{"ratings": 280, "userreviews": [{"userName": "Allison", "userReviewDate": "Jun 26, 2010", "userURL": "http://www.goodreads.com/user/show/2874779-allison", "userReview": "This totally did not make sense. Her whole premise is that there are four facets of skin -- oily/dry, sensitive/resistant, pigmented/non-pigmented, and wrinkled/tight. So I take the quiz, and I'm oily/resistant/non-pigmented/tight. That makes sense.But the section for that type of skin kept saying that it's the best kind to have because you don't have any skin problems! Which... I do, kind of a lot. And it talked about how people with this type of skin don't get acne, which is news to me, as I've been struggling with acne since I was ten. You \"might\" have a slight oiliness problem if you have this type. It also didn't seem to take into account that I might not have wrinkles because I'm 25 -- this book was clearly marketed to women for whom aging is an issue.So I check out the section on oily/sensitive/non-pigmented/tight, as that's the only place there was any wiggle room in my quiz score. And the sensitive section is all about how to deal with redness, which is not a problem I have. (She did have a bit on how to blush less easily, which I don't think of as a SKIN problem.) She only addresses acne very briefly.Also, she never addresses freckles without assuming it's a thing you hate and want to get rid of -- it's like it never occurred to her that some of us love our freckles.A totally unhelpful book."}, {"userName": "Gwen", "userReviewDate": "Nov 24, 2012", "userURL": "http://www.goodreads.com/user/show/8064057-gwen", "userReview": "I wasn't too surprised by my \"skin type\" as determined by the Myers-Briggs-esque test at the beginning of the book: borderline oily/dry, sensitive, barely non-pigmented (ability to form melanin), and \"tight\". I read the chapters OSNT and DSNT to figure out what I should be doing. OSNT: rosacea and adult acne. Hooray! I took the anti-inflammatory tips from this chapter (products with licochalone, feverfew, and aloe; stress mitigation (ha!)--avoidcocoa butter, parabens, peppermint oil, lactic acid, and coconut oil; little exfoliation) and combined them with the tips from the DSNT chapter. Should the diet route actually be effective: avoid high-glycemic foods, dairy, spicy foods (you can pry my curries from my cold dead hands, thankyouverymuch); eat eggs and fish.DSNT: dry, red, and flaky skin. Double hooray! It's a good day to be me... Avoid detergents and fragrances. Use moisturizers that have all three lipids needed: cholesterol, fatty acids, and ceramides. Avoid foaming cleansers that strip the skin of oil. But now the problem: I already do all these things. Low-carb, low-dairy diet. Oil cleansing method with castor and jojoba oils for moisture. Avoid parabens, detergents, and fragrances. Use sunscreen daily. There's nothing I can do about the stress, unless I my Christmas wish of a new job actually comes through. So now what? Baumann doesn't address what happens when the advice doesn't work...The online forums are pretty good, and there's an updated list of products online, since a lot of the recommendations in the book are out of date."}, {"userName": "Jen", "userReviewDate": "Oct 16, 2007", "userURL": "http://www.goodreads.com/user/show/41630-jen", "userReview": "This book really helped me understand what I need to be using for skincare. I like how the author gives you several choices of what you should use for your skin type (ranging from $ to $$$ depending on price), and then gives you her top choice of all she's suggested.The first couple of chapters talk about why she is qualified to tell you what to use for your skincare and what different skincare terminology is. The third offers a quiz for you to take, and the rest of the book explains the different skincare types. You don't read the whole book - just the first two chapters, then take the quiz in chapter three, and then skip to the chapter that talks about your specific skin type. I even had my daughter take the quiz. Might as well start her out using the right stuff rather than have to struggle with what to use like I did!Thanks for the recommendation, Robin! (and for gifting me the book)"}, {"userName": "Lara", "userReviewDate": "Mar 20, 2008", "userURL": "http://www.goodreads.com/user/show/235427-lara", "userReview": "I've had years of trouble with my skin. This book showed me what type of skin I have and what I should be doing to take care of it. I was doing everything wrong! A week on her program and my face is looking - and feeling - so much better. The author provides lists of products suited to each skin type (and she has 16 types here, not the usual three or four). I'd have given it four stars if more of the products listed were organic or all-natural."}, {"userName": "Adrienne", "userReviewDate": "Mar 20, 2008", "userURL": "http://www.goodreads.com/user/show/872837-adrienne", "userReview": "You should read this book just for the quizes. I like Bauman's theory that skin isn't just normal, dry, oily, sensitive or combination. Her product recommendations are very helpful and tell why certain products work or are detrimental for different skin types. A definite must read for those with sensitive skin."}, {"userName": "Alyssa", "userReviewDate": "Nov 30, 2007", "userURL": "http://www.goodreads.com/user/show/651931-alyssa", "userReview": "Follow her advice and your skin WILL improve. It looks like a big book, but it's really a quick read because you only have to take the test & read the part about your skin type. It's worked for 3 people I know, including myself."}, {"userName": "Barbara Dimas", "userReviewDate": "Feb 15, 2018", "userURL": "http://www.goodreads.com/user/show/22017651-barbara-dimas", "userReview": "Dr. Baumann classifies skin into different types by four different letters, sort of like the MBTI. (It's worth mentioning that it's possible to change skin types based on how you treat your skin.) While it is a little bit outdated, this book helped me understand what was wrong with my skin. I've had so many people around me try to tell me to use this acid peel and that retinoid, when the truth is that my skin needs to be handled really carefully because the acid mantle toward the center of my face is more or less gone from constant exfoliation and use of foaming cleansers, and it's been that way for several years. I've been using steroid creams for eczema to very little avail and salicylic acid for acne, when the acid mantle actually helps prevent both. While it's not necessarily a comprehensive read, it was very useful."}, {"userName": "Camille", "userReviewDate": "Jun 11, 2017", "userURL": "http://www.goodreads.com/user/show/67484549-camille", "userReview": "This book is very informative on the various skin types that Dr. Baumann has classified. I have Oily, Sensitive, Pigmented, and Tight skin (OSPT, by the way there are 16 classifications of skin!) and I focused on the chapters that pertained to my skin type. From reading this book, I learned about which products would be best for my skin type that I can purchase from any local drugstore. I also know which dermatological procedures would be beneficial for me and which ones would not. Grab this book from your local library to get a genuine dermatologist's understanding of your skin type and which cost-effective products and procedures you can do right now to heal your skin."}, {"userName": "V", "userReviewDate": "Jul 23, 2017", "userURL": "http://www.goodreads.com/user/show/69727347-v", "userReview": "It was educational the way she categorizes skin types. However, once you got your skin type, a large portion of the book became irrelevant. I wish the chapters were better organized; there seemed to be a lot of repetition with daily regimens, recommendations, etc. She should also disclose specific financial interests and which companies sent her free samples, as this could bias her recommendations."}, {"userName": "Emily Puccini", "userReviewDate": "Mar 01, 2018", "userURL": "http://www.goodreads.com/user/show/61747972-emily-puccini", "userReview": "Ms. Baumann provides readers with a thorough understanding of their skin type, which helps explain the problems you may be experiencing. She also provides specific product recommendations--which I have not yet tested."}, {"userName": "Linhnguyen", "userReviewDate": "Nov 26, 2017", "userURL": "http://www.goodreads.com/user/show/74241984-linhnguyen", "userReview": "its really useful!"}, {"userName": "MissAnnThrope", "userReviewDate": "Aug 23, 2011", "userURL": "http://www.goodreads.com/user/show/1526539-missannthrope", "userReview": "The premise of this book is that by figuring out your exact skin type, you will be able to properly choose your skin products and have near flawless skin. The reader does this by taking a questionnaire to determine skin type (oily vs dry, sensitive vs resistant, pigmented vs non, wrinkled vs tight). You then combine the four different categories to determine your unique skin type, and then go to your appropriate chapter to read recommendations for your type.I like Baumann's writing style because she makes the science of skincare easy to understand. The book is straight forward, and I appreciate that Baumann is not pimping her own products. She makes many recommendations from drug store brands to higher end labels to fit every budget.If you're unsure of purchasing the book, Baumann does have a website http://www.skintypesolutions.com where you can take the questionnaire online. It will even provide product recommendations. It doesn't go into as much detail as the book, but if you're short on cash and desperate to make yourself pretty, the website will do. I will update my review after I've had the chance to adopt her recommendations into my daily regime."}, {"userName": "Laurel", "userReviewDate": "Jul 06, 2013", "userURL": "http://www.goodreads.com/user/show/4311137-laurel", "userReview": "In my ongoing quest to have non-terrible skin, I think this is a pretty useful tool. You use a fairly extensive questionnaire to \"type\" your skin along 4 axes (think dermatological Myers-Briggs) and then she provides specific suggestions of routines to follow, products/ingredients to use or avoid, etc. for each skin type. Learned some useful things, it's very straightforward and non-hypey (references list is also extensive), products suggested are at a broad range of price points. I appreciated that she goes into some (accessible) depth on the physiology and chemistry of skin stuff (WHAT UP, PHOSPHOLIPID BILAYER) so you can understand WHY certain things might or might not be suitable for your skin. I also appreciated the overall tone, which is overall positive and not anxiety-provoking."}, {"userName": "Sarah Walsh", "userReviewDate": "Jul 16, 2014", "userURL": "http://www.goodreads.com/user/show/10998770-sarah-walsh", "userReview": "As I write this, I have once-in-a-lifetime, facial eczema. I cannot test the Author's advice given for under 40, dry, resistant, non-pigmented, wrinkled skin. Here's me, eczema, and identity encased in historically crime-d, Anglo/Irish, fair skin. Unaware until reading of course, it is simple but complex. Thankful, my type is heavily supplied by that oh so charming of beauty industry intent on shaming me/all women toward gracefully, disgracing Old. Further reading? BB creams thus eczema. No sooner Baumann updates, Kardashian will have trialled scraping secretions off a rare breed of donkey's arse-hole. The common-woman to trial donkey on the shelf, 10 years later by which stage, scrape my decay and age-bound atomic mare."}, {"userName": "Nicki Zevola", "userReviewDate": "Aug 13, 2011", "userURL": "http://www.goodreads.com/user/show/6031365-nicki-zevola", "userReview": "The Skin Type Solution is a revolutionary way for patients to better understand the behaviors of their skin, as well as to discern which types of products are the best for their own skin. As Myers-Briggs personality analysis is 16 types into which some 97% of the population falls into, The Skin Type Solution is more than likely providing advice, solutions, and product recommendations for about 97% of the population. It is a tremendous, ground-breaking book for the average skin care consumer, and one of my all-time favorite books."}, {"userName": "Monique", "userReviewDate": "Mar 25, 2010", "userURL": "http://www.goodreads.com/user/show/1393555-monique", "userReview": "I loved this book! It is very helpful in pinpointing what kind of skin I have and suggesting products and ingredients to use and avoid. My sister also read this book and we are completely different skin types. Thus we need to use completely different products. I have found the product suggestions very helpful and effective. It is a recommended read if you are having problem skin or just want to maximize your beauty! I did not read the whole book just the sections on my skin type but it does a great job of explaining the science behind what is going on with your skin."}, {"userName": "Becky H", "userReviewDate": "May 10, 2010", "userURL": "http://www.goodreads.com/user/show/1803135-becky-h", "userReview": "I liked a lot of the information in this book so I would've given it a 4 except for after following the regimen set out for my skin type, I'm still having issues. I also find it interesting that by a simple, subtle change of one or two of my answers in the quiz I could go from being one of the most difficult skin types to one of the easiest to maintain skin types. I do like the product she recommended for my skin type (Aveeno and Mary Kay are currently the brands I use), but I don't know how crucial it is to use exactly the type she recommends."}, {"userName": "Janet", "userReviewDate": "Mar 02, 2011", "userURL": "http://www.goodreads.com/user/show/219670-janet", "userReview": "Man, I'm on a \"books-I-didn't-finish\" kick this week! I took the self-quiz in the book and then turned to the section about my skin type. Unfortunately, the description of \"my\" type of skin was about 50% incorrect. I read the parts that applied to me (at least based on my quiz results) and didn't get a whole lot out of it. I imagine that if the results had matched me more accurately, this would've been very helpful. A friend recommended this to me so I feel bad not having loved it or gotten something good out of it (sorry, S.)."}, {"userName": "Heather", "userReviewDate": "Sep 10, 2008", "userURL": "http://www.goodreads.com/user/show/48041-heather", "userReview": "I will be making a few changes in my skin care routine and then can give a much better rating/review of the book. Overall it is well layed out and easy to find the information that is important for your individual skin type (and a quiz to figure out what your skin type is). I thought it seemed a bit Sales Pitchy for some different products that she recommends but still found the information easy to understand and incorporate into a new skin care regimen. I look forward to seeing a positive change in my own skin's appearance and health soon."}, {"userName": "Kyla", "userReviewDate": "Mar 07, 2012", "userURL": "http://www.goodreads.com/user/show/7589653-kyla", "userReview": "Thank god I read this book! I knew I had sensitive AND dry skin, but I didn't have really any clue what to do about it beyond slathering lotion on it. This book really opened my eyes to the world of skin care. It's clear to me now that I haven't been doing enough to take care of my skin and prevent premature aging. Dr Baumann also provides product recommendations based on price-affordability. It's perfect and just what I needed. Plus I got some very very good advice from this book: \"[you] dont tan well, so my advice: give it up.\" Aye aye Captain!"}, {"userName": "Marianna", "userReviewDate": "Oct 22, 2011", "userURL": "http://www.goodreads.com/user/show/2382727-marianna", "userReview": "I got some good tips. I have yet to actually try any of the products or enact a stricter routine. But I have ditched all the products that I was using that I found were bad for my skin (exfoliants and some oils). Plus I learned that steam is very bad for my skin type, which makes me sad.I also found that some of the products recommended aren't as available any more, if at all. But the website is helpful for finding current products. The chore will be wading through options and prices."}, {"userName": "Erin Robbins", "userReviewDate": "Jun 28, 2007", "userURL": "http://www.goodreads.com/user/show/104813-erin-robbins", "userReview": "This book is great. It includes a test to tell you which of the 8 skin types you have. While portions were not surprising to me, others were. I did the test for both myself and my husband. But even better the author includes a list for each skin type of product suggetions that range in price from drug store brands to expensive dermatologist purchases. I was able to create a skin treat regiment from Walmart and get better results than my expensive department store products."}, {"userName": "Colleen", "userReviewDate": "Jan 31, 2014", "userURL": "http://www.goodreads.com/user/show/21254803-colleen", "userReview": "This book is a great resource! I have super sensitive skin that reacts to everything. I learned some really important stuff no one else had ever explained to me, plus exactly which products to use - and which to avoid.[An example: Sensitive skin will often react to even high-quality products if they don't have all three of the body's natural moisturizing elements -- in the same proportions in which they're found in the skin]"}, {"userName": "Jennifer", "userReviewDate": "Jun 20, 2010", "userURL": "http://www.goodreads.com/user/show/815855-jennifer", "userReview": "While promising in principle, I didn't really find the recommendations for my skin type ones that I'd like to follow on a daily basis. Between the environmental impacts and potential personal health risks of the products that Dr. Baumann recommends, I'd hesitate to use many of the products recommended here. Check out EWG's \"Skin Deep\" database when deciding among the options. http://www.cosmeticsdatabase.com/"}, {"userName": "Tien Pham", "userReviewDate": "Mar 01, 2014", "userURL": "http://www.goodreads.com/user/show/26858518-tien-pham", "userReview": "I enjoy reading this book. For once, I actually relate to a skin type description. I am a OSPW, a pretty difficult skin type. Now that I know my skin is sensitive, proned to pigmentation and wrinkles, I know better what products to get. Before that, I mostly rely on general reviews from makeupalley, and have been confused and frustrated that a product that supposedly does wonders for many other does not work for me. If anything, this book taught me to understand the right skin ingredients."}, {"userName": "Jennifer", "userReviewDate": "Mar 24, 2010", "userURL": "http://www.goodreads.com/user/show/2843929-jennifer", "userReview": "Great helpful tool and guide to what products you should use for your skin... there are so many out there and just because you like a face wash from one place doesn't mean the moisturizer will be the same or do you use lightening gel or eye cream??? Will have to read it a few times and make a copy of my skin type regimen, but a pretty good read for those who want to start being proactive about their skin."}, {"userName": "Nicki", "userReviewDate": "Jun 04, 2008", "userURL": "http://www.goodreads.com/user/show/1056975-nicki", "userReview": "This book is really neat because it allows you to take a test to determine what kind of skin you have, then you can go to the chapter about your skin type and learn more about it. The author tells you exactly what products are right for your skin and are in your price range. I haven't used the products long enough to rate by results, but the info was good."}, {"userName": "Michele", "userReviewDate": "Mar 14, 2010", "userURL": "http://www.goodreads.com/user/show/120975-michele", "userReview": "Dr Baumann has figured out 16 skin types, based on oily/dry, sensitive/not, pigmented/not, wrinkled/tight. The book has a questionnaire to help you figure out your skin type, then personalized recommendations (at all price points) for your skin and its particular ailments. This book really helped clarify why my skin is sometimes so annoying!"}, {"userName": "Heather", "userReviewDate": "May 16, 2009", "userURL": "http://www.goodreads.com/user/show/1225179-heather", "userReview": "Loved the information in this book. If you've ever wondered what type of skin you have or spent a ton of time in the cleanser/moisturizer aisle this book is for you. It even gives you specific products to try for your skin in a variety of price points. I hope the products work for me since I will be replacing them once my current skin care products run out."}, {"userName": "Kaila", "userReviewDate": "Mar 19, 2008", "userURL": "http://www.goodreads.com/user/show/984187-kaila", "userReview": "This book is great because you take a quiz and then it tells you what your skin type is. You then go to that chapter and read how to take care of your skin. She lists products that she likes that range in price. It is great if you have problems with your skin but it is also good for people who don't have problems because she talks about wrinkling and age spots. (which none of us want!)"}], "description": "REVISED AND UPDATED FORGET EVERYTHING YOU THOUGHT YOU KNEW ABOUT WHAT'S GOOD FOR YOUR SKIN--AND LEARN THE TRUTH.Take the simple questionnaire inside this book and within minutes discover which of the sixteen unique skin types describes your skin, which ingredients to avoid, the skin care brands that are right for you, and your new time- and money-saving regimen. In this revised edition of her classic bestseller, world-renowned Miami Beach dermatologist and researcher Dr. Leslie Baumann helps you shop for the optimal skin care products. She provides detailed lists of recommended products suited to every skin type and budget. Inside you'll find- your personal skin type profile detailing exactly what will work--and what won't--for your unique complexion - the newest products for healthy, radiant skin--cleansers, moisturizers, toners, sun blocks, foundations, and more - tips on preventing skin aging and \"problem\" skin - vital information on the new world of prescription products, facials, chemical peels, Retin-A, Botox, and Restylane injectionsNow you can look like a million bucks without spending a fortune. This book is almost as good as having Dr. Baumann give you a personal consultation!", "title": "The Skin Type Solution: Are You Certain Tthat You Are Using the Optimal Skin Care Products? Revised and Updated", "url": "https://www.goodreads.com/book/show/354583.The_Skin_Type_Solution", "average": 3.83, "cover": "https://images.gr-assets.com/books/1388368040l/354583.jpg", "reviews": 51, "authors": [{"url": "https://www.goodreads.com/author/show/203278.Leslie_Baumann", "name": "Leslie Baumann"}], "type": [], "outlinks": ["http://www.goodreads.com/book/show/354583.The_Skin_Type_Solution", "http://www.goodreads.com/book/show/743970.The_Skin_Type_Solution", "http://www.goodreads.com/book/show/1106632.The_Skin_Type_Solution", "http://www.goodreads.com/book/show/12418026-the-skin-type-solution", "http://www.goodreads.com/book/show/3488389-cosmetic-dermatology", "http://www.goodreads.com/book/show/18761958-cosmeceuticals-and-cosmetic-ingredients", "http://www.goodreads.com/book/show/36011125-learn-a-trick-for-sharpening-nail-pliers-using-aluminum-foil", "http://www.goodreads.com/book/show/35924919-5-easy-and-inexpensive-ways-to-clean-silver-pieces", "http://www.goodreads.com/book/show/35992416-12-romantic-hotels-perfect-for-weekend-getaways"]}