{"ratings": 72, "userreviews": [{"userName": "Alex (not a dude) Baugh", "userReviewDate": "May 14, 2018", "userURL": "http://www.goodreads.com/user/show/4449236-alex-not-a-dude-baugh", "userReview": "Nek Chand loved living in his village of Berian Kalan in the Punjab region of India before the Partition of 1947. He especially loved listening to the ancient stories that were always being told there by the whole community. As a child, Nek began to build a world of his own based on the stories he heard along the river back, using rocks, sticks, and other materials found in nature. But, in 1947, when Punjab was split into two countries, India and Pakistan, Nek and his family were forced to leave their home - they were Hindu and their village was now in Muslim Pakistan. Fleeing at night, they walked for 24 days to the new Indian border.The family traveled to the newly created city of Chandigarh, where Nek found work as a government road inspector, but he never felt at home in this new modern city. When he discovered a few acres of scrubland in northern Chandigarh, he began clearing it away and bringing all kinds of materials he might need to create a new world of his own in miniature again. After seven years of secretly collecting, Nek was ready to begin building.Nek managed to keep is kingdom a secret for 15 years, until one day, the government began clearing the area and found his secret. They wanted it all destroyed, including the small building Nek had illegally been living in, but then the people of Chandigarh heard about what he had built and began to visit by the thousands. Nek's kingdom made everyone happy, and soon stories were once again being told. Luckily, they managed to convince the government not to destroy Nek's creation, and instead provided protection for this incredible piece of folk art. This is a beautifully written, fascinating story of how one man's love of his childhood home drove him to turn his nostalgia into a kingdom made up of recycled materials and the stories he had heard as a child. The lyrical text compliments the folk art style watercolor and gouache illustrations, each capturing those aspects of India that Nek loved and the disruption due to the Partition. Nek's story is topped off with a four page pull-out spread of photographs of just some of the parts of the real secret kingdom. Included in the back matter is an Author's Note describing more about Nek, his childhood dream, and what has become of his kingdom, as well as an extensive bibliography. This is an enchanting biography of a true folk artist."}, {"userName": "Arleigh", "userReviewDate": "Jan 11, 2018", "userURL": "http://www.goodreads.com/user/show/1866210-arleigh", "userReview": "This story follows a boy named Nek Chand as he grows up in the village of Barian Kalan in the Punjab region of what is now Pakistan. He had an ideal childhood, learning his people’s history and legends through the work and festivities of every season. When the Hindu people were expelled from the land, they traveled to India, where a disenchanted Nek hated the drab industrial landscape. Feeling nostalgic for his childhood dreams, he began building his own secret kingdom in the jungle outskirts. Years pass, and when his project is discovered, both the government and the people weigh in on the fate of Nek’s private retreat.The Rock Garden of Chandigarh, built entirely of recycled materials, took years of collecting castoff items and painstaking work. The book includes real photos of the grounds and a detailed author’s note with a biography of its subject. The illustrations appear to be texture-rich watercolors that complement Chand’s style nicely. This is an excellent resource for educators, specifically art teachers wishing to expand their book collection to include lesser known world artists."}, {"userName": "Stephanie Tournas", "userReviewDate": "Mar 19, 2018", "userURL": "http://www.goodreads.com/user/show/13364865-stephanie-tournas", "userReview": "This lovely picture book biography brings to light a little known (in the U.S., at least) artist from India, Nek Chand. I loved reading about this creative, resourceful and thoughtful \"outside\" artist. As an imaginative child growing up in a small village, he was mesmerized by folk tales. After Partition, he struggled to make a living as a government road inspector in the new Indian city of Chandigarh. Missing his home village, he began collecting \"broken pieces of village life\" - chipped sinks, broken glass, cracked pots, half-dead plants, twisted bikes, and anything else he could find. He created a \"kingdom\" of the people, animals and folktale characters he remembered from his childhood, on a unused, wild piece of land outside Chandigarh. When government inspectors found what he had been doing, they threatened to destroy Chand's magical world. But then, the people of Chandigarh came to see his work and they were amazed. They protested its destruction. The people supported him and donated money, tools and materials so that he could continue building for many years. The story ends with a 4-page spread of photographs of the Rock Garden. Claire Nivola's signature watercolor art is folksy yet delicate. I loved examining the pages for the details of village life, especially her inclusion of many local animals on each page. Includes an extensive bibliography. I love that this artist created purely for the love of his country and his culture, and never sought fame or fortune. It's wonderful for children to learn that art can have value even if exists outside the established art world. There are lots of other great biographies of outsider artists for this target age group of 5-9, such as Aston's Dream Something Big, about the Watts towers; Shapiro's Magic Trash, about Tyree Guyton; and Slaymaker's Bottle Houses, about Grandma Prisbrey. A great choice for elementary school art units."}, {"userName": "Arminzerella", "userReviewDate": "Apr 10, 2018", "userURL": "http://www.goodreads.com/user/show/1769011-arminzerella", "userReview": "Nek Chand grew up in the Punjab and absorbed the stories and culture of his village and people. He became a farmer, but had to leave his home when the area was split into two countries – India and Pakistan. His farm was now in Pakistan and his people/religion – Hindu – were no longer welcome there. He moved to India’s first planned city, Changidarh, which was all cement and concrete and was nothing like the lovely, colorful village he had known. In his spare time over the years, Nek cleared land outside of the city and collected junk that other people had thrown away, which he eventually transformed into an amazing Rock Garden with winding paths, mosaics, and wonderful sculptures based on his memories of his village and stories he’d heard in his childhood. He kept this secret for almost 15 years and upon its discovery, city officials wanted to destroy it. But people from Changidarh came and saw what he’d made and loved it and they felt it should be preserved and protected. Nek was allowed to continue his work and eventually the Garden expanded to fill 25-acres! Nek passed away in 2015, but his Garden lives on and is supported by the Nek Chand Foundation. This lovely picture book biography of Nek Chand brings awareness of his special folk art to a new generation as well as those who have never heard of him or his Rock Garden. Includes one page of fold out photographs of the actual site/art that Chand created, an afterward that talks about the history of the Garden and the troubles it faces, and an extensive bibliography."}, {"userName": "Sunday Cummins", "userReviewDate": "Feb 10, 2018", "userURL": "http://www.goodreads.com/user/show/2457533-sunday-cummins", "userReview": "The kind of book you'll want to use with students--of all ages. Read this aloud to students, letting them savor the author Rosenstock's language--\"Nek played and planted, laughed and listened, as the ancient stories circled with seasons, beginning to end and back again.\" Share with small groups and ask them to contemplate questions like, \"What is the role of art (or storytelling) in society?\" or \"How did Nek reveal his determination?\" Use as a mentor text for writers. Read and then reread, slowing down carefully to look at the water color illustrations asking, \"What do you notice?\" and \"How does the illustrator Nivola convey X?\" or \"What is the role of the gatefold (photograph that folds out) in the book?\"Don't skip the author's note. Read this aloud to students or ask students to read. You can use this as a \"second\" source and ask students to think about how the content adds to their learning. Encourage them to ask lots of questions and do more research including reading about other artists and their endeavors.I have so much more to say about this book. It's powerful and has a lot of classroom potential. Barb Rosenstock is a \"go to\" author for me. As soon I got the book, I knew it would be well written. Nivola has also illustrated several other informational books--her illustrations always expand and deepen my understanding of the topic."}, {"userName": "Kathy", "userReviewDate": "Feb 23, 2018", "userURL": "http://www.goodreads.com/user/show/300931-kathy", "userReview": "Some people are driven to make art, with no expectations for sale or fame. I had heard of the Watts Towers in LA (https://www.wattstowers.org/about-us) and the bottle houses of Grandma Prisbrey (https://speakzeasy.wordpress.com/2015...) , but not Nek Chand of India who created a similar whimsical world out of found items. This book tells his story and inspirations, with lovely watercolor and gouache illustrations. One quadruple-page spread shows photographs of the world he created, followed by a fuller explanation of what happened after its discovery by officials."}, {"userName": "RLL220_Amanda Alvarado", "userReviewDate": "May 13, 2018", "userURL": "http://www.goodreads.com/user/show/80307024-rll220-amanda-alvarado", "userReview": "The Secret Kingdom is about Nek Chand Saini who lived in a tiny village of Berian Kalan. Nek spent his childhood listing to ancient stories that he loved. His village was perfect until The Punjab split into two countries Pakistan and India. Nek found acres of jungle and started building his own secret kingdom. The illustrations are painted with rich watercolors. Most of the background is white so it allows the illustrations to stand out. This book would be appropriate for ages 7 to 13. Teachers will be able to make projects from this book where their students would learn about history and Nek Chand life."}, {"userName": "Joan Marie", "userReviewDate": "Apr 28, 2018", "userURL": "http://www.goodreads.com/user/show/23154392-joan-marie", "userReview": "I love the way this nonfiction is written. It's really a lyrical, narrative biography about a self-taught artist, Nek Chand who brought beauty to an otherwise colorless, barren world for those displaced from their homes. Illustrations add to the delight.Here's an example of the lyrical text:\"In the village, Nek played and planted, laughed and listened, as the ancient stories circled with the seasons, beginning to end and back again.\""}, {"userName": "Tami", "userReviewDate": "May 04, 2018", "userURL": "http://www.goodreads.com/user/show/1664548-tami", "userReview": "True story - Even in war and displacement one can build, create and love the beauty of not only what grows but to create from discards, art. Art can be a remembrance of the things we love. I love the dedication of Nek Chand and what he has created in a part of the world where war is still going on - 71 years and then some. It's a children story but there are several subtle messages that I love."}, {"userName": "Pam", "userReviewDate": "Feb 22, 2018", "userURL": "http://www.goodreads.com/user/show/6199749-pam", "userReview": "Biography of Nek Chand Saini and the Secret Kingdom he created. Tells his story from childhood through fleeing to India and then the years creating this artwork.Beautiful illustrations support the text.Biographic info at the end following the story. Fold out pages with actual photos of his artwork."}, {"userName": "Mary Lee", "userReviewDate": "Feb 11, 2018", "userURL": "http://www.goodreads.com/user/show/221992-mary-lee", "userReview": "Pair this book with OUTSIDE IN by Jennifer Bradbury. Nek Chand is the historical character who saves the life of the fictional homeless boy in OUTSIDE IN.Also perfect to show how the experiences of someone's childhood can turn into their lifelong passions."}, {"userName": "Aliza Werner", "userReviewDate": "Mar 10, 2018", "userURL": "http://www.goodreads.com/user/show/11936822-aliza-werner", "userReview": "An artist creating out of nature, recyclables, and trash. Pair with IN MARY'S GARDEN by Tina and Carson Kugler."}, {"userName": "Kermit", "userReviewDate": "Mar 18, 2018", "userURL": "http://www.goodreads.com/user/show/1355202-kermit", "userReview": "4.3 starsSo interesting! I had to do some additional research on this amazing man and the \"secret kingdom\" that he created in India."}, {"userName": "Bill", "userReviewDate": "Jan 31, 2018", "userURL": "http://www.goodreads.com/user/show/703807-bill", "userReview": "Fascinating man and story. But not particularly well-written. Illustrations more noteworthy."}, {"userName": "Jodi", "userReviewDate": "Jun 08, 2018", "userURL": "http://www.goodreads.com/user/show/5126174-jodi", "userReview": "Fascinating story & artwork!"}, {"userName": "Desiree Sotomayor", "userReviewDate": "Mar 12, 2018", "userURL": "http://www.goodreads.com/user/show/1251971-desiree-sotomayor", "userReview": "Probably one of the best NFs I've looked at so far."}, {"userName": "Jazz", "userReviewDate": "May 01, 2018", "userURL": "http://www.goodreads.com/user/show/2418801-jazz", "userReview": "Beautiful book about storytelling, art, and disobedience in the face of injustice."}, {"userName": "Julie", "userReviewDate": "Mar 11, 2018", "userURL": "http://www.goodreads.com/user/show/6354029-julie", "userReview": "Fascinating story about a man who built an outdoor art center in India."}, {"userName": "Katie Logonauts", "userReviewDate": "Feb 01, 2018", "userURL": "http://www.goodreads.com/user/show/38546464-katie-logonauts", "userReview": "This is a fascinating picture book biography of Indian folk artist Nek Chand. A great invitation to create!"}, {"userName": "Jacqui", "userReviewDate": "Feb 21, 2018", "userURL": "http://www.goodreads.com/user/show/6591217-jacqui", "userReview": "3.5"}], "description": "The incredible story of the world's largest visionary environment: the Rock Garden of Chandigarh, kept secret by outsider artist Nek Chand for fifteen years.After the partition of India in 1947, Nek Chand Saini settled in the city of Chandigarh, with nothing but stories brought from his homeland. Dismayed at his stark new surroundings, Nek began collecting river rocks, broken glass, and cracked water pots found on the roadside. He cleared a section of jungle and for seven years he stockpiled odds and ends. They were castoffs and rubbish to everyone else, but to Nek, they were treasures. He began to build a labyrinth of curving paths, mosaics, and repeating patterns: his very own tribute to the winding village of his youth, a hidden land of stories. Nek kept his kingdom secret for fifteen years, until a government crew stumbled upon it and sought to destroy it. But local fans agreed in awe: the Rock Garden had to be protected. Author Barb Rosenstock introduces readers to the outsider artist's stunning creation, while Claire A. Nivola's illustrations bring to life the land's natural beauty and the surreal world Nek coaxed from his wild landscape.", "title": "The Secret Kingdom: Nek Chand, a Changing India, and a Hidden World of Art", "url": "http://www.goodreads.com/book/show/35210305-the-secret-kingdom", "average": 4.31, "cover": "https://images.gr-assets.com/books/1509653095l/35210305.jpg", "reviews": 21, "authors": [{"url": "https://www.goodreads.com/author/show/3396787.Barb_Rosenstock", "name": "Barb Rosenstock"}], "type": ["Childrens", "Biography", "Art", "Nonfiction", "Cultural"], "outlinks": ["http://www.goodreads.com/book/show/35210305-the-secret-kingdom", "http://www.goodreads.com/book/show/16718342-the-noisy-paint-box", "http://www.goodreads.com/book/show/11737316-the-camping-trip-that-changed-america", "http://www.goodreads.com/book/show/17555089-thomas-jefferson-builds-a-library", "http://www.goodreads.com/book/show/21870135-ben-franklin-s-big-splash", "http://www.goodreads.com/book/show/25898322-dorothea-s-eyes"]}