{"ratings": 3795, "userreviews": [{"userName": "Melissa T", "userReviewDate": "Mar 19, 2012", "userURL": "http://www.goodreads.com/user/show/1100748-melissa-t", "userReview": "Recently, I have been curious about Marilyn Monroe. Other than a vague understanding that she was a national sex symbol and actress, I didn't really know anything about her. I chose what seemed to be the most reputable biography I could find (one of the few NOT touting never-before-seen-images!), and I was not disappointed. The author writes well. He simply presents the facts, and allows the reader to sift through them and form their own opinion. He often shares his own conclusions, but it is done so unassumingly, he almost encourages the reader to disagree, assuming they have credible reasons to do so. And Marilyn. Such heartache. Such courage. So fragile and yet so strong too. She had qualities I admired, her will to overcome and determination to succeed were impressive. And then my emotional pendulum would swing back the other way and her choices or lack of judgment made me want to rescue her from herself. The shallow image I loosely held was shattered. I didn't agree with everything she did, but I now understood why she did it. She was beautiful and smart and talented and generous and hopelessly, inevitably, flawed. Overall, I felt like I understood her, I knew her almost. This book reminded me that people, like life, are merely composites of good and bad; and hopefully, the good qualities outweigh the bad.I think they did for Marilyn."}, {"userName": "Devon", "userReviewDate": "Jun 09, 2011", "userURL": "http://www.goodreads.com/user/show/5599460-devon", "userReview": "I recently finished an epic 500-page biography of the lovely Norma Jean entitled \"The Secret Life of Marilyn Monroe\" by J. Randy Taraborrelli.Let me preface this review by saying that I have never seen a Marilyn Monroe movie, nor read any books on her. I came into this with just an image of my head that was a compilation of her most famous photos and the preconceived thought that she and JFK had some good times.I found this book to be completely engrossing...the tale is almost too good to be true in the sense that it reads like a work of fiction. It is hard to believe that Marilyn lived with so many demons, but her path to fame is nonetheless extraordinary.Taraborrelli is a wonderful biographic writer. It was never dry or boring and filled the pages with such life and detail that a film documentary could probably stand toe-to-toe with its pages.If you are a new to biographical works, this is a great first-read. Not that it's a \"training-wheels\" type of book in any sense, it is very dense and very long, but her life's story is so mesmerizing that you sometimes forget it was real.I now look forward to watching some of Marilyn's work. Her trials, tribulations and many heartbreaks and mental breakdowns were hard to read at times, but in the end it seemed to only add to her goddess-like quality that makes her seem just a little bit unreal.Highly recommended!"}, {"userName": "Michael", "userReviewDate": "May 16, 2011", "userURL": "http://www.goodreads.com/user/show/5143619-michael", "userReview": "I must confess for many years i was not a Marilyn fan. I thought like many that she was a bimbo who didnt deserve the fame an adulation she got through her adult years. In recent years though my thoughts have changed something that this book reinforces. The secret life of Marilyn Monroe goes into great detail with Marilyn's life from her child years as Norma Jean moved from home to home that created a feeling of abandonment and not knowing her father, to her adult years as a model and movie star and the famous men in her life including Frank Sinatra, Joe DiMaggio, Arthur Miller and the Kennedys Bobby and Jack.The book takes in two distict periods in her life the one growing up and the one of her as Marilyn the famous troubled star. Growing up as Norma Jean Mortenson Marilyn's life was chaotic given up by her mother Gladys Baker and then moved from home to home and to an orphanage. This sought of life caused her to feel unloved particularly from men as she felt she never had a steady male infulence in her life. This was not helped by the failed relationships in her life as she was seen as a lovely person who was to difficult to handle. This book also reiterated in my mind that her childhood and because her mother ended up in a sanitarium mentally ill combined to see Marilyn herself decend into illness and then death.Randy Taraborrelli has done a great job of describing Marliyn's life. Taroborrelli presents a very honest account of Marilyn and pulls no punches showing her as a person who although on the outside as a beautiful enchanting superstar was infact a sad and insecure person who never found a sense of home or love. Not just for fans but also for people who are interested in wanting to know more about one of the greatest icons in history Taroborrelli's book is a great place to start."}, {"userName": "Peace Love and Reviews", "userReviewDate": "May 19, 2011", "userURL": "http://www.goodreads.com/user/show/1963075-peace-love-and-reviews", "userReview": "I don't know what possess me to read Marilyn Monroe's biography. I do not even idolize her or pay attention to her that much. But one day, I decided, I am going to read up on her. It was one heck of a story the first two chapters, I was depressed, so I have to put it down. Yet I itch to find out how life was for her. From the innocent Norma Jean whose most relatives and guardians are irresponsible and selfish. Seriously her family history and background set her to doom. I think I would have set to the same path of mental illness if my life was like hers, whether or not my family has mental illness. I extremely dislike Grace, while it clearly showed that she did love her best friend daughter, she was not really the fit guardian. I mourn that Norma Jean was forced to leave Ida's care. I was shocked that Grace married of Norma Jean at 16, so she could be done with responsibilities of her. Her life story was tragic, from beginning till the end. All those glitter, all that beauty, the fame. It was all a fascade to what she is actually feeling inside. Now I understand, why people love her, until now even if she's been long gone."}, {"userName": "Marisa Grey", "userReviewDate": "Jun 04, 2012", "userURL": "http://www.goodreads.com/user/show/9983850-marisa-grey", "userReview": "I started reading this in January when I didn't know anything about her. I figured she was an over blown celebrity and didn't have an opinion of her. After reading this book my opinion changed of her.The writer did a wonderful job at portraying Marilyn's life. She was very intelligent and not only an amazing actress. This is a great book to read if you're curious about Marilyn. The writer uses evidence and allows you to question the statements he makes, and this book is not only an eye-opener of the \"secret life\" of Marilyn, but something I highly suggest. I agree with the person who commented on the back of this book, every other book about her life from now on will be measured on this one."}, {"userName": "Nina", "userReviewDate": "Dec 14, 2011", "userURL": "http://www.goodreads.com/user/show/4914725-nina", "userReview": "I have never been a fan of Marilyn Monroe. Not that I disliked her, I just didn't give her much thought. Then I saw a picture of her reading Ulysses. Anyone who reads Ulysses has my respect. Then I heard that she had more than 400 books in her personal library, including Middlemarch, Crime and Punishment, books by Nietzsche and books on Judaism, and I knew I had to know more about this woman who was apparently more than a stupid, blonde beauty icon.Boy, what a life she had and what a complex woman. I think I have to make lists to be able to tell you what I thought of this book.The first list:Things that I admire about Marilyn Monroe/Norma Jeane:1. She was a good, kind woman and a true friend. You get the sense that Marilyn was through and through a good person, always there for her friends, kind to her colleagues (when her problems didn't annoy the hell out of them) and she fought hard to help her mother which couldn't have been easy for her.2. Her ability to start from rock bottom - or below that - and make something of herself through sheer determination and hard work3. Her wit. She was an intelligent and fast-thinking woman with quotes that have gone down in history (who doesn't know her Chanel no. 5 comment, and when 20th Century Fox heard that there were nude pictures of her in circulation an angry boss asked Marilyn, \"Is that you on those pictures?!\" and Marilyn replied, \"Yes, but I don't think they got me from my best angle.\")4. Her ability to turn bad publicity into good publicity.5. Her indifference to money. Marilyn wasn't in the business for the money, but because she loved her art and ... well, she liked the limelight. Reasons why I am thankful I am not Marilyn1. Mental instability ran in the family. Her grandfather went crazy and died young, her grandmother went crazy too and her mother was diagnosed paranoid scizophrenic and spent most of her life in mental hospitals and institutions. When in her 20s, Marilyn started to hear voices. Imagine how scary that must have been. Marilyn knew that something was wrong with her, and ended up seeing doctors and psychiatrists almost daily. She also suffered from severe depressions for most of her life and tried to kill herself a couple of times.2. Her pill addiction. Pills to fall asleep, pills to get up, pills to stay awake, pills to get through the day, pills to keep the voices out of her head, pills to keep her borderline paranoid scizophrenia in bay, etc. Add alcohol to this and you have a dangerous coctail.3. Her taste in men. First husband Jim was possessive and wanted Marilyn to give up her career. She had married him at 16 to avoid going back to the orphanage. Second husband Joe was possessive and jealous and didn't like her career (do you see the pattern?). After the famous hot air-scene in the Seven Year Itch - you know, Marilyn in a white dress trying to keep the dress from flying up over her head - Jim beat her. Third husband Arthur Miller was intelligent, but didn't understand Marilyn's problems and dependence on him and the marriage was as good as over after 3 weeks. 4. Her childhood. She never knew her father, her mother was paranoid scizophrenic and Norma Jeane spent the first 7 years of her life with Wayne and Ida Bolender. Then she lived with her mother and a woman called Grace. Then another family. Then the orphanage. Then another family. And another family. Then she was back with Grace. Then an aunt Ana. Then Grace. Then she married Joe. Marilyn spent most of her life looking for a family, searching for stability, love, security. It is scary how many men she called \"Dad\" - lovers, husbands, father-in-laws, bosses... Pat Kennedy Lawford believed that Marilyn became obsessed with the Kennedy family because they were so loving and close-knit and they had each other's backs - they were everything that Marilyn wanted and had never had.5. Her cribbling insecurity and self-doubts, made worse by her mental problems and pill addiction.6. She was followed by the FBI. Imagine you are borderline paranoid scizophrenic and thinks that someone is always following you, and then, someone actually IS following you and knows your every move. Things that annoyed me about this book1. For some reason the author has to constantly remind us of how beautiful Marilyn is. \"In Gentlemen Prefer Blondes she was stunningly beautiful\", \"when she walked into a room everyone stopped and stared at her, she was so beautiful\" etc. I mean, it's Marilyn Monroe we are talking about. I know she is beautiful and don't need to be reminded of it every five pages.2. People interviewed for this book can always remember just what Marilyn was wearing at certain events. \"We had lunch at a restaurant. Marilyn was wearing a white blouse and a black skirt with flat, white shoes\". How is it that everyone can always remember what Marilyn was wearing on any random day?3. The author insisted that Marilyn always gave splendid performances and was always the show-stealer. Surely she must have given just one luke warm performance in her life?4. When a disputed point is debated it is clear what the author's personal opinion is and he wants us to agree with him which I didn't like. He should have been more neutral.5. At some point Taraborrelli says that no one knows how Marilyn and Frank Sinatra first got introduced, how they got to know each other. A few pages later he says that Frank Sinatra and Marilyn's husband Joe were good friends. So here's a crazy thought: They met through Joe?But overall a very interesting book and I certainly learned a lot about Marilyn and all the odds she had against her. It is amazing that she went on to become one of the biggest movie legends of all time because life certainly wasn't kind to her. It was always one step forward, two steps back for her. But in spite of her chaotic and frightening life she had the ability to make people care for her and take an interest in her welfare which she was very much in need of. Today, 50 years after her death, I can't help both loving her and feeling very, very sorry for her.____P.S. I watched \"My Week With Marilyn\" yesterday. Michelle Williams was an excellent Marilyn I think, and Branagh a ditto Olivier. I really enjoyed the movie, though there wasn't much in the way of a plot"}, {"userName": "Lu (Sugar & Snark)", "userReviewDate": "Jan 25, 2013", "userURL": "http://www.goodreads.com/user/show/2049296-lu-sugar-snark", "userReview": "This is one of the best biographies I have ever read (not that I have ready many), but I have no complaints. The author takes you on a journey through Marilyn’s life from beginning to after her death. He focuses on everything I wanted to know about: her mother, childhood, men in her life and the movies. I felt that I got a complete picture of Marilyn’s life and I found it absolutely fascinating!\nSourceI now fully understand the fascination with Marilyn Monroe! She went through so much heartache and setbacks in her life, and yet she is was one of the biggest movies stars of all time. The men in her life treated her like property, they tried to control her, and some even attributed to her paranoia. And yet she kept on trying, she kept on looking for love and I wish with my whole heart that she would have found it in time.At the back of this book there are images of Marilyn and the people in her life – I found these very interesting and I loved seeing everyone that was talked about in the book.I also found the writing thoughtful and the author presented the facts to me, so I could form my own opinion. The author also tried to be fair to everyone that affected Marilyn’s life and I came out feeling that this was a job well done!I couldn’t help but completely falling under Marilyn’s spell while reading this novel – I even watched a few old movies and started Tumblr’ing. So count me among one of Marilyn Monroe’s fans and I will definitely be reading more about her. And even more biographies, I can only hope that they are as great as this one was!"}, {"userName": "Julie", "userReviewDate": "May 28, 2015", "userURL": "http://www.goodreads.com/user/show/1258897-julie", "userReview": "\"This is a story of a girl named Norma Jean Mortenson. She thrived despite seemingly insurmountable obstacles and almost impossible odds. She created and became a woman more fascinating that she ever believed possible. And in the face of her own failing mind, she battled to keep the creation alive-- not for her, but for us.\"Although this is such a tragic story, it is very well-written and gives a detailed account of Marilyn Monroe's entire life-- not just her movie star days. Reading this really made me feel more empathy for Marilyn. As I read this, it occurred to me how quickly (and easily) we are to judge others' misfortunes and choices. This book has reminded me not to judge a book by its cover (both figuratively and literally). We never truly know what others have been through unless we have walked in their shoes."}, {"userName": "Anastasia Alén", "userReviewDate": "Jul 08, 2017", "userURL": "http://www.goodreads.com/user/show/21610643-anastasia-al-n", "userReview": "I knew Marilyn Monroe had a tragic life, however I never realized the extent of it before reading Taraborrelli's book. This book made me appreciate her career so much more."}, {"userName": "Val Penny", "userReviewDate": "Apr 13, 2015", "userURL": "http://www.goodreads.com/user/show/28379554-val-penny", "userReview": "Many biographies have been written about Marilyn Monroe. She was born under the name of Norma Jeane Mortenson in the charity ward of the Los Angeles County Hospital, Los Angeles, California, USA on June 1, 1926. She was a Golden Globe Award­ winning American actress, singer, model and pop icon. She became known for her comedic skills and screen presence, going on to become one of the most popular movie stars of the 1950s. Later in her career, she worked towards serious roles with a measure of success. However, long­standing problems were exacerbated by disappointments in both her career and personal life during her later years. Her death on August 5, 1962 has been subject to speculation and conspiracy theories.I found this biography by J. Randy Taraborrelli in my local library and I decided to read it to try to separate the fact from the fiction. He is an American journalist and biographer. Taraborrelli was born February 29, 1956 in Califonia, USA and is an author known for his biographies of contemporary entertainers and political figures. In The Secret Life of Marilyn Monroe the author draws complex and sympathetic portraits of the women so influential in the actress’ life, including her mother, foster mother, and legal guardian. He also reveals, for the first time, the shocking scope of Marilyn’s own mental illness, the identity of Marilyn’s father and the half-brother she never knew. He has also uncovered new information about her relationships Robert Kennedy, John F Kennedy, and Pat Kennedy Lawford. When Marilyn Monroe became famous in the 1950s, the world was told that her mother was either dead or simply not a part of her life. However, that was not true. In fact, her mentally ill mother was very much present in Marilyn’s world and the complex family dynamic that unfolded behind the scenes is a story that has never previously been told. In this groundbreaking book Taraborrelli draws complex and sympathetic portraits of the women so influential in the actress’ life, including her mother, her foster mother and her legal guardian.Marilyn was beautiful but damaged. She was the ultimate sex symbol, publicly celebrated, privately unhappy; that is why Marilyn Monroe’s tumultuous life and untimely death continue to fascinate us. The Secret Life of Marilyn Monroe by J. Randy Taraborrelli is explosive, revelatory and surprisingly moving. It is the final word on the life of one of the most fascinating and elusive icons of the twentieth century."}, {"userName": "Louise", "userReviewDate": "Mar 09, 2013", "userURL": "http://www.goodreads.com/user/show/9281934-louise", "userReview": "I left the Marilyn Monroe story more than 30 years ago having read Norman Mailer's \"Marilyn\" and Fred Guilles' \"Norma Jean: The Life of Marilyn Monroe\". The character of Marilyn was not of interest to Mailer and the gossip was. My vague memory of Guilles is that he made a lot of her as a fatherless child. Both by-passed an exploration of her relationship with her mother who was alive at the time of their publications. I don't know much of the considerable research since that time, but it appears that this is a new and long delayed analysis.Taraborelli demonstrates how Marilyn's relationship with her mother and her family heredity are the determining factors in her life and career. This background holds Marilyn Monroe's stunning story together as nothing else does. Without it, her life, the rumors, the innuendo, etc. are just plain mystifying. Besides the historical record, the story has importance for, and may provide comfort to, the many families who suffer from having a loved one with a mental illness.The book prompts my interest in \"Marilyn: Norma Jeane\" with the text by Gloria Steinem, Photographs by George Barris, which I will read. I presume Steinem takes a different tack. The friendship of Gladys and Grace is astounding. Perhaps this set the stage for Marilyn's later reliance on female friends, her half-sister, and a host of female professionals. I did not know of her stands against the studios, nor of her formation of her own production company.I appreciated the sensitivity that Taraborelli gives to the many people in her orbit. He explains their role and does not judge a one of them.Many books of this scale are team efforts, but this is the first one that I have seen where the author seems to be genuinely sharing the credit."}, {"userName": "Mary", "userReviewDate": "Jan 14, 2010", "userURL": "http://www.goodreads.com/user/show/1644595-mary", "userReview": "I thoroughly enjoyed it! JRT tells a story very well, the characters quite vivid in my mind as Marilyn's life unfolded in the pages.I can be such a nit-picker when it comes to details of Marilyn's life. Primary, the name on her birth certificate is Mortenson, with a O. Throughout the book it's spelled Mortensen with an E, the spelling of Gladys's second husband, but not her daughter. It's always important to get a person's name spelled right. The whole mix up of the chapter of \"Jasper Dies\" is another big mistake. Not very thorough research, and I am surprised no one else caught these obvious whoppers before it hit the presses.I loved this book most for the research and telling of Marilyn's relationships, especially the women in her life; Gladys, Ida, Grace, Ana, Natasha, Berniece, and Pat Kennedy. Surprising little attention compared to previous biographies was paid to Paula and Lee Strasberg, Eunice Murray, Ralph Greenson, and Pat Newcomb, in my opinion. Another reason why the serious Marilyn student/fan needs to read a full spectrum of bio's on her before they see the whole person and all of her complexities.Just my opinion, I don't think Marilyn was as mentally ill as she is made out to be in the book, but who knows. I do think she was pron to clinical depression with bi-polar personality, but progressively psychotic, hearing voices, and Thorazine? I'm not convinced it was so, and I am in my third decade of studying Marilyn.It reminds me of the time Marilyn quipped about hearing voices in her head to Susan Strasberg that she had \"a whole committee\" - in perfect Marilyn dry wit. Not taken literally at all. One of the most important details of Donald Spoto's biography on Marilyn was the medical explanation for the mental illness of Marilyn's grandparents, and her mother Gladys too. It made perfect logical sense to me.Taraborrelli's portrayal of Gladys was incredible and haunting, and very believable.As far as Marilyn's romance or non-romance with the Kennedy's go, that too will remain for us to each decide what we believe. I don't think one weekend with JFK set Marilyn on the coarse that played out in the book. I just don't believe Marilyn went that gaa-gaa for him, I think she was a smarter more sophisticated woman than that. I've always felt that if Marilyn actually fell for one of the Kennedy's it would have been Bobby. I think she so would have been drawn to the sensitive, compassionate side of his personality.I'm not sure about all the sources to these important points in her life...My favorite chapter was \"Gladys: I Don't Say Goodbye\". I cried, it was so well told.The Secret Life of Marilyn Monroe by J Randy Taraborrelli is now on my short list of recommended \"must reads\" for anyone admiring Marilyn.x0xMary"}, {"userName": "Terra", "userReviewDate": "Nov 26, 2009", "userURL": "http://www.goodreads.com/user/show/1024907-terra", "userReview": "The Secret Life of Marilyn Monroe by J. Randy Taraborrelli is in essense a story of Beauty and the Beast. A beautiful young woman with so much potential who is chased throughout her life by the beast of disappointment, heartbreak, abuse, drugs and doubtful self esteem. A story of a beautiful young woman whose life is but a roller coaster ride with so many ups and down it's no wonder the tragic outcome.I must confess this is the first I have read of this actress and am glad for the opportunity to hear it from an author that has taken the time to get the facts from reliable sources so as to give us a true rendition of what really went on behind the closed doors of America's Sweetheart. Even though I was but a young child when Marilyn Monroe met her tragic end I still remember so much emphasis on the most beautiful woman that ever lived. The two people I do remember from this time period are Marilyn Monroe and JFK. Two people whose lives impacted so many and ended so tragically.The author starts this story before Marilyn is even thought of and the circumstances that bring about her life. A story starting with her grandmother giving us important background that will give us some understanding of the vicious cycle of all that is good and bad in life. A telling of no matter what station you hold in life and how the happiness and cruelties can latch onto you as easily as a cold germ from the sneeze of a sick person in a grocery store.This story talks about Marilyn's loves, marriages, affairs. Her achievements from hard word and failings from human frailty. People she knew that influenced her to the point of almost truly possessing her. Bad choices and good choices she made and how each and every one affected the outcome of her life. The story makes you think of what if she had made a different choice and how fate would have handled her. A story that will touch you in many ways and open your eyes to how good your life really is in comparison."}, {"userName": " PuMbA's MoMmy*•.♥.•* ", "userReviewDate": "Oct 17, 2011", "userURL": "http://www.goodreads.com/user/show/4756353-pumba-s-mommy", "userReview": "J. Randy Taraborrelli is one of my favorite biographers of all time. I always know that when I read his books I will get the full story and that he has done is massive research behind what he writes. Needless to say he did not let me down in this book.Marilyn Monroe has become such a wordly icon that her life and death drives many curiousities. Her death left mamy questions unanswered. Her life was not always glamorous, instead I found it to be actually very sad. Even though she became Hollywood's sex bombshell, she led a very lonely unloved life. From the time she was born she was pretty much alone going from foster home to foster home. I think throughout the rest of her life she tried to look for that type of real love from the many people that surrounded her.There were many interesting facts stated in the book that I didnt know about her. For example, her birth mother was born in Mexico and mental illness ran in her family. After reading this book and seeing all the different theories behind her death it is hard for me to say how I think she died. It could possibly have been a suicide being that she had tried to commit suicide 2 previous times and that mental illness ran in her family, & towards the last years of her life she became depressed and was very drug dependant. At the same time however, I can see why it is also believed that the Kennedy brothers had her murdered. They were very powerful and the relationship they both (Bobby & JFK) had with her seemed to have been unwanted by the brothers. I think they just used her for sex and when they got tired of it they just wanted to rid themselves of her.I highly recommend this book to everyone. Especially if you a Marilyn Monroe fan it is a MUST READ. I hope Marilyn found the love & happiness in heaven that she couldn't find here on earth."}, {"userName": "Jessica", "userReviewDate": "Aug 09, 2012", "userURL": "http://www.goodreads.com/user/show/7085045-jessica", "userReview": "I bought this book because it was on sale for $4 and I thought \"Why not?\" Unfortunately, the author is clearly biased in Monroe's favor, and painted a very favorable picture of her as being good, decent, talented, and so on, if also mentally ill and ,therefore, a victim. In addition to his obvious bias, he left out a lot of details about Marilyn's life that I had read in other places. For instance, a few years ago, Playboy released an article documenting an audio tape she had made a few days before her death to her psychiatrist, in which she describes in great detail sexual encounters with various celebrities including Joan Crawford. But the author of this book never mentions that tape nor the info it contained. It is known that Marilyn often invented tales for her own image, but in a private tape to her psychiatrist it's not likely she was lying. I think that in choosing to not acknowledge that tape, this author is purposefully leaving out things that make Marilyn look bad. It also makes me wonder what else he's leaving out. I also find it questionable that the people he has interviewed all seem to have such an amazing memory for details that occurred over 50 years ago, down to exactly what Marilyn was wearing in her daily life and exactly what words were spoken. It makes me suspicious that a lot of this information could be fabricated; if we're only relying on the words of people involved so long ago, how can we be sure any of it is true? For a book that claims to be the new, definitive biography of Marilyn, I found it highly lacking. It was breezy to read, but I found the chronological order of things to be a bit out of whack. And the author's obvious adoration of Marilyn got on my nerves considerably. I guess it was worth the $4, and it was interesting, but yeah, that's about it."}, {"userName": "RNOCEAN", "userReviewDate": "Sep 13, 2009", "userURL": "http://www.goodreads.com/user/show/1874870-rnocean", "userReview": "From New York Times bestselling author J. Randy Taraborrelli comes the definitive biography of the most enduring icon in popular American culture. When Marilyn Monroe became famous in the 1950s, the world was told that her mother was either dead or simply not a part of her life. However, that was not true. In fact, her mentally ill mother was very much present in Marilyn's world and the complex family dynamic that unfolded behind the scenes is a story that has never before been told...until now. In this groundbreaking book, Taraborrelli draws complex and sympathetic portraits of the women so influential in the actress' life, including her mother, her foster mother, and her legal guardian. He also reveals, for the first time, the shocking scope of Marilyn's own mental illness, the identity of Marilyn's father and the half-brother she never knew, and new information about her relationship with the Kennedy's-Bobby, Jack, and Pat Kennedy Lawford. Explosive, revelatory, and surprisingly moving, this is the final word on the life of one of the most fascinating and elusive icons of the 20th Century. *****Rate this well-written book about Marilyn as 5/5. I like the fact that the author did extensive research prior to writing it. There have been many misconceptions about her life and a lot of unknown facts. This book covers it all. I have read many books on Marilyn, but this is the most researched and well-written one by far"}, {"userName": "Colleen Martin", "userReviewDate": "Jan 07, 2010", "userURL": "http://www.goodreads.com/user/show/651525-colleen-martin", "userReview": "Okay, I need to preface this by saying that I'm not a huge Marilyn Monroe fan...I can appreciate what a beautiful woman she was, but I've never seen any of her movies and don't really understand why she's so iconic. And after listening to this book, I still don't understand. It sounds to me like the only redeeming quality she had was her remarkable beauty. The author goes to great lengths to tell us how intelligent she was and how she resented always being given dumb blonde roles, but frankly, Paris Hilton has made the same assertions. Yes, she showed signs of being mentally ill and yes, she had a rough childhood (although her youth wasn't nearly as bad as it could have been. There were people in her life who truly loved her, even if her mother wasn't one of them), but these were things that she could have overcome if she wasn't too busy milking the \"lost little girl\" schtick. Again, I haven't seen any of her films, so I'm willing to accept the widely-held belief that she did display acting talent in some of her films, but is that really why we remember her? No, it's not...we remember her because she's the original Hollywood cautionary tale, a train wreck we can't keep from watching, the forebear of Lindsay Lohan, Britney Spears, and other famous girls who are the path to self-destruction. Really, aren't there any better role models out there?"}, {"userName": "Calley Nye", "userReviewDate": "Aug 10, 2013", "userURL": "http://www.goodreads.com/user/show/1548731-calley-nye", "userReview": "I have always idolized Marilyn Monroe, but I never did too much reading about her. I read this book and my appreciation for her has multiplied tenfold. It was my first Marilyn biography, and it could be my last (though it probably won't be). The problem with Marilyn was that she was very troubled and had many issues, one of which was lying. So many accounts of events in her life, are based on lies, and people took them as truth. This book attempts to set them straight as. What I appreciate most is he doesn't say \"This is true, this is not.\" He presents all of the evidence and sources of stories, explains why each source might not be trusted or why it should be questioned, and leads you make your own assumptions. Much of her life is unknown, and we will never know for sure what exactly happened and why, but at least we can understand the woman and her motivations a little clearer.It was a fascinating read, and the way all of the information was presented is how I wish all biographies were written. I will definitely be reading more of Taraborrelli's books soon."}, {"userName": "Patti", "userReviewDate": "Nov 09, 2011", "userURL": "http://www.goodreads.com/user/show/5518292-patti", "userReview": "This was a good book. It's amazing that Marilyn or Norma Jean, had the strength to get as far as she did and live to realize her dream of becoming famous. I think her life would have turned of differently, if she was allowed to stay with the foster family that was taking care of her. Her mother, while I am sure she actually did love her, she never had her daughter's best interests at heart.It is also a case of a big celebrity using their fame and fortune to get what they want from doctors who are too \"fame struck\" or greedy to say no to a celebrity. Marilyn used her fame and fortune and maybe even her feminine whiles to get the drugs she wanted from Doctors. If one Doctor didn't want to give them to her, she would \"shop\" around until she found one. This book shows that she was an intelligent woman, but because of the way she was raised, and the people she was surrounded by, she was a very insecure person who used drugs to escape the demons who haunted her, and sometimes used the drugs as a way of getting sympathy from people who would come running to \"save\" her."}, {"userName": "Christina", "userReviewDate": "Dec 29, 2009", "userURL": "http://www.goodreads.com/user/show/3048348-christina", "userReview": "\"Secret Life\" is proof that sometimes one's instincts serve one well. I found it 50% off at Barnes & Noble on Christmas Eve and was so drawn to the picture of Marilyn that I picked it up on a whim, assuming I'd read it \"at some point.\" I read the first few pages and before I knew it, I was closing the book and attempting to register everything I'd just learned about Monroe's life. Taraborrelli uncovers a lot of misconceptions about Monroe and his extensive research lends much support to his accounting of her life. By the end, you're not sure whether to blame Sinatra, DiMaggio and the Kennedys for her fast decline, her genetic predisposition toward mental illness or the woman herself. Awesome, heart-wrenching and, at times, glamorous. A must-read!"}, {"userName": "Jeane", "userReviewDate": "Oct 01, 2016", "userURL": "http://www.goodreads.com/user/show/1530627-jeane", "userReview": "I had read several books written about Norma Jeane Mortensen and like all of them you need to believe what you want yourselves. It never matters if you approve about something which is said to have happened, been said ... .Since I was in school I have been reading about her and I always had the same feeling, that of an interesting, lovely and kind person with her own problems, dreams ... . We have them all and all deal with them as we do.My friend asked me recently while a documentary about Norma Jeane Mortensen was on, why I was so interested in reading about her.I can't really put in words or maybe know. It seems the only way I know answering is the way people have been doing while she was alive and after her dead, It's Marilyn Monroe."}, {"userName": "Rebecca McNutt", "userReviewDate": "Apr 02, 2016", "userURL": "http://www.goodreads.com/user/show/36977686-rebecca-mcnutt", "userReview": "Behind the glitz and glamour of Marilyn Monroe's life on celluloid, there was a family history of mental illness going right to Marilyn herself. In the 1950's mental illness was considered shameful and had a stigma attached to it, but many years after Marilyn's death, this book revealed a whole new side to her world that most people didn't know. Shocking, moving and at times very sad, this book is unlike any other."}, {"userName": "Victoria", "userReviewDate": "May 22, 2016", "userURL": "http://www.goodreads.com/user/show/3598687-victoria", "userReview": "This was an excellent and thoroughly researched biography about the luminous Marilyn Monroe. She was and continues to be an extraordinary woman who challenged her difficult circumstances and created the image and legend that is Marilyn Monroe. She is a true icon. She battled mental illness and so many demons, swinging between hope and despair. All she ever wanted was a place to belong. RIP Norma Jeane."}, {"userName": "Trish", "userReviewDate": "Jan 19, 2010", "userURL": "http://www.goodreads.com/user/show/5238476-trish", "userReview": "I have read a lot of biographies about Marilyn Monroe and found this particular book to read well. I actually found this book to clarify certain claims made by other authors with evidence to support the facts. I liked the way this book began with her birth and kept with the family and people throughout her life. A tragic tale that reads like a work of fiction, but good fiction. Would highly recommend."}, {"userName": "Ashley", "userReviewDate": "Oct 07, 2015", "userURL": "http://www.goodreads.com/user/show/7134520-ashley", "userReview": "I recommend this book to anyone who wants to know more about Marilyn Monroe. It's detailed, eloquent, and written so that the reader feels like they personally knew the actress. A truly beautiful, yet heartbreaking book."}, {"userName": "Neri.", "userReviewDate": "Jul 02, 2016", "userURL": "http://www.goodreads.com/user/show/38913473-neri", "userReview": "Very intimate look into the life of Marilyn Monroe. While reading this, I found out a lot of stuff I never knew before and of course some sort of a death conspiracy version was also mentioned here. Interesting read for her fans and everyone who likes her and her movies."}, {"userName": "Buqet", "userReviewDate": "May 14, 2012", "userURL": "http://www.goodreads.com/user/show/5306402-buqet", "userReview": "Hediye gelmişti , pek M. Monroe seven birisi değilim o yüzden belki kitap ilgimi çekmedi ama Allah için *taş gibi kadınmış rahmetli :)"}, {"userName": "Becky", "userReviewDate": "Aug 22, 2017", "userURL": "http://www.goodreads.com/user/show/8488852-becky", "userReview": "(Abridged on Audible)"}, {"userName": "Deborah", "userReviewDate": "Apr 04, 2018", "userURL": "http://www.goodreads.com/user/show/23412349-deborah", "userReview": "This is a long-ish review. I'm editing now, to put my main points on top. Then you can keep reading my blathering as you choose.I'm fascinated by Marilyn Monroe. Not sure why. It's not that my husband likes to say I look like her--I don't. He's just being sweet. But it's odd that it took me this long to read a Marilyn biography or watch a Marilyn movie. I chose this particular biography because it was the highest-rated on Goodreads. I almost decided not to finish it, and now I'm pissed that I did finish it.The main things:1. Much of Marilyn's life was mysterious, glamorous, tragic. Mostly mysterious, particularly her death. I was annoyed several times as the author glossed over alternate theories about her death and other things rumored to have factored in to it, such as the possibility of an affair with RFK as well as JFK, with statements like, \"The research assembled for this book says it didn't happen\" and that's it. Just take his word for it. But it's even worse than that. He starts the appendices section by saying that appendices are just typing exercises, they're a waste of ink and paper, nobody ever reads them anyway, so he's not actually going to set out his research and sources.What the what?I'm one of those people who does read appendices. That was when I did quit reading. Should have quit when I first thought about it.But here's the real kicker. He dismisses theories about her death this way: \"If she had been a stable woman who had never overdosed in her lifetime, then, yes, one might legitimately question the circumstances of her death. However...\" And I am not using that quote that out of context.What in the actual fuck? So, an addict can't be the victim of foul play? She was an addict, so suspicious circumstances don't matter? Is the author one of those assholes who also thinks a rape victim's sexual history is relevant? This is especially galling after you've read an entire book themed around poor-Marilyn-nothing-was-her-fault.2. The writer was perhaps a bit too dazzled by his subject. To hear him tell it, she was incapable of simply being a shit sometimes or making a stupid decision like the rest of us. Every bad thing she does is attributed to mental illness, her sad childhood, her crazy mother, her daddy issues, power-tripping studio heads, greedy and controlling acting coaches, hyperprescribing doctors, too much therapy and wallowing, abusive husbands, the effects of alcohol and/or pills, the nature of addiction, paranoia from the FBI following her around. Marilyn herself was never culpable. Except for her death, of course; see above. It wore thin.3. It suffers from Other People's Childhoods Syndrome. Normally I'd give the author a pass for this one because it's so tough to make anybody else's childhood interesting to me, but I don't like this writer. I skipped ahead to the James Dougherty marriage and the beginning of modeling, and don't feel I missed anything.4. The writing is meh, and the narrative jumps around in time so I was always flipping back and forth to see if I really already had read something, and yes, yes I had. Overall, it reads to me like a not-quite-finished draft; do some more editing, tighten up the timeline, cut about 200 pages of minutiae. Exhaustive detail is not always a good thing, and there's way too much of it here...5. ...right up until her death, which the author treats almost like a postscript. This book bogs down with detail and it was getting annoying, glancing down and seeing I was only at 35%, 43%, good Lord, only 48%. I initially skipped the most interesting parts--the Rat Pack, the Kennedys, the Lost Weekend--and jumped ahead to her death. I couldn't believe the treatment he gave it, so I went back and read what I'd skipped to see if perhaps I'd missed some justification for the author's conclusions. I had not. And I feel I've been taken for a ride.I guess this is where the blathering starts.Yes, it's morbid, but in my own defense, I also like true crime. Marilyn's death remains so mysterious but the author skims right over it. After endless recitations of imagined or third-hand conversations, interviews with people only peripherally involved in her life, detailed descriptions of what she was wearing, allusions on virtually every page to her vulnerability and mental illness and despair and emotional spirals and loneliness, she's a poor-little-lost-girl-victim all the way, over and over, okay, okay, I get it, and then the last chapter is like, \"Marilyn was found dead from a drug overdose. Lots of contradictions and different theories. Whether accidental or intentional, she did it herself, nothing fishy here. So sad. Legend, icon, blah blah blah. The end.\"Since I was lying around feeling lousy, nursing a sinus infection/allergies/spring crud, I decided to continue being unproductive and turned to YouTube clips. Yes, she did have a certain something, a fascinating blend of innocence and manipulativeness. We'll never know if she could have become a good dramatic actress, but she certainly had a gift for the sexy and funny. All glammed up she was the quintessential movie star but au naturel her beauty was ethereal. The woman was stunning. (Some of her nude shots don't even try to cover a surgical scar, and I appreciate that.)That led to Marilyn documentaries, the conspiracy stuff. Good Lord, I'd never known. What really gets me is the story of how she was found: The housekeeper became alarmed when Marilyn's door was locked, she called the doctor, he came over, he looked through the window of the French door to her bedroom, saw her lying face down with the phone in her hand, he broke the window and reached in to open the latch so he could get to her. Fine, but now Google photos of the house. (1) Where she was lying on the bed, Marilyn would not have been visible through the window at that angle, and (2) no one in their right mind would stick their hand through that broken window; you'd slice your hand to ribbons.That's just for starters. What about the later statement that Marilyn's door did not even have a lock on it? What about the assistant district attorney who says that Marilyn's organs and other samples and slides disappeared, that what tissue analysis was done was almost perfunctory? What about her completely empty stomach and the lack of any water glass at the scene? What about the claims that bruising and lividity indicated her body had been moved after death? What about the missing diary? What about the Hollywood cop who stated that on the evening of Marilyn's death, he'd pulled over a car driven by Peter Lawford with Bobby Kennedy in the passenger seat, even though Kennedy was supposedly in San Francisco that night? Rumors of the FBI, the CIA, the mob? Only some of that is here, and it's glossed over and dismissed out of hand.And I'm not saying any of what I watched is definitive. One person says this, another says that, then the first person changes their statement and says another thing, and everything seems to contradict everything else. (Really, the only conspiracy I didn't find online is that she faked her death and is off somewhere living it up with Jimi Hendrix and Elvis.) People misspeak during trauma, perhaps remember differently later, misjudge times and whatnot. Memories fade after 50 years. I understand that. But I can't take this book as definitive either.Quite annoyed that this is the Marilyn biography I chose to read. We can call it my Lost Weekend.P.S. My daughter and I just watched The Seven Year Itch in its entirety. Loved it.P.P.S. A good friend of mine is adamant that he saw Marilyn's ghost at a resort he later learned she favored. I believe him."}, {"userName": "Lani", "userReviewDate": "Feb 11, 2012", "userURL": "http://www.goodreads.com/user/show/247896-lani", "userReview": "I actually tried to read this book once before, but at the time I was in an unhappy place and couldn't take the accounts of Monroe's family history of depression. As someone with a similar family history, and unfortunate personal experience with visiting my mother in a mental ward, it was quite odd to see similarities between myself and Marilyn Monroe. Of course this is a biography, not an autobiography, so I can't know how Monroe handled her situation emotionally. But her relationship with her mother was something I understood, and the constant fear of 'becoming your mother' is magnified tenfold in this situation. If nothing else, the author is able to capture that kind of concern very realistically, whether Monroe actually felt it or not.This isn't a happy go lucky bio of a sunshine girl, this book is largely the story of Marilyn Monroe losing her mind. Maybe all the books are like this, but I didn't expect such a dark story throughout. Of course someone who commits suicide is depressed, but I didn't realize what a struggle Monroe had as a child and then with mental issues and drugs. It was shocking, and sad, but ultimately very interesting. She's so often portrayed as a woman with little depth, when in fact it's almost the opposite.Not being a Marilyn Monroe fan and not having read other biographies of her, I can't say whether this is a particularly good one. It definitely includes a LOT of quotes from close associates, many of which were actually collected for the author's other celeb bios over the years. (I think this adds a layer of authenticity, if you don't think your'e being interviewed about Monroe, you may be more honest about her. Similarly, he has stories involving other celebrities with Monroe that he might not have gotten had he not been writing books about them. I imagine Liz Taylor is a busy lady.) There is a lot of emphasis put on 'never before published' information, and I don't know how much of that is hype and how much is actually true. As someone who knew next to nothing about Monroe, I thoroughly enjoyed the book - inasmuch as one can enjoy such a sad story. Some of the family drama towards the beginning can get tedious, and maybe my personal experiences with similar situations helped me get through that part. But as Monroe's celebrity grows, the story gets going, and it becomes like a big roller coaster drop - you can see just how fast everything will go downhill until it hits bottom."}], "description": "NOW A LIFETIME MINISERIES STARRING KELLI GARNER AND ACADEMY AWARD® WINNER SUSAN SARANDON World Premiere May 30th & 31st at 8/7c\n From New York Times bestselling author J. Randy Taraborrelli comes the definitive biography of the most enduring icon in popular American culture. When Marilyn Monroe became famous in the 1950s, the world was told that her mother was either dead or simply not a part of her life. However, that was not true. In fact, her mentally ill mother was very much present in Marilyn's world and the complex family dynamic that unfolded behind the scenes is a story that has never before been told...until now. In this groundbreaking book, Taraborrelli draws complex and sympathetic portraits of the women so influential in the actress' life, including her mother, her foster mother, and her legal guardian. He also reveals, for the first time, the shocking scope of Marilyn's own mental illness, the identity of Marilyn's father and the half-brother she never knew, and new information about her relationship with the Kennedy's-Bobby, Jack, and Pat Kennedy Lawford. Explosive, revelatory, and surprisingly moving, this is the final word on the life of one of the most fascinating and elusive icons of the 20th Century.", "title": "The Secret Life of Marilyn Monroe", "url": "http://www.goodreads.com/book/show/8258307-the-secret-life-of-marilyn-monroe", "average": 4.04, "cover": "https://images.gr-assets.com/books/1328184359l/8258307.jpg", "reviews": 362, "authors": [{"url": "https://www.goodreads.com/author/show/3086927.J_Randy_Taraborrelli", "name": "J. Randy Taraborrelli"}], "type": ["Biography", "Nonfiction"], "outlinks": ["http://www.goodreads.com/book/show/8258307-the-secret-life-of-marilyn-monroe", "http://www.goodreads.com/book/show/6004568-the-secret-life-of-marilyn-monroe", "http://www.goodreads.com/book/show/6371555-the-secret-life-of-marilyn-monroe", "http://www.goodreads.com/book/show/6990124-the-secret-life-of-marilyn-monroe", "http://www.goodreads.com/book/show/8239566-the-secret-life-of-marilyn-monroe-j-randy-taraborrelli", "http://www.goodreads.com/book/show/6603053-michael-jackson", "http://www.goodreads.com/book/show/690438.Jackie_Ethel_Joan", "http://www.goodreads.com/book/show/156562.Elizabeth", "http://www.goodreads.com/book/show/13018463-after-camelot", "http://www.goodreads.com/book/show/383086.Once_Upon_a_Time", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}