{"ratings": 1571, "userreviews": [{"userName": "Joy D", "userReviewDate": "Jan 16, 2018", "userURL": "http://www.goodreads.com/user/show/50297885-joy-d", "userReview": "Compilation of Roger Angell’s essays about baseball, written for the New Yorker during the 1962 – 1971 seasons. He recaps each year’s World Series, but most of the highlights for me were the sections of local flavor, such as visiting Spring Training, describing the rollercoaster ride of a New York Mets fan, covering the early days of the Houston Astrodome, observing the arrival of “sports as entertainment” (which continues to this day), recounting the French terms used by the dual-language Montreal Expos, putting forth views on expansion and the attendant increase in playoffs (which was just beginning back then), and relating the sights and sounds of what it was like to attend games in various stadiums across the country. The last essay, The Inner Stadium, explores the timelessness of baseball, and how events and players can be clearly recalled from memory no matter how much time has passed. Angell’s prose is top notch, evoking the spirit of the period in a vivid manner. His love of the game shines through. Published in 1972, it is a product of its time, so there are a few references that may not sit well with women or other groups. Highly recommended to baseball fans, especially those interested in reading about the history of the game."}, {"userName": "Lance", "userReviewDate": "Nov 27, 2017", "userURL": "http://www.goodreads.com/user/show/8511956-lance", "userReview": "Roger Angell is considered by many, including this reviewer, the best baseball writer to grace the pages of books or magazines. This was his first book, a collection of essays covering the decade from 1961 to 1971. The topics are wide – everything from the birth of the New York Mets (the Mets are a favorite topic of many stories in the collection) to the Pittsburgh Pirates World Series victory over the might Baltimore Orioles in the 1971 World Series. While his prose about the action on the diamond is worth the price of the book alone, his writing on so many baseball topics is also a joy to read. Whether the topic is franchise shifts, expansion of both leagues and the postseason, the “Year of the Pitcher” in 1968, the first year of indoor baseball in the Houston Astrodome or the euphoria of New England when the Boston Red Sox lived the “Impossible Dream” by winning the 1967 American League championship, Angell tells it in flowing prose and an entertaining style. There are so many examples in the book that illustrate the beauty of Angell’s storytelling. Many times Angell explains why baseball is the best game, and I will use two quotes from the book to show how he felt about the game. In the chapter titled “A Terrific Strain” (written after the 1966 season), Angell writes that “Baseball is perhaps the most perfect visible sport ever devised, almost never requiring us to turn to a neighbor and ask ‘What happened?’” The second quote I will use for this came from the final chapter, “The Interior Stadium.” When writing about how most sports are resembling all the others, he maintains that baseball is unique, writing “Of all sports, none has been so buffeted about by this unselective proliferation, so maligned by contemporary cant, or so indifferently defended as baseball. Yet, the game somehow remains the same, obdurately unaltered and comparable only with itself.”With prose like this, how can any reader who enjoys baseball NOT read this man’s work? It is the perfect book for readers who have not read any of his work to pick up and start enjoying. If the reader has read this book, it is well worth the time to pick up again, as it is one that I will re-read as the winter continues. http://sportsbookguy.blogspot.com/201..."}, {"userName": "Brian Eshleman", "userReviewDate": "Mar 13, 2012", "userURL": "http://www.goodreads.com/user/show/5862823-brian-eshleman", "userReview": "Missing Link between my father's dalliance with baseball through the mid-60's and the game I came to know and love as a child of the 80's. Expansion, the move indoors, and the protracted competition for Americans' attention and entertainment dollar that baseball once took for granted are chronicled with prose that isn't argumentative for the Good Old Days or manipulatively emotional. Instead, Angell uses a light, lyrical style to look in on the game year-by-year, usually at World Series that lend themselves to such reflective and undistracted attention. Worth reading twice, for a guy who doesn't usually do that. Actually added a star and a lot of highlights the second time through."}, {"userName": "jeremy", "userReviewDate": "Apr 05, 2012", "userURL": "http://www.goodreads.com/user/show/635936-jeremy", "userReview": "well before babip, vorp, war, and eqa became common parlance in the realm of baseball reporting, a different breed of sportswriter once thrived within the pages of newspapers and magazines across the country. perhaps none excelled as greatly in their attempts to reanimate a ballgame's action and essence in print as longtime new yorker editor roger angell. angell is well known as one of baseball's finest chroniclers, and his first book on the subject, the summer game, amply exemplifies the reasons for such accolades. in the nearly two dozen essays that compose the summer game, each of which originally appeared in the new yorker over a span of ten years (1962-1972), angell waxes eloquent about our beloved national pastime. with poetic prose that richly captures some of the era's most talented players and impressive teams, angell offers insights and opinions that extend far beyond the field and the daily box score. his discerning observations of the game allow for impressions likely overlooked by less ardent devotees. although these essays are all now nearly a half century old, it's apparent that while so much of the game has evolved (given increases in payrolls, revenues, technologies, medicine, etc.), many of the main criticisms persist today. the timeless and enduring quality of baseball is, of course, one of its defining characteristics, and angell's essays demonstrate (here now from a vantage point fifty years later) the duality of the resolute and adaptable nature of the game itself.the summer game stands in stunning contrast to so much of the sports writing that has come to populate sports pages and websites throughout the country today. in few places has the game of baseball been written about so beautifully as in angell's essays. the summer game provides not only a glimpse into a bygone era of baseball, but also into a time when a less frenetic social pace allowed the game a more prominent place in our collective consciousness.\nbaseball has begun. east and west, this is the week of the unfurled bunting, the flexed mayoral or gubernatorial wing, the restored hope, the repainted seat, the april fly ball falling untouched on resodded turf, the windblown shot, and the distant row of pitchers and catchers huddling deeper into their windbreakers as the early-spring sunlight deserts the bullpen. now everything counts; from now until october, every pitch and every swing will be recorded. in another month, some order will begin to emerge from the standings. infields will have hardened, some arms and expectations will have gone bad, and enormous crowds will pour out for the first weekend doubleheaders. the long season will engage us once again."}, {"userName": "Jim", "userReviewDate": "Feb 26, 2015", "userURL": "http://www.goodreads.com/user/show/12439101-jim", "userReview": "Few works of art are truly timeless. Van Gogh’s “The Starry Night.” Beethoven’s Fifth. Michelangelo’s David. Add to that list Angell’s “The Summer Game.” The book, a collection of essays Angell originally penned for “New Yorker” magazine in the 1960s and early 1970s, recreates an era both nostalgic and immediate. Long retired superstars like Jim Palmer, Denny McLain, Bob Gibson, Lou Brock, Wille McCovey, Wille Stargell, Willie Mays, Tom Seaver, and Jerry Koosman—to name just a few—come back to life in these pages. And Angell is so skilled at describing the action and nuance of each game and each play that the reader is transported to the action. Angell puts you in the stands right next to him.Angell’s writing reveals his love of the language as much as it showcases his love of the game of baseball. For example, while discussing the Pittsburgh Pirates’ propensity for populating their pitching staff with monosyllabically named hurlers, he writes, “This year’s Buccos recklessly disposed of Mudcat Grant, but with Blass, Briles, Moose, Lamb, and Veale still on hand (I plan an extensive footnote on this startling incursion of ungulates), and the club’s coffers now heavy with championship loot, they can easily swing a deal for Vida Blue that should bring them safely through the seventies.” I know of no other writer past or present who talks about baseball with such wit and skill.Angell appreciates baseball’s enduring paradox—a game that seems so simple is rife with endless possibilities for complexity. And despite the sport’s evolution (during the time when Angell wrote these pieces, both leagues were undergoing expansion, and divisional play—along with league playoff series—had recently been adopted), the game on the field remains familiar and pure (PEDs notwithstanding). If you love baseball, read this book, and lose yourself in the sublime."}, {"userName": "Harold Kasselman", "userReviewDate": "Jan 25, 2018", "userURL": "http://www.goodreads.com/user/show/16965781-harold-kasselman", "userReview": "Roger Angell can paint images with his prose. This collection of essays is an ode to the game he loves. It is filled with insights into the game and the emotions it generates in us and instills itself in generations of families. There are so many wonderful metaphors-too many to mention but I'll pick a few. In describing a slowly emerging 64 Mets team, \"Stengel has called on Jerry Hinsley and two other rookie pitchers Bill Wakefield and Ron Locke for spot duty. They have responded with eager gallantry-often of the kind once displayed by Eton sixth-formers taking to the air against Baron von Richthofen.\" And while watching the 65 World Series after the Twins went up 2-0, he made this observation: \"The fans around me were all laughing and hooting,'it's all over now'. I hope he meant the game and not the series. After I had visited the clubhouse and heard Sandy Koufax's precise, unapologetic, and totally unruffled analysis of the game, I came away with the curious impression that the Twins with two straight victories, were only slightly behind in the series.\" And this about my personal baseball idol Willie Mays during a Giant/Dodger division race, \"Watching him this year(1971) seeing him drift across a base and then sink into full speed, I noticed all at once how much he resembles a skier in mid turn down some deep pitch of fast powder. NOBODY like him.\" And then there is the last chapter especially the last page which brought me to chills. Read that chapter and the last page and you will understand Angell's love affair with this game above any other."}, {"userName": "Ed", "userReviewDate": "Nov 13, 2008", "userURL": "http://www.goodreads.com/user/show/1090620-ed", "userReview": "Even as I was doing it, I wondered why I picked this tattered volume from my bookcase to re-read 20 or more years after I first read it.While, I'm a baseball fan, I'm not an addict. While I love reading history, I've never been particularly interested in spots history. Roger Angell is a good writer but not the best \"New Yorker\" contributor I've read.Then I got it. I wanted to take myself back to a more peaceful time - 1961-1971. After the recent hard fought election, with two wars going on and a financial melt-down of immense proportions, it was just nice to take myself back to a less stressful time, not only for the country but also for baseball.In fact the only World Series game I've ever attended was in 1962 when the San Francisco Giants played the N.Y. Yankees in a seven game nail biter. I went to game two at Candlestick Park spending the night in line with a buddy to buy a $10 ticket in the bleachers. Angell writes about this series and even the game I attended.Reading Angell's description of the various players and situations, especially the World Series, over the decade the book covers, was very satisfying as there was hardly a name he mentioned that I didn't recognize. Maybe I'm more of a \"addict\" than I realize.I suspect that even someone who's a fan but wasn't there in the 60's will recognize many of the legendary names. Willie Mays, Brooks Robinson, Tom Seaver, Bob Gibson and on and on.Baseball and its statistics are such a part of the American male psyche that understanding what went before helps us appreciate what is happening now. I truly enjoyed this trip into the past."}, {"userName": "William", "userReviewDate": "Jan 26, 2018", "userURL": "http://www.goodreads.com/user/show/8928277-william", "userReview": "I liked it well enough, and it certainly did its job of keeping me sane between baseball seasons. The writing is, by turns, excellent and plodding. He can bring alive the magic of 50 year old baseball and on the next page go into the play-by-play minutiae which I simply cannot appreciate for large doses. The period of essays in question, 1962 - 1971, is also a period of tumult in the game. Expansion teams, team moves, expanded schedule, new ballparks, new fans. All of it gets its day in here, albeit from the nostalgic point of view of someone who seems to appreciate the old days and the old fans a bit more. Very interesting and worthwhile book.What cheered me as I tramped through the peanut shells and discarded programs and out into the hot late sunlight was not just the score and not just Casey’s triumph but a freshly renewed appreciation of the marvelous complexity and balance of baseball. Offhand, I can think of no other sport in which the world’s champions, one of the great teams of its era, would not instantly demolish inferior opposition and reduce a game such as the one we had just seen to cruel ludicrousness. Baseball is harder than that; it requires a full season, hundreds and hundreds of separate games, before quality can emerge, and in that summer span every hometown fan, every doomed admirer of underdogs will have his afternoons of revenge and joy."}, {"userName": "Holly Wendt", "userReviewDate": "Jul 06, 2014", "userURL": "http://www.goodreads.com/user/show/10217654-holly-wendt", "userReview": "This is the most beautifully written, smartly felt baseball book I've ever encountered, and it's probably in the five best non-fiction collections I've read. I cannot possibly recommend it enthusiastically enough. Angell is a treasure."}, {"userName": "Jeff", "userReviewDate": "Aug 13, 2017", "userURL": "http://www.goodreads.com/user/show/3681995-jeff", "userReview": "I have loved baseball for as long as I can remember. I have also been an avid reader from a very young age. Thus it would seem the writings of Roger Angell were destined for me. I read a few of his baseball books in the mid seventies, well shy of being a teenager, and I remember they were among my all time favorites. Of course, at the time, being a small country kid, I had no idea what The New Yorker was. I did know that this seemed to be a special kind of \" adult \" appreciation of the game and its players. It is funny how strong the memories of some early reading experiences are. This, while I struggle to remember the plot and characters of a novel I read ( and enjoyed ) last month. I can easily picture the brown bordered Street and Smith's preseason baseball issue available each spring. I would instruct my Mom to look for it on the magazine rack on the grocery store, the Friday she brought it home heralded a celebratory weekend of reading. Sometime in the late seventies I purchased a \" Sport \" magazine which featured an article on Bruins legend Derek Sanderson. Evidently at the time he has had a colostomy of some sort because he spoke very profanely about having to shit in a bag. I was dumbfounded, athletes talked this way? In a magazine? For everyone to see? All this is a roundabout way of saying that, as much as I did not remember the content of the books, I very much remembered the joy of reading them. This spring Amazon featured a deal where The Summer Game and two other of Angell's baseball books were available for Kindle download for the price of $2.99. It was an easy purchase. Last night I finished The Summer Game, in which the author writes about the baseball seasons from 1961 to 1971. Writing here about specific anecdotes would be meaningless, if you are a baseball fan you have read or will want to read the book for yourself, but, if one is not a baseball nerd, the details will bore you. The gist is this, the information is for the beyond casual baseball fan. However, the writing is for the beyond casual fan of literary merit. It is an enticing, but obviously rare combination. Pick a season in this window here. The 64 Yanks/Cards, the strong mini dynasty of the Orioles from 66 to 71, appearing in the World Series several times and led by that incredible pitching and the Robinson \" brothers \". The storied 67 Red Sox season which seems to have overshadowed the great Cards team of the same year. The 68 Tigers with Denny Mclain's 30 wins but led in the series by the tough lefty Mickey Lolich. And, as a recurring subject, Angell visits the storied first decade of the Mets. From the legendary ineptitude of Stengel's 61 team to the wonder of the hopelessly overmatched \" Amazins\" winning it all in 1969 in just FIVE games. This era was, in retrospect, the height of the black baseball player. Never again would they so dominate the landscape, especially in The National League. Bob Gibson, Willie Mays, Henry Aaron, are three players that come to mind but there were many more. Over this era also hung the reserve clause. Curt Flood's sacrifice of a full season to take Major League Baseball to the Supreme Court set the table for the 1975 Messersmith/McNally decision. Angell, it seems now, was uniquely qualified to write about the love of baseball and, at the same time, to examine the many weights it was struggling under in the sixties. As the country changed, so did baseball, in no way more than in the excelling of black players and the coming storm against total subservience to the baseball owners whims. A final note: I found myself chuckling several times reading Angell address current issues effecting baseball in the sixties. He writes about the distraction of the youth of America, the myriad opportunities for entertainment among kids today that make baseball less popular. He speaks of the shortening attention span of the sports fan, the loss of prime athletes to other sports such as football and basketball. Some pieces are prescient and some not so much, but what really is clear is that baseball today has the same conversations. The game is too long, there is no clock, kids have too many choices, we are losing the best athletes. Which, for baseball, conversely, might be the best news of all, the more things change the more things stay the same. Baseball is, and will remain, The Summer Game. * It is hard to believe that, at 97, Angel still writes, and writes well. His long baseball books don't happen anymore but his occasional piece in The New Yorker on baseball still resonates. A long piece he wrote recently on the struggles and changes of life in his 90's was one of the most well received and recognized pieces in his illustrious career."}, {"userName": "Jeff", "userReviewDate": "Aug 13, 2017", "userURL": "http://www.goodreads.com/user/show/4518999-jeff", "userReview": "The Summer Game is an old friend, having been in my library since I picked it up on a high school band trip in 1973. I read it from time to time when I'm nostalgic for a time when baseball was not about multi-millionaires, the designated hitter, and stupidly ineffective rules purported to \"speed up the game\". But I mostly read it because Roger Angell's prose is so very readable and because his prose about baseball is particularly wonderful in that he writes as a fan (which he is) rather than as a sportswriter (which he was and is not).The book is essentially about baseball in the 1960s and Mr. Angell looks at the sport from a multitude of points of view: the languid days of spring training; the birth and struggles of the worst team of all times, the 1962 New York Mets; the changes wrought in the sport by expansion, the relocation of franchises, and television; and the myriad of exciting and memorable pennant races and World Series in the era between 1962 and 1971. But, most of all, it's a story about the love that Mr. Angell has for the National Pastime.In the end, the best thing I can say is that, pre-Angell, I was a Pirates fan; post-Angell, I became a baseball fan. And, while this is ancient history to many now, it is still a worthwhile read, if only to remember a time when the most important thing in baseball was the game played between the lines."}, {"userName": "John", "userReviewDate": "Jun 04, 2018", "userURL": "http://www.goodreads.com/user/show/375083-john", "userReview": "This book is a collection of essays written by Angell in the 60s and early 70s. He focuses mostly on playoffs and world series, but there's also some discussion about the labor and racial strife that plagued the game during this time, and some coverage of the regular season and the \"future of the game.\" There's a lot of Mets coverage, as Angell was both a fan and frequent commenter on the team from their inception.I really wanted to like this book more. I'm a huge baseball fan and this wasn't an era where I knew a lot of the details beyond the end of season results. Some of the essays were brilliant, and I definitely learned a lot. It was just a slog to get through it at times."}, {"userName": "RC", "userReviewDate": "May 18, 2017", "userURL": "http://www.goodreads.com/user/show/1793234-rc", "userReview": "A classic for good reason. Angell writes, as everyone knows, beautiful, lucid prose about a game that begs to be described, contemplated, and remembered long after the season's last out, replayed in the mind during the long nights of winter. As a Mets fan, I was probably unduly won over by his affection for the then-new team of lovable losers, and their year of miracles in 1969. Reading about Yastrzemski, Bench, Rose, Seaver, Ford, Mantle, Mays, Jackson, Blue, Ellis, Koufax, Clemente and other giants in these essays is both a pleasure and an education. Angell doesn't get so much into the nitty gritties and technical aspects of the game, but offers more painterly takes, with vivid descriptions of the personalities and physical beauty of the game."}, {"userName": "Rob", "userReviewDate": "Sep 24, 2017", "userURL": "http://www.goodreads.com/user/show/3660615-rob", "userReview": "I spent the better part of the summer slowly working my way through this one, but I really enjoyed it. The writing is funny and dry and lyrical about the game without being sentimental. It may be the first non-fiction baseball book I've read and that's ridiculous, considering how much I claim to love the game. I very much enjoyed learning more about a time in baseball history with which I am pretty unfamiliar. I especially like reading about the '67 Red Sox, the Impossible Dream Team. I look forward to reading more Roger Angell."}, {"userName": "Daniel Carrol", "userReviewDate": "Aug 12, 2013", "userURL": "http://www.goodreads.com/user/show/2283902-daniel-carrol", "userReview": "Some of the best writing on baseball ever committed to print"}, {"userName": "Jennifer", "userReviewDate": "May 17, 2018", "userURL": "http://www.goodreads.com/user/show/13199125-jennifer", "userReview": "Good collection of baseball essays. Unfortunately, he wrote about a lot of teams that I knew very little about."}, {"userName": "Harron68", "userReviewDate": "Mar 11, 2017", "userURL": "http://www.goodreads.com/user/show/19016564-harron68", "userReview": "Sublime reading. It takes readers back in time, seems nostalgic, but don't be fooled. Those games, players,seasons, did really happen. It wasn't myth. Sadly, these days baseball doesn't fit our attention spans or pace of living. Players today are most likely to be Latino, with African-Americans fewer and whites and other \"ethnic groups\" less. Maybe that's a factor as well. In any event, reading about the best and worst of players endears readers to the nearly forgotten stars of yore.  For those who enjoy books of the sport's past, some of the unusual books like \"Outsider Baseball\" and any on the \"negro baseball\" era are well rewarding."}, {"userName": "Tom Gase", "userReviewDate": "Sep 08, 2015", "userURL": "http://www.goodreads.com/user/show/2339366-tom-gase", "userReview": "Roger Angell is quite simply the best baseball writer that ever lived. This book is a collection of stories Angell once wrote for the New Yorker that chroncile the 1962 through 1971 seasons. I really like his stories on the Mets in 1969 and the Orioles of 1966. What Angell does better than anyone is put you in the seats of the game, because the majority of his writing comes from himself, writing from the seats of a game, rather than the pressbox. He describes not only the game itself, but the surroundings so well it seems as if you are there. He is the Vin Scully of baseball writers. Here are some great passages...Suddenly I saw the best two left handers in baseball, or right-handers, were in a direct line with each other, Ford exactly superimposed on Spahn. It was a trick photograph, a trompe-l'oeil: a 158 game winner and a 309 game winner throwing baseballs in the same fragment of space. Ford, with his short, businesslike windup, was all shoulders and quickness, while, behind him, Spahn would slowly kick his right leg up high and to the left, peering over his shoulder as he leaned back, and then deliver the ball with an easy, explosive sweep. It excited me to a ridiculous extent. I couldn't get over it. I looked for someone to point it out to, but I couldn't find a recognizable fan-face near me.Or...Here on a patch of grass in front of the the locker rooms, in front of a smaller crowd, Jose Santiago was enjoying a moment of absolute triumph as a pitcher. Dressed in slacks and a short sleeved shirt, his hair combed after his shower, he was tossing underhand to his four-year-old son, Alex, , from a range of about 10 feet. ALex was wearing a miniature Red Sox uniform, with his father's number, 30, on the back, and he was swinging a plastic bat. As I counted, Alex took 14 successive swings at the ball without even managing a foul tip. Watching this game were perhaps a dozen other players- some in uniform, some not, some in stocking feet or with towels draped around their necks- and a good many wives and children and their babies. Several of the wives were pregnant, and all of them young. They had driven over to the park to up the husbands at the end of the day's work. Now, at last, Alex Santiago hit the ball, and everybody cheered. His father let the ball roll through his legs and across the lawn, and Alex ran excitedly around an imaginary set of base paths, fell down once, and then made it safely home. With writing like this it's easy to see why Angell is so great. A must-read for baseball fans, especially ones that grew up or remember watching baseball in the 1960's."}, {"userName": "Tobias", "userReviewDate": "Dec 21, 2016", "userURL": "http://www.goodreads.com/user/show/695437-tobias", "userReview": "Beautifully written collection of essays from the 60s and early 1970s that not only captures a really great era of baseball - with a focus on the World Series - but functions as an impressionistic history of the period when the old system gave way to the big money era characterized by expansion, moving franchises, clashes between big and small market teams, and labor strife. It's actually remarkable how much this era was dominated by teams that would soon be considered small market (Cincinnati, Pittsburgh, Baltimore, Minnesota, St. Louis, etc.)."}, {"userName": "Rahul  Adusumilli", "userReviewDate": "Feb 10, 2017", "userURL": "http://www.goodreads.com/user/show/3658765-rahul-adusumilli", "userReview": "\"Within the ballpark, time moves differently, marked by no clock except the events of the game... Since baseball time is measured only in outs, all you have to do is succeed utterly; keep hitting, keep the rally alive, and you have defeated time. You remain forever young.”A baseball reporter walks into a bar. He finds a framed motto on the wall and reproduces it verbatim in his book“Life is like a journey taken on a trainWith a pair of travelers at each window pane.I may sit beside you all the journey through,Or I may sit elsewhere never knowing you.But if fate should mark me to sit by your sideLet’s be pleasant travelers, it’s so short a ride.”In our time, we even hesitate to suggest the team that won wasn't necessarily the best. Where from this cynicism? Is it from the script of Social Network by Aaron Sorkin? Why this ever present proclivity to brush off the suggestion with a brusque, \"If they were really the best, they would've won.\" Where has the romance gone?"}, {"userName": "Scott Graham", "userReviewDate": "Apr 19, 2016", "userURL": "http://www.goodreads.com/user/show/8737404-scott-graham", "userReview": "There are(good) books that you pick up and drop at leisure. There are (great) books that you simply can't put down. And then there are those few volumes that you tear yourself away from because you don't want them to end too quickly. Angell's prose is worth savoring no matter what his attention touches. Here are a couple of selections.  \"Coleman, who is eager and combative, handles outside curve balls like a man fighting bees. He is quick on the base paths, but this is an attribute that is about as essential for catchers as neat handwriting.\" \"Reasonable hope cannot be constructed out of such a sad pile of feathers, but the lifelong Red Sox fan is not a reasonable man.\" \"The Series had given us so many of these Brooksian masterpieces, in fact, that I found myself beginning to collect and compare them in memory, like Vermeers.\" This volume covers Angells' essays on baseball from the 1962 to 1971 seasons, and touches upon events on and off the field. Anyone who has rooted for a terrible club owes it to themselves to read \"S is for So Lovable\" about the 1963 Mets. A true classic."}, {"userName": "Michael", "userReviewDate": "Apr 27, 2014", "userURL": "http://www.goodreads.com/user/show/3897824-michael", "userReview": "Baseball as it really was (and in some ways, still is). Angell covers the game I grew up with, the players--Gibson, Kaline, Aaron, Mays, Robinson, Koufax, Yastrzemski, Seaver, Palmer, teams--Tigers, Orioles, Dodgers, Cardinals, the Amazing Mets (and not so good Mets), even the ball parks--Astrodome, Tiger Stadium, the Polo Grounds, etc. He brings the baseball fan through the games growing pains of the '60's, with league expansion, franchise moves, listening to the game via radio or actual attendance to watching it on television, all the changes, even the year of the pitcher, the year of the hitter, and the so called demise of the game due to football.I originally found this book at a yard sale, $.25 was what I spent. Better deal than winning tickets to any Cardinal or Yankee World Series. The Royals, well, the book isn't the better deal compared with a Series they would play in."}, {"userName": "Don", "userReviewDate": "Feb 28, 2015", "userURL": "http://www.goodreads.com/user/show/750659-don", "userReview": "Read this to honor the start of the baseball season, just to get me further excited. The book is a collection of essays/articles written by Angell, primarily in the 1960s, and early 1970s, about baseball. Angell's writing style is easy to read, and I think he accurately captures the essence of what attracts baseball fans to the game - the sounds, the feel, the complexities. The book also includes work that touches on the growing expansion of baseball during the 1960s, the tense relationships between owners and players (ahead of the free agency period), and how people viewed baseball as a dying sport due to the rise of football (still a recurring theme today, 40 years later :)).I love baseball, and this book is for people who love baseball. Angell's writing is thoughtful, and gets at the intricacies and small moments that us fans love about the game of baseball."}, {"userName": "M. Milner", "userReviewDate": "Jan 18, 2012", "userURL": "http://www.goodreads.com/user/show/3104186-m-milner", "userReview": "An enjoyable, if very New Yorker-ish series of essays about pro baseball, originally written between 1962 and 1971. In spots it's pretty dated (him complaining about expansion, decades before the leagues exploded to 30 teams; arguments against the Championship Series, in the days before the Divisional Series, let alone the Wild Card play-in; etc). At times its somewhat stuffy and at others it's completely wrong-headed, but by and large it's an enjoyable book. It's mostly Angell recapping each season's world series, but the ones where he tackles other ideas make for the best reading: A look at the hapless 1962 Mets, visits to spring training. The last essay, The Inner Stadium, a piece on enjoying baseball during the offseason, is quite good. Recommended for baseball fans, especially those who don't mind recaps."}, {"userName": "Margaret", "userReviewDate": "Nov 10, 2009", "userURL": "http://www.goodreads.com/user/show/162759-margaret", "userReview": "A classic baseball book, collecting articles Angell wrote for the New Yorker from 1962 to 1972. Angell's descriptions are so vivid that it's almost like being at the games he narrates (including most of the World Series meetings during the period of the articles); the pieces are remarkably fresh given their age (hey, all of these games were played before I was born!). Angell muses on numerous aspects of baseball: the awful beginnings and eventual triumphs of the New York Mets, the advent of domed stadiums, spring training in Florida, the decline of the mighty Yankees, and players from Mays and Clemente to Koufax and Gibson. The Summer Game is simply one of the best baseball books I've ever read, and I'm eager to read more of Angell."}, {"userName": "Chad Simons", "userReviewDate": "Apr 25, 2014", "userURL": "http://www.goodreads.com/user/show/30842460-chad-simons", "userReview": "I loved Roger Angell's short stories. His articles in the New Yorker over the years have been gems. I love baseball, as does he. He has such a talent for writing that he makes even the simplest parts of the game of baseball extrememely interesting. That said, the Summer Game was a little hard for me to read. It was written about a time that I was not alive for, and it seemed a lot of knowledge about the time was required to really get into this book. I recognized some of the names of the great players he referenced, and the ballparks, so that part was good. Overall, I really enjoyed the book, but it seems his short stories are more my type!"}, {"userName": "Sandy", "userReviewDate": "Jul 05, 2015", "userURL": "http://www.goodreads.com/user/show/3227353-sandy", "userReview": "Reading Angell is such a pleasure - his writing evokes the time and the sport beautifully. Although my personal interest in baseball didn't really begin until the mid 70s, I was certainly aware of many of the players he talked about from the 60s. But, more to the point, his essays just make me remember how much I enjoyed baseball, and how great it could be to watch a baseball game - whether a tight pitchers' battle or a crazy high scoring game. I also really enjoy his turns of phrase - on almost every page, there was a descriptive phrase that I savored, remarking on what a perfect way it was to evoke just the image that he wanted."}, {"userName": "William Kriner", "userReviewDate": "Nov 14, 2016", "userURL": "http://www.goodreads.com/user/show/37536509-william-kriner", "userReview": "The perfect baseball book for Baby Boomers. Starting with the birth of the Mets to the last World Series of the Great One, Roberto Clemente, it chronicles each season, the ups and downs of teams and players of the game, the long term stars as well as the one season wonders. It was pre-steroids and for blokes like me the Golden Age of baseball. If you remember baseball in the sixties and early seventies, this book is for you. And, if you are not acquainted with the era of a declining Mantle, Mays, Aaron, Banks, Clemente, et al., it will give you a taste of what it was like to follow baseball then."}, {"userName": "Ralph", "userReviewDate": "Jun 06, 2009", "userURL": "http://www.goodreads.com/user/show/2206369-ralph", "userReview": "Baseball as Poetry, History, Politics, Business, America, and as Life...No one can capture the game like Roger Angell. This is my second time reading this book (I read it over 25 years ago)This book takes us through the mid to late 60's and the early 70's where the names, teams, and the deeds come back to life... the Big Red Machine, Gibson, Brock and Flood and the Cardinals, the Pitiful and the Miracle Mets, Yaz, Cash, Kaline and the Tigers, and the great Willie Mays.The best candy you can find for a baseball fan."}, {"userName": "Kate", "userReviewDate": "Aug 03, 2014", "userURL": "http://www.goodreads.com/user/show/1643707-kate", "userReview": "Not only is Roger Angell brilliant, he's also prescient. These pieces are all at least 40 years old, predating the era of free agency, and yet Angell forewarns us about the growing distance between player and fan. But, like all of his books, \"The Summer Game\" is a celebration of the beauty and joy of the game and its players. It's also full of Angell's sly humor. Despite all the changes Major League Baseball has seen in the ensuing years, the game remains the most perfect ever invented. And watching it through the eyes of Roger Angell is still a wonderful experience."}], "description": "", "title": "The Summer Game (Bison Book)", "url": "https://www.goodreads.com/book/show/18881645-the-summer-game", "average": 4.28, "cover": "https://images.gr-assets.com/books/1388289316l/18881645.jpg", "reviews": 66, "authors": [{"url": "https://www.goodreads.com/author/show/18856.Roger_Angell", "name": "Roger Angell"}], "type": ["Sports", "Sports and Games", "Nonfiction", "Writing", "History"], "outlinks": ["http://www.goodreads.com/book/show/18881645-the-summer-game", "http://www.goodreads.com/book/show/6508047-the-summer-game", "http://www.goodreads.com/book/show/603712.The_Summer_Game", "http://www.goodreads.com/book/show/4095317-summer-game", "http://www.goodreads.com/book/show/39402100-the-summer-game", "http://www.goodreads.com/book/show/3742578-the-summer-game", "http://www.goodreads.com/book/show/2676362-the-summer-game", "http://www.goodreads.com/book/show/7125454-the-summer-game", "http://www.goodreads.com/book/show/17265134-the-summer-game", "http://www.goodreads.com/book/show/313298.Five_Seasons", "http://www.goodreads.com/book/show/603707.Let_Me_Finish", "http://www.goodreads.com/book/show/1199775.Late_Innings", "http://www.goodreads.com/book/show/25733456-this-old-man", "http://www.goodreads.com/book/show/603711.Game_Time"]}