{"ratings": 4045, "userreviews": [{"userName": "Jennifer Masterson", "userReviewDate": "Jun 09, 2016", "userURL": "http://www.goodreads.com/user/show/28953843-jennifer-masterson", "userReview": "I am a mess! I mean an emotional wreck! I have a migraine from crying! This is the best book that I have come across since \"A Little Life\". If I could give it 10 Stars I would! 11? I cannot believe that this is a debut novel!I'm not going to give a plot summery. I think this book transcends it's plot. I want to share my feelings. This book moved me in a way I haven't been moved in so long. I listened to the audio version. For an audio to be this good it takes one heck of a narrator. Mark Bramhall told this story with such feeling. I can't even begin to describe how this book consumed me for the past few days.I do want to share Larry Hoffer's review with you. Please read it. It gives a more thorough synopsis of the book and it is the reason I purchased this audio. Here it is...https://www.goodreads.com/review/show...I don't understand why this is not on more people's radar!? It needs to be read!!! Forget the Devil accepting an invitation to come to this town in Ohio. This book is so much more!Tiffany McDaniel has one Hell of a career ahead of her. No pun intended! Lol!This book made me think a lot about what is going on politically right now. All the fear and hate. How love can conquer fear. Put it at the top of your to read list!!!** Note that there is the death of an animal in the book."}, {"userName": "Chelsea Humphrey", "userReviewDate": "Jun 18, 2016", "userURL": "http://www.goodreads.com/user/show/47207032-chelsea-humphrey", "userReview": "I think something deep in my soul has shifted after reading this book. My gut is still churning after turning the final page 2 days ago, and its been years since a book brought me to the brink of tears. I read more psychological thrillers and dark fiction than one human likely should, yet none of that seemed as horrific as what I just read. Don’t misunderstand- this isn’t some bloodbath horror tale with cheesy specters of the devil and his minions. The only apparition in this story is a 13 year old boy, but back to that in a minute.“The heat came with the devil. It was the summer of 1984, and while the devil had been invited, the heat was not. It should’ve been expected, though. Heat is, after all, the devil’s name, and when’s the last time you left home without yours?”Just like the blurb states, the setting is summer of 1984, and the book describes what was going on in the media during this time. I really loved all the small details she took the time to include; this seemed to put the level of writing over the top for me. Autopsy Bliss (yep, his real name), father to Fielding Bliss (our narrator), has placed an ad in the local paper inviting the devil to town. The reasoning behind this is explained in the final pages of our story, so you do get all kinds of closure, but the story starts out making you scratch your head and wonder “where is this lady going to take us with this?”. Yes, then a 13 year old black boy with green eyes shows up holding said ad claiming to be the devil, but this book is not what you’re thinking it is. I admit, I saw my friend Shelby’s review and my curiosity was piqued, but I was already overloaded with NetGalley books so I figured I’d catch it some time after publication. Thankfully the author contacted me and convinced me to read it now! Fact: Chelsea never re-reads books. Fact: Chelsea is going to have to re-read this book sometime in the future.“You can tell a lot about a man by what he does with a snake…A snake that could harm you, you don’t have much choice to kill. You wouldn’t be able to leave a cobra in your sock drawer. But a snake that is no threat will greatly define the man who decides to kill it anyways.”The characters are what really sold me on this story. Each one was deep, flawed, and broken in their own ways, yet still lovable as I felt attached to each member of the Bliss family, including Sal. We get to see snippets of Fielding’s life as he ages from memories he shares with us as a man in his 80’s. We know early on that something major will happen at the end of the summer of ’84, and the tension grows in a slow, yet powerful way. Each chapter brought new revelations on the character’s personal struggles, as well as the impending doom that lingers over the entire town of Breathed. This story was crafted with so many real issues that were relevant then and are still relevant now- mob mentality, racism, homophobia, and the ever failing criminal justice system. The ending was nothing short of disturbing, mainly because it is so easily pictured and believable. I was completely shocked with all aspects of the ending; I did not see one thing coming with how this story concluded and it made me feel this weird cross between horrified and satisfied. I don’t want to put any spoilers in here, but I felt I had grown close to this family and was broken with them every step of the way. This is a must read that is deep, compelling, and timely for what is consuming our state of current affairs. My heart broke and wept openly as a reader, as a mother, and simply as a human being. PLEASE read this book; it will certainly be a pick in my round up for TOP 10 books I’ve read this year.*Many thanks to author Tiffany McDaniel and St. Martin’s Press for providing my copy via NetGalley in exchange for an honest and fair review. Please stay tuned as I’ll be posting an interview with the author and a giveaway for a signed copy of The Summer That Melted Everything near pub day!"}, {"userName": "Jeffrey Keeten", "userReviewDate": "Jul 12, 2016", "userURL": "http://www.goodreads.com/user/show/3427339-jeffrey-keeten", "userReview": "”It was a heat that didn’t just melt tangible things like ice, chocolate, Popsicles. It melted all the intangibles too. Fear, faith, anger, and those long-trusted templates of common sense. It melted lives as well, leaving futures to be slung with the dirt of the gravedigger’s shovel.”\nSlipping Away by Tiffany McDaniel. If you preorder the book you can sign up here Tiffany McDaniel's Preorder Contest to win some cool stuff including a signed print of this watercolor. The heat wave that hit Breathed, Ohio, in 1984 was no ordinary hot spell. It was oppressive and inescapable. It was as if the cellar door to hell had been laid open beneath their feet. Sweat dripped from their pores like the tears of the damned. Tempers flared under the constant, ruthless lash of unbearable high temperatures. Reason floated away into the atmosphere and was replaced by superstition and irrationality.And it was all Autopsy Bliss’s fault.He did write the letter, after all.”Dear Mr. Devil, Sir Satan, Lord Lucifer, and all other crosses you bear,I cordially invite you to Breathed, Ohio. Land of hills and hay bales, of sinners and forgivers.May you come in peace.\t\t\t\t\t\t\tWith great faith,\t\t\t\t\t\t\tAutopsy Bliss”The Devil accepted.Now Autopsy Bliss is an educated man, a lawyer in fact, but he got bit by the fire and brimstone of religion. When he issued this letter to the newspaper, did he really expect the Devil to appear before him? Did he think he could wrestle Lucifer or spar with Satan, and The Cross would assure him a fair fight? I don’t think that Autopsy Bliss expected a creature with cloven hooves, forked tail, and horns to appear on his doorstep. Lucifer is a fallen angel, not a demon, and certainly not the creature of fairytale, or the fiendish incarnation he has been depicted in films, or the lurid spectacle he has become on the covers of pulp novels. It turns out he is a thirteen year old black boy with green eyes. He was, in fact, the same age as Fielding Bliss. He calls himself Sal.”If looks were to be believed, he still was just a boy. Something of my age, though from his solemn quietude, I knew he was old in the soul. A boy whose black crayon would be the shortest in his box.”Autopsy might have had a more realistic vision of Satan in his mind than the cartoon version, but it still took some mental gymnastics to even begin to believe that Sal was the Devil. The heat has eroded minds. Logic is a bonfire. Familiar perceptions are a blaze. When things start to go wrong for people, they start to believe that the implausible is suddenly the only possible explanation. Fielding’s mother Stella hasn’t left the house in twelve years. When she withdrew from the world, she decided to bring the world to her by turning each room of her house into a different country. Grand is Fielding’s older brother, a young man on the cusp of the rest of his life. He is a God of the ballfield, but also a man of character and sensitivity that makes him so much more than just the sum of his parts. Fielding worships him, as he should. Grand is someone we can all aspire to be more like. He is a worthy sacrifice. ”A summer’s day, and with the setting sunDropt from the zenith, like a falling star”---Milton, Paradise LostIt is one thing to never find paradise, but of course it is quite another thing to have found it and lost it. For a family named Bliss, they have watched the gates of Eden shimmer behind them and disappear.Sal becomes the third son. I think what the people of Breathed forgot about was that the concept of the Devil is manifested in all of us. You might not see him when you look in the mirror dead on, but turn your head to the side and look out of the corner of your eye, and you might catch a glimpse of him. He is reflected in your fingernails when the light is just right. Sometimes, if you close your eyes down to slits, you can see him in the swirls of your pancake. He stares at us from the darkness, from the bowel of a tree, or through the eyes of an owl. You can’t kill him. You can’t kill the light that has fallen to darkness. Why would God let you?”People always ask, Why does God allow suffering? Why does He allow a child to be beaten? A woman to cry? A holocaust to happen? A good dog to die painfully? Simple truth is, He wants to see for Himself what we’ll do. He’s stood up the candle, put the devil at the wick, and now He wants to see if we blow it out or let it burn down. God is suffering’s biggest spectator.”The town begins to suffer from mass insanity. Call it the heat, but there is this dark desire in too many of us that rises to the surface, unchecked, when we are challenged.Tiffany McDaniel might be a young writer, but this is no raw first novel. She is wise with bone deep perceptions of who we are and who we become when we allow hysteria or religious fervor to dictate our actions. She writes with conviction and complexity that forced this reader to reread sentences and paragraphs to better appreciate the uniquely, creative ways she composes her thoughts. The setting is in the North, but some of the Southern Gothic of the deep South leaped over the Mason-Dixon line into Ohio. I also could swear I witnessed the ghost of Douglas Spaulding running through the woods with Fielding Bliss and saw the flash of his bare feet as he dived back into the pages of Dandelion Wine. I thought I saw Shirley Jackson lost in the loose limbs of the mob...her eyes as big as dinner plates and her mouth opened in a.... ”That was when the screaming started. They were screaming cheers, we were screaming tears, and Sal was screaming fear. A rhyme of the ages.”Who among us can stop them? Who can wiggle a screwdriver between the door and the jam and let the cooling balm of reason flood the hallways of a fevered mind? The author and NetGalley provided me with a copy of this book in exchange for an honest review. Tiffany McDaniel was gracious enough to agree to answer a few of my questions about the novel. Below is a short interview I conducted with her. \nTiffany McDanielJeffrey Keeten:As I was reading your book I couldn't help thinking about Dandelion Wine. Have I been out in the heat too long or am I right about this book being somewhat of a homage to the Ray Bradbury book?Tiffany McDaniel:I love Ray Bradbury’s Dandelion Wine, so I’m beyond thrilled that you’ve brought it up. I always say I want to be buried with the novel, have it in the clutches of my ghost to carry forth in to the great beyond. Having read it many times, I’ve always wanted to write a story about boys coming-of-age in the summertime. Those two events seem to parallel one another as if summer exists in childhood itself. On the surface Dandelion Wine is about boys coming-of-age, but what Bradbury does so well is threading that melancholic undertone through his verse, his own bittersweet brand that makes his stories and his story-telling the mark of a true master. Life and death, happiness and sadness, these are the things that permeate both Bradbury’s novel and my own. No one can ever surpass Bradbury’s beautiful writing and story, but perhaps my story is a way of recognizing the beautiful force that has been Dandelion Wine in my life. Jeffrey Keeten:Paradise Lost obviously had a heavy influence on the writing of this book. You certainly have left me thinking I need to schedule a reread of PL. You also mentioned Orwell's 1984 in the book. In thinking about the scope of this book what other books would you say had a heavy influence in the creation of this book?Tiffany McDaniel:I first read Milton’s epic poem when I was in my early twenties. I was immediately drawn to it because it’s about that which has always fascinated me. The fall from grace. The very thing that is said to have cast all the curses upon us as human beings, and put the sins within reach. I always title my chapters in my novels, and when I was thinking of the chapter titles for The Summer that Melted Everything, “Paradise Lost” immediately came to mind. How could it not be the perfect partner for this summer? Though I do hope I have made Milton proud by including his beautiful quotes, quotes which do outshine my own words by a billion, sparkling miles. As far as Orwell’s 1984, it’s one of those required readings that most everybody has in school. I was so fascinated by it, if only because the year 1984 has passed already, but also because it was a novel predicting a certain state of affairs where citizens are manipulated and all independent thought is a crime. It’s hard to talk about 1984 the novel and its reason for being in The Summer that Melted Everything without giving any spoilers away, but I’ll just say that both Orwell’s novel and my novel speak of that herd mentality. How easy it is to come about and how threatening it is to individual choice.As far as other influencers on The Summer that Melted Everything, I can’t think of another book in particular, but reading in general just adds layer after layer to one’s soul. And with a book like The Summer that Melted Everything where we’re looking at the balance between good and evil, well those are things we see every day on the nightly news. Look no further than our daily life, and we are surrounded by the fuel to write about chaos and peace, good and bad. If anything, the book of life itself is the spinning wheel to a story like this. Jeffrey:The book is set in Ohio, but it has such a Southern Gothic feeling to it that I kept thinking the geography could have easily been set in the Deep South such as Donna Tartt's home state of Mississippi or Flannery O'Connor's Georgia or Harper Lee's Alabama. You must have encountered some of that Gothic magical realism in Ohio?Tiffany: Breathed, Ohio, the fictional town in the novel is based on my childhood summers and school-year weekends spent in southern Ohio on the hilly acreage and in the cinderblock house my father was left to him by his parents. Southern Ohio, while in a northern state, does very much have that southern United State twang to it. “Ain’t” is as abundant as the wildflowers in the fields, and bullfrogs are the music of the night. It’s a very front porch type of place. It’s a place that has shaped me as an author. I’ve said before, cut me open and there will be a release of fireflies and moon-shine. In many ways, southern Ohio was a magical place to me because it was so different from the more northern part of Ohio where I lived and went to school. That southern portion, the foothills of the Appalachians, is a part of Ohio that has its own magical myths. I was told the hills were full of tigers, released there by a zoo gone belly-up. I would stand on the creek edge and see a gar go swimming by, thinking it was an alligator. Added to this, I’ve always had a gothic mind. Wishing I could live in a derelict mansion with velvet curtains and Shirley Jackson spires. Wolves howling, spiders webbing, magic churning night after night… Jeffrey: Autopsy Bliss goes on my list of greatest character names in literary history. As I was reading the book I started jotting down the character names because I was struck by the unusual nature of most of the names. Do you start with a name or do they sometimes remain nebulous personalities in search of the right name for a while as you write? Tiffany: First off, thank you for the incredibly wonderful compliment of Autopsy’s name. I’m sure Autopsy himself would be quite pleased. When I start writing the characters, I do have to have their name from the beginning. Having their name really helps to create and flush out the character. I can’t write them without a name. It’s like walking in dark woods by myself, calling for the characters to come out from the trees. But if I don’t have a name to call, who is there to come out?Jeffrey: I jotted down this question while I was still in the early stages of reading the book. Would you want to live with the Bliss Family? They are ethereally wonderful, but of course the tragedies that find them as the plot unfolds probably answers that question. This is truly a book about bad things happening to good people. Are they still walking around in your head or have you managed to lock them in a back room of your mind so you can move onto your next novel? Tiffany: To answer your first question, I would want to live with the Bliss family, if only because I love them all so much. Even with the tragedies that reshape them as a family, I would live with them. Be their daughter, their sister, their best friend, the one crying with them, laughing with them. As the author, I’ve already done all these things. I’ve already felt like I’ve lived in the house with them. What is home, if not with the people we love? I will always share a life with the Bliss Family, as I do my real family. To me there is no difference, because while fictional, the Bliss family exists for me. I always say my characters feel real to me. Maybe I won’t get to physically interact with them in this world, but I feel as if in another plane of the universe, or even the afterlife, I’ll be able to speak to them, to recognize them as people who have lived full lives from womb to coffin. I always say my characters do not begin with the first page I’ve written. They do not end with the last. They existed before and they exist after the book. There are moments and experiences they have that none of will ever know as author and reader. In every way, they are as fully human as any of us. And they are always with me. Even when I write another novel. They are there. They just politely sit down, so new characters can stand up. Jeffrey: Speaking of next novel, where does Tiffany McDaniel go from here?Tiffany: I have eight completed novels. I’m working on my ninth right now. I wrote my first novel when I was eighteen. I wouldn’t get a publishing contract until I was twenty-nine. I spent eleven years struggling to get published. Rejection after rejection made me fear I never would be published. So much heart-ache and pain on the journey to publication, I can’t believe I’m about to be a published novelist. Publishing does move at a snail’s pace, and even with the contract I’ve waited two years for the book to move through the publishing house to the shelf. I’m thirty-one now, having waited in total thirteen years to see one of my novels on the shelf. So where I go from here is to just keep writing. Hoping The Summer that Melted Everything does well enough for me to have the other books published as well. The novel I’m hoping to follow The Summer that Melted Everything up with is When Lions Stood as Men. It’s about a Jewish brother and sister who escape Nazi Germany, flee across the Atlantic, and end up in my land of Ohio of all places. While here they create their own camp of judgment where they serve as both the guards and the prisoners. It’s a story of surviving the guilt that threatens to undo us all. More so, it’s about surviving love and the time when lions once stood as men. Book TrailerTiffany McDaniel's WebsiteIf you wish to see more of my most recent book and movie reviews, visit http://www.jeffreykeeten.comI also have a Facebook blogger page at:https://www.facebook.com/JeffreyKeeten"}, {"userName": "Shelby *trains flying monkeys*", "userReviewDate": "Mar 30, 2016", "userURL": "http://www.goodreads.com/user/show/1053760-shelby-trains-flying-monkeys", "userReview": "I thought this was a young adult book when I requested it from Netgalley. Umm it's not. Not that I have a problem with that, I love some dark 'stick-your-head-in-the-oven' books.Dark is good sometimes.\nThis one though, took me awhile to read because I had to put it aside several times because dang..\nI will say that 1984 was a year that understood how to make history. Apple launched it's Macintosh computer for the masses, two astronauts walked the stars like gods, and singer Marvin Gaye, who sang about how sweet it was to be loved, was shot through the heart and killed by his father .Fielding Bliss's father invited the devil to town. Fielding is thirteen at the time and his attorney father Autopsy (yes that is his name) is down after a case he was trying turned out to be something totally different than what he thought it was. Dear Mr. Devil, Sir Satan, Lord Lucifer, and all other crosses you bear,I cordially invited you to Breathed, Ohio. Land of hills and hay bales, of sinners and forgivers.May you come in peace.With great faith,Autopsy BlissThe thing is? The devil does come to town. Along with the heat. A thirteen year old black child with the oddest green eyes shows up in answer to Autopsy's letter. Claiming to be the devil himself. The sheriff thinks he is just a missing boy and starts trying to find out where he is from but can't find any family looking for him. Sal is completely not what Fielding nor his father were picturing when they thought of as the devil.If the devil was going to come, I expected to see the myth of him. A demon with an asphalt shine. He'd be fury. A chill. A bad cough. Cujo at the car window, a ticket at the Creepshow booth, a leap into the depth of night.Who knew how much a thirteen year old boy could change a town in the course of a summer? Sal is taken in by Fielding's family and becomes like a son to the family. The boys become pests to their older brother Grand and best buddies to each other.\nBut you have the town. Who is stifling under the heat and hatred is burning. Sal's wisdom is much older than his age and it seems like trouble follows him no matter what he does.\"You can tell a lot about a man by what he does with a snake. A snake that could harm you, you don't have much choice to kill. You wouldn't be able to leave a cobra in your sock drawer. But a snake that is no threat will greatly define the man who decides to kill it anyways.\" This book is so well written. You can tell that I liked it by the number of quotes I stole and put on here! Be in the mood to read it though, because it gets in your head and then you start thinking and stuff and it hurts my head to think about stuff.\"You can imagine anything you want in the dark. You can imagine your father loves you, you can imagine your mother is not disappointed, you can imagine that you are...significant. That you mean somethin' to someone. That's all I ever wanted, Fielding. To matter. That is all I've ever wanted.\"Booksource: Netgalley in exchange for review\nNone of my friends have read this book yet...they should. I have no clue what you guys are waiting on. So I'm picking a this review because it's awesome. I fibbed! My friend Laura read it!"}, {"userName": "karen", "userReviewDate": "Jul 07, 2016", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "after seeing the news on mel's review: https://www.goodreads.com/review/show...i figured i would help spread the word, too, because this book could definitely use an award. if you agree, vote for it here: https://www.surveymonkey.com/r/MB6DT2D”That’s the ending of the story,” he said. “Something broken.”this is a darkly satisfying southern gothic tale of what transpired when a lawyer named autopsy bliss invited the devil to the small town of breathed, ohio in 1984.the problem with extending an invitation to the devil is that he might just accept. and he might not turn out to be the worst thing living in your town.i’d heard nothing but great things about this book here on goodreads, and i’d been wanting to read it for ages, but had been TRYING not to buy hardcovers because i am oh-so-poor. so when i was offered a copy by the author, it was like all the book angels answering my book-prayers.as it turned out, the delay was a blessing, and the timing could not have been better - nothing beats finishing a book taking place during a horrible heat wave on the day a blizzard hits, and i loved every sweaty bit of this.the story itself is fantastic, but the getting there might not be for all readers. much like one of my favorite books, The Book of Night Women, in order to appreciate this story to its fullest, you have to completely give yourself over to it. with night women, it’s a dialect thing - you cannot, as a reader, balk at the unfamiliar slang or cadence or you will struggle. with this one, it’s more stylistic - you have to embrace the florid, rollicking prose that is the vehicle for her storytelling and just go with it, or it’ll quicksand you. the character names are bananas (in a good way), and the writing is overblown and turgid as hell (in a mostly good way). her style is completely her own, and like many debuts, her prose occasionally gets away from her, but when it succeeds - and it succeeds more often than not - it is the perfect way to tell this tale; its words swelling and running rampant in the humidity; the ribbons in a woman's hair indulgently described:The way they wove, they could sometimes look like slithering in an undergrowth. It was as if she were the infected Eden, the snake still turning through Eve.. the less-successful flipside to this indulgence are the few instances written more for the reader's benefit than what would be natural for the characters. for example:”How do you say this place?” he asked.“Whatcha mean?”“I mean, the name of the town. How do you say it?”“Oh, well, most folks think it’s pronounced like the past tense of breathin’. You know, like you just breathed somethin’ in. But it’s not like that at all. Say breath. and then ed. Breath-ed. Say it so the tongue don’t recognize such a large break between Breath and ed. Breathed.”is that how a thirteen-year-old boy would answer a simple freaking question? probably not, but you’re in this world, with these characters and my advice to you is to go. with. it.because it’s worth it, for all the beautifully-written parts like this:”…the thing about breaking something that no one much thinks about is that more shadows are created. The bowl when intact was one shadow. One single shadow. Now each piece will have a shadow of its own. My God, so many shadows have been made. Small little slivers of darkness that seem at once to be larger than the bowl ever was. That’s the problem of broken things. The light dies in small ways, and the shadows - well, they always win big in the end.”each chapter opens with a fragment of milton’s Paradise Lost, the original apologist for the devil. and the devil who ultimately answers autopsy’s invitation comes in the shape of a thirteen-year-old green-eyed black boy named sal, who befriends autopsy’s son fielding and is one of the most sympathetic characters in this town of breathed. (that’s 'breath-ed', folks)if the the problem with extending an invitation to the devil is that he might just accept, the problem with a sympathetic devil is one of accountability - if the devil is a likable little boy, he becomes less useful as a scapegoat for that brand of “the devil made me do it” washing-off of personal responsibility, and the evils of the world are revealed to be either directly due to human failings or unfortunate accidents that often result from these failings: fear, prejudice, misunderstandings, pain, revenge.not that everyone will see it that way - the scapegoat is a very tempting place to lay the blame, and no one wants to confront the uncomfortable realization that evil was already simmering in the town before the devil showed up. and there's evil aplenty, from relatively small transgressions like infidelity to much, much bigger ones.it’s a dark book told in a beautiful way - split between the events of that summer and the adult life of fielding bliss in the years following. the 1984 parts are wonderful - sad and chewy and wrapped up admirably. the reveal of the significance of sal’s birthday gift to fielding’s mother stella is a heartbreaker, and the ice cream reveal even more so. and granny… dear lord, granny… there’s less resolution to the adult fielding’s story, which was a little disappointing, but the quote i opened the review with kinda sums it all up:”That’s the ending of the story,” he said. “Something broken.”a fantastic debut and i want more..."}, {"userName": "Pouting Always", "userReviewDate": "Mar 08, 2017", "userURL": "http://www.goodreads.com/user/show/48650982-pouting-always", "userReview": "I really really loved this book. I know people didn't like the metaphorical writing but I always have been a sucker for poetic writing. I like when books make me question the way I think about things and I enjoy symbolism and when things are woven so intricately with the plot line. Like the story is just so well woven and elegant and the author just expressed things so eloquently. It all just fit together so perfectly and I really felt affected when reading the book. Definitely a favorite."}, {"userName": "Dan Schwent", "userReviewDate": "Jul 15, 2016", "userURL": "http://www.goodreads.com/user/show/870755-dan-schwent", "userReview": "During a heat wave in the summer of 1984, Fielding Bliss's father invites the devil to town. When a 13 year old boy shows up claiming to be the devil, the Ohio town of Breathed will never be the same again...I passed on this when I originally saw it on Netgalley, mostly because of Autopsy Bliss's name. Seriously? Autopsy? Anyway, Tiffany McDaniel emailed me a review request, mentioning how hard it was for first time authors to get reviews, and I caved in after my Grinch-like heart grew two sizes.I honestly had no idea what to expect with this but I knew I'd struck gold right away. I read a lot of books where the prose is nothing spectacular. I could tell this one was special from the first paragraph or so. The Summer That Melted Everything is Paradise Lost written by Flannery O'Connor, a southern Gothic tale with the power of a hurricane. It's a tale of families, racism, religion, small town mob mentalities, the evil that people hold in their hearts, and a lot of other serious themes.The Summer That Melted Everything is Fielding Bliss' fall from grace, from being an optimistic 13 year old to be a broken adult decades later. The devil's arrival, Sal's arrival, turns his life upside town.The Bliss family and their relationship with Sal fuels the narrative. Fielding Bliss and Sal are fast friends. Sal, devil or not, is wise beyond his years. Father Autopsy is a lawyer and mother Stella is a homemaker who is afraid to go outside. Brother Grand is good at everything, seemingly the boy every girl wants to be with. Sal's arrival changes all of them irrevocably.There is a lot of emotional packed into this book and it sure dredged up some emotions in me. The part with the dog was just the tip of the emotional iceberg. It's thought provoking and has some serious weight to it. As I wrote earlier, it reads a lot like Flannery O'Connor and I felt wrung out after reading it.The building hysteria of the townsfolk toward Sal reminds me of Needful Things a bit. I had no idea how the book would end but I knew it would be comparable to the destruction of Castle Rock. And it was. The last 20% was like watching the end of Old Yeller four or five times.The Summer that Melted Everything is a first novel that reads like a lost classic. A bleak, emotional classic. Five out of Five stars. Note: You can read my interview with Tiffany McDaniel here."}, {"userName": "Nat", "userReviewDate": "Jun 22, 2016", "userURL": "http://www.goodreads.com/user/show/23381142-nat", "userReview": "“Don’tcha wanta live forever?”“I’m the devil. I am already forever.”Fielding Bliss has never forgotten the summer of 1984: the year a heat wave scorched Breathed, Ohio. The year his father, Autopsy Bliss, invited Breathed’s own devil.“Dear Mr. Devil, Sir Satan, Lord Lucifer, and all other crosses you bear,I cordially invite you to Breathed, Ohio. Land of hills and hay bales, of sinners and forgivers.May you come in peace.With great faith,Autopsy Bliss”And on a particularly warm day in June 1984 (side note: I love it when a book is set in the same month period as when I’m reading it), our main character meets said devil.“Are you sayin’ that you’re the devil?”“It is not my first name, but it is one of them.” He reached down to scratch his thigh. It was then I noticed the denim was worn at the knees more than anywhere else. Over top the wear were layers of dirt, as if kneeling were all the time for him.“You’re lyin’.” I searched his head for horns. “You’re just a boy.”His fingers twitched. “I was once, if that counts.”Sal seems to appear out of nowhere - a bruised and tattered thirteen-year-old boy claiming to be the devil himself answering an invitation.To say that this book has an unique premise is an understatement. It’s unlike anything I’ve ever read, and I simply loved every second I spent reading The Summer That Melted Everything.I definitely took my time with this book in order to savor each and every word. It all felt so crucial to the flow of the story.I also have to mention the writing, but I feel like no words of mine will do enough justice to capture its beauty. Tiffany McDaniel created such an atmosperhic, eerie and whimsical read— I’m seriously at a loss for words.Here’s one instance in particular that captures the writing perfectly:“I cleared my throat and introduced the boy by naming him the devil.“Fielding, I didn’t quite hear you correctly.”“I said devil, all right.” I shifted the bag of groceries to my other arm as Elohim drew down the porch steps, slow and at a slant like he was walking in a large gown that he had to be careful not to step on the edge of lest he fall.”That last sentence has just such a wonderfully specific description.Also, I loved how clever it was that the neighbor’s name was Grayson Elohim (his last name meaning God in Hebrew).And I really want to mention another instance I loved, because I’m weak, and the writer’s words are magnificent:“The days … they’ve been blurring together.”“Just hang a calendar on your wall.”“The walls of hell are not like other walls. I tore a picture of the ocean out from a magazine and hung it on my wall once. An ocean is a good life place. Everyone always seems happy there. And for a moment, I was happy with my picture, but then the blue sky turned gray. The waves, once calm, took a turn to rage. Then came the screams. As I looked closer, I saw the screams came from men drowning in the water.”How does one make words work this beautifully???Also also, the familial relationships in this book were spectacular. I kept wanting to delve deeper and know more about each family member— and it all started with the grandma (whom I loved), she was such a unique addition:“Autopsy is an acutely strange name for a man to have, but his mother was an acutely strange woman. Even more, she was an acutely strange religious woman who used the Bible as a stethoscope to hear the pulse of the devil in the world around her.The sounds could be anything: The wind knocking over a tin can. The clicking of rain on the windowpane. The erratic heartbeat of a jogger passing by. Sometimes the things we believe we hear are really just our own shifting needs. Grandmother needed to hear the spook of the snake so she could better believe it actually existed.”And her son (Fielding’s father) was just as compelling to read about:“I always thought he had too demanding a job for someone like him. We are all sensitive to a degree when it comes to the great terrible things in the world, but he was torn apart by them.Some cases affected him more than others, like the one with the little girl who was beaten to death by her addict parents. He’d stare at those bloody crime photos over and over again, long after he put the parents away. Then one day he said he was going out.He drove a few miles outside of Breathed to a roadside bar and said the types of things you should never say to a biker gang. He was in the hospital for six weeks. When I asked him why he did it, he used his one good hand to write I wanted to see for myself on a pad of paper because his mouth was wired shut.His jaw would heal, as would his swollen eyes, cracked ribs, and broken kneecap. The bruises would go on their way, the blood would stop lifting to the surface, and his arm would eventually come out of that cast. But he’d still have the scar at his hairline where the beer bottle was broke. He never tried to hide this scar. He’d brush his thick brown hair back so there’d be no chance of not seeing it. He did just this as he strolled between me and the boy.”I keep thinking about this part. The “I wanted to see for myself” gets me every time.I’ve never encountered such a dynamic father figure in a novel before this one. To borrow Sal’s phrasing, “Compared to him, it’s as if all other men are homeless dogs that bed in the mud.”And his quintessential wife (Fielding’s mother), Stella, was that more intriguing.“If you wanta see her, you’ll have to go to her. Porch is the farthest she’ll come.”“Why?”“She’s afraid of the rain.”“It’s not raining.”“Naw, but it might start.”“She had that tendency to be overaffectionate. It was almost like a nervous tic. It was the staying in the house that did it. She thought if she loved you enough, you’d never want to leave her, and then the house wouldn’t seem so lonely as it could be to her at times, when it was just her and the vacuum.”And their oldest son, Grand (Fielding’s brother), was the very meaning of his name.“Something about his eyes made me think of Russia. Perhaps because they were so large, the largest country in the world of his face. Then again, knowing what I know now, maybe it was because his eyes were so like matryoshka dolls, hiding the real him within boxes of lacquered mystery. You’d open one box and find another just the same. No matter how many boxes you took away, there was always one more.Because I told him his eyes were Russian, he decided to learn the language and would at the most unexpected times drop Russian words in a saline accent Tolstoy would have praised, for an Ohioan at least.”I just love it when books feature close siblings and Fielding was, like he mentioned, as in love with his older brother as any young boy could be.The whole family gave off such an incredibly intimate feel and leaving me, once again, at a loss of words.However, when the focus shifted from the family and instead refocused on the devil and the mystery surrounding his crimes, I felt a tiny bit let down. I personally felt more invested in the Bliss’ lives than in the conundrum that is the devil.“Being the devil made him a target, but it also meant he had a power he didn’t have when he was just a boy. People looked at him, listened to what he said. Being the devil made him important. Made him visible. And isn’t that the biggest tragedy of all? When a boy has to be the devil in order to be significant?”But with an unbearable heat wave in town, tensions rise and strange accidents start to occur that put the Bliss family head to head with their own personal demons. Common sense was starting to melt away.“People always ask, Why does God allow suffering? Why does He allow a child to be beaten? A woman to cry? A holocaust to happen? A good dog to die painfully? Simple truth is, He wants to see for Himself what we’ll do. He’s stood up the candle, put the devil at the wick, and now He wants to see if we blow it out or let it burn down. God is suffering’s biggest spectator.”The above passage has been integrated into my heart because of its beauty and understanding.Just… everything was told in such an astonishingly vivid way. Seriously, the amount of quotes I’ve written down from the book into my own notes is a tad excessive.Simply put, I didn’t want this book to come to an end— so much so that I even reread the first chapter. And now I cannot wait for what Tiffany McDaniel will write next.ARC kindly provided by the author in exchange for an honest review.*Note: I'm an Amazon Affiliate. If you're interested in buying The Summer That Melted Everything, just click on the image below to go through my link. I'll make a small commission!*\nThis review and more can be found on my blog."}, {"userName": "Elyse", "userReviewDate": "Nov 14, 2016", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "Ok....update: A SMALL REVIEW ... but read OTHERS. This community has written amazing ones!!! I'm changing my vote -- SO FAR....( still waiting to read The Nix and The Gentleman From Moscow)... but as of today....I vote this book ( of books I've read) , BEST FICTION in the Goodreads voting. Review:\"Why, upon hearing the word 'Devil', did I just imagine the monster? Why did I fail to see the lake? A flower growing by the lake? A mantis praying on the very top of a rock?\" \"A foolish mistake, it is, to expect the beast, because sometimes, sometimes, it is the flowers turn to own the name\".There is a level of sadness in this book ----fear and despair----grief ----loss---mourning----bereavement----leaving everyone vulnerable as though sorrow is the price of life itself. The last 20% or so of this book is where I almost couldn't breathe. It's a huge section of the entire novel's power....taking us deeper into an emotional state of a combination of tears and numbness. \"The Summer that Melted Everything\" includes childhood charming dialogue, warmth, family bonds, friendship, humor, compassion, and mystery in the beginning pages ---Then the story begins to shift - suffering and scars surface. The book touches on AIDS, homophobic, racism, and violence. Innocence is lost to hatred and bigotry. The beautiful writing is a gift.....contributing compassion between good and evil in our world. Very powerful. One of the best books I've read this year! Thank You *Dan*...( your encouragement made a difference!!!) ..... and to the many friends in this community who read this before me - and wrote some of the most gorgeous heartfelt outstanding reviews... one would ever want to read about any book! HIGHLY SUGGESTED! Worth every penny! It was 'my' mistake when I was sooo sure I wouldn't care for a book about a devil ... I had never wanted to read it --- even though I kept seeing high rating reviews. I was wrong. THIS IS AS POWERFUL - and EXCEPTIONAL as readers have been saying!!!!AMAZING!!!!!!!!!!!!!!!!! will write review later! Back into my reading cave for now!There are already FANTASTIC reviews of this book............INCREDIBLE!!!!!!!!! It wasn't anything I thought it would be ---(the book I most resisted reading all year)!A thousand times BETTER!!!"}, {"userName": "Larry H", "userReviewDate": "Jul 01, 2016", "userURL": "http://www.goodreads.com/user/show/5872506-larry-h", "userReview": "I'd rate this 4.5 stars.It's the summer of 1984 in the small town of Breathed, Ohio. Fielding Bliss is a fairly typical teenager until the day his father, Autopsy (is Autopsy Bliss not one of the best character names you've ever heard?), the town's prosecutor, puts in the newspaper an invitation for the devil to visit Breathed.\"If the devil was going to come, I expected to see the myth of him. A demon with an asphalt shine. He'd be fury. A chill. A bad cough. Cujo at the car window, a ticket at the Creepshow booth, a leap into the depth of night.\"Imagine Fielding's surprise when a tattered-looking young boy arrives in town, claiming to be the devil. It seems hard to believe, and many think the boy, who calls himself Sal (\"From the beginning of Satan and the first step into Lucifer. Sa-L.\"), is probably a runaway or a kidnap victim, not the devil himself. But he brings an unending heatwave to town, and suddenly, disasters begin to occur in his presence, although no one is quite sure whether he is causing the incidents or if it is people's reactions and fears that are to blame.It isn't long before Sal becomes an integral part of the Bliss family, but their fellow Breathed residents are less than enamored of this fact, as they get riled up by a neighbor and former friend of the Blisses. As the heatwave continues ceaselessly, tempers flare, damaging insults are hurled, friendships end, rumors are spread, and Fielding finds himself suddenly confused by his family. Sal continues to maintain that he is the devil, and he brings about changes in people willing to talk to him, leading them to self-discoveries that change their lives. And as Fielding uncovers secrets his family and others hold, he knows he should react a certain way, but instead he acts like a typical teenager, which only adds fuel to the fire. So many things happen that remain unmentioned by his family, and this lack of discussion causes even more hurt and harm.\nThe Summer That Melted Everything\n is utterly mesmerizing, and it took me by surprise just how much it touched me. It's a book touching on powerful issues—racism, homophobia, fear of AIDS, agoraphobia, child abuse, religion—yet it never seems heavy-handed or preachy. This is a tremendously moving book; while much of the plot may not be surprising, Tiffany McDaniel did such a great job giving complexity and heart to her characters that you can't really distinguish which characters you should root for and which ones you should view as villains. I completely understood what motivated everyone to act the way they did.The book is narrated by a much older Fielding, who reminisces about that life-changing summer, and the scars it left him with throughout his life. At times it was hard to distinguish when the plot was unfolding as it happened and when Fielding was recounting memories of other times in his life, and the emotional trauma Fielding suffered makes his older self a fairly unsympathetic character periodically. But when the story is fully told, much of his motivation becomes clear (although some plot twists confused me a little).I've often commented that I read from a place of emotion, and if a book is well-written and it touches me emotionally, it resonates for me more than one that does not. It will be a long time before I'll be able to get \nThe Summer That Melted Everything\n out of my mind. This book might not be for everyone, but if you open your mind, you'll be affected and moved.Tiffany McDaniel, NetGalley, and St. Martin's Press provided me an advance copy of the book in exchange for an unbiased review. Thanks for making this available! See all of my reviews at http://itseithersadnessoreuphoria.blo...."}, {"userName": "Debbie", "userReviewDate": "Sep 11, 2016", "userURL": "http://www.goodreads.com/user/show/8665845-debbie", "userReview": "This is just me, this is just me, so hold your horses! I’m not saying that this isn’t a brilliant work of fiction—it certainly is. I’m just saying it’s not for me. First, we have a devil dude as the hero. I can maybe handle a devil if I open myself up to magical realism, which is tough, but I can do it if I try really hard. But I have a cow if a book is full of the word “god,” and here it’s all over the place. I mean it seems like the name came up a million times. I know the book is not trying to convince us of the goodness of some higher being, since so many terrible things happen. And I know that one of the things it’s trying to show is the super scariness of mobs that go on witch hunts. I just really don’t like a book whose characters are god-fearing folk. Which also leads me to say that I don’t like folksy either, and there’s a lot of that in Breathed, Ohio.Here’s a sample:“I feel bad for ‘em, I really do, but some say it’s God punishin’ ‘em for their lifestyle. Maybe He is, punishin’ ‘em. . . . It makes ya think maybe God is tellin’ ‘em to stop coming’ together. Maybe He’s tellin’ ‘em to stay apart.” She patted the sides of her neck. “Lordy, this heat has a fury, don’t it?”So while I stand here at my Complaint Board, I might as well finish it up right now. We all know I want to. Okay, besides the devil and god driving me nuts, oh, and let’s not forget the god(!)-awful folksiness, the Southern dialect got on my nerves. Along with the dialect comes the bad grammar, like “how did you like them apples”? Of course it hurt my editor ears, but I can get into the swing of things if it seems realistic. Here, the problem isn’t just the bad grammar but the fact that the narrator only uses it sometimes. Most of the time, he sounds like this erudite storyteller. Does he have bad grammar or doesn’t he? This all brought me to a big a-ha moment: I don't like Southern fiction! Or Midwest fiction or whatever it is. (The story actually takes place in Ohio even though it feels like the South.) And I didn't even know I didn’t like Southern or Midwest fiction until the dialogue and folksiness and God stuff all started bombarding me at once. I winced in pain.The other big thing that turned me off was that this book is chock full of parables. Again, sort of an a-ha moment for me—I really hate parables. It felt like the author wanted to sit me down and teach me a thing or two about life. I’m always up for learning, but please don’t shove life lessons down my throat. Sometimes there was wisdom being thrown my way, and I accepted it happily, but usually I was very conscious that I was there to learn an important lesson. I just resent the hell out of that learning format.Although the language was very rich, it was a little too rich for me. I’d find myself having to stop and contemplate too often. This isn’t a bad thing, but it made it a hard and slow read. I thought sections could be great stand-alone pieces, long prose poems maybe. But since I had signed up for a novel, I wasn’t loving the interruptions to the plot. I wasn’t dying to pick up the book, because I knew I’d have to think too hard. Call me lazybones, but it really did make my head hurt.One more small complaint and then I’ll walk away from the Complaint Board, I promise. There are these Russian words written in the Russian alphabet scattered throughout, but super infrequently. So infrequently, that at one point I decided they were typos—someone during Kindle production must have occasionally hit the wrong alphabet set. Right when I was reminding myself to send a note to the Kindle people when I finished the book, one of the characters asks another character what was up with the Russian words. What??? What are Russian words doing in the middle of a Southern or Midwestern novel? This is just all wrong. I suspect the writer did this to add some weirdness to it, and weird it was, but it’s pretty bad when you think the book has font problems and it doesn’t.Okay, now I am staring at the Joy Jar. The language, oh the language. To die for. Truly, the writing is phenomenal. There are paragraphs that I could read over and over (not any of the paragraphs that say God God God of course). The author has a very bizarre and cool way of seeing things, and the metaphors just slayed me. The author is so original, so creative, I was in awe. Even the names were fun: The dad was named Autopsy. The brother was named Grand.Here are some sample goodies:“He was more field than town. More old soul pasture than adolescent attitude.”“…there is no hope to be had. Hope is just a beautiful instance in the myth of the second chance.”“My hands were still shaking, little vibrations as if they were being chewed on by gnats.”“He stood there, watching me scratch my chin through my beard. I stopped because he began to look worried I may have fleas.”“Old Fedelia’s way to cool down was by licking her forearms. There she’d be, the shades of her eyes pulled half closed, her tongue amphibiously long and aggressive. ‘Kangaroos, you stupid boy. Kangaroos.’ Her amber eyes lit with rage as she shook her forearms at me when I asked why she licked them.”“Because of him and the anger she held onto, her features reached home to their bones, causing cave and shadow.”Besides the language, the plot was juicy, if not sad, dark, and strange. I really do love dark and strange. And there are some hefty issues happening here—racism, gayness, AIDS, mob psychology, good vs. evil, sibling love. The characters were well-drawn and complicated.The story is told by a strange old man who is looking back to a sweltering summer in 1984. Occasionally, we see him in the present, and we learn why he is who he is. The author really made this narrative style work.I tried, I really tried. So many of my trusted Goodreads friends just loved this book, I wanted to be part of the crowd. But, hey, look--my Complaint Board is way fuller than my Joy Jar. So 3 stars it is. But as I said at the start, it’s just me. I have trouble with God and devil stuff, parables, and folksy. I’m thinking most readers will scarf it down in glee."}, {"userName": "Perry", "userReviewDate": "Aug 10, 2016", "userURL": "http://www.goodreads.com/user/show/6354112-perry", "userReview": "Gomer-ic Dirge: Stereotypes Stuck in Purple Prose I wanted to hear the water go down the drains so I wouldn't have to hear myself doing the same.  Gloom, despair and agony on me. Such eye-rollers fill this novel.A man named Autopsy Bliss (no joke) writes a letter to the local newspaper in the summer of 1984 inviting the Devil to the rural southern Ohio town of Breathed (pronounced \"Breath Ed\"). A few days later, a 12-year-old African American boy shows up saying he is Satan, replying to the letter. Autopsy's son Fielding narrates the novel and, at thirteen years old, reminded me of the naiveté of Opie in the 1st year of \"The Andy Griffith Show.\" This is the novel's only character who the author develops in any respect, but unfortunately into a mawkish tragedian who sees each moment as doomed and speaks in mushy hyperbole, so overwrought it sometimes approaches hilarity, e.g., \"the only thing longer were his fingers, which were tall and grasslike when his hands were up. Perhaps that's why his palms were always a bit moist. They were the wetlands and his fingers the bulrushes that grew at the edges of them.\" Besides the young runaway who refers to himself as \"the Devil,\" the remaining denizens of Breathed constitute the largest collection of shallow stereotyped characters of any novel I've read. The mother is a gullible dimwit home maker, the novel's two gay men, a 16-year-old boy and a reporter in his late 20s, rush to the woods immediately upon discovering each other, and the entire remainder of the cast is a town full of white Southerner stereotypes, the most racist, uneducated, idiotic, hateful, homophobic, simple, alcoholic, xenophobic, child-beating, wife-beating, slobbering hillbillies, rednecks, hicks, yucks and bubbas, mostly straight out of 1960s news footage.Paint by numbers character traits, reminding me of this exchange from the film \"Do the Right Thing,\":  Mookie: Dago, wop, guinea, garlic-breath, pizza-slingin', spaghetti-bendin', Vic Damone, Perry Como, Luciano Pavarotti, Sole Mio, nonsingin' motherfucker.Pino: You gold-teeth-gold-chain-wearin', fried-chicken-and-biscuit-eatin', monkey, ape, baboon, big thigh, fast-runnin', high-jumpin', spear-chuckin', 360-degree-basketball-dunkin' titsun spade Moulan Yan. Take your fuckin' pizza-pizza and go the fuck back to Africa.Stevie: You little slanty-eyed, me-no-speaky-American, own-every-fruit-and-vegetable-stand-in-New-York, bullshit, Reverend Sun Myung Moon, Summer Olympics '88, Korean kick-boxing son of a bitch.Officer Long: You Goya bean-eating, 15-in-a-car, 30-in-an-apartment, pointed shoes, red-wearing, Menudo, mire-mire Puerto Rican cocksucker. Yeah, you!Sonny: It's cheap, I got a good price for you, Mayor Koch, \"How I'm doing,\" chocolate-egg-cream-drinking, bagel-and-lox, B'nai B'rith Jew asshole. These offensive stereotypes display at best laziness and/or, worse, an ignorance of the flaw and falsity inherent in casting a dark net over an entire category of people.If not offended by the novel's across-the-board drawing of its characters and lack of any development, one might be nauseated by the overwrought writing in repeated use of maudlin metaphors, syrupy similes, hokey analogies and pathetic puppyisms, such as \"I wanted to hear the water go down the drains so I wouldn't have to hear myself doing the same.\" Or, \"something about his eyes made me think of Russia. Perhaps because they were so large, the largest country in the world of his face.\" The novel seems to be Ms. McDaniel's attempt to throw into her debut novel every social ill and negative character trait she had stowed away in her idea file over the years. She proceeds to bestow this surfeit of social subjects with the sappy, sensationalist treatment. In The Summer that Melted Everything, I count sixteen: teen suicide, homophobia, animal cruelty, prejudice against the handicapped, major depression, cuckoldry, religious bigotry, achondroplasiaphobia (a fear of short people), sexual promiscuity, psychological fears, xenophobia, alcohol abuse, AIDS, mass suicide, mob mentality and, as mentioned above, racism. Few novelists, even those much more experienced than Ms. McDaniel, are capable of adequately exploring even half of these in the same novel. While writing stories addressing social evils is admirable, dilution to such a degree results in scant social messages that come across as overly didactic and pedantic. If you choose to read it anyway, Gloom, Despair and Agony on You."}, {"userName": "Cheri", "userReviewDate": "Jul 16, 2016", "userURL": "http://www.goodreads.com/user/show/106692-cheri", "userReview": "Breathed, Ohio is a small town in southern Ohio, in the Appalachian foothills, bordering West Virginia and Kentucky. Fielding Bliss is 13 years old, his brother Grand will be leaving for college soon enough, his father, Autopsy is an attorney, and his mother is a stay-at-home mom, literally. She used to go places, but it’s been years since she’s left the shelter of their home. “I once heard someone refer to Breathed as the scar of the paradise we lost. So it was in many ways, a place with a perfect wound just below the surface. It was a resting in the southern low of Ohio, in the foothills of the Appalachian Mountains, where each porch had an orchard of small talk and rocking chairs, where cigarette tongues flapped over glasses of lemonade.”The heat wave that accompanies Sal (Sa from Satan, L from Lucifer) is sudden, intense, not invited, or welcomed. Sal is welcomed only by his new friend Fielding, who recalls the invitation his father issued to the Devil to come to Breathed, Ohio. Tempers rise as disasters befall the townspeople, accusations are flung, and fingers pointed in the direction of the Sal.“The heat came with the devil. It was the summer of 1984, and while the devil had been invited, the heat had not. It should’ve been expected, though. Heat is, after all, the devil’s name, and when’s the last time you left home without yours?”There’s so much more to this incredibly moving debut novel than meets the eye with these few words that tell you what it’s “about.” Bigotry in all senses, sexual preference, skin color, abuse, child abuse, HIV/AIDS, aging… and living. Just the day to day of living seems both precious and tenuous in Breathed in 1984. Tiffany McDaniel does such a tremendous job giving life to her characters. You’ll see, maybe even care for these people, you’ll see how their past makes someone capable of hurting another. How their fears can cause such pain for others. Can love conquer fear?Read this."}, {"userName": "Emma", "userReviewDate": "Jun 01, 2016", "userURL": "http://www.goodreads.com/user/show/28602001-emma", "userReview": "An incredible novel, genuinely different from anything I've read before. I've taken a few days to think about this book before writing a review. It's one of those novels that haunt the mind by asking the kind of questions that cut straight to the heart of who you are. Despite the 80s setting, the themes are so relevant, so pertinent that it made for an extremely uncomfortable read. Racism. Homophobia. Mob mentality. Religious extremism. Just when you are busy congratulating yourself that you don't live in a small town in 80s America, you remember the news over the last few weeks and it occurs to you that things haven't changed all that much. People haven't changed all that much. After hitting you hard with the story within the pages, the book follows it up with this lasting taste of human behaviour. All I can think about since reading it is that quote from Gandhi about being the change you want to see in the world. I hope everyone who reads this asks themselves: what would I do?The language is fundamental to the story; the originality of expression is that of a master wordsmith, not a debut author. It is difficult, layered, and complex; providing a stark contrast to the simplistic language of hate the forms the darker currents within the novel. The single words used to embody an entire doctrine of superiority and negation: Faggot, demon, devil, black, nigger. At the same time, there are so many quotes that seem to say so much about the world, but that are also specific to the singular time and space of the novel. I put the book down many times to think about what was said, to roll it around in my mind and even say it out loud. The dichotomy between language and theme was both jarring and beautiful. So did the Devil really accept the invitation to go to Beathed? It hardly matters, it is our free will that makes us who we are. In any case, if we all chose to act like the community of this small town, the Devil would soon be out of a job. It just goes to show that when it comes to horrible acts of violence, us humans don't need any help.My heartfelt thanks to Tiffany McDaniel, St. Martin's Press, and Netgalley for this copy in exchange for an honest review."}, {"userName": "Mel", "userReviewDate": "Jul 19, 2016", "userURL": "http://www.goodreads.com/user/show/10697179-mel", "userReview": "Reread 2017 - 5 stars.Tiffany McDaniel has done something truly unique with this novel. As a debut novel (though I know from conversations I've had with her that this is not the first book that she's written, just the first published) she is able to do something that has not happened to me very often in my reading life. She has made this feel like I'm not reading. This has never felt like a book for me, this has felt like something I've lived. Like something someone I love has lived. This has felt real, and has felt pure and raw and everything that one wants a book to make you feel. This lived up in a reread, and this hurt just as much the second time, if not more, since I knew everything that was coming. There are so many beautiful poetic lines, philosophical questions, beautiful thoughts that made me want to stop reading and just think about them. I will cherish this book for the rest of my life and I cannot wait to visit it again in the future.------------------------------------------------I also did a video review on my booktube channel! https://www.youtube.com/watch?v=n4wwi...I forgot to mention that the author contacted me to review this book and I did so honestly!GUYS. This book was amazing.It's kind of funny because when I read the blurb for this book, all I read was that the Devil comes to this Southern USA town and I knew I wanted to read it. I don't read blurbs often so I didn't read the rest, but just that one or two sentences was enough for me. But the book is about so much more than that. It's about a loss of innocence. It's about families and communities and friendship and sibling relationships and romantic relationships. It covers race issues and LGBT issues and even different than usual psychological issues. And the book does them all WELL. It does not overload you with content, it has a really nice balance. The characters in this book are absolutely so well written. Many times throughout the novel I found it impossible to believe that she was a debut author because this was so well written. Sal, Fielding, Grand, his parents, Elohim, all of them were just so fleshed out. They were complex and complicated, filled with so many feelings and backstories and conflict, and yet they were simple. Prone to human desires and human feelings that everyone feels. Throughout the novel it was hard to see who the villain was. There were obvious villains, but there were moments where I questioned who was bad and who was good. But then I realized that that was the brilliance of the way the author wrote these characters, they were human, they were flawed and could be both bad and good. I loved the setting of the story. I loved this small southern town where it was incredibly hot all summer. There were times when just the descriptions of the heat made me feel like I was experiencing it with them. I could picture this town and all its inhabitants perfectly because it was a simple, yet elaborate, setting. Overall, there's just not enough praise I could give this book. I may have had problems with the book, if I did I honestly don't remember them as by the end I completely had forgotten them. If I had issues, they clearly weren't important. This book broke my heart. It made me feel angry, upset, and even, although rarely, happy. I feel like I lived through this book with the characters and that's not a small thing for me to say. As a debut novel this is amazing, as a novel in general this is still amazing. Tiffany McDaniel definitely has a reader in me for life because I just loved everything about this book so much. Around The Year in 52 Books Challenge #18 - A book on a summer/beach reading list"}, {"userName": "Liz", "userReviewDate": "Apr 18, 2017", "userURL": "http://www.goodreads.com/user/show/4125660-liz", "userReview": "What a weird, strange, engrossing book this is. It defies description. Beautifully written and with ideas that will have you thinking for days. Like the idea that hell is a place without Hope or that the devil prays for forgiveness. But the story itself grabs you. Is this young boy truly the devil? I love that the author chooses 1984 as the year the novel takes place. The book constantly harkens back to Orwell’s novel with its groupthink and ideas of “truth”. But it's also a book that fits with the current times and the hate currently enveloping the country. It's not a story that ends well. If anything, the book shows that hell is often right here on earth. But despite the sadness this book evokes, I heartily recommend it."}, {"userName": "Diane S ☔", "userReviewDate": "Jun 27, 2016", "userURL": "http://www.goodreads.com/user/show/4159922-diane-s", "userReview": "The first thing I noticed when I started reading this novel was the tone, the writing. Southern gothic in Southern Ohio? Okay, I can go with that. Know little about Southern, Ohio so maybe it has more Southern in it than I thought. Takes place over the course of a single summer, a summer with an unprecedented heat wave, a summer that will change forever a family and the people in this town. The summer a devil appeared in answer to an invitation tendered by Autopsy Bliss. A devil that appears to be a young black boy.Narrated by a now elderly Fielding Bliss, same age as said devil, son of Autopsy who wrote the ad, a man who has not enjoyed life, but when you read this book one can certainly understand why. This book is dark, darker than dark and anytime a little light, a little beauty shines through you can be sure there is more darkness to follow. Yet, it is this very darkness that makes an impression, makes the book memorable. A town who believes that everything bad that happens is the fault of this young black boy, the devil. A town whose people will act against common sense and their very own nature to become something horrible. A young man struggling with his own sexual identity will come smack against the AIDS epidemic. A young Fielding forced to watch as his family and his life falls apart. I can't say I enjoyed this book, but it made a deep impression. Gorgeous writing. Lines that make you think. One in particular I can't seem to let go of. Paraphrasing, Fear, is the first shadow of ignorance.\" Covers so much of what happens in this novel and I find it applicable in the present, sadly in my own country.ARC from Netga'ley."}, {"userName": "Lola  Reviewer", "userReviewDate": "Nov 02, 2016", "userURL": "http://www.goodreads.com/user/show/14596170-lola-reviewer", "userReview": "What an atmospheric book.But don’t think that because it’s atmospheric, it’s necessarily wonderful, in the traditional sense of the word.In fact, this is a very melancholic story. What is ‘‘wonderful’’ about it, though, is how the author pieced the story together.We follow Fielding when he is a young teen and meets Sal AKA the Devil, but we also meet him at different points in his life – when he is a new adult, a middle-aged man and even a grandparent’s age!Multiple people have mentioned this already, but this is not a happy book. I don’t know what you’re expecting out of it, by reading the blurb, but I hope it’s not humour, adventure or romance, because this is not what this is about.Some of the things that make this book more ‘‘unhappy’’ than ‘‘happy’’ is all the discrimination against people of color and LGBT people that is represented (in good context), as well as Fielding’s personality later in life. He is not the same Fielding he was in his teen years. Not at all.And so, as I was reading the story, I kept wondering: Why? Why has he changed so much? What made him so cynical and negative and a little bit (very) crazy?Like I said, the way the author pieced the story together is one great thing about this book. We may go back and forth in time, but our attention never falters. On the contrary, because it makes us ask questions, it keeps us invested in the story.Also, only FYI, there is no ‘‘plot’’ exactly, a little bit like ‘‘Aristotle and Dante Discover the Secrets of the Universe’’ or ‘‘All the Wonderful Things,’’ so things are not progressing at a fast pace. But go with the flow, because it’s worth it!Blog | Youtube | Twitter | Instagram | Google+ | Bloglovin’"}, {"userName": "Debbie \"DJ\"", "userReviewDate": "Jun 08, 2016", "userURL": "http://www.goodreads.com/user/show/12620745-debbie-dj", "userReview": "Holy moly, this is McDaniel's debut novel? It is my favorite read so far this year, and spoke to me like few books do.It's the 80's and McDaniel starts by reminding us of the hysteria over child abuse at the time. I remember the McMartain trial, the social workers giving children toy dolls, asking leading questions, dooming innocent caretakers as pedophiles. It was also the decade we learned of AIDS, how many believed God was exacting judgement for those who defiled Him. These memories set the stage for her own novel by showing us how hysteria and religious fervor are often all too human, but always lead us down a path of destruction.We are introduced to the Bliss family, and their two sons Feilding and Grand. The younger son Feilding, now 84 years old, narrates the story as he looks back to his 13th year, and a summer that changed everything. His father was the town prosecutor. Always an even-handed man, he begins to wonder, is he really sifting out the \"devils,\" or merely playing god. His desire to know leads him to place an add in the paper, inviting the devil to town. When the devil shows up as a 13 year old boy, and the town is facing its hottest summer on record, tempers begin to flare.I loved how McDaniel took on all the questions that lie at the heart of who we are, and what we believe in. Questions such as where does our sense of morality, good and evil, right, and wrong, come from. This isn't a book questioning the existence of God or the devil, but rather how humans have interpreted both. She carefully weaves throughout many emotions and topics, such as pain and suffering, loss and death, family bonds and homosexuality.What lies at the heart of this novel is mob mentality, how families are shattered through their ignorance, and how one man can affect others to blindly follow him through fear. As McDaniels states, \"It is the inability to choose by our own will that lessens us all. It is disease to our sanity, which  sickens our good sense until we are the victims of choices we would not normally have been in  the company of.\" I was so reminded of our current political situation, and loved this statement as well, \"Fear is ignorance's first shadow\"McDaniel's writing is full of metaphor, and so beautifully written. Even the characters names were brilliant, ones I will never forget. Sometimes it takes a so-called devil to help us see more clearly. I think the novel seeks to show us that love is the only answer that matters in the end. Thanks to NetGally for the early copy in exchange for a review."}, {"userName": "Zoeytron", "userReviewDate": "Jun 25, 2016", "userURL": "http://www.goodreads.com/user/show/12656534-zoeytron", "userReview": "Copy furnished by Net Galley for the price of a review.Posted in the newspaper, a formal invitation is extended to the devil requesting his presence in Breathed, Ohio. A heat wave ensues, the likes of which has not been seen before in this small town. Tempers flare, bad feelings smolder, hot words bubble from the lips of those who are typically slow to anger. A sort of madness descends, and all common sense melts away.And now, here is a young boy in tattered overalls with a pure love of ice cream and an old soul. Fireflies, the color yellow, a family dented by grief. Everyone wants to be significant in some way, to matter. Who's to say what is good, what is evil? One last poser - is there a chance in the world the devil has a heart?This is an unusual novel, refreshing in its originality, both in the writing as well as the plot. I suspect we can look forward to good things from this author if this debut is any indication."}, {"userName": "Ɗắɳ  2.☊", "userReviewDate": "Sep 19, 2016", "userURL": "http://www.goodreads.com/user/show/12058788-2", "userReview": "[“You know, Fielding, the thing about breaking something that no one much thinks about is that more shadows are created. The bowl when intact was one shadow. One single shadow. Now each piece will have a shadow of its own. My God, so many shadows have been made. Small little slivers of darkness that seem at once to be larger than the bowl ever was. That’s the problem of broken things. The light dies in small ways, and the shadows—well, they always win big in the end.”…“Then there was the strawberry jam I’d believed was blood. It seeped from the broken jars, oozing wide and then tapering as if the way to eternal glory is one long, narrow passage. Maybe that’s why it’s so hard to get there. Our sins widen us until the narrow way is something we can never go through. We have no choice but to languish in the boiling of what’s left, as I have been languishing.”…“THIS IS ME. Teeth marks here. Teeth marks there. Being eaten one bite at a time. I smell myself on my breath. Feel myself swallowed and plopped to my stomach. Clean myself out from my own teeth with a toothpick.”“It was Carl Jung who said shame is a soul-eating emotion. It doesn’t eat you in one big gulp. It takes its time. Seventy-one years, it is still taking its time.I am for my own teeth. I am for my own stomach. I alone eat myself to the dark.”… “ALL LOVE LEADS to cannibalism. I know that now. Sooner or later, our hearts will devour, if not the object of our affections, our very selves. Teeth are the heart’s miracle. That a mouth should burst forth on that organ without throat and crave another’s flesh, another’s heart, is nothing short of a miracle.”…“MADNESS. THE COMPASSING violin when in our head, the directionless chaos when out of it. Isn’t that what madness is, after all? Clarity to the beholder, insanity to the witnessing world. My God, what madness this world has witnessed. What beautiful, chaotic madness.”... “THE YELL IS permanent, the wrong is lasting, the damage is complete, and the goddamn is eternal when a young man goes into the woods and in his fray turns the sword inward.”…“I was so sure of what was evil, of what was good. But then Sal came, and the panther ate salad, and the devil—well, he turned out to be the only angel among us.” (hide spoiler)]"}, {"userName": "Esil", "userReviewDate": "May 31, 2016", "userURL": "http://www.goodreads.com/user/show/3643764-esil", "userReview": "3.75 stars. I'm struggling with my reaction to The Summer That Melted Everything. Set in a small town in Ohio in the 1980s, the story is narrated by Fielding Bliss who was 13 during the summer when the story takes place. It was a ridiculously hot summer, and Fielding and his family welcomed a homeless black teenaged boy who presented himself as the \"devil\" -- aka Sal -- in response to an ad Fielding's father placed in the local paper. Following Sal's arrival, the town and Fielding's family are plagued by a series of nasty events which lead to a growing mob mentality in the town. I won't say more about the story to avoid spoilers. I loved a lot of things about this book: the 1980s time period, the strong sense of time and place, the intensity of how the book deals with a small town's reaction to difference, Fielding's own internal struggles to figure out where he and his family fit in, and Fielding's intense complicated love for his brother and Sal. And the writing at times blew me away -- there are some truly brilliant passages. But at times I really struggled with how this story was told. The narration hovers just above reality, presenting the story more as a myth or parable. I appreciate the skill involved, but I think my brain may be a bit too concrete to be fully engaged or caught up in how this story is told --- at times I found myself struggling with the devil trope and feeling that the story's elusiveness was overdone. Having said that, at other times it really worked for me and I had real moments of awe. This book definitely deserves to be read -- the end especially is brilliant -- but I suspect that the writer's stylized story telling will not resonate with all readers. Thank you to Netgalley and the publisher for giving me access to an advance copy."}, {"userName": "Andrew Smith", "userReviewDate": "Dec 02, 2016", "userURL": "http://www.goodreads.com/user/show/5885760-andrew-smith", "userReview": "Make no mistake, this is a book that’ll suck you in, chew you up and spit out the gristly bits. It’s slow to get going but from the mid-point onward it’s intense, very intense. And the last section of the book might just leave you an emotional wreck. So choose a good day, a happy time, to pick this one up.Set in a small town in Ohio in 1984, we are introduced to the fact that it’s the beginning of the hottest, driest Summer anyone can remember. We meet a family, the parents and their two sons: Fielding, aged 13, and his elder brother, Grand. The father’s name is Autopsy Bliss (yes, there’s a lot of strange names here), a lawyer and a religious man. For reasons I haven’t quite grasped, Autopsy decides to write an open letter inviting the devil to visit this town. And the devil duly arrives, at least he says he is the devil, in the shape of a thirteen-year-old black boy.The town is populated by rather strange folk and the atmosphere feels like that of a place lost somewhere in the 19th Century, so far removed is it from the 1980’s England I grew up in. In fact, the town is so estranged from any other conurbation that after the stock of ice cream is destroyed at the local store it takes the whole of the Summer for it to be replenished. We follow the story of the family and of ‘the devil’ (given the moniker Sam soon after his arrival) through the ramblings of a 71-year-old Fielding looking back on that insufferable season. We know it’s not going to end well, Fielding’s stumbling thoughts and uncoordinated actions make that clear. His memories are not good ones. In all honesty the prose is not entirely to my taste. There are some brilliant lines and some genuine wisdoms that made me pause and think, but there are also long, overblown sections that prompted to to drift off and to lose, temporarily, the thread of the narrative. It didn’t seem to flow in the way the best novels do, but at the same time I retained enough interest to keep me turning the pages. In particular, there were glimpses of Sal’s background that began to piece together the life he’d had before he arrived in the town. I wanted to follow this through, to see where it took me. I’m not sure I was ever totally taken in by events but I can say that towards the end I was totally captivated by the power of the piece. I found it hard to read but impossible to put down. Most reviews I’ve subsequently read are from readers who absolutely loved this book and I’m sure it will capture a good deal of attention. Despite some personal reservations, I do feel that this is an extraordinary potent piece of literature from the hands of a young writer. My thanks to St Martins Press and NetGalley for providing a copy of this book in exchange for an honest review."}, {"userName": "Carol", "userReviewDate": "Sep 13, 2016", "userURL": "http://www.goodreads.com/user/show/1166663-carol", "userReview": "The Hook - The tug of war that comprise the force of good vs. evil. The outcome of what happens when the devil comes to call. The Line - ”Sometimes I think not having tears meant we cried even more.”The Sinker - A beautifully written debut novel with a creative take on a story that’s been told many ways before. The Summer That Melted Everything has received lots of praise. I was not certain I wanted to read it but there it was sitting on the library shelf and before I knew it, it was in my book bag. Many people have written eloquent reviews of The Summer That Melted Everything. I’m not going to try to outdo them. The Summer That Melted Everything is a read that will mean different things to different people, one from which we each will choose what we take Fielding and Sal will forever be in my heart. Birth/Death, Understanding/Intolerance, Good/Evil, Young/Old, Black/White, Right/Wrong, Guilt/Innocence, Rain/Drought, Fire/Ice, Heaven/Hell, opposites that attract and meld in their morality. The author, Tiffany McDaniel was on to something. She made me think as I was given a glimpse of that long, hot summer of 1984. I’m glad I read The Summer That Melted Everything and look forward to see what else McDaniel might have in store for me."}, {"userName": "Taryn", "userReviewDate": "Jun 08, 2016", "userURL": "http://www.goodreads.com/user/show/1334938-taryn", "userReview": "“You can tell a lot about a man by what he does with a snake.” Fielding Bliss looks back on the life-altering summer of 1984, when his father invited the devil to their hometown of Breathed, Ohio. The invitation is accepted by Sal, a thirteen-year-old black boy who claims to be the devil. After his arrival, an overbearing heat descends upon Breathed and tragic events begin to occur with frequency. The townspeople fixate on Sal and view him with suspicion. Is Sal actually the devil or just a runaway? Elohim, a neighbor who is friendly with Fielding, immediately dislikes Sal and seizes on the opportunity to focus the town's rage against him. While the community's lashes out at Sal, trouble is also brewing inside the Bliss home.“No one wants to say one word and then realize it means so many more.”I practically ran to Netgalley the moment I read the summary! The Summer That Melted Everything is such a unique book. The synopsis above barely scratches the surface of what this book is about. It has a whimsical, magical feel, but it's also very dark. Atmospherically, it reminds me of Big Fish (movie), Beasts of Southern Wild (movie) and The New and Improved Romie Futch. Romie Futch is described as a \"Southern Gothic tall tale\"; I'm not sure if Ohio counts as the South, but I think that label fits this book too! The writing is impressive. It addresses heavy themes such as racism, homophobia, AIDS hysteria, and domestic violence, but it never felt heavy-handed. Each chapter begins with an epigraph from Paradise Lost by John Milton, which helps sets the mood. Every word and name feels intentionally chosen and the story is well-constructed. The story is told by 84-year-old Fielding Bliss, primarily in flashbacks. He is consumed by guilt and regret, so we know this story probably doesn't have a happy ending. How did the caring thirteen-year-old we meet in the flashbacks turn into this self-destructive old man? He was so close with his family during the summer of 1984, so why does it seem that he lost all contact with them?\nCowardice is always too late to the fact that bravery has the better chance. Our better chance could’ve been understanding. It could’ve been soaring from that which has too long been believed to be a sin. And yet it’s far too easy to be the coward when it requires nothing more than a lie.\nThe book is filled with peculiar and interesting characters. Fielding's father Autopsy Bliss reminded me of Atticus Finch (TKAM). He's a fair-minded man who welcomes Sal into his home with open arms, despite the growing concerns of the community. Stella Bliss, Fielding's mother, won't step out of the house out of fear of the rain. Instead of leaving the house to travel, she decorates each room of her house as a different country. Fielding idolizes his older brother Grand, a high school baseball player whose reputation fits his name. Fedelia Bliss, their aunt, wears ribbons in her hair as a reminder of each of her husband's betrayals. Sal quickly bonds with the Bliss family and becomes especially close with Fielding. He's thirteen, but he speaks in parables. He seems much wiser than his years, but he's also seen more than any child should have to. These are just the people inside the Bliss household. There are so many more memorable major and minor characters.\n“What these poor souls were desperate for was a light. But the thing about light is it all looks the same when you’re in the dark, so you can’t tell if what powers that light is good or if it is bad, because the light blinds you to the source of its power. All you know is that it saves you from the darkness … They reached for that brightness, and while the light distracted them, while it comforted them in its false rescue, the dark power behind it did its work, and before any of them knew it, they were not being saved by the light, they were being changed by it.\"\nThis book illustrates mob mentality. A charismatic leader whips people into a frenzy and the townspeople easily rationalize their atrocious behavior. There are hints of the terrible events to come, but it begins with disturbing rhetoric. Over the summer, the situation slowly escalates to horrifying levels. When the people of Breathed find a \"monster\" to pin blame on, they become blind to their own monstrous behavior. Many of the strange events attributed to Sal were actually caused by the townspeople. \"Sometimes the things we believe we hear are really just our own shifting needs.\" The \"devils\" in Breathed aren't the ones who you would expect. They are neighbors and friends. There were no visual markers or previous indications of the evil they were capable of. I recently read an interview with a man talking about his professional colleagues. I can't remember the exact quote or numbers, but it was something like ≈10% were consistently bad, ≈10% were consistently good, and the behavior of the other ≈80% depended on who they worked with that day. Many of the citizens of Breathed reminded me of that 80%. This book makes it clear how easy it is to be led astray by blind certainty or a trusted individual.  Even the character with the purest heart had moments where they were certain and proven wrong after it was too late.\n“When glass is whole, it’s good. When it’s broken, it’s bad. It’s swept up. It’s thrown away. Sometimes thrown away too soon. Think of a window, Sal said. Imagine a violence breaking that window. All those shards of broken glass fall to the floor. The violence is inside the house now, wrestling you. It could kill you, so you grab one of the shards and stab. The violence dies and you are saved. Saved by the broken glass. Isn’t that a funny thing? To be saved by the bad. Sometimes, not sweeping that bad up and throwing it away will save you in the end. It just might. So to defend the devil means defending the good of the bad. That’s what I was doing, Fielding. Hoping that all those folks are just shards of broken glass and one day in the future, they’ll save someone by being just that.\"\nThe events at the end were so horrifying that it did make it difficult for me to put on my grey-tinted glasses. However, when I go back to “You can tell a lot about a man by what he does with a snake\" and the context, I understand why the story went the direction it did. I also have a personal issue where stories with allegorical characters make me hyper-aware that I'm in the middle of a story, so I am not 100% invested in the character's fates. Even though I didn't feel as ripped apart by tragedy as I probably should have, I did feel deeply for these characters. It felt like a gut punch when Fielding uttered the one word to his brother that changed their relationship forever. When the Bliss family hit their lowest point, my heart broke. Sal's stories are so beautifully told that they bring tears to my eyes. (Without giving anything away, the stories about the fall and the rope really stick out in my mind.)\n\"Isn’t it time we put the shovels down instead of digging more holes? The more holes we dig ... the less solid ground any of us will have to stand on.”\nI would love to  go on and on about my favorite parts, but it's best to experience it for yourself! This book's message will always be relevant. Part of what makes it terrifying is that the events are so recognizable. It's been hard for me to watch the news lately without thinking about Sal and Breathed, Ohio. There is so much in this book that it is impossible to unpack it all in just one read. The first read is really good, but it will definitely reward a reread. The Summer That Melted Everything is a deeply affecting book that will provoke much discussion. Highly recommended!_____________________Quotes I was reminded of while reading:Batman v Superman: Dawn of Justice Bruce Wayne: We're criminals, Alfred. We've always been criminals. Nothing's changed.Alfred: Oh, yes it has, sir. Everything's changed. Men fall from the sky, the gods hurl thunderbolts, innocents die. That's how it starts, sir. The fever, the rage, the feeling of powerlessness that turns good men... cruel. Unfair: The New Science of Criminal Injustice by Adam Benforado Doubt isn't the enemy of blind justice--blind certainty is.I received this book for free from St. Martin's Press & NetGalley in exchange for an honest review. I also had brief contact with the author, but I had already received the book at that point. This does not affect my opinion of the book or the content of my review. This title will be released on July 26, 2016."}, {"userName": "Edward Lorn", "userReviewDate": "Dec 30, 2016", "userURL": "http://www.goodreads.com/user/show/8850418-edward-lorn", "userReview": "I could go on for days about how well written this book is. I will not do that, though. You can judge for yourself how amazing are the turns of phrase and similes and metaphors. McDaniel knows her way around the written word. You can feel her attention to detail in every line. The word \"masterful\" comes to mind.I hesitate to recommend this book to some of you. Unfortunately, the list of people who this book might break over its knee is far too long to name each and every one of you. Up until the 85% mark the book is manageable in how it deals with loss and grief. But then 95% comes in like a Mac truck through your emotions. Unfortunately, your feels get caught in the grill and you're dragged for the final 5%. By the end of the book, you're nothing but scraps of flesh on a skeleton. Not since Stephen King's Revival have I felt so utterly drained after finishing a work of fiction. Usually I don't like repeated punches to the gut, as I stated in my review of The Kite Runner. It gets old. It gets boring. You're just waiting for the next tragedy and the book suffers due to that. Or the book is lighthearted in its sorrow, as with A Man Called Ove, and the tragedy feels glossed over and paperthin. Sure it's sad. But you know the Grinch's heart is gonna grow three sizes this day and blah blah blah...The most striking difference between the aforementioned books and this one is the terrifically quirky characters. You have a little person who's role in the book is far from just a supporting character; a cute little girl with a prosthetic leg and a shitty home life; a character who's terrified of being rained on; and some of the most unique names I've come across. Too often I'll read a book with unique names like Fuquery or Papa Platypus or Jim-Jim Jimmy Jimkins and I'll roll my eyes and wish the author had done better. Here, the character names fit their respective characters. The odd names are not just for show. They are functional. I like that. But more than that, I came to really love these characters. They were real people to me. Which made what happened to them that much more soul crushing. Suffice it to say that this book is way above the level of tragedy porn. There is tragedy. Loads of it. But, oddly enough, I never felt it to be too much. Actually, it did feel like too much, as in too much to handle. But never did it feel gratuitous, I guess is what I'm trying to say. I never felt like Tiffany McDaniel was thinking \"How can I make the next tragedy even worse than this last one?\" The horrible happenings herein seemed to follow a natural timeline, as if progression was not only needed, but wanted. I wanted to know what happened next because the last thing was so goddamn horrific I couldn't imagine what might come next. Well, sports fans, this motherfucker's ending is a blistering experience. I believe my exact words were, \"Holy fucking shit.\"I've read some disturbing scenes in my day (hell, I've even written my fair share), but none of them compare to what happens in this book. You can tout that you're the KING OF EXTREME HORROR! and label your books with PUSSIES NOT WELCOME! but you will never match the strength of something as emotionally powerful as McDaniel has accomplished. So you guys can have your shockfests. I'll take real literature over that nonsense any day. Because if you don't care about the people this horrific shit is happening to, what's the point? In summation: Tiffany McDaniel is too cool for school. I will not drop the age-old cliche of \"I can't believe this is a debut novel!\" because that wouldn't be true. This feels as if someone poured their entire self into a book, and if McDaniel never writes another novel I'd be sad but okay with that. Because this novel is a once-in-a-lifetime experience. And I will say that until another author proves me wrong.Final Judgment: Tiffany McDaniel is my generation's Harper Lee."}, {"userName": "Irena", "userReviewDate": "Aug 13, 2016", "userURL": "http://www.goodreads.com/user/show/17737927-irena", "userReview": "Here is the truth: this book is perfect.When you look at every single element of this story, every single character, phrase and all of the parts of the plot, you get one perfect whole, compliteness that leaves you breathtaken in an absolutely literal way.I am sorry if I already used the word perfection too many times at the very beginning of my review, but the truth is, I am lost for other words. This book, to me, was pure perfection.It played with my emphaty in a way I can't describe, it broke my heart, torn me apart and I am still picking myself up, days after I finished it.I am lost for words and I already know that my review won't do a justice to this masterpiece, but I will try my best.The Summer That Melted Everything talks about summer in a year 1984, the year when the HIV virus was discovered and scientists gave it a name.It takes place in Breathed, a small town in the West America, where people are still afraid of unknown and are very judgamental.Even though this book contains more then few diverse elements (like gay people, black people and people with dwarfism), the way characters talk about people and things that are diverse or different is plain brutal. For example, people say that AIDS is God's punishment for gays, God's tool to get rid of them.Those kind of references you'd hear even from characters you'd like.Keep in mind that it is 1984 and even though that kind of phrases were hard to read about, they also represent the reality of the story.The novel is written in first person, following two different times: first being placed in 1984 when Fielding was a 13 years old boy and the second that takes place when Fielding is and old angry man, and we can see how much tool summer 1984 took on him, how happenings from that summer shaped him as a person and destroyed him in a way.The writting style is astonshing. McDaniel's voice is so beautiful. It is different from other voices I read and it probably has a lot to do with the fact that The Summer That Melted Everything is a piece of literary fiction.This book reminded me how much I enjoy reading literary fiction, even though I don't read it too often.My opinion is that this book demands to be read more then once. I know I will reread it for sure in my close future.This is not a happy book, it will probably leave you under an impression and you won't be able to stop thinking about it.I already knew this was a five stars read for me after I finished it, but I also learned to appreciate it even more after some time passed.I would give it all the stars in the world.This is the best book I have read this year and it is one of the best books I read in my lifetime.Tiffany McDaniel surprised me with her debut novel and after reading only one book written by her, I already know I want to read everythig she'll write in the future.Recommending books is something I often do in my reviews, but if there's one book I would recommend of all the books I liked, it would be this one.I really, wholeheartedly recommend you to read this book!Note: I got this book for free via Netgalley in an exchange for an honest review. Thank you Tiffany McDaniel and St. Martin's Press. \nRead this and more reviews on my blog: http://bookdustmagic.wordpress.com"}, {"userName": "Dem", "userReviewDate": "Aug 10, 2016", "userURL": "http://www.goodreads.com/user/show/2752994-dem", "userReview": "2.5 Stars \nI Guess I couldn’t take the heat…………………….\nThe Summer that melted everything is a unique and interesting story set in Breathed, Ohio. A deep and dark story of the summer the Devil comes to town in the form of a teenager called Sal and a series of horrific events occur and the reader must decide whether these events are actually the work of the devil or humans. Of course the town are quick to point the finger at Sal but could a fifteen year old teenager really be the devil in disguise?It’s a beautifully written book and the story is unique in its telling and I normally love Southern Fiction but this one just didn’t sit well with me as from the outset I really didn’t engage with any of the characters and I found the story too deep and dark and to be honest there is a little magic realism running through the novel which doesn’t work for me at the best of times. Perhaps I need to be from the South or know more about it in order to enjoy this novel.This book reminded me very much of The Enchanted\n in its tone and uniqueness.This book wasn't for me and I am know that I am in the minority on my views on this one as most of my Good reads friends have loved it so I think its best to decide for yourself as the writing is excellent and the story unique. An ok read but not one for my favourite list."}, {"userName": "Ann Marie (Lit·Wit·Wine·Dine)", "userReviewDate": "Dec 03, 2017", "userURL": "http://www.goodreads.com/user/show/7447086-ann-marie-lit-wit-wine-dine", "userReview": "You can read this and all of my reviews at Lit·Wit·Wine·Dine\n” “A snake that could harm you, you don’t have much choice to kill. You wouldn’t be able to leave a cobra in your sock drawer. But a snake that is no threat will greatly define the man who tries to kill it anyways.” “\nThe year is 1984 and in the small town of Breathed (pronounced breath-ed), Ohio, something strange is happening. Autopsy Bliss, a local attorney, places an open invitation in the newspaper inviting the devil to town. The arrival of a young boy, out of nowhere, claiming to be answering sets the stage for a series of events that will have the entire town coming undone.The Summer that Melted Everything is a very emotional read. When I finished, I had a sense of hopeless heaviness in my chest that hasn’t fully dissipated. Tiffany McDaniel has boldly chosen to take on several serious social issues at once including racism, homophobia, HIV/AIDS, child abuse and molestation, mob mentality, and behavioral health differences for starters. So many issues, in fact, that had I realized just how many prior to reading the book, I may have scoffed at the level of ambition. Somehow, though, it all works in this book. In fact, it’s necessary, and I would argue that the the very point of this book is to illuminate how layers upon layers of social injustices, societal complicity and complacency, and the oppression of the marginalized have culminated/can culminate in the breakdown of the sense of safety and justice within a community large or small.As if that wasn’t enough, McDaniel writes in poetic form that is a joy to read. So much so, in fact, that I wondered if she was a poet. As it turns out, she is! There are many beautiful passages throughout the book but here’s another of my favorites:“The finale of fear is neared by small labors of bravery. These small labors will eventually lead to the last laboring of the great defeat of the fear altogether. That is the breathing text of hope anyways, that we branch an escape from fear’s trapping circle.”As for young Sal, was he the devil? Or was he simply convinced that he was so? If so, why? I know my answers but I’ll leave you to decide for yourself.The Summer that Melted Everything is a profoundly moving, heartbreaking read that will stay with you forever. Tiffany McDaniel brilliantly weaves a story that is classic man’s inhumanity to man meets modern literary fiction with twists of darkness and mystery.I’d like to thank Amanda at Cover2CoverMom for connecting me with Tiffany McDaniel. I’d read Amanda's review back when it was originally posted and it’s been on my want-to-read list since. I’m so grateful that I’ve finally been able to read this book.This book would be a great Christmas gift for the serious lit lover on your list.Many thanks to Tiffany McDaniel for providing me with a free copy of this book in exchange for an honest review."}, {"userName": "Melissa", "userReviewDate": "Jul 22, 2016", "userURL": "http://www.goodreads.com/user/show/9185509-melissa", "userReview": "This was a GREAT read! It totally caught me off guard how absolutely unique and fabulous this book was.In the summer of 1984, Fielding's father Autopsy Bliss wrote an invitation to the devil in the newspaper. And the devil accepted. Or did he? A young boy called Sal arrives claiming he is the devil. At first the townspeople think its a joke, that he is a runaway. But as Sal begins to get involved with some of the people from the small town, strange things begin to happen and darkness seems to follow Sal wherever he goes.I was just so taken aback by the complexity and brilliance of this novel. It is told from Fielding's point of view in large flashbacks and flash forwards to the the future, when Fielding is a old man. And this back and forward alternating perspective really worked. You get glimpses of what he is like in the future, and slowly start to understand why he is the way he is, and what exactly happened that summer.It wasn't so much the story that captivated me (although it was in itself, captivating), it was the writing. The powerful atmosphere and the emotional, resonating quotes and dialogues throughout the book were hauntingly beautiful and incredibly moving. There were numerous occasions where I had to stop reading and sit in wonder at what I just read. At times it was utterly depressing, but not in a bad way!The characters are all so deep and powerful. They all have their own unique stories and a darkness about them. Fielding was probably the most innocent and naive of the lot. His brother, mother and father were fascinatingWould I recommend The Summer that Melted Everything?Absolutely! I am surprised that more people don't know about this novel and I have a feeling that its going to be huge! And I can't believe that this is a debut!! I can't wait to see what else the author has up her sleeve for the future!Many thanks to author Tiffany McDaniel and the publisher for an advanced copy of The Summer that Melted Everything to read and review.For more reviews check out my BLOGfacebooktwitter"}], "description": "Fielding Bliss has never forgotten the summer of 1984:the year a heatwave scorched the small town of Breathed, Ohio.The year he became friends with the devil.When local prosecutor Autopsy Bliss publishes an invitation to the devil to come to the country town of Breathed, Ohio, nobody quite expected that he would turn up. They especially didn't expect him to turn up a tattered and bruised thirteen-year-old boy.Fielding, the son of Autopsy, finds the boy outside the courthouse and brings him home, and he is welcomed into the Bliss family. The Blisses believe the boy, who calls himself Sal, is a runaway from a nearby farm town. Then, as a series of strange incidents implicate Sal — and riled by the feverish heatwave baking the town from the inside out — there are some around town who start to believe that maybe Sal is exactly who he claims to be.But whether he's a traumatised child or the devil incarnate, Sal is certainly one strange fruit: he talks in riddles, his uncanny knowledge and understanding reaches far outside the realm of a normal child — and ultimately his eerily affecting stories of Heaven, Hell, and earth will mesmerise and enflame the entire town.Devastatingly beautiful, The Summer That Melted Everything is a captivating story about community, redemption, and the dark places where evil really lies.", "title": "The Summer that Melted Everything", "url": "http://www.goodreads.com/book/show/26114523-the-summer-that-melted-everything", "average": 3.93, "cover": "https://images.gr-assets.com/books/1462949293l/26114523.jpg", "reviews": 1035, "authors": [{"url": "https://www.goodreads.com/author/show/14220744.Tiffany_McDaniel", "name": "Tiffany McDaniel"}], "type": ["Fiction", "Magical Realism", "Contemporary", "Literary Fiction"], "outlinks": ["http://www.goodreads.com/book/show/26114523-the-summer-that-melted-everything", "http://www.goodreads.com/book/show/28858922-the-summer-that-melted-everything", "http://www.goodreads.com/book/show/28514323-the-summer-that-melted-everything", "http://www.goodreads.com/book/show/29601654-the-summer-that-melted-everything", "http://www.goodreads.com/book/show/31051559-the-summer-that-melted-everything", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}