{"ratings": 2846, "userreviews": [{"userName": "Catherine Sanders", "userReviewDate": "Feb 02, 2016", "userURL": "http://www.goodreads.com/user/show/52252047-catherine-sanders", "userReview": "I am a first time user at Goodreads. I signed up so I could rate this book, The Secret to Hummingbird Cake. I read the other reviews to see exactly how it worked. After reading them, I wonder if we all read the same book or maybe I just wonder if we are all the Christians we claim to be. This was a beautiful story of friendship and forgiveness. I think some may have missed that. This book tells a story of women so devoted to each other they would do anything for one another. I'm wondering how that could be misconstrued or deemed \"preposterous.\" We live in a world that mocks friendship. It was a joy to read about such devotion between these women. My husband who has passed away, was a pastor for 32 years. As his partner in ministry, I can assure you affairs happen and they sometimes happen within a congregation. Yes, they can be forgiven. This beautiful story found it's way to me by accident. But, I don't really believe in accidents, so I had to write this review hoping Ms. McHale will see it. Thank you, Ms. McHale for reminding us forgiveness is the true Christianity, affairs don't always end marriages and true friends are forever."}, {"userName": "Sarah", "userReviewDate": "Jan 30, 2016", "userURL": "http://www.goodreads.com/user/show/12893906-sarah", "userReview": "The Secret to HummingBird Cake is the best book I have read in a long time, which says a lot for an avid reader and reviewer. First, I will disclaim this; many readers will be off put by this book because of the REAL life junk that happens in the book. Yes, I said REAL life, you know the thing you and I are living. This book isn't some sweet fairy tale, but it's sassy, painful, messy and downright lovable. The Secret to Humming Bird Cake will make you laugh so hard and cry tears you didn't know existed. Your husband will look at you, and question if he made you upset or if you ate something funky? Any book that makes you cry and laugh simultaneously is a book well worth reading more than once, which is what you will find here. The characters aren't perfect and in fact, have faults, just like readers, which makes this book a breath of fresh air.The Secrets to HummingBird Cake has a Southern charm of a small town, but don't mistake that for the beautiful friendships these three women have. Their friendship is a once in a life time and God Bless their hearts, we'd be lucky to have true friendship like these three women. They can call each other about their mistakes, but pull them by the boot straps to carry them through the mud. And if you give this book a bad review because you're gawking at three words used in this book, look behind you, you have one too, move on. Life isn't perfect, I still love Jesus, and no, I'm not the condoning language, but you've missed the point of the book if you're off put three-word choices. This book isn't about that. Chances are, you're probably offended by the C- word, but those are just my thoughts. This book hit close to home as so many of friends have children battling ALL and EWIGS Sarcoma. In my opinion, The Secrets to HummingBird Cake touches on the things that matter most to me; Marriage, friendship, faith, giving in the unseen, Cancer and love. When the final page has been turned, you will be thinking about this book and wishing you had friends like Laine, Ella Rae & Carri. I want to see this book made into a film, and I wish Ms. McHale the very best in her writing. You gained me as a reader for life."}, {"userName": "Laura", "userReviewDate": "Apr 08, 2017", "userURL": "http://www.goodreads.com/user/show/29789832-laura", "userReview": "Hmmm. I am very conflicted on how to rate this book. I am afraid I could write an extremely long and drawn out review with lists of reasons why I really enjoyed it, and why, I also feel like giving it an even lower rating. First, let's start with the good. I really thought this was well written. The author did a wonderful job with describing the southern setting. I really felt like I was visiting the South while I read this. I was very engaged and the author played with my emotions throughout the entire story. I haven't laughed and cried so much, because of a book, in a long time. I enjoyed the theme, that life is precious and time passes by so quickly and we often need to take time to really appreciate loved ones in our lives. This was a beautiful story about three girls, who loved each other like sisters and had to face death, as one of the main characters becomes very sick. Now, lets move on to what I didn't like and why I don't know how to properly rate the book. This is published by Thomas Nelson. This should, in my opinion, be a Christian book, yet I feel like it had nothing to it that I would say was truly Christian. Thomas Nelson is a company that states their purpose, core values and goals; this novel was a complete failure when compared to those very standards that they list. The majority of the time, that God was mentioned, was using the Lords name in vain. This was all through the book. It also had several other cuss words that I wont even take the time to mention. The three main characters never showed any real saving knowledge of Christ. I was given the impression that everyone goes to heaven if you are mostly good, sometimes people can even \"save you a seat\" in heaven. The characters never relied on God, nor did they ever really accept Him. It really is a shame, because the story had so many opportunities to allow the characters to repent, to trust God and to find a peace through his love, but it was never approached or even hinted at. The three star rating is simply an average between rating this as a well written book and how it should have been Christian, yet it read like a secular book, in my opinion. You might ask, \"Why does this bother her so much? She enjoyed it, didn't she?\" Well, yes, I did. But I am also very disappointed. Its like this, let me give an analogy here...... ( hear me out) I LOVE ice-cream. Lets say I go to the store and buy some Vannila Bean ice-cream. When I get home, I pull back the lid, eager to scoop out my favorite flavor, only to discover, its not vannila, its chocolate. Now, that chocolate wasn't that bad, but its also not what I thought I was buying. ( Thomas Nelson did exactly that when they published this under their name. It was good, but not what I expected) I would have loved, The Secret to Hummingbird Cake, if the language was cleaned up and if the main character was transformed through Christ."}, {"userName": "Beth", "userReviewDate": "Jan 20, 2016", "userURL": "http://www.goodreads.com/user/show/4075354-beth", "userReview": "Expectations can sometimes make or break a read. In this case, my expectations messed this book up for me. I can easily overlook profanity, some off-color language and even a sex scene or two, and I’m not offended by it or shocked to see it in general fiction. However, when I’m reading a book that is specific to the inspirational, Christian fiction market, there are certain expectations that I have. Little to no language and no crude slang (I can make some exceptions for historical context, but not many). I believe that a story can be raw, gritty and realistic without using profanity. I can only assume that this publisher is changing their style a bit, and I suppose, adjust my expectations accordingly. Readers that read from primarily the general market will most likely not find any sort of problem with the language because it is mild for the most part.That out of the way, now to my thoughts on the book. There are a lot of good things here. I loved the setting – I’m from the South, and as a native, the author gets so many things right. The cadence of the dialogue, the small town stories, it all just flowed together to really ground the reader with a strong sense of place. I really enjoyed the authentic dialogue – it sounds Southern, without droppin’ all the G’s in the words and throwing in cliché sayings. There are several hilarious bits of dialogue, and can I just say, that I about squealed when Carrington said she felt like a can of busted biscuits. My sister-in-law say that all of the time, and others have just looked at us like we were crazy! Several things like that had me laughing, while some of the more serious bits did make me teary-eyed a few times.I didn’t actually love the main character, since I didn’t really have a lot in common with her, but it was interesting to get a different perspective like Carrington’s. I was actually more like Laine – no, I’m definitely not as selfless as she is by any means, but I’m more the quiet, rule-following type (yep, I wave my “goody-goody” flag high. I only get sassy when necessary. Too much drama wears me out). The book is worth reading for Laine's character alone. I don’t want to give too much away about the plot, but she definitely carries the story for me.Carrington has a significant, poignant character arc, and though much of the story is sad, I still felt hopeful by its end. I really enjoyed seeing her develop; in many ways, she still had some growing up to do, despite getting married at a very young age. I liked the portrayal of friendship, although I’m sorry, if any of y’all are doing something wrong, I’ll forgive you, and I’ll still love you, but I won’t be an enabler. ;)Speaking of her marriage, I think it does portray that getting married young is not always a mistake – if it started out as a mistake, it doesn’t have to remain one, and the marriage can still work and thrive. The issue of infidelity (this is not a spoiler, it’s talked about in the opening chapters)…I’m not sure how I felt about it. Infidelity is appalling, obviously, but I’m not sure about how it was portrayed here. I do appreciate that the book addresses some tough issues, and that it is a much grittier story than the pretty cover implies. It’s not really chick-lit as I typically think it, which is a plus for me, and the focus on friendship, and how resilient it can be in times of trouble, is the highlight of the story.Although it didn’t bust onto my favorites list, I did like it and enjoy it and look forward to the author’s upcoming works."}, {"userName": "Pamela", "userReviewDate": "Aug 07, 2016", "userURL": "http://www.goodreads.com/user/show/20048096-pamela", "userReview": "\"Isn't that the job description for a best friend - hide the bodies and encourage the bliss?\"Is it just me, or does anyone else delay writing a review because you're so in love with a book - the setting, atmosphere, nuances and cadences, dialogue and characters - that you simply MUST hold the story close to your heart before you send it all out into the world? Yes, oh yes.... I LOVE The Secret to Hummingbird Cake!! Especially the characters, who are so delightfully flawed, realistically quirky, and spitefire spunky. They are hometown best friends, and in turn, became my best friends. Wishfully, prayerfully. I want to move into their town, their neighborhood, their lives. Sip a glass of wine, do lunch, hang out at the softball fields, play ball, go shopping (heck, I don't even like shopping, but it would be a hoot with those three!), worship together, and revel in the joyous beauty of friendship. I mean for real, everyone needs the sort of friends who are willing to save us from self destruction, in spite of our sniveling protests. \"In that moment I felt as if God had a damp dish towel and slapped me across the face with it. I was no Bible scholar, but I was completely sure God wasn't sitting on his throne with his notepad and pencil, smiling and saying, 'Let's get Carrigan Whitfield involved in a completely inappropriate relationship with a man she barely knows.\"I shared in their antics and imaginings, joys and sorrows, tiffs and tirades. I laughed loud and long - uncontrollably at times. Southern \"Bless your heart\" sassafras storytelling, just doesn't get much better than this. At its core The Secret to Hummingbird Cake celebrates friendship. Friendship in its purest and truest sense, where each hold the other accountable; they speak honestly and openly to edify and uplift sans judgement; love unconditionally through good times and bad, highs and lows, joys and sorrows. As too with marriage: the parallel focus of the book, right alongside personal growth and divine realization. All of which find common ground in unconditional love. \"Maybe we didn't have the perfect love story. But we had the perfect love. Because if endured, and it remembered, and it forgave.\"For all the crazy bouts of laughter, there were also tears. Tears of joy. Tears of Sorrow. Tears of letting go...... Oh how hard it is to say goodbye to a tried and true friend. One who has stood by your side through thick and thin, and understands you, accepts you for who you are - right where you are. Whether literal or literary, goodbye is one of the hardest words. However, I can always reread this cherished book again. And one day, I will be united in heaven with all my friends and loved ones who've gone home before me to our Father.\"You are responsible for what you do. No matter what you go through, no matter what happens to you, no matter how much someone hurt you, the choices you make are ultimately your own.\"FIVE ***** Delightfully Wise, Sassafras Southern, Morally Uplifting, BFF ***** STARS"}, {"userName": "Hannah", "userReviewDate": "Jan 20, 2016", "userURL": "http://www.goodreads.com/user/show/17442587-hannah", "userReview": "It's a good thing I had some time in the bookstore to browse this one before making an impulse purchase. The characters are Southern, but very worldly...instantly it reads more like a romance novel than a women's fiction. One character is literally salivating over a man's abs in a tight tshirt and, later, in a wet tshirt. There is some cussing and a deal of crude slang. But it was when a character responded to a handsome guy asking her to help him with something by saying \"I'll do anything for you short of whips and chains\" that I slapped the book back on the shelf. I do not like the bondage culture and was offended to find it mentioned in pleasant jest by a leading character in a Christian book. Not my glass of sweet tea at all."}, {"userName": "Terri Wino", "userReviewDate": "Mar 08, 2016", "userURL": "http://www.goodreads.com/user/show/28305082-terri-wino", "userReview": "When I first started reading this book, I have to say I wasn't really feeling it. You're kind of just dropped into a story already in progress and told by the narrator, Carrigan, that she's best friends with Ella Rae and Laine and it's almost expected that you should like them all. I really didn't like Carrigan initially. But then she starts to talk about how she met her friends, some of their past antics, how she got together with her husband, and next thing you know, I'm wrapped up in these lives and laughing and crying along with them. Some people may find this book melodramatic or not understand the friendship these women have, but I have been blessed to have a group of friends like the ladies in this story. People who do crazy things and create fun memories together. People who have been there for you through thick and thin. People who you can get mad at and they you, but the minute you need each other, you've got each other's back. People you can go days, weeks, or months without seeing because life gets in the way, but you know the minute you utter the words, \"I need you,\" they're at your doorstep.This book had me laughing out loud a few times because it reminded me of those friends of mine. It also had me in tears more than once.I've seen some reviews bashing this book because, I guess, it's supposed to be a Christian book or from a Christian publisher or something like that and the reader didn't think it was a very Christian story. Well, I don't know about that, but I do know it was a story I thoroughly enjoyed reading. A story that made me even more grateful for the sister-friends in my life."}, {"userName": "Galaxy Adventurer", "userReviewDate": "Apr 03, 2016", "userURL": "http://www.goodreads.com/user/show/21821354-galaxy-adventurer", "userReview": "[So first off I will say my favorite parts were the flashbacks in the first half of the book, my favorite one was when Carrigan met Jack. Laine was my favorite character, she was so kind and such a good friend to everyone. Also the cover is pretty :)So now that I've said my favorite parts I will say I didn't really enjoy anything else. There were some parts that made me kinda uncomfortable, that is why I wouldn't recommend this book. Some of the things that were said before and after Carrigan had her baby kinda grossed me out...maybe that was just me but...Another part that made me kinda uncomfortable, was when Carrigan and Jack went on their 'picnic'. It faded out quickly but I still didn't need to know some of the details from that, and other times later on.There was some bad language in the book, maybe that's just the way they talk in the south but I was still surprised to see it in a Christian book. Some of the characters got drunk at different parts of the book as well.So it was an ok book overall, but I defiantly wouldn't recommend it to any of my fellow teenagers.  (hide spoiler)]"}, {"userName": "Tami", "userReviewDate": "Mar 22, 2016", "userURL": "http://www.goodreads.com/user/show/16127486-tami", "userReview": "I was expecting a sweet southern story, but was disappointed. It would appear that Thomas Nelson is going for a new audience? I was unhappy with the swearing, glorified drinking and getting drunk, adultery that was considered a positive thing, and a character I couldn't empathize with. Just being honest. If the book is marketed as \"Christian,\" I don't want curse words. I'm sorry if people disagree, but there are ways to be real about swear words without actually including them. The drinking and adultery are, yes, a part of real and can be handled in a Christian book, but I don't expect them to be handled like this book does. The redeeming parts of this book are the story of the friendships. That part was beautiful. But I was too far frustrated by that point to appreciate it. I guess I'm getting old and conservative. I don't need my Christian books to be a preachy and naiive, but I do need some expectations met so that the characters are human (and therefore fallible) but then don't call the characters Christians when their beliefs are not biblical.My two cents' worth. I received this book in exchange for my honest review..."}, {"userName": "Diana Rhodes", "userReviewDate": "Jan 25, 2016", "userURL": "http://www.goodreads.com/user/show/51931418-diana-rhodes", "userReview": "I absolutely LOVED this book! Any book that makes me laugh, cry, and laugh through tears is a well written book. The story is sooooo real and believable; not everyone is beautiful, perfect, happy, tall and slim, but they learn from their mistakes and are true blue friends. I believe in women supporting women, and these women are true blue friends. They love each other enough to let each other make mistakes but they are there to help pick each other up. Lessons are learned. I love the Southern charm of this book, as well as, how the book wraps up. Having lived in a small town for many years, this author hits the nail on the head regarding small town life. I can be peeved at someone but that doesn't mean someone else can point out that persons flaw. LOL.. I truly believe this book is well worth reading, will benefit and touch many that read it and Lord have mercy, this should be a movie!"}, {"userName": "Cheryl Olson", "userReviewDate": "Jun 06, 2017", "userURL": "http://www.goodreads.com/user/show/4729258-cheryl-olson", "userReview": "As many others have posted before me on this book as to questionable content, I completely understand their objections- there is a lot of \"stuff\" in this book that is surprising to see in a \"Christian Fiction book\". I'm not going to be running to my grandmother saying, \"Please Granny read this.\" However, with that being said, I have to say that the authenticity in the writing is so good, the character's so real, and the struggles they face, very real as well. For those who have really wrestled with the \"Why God, did you let this happen?\" questions will completely relate to this story. I had tears streaming down my face several times as someone who has experienced real grief, as those scenes were so very touching and well written. The friendships of the 3 women- Carrigan, Laine and Ella-Rae were funny, poignant and very authentic. I did enjoy this book and this journey with the characters even as I wiped away my smudged mascara after finishing the book. 3.5 stars"}, {"userName": "Letty", "userReviewDate": "Aug 01, 2016", "userURL": "http://www.goodreads.com/user/show/5960404-letty", "userReview": "I was provided with a copy of this book in exchange for an honest review. I must say that this is a beautiful, beautiful story of the strong bond and friendship of three women: Carrigan, Ella Rae and Laine. Loved this book and loved the characters. It made me laugh quite a bit and made me teary as well. So touching and sweet. I highly recommend this one!!"}, {"userName": "Aurelia Mast-glick", "userReviewDate": "Feb 02, 2016", "userURL": "http://www.goodreads.com/user/show/36773159-aurelia-mast-glick", "userReview": "This is one of those books that I'm left shaking my head and nodding it both at the same time. I'm simply not sure what to make of it.First off, I don't classify it as a real Christian book. Yes, the character who died seemed to have a faith in God, but it wasn't mentioned a lot. The main character spend most of the book ranting at God. And the language wasn't what I expected in a Christian book published by a Christian publishing company. So in that regard, I was a little disappointed. I was hoping for a bit more depth.On the other hand, the depth of the friendship of these three women is a rare find. They did everything together, actually they did too much together in my mind. I have some really good friends, but there is no way they would accompany me to all of my prenatal visits and to the birth of my child. Sorry guys, no can do!! And there is no way I would go with them to theirs. Actually that whole idea is so preposterous it can make me laugh. But on the other hand, these three friends stuck it out through thick and thin and when one of them is diagnosed with cancer, the other two rally around and stuck with her all the way to the end.So that is the reason for the mixed feelings here. It was a good read, but...I do want to share a couple of quotes from the book that I did think were inspiring and just very good.This one was said by Laine, the lady that died, at a classmate's funeral. \"'I know this is sad,' she said, 'and I'm sad too, especially for his family. But keep hearing people say, \"Isn't it tragic because he had his whole life in front of him.\" But what difference does that make? It's not how long you live; it's what you leave behind. Ricky was a great guy. Everybody loved him. That's an amazing way to be remembered.'\"And this also by Laine, \"You are responsible for what you do. No matter what you go through, no matter what happens to you, no matter how much someone hurt you, the choices you make are ultimately your own.\" As you can tell, she was the mature one of the bunch.Those two things struck a chord with me. What am I leaving behind?This book was given my by Book Look Bloggers for the purpose of reading and writing a review. All opinions expressed are my own."}, {"userName": "Lesa", "userReviewDate": "Mar 18, 2016", "userURL": "http://www.goodreads.com/user/show/1366422-lesa", "userReview": "I'll admit for a while I wasn't fond of the narrator in Celeste Fletcher McHale's debut novel, The Secret to Hummingbird Cake. But, stick with it. This is not your typical chick lit book, and Carrigan Whitfield learns a few hard lessons in the course of the story.Carrigan, Laine Landry and Ella Rae Weeks have been best friends since they were five and Laine's family moved to the small town of Bon Dieu Falls, Louisiana. Twenty-five years later, Carrigan and Ella Rae have married, but they still have hairbrained ideas, and Carrigan, in particular, makes \"slightly off decisions\". When she becomes convinced her husband, Jack, is having an affair, she decides to have one, too. Laine reprimands her, insisting Jack still adores the woman he eloped with when she was seventeen. Carrigan, already feeling guilty because she loves her husband, knows there are \"Some distinct disadvantages to having your conscience living directly across the street.\"\"Laine was kind and gentle and loving. I was loud and suspicious and headstrong.\" And, Carrigan reveals all of their escapades and her mistakes until one day when it's no longer funny. Life hits them in the face, and Carrigan is finally forced to mature. She'd been so wrapped up in herself, despite her best friends, that she never saw that change could come. But friends and family rally, and Carrigan is grateful she lives in a small town where everyone knows everyone's business.As I said, Carrigan's immaturity bothered me at the beginning of the book. She was a little too selfish, a little too self-involved. But, as my co-worker pointed out, it was refreshing to have a narrator and main character who isn't perfect. And, she does grow in the course of the book.The Secret of Hummingbird Cake. It's a debut, southern novel, with three best friends, a character that grows, and a tearjerker. What more do you want?"}, {"userName": "Diane Coto", "userReviewDate": "Feb 09, 2016", "userURL": "http://www.goodreads.com/user/show/15367113-diane-coto", "userReview": "Cell Phone Romeo. That’s what Carrigan (Carri) calls the man she has been seeing. Assuming that her husband was having an affair, she was just trying to even the scales. But she’s not happy at this game, and Romeo is not the sharpest knife in the drawer. She longs for what she and her husband, Jack, once had. She doesn’t know where it went or why. She thought their romance would last forever. She’s sure she will love him for the rest of her life.Thank God for close friends. Laine and Ella Rae are her ‘forever’ friends. They have known each other since they were children. They share their deepest, darkest secrets with each other. Laine is the ‘goody’ of the bunch seemingly wanting to bring both Callie and Ella Rae down to earth. While they are both more on the vindictive side, Laine prefers to see the good in everyone. She is as sure that Jack is not having an affair as Carri seems to believe he is. But, Laine has a frightening secret of her own. Soon all three will share in her pain.A women’s fiction set in the deep south of Louisiana, this is humorous in parts and heartbreaking in parts. Similar to books written by Fannie Flagg, the novel touches on heartbreak, love, friendship, and faith … a lot of faith. I loved the character’s personalities. They were friends, but not clones. They all had distinct personalities. They may argue and disagree, but they remained close no matter what. They did tend to agree on Bethany who seemed to corner Jack a little too much. Carri narrates, “Did this chick eat at all? Probably all the time. Another reason to be annoyed at her. I wanted to drag her out to the parking lot and beat the crap out of her, but she’d probably even bleed cute.” Rating: 4.5 out of 5."}, {"userName": "Staci", "userReviewDate": "Jun 15, 2017", "userURL": "http://www.goodreads.com/user/show/11909124-staci", "userReview": "I have mixed emotions about this debut.I enjoyed the southern influence, bits of humor and raw emotion. I struggled with at least one abrupt swing in the novel and some of the behaviors of the main characters.There is promise is the author's style and I would read another novel by the author."}, {"userName": "Rachel McMillan", "userReviewDate": "Dec 07, 2015", "userURL": "http://www.goodreads.com/user/show/2201736-rachel-mcmillan", "userReview": "Quick Take: if you like Fannie Flagg, Billie Letts or The Divine Sisters of the Ya-Ya Sisterhood, you will enjoy this winsome Southern novel which paints with talented aplomb a pitch-perfect women's sphere. The voice is refreshing, the characters buoyant and believable: why, you feel like you will look up from the pages and see them there across from you!"}, {"userName": "Martha", "userReviewDate": "Jan 25, 2016", "userURL": "http://www.goodreads.com/user/show/6966032-martha", "userReview": "The cover, title and description caught my attention when I saw this book on a list to read one day. I had put it on my \"To Be Read\" pile and pushed it to the top when I actually read that it was a little more gritty than I first had believed. I loved the fact that the bookmark that came with the book had a recipe for the cake on it. I am really going to have to make it! The topics in this fiction book were for sure about the bond of friendship overall. But in the meanwhile, they deal with hard topics such as adultery, cancer, marriage issues, among others. I really wanted to really like this book, but while I am not a prude about language, I would prefer some words to never find a place in Christian fiction. Sadly, this book contained a couple of \"A\" words, \"D\" word, and a few other things that were more character issues that I struggled with seeing as normal in a Christian fiction book such as excessive drinking. I really enjoyed the story, and found it much different than I expected. I was looking for more of a \"Chick Lit\" book, but instead found a book that dealt with love and friendship in hard things. I really enjoyed the friendship between the girls in the story. I would not really recommend this book to anyone other than adults because of the topics addressed, and if they are expecting the language and are okay with that."}, {"userName": "Melissa", "userReviewDate": "Nov 14, 2015", "userURL": "http://www.goodreads.com/user/show/721595-melissa", "userReview": "The beginning of McHale’s novel is a bit slow, but it gains momentum quickly. The book is filled with love, friendship and learning to hold on even when life is hard; but it is also about letting go. Thick with Southern charm, readers will warm to the characters and wish they were friends with these wonderful women. A beautiful story to savor.Since they were young girls, Carrigan, Ella Rae and Laine have been the best of friends. Now that they are adults, they lean on each other even more, because life just keeps getting more complicated. Carrigan isn’t sure what is going on with her marriage, and the other two women are trying to keep her from making irreversible mistakes. When they discover some devastating news, the three must band together in a way they never have before.- See more at: http://www.rtbookreviews.com/book-rev..."}, {"userName": "Joan", "userReviewDate": "Feb 16, 2016", "userURL": "http://www.goodreads.com/user/show/8435102-joan", "userReview": "This novel is a good exploration of the importance of lifelong friendship. I really liked it. But I have to say that there is good news and bad news about the book.The good news is that this book is wonderfully written and is captivating. I don't think I have read of a friendship between women written in such a wonderful way. Carrigan, Ella Rae, and Laine are crazy wonderful women. Their personalities are revealed very well and their actions are always entertaining. I loved that part of the novel.But there is also bad news. This novel takes place in a small town in Louisiana and people in the south express their Christianity differently than in the Pacific Northwest where I live. There is frequent mild swearing in this novel. There is infidelity in a marriage and the general attitude is, “These things happen. Honey, you gotta get a hold of yourself.” There is no concern about the sin of the action nor asking for God's forgiveness. Also, when things get really tough, when the women need strength to persevere, there is no relying on God for strength. There is no faith that carries them through. Their “Christianity” is something for Sunday and wearing hats to church but has little or no meaning the rest of the week.So, the good news is that this is a well written and captivating novel about a life long friendship between three southern women. The bad news is that while at least some of the women think of themselves as Christians (“I'll see you in heaven.”), there is really nothing fundamentally “Christian” about the book. The words and actions of the women, especially Carrigan, our narrator, do not reflect a saving faith.I received a complimentary egalley of this book from the publisher for the purpose of an independent and honest review."}, {"userName": "Michelle", "userReviewDate": "Feb 02, 2016", "userURL": "http://www.goodreads.com/user/show/11663753-michelle", "userReview": "So I’ll be honest, I wanted to read this book because of the cover and because of the setting in the south. A few chapters in and I knew where this book was going and was slightly disappointed. Three friends going through life’s ups and downs. One has cheated on her husband (and I’ll be honest I didn’t really see where this had a redeeming ending aside from “oh it happened. oh well moving on.”) Also, this is discussed within the first chapter so it’s not really a spoiler. That part bugged me a bit because it was too easy, when something like that happens it doesn’t just go away. I loved the friendship theme and there were some humorous stories. There was some language, nothing terrible, but not necessary either. The best part of the book happened near the end and I found it to be very much like many movies I’ve seen. I think it wrapped things up after much sadness and real life situations. It was an okay book in my opinion. Not my favorite but I didn’t hate it either. I guess I just didn’t get much from it and it didn’t leave a resounding feeling of a great book. Three stars. “I received this book from BookLook Bloggers for free in exchange for an honest review.”"}, {"userName": "Debbie", "userReviewDate": "Mar 08, 2016", "userURL": "http://www.goodreads.com/user/show/12691311-debbie", "userReview": "This was a great story about three best friends who grew up together. One would decide the crazy stunt they'd do, one would say \"okay when\" and the other one would say \"oh, no, not again and follow them and try to keep them out of trouble\". They were hilarious together. They would say just what they though and felt and because they had known each other for so long, no ones feelings would get hurt. I laughed continuously throughout this book. Then, life caught up with one of them and offered them a real hard knock. Stage four cancer. It was interesting how the girls went through this process and how each handled it in their own way. I just loved this book!! I laughed, laughed some more, cried, laughed again, cried and repeated the process all over again. Never once wanting to put it down even at the end. Thanks to Fiction Guild and to Thomas Nelson for sending me a copy of this book hoping I would read and review it. Special thanks for the Hummingbird Cake recipe, it sounds deelish!"}, {"userName": "Nicole Henke", "userReviewDate": "Jan 26, 2016", "userURL": "http://www.goodreads.com/user/show/943795-nicole-henke", "userReview": "Grab the box of kleenex before you start reading this one! you'll need it because you are laughing so hard, your're snorting, and then you'll be crying. To me this is the TRUE tale of Southern women- this trio of women IS me and my friends, and other women I've known. Everything rings 100% true to life, even to almost taking the secret of your famous cake to the grave. The author has the local Louisiana nuances right as well. Call it Redneck, but the people in this story are ones you know you could rely on in cases of trauma and drama. Like the Divine Secrets of the Ya Yas and Steel Magnolias, this book is bound to stand the test of time, as women recognize themselves, their friends and family in this book. It's hard to believe this is the author's FIRST book! Do NOT miss this one, it's gonna be the talk of the Spring! And if you want to make up your own Hummingbird Cake- check out this one from Southern Living, it's pretty near to our family recipe!"}, {"userName": "Connie Hess", "userReviewDate": "Dec 03, 2017", "userURL": "http://www.goodreads.com/user/show/15928044-connie-hess", "userReview": "What a waste of money!I tried and tried and made it to page 126 and couldn't stand it anymore.What a sappy, juvenile, sophomoric novel.Every chapter had us walking with her down memory lane for childhood recollections and then fast forward to current time, neither of which were remotely interesting!"}, {"userName": "The Books and Biscuits Blog", "userReviewDate": "Feb 09, 2016", "userURL": "http://www.goodreads.com/user/show/47131262-the-books-and-biscuits-blog", "userReview": "The Secret to Hummingbird Cake – Celeste Fletcher McHale (4.5 Stars)Celeste Fletcher McHale debuts her writing talents in The Secret of Hummingbird Cake. A purely-Southern tale, the novel follows the adventures of three best friends: Carrigan, Ella Rae, and Laine. Having grown up together in a small town, they know everything about one another. Together, Carrigan and her two friends have taken on every adventure, encouraged one another in their marriages and relationships, and been through every life event right alongside each other. However, life brings unexpected news for one friend, forcing all three to pull together in a way they have never experienced before. Along the way, they discover the mysterious secret ingredient for hummingbird cake and their once-in-a-lifetime friendship.Ms. McHale weaves an incredible tale of love, friendship, and faith in her debut novel. Readers will find themselves shedding tears of joy and sadness, as they feel drawn into a sweet Southern town and Ms. McHale’s remarkably well-written characters. Overall, I was very impressed with The Secret to Hummingbird Cake. While I’m not typically the person drawn to chick-lit novels that focus on a close-knit group of friends, I ended up reading this novel from back to front in one sitting. Ms. McHale offers incredible insight into women’s personalities and relationships with one another, accessing the full range of human emotion in a way few authors ever accomplish. She presents a conversational style in her writing that will draw in readers and keep them immersed in a compelling cast of characters, who seem to leap off the page in their realism. I found myself particularly awe-struck by Ms. McHale’s ability to communicate her characters’ maturing experiences with love and loss, as these topics seem nearly impossible to articulate in even real-life situations. After reading The Secret to Hummingbird Cake, I am very eager to read Ms. McHale’s writing in the future.Special thanks to BookLook Bloggers for the advanced copy of The Secret to Hummingbird Cake! Thanks!Brittany at the Books and Biscuits BlogPS. To see the full review, please visit http://booksandbiscuits.com/blog/2016.... Thanks!"}, {"userName": "Jess", "userReviewDate": "Jan 31, 2016", "userURL": "http://www.goodreads.com/user/show/28497722-jess", "userReview": "Whew... what a loaded book! I can promise you that you will not have that impression when you start the first few chapters. You may even consider putting the book down as you are introduced to spoiled, cheating, Carrigan who laments her husband is ignoring her and seeks to complete herself in ways not in her best interest. You will struggle to find sympathy for a thirty year old, stay at home wife, no kids, and a maid to help her because housekeeping is just beyond her. I truly felt like throwing the book at this point. But I am a committed reviewer and thought to keep going. WOW- am I glad I did. The rich beauty of the South, the friendship among women, and the capacity of personal growth moved me. You will come to love Carri's best friend, Laine, with her pureness of heart, loving nature, and her devoted love to her friends. Fun loving, no filter, Ella Rae completes the circle of friends. The book quickly turns from the focal point of Carri's marriage, to the fact that a friend is dying of cancer. The manner of her death is going to be on her terms; no chemotherapy or radiation, a death that will be inevitable.  Ella Rae, Carri, and Laine all are brought to a place that neither thought they would be in. I don't think any person really does. They handle impending death in several ways; graceful acceptance and loving planning for the aftermath that will ensue for friends/family, avoidance for awhile, asking why and lamenting to God how this could happen, and ultimately seeking solace in the arms of each other. This was such a rich, beautiful story that moved me to tears at the end. Celeste Fletcher McHale captured the beautiful side of the human spirit in this novel; I needed to see it. There are many beautiful quotes that touched me in this book: \"An American writer, Rita Mae Brown wrote, \"I still miss those I loved who are no longer with me, but I find I am grateful for having loved them. The gratitude has finally conquered the loss\" and \"Feed a stray dog when you get lonesome for me. Check on some of the older ladies in town that have no help when you get lonesome for me\" So beautiful.  Thank you to Thomas Nelson Publishing and Netgalley for allowing me to read this book in exchange for my honest review. It truly was a pleasure."}, {"userName": "Amy", "userReviewDate": "Mar 10, 2016", "userURL": "http://www.goodreads.com/user/show/9945907-amy", "userReview": "When I received a review copy of The Secret to Hummingbird Cake, I was not sure it would be my kind of book. Wow! I was very much wrong. I have never read a book that made me cry so hard on one page and literally have me laughing so hard I was yet in tears again. This has be one of my top ten favorite book I have ever read. I thought it was phenomenal. I already want to pick it back up and read it again. And I just finished reading it a few hours ago. It was that good. To me, it was reminiscent of Steel Magnolias. Now, I do need to warn the reader that even though this is listed as Christian Fiction, there may be some Christian Fiction fans who will be sensitive to some of its content. There is some mild cursing, alcohol use, premarital sex and adultery. Since, I am a reader of different genres, I was not too bothered by the content.I would highly recommend this book for readers 18 and up and for those who would not be sensitive to the aforementioned content. A definite keeper for me and I look forward to more by this author in the future.100 plus stars."}, {"userName": "Chelsea", "userReviewDate": "Feb 09, 2016", "userURL": "http://www.goodreads.com/user/show/15449584-chelsea", "userReview": "Words can't describe how much I love this book. The Secret to Hummingbird Cake is wholly absorbing and raw, but also so uplifting as well. It's real, authentic, and so beautifully written; it honestly had me laughing and crying at the same time which is a super strange sensation, but one I recommend if you're reading this book. Ugh, I'm still not over it; I want to read it again, and I'm sure I will. This novel is Southern lit at its best--so cool that it won an OKRA Pick! It definitely deserved it. It is not for the faint of heart, so if you want nothing but fluffy bunnies and rainbows made of candy I suggest you look elsewhere. But if you want an incredible novel about real women, beautiful friendship, adn the hilarity and heartbreak of dealing with real life, this is the novel for you. I can't wait to read what Celeste writes next."}, {"userName": "Sue ", "userReviewDate": "Jan 20, 2016", "userURL": "http://www.goodreads.com/user/show/690922-sue", "userReview": "This novel is about friendship - the kind of friendship between women that anyone is lucky to find. Carri, Laine and Ella Rae have been friends since elementary school and now in their 30s they are faced with all kinds of adult problems. They live in a small town in the South where every knows all about what is going on in everyone else's life and there are all sorts of eccentric characters. The novel centers around their friendship - first whether or not Carri's husband is having an affair and then over the health of one of the members of the group. I loved all three of the main characters - I live in the South and I know people just like them. I laughed with them and I cried with them and I hated to see the book end. This is a fantastic book and I will definitely be on the lookout for future books from this author. (This book was provided by NetGalley for an unbiased review)"}, {"userName": "Angie", "userReviewDate": "Aug 29, 2016", "userURL": "http://www.goodreads.com/user/show/1494253-angie", "userReview": "3.5 starsTearjerker at times, and had me laughing out loud in others! It's focus in my mind was friendship--Ella Rae, Laine, & Carrigan had something special for sure and it was fun to read about. The Secret to Hummingbird Cake was published by a Christian publisher, but wasn't glaringly so. Just the right amount, and also with human characters who don't always make the \"right\" choices. A kind-of secondary theme was marriage and fidelity. Full of \"southernisms,\" it will charm it's way into your heart & mind."}], "description": "“Why won’t you just tell me what’s in that cake?” I’d been trying to get Laine’s recipe for years. We all had.When all else fails, turn to the divine taste of hummingbird cake.In the South you always say “yes, ma’am” and “no, ma’am.” You know everybody’s business. Football is a lifestyle not a pastime. Food—especially dessert— is almost a religious experience. And you protect your friends as fiercely as you protect your family— even if the threat is something you cannot see.In this spot-on Southern novel brimming with wit and authenticity, you’ll laugh alongside lifelong friends, navigate the sometimes rocky path of marriage, and roll through the outrageous curveballs that life sometimes throws . . . from devastating pain to absolute joy. And if you’re lucky, you just may discover the secret to hummingbird cake along the way.", "title": "The Secret to Hummingbird Cake", "url": "https://www.goodreads.com/book/show/26893373.The_Secret_to_Hummingbird_Cake", "average": 3.9, "cover": "https://images.gr-assets.com/books/1448216463l/26893373.jpg", "reviews": 534, "authors": [{"url": "https://www.goodreads.com/author/show/14291669.Celeste_Fletcher_McHale", "name": "Celeste Fletcher McHale"}], "type": ["Fiction", "Womens Fiction", "Christian Fiction", "Contemporary", "American"], "outlinks": ["http://www.goodreads.com/book/show/26893373-the-secret-to-hummingbird-cake", "http://www.goodreads.com/book/show/28100468-the-secret-to-hummingbird-cake", "http://www.goodreads.com/book/show/26371039-the-secret-to-hummingbird-cake", "http://www.goodreads.com/book/show/30649391-the-sweet-smell-of-magnolias-and-memories", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}