{"ratings": 878, "userreviews": [{"userName": "karen", "userReviewDate": "Nov 26, 2012", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "i honestly don't know what to do with this review.because i feel bad for only giving the book 2 stars, but it just didn't work for me. and that doesn't mean it's not a good book or that it's not an important book, it just means that i, karen tiffany brissette, did not enjoy reading it. which is a drag, because i have liked every other book that i have read by her. this one seemed weak,but then in the endnotes, she says that this is the first YA book she ever sold, which i guess means it is a re-issue, although i can't find any real information on that on her site or anywhere. but it was almost a relief to learn that factoid, because now that i know this is not a \"new\" book, i can understand why this one came across as less mature and less potent than her \"later\" books.phew.the subject matter is very important, which is another reason i feel horrible for not liking it. it is about a boy who is brutally murdered, most likely because small town wisconsin doesn't like it when their churchgoing teenagers are rumored to be gay. or are artistic. or when they take portraits of other boys sweaty and shirtlessly napping after hard farm work.because as bubbled as i am here in new york, there are still pockets of this fine country where gay kids get beat up. where they don't have their own schools. where they have to hide one of their most salient, defining characteristics out of fear. and that's such a hard path, and if books like this can help someone struggling with this situation, or help one closed-minded person realize that no one has any business judging who likes what kind of genital, then i have to applaud the book for doing a public service towards a goal i would like to see realized.if only i didn't hate the narrator so much. his weakness, his waffling, his telling us time and time again that he is not himself gay, he just doesn't have time for a relationship, is why he doesn't have a girlfriend. and i think if it were written differently, it would have been more successful in fine-tuning the unreliable-narrator into something more nuanced, but it just reads flat, to me.oh, but i did like that the murdered character saw rhode island as a place to escape to; wanting to go to RISD, where he assumed people would be nicer to him. it's true, rhode island may be tiny, but we were founded by a buncha outcasts, so we're kinda laissez-faire.you have pleased the ghost of roger williams, ilsa j. bickbut you shouldn't listen to me - i'm just some old lady who is drinking wine alone on a friday night. i clearly have no business having opinions about anything. read this book, but know that as far as her writing goes, it gets better.didja see what i did there??cheers."}, {"userName": "Rose", "userReviewDate": "Feb 23, 2013", "userURL": "http://www.goodreads.com/user/show/3399699-rose", "userReview": "Initial reaction: Honestly I'm torn as to how to rate this because this was a very tough, raw read, and I need some time to meditate on it to explain my thoughts in full. In short sum, I thought this was a brilliantly told story of a boy who feels guilt over the murder of another - and his powerlessness of being able to do anything about it. Granted, what happens to Jimmy's character broke my heart, even made me cry, but while I could've raged at Ben's actions, inactions, and thoughts, I felt bad for him knowing he was a kid trapped in his own mind of grief, confusion, and overwhelming sadness in the aftermath of things. It's a novel that really handled the emotional resonance well for the situations, moralities, and issues it raises.Full review:It's been a while since a young adult book has blown me away for the subject matter like \"The Sin-Eater's Confession\" has. The level of the writing and the honest prose were a few dimensions, but tackling several tough subject matters in the backdrop of prejudice, a coming of age for its levels of grief within a small town really pulled me into the narrative.This is not a novel that will strike people the same way - it's rather controversial for the raw edge of what it shows - not just the backdrop of a prejudicial murder, but also for the raw emotion and several gory details that don't mince words in the portrayal. The story revolves around a young soldier named Ben who fights in Afghanistan and writes a series of letters during his tour.Ben carries a heavy secret that no one knows, and it all happened in the time that he was home with his parents as a senior in high school. He meets Jimmy, a boy only a bit younger than him, but seeming much younger. The two aren't friends in Ben's eyes, but they get along well enough in their brief interactions and he feels protective of the boy and willing to help him.Then the story starts unraveling a measure of many secrets and unfulfilled promises. Jimmy lives as a closeted gay boy who doesn't know how to tell others how he's different and what he truly wants out of life. He makes an attempt to tell Ben, but Ben's understanding of Jimmy is on shaky ground at best. Then, in the pursuit of aspirations, Jimmy takes a suggestive picture of Ben without his knowledge, submits it for a photography contest which he wins and gets rather notable attention for it.All heck breaks loose shortly after that. Because Ben lives in a small town prejudiced against anyone gay or insinuated to be gay, and there are some rather strong assertions by people in both Ben's and Jimmy's circles on the matter hurling accusations at both boys. Jimmy's father and priest ban Ben from visiting the boy because they think he's a \"bad influence\" on Jimmy (and Ben's upset about it). Even more, Ben distances himself from Jimmy in the wake of the controversy - not just for the betrayal of taking the picture without his knowledge, but for the implications it has on his own sexuality and he's not sure what to do with it. Jimmy's confused and desperate to have a friend and Ben's the only person it seems who can help him, but Ben doesn't act on his conscience until the very last possible moment.And then the inexplicable happens.This book made me misty-eyed on a number of levels. What happened to Jimmy, how Ben confronts the weight of his actions before the incident, his inactions during, and his grief in the aftermath which stacks one, after the other, after the other in bargaining. In Ben's words, there are a lot of \"shoulda, coulda, woulda\" considerations.What struck me was the raw emotional grief and honest dialogue that occurs in this entire narrative - both in the shaping of Jimmy's experiences as well as Ben's. It doesn't stray from talking about the tough emotions - the before, during, and aftermath of events even as Ben's recalling this confession years after it happened. It's a grief story, probably even more than it is a murder mystery (though that's a significant part of it), and I'll admit that I struggled to find words to put to how to best explain why I liked the narrative in this book so much. I know this is a book that will divide people for the portrayal, and there are many morality and grief prompts it raises, but I have to say that Bick's writing of this was very mature, raw, and doesn't pull its respective punches with emotional resonances. It's a story that hurts, and has dimensions in the weight it carries for all the characters it portrays in this narrative. It gets one thinking about several measures it raises, and most of you who know my reading tastes know that if a book gets me thinking about things long after I've turned the final page, that's a sign of a good read for me. Granted, there were many times I wanted to throttle Ben, asking why he thought the way he did and why he didn't act, but at the same time, I understood his emotional confusion, constant self-blaming, cyclical spiral of inaction and internal debate as the narrative went on.It's hard for me to say that I liked or loved this book in itself because it left me sucker punched and drained when it was over, especially because it ends on a note that leaves you in suspense as to what occurs in the extension of things. At the same time, I don't know if there was another ending that could've better punctuated the tone this took on - a constant mental bargaining that peppered the thematic of this entire narrative. I would recommend reading it if only on the measure it'll get people talking about the measures contained within it, and while it may not strike some the same way in terms of how they personally connect with the character(s)/situations within, it will start a constructive dialogue that will have one thinking about the weight of identity, morality, and grief after turning the last page.Overall score: 4.5/5"}, {"userName": "Giselle", "userReviewDate": "Nov 10, 2012", "userURL": "http://www.goodreads.com/user/show/4800103-giselle", "userReview": "Nope. No no no. Uh uh.You can say dead body. You can even describe how bloody it is. Or mention his guts or whatever. But I can't handle lengthy (this is page 3, now) descriptions of how a blanket of flies are eating his lips and laid eggs in his eye sockets, or how his splattered brain looks like melted butter. As much as I loved Ilsa's other book I think I may just vomit on this one for real."}, {"userName": "Cassi aka Snow White Haggard", "userReviewDate": "Feb 21, 2013", "userURL": "http://www.goodreads.com/user/show/2216677-cassi-aka-snow-white-haggard", "userReview": "4.5/5 starsThe Sin-Eater's Confession is a very dark and disturbing book. Not because of ghosts or horror, but because the realism and prejudice represented. The book is mostly internal dialogue, following the story of Ben who witnessed his friend Jimmy's murder. Nobody knows he was a witness and he can't bring himself to tell anyone. So he struggles with what he saw alone.According to everybody in town Jimmy was murdered because he was gay. Not that anyone really knew, but everyone suspected. There were also rumors about Ben and Jimmy, those were untrue, but they made Ben question himself and what he remembered about their friendship. This book isn't just about discrimination and homosexuality, but has an excellent commentary about the nature of how we \"know\" things and gossip.You know how they say no two people read the same book? For me this book is personal. In 2006 my 15-year-old cousin committed suicide. He way gay. (He was also bipolar which people like to de-emphasize). Losing someone to suicide is one of the worst things I've ever experienced. But the local media (who don't normally cover suicides but because they'd done an article about Josh earlier in the year covered his) made my cousin into the poster child for gay-suicide, boiling down a very complicated person with complicated problems to only his sexuality.What made this harder was that Josh told me he was gay when he was nine. Except he didn't say, \"I'm gay.\" He said he thought he'd been born wrong; that he should've been a girl. I was 14 (I think, maybe 13, maybe 15) at the time. I didn't understand. I just thought it was something strange Josh was saying (for the record this was not denial but extreme naiveté on my part). But it stuck in the back of my mind. When Josh died I was away at college and didn't really know what was happening in his life but that scene kept replaying in my head over and over again. I can still see it. We were sitting on top of a jungle gym at a campground. He was crying and then told me (Yes I still replay that moment).This book is not about suicide. Jimmy is murdered. But there are a lot of parallels between my experience with Josh's death and Ben's experience with Jimmy's. Everything from Jimmy trying to confess a secret (he seemed to be telling Ben he was gay but that's just speculation as the book points out) and Ben not understanding, to the media trying to make Jimmy into a poster child for discrimination, to all the self-doubt and questions in the aftermath, all the moments you replay over and over again.The voice in this book is very compelling. I instantly connected and related to the main character. I felt what he felt, probably partially because of my experience but also because the feelings expressed in the book are correct and authentic. Ben struggles with Jimmy's death, his friendship with Jimmy and what that means about him, the rumors and guilt over not saving Jimmy.The Sin-Eater's Confession does not hold back. It's terrible, descriptive and I had to set the book down on many occasions. But it's a book that shouldn't hold back. It's Ben's coping mechanism, his confession of everything he saw and the details he remembers. He's trying to understand what happened, trying to sort it out. Anything else would feel less truthful. Despite the gruesome events that are very very vividly described I couldn't stop reading. Near the end the book slowed, losing some of it's momentum, but overall it was a very satisfying read and meaningful novel.There's a giveaway over on my blog if you're interested in reading this book Giveaway! I received a galley from the publisher for reviewing purposes"}, {"userName": "Mónica BQ", "userReviewDate": "Jan 09, 2014", "userURL": "http://www.goodreads.com/user/show/27512341-m-nica-bq", "userReview": "The blurb of the books says it all. You don't need more than that. Told in a sort of epistolary novel, Ben recounts a story of a tragedy viewed from the very narrowed mind of a teen that simply doesn't know any better.An extremely well written account of a teenagers guilty conscience. It was very very painful to read, not just because of the gay undertones of the situation described, but for its very real portrayal of small- minded thinking.How fear so big is instilled in people for daring to be something or someone outside of a mold.I really liked that the book doesn't try to shed light on things and that in no way excuses Ben or the adults in the story. The whole book is made of Ben's thoughts and explanations and remembrance of the events that occur before and after Jimmy's death, but I appreciated that although Ben tries to make you sympathise with him he doesn't achieve it. Not completely.My only minor complaints are that at times Ben is either too naive or too stupid and that doesn't equate with the rest of his persona, and that the book dragged a bit which paired with the painful narration made me stop reading it several times. In the end the book leaves you to ask yourself the same questions it uses to introduce its narration:What do the living owe the dead?\"The thing is, every story has a beginning that sometimes doesn't become clear until you've made it nearly to the end...Or maybe your story starts when you're seventeen, and the life you thought you were destined to lead gets derailed.\""}, {"userName": "Pamela", "userReviewDate": "Dec 16, 2012", "userURL": "http://www.goodreads.com/user/show/3007527-pamela", "userReview": "I received an ARC of this from NetGalley. I tried reading Ashes by the same author and didn't really like it, but I figured a more contemporary, non-dystopian-bandwagon novel might be better.I feel really awful, but I really, really didn't like this. At all. It felt extremely drawn-out and tortured. It could have been a very, very good short story or even novella, but I feel like a lot of authors don't consider that--or maybe publishers don't want to publish it. Beats me. I was also interested because Ms. Bick is from Wisconsin and this is set in the fictional town of Merit, WI--your typical Great Lakes small town with cows and farmers and diners. This is a take on the small-town-as-evil-character premise, because everybody in this town is portrayed as blind to the faults of obviously evil people, brainwashed drones believing in a \"Christianity\" that promotes hate and bad rock music, and evidently everyone is white and straight. I'm sure there are a lot of towns like this (maybe nicer, I don't know). I've never been up by Wausau, but I do live in Wisconsin, and gee golly, aren't we Cheeseheads portrayed as a bunch of dumb backwater beer swillers. With cows. Ayyy. If the author wanted to do small-town evil, could she at least have specified that not everyone in Wisconsin is a) ruled by a terrible fear of the local church or b) hateful and awful? Yikes. Another thing I didn't quite get--related to the setting--Merit is supposed to be this tiny town, right? Especially compared with Wausau, which the narrator calls a real city because it has a Starbucks and 30,000 people. But Ben, the narrator, volunteers at a hospital that seems suspiciously far too well equipped to deal with the kinds of injuries he's talking about. I mean, there are guts everywhere and it's just like, ho hey, stuffed that guy's guts back in his belly. That kid we had to send off to some other hospital, though. ???Anyhoodles, about the actual story. I don't really think it's a spoiler to talk about the theme of the book, but if you think so, read no further.Okay? Okay. It's about being gay in a small town and being suspected of being gay by virtue of association with someone who is gay. The narrator, Ben, is applying to Yale because his mom wants him to (yawn), and he's super type-A in school, head of everything, blah blah blah. He's so busy that he doesn't have time for girls *dramatic pause* or so he says *double dramatic pause*. When Dru, a local farmer's son and sports star, dies, Ben starts helping the family around the farm. He acts as a sort of big brother to Jimmy, the younger brother, who reveals that he's passionate about photography. Only Paw don't take too well to that photografick voodoo, it bein' from Satan and all. Naturally, something happens that is a big misunderstanding and nobody can just TELL THE TRUTH ABOUT IT ALREADY (my #2 pet peeve in books) and so everyone is miserable and Very Bad Things happen. Our main character (not a spoiler, because we know it at the beginning) ends up going to war in Afghanistan and delightfully giving very vivid details of what happens when you are blown up by an IED. The book is supposed to be his confession about what happened, only nothing really happens and so there's not much to tell.A lot of the filler in the story here is the narrator trying to convince himself that he is not gay. I felt like every other paragraph was something like, \"No no no. I didn't feel that way when I hugged him. Oh no.\" The main character, Ben, talked to himself a lot. He was also a jerk and a horrible friend--even if being a friend meant more than a friend, you know? Still horrible.I'm not quite sure who this would appeal to. People who don't mind angst (?). Rabid fans of the author, perhaps? I also would like to note that the Kindle edition I used had a lot of strange \"pages\" that just looked like paper--I assume this was part of the artwork for the book, and this was an ARC, so I hope the publishers correct this before the launch. It was really hard to read and at first I worried that the copy I received was incomplete."}, {"userName": "Jenni Frencham", "userReviewDate": "Jun 27, 2013", "userURL": "http://www.goodreads.com/user/show/6906412-jenni-frencham", "userReview": "Ben is in the army, and he thinks he's going to die on his next mission, so he's taking time to confess everything before he heads out. When Ben was in high school, Jimmy was beaten to death because some people suspected he might be gay. Ben saw what happened and never told; since then he has felt responsible for Jimmy's death. I didn't really like this book. Ben's mother has been running his life, which is not an atypical storyline for a young adult novel, but Ben doesn't have that epiphany where he takes his life back and starts making his own decisions. Also, he's obsessed with telling the reader, as well as anyone else who will listen, that he is. not. gay. Perhaps he's deeply closeted, but if so, then he's still closeted at the end of the book. And the whole church coffee shop and religious musical group and homophobic pastor thing is weird, too, especially since Ben's family isn't religious. This book rambles a bit, like a confession would, but it's not very engaging. I didn't like any of the characters, and I didn't get to know Jimmy well enough to do anything but feel a bit sorry for him. Overall, this book felt like Absolute Brightness, but without the heart.Recommended for: teensRed Flags: alcohol use, profanity, graphic scenes when Jimmy is killedOverall Rating: 2 1/2 stars out of 5"}, {"userName": "Donna", "userReviewDate": "Jan 10, 2013", "userURL": "http://www.goodreads.com/user/show/2465264-donna", "userReview": "How did we end up here?Carolrhoda Lab + Ilsa Bick = GIMME NOWReally, it’s not rocket science. Hey, you want some Carolrhoda Lab books one of which is written by Ilsa Bick? Hey, do my lungs want oxygen?Okay, book. You've got 50 pages. Go!I’ve been reading Ilsa’s work since she published DRAW THE DARK and I’ve watched her craft develop over those years and I have to say she’s getting more and more succinct. The voice in SIN-EATER’S was immediately engaging (although the military aspect ended up being rather irrelevant at the end of the day) and before I knew it fifty pages were in my dust. While it still took a little while for the plot to get moving (in proper Ilsa fashion) the voice had a fresh immediacy to it that made any non-action seem exciting because of the weight behind it. I had to read more.What worked . . .The voice was probably one of the best and most intricately crafted I’ve read of Ilsa’s yet. As much as I ended up liking Christian in DRAW THE DARK the relatability here was immediate. I didn’t need to wait for anything to pick up. Just the right words were used to suck me in and keep me there, regardless of actual action on the page.As you read you watch the story spiral and it makes you want to reach out and grasp after it, as if you can pull it back and keep it from ever getting so incredibly out of control. I found myself trying to push Ben in the “right” direction and help him get out of the spiral he kept swirling himself into. And the thing is Ben really is an innocent bystander in all of this and he gets pulled in against his will, gets mixed up in something he has no control over and gets pegged as something he most definitely isn’t. It’s horrifying to watch and I kept cringing when the Cuppa Joy people kept getting involved, or Jimmy’s dad, because their reactions were so incredibly irrational it was astounding. It was like a car wreck you can’t help but slow down for and gawk.Over the course of the book you watch this kid that’s wound way too tight in one direction rather quickly unravel and then get wound too tight in another. He’s this rubber band that bounces from one twist to the next and you can see how he loses complete control of his life until the very end when he finally digs his heels in and has an effect on his world that HE actually makes. It’s sad to see him get to that point but empowering when he finally does.What didn't work . . .I know I probably shouldn’t say it because it was written that way for a reason but I didn’t like the end. It felt unresolved. Let’s just leave it at that for spoilers’ sake.And I didn’t think the military epistolary was really necessary. It served a purpose for that moment in the end but how it was portrayed throughout I felt came off a little forced. I get it. It’s an extreme but I think the effect would have been harder felt if, as the reader, I was blindsided by his decision instead of knowing he was going to make it from the very beginning. It was just a matter of when and how instead of a why and how come.And in the end . . .I found THE SIN-EATER’S CONFESSION a more palatable contemporary book to endure than many, probably because I was able to immerse myself in it far more quickly and it was a situation that ended up having a little bit of empowerment at the end but what ultimately wholly relevant to a far broader range of people. I don’t think there’s anyone that doesn’t question their sexuality at some point (and if they tell you they don’t they’re lying) and Ben has to deal with that amidst an incredible event he can’t get away from. Not to mention it’s all in the public eye. He can’t quietly ponder it in his head secrets. It’s there for everyone to dissect.Plus it also begs the question, what would you do? That whole fight or flight thing is a big discussion point for a lot of people and it really gets them thinking. And it’s a relatable fight or flight, not something steeped in zombies or a post-apocalyptic world or in a war. It’s home town, home-grown fear. While we have all this march forward for equal rights there are far too many places that are content in keeping it back. What do you do then?I didn’t like it was much as DARK THE DARK. I didn’t feel it in my soul like I did DtD but it was a good book. It’s engaging and entrancing and will really make you think about your own decisions, what you’ll say you’ll do and what you may ACTUALLY do, who you like and who you don’t, what kind of effect your words have on people. It’s an issue book without the issue being shoved down your throat with a message. It poses scenarios at you, makes you feel the intense anxiety Ben feels at times and then secretly asks you what you would do. It’s thought-provoking and I didn’t want to put it down."}, {"userName": "Stephanie", "userReviewDate": "Nov 19, 2012", "userURL": "http://www.goodreads.com/user/show/3822752-stephanie", "userReview": "I must start out by saying that I am a huge Ilsa J Bick fan! I discovered her with Ashes (which I almost didn't read but am SO glad I did!) and have clamored to get my hands on everything else since. With that said, when I heard this one was available, I had to get a copy as soon as possible! I was able to do that and immediately began the book. It didn't take long to realize that unlike all the others I read, where I would start and not stop until the last page, then re-read multiple times, I needed to take a different approach with Sin-Eater's Confession. This one deserved to be read slowly. That is not easy to do. This is not a book filled with constant, or near constant, action. It is not a book that will keep you on the edge of your seat at all times waiting for the other shoe to fall, to see who dies. You know who dies from the summary on the back. You even get an inkling how he dies. What keeps you on your seat is seeing just how far reaching that death is. And it does. It reaches physically, mentally and emotionally well beyond one person, or even one family.There are several relevant issues addressed in this book. There are elements of domestic violence, underage drinking, homosexuality, bullying, invasion of privacy, \"tiger mom\" syndrome, sibling rivalry, war, forced and enforced religion. With this many issues, the chances of the book and characters becoming either too shallow to relate to or too scattered for you to care is great. Somehow, and I don't know if it's Ilsa's background in psychiatry, the Air Force or the strength of her own character and convictions, but somehow Ilsa pulls it together. And you give a damn about the characters and what is happening to them. You may not always like or agree with them, but you find yourselves caring. Even the characters that you don't see that often, you can sympathize with their reactions, or detest them because of their inaction. You can relate. I think most of us have met someone from this book, even if you have never lived in a small town. Maybe we have reacted in the same way as the characters and maybe we have taken a different path. But the fact remains, we have all seen this. We just didn't realize how our response would reach others. Ilsa has given us one scenario. And, unfortunately, it's not that far fetched.Bottom line - I am only upset that I cannot talk freely about this book with others until March! I hate spoilers and will not post them here. However, once I can discuss this book freely, beware anyone who asks a casual question! I love the Ashes trilogy (so far!) and I know that series are the thing in publishing now. However, we all need to pay attention to Ilsa's standalone novels. She manages to wrap up the story, not always with a red bow on top and a nice neat ending, but you will not feel cheated by the end. She leaves room for interpretation and personal experience without skimping on the characters and details. With what she gets in a novel, they should be the size of War and Peace but they are \"bite-sized\" compared to that tome. And yet, they bring a new world to each reader and leave you full. She makes you think and feel and I appreciate the way in which she does it."}, {"userName": "Annette", "userReviewDate": "Dec 31, 2012", "userURL": "http://www.goodreads.com/user/show/8853519-annette", "userReview": "Bick has done it again with The Sin-Eater's Confession. The book had me riveted throughout the entire story.I enjoyed the way The Sin-Eater's Confession was written. We learn that our main character (I don't know his name, and I'm not sure it was ever used) is in Afghanistan. He's ready to volunteer for a mission from which it is quite likely he won't survive. But first, he has to get something off his chest. He's been hiding a secret that is eating him up, and he's going to write a letter and tell us about it.He was a straight-A student and had applied to attend Yale. He wanted to be a doctor. He worked two jobs, volunteered in the local ER, studied, took a couple of college courses, and didn'tt have much time for anything else. But when a friend dies, he helped out on the family's dairy farm and ends up taking his friend's little brother, Jimmy, under his wing.This leads to all kinds of problems, and I really don't want to go into too much detail. Jimmy does something to make his parents so mad that they take him out of school, and forbid our main character from coming near him. Jimmy has also ruined the reputation of our main character, making everyone think they might have had a homosexual relationship.Things spiral out of control. A most interesting aspect is living this through the eyes of our main character. He's questioning his relationship with Jimmy just like everyone else. He's never had a relationship with a girl, so does that mean he's gay? The inner dialog is realistic and heartbreaking.Everything gets worse when he witnesses some violence and does nothing about it. We see him struggling to decide what to do (and making some really stupid choices) and because of this inner turmoil the rest of his life pretty much falls apart.I couldn't put The Sin-Eater's Confession down. I was riveted, wondering what he would decide to do. Wondering how he ended up so far from his original path. The family dynamic is excellent. His parents are caring, but not perfect. He doesn't have many friends, but he uses them effectively. The town was, unfortunately, probably typical of a small town. \"We don't have any gays here.\" And the pastor and his followers are creepy and awful.The Sin-Eater's Confession uses a somewhat dramatic situation to describe absolutely realistic reactions. Bick has a background in psychology, and it is much evident in The Sin-Eater's Confession. Fans of realistic fiction won't want to pass this one up."}, {"userName": "A Book Vacation", "userReviewDate": "Mar 06, 2013", "userURL": "http://www.goodreads.com/user/show/3558850-a-book-vacation", "userReview": "To see my full review:http://bookvacations.wordpress.com/20...This is one of those books that punches you in the gut, mainly because you cringe for the main character, his bad decisions, and the fact that this really could happen. We learn the sad and often gruesome details of this story through the penitent letters of Ben, an extremely sad character who, a victim of circumstance, was at the wrong place at the wrong time, both literally and figuratively. We often ask ourselves, “what if?” when dealing with tragedy. This entire novel hinges on the “what if” as Ben slowly recounts what happened in his hometown of Merit, a place set in its bigoted ways, as he looks back on his not so distant past.Jimmy is a young teen who, faced with narrow-mindedness and prejudice, looks for a different means of expressing himself. Upon the revelation of some sexually charged photos published in a national magazine, both Ben’s and Jimmy’s lives are thrown into turmoil as Ben struggles to clear his “good name” and Jimmy attempts to appease his father and pastor. One lie leads to another, and suddenly the world is turned upside down for Ben, though at no fault of his own. Yet, as he attempts to make Jimmy understand, the unthinkable happens. Murder. In a small town. A hate crime. And Ben saw it all.I have to admit, when the novel first opened, I wasn’t exactly sure where it was going to go. It starts off rather slow, and we learn that Ben has indeed escaped his small town, but he hasn’t escaped his memories, and it is these memories that slowly eat away at his mind. Hence, the letter format that Bick employs as Ben attempts to purge his soul. It is ingenious, and it isn’t until the very end that readers understand the purpose of the letters. Thus, I highly recommend that, though the graphic nature of the novel is tough at times, readers should continue onward to the conclusion. It is an amazing, sad story.This is a breathtaking novel that is all the more scary because it could easily happen, though society would like to think that we are beyond this brutality. The Sin-Eater’s Confession is a eye-opening novel that stares intolerance in the face. Gruesome and graphic, yet palpable and poignant, Bick’s novel is not one you’ll soon forget."}, {"userName": "Elise (TheBookishActress)", "userReviewDate": "Feb 15, 2016", "userURL": "http://www.goodreads.com/user/show/52545435-elise-thebookishactress", "userReview": "I'm sorry, but this is just torture porn masquerading as symbolic, deep writing. Bick uses the small town environment to create a horrible, terrifying atmosphere. Everybody in this town is a homophobic idiot. Including our protagonist. Bick does get credit for making a very claustrophobic environment, but after a while the town and environment was SO terrible, with no happiness in sight, that I couldn’t bring myself to care anymore. That’s the main issue here; the book is so fucking depressing and there’s no hope to be found anywhere. The gay character is brutally murdered and it changes nothing. The tragedy doesn’t even make our main character develop. He’s an asshole who is absolutely convinced he’s not remotely gay up until the end. I’m going to say this once, so please don’t ignore it anymore, authors. If a story has a tragic ending, it needs to show something about the human spirit. Tragedy for tragedy’s sake isn’t creative or interesting, especially when you’re working with lgbt characters. Not a single remotely happy thing happens in this entire book. It’s exhausting and pointless. I really recommend not reading it."}, {"userName": "Stephanie", "userReviewDate": "May 20, 2015", "userURL": "http://www.goodreads.com/user/show/5953807-stephanie", "userReview": "It is very unusual that I give a novel 4 out of 5 stars. But this book was special. I really can't even say that I liked it because it was so \"painful\" to read. The subject matter is about hate, the time when things may be fluid (as I see it) in a teenagers sexuality and the attitudes around that growing awareness in them. It is about the intolerance in others around that time period. It is a painful book about that time. I can't say that I \"liked\" it but I was fully invested with the story line, the people and their out come. It is stated as a young teen book (14+), but I see it as a book that would be good for teen or adult to read. I highly recommend this book for the thoughts and awareness that it might make you look at in yourself.Well done Ilsa J Bick, on all fronts!"}, {"userName": "Sara", "userReviewDate": "Apr 20, 2013", "userURL": "http://www.goodreads.com/user/show/19613652-sara", "userReview": "This book was graphic; it was intense and it was uncomfortable at times. That said, when I finished I felt like I was left reeling because it sticks with you.There's a message there, about finding who you are, knowing what you want, and the point when children begin to separate themselves from their parents and become their own people. The horrible things that happen in this book? They are made worse by the fact that similar things have actually happened before.Not sure how I would go about recommending this book to the teenagers in our library. It's an upsetting read, but for someone it could be an important one. Might have to be a case of someone specifically asking for something intense/dealing with issues of homophobia and identity."}, {"userName": "Hannah", "userReviewDate": "Apr 19, 2014", "userURL": "http://www.goodreads.com/user/show/3115053-hannah", "userReview": "Too stressful and hurt too much. I didn't think it was worth the heartache. Gore and violence don't bother me but the constant vigilance and paranoia the main character displayed really unnerved me. Way too many unanswered questions."}, {"userName": "Rabbit {Paint me like one of your 19th century gothic heroines!}", "userReviewDate": "Jul 16, 2017", "userURL": "http://www.goodreads.com/user/show/4709630-rabbit-paint-me-like-one-of-your-19th-century-gothic-heroines", "userReview": "Rating: 3.5 Need to be reviewed."}, {"userName": "Elizabeth Sanders", "userReviewDate": "Feb 17, 2018", "userURL": "http://www.goodreads.com/user/show/77504308-elizabeth-sanders", "userReview": "now that, my friends, is how you write a mystery-crime thriller. can i pitch the idea for this to be made into a movie? the letter format/story-telling would make for a much more enthralling and dark version of forrest gump. (minus jennnaaaayyyy and plus a murder)"}, {"userName": "Roben", "userReviewDate": "Nov 25, 2016", "userURL": "http://www.goodreads.com/user/show/6931436-roben", "userReview": "The story begins with Ben in Afghanistan. He's a medic. And he's about to volunteer for a mission that could be his last. Before he goes, he decides to write a \"confession\" of what happened over the span of about a year way back in high school in small-town Merit, Wisconsin. (He enlisted in the Navy when he was a senior? About 3 years ago?) Anyway -- near the end of his junior year, he befriends a boy, Jimmy Lange, who is a year younger than he is. Jimmy's older brother, Del, was killed in a pretty horrible car accident. And Ben and his dad help out on the Lange's dairy farm. Ben treats Jimmy as a sort of kid brother. Del was a football star; Jimmy is nothing like that. He likes photography. And taking candid photos. And Mr. Lange doesn't really understand - or like - Jimmy. He berates him and - eventually - physically abuses him. Jimmy, unbeknownst to anyone, enters a photo contest that includes a photo of Ben. The picture was taken while Ben had fallen asleep in the barn after an exhausting morning of haying. He had taken his shirt off and the picture comes across as erotic. Ben realizes that Jimmy has a bit of a crush on him. When Jimmy places second in the contest, all hell breaks loose. Mr. Lange accuses Ben of seducing Jimmy and leading him into all kinds of activities which Ben has never even considered. Unfounded rumors begin to fly. Ben is angry with Jimmy and confronts him at his job, Cuppa Joy - a local Christian coffee house. Things don't go well. Jimmy asks Ben for help and - for some bizarre reason that I have yet to figure out - Ben decides to do that. Instead of helping, he witnesses Jimmy's murder. He runs away; he doesn't tell anyone. Jimmy is left to die a terrible death (which is described in pretty gruesome detail) and Ben could have -- not necessarily saved him but certainly have done more than he did. And thus begins Ben's descent into a pit of guilt hell. And that's the story. Ben's rehashing of Coulda Woulda Shoulda. The author is a psychiatrist, I believe? And there is a lot of psychoanalyzing going on. But there is also zero resolution. The book just - ends. Ben finishes his confession. No resolution. No idea who actually murdered Jimmy. It was just -- I hate to say a waste of time? But basically - yep. I really have no idea what the author was trying to say -- that hate crimes still exist? Yes. We know that. That guilt is not a good thing? Maybe. That confession is good for the soul? Also maybe -- only it took Ben three years to get around to that fact... Again - not sure. I honestly cannot think of a teen that I would recommend this book to. It was, for me, a disappointing read."}, {"userName": "Mandy", "userReviewDate": "Feb 10, 2013", "userURL": "http://www.goodreads.com/user/show/998669-mandy", "userReview": "Ok, Ilsa. You win. Your books are kicking my ass. And they KEEP kicking my ass long after the last page has been turned and devoured. And I agree with your protagonist: some people might want to know everything that happened, and say \"that's it?!\" But I get it. I see. And I'm OK. Well, I'm NOT OK, but I understand. And I'll have to confess: I stalled out about 100 pages into it. It was almost PHYSICALLY uncomfortable for me to continue. I was so upset. I'm glad I finished it, but to be inside someone's head and heart like that for so long leaves an inmprint in your mind that just...lingers. I need some time to really form a great book review, but for now, here's the basics:Did I like it: Yes. I found it incredibly well-written (as usual). The protagonist is incredibly believable. He's a real kid: flawed and smart and sensitive. To quote the author: \"I can't even...without choking up because I do think that Ben's struggle- his desperate attempts to figure out just who he is and what he believes- are ones every kid knows. Because, really, where does a person begin and his parents leave off? How do you know when you've had an original thought or feeling not predicated on where you came from, what you've been taughtm or whom you love and wish to please?\" Yes. THIS. Also: \"You think you live in a world where these things can't happen? That adults don't act this way? That a kid can't lose sight of himself- if he even knew whom that person was to begin with? Guess again.\" I guess the reason why Ilsa Bick's books haunt me is that they are just so damn...plausable. Believable. Realistic. Heart-wrenching. Her narrative voice is so clear, so distinct that the weil of fantasy is just that more diaphanous. You BELIEVE her characters. You SEE the townspeople. You FEEL the...feelings. Would I recommend it: Yes. I would. I feel like too much is skirted, especially when it comes to controversial topics. We live in an age of book banning and prents who seek to hide the truth, the ugly reality of life, from young people. So what happens when it hits them in the face? What happens when a lonely girl is caught up with a teacher? When an innocent boy witnesses a horrible crime? When mental illness creates a stigma that proliferates through an entire town? These are the real things all around us, and Ilsa meets them head on. This, I respect. Would I recommend it to any Joe on the street that somes in? No. I would think carefully and try to place it in the hands of someone who maybe needs it, or gets it or can appreciate it."}, {"userName": "Liviania", "userReviewDate": "Jan 16, 2013", "userURL": "http://www.goodreads.com/user/show/1430644-liviania", "userReview": "When local football player Del dies, Ben volunteers to help his family around the farm and eventually takes a job there. He takes Del's little brother Jimmy under his wing, but things change when Jimmy places second in a national photography contest. One of the photos is a sexually charged image of Ben that fuels much gossip and speculation in their small town of Merit, Wisconsin.You know where Ben ends up from the beginning. THE SIN EATER'S CONFESSION is framed by Ben in Afghanistan, serving as a Medic, and writing a letter explaining what he knows about Jimmy, then deciding who to send it to. They mystery is what happened to Jimmy, and not even Ben knows the whole story, though he probably knows more than most.THE SIN EATER'S CONFESSION reminded me strongly of WHAT HAPPENED TO LANI GARVER and ABSOLUTE BRIGHTNESS. It felt regressive at times, given how bigoted and unaccepting the people of Merit are. But the novel makes a valid point in the novel that not every town is progressive, and right now being born somewhere where being gay is okay is still a matter of good luck.The strengths of THE SIN EATER'S CONFESSION lie in Ben's voice and the ambiguity of people and events. Ben is profoundly affected by people making assumptions about him, so he tries to refrain from making assumptions about others. (He's also pretty clueless about when people are obviously into him.) At the same time, he has his own prejudices that color his perceptions. Although sometimes he is clearly right, because Jimmy's dad is a piece of work.The main weakness is that the plot gets increasingly preposterous as the story goes on. By the end of THE SIN EATER'S CONFESSION, Ben has done so many bone-headed things that it's amazing he's still alive and not in jail to enlist. I don't want to refer to enlisting as a bone-headed thing. Ilsa J. Bick is pretty fair about the pros and cons of the armed forces and why people might choose to enlist during a time of war. But by the end of THE SIN EATER'S CONFESSION, I was having trouble suspending my disbelief.This is the first book I've read by Ilsa J. Bick, though I know her Ashes books are very popular. The end notes state that this is the first book she sold, and so I do feel a little as if I should approach THE SIN EATER'S CONFESSION as a debut work as well as a novel by an established writer. It's got a great voice and raises some interesting questions, but it's pretty messy. Recommended for fans of unsolved mysteries and LGBTQ themes."}, {"userName": "Elizabeth Drake", "userReviewDate": "Jan 24, 2013", "userURL": "http://www.goodreads.com/user/show/2230747-elizabeth-drake", "userReview": "This and other reviews can be found on Reading Between ClassesCover Impressions: The cover is what first drew me to this book. I loved the image of the letter and how it was a little faded and travel worn. The scratched in lettering and the blood add an element of mystery and an interesting edge. The Gist: When Ben befriends a young boy who had lost a brother, he never thought that this decision would change the course of his life. When Jimmy reveals just how deep his feelings are for Ben, the town erupts with anger that a gay boy might be living among them. Ben struggles with his feelings of anger at having been duped and obligation to the boy that he cares about. When those responsibilities reach from beyond the grave, Ben tries distance himself from question, while at the same time attempting to seek out a killer.Review:The Sin Eater's Confession had a lot of flaws. Firstly, the main character was despicable. He was unlikeable, cowardly and an all around lame-ass human being. Whenever given the chance to prove himself and make a decision that might actually benefit someone else, he took the selfish way out. He seems like a very intelligent young man, but the entire book is based around the stupid decision that he continuously makes.The writing featured a great deal of conjecture in the main character's head. This was boring. repetitive and, ultimately, pointless. We were forced to tag along for the ride as Ben whined about his horrid little life with parents who love him and a looming admission to Yale, when it was abundantly clear that other characters had actual important issues to deal with. The book also featured frequent graphic descriptions of suicide and murder. These were crass and disturbing. While the use of this language appears to be intended to be edgy, it comes off as gruesome instead. I never really understood the point of the big cover up conspiracy. It felt like page after page where nothing really happened and, in the end, nothing was resolved. This book just did not work for me. Even with the issues that I had, all could have been redeemed with a killer psychological and surprise ending - but that simply wasn't the case. Teaching/Parental Notes:Age: 16 and upGender: BothSex: Some description of naked bodiesViolence: Child abuse, Murder, Graphic descriptions of a dead bodyInappropriate Language: Piss, Ass, Jesus, Shit, Fuck, BastardSubstance Use/Abuse: Underage Drinking"}, {"userName": "Aaron Leventhal", "userReviewDate": "Dec 05, 2017", "userURL": "http://www.goodreads.com/user/show/71320976-aaron-leventhal", "userReview": "What an incredible book! This book takes the reader on a journey of a boy who experiences the tragedies of being a human, of running from conflict, and how SELF is shaped. It is a very exciting, relatable, and enjoyable book."}, {"userName": "Sophia", "userReviewDate": "Jun 21, 2014", "userURL": "http://www.goodreads.com/user/show/12941422-sophia", "userReview": "Finally! A four star read. Well, actually it's more like 3.5 stars for the lack of a proper ending. (When I read a mystery/thriller book, I expect to know \"who dun it\" by the end of the book. I appreciated with Bick was trying to do with the ambiguous ending, but appreciating and liking are two different things.) Minus the ending, this book had a lot of good things going for it. First, there was a strong protagonist voice. A rarity inside YA fiction. While I didn't actually like Ben as a character (nor do I think you were supposed to) I was impressed at how much Isla J. Bick brought us into his head. His struggles, his guilt, and the slow rise of his paranoia and mental instability was fascinating to read about. The other characters in the book however, while fleshed out and decently written didn't hold any particular interest to me. The Sin-Eater's Confession though is a book driven by its plot, not by its side cast. Usually books like that aren't my cup of tea but I couldn't help but being drawn into this one despite that. The plot was both suspenseful and engaging, the atmosphere reminiscent of \"I Hunt Killers\" one of my favorite thriller/suspense YA novels. The gore level, and amount of disturbing description of dead bodies was also present in The Sin-Eater's Confession as well. (the fly eggs in the hollow sockets of the victims eyes was a real stomach churner - looks like Bick might give Lyga a run for his money.) This book had me on the edge of my seat almost all the way through and is the only read this year that thoroughly and utterly grossed me out. Thank Bick, you have added a new depth of nastiness to dead bodies. Overall, an engaging and fascinating read with a good premise and excellent first person narration. 3.5 stars."}, {"userName": "Ellen Zarate", "userReviewDate": "Nov 22, 2015", "userURL": "http://www.goodreads.com/user/show/29368222-ellen-zarate", "userReview": "Sometimes what we don't do is just as important as what we do. Ben is as real a character as I've ever met and this Yale-bound, destined-for-greatness 17-year-old's life is turned upside down by one bad decision that snowballs.This story, Ben's story, is about the complexity of growing up under the burden of parental expectations. It is also about the complexities of coming of age. Finally, it is about horrific injustice, hatred and the hate crimes it spurs, and the damage caused by words and weapons. Truly a gut-wrenching read. Highly recommended for people who can handle these very uncomfortable themes."}, {"userName": "Emily", "userReviewDate": "Jun 28, 2013", "userURL": "http://www.goodreads.com/user/show/3879054-emily", "userReview": "This book absolutely killed me. Its excellence completely snuck up on me and before I knew it the book was under my skin in ways a book hasn't done in a while. Though it took a while to read, because the school year has started and I'm back at work and have less time to read, when I *was* reading it I couldn't put it down, and it made me almost miss my bus stop on three occasions. It was horrifying, and beautiful, and chilling and heart-wrenching, and everything all at once and THE ENDING. THE. ENDING. This is one I need to own, and reread, and loan and share with others, because it is brilliant."}, {"userName": "Karyn Silverman", "userReviewDate": "Feb 05, 2013", "userURL": "http://www.goodreads.com/user/show/1430746-karyn-silverman", "userReview": "Review notes: Repetitive. drags. Slightly incredulous but may be Northeast in me.Good voice but character limited. Not sure I believe he joins the military.Sort of morphs into murder mystery but then it isn't.Overall lots of flaws.Applaud lack of any answers. Deplore back and forth at the very end tho, which overdoes it.Too much focus on Ben rather than what's his name. See, I forgot the name. Not a good sign.Characters: only one really exists at all; all others are ciphers. Maybe sign of narrator's limited vision?Plot: eh. all over the place. Premise not terrible, but military stuff shoehorned in."}, {"userName": "Elizabeth", "userReviewDate": "Aug 02, 2014", "userURL": "http://www.goodreads.com/user/show/33598566-elizabeth", "userReview": "The ending infuriated me ! That being said I did really enjoy this book. I haven't read any of her other books but this one was fantastic and i will have to pick up one of her other books to see of it's as good"}, {"userName": "Julie", "userReviewDate": "Mar 28, 2015", "userURL": "http://www.goodreads.com/user/show/31927759-julie", "userReview": "Disturbing, suspenseful, and I can't stop thinking about it."}, {"userName": "Librariann", "userReviewDate": "Jul 08, 2014", "userURL": "http://www.goodreads.com/user/show/126589-librariann", "userReview": "In spite of the disappointment i felt for the second Ashes book, I really like Ilsa J Bick. This was no exception. No answers, but well done."}, {"userName": "Sonja", "userReviewDate": "Jun 14, 2014", "userURL": "http://www.goodreads.com/user/show/1081017-sonja", "userReview": "Intense. Sad. Ben was a mess and made so many bad choices. I wanted to scream at him, but also really liked him and wished I could help. Infuriating and so interesting."}], "description": "People in Merit, Wisconsin, always said Jimmy was . . . you know. But people said all sorts of stupid stuff. Nobody really knew anything. Nobody really knew Jimmy. I guess you could say I knew Jimmy as well as anyone (which was not very well). I knew what scared him. And I knew he had dreams—even if I didn't understand them. Even if he nearly ruined my life to pursue them.Jimmy's dead now, and I definitely know that better than anyone. I know about blood and bone and how bodies decompose. I know about shadows and stones and hatchets. I know what a last cry for help sounds like. I know what blood looks like on my own hands. What I don't know is if I can trust my own eyes. I don't know who threw the stone. Who swung the hatchet? Who are the shadows? What do the living owe the dead?", "title": "The Sin-Eater's Confession", "url": "https://www.goodreads.com/book/show/16075882-the-sin-eater-s-confession", "average": 3.6, "cover": "https://images.gr-assets.com/books/1352637963l/16075882.jpg", "reviews": 179, "authors": [{"url": "https://www.goodreads.com/author/show/143691.Ilsa_J_Bick", "name": "Ilsa J. Bick"}], "type": ["Young Adult", "Mystery", "Realistic Fiction", "Lgbt", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/16075882-the-sin-eater-s-confession", "http://www.goodreads.com/book/show/18464861-the-sin-eater-s-confession", "http://www.goodreads.com/book/show/18354143-the-sin-eater-s-confession", "http://www.goodreads.com/book/show/9975679-ashes", "http://www.goodreads.com/book/show/11320138-shadows", "http://www.goodreads.com/book/show/12083233-drowning-instinct", "http://www.goodreads.com/book/show/15947841-monsters", "http://www.goodreads.com/book/show/13449631-white-space", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/9409759-powers", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/40192858-dragon-rider"]}