{"ratings": 7350, "userreviews": [{"userName": "karen", "userReviewDate": "Aug 31, 2014", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "so, i just loved this book.it's an incredibly strong debut, and i want this guy to quit his job at his venture capital firm (!!!???) and focus full-time on writing, because he is a natural born storyteller, and this book was fantastic, and i don't even know why!because there's not a lot that is \"new\" here. i've read gritty coming-of-age novels before. i've read about dysfunctional families who have experienced tragedy. i've read about the way small communities huddle together and share a history and know each other's secrets, even if they don't publicly acknowledge them. i've read about hate crimes. i've read about the devastation following the \"development\" of rural areas. i've read all kinds of appalachia. but there's just something about this book that is so fresh, so appealing. and i think a lot of it comes down to narrative flow. there's an ease to the writing of the first 2/3 of the book (more about that later) that is… delightful. it's not particularly sparkly-luminous prose, but there is something charming about his storytelling that sucked me right in and kept me completely immersed in his story. but.around the 2/3 mark, the action moves up into the mountains, where the characters are going on a \"tramp\" through nature, and that's where it started losing me a little. it's not that nothing happens while they are up there, because it surely does, but it got a little more didactic than it was up to that point. a little too on-the-nose preachy about the evils of mining companies raping the earth. within the situation it makes sense, but to a reader, it's a little too much telling at the expense of showing. and there are also some awkward insertions of mountain medicine that seem clunky. from that point on, i found myself a little less engaged in the story than i was in the parts leading up to that transition, but it didn't run the book for me - it just brought it from a five star \"best book ever\" to a very respectable four star \"loved it\" rating. the ONLY other thing i was conflicted about was the main character, kevin. he is supposed to be 14, but he reads a lot younger. he's a little naive, and comes across more like 12. i understand why he is older, since he needs to be physically strong enough to handle some of the later scenes, which would be unrealistic for a 12-year-old, and i loved the way he shades into understanding through his experiences, so i wouldn't sacrifice that by having him be more savvy, but it's just something i had to adjust in my head while i was reading. a flaw, but not a deal breaker. not at all. it's a little reminiscent of stephen king's \"the body,\" which is me paying a compliment, not crowing \"derivative,\" because if there's one writer who does a strong coming-of-age book, it's stephen king. i definitely recommend it if you are into these kinds of stories, because despite my caveats and quibbles, i enjoyed so many of this book's quiet moments, and the poignancy it evoked in my robot heart. seriously, dude, stop venture capitaling, because no one even knows what that is."}, {"userName": "Pouting Always", "userReviewDate": "Apr 02, 2017", "userURL": "http://www.goodreads.com/user/show/48650982-pouting-always", "userReview": "[ the passage about Mr.Paul going back to the earth after his death and tying it to his abusive childhood, I literally cried  (hide spoiler)]"}, {"userName": "Annet", "userReviewDate": "Dec 31, 2014", "userURL": "http://www.goodreads.com/user/show/1166369-annet", "userReview": "Now we both were silent, staring into the fire at the dancing light of the single flame and at the flame's reflection on the sweating walls; listening to the slow drip of water somewhere down in the cave and the irregular popping of dying coals; fresh friends from completely different worlds faced with the hard shapings of truth and deceit, of right and wrong, and of the equivalent damage when high expectations and low expectations are devastatingly unmet....A beautiful, tender and sad coming of age story of Kevin, who goes to live with his pops in a small mountain town, together with his grieving mother, having lost his young brother in a tragic accident. In town, pops is involved in a fight of the people saving the mountains from the destroying and even criminal mining activities. Slowly involved, Kevin start a healing process, helped by his new mountain friend Buzzy and his wonderfully wise and tender pops. Wonderful read, gearing between still and tragic moments. Lots of beautiful wilderness images come vividly to mind while reading.... reminds me of my many hikes in the Rockies wilderness mountains in US and Canada. Beautiful writing. 4+ stars & recommended! One of my highlights in 2017!Men like Bubba Boyd think the earth owes them a living. They take whatever wealth the can from the mountains and move on. I actually feel sorry for him, I really do. He can't for the life of him see the simple beauty in a waterfall or understand the importance of history and place...."}, {"userName": "Carol", "userReviewDate": "Apr 22, 2015", "userURL": "http://www.goodreads.com/user/show/7668522-carol", "userReview": "OH. MY. GOSH. Don't think I'll ever be able to erase the horrific description of Joshua's tragic death from my mind. (no spoiler here)........AndI want to begin by stating I absolutely love Pops and Kevin and Buzzy and Rudy Rae.....these wonderfully well-drawn characters who fill the pages of this touching coming-of-age story.It's 1985 in the eastern Kentucky Appalachia during a time of land destruction, and fourteen year old Kevin is burdened with the blame and guilt of his little brother's death until the amazing Dr. Peebles (Pops) comes to the rescue giving him the loving attention and positive encouragement he needs to ease his pain.This magical story takes the reader on a wild adventure of survival with a killer on the loose and vividly describes a brutal hate crime, but aside from the evil acts of violence and prejudices, the main theme of the novel revolves around love, loss, and redemption..........And\"What happened was not your fault.\""}, {"userName": "Diane S ☔", "userReviewDate": "Jul 23, 2014", "userURL": "http://www.goodreads.com/user/show/4159922-diane-s", "userReview": "After the horrible death of his younger brother, 14 year old Kevin and his mother come to a small mining town in Kentucky, within the Appalachian mountains. His mother is nearly catatonic with grief and it is hoped that returning to her Father's house will help heal her.Kevin quickly makes friend with another boy, Buzz who lives in one of the hollows, and their days are spent hanging in a tree house, tromping through the woods and camping in a cave said to be haunted. Though everything is thought to be wonderful there are deep undercurrents of anger and mistrust running through this community. The mines have been closed and now the man from the family who made a fortune from the mines, is blowing the top off of the mountains to access the coal from the top and a local man, who is also gay, is the main person standing up to him.These things will come together in a horrifying way, a way that will leave Kevin and Buzz no longer children. This is a beautifully written book, the description of the hollows, the mountains are at times beautiful and at times devastating as we see what the mining has done to this beautiful place. What fear, anger and suspicion does to this community and the people within. It is an adventure story, an ecological lesson and a social injustice all combined to make this a wonderful if at times sad story.For everyone who has loved a time and place that has been changed by progress or greed this is the book to read. At the finish of this book I felt nostalgic and angered about how much people are willing to sacrifice for reputation and money. Things that can never be replaced, things we should value, but don't.This is the first book by this author but I have a feeling he will be around for a long while, I certainly hope so anyway."}, {"userName": "Greg", "userReviewDate": "Sep 21, 2014", "userURL": "http://www.goodreads.com/user/show/42508-greg", "userReview": "[I could compare the novel to the football playing character in the book (hide spoiler)]"}, {"userName": "Kelly (and the Book Boar)", "userReviewDate": "Jan 13, 2017", "userURL": "http://www.goodreads.com/user/show/11183856-kelly-and-the-book-boar", "userReview": "Find all of my reviews at: http://52bookminimum.blogspot.com/\n“Evil doesn’t have to be loud, son. In fact, it reserves that for the merely boorish. Evil is quiet, stealthy – it sneaks up on you, smiles, and pats you on the back while pissing down your leg.”\n\nLet me tell you the tale of how this ended up on my TBR. It was a cold and snowy New Year’s and the family was all in the reading room to make as much noise as possible in order to distract me from my ‘puter watch me churn out one of my super professional book reviews when my husband (the non-reader) began pelting me with “Have You Read [fill in name of book]???” questions. After the fourth title (two of which were quality reads of mine last year and two of which I had never heard of) I asked where the eff he was getting these selections. He then informed me it was his co-worker’s “Best Reads Of 2016” Facebook post. Recognizing that two of the choices came from my own brilliant mind I thought I should take his other two suggestions seriously as we appear to have the same taste and asked my husband to repeat the titles – which I then looked up on Goodreads. The only thing I saw when The Secret Wisdom of the Earth blurb came up was APPALACHIA and I was all . . . . . . \nWhich led my husband to have a “You Serious, Clark?” moment. Yep. Dead serious. I’m a cheap sell.Now that that overshare is over, let’s talk about the book . . . . \n“Heard your momma’s gone crazy cause your little brother died,” he said, looking hard at me.“She’s taking it kind of bad.”\nThat’s the reason young Kevin and his mother are spending the summer with his granddad Pops. The rest of the story is a mix of a coming of age tale in the spirit of Harper Lee where Kevin learns that unfortunately people don’t always believe that . . . . \nWith a little Jack London, Bill Bryson and just a hint of Barbara Kingsolver’s eco-warrior thrown in for good measure. Since I’m not a fan of humans, I don’t even know the name of my husband’s co-worker, but I owe him a thank you. I would have never heard of this book were it not for his recommendation and that would have been unfortunate because . . . . \nNote to everyone with normal human emotions: This one is a real gut-wrencher. We’re talking a brutal accidental death and a hate crime and black lung and poverty and abuse and everything else that’s wrong with the universe that might make you have the feelz. You’ve been warned."}, {"userName": "Melki", "userReviewDate": "Sep 07, 2014", "userURL": "http://www.goodreads.com/user/show/5293536-melki", "userReview": "Fourteen-year-old Kevin and his mother are sent to spend the summer with a beloved grandfather in eastern Kentucky. Kevin's mom is nearly catatonic, traumatized by the death of her younger son. His dad frequently hints that Kevin is in some way responsible for the tragic accident. Luckily, he heads back to Indiana, leaving Kevin to have, if not the greatest, certainly the most unforgettable, summer of his life.He and his new pal, Buzzy, will indulge in mud baths, hang out in tree houses, explore caves, share secrets and go a-hellin' through the woods. Kevin will also spend his time helping his veterinarian grandfather remove bull testicles and serving as bartender for Pops' cronies. Good times, good times, indeed! Unfortunately, everyone in town is concerned about the mountaintop removal mining that is happening all around them. While many are thrilled at the job prospects, others see only the devastation the operation will bring. It's a simmering pot that will come to a boil during that summer and Kevin will be there to witness the whole thing. This book reminded me, in a good way, of EVERY wonderful, coming-of-age, magical-way-I-spent-my-summer-vacation, boy's-big-adventure book I've ever read. It's also one of the few books that features young adult characters that I would actually encourage young adults to read. Keep 'em comin', Scotton!"}, {"userName": "Lori", "userReviewDate": "Nov 13, 2015", "userURL": "http://www.goodreads.com/user/show/3332895-lori", "userReview": "This was one of the most atmospheric novels I have read. I felt like I was walking every step with these boys. The characters were very well developed... every thought and emotion felt authentic. My only complaint is that I found myself skimming through several parts starting about 3/4 of the way through. It just seemed too drawn out for me with too many unnecessary details. The first half was really really good... second half not so much. Still a very strong debut and I look forward to reading more by Scotton in the future. 3.5-4 stars."}, {"userName": "Diane", "userReviewDate": "Sep 06, 2014", "userURL": "http://www.goodreads.com/user/show/279256-diane", "userReview": "This book is a lovely blend of several things: a boy's coming of age, a family in crisis over a child's death, a small town's struggle to survive, a fight against prejudice, and a wilderness adventure. The author was juggling a lot and I think he pulled it off well. Our narrator is 14-year-old Kevin, who moves with his mom back to her hometown in Appalachia. His mother is mad with grief after losing her 3-year-old son in a terrible accident. Kevin's grandfather tries to care for them, and Kevin grows fond of him. Kevin also makes friends with a boy named Buzzy, who introduces him to their mountain ways. The boys end up facing some bullies, and Kevin is pushed into a dangerous situation.Meanwhile, the small town is having its own troubles. The coal mining company is pressuring families to sell their land, and threats are made to those who refuse, including Kevin's grandfather. The town boss picks on Paul, a homosexual man who runs the local beauty salon, and it causes even more tension in the community. There are so many elements to this grand novel that I was reminded of numerous other books and movies, including To Kill a Mockingbird, Tell the Wolves I'm Home, Coal Miner's Daughter, On Golden Pond, Harlan County U.S.A.,  and The Most Dangerous Game. I don't think it's a bad thing to think of other works — Scotton's book is just so rich in events that I couldn't help be reminded of similar stories.Scotton's prose is lovely and he had some beautiful descriptions. I knew I would like this book as soon as I read its opening passage: \nIt was always coal. Coal filled their pantry and put a sense of purpose in their Monday coffee. Coal was Christmas and the long weekend in Nashville when the Opry offered half-price tickets. Coal was new corduroy slacks and the washboard symphony they played to every step. Coal was a twice-a-month haircut. Coal was a store-bought dress and the excuse to wear it. Coal took them in as teenagers, proud, cocksure, and gave them back fully played out. Withered and silent.Coal was the double-wide trailer at twenty and the new truck. Coal was the house with the front porch at twenty-eight and the satellite dish. Coal was the bass boat at thirty-five and the fishing cabin at forty. And then, after they gave their years to the weak light and black sweat, coal killed them.And began again. \nOne small frustration I had with this novel was with Kevin himself. Since he was 14 and was a fish-out-of-water in this small southern town, he could be remarkably dense and naïve. I recognized it as a critical element of the plot that he had to ask lots of questions and would make mistakes, but occasionally it was overdone. But by the end of the book, he has grown up considerably and I liked his story arc.I would recommend this book to those who like literary fiction or sprawling family stories.Favorite Quotes\"It is always strange going to a friend's house for the first time, as if you are invading a secret world they try to keep apart from you.\"\"Men like Bubba Boyd think the earth owes them a living. They take whatever wealth they can from the mountains and move on. I actually feel sorry for him, I really do. He can't for the life of him see the simple beauty in a waterfall or understand the importance of history and place. If I have one hope for you, Kevin, it's that you never become one of those men.\""}, {"userName": "Cathrine ☯️ ", "userReviewDate": "Jun 30, 2015", "userURL": "http://www.goodreads.com/user/show/22600410-cathrine", "userReview": "4.5★I love books centered in Appalachia + I’m a tree hugger = Biased spin starts here.I love when an author can tell a great fictional story that also draws the reader to a real life issue that is close to his heart and mine; writing and reading with a cause if you will. Ron Rash and Barbara Kingsolver are very good at this. Now I can add Christopher Scotton and his debut novel to that list. A debut? Wow! A few years back I had looked up images of mountaintop removal after seeing a film narrated by Sissy Spacek about Appalachia. I looked up those images again in the midst of reading. “How can they think of destroying this place? I just don’t get it.” I don’t either. This is another boyhood entering manhood tale and quality stuff in my opinion. As the mountains crumble, so does a way of life for many in the hollows of Kentucky as the story weaves around family, love and loss, friendship, betrayal, and greed. A bit of reality is suspended for the sake of drama and I didn’t mind at all. My kind of book written to order and I was sad when I ran out of pages to turn.In sharing his thoughts about it author John Hart wrote: \"Atticus Finch meets Deliverance.\""}, {"userName": "Jennifer", "userReviewDate": "Nov 28, 2015", "userURL": "http://www.goodreads.com/user/show/9420458-jennifer", "userReview": "“I guess I learned that even though most people are good, they can be talked into doing bad things by one or two jerks...And I guess, people sometimes need someone who can stand up and remind them that they are good people and they know what's right.”4.5 starsThe prose in this book created a song in my heart like the tunes that have been sung throughout the Appalachian Mountains for the last few centuries. Author Christopher Scotton has created a beautifully-written novel which I couldn't help but think of as a modern-day \"To Kill a Mockingbird\". He has combined a coming-of-age tale with stories of tragedy, the power of love over hate, the complexities of the coal mining economy, and a deep reverence for the beauty of nature and a sense of place. The characters in this book are well-developed, and I imagine readers will have their favorites, as I did. The plot may get a wee bit fantastical toward the end, but first-time novelist Scotton is forgiven because the rest of the novel is so strong (note for the author: next time one or two catastrophes are enough -- they don't need to pile on each other).Highly recommended."}, {"userName": "Mary", "userReviewDate": "Aug 18, 2014", "userURL": "http://www.goodreads.com/user/show/5159698-mary", "userReview": "There has been a lot of buzz building around the debut novel of Christopher Scotton titled, The Secret Wisdom of the Earth. The publisher has announced a print run of 100,000 —- unheard of for a first novel —- and many of the early reviews have been gushing. I picked up an ARC a few weeks ago, and trust me -- the hype is justified.The Secret Wisdom of the Earth is one of the most beautifully written novels I’ve read in many years. The prose is breathtaking at times and the imagery transports you to the hills and hollows, the small towns and coal seams of eastern Kentucky in ways few writers can master. The characters are pitch-perfect, genuine, real, and stay with you throughout the next day after reading the book the evening before. Even weeks later I am thinking about them, about their lives...hard to believe they are not still living in Medgar, Kentucky, but only exist in the pages of this captivating story. At the book's conclusion I wanted to plan a roadtrip to witness the beauty of the region, cringe at the horror of flat-topped mountains, glimpse the waterfall at Juke's Hollow, or slowly cruise past the porch at 22 Chishold and see who might be sitting there....The impeccable pacing of the novel propels the story to a suspenseful, shocking conclusion. It's one of those delicious books I have stayed up all night to finish, wanting to know what happens, yet not wanting it to end!Yes, it’s a coming of age novel...but its themes go so much deeper. It’s about love, loss, prejudice and the connective tissue that joins us to each other and to the earth -— all of it wrapped in a gripping, page-turning story of survival and redemption in the back woods of Kentucky.Christopher Scotton is a huge new talent and this is a novel that will be discussed and dissected for years to come. I cannot wait to see and hear more about this book and his future ones once published. Fantastic!"}, {"userName": "Melissa Crytzer Fry", "userReviewDate": "Dec 15, 2014", "userURL": "http://www.goodreads.com/user/show/3857699-melissa-crytzer-fry", "userReview": "This book has received a great deal of pre-release accolades – all well deserved. I suspect, however, the spell it cast over me is a bit different than the one cast for others, mainly due to my own geography and relationship to mining (not in Kentucky and not coal mining, but in southern Arizona where copper mining “is king” as was quoted recently in our local paper over a mining ‘victory’ that will scrape away sacred Native American land).This debut is a fabulous coming-of-age story about 14-year-old Kevin, who bears witness to a horrific family tragedy and upon going to Kentucky to live with his grandfather, “Pops,” does a great deal of growing up. In many ways, the story reminded me of the popular Stand By Me film (originally a Stephen King novella titled, The Body) in its depiction of a simpler life and boyhood friendships (Kevin falls in with local Hollow kid, Buzzy Fink). But while Kevin is introduced to the slower pace and spiritual connections of the earth, he is also witness to the ravages of coal mining on the environment. And to the brutal ignorance of members of a small town.This book is cocooned in so many layers of moral/ethical/environmental themes, yet it is not in any way preachy. It does what today’s journalism should do: it presents an unbiased, two-sided story illustrating that the world’s appetite for natural resources isn’t cut-and-dry. It’s one of many themes tucked neatly into Kevin’s journey, through the lives of multigenerational mining families and opponents who appear in the story as flawed and realistic characters. Mining presents a fitting backdrop that parallels the personal loss suffered by many of the characters within this book.Scotton has created a novel that entices readers to think – one that challenges the “it’s ok as long as it’s not in my backyard – or as along as I can’t see it” mentality toward large-scale mining operations – all in a way that is not the least bit overbearing. During an extended mountain trip with Pops, Kevin is explaining the wild beauty of the mountains surrounding him: “The trees were lush and large, with holly, mountain laurel, and dogwood filling in the forest floor.” And then he notes the sight as they come toward the evidence of mountaintop-removal mining: “As we came over a gentle rise, the trees ended abruptly. What lay before us was a scene of unimaginable devastation.”Midway through this whopping 480-page book, I had already decided it was going to be passed along to my 14-year-old nephew: for its wisdom, for its introduction to the redemptive nature of nature (a concept completely foreign to so many young people today) and for its entertainment value (Pops has some good one-liners). Yet for all of the environmental takeaways I personally experienced, this is just a GOOD story: a book offering lessons of hope and forgiveness, acceptance and tolerance, loyalty and trust.If you are a fan of young adult fiction (while the story is a recollection of an adult Kevin looking back, it reads in his 14-year-old point of view until the very end), and enjoy coming-of-age stories, this is the book for you. Could it have been shorter? Sure. But despite its heft, it is a quick, satisfying read with true substance. I look forward to this author’s future work. Bravo to this debut author!"}, {"userName": "Bam", "userReviewDate": "Nov 04, 2015", "userURL": "http://www.goodreads.com/user/show/5922426-bam", "userReview": "I found this book in the library of our cruise ship! I had been meaning to read it since it was first published and knew the timing was perfect since there would be several long days of cruising at sea. It is just the kind of book that I love: a coming of age story set in the hills of Kentucky, with a wise old grandfather, and plenty of heart-breaking problems and a bit of mystery and danger to keep the plot moving forward steadily. Kevin Gillooly and his mother leave their home in Indiana to spend the summer with Pops in Kentucky to try to recover from the death of Kevin's three-year-old brother in a hideous home accident. Kevin's father blames Kevin for the death, which adds the burden of guilt to the young man's grief. And mom is almost catatonic in her own grief. Will being in her childhood home help her recover and return to life?The story is also about the issues surrounding modern-day strip-mining for coal or 'mountain-top relocation.' Bubba Boyd, the big money guy, wants to buy Pop's old boyhood homestead in Jukes Hollow for storing his sludge. \"Men like Bubba Boyd think the earth owes them a living. They take whatever wealth they can from the mountains and move on. He can't for the life of him see the simple beauty in a waterfall or understand the importance of history and place.\" How far is he willing to go to get his hands on that desirable property? When Paul, the local hair dresser and the leader of the environmental group against the mountain-top mining, is brutally murdered, Kevin becomes aware that his new best friend Buzzy knows who committed the crime and may be in danger himself. Pops plans a tramp up the mountain to Jukes Hollow and takes the two teens along but trouble follows them and results in a \"Deliverance\" style scenario that requires courage, strength, and ingenuity from all three. It's hard to believe this is Christopher Scotton's first novel--it is that good! The ending could have used some polishing but my rating still falls somewhere between 4.5 and 5 stars. I hope the author has another gem in the works that we'll see someday!"}, {"userName": "Pamela", "userReviewDate": "Dec 04, 2014", "userURL": "http://www.goodreads.com/user/show/20048096-pamela", "userReview": "I don’t really know where to begin. Like a chamois through a wringer, my emotions have been put through it. Love – Hate – Rage – Joy – Compassion – Sorrow – Pain – Hope – Fear - Vindication – Disgust…….. Just to name a few. Poignantly lyrical and gritty, “The Secret Wisdom of the Earth” packs a wallop of a punch. It’s a genre kaleidoscope. Grit-lit, southern-fiction, family-drama, mystery, suspense, Appalachian culture, environmental-lit (and the list goes on) in the guise of a coming-of-age story. A seriously mature-audience coming-of-age story delving into bold and controversial subject matter – some of which is exceptionally graphic, violent, and disturbing. A few passages made me so nauseatingly ill I had to set the book aside and take a breather. Even now, after putting off writing this review for a couple days, I’m still rattled by what I read. Those who know my personal story know how upsetting certain topics are for me. And there’s a fair amount of expletives. Though in most incidences, it was reasonably justifiable based on character and/or circumstance. And even though I struggled with numerous unpleasant passages, I thoroughly enjoyed Kevin’s relationship with his grandfather, and found the overall story captivating. Moreover, my seeing this book through to completion says much about the overall intrigue, quality of writing/prose, literary prowess, suspense build, fluidity, and importance of underlying themes of hope, healing, love, friendship, forgiveness, and the will to rise above adversity. Four – poignant and gritty, discretion advised - Stars"}, {"userName": "Judy Collins", "userReviewDate": "Jan 15, 2015", "userURL": "http://www.goodreads.com/user/show/11063006-judy-collins", "userReview": "Coming in Paperback 1/5/2016!  Top 50 Books of 2015\"Best Coming -of-Age Debut.\"THE SECRET WISDOM OF THE EARTH  by talented Christopher Scotton,  is a highly recommended compelling, multi-layered coming-of-age epic debut, crossing many genres. A deeply-moving story, with a powerful voice of adult Kevin, main protagonist, telling his story--with a \"heart of gold\", and as big as the mountains; matched perfectly by audio narrator, Robert Petkoff, delivering an award-winning performance! This southern classic is a \"must read\" and guaranteed to win your heart. Set in Kentucky in the 1980s, after the horrific death of Kevin’s younger brother, now 14 years old, he moves with his distraught mother to the rural Kentucky home of his grandfather. It is here he meets a local boy Buzzy and they two become friends; introducing him to all things the rural mountain area has to offer, from fishing, hunting, and country living.However, what he does find is troubling, making him confused. The people are backward thinking, narrow minded, filled with hate, rage, racists, and bigotry. This pair slowly is drawn into the local politics of the good ole’ boys at the heights of the coal mountaintop removal mining in the rural Appalachia Mountains, and the death of a local gay guy, (and much loved citizen).  A small town mix of good and evil; from witty, humorous, rednecks, hillbillies, racists, activists, gays, bigots, and those without education and forward thinking—a murderer. A variety of viewpoints, in one small town --spells TROUBLE.  An emotional and heartfelt journey  of a grandfather and grandson. Pops, Kevin’s grandfather, a veterinarian and a mentor for Kevin introducing him to a world he knows nothing of, along with his friend, Buz. With an array of characters from Boyd’s Mining  (trying to buy up the land from locals), Paul, the local hairdresser (loved him), and environmental activists, for a fight which escalates, becoming personal and dangerous with a brutal murder. With many hard lessons, a young troubled boy, learns of wisdom, tolerance, beauty, hope, and courage; in a world of ugliness, devastation, and hatred. From the vivid settings, descriptions of the land, mountains, and nature combined with beautiful narrative, Scotton delivers an extraordinary tale which will remain with you long after the book endsA gifted new author with a \"winner out of the gate,\" takes readers on a journey of \"human compassion, resilience, redemption, and the power of family.” An author I look forward to following, for years to come!  Judith D. Collins Must Read Books"}, {"userName": "Dianne", "userReviewDate": "Nov 12, 2015", "userURL": "http://www.goodreads.com/user/show/2947323-dianne", "userReview": "Good, if slightly overlong, coming-of-age tale set in a coal-mining town in Kentucky. Hard to put down - the author does a great job with creating atmosphere and helping you to see the beauty of the Appalachian mountains, as well as the horror of what modern coal mining does to those mountains.A 3.5 for me. The story dragged a little at the end and some of the characters were a bit too archetypical for me, but rounding up for a good story well told."}, {"userName": "Phyllis", "userReviewDate": "Dec 03, 2016", "userURL": "http://www.goodreads.com/user/show/19228026-phyllis", "userReview": "A horrible accident at home sends this fourteen year old boy and his mother to her father's home in a small mining town in Appalachia. In this debut novel, the author brings you into the heart and soul of mountain living. You feel like you know every character. I thought this was very well written and would recommend it to anybody. Loved it."}, {"userName": "Janieh Hermann", "userReviewDate": "Jul 05, 2014", "userURL": "http://www.goodreads.com/user/show/826840-janieh-hermann", "userReview": "I had the delight of seeing Mr. Scotton read from his novel at a publisher's breakfast and then also have dinner with him later on in the same conference. As an author, he is as down to earth as the characters he has crafted in his debut novel. Knowing that the inspiration behind this novel is based on a true life event and that it took Mr. Scotton 15 years to complete the manuscript had me reading the story through a different lens than normal -- one that enhanced the experience. At its simplest, this is a coming of age story, but it is much more complex than that. There are lessons to be gleaned, but the book is not didactic by any means. The setting in the Appalachians is wonderfully detailed in description as are the characters in the book. I read this immediately upon receiving an Advanced Reading Copy and I could not put it down until I was finished. I predict this will be a breakout hit of 2014."}, {"userName": "Morris", "userReviewDate": "Feb 02, 2015", "userURL": "http://www.goodreads.com/user/show/32911939-morris", "userReview": "For the first time, I feel like a jerk for giving something three stars as opposed to four, because at its heart “The Secret Wisdom of the Earth” is a solid four-star novel. There are some plot flaws that made me feel the need to dock a star, and they may not bother others, so please research other reviews along with mine to determine if this novel is right for you.“The Secret Wisdom of the Earth” is a coming-of-age tale in the slice-of-life tradition. It meanders through the beautiful world of the Kentucky mountains, creating a respect within the reader for the beauty and fragility of nature. Mixed in are the very real issues of coal mining, poverty, and homophobia. All are handled in a realistic and unflinchingly honest way.The main characters of Kevin, Pops, and Buzzy are likable and flawed, making them people whom those from all walks of life can relate. The supporting characters are all given complex stories and personalities that make you want to sit around at the diner and get to know them better.Given all of these positives, you may be wondering why the three-star rating. The problem comes at the end. While some issues were not resolved, and should not have been, there were others that were not addressed at all, leaving the reader with no closure. On the opposite end, there was too much closure in the epilogue, with as many personal details crammed in as possible. It cluttered what would have been such a great book had the ending simply addressed the initial themes as opposed to ignoring them for the minor details.I don’t regret reading “The Secret Wisdom of the Earth”, but I do have mixed feelings about it. I can neither recommend nor not recommend this novel.This review is based upon a complimentary copy provided by the publisher in exchange for an honest review."}, {"userName": "Janet", "userReviewDate": "May 20, 2014", "userURL": "http://www.goodreads.com/user/show/219670-janet", "userReview": "Scotton's book is a completely engrossing coming-of-age novel that reads like a classic from page one. It's literary fiction with an astoundingly wide breadth in terms of characters, plot, and language. The only thing I'd changed about this book? Its title (and perhaps the cover art, too): I feel like many readers who are meant to have this book will be turned off by the title and design. TRUST ME: read it. If you choose to buy this book based on my review, please buy from a local, independent bookstore. Check out my link text to find the bookstore closest to you, keeping in mind that most bookstores like mine will ship to you at a low cost!(For good measure, here's my first response when I finished the book:\"Incredible, moving, beautiful, classic. Review to come.\")"}, {"userName": "Karen", "userReviewDate": "Jan 27, 2015", "userURL": "http://www.goodreads.com/user/show/7784766-karen", "userReview": "This was about as real as a story can get. \nThe Secret Wisdom of the Earth\n featured small town prejudices, old family rules, tragedy, and the losing/finding of oneself. This book was very engrossing and encompassed every thing I love about a good book.I have to admit that the beginning started kind of slow. Written by a male, the writing reflects a bit of the technical aspects of a boy in his youth. I kept reading because I enjoyed the slow build up. I really felt like I got to know the characters and the town of Medger enough to picture myself there. By chapter two I could understand that this book didn’t need the feminine style of writing to draw emotion out of me. The characters have so much depth it is almost written as if it was a memoir. A real person can feel like this, can remember like this. The story builds up to an adventure that changes the lives of the characters, and indeed the whole town, involved.This is an epic coming of age that I easily see becoming a movie. I spent two hours after reading this book crying inconsolably. I don’t think that the book was meant to draw that kind of emotion. I just grew so attached to the characters that I wept even harder knowing the story was actually over. I can’t go back now and feign ignorance of their fate. I want to very badly. These characters have become like my own kin, and I wish I could turn back the clock and move to Medger to be close to them.It is hard to believe this was a debut novel! Does this author understand how absolutely profound this story is? This book was one of the best stories I have ever read, and an experience for me that I will not soon forget."}, {"userName": "Laura", "userReviewDate": "Aug 12, 2016", "userURL": "http://www.goodreads.com/user/show/7555122-laura", "userReview": "This was a 3.5 star read. The book almost read like two separate stories. One story being a coming to age and the other a camping adventure gone bad. By the end I had lost some interest in the plot. Not a bad debut but not one I just absolutely loved. However, I did love some of the characters."}, {"userName": "Maureen", "userReviewDate": "Jan 05, 2015", "userURL": "http://www.goodreads.com/user/show/5535795-maureen", "userReview": "2.5 stars. I know there has been a lot of buzz about this book so I feel like I am going out on a limb here to say that I did not love this book - I really just sort of liked it - barely. It really pains me that this book was not as great as I expected because it has not only received the aforementioned buzz, it is Parnassus' Books First Edition pick for January and those who know me know how much I love Ann Patchett and I usually love her picks. Nevertheless, I found the plot to be extremely fractured- was it about mountain top mining, were we taking a visit to Mayberry, were we on the raft with Huck Finn, painting the fence with Tom Sawyer, grieving over the loss of a loved one, yada, yada, yada? It just did not gel for me. Yes, the characters were (I can't say well-drawn) easily relatable but only in one-dimension and very stereotypical. The overly long descriptions of each and every rock and hollow require me to say something about how looooong this book is. Could have been at least 100 pages shorter. Oh yes and the ending was horribly cliched and felt like a tack on.I must add the caveat that I read this as and ARC from the publisher so maybe some of these problems were cleared up in editing, but this was just not my fave- by far. You know how you either love Jonathan Franzen or you hate him? My prediction is that this book is going to elicit the same sort of reactions in people. We shall see but this one definitely does not receive my stamp of approval."}, {"userName": "Stacy", "userReviewDate": "Aug 20, 2014", "userURL": "http://www.goodreads.com/user/show/18279306-stacy", "userReview": "**I won an uncorrected proof of this novel as part of the Goodreads First Reads giveaway program.**Wow. Wow. Wow. I am absolutely amazed at the caliber of this novel. The writing was absolutely brilliant. The main character and narrator of the story, Kevin, moves to Kentucky for the summer and experiences so much in that short period of time. The characters were all complex and well-thought-out. The story was both heartbreaking and heartwarming at the same time. The words on the pages seemed all too real. I highly recommend this exquisite work of art and hope it becomes an immense success. It really does hold the \"secret wisdom of the Earth\" in its pages. I hope the author continues writing novels like this one. Thank you, Goodreads for allowing me to discover works as good as \"The Secret Wisdom of the Earth\"!!!"}, {"userName": "RoseMary Achey", "userReviewDate": "Jan 17, 2015", "userURL": "http://www.goodreads.com/user/show/5338290-rosemary-achey", "userReview": "Novels set in Appalachia have long intrigued me-as most of you know, I am a huge fan of Ron Rash. I picked up  The Secret Wisdom of the Earth  as it was set in a rural community of Appalachia Kentucky. While Rash's Appalachian material always feels real, author Christopher Scotton's felt arbitrary and forced. While some narrative flowed, much of it felt awkward, somewhat like an individual speaking a foreign language. The story itself was engaging and enough happens to keep the reader turning the pages. A young boy learns several life lessons while spending the summer with his wise grandfather. The book also presents a lesson on the effects of mountain top removal mining which was enlightening."}, {"userName": "Tamara", "userReviewDate": "Sep 28, 2014", "userURL": "http://www.goodreads.com/user/show/35433486-tamara", "userReview": "Perfection! Scotton's illustrative descriptions are some of the best I have ever read. Throughout the book I thought, “How did he come up with that? So creative.”Don't skip over the chapter titles - they are clever and some are quite thought provoking. I dog eared a few in particular, “The Price of Future Memories,” “The Paradox of Penning Cats,” and “In the Weave of Time and Being.”It’s used as a title but I especially like how the phrase, “The equivalent damage when high expectations and low expectations are devastatingly unmet” is used in one the chapters.The characters are rich and well developed. It's impossible not to feel for Kevin, Buzzy and Pops. As a reader, I wanted to know what would happen next and especially liked the wisdom of Pops."}, {"userName": "Kathryn", "userReviewDate": "Aug 08, 2014", "userURL": "http://www.goodreads.com/user/show/2600090-kathryn", "userReview": "First sentence: The Appalachian Mountains rise a darker blue on the washed horizon if you're driving east from Indiana in the morning.Favorite quote: Just knowing I wasn't alone - knowing that I was guarded by something inexplicable and ecumenical - gave me energy and courage I had never felt before.All I can say is WOW! This book takes your breath away with the lyrical gorgeous writing. This man can tell a story and make you think you are there living it with everyone. This is a story for men and women who find a story fascinating about a 14 year old boy and all of his antics; a community stricken with poverty due to the coal mining industry; the story of a small community and all of its eclectic neighbors and the story of a family dealing with deep tragedy. This is a great book."}, {"userName": "Donna", "userReviewDate": "Jan 18, 2015", "userURL": "http://www.goodreads.com/user/show/13244359-donna", "userReview": "My rating for this book is more of an emotional response than my normal dissection, which is probably very rare for me. It's just when I think about this book, I was really drawn in and I grew to love the characters. I felt vested in their futures. They were so well drawn emotionally, which I loved.I also liked the story itself. There were some creative turns that had me saying, \"Nice.\" This was an endearing coming of age story of two teenage boys trying to navigate life in a rural mining town. My only real complaint is that the wrap up was so very long at the end, as the the author tried to put a big fat red bow on everything. A lot of that felt like unnecessary information."}], "description": "After seeing the death of his younger brother in a terrible home accident, fourteen-year-old Kevin and his grieving mother are sent for the summer to live with Kevin's grandfather. In this peeled-paint coal town deep in Appalachia, Kevin quickly falls in with a half-wild hollow kid named Buzzy Fink who schools him in the mysteries and magnificence of the woods. The events of this fateful summer will affect the entire town of Medgar, Kentucky. Medgar is beset by a massive mountaintop removal operation that is blowing up the hills and back filling the hollows. Kevin's grandfather and others in town attempt to rally the citizens against the \"company\" and its powerful owner to stop the plunder of their mountain heritage. When Buzzy witnesses a brutal hate crime, a sequence is set in play that tests Buzzy and Kevin to their absolute limits in an epic struggle for survival in the Kentucky mountains.", "title": "The Secret Wisdom of the Earth", "url": "https://www.goodreads.com/book/show/22217702.The_Secret_Wisdom_of_the_Earth", "average": 4.09, "cover": "https://images.gr-assets.com/books/1403541255l/22217702.jpg", "reviews": 1316, "authors": [{"url": "https://www.goodreads.com/author/show/8179815.Christopher_Scotton", "name": "Christopher Scotton"}], "type": ["Fiction", "Historical", "Young Adult", "Contemporary", "Young Adult"], "outlinks": ["http://www.goodreads.com/book/show/22217702-the-secret-wisdom-of-the-earth", "http://www.goodreads.com/book/show/32706661-the-secret-wisdom-of-the-earth", "http://www.goodreads.com/book/show/23616774-the-secret-wisdom-of-the-earth", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}