{"ratings": 1803, "userreviews": [{"userName": "Hannah", "userReviewDate": "May 02, 2018", "userURL": "http://www.goodreads.com/user/show/17442587-hannah", "userReview": "An oldie set in yet more olden days. My friend Allison basically said I hadn't lived until I read the book, so I was definitely going in with some high expectations. I really enjoyed the story, though I disliked some of the violence... I could picture it too well. I'm definitely impressed with Sutcliff's talent for description!"}, {"userName": "Allison Tebo", "userReviewDate": "Oct 26, 2016", "userURL": "http://www.goodreads.com/user/show/60149806-allison-tebo", "userReview": "Magnificently, shiningly glorious."}, {"userName": "Miriam Joy", "userReviewDate": "Apr 03, 2014", "userURL": "http://www.goodreads.com/user/show/14328970-miriam-joy", "userReview": "It's very noticeable, after reading a few of Rosemary Sutcliff's books in close succession, how her protagonists are never the 'strong' ones. In Song For A Dark Queen, it's narrated by the queen's harper, not one of her warriors or a member of her family or the queen herself. And within the context of the narrative, that makes perfect sense, but it's a slightly unexpected choice. In The Eagle Of The Ninth, the protagonist is lame in one leg because of an injury, and therefore struggles with chronic pain despite the fact it is almost healed. And here, the protagonist is an anxious, sickly surgeon (he wasn't healthy enough to be a soldier) with a stutter that gets worse when he's nervous.It makes a change. It really does. And it also makes sense, reading the author bio of Sutcliff at the end of the novel which highlights the fact she was in a wheelchair for most of her life, affected by Still's disease.I've spent most of my life hale and healthy, until recently. Unfortunately, long-term health issues got a lot worse and I've been kind of limited in what I could do the last year or so. I'm also anxious and prone to panic attacks and nervous breakdowns. A lot of the time, these limitations massively affect my mood. But they also impact my reading taste, because why would I want to read about strong, athletic characters saving the world / their family when I could read about disabled or injured characters doing the same thing by overcoming their difficulties and playing their strengths? I imagine it was a similar attitude that prompted Sutcliff to make those decisions about her characters, and I'm sincerely grateful for it. It's refreshing to read a historical novel where the sickly or injured character isn't confined to their room while dashing young soldiers go around filling the plot criteria, perhaps out of pity or love for their fallen comrade. It's refreshing to read about somebody waking up with chronic pain in their leg and pushing through it to achieve something that most people thought was impossible, or struggling to communicate because of their nervousness but working through it to build friendships and alliances.Sometimes Sutcliff's style isn't the easiest, and I always feel slightly lost for the first couple of chapters of her books as I try and adjust to the setting which is often very intense and a little bit difficult to understand (and I'm far older than the target audience of these books). This one was no exception, though that might have been because I haven't read anything in a few weeks due to a heavy workload from school, and I wasn't in the swing of it. But the story, especially how it linked so cleverly and carefully with the earlier book, The Eagle Of The Ninth, made it worth it. And I've already mentioned what I like so much about her protagonists. So not the easiest read I've ever picked up from the children's shelves in the library and there's definitely no reason that it should be limited to that age group -- the writing and language is sophisticated, the characters are young but grown up, rather than being adolescents or children, and I'm sure it would appeal just as much to others my age (18) as to the ten-year-olds who frequent the children's section.In future, I won't let myself be embarrassed when I check out those books."}, {"userName": "Tijana", "userReviewDate": "Oct 15, 2016", "userURL": "http://www.goodreads.com/user/show/35343816-tijana", "userReview": "Srebrna grana je vrlo solidan istorijski roman za decu koji se bavi onim istorijskim trenutkom kad se Rimsko carstvo već malo ljulja ali još nije počelo sasvim da se raspada (tako, treći vek). Kod nas je, mislim, dosta loše prošao jer su ga objavili em kao roman za odrasle, što ipak nije, em kao \"drugu knjigu trilogije\" što takođe nije, samostalan je roman i pored toga što je glavni junak praunuk onog iz \"Orla Devete legije\". Rouzmeri Satklif piše ne samo pouzdano što se tiče istorije i sa uvek simpatičnim likovima već i sa velikim uživljavanjem u tadašnji svakodnevni život i uz lepe opise promena u vremenu i pejzažu. Pripovedanje utoliko jeste malo zahtevnije za današnju decu ali npr. neko od trinaest do petnaest godina ko voli stari Rim - trebalo bi da bude oduševljen.I moram da dodam ovo o primerku (bibliotečkom) koji sam ja čitala. Pre mene ga je čitao neko ko je usput pravio dve vrste zabeleški: grafitnom i hemijskom olovkom. Grafitnom su podvlačene zanimljive rečenice i dodavane kritike apropo radnje (\"nevešto konstruisano\", \"mnogo se guze naprazno\") a hemijskom su stavljane zvezdice za... istorijske fusnote. Bodež saks? fusnota hemijskom, s etimologijom. Kukuruz (jedna od baš retkih omaški u inače iznenađujuće uspelom prevodu)? Ljutita fusnota \"možda posle Kolumba i Kortesa!\" Poglavlje o Karausiju? Na kraju poglavlja istorijska beleška o Karausiju preko celog praznog prostora, sitno ispisanih pola strane :) Razumem da to drugima smeta, meni je bilo drago i simpatično i sve vreme sam imala utisak da mi preko ramena knjigu čita neko poput mog razrednog (istoričara, normalno) iz gimnazije :)"}, {"userName": "Mary", "userReviewDate": "Sep 18, 2015", "userURL": "http://www.goodreads.com/user/show/47111982-mary", "userReview": "The Silver Branch by Rosemary Sutcliff is a wonderful young adult historical adventure novel that I dearly love. There are many reasons why, and I could go on forever about all of them. Instead, I'll jump between a few representative highlights of some elements I appreciate most. My favorite part of this book is most definitely the characters. Flavius and Justin, especially, but also each of their friends - from strange little Cullen to tall and fabulous Evicatos of the Spear, from the great little Emperor to the inimitable Aunt Honoria. Even the villains and other evil characters are so well-written - realistic, believable, dastardly, complex, and never cliche - and the main villain and his henchmen are possibly the very best antagonists I've ever read in my life. I could go on for ages and ages about what I love about each of the heroes, but I'll focus on just a few prominent things - though be assured there are many more than these.I love Flavius and Justin's character qualities - their incredible strength, goodness, commitment, loyalty, sense of duty, kindness, leadership, and courage. I love their good-natured, friendly, cheerful, and witty dispositions - Flavius in his fiery, bright way, and Justin in his own quiet, steady way. I love their close and brotherly friendship and the way they stick by each other, fighting alongside one another, through thick and thin. I identify with their loneliness and rejoice that they found each other and each gained a close companion who is much more than merely a friend or kinsman. I love stories of cousins, and there aren't enough in the world - and this is arguably my favorite one.I love Flavius's great leadership, and Justin's as well - equally admirable in both although and because it comes easily to Flavius but not to Justin. Flavius is strong and valiant and is the first in every attack and the last in every retreat, as is Justin. Both of them are always with their men in the most dangerous place, fighting shoulder to shoulder with the rest and rallying them on to victory or defeat. I love Flavius's immense and laughter-ridden pride in his men, whether his cohort, his band of spies, or his motley, tattered \"legion.\" I love the way he cares for his men as individuals like only a good leader can. There's a reason his men would follow him to the earth's end and back and through any battle or risk of death. I love that Justin is a surgeon and a healer in every way - in title, heart, hands, mind, and very being. He's committed to doing his work to the best of his ability, and he always, always puts his medical duty and his patients first. He has incredible compassion, empathy, kindness, and care for people, and he has eyes to truly, deeply see them and a heart that cares and helps others. I love how he carries his surgical instrument case through everything he goes through, even beyond the seeming end of the world he knows. Without him ever saying so, the value he places on his career and his skill to live it out are vividly apparent in his every thought and action. I love that he's not strong in body but never lets that stop him. He was sickly as a child - part of what gave him his desire to be a surgeon - and he doesn't have physical strength or stamina, but he pushes on anyway, every bit as much as Flavius, and he never bows out of the fight. I identify with Justin so much - his identity as a healer and medical professional (though I'm not one quite yet); his insecurities, his feeling of not being good enough, and his low self-esteem; his compassion, empathy, kindness, and care; his desire and ability to help and heal others; and much more. I'm a tall, reasonably pretty female, and he's the opposite, but I recognize my heart and being in him. I love this book's depiction of courage throughout, and it's one of my many favorite things about the characters and themes of The Silver Branch. Several of the characters exemplify this quality, and not just the two main heroes. Paulinus likes comfort and is timid and not at all adventurous, yet he risks mortal danger daily to fight for what he believes is right and save countless lives. Justin and Flavius know the danger, like Paulinus, and they at first do not want to join him in this task, but they can't help it in the end - their goodness and sense of justice win over their fear. They repeatedly make the difficult choice to continue Paulinus's work even when they could more easily refuse. And even before that, everything Justin and Flavius do speaks of their courage and refusal to do anything but what is right. They risk their lives to twice warn the emperor, to do Paulinus's work, and to fight in desperate battle to save the townspeople, the province, and countless individuals. Then there's Anthonius, who risks his own life to bodily defend the weak and helpless - and suffers the dangerous consequences for doing so. Then, after seeing the horrific danger first-hand, he makes the same courageous choice as Justin and Flavius - because he feels what they're doing is right and good. He also risks persecution for his faith but follows his Christ anyway, and I admire that as well - and I hope and trust that I would do the same. Their friends and comrades show courage as well as they fight alongside them. Each of these men, and others as well, risk death and terrible danger to fight for what's right - to fight corruption, wickedness, oppression, and darkness with light, justice, humanity, and kindness. That takes immense courage. These men stand up for what is right against overwhelming evil when most others want simply to stay safe and survive. To me, thought they are fictional, they represent real people throughout history and the world who have risked their lives to faithfully fight for what is right and true in the face of great danger and evil. I love how extremely vivid and powerful the scenes and settings of The Silver Branch are. The pulsing tension of dark shadow shot with red flame; the pure beauty of marshes and birdsong, grassy hills and clouded skies; the soft, warm, golden lamplight; the bustling, colorful crowds and deserted natural expanses. I love that Justin has an eye for small but significant details about people, places, and events. He truly sees things and people, and he thinks deeply about them. It shows in the few important details that are described in his narrative, details that have far, far deeper significance than they seem to have on the surface: a precious apple-tree, a half-finished chess game, a crimson \"rose for the arena,\" Justin's instrument case, a battered gold eagle standard, a half-eaten radish, a leaf-bladed spear ringed with dangling white feathers, a sprig of rye grass, a green-painted dolphin sign, a faraway beacon gleaming red in the night, a country farm, a singed and crushed moth, a silver branch of tinkling bells, a green flawed emerald ring. And I could go on for even longer about the small vivid details that make each and every character incredibly real, alive, and human. These small details of people make the main and minor characters of Sutcliff and especially The Silver Branch the most lifelike characters I've ever read. They come to life in vivid relief with only a few descriptive details, and I can see every feature and movement of each person, which is rare for me. I love that this book includes such wonderful female characters. Though they are on the page for much less time than the boys, they're all the more potent, vivid, and strong for that, since they're no less compelling than any of the men. Aunt Honoria is the most prominent and wonderful woman in this book, and she shines gloriously beside Flavius and Justin throughout. Aunt Honoria is amazing, and I adore her, admire her, and hope I become half the woman she is. She always keeps her cool and poise even in the most harrowing of situations - which is ironically the only time we see her - and rises to every challenge. I love her vivaciousness, her crooked but fabulous make-up, her generosity, her unique and lovely voice and laughter, her affectionate care for her nephews, her youth despite her age, her courage, and her immense strength of character. Other female characters appear for a total of only a few pages each, but they are themselves vivid, wonderful, and admirable. Vast and motherly Volumnia, the delicate and fragile \"girl like a pale flower\" who shows great courage and steadiness, and Manlius's courageous wife and other unnamed women who aid the heroes in their fight. I even love that romance is technically non-existent in this book - but I also love that there's still a barely perceptible hint of what may happen in the future, which I earnestly hope and believe must certainly take place someday. I love the ending of this book. It's so perfectly bittersweet, and full of joy and tragedy, and it looks back on all the joys and sorrows of the rest of the book - battles and friends won and lost, hardships endured, victories and struggles. The final desperate battle is intense, heart-wrenching, and glorious. And I love how even though the heroes' fight has ended, they are given a new beginning and hope after it all. I highly, highly recommend The Silver Branch to all readers of historical or adventure - and to any reader of any genre who loves compelling characters, suspenseful plots, and deep and beautiful writing."}, {"userName": "Maureen E", "userReviewDate": "Nov 04, 2008", "userURL": "http://www.goodreads.com/user/show/984514-maureen-e", "userReview": "Up until very recently I was unaware that Eagle of the Ninth, one of my all-time favorite Sutcliff books had a sequel. This is not the first time something like this has happened to me, and it's very demoralizing. Anyway, I made haste and got out The Silver Branch to read immediately. And then it sat in my To Be Read pile for ages until I made myself read it because I had to return it. Well, made myself read it isn't quite the right phrase, because I enjoyed every minute of it (except when a certain character died, which was very traumatic--two certain characters, I suppose).I've read enough Sutcliffs by now that I can pick up the thread. Rutupiae light, for example, is only briefly mentioned in this book, but anyone who's read The Lantern Bearers (LOVE, LOVE, LOVE) will know how important it is there. Similarly, there's the familiar old flawed stone with the dolphin carved in it. This book is a bit different from most of Sutcliff's though, in that it arguably has two main characters.Justin (Tiberius Lucius Justinianus) has just been posted to Roman Britain as a surgeon to the Eagles who are supporting Carausius, the self-styled Emperor of Britain. He's excited because his family was originally from Britain. On his first day there he falls in with a young centurion about his age who turns out to be a cousin of his (Flauvius). And, as it further turns out, they are both descendants of Marcus Flavius Aquila, of Eagle of the Ninth fame (YAY!).This being a Sutcliff novel, naturally they run into quite a bit of trouble. While I like Flauvius, Justin became the real hero of the novel for me. I think that's what Sutcliff intended (most of it is told primarily from his point of view), and it worked.This is highly recommended for almost all ages (her prose is occasionally difficult). No bad content, except for a bit of violence.Quotes:\"And above him towered the ramparts of Rutupiae: a grey prow of ramparts raw with newness, from the midst of which sprang the beacon-crested tower of the Light.\" (Okay, so I wrote that down solely for the Lantern Bearers reference. I love that book. I can't help it.)\"[Justin] was a friendly soul himself, but he was always gratefully surprised at any sign of friendliness from other people, and with his gratitude, his liking went out, hesitant but warm, to the red-headed centurion [Flauvius].\"\"Here we are on the run, with the hunt up behind us and the world falling into shards around our ears and you bring your instrument-case away with you.\"\"The young Centurion, who had been completely still throughout, said very softly, as though to himself, 'Greater love hath no man--' and Justin thought it sounded as though he were quoting someone else.\""}, {"userName": "Abigail Hartman", "userReviewDate": "Mar 17, 2011", "userURL": "http://www.goodreads.com/user/show/2272332-abigail-hartman", "userReview": "I cannot quite tell if this ties with \"The Eagle of the Ninth\" or comes in as a close second, but either way, it is a wonderful story. As with \"The Eagle of the Ninth,\" Sutcliff has an amazing knack for showing emotion in the little things of the story, and for sweeping the reader off to yesteryear. Justin and Flavius are spectacular, and the smattering of lesser characters are each unique - Evicatos of the Spear, Aunt Honoria, Centurian Anthonius, Cullen the Fool, Paulinus, and, larger than life, Carausius."}, {"userName": "Nigel", "userReviewDate": "Oct 01, 2012", "userURL": "http://www.goodreads.com/user/show/5020684-nigel", "userReview": "Well, the annoying thing about this book was the spoilers contained in the blurb, two on the back cover and another one on the page inside the front cover, giving away two major turning points in the book and effectively telling us something that doesn't happen until the last act, though it is the point the book has been building up to. It doesn't spoil the book by any means but it does nail down the direction of the book for you before you've even picked it up. The first spoiled turning point doesn't occur until about 100 pages in, for God's sake. Anyway, The Silver branch, sequel to Eagle Of The Ninth, set a generation later, recounts the adventures of Justin and Flavius, young Roman officers posted to Britain where Carausias has proclaimed himself Emperor. Once a river-pilot, he rose to command the Roman fleet and absconded with it to Britain and overthrew the Governor. Now he's a valuable ally of the much-weakened Roman Empire against encroaching barbarians and sea-wolves and plans to strengthen Britain to the point where it can withstand the impending fall of Rome.Justin and Flavius, good-hearted and good-natured youths, chance on a treacherous meeting while hunting on the coast. Reporting what they witnised, however, leads to an unexpected outcome. What follows is a tale of loyalty and betrayal, a stirring adventure that builds to a fiery climax under the battered and tarnished Eagle of the lost Ninth Legion.Absolutely marvelous stuff. Sutcliff was the mistress of historical adventures, concealing a sophisticated understanding of the ancient world and its history under a deceptively simple and straightforward style of storytelling. The story twists and turns and runs its own course, and it helps if the sodding copywriter hasn't given any of the various twists and turns away."}, {"userName": "Angela R. Watts", "userReviewDate": "May 04, 2018", "userURL": "http://www.goodreads.com/user/show/58296710-angela-r-watts", "userReview": "Intriguing story and style, amazing characters (ahh, my BABIES, Y'ALL), and definitely got my heart going. Another fantastic Sutcliff story!"}, {"userName": "Katherine 黄爱芬", "userReviewDate": "Sep 24, 2016", "userURL": "http://www.goodreads.com/user/show/3839010-katherine", "userReview": "Justin bertemu Flavius di Inggris dan mrk menyadari bhw mrk msh bersepupu jauh. Ketika mrk mengetahui bhw Alectus mencoba mengkhianati Kaisar Carausius (kaisar buronan Romawi yg mengangkat dirinya sbg penguasa Inggris), mrk malah dimutasi ke daerah perbatasan.Ternyata Alectus benar2 melakukan makar thd Carausius. Sebagian pendukung Carausius menyeberang utk minta bantuan pada Kaisar Constantius. Justin dan Flavius batal menyeberang dan memilih mengkonsolidasikan di dalam negeri dgn menggalang kekuatan utk melawan Alectus. Maka perang gerilya dan perekrutan dilakukan dgn tekun oleh dua saudara ini, hingga datangnya pasukan dari Romawi, perang besar tidak terelakkan lagi. Sang Elang- lambang pasukan Romawi berhasil ditemukan lagi dan digunakam sbg simbol pembangkit semangat perang. Berhasilkah mereka memenangkan perang ini?Kesetiaan tetap menjadi pesan moral utama di buku ini. Kesetiaan terhadap Kaisar sbg penguasa utama ditonjolkan dgn baik, sampai rela mengorbankan nyawa demi negara. Saya suka scene perang di buku ini, terasa nyata kesan \"dark\" yg mengharubiru, kehilangan teman-teman seperjuangan yg melawan terus hingga darah penghabisan. Sungguh epic.Sayangnya alur cerita lebih dr separuh buku berlangsung datar dan monoton. Terlalu banyak deskripsi pemandangan alam yg bikin bosan. Untungnya adegan demi adegan memakai alur progresif sehingga tidak bikin puyeng kepala. Suasana Inggris yg saat itu masih dikuasai oleh Imperium Romawi cukup terasa. Lumayanlah utk belajar sejarah dikit-dikit."}, {"userName": "Alexa Ayana", "userReviewDate": "Sep 24, 2016", "userURL": "http://www.goodreads.com/user/show/2858235-alexa-ayana", "userReview": "Sekuel ini masih menawarkan tema persahabatan seperti buku sebelumnya. Justin dan Flavius secara mengalami instan bonding saat bertemu di benteng laut Roma di Inggris. Kenyataan bahwa mereka masih bersaudara jauh adalah bonus persahabatan mereka. Saat Kaisar Roma di Inggris yang mereka hormati di gulingkan penasehatnya Allectus yang sewenang-wenang, dua pemuda ini berusaha untuk menyelamatkan rakyat dengan cara yang paling sederhana yang mereka pahami. Seperti buku pertama, buku ini berpotensi epik. Masalahnya buku ini lagi-lagi menghabiskan hampir 3/4 buku untuk menceritakan tentang tahap persiapan mereka untuk bergabung dengan Kaisar Constantius untuk melucuti Allectus.Proses mengumpulkan pasukan \"compang camping\" dan penemuan kembali Elang ke-9 yang di sembunyikan di buku 1 penuh kejutan. Aku menyukai tiap pribadi unik yang bergabung dalam legiun Flavius dan Justin. Elang compang camping yang hilang untuk perlambang perjuangan terakhir penuh harga diri para lelaki yang mengalami kehancuran, tersisih dan buronan.Perang akhir oleh pasukan yang tak dipandang sebelah mata ini epik dan juga mengharukan. Tidak ada twist yang menegejutkan atau konflik yang lebih besar daripada yang sudah digambarkan di awal. Ending bahagianya juga biasa-biasa saja seperti buku pertama. Buku HF ini ringan dan bisa di baca oleh pemula tanpa harus bersusah payah mengingat tiap detail kesesuaian timeline sejarahnya."}, {"userName": "Basicallyrun", "userReviewDate": "Apr 24, 2011", "userURL": "http://www.goodreads.com/user/show/4921346-basicallyrun", "userReview": "I thought this was fantastic - the only reason it doesn't have five stars is because I'm judging it against The Eagle of the Ninth, which I just... like more for some reason. I adore the ties between this and The Eagle - I imagine Marcus would've been proud to see the use his eagle was put to. Justin's relationship with his father felt very real to me, too. Neither of them are really in the wrong, they're just *really awkward*. Bless. As ever, Sutcliff writes beautifully, and does a brilliant job of creating people with utterly different mindsets who somehow work together. The historical details are gorgeous too - the Christian soldier testing out Justin and Flavius with the fish drawing stood out in particular. It's not heavy handed, it's not 'Oh, look at how much I know about this period!', it's just utterly, utterly immersive.In most books with nigh-impossible tasks to be achieved, you can be pretty sure the heroes will win through somehow, but with Sutcliff you can never be sure (The Shining Company, for example). People tend to fail, not because they're bad people, or because they did something stupid, but because the odds are ridiculously against them. But they still try, and that is my kind of hero."}, {"userName": "Ellis Knox", "userReviewDate": "Jan 08, 2013", "userURL": "http://www.goodreads.com/user/show/3338358-ellis-knox", "userReview": "I have fond memories of reading Sutcliff back when I was in my early teens. Nostalgia doesn't always serve me well, though, so I wasn't sure what I was going to find when I read this book. But it was easily got on my Kindle, and I was looking for a change of pace. I was not disappointed.I'll let others describe the book; here I'll describe my reaction to it. I enjoyed it. It's not great literature, but it's solid literature and Sutcliff had a good eye and ear for historical matters. One doesn't learn history in any formal way, but one does imbibe it, rather as a tourist imbibes something of a culture even on a bus tour. I don't know why I associate Sutcliff's work with Young Adult; perhaps it's because that's when I read her. She doesn't specifically write about teens, and she certainly doesn't dumb down her writing. Maybe it's because her books have such a strong element of adventure in them. Whatever the reason, I heartily recommend her books to any teenager of today. They will be a strong alternative to the dreck that usually bears the YA tag."}, {"userName": "Jennifer Freitag", "userReviewDate": "Jan 24, 2011", "userURL": "http://www.goodreads.com/user/show/4743240-jennifer-freitag", "userReview": "When Justin, an army surgeon, and his soldier cousin, Flavius, discover a plot against their British emperor Carausius, they are forced to go into hiding. There they spend their time dodging the Saxon agents of the traitor while creating secret communications with the Roman Caesar Constantius on the Continent. All the while they build up a rogue Legion of their own, making for their standard a mysterious, wingless Eagle whose history lies in shadow, a glory of past days to lead them on to future triumph. As with every piece of Romano-British historical fiction of Sutcliff's which I have read, though definitely with twists of her own added, the author brings the setting to life in such a captivating way as to make that ancient time as real to the reader as the chair in which he sits. While some may be irked to have no more of Marcus and Esca and Cottia from the previous book The Eagle of the Ninth, Justin and Flavius are excellent characters in their own right, two sides of the same coin, living characters against a very lively backdrop."}, {"userName": "Yannis", "userReviewDate": "Jul 23, 2013", "userURL": "http://www.goodreads.com/user/show/6008887-yannis", "userReview": "4 stars I guess because why not? It's a solid good history fiction book about as good as the first of the series. It may even be read as a stand alone although the reader will be kinda wondering what is the lost eagle's story but this adds to the mystery. Mystery and the unexpected is something missing in the book coming to think of it. You immediately know the good guys and the bad ones(seriously, the hero sees a guy killing a bug and immediately understands he's a very evil guy and his main opponent). You also know the outcome because, duh, it's history. No real plot twists and apart from a an incident where the hero is trapped there isn't much of a thrill. So, all you have left is a nice story nicely told by Sutcliff. It still gets a good mark though. I mean, you like a story about Romans in ancient England if you picked it up and this is one of the best."}, {"userName": "Kiwi Carlisle", "userReviewDate": "Feb 03, 2016", "userURL": "http://www.goodreads.com/user/show/3100071-kiwi-carlisle", "userReview": "It must be 20 years since I last reread this childhood favorite. I still love it and so appreciate Sutcliff's treating her readers as intelligent beings. It made me feel good as a tween to be considered a reader who didn't need to be talked down to--who knew who Euripides was and what a pilum was used for. Sutcliff once wrote that her books were for children from 9 to 90. Ave, Rosemary, your 62 year old child salutes you!"}, {"userName": "Rik", "userReviewDate": "Feb 03, 2012", "userURL": "http://www.goodreads.com/user/show/7345516-rik", "userReview": "Really enjoyed this book. Some similarities between this and the first, such as unusual friendship between the Roman occupiers and the locals, made it a little less fresh, but then I did read them one after the other. Again it felt authentic, and does , as the forward says, have real historical context. Makes me want to find out more about this period in history."}, {"userName": "Hadiyanti Ainun", "userReviewDate": "Apr 17, 2015", "userURL": "http://www.goodreads.com/user/show/42082416-hadiyanti-ainun", "userReview": "i read the indonesian-translation one. wether the translation one similar or not, i'm preety sure this book truly awesome. its proves that even people in the past aren't always 'jahiliyah'--unknowledgeable. they have their own sitcon. in this case, justin and flavius certainly against allectus the traitor.for short, i love this book"}, {"userName": "Cindy Tomamichel", "userReviewDate": "May 21, 2017", "userURL": "http://www.goodreads.com/user/show/62549660-cindy-tomamichel", "userReview": "A good read, with characters that you care about, and historical detail that is just enough to set the scene. Some lovely descriptions and snippets of detail scattered through the book. Possibly showing its age a little now, as I felt it read a little slow despite having plenty of action. This didn't stop me from reading, and probably enhanced my enjoyment of the details.The characters are well drawn, and she weaves in parts of 'The Eagle' book providing a sense of continuity. Lots of strange characters developed from small historical facts, which I found interesting."}, {"userName": "Linda", "userReviewDate": "Feb 06, 2018", "userURL": "http://www.goodreads.com/user/show/5433361-linda", "userReview": "This well-written Young Adult novel is set in late third-century Britain and is based on actual events. It centers on two young Romans named Flavius and Justin, who are coincidentally posted to the same fort and then discover that they are distantly related. The battles are depicted fairly realistically, for a YA book, but there are also moments of humor and genuine friendship among the main characters.(This is a sequel to The Eagle of the Ninth and the second volume of the Roman Britain trilogy.)"}, {"userName": "Rosemary", "userReviewDate": "Feb 10, 2017", "userURL": "http://www.goodreads.com/user/show/133127-rosemary", "userReview": "This book fits in between The Eagle of the Ninth and The Lantern Bearers -- about 100+ years on each side. I'm very loyal to Sutcliff, but this is not her best work. It has many of the same familiar elements (primeval natural setting, plot tracing the struggle to hold onto a humane civilization amid the power struggle of tyranny and anarchy) but the storyline doesn't have quite the emotional depth of something like Lantern Bearers or the utter magic of Flame-Colored Tafetta. It's overall a little too glibly symmetrical."}, {"userName": "Jamie (ReadsInTrees) Dacyczyn", "userReviewDate": "May 13, 2017", "userURL": "http://www.goodreads.com/user/show/5407713-jamie-readsintrees-dacyczyn", "userReview": "Another well written installment in thus series. I'll admit that quite a bit if the subtle action bits were lost on me because I kind of rushed through this one a little because I was eager to begin rereading The Thief by MWT. However, it's obviously a classic worth a reread and I suspect I'll enjoy it more the second time around."}, {"userName": "Margaret Pinard", "userReviewDate": "Mar 04, 2018", "userURL": "http://www.goodreads.com/user/show/121159-margaret-pinard", "userReview": "+ 52 \"It was a raw morning with the mist lying low and heavy like smoke among the brown heather, and the rooty tang of bog and the bitter-sweetness of sodden bracken hanging in the air.\"p136 exultation"}, {"userName": "Christie", "userReviewDate": "Feb 06, 2018", "userURL": "http://www.goodreads.com/user/show/59795688-christie", "userReview": "Lovely prose, a charming almost anti-hero, vivid descriptions of the settings, I really enjoyed this book. Several of the minor characters are so well drawn, I'd like to see them have their own books. What is Aunt Honoria's back story? Hmmmm..."}, {"userName": "Ethan Smith", "userReviewDate": "Apr 13, 2018", "userURL": "http://www.goodreads.com/user/show/75568220-ethan-smith", "userReview": "Three words... Flavius, Crispinius, Asklepiodotus"}, {"userName": "Catherine ~Whatever you are, be a good one~", "userReviewDate": "May 19, 2017", "userURL": "http://www.goodreads.com/user/show/63524741-catherine-whatever-you-are-be-a-good-one", "userReview": "A great historical fiction story of when the emperor of Britain is killed by his right-hand man and two Romans set out to rebel."}, {"userName": "Eric", "userReviewDate": "Dec 26, 2017", "userURL": "http://www.goodreads.com/user/show/63369991-eric", "userReview": "A good story I think. It's not a direct sequel but the historical fiction written within is very interesting."}, {"userName": "Heidi Burkhart", "userReviewDate": "Oct 14, 2017", "userURL": "http://www.goodreads.com/user/show/16095582-heidi-burkhart", "userReview": "Fantastic historic fiction. This book can be enjoyed equally by middle school students to adults."}, {"userName": "Margaret Peacock", "userReviewDate": "Mar 20, 2018", "userURL": "http://www.goodreads.com/user/show/21572473-margaret-peacock", "userReview": "Excellent. Hated that it had to end."}, {"userName": "Ariana", "userReviewDate": "May 25, 2018", "userURL": "http://www.goodreads.com/user/show/3999129-ariana", "userReview": "I really just love this author. She has always been my favorite author. The Silver Branch is a great example of her writing."}], "description": "Intrigue, plotting, and battles in the second of Rosemary Sutcliff's best-selling trilogy which began with The Eagle of the NinthViolence and unrest are sweeping through Roman Britain. Justin and Flavius find themselves caught up in the middle of it all when they discover a plot to overthrow the Emperor.In fear for their lives they gather together a tattered band of men and lead them into the thick of battle, to defend the honour of Rome. But will they be in time to save the Emperor?Rosemary Sutcliff's books about Roman Britain have won much acclaim and the first in the trilogy, The Eagle of the Ninth, has now sold over a million copies worldwide. The author writes with such passion and with such attention to detail that the Roman age is instantly brought to life and stays with the reader long after the last page has been turned.Features Rosemary Sutcliff is the acknowledged master of children's historical storytelling Award-winning author has won Carnegie Medal and has also been awarded the OBE and the CBE Historical fiction is currently enjoying a huge amount of popularity Great book for boys and girls alike Beautiful package with original black and white artwork throughout by Charles Keeping together with new cover look to tie in with other books in the sequence, The Eagle of the Ninth and The Lantern Bearers", "title": "The Silver Branch\n      \n          (The Dolphin Ring Cycle #2)", "url": "http://www.goodreads.com/book/show/159806.The_Silver_Branch", "average": 3.93, "cover": "https://images.gr-assets.com/books/1355118091l/159806.jpg", "reviews": 149, "authors": [{"url": "https://www.goodreads.com/author/show/26457.Rosemary_Sutcliff", "name": "Rosemary Sutcliff"}, {"url": "https://www.goodreads.com/author/show/101076.Charles_Keeping", "name": "Charles Keeping"}], "type": ["Historical", "Fiction", "Historical", "Young Adult", "Adventure"], "outlinks": ["http://www.goodreads.com/book/show/159806.The_Silver_Branch", "http://www.goodreads.com/book/show/32601560-srebrna-grana", "http://www.goodreads.com/book/show/9170281-the-silver-branch", "http://www.goodreads.com/book/show/3302188-the-silver-branch", "http://www.goodreads.com/book/show/19716077-the-silver-branch", "http://www.goodreads.com/book/show/18003086-the-silver-branch", "http://www.goodreads.com/book/show/780192.The_Silver_Branch", "http://www.goodreads.com/book/show/3419775-the-silver-branch", "http://www.goodreads.com/book/show/11963622-the-silver-branch", "http://www.goodreads.com/book/show/149405.The_Eagle_of_the_Ninth", "http://www.goodreads.com/book/show/162954.Black_Ships_Before_Troy", "http://www.goodreads.com/book/show/149418.The_Lantern_Bearers", "http://www.goodreads.com/book/show/149413.Sword_at_Sunset", "http://www.goodreads.com/book/show/272527.The_Shining_Company", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}