{"ratings": 509350, "userreviews": [{"userName": "Kemper", "userReviewDate": "Sep 22, 2007", "userURL": "http://www.goodreads.com/user/show/405390-kemper", "userReview": "You know what’s really scary? Getting sick while you’re reading the first part of The Stand. Just try running a fever, going through a box of tissues and guzzling the better part of a bottle of NyQuil while Stephen King describes the grisly deaths of almost every one on Earth from a superflu. On top of feeling like crap, you'll be terrified. Bonus!After a bio-engineered virus that acts like a revved up cold escapes from a U.S. government lab, it takes only weeks for almost all of humanity to succumb to the disease. A handful of survivors are mysteriously immune and begin having strange dreams, some of which are about a very old woman called Mother Abigail asking them to come see her. More disturbing are nightmares about a mysterious figure named Randall Flagg also known as the Dark Man or the Walkin’ Dude.As they make their way through an America almost entirely devoid of people, the survivors begin to unite and realize that the flu was just the beginning of their problems. While some are drawn to the saintly Mother Abigail in Boulder Colorado who tells them that they have been chosen by God, others have flocked to Flagg in Las Vegas who is determined to annihilate all those who refuse to pledge their allegiance to him.If King would have just written a book about a world destroyed by plague and a small number of people struggling in the aftermath, it probably would have been a compelling story. What sets this one apart is the supernatural element. Flagg is the embodiment of evil and chaos. He's a mysterious figure who has been giving the wrong people the push needed for them to make things worse for everyone, and he sees the plague as his chance to fulfill his own destiny as a wrecker of humanity. And on the other side, we have God. Yep, that God. The Big Cheese himself. But this isn’t some kindly figure in a white robe with a white beard or George Burns or Morgan Freeman. This is the Old Testament God who demands obedience and worship while usually rewarding his most faithful servants with gruesome deaths. King calls this a tale of dark Christianity in his forward, and one of the things I love about this book is that it does feel like a Biblical story, complete with contradictions and a moves-in-mysterious-ways factor. Stories don’t get much more epic than this, and King does a great job of depicting the meltdown of the world through the stories of a variety of relateable characters. (Larry Underwood remains among my favorite King creations.) One of my few complaints is that this features a lot of King’s anti-technology themes that he’d use in several books like Cell or The Dark Tower series. We’re told repeatedly that the ‘old ways’ like trying to get the power back on in Boulder are a ‘death trip’. The good guys gather in the Rocky Mountains, but if they try to get the juice going so they won’t freeze to death in the winter, they’re somehow acting in defiance of God’s will and returning to the bad habits? Not all tech is bad tech, Mr. King. Nature is a bitch and will kill your ass quicker than the superflu.Here’s another thing I’m not wild about. When this was published in the late ‘70s, the bean counters at King’s publishers had decided that the book as written would be too pricey in hardback and no one would pay a whopping $13 for a Stephen King hardback. So King cut about three hundred pages.Around 1990 after it had become apparent that King could publish his shopping list as a best seller, he put those pages back in and released the uncut version. Which I’m fine with. The original stuff was cut for a financial reason, not an editorial one, and there’s some very nice bits of story added in. If King would have stopped there, we would have had a great definitive final version as originally created by the author.Unfortunately, he seemed to catch a case of Lucasitis and decided to update the story a bit and change its original time frame from 1980 to 1990. I’m not sure why that seemed necessary to him. Yes, the book was a bit dated by then, but it was of its time. He didn’t rewrite the text (Which I’m grateful for.), but just stuck in some references to Madonna and Ronald Reagan and Spuds McKenzie. This led to a whole bunch of anachronisms. Would students in 1990 call soldiers ’war pigs’? Someone in New York picks up a phone book to look up the number to call an ambulance instead of dialing 911? A song called Baby, Can You Dig Your Man is a huge hit? None of it quite fits together. There's also a layer of male chauvinism and lack of diversity that you can overlook in a book written in the late '70s, but seems out of place for a book set and updated for 1990.The things that irritate me are still far outweighed by one of my favorite stories of an apocalyptic battle between good and evil.I’m also glad to get a long overdue audio edition of this book. Great narration and 40+ hours of end of the world horror make for a damn fine listening experience."}, {"userName": "Carol. ", "userReviewDate": "Jul 05, 2011", "userURL": "http://www.goodreads.com/user/show/3978225-carol", "userReview": "Dear Stephen,I'm sorry. I just don't like you in that way. I know we've been friends for a long time, but I just never developed those kind of feelings for you, even after eleven hundred pages. I feel like we only moved forward in fits and stops, and we were just never able to sustain a kind of even-handed development of the kind of chills and thrills a person really likes. Shock someone enough times with snot running out of their nose, and it just becomes a little meaningless. And there are only so many ways to view a dead body before one gets kind of numb instead of apprehensive. Using the journal device to move things forward seems a little crude, when what we really need to do is talk. I have to confess, I've felt kind of uncomfortable watching you struggle with religion and spirituality. You sparked my interest when you posited that this might be the battle between the age of reason and that of \"irrationalism,\" and the dark man was the last vestige of doomed rationalism. I thought for a few minutes we were headed somewhere really special, but you didn't seem very confident, and the theme fell apart. I will say there were a few surprises along the way, which I found pleasant. I appreciate you avoiding the obvious character arcs, especially when it comes to redemption. I was glad to meet most of your friends, especially Joe/Leo, Stu and even Kojak. Your military friends bored me out, though, especially Starkey; I don't even get why you like spending any time with those guys. Such a bunch of fossils. I do have to say, I was really impressed with how you must have studied disease modelling and progression--I almost felt like was there.Sometimes I get the feeling that you don't really see me as a person, just a baby-maker. You even have an extended soliloquy about it, as if I wasn't even here reading your words. It bothers me, because you took the time to develop nuanced male relationships (Larry, Stu, Lloyd), but the women were about reproducing or were cannon fodder. Since you allowed technology to remain, I'm not going to buy into your lowest most-functional society mentality, no matter how many sociological theories you throw at me. And then there's the elderly black woman as representation of all that's spiritual. Perhaps even Mother Earth? If I'm rolling my eyes, it's because it's another aspect of compartmentalizing women as either maiden, matron or crone, and people of color as closer to God(s)(being savage and all, as you so helpfully illustrate in your \"The Circle Closes\" afterward). Honestly, it's kind of juvenile, and a little disappointing when I know you are capable of so much more. It's time for me to move on. I'm sure you'll find someone special eventually, Stephen, because you are such a really great guy. And so unusual, too.With Three Stars,Your Friend Always.Cross posted at http://clsiewert.wordpress.com/2013/0..."}, {"userName": "Evan", "userReviewDate": "Jul 24, 2009", "userURL": "http://www.goodreads.com/user/show/2555794-evan", "userReview": "Are 1100 pages enough to stop a bullet? This was the question that came to mind when my roommate asked if I had anything to use as target practice for when we would go shooting. Well, that was not the exact question. More of a theoretical situation, really. Suppose you are being shot at, and you have a paperback copy of the stand in your pocket, and that's where the bullet hit, would Stephen King's really thick novel be enough to stop the bullet and save your life? I was determined to find out. Some reading this may be more horrified by the fact that I would be willing to even think of shooting such a beloved book. And I agree, based on seeing it's affect, that shooting a book is a very violent act. Yet I didn't feel any remorse in shooting it. I do admire Stephen King as a writer, though. I read several books of his (before and after reading the Stand) that I did enjoy a great deal, and hope he keeps writing more books. I like King's style, and something tells me that he would be amused to know that I shot his book. But I didn't like the Stand because I felt that it failed to deliver on it's promise of an \"apocayptic confrontation between Good and Evil.\" I was waiting for our heroes to make the stand, which is a very powerful phrase and title for a book. *** vague spoilers follow *** Well, the heroes stood, and that's pretty much all they did, just in time for the most shameless deus ex machina ending I've ever come across. All the bad guys died in a way that wouldn't have made any difference if the good guys had been there to make their stand or not. I read about three hundred pages of tedious ad hoc committee meetings to get to that? Disapointing. I expected so much more. *** end of vague spoilers *** But perhaps the book had other virtues. Maybe, just maybe, this 1,168 page book could save someone's life if they were being shot at. Just to make one thing clear: I, in no way, advocate the use of fire arms to maliciously deface intelectual property. I wouldn't have tried this on the Scarlet Letter which is 272 pages and which I equally disliked. I was going to shoot the Stand in the name of Science and public safety. My roommate and I took it to an outdoor shooting range to test such a possibility. I mounted it up on a dirt berm, and used my roommate's .45 rifle to shoot it. No wimpy guns here, could this book stop a bullet or couldn't it? Four bullets hit the Stand. Two bullets grazed the side. One went through the \"h\" in \"Stephen\" and curved up through the top before reaching page 450. The last bullet hit just below center, making a perfectly shaped O. What took me two months to get through, that bullet blew through in a tiny fraction of second. The bullet exploded out the back, ripping a two inch hole through the back cover, and finally ending in a puff of dirt behind it. So the answer is no, my friends. 1,168 pages are not enough to save your life from a .45 slug. I wish I could say otherwise. If they had I would have given this book a higher rating."}, {"userName": "Lyn", "userReviewDate": "Oct 10, 2015", "userURL": "http://www.goodreads.com/user/show/5253785-lyn", "userReview": "M-O-O-N. That spells “Damn, what a great book!”I knew King had it in him, I am a fan of his brilliant 1977 haunted house thriller The Shining, but I did not expect this.The best post apocalyptic novel ever? Maybe, that is a broad category teaming with great work from talented writers, but King’s The Stand is an epic, genre defining work.My friend Michael has a profile statement, something to the effect of finding our next 5 star rating. I like that sentiment, and am excited by the opportunity that our next favorite book is out there waiting to be read; a new best friend of an author to whom we’ve yet to be introduced. Here’s mine. I’m late to the party, just reading this for the first time in 2015. I think I was always a little intimidated by the length. It’s a beast, and I was a glutton for punishment reading the 1990 extended version, weighing in at a heavyweight 1153 pages. But it’s a runaway train, grabbing the reader up and taking him or her where Stephen King wants to take you.Yes, it’s a book about a devastating plague, but also so, so much more. King weaves in an allegory about the viruses amongst us. There is also the spiritual quality of the book, King shows how we are sinners in the hands of an angry God, and that dreamers will survive – and survivors can still dream.I could not help making a comparison with the Left Behind series, and associating Flagg to Nicholai Carpathia – though King’s characterization is far more complex and well rounded, and like Milton’s Satan, the most interesting character here is the villain. This makes me appreciate his The Gunslinger series and I want to search out Flagg and read more about him.This is also an American epic and in its context an American eulogy. King shows us the good the bad and the ugly of what we are and what we can be. An observant reader will see references to Ursula K. LeGuin (word for world is woods), to Jim Morison, Edgar Allan Poe, Woody Guthrie, and hell even Rod McKuen.I know Mr. King and have enjoyed many of his works and I have now been amazed by his finest."}, {"userName": "Melissa ♥ Dog/Wolf Lover ♥ Martin", "userReviewDate": "May 05, 2018", "userURL": "http://www.goodreads.com/user/show/17438949-melissa-dog-wolf-lover-martin", "userReview": "Wow!! So I have had this awesome paperback door stopper for some time. (Gift from friend) I decided to get the audio through the library and of course now I have added it to my Audible wishlist. The narration is freaking awesome! The whole damn book is freaking awesome! The thing is, I didn't think I would like it because I barely remember the movie and am not sure I liked it. That was a long time ago and who the hell knows! I'm just extremely happy I finally read it. Yeah! It's long, but most books I read or listen to are so that's neither here nor there. I just loved reading about all of the people and events. And I did laugh at times. YES, scary stories do have some comedy at times. Lol. Anyhoo, enjoy peeps!! Happy Reading! Mel 🖤🐾🐺"}, {"userName": "Delee", "userReviewDate": "Mar 23, 2012", "userURL": "http://www.goodreads.com/user/show/6168268-delee", "userReview": "M-O-O-N spells spectacular!I first read THE STAND in the early 80's. It was during the Christmas break- I lived out in the boonies with my family, and after the holiday hoopla was over -I planted myself in my favorite chair and sat there for 4 days devouring every page-(only leaving for bathroom breaks, meals and sleep).30+ years later my reading experience was a little different. I read it with my Goodreads friend Lisa- who had the uncut version, while I had the original- I stopped and started as she caught up- there were huge amounts of messages back and forth- on the characters, the differences in editions, who we loved- who we hated, and everything and anything we could think of to discuss. It was a month long read......but the one thing both experiences did have in common was- I LOVED IT each time!!At a remote U.S. Army base, a strain of influenza is accidentally released. Despite a lock down- soldier Charles Campion is able to escape with his wife and child. By the time the military is able to track his whereabouts- Campion has spread the disease around parts of Texas- triggering a pandemic which kills off 99 percent of the population. The one percent are left in survival mode- spread out over the entire country and plagued by strange dreams about two individuals which eventually draw some to Nebraska and some to Las Vegas.Hemingford Home, Nebraska- Is the home of Abagail Freemantle— \"Mother Abagail\" a 108 year- old woman who receives visions from God. She is the embodiment of good.Las Vegas, Nevada- is where Randall Flagg has set up shop- Randall is also called The Dark Man and The Walking Dude. He lives to cause death and destruction and has supernatural powers which allow him to be human, animal or demon. He is the embodiment of evil.King said that he \"wanted to write a fantasy epic like The Lord of the Rings, only with an American setting\"- and that is just what he did. THE STAND is a wonderful epic fantasy adventure about good vs evil- One that I would recommend to anybody who hasn't read it yet, and even to those who have!"}, {"userName": "Mohammed Arabey", "userReviewDate": "Mar 01, 2017", "userURL": "http://www.goodreads.com/user/show/13592557-mohammed-arabey", "userReview": "لماذا تقرأ رواية 1440 صفحة؟لأنها رواية ستيفين كينج الأطول، لم يلجأ هنا لديستوبيا معلبة مجهزة مسبقا، وحده قادر ببناء واحدة من البداية!لكنها 1440 صفحةلأنها ملحمة ليست خيالية بل معاصرة عن عالمنا..ماذا لو أصابه وباء بيولوجي قضي علي 99% من سكانه!في 1440 صفحة؟لأنها تصور لآخر الأيام، القيامة، عن المواجهة، الخير ضد الشر .. قل لي هل أنت مستعد لمواجهة المسيخ الدجال حقا؟!لكنها رواية..وفي 1440 صفحةلأنها 3 روايات بواحدة، تبدأ بمواجهة للنفس البشرية..صراعات نفسية لشخصيات مختلفة تواجه أصعب أيام حياتهاتخيل الناجين في أرض موتي، جثث بكل مكان..الجميع فقد احباءه ومعارفه..فقد أيمانه... الشدائد كتلك هي ما تظهر معدن البشرنحن من صنعنا الأوبئة الجديدة والأسلحة البيولوجية والجرثومية في المختبرات العسكرية لنستخدمها كسلاحفماذا لو انقلبت ضدنا؟لقد سبق كينج ساراماجو بسنوات في رسم الفوضي التي تنتج عن وباء مكتسح وتغيرات التي تحدث بنفوس البشركما أنها عن علم الاجتماع ..وكيف سيكون الناجين مجتمعا من جديدوكيف أننا دائما نكرر أخطائناربما يكون الإنسان قد خلق علي صورة الله، لكن المجتمع البشري خلق علي صورة الشيطان، لكنه دوما يحاول العودة لاصلهبل وبعد النجاة من الموت عليهم مواجهة كبري ...مواجهة الشيطان ، في اختبار اصعبوَلِيُمَحِّصَ اللَّهُ الَّذِينَ آمَنُوا وَيَمْحَقَ الْكَافِرِينَذلك لأنها أيضا عن فلسفة الإيمان بالله...أو الشيطان!!تبدو لي كرواية تبشيرية دينية..وفي 1440 صفحةلكنها رواية إنسانية، عالمية، كلنا يواجه شياطين نفسه، والاغراءات بالسلطة، الاستحواذ، عدم تحمل المسئولية، حتي فكرة المسيخ الدجال واتباع الشيطان هي أمر ذكر بالأسلام كما المسيحية وله تشابه بكل الاديانوحتي إن لم تكن مؤمنا، فصدقني حتي أبطال الرواية لم يكونوا كذلكالجمال في جنون التدين هو قوته علي تفسير أي شئ. بمجرد قبول أن الله (أو الشيطان) هو المسبب اﻷول في حدوث كل شئ في العالم الفاني، لا شئ يبقي للصدفة..المنطق يمكن ألقاءه من الشباك بسعادةقد يكون فكرة الشيطان والمسيخ الدجال غير منطقية لملحد..لكن الشيطان هنا قد يكون مجرد زعيم، طاغية..محب للسلطة يجمع أتباعه كالأنعاممن يهدر المليارات في صناعة الاسلحة النووية ، الجرثومية..وباء ليقتل به غيرهلقد كتبها ستيفين كينج بالسبعينات، بعد نهاية حقبة الستينات بمخاوفها وذعرها من حدوث حرب نووية اخري مخيفة بلا معني يضيع بسببها ملايين البشر، وسط اتهامات بتجارب الأسلحة البيلوجيةوما أشبه البارحة باليوم!في 1440 صفحة؟نعم ستيفين كينج ثرثارا بحق..يكثر من وصف الطرق والاشارات للمنتجات الأمريكية والعلامات التجارية من سيارات وحتي الأطعمة المعلبةنعم كثير من السطور كانت حشوا، لم تؤثر في الأحداث بشكل مباشر ولكنه بنفس الوقت يجعلك تعيش وسط الأحداثفهذا التطويل جعلني أجوب الولايات المتحدةالأمريكية من شرقها لغربها أكثر من مرة، كطريق الحج، في ديستوبيا مرعبة مقبضة..عشت بها شهرا في تجربة لن أنسها!بالطبع، أنها 1440 صفحة بحق اللهلأن ضخامتها هي سبب جعلها رحلة تعايشها لا تنسيهي أهم أعمال الكينج، ولو انها ليست الأقرب لقلبه ومع ذلك وافق في إعادة نشرها بنسخة أكبر بها كل ما حذفه في وقت نشرها الأول في 1978وعندما عرفت تلك الأجزاء وجدت أنها ما جعلني من ربع الرواية اﻷول أشعر بقرب أكبر من الشخصيات بالأخص، لاري أندروود وفراني جولدسميث وعمق لشخصياتهما وتطور ملحوظ لهما لاحقاأتعجب من هذا الذي يقرأ نسخة مختصرة من رواية ضخمة ثم يقول لك أن لا تطور بشخصياتها ويكتب عنها مراجعة يهاجمهالكن ما جذبك لتتخلي عن كل الكتب لتستكمل قراءة رواية في 1440 صفحة؟أعلم أنني لن أقنعك عزيزي القارئ بما يكفي، بل ربما لا أرشح الرواية بقوة كبعض أعمال ستيفين كينج اﻷخريﻻنها رحلة قد تجد نفسك مجبرا لأستكمالها...أو تتوقف في ربعها الأول وتفضل الرحيل عنها كما من رحل عن الاحداث بسبب \"كابتن الترحال\"، \"الرحالة\"، \"الإنفلونزا اﻷعظم\"، بل وطوال قراءتها ستجد عقبات أشد قد تجعلك ترحل عنهالكنك إن صمدت، حتي المواجهةالوقفةستجد نفسك شهدت مواجهة عميقة، قوية لها أكثر من بعدولنر لاستطيع تقييم رحلتي تلك بتقسييم المراجعة للثلاث كتب التي أحتوتها الرواية~~~~~~~~~~~~~~~~~~~الكتاب اﻻول : كابتن الترحالمن 16 يونيو الي 4 يوليو -480 صفحة فقطهنا كما قلت، ستيفين كينج يبني ديستوبيا من الأساسبعكس كل الروايات الشهيرة الحالية التي تبدأ مثلا في مجتمع تم تدميره من قبل بسبب حرب، كارثة طبيعية، أو بشرية، ربما نووية ، وباء، أو حتي حاكم طاغية مستبد .. كل تلك الروايات التي تبدأ بجو دوستوبيا معلبة، مجهزة مسبقالكن في هذه الحالة...الوباء المسبب للديستوبيا هو المعبأ والمجهز مسبقا...في مختبرات الاستخبارات العسكرية الأمريكيةهنا الرواية تبدأ في أمريكا..التسعينات، تعاني كما الكثير من الدول وقتها ، تعاني كما ستعاني دوما ؛ الازمة الاقتصادية ، التضخم...زيادة السكان وقلة الموارد فأرتفاع الاسعار كالعادة..حزب الديموقراطيين..ألخولكن في مختبر عسكري تابع للحكومة الأمريكية يفلت منه فرد أمن بسيط شهد وفاة مفاجأة لكل من بالمعمل علي كاميرات المراقبة بالخارج...ليهرب قبل أن يغلق باب مباني المختبر اوتوماتيكيا بالكامل للاحتواء، و يأخذ عائلته ويرحل عن الولاية بأسرع وقتتصدم سيارته صباح اليوم التالي بمحطة بنزين في الولاية التالية، ولحسن الحظ- أو سوءه- يلحظ ستو ريدمان السيارة المسرعة فيغلق مضخات البنزين بسرعة كي لا تنفجر بالسيارة بالمحطة كلها(ياليتها انفجرت) ، (حقا؟)ومن تلك البلدة الصغيرة، بمقابلة عابرة تلو الاخري يبدأ كابتن الرحلات، الرحالة، الإنفلونزا العظيمةوصف السيد كينج كان كابوسيا هنا لكيف أنتشر المرض، هناك فصول كأنها تروي من منظور الوباء نفسه ولكن بشكل غير مباشر، كيف يقابل شخصا مصاب شخصا اخر سليما، ليذهب لشخص اخر يرتحل لولاية أخري حاملا مرض ينتشر بسهولة في الهواء..بشكل تفصيلي غريب كابوسيوقد يكون بدأ قويا، يقتل في لحظتها، لكن بأنتشاره طالت فترة حضانته...وصار كشفه أصعبفأعراضه أعراض مجرد برد عادي ، برد أول الصيف العتيد، لكنه يتحول لكل مضاعفات البرد والإنفلونزا البشعة حتي يودي بحياة المريضثم تتطور الامور بسرعةقمع عسكري أعلامي ، مستشفيات تعج بالمرضي والموتي ، فوضي في الأعلام ورعب في الشوارع والجيش يضع حواجز بالطرق بين الولايات التي لا يعرف سكانها إلي أين يفرون من الأساسوقبل أن ينتهي هذا الكتاب الكابوسي (الجزء اﻷول)، يكون قد تم القضاء بنجاح علي 99% من سكان أمريكا وبالتبعية العالم كله -بسبب ذكر عابر أنه أيضا وصل الصين وروسيا-..كابتن الترحال قام برحلات ناجحة بحقولكن هناك ناجين لم يصبهم الوباء...ولكنهم 1%فحسب وبالطبع لم ينس السيد كينج أضافة فصل قبل نهاية هذا الكتاب عن كيف أن ال1% من السكان الناجين لمناعتهم من الوباء ،قد يلقي ربعهم نحبه بسبب أسباب أخري طبيعيةتخيل كل جيرانك وشارعك والحي الذي تقتنه ميتون ببيوتهم أو سياراتهم العالقة في أزدحام مروري لن يفك أبدا، هل سيتحمل عقلك واعصابك؟طفل رضيع لديه مناعة لن يستفاد بها من ذلك الوباء، سيموت في غضون ساعات وحيداذلك الفصل بالاخص كان قاسي ببشاعة ، أسلوب السيد كينج به كان عبقريا ، أضافة عبارة \"ليست بالخسارة الكبري\" بعد أغلب الوفيات التي نتجت بأسباب غير الوباء أصابتني بالرعشة ، حتي إن كانت عن مدمن هيروين مات بجرعة زائدة لم يجد من يساعدهلكن تلك الشخصيات التسع بهذا الفصل والتي تراوحت قصتهم بين صفحة ونصف الي سطر ونصف ليسوا الوحيدين الذين عانوا قسوة السيد كينجبل الشخصيات الرئيسية نفسها التي نجت الوباء أيضا ستشهد قسوة أشد وطراوالتي سنتعرف عنها لاحقاولكي لا احرق لك مصائر الشخصيات لنر الكتاب الثاني~~~~~~~~~~~~~الكتاب الثاني : علي الحدودمن 5 يوليو الي 6 سبتمبر - 660 صفحة فقطالأن كل الشخصيات الرئيسية -من مختلف الولايات- بدأت تتحرك من المدن الخاوية الا من جثث الالاف الموتي بكل مدينة لتتجه الي مصيرهاولكن الي اين؟هذه هي النقطةلا يوجد مجتمع الان ، بل سيتم بناء مجتمع من الاساس من جديدأرني رجلا او امرأة وحدها أريك قديسا. أعطني اﻻثنين وسيقعا في الحب. أعطني ثلاثة وسيخترعوا أمرا ساحرا نسميه ‘مجتمع’. أعطني أربعة وسيبنوا هرما. أعطني خمسة وسيجعلوا أحدهم منبوذا. أعطني ستة وسيعيدوا أختراع العنصرية أعطني سبعة وفي سبع سنين سيعيدوا أختراع الحروب. وهنا يلعب ستيفين كينج لعبة المواجهة النفسيةهناك البعض يحلم برجل مظلم ، يمشي في الظلام يسبب برودة وقشعريرة لمن يراه ويحاول ان يجند اتباع لهواحيانا تتنتقل الاحلام الي سيدة سوداء عجوز معمرة في مزرعتها تغني طيلة النهار اغاني وابتهالات تبارك اللهوالغريب ان الجميع يحلم بكلا الشخصيتين ، وكل نفس لها أن تفضل طريقا عن الاخرتفسير جزء الأحلام الجماعية رغم ان بها شئ من الميتافيزيقا \"ماوراء الطبيعة\" هو أن الأحلام عاما تتأثر بشكل كبير بالوعي الجمعي ، وعندما وصل سكان الارض ل1% فقط فقد كان سهلا التأثر بالاحلام ويتكون ما يشبه حلم جماعيقد يكون الرجل المظلم \"راندل فلاج\" لأنه تابع للشيطان له بعض القدرات الخارقة للطبيعة لينادي علي اتباع له بالاحلام، ولكن كهبة من الله يحلم البعض ايضا بتلك السيدة العادية، \"اﻻم أباجايل\" ، المؤمنة فحسب..والتي تشعر أن الله أختارها لتعمر لسبب جاء وقتهفتتخذ الأم أباجايل دور أرشاد الناجين الذين سيتوجهوا لها ، حسب رؤياها من الله، للذهاب للغرب للاستقرار بمدينة سيسمونها \"المنطقة الحرة\" عند شرق جبال روكيبينما يختار الجانب الاخر الذهاب لغرب جبال روكي ، للاس فيجاس نيفادا...لدي رجل الظلام..رجل الشيطانوهنا سيتكون المجتمع، من جديدأو باﻻصح، المجتمعانونتابع بشكل مرهق وقوي كيف يتقابل شخصيات الكتاب الاول مع شخصيات جديدة علي الطريق ، التحالفات التي تحدث بين الشخصيات ، وتشهد معهم اهوال ما حدث بالولايات الاخري برحلة طريق شاقة عبر الولايات الامريكيةوكل شخصية او جماعة حسب وجهتهاهنا يقدم ستيفين كينج نقاش مستمر طوال الاحداث هنا عن المجتمعات وتكونها.. كيف قد يكون مجتمع يديره شيطان طاغية يحكم رعاياه بالخوف..ويخطط كل مجهوداته كيف يقضي علي غيرهوكيف يمكن ان يظل مجتمعا متشتتا متخبطا برغم من ان نواياه صالحة، ديموقراطي، ولكنه يحاول تنظيم فقط بشكل بيروقراطي تنظيمي عقيم وبأجتماعات لا تنتهي مما قد يؤدي لضعفهبل والاهم كيف يمكن للمجتمع الصالح التجهيز ضد الشيطان؟ العدو الخارجي؟هل يبدأ ايضا في ارسال جواسيس؟ التحضير ﻻسلحة اخري؟ ربما بيولوحية؟ وباء اخر؟بل لماذا بعد كل هذه الصعاب (وباء قاتل)..(تذكر ان صنعه البشر بنفسهم)، يظل عليهم مواجهة الشيطان؟؟هنا نعود للآية التي ذكرتها بأول المراجعة{وَلِيُمَحِّصَ اللَّهُ الَّذِينَ آمَنُوا وَيَمْحَقَ الْكَافِرِينَ * أَمْ حَسِبْتُمْ أَنْ تَدْخُلُوا الْجَنَّةَ وَلَمَّا يَعْلَمِ اللَّهُ الَّذِينَ جَاهَدُوا مِنْكُمْ وَيَعْلَمَ الصَّابِرِينَ}\nأعترف انني لثاني او ثالث مرة أقوم بأدخال الدين في رواية لستيفين كينجلكن هذا بالظبط شبيه لرد الأم اباجيل علي احد الشخصيات التي أتهمت الذات الإلهية بالظلم لوضع البشر دوما في لعبة شطرنج بين الانسان والشيطانلان الانسان نفسه بداخله نفس الصراع دائما. . ودائما ما يحتاج لمواجهةفكرت الام ان قد يكون هذا حدث ايضا في المجتمع بعد طوفان سيدنا نوح، بالتأكيد كان هناك انقسام اخر بين البشر الناجينوقفة أخريمواجهةمواجهة النفس...مواجهة الشيطانفحتي في مجتمع \"المنطقة الحرة\" كان به نفوس مضطربة مخفية بينهم..يميلون للظلام أكثر في الخفاءالمواجهة هي التي ستظهر المؤمنين وتقويهموكلما كانت اسرع، كانت نتيجتها حاسمة اكثرفي هذا الجزء أيضا يناقش الرموز الدينية واهميتها للبشر..ماذا اذا توفت الأم اباجايل؟ هل سيتزعزع ايمان الناجين الذين كونوا هذا المجتمع الصغير بسبب الارتياح النفسي لهالتها الدينية؟الامر بالظبط كالمرتدين بعد وفاة الرسل.. ولكن بشكل رمزي من خلال الاحداث مقدمة بشكل ملائم وعصري ويدعو للتفكيرلذا كان لابد من المواجهةالوقفة الاخيرةوالكتاب الثالث والاخير~~~~~~~~~~~~~~~~الكتاب الثالث : المواجهةمن 7 سبتمبر الي 10 يناير - 300 صفحة فقط{إِنَّ كَيْدَ الشَّيْطَانِ كَانَ ضَعِيفًا}\nوالان، هذا هو الجزء الاسوأ بالنسبة لي...والاجمل بنفس الوقتالجزء الاضعف... والاكثر حماسة بنفس الوقتتخيل انت تقرأ اكثر من 1100 صفحة لعلك تتوقع ملحمة ومواجهة تستمر لصفحات طويلة مليئة بالحرب والدماء والجمل الرنانة والاقتباسات الدينية القويةلكن الامر تم بشكل ابسط بكثير، واقسي بكثير مما توقعت بنفس الوقتلن احرق لك الامرلكن المواجهات التي تمت بين الشخصيات والشيطان، المسيخ الدجال ، وضعف حيلته أمام قوة الايمان وتزعزع صورته امام اتباعه هو امر يستحق القراءةالاسلوب هنا كان ساحرا وحماسياطوال الوقت كنت اكتم انفاسي، اشهق ، او اتحمس كأني اريد ان اصيحYesssssفقط كل شيء تم بسرعة اكبر مما توقعتاسمعك تقول ، كيف 300 صفحة ام تكفيك، هناك روايات تتحدث عن ما هو اكثر من ذلك في 300 صفحة فقط؟!!؟حسنا، لن احرق لك الامرولكن جزء كبير يصل للنصف من الكتاب الثالث والاخير يدور في الطريق الي المواجهة ، وطريق العودةفي طريق الذهاب يناقش السيد كينج ببراعة اهمية رحلات تطهير النفس، كرحلات الحج في كل الاديان ، كخروج -مع الفارق- الانبياء والرسل للعراء في صوم للوحي الإلهياما في الجزء الذي يدور في مدينة لاس فيجاس ، المجتمع الذي يتزعمه الرجل المظلم، فيقدم فيه السيد كينج عن طريق الجواسيس المرسلين من المنطقة الحرة للاس فيجاس، مقارنة مثيرة للتفكير بين المجتمعينكيف ان الحكم النازي، حكم الطاغية، يؤدي الي جعل البشر يحافظون علي مواعيد عملهم ويسارعون في انجازه، بعكس الحال تماما في \"المنطقة الحرة\" حيث هناك شئ من التراخي رغم أهمية العمللكن بنفس الوقت الحكم النازي ، حكم الشيطان الطاغية، يجعل المحكومين كأشباه بشر...يعيشون في خوف دائم، لان الطاغية لا يملك غيره يعطيه لهم ليحكم بهفلصالح من تنتهي المواجهة؟...ثم ماذا بعد؟كيف سيكون المجتمع بعد ذلكهل سينجح النسبة التي تقل قليلا عن 1% من البشر العيش بسلامام ان الدائرة ستنغلقوسنكرر أخطائناويعيد التاريخ نفسه؟...الي هنا تنتهي مراجعة الأحداثاتمني ان تكون عرفت الان صديقي القارئ لم قرأت رواية 1440 صفحة..وماذا خرجت منها~~~~~~~~~~~~~الشخصياتمن ستصطحبهم أغلب ال1440 صفحةدون حرق مصائرستو ريدمانهو مفهوم ستيفين كينج عن \"رجل الشارع البسيط\" ، الرجل الجدع العاديالغريب أنه رغم وجوده في دور رئيسي إلا أنه لم يكن شخصيتي المفضلة..كان رجلا عاديا في ظروف غير عادية ، هذا كل شئولأن الشدة تظهر معادن البشر..حسنا ، لهذا قلت عنه انه الرجل \"الجدع\" ، رحلته بعد الوباء هي الأصعب بحق..ربما لم تتطور الشخصية كثيرا لاحقا لكن التجربة هي ما ستخلف به أثارا واضحةفراني جولدمانشابة جميلة ، عفوية جدا..ايضا قد تعد شخصية عادية رغم كل شئ لكن ما ستمر به من مصاعب يجعلها يظهر معدنها القوي ، بالأخص في الربع الأول عند معرفتها بحملها ومواجهتها لوالديهاولكن تقريبا مشهد تحملها المسئولية بوفاة والدها كان من أصعب المشاهد..وأصرارها علي أن تدفنه بنفسها رغم صعوبة الامر، رسمها كينج ببراعة، وظهرت بلوحة من لوحات الروايةوإن كنت عرفت أن فراني يمكنها تحمل المسئولية بهذا الشكل بالربع الأول ، فهي بهذا عكس الشخصية المناقضة لهالاري أندروودمطرب الروك ، شخصيتي المفضلة...ربما بالاخص بسبب فصوله مع أمه أليس أندروودأمه تواجهه بحقيقته ، بصراحة ووضوح؟ نعم، لكن بقسوة؟...لا أعتقد.. قالتها له مباشرة أنه من النوع الذي يأخذ ويأخذ ولا يعطي، لا يتحمل مسئولية … ظنت ان السنون قد تجعله ينضج لكنه مازال لاري القديم، يقع في مشكلة فيلجأ للحل الأسهل لكن توافق أمه علي أن يمكث معها في بيته القديم في ضيقته ، بل وتحضر له كل المأكولات التي يحبها من الصغر حتي دون أن يطلبلاري شخصية مثيرة جدا لان هناك مثله الكثيرين، بل للاسف شعرت بشئ ما مألوفا عنديلا يقصد ان يكون سيئا..يندم بعد فوات الاوان..لكنه يظل دوما مطاردا بذلك الندم..كما ظل مطاردا بكلمات أمه، وشبح اتهامه أنه \"ليس بالشخص الجيد\"..ربما هو كذلك؟الفصول التي جمعته وأمه أغلبها من النسخة الممتدة -كانت محذوفة في النسخةالقديمة- ، وهنا أعتقد أنك ستدرك سر جمال الرواية الطويلة إن كانت مكتوبة جيداالتفاصيل هنا ستجعلك تتفاعل مع لاري، تحبه، تكرهه، تشفق عليه كأمه...وبالاخص شخصية أمه والتي اراها من اجمل ما كتب كينج من الامهاتستيفين كينج مشهور بالامهات القاسية المستبدة -أم فراني، الشخصية السابقة، خير دليل- لكن أليس رغم انها واجهت لاري بعيوبه لكن تصرفاتها الصامتة معه كانت اقوي تأثيراوربما لهذا كان سبب ثراء تحولات شخصية لاري من البداية للنهايةأعتقد ان كل مشاهده مع امه لاتنسي، ملوها الثلاجة لما يحبه ، مصروفه ليدخل السينما برغم من سنه الكبير، وعده لها لاصطحابها للعبة البيسبول في يوليو ، صراعه النفسي الشديد وقت احتضارها ووفاتها والذي اعتقد انه هنا كان نقيضا نوعا ما ممتازا لدور فرانينيك أندروزشاب صغير ابكم وأصم ، يتيم، عصامي، ظروف معيشته الصعبة جعلت تحمله للمسئولية أهم خصالهشاب صاخب رغم مظهره الهادئ وحالتهيتحمل المسئولية من بداية ظهوره مع مأموربلدة صغيرة، بل وحتي يرعي زوجته بعد رحيله.. ولم يعلم وقتها مقدار المسئولية التي ستلقي عليه لاحقامن المشاهد التي لاتنسي له هو عندما اعترف للأم أباجايل أنه غير مؤمنا، ردها كان جميلا وواقعيا...ودوره في المجتمع الوليد عاما كان مكتوبا بشكل جيد جداجلين باتيمانهو خبير علم الاجتماع العجوز، رجل ذكي فطن...يقرأ بسهولة كيف سيكون المجتمع الذي قد يتكون من الناجين رغم انه اول ظهوره لم يتقابل سوي ستو ريدمان وكلب اسماه كوجاكمنذ بداية ظهوره أخر الكتاب الاول وهو \"رمانة الميزان\"، ذلك الذي لا ينطق عن هوي، بل ينطق عن اقتباسات، اغلب اقتباسات الكتاب ستجدها منهينطق عن علم نفس بشرية وعلم اجتماع وفلسفة...كيف ان التاريخ يعيد نفسه . كيف ان بناء المجتمعات لم يتغير، الوعي الجمعي والاحلام...العلاقات بين المجتمعات...بل وحتي الاجزاء الدينية ايضا رغم انه غير مؤمنهارولد لويدرشاب مراهق وحيد، بدين، لا يملك سوي الكتب والكتابة كرفقة دائمة...واعجاب قديم من طرف واحد بصديقة اخته التي تكبره ببضعة اعوام...فرانيهارولد شخصية مهتزة غير واثقة بنفسها...ولكنه عبقريا، ذكياولذكاءه وسعة حيلته وافقت فراني ان ترافقه في رحلة البحث عن ناجين، غير أن ذلك بسبب أن ببلدتهم هما اخر ناجين من الوباءتطورات الشخصية كتبها ستيفين كينج بشكل عبقري طوال الاحداث مع كل الشخصيات التي ستنضم معه وفراني ، ليكون من الشخصيات القليلة التي تطورت شخصيتهم بشكل كبير علي مدار الرواية-ستيفين كينج ممتاز في رسم مثل تلك الشخصيات-ريتاسيدة اربعينية مرفهة، لكن رغم انها قد تبدو قوية وصلبة بعد نجاتها من الوباء إلا أن نيويورك بعد الوباء كانت قادرة علي تحطيم اعصابهاالشخصية مرسومة بشكل جيد ومؤثر بالاخص بالنسبة للاري اندروود أقتباسها من رحلة عصبة الخاتم في رواية تولكين الملحمية الاشهر \"ملك الخواتم\" في بداية رحلة 'الخروج' من نيويورك مع لاري كان موفقا. خاصا ان رحلة تولكن، والتي تعتبر ملهمة ستيفين كينج الرئيسية لكتابة تلك الرواية الملحمية علي غرارها.. ولكن في عالمنا، بامريكا بدلا من الأرض الوسطي الفانتازيا لويدمجرم محبوس في قضية قتل ارتكبت لانه كان تابعا لمجرما اخر مختلالكن الوباء بدلا من ان يتسبب القضاء عليه، تسبب في انه كان علي وشك الموت من الجوع والعطش وحيدا في الزنزانةحتي يأتي من معه المفتاح لاخراج مجرم كهذاومن سيكون سوي رجل الظلام نفسهليكون لويد..كما في قبل الوباء كما في بعده.. مجرد تابع لقاتلمع الاختلافرجل صناديق القمامةمختل بسبب ماض قاس وظروف عائلية سيئة يحكيها لنا السيد كينج بالتفصيليهوي اشعال الحرائق بهوس شديدخمن الي اي جانب سينضمنادينشخصية مثيرة، شابة في اواخر سنوات الشباب لكن شعرها المختلط اسوده بالبياض سببه حادث قديم غامضنادين شخصية متحفظة، تخفي امرا ما يقتلها بصراع نفسي رهيب بين قبول ورفضيقابلها لاري أندروود خلال الرحلة مع فتي صغير عجيب به شيئا من الشفافية، او كما يفضل السيد كينج اطلاق عليها \"اللمعان\" كما في اسم روايته التي سبقت تلكThe Shiningكلا الشخصيتين كان ممتعا في قراءة مشاهدهما بالاخص عند لقاء الأم اباجايلوهناك الكثير من الشخصيات الاخري التي تظهر بعد ذلك، مهمة ولها روح ، واخري عادية او مجرد فرد اخر في المجتمعات التي ستتكون، وشخصيات اخري غير ما سبق لها دور مهم ومحرك في الاحداث حتي لو صغرلكن لضيق المساحة لنر اهم شخصيتينراندل فلاج/رجل الظلام/ظفر الشيطانعند ظهوره بالربع الاخير من الكتابالاول استنكرت الماورائية والجزء الفانتازي الذي قام ستيفين كينج تقديمه بهلكنه بمرور الأحداث ستفهم ان كينج يقصد به انه أداة الشيطان، مخلبه او اصبعه او ظفرهكالشيطان ينمو ويقوي في الفوضي، في زعزعة الايمان، في مثل تلك الاحداث الكابوسيةلكن في هذا العدد القليل من البشر، وبعد قيامة صغري قام بها البشر بايديهم، قدمه ستيفين كينج كرمز للمسيخ الدجالليختبر به البشر، ليجمع اتباع، ويكيد للجانب الاخر..المؤمناعجبني بشدة رموز الظلام المحيطة بتلك الشخصية، مواجهته الضعيفة بالبداية للأم اباجايل كحيوانات ابن عرسولكن اعجبني اكثر انه لم يلجأ لتهويل وتعظيم شخصيته الخيالية لجعلها الشيطان نفسه مثلا، فقط رمزاكالجانب الاخرالام اباجايلسيدة عجوز مؤمنة ،تكلمت عنها في جزء الاحداثتحولت لرمز ديني لسبب إلهي يحلم بها الناسالجميل هنا ان كينج قدم حياتها بشكل تفصيلي قبل ذلكلكن الاجمل أنه حاول ان يقسو عليها فقط لينفي خطيئة قد يقع فيها امثالهامن يجد تجمع الناس حولهخطيئة الشيطانالفخرلا يتبق سوي حروف قليلة، واعتقد ان الي هنا ينتهي المراجعة \"المختصرة\" للنسخة \"الكاملة\" لملحمة ستيفين كينج الاضخمفي 1440 صفحةالمواجهةمحمد العربيمن 1 مارس 2017الي 31 مارس 2017-يمكنك متابعة مراجعات الكوميكس لمزيد من التفصيل-"}, {"userName": "Alex is The Romance Fox", "userReviewDate": "Nov 05, 2011", "userURL": "http://www.goodreads.com/user/show/6663962-alex-is-the-romance-fox", "userReview": "[image error]"}, {"userName": "Petrik", "userReviewDate": "Mar 10, 2018", "userURL": "http://www.goodreads.com/user/show/59458347-petrik", "userReview": "3.5/5 starsM-O-O-N. That spells I am done with this MOONstrosity of a tome.This is the biggest single book I’ve ever read in my life so far—It’s 470k words and it’s even bigger than Oathbringer by Brandon Sanderson—and although it doesn’t go into my personal favorite list, I enjoyed the majority of the book.The Stand is totally not what I expected. I really thought this would be a super thrilling plot-driven with a lot of actions book due to the nature that the story revolves around a plague outbreak. As it turns out, The Stand is a HIGHLY characters’ driven book with the plot moving at a very slow pace, and as great as it was, sometimes it did get a bit excruciating.One of the two that stands out the most from this book—other than the gigantic size—in my opinion was the theological nature and the classic tale of a battle between good versus evil.\n\n“That wasn't any act of God. That was an act of pure human fuckery.”\n\nThere are a lot of symbolism to the aspect of light versus darkness here. To give one example of many, with the country being ravaged by the outbreak, the survivors ended up joining either Mother Abagail’s group (the good) or Randal Flagg’s group (the evil); Mother Abagail is located in the East (where the sun rises every day) and Randal Flagg is located in the West (where the sun set). I enjoyed reading almost all the characters’ perspectives and survivor’s tales and I really think if you love a HEAVY theological talk in your fiction, this is a must-read.\n\n“The beauty of religious mania is that it has the power to explain everything. Once God (or Satan) is accepted as the first cause of everything which happens in the mortal world, nothing is left to chance...logic can be happily tossed out the window.”\n\nOther than the theological talk, the characters were almost absolutely delightful to read. The characters developments in this book were astounding to say the least and it was awesome to see how far these characters changed from where they began. Plus, Stephen King writes very unconventional and memorable characters in The Stand such as Nick, Tom Cullen, Randal Flagg, Harold, Larry, and Mother Abagail to name a few.Picture: Mother Abagail by Bernie WrightsonNow, the parts that didn’t work for me. First being Stephen King’s prose took quite a while for me to get used to. Second, and probably my major problem with the book, The Trashcan’s man chapters were atrocious. I didn’t enjoy any moment reading his POV, it was messy, felt juvenile, and during my time reading it, I knew immediately this his meeting with the Kid was going to be the one that was cut out from the first published edition of this book, and I was right. It was a painful 70 pages chapter which in my opinion offer close to zero points to the story. Finally, with a book this HUGE, I really expected the ending to blow me away but the ending ended up being anti-climactic. I also can’t help but think that the first edition of this book (the 800 pages one) would probably be a better experience. Stephen King received the title “word diarrhea” for a great reason and a lot of the words in this book in my opinion definitely deserves to be flushed.Overall though, I think The Stand is still overall a great book. Even though it’s not a genre that I dive into frequently, I found myself amazed by the characterizations and compelled to read what happened to most of the characters. It’s unfortunate that there were a few hiccups with the pacing and ending but I still will recommend this book to anyone who enjoyed a heavy theological discussion and memorable characters in their read. Thank you also to my good friend, Celeste, for giving me this book as a late birthday present! You can find this and the rest of my Adult Epic/High Fantasy & Sci-Fi reviews at BookNest"}, {"userName": "Evgeny", "userReviewDate": "Dec 23, 2016", "userURL": "http://www.goodreads.com/user/show/9340136-evgeny", "userReview": "Humanity in general loves to play god trying to meddle in some very dangerous things. Military is not an exception as they are obsessed with creating more effective and devastating weapons. Considering the progress from a simple stone to an atomic bomb we became quite efficient at killing others en masse. Suppose we create a new virus which would make HIV look like a common flu. Great, now we can let it loose, wait and have all the enemy infrastructure intact with all the people gone. The problem is virus does not care much about taking sides in a conflict. So such a virus was created paid for by US taxpayers and was accidentally released. The said taxpayers were practically wiped out with some rare exceptions that were immune to it. The end result: some occasional survivors have practically everything created by others just for taking. It seems to be practically a Utopia, but the people decided it would probably be boring so they split into two camps trying to wipe out each other. To be fair one of the group only wanted to eradicate the other in self-defense. The book is the story of how the disaster came to be and the story of these two groups. Before I begin rambling about the book I seriously need to get something of my chest. I truly believe Stephen King suffers from what I call Word Diarrhea. Other people call this phenomenon Typewriter Diarrhea, but I think my term is more general. I had a misfortune to read an unabridged edition of this. I lost count to the number of scenes that could be cut off without any impact on the remaining part. Just as an example: who cares about Fran's mother being a selfish bitch after her brother died? How did it affect the rest of the story? Do not get me wrong, King is a talented writer, but exercising some brevity in writing would improve the quality even further. As it stands now I did not go outside with a physical copy of the book being afraid I would be arrested for carrying as assault weapon. The book is clearly split in three parts: events leading to the catastrophe and its unfolding, survivors trying to cope, and two groups trying to exterminate each other. The first part was quite boring until the infection became widespread. I was not excited to read about day-to-day lives of the people that are about to die. To add an insult to the injury the people that were destined to survive were either jerks, or plain boring. Yes, I said it: nice people are boring; this was one of the lessons I learned from the book. What would you rather read about: a guy helping an old lady cross the road, or a guy torching an oil repository? If you answer \"the former\" you are lying. As you can see nice people have no chance of survival whatsoever; we are left with jerks. In fact let me introduce Stephen King's apocalypse survival rule #1: the bigger jerk you are the better your chances. Here comes another problem: I did not care about jerks that much. This left me exactly one person to root for; that person had the least screen time. Take Fran I mentioned above: she came out as somewhat unbalanced woman falling into giggling hysterics at a slightest reason; not the one to care for. This boredom continued until the military began a serious cover-up campaign. Military cover-up methods are taken straight from the Mafia books: dead people tell no tales. This action brought much-needed well... action. Here we finally get to the heroics and cowardliness of ordinary people. And then everybody died.Second part: the lonely survivors wonder around. I guess this part was OK, but I still have some things to say. Here King uses only black and white for characters with no gray shades: you are either with us, or against. I was also appalled by how quickly the (self-appointed) leaders decided their own lives are sacred and irreplaceable, but they are perfectly fine with throwing away lives of people around them. After all, they are good guys and as such Can Do No Wrong. I often miss the times when the leader of people was somebody who lead the attack on the enemy and could survive thanks to his/her battle skills. Imagine how many wars we could prevent if only we would let the people that declare them to lead the first attack. We already established the good guys are boring. It turns out they are also stupid as several people were practically wearing signs saying, \"I am a traitor\" and it did not bother anybody. No wonder the bad side managed to get more intelligent people - who wants to spend their time with stupid? Last part: confrontation. Finally things start moving alone. Probably the fastest-moving part all the way until last two chapters which were loooooong and felt like a complete filler. Every single plot thread was resolved at this point, so why the delay? The very end came in opposition of everything that was said before. It also bothered me that we ended up with a society of basically parasites living on what was built/grown/created before. Not a single human being in the book bothered with creating new things. Supplies would run out, sooner or later. Does it mean another resource war is coming? By this time I read quite a few King's books and as a result I noticed some things I think worth mentioning. Practically all people in any King's story love to let their bladder go the moment they get even a little scared. No exception to this rule (sorry one exception: tough as nails Roland the Gunslinger). The majority of bad guys often masturbate. Good guys never do. Reading King's stories never fails to make me hate the humanity. The hate goes away though - after a while and until I read his next work. Finally some amusing references: in the first part one of the cops works at 87th precinct and has a colleague named Steve Carella. Does it ring any bells? The amusing part is that this guy thinks Carella is completely dominated by his wife.Unfortunately I read Justin Cronin's The Passage before this one so I did not know how heavily he used copy/paste feature of a word processor. I will be generous and call him being heavily inspired by The Stand instead. Even such details as excessive wordiness and describing a full character's bio right before killing him/her for good are present in The Passage. My final rating is 3.5 stars which I reluctantly round up. There are several reasons for this. I gave The Passage 4 stars and it would be completely unfair to rate the original less. I have several friends that love this book a lot and would lynch me without thinking twice if I rate it any lower. Finally, it is a good book despite all its weaknesses and problems. Have you noticed how big my review is? I am afraid I contacted the Word Diarrhea I mentioned above. Seems highly appropriate for this book."}, {"userName": "Will M.", "userReviewDate": "May 11, 2014", "userURL": "http://www.goodreads.com/user/show/20408288-will-m", "userReview": "[ The nuclear blowout in the end was not as amazing of an ending as I was hoping. Flagg being the devil, I kinda figured he wouldn't end up dead. Why use a man made creation to kill a supernatural being right? I'm not considering this as a major problem of mine though, I just thought that King could've ended the novel in a different way. I can't think of a better ending though, so I also don't get this contradicting and useless spoiler tag.  (hide spoiler)]"}, {"userName": "Diane Wallace", "userReviewDate": "May 23, 2015", "userURL": "http://www.goodreads.com/user/show/43342511-diane-wallace", "userReview": "Haunting read! scary good and well written (paperback!)"}, {"userName": "Jessica", "userReviewDate": "Oct 21, 2007", "userURL": "http://www.goodreads.com/user/show/419287-jessica", "userReview": "I read this book ages ago, but it's fresh in my mind every time I wind up stuck in traffic underneath the Hudson.It's about almost everyone in the world basically catching a bad case of the Plague and dropping dead. This premise doesn't seem very far-fetched, which could make it either more or less entertaining, depending on your temperment.Here's my opinion about good old Stevie King: he's got a real problem with endings. He'll spin these long, terrific stories, but way too often they're all based in suspense, and he lures you to page 600 or whatever, and leaves you high and dry. I read the first half of _It_ in sixth grade and had to stop, as the book had completely deprived me of my ablity to sleep. Two years later, I'd finally recovered enough to brave It again, and the ending was so stupid that I sorely wished I'd saved myself months of clown-terror wakefulness by finishing it the first time. I mean, don't get me wrong, the guy can write. But he almost invariably writes himself into a corner, and his endings are a let-down.The great thing about The Stand, to me, is that King a. demonstrates that he's aware of this problem and b. uses his weakness jujitsu style, combined with wish-fulfillment, to great effect. You can just see him crouched at his typewriter, chewing on something and grumbling, \"Christ, what's my problem..... These goddamn endings.... I just need a deus ex machina.\"I liked the Stand. The Stand's good stuff. It's not one of the scary ones (well, it's scary in a different way than, say, The Shining), and in addition to having an ending I appreciate, it also gets pretty silly, but still: Recommended. Yep.A-choo!"}, {"userName": "Norma * Traveling Sister", "userReviewDate": "May 06, 2017", "userURL": "http://www.goodreads.com/user/show/41400192-norma-traveling-sister", "userReview": "Traveling Sister Reads Review by NORMA, BRENDA and KACEEY!!Let’s take a stand against evil!!5 epic stars for THE STAND by STEPHEN KING as we all thoroughly enjoyed the entire experience of reading this masterpiece of a novel together.With not too many of Stephen King’s novels read and not really being all that familiar with his work, when we thought of King we thought of horror, disturbing, and very frightening came to our minds. THE STAND is much more than that and not what we expected at all as we all went into this one pretty much blind. This is a whole different kind of disturbing and an unforgettably frightening story but yet hopeful with such a complex and believable story of human behaviour. It's clear to us now why this is considered a masterpiece. How can we not say something about the length of this very long book and what an achievement we all felt after getting through it. Yeah us! We spent two weeks with this complex plot and intense and complicated characters and enjoyed the discussions it created with each other. STEPHEN KING created a believable world here after a devastating destruction of the human race and it left us wondering how it would play out with our generation of technology. Could we survive or rebuild? Hmm Stephen King maybe you could add another 400 pages. This is an excellent book to choose for a group read and makes for great discussions. Would recommend!All of our Traveling Sister Reads Reviews can be found on our blog:http://www.twogirlslostinacouleereadi..."}, {"userName": "Samadrita", "userReviewDate": "Nov 26, 2012", "userURL": "http://www.goodreads.com/user/show/13266158-samadrita", "userReview": "One of the reasons why I would never club Stephen King together with any of the other best-selling writers of his generation (Grisham, Archer, Patterson, Sheldon and so on) is this :-None of them match King's calibre as a story-teller. They don't even come close.If somebody spins an intriguing tale, his characters get in the way of my enjoyment of it.If somebody excels at characterization, his plotting is rather unconvincing.If somebody plots a story well, then his writing turns out to be flat.(And if you're unlucky enough, some of them mess everything up.)But Stephen King possesses that rare talent of getting everything right - the story, the unraveling of the plot, the imagery, the underlying implications, the characters, the backdrop, the world-building, the writing - down to the very last detail. He can grasp your attention at the onset, reel you in slowly but surely, give you nerve-wracking moments of pure anxiety, make you visualize a scene exactly the way he must have imagined it, feel for the characters in his story as if they were people of flesh and blood you were familiar with and, at some point, render you completely incapable of discerning between reality and the make-believe world of his imagination. And you're caught in the same nightmare as the characters of his book are plunging deeper into with every passing moment. The Stand is one such Stephen King creation. Arguably known as his best written work yet, The Stand, I'm happy to inform readers, deserves every bit of the praise and adulation it continues to receive worldwide till this day. Now don't get me wrong. The book is nothing new when you glance at the blurb. It is nothing you haven't already read or known about because it is the story your mom/dad/grandma must have read to you as a kid - while you listened moon-eyed with wonder and awe, overcome with emotions you couldn't quite fathom. It is the ever-fascinating and timeless tale of good triumphing over evil that you have come across enough times yet can never possibly get over. It is that same story, but with a distinct Stephen King-esque flavour.Add a dystopian, post-apocalyptic, anarchic world in the grip of an epidemic that claimed most human lives to the eternal conflict between good and evil, and the summation result will lead to The Stand.But it is so much more than this simple one-sentence summary. Every character, every plot device, every written scene has been constructed and put together so fastidiously in this book that at the end of it one feels that the reader is assigned with the task of collecting and preserving every piece of the gigantic puzzle to form this humbling, larger-than-life image the author had begotten.Everything is done so ingeniously, that the mesmerized reader can only sit back and watch this spectacle of gargantuan proportions unfolding right in front of his/her mind's eyes. Horror, psychological ramifications of events, political intrigue, war, chaos in the absence of a centralized administration, a crumbling world order, basest of our human tendencies - King doesn't shy away from exploring the entire gamut of human actions and emotions in a world where nothing of the old establishments has survived.This man can write. There's no doubt about it.In terms of sheer volume, scale and narrative sweep, it is an epic. In a way it is The Ramayana, The Mahabharata, The Iliad and The Odyssey or a concoction of all the elements that transformed each one of these stories into epics the world will never cease to look upon with the utmost respect. It is the story that never becomes stale despite the number of years you insert between the time you read it first and read it for the umpteenth time in some other form. It is the story that transcends barriers of language, culture, religion and history and will always be told and retold in possible ways imaginable, for as long as humanity survives.It is the story you are bound to be won over by even if you're snotty enough to swear by your copy of Ulysses and frown upon the Stephen Kings of the world of writing simply because they don't have much of a chance of ever winning the Man Booker or Pulitzer or *gasp* the Nobel Prize.It is the story of good, evil and everything in between. It is the story of love and hatred, loyalty and betrayal, sin and redemption, fate and co-incidence, rationality and the inexplicable. Of unalterable mistakes and innocence lost. Of the goodness of the human heart and the face of the Devil.At 1100+ pages, it was rather much too short. I almost wished for it to never end. But then again one can always re-read to start the cycle of awesomeness all over again."}, {"userName": "Celeste", "userReviewDate": "Apr 29, 2017", "userURL": "http://www.goodreads.com/user/show/7317186-celeste", "userReview": "Full review now posted!Original review can be found at Booknest.Rating: 6/5 stars.Yes, you read that right. Six out of five stars. This is one of the best books I’ve ever read. M-O-O-N, that spells phenomenal.Going into this book can be intimidating. It’s 1153 pages in its complete and uncut edition, making it one of King’s largest books. It is also considered by many King fans to be his best work. There’s disagreement, of course. Some swear by King’s magnum opus, The Dark Tower, while others hale IT as their favorite book of all time, while still others hold up various of King’s other works as their personal favorites. I have yet to read The Dark Tower and thus might change my mind on this, but so far I’m firmly in the camp that The Stand is King’s masterpiece. Within this massive book mingle so many genres. The setting is an apocalyptic dystopia, but there is romance and adventure and humor and theology and satire and fantasy. If I could only re-read five books for the rest of my life, this would be one of those five because it gives its readers so much.“Can you dig that happy crappy? Do you believe that happy crappy?”There were some fantastically well-developed characters in this book, and they all joined the side of one of the two most charismatic characters of all: Mother Abigail and Randall Flagg. Mother Abigail is a 108 year-old black woman who has been appointed by God to lead the side of good. Randall Flagg is the dark man, the tall man, the Walkin’ Dude, and he is the face of evil in this brave new world that’s been wrought by Captain Trips, the worse plague to ever sweep the earth. With 99 percent of the earth’s population wiped out at the hand of man, those remaining face off as they try to remake the world, for good or for ill. Though Flagg and Mother Abigail lead their respective sides, their followers are just as well-developed, of not more so. Honestly, there are too many amazing characters to list. But I think that the star of the show is Tom Cullen, a mentally handicapped man who accomplishes more than anyone would have believed possible. Tom made my heart squishy with his innocence and his belief in his friends. Every character King crafted within this story felt special and real and relatable, but Tom shone. One thing I really loved about this book was King’s decision to portray “good” characters and “bad” characters in such a human way. Those who sided with Flagg were still sympathetic and relatable, while those who sided with Mother Abigail were still fallible and petty at times. There were no perfect protagonists here, and no flat cardboard antagonists who are easy to hate. These were all people, real people, and I connected with them all.Besides the characters, my absolute favorite thing about this novel was its religious commentary. There was a level of theological depth here that’s not present in most religious fiction. I knew going into this book that it was a post-apocalyptic war between good and evil, but I had no idea that it would impact my thinking this much. Take this quote from Mother Abigail’s thoughts, for instance:\"They filed in through the gate that Ralph opened and she felt her sin, the one she thought of as the mother of sin. The father of sin was theft; every one of the Ten Commandments boiled down to “Thou shalt not steal.” Murder was the theft of a life, adultery the theft of a wife, covetousness the secret, slinking theft that took place in the cave of the heart. Blasphemy was the theft of God’s name, swiped from the House of the Lord and set out to walk the streets like a strutting whore. She had never been much of a thief; a minor pilferer from time to time at worst. The mother of sin was pride. Pride was the female side of Satan in the human race, the quiet egg of sin, always fertile.”See? That’s some deep stuff, man. And this book was chock-full of it! Characters who didn’t believe in a Higher Power at all were faced with His probability, and watching them struggle between the rejection and acceptance of that knowledge was fascinating. The theological debates between characters and within their own thoughts was incredibly thought-provoking, and I would read this book again just for that. But there were so many more facets to this story. I was actually even okay with the ending here, which is often lacking in King’s novels; I felt like this one delivered. I highly recommend this book. If you’re going to read one Stephen King book, I wholeheartedly believe that this should be the top contender. It’s a commitment, true, but incredibly worth it.\"The place where you made your stand never mattered. Only that you were there … and still on your feet.”My first buddy read with my wonderful friend Caleb!"}, {"userName": "Matthew", "userReviewDate": "Jan 16, 2013", "userURL": "http://www.goodreads.com/user/show/16254355-matthew", "userReview": "[ Trashcan Man and The Kid as it filled in the blanks for the Trashcan Man’s journey across America. However, it makes it more obvious that Trashy is barely in the rest of the book – which I don’t remember feeling when I read the abridged version  (hide spoiler)]"}, {"userName": "Whitaker", "userReviewDate": "Jun 29, 2011", "userURL": "http://www.goodreads.com/user/show/1415047-whitaker", "userReview": "I’ve said before that romance fiction taps into a primal desire for comfort. It’s a fantasy, a snuggie to wrap up in curled up with hot chocolate and toasty roadhouse cookies. The Stand falls squarely into that category, and adds hot rum to the mix as well. The subtitle of The Stand really should be A Very Norman Rockwell Apocalypse. It’s a political fantasy set in the aftermath of a GM plague: a mutating flu virus with 99.4% transmissibility. Needless to say, 75% of the world’s population dies. Well, as far as we know, since the novel is set in the US, and except for maybe two widely separated sentences in its 1000+ pages of text that tangentially mention the spread of the virus to China and Russia, the rest of the globe is one huge blank. It is not only a political fantasy, but it is a particularly American political fantasy. The trajectory of the novel could be described by this triptych of American Gothic: The crux of the conflict is between the good guys (who proceed to set up a Kumbaya egalitarian republic) and the bad guys (who run a pseudo-religious dictatorship/cult). The good guys are gathered in by Mother Abigail, an African-American woman (and the only significant person of colour in the entire book I believe), who plays the obligatory role of Virgin Mary/Mother Goddess/Earth Mother. The bad guys are led by Randall Flagg, a persona of pure evil, the Antichrist in all but name. Now I’ve nothing against comforting fantasy. It’s clearly hit some kind of sweet spot with a lot of Goodreaders. Good wins out, of course, and if you think that this is a spoiler, well then you’ve been living under rock for a century (this is Stephen King for crying out loud, not Thomas Mann). But what made the whole thing an indigestible corn syrupy mess for me is that it’s essentially founded on the idea that Bad People do Bad Things Cause They’re Possessed by the DEVIL. Seriously. Randall Flagg has this weird power over people where he takes over their minds. Yeah, it’s true that bad people are attracted to him even if they also find him repulsive. But King makes it clear that Flagg has some kind of occult power to influence them. Now, if this was ultimately about Flagg getting into a fisty-cuffs with Mother Abigail, with her using her own weird (but good weird) occult power to control her minions in some kind of heavenly smack-down, I would be okay with that. But it’s not. The forces of egalitarian righteousness are Good Simple Salt-of-the-Earth folk exercising their God-Given Freewill, laws yes they are! (One of them talks that way, I kid you not.) The spineless terrorised people under one Flagg are, on the other hand, mindless zombie spawn about to unleash nuclear Armageddon on the US of A. And that just really pisses me off. Cause in all of human history, it’s always been the rallying cry that the Other Side are in league with the Devil. That’s what makes it okay to rip out their guts, rape their wives, and bash out their babies’ brains. Hey, cause they’re not people, like us. When really, all it is is that that they aren’t people like us. That they aren’t people is such a sweet little fantasy. And one of the most vile and deadly ones too. It's sad to see it be perpetuated here. For shame, Stephen King! For shame!"}, {"userName": "Brenda - Traveling Sister ", "userReviewDate": "May 19, 2017", "userURL": "http://www.goodreads.com/user/show/10841164-brenda---traveling-sister", "userReview": "Traveling sister read with Norma and KaceeyI am feeling wow right now and what an achievement reading The Stand. 2 weeks on this amazing book and the best part the discussions it created with Norma and Kaceey.Great book for a group read.Norma has posted the full review on her reviews or you can find it on our sister blog.http://www.twogirlslostinacouleereadi..."}, {"userName": "Mark Lawrence", "userReviewDate": "Mar 20, 2011", "userURL": "http://www.goodreads.com/user/show/4508542-mark-lawrence", "userReview": "I loved this book. I read the uncut version years back when I lived in the States, maybe in 2002. I loved everything about it except the ending. I'm a big fan of Stephen King and have 23 of his books on my shelf. Stephen King can only write a good ending to a book by chance. That said, the first 95% of his books is generally so good that I can forgive the ending.One of the things I like best about King's writing is the way he breathes life into characters and every day settings. For a horror writer this is crucial. You have to make everything utterly believable so that when the monster comes and the stakes are raised the reader feels it's all real and cares about what's at stake. The short story, The Body, on which the film Stand By Me is based is a great example of King's genius at making complicated, flawed, awkward, real characters.Anyway, The Stand, is not typical King as the main core of it is an apocalypse, and the super natural horror element is rather secondary and low key for most of the story. The apocalypse is a believable one, a flu pandemic with a mortality rate so high that only a tiny fraction of the population survives. King tears the world down in terrifying slow motion and playing on our fears of pandemics it is at once horrifying, touching, and fascinating. King is great at slowly pulling everyday reality apart.The cast of characters who survive this catastrophe is sizeable, diverse, and interesting. A pyromaniac with an array of mental issues, a man with learning disabilities, a singer who was in the act breaking big, others more ordinary but no less fascinating under pressure.The literary institutions of this world sniff at horror writers as much as they do fantasy writers but I find King's prose and insights into the human condition to be as powerful as those in many of the more plodding works of literary fiction I've read. Readers often don't notice it because it's not what they came for. But King is interested in people and how pressure acts on them.“No one can tell what goes on in between the person you were and the person you become. No one can chart that blue and lonely section of hell. There are no maps of the change. You just come out the other side. Or you don't.” King shows us the inception of the disaster, plots its course through his scattered and varied cast, and slowly brings those actors together into two communities in the aftermath.The two communities we focus on centre on the supernatural aspect of the book, one of them is home to the 'good' folk, and the other to the 'bad'. The bad camp is ruled over by Randal Flagg who roams through the pages of quite a few of King's books, The Dark Tower in particular.The book concludes with the fight between these two camps and ultimately the ending was a touch unsatisfying for me, though not awful by any means. The journey to that ending however was a fascinating thrill ride and well worth the price of entry!If you've not tried Stephen King before then this is a fine place to jump in - be warned though, it is perhaps the longest of his books with a page count to rival GRRM at his most long winded.Join my 3-emails-a-year newsletter #prizes"}, {"userName": "Kaceey - Traveling Sister", "userReviewDate": "May 20, 2017", "userURL": "http://www.goodreads.com/user/show/13442817-kaceey---traveling-sister", "userReview": "A heartfelt thank-you to Norma and Brenda for including me in this 1,300 page marathon journey of a novel. I was kindly offered the opportunity to become part of the “traveling sister read” earlier this month. Such a great concept and what an incredible experience. I enjoyed every minute of it. All of our discussions, opinions and back-and-forth chats. So interesting to share each other’s thoughts as we made our way through the book together. With such an incredibly long book we managed to keep one another on track. It was great fun trying to figure out where the story would take us. I can't imagine tackling this book without them! A 5 star book as well as a 5* reading experience! Thank-you to my 2 new Canadian sisters!In the end, the book left me with just one question: is mankind doomed to continually repeat his past mistakes?To see the full traveling sister review please visit Norma and Brenda's blog at:Http://twogirlslostinacouleereading.w..."}, {"userName": "Hasham Rasool", "userReviewDate": "Apr 06, 2017", "userURL": "http://www.goodreads.com/user/show/43718887-hasham-rasool", "userReview": "I haven't read any horror book for 5 years.I have heard of Stephen King a many times. He is one of most popular authors. I never thought I would have read his book one day. This is the first book I have read by Stephen King.Stephen King has used very powerful vocabulary and it is very unusual style of vocabulary.Stephen King is a good writer. He has a very good imagination and the way he has created horror atmosphere is wonderful. King has created horror atmosphere and feel brilliant also he knows how to draw the readers in and he deliberately keep suspension to make the readers to keep reading this book.There are multiples of characters in this book.This book has included religion and it has shown good verse bad.There are lots of characters but I really like one character in the book, Nick Anderos, he is my favourite character.What a stupendous book! 'The Stand' is masterpiece. This book is definitely one of my favourite books. Alhamdulillah."}, {"userName": "Luvtoread", "userReviewDate": "Nov 24, 2017", "userURL": "http://www.goodreads.com/user/show/39509137-luvtoread", "userReview": "The Stand is one of my all-time favorite books, and I think it is the most unforgettable. A must read if you are a SK fan, and a must read if you love Good vs Evil!"}, {"userName": "Ɗắɳ  2.☊", "userReviewDate": "Jul 05, 2016", "userURL": "http://www.goodreads.com/user/show/12058788-2", "userReview": "I'm sorry but I cannot, in good conscience, give this anything less than 5 stars. Even though there were a few parts that aggravated me--mostly in book 3--the good far exceeded the bad. It took me nearly three weeks to read this 1153 page monster, and amazingly I was never bored with it. Such an epic tale, biblical in scope, with some truly remarkable character development. I'll be remembering this one for a long, long time to come."}, {"userName": "Chris", "userReviewDate": "Jan 31, 2008", "userURL": "http://www.goodreads.com/user/show/858949-chris", "userReview": "And so the Apocalypse Trifecta is complete, with my one, true favorite End of the World book. I have no idea how many times I've read it now - I know the first time was in junior high school, though, and a lot of time's gone by since then. I also think I have about three different copies floating around....It's hard to know where to begin when writing about this book, probably because I work under the assumption that everyone has read it. But I guess that's what everyone thinks about their favorite books, so I'll fill in those of you who haven't.It's the end of the world. Not in the horrible confluence of blindness and carnivorous plants, or in the fiery desolation of nuclear war. The world dies in a more unpleasant way than that, and it all begins in Project Blue - a US military lab in the southwest. There they've built the greatest plague mankind has ever known, a shapeshifting flu virus that is 99.4% communicable and 100% lethal. Its intended use was probably against the Soviets or some other enemy state, but... Things fall apart, the center cannot hold, as Yeats said. And on June 13th, 1990, the superflu got out.It was carried by Charles Campion and his family, spread throughout the southwest until Campion died in a gas station in Arnette, Texas. From there it hopped into the men gathered at the station, who passed it on to nearly everyone they met.By June 27th, most of America was dead. And thanks to the final command of the man in charge of Project Blue, the virus was spread around the world as well. By Independence Day, the population of the world was reduced to less than the pre-plague population of California.Of course, not everyone who was immune escaped unscathed. There were accidents, mishaps and murders that probably brought the number down, but not by much. Scattered survivors struggled to understand why they lived when so many had died, and started to seek out others like them.And then came the dreams. An ancient woman, living in a cornfield. She radiates goodness and compassion (and still makes her own biscuits). Mother Abagail is the beacon of hope for those who see her in their dreams. And then there's the other, the Dark Man, the Walkin' Dude, whose shadow brings madness and whose gaze brings death. He is Randall Flagg, a man whose time has come 'round at last. Just as Mother Abagail attracts the good and strong, so does Flagg attract the weak and frightened. Around these two do the remains of America come together. And neither one can let the other exist without a fight....What keeps bringing me back to this book? Well, a lot of things. For one, the writing. King has said that he's a little disturbed about The Stand being the fans' favorite - it means he did his best work thirty years ago. Not entirely true, I think, although I am hard pressed to say which of his other books exceeds it. King's sense of scale as a writer is outstanding. We get into our characters dreams, in their innermost secret thoughts, and then a few pages later are presented with an overview of what's happening around the nation. It's like being able to go, in Google Maps, from someone's bedroom all the way out into space. He dances between characters smoothly, so just when you get to the point where you're thinking, 'Yeah, but what's Flagg doing?\" he brings you there.And speaking of the characters, they're people who will stay with you long after you finish the book. The quiet confidence of Stu Redman, the single-minded madness of the Trashcan Man, Larry Underwood's late maturity, Lloyd Henreid's devotion, Fran Goldsmith's determination.... Each character rings true. Even the ones who really shouldn't have ended up the way they did - and I'm thinking of Harold and Nadine here - you can't help but find bits of them to love. Had they been strong enough, Harold and Nadine never would have gone as bad as they did, and I think even King kind of had a hard time making them do what he wanted.Underlying all this, of course, is a kind of Old Testament religiosity. The God of Mother Abigail is not the kind and friendly God of the New Testament, He is the angry one of the Old. He is the God who will gladly wipe out nearly all of mankind to prove a point, and will make a 108 year-old woman walk into the desert by herself because she's getting a little too uppity. In this world, at least, God is most definitely real, even though His purpose is hard to understand.I could go on. Thesis papers could probably be written about this book, and I reckon they already have been. But that's not why I do these reviews. I do them because I want y'all to know what's worth reading.This book is worth reading.Oh, and one more thing - if anyone wants to send me the DVDs of the TV movie that was made back in the 90s, I'd be your friend for life. One of my favorite college memories was getting a whole bunch of friends together in my dorm room to watch it when it was broadcast...."}, {"userName": "Stephanie *Very Stable Genius*", "userReviewDate": "Apr 15, 2012", "userURL": "http://www.goodreads.com/user/show/1085121-stephanie-very-stable-genius", "userReview": "The first time I read The Stand I was home sick from school with some illness, the German measles I think. Maybe not a good time to be reading a book about a super flu, but I was young and not so bright.This had to have been in 1981 or so, because that’s the year MTV debuted, back then they played music videos on Music Television and probably had about ten or so they kept playing over and over. Well, I’m on the pull out couch in the family room with MTV playing (it made me feel better to see the guys from Journey), and reading The Stand, half listening to MTV when this (very 80's)video I hadn't seen before comes on.The StandThis was very surreal. I was feverish and the words I was reading like “The walkin’ dude” and “Trashcan Man” were coming out of the TV machine. It was very strange……as strange as The Alarms hair. Did you notice the painting of the flower he did looks just like the hair. Amazing…….I kind of like the painting. I loved the book and it has been one my favorites list ever since. I always wanted to re-read it, but it was so darn long, and there are so many books out there to read. Thirty years later they release the audio version and I was excited, not only to revisit the book but to hear it on audio,(yay) and I was not disappointed. The Stand still remains on my favorites list. But since it had been so long since I first read it, I forgot most of it. It was like a whole new book.The government develops a biological weapon, a super flu (project Blue) , nick named Captain Tripps, that is inadvertently released and kills 99% of the human population along with most of the dogs and horses. The cats survive (they always do). Here I have to ask the question, why would a government develop such a weapon when It kills most everybody…….even the guys on your side, and you?The people who survive start to have crazy dreams. One is about a very old African American women, Mother Abigail, in Nebraska who calls on the people to come see her and then to travel to Boulder Colorado. The other is a nightmare about a mysterious fella named Randell Flagg, aka The Walkin’ Dude or the Dark Man who draws them to Los Vegas. Randell is not just bad; he is pure evil, while Mother Abigail is the instrument of God. The survivors pick their side, and there is a good old fashion show down between good and evil. What could go wrong?King develops strong, memorable characters in this book. He also writes horrifyingly memorable scenes like a trip through the Lincoln Tunnel in New York, dark and stuffed to the brim with rotting corpses. That is not one of the things I forgot.A few minor things bugged me in this version. Stephen went back later on and added pages to the book that were cut by the publishers, which I am happy with. But, in an attempt to update the book, he moved the time period up from 1980 to 1990. This made a few things awkward, such as a scene about the shootings at Kent State University. The reasons for the shooting were changed from being about war protest to protesting the detainment they were under because of the flu. This worked in the original version because it was closer in time period of the shootings at KSU. Being set in the 90’s it made no sense.Also, King was in love with the word “pillion”, it means to ride behind the driver of a motorcycle. He used it as much as he could. He also described people’s knee joints popping when squatting, or getting up from a squat, many times. One time would have been just fine.Love the book. Now I’m off to buy hand sanitizer."}, {"userName": "Paul O'Neill", "userReviewDate": "May 15, 2015", "userURL": "http://www.goodreads.com/user/show/17331573-paul-o-neill", "userReview": "M-O-O-N, that spells one of the best books ever! This is King at his very best."}, {"userName": "J.K. Grice", "userReviewDate": "Oct 03, 2017", "userURL": "http://www.goodreads.com/user/show/72137025-j-k-grice", "userReview": "I know THE STAND is considered King's magnum opus by many, but I had a hard time staying fully engaged with this epic tale. Maybe in part because I'm not the biggest fan of post apocalyptic fiction. This book seemed overly long to me, and I was more than ready for it to end. 2.5 stars"}, {"userName": "Franco  Santos", "userReviewDate": "Apr 11, 2014", "userURL": "http://www.goodreads.com/user/show/29931457-franco-santos", "userReview": "Uno de mis favoritos de mi autor favorito, y uno de los más complejos y mejor elaborados. No voy a escribir 1000 palabras para convencerlos de que lo lean, solo confíen en estas pocas líneas y en mi calificación perfecta. Cuando digo que es de lo mejor de lo mejor, lo es. Fantástico trabajo de King. Lectura impostergable, conmovedora, emocionante."}, {"userName": "Matthew", "userReviewDate": "Oct 05, 2016", "userURL": "http://www.goodreads.com/user/show/16254355-matthew", "userReview": "[ Trashcan Man and The Kid as it filled in the blanks for the Trashcan Man’s journey across America. However, it makes it more obvious that Trashy is barely in the rest of the book – which I don’t remember feeling when I read the abridged version  (hide spoiler)]"}], "description": "This is the way the world ends: with a nanosecond of computer error in a Defense Department laboratory and a million casual contacts that form the links in a chain letter of death. And here is the bleak new world of the day after: a world stripped of its institutions and emptied of 99 percent of its people. A world in which a handful of panicky survivors choose sides -- or are chosen.", "title": "The Stand", "url": "http://www.goodreads.com/book/show/149267.The_Stand", "average": 4.34, "cover": "https://images.gr-assets.com/books/1213131305l/149267.jpg", "reviews": 15045, "authors": [{"url": "https://www.goodreads.com/author/show/3389.Stephen_King", "name": "Stephen King"}, {"url": "https://www.goodreads.com/author/show/133241.Bernie_Wrightson", "name": "Bernie Wrightson"}], "type": ["Horror", "Fiction", "Fantasy", "Science Fiction", "Apocalyptic"], "outlinks": ["http://www.goodreads.com/book/show/149267.The_Stand", "http://www.goodreads.com/book/show/228202.The_Stand", "http://www.goodreads.com/book/show/13155183-the-stand", "http://www.goodreads.com/book/show/1454117.The_Stand", "http://www.goodreads.com/book/show/9813753-the-stand", "http://www.goodreads.com/book/show/5864120-the-stand", "http://www.goodreads.com/book/show/11232016-the-stand", "http://www.goodreads.com/book/show/6983110-the-stand", "http://www.goodreads.com/book/show/5583246-apocalipsis", "http://www.goodreads.com/book/show/25159945-the-stand", "http://www.goodreads.com/book/show/11588.The_Shining", "http://www.goodreads.com/book/show/10614.Misery", "http://www.goodreads.com/book/show/43615.The_Gunslinger", "http://www.goodreads.com/book/show/10592.Carrie", "http://www.goodreads.com/book/show/10644930-11-22-63"]}