{"ratings": 16543, "userreviews": [{"userName": "Mike (the Paladin)", "userReviewDate": "Nov 25, 2009", "userURL": "http://www.goodreads.com/user/show/2187043-mike-the-paladin", "userReview": "I worked for years in a situation where I spent hours in driving so I often I listened to books on tape or CD. I mentioned before that I was surprised that I got into these books. I have noted that most of the reviewers of these are women (no surprise). Had I not been desperate for something to listen to I would probably never have tried them. Yes they are Christian in content, but they don't get preachy. Yes we do follow Father Tim and his (new) wife and his shaggy dog, but they don't slump into soap opera. I am a Christian and these are a cut above a lot of \"so called\" Christian fiction.I'd describe it this way. There are works of Christian fiction that happen to be very good books.Then there are very good books that happen to be Christian fiction. These are, in general, the latter.Even if this doesn't seem like the kind of book you would usually read let me suggest you consider trying them."}, {"userName": "Sarah Grace", "userReviewDate": "Dec 15, 2016", "userURL": "http://www.goodreads.com/user/show/59507807-sarah-grace", "userReview": "Lovely, as always! I have never been disappointed by Jan Karon!"}, {"userName": "Lena Morrison", "userReviewDate": "Jan 16, 2018", "userURL": "http://www.goodreads.com/user/show/28404981-lena-morrison", "userReview": "Jan Karon is such a great author.The third novel in the Mitford Series was no exception.I am so glad that Father Tim is now married! You can feel his happiness. Cynthia is perfect for them. They really love each other.Father Tim had many adventures, and some were sad, but some were heartwarming.Great read for anyone who loves Mitford!"}, {"userName": "Kelly ", "userReviewDate": "Apr 11, 2010", "userURL": "http://www.goodreads.com/user/show/872942-kelly", "userReview": "I'm going to write the same thing for the entire series. It's a syrupy sweet old fashioned read which does not demand anything of the reader. Many find the series feel good, and there are some sparkles of true conflict here and there, but mostly it's about the mundane daily plight of a vicar who finds love later in life and saves people - emotionally and physically. If you like the first in the series, keep reading because you will be comforted by the characters and will want to see who is added to the \"family.\" This reads like it was made for a TV series, which I am surprised it has not been made into for PBS yet!What I like about this series is that it doesn't try to be anything it is not; that in itself makes it charming, and if you want to read a simple, feel good, clean series, then this is it."}, {"userName": "Melinda", "userReviewDate": "Jun 22, 2012", "userURL": "http://www.goodreads.com/user/show/1661139-melinda", "userReview": "I cannot get enough of this series. After I finish each volume, I am so eager to begin the next one. Karon's eclectic Mitford characters have definitely captured my attention and I realize that I am seriously invested in what becomes of them. I admire Karon's apt ability to keep the stock characters engaging - the story lines have remained fresh and animated and the additions of new characters are lively and anticipated. I feel like I currently truly know these people.In this volume, I found Fancy Skinner and her ceaseless chatter to be fantastically believable - I have known several women during my life whose faces I could easily place in her stead, minus the over-abundantly pink wardrobe. Another fresh character is Scott Murphy; the history of why he comes to Mitford is telling and especial, a definite asset to this North Carolina community. And then there's Dooley Barlowe. There continues to be such growth with this character as her struggles to put his former piteous ways behind him and parade the skills that he is obtaining in private school. The \"ain'ts\" continue to slip in and I applaud his response of \"love ya back\". Very enriching reading!"}, {"userName": "BarbaraW", "userReviewDate": "Nov 15, 2017", "userURL": "http://www.goodreads.com/user/show/59266940-barbaraw", "userReview": "Nice third book in a series. Really gets to the heart of being a minister including dealing with troubled people 24/7. You feel like you’re part of Mitford, the little hilly town where this book takes place. He finally marries Cynthia, who is a lively jovial person. He is awestruck that he’s 61 and getting married for the first time and really cherishes her so sweetly. You can really feel the love. These books are well done and make me chuckle which is rare."}, {"userName": "Dawn Teresa", "userReviewDate": "Jul 12, 2011", "userURL": "http://www.goodreads.com/user/show/1480109-dawn-teresa", "userReview": "Originally posted on my blog, Read Love.Ah, Mitford! You are such a breath of small-town fresh air! If you are unfamiliar with the Mitford Years series, you need to start at the beginning, At Home in Mitford. These books, which follow life in a sleepy North Carolina town, are told from the point of view of Father Tim, the rector of Lord's Chapel. Much like an easy chair or an old sweater, this series is a cozy delight. You'll not find arresting intrigue, high drama, or pulse-quickening action in the pages of a Mitford Years book. But that's not to say you won't find something of value.What you'll find in Mitford is a loveable town with endearing characters. With each installment, you'll feel like you're catching up with family and friends. Jan Karon says she writes \"to give readers an extended family, and to applaud the extraordinary beauty of ordinary lives.\" And she's true to her word. There may be a bigger dose of minutiae than you'll encounter in a dramatic novel, but therein lies the charm. These characters feel like ordinary people--people you'd meet in a real-life small town. And we watch their lives unfold at a steady pace. We watch them celebrate, grieve, love, laugh, and grow. And hopefully we grow a little bit with them as they learn lessons from every day life.So, if you find you need a break from whatever larger-than-life drama you might be reading and want a quiet escape to clear your mind and take a deep breath before plunging back into murder, mystery, or mayhem -- look no farther than Mitford."}, {"userName": "Janice", "userReviewDate": "May 16, 2009", "userURL": "http://www.goodreads.com/user/show/1428024-janice", "userReview": "This is the third book in this series, and with each book I am more engaged with these characters and their stories. I have listened to the books on audio, and the reader is great at giving each different person in the story a voice that fits with the wonderful characterizations developed by the author. The setting is a small town in North Carolina, and pastor Tim Kavanaugh strives to serve all the community, whether members of his church or not; he is very much a part of their joys, sorrows, and daily lives. In this book, the pastor begins to have increasing concerns for a small area outside of town called “the creek”, where poverty, drugs and violence prevail; pastor Tim feels that he is not doing enough to reach those who live at “the Creek”, although he and his wife are raising a young boy from there, he has found a home for another child, and formed a relationship with Homeless Hobbs, who lives in a shack and serves soup to the others living along the creek. I am looking forward to learning more about his efforts to reach the people living in \"the creek\" community in the next book."}, {"userName": "Dianna", "userReviewDate": "Feb 08, 2011", "userURL": "http://www.goodreads.com/user/show/4752531-dianna", "userReview": "In this book, Father Tim is married to Cynthia at last. She is moving into his home and now he has to learn about sharing space with her.Dooley reaches a very hard decision regarding his life's journey. Father Tim has grown to love Dooley as though he were his own son. Father Tim and his secretary Emma are introduced to the world of computers. This leads to a few laughs when they venture forward with this. In this book we will meet new characters, or as I call them friends. One of these is Lacey. She is a toubled teenage girl who requires a lot of help. But, Father Tim to the rescue.If you're still into the series you have to go on to #4 \"Out to Canaan\"."}, {"userName": "Sara", "userReviewDate": "Nov 13, 2012", "userURL": "http://www.goodreads.com/user/show/909838-sara", "userReview": "I love Father Tim and all his cohorts there on Mitford. I find myself loving his parishioners like they are from my own congregation, mourning when they mourn, and feeling joy for those that have triumphed! Great read."}, {"userName": "Amy", "userReviewDate": "Mar 30, 2015", "userURL": "http://www.goodreads.com/user/show/4785830-amy", "userReview": "Excellent. Enjoyed each moment of this story. After I read these books the first time, we went to North Carolina for a sabbatical. So many years later we've just planned a return trip to the Asheville area—right as I'm rereading the books. Not a coincidence:)"}, {"userName": "Debbie", "userReviewDate": "Sep 20, 2016", "userURL": "http://www.goodreads.com/user/show/4191554-debbie", "userReview": "This is such a heart warming series. It's like a nice long visit with old friends."}, {"userName": "Susan Snodgrass", "userReviewDate": "Jan 30, 2018", "userURL": "http://www.goodreads.com/user/show/7103516-susan-snodgrass", "userReview": "Pure nourishment for the soul are these Mitford books. I am on my third reading and they are as fresh and wonderful as ever. Mitford is one fictional place I would love to live."}, {"userName": "Katy", "userReviewDate": "Dec 10, 2017", "userURL": "http://www.goodreads.com/user/show/5927858-katy", "userReview": "True feel-good bookBut very Christian while doing so:) I didn't mind skipping all that though, as the characters are well written and pretty believable."}, {"userName": "Joan Bennett", "userReviewDate": "Aug 27, 2017", "userURL": "http://www.goodreads.com/user/show/28925022-joan-bennett", "userReview": "A long series and every book an interesting and relaxing read. Not complex literature, just extremely pleasant times among people all would admire."}, {"userName": "Leah", "userReviewDate": "Oct 08, 2017", "userURL": "http://www.goodreads.com/user/show/2780712-leah", "userReview": "Relaxing. Rejuvenating. Real."}, {"userName": "Gracelyn Buckner", "userReviewDate": "May 18, 2018", "userURL": "http://www.goodreads.com/user/show/63411712-gracelyn-buckner", "userReview": "4.5 StarsReally, really great! I'm loving this series."}, {"userName": "Chris", "userReviewDate": "Aug 06, 2017", "userURL": "http://www.goodreads.com/user/show/10983379-chris", "userReview": "Loved Scott-the new Chaplin. Can't wait to see more of himTHIS SUMMARY/REVIEW WAS COPIED FROM OTHER SOURCES AND IS USED ONLY AS A REMINDER OF WHAT THE BOOK WAS ABOUT FOR MY PERSONAL INTEREST. ANY PERSONAL NOTATIONS ARE FOR MY RECOLLECTION ONLY1st year of Father Timothy and Cynthia Kavanagh marriage - the merging of their households (keeping both her house and the rectory)... hers as her studio and their place of recreation ... they are negotiating... their only stumbling block, the future - he freezes up and cannot talk to her about retirement (he figures out, in the cave, it is tied to his father, whom he could never satisfy growing up or save his soul - and hence he can't look to the end of his career - she gently confronts him on it early on, respects his need to withdraw but expresses her sadness of having a part of him cut off from her - and he remembers advice before married, that communication is paramount, and if she wants to talk he must listen, or... and he can finally see his way to talking about retirement - maybe in 3 years... and the book ends where they agree that Mitford (her house) will be their home base in retirement : )\"He could see, early on, that beds were a problem that needed working out...(at the rectory) 'What is this trough doing in your bed?' she asked... They had been squeezed together like sardines the livelong night, which he had profoundly enjoyed, but she had not. 'Do you think this is what's meant by the two shall be one flesh?' she murmured, her cheek smashed against his...(the following night in her bed) a super-king-size, and the largest piece of furniture in her minuscule house. He found it similiar in breadth to the state of Texas, or possibly the province of Saskatchewan. Was that a herd of buffalo racing toward him in the distance, or a team of sled dogs?\"Cynthia courageously says no to all offers to include her in the committees of the church (6 in one night) - but so as to do her husband proud, she plans an Spring Tea (and she does him proud)...Dooley Barlowe: the 12 year old boy they've unofficially adopted... he is attending (and adjusting) to the boarding school Sadie is funding for him... some moments of insecurity... and he hurts Tim and Cyndy when he asks to spend the summer on the farm... but there is love...Lacey Turner: 14 year old girl from the Creek; poor, father drinks and beats her; mother bedridden, and depends on Lace to care for her (and dad threatens to beat mother if Lace makes him mad); she accepted Jesus when Tim's friend preaching there over the summer; Tim catches her digging/stealing fern plants from Sadie's, confronts her, she runs off; but when beaten badly, she goes to Tim (on recommendation of other preacher), and he & Cyndy do their best to heal her; ultimately (because of Tim's report to social services) she is picked up, and placed in Sadie's niece's home; she helps Tim 'rescue' Dooley's younger brother;Olivia Harper: Sadie's illegitmate neice (but they have found each other and are happy); Sadie living in Olivia's 1 story house; she takes on the fostering of Lacey - having met her at Tim's, got along with her, and wanting her life (after heart transplant) to be meaningful;Miss Sadie Baxter and Louella Baxter Marshall: Town aristocracy (based on father & grandfather's influence); millionaire; friends of Tim, and serve the church and Dooley; Tim throws her an 80th birthday party - everyone gets involved; but she falls a few days later, and doesn't recover; she leaves Dooley (feeling he will be a man of consequence) a million dollars, in trust til his 21st birthday; Louella, her faithful friend and companion is the first to move into the retirement home Sadie built - getting room #1;;Pauline Barlowe and Poobaw: Dooley's mother and younger brother; she (along with Lacey) found God, and has stopped drinking, and is doing her best to live godly; her husband continues to be a drunk, and he pours kerosene on her and lights her on fire; she is hospitalized, and the doctor requests Tim to pray for the unknown woman, and to be with her - he is there 2x a day when dressings changed and after grafting; she seems familiar, and when breathing tube removed he learns she is Dooley's mother, looking for a second chance; he recovers Poobaw (who is living with grandpa), and reunites Dooley (who seems to be taking it in stride; I'm puzzled about a 4 year old Daughter - where is she? - and apparently there is a 3rd son that she sold in Oregan for $100 and bottle of booze - will he ever be found?Doc Hal Owen and Marge Owen (and Rebecca Jane Owen): Dooley goes to them for the summer - to continue to learn to work on animals; he delivers twin cows (and names them after his siblings); Dave the Technician and Emma Newland: the church is getting a computer (he stores it in his trunk for a few weeks until Dave shows up to install it : ), and once a week lessons to learn how to use it; Dave is patient... and though secretary Emma threated to quit, at some point she has an aha moment, and embraces it whole heartedly - allowing Tim to fall back;Dr. Wilson and Dr. Hoppy Harper: last book, and continued in this book, the doctors pray for and with their patients, and call in Tim to pray with them on especially challenging patients;Adele Lynwood and J.C. Hogan: new 40 something policewoman (1st in the town) and town newspaper owner; at first JC (who lunches with Tim and Mule most days) is teasing them about how their women 'influence' them... but then he starts jogging, and eating right... and it takes a bit to figure out he and Adele are talking... their conversation about women and buying flowers (not just once), etc is hilarious;Mule Skinner: hmmmm... meets them for lunch, long time married;Mr Omer Cunningham: two seater plane; Tim is given day's notice that Dooley is in a performance... its a 4 hour drive, and Tim is driving... 30 minutes in his car stops... he ends up accepting Omer's offer to fly him (he questioned if this was really how God was answering his prayer : ); hilarious trip - and all things considered Tim enjoys it;Puny Guthrie: twins - Sissy and Sassy; Puny, poor, ambitious, loving, God fearing, continues to bring sunshine and clean the rectory... she is newly married, they are building an addition (Tim buys them a toilet as a gift), and she is pregnant, delivering twins; Tim is there for the birth (almost passes out), and the babies come with her to work;He finds a young, energetic chaplain for the retirement home... who also responds when they discuss the Creek... look forward to him in the next book. (**There are so many. And if you haven’t read the first two and tried to read this, forget it. But as I read more, the book got better. Dooley is going to a private school paid for by Sadie. After a rough start, he is doing well. The reverend and his wife are getting used to being married. They get lost in a cave on a camping trip and it changes their lives. Sadie dies in this one. That’s sad. A young girl is saved from her abusive father and taken in by Olivia. Dooley’s mother finds God but then gets burned by her boyfriend. She is fighting for survival but is bent on turning her life around. Dooley is reunited with his younger brother. The maid has twins. Computers are introduced to Timothy’s secretary who hates them at first but then becomes a wiz. Lots going on in Mitford."}, {"userName": "Kellie", "userReviewDate": "Sep 12, 2008", "userURL": "http://www.goodreads.com/user/show/842772-kellie", "userReview": "-(#3 of the Mitford Series) I wasn’t really into this book when I first started to read it. Jan does not do a very good job reminding the reader who the characters are. There are so many. And if you haven’t read the first two and tried to read this, forget it. But as I read more, the book got better. Dooley is going to a private school paid for by Sadie. After a rough start, he is doing well. The reverend and his wife are getting used to being married. They get lost in a cave on a camping trip and it changes their lives. Sadie dies in this one. That’s sad. A young girl is saved from her abusive father and taken in by Olivia. Dooley’s mother finds God but then gets burned by her boyfriend. She is fighting for survival but is bent on turning her life around. Dooley is reunited with his younger brother. The maid has twins. Computers are introduced to Timothy’s secretary who hates them at first but then becomes a wiz. Lots going on in Mitford. It’s a place I wish existed because I would love to go visit it. This is enjoyable"}, {"userName": "Rick Boyer", "userReviewDate": "Sep 07, 2015", "userURL": "http://www.goodreads.com/user/show/16805695-rick-boyer", "userReview": "I know that a lot of people love Jan Karon... and this story was okay, as a story. But it was just way too syrupy, schmaltzy, and sentimental for me. Father Timothy Kavanaugh sounds like a nice guy; but his ministry is really a textbook recipe for severe clergy burnout. He's supposed to be a simple country parson... but in reality he's superman. And a real-life pastor wouldn't last a year doing what he does, with a smile and no complaints. I know, I know, Mitford is supposed to be a special kind of place... sort of a latter-day Mayberry, North Carolina. But after about 150 pages it started to feel like something out of an episode of The Twilight Zone... and any minute I expected Rod Serling to show up, asking to join Father Kavanaugh's church. If you love it, that's great... but it's not my gig."}, {"userName": "Autumn", "userReviewDate": "Apr 04, 2011", "userURL": "http://www.goodreads.com/user/show/2564574-autumn", "userReview": "Sweet, humorous, and believable as always. And it's always nice to read of people who share your religious tendencies and pray for guidance, safety, and the joy of people just like you do. Mitford feels like your hometown and the characters like old friends. Karon skillfully helps us welcome new characters and say goodbye to old friends while still keeping the feel of the Mitford family. Nice to read such a good, clean book where good and normal things happen to good, decent, normal people who you recognize as being just like your friends or neighbors—or maybe even yourself. Always nice and charming to visit Mitford."}, {"userName": "E.A. Lawrence", "userReviewDate": "Oct 16, 2016", "userURL": "http://www.goodreads.com/user/show/5536730-e-a-lawrence", "userReview": "Another restful stay in the town of Mitford. Gotta say, when things are stressful and I feel rather depressed about life, the universe, and everything, there is nothing like a Mitford book to help me unplug."}, {"userName": "Delores Thomas", "userReviewDate": "Mar 28, 2015", "userURL": "http://www.goodreads.com/user/show/2561103-delores-thomas", "userReview": "I enjoyed this story completely. I have just discovered this series. Each one has a wonderful theme of faith and redemption. Father Tim quotes many inspirational songs, verses and other things. That is the main reason I enjoy these books."}, {"userName": "Dawna", "userReviewDate": "Aug 25, 2012", "userURL": "http://www.goodreads.com/user/show/5683946-dawna", "userReview": "Giving all MItford books a 5* from now on. Read them all at least 4 times. Guess I kinda like 'em!"}, {"userName": "Jan", "userReviewDate": "Jun 06, 2018", "userURL": "http://www.goodreads.com/user/show/77614930-jan", "userReview": "These High Green Hills was Jan Karon’s third book about the town of Mitford, which has been said to be modeled after Blowing Rock NC. Her books give us well-developed characters, light humor and yet she isn’t afraid to deal with tough, poignant issues such as child abuse, alcoholism or depression. In this installment, Father Tim and his beloved wife Cynthia are contemplating their future. Should he reitre from the Episcopal church? Should they move to a new place? What will they do with the wondrous rest of their lives together? Meanwhile, they help several youngsters who are from broken homes, putting feet on their faith. Their marriage is a true partnership. Even though Father Tim is a primary character, the books are not preachy at all. In fact, the priest is humble and teachable, as the Bible tells us that we all should be This book gives a micro-picture of what the life of clergy are really like - not just preaching once a week, but going walking through the very human dilemmas of his congregation-hurting with the families at the death of a beloved family member and pillar of the community (no spoilers), seeing patients in excruciating condition in ICU, deciding when it’s time to delegat vs. when it’s time to do something himself and more. Father Tim shows. I loved Father Tim’s eomments, which are a testament of what joy and fuilfillment a GOOD marriage can bring:“How had he lived so long without this vital connection in his life? Where had he been all these years? How had he gotten by before he was married?\" If you like wholesome books about small towns, I recommend that you try Karon’s books."}, {"userName": "Kathy", "userReviewDate": "Dec 27, 2012", "userURL": "http://www.goodreads.com/user/show/382146-kathy", "userReview": "sweet - a collection of Tim's interior thoughts and dialogues with God... conversations with Cynthia... his wonder at finding a soul mate, and the good (great) of it - even what might be thought of as negative, warm him... 1st year of Father Timothy and Cynthia Kavanagh marriage - the merging of their households (keeping both her house and the rectory)... hers as her studio and their place of recreation ... they are negotiating... their only stumbling block, the future - he freezes up and cannot talk to her about retirement (he figures out, in the cave, it is tied to his father, whom he could never satisfy growing up or save his soul - and hence he can't look to the end of his career - she gently confronts him on it early on, respects his need to withdraw but expresses her sadness of having a part of him cut off from her - and he remembers advice before married, that communication is paramount, and if she wants to talk he must listen, or... and he can finally see his way to talking about retirement - maybe in 3 years... and the book ends where they agree that Mitford (her house) will be their home base in retirement : )\"He could see, early on, that beds were a problem that needed working out...(at the rectory) 'What is this trough doing in your bed?' she asked... They had been squeezed together like sardines the livelong night, which he had profoundly enjoyed, but she had not. 'Do you think this is what's meant by the two shall be one flesh?' she murmured, her cheek smashed against his...(the following night in her bed) a super-king-size, and the largest piece of furniture in her minuscule house. He found it similiar in breadth to the state of Texas, or possibly the province of Saskatchewan. Was that a herd of buffalo racing toward him in the distance, or a team of sled dogs?\"Cynthia courageously says no to all offers to include her in the committees of the church (6 in one night) - but so as to do her husband proud, she plans an Spring Tea (and she does him proud)...Dooley Barlowe: the 12 year old boy they've unofficially adopted... he is attending (and adjusting) to the boarding school Sadie is funding for him... some moments of insecurity... and he hurts Tim and Cyndy when he asks to spend the summer on the farm... but there is love...Lacey Turner: 14 year old girl from the Creek; poor, father drinks and beats her; mother bedridden, and depends on Lace to care for her (and dad threatens to beat mother if Lace makes him mad); she accepted Jesus when Tim's friend preaching there over the summer; Tim catches her digging/stealing fern plants from Sadie's, confronts her, she runs off; but when beaten badly, she goes to Tim (on recommendation of other preacher), and he & Cyndy do their best to heal her; ultimately (because of Tim's report to social services) she is picked up, and placed in Sadie's niece's home; she helps Tim 'rescue' Dooley's younger brother;Olivia Harper: Sadie's illegitmate neice (but they have found each other and are happy); Sadie living in Olivia's 1 story house; she takes on the fostering of Lacey - having met her at Tim's, got along with her, and wanting her life (after heart transplant) to be meaningful;Miss Sadie Baxter and Louella Baxter Marshall: Town aristocracy (based on father & grandfather's influence); millionaire; friends of Tim, and serve the church and Dooley; Tim throws her an 80th birthday party - everyone gets involved; but she falls a few days later, and doesn't recover; she leaves Dooley (feeling he will be a man of consequence) a million dollars, in trust til his 21st birthday; Louella, her faithful friend and companion is the first to move into the retirement home Sadie built - getting room #1;;Pauline Barlowe and Poobaw: Dooley's mother and younger brother; she (along with Lacey) found God, and has stopped drinking, and is doing her best to live godly; her husband continues to be a drunk, and he pours kerosene on her and lights her on fire; she is hospitalized, and the doctor requests Tim to pray for the unknown woman, and to be with her - he is there 2x a day when dressings changed and after grafting; she seems familiar, and when breathing tube removed he learns she is Dooley's mother, looking for a second chance; he recovers Poobaw (who is living with grandpa), and reunites Dooley (who seems to be taking it in stride; I'm puzzled about a 4 year old Daughter - where is she? - and apparently there is a 3rd son that she sold in Oregan for $100 and bottle of booze - will he ever be found?Doc Hal Owen and Marge Owen (and Rebecca Jane Owen): Dooley goes to them for the summer - to continue to learn to work on animals; he delivers twin cows (and names them after his siblings); Dave the Technician and Emma Newland: the church is getting a computer (he stores it in his trunk for a few weeks until Dave shows up to install it : ), and once a week lessons to learn how to use it; Dave is patient... and though secretary Emma threated to quit, at some point she has an aha moment, and embraces it whole heartedly - allowing Tim to fall back;Dr. Wilson and Dr. Hoppy Harper: last book, and continued in this book, the doctors pray for and with their patients, and call in Tim to pray with them on especially challenging patients;Adele Lynwood and J.C. Hogan: new 40 something policewoman (1st in the town) and town newspaper owner; at first JC (who lunches with Tim and Mule most days) is teasing them about how their women 'influence' them... but then he starts jogging, and eating right... and it takes a bit to figure out he and Adele are talking... their conversation about women and buying flowers (not just once), etc is hilarious;Mule Skinner: hmmmm... meets them for lunch, long time married;Mr Omer Cunningham: two seater plane; Tim is given day's notice that Dooley is in a performance... its a 4 hour drive, and Tim is driving... 30 minutes in his car stops... he ends up accepting Omer's offer to fly him (he questioned if this was really how God was answering his prayer : ); hilarious trip - and all things considered Tim enjoys it;Puny Guthrie: twins - Sissy and Sassy; Puny, poor, ambitious, loving, God fearing, continues to bring sunshine and clean the rectory... she is newly married, they are building an addition (Tim buys them a toilet as a gift), and she is pregnant, delivering twins; Tim is there for the birth (almost passes out), and the babies come with her to work;He finds a young, energetic chaplain for the retirement home... who also responds when they discuss the Creek... look forward to him in the next book."}, {"userName": "Carol", "userReviewDate": "Nov 13, 2017", "userURL": "http://www.goodreads.com/user/show/5106784-carol", "userReview": "Second Read: These books are magical. They are written so well that the characters and author put us the reader is such good moods and are touched by the personal stories of those involved. I'm busting out laughing one minute, then very much touched as there are changes in the book(s). This one is especially good. Father Tim had been wondering when it was time for him to retire. He finally met a man that will take over for him, and he and Cynthia can pursue new ideas, travel, and so forth. Dooley is doing well, and his new friend Lace is becoming an important person in their family. She has been hugely abused by her mother and it breaks my heart to see this sweet girl suffering so very much. I highly recommend this whole series. Awesome read.First Read: This is the third book in this series, and with each book I am more engaged with the characters and their individual stories. The setting is a small town in North Carolina, and Father Tim Kavanaugh strives to serve all the community, whether members of his church or not; he is very much a part of their joys, sorrows, and daily lives. Father Tim feels that he is not doing enough to reach those who live at “the Creek”, although he and his wife are raising a young boy from there, he has found a home for another child, and formed a relationship with Homeless Hobbs, who lives in a shack and serves soup to the others living along the creek. All of these books have brought me great joy to read"}, {"userName": "Lila Diller", "userReviewDate": "Apr 27, 2018", "userURL": "http://www.goodreads.com/user/show/65512362-lila-diller", "userReview": "I had a hard time getting into this book. I've been plugging away through the first two in the Mitford series, and I'm wondering if there is ever going to be a plot, a single thread that ties all of these pieces together. I started this book once and put it down at the end of chapter 4. It was more than six months later that I finally came back to try it again, for a challenge in my book club to redeem a book you'd never finished. After that, it finally seemed to get more into the marriage, the interaction in the relationship, of Father Tim and Cynthia, which is what I've been waiting for ever since they met. I had already felt cheated by not getting anything about their wedding, so I was getting disgusted with all the seemingly irrelevant details of the lives of everybody else in that town. I think one of the hardest things for me in this series is that I just don't relate to Father Tim much. It's hard to care about the book when I don't really care how the main character thinks. I wanted to get more into the mind of Cynthia. This came down to a POV issue for me.(I received this book as a birthday gift. The decision to write a review, as well as the opinions expressed in it, are all my own.)"}, {"userName": "Elizabeth Castro", "userReviewDate": "Oct 22, 2017", "userURL": "http://www.goodreads.com/user/show/43363595-elizabeth-castro", "userReview": "These High, Green Hills has been my favorite story in the Mitford Years series so far. The characters become more developed, seem to have everyday real life problems, and are less \"syrupy.\" And yes, I am addicted to this series flaws and all.One of the things I like least in this series is the occasional, out of the blue, old fashioned ethnic stereotypes that is generally not seen in today's writing. Page 170 states, \"We thought Indians were living in the cave and had scalped you or made you their slaves.\" And for the ending, I read faster and faster engrossed in the story, when it came to an abrupt and screeching halt. I actually read the ending four times seeing what I had missed. I don't understand how the story could end with Cynthia looking at a wall and thinking how it could look better. I was confused."}, {"userName": "Terry", "userReviewDate": "Jun 12, 2017", "userURL": "http://www.goodreads.com/user/show/9760366-terry", "userReview": "We have definitely fallen in love with another series. Seems we have been introduced to many new friends in this wonderful little village. \"The Mitford Years\" is a series by Jan Karon and \"These High Green Hills\" is the third book. Absolutely delightful. The town, the people, the charm and the spirituality weaved through the whole story. It will fill your heart. Mitford would be a wonderful place to escape to as we face the challenges of our everyday life. How we would love to stroll down Main Street with Fr. Tim and Barnabas, listen to a sermon at Lord's Chapel, read one of Cynthia's children's books, listen to Dooley talk about anything or sing like an angel, dance in Miss Sadie heavenly ballroom, share breakfast at Percy's or be preached to by Absalom. Mitford seems like a perfect place to be even when dealing with difficulty and we can't wait to return."}], "description": "In These High, Green Hills we're once again in Mitford, a southern village of local characters so heartwarming and hilarious you'll wish you lived right next door. At last, Mitford's rector and lifelong bachelor, Father Tim, has married his talented and vivacious neighbor, Cynthia. Now, of course, they must face love's challenges: new sleeping arrangements for Father Tim's sofa-sized dog, Cynthia's urge to decorate the rectory Italian-villa-style, and the growing pains of the thrown-away boy who's become like a son to the rector. Add a life-changing camping trip, the arrival of the town's first policewoman, and a new computer that requires the patience of a saint, and you know you're in for another engrossing visit to Mitford -- the little town that readers everywhere love to call home.", "title": "These High, Green Hills - the Third Novel in the Bestselling Mitford Series\n      \n          (Mitford Years #3)", "url": "http://www.goodreads.com/book/show/821172.These_High_Green_Hills_the_Third_Novel_in_the_Bestselling_Mitford_Series", "average": 4.28, "cover": "https://images.gr-assets.com/books/1344618554l/821172.jpg", "reviews": 520, "authors": [{"url": "https://www.goodreads.com/author/show/40552.Jan_Karon", "name": "Jan Karon"}], "type": ["Fiction", "Christian Fiction", "Christian", "Adult Fiction"], "outlinks": ["http://www.goodreads.com/book/show/821172.These_High_Green_Hills_the_Third_Novel_in_the_Bestselling_Mitford_Series", "http://www.goodreads.com/book/show/112874.These_High_Green_Hills", "http://www.goodreads.com/book/show/16053794-these-high-green-hills", "http://www.goodreads.com/book/show/147902.These_High_Green_Hills", "http://www.goodreads.com/book/show/1280868.These_High_Green_Hills", "http://www.goodreads.com/book/show/10086313-these-high-green-hills", "http://www.goodreads.com/book/show/1818586.These_High_Green_Hills", "http://www.goodreads.com/book/show/665881.These_High_Green_Hills", "http://www.goodreads.com/book/show/71776.At_Home_in_Mitford", "http://www.goodreads.com/book/show/112872.A_Light_in_the_Window", "http://www.goodreads.com/book/show/71784.A_New_Song", "http://www.goodreads.com/book/show/78674.Out_to_Canaan", "http://www.goodreads.com/book/show/71787.In_This_Mountain"]}