{"ratings": 1018, "userreviews": [{"userName": "Margaretann", "userReviewDate": "Nov 26, 2011", "userURL": "http://www.goodreads.com/user/show/3833254-margaretann", "userReview": "I've officially given up on sleep books and am throwing in the towel. This will likely be the last one I pick up. There was nothing inherently wrong with the advice given here (another modified CIO approach to infant sleep) but I've realized that my little one will STTN when she's ready and that - for now - several wakings during the night is normal and okay (particularly as she is EBF and not yet eating solids). In my opinion, western society is way too obsessed with this notion that a baby MUST sleep through the night at such young ages. I've come to cherish the quiet night time together and appreciate the fact that we have these moments to cuddle - especially because I am apart from her so long during the day M-F. Yes, I often start my days tired but that's what coffee is for, right? As for going to sleep in her crib, we've got that down and our method goes against what CIO practioners advise (I nurse and rock her until she's asleep in my arms. Then I gently place her in her crib. Around midnight when she wakes up for the first time, I bring her to bed with me and we cuddle/nurse/sleep the rest of the early morning. CIO has never worked for her - she seems to get more wound up rather than the opposite and her screams were just too awful for me to endure.) This provides me with a few hours of sleep alone in my bed (well, with my husband) before she joins us.Hey, it works for us and, at the end of the day (literally!) that really all that matters, right? Everyone's got to find the best way for them."}, {"userName": "Hannah", "userReviewDate": "Aug 23, 2007", "userURL": "http://www.goodreads.com/user/show/208876-hannah", "userReview": "Absolutely saved my sanity and helped my daughter to learn excellent sleeping skills. I chose this book in a haze from the bookshelf at Borders one day after a major regression in my child's sleeping patterns left the whole family with basically no sleep for days. I was so tired that I was on the verge of a meltdown and there was no end in sight. I'd tried everything I could think of to help her sleep and nothing was working anymore. The reason I grabbed \"Sleepeasy\" is because the print was large and there were sidebars with quick tips in them - in short - it was easy for an exhausted person to read and digest. Within a week of buying the book and applying the methodology, my daughter was going to bed and naps easily, sleeping through the night and in a MUCH better mood when awake!As time has passed and there have been disruptions in our routine, such as illness, developmental milestones, teething or travel, I've returned to the book to help us get back on track. \"Sleepeasy\" is such a godsend that I won't even loan it out to friends because I always want it easily on hand for reference if needed. This method of sleep training is not for every child, but it is certainly what my child needed and continues to thrive on."}, {"userName": "Paula ", "userReviewDate": "Feb 03, 2015", "userURL": "http://www.goodreads.com/user/show/2879703-paula", "userReview": "I wanted an easy solution to my son's sleeping issues. But this book didn't tell me anything I didn't already know or have already been doing. If anyone has a better suggestion on a book that will help me get through my son's dreaded rolling stage in the crib, and to wean him off his paci at night, please let me know. I'm so tired."}, {"userName": "Regina", "userReviewDate": "May 05, 2008", "userURL": "http://www.goodreads.com/user/show/1075642-regina", "userReview": "Sleepeasy: worked better than expected. Promises almost all babies will be sleeping all night in 5 days or less, if parents follow the plan exactly. My baby dropped from 10 to 4 wakings the first night, and down to one waking the second night with a sleep stretch of 7 1/2 hours!Ferber's method:increased night crying and number of wakingsWeissbluth's method: my baby cried and cried and then it didn't work longterm because my baby was still night nursing.Pantley No-Cry Sleep Solution: didn't work, great rationalizing for parents who can't stick to a sleep learning plan. promises 92% of babies will be sleeping 5+ hours in a row after 60 days. The plan was confusing and difficult to follow. My baby had lots and lots of little bouts of crying, more total than a let cry method in the longrun. Night wakings increased, I was stressed because my \"to-do\" list was soooo long."}, {"userName": "Vi", "userReviewDate": "Jun 16, 2017", "userURL": "http://www.goodreads.com/user/show/28542688-vi", "userReview": "Really good advice and encouragement in a concise and easy-to-read format for parents working on their children's sleep.I'm taking off a star because of the authors' slant towards mothers being the primary caregiver of their kids. I understand some families work this way, either by choice or due to tradition. Even if yours has a much more active dad in the picture, ignore the bias and just take the information and suggestions.With travels and a move on our horizon, I'll definitely go back to this book to get our son's sleep back on track."}, {"userName": "Michelle", "userReviewDate": "Jun 04, 2018", "userURL": "http://www.goodreads.com/user/show/857137-michelle", "userReview": "What else can I say? It worked! Only one night of screaming with our 5-month old twins, and now they sleep all night except for one medically-needed night feeding. Naps are getting better too, but I was shocked at how well this worked and how quickly!"}, {"userName": "Christine", "userReviewDate": "Oct 12, 2017", "userURL": "http://www.goodreads.com/user/show/18186090-christine", "userReview": "It worked for us and our baby boy is sleeping through the night, so 5 stars!"}, {"userName": "Jillian Zimmerman", "userReviewDate": "Jun 28, 2017", "userURL": "http://www.goodreads.com/user/show/30270673-jillian-zimmerman", "userReview": "I used this sleep training style with our son, and it was difficult at first but truly did work! Consistency is key! I would definitely recommend this book to new parents."}, {"userName": "Chris Ortez", "userReviewDate": "Nov 27, 2013", "userURL": "http://www.goodreads.com/user/show/25967784-chris-ortez", "userReview": "I can't recommend this book any more whole-heartedly or enthusiastically. If you're losing your mind from lack of sleep due to a miniature version of you, this book will help you solve that. We had tried reading a few other books but the methods seemed a little too draconian for our tastes. This book struck the perfect balance between crying it out and offering aid to your child, in the form of scheduled check-ins (with no contact whatsoever, just reassuring and encouraging words). My wife & I employed the methods on Thanksgiving night 2012 (our daughter was 9 mo old at the time), and it literally worked for us in 18 minutes! Two prescribed check-ins and 18 minutes of exorcist-worthy screaming and she has been a pro-sleeper ever since, now asking to be put down for bed or naps! If you're the timid type, try buying the accompanying DVD to see it work in action. I actually needed that because I'm often the one putting our little girl to bed and yes, I was very nervous, but the DVD was the coup de gras and I was ready for action."}, {"userName": "Becki", "userReviewDate": "Mar 11, 2014", "userURL": "http://www.goodreads.com/user/show/4070808-becki", "userReview": "Ironically, I finished reading this book in the middle of the night when my 8 month old was refusing to sleep. The 4 stars is based on the writing and readability of the book. I haven't put the plans into practice yet. That's on the docket for the weekend.Let me start by saying I am really not a fan of \"crying it out\" or letting my lovely one cry and cry. However, none of the non-cry methods have worked with him. So I'm going to give this one a try. It promises results in less than a week for night time sleeping and a bit longer for naps (we need help there too).I liked the step-by-step approach and that I would read a section and then work on a specific section of our sleep plan. It was less overwhelming that way than some of the books where you read the whole thing and either 1) don't get anything practical to do or 2) have so much information you don't know where to start implementing.We'll see how it goes..."}, {"userName": "Leslie", "userReviewDate": "Dec 29, 2007", "userURL": "http://www.goodreads.com/user/show/137854-leslie", "userReview": "this book is great! i have so many \"how to get your baby to sleep\" books which are informative, but this book gives you a nuts and bolts plan that you can put into action. we recently encountered some problems with our daughter waking during the night...she had slept before but she is at a developmental fever pitch right now and i suspect also having a bit of separation anxiety. whatever the reason, she used to sleep and all of a sudden decided she wouldnt! after reading the book, we started our sleep plan and saw results after the first night. from there on out, it has been like a dream! we have gone from getting up several times a night to sleeping 11 hours straight. unbelievable!"}, {"userName": "Isabell", "userReviewDate": "Jul 27, 2008", "userURL": "http://www.goodreads.com/user/show/901248-isabell", "userReview": "So, this is the only book that actually worked. For that, it should get 5 stars. :) The writing I can't star because, well, it isn't literature and it doesn't intend to be. A note of caution: I wouldn't do this with a baby younger than 12 months to whom you can't explain what's going to happen. I really loved the author's idea of making an own story book to explain the new rules at bedtime. That worked especially well for me and Fé."}, {"userName": "Julie", "userReviewDate": "May 28, 2009", "userURL": "http://www.goodreads.com/user/show/718679-julie", "userReview": "This was the one book out of the 50 that I seemed to have read that got Leah to sleep through the night (finally) at 7.5 months old. It's great that is separates the advice into age groups so that if you are starting when your baby is 6 months or 3 years old, you know right where to start reading."}, {"userName": "Gail", "userReviewDate": "Mar 21, 2013", "userURL": "http://www.goodreads.com/user/show/93751-gail", "userReview": "You can read my thoughts on how much I LOVED this book and how we sleep trained our son at this blog post: http://www.gailwernerphoto.com/sleep-...All I will add is OH MY GOD IT REALLY WORKS."}, {"userName": "Sarah Bliss", "userReviewDate": "Jun 18, 2017", "userURL": "http://www.goodreads.com/user/show/28437664-sarah-bliss", "userReview": "This had been recommended to me by several fellow parents who had used it as a guide for successfully \"sleep training\" their babies. Of all the sleep resources available to exhausted parents, the consensus seemed to be that this one worked, so when we decided it was time to try to improve our baby's sleep habits, we decided to make this our bible. That was a good choice.I read the first few chapters (which hold most of the key information) on a tough night, after a series of tough nights, when we decided enough was enough. I confess that it made me cry a lot, though that certainly was not the authors' intent. It just brought up every kind of mom emotion for me: the relief of being understood and knowing we were not alone in these challenges, guilt that we hadn't made these changes sooner for our baby and ourselves, gratitude that there appeared to be achievable solutions to the sleep issues we were struggling with, grief at having to give up some of the practices that were contributing to the problem (in particular, letting my baby fall asleep in my arms - inconvenient, but so very precious). I had to stop reading, because it was all too much.But I finished reading it over the next couple days, we put it into practice, and the process went so much better than we expected it to. As I type this, we are not quite a week in, and it's still a bit bumpy at times (naps especially), but it has already made such a positive difference in our lives.I needed to read this book so much that I can't really be objective in my critique of it. I did notice some assumptions about gender roles and spousal relationships that don't reflect the diversity of modern families, which might trouble some readers more than others. It did bother me, but not enough to outweigh the good. Overall I appreciated the tone of the book - it was written with great compassion for those reading it, and was honest and realistic about what's involved in the process they present. I am sure it will continue to be a valuable resource for us, and I would definitely recommend it to other families."}, {"userName": "Joanna Martin", "userReviewDate": "Jun 13, 2017", "userURL": "http://www.goodreads.com/user/show/62913243-joanna-martin", "userReview": "I know everyone is different and different methods work for different families, but this book 100% worked for us and I would recommend it to anyone trying to sleep train. My 8 month old had started waking up almost every hour just to pacify himself to sleep on me, he would not sleep without being super fussy, squirmy, and cried multiple times a night. The VERY FIRST NIGHT we began the steps in this book, he cried for about 45 min before falling asleep (around 8pm). THEN HE SLEPT ALL NIGHT UNTIL 7 am! No joke, I am so relieved to be able to finally sleep all night!! This book gives great detailed information on night sleeping, napping, and anything else you can think of as far as sleep training goes. I am so happy it was suggested to me!"}, {"userName": "Gregg Desmarais", "userReviewDate": "Mar 13, 2018", "userURL": "http://www.goodreads.com/user/show/39344658-gregg-desmarais", "userReview": "Saved our lives!This book literally saved our lives. After implementing the Sleep Easy Solution our 10 month old was sleeping through the night in 5 nights. After night 1 he was able to put himself to sleep with minimal crying. It was like a miracle...the sleep deprivation had really taken a toll on us. I highly recommend this book to anyone who wants to improve their baby’s sleep habits. I only wish we read it sooner!"}, {"userName": "Joya", "userReviewDate": "Mar 06, 2018", "userURL": "http://www.goodreads.com/user/show/27295716-joya", "userReview": "Really good easy to read book with lots of tips on helping* your child sleep. Unfortunately they recommend sleep learning to begin at 4months and 14lbs. So I still have two months to wait until I can utilize their tips."}, {"userName": "Cassi Frank", "userReviewDate": "Dec 05, 2017", "userURL": "http://www.goodreads.com/user/show/47972524-cassi-frank", "userReview": "Four stars only because it's one of the hardest things I've ever done. But this works even if you hate every minute of it. One week and our bedtime routine was my favorite time of day again. Snuggles and stories and lights out with no tears."}, {"userName": "Laura", "userReviewDate": "May 16, 2018", "userURL": "http://www.goodreads.com/user/show/1312704-laura", "userReview": "I've read two books now to help me with child rearing - 1 on potty training, and this one. The two common threads I've found? Absolute consistency and positive reinforcement (i.e., not losing your shit when your kid makes you want to lose your shit). Now if only that were easy."}, {"userName": "Victoria", "userReviewDate": "Nov 06, 2017", "userURL": "http://www.goodreads.com/user/show/4741078-victoria", "userReview": "I appreciated that this book was easy to read and had specific steps. It also answers almost all of my questions. It was also the first thing that helped me get naps in order, as everything I read prior was too general. This book gave me the confidence to figure out a sleep schedule for my family."}, {"userName": "Angela", "userReviewDate": "Feb 01, 2018", "userURL": "http://www.goodreads.com/user/show/419440-angela", "userReview": "This guide is excellent. Short and to the point, without all the added fluff I find in most parenting books. It clearly lists what to do and how to do it, followed by custom recommendations to suit individual families. We followed this about a year ago and it worked!"}, {"userName": "Ashley Sala", "userReviewDate": "Jan 01, 2018", "userURL": "http://www.goodreads.com/user/show/17377588-ashley-sala", "userReview": "Not much I didn’t know but I do like the charts for what to expect different ages to sleep and the night feeding weaning suggestion. I appreciate being told to work on night first and naps simultaneously. My baby is 3.5 months so I’m excited to try this in a couple weeks!"}, {"userName": "Vidya", "userReviewDate": "Jul 01, 2017", "userURL": "http://www.goodreads.com/user/show/5710407-vidya", "userReview": "Easy read (esp relative to Weissbluth) and seems like a reasonable plan. Haven't put it into practice yet, but plan to in the next 4-6 weeks."}, {"userName": "Enkhzaya Burged", "userReviewDate": "Jan 02, 2018", "userURL": "http://www.goodreads.com/user/show/63345780-enkhzaya-burged", "userReview": "Clear, concise, to the point. It is very well organized for easy reference."}, {"userName": "Kara", "userReviewDate": "Dec 17, 2017", "userURL": "http://www.goodreads.com/user/show/67591627-kara", "userReview": "we faithfully followed the advice in this book and currently have a four and six year old who look forward to going to sleep and even ask to go to bed. it has been a lifesaver for our family!"}, {"userName": "Jenny", "userReviewDate": "Mar 07, 2017", "userURL": "http://www.goodreads.com/user/show/5227683-jenny", "userReview": "3.5 stars. I feel like they take a bit of an excessively hard line on sleep training. A lot of the explanations of why make sense, but some of their rules just don't work for my kids and would prolong the process (like no touching during check-ins). I used a different book for my eldest and I think I prefer it (unfortunately I can't remember the title), but I like some of the details included in this book.In the end, the desired results have been achieved. Baby boy has been sleeping in his crib and not on me since Day 1 of training. Alleluia!"}, {"userName": "Abigail", "userReviewDate": "Mar 28, 2018", "userURL": "http://www.goodreads.com/user/show/3027524-abigail", "userReview": "This is the second book I've read about sleep training for children and infants. The first you can find here. https://whimsywriter3.wordpress.com/2...I thought that The Sleepeasy Solution was a pretty helpful book, and it's one I'll probably read again once I actually have an infant. I really liked that the idea they presented of documenting your babies sleep habits and then creating a routine to go through every night with the child.  That seemed really practical and helpful. I also liked the sample sleep schedules and how they broke it all down. It gave me ideas for how I want to create a sleep schedule in the future. Waking up early is one of my least favorite things and hopefully this book will help me with this.I did think the book was wee bit long again, it was almost 300 pages which is a bit much. And it got repetitive at times. I thought it was interesting that they were against swaddling. But personally I think you should take something like that on a baby by baby case. Some of my siblings seemed to like swaddling more than others. In the end I gave the book four stars. So far it's my favorite of the baby sleep training books that I've read."}, {"userName": "Yvette", "userReviewDate": "Aug 08, 2011", "userURL": "http://www.goodreads.com/user/show/396453-yvette", "userReview": "I am really skeptical when it comes to books that \"supposedly\" help you get your baby to sleep. In desperation I downloaded this book into my Kindle. As I lied in bed with a baby nursing and my arm hurting from the side-lying position (which has been my permanent position for the past six months), I read the book thinking \"yeah right.\" The next day, exhausted from nursing all night and from getting very little real sleep I decided that enough was enough. I love my baby. I don't mind nursing and co-sleeping, but I knew that she was not getting enough sleep and neither was I. We were both very cranky and exhausted for the past few months. It's easier when you have children close in age (at least it was for me)because you are all pretty much on the same schedule. However, this baby is number four and eight years apart from the last child, which means that she goes to many events and is constantly on the go. Being on the go hasn't allowed for a structured nap schedule which means that I HAD to give her as much \"real\" sleep at night as possible. What we had been doing was nurse-sleeping and she was in a constant state of light sleep. Anyway, I JUST started The Sleepeasy Solution last night and baby slept in her co-sleeper for 12 hours! The hardest part were the first 30 minutes. Tonight, she went down at 8:00 PM and only fussed for about 7 minutes. I never got to the second or third check-ins. I like this solution because unlike the Ferber Method you don't just let the baby cry it out. This solution is much more friendly and you can customize it to fit your needs. I mean you don't want to customize so much that you are doing the same old thing that didn't work for you to begin with, but you can change the structure a little. It'll probably take longer to yield results if you don't follow it to the T, but it'll still work. I highly recommend this book and I highly recommend you do follow it as written because you will get results almost instantly. This morning I started to feel like my old self and my baby woke up with a big smile on her face. We thoroughly enjoyed our day with lots of play time and happy moments."}, {"userName": "Kristen", "userReviewDate": "Feb 13, 2009", "userURL": "http://www.goodreads.com/user/show/1664726-kristen", "userReview": "This is the baby sleep book I would recommend to others!The authors really have \"heart\" when it comes to helping a baby sleep. They understand the parent instinct to comfort an upset baby. I loved the detailed section based on different ages: 4-6 months, 6-9 months, 9-12 months, and so on.They introduced me to the concept of a \"dream feed\" rather than feeding my baby when she wakes. This way I don't have to expect her to sleep 12 hours through the night, but I do still expect her to fall back asleep on her own when she wakes at night. This is a concept I can get behind. I don't want to starve my daughter, but do want her to get closer to being able to sleep through on her own.The age specific nap information is also great. They talk about transitioning from 3 to 2 naps, and then from 2 to 1 nap. I was already a fan of scheduling naps for a fixed amount of time after the baby's last wake time. This just makes more sense to me than going strictly by the clock, since I know the baby doesn't know what time it is.Like most sleep training authors, they are cry-it-out advocates. Although they do make it clear that if you are reading their book you've tried your way of soothing, rocking, cuddling, etc and the baby just isn't sleeping the way you'd like. In fact, they don't think you should touch the baby at all when you go in for 5, 10, and 15 minute check-in.Side note: I find it curious that most development books say a 5 month old can probably sleep about 6 hours with out feeding, a six month old 8 hours. But books on sleep training, promise that in 1-2 weeks by using their methods any baby (sometimes as young as 6 weeks) will sleep 11-12 hours straight at night."}], "description": "Two experts who are helping Hollywood's A-list babies get their zzz's share the no-fail, family-friendly method that has helped thousands of sleep-deprived moms and dads.Even Hollywood's biggest stars face the same dilemma as other parents do: \"How do I get my child to sleep?\" As parents in the know are finding, whether they're on the red carpet or the soccer field, the answer is the same: The Sleepeasy Solution.Psychotherapists and sleep specialists Jennifer and Jill, the dynamic \"girlfriends\" all of Hollywood calls on to solve Junior's sleep problems, have perfected their sleep technique that will get any child snoozing in no time--most often in fewer than three nights. The key to their method? It addresses the emotional needs of both the parent and child (yes, how to handle the crying!)--a critical component of why most other sleep methods fail.In this much-needed, family-friendly guide, weary parents will learn to define their own individual sleep goals, those that work for their family's schedule and style. They'll create a customized \"sleep planner\" to ensure consistency with both parents as well as extended caregivers. (As an added bonus, they'll even improve the readers' relationships with their spouses with the \"marriage-saver\" section.) With comprehensive sections devoted to each stage of Baby's and Toddler's development, plus solutions to special circumstances like traveling, daylight saving's time, moving to a \"big kid bed\" and multiples, The Sleepeasy Solution is a dream come true!\"This approach was truly amazing in helping our family to thrive. . . . We are eternally grateful!\"--Ben Stiller and wife, Christine Taylor, actors\"With their gentle approach, Sleepeasy gave us the tools we needed to solve our daughter's sleep problems.\"--Conan O'Brien, host of NBC's Late Night with Conan O'Brien \"Sleepeasy gave us all the tools we needed to get our baby sleeping through the night. Now when we say good night to our daughter, we know it really will be a good night.\"--Greg Kinnear, actor", "title": "The Sleepeasy Solution: The Exhausted Parent's Guide to Getting Your Child to Sleep from Birth to Age 5", "url": "https://www.goodreads.com/book/show/474621.The_Sleepeasy_Solution", "average": 4.07, "cover": "https://images.gr-assets.com/books/1355832836l/474621.jpg", "reviews": 154, "authors": [{"url": "https://www.goodreads.com/author/show/265512.Jennifer_Waldburger", "name": "Jennifer Waldburger"}, {"url": "https://www.goodreads.com/author/show/7335950.Jill_Spivak", "name": "Jill Spivak"}], "type": ["Nonfiction", "Parenting", "Health"], "outlinks": ["http://www.goodreads.com/book/show/474621.The_Sleepeasy_Solution", "http://www.goodreads.com/book/show/18655457-the-sleepeasy-solution", "http://www.goodreads.com/book/show/7457785-the-sleepeasy-solution", "http://www.goodreads.com/book/show/8904210-al-fin-mi-bebe-duerme-de-noche-desde-el-nacimiento-hasta-los-5-anos-de", "http://www.goodreads.com/book/show/17842892-calm-mama-happy-baby"]}