{"ratings": 1908, "userreviews": [{"userName": "Brina", "userReviewDate": "Nov 24, 2016", "userURL": "http://www.goodreads.com/user/show/2933855-brina", "userReview": "Read in 1999 pre Goodreads. At the time Hamilton was one of my favorite authors and I read all of her books when they came out. Charming story about a now grown ballet dancer fighting to keep his family's summer home while coming to terms with his life."}, {"userName": "Kim", "userReviewDate": "Jun 19, 2007", "userURL": "http://www.goodreads.com/user/show/134131-kim", "userReview": "When I picked this up I was mostly intriqued by the cover, the ballet shoes on the front. I had already read two of her other books and I'm a fan of Jane Hamilton's. This book did not disappointment. It's about a young man who dreams of getting a big dancing role in the Chicago ballet. He works really hard, has some natural talent, and his family is supportive, though his lessons are expensive and there's some finageling involved with transportation. He's gay, though I think that's only hinted at. It's been awhile since I read it. There was some humor-- it wasn't nearly the heartbreaking downer as the Book of Ruth or Map of the World."}, {"userName": "Terry Gorman", "userReviewDate": "Mar 28, 2009", "userURL": "http://www.goodreads.com/user/show/2164449-terry-gorman", "userReview": "This book is a quiet, smooth, and wonderful read. Totally unpretentious and almost poetic. Reading it was like gliding across a frozen pond alone at the break of dawn."}, {"userName": "Wendy Perkins", "userReviewDate": "Jul 23, 2009", "userURL": "http://www.goodreads.com/user/show/1294624-wendy-perkins", "userReview": "\"The Short History of a Prince\" is a coming of age story split across one man's lifetime, showing how \"coming of age\" is an ongoing process that isn't relegated to any one place in a person's life. As a teenager in the early 1970s, Walter struggled with his sexuality, his feelings for his best friend Mitch, his desire to be a ballet dancer despite having little talent, and the slow death of his older brother from cancer. His crowning moment was landing the part of the Prince in a community theater version of the Nutcracker--this being both a fulfillment of his dreams (to be the Prince) and a backhanded compliment of the worst kind (community theater). A lifetime later, the adult Walter has made the decision to move back to the Midwest (to a fictional town in Wisconsin that is, oddly enough, close to where I live). Amongst the usual life-redefinitions that would accompany such a move, he is forced to reconstruct the year his brother died, face the decisions he made then, and figure out how to come out to his family. All of this is centered around the family's summer house in Lake Margaret. This is a complicated story told in a lot of layers. The main handful of characters are pretty well drawn, but there are a lot of significant characters that amount to little more than sketches, if not stereotypes. Overall, the story was well told, though there were scenes that felt like they went on too long. Stories that are explorations of very ordinary lives don't do much for me, but if that's what you like, this novel will probably work for you, even if you don't live in Southwestern Wisconsin."}, {"userName": "Leah", "userReviewDate": "Dec 13, 2007", "userURL": "http://www.goodreads.com/user/show/581687-leah", "userReview": "This was a tough read because of Hamilton's continued themes of loneliness, sexuality questions, identity, and finding your place in your adult life within your family and within your \"life plan,\" which are all important themes to wrestle with, but difficult for a good reason. Her character's voices are sometimes a bit too articulate and perfect, but the main character is convincing and intriguing. His dramatic nature and obsession with finding love and identity is compelling, but I don't think this book is going to rise on the list of literary classics. It is highly worth a read for some thought."}, {"userName": "Julia Grundling", "userReviewDate": "Apr 23, 2011", "userURL": "http://www.goodreads.com/user/show/3326351-julia-grundling", "userReview": "this is my third book by this author ... oh wow, she is definitely a firm favourite author now. 'a map of the world' was a 5 star book ..!!i thoroughly enjoyed this one. human emotions - she describes it so beautifully ... you totally go through the emotions with the character. *spoiler alert* the scene where he puts on the ballet clothes and what happens after that - his toes bleeding, his lover laughing at him - oh my word, it was gut-wrenching. i was so satisfied with the end. my husband brought me a cup of divine coffee when i had five pages left to read, so i was completely satisfied ..!! ;)"}, {"userName": "Lisa", "userReviewDate": "Jan 07, 2013", "userURL": "http://www.goodreads.com/user/show/1642339-lisa", "userReview": "I think Jane Hamilton is brilliant, but this book falls one step short. Had she written this novel from the point of view of her protagonist, I would have been engaged. I would have been dazzled. Every time she permits her Prince to speak, I love what I hear. The flat, neutral, midwestern tone of the omniscient narrator does him a disservice. If only this were the penultimate draft, and not the final product."}, {"userName": "C. Miles", "userReviewDate": "Mar 29, 2012", "userURL": "http://www.goodreads.com/user/show/5209616-c-miles", "userReview": "I was torn between 3 and 4 stars for this book. Jane Hamilton has an easy illustrative writing style that I really enjoyed. I found the story to be captivating at times, and slow and lacking momentum at others. Overall, I'd say this is a great book, both for the story and for the way the author makes the characters relate-able and aggravating in a beautiful way."}, {"userName": "Stacey B", "userReviewDate": "Nov 10, 2009", "userURL": "http://www.goodreads.com/user/show/1887131-stacey-b", "userReview": "Good story by Jane Hamilton. Very interesting main character, a boy with a love of ballet, two good friends, and a brother suffering from a terminal illness. I liked the way the story shifted from Walter's youth to present time, balancing then and now and eventually coming together to illustrate how Walter's past shaped his future."}, {"userName": "Robin", "userReviewDate": "May 22, 2009", "userURL": "http://www.goodreads.com/user/show/258668-robin", "userReview": "It certainly took everything I had to finish this book. It isd a story told in a gay man's voice about his life. He wanted to be a ballet dancer, but everything sort of ends when his older brother gets sick with cancer. His life goes on, but it never got me excited about it. I was rather disappointed with this story from Jane Hamilton."}, {"userName": "Margie", "userReviewDate": "Jul 21, 2008", "userURL": "http://www.goodreads.com/user/show/208489-margie", "userReview": "I like this book. While Jane Hamilton often makes me feel such an upwelling of despair and pathos that jumping off a bridge seems reasonable, this book could be considered \"Jane Hamilton Lite\". It addresses the same issues she covers in other books, but with a far lighter touch."}, {"userName": "Tammy Downing", "userReviewDate": "Jul 20, 2014", "userURL": "http://www.goodreads.com/user/show/20656716-tammy-downing", "userReview": "I really enjoy the way that Jane Hamilton weaves her stories. This one was even more interesting as part of it is set in Wisconsin where we both live. I liked the way she went back and forth from childhood to adulthood and back for the main character and his friends."}, {"userName": "Sarah", "userReviewDate": "Aug 18, 2008", "userURL": "http://www.goodreads.com/user/show/1420391-sarah", "userReview": "Gotta love Jane Hamilton! The main character couldn't be farther from my own, yet I became him as I read this. I was running out of the building in a tu-tu..."}, {"userName": "Arthur Van Erps", "userReviewDate": "Oct 17, 2017", "userURL": "http://www.goodreads.com/user/show/58955275-arthur-van-erps", "userReview": "“Hmmm” comes to mind when trying to explain and write out my feelings towards this book. I absolutely adore how Hamilton creates scenery and dialogue, or how an entire paragraph can suddenly turn into written art that begs the reader to earmark the page so that you can reminisce later. That being said, the story itself isn’t really all that interesting, it takes an excruciatingly long time for it to go somewhere and by the end i’m not really sure it went anywhere. Maybe that’s the point though, the pointlessness of it all. Who knows? (I don’t)."}, {"userName": "Alison Dawson", "userReviewDate": "Jun 06, 2018", "userURL": "http://www.goodreads.com/user/show/3350087-alison-dawson", "userReview": "This book was a little slow. However, I ended up completely loving it! I loved Walter’s character and his friendship with Susan. I also liked the way they portrayed the complex emotions of adolescence. Additionally, I have experienced a similar issue with a summer homes and I liked reading about it as I related a lot to what Walter went through related to. My own family summer house had a far different and sadder ending though. :("}, {"userName": "Karen Nelson", "userReviewDate": "Jul 24, 2017", "userURL": "http://www.goodreads.com/user/show/2376577-karen-nelson", "userReview": "I've read two of Hamilton's novels, and enjoyed them, prior to this one. I don't enjoy giving a poor rating to any novel, but I just did not enjoy this book. I did not enjoy 349 pages of waiting for death. I did not enjoy any of the characters, as none of them were likeable. I did not enjoy the writing, and found it to be excessively boring in details. I made myself finish reading it quickly once I passed the halfway mark, to put it behind me. It left me dissatisfied in every way."}, {"userName": "Jeff", "userReviewDate": "Oct 01, 2017", "userURL": "http://www.goodreads.com/user/show/1719430-jeff", "userReview": "By all accounts this coming of age story should have resonated with me. A gay man struggles with his sexuality, his competence as an artist and his place within his family following his brother's death from cancer. However, it lacks the emotional intensity and complexity of the other books by Jane Hamilton that I have read."}, {"userName": "Elaine Bowman", "userReviewDate": "Dec 03, 2017", "userURL": "http://www.goodreads.com/user/show/2150683-elaine-bowman", "userReview": "Reread this book about 20 years after first read. It’s great and I should reread her other work. A little too much ballet but that is my only criticism. Honest characters and nice juxtaposition of past and present."}, {"userName": "Jeanne Cummings", "userReviewDate": "Jun 06, 2017", "userURL": "http://www.goodreads.com/user/show/24459986-jeanne-cummings", "userReview": "One of my favorite books."}, {"userName": "Caroline", "userReviewDate": "Feb 27, 2017", "userURL": "http://www.goodreads.com/user/show/35676-caroline", "userReview": "Jane Hamilton - making the ordinary seem extraordinary. She absolutely nails human behavior and human emotion here."}, {"userName": "Rae", "userReviewDate": "Dec 07, 2016", "userURL": "http://www.goodreads.com/user/show/62238814-rae", "userReview": "TL;DR: A thoughtful, beautifully-written meander. Hamilton's characters are flawed and interesting. She has a magic way of making real life seem fantastical. This wasn't a quick read for me.This isn't the type of book I normally elect to read - it's not dripping with satire and dry wit; there's no magic or princesses or plot devices that save the characters just in time. Nothing really noteworthy happens, on a major scale, in the entire book. I read some reviews on here that felt this made the book boring and the characters unlikeable. As I was reading, though, Jane Hamilton kept me feeling. The phrase that kept coming to mind was \"real life but better\" - she has an uncanny way of taking those every day moments and thoughts and making them poetical. So maybe \"better\" isn't the right word, especially since her characters do go through quite a lot of suffering internal and external - romantic, then. She has a beautiful ability to make those every day moments and turning them into something romantic.The protagonist, Walter, is flawed in all the right ways. Yes, we are kept at an emotional distance from him through much of the book - still, I could relate to his internal thoughts. The difference between teenage Walter and his adult self in the alternating chapters, and the way the two blend into one towards the end of the book as he comes closer and more in touch with his emotions, is masterfully done.The negatives: This wasn't exactly a page turner. It took me about a month to finish, and there was a point in the book where I put it down for a week. Not because it wasn't good - but the slow pace of the story lends itself to slow reading. There was no urgency to find out what happens next. When I did sit down to read, Hamilton's writing filled me up like a good buffet. I marked so many quotes I loved in this book that it now looks like a rainbow attacked it.I will be picking up Jane Hamilton's other books at some point for sure, though not without a pinch of trepidation - other reviews on here have stated that \"The Short History of a Prince\" is her least melancholic and tragic of her novels, which has me concerned! Definitely not the kind of book I'd want to read for escapism, but it's nice to read something that makes you feel sorta sad and thoughtful once in a while."}, {"userName": "Mirrani", "userReviewDate": "Jul 23, 2013", "userURL": "http://www.goodreads.com/user/show/8952174-mirrani", "userReview": "While reading this book I felt a little as if the story had been tossed into a blender, spun around once or twice, then dumped back out again and glued to the cover. The story was good and interesting, but the jumping around was somewhat distracting in just a few places. I have no problems with a book that tells you someone's history in little chunks, in fact I find that kind of storytelling fascinating because it brings questions to mind about what happened in the past or how said past connects to the future, however when you add huge a flashback or memory to the mix, it changes the way the book reads.The characters were all written well and were true to themselves. There were certain people that you just wanted to punch in the face, there were certain people that you wished you could hug tightly while reminding them that everything would be okay, and there were people that you never really felt one way or the other about. All of those kinds of things are true to life and speak to the quality of care taken when creating and maintaining the characters involved. Walter's transition from being a gay teen-dancer dealing with the death of his older brother to being a gay adult learning to become a teacher in a rural setting is very well written and the relationships that he maintained through that time frame are also interesting to observe.Overall, I read the book because I was curious about what would happen in Walter's life, not because I found the writing to be groudbreaking or beautiful or a work of perfection. There were times when I simply wanted to hurry along and move on to other books, but I just couldn't give up on the characters. High praise must to be given for good writing in that regard."}, {"userName": "Janet Mahlum", "userReviewDate": "Sep 08, 2016", "userURL": "http://www.goodreads.com/user/show/34123082-janet-mahlum", "userReview": "This probably isn't really a 5-star book, more like a 4+-star. But I rounded it up to help offset negative ratings. It is a beautiful coming of age story. I listened to it on cassettes and it didn't take long to hear. The style of writing is lyrical, beautiful phrases and word pictures. Although there is a lot of tension in the story, there is an element of peacefulness about it, like a mother whispering, \"It's all right. Everything is going to be okay.\""}, {"userName": "Sarah Beth", "userReviewDate": "May 02, 2016", "userURL": "http://www.goodreads.com/user/show/52608880-sarah-beth", "userReview": "I slogged through this book for a book-club. The first challenge to completing the read is the fine-pointed, crowded, and pompous font, specifically chosen and explained in the back of the book, as well as the long chapters and paragraphs that made me think Jane Hamilton was actually anti-reader. The second is the dreariness of the main character and the limping plot line that develops slowly, if at all. It's essentially a coming-of-age story about Walter, a man who finally comes of age at middle age. There are certainly endearing and emotional aspects of Walter's life, friendships, and development; but after brief spots of empathy I returned to the feeling I was listening to someone's life story that I did not particularly care about. While the ending had definitive satisfaction, it was more the feeling of completing an airline meal: happy to no longer be hungry, but glad that you do not have to eat it once more."}, {"userName": "Sharon", "userReviewDate": "Jun 19, 2013", "userURL": "http://www.goodreads.com/user/show/10624031-sharon", "userReview": "The story of Walter, going back and forth between his teen years, when he is aspiring to be a ballet dancer but is really not very good, and the present, when he leaves his job selling dollhouse furniture in NYC to become an English teacher in small town Wisconsin. In the childhood winter he is cast in a crappy production of the Nutcracker in Rockford (while his friends star in the show in Chicago), his brother struggles through terminal illness and Walter has his first homosexual experience. The family summer home on a Wisconsin Lake finds it way into both decades, as does his friendship with Susan (one of the ballet stars). This book was OK, it moved along OK, the story was OK, but it isn’t something I would rush out to recommend to a friend. I have enjoyed other books by this author."}, {"userName": "Romerei Macarse", "userReviewDate": "Mar 21, 2014", "userURL": "http://www.goodreads.com/user/show/26823253-romerei-macarse", "userReview": "The book at first was a bit dragging. The first part made me yawn at times, but still I persisted. It was not until I'm in the middle part of the story that the narrative started to pound at my consciousness like a hammer. Wow, Walter's coming-of-age story is poignant and bittersweet that I can relate to his losses and gains. His teenage years were like everyone else's ---> full of dreams, disappointments, insecurities and yes, raging hormones. His uncultivated relationship with his diseased brother was like a ghost haunting him at the present. Much like of the relationships that we had in the past that had gone to waste and regretted that we didn't nurture them. The book didn't clearly indicated at the end that Walter will have a life with a happy ending, but it's a good thing that he has finally forgiven himself and decided to move on with life with a positive disposition."}, {"userName": "Pat", "userReviewDate": "Oct 24, 2014", "userURL": "http://www.goodreads.com/user/show/5166924-pat", "userReview": "I'm a huge fan of Hamilton's. She always puts her finger on the pulse of protagonists' hearts AND minds, while telling an engaging story.Poor Walter has lived his entire life in frustartion and in authenticity. He finally has to admit he is a failure as a dancer, his one youthful passion--besides the bisexual Mitch. Walter lives in the shadow of his sainted dead brother' 25 years after his death, Mitch feels the reprecussions. Mitch cna only exprerss his gay sexualtiy in furtive encounters, longing for a partnership that he is unable emotionally to sustain. Now, Mitch is about to embark on a failed career as a teacher. The heart of Mitch's world is still his dysfunctional family (as symbolized by the lake house and its impending loss), loathe though he is to admit it. Who can't relate to feelings like that?"}, {"userName": "Terri Tinkel", "userReviewDate": "Mar 30, 2013", "userURL": "http://www.goodreads.com/user/show/7323772-terri-tinkel", "userReview": "This was not my favorite Jane Hamilton novel. It's the writing that makes me say that. The sentences are so long and difficult to figure out the point of the writing. The story of a young man who wants nothing more than to be a danseur ( a male ballet dancer) such as Balanchine or Tchaikovsky or Baryshnikov and Nereyev realizes that his dreams will never come true. He never seems to fit in and he clings to a couple of friends to fill his life. Along with that disappointment is the awareness that his older brother is very ill. His life is told before and after his brother's illness. This book was depressing to me. The main character, Walter McCloud, never seems to find happiness except at the family summer home at Lake Margaret,Wisconsin. A home that is old and falling apart but holds all the family stories and has been there for generations."}, {"userName": "Sarah B.", "userReviewDate": "Apr 30, 2013", "userURL": "http://www.goodreads.com/user/show/360913-sarah-b", "userReview": "I love Jane Hamilton, and this novel is masterful. It was very easy to read, and even when my interest in the story drooped, I kept going because it was so lovely to read. Hamilton is just so good.Like other readers, I had trouble connecting with Walter, the main character. His story, about ambition without talent and surviving an adolescence in the shadow of his older brother's illness, was compelling enough, but Hamilton seemed to keep the reader at an emotional distance. Because Walter doesn't know himself well he must have been a difficult character to write, but other reviewers have pointed out that the tone of the book was so understated as to be flat. Too much restraint can leave the reader cold.In the end I felt this book was missing something. It was good to read, but not satisfying. Despite Hamilton's skill as an author, I would not recommend this one."}, {"userName": "Katie", "userReviewDate": "Sep 17, 2010", "userURL": "http://www.goodreads.com/user/show/278970-katie", "userReview": "for Sabrina... I definitely enjoyed this book, and can understand why my friend Sabrina loved it so much - the writing itself is very good. The storyline is interesting and is somehow delivered from a different angle than usual. What I loved most of all, though, was Sabrina's review of the book (below), and the fact that in some small way by reading the book I could share one last thing with her... \"There were lines that I read, re-read, underlined (in the library book), because I somehow wanted to share the words with someone, to remember them, to make them stick with me. I read this book like I was gorging on something that was delicious, but strangely good for me too. And it was funny.\""}], "description": "Walter McCloud was constantly eclipsed by those around him - his beautiful, talented friends, his flamboyant relatives, his golden-boy brother, Daniel. He was always the outsider, never the star. But the summer of 1972 was a turning point in the life of fifteen-year-old Walter. It was the time when he realized that his great passion for dance would never be matched by his talent; the time when he discovered the funny agony of first love' and the time when he watched his brother declining into a cruel, untimely death.It is only when, twenty-four years later, Walter returns to fight for the survival of his childhood Eden, his family's lakeside summer home, that he finally discovers a way to reconcile himself to the past in a way that gives hope for the future.", "title": "The Short History of a Prince", "url": "https://www.goodreads.com/book/show/12560.The_Short_History_of_a_Prince", "average": 3.64, "cover": "https://images.gr-assets.com/books/1327889835l/12560.jpg", "reviews": 136, "authors": [{"url": "https://www.goodreads.com/author/show/3526.Jane_Hamilton", "name": "Jane Hamilton"}], "type": ["Fiction", "Novels", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/12560.The_Short_History_of_a_Prince", "http://www.goodreads.com/book/show/772626.The_Short_History_of_a_Prince", "http://www.goodreads.com/book/show/5205.A_Map_of_the_World", "http://www.goodreads.com/book/show/5187.The_Book_of_Ruth", "http://www.goodreads.com/book/show/171221.Disobedience", "http://www.goodreads.com/book/show/26031214-the-excellent-lombards", "http://www.goodreads.com/book/show/12559.When_Madeline_Was_Young"]}