{"ratings": 1097, "userreviews": [{"userName": "Sandy  Kemp", "userReviewDate": "Jul 27, 2012", "userURL": "http://www.goodreads.com/user/show/7256231-sandy-kemp", "userReview": "Something about this author's main characters is a bit shallow and superficial. They seem to be obsessed with conspicuous consumption, yet rather judgmental about others who are similar (ordering M&Ms in colors to match the office, while criticizing in-laws who want a big blowout wedding, etc.). It was funny to read how the sister who was marrying wanted a \"small\" wedding, while planning a bachelorette party which included renting an entire spa, \"ridiculous\" hotel suite, and 2 limos.Jodi (the main character) seems quite immature for her age and sadly dependent on men, while she trumpets how man-savvy she is.I find it hard to connect with her characters, which is a shame, because the author is clearly a very smart girl, and I really want to like her books. I do like the Chicago setting.Overall - Disappointing, unfortunately"}, {"userName": "Susan Arra", "userReviewDate": "Jun 05, 2012", "userURL": "http://www.goodreads.com/user/show/7946365-susan-arra", "userReview": "I was disappointed in this book for several reasons - some have already been mentioned below. First of all, I have to say that just dropping restaurant and other place names does not provide setting. If I hadn't known many of the places mentioned I would have no feeling for the city of Chicago - it could have been just about anywhere. Next, the dialogue just didn't work - long pontifications don't feel real. And finally, I sure wish I liked protagonist Jodi better..."}, {"userName": "AngryGreyCat", "userReviewDate": "Jun 09, 2014", "userURL": "http://www.goodreads.com/user/show/13236257-angrygreycat", "userReview": "The story idea was interesting, what happens to sisters who have an entire self-help business devoted to spinsterhood, and one of them decides to get married. The aunt’s character’s were more interesting than the spinster sisters themselves. I found the dialogue awkward and unnatural and the main characters, Jodi and Jill, were just really not all that likable. They seemed shallow and always seemed to be looking down on others. This one just didn’t work for me. Also, they excerpts from their self help manuals were …irritating and overly long."}, {"userName": "Kelsey Boomer", "userReviewDate": "Nov 08, 2013", "userURL": "http://www.goodreads.com/user/show/22500669-kelsey-boomer", "userReview": "Loved the idea, loved the storyline, liked the protagonists... HATE the way the dialogue is written. I don't know anyone who speaks in conversation the way it is written in this book (too bad for me). The long, drawn out conversations about the ex-boyfriend and his crazy fiancé drove me crazy. Disappointing to say the least."}, {"userName": "Beakmorris", "userReviewDate": "Sep 01, 2014", "userURL": "http://www.goodreads.com/user/show/5160100-beakmorris", "userReview": "OMG will Never read anything by this author again! Sooo unrealistic it was like a big girls fantasy book with Rich men and romantic gestures and wonderful food ! It was just a big let down!"}, {"userName": "Wendy Stotts", "userReviewDate": "May 20, 2018", "userURL": "http://www.goodreads.com/user/show/16869387-wendy-stotts", "userReview": "The characters were shallow and vapid. I skimmed through it just to see how many times they would insult me. I am a WASP, I am a mother, and mother-in-law, and a grandmother. The description of the WASP future mother in law: \" She has a helmet of perfectly frosted hair, a slim figure, and the placid lack of expression that seems to come with BOTOX or Xanax or both\"...... \"Please do call me Grace,\" she says in a breathy, nasal voice that makes me wonder if the perfectly upturned button nose is original or a reproduction.\"  I am also a member of a country club and golf regularly. \"So what if you've always thought that golf was a white-elitist waste?\" Pick any ethnicity or religion, and paint a simplistic, totally stereotypical picture of them that matches this one, and the social justice warriors will run you out of town on a rail. But it's perfectly okay to do so for White Anglo-Saxon Protestants. They were equally condescending for religious people, conservatives, and people who value families. This while one of the characters was sleeping with three men at once. I do not think that our society has a whole has benefited from our move away from families and toward sexual abandon. I don't think it has freed women, I think it has just enslaved them in different ways. Children as well. I don't care if your family is headed by two women, two men, or a man a woman, I just ask that you at least try to form a stable family before having them, but she again dismisses \"family first\" people as being nuts. As you can probably tell by this rant, I am just tired of it. I am tired of condescending people who think they are tolerant writing absolutely intolerant garbage."}, {"userName": "Wendy", "userReviewDate": "Aug 02, 2017", "userURL": "http://www.goodreads.com/user/show/21389269-wendy", "userReview": "This wasn't well written and was predictable. Alight, fast read -- good for the summer or the beach. The fun part of the book was its setting in Chicago. Having moved from Chicago to NC, it was fun to read about restaurants, neighborhood and traditions from home."}, {"userName": "Jessica", "userReviewDate": "May 11, 2017", "userURL": "http://www.goodreads.com/user/show/7270887-jessica", "userReview": "So cute! Another win by Stacey Ballis. The only reason I'm giving this four stars instead of five is because I missed her trademark drool-inducing descriptions of food. But the characters were delightful, the girl power was awesome, and the story was full of advice and wisdom."}, {"userName": "Lissa", "userReviewDate": "Sep 23, 2013", "userURL": "http://www.goodreads.com/user/show/5786300-lissa", "userReview": "Reviewed by Lissa Staley Posted February 12, 2007Romance Contemporary What if you make being single your life's work? And what if you are wildly successful at it? Then in between broadcasting your weekly satellite radio talk show, writing your latest advice book and launching \"Spinster Sisters\" licensed merchandise in major retail outlets, you find yourself thinking about one particular guy? Since her divorce, Jodi Spingold has dated three or four different guys at a time, all while spending time socially with her trendy and highly regarded spinster aunts and working closely with her sister, Jill, on all aspects of their corporation, Spinster Inc. When Jill gets engaged to a wonderful man, the press jumps on the story and the sisters' many single fans turn bitter and disgruntled. The situation escalates when Jodi's ex-husband's horrid new fiancée begins threatening to plant negative publicity in the press unless they pay her off. But for all of her many worries, Jodi is most concerned about Connor, the intriguing man she met at the grocery store while trying to buy the last bag of mini-marshmallows for her Thanksgiving sweet potatoes. She's specifically concerned with whether he will call, whether he likes her as much as she likes him and whether she needs to stay single in order to keep the corporation viable and profitable. From inside the minds of dating advice experts, Stacey Ballis creates a network of supportive sisters from their elderly aunts to their fortunate coworkers and all of their adoring fans. Practical and pointed advice, excerpted from Jodi and Jill's advice books, starts each new chapter to contrast the changes in their lives with the reality of their business. Ballis addresses the dilemmas of empowered, independent women who are proud of their single status, but also looking hopefully toward settling down with someone special with grace and eloquence. She asks the hard questions, like what gives our popular relationship experts their credibility, and can THE SPINSTER SISTERS continue to expand their woman-centered corporate empire if they loose their spinster status?"}, {"userName": "Jenny", "userReviewDate": "Jan 31, 2017", "userURL": "http://www.goodreads.com/user/show/1332648-jenny", "userReview": "I thought this would be a funnier book, but instead it was quite predictable and blah. Jodi and Jill are sisters two years apart but as close as twin, even living in the same house above the apartment their two spinster aunts inhabit. Jodi is divorced and has two guys she's seeing part-time and Jill has just become engaged to Hunter (there should be a drinking game for every time Jodi notes how perfect Hunter is for Jill). Naturally, this book isn't just about Jodi's fear of alienating their supporters (called the Spinster Sisters) now that Jill is going to be married, but also about her new relationship with a guy named Connor as well (I did think that his picking her up in the food mart was cute).I gave up on the book for a couple reasons:1) I didn't really like Jodi... she has a 28-year-old boy toy that she isn't sleeping with and a 48-year-old Silver Fox who she is ... and then there is Connor to add to the mix. I'm 32, and maybe it's because I haven't lived through a divorce but I just couldn't take her seriously as a character. In fact, all the characters were very flat and stereotyped, in particular the aunts. 2) Speaking of Jodi, I didn't buy that a 34-year-old would go around saying \"bod\" in the same breath as the F-word (and there were many cases where the dialogue just didn't seem real, like Paige's rant against Jodi's ex's new girlfriend - it was too smart and long to be real.)3) the fact that everyone thought Jodi's lunch kit ideas were cute. I thought they seemed stupid and knick-knacky to me (she suggests they make a \"Spinster Sisters'\" lunch kit for listeners to enjoy using during their radio station lunch hour)Anyway, I thought Ballis would be funny and that a very vanilla book would be more enjoyable because of some laughs. I made it to page 102 and didn't laugh at all."}, {"userName": "Deborah", "userReviewDate": "Feb 15, 2017", "userURL": "http://www.goodreads.com/user/show/5558461-deborah", "userReview": "What bugged me from the start was the title., The Spinster Sisters. A spinster is a woman who has never been married. One sister had been divorced in this book. So the name is inaccurate from the start.Then I really disliked Jodi. She was a ninny and very passive aggressive. She didn't follow any of her own guidelines in dating and sat around waiting for the man to do all the work. The rest of the characters were okay, but she annoyed me."}, {"userName": "Michelle", "userReviewDate": "Feb 01, 2015", "userURL": "http://www.goodreads.com/user/show/25885157-michelle", "userReview": "Sisters Jill and Jodi were raised by their unmarried aunts. They're aunts are very inspirational to them (and great characters in the book). The girls grew up knowing that they could be strong, take care of themselves and find happiness in life whether they were single or not.Jodi got married right out of college and divorced shortly afterwards. Between this and her aunts, she has been inspired to write about the single life. Jodi and Jill soon build an empire on the concept of a full life as a happily single woman. They have books and a radio show. They're doing quite well for themselves and while they're not exactly saying that they encourage staying single, a lot of their fans (and critics) see that as the takeaway. They do call themselves the spinster sisters after all.The book begins with Jill's engagement.She's very happy about it but Jodi sees the chance that her sister getting married could screw to the whole message of spinster sisters. She's happy for Jodi, but scared for their business.It doesn't take long before the critics join in, some fans are upset, didn't Spinster Sisters tell them it was better to be single they ask.Critics call them hypocrites.And during this time, Jodi is juggling three different men and some drama from an ex.I liked the characters and the style of writing. I also thought the aunts were great. I think they were the best characters."}, {"userName": "Megan", "userReviewDate": "May 16, 2013", "userURL": "http://www.goodreads.com/user/show/11374806-megan", "userReview": "Meh. This is the best word I could come up with to describe what I thought about this book. Just meh. It wasn't horrible but it definitely wasn't great. It was just meh. A story about two sisters who run a conglomerate focused around empowering women to be true to themselves, the plot was predictable and fairly boring. The characters were likable enough, but pretty much a dime a dozen. Lots of use of the f-word, which made it stand out a little from other chick lit books. But I felt like maybe Ballis was over using profanity just for the shock factor because it didn't seem to fit in with the narrative. Every time one of the sisters said fuck I felt myself pulled out of the story and I am by no means a prissy type who never cusses. Fuck no. But it just seemed overdone. One of them even calls the other the c-word at one point (for some reason, I found myself unable to even type the real word. Weird, maybe I am a prissy type!). I checked out several of Ballis's novels from the library, this being the first of those that I have read, and am hoping the others are a tad more exciting."}, {"userName": "mandyfujita  ", "userReviewDate": "May 26, 2015", "userURL": "http://www.goodreads.com/user/show/6291801-mandyfujita", "userReview": "Jodi and Jill Spingold are the Spinster Sisters. In the past five years, their company has grown rapidly. They have a radio show once a week, they have speaking engagements, 2 best selling books with the 3rd on its way. Their main focus is the happiness and empowerment of women. Jodi is divorced, but Jill has just announced her engagement to Hunter. Hate mail and negative publicity ensue, and Jodi begins to worry that their empire will crash around them. Their two single aunts inspire them tremendously from the time they were little. Jodi and Jill's parents died in a car crash and from that point on Aunt Shirley and Aunt Ruth has been their foundation. It is an interesting story of the two sisters, Jill is devoted to her finance Hunter while Jodi dates like there is no tomorrow. Jodi doesn't limit herself to one man, since no one man seems to satisfy her requirements. Connor Duncan comes into the picture and Jodi begins to wonder if maybe he will be the one."}, {"userName": "Heather", "userReviewDate": "Nov 26, 2007", "userURL": "http://www.goodreads.com/user/show/270144-heather", "userReview": "I LOVED this book, aside from the cursing. Some authors/people think cursing gives a sentence special effect, but I personally believe that girls should NOT frequently uses curse words. This is not a gender bias type of thing - I don't thing men should use curse words either, but it sounds MUCH worse coming out of the mouth of women.As for the rest of the book - it's basically a chick flick in a book!!! And there's much more soul to the book then \"How to Lose a Guy in 10 days\" and \"Failure to Launch,\" etc. I love the way that Stacey Ballis writes and she has a way of portraying women to be so intelligent and successful, but yet keeping them down to earth so every reader, regardless of their personal status can SOMEHOW relate to the characters.This book also encouraged me to start traditions in my new family and with my girlfriends - the best piece of advice from the book - stop pressuring men about Valentine's Day. Instead, start a new tradition with your best friends or your mother or your sister - and enjoy the day together doing girly things."}, {"userName": "Melanie", "userReviewDate": "Jan 25, 2017", "userURL": "http://www.goodreads.com/user/show/220833-melanie", "userReview": "As I was reading this, I kept getting annoyed by the dialogue - there would be like a page and a half of articulate, well-thought-out speech for one character, then another would respond with a page and a half of the same. But the more I thought about it, the more I felt like maybe that was the way these characters talked (I'm pretty verbose myself sometimes) and that it's just hard to read in a book as dialogue. So I was torn on that part, whether it was unrealistic, or just didn't work pacing-wise. Either way, I liked the concept of the book - two sisters running a business focused on single women living their best lives, then one is getting married & the other has to reconcile with that and her own choices in life - and I liked a lot of the advice the sisters gave, even if it didn't always read beautifully. I didn't love the ending, but it was sort of inevitable. All in all a solid book, but not earth-shattering."}, {"userName": "Hilary Hoffman", "userReviewDate": "Oct 28, 2010", "userURL": "http://www.goodreads.com/user/show/4476066-hilary-hoffman", "userReview": "A great read!! Stacey Ballis has made it on to my favorite authors list! \"The Spinster Sisters\" is a book about 2 sisters, Jodi & Jill, and their relationship through the years. How it has changed and evolved all while the Spingold sisters are building a business together. The main plot driver being that one of the Spinster sisters gets engaged, thus no longer being a spinster...now what?! Ballis is a great story teller who shows the real side of being an independent woman. She sheds a light on the bullshit that women have to deal with in society today, mainly at the hands of other women, how they are quick to judge or criticize each other rather than supporting and encouraging one other. Quick wit and real life advice fill the pages of this creative story, making it a delightful quick read. True Chick lit to it's core, We're all Spinster Sisters!!"}, {"userName": "Suzanne", "userReviewDate": "May 10, 2012", "userURL": "http://www.goodreads.com/user/show/2045279-suzanne", "userReview": "I liked this book. About the time that I would get annoyed with the main character (long story short - if you aren't committed to a fella, don't expect him - or any of them, as was the case here - to be committed to you. I also found it hard to sympathize with the romantic loneliness of someone who had not one, not two, but three part-time boyfriends. Have an actual dry spell, and then you can share my ice cream. Also, actively choosing not to commit relinquishes your right to whine, \"What is it about me that makes men not want to shower me with undying devotion?\" That's easy - your unwillingness to do the same for them. /rant), one of the other characters would swoop in and save the day by saying to her EXACTLY what I was thinking. Also, I really like Stacey Ballis, and I find her hilarious."}, {"userName": "Just - The romance reader", "userReviewDate": "May 26, 2009", "userURL": "http://www.goodreads.com/user/show/2184659-just---the-romance-reader", "userReview": "An amusing novel about two sisters who share a bond stronger than any other, raised by two aunts with a bond just as strong. The characters are hilarious and at once thought provoking. I struggled, not wanting to put the book down so that I could actually have a productive day. I wanted to keep reading to find out what would happen next. Each chapter started off with a short except of previous advice given to others by the sisters, and although it was always relative to the chapter it was introducing, I didn't always love it. I wanted to just dive right into the chapter and skip over the preluding advice. All in all a good book, and left me wishing I had a sister or atleast two hilarious and wonderful aunts like Aunt Ruth and Auth Shirley."}, {"userName": "Karina", "userReviewDate": "Dec 29, 2007", "userURL": "http://www.goodreads.com/user/show/232835-karina", "userReview": "A thoroughly enjoyable novel about two sisters that are forced to reinvent themselves when love finally finds them.Picture this: two sisters, raised by two sisters, who become famous and wealthy as the \"Spinster Sisters.\" But when one of them gets engaged, the other is left dealing with personal and business angst...and has to learn to move past her divorce and self-doubt before she too can find a meaningful relationship.The pacing and writing is wonderful, the characters are endearing, and I found myself smiling while reading this on the subway. I highly recommend this to anyone who wants a feel-good book...or just a good story.And Stacey Ballis keeps getter better with every new book she writes."}, {"userName": "Wendie", "userReviewDate": "Oct 12, 2011", "userURL": "http://www.goodreads.com/user/show/1014981-wendie", "userReview": "Much better dialogue than \"Good Enough To Eat\"!!! I was shocked to realize that \"Good Enough\" is Stacey Ballis' newest novel; I would have bet money that \"The Spinster Sisters\" would be the newest, since it seems better written. I enjoyed the fact that each character had difficult decisions/situations to tackle & everything wasn't tied up in a tidy little bow throughout the book, but that situations weren't harped on with the maturity of a 7th grader, like they seemed to be in \"Good Enough.\" It's interesting that Stacey Ballis seems to be regressing with experience, rather than getting better (I liked \"Room for Improvement\" better, too). Perhaps she has a new editor....."}, {"userName": "Jan", "userReviewDate": "Mar 13, 2009", "userURL": "http://www.goodreads.com/user/show/598461-jan", "userReview": "I think every woman should have access to people like Jodi and Jill and their two colorful aunts to act as sounding boards, mentors, confessors and if you have a best friend who fills that role, you're golden! Over the years, I've heard so many young singles obsess about their dating life and receive erroneous advice that it's a shame these two aren't for real. Ballis did a wonderful job of creating characters endowing them with humor, warmth and wit. It's a quick uplifting read that goes too quickly."}, {"userName": "Joy", "userReviewDate": "Sep 01, 2010", "userURL": "http://www.goodreads.com/user/show/973139-joy", "userReview": "Stacey Ballis writes women's fiction with some of the most relatable characters. The female protagonists are funny, intelligent, independent, yet, flawed, but still likeable. Even when I disapprove of their decisions, I feel like I understand why they do what they do and I love that. The protagonists in both Spinster Sisters and Room for Improvement are women that I would love to know.Spinster Sisters is the 2nd of her novels I've read and I can't wait for her new novel to come out next week and will get a hold of her 2 earlier books."}, {"userName": "Kmcclanathan", "userReviewDate": "Mar 17, 2011", "userURL": "http://www.goodreads.com/user/show/1564743-kmcclanathan", "userReview": "Fun, flirty little book about two sisters, who were raised by spinsters, and developed personas based on being spinsters. What happens when one is no longer a spinster? When is too many men to juggle an issue? These are addressed. Some issues I would love to have. LOL. Great characters, although sometimes I found myself rooting for the men, it is NOT a man-hating book, but sometimes it could be construed that way."}, {"userName": "Kelly Olexa", "userReviewDate": "Jun 19, 2011", "userURL": "http://www.goodreads.com/user/show/3570157-kelly-olexa", "userReview": "I read this book a while back and just stumbled upon it again on Amazon, so I thought I'd share a review. This book was so charming, a cute story about two sisters that have a business essentially based on them both NOT being in a relationship. As things change and thus affect the business, it becomes humorous and then tense. I loved this book as it was \"heartwarming\" but not cliche, just an overall warm fuzzy book read."}, {"userName": "Pooch", "userReviewDate": "Jul 15, 2011", "userURL": "http://www.goodreads.com/user/show/1100910-pooch", "userReview": "This story began with engaging writing and a snappy premise regarding revisionist spinsterhood. The two sets of sisters are well characterized and developed. The promising beginning chapters give way to a soft, spongey center of repitition and wordiness that appear to pad the book. The predictable ending could be forgiven had the writing held up throughout the story.If you enjoy Lifetime movies, you'll like this book."}, {"userName": "Shelley", "userReviewDate": "Sep 23, 2010", "userURL": "http://www.goodreads.com/user/show/1389888-shelley", "userReview": "I absolutely love to be able to read a book that helps me feel like I am involved in the characters lives. I have to tell you, this one was so real at one point, I wanted to smack one of the characters. I have seen her kind in real life and do not appreciate them one single smidgen. See, I love that I can get involved when reading. Great job with all the characters. We all have these women in our lives."}, {"userName": "Lisa Tees", "userReviewDate": "Sep 13, 2013", "userURL": "http://www.goodreads.com/user/show/5026792-lisa-tees", "userReview": "A great way to kill a summer afternoon or two but I didn't love it. I came to this author who is mentioned in a series of memoirs written by Jen Lancaster. They are friends. I LOVE Ms. Lancaster's books so was maybe expecting more? If you like your chick lit with a bit more substance I highly recommend 'Bitter is the New Black'."}, {"userName": "Andrea", "userReviewDate": "Jan 19, 2012", "userURL": "http://www.goodreads.com/user/show/1726138-andrea", "userReview": "The characters used the F-word too often for my taste, but cursing aside, I really enjoyed the book. I appreciated what another reviewer said about the uninterrupted monologues -- I think some of those conversations/disagreements would have played out differently in real life -- but they did not affect my enjoyment of the book."}, {"userName": "Cecile Grudzinski", "userReviewDate": "Nov 29, 2014", "userURL": "http://www.goodreads.com/user/show/37281781-cecile-grudzinski", "userReview": "I truly enjoyed this book. The 4 main characters are delightful, each with their own quirky personality. It is witty and fun to read. Sometimes I wanted to reach out and give one of the characters a shake, but that was part of the endearment. The writing was very good, and I will look for other books by this author."}], "description": "Jodi and Jill Spingold are the Spinster Sisters. With a radio show, speaking engagements, DVDs, and two bestselling books, they've built a thriving cottage industry helping other single women find happiness. Their futures have never been brighter-until Jill turns out the lights on Jodi by announcing her engagement.  Jodi is stunned. How can they be the Spinster Sisters if one of them is married? Complicating things is her own love life, involving three vastly different paramours offering three different kinds of happiness-none of which Jodi is sure she wants. And her ex-husband, backed by his lawyer girlfriend, may be angling for a piece of the Spinster Sisters empire.  Now, Jodi must make some tough decisions, keep the business afloat, and get to the altar to stand by her sister-even if means that from now on she'll be single all by herself.", "title": "The Spinster Sisters", "url": "http://www.goodreads.com/book/show/82641.The_Spinster_Sisters", "average": 3.6, "cover": "https://images.gr-assets.com/books/1389409465l/82641.jpg", "reviews": 113, "authors": [{"url": "https://www.goodreads.com/author/show/47231.Stacey_Ballis", "name": "Stacey Ballis"}], "type": ["Womens Fiction", "Fiction", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/82641.The_Spinster_Sisters", "http://www.goodreads.com/book/show/10944310-the-spinster-sisters", "http://www.goodreads.com/book/show/8731635-the-spinster-sisters", "http://www.goodreads.com/book/show/8300253-good-enough-to-eat", "http://www.goodreads.com/book/show/13186433-off-the-menu", "http://www.goodreads.com/book/show/17166231-out-to-lunch", "http://www.goodreads.com/book/show/484024.Room_for_Improvement", "http://www.goodreads.com/book/show/22571603-recipe-for-disaster", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}