{"ratings": 726, "userreviews": [{"userName": "Julie", "userReviewDate": "Mar 06, 2009", "userURL": "http://www.goodreads.com/user/show/589617-julie", "userReview": "The other day I was listening to Lucinda Williams, and when I heard \"Car Wheels on a Gravel Road\" I thought immediately of this book (\"little bit o' dirt, mixed with tears\"). The protagonist seemed entirely real to me--the very picture of unhinged, devastating Southern poverty and ignorance. I'm Southern myself, and I have gritted my teeth in irritation at the stereotyping and the complete-missing-of-the-boat in literary and dramatic depictions of slices of Southern life. (I could not make it through \"Steel Magnolias.\" So awful.) This story felt dead on to me."}, {"userName": "Allison Herman", "userReviewDate": "Dec 29, 2008", "userURL": "http://www.goodreads.com/user/show/674263-allison-herman", "userReview": "Sherri Reynolds is one of my favorite authors and she did not disappoint with this story. Kendra, also known as Kenny, lives with her father's girlfriend while he serves time in prison for trafficking. She is getting close to being 18 and is worried about where she'll go after she hits the landmark birthday. Kenny is also getting worried about her sexuality, seeing her father in prison, watching her almost-brother get lost in a new relationship. The story just flows so well and her writing is incredible. Read anything by her - you won't be disappointed!"}, {"userName": "Jill", "userReviewDate": "Mar 02, 2010", "userURL": "http://www.goodreads.com/user/show/689506-jill", "userReview": "My book selection process usually goes a little something like this: I read a review, add the book to my wish list, buy the book several months later, and then read the book months after that. So when I first started reading The Sweet In-Between, I was trying to remember what it was about that long-ago review that made me want to read this strange little book. Now that I've finished it, I still don't remember, and frankly, I don't really care. Whatever it was, I'm grateful for it, because as strange as The Sweet In-Between is at times, it's also one little gem of a novel.What I really liked about this book was that the \"main event\" in the plot, while significant, was merely a touchstone for a series of smaller -- but no less important -- events, all of which revolved around the main character, Kenny. I loved the honesty with which she navigated through these often painful experiences -- it made her all the more sympathetic and, well, real. And that's another thing: I don't know of many authors who tackle the theme of gender identity, but I doubt I will find another who can handle the topic with more skill and grace than Reynolds.Do not be deceived by its short length and seemingly common coming-of-age umbrella: like Kenny, there is definitely more to The Sweet In-Between than meets the eye."}, {"userName": "Laren", "userReviewDate": "May 20, 2009", "userURL": "http://www.goodreads.com/user/show/93749-laren", "userReview": "This is a coming-of-age story about a \"gender-confused\" girl whose mother has died, and she lives with her dad's girlfriend since her dad was sent to prison for drug dealing. She also is concerned that she will be thrown out once the foster-care money stops coming when she turns 18. The story starts the night their neighbor shoots an intruder who turned out to be a college student on spring break who meant to be entering a nearby vacation home when she trespassed the neighbor's home. Our protagonist becomes obsessed with this incident, and her story, past and present is interwoven with her processing the death of someone so near her own age. The story does capture well the mind of a teenager trapped in isolation, ignorance and poverty when that's all that is around her. The story doesn't relate gender confusion well though, as the tale is more about the character finding comfort with her own sexuality than having a true gender identity disorder as advertised.As with many COA stories, this one doesn't resolve nicely - it just ends when the main character begins to look towards her future with hope and confidence instead of despair (is that really when people \"come of age\"?). I felt I sort-of understood the main character, but the rest of the many characters remained enigmas to me."}, {"userName": "Ally Armistead", "userReviewDate": "Jun 02, 2011", "userURL": "http://www.goodreads.com/user/show/159633-ally-armistead", "userReview": "I picked up \"The Sweet In-Between\" on a whim, in the library, after reading the first page and finding myself caught up in the pithy, vulnerable voice of Kendra. Abandoned by her imprisoned father, confused by her sexual identity, and living with a woman she calls \"Aunt Glo\" but who isn't her blood relative, Kendra had me from the get-go. However, as the novel progresses, the story (which had such promise) begins to fall apart. Part of this has to do with a distracting and irrelevant subplot about a manslaughter that occurs in her neighbor's apartment, and part of this has to do with the novel not tying up the central issues of identity that it set out to explore. As a reader, I had wanted Kendra to discover and embrace her sexuality; I had wanted her to find family in Aunt Glo; I had wanted her to accept herself. However, instead, the novel seems to taper off, diminishing into vignette and subtlety that is far too vaporous for this reader.Had Reynolds pursued what she set out to do in the first few pages, \"The Sweet In-Between\" would have been much improved. Still, I'd recommend this book to all novelists in-progress, if only to discover how unsatisfying (for a reader) it is to walk right up to the edge of something without ever taking the plunge."}, {"userName": "Jeanne", "userReviewDate": "Sep 08, 2008", "userURL": "http://www.goodreads.com/user/show/388385-jeanne", "userReview": "Kendra AKA Kenny is going through a difficult period in her life. Like most characters in Reynolds's novels, she is dirt poor and living in the South. Her father is in jail, her mother is dead, and she is currently living with her father's girlfriend, Aunt Glo. And did I tell you that Kenny binds her breasts and dresses like a boy? That, by the way, is the most intriguing part of Kenny, and Reynolds waits a good, long time to explain the origins of this behavior. No matter, as it was definitely worth the time and the journey with Kenny.This is yet another amazing (and sad) Southern novel from the awesome Sheri Reynolds. She just never disappoints me!"}, {"userName": "Emily Thrasher", "userReviewDate": "Dec 24, 2012", "userURL": "http://www.goodreads.com/user/show/15739781-emily-thrasher", "userReview": "The back of the book says that it this book is a tender... A sweet coming of age story. I don't think they could be more wrong. This story like Sheri's other titles weaves a complex web between the characters and their inner struggles. Sheri's writing has a knack of touching a reader's deep, dark secrets thoughts. Most of her books shine light into the confusing, and potentially dangerous world of sex."}, {"userName": "Barbara", "userReviewDate": "Jan 24, 2015", "userURL": "http://www.goodreads.com/user/show/1635182-barbara", "userReview": "I gobbled up this coming of age story of Kenny (Kendra) who is struggling with her gender identity while working hard to belong to her Incarcerated father's girlfriend \"Aunt\" Glo's little family. The book opens with an accidental killing in the adjoining duplex and Kenny's reactions to this event. All of the characters rang true with their quirks and flaws as well as redeeming qualities. Humorous too."}, {"userName": "SJ", "userReviewDate": "Feb 26, 2017", "userURL": "http://www.goodreads.com/user/show/62701918-sj", "userReview": "Excellent reading. Not the central theme, but a tender, realistic view of how a family or a parent can be dysfunctional and permanently imperfect but still loving and lovable. Many difficult subjects here--LGBTQ/trans teen issues, co-dependency, parent in prison, foster care, sexual pressure, dealing with violent death (although this starts the story, it is not really about the death). Sensitively done, and Reynolds doesn't get bogged down with trying to fix everyone in the story."}, {"userName": "Lisa", "userReviewDate": "Oct 09, 2017", "userURL": "http://www.goodreads.com/user/show/316640-lisa", "userReview": "Realistic, dark portrayal of a family living in poverty with a father incarcerated, an aunt addicted to drugs, a child with learning challenges, and the realities of what happens when you are desperate to make some money."}, {"userName": "Ian Wood", "userReviewDate": "Aug 10, 2013", "userURL": "http://www.goodreads.com/user/show/19929095-ian-wood", "userReview": "This is the complete review as it appears on my blog. Any links which may be in the blog review are not reproduced here.NOTE: SPOILERS!Here's another example of what you get when you put your fine novel into the hands of a publisher: the girl in the cover illustration doesn't even remotely represent the character in the novel. Quite the contrary; the girl on the cover is an open insult to the main character, and I can't honestly believe that the illustrator even read the novel to come up with crap like that. This is why I self-publish!I highly recommend this novel.Kendra Elaine Lugo, universally known as Kenny, is almost eighteen. She lives in a sea-side town in a run-down home, which isn't, strictly, her home. Her mother is dead and her father is in prison. She lives with her \"aunt\" who isn't related to her, and so she also lives in constant fear that she's going to be thrown out the minute she turns eighteen. She's mildly sexually abused by her older non-brother Tim-Tim in the way kids sexually explore one another, but in general, very broadly speaking her life isn't too bad considering everything.Unfortunately, Kenny is one of the most intriguing, scary, endearing, frightened, desperate, lovable characters I've ever encountered in a novel and she has more neuroses than a medical dictionary. When a girl is killed next door, in the adjoining home of a old guy who is potentially a pedophile, Kenny takes a morbid interest. Jarvis killed Clara Tinsley with a shotgun blast when she climbed into his house with her friend Rhonda, both of whom mistakenly thought this was their rented beach property where they were vacationing. They had been given the wrong address, and couldn't find the key. It was late at night so they went in through the window.Kenny often behaves as though she's much younger than her 17 years. She has flights of fearful fancy about her life and her future. She obsesses on dead Clara, frequently imagining bits of her wounded body lying hidden in crevices in Jarvis's house, or imagining her as a friend, still alive. She obsesses on Clara's friend Rhonda, and on Clara's red car. Kenny obsesses on her own body and on her breasts, and on her period. She wears cycling shorts and several layers of underwear and presses her small breasts down even smaller by wearing a cut-off pair of pantyhose upside down, with a hole cut in the crotch for her head. She decided to make herself appear as boyish as possible to dissuade Tim-Tim from hitting on her.Kenny is industrious and inventive, and imaginative and quirky as hell. She has way more fears and fantasies than any ordinary girl ought, which makes her extraordinary in my book (and in Reynolds's book, too!). I love the way she thinks and the way her thoughts run on disjointed and simultaneously oddly congruous. I love how inventive she is and how her mind works, and work it does - overtime, too! She's refreshing and brilliant and well worth getting to know, which is why it's so saddening to see how undervalued she is.Kenny starts cleaning out and redecorating the crappy garden shed in Aunt Flo's back yard because she thinks she will have to move out there or be homeless when she turns eighteen. Okay, I confess: I adore Kenny. But I think Kenny is gay, so my adoration is as far as this can go! Even at the end of the novel I still had no take on Kenny in this regard, and that's fine, because she doesn't want to be pinned down and she deserves to be free, but I have to confess I had hoped for a bit more than I got the more I read this.Having said that, I did get wa-ay more than I hoped for in this novel before I began it, and that's why it was one of the very few novels I've read since I started my blog that I was willing to class as a 'WORTHY!' even before finishing it. That's because it's so brilliantly done that I didn't care if the ending sucked: it's worth reading anyway. And the ending didn't suck. I loved Kenny, I loved the way this was written. I loved the stops and starts and spurts and stream of consciousness writing. I urge you to read this and I am looking for other Sheri Reynolds novels. Well, not as we speak, but you know what I mean! Very WORTHY indeed."}, {"userName": "Jen Hydrick", "userReviewDate": "Jan 08, 2013", "userURL": "http://www.goodreads.com/user/show/79170-jen-hydrick", "userReview": "I appreciated a lot about this story: the narrator's voice, quasi stream of consciousness and subtly Southern; and how the seemingly ambling pace revealed character development and plot in a very nonchalant, everyday-working-class way. I also really liked having a fully dimensional gender variant (and possibly queer) character front and center in a YA novel. (That's Kenny, y'all.) My complaints are that it felt like the author lost control of the story's unfolding at the three-quarters mark, and ended it by awkwardly wrapping up plot lines and putting a bow on Kenny's head. Worse, though, is that she threw in an explanatory sexual abuse backstory in a paragraph or two, and in doing this implied that this was the character's root--or reason--for being transgender*/gender variant. Which I am wholly dissatisfied (and kind of upset about) for two reasons: she does not at all address the impact this sexual abuse would have had on Kenny (relationship with foster brother, complications with coming of age and burgeoning sexuality). And second, \"explaining\" Kenny's otherwise ambiguous and natural gender variance this way is utterly unnecessary, and undermines the otherwise solid job she does of creating a whole, complicated and likeable main character who is also trans*. She spends a lot of time showing us Kenny's struggles with the very real friction between internally felt/known gender, gender expression, and the expectations their family and community places on them based on their birth sex. We don't need this two-second backstory in the first place, and she doesn't adequately address it in the second. So, read it if you like YA lit, Southern settings, genderqueer and trans* representations in media, good depictions of white working class Southern life, slightly dark narrators with unique voice. Just... bear in mind what I said about that root bullshit. I'd love to know what you think."}, {"userName": "Julie Failla Earhart", "userReviewDate": "Dec 01, 2008", "userURL": "http://www.goodreads.com/user/show/1277299-julie-failla-earhart", "userReview": "Seventeen-year-old Kendra “Kenny” Lugo is the protagonist in Sheri Reynolds’ The Sweet In-Between. Her mother died from cancer when was a kid, and father is doing time for selling and taking drugs. Kenny lives with “Aunt Glo,” a former (before Mom) and current lover of her father’s, Aunt Glo’s two sons and granddaughter, seven-year-old Daphne.  Kenny’s problem is much larger than her living situation. She is petrified of what will happen to her when she turns eighteen. Will Aunt Glo kick her out? Will she be able to finish high school (she got a year behind)?  Her other, much more serious, problem is her gender identity. She knows she’s a girl but dresses, including binding her voluptuous breasts, and acts like a boy. She is much happier taking shop than home economics.  When the man who lives in the other side of the duplex accidentally shoots and kills a young woman, Kenny obsesses about the woman’s life and why she had to die. The young woman, Clara, becomes a fixture in Kenny’s life, even when she thinks she’s past it. And as Kenny obsesses about Clara, she obsesses about what will happen to ultimately happen to her and if her life matters at all. Kenny does everything she can to be helpful to Aunt Glo so she won’t be let go on her next birthday. Kenny makes contingency plans by cleaning out the barn-like workshop and fixing it up to she would have a place to live.  Kenny is a man trapped in a woman’s body. She enjoys guy things, like laying linoleum. She doesn’t appear to be attracted to other women, but it’s hard to determine. Reynolds does a good job in keeping the focus of the story on Kenny, but in the end, The Sweet In-Between has no umph. \tOriginally appeared on www.armchairinterviews.com"}, {"userName": "Rebecca Chapman Dann", "userReviewDate": "Aug 04, 2013", "userURL": "http://www.goodreads.com/user/show/7995015-rebecca-chapman-dann", "userReview": "I like Reynolds style of easy dialog, fast moving plot lines, and great complex characters. Here we have a book about a sexually confused teen, Kendra/Kenny trying to decide who to be in a turbulent family of misfits in which she doesn't even belong. “Aunt” Glo is actually her father's girlfriend and dad is in prison for drug trafficking. Kenny adores Glo's small granddaughter Daphne and in actuality is the responsible caregiver to the developmentally challenged little girl. In the home also lives Glo's sons Quincy and Tim-Tim. There is never enough money or good food, Tim-tim is a thief and Glo remains stoned much of the time. Interspersed with chapters of Kenny maneuvering the halls of high school trying to find a place to just “be,” and to be real, the reader (or at least I did) remains on edge while she tries to keep her family together and functioning. They live in a duplex and on the other side is a lecherous drunk who shoots and kills a teenage girl who mistakenly enters his house thinking it is one she rented. So throw in all the trauma of that mess and what a great tale Reynolds tells. Kenny's coming of age tale is so poignant and also shocking at times. Reynolds did a good job making the reader see how the minds work of those who traverse a world that we or at least I have no experience with. It is hard to read about a young girl being sexually assaulted and then having her take it in stride and not think it is the end of her world. It is hard for readers like me to read about people living in subcultures where that is not uncommon and not perceived as being that bad."}, {"userName": "Patty", "userReviewDate": "Jun 10, 2016", "userURL": "http://www.goodreads.com/user/show/1020899-patty", "userReview": "When Sheri Reynolds' novel The Rapture of Canaan was picked by Oprah in 1997, Richmond, VA was all agog. Who knew that Oprah would pick a book written by a professor who taught in Richmond? That book is wonderful and I enjoyed every page. The characters seemed to be people you might meet down here in the South. I then picked up her first novel Bitterroot Landing and I thought that was good also.Then Oprah, Richmond and I moved on and started reading other novels by other good writers. I have to admit that I forgot all about Sheri Reynolds. Recently a friend asked me about her and I had to admit I didn't know anything about her more recent books. I decided that I should find one and see what Reynolds has been up to. From the first page I wanted to know more about Kendra, the narrator. She has had a hard life, but she is trying hard to figure out how to live it. Sometimes she figures out the right answers and sometimes she doesn't but throughout the novel her voice is clear and strong. I am glad to have met Kendra (Kenny) and also to have reconnected with Reynolds. I will have catch up with the rest of her novels.If you are like me and have forgotten most of those \"Oprah authors\", I recommend you find Reynolds and reacquaint yourself. I may go looking for some of the others."}, {"userName": "Louise", "userReviewDate": "Mar 20, 2009", "userURL": "http://www.goodreads.com/user/show/2143983-louise", "userReview": "As usual, another fabulous story by Reynolds!From dust jacket:\"Kendra, or \"Kenny\", has grown up in a family that's not really hers. Her momma died of cancer when Kenny was very young, and \"Aunt\" Glo is, in fact, her daddy's girlfriend, who took her in when her father was sent to jail for drug trafficking.Nearing eighteen years old and facing confusion over her sexuality, Kenny binds her chest with ACE bandages and keeps her hair cropped short like a boy's. Her gender ambiguity makes her an outcast at school and, even at times, at home, where her adopted family isn't really sure what to make of her.When a senseless murder occurs in their run-down coastal town - a college student mistakenly entering the wrong home is killed - Kenny becomes obsessed with thoughts of the dead girl and with her own fears that she will be alone in the world when she turns eighteen. She makes it her mission to become indispensable to Aunt Glo in the hopes that she can win the older woman's love, despite their not being bound by blood.A lyrical tale of a family of misfits in a town that's seen its best days come and go, THE SWEET IN-BETWEEN is also a poignant story of an unforgettable character's coming-of-age.\""}, {"userName": "Erika", "userReviewDate": "Feb 08, 2010", "userURL": "http://www.goodreads.com/user/show/2241240-erika", "userReview": "This was not a cheerful book to read. It tells the story of Kenny, a teenage girl who lives with her Aunt Glo (who's not really her aunt, but her dad's girlfriend) because her dad is in prison for drug trafficking and her mom died of breast cancer when she was a little girl. She was abused by her almost-brother (Aunt Glo's son), and that made her chop off her hair and bandage her breasts to look like a boy. She dresses in baggy clothes as if denying her gender will protect her from more pain.Although life with this disfunctional family isn't perfect, Kenny fears that she will lose them and have to leave when she turns eighteen and the government checks stop coming.And to make her misery even worse, a girl is accidentaly shot next door and Kenny becomes obsessed by thoughts of the murdered girl.Oh, and did I tell you that the kids bully her at school?There is not a single thing on Kenny's life that looks good, but despite the misery of Kenny's life we know, somehow, that she will be ok."}, {"userName": "Jenn", "userReviewDate": "Feb 20, 2016", "userURL": "http://www.goodreads.com/user/show/7068819-jenn", "userReview": "The Sweet In-Between is a book about a girl named Kendra who goes by Kenny. She binds herself up, cuts her hair short, and dresses like a boy. Even after reading the entire book, I am still not sure why. It may be because she has gender identity issues or it may be because she hates being a girl that people can, and possibly have, abused. The story is an interesting snapshot of her life. It takes place over a brief period of time and several things happen to her. It begins with an accidental killing next door and how she copes with that, but then moves on to 'normal' life for this particular girl. The author doesn't give you any backstory for some time and it feels like you are going down the path of her life, but in a way like skipping from stone to stone across a brook. However, as the backstory is filled in, I felt like I was on more solid ground. Although, I never felt like I really knew her very well, even though the story is hers. This is why I give it three stars. I would have liked to have gotten to know Kenny better so I could understand her."}, {"userName": "Juliette", "userReviewDate": "Mar 24, 2010", "userURL": "http://www.goodreads.com/user/show/834802-juliette", "userReview": "I have been really hesitant to read anything else by Sheri Reynolds, because she wrote one of my very favorite books of the last few years,  The Firefly Cloak . I was worried that nothing else that she wrote could even compare to that lusciously beautiful book. While this book comes no where close to  The Firefly Cloak , her writing talent and ability to craft a vivid location and solid characters is still evident. What's missing? The fact that nothing really happens in this book. I almost quit reading it a few times, but feel okay about the fact that I finished it. This book is about a teenage girl (Kendra or 'Kenny') with some gender and sexuality issues, who lives with her dad's ex-girlfriend. Her dad is in prison, her next door neighbor shot an intruder, and she is deeply concerned about what will happen to her when she turns 18. Interesting set up, but then again, those details are all in the set up, and really, nothing actually transpires. Overall, Kenny is a likable character, but this book is just so-so. I'll be returning it to the library asap."}, {"userName": "Debra Parks", "userReviewDate": "Aug 04, 2011", "userURL": "http://www.goodreads.com/user/show/5110505-debra-parks", "userReview": "Sheri Reynolds graduated from my Alma mater, so I feel an affinity for her simply due to that. In all honesty, though, she creates characters beyond the mainstream and poignantly brings them to life to face situations beyond the norm of mainline fiction. Other books by Sheri Reynolds include Bitterroot Landing and Rapture of Cannon which I also highly recommend.In this novel we meet Kendra \"Kenny\" Lugo, a young woman on the brink of adulthood, but with a childhood fraught with challenging circumstances, and an adolescence filled with confusion. I fell in love with Kenny as she struggled to make sense of who she was, who she is, and who she will be, all set in a frame of an accidental murder by her drunken neighbor. Reynolds shows us that there is function in dysfunction; it is the focus that makes the difference."}, {"userName": "Janice", "userReviewDate": "Jul 04, 2009", "userURL": "http://www.goodreads.com/user/show/1428024-janice", "userReview": "Although this is my least favorite of the Sheri Reynolds books I have read, it is still an engaging story. Kenny (Kendra) is an adolescent girl, struggling with sexual identity, living in a “family” that barely makes it, financially, emotionally, socially, most of the time. A deceased mother and incarcerated father has left Kenny in the care of her Dad's girl friend, Glo, a woman who has her own children and gradnchildren to attend to, as well as Kenny. Glo is kind of a broken mother hen, she wants to support and love all her brood, but has her own emotional pains and traumas that sometimes interfer. Desptie all the brokenness in each of their lives, this family is united, they have a bond that yearns toward protecting and loving each other. There are caring adults that give Kenny a belief in the future, and although there is no epiphany the book ends on a hopeful note."}, {"userName": "Megan", "userReviewDate": "Jul 07, 2010", "userURL": "http://www.goodreads.com/user/show/419390-megan", "userReview": "I think this is actually shelved in fiction, not YA - but it fits in both. I loved this book - it's heart-wrenching, and also totally beautiful and touching (like these moments where Kenny's aunt Glo says things like \"If Kenny is a lesbian, she is OUR lesbian\" and tells the prison guards not to give Kenny \"a complex\" about her gender presentation when they visit Kenny's dad). It also captures some of the ruminating misery of adolescence where there do not seem to be other options...like if you are Kenny and the camera your teacher lent you disappears or maybe was stolen because you left it out - the horror of it all is so big that you can't go to school and face the teacher or explain - the only thing to do is drop out of school and find a job to pay for a new one. and also continue to wonder why all these things seem to happen to you and not anyone else..."}, {"userName": "Tracey", "userReviewDate": "Jan 26, 2012", "userURL": "http://www.goodreads.com/user/show/418708-tracey", "userReview": "Adult fiction; coming-of-age/gender confusion/modern day South. This one starts out sort of like Boys Don't Cry (the other students' actions towards Kenny are horrifying) and you think, there's no way I can read through a scene like that if that's where this is heading, but then it morphs into a cheery, hopeful world where Kenny's family and friends all accept her as she is--even her step-brother Tim-Tim seems to have transformed and seems to support her rather than pestering her for \"sex practice\" (ok, even if he's still a jerk, at least THAT much has stopped). True, these are difficult issues to write about, especially if you want to evoke hope, but I feel like it could've been handled in a more realistic way."}, {"userName": "Carrie", "userReviewDate": "Apr 28, 2009", "userURL": "http://www.goodreads.com/user/show/1995579-carrie", "userReview": "This site is called good reads. I debated even putting this on here. NOT a good read. I grabbed it off the library shelf knowing zip about it. I wish that is where it would have remained for the next sucker instead of me. I finished it today, and am not sure how or why I made it to the end. This author has a strange mind, and I need to go wash mine out with soap after reading her weirdness! I am just putting this on here as a warning, if you see it on YOUR library shelf, move on by!p.s. I am giving it one star instead of none because afterall, I did read the whole thing. UGH!I think I actually finished the book because I like Sheri's writing style, but not what she actually writes, if that makes sense...!"}, {"userName": "Levi Amichai", "userReviewDate": "Nov 27, 2010", "userURL": "http://www.goodreads.com/user/show/640561-levi-amichai", "userReview": "More lit than I expected, and not at all young adult. I shouldn't have listened to the front cover, or the back cover, or the blurb, or the other reviews---Kenny's gender identity is still nebulous, but definitely somewhere on the transmasculine spectrum. Despite all the icky wrappings, Kenny's experiences and identity are very respectfully handled in the actual story. As people become more knowledgeable about trans issues, I've been hoping for a new wave of complicated literary stories about people's complicated literary gender identities, and this is a great contribution to that budding genre.Unfortunately, I was hoping for a bit more of a plot. It's ~lit~ though; what can you expect."}, {"userName": "Adele Stratton", "userReviewDate": "Jun 18, 2009", "userURL": "http://www.goodreads.com/user/show/1202084-adele-stratton", "userReview": "A novel by the author of The Rapture of Canaan, it was the story of a hard-luck 17-year-old girl named Kendra and all the fears and ambivalence she encountered being raised by a stepmother, “Aunt Glo”, in a hard-luck southern family of “yours, mine and ours.” (Her mother had died of breast cancer, and her father was in jail, due to the consequences of a drug problem that was in large part due to his reaction to the death of her mother.) Although “Kenny’s” story and experience includes poverty, murder, incest and a mentally challenged sibling, as well as all the contradictions and imperfections of her parents, unbelievably this is a wise and tender story, and we know that despite the many and unfair challenges in her young life, Kendra is most likely gonna be just fine."}, {"userName": "Kim", "userReviewDate": "Jan 07, 2009", "userURL": "http://www.goodreads.com/user/show/1356066-kim", "userReview": "Sheri Reynolds is a good author; however, I wasn't overly impressed with this story. The main character just seems a little over-the-top to me. I get all of the abuse the girl goes through and understand her responsive actions, but they seemed flat, not fully developed. Her great worry about what happens when she turns 18 is solved with a tiny scene that doesn't seem to fit with the characters, and her history with her father was very easy to figure out. I never felt connected to any of the characters, and the whole sub-story about the \"dead girl\" really wasn't carried through well at all. I do like the author's style of writing, but this book was too tiny to do all the author wanted."}, {"userName": "Kendra", "userReviewDate": "Jan 19, 2009", "userURL": "http://www.goodreads.com/user/show/436583-kendra", "userReview": "Go figure that the very first time I see my name used for a main character in a book, she has gender identity disorder and prefers to go by Kenny -- a nickname that I spent my whole childhood avoiding. Anyway, this is a short, quick read, and Kenny is a sad, sweet character. She spends her time obsessing about a dead girl, trying to avoid attention from men, and endearing herself to \"Aunt Glo,\" her father's girlfriend (who took her in after her father was sent to prison), so that she won't end up on the streets as soon as she turns 18. It's an ok story, but probably not one I'll remember for long."}, {"userName": "Mike Tarasovic", "userReviewDate": "Dec 29, 2010", "userURL": "http://www.goodreads.com/user/show/4691634-mike-tarasovic", "userReview": "If I'd read a review of this it would have reeked of \"chick lit\" and I'm pretty sure the author has had other work featured in Oprah's book club, which would likewise normally be a turn-off for me. But I attended a reading at the Virginia Festival of Books that Reynolds was at and heard her read from this and decided I'd check it out. I was not at all disappointed, as it was a really good read that totally inhabited the mind of the main character (it helped that I had Reynolds' voice in my head the whole time I was reading)."}, {"userName": "Lindsey Deitz", "userReviewDate": "May 20, 2016", "userURL": "http://www.goodreads.com/user/show/3137282-lindsey-deitz", "userReview": "Sheri Reynolds....your writing is so strange and in lots of ways so wrong but you are one of my favorite authors. Having read practically all of Sheri Reynolds books this was my most favorite. The strange part is that this is the most \"unread\" book of Sheri Reynolds. I love all the main characters in her books because they are so real and think things I've thought that I thought no one else did. I can perfectly see all the characters in my mind as if I were there. Ok Sheri, I've read all of your books.... Keep em coming!!!"}], "description": "With her father in prison, her mother dead, and her eighteenth birthday on the horizon, Kenny Lugo is desperate to belong to someone, something -- anything. Her last best chance is her father's girlfriend, Aunt Glo, who has given Kenny a place to stay in her small home. But Glo is struggling herself. Addicted to painkillers and raising her runaway daughter's baby in addition to her own children, Glo's less-than-idyllic family is hardly the situation Kenny has longed for, but certainly better than the streets. The murder of a college girl next door sends Kenny reeling. Already at loose ends, she becomes obsessed with the death of this young woman. And as Kenny searches for some element of truth in this girl's tragic death, she finally finds the meaning and redemption that has long escaped her own life -- and from a most surprising source.", "title": "The Sweet In-Between", "url": "https://www.goodreads.com/book/show/5043829-the-sweet-in-between", "average": 3.34, "cover": "https://images.gr-assets.com/books/1348057519l/5043829.jpg", "reviews": 121, "authors": [{"url": "https://www.goodreads.com/author/show/3520.Sheri_Reynolds", "name": "Sheri Reynolds"}], "type": ["Fiction", "Lgbt", "Young Adult", "Lgbt", "Adult Fiction"], "outlinks": ["http://www.goodreads.com/book/show/5043829-the-sweet-in-between", "http://www.goodreads.com/book/show/3067573-the-sweet-in-between", "http://www.goodreads.com/book/show/6347327-the-sweet-in-between", "http://www.goodreads.com/book/show/5180.The_Rapture_of_Canaan", "http://www.goodreads.com/book/show/94564.A_Gracious_Plenty", "http://www.goodreads.com/book/show/70115.Firefly_Cloak", "http://www.goodreads.com/book/show/318494.Bitterroot_Landing", "http://www.goodreads.com/book/show/14596142-the-homespun-wisdom-of-myrtle-t-cribb"]}