{"ratings": 934, "userreviews": [{"userName": "James Smith", "userReviewDate": "Aug 22, 2015", "userURL": "http://www.goodreads.com/user/show/4103398-james-smith", "userReview": "Reading Gopnik is a bit like reading David Foster Wallace: makes me both aspire (\"I want to write like that!\") and despair (\"I could never write like that!\"). Don't be fooled: this is a philosophy book--a smart, meaty [sic!] meditation on politics, meaning, and the good life."}, {"userName": "Dan", "userReviewDate": "Nov 16, 2011", "userURL": "http://www.goodreads.com/user/show/827985-dan", "userReview": "Adam Gopnik is my favorite current writer of nonfiction. He's brilliant and often funny. He loves his family, France, and food. Though not overtly political, he has liberal sensibilities. He has a wide range of interests in sync with my own, including urbanism, sports, classic novels, and music from Bach to the Stones. And he has interesting insights into aspects of daily life that most of us take for granted. So there are always some great nuggets in anything he writes, but this book is a disappointment. For starters, he takes far too intellectual and abstract an approach to earthy subjects; there are too many food critics here and not enough cooks and eaters. The structure of the book is bizarre: each section begins with a tangent to \"the table\" and ends with an e-mail to Elizabeth Pennell, a 19th century food writer (I get the idea - it's a way to comment on how radically cooking & dining have changed - but it comes off as strained). And way too many of the paragraphs have the same structure: opening abstract statement (usually about appetite or desire), some USA Today-style pop psychosociology (\"We\" want this or that), and closing bons mots based on more abstractions. If I'd ordered this book in a restaurant, I'd have sent it back to the kitchen."}, {"userName": "Sara", "userReviewDate": "Mar 30, 2012", "userURL": "http://www.goodreads.com/user/show/6460479-sara", "userReview": "okay, you tell me...\"As museums cross, or so Updike tells us, with the mystique of women, restaurants cross in memory with the optimism of childhood, with birthdays, promises, quiet, and the guilty desires of childhood, too: special treatment, special favours. The Cardinal who never arrives, who sweeps you up into his carriage saying, 'Child, you please me,' becomes the Maitre d' who says, 'Ah, sir, we're so glad to see you!'(page 17)Come on, that is ridiculous writing. If you make an obscure reference, please let people know WTF you're talking about. Museums cross with the mystique of women do they? How, please tell me? And who is this cardinal you keep referring to, who never arrives but also sweeps me off my feet? What if I've never read Updike; it would help to know which book you're referencing and maybe the context.Or how about something Gopnik refers to as the dirty-sounding \"familiar wet progression'(p. 26): \"We would be have been struck, for one thing, by how odd their drinking habits were, with sweet wines offered throughout the meal - sherries and ports. The familiar wet progression - starting with champagne, and then a bottle of white wine, on to red wine, then liqueurs and brandies, ending with a sweet wine - is a late invention, and largely English.\" How odd, indeed! I know, I never go to a restaurant without having a wet progression. Those 18th century barbarians didn't start with champagne!I've only just started the book, but I have been moved by Gopnik's pompous, bourgeois writing to post my first-ever review. Anyway, if you like this sort of thing, the book is full of it, so please enjoy."}, {"userName": "Linda", "userReviewDate": "Nov 24, 2011", "userURL": "http://www.goodreads.com/user/show/1292442-linda", "userReview": "I loved Adam Gopnik's Paris to the Moon and so was delighted to see that the library has another book by the same author. Culinary, French, what could be better? I'm finding myself skimming, skipping much of the book; however, some parts are interesting. I'll reserve judgement.Okay ... I should just erase the above. As I picked up the book a second time, I knew I needed to start anew and read with a fresher and keener eye; in doing so I realized the full circle the author had come from beginning to end. Mr. Gopnik takes the reader on a tour of the history of food and food styles, changes along the way, the importance in society of sitting down to the table, the memories that are created in doing so. Along the way he creates a second story of sorts in his imaginary emails to English writer Elizabeth Pennell - they share a love of cuisine; the author also uses the emails to ultimately share a universal truth that seems not in keeping with the story but which ties into the beginning and end of the book. In all, The Table Comes First is a wonderful and interesting whirlwind into the wide world of food."}, {"userName": "Todd", "userReviewDate": "Jan 19, 2012", "userURL": "http://www.goodreads.com/user/show/7324906-todd", "userReview": "Among the most self-indulgent, over-intellectualized works I've ever encountered--and I actually enjoyed law school. Given my enjoyment of Mr. Gopnik's other work, I am a little surprised to have been so annoyed by this one. However, after suffering through dozens of pages on \"taste\" as characterized by Hume, Rousseau, Veblen, Becker and others, I suppose I shouldn't. That said, the sparkle and wit so common to his writing occasionally shines through--in his \"correspondence\" with Elizabeth Pennell and the chapter \"In Vino Veritas,\" for example. Gopnik is unquestionably passionate about food and has thought deeply and carefully about the subject. However, the book seems far too overwrought to me, its efforts to elevate the everyday a stretch. De gustibus non est disputandum . . . indeed."}, {"userName": "Deb (Readerbuzz) Nance", "userReviewDate": "Sep 02, 2012", "userURL": "http://www.goodreads.com/user/show/1654645-deb-readerbuzz-nance", "userReview": "“In cooking you begin with the ache and end with the object, where in most of the life of the appetites---courtship, marriage---you start with the object and end with the ache.”Do you see why I love Adam Gopnik? He can take the simplest of activities---like cooking, for example---and he can find great wisdom there. Half the time I don’t understand what he’s talking about as I’m reading along; it’s only later, when I’m looking over his words again, that his thoughts become clear to me.Here’s another example of Gopnik’s wisdom that often goes over my head in a first reading, truth that is wiser than simple information about cooking and eating: “It seems to me that the real spirit of localism---the thing most worth taking from it---is the joke: the playful idea of the pleasure of adventure, the idea, at the heart of most aesthetic pleasures, that by narrowing down, closing up, the area of our inquiry, we can broaden out and open up the possibilities of our pleasures.”And not only does he find deep wisdom in simple activity, but he shares his ruminations with a cleverness that few essayists display:“Yes, of course, everybody’s recipe is someone else’s recipe, with the exception of those few rare new things that someone really did invent….But there is a recipe that has, so to speak, through suffering become yours, unlike those that you have simply copied out of a book. We recognize the concept of sweat equity in recipe writing: if you have labored nightly over a stove in a restaurant kitchen cooking the thing, then you can write it down, even if its origins lie ultimately not in your own mind but in someone else’s cooking.”“The good food of twenty-five years ago always looks unhealthy; the good food of fifty years ago always looks unappetizing; and the good food of a hundred years ago always looks inedible.”“On the other hand, or in the other fork….”And beneath his wisdom and his cleverness, Gopnik shares little tidbits of the craft that help us all:Gopnik suggests that everything is better by adding a little saffron and cinnamon or bacon and anchovies. He also shares the surprising truth that good cooks either go very hot or surprisingly cold. They have time."}, {"userName": "Maureen M", "userReviewDate": "Sep 11, 2011", "userURL": "http://www.goodreads.com/user/show/944992-maureen-m", "userReview": "Here's my review for the Star Tribune newspaper:For his last meal on earth, Adam Gopnik would have roast chicken with lemon and an apricot souffle for dessert. Or maybe beef with béarnaise sauce, with chocolate pot-au-crème for dessert.Questions of food consume Gopnik in “The Table Comes First: Family, France and the Meaning of Food,” an exploration of eating from the earliest restaurant in pre-Revolutionary Paris to what we find at our dinner tables now. Gopnik travels from the United States to Europe, from the past to the cutting edge, posing the question: Why do we eat what we eat?The book has the outline of a meal — starters through dessert — and the unevenness of a progressive dinner. Some stops are delightful. Others disappoint.Gopnik is at his best when he’s out exploring, and is at his weakest when he’s giving history lectures.This book lacks the charm of “Paris to the Moon,” Gopnik’s 1990s collection of essays for the New Yorker when he was a new father introducing his little boy to Paris. But he recaptures that spirit in places.It’s there when he introduces us to the death-row inmate contemplating his favorite meals. It’s there when he introduces Elizabeth Pennell, a Victorian-era food critic with un-Victorian attitudes toward food and sex. He is so taken with this “Nigella Lawson of the age of Whistler” that he strikes up an imaginary correspondence, dropping e-mails to Pennell between chapters like palate cleansers. It’s there when his son, now a teenager, makes a cameo appearance. Father, son and daughter forage Central Park in search of edible greens in an entertaining test of the eat-local movement. Gopnik’s long experience with France and fine dining yields some fine observations. He sees the provocation in the word “Le Fooding,” concocted to poke French cuisine off its pedestal and back into the culinary game. He taps Minnesota’s own Thorstein Veblen, a 19th-century economist, to explain food trends. In places, you feel as if you’re sitting across the table from an amusing friend recounting his adventures. In others, you feel like the outsider at a dinner party where the conversation drones on about people and places you don’t know. Then comes dessert, and all is well again. Like the “techno-emotional” dessert wizards he visits in Spain, Gopnik saves his best for last: “What is it that we want from eating? Comfort? Absolutely. A symbol of love shared? For sure. … We can have our cake and eat it, too, if we are willing to see that the point of having cake is to eat it and accept that then it will be gone.”"}, {"userName": "Vuk Trifkovic", "userReviewDate": "Oct 31, 2011", "userURL": "http://www.goodreads.com/user/show/4530266-vuk-trifkovic", "userReview": "Mixed feelings about this book. For a start, I felt starved for propert writing about writing about the food. We're all deluged with cook-books, culinary supplements, restaurant reviews, but there is very little writing about this trend. So, who better to do it but Adam Gopnik, essayist supreme of New Yorker fame.Indeed, he does a very good job, but perhaps he's little bit too good. The essays are great, but feel bit winding and not in 'this is where my mind takes me' and more along the lines of 'what was I saying again'. There are some very clever ploys too, like the progression of topics from the start of the restaurant meal to desert or imaginary correspondence with Elizabeth Purnell. However, there are slippages and missteps. After a while, the email series gets bit laboured and topics bit jumbled. \"Fooding\" movement for instance, makes two rather disjointed appearances even though it's quiet obvious that neither the author really finds there is much to it, nor they seem to be capable of keeping reader's attention.Having said all that, Gopink's writing is wonderful, UK edition hardcover is a wonderful object and there's precious little writing of this caliber out there. It's just frustrating that the author did not go the extra mile in this one, even though he's patiently capable of it."}, {"userName": "Elizabeth Theiss", "userReviewDate": "Jul 30, 2013", "userURL": "http://www.goodreads.com/user/show/7958239-elizabeth-theiss", "userReview": "Keeping company with Adam Gopnik is reminiscent of conversation at a long French dinner party where food, philosophy and life are woven into a deeply enjoyable tapestry. At the end, we sigh and move on with our lives and the happy memory of an evening well-spent. Gopnik's essays touch on some of my favorite topics--wine and Parkerism, the history of restaurants, the ethics of locavorism, food as art and the art of cooking. I can't say I always agree with him, but I invariably appreciate the ideas he brings to the table. Let's talk about wine for a minute. I cannot agree that wine quality is entirely a matter of individual taste. If you've tasted a first-growth Bordeaux or an excellent burgundy, it is hard to believe that you could then assert that a California zip code wine is somehow equivalent. Yes, descriptive adjectives help wine drinkers to distinguish subtle flavors, and the setting in which wine is served influences our opinions of it. Yet, a good wine is distinctive in the pleasure it provides and very different from a bad wine, which is likely to make an entire table wince."}, {"userName": "Michele", "userReviewDate": "Dec 19, 2011", "userURL": "http://www.goodreads.com/user/show/1155122-michele", "userReview": "Adam Gopnik reads like MFK Fisher, minus heart, charm, or lovely turns of phrase.While some of his writing did have humor, I could almost hear the New Yorker guffaws after punch lines. Overall, his style didn't appeal to me. Neither did sentences like this one:\"I notice that, in your essay on the perfect dinner, you dish-drop pommes soufflées.\"*insert pompous guffaw*I thought the current movement in food has been about making food more accessible, but with this book, Adam Gopnik does nothing to further that cause."}, {"userName": "Sharlene", "userReviewDate": "Jan 10, 2012", "userURL": "http://www.goodreads.com/user/show/388772-sharlene", "userReview": "This wasn’t what I was expecting.What was I expecting?, you might ask. A sort of history, evaluation of the current state of the culinary world, the progress it has made, from home-cooked to fine dining. It was, and it wasn’t.It took me three weeks to read this book. And that involved a LOT of skimming. Because while Gopnik is full of passion about food and eating (mostly French/French-styled food), he enjoys a too long philosophical ramble, one which leaves more questions than answers, and sometimes it’s all a bit too preachy like he’s glaring at us from his high culinary pulpit especially when he’s going on about the meat-vs-veg debate (nevertheless to say, I skimmed that chapter).I hesitate to recommend The Table Comes First to anyone, even if you are a foodie. I mean, I love to eat and read about food and all that, but how I struggled with this book. It was not a fun read, it wasn’t all that insightful either. It was too Franco-centric, largely ignoring most of the non-western world. It is obvious that his target audience are those who have already eaten at Momofuku and El Bulli and all those ‘top’ restaurants.However, if I hadn’t read it, I would not have come across to Elizabeth Pennell, whose 1900 book The Feasts of Autolycus, the Diary of a Greedy Woman (available as an ebook here) begins:“Gluttony is ranked among the deadly sins; it should be honoured among the cardinal virtues.”Gopnik decides to start ‘emailing’ Elizabeth Pennell, which is a little silly, but at other times, entertaining as he details his attempts in the kitchen.And even more so for that great bibliography at the end because with the exception of the Steinberger book, I have not heard of any of them. And these definitely sound more up my alley."}, {"userName": "Charles", "userReviewDate": "Apr 04, 2012", "userURL": "http://www.goodreads.com/user/show/39942-charles", "userReview": "Following a truly brilliant introduction (\"A Small Starter: Questions of Food\"), the rest was almost unreadable. I tried very hard to finish this book, but eventually conceded that it was too much work, since, overall, what I was learning seemed to have little practical value to me. But for whom would this read as entertainment? Wandering prose, elitist foodie references, and writing that seems far too enamored of itself. Buried within the minutiae are some very intriguing insights about the meaning of food in our culture, but it was too easy to lose sight of that. Gopnik is in need of a good editor. (Maybe one day, when I am more advanced in my knowledge of obscure food lore, and thus able to parse his references without finding them so distracting, I will give this one another try.)"}, {"userName": "Zvi", "userReviewDate": "Feb 04, 2013", "userURL": "http://www.goodreads.com/user/show/1125226-zvi", "userReview": "[Overdrive eBook] Fascinating essays on many aspects of food -- including explorations of the origin of the restaurant and cookbooks, a discussion of the current reigning culinary trends, a dialog with a food writer of the late 19th century that Gopnik feels close to, and other amusing bits -- even some recipes. Gopnik overwrites, but forgivably; his essays are such clever triumphs of philosophical wordplay that even when the balloon is full of nothing but hot air, we can admire the precision of the animal shapes that he twists them into. I read a library copy and will pick up my own copy to keep -- if only for the recipes and philosophy of cooking he espouses."}, {"userName": "Kristen", "userReviewDate": "Dec 09, 2011", "userURL": "http://www.goodreads.com/user/show/6493562-kristen", "userReview": "I listened to this on audiobook, read by the author. Gopnik's clear passion for the subject and his enthusiastic storytelling made it perhaps more enjoyable than it might have been to read.The history, stories, and anecdotes he provides are all entertaining and informative, and Gopnik's style funny and approachable, but the structure of the book was a bit distracting. Toward the beginning Gopnik states that in the current world of foodies, food writers, locavores, etc., the focus of the meal has become the food itself, not the joys of the table; the company, the conversation, the progression of the courses, etc. We nod our heads in agreement and expect him to then expound on this, showing us the error of our ways and how we should return our attention to the whole of the meal.However, what follows is a collection of rambling essays on the history of the restaurant, the history of recipe books, the state of contemporary chefs and so forth, all seen through Gopnik's Francophile eyes. These are punctuated by emails to a deceased food writer, which he uses as a device to tell his personal histories related to food and to relay his own favorite recipes or cooking tips.While I enjoyed the book from beginning to end, it seemed to me a bit disjointed and scattered. Almost as if the author were trying to cram too much in and lost his train of thought in the process. ADD: Currently half way through Gopnik's Paris to the Moon, which I quite like. I feel I may have gone at \"Table\" with the wrong expectations, not having been familiar with his work, but having read umpteen food writers. Perhaps I was expecting it to be more of a comprehensive, persuasive essay than a series of stories."}, {"userName": "Christine", "userReviewDate": "Apr 16, 2012", "userURL": "http://www.goodreads.com/user/show/6127488-christine", "userReview": "I remember enjoying \"From Paris to the Moon\" when I read it several years ago. I wish I could say his writing style stayed the same. The best thing about this book is the introduction. No kidding. The rest was full of overwrought phrases, references that were so tedious that I didn't even bother to look them up, and so much pretentious, page-filling tripe that I skipped about 30% of this book, just to get to the good historical and sociological parts. If you're not a confident person, this book will make you feel like a dolt. To me, it was just a load of crap. This could have been a great subject, had someone with an accessible writing style, a la Bill Bryson, had tackled it. Gopnik should just stick to the New Yorker and spare us all the glitterati literati junk. I would give this 2 stars just for the intro and good historical content, but it left such a bad taste in my mouth, that 1 star was all I could muster."}, {"userName": "Barbara", "userReviewDate": "Jun 13, 2016", "userURL": "http://www.goodreads.com/user/show/1687461-barbara", "userReview": "This is one of those where I would give in between a 3 and 4 stars if you know goodreads had in-between ratings. They don't. Not as good as his other two. So I'm going to have to go with three. He does have a good sense of history and gives us a good background to issues regarding food. And I learned enough. And he still writes well, giving us good and out there analogies. However, and this is a big however, too much about french food and restaurants. Which I know kind of the point of food. But, still. And I really think that some of the new food fads are too out there. And fussy. I think I wanted a more friendly food criticism and memoir. And again, too, too much French stuff. Which okay is in the title. But, sometimes I am reading too many French stuff at once. Which is not his problem. But."}, {"userName": "Jodi", "userReviewDate": "Oct 13, 2012", "userURL": "http://www.goodreads.com/user/show/667420-jodi", "userReview": "Initially I was really taken aback by the tone of this book and kept asking myself, \"who is this guy?\". The pompous, elitist tone was a real turnoff. I put it down for a long time and picked it back up again and while I still found the tone annoying and the story not told in any sort of cohesive way, the second half of the book was more interesting. He discussed the locavore movement both tongue in cheek but also as someone who tried to make it work and talked about whether it makes as much economic sense as it is supposed to. He name drops a lot which probably means a lot if you have a lot of money and can eat in these really posh restaurants or you just study food gossip. But even he knows the foam movement has gone a little too far. While there were some gems, it was mostly tedious and didn't feel like it made its point."}, {"userName": "Mario", "userReviewDate": "May 21, 2012", "userURL": "http://www.goodreads.com/user/show/552625-mario", "userReview": "I don't often offer up comments on books but I'll make an exception. 97% of this book was utterly useless; My experience was probably even more frustrating because the I listened to the audiobook and the author spoke in as pompous a manner as his style of writing. This was complete with him pronouncing any French names, places or dishes with a French accent. Now, I bet his French is probably better than mine, but his accent is not. I couldn't believe how many terrible mistakes he made. I found myself shouting at the recording to correct him. AG, \"Le Bernadeen\" me, \"Le BernadIIIIN\" it's nasal, douche. \"AG, \"Guy Savooy\" (Like oy vey) me \"Guy Savoir, like Savoir Faire espece de con!\""}, {"userName": "Margaret Sankey", "userReviewDate": "May 16, 2015", "userURL": "http://www.goodreads.com/user/show/5861086-margaret-sankey", "userReview": "From an essayist I already liked, this is very good food history, showing how what we eat is deeply entwined with politics (the French Revolution and its view of austerity, pleasure and authenticity), cycles of class driving fashion (with a Veblen analysis of Whole Foods) and taste (strong spice is favored until middle class people can afford it, whereupon the best taste is subtle and spicy is for savages, and then the opposite), ethics of meat eating, the lush works of Elizabeth Pennell (Diary of a Greedy Woman!), mouth taste and morals taste and how it all boils (or braises/fries/bakes/steams/etc.) down to salt, sugar, umami and starch--and alcohol and caffeine."}, {"userName": "Robyn", "userReviewDate": "Jan 08, 2017", "userURL": "http://www.goodreads.com/user/show/9172680-robyn", "userReview": "A nice meaty meditation. As usual with Gopnik, I highlighted a bunch of quotes:\"Dinner with water is dinner for prisoners\"\"That the double presence of coffee and wine is necessary to \"force\" the restaurant, as the seeded underbrush is necessary to force the trees, is made plain when you see what happens in places--Ireland and England--where you drink your drink in one place and take your coffee in another: it's a recipe for alcoholism, bad coffee, and a weak restaurant culture.\"\"We can have our cake and eat it too, if we are willing to see that the point of having cake is to eat it and accept that then it will be gone.\""}, {"userName": "Jason McKinney", "userReviewDate": "Mar 06, 2012", "userURL": "http://www.goodreads.com/user/show/985843-jason-mckinney", "userReview": "Don't get me wrong; I think Gopnik is a fantastic writer. I highly enjoyed From Paris to the Moon and Through the Children's Gate. This was a lot less readable. I NEVER skip parts of books and I found myself flipping through entire sections of this. I felt that the main problem was that he takes too much of a \"worm's eye view\" at looking at his subjects. He analyzes them so much that you soon reach exhaustion about the topic. I would recommend this for diehard Gopnik fans ONLY...even then, you'll still be doing a lot of skimming."}, {"userName": "Tom Spann", "userReviewDate": "Jun 20, 2013", "userURL": "http://www.goodreads.com/user/show/5960631-tom-spann", "userReview": "I read many of the reviews before starting the audio book. Many reviews gave it low marks, but I still wanted to read it so I pressed on. I stuck with the book losing my way occasionally. in the maze of his over-embellished writing style. I enjoyed hearing Gopnik read his work, however I began to tire of him and his writing. Nearly halfway through I called it quits. I don't question his authority and expertise on the Paris food scene, I just got tired of him proving it over and over in oh so many eloquent ways."}, {"userName": "Dana", "userReviewDate": "Jun 01, 2015", "userURL": "http://www.goodreads.com/user/show/1293613-dana", "userReview": "I wanted to really like this book in its entirety, but I couldn't. There were sections, whole chapters, that I underlined and geeked out on and reveled in. And then I would hit a dry spell, over-wrought and hard to trudge through. But I'm glad I read this little micro history of our cultural love for (obsession with?) food. It is smart (so smart) and informative, and Gopnik's imagined emails to Elizabeth Pennell were like lovely little snacks along the way."}, {"userName": "Beverly Hollandbeck", "userReviewDate": "Aug 30, 2014", "userURL": "http://www.goodreads.com/user/show/19094894-beverly-hollandbeck", "userReview": "I should have read the blurb a little more carefully. I was expecting a history of cooking - a la Michael Pollan - but this was a philosophy of cooking. I almost put it down in the first chapter since there were so many French words - people, restaurants, dishes - about which he seemed to imply I should know the translation. (Again, the title should have alerted me!) But I finished it. Some chapters were OK."}, {"userName": "Susan", "userReviewDate": "Dec 21, 2011", "userURL": "http://www.goodreads.com/user/show/4533144-susan", "userReview": "I think I tried to read this at the wrong time. I was super busy, as are many people at this time of the year, so I never got a chance to sit down and devote my full attention to the book. I think I would have enjoyed it if I had. The author had many interesting things to say about food, observations that were new to me and made me think, but it wasn't a book you could dip into when you had a stray 15 minutes.Just bad timing I guess."}, {"userName": "Becky Rogers", "userReviewDate": "Dec 23, 2012", "userURL": "http://www.goodreads.com/user/show/12133209-becky-rogers", "userReview": "I'm finding this book very dry & boring. Putting it down for now, but maybe I'll try it again some other time. Some of the reviews are really good! It's just not a great book to curl up w/ on a cold winter day."}, {"userName": "Lily", "userReviewDate": "Aug 07, 2012", "userURL": "http://www.goodreads.com/user/show/5609410-lily", "userReview": "PRETENTIOUS with a capital P. Adam Gopnik is so pleased with himself. I enjoyed this for the first few chapters, but by the end I was pretty done. I guess food writing, or rather food writing about writing about food about writing, (way too abstract and theoretical Adam) is not my thing. Next!"}, {"userName": "Seth", "userReviewDate": "Mar 08, 2012", "userURL": "http://www.goodreads.com/user/show/77407-seth", "userReview": "I've generally enjoyed Gopnik's articles. And his story at the Moth (http://www.youtube.com/watch?v=vc-oxQ...) was one of my very favorites.This book was . . . a surprise. It was repetitive and gimmicky with little in the way of redeeming value (information, humor, insight, etc.)."}, {"userName": "Denise", "userReviewDate": "Dec 25, 2011", "userURL": "http://www.goodreads.com/user/show/3396653-denise", "userReview": "Sadly, this book is not nearly as enjoyable as other books by Gopnik. The emails to one of the early cookbook writers are the times when Gopnik shines with his usual wit and style - the rest is fairly dry. I may pick it up at another time to just read the good bits."}, {"userName": "Susan", "userReviewDate": "Dec 31, 2011", "userURL": "http://www.goodreads.com/user/show/2308001-susan", "userReview": "Way over my head - his erudition and complex writing style made this an impossible read. Some interesting tidbits tucked in.."}], "description": "Transplanted Canadian, New Yorker writer and author of Paris to the Moon, Gopnik is publishing this major new work of narrative non-fiction alongside his 2011 Massey Lecture. An illuminating, beguiling tour of the morals and manners of our present food manias, in search of eating's deeper truths, asking \"Where do we go from here?\"Never before have so many North Americans cared so much about food. But much of our attention to it tends towards grim calculation (what protein is best? how much?); social preening (\"I can always score the last reservation at xxxxx\"); or graphic machismo (\"watch me eat this now\"). Gopnik shows we are not the first food fetishists but we are losing sight of a timeless truth, \"the table comes first\": what goes on around the table matters as much to life as what we put on the table: families come together (or break apart) over the table, conversations across the simplest or grandest board can change the world, pain and romance unfold around it—all this is more essential to our lives than the provenance of any zucchini or the road it travelled to reach us. Whatever dilemmas we may face as omnivores, how not what we eat ultimately defines our society.Gathering people and places drawn from a quarter century's reporting in North America and France, The Table Comes First marks the beginning a new conversation about the way we eat now.", "title": "The Table Comes First: Family, France, and the Meaning of Food", "url": "https://www.goodreads.com/book/show/10529697-the-table-comes-first", "average": 3.34, "cover": "https://images.gr-assets.com/books/1333576524l/10529697.jpg", "reviews": 175, "authors": [{"url": "https://www.goodreads.com/author/show/4747.Adam_Gopnik", "name": "Adam Gopnik"}], "type": ["Food and Drink", "Nonfiction", "Cultural", "Writing", "Travel"], "outlinks": ["http://www.goodreads.com/book/show/10529697-the-table-comes-first", "http://www.goodreads.com/book/show/10529698-the-table-comes-first", "http://www.goodreads.com/book/show/13005682-the-table-comes-first", "http://www.goodreads.com/book/show/13126463-the-table-comes-first", "http://www.goodreads.com/book/show/13414675-the-table-comes-first", "http://www.goodreads.com/book/show/7062.Paris_to_the_Moon", "http://www.goodreads.com/book/show/7111.Through_the_Children_s_Gate", "http://www.goodreads.com/book/show/7113.The_King_in_the_Window", "http://www.goodreads.com/book/show/6071984-angels-and-ages", "http://www.goodreads.com/book/show/4586825-the-best-american-essays-2008"]}