{"ratings": 238730, "userreviews": [{"userName": "Kristina A", "userReviewDate": "Jul 06, 2007", "userURL": "http://www.goodreads.com/user/show/174245-kristina-a", "userReview": "Sigh. I really, really wanted to like this book. I heard good things about it, and it has many elements I usually love in a novel: a Victorian sensibility, questions of identity and sisterhood (as well as siblinghood generally), meta-commentary on writing, and a plain, quiet, somewhat chilly protagonist who prefers books to people. The protagonist, Margaret, grew up in a bookstore and learned to read using 19th century novels, and there are clear parallels in the story to Jane Eyre, Wuthering Heights, The Turn of the Screw, and so on.And yet, with all it had going for it, somehow it fell flat for me. Somehow it felt slight and, eventually, tedious at the same time. There were definitely many interesting moments, but for some reason, the \"gothic\" elements of the story never swept me up in the passion and scandal the way it would if the Brontes or Wilkie Collins wrote it. Obviously this is an unfair comparison since the Brontes and Collins are my favorite writers, but then again, if you're going to model your story on Jane Eyre (and indeed, there were parts that really beat you over the head with it, stating the obvious instead of allowing the reader to infer for herself), you should be up to the task, right? One of the problems, in my opinion, is that it seems Setterfield wanted a \"Chinese box\" construction ala Wuthering Heights, but whereas that novel drew me in and made me feel like I was personally sitting at Nelly's feet as she told me the story of Heathcliff and Cathy, somehow Setterfield's construction (in which the novelist Vida Winter tells Margaret her story, and does so using third person, for a reason revealed later in the novel) feels very distanced. Margaret has a personal obsession which is supposed to parallel Miss (the novel's term, not mine) Winter's, but this obsession, for me at least, had me wishing Margaret would just get over it already. Miss Winter's story stops adding much new information at a certain point, and later we are given the diaries of a minor character, which essentially only goes over information we already know. Yet despite this, the ending feels rushed, and the mysterious \"thirteenth tale,\" which Margaret receives in writing toward the end, is only excerpted. One wishes A.S. Byatt had written this novel, as I suspect Setterfield may not have felt up to the task of writing \"the thirteenth tale,\" which has a fascinating premise. Byatt, I am sure, would have written a gorgeous tale to end the book with.That's the bottom line, I suppose: I just don't think Setterfield is that good a stylist. The story should have drawn me in but didn't, and I set it down to writing that simply wasn't as imaginative or lovely as it could have been. If I read that someone made \"hot, sweet tea\" ONE MORE TIME I was going to go crazy -- I like hot, sweet tea as much as the next Victorianist, but can't you find something else to describe, or a different way of doing it? With all of the wonderful Victorian-style writing going on now from former academics like Sarah Waters and AS Byatt, it's too bad this book didn't measure up. I kept comparing it to the (in my opinion) wonderful The Historian by Elizabeth Kostova, which is also a first novel by a former academic. The Historian has faults -- it's a little repetitious in certain points, it's unwieldly, there are some logic issues -- but it is so true to its Victorian predecessor (Bram Stoker's Dracula) in feeling, and it completely sucks you in (pun intended). I have discovered a personal preference: I would rather have an overlong, unweildy, messy wonderful novel that completely absorbs me than a shorter, tidier, but slight novel that doesn't touch me emotionally. Wow, did I just write a review that's longer than the book I just read?"}, {"userName": "Emily May", "userReviewDate": "Aug 07, 2013", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "“There is something about words. In expert hands, manipulated deftly, they take you prisoner. Wind themselves around your limbs like spider silk, and when you are so enthralled you cannot move, they pierce your skin, enter your blood, numb your thoughts. Inside you they work their magic.”\n\nI don't know if I've ever loved words so much.Lots of people told me that this was a book I needed to read, but many of those people also warned me that I might find it slow. So I went into The Thirteenth Tale prepared for a subtle plot that moved at a gentle pace... well maybe my expectations are to blame but that wasn't what I got. Slow?? Not for me. There was not a slow moment in this story because the prose itself was dynamic and consumingly evocative. I was intrigued by the mystery, seduced by the characters and caught up in page after page of well-written family drama.Do you like...?:1) Books2) Mysteries3) Family dramasIf you said yes to those, then I really can't see any reason you wouldn't love this book. People were right when they said it's a book for people who love books. It is. A love of literature and words is enthused in every page of this novel. I find myself believing that had I not already been a bibliophile, an encounter with this book would be enough to have me drooling over the endless possibilities and magic that lie within stories. I must confess that I am almost always a story person first, a character person at a close second and a language/word person last. This book delivered on all three, but it was the latter that most amazed me. Setterfield completely seduces you with words. I read passages over and over again because I loved the language and style so much.\n\n“Books are, for me, it must be said, the most important thing; what I cannot forget is that there was a time when they were at once more banal and more essential than that. When I was a child, books were everything. And so there is in me, always, a nostalgic yearning for the lost pleasure of books. It is not a yearning that one ever expects to be fulfilled.”\n\nThe story is about a biographer called Margaret Lea who very suddenly and unexpectedly receives a hand-written letter from the popular and critically-acclaimed novelist - Vida Winters. Ms Winters wants Margaret to recount her life story, she wants to finally stop telling fictional stories and reveal the truth of her childhood and all its dark secrets. Before accepting, Margaret reads and falls in love with one of the author's books called Thirteen Tales of Change and Desperation, but she is surprised to find that it contains only twelve stories... where is the thirteenth tale? Margaret finds herself unable to refuse the job. And as Vida Winters opens up more and more, both women are forced to confront the demons of their pasts.I, for one, was totally sucked into every aspect of the story. The writing had hold of me, the characters made me need to know more about their lives, the mysteries surrounding Winters' youth kept me guessing. If it's possible, I think this book made me love books even more.Blog | Leafmarks | Facebook | Twitter | Instagram | Tumblr"}, {"userName": "Lisa M.", "userReviewDate": "Sep 13, 2007", "userURL": "http://www.goodreads.com/user/show/311389-lisa-m", "userReview": "\"Do you know the feeling when you start reading a new book before the membrane of the last one has had time to close behind you? You leave the previous book with ideas and themes–characters even–caught in the fibers of your clothes, and when you open the new book, they are still with you\"This quote from The Thirteenth Tale by Diane Setterfield sums up my experience with the book. It’s been a while since I’ve felt truly drawn in to a novel. Likely this is the result of my recent tendency toward selecting less-than-literary books in an attempt to find some distraction without devoting much real focus to the reading. I’ll admit that it took me a bit to get hooked, but, a few chapters in, I found myself thinking about the novel and the developing plot at times when I was unable to be reading.There is no reference to time in the setting of The Thirteenth Tale. From the context clues, I’d guess that it’s set in the 1970s. It’s a world where people still write letters and where if phone lines go down in a storm, country homes are cut off from contact with civilization. Manuscripts are written by hand. The feel of the book is reminiscent of Jane Eyre, a novel that itself is woven throughout the plot.The story begins when Margaret Lea, a little-published biographer, is summoned by Vida Winter, famous novelist. Ms. Winter is finally ready to tell her true life story, rather than another of the many versions she’s given of her life over the years. As she does so, Margaret and the reader are drawn into the mystery that shrouds Ms. Winter. Through the stories she tells Margaret as well as the accounts of Margaret’s own investigations, we eventually learn the truth both about Ms Winter and the legendary Thirteenth Tale, a story that was left out of an early collection written by Ms. Winter. There are enough twists to keep the story interesting and unpredictable.The book jacket describes The Thirteenth Tale by stating,\"It is a tale of Gothic strangeness, featuring the Angelfield family, including the beautiful and willful Isabelle, the feral twins Adeline and Emmeline, a ghost, a governess, a topiary garden, and a devastating fire.\"In reality, it’s that and much more. This book lead me to wonder about identity, love, and the meaning of family. I have a feeling these characters will indeed be in the fiber of my clothes for quite some time."}, {"userName": "Navessa", "userReviewDate": "Jul 27, 2014", "userURL": "http://www.goodreads.com/user/show/18104163-navessa", "userReview": "\"Tell me the truth.\"\nThese are the words that a young journalist speaks to Vida Winter in the beginning of this book. Vida is an author famous for spinning magical tales. In books, and about her life. Each time she releases a new story, she grants multiple interviews, in which every journalist asks her the story of her life, and leaves thinking that they, finally, after decades of deceptions, are the one she's told the truth to. But she never does. Until now. Out of the blue, she writes to an amateur biographer named Margaret Lea, telling her that she has chosen her to be her official biographer. That she is finally ready to tell the truth. What follows is…something I find myself at a loss to describe. Setterfield's prose is of the magical variety. The kind that lifts from the pages to wrap you in its spell and transport you bodily into the book. At one point in the story, Setterfield perfectly describes how I felt when I finally set it down: \n\"There was a sudden rush in my head, I felt the sick dizziness of the deep-sea diver come too fast to the surface. Aspects of my room came back into view, one by one. My bedspread, the book in my hand, the lamp still shining palely in the daylight that was beginning to creep in through the thin curtains. It was morning. I had read the night away.\"\nI immediately woke up my fiancé (at 5 a.m. on a Saturday) and began to whisper to him about what I had just read. Speaking at full volume didn't seem right, sacrilegious even, because I was still caught in this book's thrall and the ghosts of those who haunted the pages seemed to stalk my waking mind. I finished it four days ago, and still my fingers twitch toward my beautiful hardcover copy. Because The Thirteenth Tale is a book that you need to read at least twice in your life. The first time, to learn the truth. The second time, to see with eyes wide open what is really taking place within these pages. This is easily one of my top 10 books of all time.Blog | Facebook | Twitter | Instagram | Pinterest"}, {"userName": "Jessica ❁ ➳ Silverbow ➳ ❁ Rabid Reads-no-more", "userReviewDate": "Jul 27, 2013", "userURL": "http://www.goodreads.com/user/show/10336538-jessica-silverbow-rabid-reads-no-more", "userReview": "Reviewed by: Rabid ReadsSo here's my problem with gothic literature: it's so habitually grotesque that it's predictable.If there's not incest, there's a crazy wife in the attic. If there's not a crazy wife in the attic, there's a murderous illegitimate son who's not right in the head. Or conjoined twins. Or a dying gypsy's curse. Or something equally unsettling.So even if you guess the HEP Big Secret wrong, whatever it actually is isn't going to make a dent. B/c you've already imagined the worst. B/c gothic.ALSO . . . I don't like it.If I lived in the time of traveling freak shows, I would not attend. Not my bag.You: So why did you read it?Me: B/c didn't realize it was gothic until I'd already started it.You: Why didn't you quit?Me: \nSCHADENFREUDE\n. #thestruggleisrealPlus, the concept is friggin amazing: England's most beloved author, who's written 56 novels in 56 years, has zealously guarded her privacy. She made her pen name her legal name, and has threatened any would-be biographers with lawsuits until they backed down.Interviewing her has become a kind of rite of passage for journalists, b/c she gives a different version of her life story to every, single one of them. <------how cool is that?But now she's dying, so she contacts our MC (Margaret), an amateur biographer who's grown up in her father's rare bookshop (a bibliophile's DREAM), and employs Margaret to write her life story before she leaves this mortal coil.After that is when it gets weird. And gross. And creepy. And messed-the-eff-up.Man alive, these people are CRAZY. Including Margaret, who has an unhealthy fixation on her dead-shortly-after-birth twin sister. Genre preferences aside, there's no denying that this is a beautifully written book:\nThere is something about words. In expert hands, manipulated deftly, they take you prisoner. Wind themselves around your limbs like spider silk, and when you are so enthralled you cannot move, they pierce your skin, enter your blood, numb your thoughts. Inside you they work their magic.\nIt's also mindbendingly clever. The line between mental illness and the supernatural is so thin, so frail, so indecipherable, that even now, days later, I can't stop thinking about it--were the ghosts real, or did they only exist in her mind?I. DON'T. KNOW. *EDVARD MUNCH FACE*THE THIRTEENTH TALE by Diane Setterfield is not a book you read then forget. It stays with you, taking up brain space, whispering incessantly, like the five notes of a song you can't place, but can't escape. It's beautiful and terrible. And even if you avoid gothic novels like I do, this one . . . This one deserves to be made an exception. Highly recommended (with trepidation)."}, {"userName": "Libby", "userReviewDate": "Jul 20, 2008", "userURL": "http://www.goodreads.com/user/show/662102-libby", "userReview": "I know that most people like to work out to Gnarls Barkley or Metallica or what-have-you, but I find gym-based exercise so exceedingly boring that I require narrative to keep me going. Since my motor-coordination isn't sufficient enough to allow me to turn the pages of a magazine/book AND pump the pedals on an elliptical trainer, sometime last summer I turned to Audible to solve my problems. Now, what one requires from printed matter may not at all do for the recorded book, and in my case, it turns out that I can only sustain listening interesting in heavily plot-driven novels (or extra dorkified pod-casts of \"Wait, Wait Don't Tell Me\"... sigh, Peter Segel). Unfortunately, the intersections of a compelling plot and interesting writing are fairly few and far between, plus the narrator has to be a strong reader whose vocal stylings are not reminiscent of one's old junior high school/high school drama club classmates. This is difficult. The literary writer trying on genre often works well (John Banville as Benjamin Black is pretty good)--forgive my snobbery--but only because the conventions of a straightforward mystery or sci-fi novel can be a little cringe-inducing when you actually hear them recited aloud. But seriously, I love Science-fiction, so no diss.Anyhoo, The Thirteenth Tale seemed as though it would fit the bill perfectly. I mean, premise-wise, it's the kind of book editors slaver over (personal experience alert!) esp. vis-a-vis potential audience, in other words, well heeled women (possibly of a certain age). The whole freaking novel is, in effect, a love letter to Jane Eyre and the other mega-hits of the 19th century. I'm browsing Audible, thinking to myself (o.k., talking out loud to myself) \"Dark family secrets? Check! Wheels within wheels narrative? Check! Gloomy old English estate? Check! Both Victorian and (presumably) post-war setting? Check! Antiquarian bookstore? Check! Lonely main character whose best friends are books? Secondary main character who is a mysterious, isolated writer? Check, and Check!\"Unfortunately, I think the voice I was hearing in my head was actually Diane Setterfield's cajoling, coercive, whinging, and not my own. Emphasis on coercive--my main gripe about this mess of a novel is that while reading I couldn't shake the feeling that the author is constantly trying to impress upon the reader--HOODWINK INTO BELIEVING, more like it--that this piece of moribund trash is actually a work of serious literature.Might I illustrate this vexing complaint for you? Let's talk theme for a moment. The central preoccupation of this novel is twinning, or twinness. The two main characters are both twins (not each other's), whose core-identity has been formed by this (as Diane Setterfield would have it) division of one soul, one egg, one person, into two bodies. The concept of the twin is the leitmotif of The Thirteenth Tale. Unfortunately, Setterfield's entire take on the idea of the twin can be fairly summarized in the above italicized line. Over the course of the book, she uses the same metaphor at least four times to describe separated twins or non-twins--the amputee. She has nothing but the most obvious, predictable, easy, pop-psychology thoughts to offer vis-a-vis twins, but these ideas are all delivered in overwrought, hyperbolic, purple prose. Every time the main character, Margaret, catches sight of her reflection (which occurs at least ten times) she swoons into an overheated, almost laughable disquisition about her \"twin\" (her reflection) who waits for her just on the other side of this mortal coil. Every. Single. Time.How about books? Well, could you imagine that some clever minx would have us believe that books are like the ghosts of dead people? I mean, as a committed life long reader I have never encountered nor thought of such a bold notion--author's words outlive their bodies and thus reading might be an act of communion with the dead? Whoa. And also, dead folk might get lonely--it's so lonely being dead--and the act of reading is akin to an act of friendship and/or companionship? Fortunately for my feeble and limited imagination, Setterfield ensures that such concepts are inescapable in her novel's groundbreaking treatise on the delights literature has to offer.Setterfield makes the further mistake of declaring that Margaret's counterpoint, Vida Winter, is the greatest living English author of her day, a point that is crucial to the story's operation. Her books have won legions of awards, and generations of journalists and biographers have been rebuffed in their frenzied attempts to discover her life story. But Setterfield is not capable of convincing us that Winter is a great--one of THE greats--talent. The narratives that Winter spins for Margaret are pale imitations of Atwood/Byatt-esque storylines. Setterfield's insistence that we believe Winter is a cannonized author damages the credibility of the rest of the novel, especially as it relates to the reader's required suspension of disbelief. Of course, the problem is that Setterfield is not (nor should she be) the greatest living English author, nor even close to it, and she's overreaching in trying to depict Winter as such. It's sort of like an unfunny writer trying to write a funny character; the author doesn't possess the tools to show us that the character is funny, but can only tell us she is. Honestly, I could continue on in my screed for quite a while longer, but I think I should save my energies for positive reviews. Let me just mention that this novel's construction, pacing, and plotting are all askew as well, and that its ultimate resolution is a huge disappointment. Perhaps my take is soured by the fact that I spent fourteen hours listening to this novel, instead of four or so hours reading it. But my feeling is that what could have been a fun homage to the nineteenth century novel became instead a dull trainwreck of a book, derailed by its own inflated sense of literary import. If anyone knows of a better, but similar in texture, novel to accompany me on my upcoming travels/adventures in exercise, I'd love to hear it. Thanks!"}, {"userName": "Amalia Gavea", "userReviewDate": "Oct 16, 2016", "userURL": "http://www.goodreads.com/user/show/56789747-amalia-gavea", "userReview": "''We live like latecomers at the theatre; we must catch up as best we can, dividing the beginning from the shape of later events.''\nThe Thirteenth Tale had been ''waiting'' in my TBR list for almost two years, before I finally decided to start reading it. It proved to be a rare bibliophile's experience.In the Gothic Literature group October Reading and in a recent discussion with a friend in Goodreads, I described Diane Setterfield's novel as foreboding. Each scene, each sentence is a creation of art, each detail so important, nothing is wasted. Each page leads to the shocking final twist, although some of the twists in the middle of the book were a bit predictable, if you paid attention. I will not go into any detail of the plot, because it is hard to do so without falling into the trap of spoiling something, but I can say that the lover of books will find a treasure of references. The most prominent reference is Jane Eyre (and rightfully so), with Wuthering Heights and The Woman in White following closely. Why? Foreboding houses, problematic narrators, troubled heroines, and all the sins and faults of the past that go on haunting families and places. Even Sherlock Holmes gets an honourable mention, since there are some riddles that require answers as there are some characters that desire truth and others that seek absolution.For some reason, Miss Winter reminds me of a modern Miss Havisham, from the first glimpse of her through the eyes of Margaret Lea, the young amateur biographer. Margaret is a very interesting character that stands as equal to the troubled Vida. She is sensitive, almost fragile, but strong at the same and so determined to exorcise her own demons.The Thirteenth Tale  has all the characteristics of a heavy cloud before the storm. It is a classic, a haunting tale, its prose elegant and poetic. A tale that shows us that the most dangerous ghosts exist not in a world beyond, but fully in our own..."}, {"userName": "Rachel Burton", "userReviewDate": "Oct 24, 2007", "userURL": "http://www.goodreads.com/user/show/574616-rachel-burton", "userReview": "This has finally come out in paperback. This is that one that got an £800,000 advance and is meant to be the best book since sliced bread. To be honest I don't hold out a lot of hope....On P. 138I take it back. I have been sucked in straight away. Can barely put it down! Whiich is apt seeing as amonst other things it is the tale of books and their words sucking you in. It is also the tale of a dying writer and her reluctant biography, lost twins and the ghosts of the past. Like The House at Riverton it has a very Brontesque Gothic atmosphere to it; it is also set in Cambridge and the Yorkshire Moors - my two favourite places! And timeless. It could be set anytime. Whilst it seems modern there are no mobile phones or laptops or other such superfluous crap which makes me think it is a different plane of now. It also reminds me of Donna Tart. I'm not really sure why as it covers none of the themes that Tart obsesses with. Maybe it is my utter empathy with the narrator, which I got with the Little Friend and also from the characters in The Secret History. This time a solitary girl happier around books than people... On finishingIs there a new trend for the Brontesque at the moment. The second novel in as many weeks I have read that draws heavily on the themes of the sisters. In fact the Thirteenth Tale is unashamedly Jane Eyre (mixed with a little Wilkie Collins and Henry James), but it is in such a way that the book is a homily to Charlotte rather than a plagerism.I opened this with every intention of hating it for yet more overhyped nonsense. I haven't enjoyed a contemporary novel so much since the Secret History (and believe me that is high praise indeed)."}, {"userName": "Jean", "userReviewDate": "Oct 13, 2013", "userURL": "http://www.goodreads.com/user/show/19300421-jean", "userReview": "[\"Inside my head was a half-painful, half-euphoric vibration. It was her song. My sister was coming.\"  (hide spoiler)]"}, {"userName": "Julie", "userReviewDate": "Apr 01, 2011", "userURL": "http://www.goodreads.com/user/show/5210022-julie", "userReview": "This one of my favorite books. I don't re-read books very often. This is one of the few that would make the list. This book has been reviewed about 3000 times, so I'm not going to add more to the pile. I will just stay I recommend this book to all book lovers no matter what genre you prefer. A+"}, {"userName": "Florence (Lefty) MacIntosh", "userReviewDate": "Jul 20, 2012", "userURL": "http://www.goodreads.com/user/show/10856439-florence-lefty-macintosh", "userReview": "Amazing for a debut! While a homage to classic gothic novels no need to be a fan - pick it up if you’re into mysteries with plenty of psychological twists, ambiance and above all – suspense! Setterfield excels in the slow build, at stringing you along, feeding you morsels bit by tantalizing bit…almost toys with you until you grow impatient, at least I did. About 1/3 of the way in I reconciled myself to the fact that she insisted on setting her own pace and simply would not be rushed. That’s when I relaxed, immersed myself in this tragic tale of arson, incest, insanity, abandonment, and murder.Great premise, picture someone like J.K. Rowling on her deathbed choosing you to reveal her deepest darkest secrets too, you get the idea☺ Amateur biographer Margaret is hired by reclusive world-famous author Vita Winter to chronicle her life, an author who's perfected writing fiction, keeping secrets, mastered deception. “My gripe is not with lovers of the truth but with truth herself. What you need are the plump comforts of a story. The soothing, rocking safety of a lie.”  Terrific dialog, a host of intriguing characters; Hester as the “dumpy, potato-faced, provincial governess” a standout. Cons:  Compared to Vita’s tale Margaret’s felt like clutter. I did like the contrast of temperaments, the pitting of wills. Plus the resolution was a little too pat.For the genre of gothic suspense 4 ½ stars. Read on the heels of We Have Always Lived in the Castle, a smooth as silk transition that so worked for me I’m rounding this up to a 5."}, {"userName": "Heather", "userReviewDate": "Dec 29, 2007", "userURL": "http://www.goodreads.com/user/show/712719-heather", "userReview": "MY REVIEWS ARE NOT LIKE MOST PEOPLE'S REVIEWS. I STATE THINGS AS I READ THEM & AS I SEE THEM. YOU CAN HAVE YOUR OPINION, JUST DON'T EXPECT ME TO SHARE IT OR CHANGE MY OPINION. I HAVE ALSO BEEN INFORMED THAT THIS REVIEW HAS SPOILERS IN IT. I GUESS PEOPLE DON'T READ BOOKS JUST FOR THE ENJOYMENT OF READING ANYMORE. THAT IS TO THEIR DISAPPOINTMENT.The Thirteenth Tale by Diane Setterfield was, for a lack of a better word, an interesting book. Just when you think you have everything figured out and Mrs. Setterfield can not surprise you anymore, she pulls another surprise out of her hat. Which that was a surprise in itself. Rarely do I find a book that can leave me guessing and have to actually tell me what happens before I figure things out for myself. I never figure out that there was a cousin until Mrs. Setterfield inform me of such. That blew my mind, it had been three years since I had a book that did that to me. Trust me, it is a welcome respite from always figuring out the books plots and who-done-it before the author tells the reader who did it. I am so glad that Michelle made us read this book (yes, I said made us read), cause if I went off of what the back cover said I never would have read it. The back does not do justice to the book. It doesn't even come close to summerizing what the book is about. Personally, I think Mrs. Setterfield needs to re-do the back cover and re-publish the book. I think it would hit all the best seller lists then instead of just the New York Times Best seller list.Before I delve into my review and the characters I would like to explain how and why I came to some of my conclusions. First off, when it came to the twins, Adeline & Emmeline. I understand the language that they spoke completely. Being a twin, I grew up knowing the language. Personally, I feel that the twins had a form of autism and that their twin language was how they communicated with themselves. But at the time of the story autism was not thought of yet. So when the governess and the doctor separated the twins, they caused a downward spiral that Adeline & Emmeline could not recover. The ghost that the governess was seeing was, of course, Vida. Vida was the only reason that Emmeline didn't react like Adeline. Vida understood the twin talk because she had spent her entire life with the twins. Most people if they would just stop & listen to the twins would understand their language, but they don't listen. My mother quickly understood my twin language cause at first that was all I would speak. With an autisic child it is best to try and keep everything the same; same house, same routine, same people, etc. I have seen this work with autistic children so I know that it works. As for the loss that Margaret Lea felt growing up for the loss of her siamese twin, I do understand the loss of a twin feeling. I wasn't a siamese twin but my twin was lost before we were born. So I do understand the feeling of growing up feeling like there is supposed to be someone else there.As for the two grand estates that the story takes place in. I believe that this is because Emmeline was use to living in a manor estate (see above paragraph) and for Emmeline to remain comfortable Vida knew that she would have to have an estate similar to Angelfield. If you will remember Miss Lea's first trip to the estate and Vida's description of Angelfield you will realize that they both sound similar in a sense. To a autistic person they would be similar enough to help the person stay calm. Also the twins were used to this lifestyle and people would talk if they lived any other way.Both Miss Lea & Miss Winter shared a few things in common with each other. Though if I understood the book correctly Miss Winter was not actually a twin. She was the child of Charlie's rape on Sybilla March *page 71* (Ms. Setterfield leads us to assume it was Miss March who was raped) and then was abadoned on Angelfield. We learned this on page 357 & page 400. So Miss Lea & Miss Winter do not share the reporte of being twins. But they do share the love of books & Jane Austin.Mrs. Lea was in a major depression over the loss of her child. In my opinion, Mrs. Lea blamed Margaret for the loss of the twin. Where is Margaret understood why her twin was lost, but she still felt the loss of that twin. Since they were siamese twins then I imagine Miss Lea felt a bigger loss then a normal separated twin. No one actually understands the relationship between twins, though scientists have tried to understand it. I doubt if anyone will ever under the connections between twins. If Miss Lea's parents had told her about her sister then she might have been able to deal with her feelings of loss a little easier. But then if Miss Lea's mother didn't blameher for the loss it would have helped also.The book revolved completely around books & libraries. To me this is just Ms. Setterfield's way of telling her readers that there is stories within stories within stories. Within this book there are so many different storylines you almost have to be careful to make sure that you are switching story lines with the author. Personally, I counted about five different story lines in this book, but those were just the ones that I counted. That does not mean that Ms. Setterfield finished all those story lines.To some people thing that The Thirteenth Tale is a classic, gothic novel but in my opinion I would classify this book as an adult fiction book. I found this book in the young adult section of my book store and after reading it I can not see how some young adults would understand it. This book is not a ghost story, it lacks all the necessary requirements for a ghost tale. There is no ghost in the story. Yes, there is the thought of a ghost, but it isn't a ghost. If you will think about each time that the supposed \"ghost\" was seen it was written in such a way that you automatically thought it was a person not a ghost. To me, in order, for a tale to be considered a ghost tale it has to have a scary part and ghosts. Well, this book really didn't have either of those parts so to me it did not classify as a classic gothic novel.When you read the book you should notice that as Miss Winter tells her story she changes the point of view from third to first person, from \"they\" to \"we\" to \"I\". To me Miss Winter did this in order to see if Miss Lea would catch on and figure out about the third child. When I read about the \"other presence\" in the rooms and the girl that was playing with Emmeline in the fields that told me that there was another child.When you read the book, you will notice that all through the times when Miss Winter is telling her story to Miss Lea that there is mysteries within mysteries. One of those is Miss Winter herself. She was abadoned on the ground of Angelfield as a child and found by John. The only people who knew about her were John, Missus, Adeline, & Emmeline. Personally, I first suspected a third child when Charlie turned to Sybil March on page 71. Then when I read that the governess saw Emmeline playing in the field with Adeline and then the governess found out that Adeline was at the doctors house for the whole afternoon. That told me that there was another child. Also that would explain why Emmeline was able to handle the separation from Adeline and why Adeline couldn't handle the separation from Emmeline.I remember in the book that Miss Lae telling Mr. Love that Mrs. Lea preferred telling \"weightless\" stories in place of heavy ones and that sometimes it's better \"not to know\". When I read this I had a major problem with this. My parents believed in telling me the truth of the matter even if the truth was not good. Even though the truth was not always good or easy to bear I always knew what was going to happen and I was never shocked or surprised when something happened. I am not a believer in not telling children the truth. I have found that most children can handle the truth as long as it is explain to them in a language that they can understand.To me the first book that Miss Winter wrote, Thirteen Tales of Change & Desperation,was her way of trying to tell her personal story. The last tale would have been her personal story of how she was born. You found out about that on page 400. Though the tale was never finished because Miss Winter's life revolved around taking the place of one of the twins. She never really had a ife of her own.Another thing that I noticed about this book was that Ms. Setterfield never gives a time frame for when this tale takes place. She gives you hints and such, but never an exact date. Personally, I believe that this tale took place around the 1920's or the 1930's. I get this from the language that Ms. Setterfield used, the transportation, and the styling of clothing that was described in the book. Plus with the language used to describe the houses tells me that it is not a modern time. But this is just my opinion.In conclusion, The Thirteenth Tale is a very interesting book, that will take you on a spinning twisting tale. I would recommend this book for any adult that was wanting a book to read that they could get lost in. Personally, I had a hard time putting it done every night to go to sleep. I throughly enjoyed this book. I didn't figure out all the mysteries until the very end, which for me is highly unusual. I normally read mystery & thrillers, and even those books I figure out the plot before the author tells the reader. With The Thirteenth Tale I only figured out one of the plots, the third child, and I had to be told the other ones. So in that sense it was a wonderful book."}, {"userName": "Lindsay - Traveling Sister", "userReviewDate": "Mar 28, 2017", "userURL": "http://www.goodreads.com/user/show/54886546-lindsay---traveling-sister", "userReview": "2 stars. I really, really wanted to like this book more than I did. Unfortunately, I finished it with a sense of disappointment.My interest wavered throughout the novel, going on a roller coaster ride of ups and downs. Unfortunately, there were more downs than ups.The book started off with a bang! I was thrilled to have the feeling of settling into a well-written historical fiction/family drama/mystery, my absolute favourite genre combination. Sadly, this feeling was short-lived. After the first quarter of the book, the story got very 'strange', for lack of a better term. The strangeness wasn't to do with the talk of ghosts, it was the actual stories themselves. One of the main characters, Vida Winter, was telling her biographer her back story which was filled with several absurd childhood situations and peculiar stories, none of which sat well with me. During these scenes, I really lost interest and had to work hard to plug through and keep myself focused. Often I found it hard to talk myself into picking this book back up to continue reading. Several of the characters were extremely unlikable.What I liked about the book was the bookshop and library atmospheres. The author, Diane Setterfield, did a fabulous job of making me feel as though I were right in these rooms with the characters. I also enjoyed that this was essentially a book about books and book lovers. I will finish with some quotes that captivated me (all of these from the first 25 pages).\"There is something about words. In expert hands, manipulated deftly, they take you prisoner. Wind themselves around your limbs like spider silk, and when you are so enthralled you cannot move, they pierce your skin, enter your blood, numb your thoughts. Inside you they work their magic.\"\"Though my appetite for food grew frail, my hunger for books was constant.\"\"The hours between eight in the evening and one or two in the morning have always been my magic hours. Against the blue candle-wick bedspread the white pages of my open book, illuminated by a circle of lamplight, were the gateway to another world.\""}, {"userName": "Debbie \"DJ\"", "userReviewDate": "Jul 07, 2015", "userURL": "http://www.goodreads.com/user/show/12620745-debbie-dj", "userReview": "Here I am, looking at other reviews to figure out what genre this is. So, this is Gothic suspense? WOW! I was guessing mystery, but with so much atmosphere, it seeped into my bones! What an incredible book!This was a 15 hour audio book, and due to life circumstances, I was not able to listen continuously. What I can say is that every time I listened, I was completely drawn into another world. It is the story of a famous recluse writer, Vida Winters. She is an invalid now, but has one final tale to tell. One that was missing from a previous book which stated it had thirteen tales, but only contained twelve. And so, it is a tale the world has been waiting to hear. Her choice of a biographer is that of an unknown bookstore owner, one who she has sent a letter, one who simply receiving any letter is an event. Could their lives be connected in unknown ways? All of the mysteries in this book expand, the layers go deeper. It was impossible not to follow each word through every door. And that's exactly what it felt like. The writing is so exquisite that I would follow it anywhere.The book begins, \"You want to know someone heart, mind and soul? Ask him to tell you about where he was born. What you get won't be the truth. It will be a story, and nothing is more telling than a story.\" And so, Vita Winters is enticing me with story, stating, \"a good story is always more dazzling than a broken piece of truth.\" But, the truth has become a bully in her mind. It must be told.I loved this story so much I will be buying the book. I must have those words in writing, for they are truly...dazzling!"}, {"userName": "Violet wells", "userReviewDate": "Jan 08, 2017", "userURL": "http://www.goodreads.com/user/show/4196681-violet-wells", "userReview": "I can’t remember why I bought this and it’s probably not fair that I rate it because at times I felt like I was reading a novel in a language I don’t understand. The best way I can think of describing it is Bronte fan fiction. At times it felt more like a product than a labour of love. The biggest problem for me was the question of how seriously I was supposed to take this novel. Just a bit of light-hearted fun with its constant smoking mirrors and playfully preposterous premises? But maybe there’s an argument that novels like this trivialise the genius of Emily Bronte. There’s also the baffling question of why many people who love the Brontes and Jane Austen are also eager to read countless contemporary spin-offs, cover versions of these classic novels. One of the reader questions at the end is how this sits beside the novels that inspired it. That to me is like asking how a contestant on X Factor sits beside the artists – say, Marvin Gaye or David Bowie - whose songs she or he covered on the programme. Ultimately I just asked myself why I didn’t spend my time much more fruitfully by rereading Wuthering Heights."}, {"userName": "PopiTonja", "userReviewDate": "Sep 30, 2017", "userURL": "http://www.goodreads.com/user/show/39885144-popitonja", "userReview": "Danas nisam živela svoj život, danas sam živela život Margaret Li. Odavno me knjiga nije ščepala kao ova. Na početku je bila samo lepa, topla, pitka... uljuljkavala me je nežno poput deteta... uživala sam... A onda je klupko počelo da se odmotava, priča me je razbudila i povukla sa sobom, želela sam još i još i još... Pohlepno sam tražila to „još“ kroz rečenice i stranice, nisam mogla da se oduprem želji da što pre saznam svaku pojedinost, detalj, pogledam u svaku ispisanu sliku, da saznam istinu i konačno otkrijem trinaestu priču.„Poznajete li onaj osećaj kad počnete da čitate novu knjigu pre nego što je opna prethodne stigla da se zatvori za vama? Prethodnu knjigu napuštate sa idejama, temom i motivima – čak i s likovima zatočenim u samom tkanju vaše odeće, pa su i pošto otvorite novu knjigu, još tu, sa vama.“Da, Margaret, upravo prolazim kroz taj „knjiški mamurluk“ i osećam ga u svakoj ćeliji svog bića. Započeću i završiti još mnogo knjiga, ali će ova ostati da tinja u meni zauvek."}, {"userName": "Lindsey Rey", "userReviewDate": "Dec 21, 2013", "userURL": "http://www.goodreads.com/user/show/5436213-lindsey-rey", "userReview": "[4.5 Stars]This was an absolute gem!"}, {"userName": "Ahmad Sharabiani", "userReviewDate": "Sep 24, 2009", "userURL": "http://www.goodreads.com/user/show/614778-ahmad-sharabiani", "userReview": "The Thirteenth Tale, Diane Setterfield تاریخ نخستین خوانش: بیستم ماه سپتامبر سال 2009 میلادیعنوان: سیزدهمین قصه؛ نویسنده: داین سترفیلد؛ مترجم: نفیسه معتکف؛ تهران، البرز، 1386؛ در 557 ص؛ شابک: 9644425448؛ داستانهای نویسندگان امریکایی قرن 21 مویدا وینتر اسرارآمیز به خلق داستانهایی پرداخته بود که هر کدام شهرت و پول برایش به ارمغان آورده بود، اما گذشته ی او همچون رازی سر به مهر بود، میخواست راز و حقیقت زندگیش را نیز بر ملا کند، مارگارت لی زندگینامه نویس، قصه ای پر راز و رمز از او میشنود، قصه ایزابل زیبا و خودسر، دوقلوهای رام نشدنی، شبحی مرموز در باغی پردرخت و حریقی خانمان سوز... قصه سیزدهم که نانوشته مانده بود. ا. شربیانی"}, {"userName": "Jaya", "userReviewDate": "Jul 29, 2016", "userURL": "http://www.goodreads.com/user/show/31691644-jaya", "userReview": "DISCLAIMER\n : This is not a review. These are just some random thoughts that were skittering through my mind while I was reading this book.WARNING: The following is filled with passages picked up from the book, which may not be of any interest to anyone but me. (Yes I might have ended up highlighting more than half of the book). So read at your own peril!According to me, there are two kind of listeners of music. One who prefers lyrics of a song over its melody and rhythm; the second kind are the ones who are are (almost) deaf to the lyrics, because when melody comes to play nothing else exists for them. I am (mostly) the kind of music lover who would fall into the second category. It is the tone, melody, rhythm and dynamics of a song that transports me to another world. So even if a song is in a language that I do not understand, if I can identify with the other elements, that song is ‘it’ for me. Not very dissimilar to this, is my habit of reading. When I pick up a book it is more often than not, the story rather than the way it is narrated that works for me. Sometimes I might not pay attention to the choice of words, expression or the POV of the narrator. If the writing, even in its simplest form is engaging enough, read it, I SHALL (having said that there a few writers whose works I would read just for their style of writing and barely pay attention to the story or the plot).Then there are books like \nThe Thirteenth Tale\n. I'v had this book in my possession for a couple of years now. I don’t recall how or when did I happen to acquire it (habits of an obsessive compulsive book hoarder, perhaps) but there would something in me holding me back from reading this book, could have been forgetfulness…I do not know, had this book not been tagged as a gothic-mystery, I probably would not have took much interest in it, that's for sure.So when some good friends here at GR began to read The Thirteenth Tale, I decided to tag along with them. After reading a few pages of the story, I realised that this time, it wont be easy for me to shelve-off this book in any of the established categories of my mind. This was not the song where the music had hit me, this time, it was the lyrics that called out to me. Here's a song that synced with the mood I fell into at that time... There There by RadioheadIt was the writing of Diane Setterfield that captured me in its thrall. While the plot seemed intriguing enough from the start, it was the evocative narrative that held me mesmerized right from the very beginning. As I kept reading there were some so many lines, passages and paragraphs that I would re-re-re-read and ponder on them time and time again. I don't recall if I'v ever been moved by “words” so much.Here are a few of my most fave ones….\"When you read a manuscript that has been damaged by water, fire, light or just the passing of the years, your eye needs to study not just the shape of the letters but other marks of production. The speed of the pen. The pressure of the hand on the page. Breaks and releases in the flow. You must relax. Think of nothing. Until you wake into a dream where you are at once a pen flying over vellum and the vellum itself with the touch of ink tickling your surface. Then you can read it. The intention of the writer, his thoughts, his hesitations, his longings and his meaning. You can read as clearly as if you were the very candlelight illuminating the page as the pen speeds over it.\"\"There is something about words. In expert hands, manipulated deftly, they take you prisoner. Wind themselves around your limbs like spider silk, and when you are so enthralled you cannot move, they pierce your skin, enter your blood, numb your thoughts. Inside you they work their magic.\"\"People disappear when they die. Their voice, their laughter, the warmth of their breath. Their flesh. Eventually their bones. All living memory of them ceases. This is both dreadful and natural. Yet for some there is an exception to this annihilation. For in the books they write they continue to exist. We can rediscover them. Their humor, their tone of voice, their moods. Through the written word they can anger you or make you happy. They can comfort you. They can perplex you. They can alter you. All this, even though they are dead. Like flies in amber, like corpses frozen in ice, that which according to the laws of nature should pass away is, by the miracle of ink on paper, preserved. It is a kind of magic.\"And my most favourite!\"One gets so used to one's own horrors, one forgets how they must seem to other people.”One more...\"With no beginning and no ending to frame them, no melody to hold them in place, whatever it was that bound them together seemed precariously insecure. Every time the first note struck up its call, there was a moment of anxiety while it waited to find out whether its companion was still there, or had drifted off, lost for good, blown away by the wind. And so with the third and the fourth. And with the fifth, no resolution, only the feeling that sooner or later the fragile bonds that linked this random set of notes would give way as the links with the rest of the tune had given way, and even this last, empty fragment would be gone for good, scattered to the wind like the last leaves from a winter tree.\"...one world seeping through the cracks of another. Do you know the feeling when you start reading a new book before the membrane of the last one has had time to close behind you? You leave the previous book with ideas and themes-characters even-caught in the fibers of your clothes, and when you open the new book, they are still with you.So what is it about this book that has touched me so deeply? Why do I feel that I am not going to forget these lines, anytime soon? I have no answer to them. What I do know that these passages resonate on my mind like a haunting melody, catching me unawares.\n\"We all have our sorrows, and although the exact delineaments, weight and dimensions of grief are different for everyone, the color of grief is common to us all.\"\nAnd here’s a song that baffles me equally like this story does, I catch its strains in my mind when am not paying attention.\nSorrow by Pink Floyd\nRead this book if you love BOOKS, read it if you love play of WORDS. You will not be disappointed."}, {"userName": "Russell", "userReviewDate": "Feb 18, 2008", "userURL": "http://www.goodreads.com/user/show/144335-russell", "userReview": "Dear god. I listened to this abortion of a story in the car last weekend. It was so awful that words cannot describe how idiotic it was. Contrived doesn't begin to describe it. Melodrama on top of melodrama. Secret family members. Ghosts. The main character fainting at the drop of a hat. Ugh, I wanted every last character to die screaming. If this is what women read (and apparently there are people who actually enjoyed this catastrophe, in fact it has a higher rating than some Cormac McCarthy novels on here) then we, as a species are lost. Jesus, I can't say enough bad things about this book. Light it on fire and let's never speak of it again."}, {"userName": "Margitte", "userReviewDate": "Nov 14, 2014", "userURL": "http://www.goodreads.com/user/show/7481492-margitte", "userReview": "Margaret Lea never imagined the outcome when she, as a devoted modern, bibiophile, living with her parents on top of their book store, wrote a biographical essay,  The Fraternal Muse on the Landier brothers, for a hardback collection of essays on writing and the family in the nineteenth century. She was a diletante, talented amateur in the company of professional and academic writers.A is for Austen, B is for Brontë, C is for Charles and D is for Dickens. That is how she learned to read and write. The book store was her everything.The second floor was her favorite place of discovery. It was where the Nineteenth-century literature was found: biographies, autobiographies, memoirs, diaries and letters of people gone a long time ago. And by opening and reading a few pages of all the books in the shelves, looking for something missing in herself, she gave all these people a chance to be alive again, even if it was only through their words. Being dead could be very lonely, she thought. Reading could be dangerous as well. She learnt that lesson early in life when she was sitting on a wall, reading, and fell off when she relaxed her muscles too much. From then on she always chose a secure, safe position to sit down when opening a book.She had to be with the deceased. It was an urge, a need, an instinct. \nP. 19: People disappear when they die. Their voices, their laughter, the warmth of their breath. Their flesh. Eventually their bones. All living memory of them ceases. This is both dreadful and natural. Yet for some there is an exception to this annihilation. For in the books they write they continue to exist. We can rediscover them. Their humour, their tone of voice, their moods. Through the written word they can anger you or make you happy. They can comfort you. They can perplex you. They can alter you. All this, even though they are dead. Like flies in amber, like corpses frozen in ice, that which according to the laws of nature should pass away is, by the miracle of ink on paper, preserved. It is kind of magic.\n As a ten-year-old, she discovered an old tin underneath a bed which changed her life forever. She discovered the reason why she wanted to give a voice to the deceased. P. 9: There is something about words. In expert hands, manipulated deftly, they take you prisoner.  A letter from Britain's most famous author, Vida Winter, invited her to write the author's biography. All through her life, Vida Winter entertained journalists with various versions of her life story. None of them were ever the same.  P.5: I have nothing against people who love truth. Apart from the fact that they make dull companions. Just so long as they don't start on about storytelling and honesty the way some of them do. Naturally that annoys me. Provided they leave me alone, I won't hurt them. And now, suddenly after all these years, she wanted Margaret Lea, in particular, to write down the real truth - the one story she could never share, the story that needed to come alive for the dead to rest in peace...P. 66: The story is not only mine; it is the story of Angelfield. Angelfield the village. Angelfield the house. And the Angelfied family itself. George and Mathilda; their children, Charlie and Isabelle; Isabelle's children, Emmeline and Adeline. Their house, their fortunes, their fears. And their ghost. One should always pay attention to ghosts... The biography turned out to be an elongated, painful confession. How many times have I gone back to the border of memory and peered into the darkness beyond? But it is not only memories that hover on the border there. There are all sorts of phantamasgoria that inhabit that realm. The nightmares of a lonely child. Fairytales appropriated by a mind hungry for story. The fantasies of an imaginative little girl anxious to explain to herself the inexplicable. Whatever story I may have discovered on the frontier of forgetting, I do not pretend to myself that it is the truth.''All children mythologize their birth.'Margaret Lea became more than just a biographer. \"I'm going to tell you a story about twins\" Miss Winter said that first night in her library. Words that with their unexpected echo of my own story attached me irresistibly to hers.\" She needed to become Sherlock Holmes to unravel the haunted history of the old mansions and its inhabitants. In the process, her own life story would entwine with that of Miss Winter's, and in one moment of vertiginous, kaleidoscopic bedazzlement, she would finally take the fragmented and the broken and mend it, tidy it up and put it in order. The chaos and clutter would be banished, doubt will be replaced with certainty, shadows with clarity, lacunae with substance. Everything was put in place before the wolf came to collect, but only because the diary of the governess, miss Hester Barrow , was discovered...Finally, The Thirteenth Tale could be told: the final, the famous, the unfinished story. But it would be Vida Winter herself who wrote it. Although she was the only one who could bring the deceased alive again, Miss Margaret Lea was the only person who understood where it was coming from.COMMENTS. It is certainly one of the most mesmerizing and gripping tales I have read in a very long time. And one of the best in the suspense thriller genre, for sure. While reading the book, I was constantly thinking about Manderley, the mansions, in Rebecca(Daphne Du Maurier). The gothic elements in Jane Eyre(Charlotte Brontë) - which features very strongly in the narrative, changed this book into a modern version of the old classics, such as The Woman In White( Wilkie Collins); Wuthering Heights(Emily Brontë); Rebecca(Daphne Du Maurier), and The Turn Of The Screw (Henry James). I simply cannot recommend this book high enough. A story of books and haunted houses. What a fabulous combination. ;-)There is something about words. In expert hands, manipulated deftly, they take you prisoner.  - You have been warned!"}, {"userName": "Jamie", "userReviewDate": "Nov 15, 2007", "userURL": "http://www.goodreads.com/user/show/219514-jamie", "userReview": "Oh to be lost in a book. That's really the reason I read, the reason I read more often than I write and so on. I have a favorite memory: it is me, at thirteen or fourteen, lying on a bedsheet I carried from the laundry room and spread out in the field across the street from my childhood home. It was spring, nearly too cool to be comfortable, but the grass was dry and very green and filled with tiny little pastel flowers, which are decidedly not \"real\" snow drops, but that's what I'd called them since I was a child. I'd had Daphne DuMauier's Rebecca on my shelves for about a year. I'd borrowed it from some Language Arts teacher who was critical of my typical reading choices, however furvent, and suggested I up the reading level a bit. The paper back was spider-webbed with age and the pages brown and flaking, but I did like the very narrow picture: lovely dark eyes framed by red hair: Rebecca. And so, at last, the book had ripened and I read it in the field until it grew too dark to see and I moved inside. I can still feel the flowers touch my arms as I turned the pages, feel the \"crush\" of my stomach as I decided I loved Mr. De Winter I though I could only get from easy visuals like movies. And so began my love affair with the Gothic novel.Others would follow: Jane Eyre, re-read in an apartment in Paris during the great, dreary rains of late winter, wrapped in a quilt, drinking black tea, and, of course, as of late, The 13th Tale. Where to begin--I loved Margaret Lea, the timid, Jane Eyre-ish narrartor who leads a very exact little life above her bookshop: dinner and in bed to read by eight with cocoa and hot water bottle, her old gothic novels with their nicely wrapped up endings, and I loved the eccentric Miss Winter, in her Mistlewaith Mannor of a house on the moores with topiary gardens, cats and tapistries. The food listed in these novels, the soup and sandwiches denoting lunch as apposed to the steak and kidney pie for dinner, it all sounds better with served at a small table in a dark, cozy room in a mannor house with a high antique bed overstuffed with linens.Granted, this was a gothic novel with a bit of an edge: like Rebecca's maybe/maybe not lesbian connotation, the Angelfield's have a knack for not only mental illness and general instability as well as seemingly profound agoraphobia, but they also like to \"hurt\" themselves and each other: physically. There was absolutely a plethora of rusty wires, kept needles removed from sewing kits, revolvers, pires and cans of petrol.But, like Jane Erye, there were also ghosts to go with the madness and other lovely things, as well as asylums, (twins!), trains, hats, gloves and libraries. It's no wonder Beauty and the Beast is my favorite Disney cartoon...it too, fits this bill.The book wasn't perfect, but how can anything be? I wasn't ready for it to be over, exactly, but begining to understand on my own, which is the sign of a worthwhile mystery. No mystery should be impossible to unravel--it's all about the story, the trail of the ribbon, as apposed to simply the unvailing. I loathe totally impractical silliness in mysteries. I much prefer a long lineage of a well oiled, detailed distraction. Very good book.PS: there was a stone cottage, too. I do love that, too."}, {"userName": "Lizzy", "userReviewDate": "Jan 13, 2017", "userURL": "http://www.goodreads.com/user/show/30575403-lizzy", "userReview": "I hate not to finish reading a book I've started, so I went on and finished it fast. Sigh. I really wanted to like The Thirteenth Tale, for one I was reading with my friend Vessey. Besides that, there was a lot in the story for me to enjoy: an antiquarian bookstore; a lonely protagonist whose best friends are books, plus a secondary character who is a mysterious, isolated writer. And some nice passages, like:\n\"There is something about words. In expert hands, manipulated deftly, they take you prisoner. Wind themselves around your limbs like spider silk, and when you are so enthralled you cannot move, they pierce your skin, enter your blood, numb your thoughts. Inside you they work magic.\"\nBut it was not enough. It might be me, but the story simply fell flat and I found myself either upset to read about how abandoned the twins were (as a mother that did not come easy) or wondering about everything else but the pages in front of me. I'm sorry Ms. Setterfield."}, {"userName": "Mary Beth *Traveling Sister*", "userReviewDate": "Feb 11, 2015", "userURL": "http://www.goodreads.com/user/show/14233569-mary-beth-traveling-sister", "userReview": "Wow! I was really surprised how much I loved this book. There are a lot of mixed reviews and it seems to me that people either. Hated it or loved it and I was afraid that I was going to be one of those that hated it. I love the Gothic Suspense genre and this book definitely is a classic so this was not the case. I loved it more than I ever thought I would. I feel that those that hated it just do not like the gothic suspense genre. The. Best adjective to describe this book would be mysterious. Vida Winters and all the other characters are all very mysterious. If you liked Rebecca by Daphne Du Maurier I would say that you will love this book. It is similar to this book. This book is a tale of gothic strangeness featuring the Angelfield family including the beautiful and willful Isabelle, the feral twins Adeline and Emmeline, a ghost, a governess, a topiary garden and a devastating fire. Vida Winter who is a famous author requests for Margaret Lee to write her biography Margaret Lee at first refrains because she has only written biographies of dead literary figures but then decides to do it. The author has always kept her mysterious past a secret from her millions of fans and the biographer is about to find out why? As the story unfolds Margaret discovers what they have in common and why she is chosen to write the biography.There is a lot of gothic atmosphere brewing throughout this book. The book discusses other books like Jayne Eyre, The Woman in White, and Wuthering Heights. I loved the twins Emmeline and Adeline, this is just a way to describe them which is written word by word in the book. \"The twins were odd. There were no two ways about it. They were strange all the way through into their very hearts.\" I also noticed that things happened in threes, throughoutthis book.Pick this book up if you are into mysteries with psychological twists and ambiance and above all suspense. This is tragic tale of arson, incest,insanity, abandonment and murder."}, {"userName": "Michael", "userReviewDate": "Nov 02, 2013", "userURL": "http://www.goodreads.com/user/show/4086118-michael", "userReview": "I got a lot of satisfaction from the dark mysteries in this old-fashioned tale, which makes homage to “Jane Eyre” and “The Woman in White.” It hooked me right from the beginning, where Margaret Lea is working in her father’s antiquarian bookstore in London and gets a letter from a famous reclusive writer, Vida Winter, inviting her to consider writing her biography. She balks because she has only written obscure biographies of obscure dead literary figures, but the letter intrigues her with its praise of the power of stories:My gripe is not with lovers of the truth but with truth itself. What succor, what consolation is there in truth, compared to a story? … When fear and cold make a statue of you in your bed, don’t expect hard-boned and fleshless truth to come running to your aid. What you need are the plump comforts of a story. The soothing, rocking safety of a life.Margaret travels to Winter’s spooky Yorkshire estate to interview her about the job. She finds the author testy and untrustworthy given all the conflicting tales she has passed to journalists about her life. But Lea changes her mind on the job when Winter confesses her tale has something to do with twins. As Margaret learned late in life that she herself was a twin whose sister died in her infancy, Winter’s tale is of compelling personal interest to her. Winter spins out her secret story over a long period of time, forbidding any questions. The tale is of twins, Adeline and Emmeline, living in an isolated gated estate in a family that has fallen on hard times. They end up mostly under the care of the housekeeper and gardener, “Missus” and “John-the-dig”. The frail housekeeper, Missus, gives up trying to civilize them : She didn’t want to see it: she tried not to see it for a long time, but in the end she realized. The twins were odd, there was no two ways about it. They were strange all through, right into their very hearts.The twins seem to be opposites: The Missus hardly knew what worried her more: Adeline’s persistent and merciless aggression, or Emmeline’s constant, ungrudging acceptance of it. For Emmeline, though she pleaded with her sister to stop tormenting her, never once retaliated. Instead, she bowed her head passively and waited for the blows that rained down on her shoulders and back to stop. The Missus had never once known Emmeline to raise a hand against Adeline. She had the goodness of two children in her, and Adeline the wickedness of two. In a way, the Missus thought, it made sense.The family doctor intervenes by getting them a Scottish governess, Hester, who institutes a regular regime. She finds reading them Bronte or Dickens has some ability to capture their attention, otherwise focused on their own little world. She has some insights, which she shares with the doctor: “The way I look at it is this,” she said. “In a number of ways, you could view the twins as having a divided a set of characteristics between them. Where an ordinary, healthy person will feel a whole range of different emotions, display a great variety of behaviors, the twins, you might say, have divided the range of emotions and behaviors into two and taken one set each. One twin is wild and given to physical rages; the other is indolent and passive. One prefers cleanliness; the other craves dirt. One has an endless appetite for food, the other can starve herself for days. “I don’t see this information as a spoiler. For both Margaret and the reader, it is merely the stage for the mystery:I thought about the story. I had warmed to the Missus and John-the dig. Charlie and Isabelle made me nervous. The doctor and his wife had the best of motives, but I suspected their intervention in the lives of the twins would come to no good. The twins themselves puzzled me. I knew what other people thought of them. John-the-dig thought they could not speak properly; the Missus believed they didn’t understand other people were alive; the villagers thought they were wrong in the head. What I didn’t know—and this was more than curious—was what the storyteller thought. In telling her tale, Miss Winter was like the light that illuminates everything but itself.Margaret can’t help formulating theories and in breaks from her sessions with Winter is led to do some investigating out in the world. She has hints that there was some tragic disaster involving a fire, but she can’t make the link between the people in story and the author telling the tale. Her slow unraveling of the clues she uncovers makes for an elegant and compelling narrative. Her empathy for the children in the story ties in with her own bereft origins as a twin and help propel a growing bond with the elderly declining author. I appreciated the intricate craft and emotional impact of this read, even though I am not normally attuned to Gothic tales."}, {"userName": "Melissa ♥ Dog/Wolf Lover ♥ Martin", "userReviewDate": "May 10, 2015", "userURL": "http://www.goodreads.com/user/show/17438949-melissa-dog-wolf-lover-martin", "userReview": "www.melissa413readsalot.blogspot.comThis book was so good! I can't believe I have had this book in my stacks for a few years now! The story is so bizarre and sad. I loved it! When Margaret is called upon by Vida Winter, a famous author, to come and write her biography she has no idea what she is in for with this woman. Vida tells the story of her life as a child, but she is not who she seems. The twist ending threw me right off the bus. I didn't see that one coming at all, but I should have expected something along those lines. The way the author weaves this tale is so haunting and it reels you right into the book. I can not fathom how children can be brought up this way! The story unfolds in a beautiful, well, what should be, a beautiful mansion in the countryside of London. They call the place Angelfield. This is about a family that goes beyond being dysfunctional. I want to see this on film! It is an incredibly sad story, I cried. But there is a happy ending so that is what matters. The story is a beautiful tale even though it is incredibly disturbing at times and so very sad. All of the characters and background is very rich in detail and I liked a lot of the characters. I would like to read more books from this author if they are as good as this one!"}, {"userName": "Melissa", "userReviewDate": "Oct 24, 2016", "userURL": "http://www.goodreads.com/user/show/9185509-melissa", "userReview": "Yes, this is a book for book-lovers! If I see that phrase in one more review of this one I think I'm going to scream! So just to be fun, I decided to LISTEN to this book on audio (because I'm a rebel like that... and I had severe morning sickness which rendered me unable to read 3 lines in a book without puking for over three months). It wasn't the 5 screaming stars that I was almost expecting from reading some of my friends reviews, but I did like it a lot.Our story begins when Margaret Lea, a biographer, is sent a letter from one of the most famous authors in Britain, Vida Winter. She is dying and wants Margaret to write her life story. Confused, as Margaret usually only writes biographies of long dead people, and also because Ms Winter is well known for her secrecy, Margaret decides to travel to Ms Winters estate and talk with her. Of course she agrees to write the book, and thus the tale of Vida Winter beings.And it is quite a tale. Twists and turns and more twists and some more turns, and then a MASSIVE twist which I never saw coming. But when it did come, it was a little bit too unbelievable for me. Don't get me wrong, it didn't stop the story from being fabulous, but it was just a little bit much.I found the story of the girls at Angelfield so fascinating. What a life! I really enjoyed the gothic atmosphere and all the drama.I thought Margaret's obsession with her dead sister was extremely well written and quite unnerving. It keep the tone of the novel quite brooding and dark.I didn't mind the shifts back and forth in time, and enjoyed the somewhat slow unravel of the truth.The audio version was really well done. I love when audiobooks have more than one narrator. It really helps keep the characters separate, which I believe is really important. Often when listening to audiobooks, I can get a bit lost if the narrator is a monotone and is reading all the characters in a similar voice. Different actors really enhances my listening experience! And the two women in this one were fantastic. They really differentiated the characters completely and made it extremely easy to follow.Would I recommend The Thirteenth Tale?Yes, it was well worth reading. A touch slow in parts but overall it was a gripping novel with lots of twists and turns and sometimes had unnerving subject matter.I read The Thirteenth Tale with a local book club, purchased on audible at my own expense.For more reviews check out my blogwww.booksbabiesbeing.comFacebookwww.facebook.com/booksbabiesbeingTwitterwww.twitter.com/BBB_Mel"}, {"userName": "Rowena", "userReviewDate": "Dec 23, 2011", "userURL": "http://www.goodreads.com/user/show/2990642-rowena", "userReview": "“I have always been a reader; I have read at every stage of my life and there has never been a time when reading was not my greatest joy. And yet I cannot pretend that the reading I have done in my adult years matches in its impact on my soul the reading I did as a child.” This seems to me the perfect book for booklovers. The above quote really resonated with me as I can definitely relate to it. This is an interesting story, situated in the world of literature. Famous, reclusive author, Vida Winter, requests biographer Margaret Lea to write her biography. Mysteries abound, of course, and we learn a lot about both Vida and Margaret as the story progresses.This story has a very gothic feel. Setterfield is a wonderful writer and sets the scene and atmosphere.She has such a way with words and it was really difficult for me to put the book down. However, the second-half of the book did drag on quite a bit.And this last quote is just wonderful in my opinion.“How long did I sit on the stairs after reading the letter? I don’t know. For I was spellbound. There is something about words. In expert hands, manipulated deftly, they take you prisoner. Wind themselves around your limbs like spider silk, and when you are so enthralled you cannot move, they pierce your skin, enter your blood, numb your thoughts. Inside you they work their magic. When I at last woke up to myself, I could only guess what had been going on in the darkness of my unconsciousness. What had the letter done to me?”"}, {"userName": "Cathrine ☯️ ", "userReviewDate": "Feb 27, 2015", "userURL": "http://www.goodreads.com/user/show/22600410-cathrine", "userReview": "4.5 ★Well summarized for me in Carol Birch's INDEPENDENT review: \"The Thirteenth Tale is a cleverly plotted, beautifully written homage to the classic romantic* mystery novel. Rebecca and The Woman In White spring to mind, but especially Jane Eyre: a book that Setterfield weaves into the substance of the plot, and whose Gothic elements are skillfully reimagined in a peculiar tale of madness, murder, incest, and dark secrets.” (*romantic defined here as a mysterious or fascinating quality or appeal, as of something adventurous, heroic, or strangely beautiful')Book lovers will delight in the prominent role they play throughout the story. This passage reflects why I was so steeped in the pages.“I have always been a reader; I have read at every stage of my life and there has never been a time when reading was not my greatest joy. And yet I cannot pretend that the reading I have done in my adult years matches in its impact on my soul the reading I did as a child….When I was a child books were everything. And so there is in me, always, a nostalgic yearning for the lost pleasure of books.”So much gratification and indulgence getting lost in the pages for me. It brought back the feelings and sensations of reading the books, and others like them mentioned above, as a younger, innocent reader. I so delighted in it, that unlike my usual habit of reading one star reviews to experience the other POV, I chose to hold on to my passionate response. \"How long did I sit on the stairs after reading the letter? I don't know. For I was spellbound. There is something about words. In expert hands, manipulated deftly, they take you prisoner. Wind themselves around your limbs like spider silk, and when your are so enthralled you cannot move, they pierce your skin, enter your blood, numb your thoughts. Inside you they work their magic. When I at last woke up to myself, I could only guess what had been going on in the dryness of my unconsciousness. What had the letter done to me?\" Why, the same doing great writing and storytelling does to me. There may be imperfections in the pages but it just doesn’t get much better than this for reading enjoyment. If this was a bottle of wine, I would buy a case."}, {"userName": "Nikoleta", "userReviewDate": "Nov 15, 2014", "userURL": "http://www.goodreads.com/user/show/13362307-nikoleta", "userReview": "«Γύρνα πίσω!» φώναξε. «Θα σου πω μία ιστορία, μια καταπληκτική ιστορία!»Δε σταμάτησα.«Μια φορά κι έναν καιρό υπήρχε ένα στοιχειωμένο σπίτι…»Έφτασα στην πόρτα. Τα δάχτυλα μου τυλίχτηκαν στο πόμολο.«Μια φορά κι έναν καιρό υπήρχε μια βιβλιοθήκη…»Άνοιξα την πόρτα κι ετοιμαζόμουν για ένα βήμα στο κενό, όταν, με φωνή βραχνή από κάτι σαν φόβο, πρόφερε τα λόγια που με έκαναν να μαρμαρώσω.«Μια φορά κι έναν καιρό ήταν δυο δίδυμα…»σ. 59.Έτσι ξεκίνησε τη διήγηση της η Βίντα Γουίντερ στην Μάργκαρετ. Κ δεν θα μπορούσε να το θέσει καλύτερα. Αν με ρωτούσατε τι ήταν αυτό που μόλις διάβασα, τι ήταν «Η δέκατη τρίτη ιστορία», είναι όλα αυτά που είπε, μια ιστορία για την αδελφική αγάπη, μια ιστορία για τα βιβλία και μια ιστορία φαντασμάτων. Μερικές φορές ακραία, άλλες τρυφερή. Ένα απίστευτα καλογραμμένο βιβλίο, με περιγραφική αφήγηση, με μια πλοκή που σταθερά αυξάνεται σε ένταση και αγωνία και ήρωες τόσο περίπλοκους, τόσο καλοφτιαγμένους που με συνεπήραν. Δεν έχω λόγια, ίσως να κλείσω όπως ξεκίνησα, απομονώνοντας ένα ακόμα αγαπημένο μου σημείο και μεταφέροντας το εδώ.Ρώτησε, με την πλάτη γυρισμένη στο μέρος μου, «Και τι διαβάζεις;»(…)Τα Ανεμοδαρμένα Ύψη τα έχεις διαβάσει;»«Μμμ»Και την Τζέιν Ειρ;»«Μμμ»«Και το Λογική και Ευαισθησία;»«Μμμ»(…)Έβγαλε το θερμόμετρο από το στόμα μου, σταύρωσε τα χέρια του και έκανε την διάγνωση του. «Υποφέρεις από μία ασθένεια που προσβάλλει τις κυρίες ρομαντικής ιδιοσυγκρασίας. Τα συμπτώματα είναι λιποθυμίες, κόπωση, ανορεξία, ακεφιά(…)» (…) σημείωσε κάτι στο μπλοκάκι του, έκοψε τη σελίδα και την άφησε στο κομοδίνο μου.(…)Πήρα τη συνταγή. Είχε γράψει Σερ Άρθουρ Κόναν Ντόιλ, Οι περιπέτειες του Σέρλοκ Χολμς. Δέκα σελίδες, δυο φορές την ημέρα, μέχρι το τέλος της θεραπείας.σσ. 322-323."}], "description": "Biographer Margaret Lea returns one night to her apartment above her father's antiquarian bookshop. On her steps she finds a letter. It is a hand-written request from one of Britain’s most prolific and well-loved novelists. Vida Winter, gravely ill, wants to recount her life story before it is too late, and she wants Margaret to be the one to capture her history. The request takes Margaret by surprise–she doesn’t know the author, nor has she read any of Miss Winter’s dozens of novels. Late one night, while pondering whether to accept the task of recording Miss Winter’s personal story, Margaret begins to read her father’s rare copy of Miss Winter’s Thirteen Tales of Change and Desperation. She is spellbound by the stories and confused when she realizes the book only contains twelve stories. Where is the thirteenth tale? Intrigued, Margaret agrees to meet Miss Winter and act as her biographer. As Vida Winter unfolds her story, she shares with Margaret the dark family secrets that she has long kept hidden as she remembers her days at Angelfield, the now burnt-out estate that was her childhood home. Margaret carefully records Miss Winter’s account and finds herself more and more deeply immersed in the strange and troubling story. In the end, both women have to confront their pasts and the weight of family secrets. As well as the ghosts that haunt them still.", "title": "The Thirteenth Tale", "url": "http://www.goodreads.com/book/show/13532679-the-thirteenth-tale", "average": 3.95, "cover": "https://images.gr-assets.com/books/1337653973l/13532679.jpg", "reviews": 20137, "authors": [{"url": "https://www.goodreads.com/author/show/22665.Diane_Setterfield", "name": "Diane Setterfield"}, {"url": "https://www.goodreads.com/author/show/22665.Diane_Setterfield", "name": "Diane Setterfield"}], "type": ["Historical", "Gothic", "Writing", "Adult"], "outlinks": ["http://www.goodreads.com/book/show/410428.The_Thirteenth_Tale", "http://www.goodreads.com/book/show/13532679-the-thirteenth-tale", "http://www.goodreads.com/book/show/40440.The_Thirteenth_Tale", "http://www.goodreads.com/book/show/5868297-the-thirteenth-tale", "http://www.goodreads.com/book/show/6986999-the-thirteenth-tale", "http://www.goodreads.com/book/show/19016631-the-thirteenth-tale", "http://www.goodreads.com/book/show/9247079-trinaesta-pri-a", "http://www.goodreads.com/book/show/6904234", "http://www.goodreads.com/book/show/18040651", "http://www.goodreads.com/book/show/17571907-bellman-black", "http://www.goodreads.com/book/show/18764832-the-princess-and-the-pea", "http://www.goodreads.com/book/show/36678391-once-upon-a-river", "http://www.goodreads.com/book/show/35961726-the-other-side-of-the-river", "http://www.goodreads.com/book/show/23302130-vinterhjerter"]}