{"ratings": 280, "userreviews": [{"userName": "Donna", "userReviewDate": "Aug 15, 2015", "userURL": "http://www.goodreads.com/user/show/13244359-donna", "userReview": "3.5 stars.This was mystery, historical fiction, modern treasure hunters, family history & WWII. I like all of those things. This was creatively written. The author tied everything together so neatly into this story. It also had some great twists that kept me engaged. I liked the MC and some of the older characters. But I had a hard time with the main female character. She wasn't as well drawn as the others. Even the characters with minor roles, were better fleshed out. And the romance didn't work for me. It just seemed too simplistic and choppy. I had a hard time even picturing those two together, without any effort or understanding."}, {"userName": "Midwest Geek", "userReviewDate": "Feb 14, 2018", "userURL": "http://www.goodreads.com/user/show/2778499-midwest-geek", "userReview": "[Nobody could behave as naively as does our hero who nearly gets himself killed (again.) Also, his German girl friend does an about-face that seemed somewhat out of character, but, I suppose, blood runs deep. (hide spoiler)]"}, {"userName": "Monty", "userReviewDate": "Feb 22, 2018", "userURL": "http://www.goodreads.com/user/show/8795016-monty", "userReview": "Good solid plot driven novel which is both a strength and weakness as Henri Poincare in this second offering of the franchise is flat. I think too that I am a little read-out and filmed-out with WW2 Holocaust material. I know it's probably politically incorrect, But I get it! We should never forget either that iteration or it's contemporary manifestation(s) in various global theatres. However the dearth of material / focus upon this era runs the danger of indifference or worse still a belief that it is the only matter of the type worthy of documenting in fiction, non fiction and all matters of.literary - artistic expression."}, {"userName": "Maine Colonial", "userReviewDate": "Sep 06, 2013", "userURL": "http://www.goodreads.com/user/show/2697302-maine-colonial", "userReview": "I've lost count of how many novels I've read about the fingers of the ugly World War II past reaching into the present. It's a challenge to make a fresh story on this theme, but Leonard Rosen's The Tenth Witness shows he is more than up to the task.The Tenth Witness is a prequel to Rosen's impressive and original first Henri Poincaré novel, All Cry Chaos. Most of the action in The Tenth Witness takes place in the late 1970s, before Henri has become an Interpol agent. Henri is an engineer, and he and his partner, Alec Chin, have just landed an exciting project: on behalf of Lloyd's of London, they've built a platform from which they hope to recover the 18th-century wreck of the Lutine, a ship that went down off the Dutch coast, laden with gold bars.While out hiking, Alec meets Liesl Kraus, and their attraction is immediate. Liesl turns out to be a very wealthy young woman, the daughter of Otto Kraus, founder of Kraus Steel. Henri is soon introduced to Liesl's family, including her charming brother, Anselm, who now runs the firm's operations, and her uncle, Viktor Schmidt, whose bluff heartiness feels to Henri as if its hiding something more menacing.Henri, who has an honorary uncle Isaac who was a Jewish Holocaust survivor, is curious and cautious about the Kraus family, especially since Anselm and Viktor seem eager for Henri to become involved in some of their overseas businesses. Henri learns that Otto Kraus was a member of the Nazi Party and produced steel for the German war effort, with production fueled by slave labor. After Germany lost the war, Otto had a get-out-of-jail-free card, though: an affidavit, signed by 10 Jewish workers at Kraus Steel, swearing that Kraus had saved lives of the slave laborers; a veritable Oskar Schindler.When hints surface that the whole Kraus-as-Schindler story might not be the real deal, Henri's love for his adoptive uncle compels him to try to unearth the truth, whatever the cost to himself, his career and his relationship with Liesl. The story really takes off at this point, with Alec traveling around the world gathering intelligence. Henri spends almost as much time slogging through archival documents, and Rosen's writing makes that part of the search every bit as tense and compelling as the globe trotting.Henri's work and research take him to facilities in the third world where workers who are desperate for any kind of employment are treated only marginally better than the Nazi slave laborers, and to countries where individual freedoms and lives are sacrificed in the name of security and progress. Without being at all sanctimonious, Rosen makes us look at the situational ethics so many used during the Nazi era and ask ourselves if we are so sure we'd have done the right thing, not the expedient thing––and if the choices we make today can stand up to close scrutiny.As with All Cry Chaos, there is so much going on in this novel; murder, romance, science and technology, a chase after Nazis, and the quest for a gold-laden shipwreck. The plotting is intricate but fast-paced, the storytelling lean but with plenty of food for thought and emotion. Leonard Rosen has created an appealing and complex protagonist in Henri Poincaré, and his novels offer far more than the usual thriller or whodunnit. If you haven't read them yet, pick one and see for yourself.Note: I received a free review copy of this book."}, {"userName": "Sheila", "userReviewDate": "Aug 26, 2013", "userURL": "http://www.goodreads.com/user/show/2039269-sheila", "userReview": "Hiking the flats of the Wadden Sea can be hard work and dangerous, but author Leonard Rosen provides a wise guide in Liesel Kraus for his character, Henri Poincare. There’s a haunting appeal to heading out over land often covered by water, to see what’s really there, to take on a challenge and get away from the business of everyday life. But Poincare, having tested his physical limits on the walk, soon finds his intellect and emotions tested too, as his life and Liesel’s become more intertwined.A beautiful German home and a thriving German business provide the backdrop for much of this novel. If business associates live in Argentina, well, that’s not so strange; many Germans moved there after the war. And if Henri’s adopted uncle might almost have known Liesel’s father, that’s just the sort of pleasing coincidence that makes them seem made for each other. Except that Henri’s uncle was Jewish. When his uncle dies, the boy who loved his imaginative stories sets out across his own Wadden Sea to find the truth of a holocaust survivor’s hidden depths. The journey’s harder and more dangerous than he expects.Convincing science, history and geography anchor this tale, giving it depth and power. Vividly haunting descriptions of mudflats, Hong Kong harbors, third-world laborers and first-world affluence tie the start of the computer age to a darker time before. And Liesel and Henri’s parallel searches into the past bring as many surprises as the hunt for shipwrecked treasure.The older Poincare was a fascinating protagonist in Leonard Rosen’s earlier novel, All Cry Chaos. Here he’s convincingly youthful and idealistic, a young man learning that hidden things can be dark, sticky and hard to clean off as the Wadden Sea’s mud, but can still hold treasure. It’s a treasure of a novel.Disclosure: I was sent a free preview edition by the publisher with a request for my honest review."}, {"userName": "Ron", "userReviewDate": "Aug 24, 2013", "userURL": "http://www.goodreads.com/user/show/7028840-ron", "userReview": "I thought I had already put this one on Goodreads, so forgive me if I have! This is a \"prequel\" to his novel All Cry Chaos, which I have previously read. I had the opportunity to read a preview copy of The Tenth Witness and it is great! It tells the story of how Henri Poincare became the great detective he is. Very good plotting, very good character development and I highly recommend both of these books. Here is what Amazon says: On the night of October 9, 1799, the frigate HMS Lutine breaks apart on the shoals of the Frisian Islands off the Dutch coast. When the insurer Lloyds of London pays on the wreck, it takes ownership and plans expeditions to recoup the lost millions in gold and silver. Nearly two hundres years later, after a series of largely failed salvage operations, Lloyds tries again - this time on the strength of new technologies and a strategy devised by the gifted young engineer Henri Poincare.It is late spring, 1978. Poincare has worked to near-exhaustion preparing for the Lutine dive. Before the salvage season begins, he takes a rare holiday: a hike at low tide across the vast, muddy flats of the Wadden Sea. His guide is Liesel Kraus - smart, able, appealing...and troubled. She and her brother Anselm, directors of Kraus Steel, are haunted by a violent history that generates both rage and an enormous, corrupting wealth. The closer Poincare draws to Liesel and Anselm, the more warped life becomes until love and a death threat compel him to investigate what no one else - aside from Interpol - will. Pain as well as treasure, he discovers, can be dredged up from the past to reshape the present.The Tenth Witness, a prequel to the award-winning All Cry Chaos, is the tale of a man upended: a twenty-eight year old who rejects a brilliant career in engineering for an uncertain, darker one: international police work."}, {"userName": "Robert Pater", "userReviewDate": "Jul 29, 2013", "userURL": "http://www.goodreads.com/user/show/22629927-robert-pater", "userReview": "I’ve just finished The Tenth Witness and am left with that too-rare bittersweet aftertaste common to many bookaholics: thoroughly enjoyed this tasty and wonderful read, but disappointed that I’ll have to wait to devour another book in the Henri Poincare series. Akin to concluding a heartfelt visit to great friends. Please write more and faster, Leonard Rosen!This is a meticulously plotted mystery that is simultaneously character driven. It’s a prequel to the wonderful “All Cry Chaos” (read this!), illuminating Henri’s evolving path from a youthful, becoming-successful engineer toward becoming a gifted Interpol agent/detective.The Tenth Witness is related by Henri – and how I love well-done literature that reveals the perceptions, thoughts and conflicts of a multi-layered character in a way that only first-person POV can do – who is intelligent, thoughtful, perceptive, determined – as well as driven by an internal moral beacon.Overall verdict?: Great story, superior and tasty wording, high level of plotting, believable and interesting characters make this a great read. Even if you’re not a mystery aficionado, do yourself a great favor and read both “All Cry Chaos” and “The Tenth Witness.”"}, {"userName": "Bebe (Sarah) Brechner", "userReviewDate": "Oct 05, 2013", "userURL": "http://www.goodreads.com/user/show/10381238-bebe-sarah-brechner", "userReview": "Stunning novel that is a prequel to Rosen's All Cry Chaos. This fascinating story takes us back to the 1970s and the continuing aftermath of the Holocaust - its survivors and its perpetuators, decades later. Rosen's protagonist French engineer Henri Poincare is just starting his career and encounters the moral complexity of doing business with Germans who may have had a hand in the making of the Nazi war machine. Rosen is a superb writer who deftly provides a taut and surprising plot that provides deep insight into his characters, the European landscape of survivors of the Holocaust and the Nazi regime, and ethical dilemmas that remain very current. For Poincare, this reveals his early background and first contact with Interpol.Now, I must read All Cry Chaos at once! Highly recommended for readers who enjoy intelligent thrillers threaded with fine historical research."}, {"userName": "Stacey", "userReviewDate": "Jul 30, 2013", "userURL": "http://www.goodreads.com/user/show/1260185-stacey", "userReview": "4.5 stars. A compelling mystery with a likable protagonist, intriguing plot line, and a sense that things aren't going to end well for our star-crossed lovers. This book dives into the chilling history of Nazi Germany and the repercussions that are still evident. Henri Poincaré is investigating his family friend's past during the Holocaust, and discovers the man was once interred at a steel mill/concentration camp, living in horrific conditions. The problem? The mill was run by his current girlfriend's father.The Tenth Witness was captivating and heartbreaking. I heartily recommend it for all mystery and thriller fans."}, {"userName": "Lesley", "userReviewDate": "Jul 17, 2013", "userURL": "http://www.goodreads.com/user/show/2598826-lesley", "userReview": "(note: this was an ARC)Given that this is a prequel, I wasn't quite sure what to expect, but this was a fabulous book. Digging deeply into questions of guilt by association, the aftermath of war and its corresponding guilt for all who are left behind, and how we handle serious ethical dilemmas, especially when they impact our livelihood and our relationships, and combining those themes with a solid storyline, Rosen has produced a great follow-up to \"All Cry Chaos,\" which I loved. Poincaré's character becomes even more layered, as some of his back story is revealed. I look forward to future books with these characters."}, {"userName": "Lynn Demsky", "userReviewDate": "Oct 03, 2013", "userURL": "http://www.goodreads.com/user/show/5271724-lynn-demsky", "userReview": "This was a thoroughly remarkable, incredible read written on an staggering event that should never be forgotten (and in many cases has yet to be explained)! The book was well researched with a lot of historical realities which need to always be remembered and forgiven as everyone takes accountability for what transpired and hopefully will never happen again. And yet, as the author points out, we’re all guilty in one way or another of evil occurrences every day in our own lives! The story was well written, well plotted and ended with me thinking of what happened, how it happened, and hopefully never happens again! A real good thinking book!"}, {"userName": "David Williams", "userReviewDate": "Sep 24, 2013", "userURL": "http://www.goodreads.com/user/show/4554707-david-williams", "userReview": "A very good little mystery. Nazis and gold and adventure and questions of reconciling one's family's past. The characters are well-wrought, the pacing is excellent, and the emotion is genuine. The world is a wonky place and The Tenth Witness, though fictional, is culled from research into the actual goings-on of people, corporations, and governments--both throughout and after the rise of the Reich--in an attempt to reiterate that wonkiness.  ARC received fro free from the Author via a ShelfAwareness giveaway."}, {"userName": "Dave Hoff", "userReviewDate": "Dec 02, 2013", "userURL": "http://www.goodreads.com/user/show/11192962-dave-hoff", "userReview": "4.5, An Engineer, in 1978,using the steel from a German plant falls in love with the steel magnate's daughter, only to find her father used the slave labor of Jew & other war victims to produce steel for the Nazis. A fiction biography of this steel man was written to hide what he did for the Nazis and the Engineer uncovered it as fake. Justice won over Love, no statue of limitations on war crimes."}, {"userName": "Christopher White", "userReviewDate": "Sep 09, 2015", "userURL": "http://www.goodreads.com/user/show/39133078-christopher-white", "userReview": "Interesting enough to keep me engaged...an investigative book that is heavy on Continental nuance, and shows how a web of lies can be very difficult to cut through, and how destroying that web can bring collateral damage that no one expects..."}, {"userName": "Charlene", "userReviewDate": "Jul 07, 2014", "userURL": "http://www.goodreads.com/user/show/29012086-charlene", "userReview": "Really liked the actual history woven into the story."}, {"userName": "Amy", "userReviewDate": "Nov 20, 2014", "userURL": "http://www.goodreads.com/user/show/5859560-amy", "userReview": "A totally different look at WWII and the nature of evil. Advertised as a mystery/thriller, but there's enough morality and grey areas that a Bookclub might enjoy a discussion."}, {"userName": "Judy", "userReviewDate": "May 17, 2017", "userURL": "http://www.goodreads.com/user/show/7409820-judy", "userReview": "It's too bad that Leonard Rosen hasn't written more books. I've read his two published books and think they are terrific. This book was written in 2013, and has all the makings of a great series. But I'm afraid illness or something beyond his control has kept him from writing more. Rosen crafts an interesting if not unusual plot that has Henri Poincare searching old Nazi records, and visiting surviving Jews where he hopes to find out more about a favorite uncle who recently died. Complications arise when he becomes romantically involved with Liesel Kraus, member of the Krause Steel company. Henri's searching leads him to Nazi involvement of family members. As Henri locates where people are that can tell him about his uncle, they dies before he can reach them. Their deaths are only suspicious to Henri. They are other story lines that add to the intrigue and make a great read. I would live to read more from Rosen."}, {"userName": "Betsy Baird", "userReviewDate": "May 15, 2018", "userURL": "http://www.goodreads.com/user/show/3401907-betsy-baird", "userReview": "This was the audible edition and the narrator seemed wrong for the story--less like a teller of tales and more like listening to a newscast of events. I also felt the book was less story and more moral lecture. So it was ok, but if I'd heard this one first, I wouldn't have listened to the other one--which I really enjoyed."}, {"userName": "Steve", "userReviewDate": "Sep 09, 2013", "userURL": "http://www.goodreads.com/user/show/6424654-steve", "userReview": "One of the worst books I have read in years (1) clunky dialogue and scene descriptions. It is kind of hard to believe that Rosen teaches writing. Examples are almost too numerous to mention. \"That night Liesel nearly consumed me in bed.....We thrashed\". Liesel is the woman that our hero, Henri Poincare, falls in love/lust with basically over one weekend, and that sets the arc of the rest of this unrealistic story into motion. Another from a scene in which Henri is talking to a seasoned war crimes investigation veteran who has just reflected on how many Nazis got away with their crimes, \" The number hung in the room before it died, and for a moment Plannik wouldn't meet my eyes. Watching him was like watching the time-lapse decay of a corpse, from life to bloat to festering flesh to bone\". Ugh. For more cringe inducing sentences, just read the book. There is at least one on every page that will send shudders up your spine 2) the all good versus all bad guy approach. Our hero, Henri Poincare, walks on the side of angels. The same goes for everyone he knows or reflects on from his childhood. Everyone is intelligent, industrious, honest, frugal (at one point Henri turns down the offer to fly to Argentina to meet with government representatives on a project so that they won't have to pay for his expenses. This is mentioned twice in the book), loving, they all love children, ethical. And, of course, his father was part of the French Resistance. Perhaps in an effort to provide balance, Rosen does throw in a scene where our hero has a momentary lapse and thinks ill of a Roma woman that he meets. This so upsets him that he walks the streets through the entire night, until dawn. He wanted to walk in order to \"drain the swamp of his self disgust\". He pushed on, \"hoping to numb myself\". And then there was another very brief scene where an older Jew made a derogatory statement about a black family. I suppose it could be said that the point of these is that this looking down on other groups could happen to anyone but both of these scenes felt like they were thrown in without much thought and did not really fit in to the overall narrative. And then on the other hand, the Germans (and their heirs, by virtue of inheriting anything from their parents and grandparents) were bad (there was only one good German in the book, not counting children, and that was the aforementioned Plannek, who is apparently turning into a corpse right before our eyes anyway. Our hero, Henri, reflects on \"the evil German seed\"). Also bad were the Catholic Church, the CIA, the OSS, most of South America, especially Argentina, the International Red Cross, and the Grimms' Fairy Tales. So righteous was our hero, Henri, that unless his love/lust interest, Liesel, responds to a reading from an objectionable Grimms story in exactly the way he thinks she should, he would leave her immediately 3) The Marathon Man. Everyone remembers the Marathon Man story, where a desperate ex-Nazi corners Dustin Hoffman (in the movie) in an abandoned warehouse and, using a dentist drill, tortures him while continually asking \"is it safe, is it safe?). In this book, we have a desperate ex-Nazi who corners our hero, Henri, in an abandoned warehouse, and inflicts torture (though luckily not on our hero, but on someone else, after reverse-clamping our hero's eyelids open so that he has to watch!), in order to make sure that it is safe for the Kraus family to carry on their business interests as they have been and to not have their past dug up. I am not making this up. The only thing missing is the footrace, where the Dustin Hoffman character, a distance runner, tries to escape by outrunning a sprinter. That was actually pretty exciting, especially in that book, and this plodding book could actually have used some of that excitement. Much of the rest of the story involves a sunken frigate, a sunken u-boat, the hunt for a missing person who can provide some testimony to what went on in the 1940's (the 10th witness), but I had minimal interest in that as I approached the end of the book. It appeared to me that Rosen was basically trying to highlight the many wrongs that happened to the Jews during and after WWII. And that is fine. It's just that he built a pretty skimpy and unbelievable story, with poor writing, to infuse into those facts.I actually did enjoy his first book, All Cry Chaos. I know that that was one of the books that was nominated for an Edgar for Best First Novel By An American Author. That award was given to Lori Roy for Bent Road, which I thoroughly enjoyed as well. Lori Roy, on the other hand, has written a second book which is also riveting (Until She Comes Home), whereas Leonard Rosen has produced a clunker.For really insightful stories into this time period, both of which are family stories passed on to their children both in writing (letters, diaries, etc.) and orally and gives you a real feel for what the Jewish population went through during and after WW II, I would recommend 1) I Kiss Your Hands Many Times - Hearts, Souls, and Wars in Hungary by Marianne Szegedy-Maszak and 2)Made In Hungary - A Life Forged By History by Maria Krenz."}, {"userName": "David Kinchen", "userReviewDate": "Sep 12, 2013", "userURL": "http://www.goodreads.com/user/show/21334604-david-kinchen", "userReview": "What does a writer do when his debut mystery novel is praised to the skies, nominated for almost all the awards and loved by the critics? In the case of Leonard Rosen, whose 2011 mystery \"All Cry Chaos,\" featuring engineer turned Interpol agent Henri Poincaré, did all that, you turn around and write a prequel, \"The Tenth Witness\" (Permanent Press, 288 pages, $29.00, also Kindle edition) showing how it all began. It's the late spring of 1978. Poincaré is a brilliant mechanical engineer, only 28 years old, who has designed a steel platform enabling divers to retrieve treasure buried at sea. Born in 1950 to a family who fought in the French Resistance against the Germans, Poincaré has no memories of the war, other than what he's learned from survivors and read.  Two centuries before, in 1799, Lloyd’s of London insured an English frigate, the H.M.S. Lutine that sank off the Dutch coast with a cargo of a thousand gold bars; in 1977 Lloyd's hires Poincaré and his partner Alec Chin and their fledgling firm to build a platform to try to recoup their loss. Poincaré falls in love with Liesel Kraus, who, with her brother Anselm, runs a huge Munich steel company founded by their father, Otto Kraus. Like other industrialists, Kraus was arrested for investigation of war crimes at the end of World War II. Krupp, Bayer, Siemens, I.G. Farben -- as well as the operators of American companies like General Motors and Ford -- were all investigated by so-called deNazification organizations. Unlike some of the others, Kraus, a member of the Nazi party, had what could be called a \"Schindler Defense\"; Like the famous Oskar Schindler, Kraus was said to have protected the workers at his plant from the Nazi killing machine. Kraus had obtained an affidavit from ten Jewish workers at the steel plant attesting to his fair treatment of workers -- slave laborers, to be blunt -- at the plant. Kraus, according to the ten witnesses, did everything he could to make life easier for the residents of the adjacent concentration camp who walked to work at the plant. The steel for the diving platform comes from the postwar re-creation of Kraus' steel mill, financed mysteriously (the financing of the new plant is a spoiler, so I won't go into it). The involvement of the Kraus company leads to Henri meeting and falling in love with beautiful (naturally!), smart and capable 30-year old Liesel. When Henri's uncle dies, Poincaré discovers he was one of the laborers in Kraus' steel mill, which leads him to probe into the past. Anselm Kraus and a mysterious group of Germans, some of who live in Argentina, don't like this probing and they set about tracking Poincaré's movements. The plot thickens when he travels to Argentina at the invitation of the government with plans for a platform similar to the one in Holland, to rescue treasure from a sunken ship in the treacherous Rio de La Plata. Sickened by what he sees in Argentina, run by the generals conducting the \"Dirty War\" after the death of Peron, Henri tells the government officials that the plans he drew for the platform in Europe won't work in the river. He pays off the government official and goes back to Europe to tell Alec Chin. Fortunately, the thriving firm of Poincaré & Chin Consulting Engineers doesn't need the relatively small fee that would have come from selling the blueprints to the Argentines. In the manner of Alan Furst and Martin Cruz Smith, Rosen is expert in recreating the WWII period and explaining the involvement of Americans, in the form of Operation Paperclip, which brought a user of slave labor named Wernher von Braun (1912-1977) to the U.S., along with dozens of German scientists, as well as the machinations of the O.S.S., the predecessor of the C.I.A.  The skirts of the Roman Catholic Church, and the International Committee of the Red Cross (ICRC) are far from clean, Rosen writes, describing how both organizations formed \"ratlines\" to facilitate the escape of the Nazis to the Arab countries and South America. Of course, the reality of the times -- the Cold War -- led to most of the war criminals continuing to live prosperous, Mercedes-Benz driving lives in West Germany. Rosen deals deftly with the children of the war criminals and how they live with themselves and their knowledge of the crimes committed by their relatives. Combining history and suspense, \"The Tenth Witness\" is an outstanding novel that will provide revelations of monstrous crimes against humanity committed by people who mostly got away with it, along with their American corporate partners in murder. Guess who sought reparations after the war from the U.S. government for bomb damage to their German operations, Opel and Ford Werke: You guessed it, G.M. and Ford respectively. Now that's what I call chutzpah! For more on this sordid (and largely unknown) part of our history: http://www.rationalrevolution.net/war..."}, {"userName": "Ashley", "userReviewDate": "Feb 19, 2014", "userURL": "http://www.goodreads.com/user/show/28820519-ashley", "userReview": "I do love a good thriller – so, why not try a historical thriller?THE TENTH WITNESS by Leonard Rosen offers up a gripping tale of lies and deceit – come read why you’ll be swept away by a thriller that has ties to Nazi Germany, a 1700 gold-packed sunken freighter, racial hatred and the lies that intertwine all three together.Release Date: September 2013Publisher: The Permanent PressDisclaimer: Novel received for review purposesGoodReads Synopsis: On the night of October 9, 1799, the frigate HMS Lutine breaks apart on the shoals of the Frisian Islands off the dutch coast. When the insurer Lloyds of London pays on the wreck, it takes ownership and plans expeditions to recoup the lost millions in gold and silver. Nearly two hundred years later, after a series of largely failed salvage operations, Lloyds tries again – this time on the strength of new technologies and a strategy devised by the gifted young engineer Henri Poincare. It is late spring, 1978. Poincare has worked to near-exhaustion preparing for the Luntine dive. Before the salvage season begins, he takes a rare holiday: a hike at low tide across the vast, muddy flats of the Wadden Sea. His guide is Liesel Kraus – smart, able appealing…and troubled. She and her brother Anselm, directors of Kraus Steel, are haunted by a violent history that generates both rage and an enormous, corrupting wealth. The closer Poincare draws to Liesel and Anselm, the more warped life becomes until love and a death threat compel him to investigate what no one else – aside from Interpol – will. Pain as well as treasure, he discovers, can be dredged up from the past to reshape the present.Review: This is the second novel in the ‘Inspector’ Henri Poincare mystery series, but THE TENTH WITNESS is a prequel, explaining how Poincare became to be. Seeing as I haven’t read the first novel in the series, ALL CRY CHAOS, I was initially skeptical. But no worries, you don’t need to have read the first novel to understand what’s going on here or get insight into the characters.Henri has been hired as a mechanical engineer to aide in the scouting of the sunken ship, the HMS Lutine. Sunk with hundreds of bars of gold on board, Henri works himself to tire and is in much need of a vacation. He takes a hiking trip with the beautiful guide Liesel Kraus – the director of the multi-national company Kraus Steel. Henri and Liesel fall into a relationship before Henri can learn the truth: Kraus Steel, and Liesel’s father and extended family, have historical ties to the Nazi Party, and was originally a working camp that harboured prisoners. Yet, an affidavit signed by 10 witnesses excludes Liesel’s father from any Nazi wrongdoing, proclaiming him to be on par with the heroic actions of Schindler. Henri remains suspicious – with prisoners of the work camps within his family, he cannot let go of the idea that his girlfriend’s family might be behind some of the most atrocious crimes of the past century. Can Henri really get to the truth behind Liesel’s family? And what’s happened to those 10 witnesses?First things first, the story is remarkable written. Rosen has a distinct flair for words without being overly dramatic. His story jumps off the page and truly turns into reality upon first reading.Secondly, Rosen has breathed life into the historical genre. THE TENTH WITNESS takes an industrialized approach to the crimes of Nazi Germany, a side that I, myself, knew little about. Rosen does well speaking about the war, and the hardships faced by many after the conclusion and liberation of the interred prisoners of war, and labour camp survivors. Again, not often visited upon by recent authors. Rosen has also taken great lengths to ensure historical accuracy within his novel, and it’s frightening some of the truths he puts forth here.The book itself deals with a bevy of different ideals – greed, evil, racism, murder, and lies. I enjoyed how Rosen weaved a tail out of a shipwreck in the 1700′s and made it relevant to his story. Truly ingenious.I enjoyed the characters Rosen put forth, as well. Henri is a great protagonist, with a solid ‘detective’ head on his shoulder. Liesel’s extended family play a really good part – it’s through them that we see glimpses of the fascist nature of the Nazi regime, and how it continued to play a role even after the end of the war. Liesel herself is good as a love interest, but her inherent lack of foresight and her blindness to her father’ ways are infuriating (but that’s how it’s meant to be).The only problem I had about this novel is that there are extended periods of talk about civil engineering, shipwrecks, mechanical engineering and chemistry – all that went right over my head. Does it take away from the story? Not really. It shows how in depth Rosen’s research into said subjects research was."}, {"userName": "msleighm", "userReviewDate": "Sep 10, 2013", "userURL": "http://www.goodreads.com/user/show/5025432-msleighm", "userReview": "This book was a giveaway by the author. I would like to thank Len Rosen *very* much for sharing his book with me, taking the trouble to sign it, and include a personal note. I try to keep my \"good books\" in perfect condition; this book, has been well read and well loved. The note included is still tucked in it's pages.Let me start by saying, I read this book in two long sittings; unfortunately they were not all that close together. It wasn't that I didn't want to get back to the book (like some others), life just interfered. Once I did complete it, I had to sit with this book for a long time. Two weeks to be precise. It tackles themes that I've been questioning recently myself; the book does a beautiful job exposing them like a flower with the petals opening, exposing a new thought, a new way of looking at the situation, a new conundrum. The love story is stunning and powerful; as are many of the relationships, grandparents, parents, and children, \"uncles\" who are not related by blood-but by love, war comrades, and enemies across generations.It was fascinating to read a book written completely from the European point of view. All of the primary players are European, though there are travels to other continents, and important discoveries made during those trips. Through the characters we see both war torn Europe during WWII, and the lingering effects on the population in the late 1970's (not just in Europe, but worldwide).I tend to avoid most books written by European authors (the exception being books about books, such as Shadow in the Wind or The Club Dumas), however Mr. Rosen is an American, therefore his writing does not have the affected, pretentious tones that I find in so much European literature. This book is a prequel to his \"much-honored debut\" All Cry Chaos (which, luckily I had not already read, since I *hate* reading books in a series out of order, regardless of when they were written). All Cry Chaos was the winner of two Awards, and a Finalist for three, including the highly prestigious Edgar Award for Best First Novel. I am now looking forward to getting it and finding time to read it!I did notice on GoodReads that The Tenth Witness is shown as Henri Poincaré Mystery #2; since it is a prequel should it not be #.5 if All Cry Chaos is #1? Curious about that. You can find this review and more at my Blog MsLeighM Books at http://msleighmbooks.blogspot.com/201..."}, {"userName": "Zohar - ManOfLaBook.com", "userReviewDate": "Jul 19, 2013", "userURL": "http://www.goodreads.com/user/show/3780991-zohar---manoflabook-com", "userReview": "The Tenth Wit­ness by Leonard Rosen is a novel fea­tur­ing Henri Poin­caré. My under­stand­ing is that this is the sec­ond in the series, how­ever this is a stand­alone book and is a pre­quel to the first in the series.Engi­neer Henri Poin­caré works hard to try and bring up the frigate HMS Lutine which went down almost 200 years before with mil­lions worth of gold in its belly. As a reward for his hard work, Henri takes a break and hikes at low tide across the Wad­den Sea. Henri gets to know his guide, Liesel Kraus who is a direc­tor at Kraus Steel and is still haunted by a vio­lent his­tory and cor­rupt­ing wealth.The close Henri and Liesel get, the more Henri real­izes that his recently deceased “uncle” had a sad his­tory with Krauss Steel dur­ing World War II.I did not know what to expect from The Tenth Wit­ness by Leonard Rosen, I knew it was World War II but that’s just about it. What I got was an excit­ing glo­be­trot­ting mys­tery, ex-Nazis, Inter­pol and a love story to boot.This is a very well writ­ten story with engag­ing and real­is­tic char­ac­ters. While the novel takes place sev­eral decades after World War II, the plot hangs on the zeal, secrecy and ruth­less fas­cist men­tal­ity of the Nazis. The plot unwinds very fast and the author cap­tures the atmos­phere and exotic locals masterfully.Even though the book does not take place dur­ing World War II, but refers to it in hind­sight, it does deal with the after­math of the war and the many moral issues which it brings up. The author links the Nazi slave camps with 1970s third world fac­to­ries and facil­i­ties who exploit work­ers much like the rob­ber barons did to the Chi­nese immi­grants in the US, when work­ers got paid a salary which was not even enough to rent a room from the company’s hotel or buy food in the company’s store. Instead of look­ing to please Hitler, these same type of peo­ple are look­ing to line their pock­ets on the backs of those who work sim­ply to make a few pen­nies a day if they’re lucky.The book deals with dif­fi­cult sub­jects, whether it is evil, racism, or greed. The prag­matic pro­tag­o­nist learns some dif­fi­cult lessons dur­ing his jour­ney and dis­cov­ers that the human race is not easy to judge.Dis­claimer: I got this book for free.For more reviews and bookish posts please visit http://www.ManOfLaBook.com"}, {"userName": "Brenda", "userReviewDate": "Mar 27, 2014", "userURL": "http://www.goodreads.com/user/show/2429900-brenda", "userReview": "This book is not my normal read. I was a little slow getting into it but as soon as I got interested in the characters who were very well written and the rhythm of the book, I finished it in two days. I usually read chic lit, historical romance, fiction, that type of thing. This book was such a surprise to me that I wanted to continueing reading it and finish to find out what happened at the end. The book got five awards for a first book by an author. I can see why! I believe anyone who was interested in WWII before and after and the way the Nazi's used people as slaves to get anything done they wanted to and if those people died they would just replace them with more! This is the book for you!As seen here on good reads the description of the book:On the night of October 9, 1799, the frigate HMS Lutine breaks apart on the shoals of the Frisian Islands off the dutch coast. When the insurer Lloyds of London pays on the wreck, it takes ownership and plans expeditions to recoup the lost millions in gold and silver. Nearly two hundred years later, after a series of largely failed salvage operations, Lloyds tries again - this time on the strength of new technologies and a strategy devised by the gifted young engineer Henri Poincare. It is late spring, 1978. Poincare has worked to near-exhaustion preparing for the Luntine dive. Before the salvage season begins, he takes a rare holiday: a hike at low tide across the vast, muddy flats of the Wadden Sea. His guide is Liesel Kraus - smart, able appealing...and troubled. She and her brother Anselm, directors of Kraus Steel, are haunted by a violent history that generates both rage and an enormous, corrputing wealth. The closer Poincare draws to Liesel and Anselm, the more warped life becomes until love and a death threat compel him to investigate what no one else - aside from Interpol - will. Pain as well as treasure, he discovers, can be dredged up from the past to reshape the present.The Tenth Witness, a prequel to the award-winning , is the tale of a man upended: a twenty-eight year old who rejects a brilliant career in engineering for an uncertain, darker one: international police work"}, {"userName": "Kathie", "userReviewDate": "Jun 08, 2015", "userURL": "http://www.goodreads.com/user/show/21937132-kathie", "userReview": "Were you expecting something like \"All Cry Chaos\"? This is quite a different offering from Leonard Rosen. At least I thought so. The book is set in the 70's before Detective Poincare was a detective. He had studied mechanical engineering and was in a start-up partnership with Alec Chin (P&C Engineering) designing and building a platform to salvage gold from a sunken vessel for Lloyd's of London just off the coast of the Netherlands. He meets and falls in love with a young woman, Liesel Kraus, whose family of German industrialists have a home in the area. At the same time, he loses a close friend and uncle of sorts(Isaac, a Holocaust survivor), to heart disease. After the funeral Henri comes across a box of items that Isaac had given Henri over the years. Each had a story to go with it, except one - a medallion. The medallion becomes a clue in a mystery that involves Isaac, other Holocaust survivors, and Otto Kraus, Liesel's grandfather. The mystery is interesting in itself, taking us around the world, but the issues that arise - what does it mean to be a German today, how are those descendants from the men and women who fought, died or survived WWII and the Holocaust supposed to be today, do we suppose ourselves so much more evolved than they were, etc? - those are the questions which make this book an entirely different thing than Rosen's first novel. As a babyboomer of partial German heritage I have thought and do think about these things. I live in America and my family has too since the late 1800's, but what would it be like to be German today in Germany? And when our own government's actions swerve from the path we believe in, what is our reaction, our recourse, our responsibility? Each of the characters in the novel have answered these questions for themselves. Now it is up to us. I found \"The Tenth Witness\" a tense, thought provoking novel and thank Rosen for writing it."}, {"userName": "Kendra", "userReviewDate": "Jul 16, 2013", "userURL": "http://www.goodreads.com/user/show/11547182-kendra", "userReview": "(This was an advanced reader's copy)The protagonist in this book is Henri Poincare, a young engineer who designed the platform by which an attempt will be made to salvage an old sunken frigate off the Dutch coast. Before the salvaging operation begins, Henri takes a break & goes on a guided hike across the muddy flats of the Wadden Sea at low tide, during which he meets Liesel Kraus. Liesel and her brother, Anselm, own Kraus Steel which was started by their now deceased father, who they idolize. As Henri falls in love with Liesel and is drawn into the circle of the Kraus family and friends, he becomes suspicious about the company's beginnings and its connection to the Nazi regime. Through his investigation, Henri learns of the company's sordid beginnings, its use of Jewish slave labor during World War II, its connection to a much loved friend of Henri's family, and its current shady business practices in third world countries. As Henri investigates on his own, putting his own life in danger, he learns of past Nazi war crimes, the current whereabouts of some of those criminals, and must examine his own attitudes and conscience in the process. Through tight plotting, excellent character development, and a wonderful story, this was one of those books that I wanted to keep reading right through to the conclusion, but was so sorry when it ended because I enjoyed it so much. Luckily for me, I have not yet read Mr. Rosen's first book \"All Cry Chaos\" (which from what I understand actually takes place after the story in this book), but which I was compelled to purchase before even finishing this one. Thank you Mr. Rosen, for beautifully written, engrossing story. I can't wait to read more!"}, {"userName": "Sierra", "userReviewDate": "Jan 27, 2014", "userURL": "http://www.goodreads.com/user/show/8842467-sierra", "userReview": "Reviewed by A Simple Taste for Reading:http://simpletasteforreading.wordpres...What an interesting, thought provoking book. It’s the story of a young French engineer, Henri Poincare, who in the 1970′s has designed a dive platform for searching for a sunken ship off the coast of Germany. While there he meets and falls in love with a German woman named Liesel Kraus who comes from a wealthy industrialist family. Her family got it’s wealth got it’s start during WWII making steel from Hitler and the Nazis. Henri is hired by Liesel’s brother to develop a way to extricate gold from old computers, but is troubled by the murky history of the family. When his adopted uncle, who had survived a concentration camp, dies, Henri is compelled to find out the story of the past that his uncle was never able to talk about. During his exhaustive research, Henri discovers connections between the Kraus family and the Nazi war effort, through 10 witnesses, who are now strangely dying off, declared that Otto Kraus, the family patriarch, had been of great help to the Jewish slaves who worked in the mills.Along the way Henri has questions not only about the Kraus family, but about his own ethics as well. Is the expedient thing also the right thing, or is that only something he tells himself? How Henri deals with the truths he discovers was as fascinating as the mysteries he solved.This book is a prequel to the author’s previous book, All Cry Chaos, in which Henri is an older man, working for Interpol and on the verge of retirement. I hadn’t heard of this book before, but I will have to read it now that I have read this!"}, {"userName": "Kelly", "userReviewDate": "Sep 19, 2013", "userURL": "http://www.goodreads.com/user/show/9077138-kelly", "userReview": "See this review on 1776books.net...http://1776books.blogspot.com/2013/10...For some reason that I am still trying to figure out, I found that I could not read more than a chapter at a time of Leonard Rosen’s The Tenth Witness. On vacation, I was planning to read the last half but was just too relaxed on the beach to conquer the challenging read Rosen throws our way. I think what made it so difficult for me was the combination of scientific and engineering principles coupled with trying to keep numerous characters straight.The Tenth Witness is the prequel to the award-winning All Cry Chaos, which also features Henri Poincare as the main character. In the latest novel, we go back in time to show how Poincare became an agent for Interpol. On a barge in Germany, he and his engineering partner think they are sitting over a shipwreck filled with gold. As Poincare is leading the expedition, he meets and falls in love with Liesel Kraus, the wealthy daughter of the late steel tycoon, Otto Kraus. Otto had been compared to Oskar Schindler during the Holocaust, but research Poincare discovers points to the fact that he was anything but helpful to the Jews. These findings put him in serious danger with the Kraus family and their friends, who will do anything to keep this secret hidden.This is a difficult book to get through and almost seemed disconnected at times. Some parts had my heart pounding and some were very dry. However, the ending really makes up for it and was the best part of the book.MY RATING - 3"}, {"userName": "Don", "userReviewDate": "Dec 28, 2013", "userURL": "http://www.goodreads.com/user/show/3370104-don", "userReview": "A genre-bender. We seem to have a need to categorize fiction by genre, maybe to find comfort in the familiar. Nominally a mystery, the Tenth Witness is also a story of family loyalty where family has gone bad and undersea treasure hunts. It is also a polemic against business at the expense of the health and lives of third-world workers. But more than anything else I think it is, as Rosen discussed it in a recent book club reading, a searing exploration of the dilemmas of the children of the perpetrators of war crimes -- in this case the children of fathers in Germany during World War II who as businessmen took advantage of the availability of slave- and forced labor for personal gain that would benefit their families for generations to follow. Rosen explores with a keen but sensitive eye the ambivalences of the children in coming to terms with the sins of the parents. We talk about familial love as unconditional, but how does a child honor such a parent? How does a child avoid emulating a parent perceived positively from early childhood? Even more problematic, since the children themselves may have had no role in the parent's wrongdoing, how is our perception - as possible colleagues, friends, or spouses - of the perpetrator's child affected by our knowledge of his family? The Bible presents God as visiting the sins of the fathers upon the children to the third and fourth generation, but maybe we need to understand the verse to mean that it is the sins themselves that are doing the visiting."}, {"userName": "Victoria", "userReviewDate": "Oct 30, 2013", "userURL": "http://www.goodreads.com/user/show/1388840-victoria", "userReview": "What an interesting, thought provoking book. It's the story of a young French engineer, Henri Poincare, who the 1970's has designed a dive platform for searching for a sunken ship off the coast of Germany. While there he meets and falls in love with a German woman, Liesel Kraus from a wealthy industrialist family which got its start during WWII making steel for Hitler and the Nazis. Henri is hired by Liesel's brother, Anselm, to develop a way to extricate gold from old computers, but is troubled by the murky history of the family. When his adopted uncle, who had survived a concentration camp, dies, Henri is compelled to find out the story of the past that his uncle was never able to talk about. During his exhaustive research, Henri discovers connections between the Kraus family and the Nazi war effort, though 10 witnesses, who are now strangely dying off, declared that Otto Kraus, the family patriarch, had been of great help to the Jewish slaves who worked in the mills. Along the way Henri has questions not only about the Kraus family, but about his own ethics as well. Is the expedient thing also the right thing, or is that only something he tells himself? How Henri deals with the truths he discovers was as fascinating as the mysteries he solved. This book is a prequel to the author's previous book, All Cry Chaos, in which Henri is an older man, working for Interpol and on the verge of retirement. I hadn't heard of this book before, but now must read it!"}], "description": "(Although published later, this is actually a prequel to \"All Cry Chaos.\")On the night of October 9, 1799, the frigate HMS Lutine breaks apart on the shoals of the Frisian Islands off the dutch coast. When the insurer Lloyds of London pays on the wreck, it takes ownership and plans expeditions to recoup the lost millions in gold and silver. Nearly two hundred years later, after a series of largely failed salvage operations, Lloyds tries again - this time on the strength of new technologies and a strategy devised by the gifted young engineer Henri Poincare. It is late spring, 1978. Poincare has worked to near-exhaustion preparing for the Luntine dive. Before the salvage season begins, he takes a rare holiday: a hike at low tide across the vast, muddy flats of the Wadden Sea. His guide is Liesel Kraus - smart, able appealing...and troubled. She and her brother Anselm, directors of Kraus Steel, are haunted by a violent history that generates both rage and an enormous, corrputing wealth. The closer Poincare draws to Liesel and Anselm, the more warped life becomes until love and a death threat compel him to investigate what no one else - aside from Interpol - will. Pain as well as treasure, he discovers, can be dredged up from the past to reshape the present.The Tenth Witness, a prequel to the award-winning , is the tale of a man upended: a twenty-eight year old who rejects a brilliant career in engineering for an uncertain, darker one: international police work.", "title": "The Tenth Witness\n      \n          (Henri Poincaré Mystery #2)", "url": "http://www.goodreads.com/book/show/17780324-the-tenth-witness", "average": 3.94, "cover": "https://images.gr-assets.com/books/1382921714l/17780324.jpg", "reviews": 75, "authors": [{"url": "https://www.goodreads.com/author/show/358353.Leonard_Rosen", "name": "Leonard Rosen"}, {"url": "https://www.goodreads.com/author/show/277654.Grover_Gardner", "name": "Grover Gardner"}], "type": ["Mystery", "Fiction", "Historical", "Thriller"], "outlinks": ["http://www.goodreads.com/book/show/17780324-the-tenth-witness", "http://www.goodreads.com/book/show/17233995-the-tenth-witness", "http://www.goodreads.com/book/show/38587741-the-tenth-witness", "http://www.goodreads.com/book/show/18844813-the-tenth-witness", "http://www.goodreads.com/book/show/11276223-all-cry-chaos", "http://www.goodreads.com/book/show/40383185-decisions---a-writer-s-handbook", "http://www.goodreads.com/book/show/40301081-the-kortelisy-escape", "http://www.goodreads.com/book/show/40248325-the-kortelisy-escape", "http://www.goodreads.com/book/show/40248324-the-kortelisy-escape"]}