{"ratings": 26442, "userreviews": [{"userName": "Jason Koivu", "userReviewDate": "Nov 15, 2013", "userURL": "http://www.goodreads.com/user/show/1742824-jason-koivu", "userReview": "***Read and reviewed with my niece Emma***(When she was 4 and I was 41)The greatest story ever told? Quite possibly!I think it's Emma's favorite, even though I don't think she's quite caught on to the think-ahead, strength-in-numbers, build-it-to-last concepts yet. She just seems to like to follow along with the exciting story and listen to my increasingly over-the-top Big Bad Wolf impressions. By the time we're done with this story I'm going to need a wind machine.I believe the Little Golden Book version was the one I had as a kid. The one Emma and I read was different. It lacked info on the author, who published it and when. There was nothing but the title, the story text and illustrations. Little bit odd how kids' books do that. I guess it's a public domain thing. Whatever. It matters not, because we pretty much love this story! We've read it a number of times and will no doubt continue to read it again and again."}, {"userName": "Angela Ferrari", "userReviewDate": "Apr 29, 2011", "userURL": "http://www.goodreads.com/user/show/5339220-angela-ferrari", "userReview": "The pigs know they have to build their house. But the reason Ive always loved this book is it shows the differences among the siblings and it is much like real life. There is usually one who has to take care of the others mistake and they don't ask questions, just open their doors to family. I wonder why they never went back to moms house??Theme- brothers, mistakes, survival, sticking together"}, {"userName": "Phoenix2", "userReviewDate": "Sep 22, 2013", "userURL": "http://www.goodreads.com/user/show/6542967-phoenix2", "userReview": "The three little pigs is one of the classic fairy tales that every kid knows. This book does it justice."}, {"userName": "Kimizono", "userReviewDate": "Sep 21, 2014", "userURL": "http://www.goodreads.com/user/show/34413547-kimizono", "userReview": "This is an amazing book, the story is beautiful, strongly recommend to BQ, he will love it"}, {"userName": "John Yelverton", "userReviewDate": "Jul 31, 2011", "userURL": "http://www.goodreads.com/user/show/5928256-john-yelverton", "userReview": "The all time favorite book of mine as a child. I made my father read this to me every night I loved it so much."}, {"userName": "Chloe (aka Crystal)", "userReviewDate": "Jan 31, 2018", "userURL": "http://www.goodreads.com/user/show/55308311-chloe-aka-crystal", "userReview": "different edition but wasn't sure which one... aka lazy >"}, {"userName": "Alexis Henson", "userReviewDate": "Dec 10, 2017", "userURL": "http://www.goodreads.com/user/show/50212247-alexis-henson", "userReview": "The three little pigs is a classic. It is a fun book for all. It may not have a plan win the classroom as a teaching book but it could be very fun."}, {"userName": "Desiree Zempel", "userReviewDate": "Nov 21, 2013", "userURL": "http://www.goodreads.com/user/show/12735528-desiree-zempel", "userReview": "I enjoyed \"Three Little Pigs\" by Al Dempster, because it is a little kid’s book but it also allows you to think like a kid again. I understand the authors’ message in this book. Not only what he is saying but how he feels as he writes this book. The book is told through third person perspective. The three little pigs are trying to find a way to keep their houses strong to keep the big bad wolf away. No matter what happens to the three little pigs they are always there for each other. \"Three Little Pigs\" takes place in each of the little pig’s homes. The setting is significant to the story, because it’s about the wolf trying to blow their houses down. The time period is not stated. The theme I noticed in the book \"Three Little Pigs\" was staying strong together. Not only in this book do the pigs stick together but you always need that one person by your side through everything in life. I would recommend this book to children ages five to seven and adults. This book is adorable and has cute pictures that anyone could enjoy."}, {"userName": "Janet Coba", "userReviewDate": "Oct 05, 2016", "userURL": "http://www.goodreads.com/user/show/59738396-janet-coba", "userReview": "My kids really love this book. I think they really enjoy it because they play out the story, and their dad plays the wolf. Well, most of us know how the story goes. There are three little pigs who know that the wold is coming. The three little pigs decide to go their separate ways and build their own houses. As the story continues, the wolf blows down house one and house two. The little pigsFrom house 1 and 2 run to the third house. The wolf cannot blow this house down, so he tries to force himself in. The three little pigs come up with a plan and the wolf ends up with a burnt behind and runs away.  I truly love this book especially because I have three little pigs of my own. I have three boys and they don't always see eye to eye. However, this book always reminds them how they have to sticktogether when they run into trouble. Together they are stronger then they are alone. Love this book."}, {"userName": "Jitendra", "userReviewDate": "Aug 21, 2015", "userURL": "http://www.goodreads.com/user/show/8234821-jitendra", "userReview": "Reminds you the lesson - think and work hard."}, {"userName": "Karina", "userReviewDate": "Sep 05, 2012", "userURL": "http://www.goodreads.com/user/show/12281208-karina", "userReview": "When I was a little girl I loved this book so much!"}, {"userName": "Michele", "userReviewDate": "Mar 02, 2016", "userURL": "http://www.goodreads.com/user/show/7039931-michele", "userReview": "Pretty much the perfect book for children. Sing-song parts, rhymed parts, great illustrations, and a good moral to the story. Little Golden Books are the best. Love."}, {"userName": "Maripili Gago", "userReviewDate": "Mar 05, 2018", "userURL": "http://www.goodreads.com/user/show/77144483-maripili-gago", "userReview": "This short story is about three little pigs that built three homes made out of different materials. One pig made his house out of straw, the other one out of sticks and the third brother built his house out of brick. The two first brothers were mocking the third one who made his out of bricks. This tale introduces the wolf as he approaches nearby pigs in order to eat them. The wolf destroys the house of straw and the house of sticks, as the ultimate alternative, the two pigs living in those house, were leftwithout choice as they ran to their brothers house made of brick and his brother opens his house to the other pigs. At the end the wolf couldn’t blow the house built out of bricks, so he decides to enter through the chimney and he fell and died. The main themes are patience which the book shows us that It’s not about building stuff in the fastest possible way, but about taking your time and making it right. Brotherhood can be seen at the end of the story when the third pig gave shelter to the other pigs despite being mocked earlier in the story.This story is really fascinating and I enjoy it every time I read it, it teaches us a very important lesson in life and its to not take the easy path of the road. The first two pigs, decided to make the house in the easiest possible way just to finish quickly and as the story goes by, they ended up dealing with consequences. In life we need to get stuff done, but not to only get rid of them, but to get it done in a way that they become effective. I recommend this book for kids coursing 1st grade and 2nd grade. Its never to early to show kids the importance of taking the hard way and making stuff right, rather than taking the easy way and then having to lead with the consequences. Always put your best effort in everything you do, it doesn’t matter if it’s a small or big task, its about how you do it and the effects you want to show."}, {"userName": "Eboni Johnson", "userReviewDate": "May 07, 2017", "userURL": "http://www.goodreads.com/user/show/64653203-eboni-johnson", "userReview": "The Three Little Pigs by Al Dempster is placed under Children’s Literature as a folktale. It is intended for an audience ages three to seven years. This story is about three pigs and a wolf’s journey. In the story, each pig builds a house – one of sticks, straw, and bricks. Then along comes a big bad wolf trying to fool the three little pigs - using trickery in hopes to eat the pigs. I rated The Three Little Pigs by Al Dempster five stars because of the dramatic illustrations, plot, and use of language. The illustrations capture the wolf’s evil expressions and the silliness of the pigs. The plot shows repetition, but remain exciting, and the use of language is seen through the illustrations. As a child, I loved this book – the talking animals, trying to predict what was going to happen next – the rise and fall of the plot. Young readers enjoy stories that have a protagonist and antagonist, and The Three Little Pigs is a great story to have children reenact. When reading other versions of this book I often wonder if there was ever a story telling the wolf’s side of the story – children would love to hear a version of that story."}, {"userName": "Edna Velasquez", "userReviewDate": "Dec 04, 2017", "userURL": "http://www.goodreads.com/user/show/73414232-edna-velasquez", "userReview": "NoneK- 3This book is about three little bigs who decide to go their separate ways to build their own houses after knowing that the wolf is coming. The wolf cannot blow the houses down at first but then the wolfs ends up blowing the house down and runs away. The wolf uses tricks to try to eat the pigs. The illustrations, plot, and use of language is seen through the pictures in the book. I love how the talking animals are portrayed in this book. Readers enjoy to know who the protagonist and antagonist is as the story goes in sequence. It also teaches children that it is important to stick together. 1. Have children create their own house2. Discuss with children the moral of this story after reading it"}, {"userName": "Erica", "userReviewDate": "Sep 07, 2017", "userURL": "http://www.goodreads.com/user/show/70732585-erica", "userReview": "What a fun book! I remember having my parents read this children's book to me several times for the nightly bedtime story. It is perfect for a beginning reader as well, because it has easy wording and bright colorful pictures that enhance the story as it plays along with each turn of the page. I still enjoy this book, even in my young adult life just because of the memories of my childhood it reminds me of. This book is a definite must-read."}, {"userName": "Janae' Hosley", "userReviewDate": "Sep 24, 2017", "userURL": "http://www.goodreads.com/user/show/70963276-janae-hosley", "userReview": "I remember this story as a child, I loved how it showed strength and power from the three pigs. Even though the first two houses blow down they didn't give up. This book is a classic and shows students to keep trying even when things look bad. My favorite part was when the teacher would blow just like how the book said to do. Very good interactive book!"}, {"userName": "Jeffery Worrell", "userReviewDate": "Nov 29, 2017", "userURL": "http://www.goodreads.com/user/show/70842512-jeffery-worrell", "userReview": "I like this story. It is much different from the other little pigs I have read. The ending where the wolf falls down the chimney into a big hot pot of water and then was never seen again. That was not in the other stories I read."}, {"userName": "Ariana Ahlers", "userReviewDate": "Apr 01, 2018", "userURL": "http://www.goodreads.com/user/show/77145527-ariana-ahlers", "userReview": "I decided to read this book after seeing the colorful and fun illustrations. I enjoyed the traditional story and think its one that any child should read. The illustrations are also very vibrant and appealing which makes the story even more engaging."}, {"userName": "Nakia", "userReviewDate": "Sep 07, 2017", "userURL": "http://www.goodreads.com/user/show/71195521-nakia", "userReview": "A well written book. Enjoyed reading it."}, {"userName": "Lina", "userReviewDate": "Sep 07, 2017", "userURL": "http://www.goodreads.com/user/show/71195509-lina", "userReview": "A well written book. Enjoyed reading it."}, {"userName": "Mel Ann", "userReviewDate": "Aug 25, 2017", "userURL": "http://www.goodreads.com/user/show/62302189-mel-ann", "userReview": "Our afternoon naptime story, the only way I could get him to agree to lay down. At 3 years old he reads along with the pictures all the while making himself laugh out loud with such delight."}, {"userName": "Xiao", "userReviewDate": "Nov 05, 2017", "userURL": "http://www.goodreads.com/user/show/73163701-xiao", "userReview": "Great to teach sequencing. I will have students practice retell using this book. They can draw pictures and write a sentence under the picture."}, {"userName": "Velma", "userReviewDate": "Sep 07, 2017", "userURL": "http://www.goodreads.com/user/show/71195564-velma", "userReview": "A well written book. Enjoyed reading it."}, {"userName": "Kat Wells", "userReviewDate": "Feb 15, 2017", "userURL": "http://www.goodreads.com/user/show/6305831-kat-wells", "userReview": "loved this!!!"}, {"userName": "Wai Phyo", "userReviewDate": "Jun 05, 2017", "userURL": "http://www.goodreads.com/user/show/3846942-wai-phyo", "userReview": "This is Devi's first book she read. She loves it so bad. She is 18 months old now."}, {"userName": "Florence", "userReviewDate": "Sep 07, 2017", "userURL": "http://www.goodreads.com/user/show/71195569-florence", "userReview": "A well written book. Enjoyed reading it."}, {"userName": "Isabella", "userReviewDate": "May 07, 2018", "userURL": "http://www.goodreads.com/user/show/70840167-isabella", "userReview": "Its a cute book for little kids."}, {"userName": "Pamela", "userReviewDate": "Sep 07, 2017", "userURL": "http://www.goodreads.com/user/show/71195526-pamela", "userReview": "A well written book. Enjoyed reading it."}, {"userName": "Raegan", "userReviewDate": "Sep 07, 2017", "userURL": "http://www.goodreads.com/user/show/71195474-raegan", "userReview": "A well written book. Enjoyed reading it."}], "description": "The three little pigs have never looked so cute and the big bad wolf never looked so bad in this retelling of the classic fairy tale! Vintage Disney artwork from the 1940s makes this book an important addition to every Little Golden Book collector’s library.", "title": "The Three Little Pigs", "url": "http://www.goodreads.com/book/show/140131.The_Three_Little_Pigs", "average": 4.2, "cover": "https://images.gr-assets.com/books/1388191633l/140131.jpg", "reviews": 181, "authors": [{"url": "https://www.goodreads.com/author/show/605364.Al_Dempster", "name": "Al Dempster"}, {"url": "https://www.goodreads.com/author/show/934803.Milt_Banta", "name": "Milt Banta"}, {"url": "https://www.goodreads.com/author/show/3510823.Walt_Disney_Company", "name": "Walt Disney Company"}], "type": ["Childrens", "Childrens"], "outlinks": ["http://www.goodreads.com/book/show/140131.The_Three_Little_Pigs", "http://www.goodreads.com/book/show/38674.Walt_Disney_s_Peter_Pan", "http://www.goodreads.com/book/show/1304562.Santa_s_Toy_Shop", "http://www.goodreads.com/book/show/1734663.Mother_Goose", "http://www.goodreads.com/book/show/24941060-walt-disney-s-alice-in-wonderland", "http://www.goodreads.com/book/show/7929009-walt-disney-s-pinocchio"]}