{"ratings": 29834, "userreviews": [{"userName": "Emily May", "userReviewDate": "Apr 11, 2017", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "I can’t decide if this is funny or sad, but I’ve spent so much time wanting a boyfriend that I can’t imagine not wanting one. I can imagine saying I don’t want one. But I can’t imagine it being true.\nI'm really surprised to see so many positive reviews of The Upside of Unrequited from GR members who thought Holding Up the Universe was problematic. To me, this is more of the same. This might be the author who brought us the wonderful and hilarious Simon vs. the Homo Sapiens Agenda, but these characters contained none of the charm that Simon & Co. possessed.To summarize why I didn't like this book in two points:1) I felt absolutely no connection to any of the characters. It seemed like the author put a lot of effort into creating a diverse cast, which is great, and yet she forgot to develop their personality, charms and quirks, so that they became defined by their marginalization.Molly is the most well-developed character and even that is not saying much. Who is Molly? What are her passions and interests? What does she care about aside from obsessing over her crushes and the fact she hasn't been kissed? I couldn't tell you.2) There isn't a compelling story.In fact, it's the same old story I have never liked: an insecure (plain/overweight) virgin longs to finally be kissed by a boy. Everyone else around her is “cute” or “hot” and she feels inadequate. She finally finds her worth when it turns out that a boy likes her. I don’t know if this kind of book is supposed to be empowering for bigger girls, but it felt insulting. The protagonist - Molly - is a self-proclaimed \"fat girl\" who always has crushes but never dates and/or kisses guys because she fears rejection. The story arc follows her journey to gaining self-confidence, which here occurs when her latest crush reciprocates her feelings. Is this a good message? Because, honestly, it makes me cringe.\nIt’s so many things. It’s everyone knowing you’re attracted to a guy who wears electric-white sneakers. It’s that little twinge of shame you feel when someone thinks he’s not cute. Even though he is cute. He’s actually really fucking adorable. I actually really fucking like him, and none of the other stuff should matter.\nI will say that the book has a lot of diversity - skin color, sexuality, gender identity, religion, body size, mental health - but you don't get brownie points or a pat on the back for this anymore. Diversity is just a necessity, not something a book should win an award for. Beyond this, the story and characters were extremely lacking for me. Molly's inner narrative went in tiring circles as she thought about herself, kissing boys, and back again:\nMy ego. I don’t have an ego. If I had such a giant ego, why would I have such a hard time believing Reid actually likes me?Except, if I’m totally honest, I do believe it. Reid likes me. And I like that he likes me. But I’m not used to this game. It’s this totally new way of seeing myself. Like I’m some hazily lit dream girl from a movie. I’ve never been that girl before.I really like being that girl. So, maybe I am some kind of egomaniac.\nI liked Simon vs. the Homo Sapiens Agenda so much that I will happily check out the author's future work, but this one obviously did not work for me.Blog | Facebook | Twitter | Instagram | Youtube"}, {"userName": "Adam Silvera", "userReviewDate": "Oct 14, 2015", "userURL": "http://www.goodreads.com/user/show/4050629-adam-silvera", "userReview": "I have a fierce love for this book. Molly has such a winning voice and winning heart and yup, Becky remains one of my favorite authors ever. (Just reread as an audiobook and it's amazing!)"}, {"userName": "Hailey (HaileyinBookland)", "userReviewDate": "Mar 19, 2017", "userURL": "http://www.goodreads.com/user/show/21937982-hailey-haileyinbookland", "userReview": "I loooooved this! I found it to be so relatable and just amazing. Stayed tuned for a review/discussion to hear more thoughts!"}, {"userName": "Colleen Hoover", "userReviewDate": "Mar 10, 2018", "userURL": "http://www.goodreads.com/user/show/7362767-colleen-hoover", "userReview": "I liked this book. It's been my bathroom book, if you know what I mean. DO you know what I mean? I mean, I keep it in my bathroom so when I...you know...I read. I got so sucked into this story, though, that I was in my bathroom for five hours straight. Now I can't feel my legs. But it was worth it. Counting down the days until I get to watch Love, Simon because I also loved that book and can't wait for the movie. But I'm actually going to the theater to see that movie with my book club. I'm not watching it in my bathroom. I don't think my book club would enjoy that."}, {"userName": "emma", "userReviewDate": "Apr 30, 2017", "userURL": "http://www.goodreads.com/user/show/32879029-emma", "userReview": "So...a 4.1 average rating. Heaps of praise-filled reviews. Fangirling galore. I should've liked this. What the hell went wrong?I feel like I read a totally different book. I didn’t see a swoony romance, or a relatable character, or...much of anything really. What I did see was a very f*cked-up way of discussing feminism and other social issues, intolerable teens, and a boy fixation that refuses. To. Disappear.https://emmareadstoomuch.wordpress.co...So let’s get into it. Unpopular opinion time!CHARACTERSSo the main character of this book is named Molly. She’s boy-crazy, Pinterest-crazy, and the full on worst allllll the time forever. We are trapped in the cyclical complaining of her head for 300-plus pages.Molly, despite having an astronomical number of quasi-crushes, has never been kissed, gone on a date, had a boyfriend, etc. Each and every one of those three hundred pages is dedicated to the absolute tragedy of this fact. Everything is about Molly. Molly has two moms, and on the day gay marriage is ruled as legal in the U.S., her moms get engaged. Yay! That’s so great! I love that!Molly loves it, too. For like, five freaking seconds before the whole day becomes about her. Here’s her dumb thought process: “There really is a dreaminess about today. Even our customers seem unusually coupled up. They’re all holding hands. It’s like a Valencia-filtered Noah’s ark. “And it’s nice.“Except...sometimes I feel like I’m the last alone person.”NO. NO EXCEPT. IT’S JUST NICE. THAT’S IT. You don’t have to make it about you. Trust me, we haven’t forgotten your quest to have a boy validate you. You can stop talking about it constantly for a page and just bask in the fictional recreation of a step toward equality.Among other things that Molly makes about her: Cassie’s first relationship, every interaction between Cassie and Mina, and every major and minor event in her friends’ lives. (I’m talking their relationships, their breakups, their flirtations, their sexual encounters. It never goddamn ends.)She’s also uncomfortable alllll the time. Anytime anyone mentions relationships, crushes, kissing, sex, guys in general. And anytime she’s uncomfortable, she takes the opportunity to delve into her Boy Quest for twelve more pages. It’s so exhausting. God, this book was just not fun at all.Ooh, and lest I forget: at one point, Molly blatantly uses a boy to make another boy jealous. And that’s never condemned. Cool! Let’s just treat people like emotionless objects! Speaking of which...Molly has a twin. Her name is Cassie. They do not look anything alike, as Molly tells us frequently, but they are identical in levels of terribleness! Yay!Cassie is very horrible. Because she is a total b*tch and Molly is a total doormat, Cassie frequently uses Molly to attain whatever goal she has. She uses Molly as a funny story to attempt to charm Mina, the girl she likes, while Molly is there. She decides to force Molly into a relationship with Mina’s friend Will, so she can still spend time with Molly without having to sacrifice any sexy time with her girlfriend. She continually embarrasses Molly in front of Will, by strongly implying she has a crush on him and, in one fun occurrence, telling a story about a thirteen-year-old Molly vomiting in public! Fun!She’s also a bad sister and treats Molly like dirt. Even though they have a cheesy apology scene straight out of Full House, literally none of that is resolved. Cassie stays awful and so does Molly. Yay!Mina is pretty flat. I’m supposed to think she is cool. I do not. Her friends, Max and Will, are total jerks. I am supposed to find Will charming or cute. I do not. This book is a snoozefest.Reid is...fine. I wanted to like him more than I did. There’s nothing I love more than a nerdy male love interest, but he just...didn’t do it for me. This book spends so much goddamn time wrapped up in Molly’s whining that most other characters are so flat it’s unbelievable. Like, this book felt like it was a million pages long. You’re telling me you couldn’t find time between in-depth descriptions of Game of Thrones graphic tees and edible cookie dough to give a guy a trait?But let’s talk more about the plot. Or lack thereof, I guess.PLOTThis section should probably just be blank, because there’s no plot I could discern. Nothing EVER HAPPENS. It’s just Molly whining about boys. Over. And over. And over again. If something happens, it’s filtered through the Boy Quest, and turns into fifty pages of crush analysis. Ughhhhhh.I just hated being inside Molly’s head. She’s so boring. A bunch of times people called her funny, and those were the only instances I laughed at this book. She is not funny. She is a snoozefest personified. And I know that she loves to whine and pity herself - why else would she do just that instead of solving her problems by, I don’t know, talking to her sister or friend or crush? F*ck. I’m just so glad I’m done this book.SOCIAL ISSUESThis book just...keeps trying really hard to hit the nail on the head with social issues and it just...can’t get there. It’s kind of upsetting, actually. But when I make sweeping claims, I’ll always hit y’all with that fresh evidence. Here’s the first I recorded, from page forty-five.After a loooong, boring conversation in which Molly’s cousin Abby whines about whether she’s a slut or not after having sex with the boy with whom she’s in a committed relationship, Molly hits us with the following gag-worthy interpretation of what the word slut should mean in the face of feminism: “Here’s what I would never, ever admit out loud: a part of me always thought it was some kind of a secret compliment when someone got called a slut. It meant you were having sex. It meant people wanted to have sex with you. Being a slut just meant you were normal. But I think maybe I’m wrong about that. Maybe I’m so wrong.”Ugh. See what I mean? The author is trying sooo hard. But she’s not even close! The feminist way to treat the word slut is to be against slut shaming. That’s it; it’s pretty simple. There are a million fun videos and TV episodes you can look into. But this passage essentially, like, validates slut shaming. Do what you want, ladies. Have sex or don’t, as much or as little as you want. Who flipping cares? It’s your life. (See, Albertalli? It’s not hard. Feminism is mostly about trying to free women from the restrictions on their lives. Do you understand how you’re solidifying one?)Wanna know how else I figured that Albertalli doesn’t really ~get~ feminism? This: “But I spend a lot of time thinking about love and kissing and boyfriends and all the other stuff feminists aren’t supposed to care about. And I am a feminist. But I don’t know. I’m seventeen, and I just want to know what it feels like to kiss someone.”YOU’RE ALLOWED TO BE A ROMANTIC AND STILL BE A FEMINIST. Again, like I said earlier! Feminism is about freeing up those restrictions! Feminism is about saying that women can be the stay-at-home mom, or the career woman, or a mix! Romantic or cynical or in-between! Ugh. Read an article or something. How do you not understand feminism as a woman in 2017? (Don’t answer that.)Also, see the gay marriage thing from earlier. You’re already using a step for equality as a plot device; don’t make it worse.There’s another thin line walked here. See, Molly is overweight. And like many YA girls, she’s a fat girl who doesn’t like her body. Well, she says once that she does. But she also says that while believing no boy could like her, thinking she’s incapable of having sex or looking good naked, and being incredibly susceptible to the criticisms of her grandmother.But do you see how this could be problematic? Guess what happens concurrently? Did you guess? Yup. Molly gets validation from a boy, and at the same time, looks at herself and thinks she’s beautiful. Maybe those are unrelated. I hope they are. But it seems unlikely. And that’s messed up.Ladiez, and gents, and everybody, you’re great whether or not a romantic partner is telling you that. Got it?GENERAL STUPIDITYSomething that really bothered me about this book was...totally pointless, but still. Molly always calls texts “missed texts.” Like, she’d check her phone fifteen seconds after it vibrated, and she’d be like, “I had a missed text.” No, you don’t. There’s no such thing as a missed text. Just reply to a text!Maybe that has something to do with how each and every text conversation consisted of the other person responding instantly. NOT HOW IT WORKS.Also, this book takes place in summer, and Molly’s always like, “I woke up at dawn.” Or, “Cassie woke me up early.” Sleep in! The f*ck?MINDLESS COMPLAININGBecause of who I am as a person, I also have some really mundane things that filled me with just as much anger as the most terrible character ever could. And even though they make no sense, and it’s not the author’s fault, I still want to include them. Because I have no filter. So here we are.Speaking of unpopular opinions, I flippin’ hate Lin Manuel Miranda. Every time his name is mentioned, I seize up in a cringe so debilitating I am paralyzed for the next seventeen seconds. He gives me secondhand embarrassment like I have never before experienced in my life. And the guy gets some serious name-dropping action in this book. So that was hard.Unrelated, am I the only one who doesn’t like when an author’s books all exist in the same world and they forcefully have the characters encounter each other? It feels so strange and unnatural and bleh. Like, I’m fine if they are in the same town and mention the same places, but the second the guy who makes your pizza is the male love interest from two books ago, you’ve lost me. I’m not into it.AND THE WORST SIN OF ALL: WHEN MOLLY IS TRYING TO THINK OF SONGS THAT “ALMOST RUINED MUSIC,” SHE PICKS AVRIL LAVIGNE’S CLASSIC HIT SK8ER BOI. What an IDIOT. That song is f*cking amazing. Music would have been ruined if she hadn’t graced us with the dulcet tones of that sweet, sweet tune.BUT…The LGBT+ representation in this is really great. I counted three lesbians, a bisexual, and two (barely mentioned but still) gay couples. Yes, there are still, like, a bajillion straight people, but this book represents people from the LGBT+ community like people. Most YA books follow a gay person at its center, and often their journey is the plotline. Which is really important. But equally important is having supporting and background characters be gay. That everyday inclusion matters, too. So…Bottom line: This is getting a bit extra for the representation. But I really hated everything else about this book so much.Note, 8/12/17: It was pointed out to me that I didn't mention the positives of body type diversity in this review, which is absolutely a mistake on my part and one I am immediately attempting to amend. The lack of representation in mainstream media (in all its forms) of anyone overweight is horrifying, and I am sure it is impossible to exaggerate the good this book does by centering on a fat girl who is, at the very least, depicted positively and beautifully. This representation is certainly as rare and significant as the LGBT+ representation, and any failure to discuss the positive nature of this inclusion is an absolute error by me."}, {"userName": "C.G. Drews", "userReviewDate": "Nov 11, 2016", "userURL": "http://www.goodreads.com/user/show/11375137-c-g-drews", "userReview": "So two things:(1) I'M SORRY I READ THIS SO EARLY. I'm honestly not here to brag or anything. #donthurtme But I know that if I don't review it now I will forget everything of ever and it will be embarrassing. SO. I'll keep this review spoiler-free (of course) and brief!(2) It's hard not to compare it to Simon vs. the Homo Sapiens Agenda! I shall try. I loved that book to freaking pieces and so I didn't love this one as much which is why it's just 4-stars. But I feel like it's in the shadow of it's Big Bro so. It is still a freaking fantastic book and Becky Albertalli is amazing.This book is a special little squish of a creation. It just ticks ALL THE RIGHT BOXES. It's extremely diverse (at least 50%, if not more, of the cast is queer and POC), it deals really honestly and accurately with anxiety, the protagonist is fat, it's about love but also about growing up and feeling left behind, and IT'S STINKIN' ADORABLE.The writing is, of course, BRILLIANT. Seriously I can never look away from the page. It's just captivating and beautifully written and it FEELS SO REAL. That's one of the #1 reasons I love this author's work: the dialogue is actually realistic and relatable. Which of course brings me to talking about the characters....THE CHARACTERS! OH GLORIOUSNESS. Okay, although I admit...I struggled with Molly at first. She has 30+ unrequited crushes. Like. Okay...I am not a romantic, in fact I'm so far from being a romantic that I married a bookshelf full of extremely bloody and stabby books. Ahem. SO. I didn't relate to Molly's row after row of boys she's crushing on. To me it felt a little...oooookay. But I still loved her for her totally relatable feelings that everyone around her was growing up and she just felt like SHE WASN'T. It is awkward and overwhelming. I think this book captured the way growing up can be overwhelming. OH. And Molly is a pinterest nerd. I love this. And, well, Molly is also Champion Jumper To Conclusions and that was annoying, hahah. But like aren't we all annoying sometimes? So. #realisticSo many beautiful messages too. I love how Molly's mums talked about there not being \"a specific age\" to reach milestones and achieve things. ISN'T THAT NICE TO TALK ABOUT?!? Thank you. And of course it underlined that love is love no matter what. And even though Molly had anxiety and was shy, she NEVER was forced to be less herself. Her sister told her to \"put herself out there\" and stop just pining for unrequited crushes, but there was no \"seriously Molly stop being so quiet and anxious\"....there was NO SHAMING IN THIS BOOK FOR ANYTHING. #blessit And Molly didn't have an eating disorder. She is fat. She likes food (which means she is awesome). She doesn't spend the book learning to love herself because SHE LOVES HERSELF NOW. And this was inspiring and beautiful to read.(Did I say this review was going to be short? HAHAHAHHHAHAHAHA. Sorry.)Also the romance was freaking adorable. BUT I WILL SAY NO MORE. EXCEPT: SQUEEEEEEEE.I think this book was less funny, and less nerdy than Simon Vs. Which is probably why I'm a little less in love with it. (I also FREAKED OUT when he made a teeny tiny cameo. Like ajfdksalfd I forgot how much I love Simon.) It DID, however, have much appreciation for Chocolate Mini Eggs, which I've not heard of until now but they sound like Aussie Easter chocolate Eggs???? So I am 100% FOR. I'm so glad both of Becky Albertalli's books so far have had grand food appreciation. NICE.ALL IN ALL: this is a glorious, sweet, happy and feels-good book and I LIKED IT. Which is saying something because no one got stabbed and I still liked it. Go me! I have a soul after all! (Maybe.) I still don't get how you can have that many crushes and not be a little...well, pathetic, though? (Sorry.) BUT WHATEVER. It was cute, relatable, and still had deep and poignant messages. Duuuuuude. Well done."}, {"userName": "Cece (ProblemsOfaBookNerd)", "userReviewDate": "Mar 01, 2017", "userURL": "http://www.goodreads.com/user/show/5138611-cece-problemsofabooknerd", "userReview": "Ok, I'm ready to write a full review of this now. Maybe. So many good things to say, so little time.Before I get into the quality of the book, let me just give you a breakdown of the diversity represented here because it was honestly incredible and this is the exact world that I want to see in YA contemporaries from now on.-Pansexual (on page) side character who is also Korean-American-Multiple lesbian side characters-Bisexual side character-Minor gay characters-Jewish main character, side characters, and love interest-Main character has two moms-Multiple black side characters-Although there were no on-page asexual characters, asexuality was still included as a thing that exists-Fat main character-Main character also has a history of anxiety which she is on medication for and this is brought up A LOT along with how going to parties works differently for her because of the dangers of mixing her medication with alcoholThere are so many more but LOOK AT THIS LIST. None of these characters were shoe-horned in. It was the most natural collection of people who made up this growing community for the main character and it honestly made me want to cry a couple of times because this is the world I live in and I was seeing it so naturally represented in what is going to be a highly sold YA contemporary. But now let me talk about everything else great going on here.Reading this book felt like eating one of Molly's mason jars of egg-free cookie dough and ice cream. I couldn't be mad while I was reading it. It was the most pleasurable reading experience and I spent most of my time grinning from ear to ear. Molly is a fabulous main character who struggles in such an authentic way to deal with low self esteem and feeling like everyone around her is growing up faster than she is. It was something I really identified with, remembering myself at 17. Her concerns, and the round-about way that she rationalizes how she feels left behind was excellently done and supremely authentic, in my own experience. Also, her constant struggles with self-image were really well done and she felt like a character I hadn't seen before, but one I have wanted to exist for so long now. The sister relationship. Sorry, let me rephrase that. THE SISTER RELATIONSHIP!!!!! I spend a lot of time being sad about books that don't feature siblings or close family relationships and boy was this a balm to all of that. The ups and downs with Molly and Cassie were so similar to a lot of the ways I interact with my own sister. They know exactly what words to use to hurt each other if they need to, but they will also kill absolutely anyone who so much as looks at their sister the wrong way. They can have a conversation in a glance but they can also have days where they don't know how to communicate at all. And they also have a really great relationship with their moms, who are an active part of the story. That's right, not only do they have two moms but they are participating in their daughters' lives and in the story itself! They don't vanish into whatever wasteland YA parents sometimes go while they teenage children are having life struggles! Plus, they are well-developed, live their own lives, and are honestly hilarious. My only qualms with this book come in the form of communication stuff. First of all, it seems like some of the issues in the plot could have been so easily remedied if Molly had just spoken up. I know this is often linked to the anxiety she feels and the worry that whatever she says will be shut down, but by the time I got closer to the end of the book it felt more and more like she just needed to say ANYTHING to her sister or best friend and all would be well. Also, this had an odd habit where characters would be having a really essential or meaningful conversation and it would just... stop. Molly would have some thoughts about what was being said and then we would never hear how the conversation ended. This happened a few times throughout and it did frustrate me because I thought those were really important conversations happening and I wanted to know how they ended.This was one of the most joyful books I have read in a long time. The characters talked like  teenagers  and constantly texted or brought up social media. They were funny and self-conscious and loud and confused. I'm sure you all already have this on your anticipated releases list, but if you somehow don't already: put it on there. Don't worry, Albertalli's second book doesn't disappoint. In fact, it is more than worth the wait. Now, here's hoping that the Simon movie does incredibly well so we can get a movie of this one too.*Thanks to Harper for sharing an eARC of this book with me to review*"}, {"userName": "Melissa ♥ Dog/Wolf Lover ♥ Martin", "userReviewDate": "May 29, 2017", "userURL": "http://www.goodreads.com/user/show/17438949-melissa-dog-wolf-lover-martin", "userReview": "♥ My April Owlcrate ♥\nI'm on the toilet at the 9:30 Club, and I'm wondering how mermaids pee. This isn't random. There's a mermaid Barbie attached to the door of the bathroom here. Which is a pretty odd choice for a bathroom mascot. If that's even a thing. Bathroom mascots.\nThis book had me at those first few lines and yes I'm weird and NO, I don't care. I loved this book so much =) When I first read the summary of this book, I thought I probably won't like it. Then I got it in my Owlcrate and said well, I should probably read it. Then I saw it was by the same author who wrote, \"Simon vs. The Homo Sapiens Agenda\" which I loved and I thought I'm just going to LOVE this book. And guess what? I did! =) I love when I get these young adult books that make me feel all good inside. I love them like fresh baked chocolate chip cookies! This book had me laughing out loud so hard and I really needed that, although, laughing so hard when not feeling good with a tummy ache isn't the best thing. =) I wanted to put like a million excerpts in this review but there are just too many of them! I am in love with most of the characters in the book. How can you not love them? I mean there are a couple of jerks here and there but they aren't really important. Molly and Cassie are twin sisters and their parents are two women that are the freaking coolest moms ever! They also have a little brother named Xavier. He's still a tot but Molly and Cassie are seventeen. The girls end up meeting a girl named Mina who is super nice and she ends up being Cassie's girlfriend. Then Molly meets a boy named Reid at her new job and they eventually get together. It's all so terribly sweet and funny. Molly gave both of them nicknames: Mina of the LabiaMiddle Earth ReidYou have to read the book to find out how they got these names. They have a cray grandma too. You have to read about her to get what I'm talking about. This book is full of so much stuff. Same sex marriageBody issues/weightMental health issuesOld ladies that hit people in their cars and then cuss said person outVag's Little peensDrinkingFriendshipLoveHateAll kinds of references to things/shows, etcI know I'm leaving tons of stuff out but you get the drift. I'm so happy with this book. I will read this many times. This book IS my fresh baked chocolate chip cookie =) ♥MY BLOG: Melissa Martin's Reading List"}, {"userName": "Emma Giordano", "userReviewDate": "Mar 08, 2017", "userURL": "http://www.goodreads.com/user/show/30604861-emma-giordano", "userReview": "Thank you so much, Harper Collins, for providing me with a free copy of this book to review!4.5 stars! I really really enjoyed this read. I recently read Simon & LOVED it so I was super pumped to pick up Becky's next work *that comes out on my birthday.*This was an unbelievably adorable, cute, funny, fluffy, give-you-all-the-feels kind of read. (So like, what you would normally expect from Becky) [But speaking of Becky's other books, I would definitely recommend reading [book:Simon vs. the Homo Sapiens Agenda|19547856] before Upside. It's  definitely not required  but there are some cameos that will hold no significance and seem like totally irrelevant side characters if you don't already know the history of who these characters are.]Upside was definitely a unique read! There's underrepresented body types, our MC has anxiety & takes medication for it, the MCs twin sister likes girls (specifically, a Korean-American pansexual girl), they have two moms, they're also sperm-donor babies. Molly does hold family to a higher standard than a lot of YA books as she's very concerned with her relationship with her sister but I thought it was really nice to see someone who cared to deeply for their family. It was a breath of fresh air to experience all this individuality in one book!I also feel it was a really realistic portrayal of teenagers, like REEEAALLLLY realistic compared to a lot of other YA titles. The teens drink. They talk about sex. They lie to their parents. They feel self-conscious due to a variety of factors like body image, their romantic/sexual experiences, their family and friend's view of them. They panic over issues teen do panic over in real life. They exaggerate, they feel jealousy. It held all the components of adolescence that really happen outside of fiction. It was immensely nice to see a book where teens are shown in a very truth-to-life way.There was really nothing I *didn't* like about this book per say. The only thing I can touch on is that I personally was not as emotionally invested in this story. It has nothing to do with the characters, the plot, the messages expressed, the writing or ANYTHING of that sort because I did truly enjoy every aspect of this book. It's just one of those reads that you fly through because you really really enjoy it, and you exit the story with just amusement and entertainment, which is still a really great thing!I'd highly highly recommend The Upside of Unrequited! It's definitely a fast, get-you-out-of-a-slump sort of read. I think it has a lot of strengths and would really speak to a variety of readers. Full video review to come to my channel closer to release, but definitely put this one on your TBRs for this coming April 11th!"}, {"userName": "Trina (Between Chapters)", "userReviewDate": "Aug 15, 2017", "userURL": "http://www.goodreads.com/user/show/9323164-trina-between-chapters", "userReview": "Absolutely amazing. A new all time favorite.It means so much to me to see a character who looks and thinks like myself (she's fat and has anxiety, both of which are own voices representation) in a romance story because I 100% WAS Molly at 17, pining over unrequited crushes and feeling so much insecurity about pursuing them.Aside from Molly being one of the most relateable characters I've ever read, the rest of the story held up. There are so many important discussions about weight and sexuality and marriage equality and anxiety, but there are also quieter, sweet moments that reflect REAL parent relationships and sister relationships and friendships. Becky writes the best YA parents. And I swear she captures teenage crushes in the most palpable way. And the romance, oh the romance. I see both myself and my husband in the love interest, and maybe I was relating to both the character and Molly's attraction to him, but I FELL HARD. Molly's emotions were written so well and I felt fully consumed in the build up and payoff. I appreciate how he was portrayed (nice guy, geeky, underrepresented body type) just as much as I appreciated Molly. I saw a review early on complaining that Molly's insecurities went away once she got a boyfriend and how this is bad fat rep and anxiety rep and I have to say I 100% disagree. There are two lines about Molly's self confidence improving that occur after they had gotten together but neither of the statements had anything to do with the boy in my opinion. They were directly related to breakthroughs in her relationships with her sister, best friend, and grandmother. And it was literally ONE day. People with anxiety do have high days but it absolutely does not mean their insecurities go away forever. And if you think fat or anxious people aren't allowed to feel happy when they get with someone they've been crushing on, well... I will gladly have words with you.Other rep in this book: Several Jewish characters (also own voices). Several LGBTQIA+ side characters with pansexuality stated on page. MC's family has 2 moms and is multiracial. Korean-American side character. Several black side characters. Also underrepresented body types and anxiety as mentioned above."}, {"userName": "Lola  Reviewer", "userReviewDate": "Dec 14, 2016", "userURL": "http://www.goodreads.com/user/show/14596170-lola-reviewer", "userReview": "Sex and relationships are important subjects. Teen boys and girls are especially curious about them. How does it work? How does one get a boyfriend or girlfriend? When is the right time for those two things?Molly Peskin wants to fall in love with someone and for that person to fall in love with her back very badly, but she’s scared. Her sister doesn’t seem to be daunted by anything; she even got herself a really cute girlfriend in a short amount of time.Becky Albertalli did a fairly good job illustrating themes such as first love, twin connection, equality, sexuality and coming of age, which is what this book is—a Bildungsroman. I believe, however, that this novel needed two point of views. One from Molly, which we do have, and one from her twin sister, Cassie, because, although it’s part of the story, Cassie keeps many things from her sister. Seeing unrevealed, private interactions between her and Mina would have added even more dept to this story.It honestly was enjoyable, because of all the subjects it tackles and its constant fast-pacing. Unfortunately, I did not like the writing at all. I do, however, believe Becky Albertalli writes about/analyses interesting topics using interesting references and detail, but her writing itself did not impress me in any way. It’s not elegant, pretty or special. It’s simple, unsurprising and unoriginal. Regardless, this is a book I find salient people read, exactly because of all the themes mentioned previously. It’s true that it’s a romance contemporary book, and maybe not ALL that different from the other ones out there, but what’s on the side—LGBT, sexuality, family, confidence—makes it stand out a little more.Blog | Youtube | Twitter | Instagram | Google+ | Bloglovin’"}, {"userName": "Amber Robertson", "userReviewDate": "Apr 25, 2017", "userURL": "http://www.goodreads.com/user/show/30813900-amber-robertson", "userReview": "Let's teach people that the only way to achieve high self esteem is by boys liking you back! Yeah, how about no.I don't think this author and I are a match. I'm not sure I will enjoy her books. I was so frustrated by the fact Molly was basically basing her self worth on her friends attempts to get her a boyfriend it overshadowed the rest of the plot. Not only that, but I felt this book was incredibly childish. I didn't enjoy the writing and felt myself cringing at the writing, especially the overuse of emojis in text (which had to be described, no thanks). I could see what this book was trying to achieve, but for me it fell short. This could be because I couldn't remember who the hell was actually related to Molly - my fault, I know. I also can't comment on the fat girl rep throughout this book, but from what I could see it seemed slightly harmful. The fact that she's relying on a boy for her to be happy (resulting in a bloody love triangle) is ridiculous. You're all beautiful. Fat, skinny, average (I say this to more so cover the people who are, occurring to science, the right weight for their height). It shouldn't matter. I've had a shit tonne of unrequited crushes and never have I let it impact who I am as an individual. I'm sure everyone has at least had an unrequited crush or not taken the risk when they thought someone was cute. The whole thing pissed me off. For a positive, though, I will say the final chapter warmed my heart (took the whole book) and Molly's mum's were incredibly sweet. There is also a bunch of diversity, but diversity is definitely something which should be included anyway so I'm not giving any extra stars for that."}, {"userName": "Warda", "userReviewDate": "Jun 19, 2017", "userURL": "http://www.goodreads.com/user/show/30036082-warda", "userReview": "I AM MUSH, PEOPLE! FUCKIN' MUSH! This book has made me flail with excitement several times. I LOVED IT SO MUCH! I don't think I'm going to review this book. What are reviews anyway?! Who decides they have to be coherent and whatnot? My overexcitement alone shows how perfect every single page was for me and how much I loved it. AND SO I WANT TO THROW THIS BOOK AT EVERYONE SO THEY CAN READ IT AND DIE OF CUTENESS AND HAPPINESS! GAAAH MY BRAIN IS NOT FUNCTIONING RIGHT NOW. OVER AND OUT!"}, {"userName": "Larry H", "userReviewDate": "Apr 13, 2017", "userURL": "http://www.goodreads.com/user/show/5872506-larry-h", "userReview": "I'd rate this 4.5 stars.Becky Albertalli, how do I love thee? Let me count the ways...I fell in complete and utter love with Albertalli's first book, \nSimon vs. the Homo Sapiens Agenda\n (see my original review). I devoured it in less than a day, and it was a no-brainer that the book showed up on my list of the best books I read in 2015.As you might imagine, the minute her newest book, \nThe Upside of Unrequited\n, came out, I pounced. I bought it at like 12:01 a.m. on the day it was released—I set my alarm and woke up to buy it, dork that I am. I tried really hard to keep my expectations from getting utterly out of control, because when you love an author's first book, don't you expect—and hope against hope\u0097that you'll love every one of their subsequent books, too? Molly Peskin-Suso is 17 years old. She's funny, smart, sensitive, and amazingly crafty—she can actually make the things you see on Pinterest. She makes desserts (including safe-to-eat raw cookie dough) in mason jars. She knows she has a bit of a weight problem, but everyone tells her what a pretty face she has, and sometimes her anxiety gets the best of her. But she's also a hopeless romantic—a fact that can be easily borne out by the \n26 crushes\n she's had on boys throughout her lifetime.\"There's a reason I've had twenty-six crushes and no boyfriends. I don't entirely understand how anyone gets a boyfriend. Or a girlfriend. It just seems like the most impossible odds. You have to have a crush on the exact right person at the exact right moment. And they have to like you back. A perfect alignment of feelings and circumstances. It's almost unfathomable that it happens as often as it does.\"One night, Molly's twin sister Cassie meets Mina, the girl of her dreams. (Actually, Molly meets her, but immediately knows that she's Cassie's dream girl.) For the first time, Cassie is smitten beyond a simple hook-up: Mina is relationship material. Suddenly Molly finds herself on the outside looking in—of course Cassie wants to spend time with Mina and talk about Mina, and she's totally happy for her, but she's a little sad, too. But it's not like Cassie is one of those people who throws everyone else away when she's in a relationship—one of Mina's cute hipster friends, Will, seems to like Molly, so they should totally hook up and they can double-date!Will is cute and charming and seems to think Molly's funny. And while Molly has proven that she's more than capable of having crushes on boys, with Will it seems like she's more excited about the idea of having a crush on him than actually feeling that way. Maybe that's because she's just met Reid, a chubby, adorable fan of \nGame of Thrones\n, Tolkien, and the Renaissance Festival. Reid makes her feel that way, but if she lets herself fall for him, won't it ruin everything with Cassie?\"If I had to describe the feeling of a crush, I'd say this: you just finished running a mile, and you have to throw up, and you're starving, but no food seems appealing, and your brain becomes fog, and you also have to pee. It's this close to intolerable. But I like it. More than like it. I crave it.\"Amidst the backdrop of a family wedding, a visit from their wacky, critical, slightly racist grandmother, and the emotional crises of other friends, Molly needs to decide what she feels, and for whom, before she ruins everything with everyone. Including Cassie. It's too much for anyone, much less a 17-year-old with questionable self-esteem and a history of public vomiting.I really, really enjoyed this book. Becky Albertalli drew me in on the very first page and didn't let me go until the very end, and I'll admit, I was sad that the book ended. While I'll admit I found Molly's inability to express her feelings or thoughts to anyone tremendously frustrating at times, I understand that doing so poses a challenge for anyone, especially someone who suffers from anxiety.There was just so much to love about this book—dialogue and behaviors that actually seemed teen-like, as opposed to old-beyond-their-years; the flush of excitement that accompanies crushes, first loves, and infatuation; boys I could totally see myself crushing on if I was that age; and the realistic relationships between sisters, friends, parents and children, and those who like each other. Albertalli's characters are so special and memorable that you'd love to be friends with them in real life, even if their parents are probably younger than you. (Sigh.)A lot has been made about the incredible diversity of the book's cast of characters—Molly and Cassie have two moms, one black and one white, they're being raised Jewish, characters are straight, gay, lesbian, and pansexual—but none of it seems forced, and very little of it is really a focal point. This is just a sweet, special book, about relationships, about finding the courage to believe you're worthy of love, and following your heart, not what people tell you your heart should feel.If you've not read \nSimon vs. the Homo Sapiens Agenda\n, read that, too, and you'll see why I'm a huge Becky Albertalli fan, and why I read her new book on the day it was released. (And then you can join me in my vigil for her next book.)See all of my reviews at http://itseithersadnessoreuphoria.blo...."}, {"userName": "Cait • A Page with a View", "userReviewDate": "Nov 23, 2016", "userURL": "http://www.goodreads.com/user/show/47412532-cait-a-page-with-a-view", "userReview": "This whole thing was hilariously real and wonderfully done. Let me just lay out the these characters to start with:Molly: the main character. She is obsessed with Pinterest, shops at Modcloth, is fat, Jewish, and has had 27 crushes without ever being kissed. I absolutely LOVED her character. When a guy tells her she's \"gorgeous for a big girl\" she just says \"fuck you.\" A lot of her story focuses on getting a boyfriend, but it's more of an analysis of the most relatable thoughts: \"I don't entirely understand how anyone gets a boyfriend. Or a girlfriend. It just seems like the most impossible odds. You have to have a crush on the exact right person at the exact right moment. And they have to like you back... it's almost unfathomable that it happens as often as it does.\"\"Because chubby girls don't get boyfriends, and they definitely don't have sex. Not in movies -- not really -- unless it's supposed to be a joke. And I don't want to be a joke.\" Cassie: Molly's lesbian twin sister who gets a girlfriend at the start of the story. Molly has to figure out how her relationship with her sister will evolve as they grow up. Molly & Cassie are sperm donor babies to an interracial couple (one of whom is bisexual), so the story does an awesome job of calling out some of the nonsense everyone faces. A large part of the background story revolves around the moms getting married because it's finally legal. Their family dynamic was probably my favorite part of the story... especially with their hilarious grandma who was very loving but sometimes said hurtful things despite any good intentions. All of them were just real. There were a ton of other awesome characters like Mina (Cassie's candid & pansexual girlfriend), Olivia (their friend with blue-streaked hair whose experience dating the horrible Evan Schulmeister led to some awesome feminist convos), Hipster Will (the guy everyone's trying to set Molly up with), and Reid (the adorable nerd Molly works with who wears Lord of the Rings and Game of Thrones shirts). The story itself was a pretty basic plot of testing new relationships and where you stand in the world. But Molly's hilarious narration, the realistic dialogue, and all of the characters made the book SO strong. There were so many wonderful, positive messages in here that I can't recommend it enough. I really think this will be one of the top YA books of 2017 and can't wait to see all of the love it gets!!Thank you to the publisher for sending me an ARC."}, {"userName": "Chelsea (chelseadolling reads)", "userReviewDate": "Apr 25, 2017", "userURL": "http://www.goodreads.com/user/show/16219087-chelsea-chelseadolling-reads", "userReview": "Re-read 4/24/18: Still think this was mega cute, still love me a great fat main character. Also: WOW I forgot how cute Reid is. Have mercy. This was adorable. I’m SO excited for Leah’s book now!!Original read 4/25/17: This book was mega cute. Not as good as Simon in my opinion, but still so good. And it was amazingly refreshing to read a book about a fat girl that actually accurately represents what it's like to be a fat girl and I AM SO ABOUT IT. So great."}, {"userName": "Catriona (LittleBookOwl)", "userReviewDate": "Apr 11, 2018", "userURL": "http://www.goodreads.com/user/show/5365999-catriona-littlebookowl", "userReview": "4.5 starsThis. Was. SO. Cute. There were tears of joy, such a delightful read!"}, {"userName": "Kai", "userReviewDate": "Oct 03, 2016", "userURL": "http://www.goodreads.com/user/show/41788524-kai", "userReview": "“I want to know what it feels like to have crushes that could conceivably maybe one day turn into boyfriends.”This was once again a very honest and real story by Becky Albertalli. The reason why books like Becky's resonate so much with teenagers and young adults is because in them we feel understood. We are represented. Our feelings and thoughts are valid. We see ourselves in these characters, in their struggles and in their dreams.I also love that Becky talks this openly about sex. And not just straight sex. It reminds me of Patrick Ness' novel Release. And yet again, both authors, Ness as well as Allbertalli, could've gone a bit further. Most of the time these open talks about sex and sexuality stopped in the middle of the conversation, with so many questions still unaswered. Then again, these are YA novels, not sex ed books...but still.All that is left to say is that I seriously cannot wait for Leah on the Offbeat and What If It's Us. I want them NOW.Find more of my books on Instagram"}, {"userName": "emi", "userReviewDate": "Dec 23, 2016", "userURL": "http://www.goodreads.com/user/show/34410191-emi", "userReview": "2.75/5 stars\n\nI don’t entirely understand how anyone gets a boyfriend. Or a girlfriend. It just seems like the most impossible odds. You have to have a crush on the exact right person at the exact right moment. And they have to like you back. A perfect alignment of feelings and circumstances. It’s almost unfathomable that it happens as often as it does.\n\nI think there should be a law in place that bans terrible books, especially when they are a follow up to an incredible debut. \nSimon vs. the Homo Sapiens Agenda\n was such a well-executed novel that I reasonably assumed this one would be too. Turns out, everything I knew about the universe was wrong because this book is absolutely nothing like Simon.The Upside of Unrequited? More like the The Downside of Disappointment amiright?Unpopular opinion time! As this review has a 4.08 average rating and soooo many of my friends on here seem to love it. I just wasn't one of them. The worst part about this book is that it had so much potential to address different social issues but instead it decided to throw itself in the chasm of stupidity. Literally, all I got out of this book was that the only way to be confident with yourself is to have a boyfriend. Exactly the kind of message I want teenagers to be reading. We were also told the main character has anxiety, which I was excited about. It is important to have representation of mental illness in books. Except, we were only ever told the main character has anxiety. I might be wrong, and if I am please correct me, but I don't remember a scene where anxiety played a major role. Not really the representation I was hoping for, but I guess it's still there and that should count for something. Now, usually, this is when I would try to summarize the plot of a book in a paragraph or a small essay or anything, but there isn't even enough plot in this book to do that. There isn't any plot in this book. The entire thing is just a girl, who complains about not having a boyfriend, trying to find a boyfriend. Which shouldn't be hard, honestly, as there are not one, but two possible love interests in this book. That's right folks, packaged inside this blue tree corpse is a love triangle. And not even an \"I hate love triangles and rather not read about one, but I guess this one is salvageable\" love triangle. It is one of the weakest freaking frack love triangles I have ever seen. It was Complaining Girl vs Boy She Has Nothing In Common With vs Boy She Has Slightly More In Common With But Also Not Really. I couldn't' even pretend to muster up enough energy to root for somebody. Then the boy who Molly eventually ends up with, I wasn't too sold on their relationship. I didn't feel like they had that funny banter and great chemistry I crave in a YA contemporary novel. It was more like I could see them dating for a few weeks or months then moving on with their life. They didn't have enough in common or enough deep conversations for me to buy the fact that they might spend the rest of their lives together. But, again, that just might be me. \n\n \"I'm on the toilet at the 9:30 Club, and I'm wondering how mermaids pee.\" \n\nLet's talk about the writing real quick, shall we? The first chapter or two tricked me. I thought the writing was gonna be great. In fact, the first line of this book might be my favorite first line in all the books I've ever read. An entire star was given just for it. But, unfortunately, that was the best sentence in the entire book. The way everything is worded is like Molly is speaking her story aloud and someone is trying to transcribe it. Or maybe like how I write my reviews, as if I'm speaking a reader, in this case you, directly. Sometimes the writing was like this. Other times IT WAS LIKE THIS. It was cool for a little while, but by chapter three I was beyond annoyed. For a review or a blog post or anything, this way of writing is cool. It's only a thousand words or so of it. Enough to read it and move on with your life. But when it's 350 pages of it, you can imagine the agony. Molly the MC would be talking about one thing, going into detail about it and everything, and then by the next paragraph she'd have gotten distracted and would be talking about something else. And when she texted someone, which was all the freaking time, she would describe every single emoji used in detail. And there were a lot of emojis. Do you know the cringing emoji? Insert him here. I think now is the perfect time to talk characters?Molly. All she did was complain. And complain some more. And never stood up for herself. She'd get insanely jealous if someone else was even remotely interested in the same guy. There was no character development other than she started off forever along and ended up with a boyfriend. Next. Cassie. She was a bitch the entire book but that was dismissed because she's the main character's twin sister. She'd drag Molly everywhere if she wanted to go or not, treat her like crap, stop talking to her for no good reason, and so on. But she's just a sister who is in love so that's okay.Reid. I have neutral feelings for Reid. I didn't feel like there were enough scenes of him to really form an opinion. Will. What even was the point of him? We could have taken him out and had the exact same story. 0/5 stars for Will. Olivia and Abby. I know one of them lives over in Georiga with Simon, but I got these two confused so many times in the entire book. They were pretty interchangeable, however, so I guess that was okay. Patty and Nadine. There were times when I was like, \"Wow, they are such realistic parents\" and then there were times when I was like, \"What moms would allow their two daughters to have a sleepover with so many people of different sexes?\" I wish their characters were more consistent, tbh. This book wasn't horrible though. I even considered giving it three stars just because there were parts that I did love. When Simon showed up in two different scene, that was my favorite parts. I love Simon. Then also the last chapter was the cutest, sweetest thing. And the abundance of diversity was amazing. There was representation of so many different sexualities and races and body types. It wouldn't be hard to find somebody in this book you can relate to. But in the end, this book just isn't for me."}, {"userName": "Whitney Atkinson", "userReviewDate": "Oct 25, 2017", "userURL": "http://www.goodreads.com/user/show/14457130-whitney-atkinson", "userReview": "This started out so promising, but it just wasn't for me. i thought i would be able to relate to it because fat mc with anxiety, but our personalities and insecurities were completely different and i found i actually really didn't see myself in molly at all. the biggest problem, i think, is that this is a book i wish i'd read 5-6 years ago. now, i'm beyond the part of my life where i'm self-conscious and awkward, so it did nothing for me to read about that.i wasn’t a fan of the repetition of “i’m so embarrassed about my body” and the “i blush every time i look at a boy.” if this had only been brought up a few times then it would have been more bearable, but every single scene was just contingent on those 2 pieces of inner monologue, and it got old. i think a younger whitney would have appreciated this. i’m out of the stage where im ashamed of my clothing size and dont want people judging me, but i could see how a younger me would be more like molly. by the end of the book this just seemed like one of those “i got a boyfriend and now i love myself!” stories. as a fat girl, the message to me just kinda seemed like “i can’t accept myself until i know i’m lovable.\" i would have loved to read a book about a fat girl coming to terms with her size, but this just felt very contingent on the love interest.additionally, this book is sort of about how molly has had 26 crushes that she never pursued and so she felt like she NEEDED to have a first kiss and get a boyfriend. 1) this is a little concerning to me, even though at the very end (sigh) one of her moms explains why she shouldn't worry about that, and 2) when everyone finds out molly has a boyfriend, the reaction of literally everyone was \"wwHHAHHAAAATTTTTT???\" which i thought was a little disturbing. like, was there something about her that you thought would hinder her from getting a boyfriend? idk. it just seemed.... weird. it didn't read like it was trying to be funny or quirky.also, i'm just really not a fan of becky's writing style. a lot of the dialogue tended to be cheesy and unrealistic. it was quick to read, just not…. idk. i couldn’t see myself in any of the conversations. even the adults in this book talk like they’re 12. by the end of the book i was reading some of the text messages and dialogue out loud to bonnie and we were both like ... that's weird. also no one would ever talk like that. also i'm cringing.and molly's anxiety just kinda got swept under the rug? it mentions she takes zoloft, but this book never actually discusses panic attacks or dealing with feelings of anxiety, other than feelings of self-consciousness (mentioned earlier). I guess i was expecting more on this front, and it just didn't deliver.i just had really high expectations for this book, and it ended up not being as relatable as i thought it would be. if you'd given this to me while i was in middle school, though, i'm sure i would have loved it, so i'm trying not to be too critical on it because i know molly's story will still be uplifting for a lot of young readers."}, {"userName": "Natalie Monroe", "userReviewDate": "Jan 04, 2017", "userURL": "http://www.goodreads.com/user/show/6688207-natalie-monroe", "userReview": "4.5 stars\n\"If I like a guy, I'm supposed to tell him. Maybe in Cassie's world, you can do that and have it end in making out. But I'm not so sure it works that way for fat girls.\"\nSo this review is going to be a little personal. By that, I mean I'm going to ramble and waste ten minutes of your time, depending on how fast you read. Free feel to grab a bagel.When I was sixteen, the standard YA age, I was a painfully introverted kid. Not the fun John Green kind, but the really sad kind that makes you feel awkward when they sit next your table in the cafeteria. Part of it was me, part of it was my physical disability—it wasn't convenient for me to go to places. I didn't have any close friends, except for the occasional classmate you'd say hi to during Biology.I was also achingly, morbidly desperate for a boyfriend. I had loads of crushes, but never acted on them. Because, you see, I also had massive insecurity issues. (Sixteen-year-old Natalie sounds like a mess, doesn't she?) My disability is a form of muscular dystrophy. Right now, I use a wheelchair, but back then I still walked with the help of a cane. My atrophied muscles affected my posture and movements, so I walked like a cartoon duck, all awkward angles and wheezing breaths. I was dying on the vine for romance, but secretly believed I would never find it because, well, look at that mirror. Look at who you are.A huge part of why I enjoyed The Upside of Unrequited so much is I am Molly. Or I was her. I identified with her so much, and I don't even care if there's a tiny slice of wish-fulfillment going on—I cheered like a Cubs fan when Molly got her first kiss. It was magical and sweet and nostalgic. In that moment, I was sixteen again, with the wisdom of twenties Natalie to balance it out.Molly speaks to us. The invisible girls with thirsty hearts (Shamelessly stealing from Tiger Lily). Maybe it's pathetic. But we all feel insecure about our bodies at some point in time, one way or another. You don't have to be fat to identify with The Upside of Unrequited's message of beauty and self-acceptance. It goes far beyond a boy loving you, which is why I mentioned Molly's shoes are tempered with twenties Natalie's mentality.Look at that mirror, girl. You're fucking beautiful.Other things I want to mention is the amazing diversity. There are characters of all races and genders. White characters are pointed out because it's foolish to presume white is the norm. Relationships between female characters are as big of a part in the narrative as the romance, and the plot thread with Molly and Olivia is simply magnificent. And this: \n\"Because I don't want to be a girl who needs a boyfriend,\"I say.\"Well, of course you don't need one,\"Nadine says. \"But it's okay to want one.\"\nEvery bit as good as Simon vs. the Homo Sapiens Agenda. I would wager even better.(P.S. Sixteen-year-old Natalie turned out just fine. After all, she's here talking to you. ;) )"}, {"userName": "Ashley Nuckles", "userReviewDate": "Jul 21, 2017", "userURL": "http://www.goodreads.com/user/show/55308610-ashley-nuckles", "userReview": "I liked this one but definitely enjoyed Simon v. more! :)"}, {"userName": "Pouting Always", "userReviewDate": "Jun 16, 2017", "userURL": "http://www.goodreads.com/user/show/48650982-pouting-always", "userReview": "During a night out with her twin Cassie, Molly meets a girl in the bathroom who she instantly knows is Cassie's dream girl. The girl from the bathroom, Mina, and Cassie hit it off and Cassie manages to get Mina's number that night. Molly is happy for her sister but at the same time Cassie's new relationship begins to make her think about her own lack of a love life and the growing distance between her and Cassie. Molly is used to being the closest person to Cassie and has a hard time learning to deal with Cassie having someone else she goes to. Molly also hasn't ever felt as attractive as Cassie, mostly due to her weight. Molly is always told to try to put herself out there and do more but none of her friends understand that she has to work harder to protect herself from getting hurt. Even though she's like 27 guys Molly hasn't done anything with a boy and she can't help but question how much of it has to do with her as a person and people's inability to want her. So when Cassie tries to push Molly together with Mina's best guy friend, Molly might even be open to it. Too bad her coworker Reid is the one she can't seem to stop thinking about. Reid is comfortable and dorky and right off the bat Molly felt comfortable around him. She just doesn't know how to be sure about his feelings for her. There's also the fact that this will only make her and Cassie's relationship change even more. I really liked this book, it was really adorable. Molly does a lot of things that I personally wouldn't do or say but I didn't feel like that kept me from connecting with her or the book. I've also been there, where you like people but you won't let yourself even hope that someone could ever like you back. Its really relateable especially wanting someone to want you because everyone else seems to have people who want them so how come no one wants you. I really thought Cassie was being god damn annoying though. She doesn't have to be up Molly's ass but she definitely could've been much kinder to her and actually have tried to listen to what Molly wanted. Anyway I enjoyed this book a lot even though I don't think I'm in the place where I need something like this but I do think it be even better for someone who is in that place that Molly's in and dealing with growing up and learning to be in relationships and readjusting to friendships changing. Also it was pretty good with the diversity and I know that's important to people.Also on a totally separate note how do girls just like find other girls who like girls like I truly dont get how anyone does it. It's so much easier with boys because they're so obvious and kind of just make sure you know they're interested. Confusing man confusing."}, {"userName": "Raeleen Lemay", "userReviewDate": "Mar 04, 2018", "userURL": "http://www.goodreads.com/user/show/3452652-raeleen-lemay", "userReview": "Read for Popsugar's 2018 Reading Challenge #22: A Book with Alliteration in the TitleNormally I would rate this 3 stars (it was pretty juvenile) but I just really appreciate how much diversity and love/acceptance this book holds. I also really enjoyed (and was pleasantly surprised by) all of the cameos from  Simon Vs. the Homo Sapiens Agenda, and it was perfect timing to read this right after I finished re-reading that book. All in all, a fun read!"}, {"userName": "Katie", "userReviewDate": "Aug 07, 2017", "userURL": "http://www.goodreads.com/user/show/7161764-katie", "userReview": "This was so cute omg"}, {"userName": "Heather 'Bookables'", "userReviewDate": "Jun 10, 2017", "userURL": "http://www.goodreads.com/user/show/5376236-heather-bookables", "userReview": "4.5/5Oh the adorableness! Such a cute, diverse read! I can see why so many people love this book! It's so adorable and super diverse and the main character is so relatable!!This is a perfect summer read!I did dock off half a star because so much cussing which honestly is just a personal preference and I did find the writing to be a tad to simplistic. Other than that I seriously loved this book!"}, {"userName": "Steph Sinclair", "userReviewDate": "Oct 12, 2015", "userURL": "http://www.goodreads.com/user/show/4642710-steph-sinclair", "userReview": "Where's a time machine when you need one?"}, {"userName": "Korrina  (OwlCrate)", "userReviewDate": "Oct 05, 2016", "userURL": "http://www.goodreads.com/user/show/37437502-korrina-owlcrate", "userReview": "Adored this even more the second time. I can't wait for the world to meet Molly. I've never connected with a character this strongly before. This was me in highschool!"}, {"userName": "Maureen", "userReviewDate": "May 02, 2017", "userURL": "http://www.goodreads.com/user/show/10762033-maureen", "userReview": "I'm crying because that ending was so beautiful????Alright this book. I went in with really really high expectations and expecting that it would be a book of my HEART and I would relate a lot to the main character because of similar situations. And I did relate! Just not a lot. Or as much as I had hoped. Probably some of my disappointment (very minor disappointment!) comes from setting too high of expectations. BUT ON WITH THINGS I LOVED.The diversity in this book was A+++++++ to infinity. It was so natural and wonderful and made sense in the story and there were so MANY THINGS. The main character has anxiety and talks about it openly, has two moms, her sister is a lesbian, her sister's love interest is Korean-American and pansexual, and that's just naming a *few* characters. It was JAM PACKED with well developed, diverse, authentic characters. I also loved how all of the characters, especially the family, were so supportive and great??? All the drama happened with change and things Molly was going through, not people being awful.I really did relate to Molly and her situation, though I've always been on the side of not really needing a boyfriend, I've been very selective about my crushes and basically never letting on that I liked anyone ever. SO RELATABLE. I also struggle with overthinking, though not to the extent that Molly does, which is probably partially from her anxiety that I don't personally struggle with.A small thing I loved learning about was Jewish culture and things I definitely didn't know about before. It was really fun learning about it!Things I didn't really love - the writing. I liked parts of it, but sometimes it felt too straightforward for me and I would've liked a little more flow and flower to it. I also didn't really love how much everyone needed to talk about sex? But that's always definitely a me thing and is probably something other people talk about and discuss a lot? But not me and not my friends. So it got to be a little much with that at times. Overall, really really liked it, not quite love level, but I really liked it."}, {"userName": "✨    jamieson   ✨", "userReviewDate": "May 19, 2017", "userURL": "http://www.goodreads.com/user/show/7706640-jamieson", "userReview": "“I don’t entirely understand how anyone gets a boyfriend. Or a girlfriend. It just seems like the most impossible odds. You have to have a crush on the exact right person at the exact right moment. And they have to like you back. A perfect alignment of feelings and circumstances. It’s almost unfathomable that it happens as often as it does.”\n3.5 stars!I, like Molly, am a Chronic Crusher. Maybe not 26 crushes, but a few - blonde ben, biker conor, buswalk alex, supermarket kalen, dimples melanie, tutorial girl, tutorial boy Tom (current). probably more from high school I can't remember. So straight away this premise held a kind of familiarity to me. There are things Molly talks about and deals with that I think many people can relate to - alienation, ostracisation and a kind of weird sense of shame when you're not as experienced sexually as some of your friends, or you're not in a relationship. There were events and scenes that I have literally experienced myself - not at 17 like Molly but definitely in my earlier years of highschool, that made this book completely relatable to me. There was a popular review criticising the book for it's representation of a character who really, really wants a boyfriend and the implication of that desire. I don't usually address other reviews, because staying in your lane is a thing but --- I just wanna make one point: I think this book does make a point in saying it's insane the amount of societal pressure there is on people to have relationships. Think of all the movies and stories we hear - the \"I had my first kiss in year 1\" trope, the \"highschool sweetheart\" - so much media we consume shoves the idea of romance and relationships at us, and alientates those who don't have that relationship story. People who've never dated by adulthood are shamed and ostracised all the time - and I think this book tries to address how ridiculous and crazy that is.I think the linked review is very, very true though. I think that the point that no one should be shamed for being late to get in a relationship was kind of missed. Which was unfortunate, because I think it would have been a good message to send. But this book does make some really important commentary regardless. One theme that literally made my heart sing was the discussion about sex and womanhood. \n“Yeah, that's pretty fucking problematic... the implication that becoming a woman has anything to do with whether or not you've had sex. And you know what, I'm pretty much done with this construct of 'virginity' \" Cassie does airquotes. ... \"I mean, I think people have this mentality that sex is only real if it involves a penis.” \n I thought lots of the discussions about lgbt+ people and sexuality were soo important and well done. Like, seriously, I think this is the first book that explicitly talks about sex between two girls and how it's just as valid even if it's not \"penetrative\". I think it's so important these discussions are in YA book, I wish I'd had them when I was 15/16 and really needed them. Just in general the diversity was amazing, and the representation of so many different kinds of people was such a big plus of this book. Molly is fat and has diagnosed, medicated anxiety. Cassie is gay, Mina is Korean-American and pansexual. Molly and Cassie are sperm donor babies, with two Mums one of whom is a poc. If you love representation and diversity in books like I do, Upside of Unrequited will definitely have something for you. I also really loved how there were discussions about the impact of boyfriends/girlfriends on friendships and other platonic relationships. I think everyone has struggled with losing a friend when they've moved onto a boyfriend/girlfriend and I liked that this book addressed how hard and crippling that can be. It was unfortunate there were a few things that let this book down because it could have been great? It was kind of boring, and I think it totally missed the mark when talking about feminism. There is one bit when Molly says it's \"not feminist\" to want a boyfriend! So totally not true, feminists aren't anti-romance ? It's sad thats that the movement is being equated to. Cassie and Molly were so problematic, and even if some things did get resolved, the way Cassie used Molly as a prop was so gross. It was countered by Cassie defending Molly in other areas, such as against her grandmother when Molly's weight came up - but it didn't make up for stuff before. I do think it was a good representation of the complexity of sibling relationships, but I just wish they'd TALKED more about their issues Ultimately,  what really put me off this book was that none of it allowed any self-validation. Molly ultimately finder her validation and self-worth not through herself, but through acquiring a boyfriend. I really want books to stop saying a relationship is a perfect fix for every little insecurity we have - I would have LOVED to see Molly assert herself, claim her own agency and body rather then waiting for her boyfriend to \"make her feel beautiful\". I do think this book totally fell down in some areas, but was so on-point and original in others. But honestly,? I really really hope more books like this come out. I really want to see characters talking about how their sexuality is valid, and talking about how their non-traditional family units are valid. I want the subversion of the nuclear family and the positive representation of ALL body types and teenagers dealing with more and more complex issues. I've read many, many contemporaries and I think this one dealt with some of the most pervasive issues teenagers and myself deal with - and some of the ones that go the most unnoticed. It is incredibly heartwarming to see two girls relationship written so nicely, and to see so many didn't types of people represented with agency and complexity and not be reduced to overdone tropes.Follow my blog! || Find me on Twitter || Tumblr"}], "description": "Seventeen-year-old Molly Peskin-Suso knows all about unrequited love—she’s lived through it twenty-six times. She crushes hard and crushes often, but always in secret. Because no matter how many times her twin sister, Cassie, tells her to woman up, Molly can’t stomach the idea of rejection. So she’s careful. Fat girls always have to be careful.Then a cute new girl enters Cassie’s orbit, and for the first time ever, Molly’s cynical twin is a lovesick mess. Meanwhile, Molly’s totally not dying of loneliness—except for the part where she is. Luckily, Cassie’s new girlfriend comes with a cute hipster-boy sidekick. Will is funny and flirtatious and just might be perfect crush material. Maybe more than crush material. And if Molly can win him over, she’ll get her first kiss and she’ll get her twin back. There’s only one problem: Molly’s coworker Reid. He’s an awkward Tolkien superfan with a season pass to the Ren Faire, and there’s absolutely no way Molly could fall for him. Right?", "title": "The Upside of Unrequited", "url": "http://www.goodreads.com/book/show/30653853-the-upside-of-unrequited", "average": 4.03, "cover": "https://images.gr-assets.com/books/1487956734l/30653853.jpg", "reviews": 6185, "authors": [{"url": "https://www.goodreads.com/author/show/7579036.Becky_Albertalli", "name": "Becky Albertalli"}], "type": ["Young Adult", "Contemporary", "Romance", "Lgbt"], "outlinks": ["http://www.goodreads.com/book/show/30653853-the-upside-of-unrequited", "http://www.goodreads.com/book/show/32596757-the-upside-of-unrequited", "http://www.goodreads.com/book/show/19547856-simon-vs-the-homo-sapiens-agenda", "http://www.goodreads.com/book/show/31180248-leah-on-the-offbeat", "http://www.goodreads.com/book/show/36260157-what-if-it-s-us", "http://www.goodreads.com/book/show/36952607-dear-heartbreak"]}