{"ratings": 304, "userreviews": [{"userName": "Katy", "userReviewDate": "Aug 18, 2011", "userURL": "http://www.goodreads.com/user/show/5552109-katy", "userReview": "Book Info: Genre: Horror (zombies) Reading Level: AdultDisclosure: I received a free eBook of this, the first in the Zombie Armageddon series by Ian Woodhead, free from the author in exchange for an honest review.Synopsis: In a rundown council estate in the North of England strange things are happening. The dead suddenly are not quite as dead as they should be......A mysterious government body has decided to use the estate as an experiment. Things are out of control & now they need to eradicate all knowledge & existence of the estate.But what happens when a small group of survivors band together? Will they survive the apocalypse & triumph over the undead? My Thoughts: Zombies are really not my thing, but I have heard good things about Ian Woodhead’s fiction, so agreed to read the first two books in his Zombie Armageddon series, The Unwashed Dead and Walking with Zombies. The third book is Infected Bodies. All books are available in the normal places you get ebooks.This was a fast-paced, exciting book. It consisted mostly of little character vignettes, showing what people were doing when they started to turn into zombies, how those who didn’t turn reacted, and how people went about trying to survive. Add in secret government experiments and mysterious soldiers, and you have a story that is hard to put down. Good stuff for the horror and zombie fan."}, {"userName": "Megan", "userReviewDate": "Apr 16, 2011", "userURL": "http://www.goodreads.com/user/show/1233686-megan", "userReview": "Fantastic zombie gore! The Unwashed Dead isn't written well enough to be scary. But there is so much zombie madness, and so many people succumb to the hoard, it was still an enjoyable read. As far as the writing goes, this can use quite a bit of polishing. So many characters are introduced that it was difficult for me to keep them all straight and remember all of them. On one hand, author Ian Woodhead would introduce a new character only to have said person become zombie food. Great and unexpected! On the other hand, knowing that each character had only a very slim chance for survival made me not invest much interest in them. Writing wise, this is at best a two star book. But the zombie bits are so bloody good, I am bumping it up to three! This is one I only recommend to hard core zombie fans."}, {"userName": "Abbie", "userReviewDate": "Oct 27, 2016", "userURL": "http://www.goodreads.com/user/show/10194401-abbie", "userReview": "An okay read, but I'm not sure if I want to continue the series."}, {"userName": "chucklesthescot", "userReviewDate": "Sep 15, 2015", "userURL": "http://www.goodreads.com/user/show/3426724-chucklesthescot", "userReview": "This book is an example of an author who doesn't take the time to think up interesting dialogue and descriptions. Instead he chooses to have totally pointless swearing in every sentence of the book. This is what we get in the space of the first 1.5 pages of the ebook:-shitty kitchen and effing lino on the floor-his hosts, who are b******s, not giving two s***s about decorating-refers to himself as a miserable b*****d (correct!)-his friend's are all effing retards -the music gets on his t**s and is a pile of s***eSwearing in books is ok with me if there is a purpose ie when someone is angry or scared of being chased by fast zombies. But I do not find it entertaining to be bombarded by f bombs and stuff because of lazy writing and no imagination. People might say 'yeah but it's realistic because people talk and think like that'. True but if I want to hear that language all day, I'll go and sit in the city centre and hear it for free. When I read a book, I want to get away from everyday life and be entertained, not feel like it's a Friday night when the pubs have closed.This was not clever writing or witty dialogue. This was just rubbish and I'm so glad I got this free. If I had paid for it, I would've been really angry. I will NOT be reading anything else by the author based on that standard of writing."}, {"userName": "Angie", "userReviewDate": "Oct 29, 2013", "userURL": "http://www.goodreads.com/user/show/19184609-angie", "userReview": "This book was set on a housing eastate in the north of England, and that made this zombie book so much fun because I'm sure I know some housing eastate s just like this one! The book follows several different groups of people as they try to survive, from teens pleased they are staring in their favourite video games, to others who want to hide. It's a very violent book, but unputdownable. There is also soldiers or are they really, and scientists trying to round up survivors to experiment on. But I don't know if it's going all to plan.I'm really looking forward to reading the next book."}, {"userName": "Stuart Neild", "userReviewDate": "Mar 29, 2011", "userURL": "http://www.goodreads.com/user/show/4535860-stuart-neild", "userReview": "This is a great, fun zombie romp. It's kind of a cross between the British TV show Shameless and the best zombie stuff out there. A really interesting and unique read."}, {"userName": "Patrick D'Orazio", "userReviewDate": "Jun 06, 2011", "userURL": "http://www.goodreads.com/user/show/4328815-patrick-d-orazio", "userReview": "The Unwashed Dead tells the tale of a zombie uprising on an English Estate. I have to note that as an American, my interpretation of the term \"estate\" is something along the lines of a village, or at least a close facsimile. Several residents complain of severe migraines one night, and not long after, they transform into flesh eaters, tearing apart everyone around them. As their neighbors are devoured and others are left trying to grasp what's happening, the army, or some mysterious government agency, moves in to clean up the mess they apparently created, which translates into making sure no one is left around to tell the tale. The story moves at a rapid pace, with plenty of guts and gore carrying the story forward as many of the characters are slaughtered until only a handful remain. The Unwashed Dead was a quick, simple zombie read. It doesn't bring anything new to the table as far as the undead are concerned-they are traditional Romero shamblers, but for me, there is nothing wrong with that. Perhaps the breakneck pace made it hard for me to grow attached or intrigued by any of the characters, but it was clear that the author plans on a sequel due to the sudden and abrupt ending to the book. The story was a fun bloodbath with plenty of zombie action and gore. It could have perhaps done with another editing run by the author. There are a few instances of misplaced identity, in particular early on in the story-by which I mean that I thought one character was doing or saying something because of pronoun usage, but it was actually another character and I had to reread a few passages here and there. There were some other typos, though my philosophy on that is that I can tolerate them as long as I get the gist of what the author is saying, which I did, but it deserves to be mentioned here as a fair and honest critique. Despite those quibbles, I did enjoy this story for what it was-a fast paced, gory tale of a traditional zombie uprising. It will be interesting to see where the author takes the story with his sequel."}, {"userName": "Denna", "userReviewDate": "Aug 28, 2011", "userURL": "http://www.goodreads.com/user/show/948231-denna", "userReview": "This was a great Zombie story. Sometimes I crave a little light gore for reading material and this fit the bill perfectly. You’re not going to find deep characters or a plot that keeps you guessing right up until the end, but you will find a fast pace with plenty of action and violence. The characters weren’t particularly developed out, but they were still fun to read about. It was difficult at times to know who the bad guys were, the zombies or the characters trying to stay one step ahead of them. If I have a real complaint, it’s that the editing was poor. There are lots of typos, punctuation and grammar problems, which tend to drive me absolutely crazy. In this case, I was looking for a no-brainer, fun read for in between those that are heavy going and this was a perfect choice. Without the editing issues I would have scored this a four and possibly even a five. I’m already halfway through the second one, couldn’t help myself, and I think this says a lot for how much fun it was to read."}, {"userName": "Wanda Hartzenberg", "userReviewDate": "Dec 16, 2016", "userURL": "http://www.goodreads.com/user/show/5663614-wanda-hartzenberg", "userReview": "A lot of swearing. Not even close to necessary and not at all entertaining but in the end the superficial plot line did manage to entertain me so I kept with it and since the second and third books were on my kindle I decided to read them back to back because I really needed fluff even if this fluff is disguised as horror. So not bad, but could have been a lot better."}, {"userName": "Kim (Wistfulskimmies Book Reviews)", "userReviewDate": "Mar 31, 2011", "userURL": "http://www.goodreads.com/user/show/4993654-kim-wistfulskimmies-book-reviews", "userReview": "I loved this book. I am not into zombie books as they go but Ian has managed to do the unthinkable & converted me! I think its because of the fact that its not your run of the mill zombie 'brains I need brains' type story. Loved it & recommend it to anyone!"}, {"userName": "D4ngerousBeans", "userReviewDate": "May 10, 2011", "userURL": "http://www.goodreads.com/user/show/2939784-d4ngerousbeans", "userReview": "A really enjoyable zombie fest based in a run down housing estate in England , I just wish it was longer , Oh did I mention there is a nutcase on the loose as well !!"}, {"userName": "Scott", "userReviewDate": "Feb 06, 2018", "userURL": "http://www.goodreads.com/user/show/41687857-scott", "userReview": "It was OKI enjoy all zombie books, but this one was a difficult read for me. I didn't particularly like any of the characters, and honestly, I was rooting for them all to die. I'm not sure if I will continue the series."}, {"userName": "Vix", "userReviewDate": "Jan 24, 2012", "userURL": "http://www.goodreads.com/user/show/7521915-vix", "userReview": "Ok, let's start with the negatives... YES it has some typos and yes it could possibly have been tweaked a little here and there to make it a tad more polished.... BUT this is soon to be a thing of that past as of 10/12/2013 Ian Woodhead has a wonderful new editor and it should soon shine like it supposed to!IW has some great, fresh ideas that he brings to the zombie story genre.Wham! What a great way to start a horror book with some poor bloke, who I secretly hated (!), getting his manly bits bitten off!If you are squeamish or scared of swearing then this author and series of books is NOT for you! Set \"up North\" in the UK, it's rough and tough stuff, and I'm pleased to note that he does not dumb his dialogue down for others to understand; if you don't get a certain phrase, look it up, haha and eeew will spring to mind often!Personally I thought the death and reanimation timings were a little too fast.Amongst the general goings on of a zompoc are these weird, not so wonderful, characters - such as Dennis who goes on a full serial killer jaunt whilst loving the impending apocalypse.A few sporadic little personal stories that usually don't end well gave me a sense of fullness to the whole story, such as poor Jacob, to be finally socially acceptable only to succumb to parental control. IW is a master at creating some really detestable characters and his gore descriptions are enough to make you wince. In his world nobody is perfect and we all have a little edge to us, especially if the zombies start to invade (although I would like to point out I have never buried anyone locally!)As the remaining survivors meet up the tensions are high and IW leaves this book on a real cliffhanger.What is following them? Will Dennis survive his encounter? Is his theory correct?I really enjoyed the British element such as the snooker cues must be used against zombies instead of just an endless supply of bullets (the world is ended where are they all coming from?)This book romped, or should that be groaningly shuffled, along with good pace, I am so looking forward to rest in this series."}, {"userName": "Kat", "userReviewDate": "Nov 27, 2011", "userURL": "http://www.goodreads.com/user/show/3835702-kat", "userReview": "Full review on my blog: http://theaussiezombie.blogspot.comYay the zombies are back in town and in full force too! The Unwashed Dead has a great setting – a council estate in northern England with the full range of characters that you would expect – the slightly geeky kid, the ex-con turned good (kinda), a whole bunch of chav’s and some familiar scenes in the graveyard, the pub and the corner shop run by Mr. Singh which sells anything and everything. There are is also one unexpected and surprising character, but I’m not going to give you any more info than that!The Unwashed Dead does contain a whole gamut of characters which are thrown at the reader in pretty quick succession – I didn’t have a lot of trouble remembering who was who, but I can see how it could be a little overwhelming for a reader who likes a lot of character development before a new character comes along, but the story wouldn’t work as well without the quick changes. It’s important to remember this is a hard-core zombie story so a lot of the characters do die, negating the need for in-depth character development.The conspiracy theory surrounding the sudden zombification of the residents of the estate is presented as a teaser – it’s obvious the story will be continued in the next book, but sets the groundwork out well.This is a gory book (as I like my Zombie books to be), and a lot of action scenes (again, how it should be). The regional accent/way of speaking could be a little difficult to understand if you aren’t used to it, but rings very true to life.There is a lot of strong language in The Unwashed Dead, but it is necessary as it is a realistic reflection of how the characters would speak. There are also some small spelling and grammatical errors, but far less than I’ve encountered in other self-published books.If you like your characters tough and real, enjoy zombie books where death is possible at any time and the gore and action are heavy, I can definitely recommend this book to you!"}, {"userName": "Joline Novy", "userReviewDate": "Apr 26, 2013", "userURL": "http://www.goodreads.com/user/show/16944122-joline-novy", "userReview": "I actually finished this book quite a few days ago but because of different circumstances and commitments, I was only just today able to get my review done. Anyway, onto my review.....I'm a big fan of Ian Woodhead. He has a very unique writing style and, being from \"across the pond\" uses many terms and vocabulary I'm not always familiar with. For the most part, I can figure out the meanings just from the context of the sentence. The ones I'm not sure about are very easy to look up. I actually really enjoy that part of reading his books. I'm a lover of words, especially new ones. It's always fun for me to be able to research some of the words and phrases Ian uses. But, enough about the grammar, let's talk about, The Unwashed Dead.This book, right from page one, is very unique. It jumps right into people becoming zombies and without a whole lot of explanation. I won't give away any spoilers, but I will say.....every time I get a headache, I'll think of this story. Ian does a fantastic job of jumping back and forth between the different characters and their stories. Everything flows perfectly from one point of view to the next leading up to the different characters coming together towards the end. I also enjoyed the \"realistic\" scenarios that these characters are thrown into. Most zpoc books portray people that are \"preppers\" or \"survivalists\" or \"gun experts\". The Unwashed Dead actually takes a totally different route. These characters are \"real\" people who are frightened and use whatever weapons are at their disposal. Some grab baseball bats, hammers, pool cues, beer bottles......pretty much anything they can get their hands on to try to survive.I won't give away any spoilers from this book.....That's just not my style. You'll have to download this great book and see for yourself just what a great story it is!!Thanks for writing such a fast-paced, action-packed, \"believable\" zpoc book, Ian!! I was very entertained by it and cannot wait for the next installment!! Well done!! :-)"}, {"userName": "Books", "userReviewDate": "Jan 25, 2013", "userURL": "http://www.goodreads.com/user/show/6665735-books", "userReview": "I’m not in the habit of reading blurbs on book covers, but with this book I wish I did. Had I done so, the poorly written overview would’ve given me a good indication of what to expect regarding grammar and format. I’m a huge fan of zombie-themed books, so the minute I saw the words “Zombie” and “Armageddon” in the title, I didn’t think twice to download it to my kindle when it was free on Amazon. The writing is not too bad, if you turn a blind eye to the astounding amounts of profanity, of which there’s so much it would make a sailor blush. I might’ve actually enjoyed the story had I not been so distracted by the poor editing – or lack thereof. Really, it hurt my eyes. Don’t expect much in the way of character development or world-building either. Hardcore horror fan that I am, I did enjoy the blood, guts, and chaos, but that’s all there is to this book – straight-out zombie bashing, with no plot twists, at its finest. If you’re new to zombie-themed books, I suggest you check out “Hollowland” (always free on kindle) by Amanda Hocking and/or “Solstice” by Donna Burgess. Those are two of the best zombie apocalypse books I’ve read and their excellent five-star ratings can testify to this. Before this turns into a rant about authors not taking pride in their work though, let’s move on. I think the author had a good idea for this story, but he didn’t pen it well. Also, a professional editor can make a world of difference to this book. Despite the terrible editing, poor grammar, incorrect punctuation, and most of the characters using the f-bomb and other such nasty words in most of their dialogue, and elsewhere, the story itself was sort of okay. It’s a quick read and I finished the book in less than a day. I recommend it to absolute die-hard zombie fans only, but rather wait until it’s free for download again sometime. This is the first time ever I’ve given a book less than three stars."}, {"userName": "Rebecca", "userReviewDate": "Feb 20, 2014", "userURL": "http://www.goodreads.com/user/show/19373330-rebecca", "userReview": "In this refreshingly British novel, Ian Woodhead welcomes us to Breakspear, a council estate in Bradford which is notorious for its thugs and robberies. Somehow he manages to make a completely unlikable character interesting, which is a challenge! It’s nice to snigger over certain phrases which can be considered crude but are very British, our friends across the pond may not understand a lot of this book!Unfortunately, there are so many zombie books and films that it is quite an over saturated genre. For me this made it somewhat difficult to stay interested, not because of Ian’s writing but because it’s very difficult to find things in the zombie genre which have not been done already.Other than that this is a good story and it’s loaded with quick lines to make you smile, along with good descriptive narration and a reference to a certain zombie movie which I’m sure anybody reading this genre will pick up on.The only thing for me is that I didn’t feel the danger, I wasn’t particularly heart-broken when characters were killed and it didn’t feel threatening when they were put in to situations. That is probably just me though and I will say that each situation described was interesting.At the end of the book Ian has very kindly put in a note to say thank you for reading and if possible please leave a review, and he’s also provided the first two chapters of the next book; Walking with Zombies. Even with my comments above about not feeling the threat when reading this, the second book has hooked me in!"}, {"userName": "Mark", "userReviewDate": "May 22, 2011", "userURL": "http://www.goodreads.com/user/show/5108317-mark", "userReview": "Now that the eerie air of familiarity I felt when reading Ian Woodhead’s The Unwashed Dead has seen the setting confirmed as Bradford, it’s tempting to say ‘welcome to my old home town’.Certainly, the revelation added a little frisson of nostalgia to the enjoyment as I found myself caught in the fray of this gripping frenzy of the undead, though a certain latent civic attachment compels me to point out that the real Bradford isn’t infested with zombie hordes – well, not until the pubs and clubs shut their doors, but that’s another story.Back to the main event and The Unwashed Dead is an action-packed ride into zombie mayhem, featuring plenty of gore – without ever going over the top – and the pacing is spot on. The characters are fully fleshed, ready for the zombies to take a bite, and one way or another you will care about their fate. There are no cardboard cut-outs, stereotypes or caricatures to be found among the cast of this novel. The Unwashed Dead is a cracking piece of work that fully deserves to find a place on the shelves of any bookstore. Certainly, I’d be happy to see some of the bandwagon zombie titles pushed aside to make room for this welcome addition to the genre. This is biting zombie action that will leave you craving more."}, {"userName": "C.V. Hunt", "userReviewDate": "Jun 29, 2011", "userURL": "http://www.goodreads.com/user/show/5021579-c-v-hunt", "userReview": "If I could sum it up in one word – meh. It was your average slash and dash zombie book. The content wasn’t horrible, but I think the zombie story seems to be the same no matter what book you read. I personally am looking for something different and I just haven’t found it yet.The plus side of the book is that it was action packed. Everything seemed to tumble right along, and I found myself looking at each chapter as if it were a short story. The gore and creativity of killing the undead was good.The down side for me and my personal tastes: I couldn’t get a feel for any of the characters. There was a lack of a physical description for all of the characters, and it kept me from creating the image in my mind that would have me latching on to them. There were quite a few punctuation typos also that bothered me; I wasn't sure if it was just the download that I got or not. It made it difficult to read with missing quotations around dialect. I think people who enjoy playing video games that pertain to killing zombies would enjoy this. There seemed to be an abundance of overzealous characters celebrating the apocalypse and the justified actions of killing people."}, {"userName": "Stephanie Lunsford", "userReviewDate": "Oct 21, 2013", "userURL": "http://www.goodreads.com/user/show/14783992-stephanie-lunsford", "userReview": "once you get past trying to figure out some of the phrases used in this book it's a pretty great story! I love the different POV's & how somehow everyone is connected in one way or another. As you read it you can't help but to feel if only that character passed through a few mins before. The way the virus/outbreak is formed is an interesting one. you'll have to read it for yourself to find out how. let's just say I am going to be worried everytime my kids, husband, friends, or myself have a headache. hehe Very interesting characters that is for sure & they are REAL people not people that automatically know to grab a handy gun & shoot but instead they grab whatever is nearest to them & use it! There is a great story in each of the characters POV that makes the story as a whole better! Give it a chance & check out this series by Ian Woodhead! I'm sure you will enjoy it if you can look over the editing things! Good job Ian!"}, {"userName": "Jett Cat", "userReviewDate": "Jun 19, 2013", "userURL": "http://www.goodreads.com/user/show/18277934-jett-cat", "userReview": "I gave this four as opposed to three stars, because as I thought about what to put here, I came to the conclusion that all of the characters were unlikable! Let me explain, there is generally something endearing, bad ass, or admirable about fictional characters. The people in this tale were, well flawed individuals. They were so real that by the end I felt like yelling at the characters to wise up. There were no ideal people in this book. For the most part there were simply people I know and am. There were some crazies, what kind of zombie book lacks those who lose it? But in an admirably inexplicable way, all of the characters were joe shmoez. Story wise, government experiment, mad scientists, and confused survivors. Nothing really stand out.The true gem of this piece really has to be the average characters, who in general are unlikable. The more I think about it, the more impressed I am. Nice."}, {"userName": "Philip McClimon", "userReviewDate": "Oct 21, 2012", "userURL": "http://www.goodreads.com/user/show/12057334-philip-mcclimon", "userReview": "I will be honest, I started reading this and put it down the first time. I think this must be an unedited draft. There are just too many typos for it to be anything else. I was too interested in the story however, so the next day I started again, this time ignoring all the typos. I spent the whole day off and on reading it at every spare moment. It is a good story and one that as I say kept me reading. It is like Shaun of the Dead meets Snatch or Lock, Stock, and Three Smoking Barrels, a meaner version of Shaun of the Dead if you will. It is rife with British slang and phraseology, which for a \"Yank \" like me adds to the fun. It takes place over the course of one night and everytime I started to think I knew who the hero was, they would get eaten. Despite the need for some editing this is a great story and a great read. I am already planning on reading the sequels."}, {"userName": "Rosann", "userReviewDate": "Jul 31, 2013", "userURL": "http://www.goodreads.com/user/show/5819763-rosann", "userReview": "This book had potential to actually be good. What in my opinion lost this books potential to be a good story line....... the OVER USAGE of curse words.Wow.. Mr. Woodhead couldn't you have been a bit more original or picked up a thesaurus to see if other words could be used ??!? The storyline really got to the point where it became \"eye\" rolling, boring, and skimmed reading with a huge sigh. I'm not even going to bother to pick up the other books to see what happens to Ernest, or Dennis or the 2 kids that Ernest seems to think left his son Darren to get attacked by the zombies A big YAWN to The Unwashed Dead"}, {"userName": "Robert DeCoteau", "userReviewDate": "May 14, 2011", "userURL": "http://www.goodreads.com/user/show/5406709-robert-decoteau", "userReview": "Ian Woodhead's book The Unwashed Dead is delightful. He explores the zombie invasion with fresh eyes in bad neighborhood in the UK. His characters range from good to bad to down right insane. None are ever safe from the zombie invaders.This story reads like a cross between Trainspotting and Shaun of the Dead. I enjoyed the fast pace and back story. My only criticism is that there are various grammatical errors that could be cleaned up. Overall it's a good read from an up and comer in the indie author world."}, {"userName": "Faye, la Patata", "userReviewDate": "Feb 12, 2012", "userURL": "http://www.goodreads.com/user/show/7650833-faye-la-patata", "userReview": "I purchased the kindle version of this last night and finished it in one sitting. After I got to the last page, I really was disappointed that it was so short! It's a good, quick, zombie read - full of gore and interesting characters. It doesn't really bring anything new to the zombie world, but that's okay, it doesn't matter, I still had fun!About to buy the sequel of this. I have a feeling I will not be disappointed!"}, {"userName": "Andy Angel", "userReviewDate": "Apr 01, 2011", "userURL": "http://www.goodreads.com/user/show/4731969-andy-angel", "userReview": "Another cracker from Mr. Woodhead. A northern town is infected by something that turns people into ravening zombie types (or 'deadies') in an instant. Only a few remain unaffected, and, this being Ian Woodhead, they are not particularly nice people. The characterisation of the 'northern' people is spot on and the tension ramps up quite steadily as the tale progresses.Hopefully there will be more to come from this story and I, for one cannot wait for TUD2 if i happens"}, {"userName": "Chris Walker", "userReviewDate": "Sep 09, 2011", "userURL": "http://www.goodreads.com/user/show/5387421-chris-walker", "userReview": "Well What a breath of fresh air.... Zombies..Scrotes and Yorkshire all in one book. Loved it! Some really strong characters added into the mix of my favourite genre made this a really fun read,very light hearted even for a horror book,never taking itself seriously but with lots of serious moments thrown in just to remind you what you are actually reading. Cannot wait to read some more of Mr Woodheads stuff ......GOOD READ"}, {"userName": "Christopher Beck", "userReviewDate": "Apr 11, 2011", "userURL": "http://www.goodreads.com/user/show/4983147-christopher-beck", "userReview": "Ian sucked me into his world, once again, with The Unwashed Dead. Tightly written and fast paced, this creepy read is fill with wit, humor and tension. The characters are real and so is their dialogue. Was I left with questions after this read? Yes I was but, as the author seems to have plans for at least one sequel, I'm OK being left with questions for now."}, {"userName": "Bill", "userReviewDate": "Mar 05, 2012", "userURL": "http://www.goodreads.com/user/show/5698191-bill", "userReview": "This was one of those books that I had to finish because I already put too much time into reading it. I didn't care for it at all, the characters were forgettable, literally. I kept saying to myself \"wait, who's that now?\" Also the ending felt like it finished mid-sentence. This was my 1st zombie book I ever read, I'm hoping the others I read are a lot better."}, {"userName": "Mark", "userReviewDate": "Feb 17, 2014", "userURL": "http://www.goodreads.com/user/show/15122200-mark", "userReview": "I bought this hoping for another Apocalypse Cow, but was slightly disappointed. The writer captures the language well, but tends to drag things out like James Herbert, with chapters dedicated to one character that will be zombie food by the end of the chapter, but does include a few things that make sense further on in the story."}], "description": "In a rundown council estate in the North of England strange things are happening. The dead suddenly are not quite as dead as they should be......A mysterious government body has decided to use the estate as an experiment. Things are out of control & now they need to eradicate all knowledge & existence of the estateBut what happens when a small group of survivors band together? Will they survive the apocalypse & triumph over the undead?", "title": "The Unwashed Dead\n      \n          (Zombie Armageddon #1)", "url": "https://www.goodreads.com/book/show/10894176-the-unwashed-dead", "average": 3.66, "cover": "https://images.gr-assets.com/books/1328785041l/10894176.jpg", "reviews": 46, "authors": [{"url": "https://www.goodreads.com/author/show/4369603.Ian_Woodhead", "name": "Ian Woodhead"}], "type": ["Horror", "Horror", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/10894176-the-unwashed-dead", "http://www.goodreads.com/book/show/20351813-the-unwashed-dead", "http://www.goodreads.com/book/show/26054625-brutality", "http://www.goodreads.com/book/show/9358877-spore", "http://www.goodreads.com/book/show/12011477-walking-with-zombies", "http://www.goodreads.com/book/show/26815113-depravity", "http://www.goodreads.com/book/show/22876498-dead-bones---six-pack-the-ultimate-zombie-collection"]}