{"ratings": 30, "userreviews": [{"userName": "Patricia Romero", "userReviewDate": "Apr 24, 2015", "userURL": "http://www.goodreads.com/user/show/5250985-patricia-romero", "userReview": "This is a marvelous book set in post civil war Mississippi! The well-developedplot and interesting characters drew my interest from the start and held it throughout. I had an immediate feeling for the heroine and felt like I was there with her in those magnificent antebellum mansions and walking the lovely villa garden paths. Especially appreciated was the spiritual theme which was well brought out by the characters actions and the various subplots."}, {"userName": "Carly", "userReviewDate": "Feb 15, 2015", "userURL": "http://www.goodreads.com/user/show/34417088-carly", "userReview": "i have to state that i was lucky enough to win this book from the author and goodreads. Thankyou to everyone who made this giveaway possible.This is the story about a woman named Laura and it is set in 1875 in Mississippi and is essentially a love story. I found this book to be intriguing and a really different aspect of life. I think it was really interesting to watch this character grow and develop throughout the book as she faces some tough situations. The author has really described the place where the book is set so well and it is easy to imagine it all, even though i have not experienced this period in time. I recommend this book to everyone who has ever really lived!"}, {"userName": "Robin", "userReviewDate": "Apr 11, 2015", "userURL": "http://www.goodreads.com/user/show/24825903-robin", "userReview": "This is an amazing read, reminiscent of an Elsie Dinsmore story by Martha Finley. So many twists and turns. Happiness, loss, pain, fear, unforgiveness, danger, forgiveness, repentence and restoration. All of these were well covered and dealt with in this remarkable love story. I so enjoyed it that when it was over, I just wanted more. Highly recommended. I received a copy of this book in exhange for an honest review."}, {"userName": "Tanya", "userReviewDate": "Feb 15, 2016", "userURL": "http://www.goodreads.com/user/show/16486737-tanya", "userReview": "The Union of the North and South by Ann Mock captured my attention from the start. Not only is Ann's writing reminiscent of one of my favorite authors, Lori Wick, but I so enjoyed the twists and turns throughout the story. If you like romance and mystery, you'll thoroughly enjoy this novel."}, {"userName": "Sonia", "userReviewDate": "Jan 13, 2015", "userURL": "http://www.goodreads.com/user/show/39116844-sonia", "userReview": "I had to stay up all night to finish reading this book! I loved it and want a sequel!!! It was so refreshing to read such an entertaining and clean book!"}, {"userName": "Cynthia", "userReviewDate": "Jul 20, 2017", "userURL": "http://www.goodreads.com/user/show/11894433-cynthia", "userReview": "A lovely sweet clean spiritual historical romance that keeps your interest. Your heart really goes out to Laura who has went through so much losing her husband, his family really adds to her heart break when they dissolve her marriage after his death. Her secret is a big one which she guards with her life, if people found out they might turn the tables on her. She is doing what she feels is best but things get out and if this one does it will change her life forever. I thought the narrator did a great job she has no trouble switching from women to men or even children voices. At times her voice does sound a little childlike but one becomes so into the story they over look it. I really liked her male voices she has no trouble carrying off the deep rich tones. There are no background noises, no repeating of words or any volume changes throughout the audio. She does give deep rich emotions to her characters. You have no trouble knowing what each is feeling. She carries off the emotion tones of excitement, sadness etc very well. This is the first I have listened to this narrator and I felt she did a great job pulling the listener in.This was a fun listen with vivid details given to the plot, scenes and the beautiful landscape. The author gives you a wonderful message of starting over, trusting and forgiveness. I enjoyed the buildup of the romance. I did think at one point Bradford overstep his self when I didn’t feel it was in his place. Laura has some major decisions to make that will change her life. She carries so much hurt and anger that it will be hard for her to overlook what she wants and what is right. I really enjoyed the misunderstanding, the drama and suspense. This was truly a lovely story that I feel most will enjoy."}, {"userName": "Cindy Patterson", "userReviewDate": "Aug 22, 2017", "userURL": "http://www.goodreads.com/user/show/29863058-cindy-patterson", "userReview": "A beautiful reminder of love and forgiveness...The Union of the North and the South will transport you through a descriptive historical fiction with a setting that's both elegant and graceful.This is a touching story filled with charming characters, love, suspense and a happy ending.With a writing style similar to Lori Wick, you will move from one character's POV to another's flawlessly.I really enjoyed the journey through time and the detail Ann Mock effortlessly filtered into each scene.A beautiful reminder of love and forgiveness. Highly recommended!!"}, {"userName": "Jannette Spann", "userReviewDate": "Mar 01, 2016", "userURL": "http://www.goodreads.com/user/show/24331967-jannette-spann", "userReview": "The Union of the North and the South depicts the life of Laura Malcolm Taylor, the only child of a rich banker in the post-Civil War era. Her parents have managed to save their antebellum home, Oak Grove, from the Yankees, only to lose it through bad business investments to a man from New York City.After the tragic death of her young husband, Laura spends the next five years of her life hiding the secret that could possibly cost her the young daughter she loves so dearly. With the help of her parents, Laura matures as her daughter grows. But it’s the New York Yankee, Bradford Hampton, who teaches her how to forgive and heal, and in so doing, she finds true love and peace again.The descriptions of the large antebellum homes, their interiors, the gardens and the surrounding grounds are beautifully written, as were the scenes of the ballroom dances and elegant dresses of the day. Although the memories of the Civil War still abound, these families work hard to restore the genteel lifestyles they so enjoyed before the war ever began. This book is written with a gentle narrative and Christian principles which demonstrate the power of forgiveness."}, {"userName": "Kristin Spencer", "userReviewDate": "May 21, 2016", "userURL": "http://www.goodreads.com/user/show/44525614-kristin-spencer", "userReview": "This novel is an extremely well written tale of Lauren, a woman who has lost everything, well almost everything, when several unfortunate events take place in her life after the Civil War. Things in the South have gotten downright depressing after war. With confederate money being worth nothing, many prominent families are forced to leave their plantation homes and make another way in the world. Though Laura’s family has survived the economic devastation of the war, that doesn’t mean they are free from trouble.This book was a delight to read. I couldn’t put it down. But at some points I felt very sad for Laura. Is God’s plan for her good? It seems like one tragedy follows another, and then there is the matter of the man that keeps trying to kill or injure her. She isn’t sure which is his goal. If you like historical fiction, you will love this book. The details were definitely well researched. There wasn’t one inappropriate moment in it, either.I received a free copy of this book for an honest review."}, {"userName": "Regina Andrews", "userReviewDate": "Mar 18, 2016", "userURL": "http://www.goodreads.com/user/show/2185171-regina-andrews", "userReview": "A Wonderful Romance from a Fantastic AuthorWith one of the most touching opening scenes I’ve ever read, Ann Mock’s sweeping romance \"The Union of the North and the South\" is a power-packed story that does not let up. This outstanding romance features Laura as the heroine in post-civil war Mississippi (1875). I found this book intriguing and informative, and historically accurate. (Even if history is not your favorite area, readers will enjoy this historical novel.) The characters are well-developed and the setting lush and filled with antebellum charm. The author has done a great job developing her characters realistically and she is especially adept at writing realistic dialogue from a child – a very tricky technique. This novel is clean and uplifting with a nice spiritual message. The theme of forgiveness is beautifully done. I highly recommend this novel for its appeal, interest and romance. A beautiful cover, and a beautiful story!"}, {"userName": "Claire Fullerton", "userReviewDate": "Nov 25, 2015", "userURL": "http://www.goodreads.com/user/show/24890050-claire-fullerton", "userReview": "It was the beautiful cover of this book that got my attention; there is something elegant and suggestive of time and setting that piqued my interest, and I quickly discovered that Ann Mock's writing style on the pages within were seamlessly appropriate and complimentary. I love the American South, and Anne Mock takes us there and invites us into Laura's story, which begins with premature loss, in the death of her husband, and carries the burden of secrecy in what is their child's true identity. This is a graceful, feminine book that weaves soft descriptions of atmosphere, language, life-style, and social mores throughout an engaging plot. Love, loyalty, loss and forgiveness are presented through the scrim of Christian principles in post civil war Deep South, where the triumph of the spirit prevails in the end. If you are the sort of reader who loves to be transported to a time and setting so visceral as to effect your mood, then read this beautiful book!"}, {"userName": "Patricia Nichvolodoff", "userReviewDate": "Jan 21, 2016", "userURL": "http://www.goodreads.com/user/show/50006996-patricia-nichvolodoff", "userReview": "Ann Mock writes a wonderful romance novel filled with drama and suspense weaving a theme of forgiveness and learning to let go of past hurts. Her descriptive writing and detailed historical events create vivid imagery throughout her story. She has an unique way of going back and forth from the past to the challenges of the present in her intriguing plot. Ann Mock skillfully displays the character growth in her main featured woman, the lovely Laura, as she struggles with her emotions as they rock between resentment and forgiveness. This is a must read for people who want to be immersed in the lives of story characters and feel their every emotion, be it joy, sadness, desperation, resentment, fear, bravery, jealousy, hatred or love. I very much enjoyed reading this book."}, {"userName": "Peggy", "userReviewDate": "Apr 15, 2016", "userURL": "http://www.goodreads.com/user/show/41709213-peggy", "userReview": "This was a wonderfully sweet story that I didn’t want to end. I so enjoyed the characters as well as the setting and the time period. It sort of reminded me of a Jane Austin book. The book had everything…love, loss, fear, mystery, suspense, as well as an underlying theme of godliness and forgiveness. I listened to the Audible version which I won via a drawing posted on Goodreads. I loved listening to it! The narrator did an awesome job doing different voices for all of the different characters. It was like listening to a play!I highly recommend The Union of the North and the South by Ann Mock! If you like sweet love stories with some villains and some twists you will love this book!"}, {"userName": "B.J. Robinson", "userReviewDate": "Jun 06, 2015", "userURL": "http://www.goodreads.com/user/show/5841874-b-j-robinson", "userReview": "Vivid description and when I first started reading it, I read all the way through Chapter Nine without putting it down. The author has woven a very good plot. I thoroughly enjoyed the story though I did figure out what happened to Jenny and who was behind it. That might be the writer in me. I love the cover. It is beautifully done. The story kept me engaged. I could visualize the characters and the setting. The theme is one of forgiveness, and I thought the author did a great job with it. I enjoyed when Bradford told Saundra what he thought toward the end. I also enjoyed how the grandparents came to realize how wrong they were with the choices they'd made. A beautiful story of love and forgiveness. I was glad when I read what happened to Jenny later on."}, {"userName": "Cynthia Yoder", "userReviewDate": "Jan 03, 2016", "userURL": "http://www.goodreads.com/user/show/18465055-cynthia-yoder", "userReview": "Mock vividly evokes the visual flavor of the period, with descriptions of period dress, architecture and customs. I love the rich detail, such as how the waltz is still new and slightly scandalous, or a man's glimpse of the protagonist's ankle causes her to blush. I was drawn into the story by the upset identity between mother and daughter, which gets played out through the course of the book. The romantic relationship is also well played; the main characters bumble along without immediate resolution, providing a great play of romantic tension. At times, I felt I was watching a movie while reading this book because of Mock's pictorial style."}, {"userName": "Sandra H.", "userReviewDate": "Mar 21, 2016", "userURL": "http://www.goodreads.com/user/show/5438796-sandra-h", "userReview": "The Union of the North and the South is a wonderful story set in Vicksburg, Mississippi in 1875. The author beautifully draws the reader in with warmth, adventure, ambiance, and intrigue. Every now and then there is a gentle turn of words that made me as a reader want to pause for a moment to drink them in. It’s a story about love, loss of love, and newfound love mingled with misunderstanding and forgiveness. Unexpected twists and turns brought heartfelt smiles. I found this tender book delightfully feminine and a wonderful world to get lost in."}, {"userName": "Brooke Williams", "userReviewDate": "Mar 10, 2016", "userURL": "http://www.goodreads.com/user/show/1581809-brooke-williams", "userReview": "I never really got into history when I was in school but this book made me rethink that. It was fascinating to read about these fictional characters in such a real way. The past came alive through the pages and I couldn't wait to see where the author took them. Part of the story is sad as the main character has to go through a lot of loss. But she comes through it with gumption. It was fun to see the authors plan for the storyline coming together."}, {"userName": "Leslie", "userReviewDate": "Apr 25, 2016", "userURL": "http://www.goodreads.com/user/show/21493342-leslie", "userReview": "Historical fiction is my favorite genres and I was overjoyed when Ann informed me I won the Goodreads drawing. From the start, I was pulled into the time period and vivid scenery. The character development throughout the book is captivating as we watch Laura mature and apply Biblical principles such as kindness and forgiveness. The narrator, Kendall Atkins Livick, did a wonderful job of differentiating between the characters. I am anxiously awaiting the sequel!"}, {"userName": "ANNETTE", "userReviewDate": "Nov 06, 2015", "userURL": "http://www.goodreads.com/user/show/43204327-annette", "userReview": "Wonderful romance novel filled with suspense , faith, love & forgiveness. This book is very historical throughout. I would recommend this book and will be watching to see if Ann Mock writes any more books."}, {"userName": "Lauren Lynch", "userReviewDate": "Jun 29, 2015", "userURL": "http://www.goodreads.com/user/show/7843579-lauren-lynch", "userReview": "I enjoyed the themes of forgiveness in this story about overcoming loss and finding love in the process. Recommended for those who enjoy clean historical romance!"}], "description": "READERS' FAVORITE INTERNATIONAL BOOK AWARD WINNER2015 Readers' Favorite Honorable Mention Winner Romance-ChristianRomance and suspense come alive in this uplifting Christian novel set in the South in the 1870s.Shadowed by majestic oaks on the banks of the Mississippi River, Oak Grove, the ancestral home of the Malcolm family, symbolizes their courage, resilience, and strength. The reader will fall in love with the intriguing story of Laura who overcomes personal tragedy, and is forced to hide a secret that, if revealed, will cause her great heartache. Amidst the revitalized social scene of a recovering South, Laura has to sacrifice one of her most precious desires in order to protect someone she loves above all else. Can Laura make her enemies become allies as she confronts her secret and finds the strength to forgive as well as to love again?", "title": "The Union of the North and the South", "url": "http://www.goodreads.com/book/show/23176412-the-union-of-the-north-and-the-south", "average": 4.6, "cover": "https://images.gr-assets.com/books/1415960292l/23176412.jpg", "reviews": 20, "authors": [{"url": "https://www.goodreads.com/author/show/8535531.Ann_Mock", "name": "Ann Mock"}], "type": ["Romance", "Romance", "Historical", "Audiobook"], "outlinks": ["http://www.goodreads.com/book/show/23176412-the-union-of-the-north-and-the-south", "http://www.goodreads.com/book/show/28168785-runaway", "http://www.goodreads.com/book/show/35148447-juliet", "http://www.goodreads.com/book/show/35913695-hidden-secrets", "http://www.goodreads.com/book/show/40198274-kiss-me-while-i-sleep", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/35839275-kian", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/26186801-someone-like-you", "http://www.goodreads.com/book/show/18800300-from-thin-air", "http://www.goodreads.com/book/show/18950617-sweet-caroline", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/18800331-to-hope", "http://www.goodreads.com/book/show/33016164-royally-bad", "http://www.goodreads.com/book/show/34609092-royally-ruined", "http://www.goodreads.com/book/show/40193474-the-finishing-touches", "http://www.goodreads.com/book/show/40193549-roses", "http://www.goodreads.com/book/show/19032297-accidentally-in-love-with-a-god", "http://www.goodreads.com/book/show/29231863-splinter", "http://www.goodreads.com/book/show/23622993-claimed", "http://www.goodreads.com/book/show/40243614-just-jilted", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/18800455-the-pms-club", "http://www.goodreads.com/book/show/18800812-gypsy", "http://www.goodreads.com/book/show/35708042-bodyguard", "http://www.goodreads.com/book/show/18800579-willow", "http://www.goodreads.com/book/show/30126159-mosaic", "http://www.goodreads.com/book/show/40389026-summer-island", "http://www.goodreads.com/book/show/12369122-because-of-you", "http://www.goodreads.com/book/show/29373539-the-lullaby-sky", "http://www.goodreads.com/book/show/28441063-secretly-hers", "http://www.goodreads.com/book/show/23271170-tycoon-takedown", "http://www.goodreads.com/book/show/18800411-come-high-water", "http://www.goodreads.com/book/show/33001355-before-i-knew", "http://www.goodreads.com/book/show/40205166-the-paradise-of-glass", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/21425515-once-haunted-twice-shy", "http://www.goodreads.com/book/show/40272947-the-pursuit-of-tamsen-littlejohn", "http://www.goodreads.com/book/show/40193595-the-story-of-beautiful-girl", "http://www.goodreads.com/book/show/11781578-lover-s-leap", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/30184217-say-goodbye-for-now", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/18800690-love-is", "http://www.goodreads.com/book/show/36685093-the-unimaginable"]}