{"ratings": 698, "userreviews": [{"userName": "Dave Farmer", "userReviewDate": "Mar 28, 2013", "userURL": "http://www.goodreads.com/user/show/8472613-dave-farmer", "userReview": "My journey of discovering better than average ebooks by amateur writers has been a somewhat hit and miss affair. I've read a fair number of appalling attempts at fiction by people who should stick to only writing birthday card messages. I keep on reading in the hope of finding evidence that some amateur writers can in fact write, and write well enough to keep me turning the page.When I stumbled across The Undead: The First Seven Days I was intrigued by the title, for me anything undead is worth investigating. I don't read reviews as they're way too misleading for many reasons. But I do scan the first few pages of the \"look inside\" bit to check if the quality of writing/style/layout etc is worth shelling out a few quid.I finished this book about 2 weeks ago. I prefer to digest what I've read before writing anything about it so I can get my thoughts in order and provide a well balanced review. It's all well and good to crank out a quick \"This is an awesome story!!!! The best ever!!!!!!\" or even \"Total dross, don't bother, it's rubbish\" but it doesn't do a writer or fans of a genre/author any credit for their hard work and effort.Well rounded, thoughtful and above all constructive feedback is where I prefer to go when it comes to reviews.Usually I head to the Good Bits and end with the Bad Bits, however, this time I'll hit the bad stuff first because I want this review to end on a high pointBefore I get started I will say now that I enjoyed this book immensely, despite its faults. If you're a fan of the zombie/apocalypse genre then you should read this book. Simple as that. There are some spoilers here folks, though nothing hugely important that gives away the plot in any great detail.What's BAD about The Undead: The First Seven Days:Point of View: The story starts off with a first person perspective. It's not entirely clear if this is a diary or simply an account, not that it matters much. I enjoy first person stuff - seeing events unfold inside a characters head can make a story tense and gripping. The problem with the POV is that it switches about. A lot. From first person to third person, and back again, then to another character first person and back once again.I felt R.R Haywood realised he wanted to tell more than what was being seen by the main character, Howie, and needed a quick get-out clause to go off and explore the world beyond Howie. At one point Howie explains to the reader that he will be switching to 3rd person in order to better explain the events around those 7 days. Okay. Weird. I could live with that, just about. The weird thing about the switching is how it was relayed to the reader. When the story flips to 3rd or 1st person of another character, Haywood titled that section as \"Extract from Howie's diary\" which didn't make sense to me.How could Howie write about a plague of zombies, zombie rats and cats (a cool twist I thought) when he wasn't actually there to see those characters? When writing a diary based first person POV it doesn't make sense to switch to another 1st person POV and still call that chapter \"Howie's diary\" because it wasn't him! And cat's, rats, zombies and plague virus's can't write (as far as I know) so having them tell their story didn't make any sense, in the context Haywood laid out for the reader.I overlooked that quirk because the story told from the plagues POV really did add a nice element to a tried and tested zombie plot.Personally I wouldn't have had Howie tell the reader he planned to switch at all or used the frequent implausible chapter titles \"Extract from Howie's diary.\" Giving a chapter a number or brief name is enough, and the reader would easily pick up on the fact that the POV has changed.Details that didn't upset my enjoyment I should add for reasons I'll get to in a bit.Repetition: Within the first few pages I almost deleted the book from my kindle. When Howie is at home and the zombies are at his front door, he spends a lot of time saying stuff like: \"I next go into the lounge\" and \"I go back to...\" and \"I run into the...\" and \"I look around\" and \"I grab things.\" And so on. I understand it's going to be a traumatic experience for any sane person to be plagued by zombies but that sort of repetition is very exhausting.This calmed down after about 10 pages or so. Thankfully. The other form of repetition is the hacking/slashing/whacking/chopping/dicing and slicing action. Zombies are everywhere. It's gross, dirty, horrific work to chop down what used to be human beings, but it felt as if Haywood enjoyed writing every little detail often rather than giving thought to how much was necessary to move the story forward.Tenses: I don't recall specifics but I'm sure I came across plenty of contradictions in the use of tenses. Like the POV switching the tenses get muddled up in places with present tense and past tense combined. Enough to make me wince at times but again not enough to put me off turning the page.Dialogue:Some of the dialogue is pretty damn good. The characters come across very well with dialogue alone without the need to add: \"...said Howie\" after speech. The weird thing I noticed is that Haywood has a knack for writing a lot of dialogue without paying enough attention to how people actually speak.For example, one character might say \"He is dead...\" instead of \"He's dead...\" because it's their personality trait. But when every character speaks like this it doesn't read right. More so in tense, action scenes. In a life or death situation I'd be caught off guard, and likely killed by zombies if I noticed everyone around me said things like: \"They have killed him\" and \"We have got to get out here\" and \"You do not understand.\"Writing is about constantly learning, so I apologise for bashing Haywood over this little thing, but it's an important little thing that often made dialogue stand out as awkward rather than flow like we talk banter with our friends/family etc. Paying attention to dialogue can make a huge difference to a reader feeling a book was okay and easily forgettable rather than fantastic and memorable.Thankfully there are loads of good points that still make this a memorable one for me.What's GOOD about The Undead: The First Seven Days:Get over the bad stuff and it's a cracking story! Initially Haywood wrote it in 7 individual parts so I'm very grateful to have read the entire thing in one go. And I'll be grabbing the next set very soon, I think the story currently goes to day 10 at the time of writing this review.Howie and Dave: A brilliant partnership and friendship grows between these two. Howie, a supermarket manager and Dave, an ex-special forces guy. Their interactions alone drive the story along, the way they grow to need, respect and protect one another. Their dialogue ranges from witty and smirk raising to sombre and tearful in places.Their journey is the main highlight for me. There were times when I feared for them, and that doesn't happen very often when I'm reading a book - Dark Tower by Stephen King, the bit with Eddie Dean, if you're a fan, you'll know what I'm talking about - that was tearful and scary.I found plenty of subtle facets to their friendship that kept me turning page after page until well after my bedtime alarm had gone off.The Recruits: Slight negative one here - I found the new army recruits (TA I think, perhaps)ability to learn and master weapons and combat techniques a little too easy. That aside there are plenty of interesting characters to get your teeth into, just the right amount of description too. Occasionally I'd find myself flipping back a few pages when a name is mentioned, thinking \"er, who's this guy who's just died?\" because a few of them don't have much if anything to say.The banter between them is well paced and flows beautifully (for the most part.) Lots of quick retorts, put-downs etc that build characters in the imagination machine inside your noodle. Aside from the easy ability to master army stuff, the journey of the recruits coming from wet-behind-the-ears lads to an organised and hardened team is thoroughly enjoyable. The impact of this is felt close to the end of the story.The Plague: The idea of telling parts of a zombie story from the POV of the virus is a stroke of excellence. I don't recall coming across that concept before, though I dare say it's been done before, but then hasn't everything? The plague's journey is every bit as enjoyable and essential as each of the other characters.It's refreshing to see this side of a zombie story, how a plague thinks, how it uses humans as hosts, how it learns and evolves, creating a hive mind spread across the globe. A nice twist I wasn't expecting, though as mentioned before told in clunky manner.At times I felt guilty for quietly rooting for the plague because it too wanted to survive. Just once I wanted to see it win, though to be fair that would make for a pessimistic plot twist. However, I suspect not entirely a bad one if done well. Scale: Zombie apocalypse plots are rooted in a global event of human downfall. Anyone who's read World War Z or seen the movie trailer (yeah, I know, but I'm still going to see it anyway) will expect epic scenes of thousands or millions of undead swarming or shuffling after those few survivors.Haywood starts small with a handful of creatures in a quiet suburban street. He ups the pace by a few degrees at a time, moving to a supermarket bloodbath, to a country village, city, army barracks, London and more. The size of the zombie hordes increases at a good rate though I was very aware that Howie and his army also increased their skills and abilities to deal with the ever increasing numbers. I felt this was somewhat unrealistic but the alternative was to kill the main characters off quick because they're not Rambo clones but normal people. And that's not a recipe for successful heroic last stands and pitched battles is it?Last Stand: It goes without saying that many zombie plots need a last stand. Whether that's against a small or large horde. Without giving too much away this one had me reading fast and furious. I'm not joking when I looked at my clock to find it was 3am, groaned because I had to be up at 6 and then kept on reading.In the end I had to put it down but only after promising myself I'd finish it the moment I got home the next evening. The only gripe I had was the obviousness of a last stand pretty much in the first 20 pages or so, mentioned in a radio broadcast that Howie hears in the car. After that it's obvious that last stand is coming.In one way that's sort of bad because you know it's going to happen and more or less where. It puts a dull sheen on the \"oh man, what the hell's going to happen next?\" feeling. On the other hand it sure was something to look forward to and watch to see which character wasn't going to make it there.Final Thoughts:Putting aside the bad points, this was a hugely enjoyable read. It's a long one too with lots of action and struggle to get your apocalyptic taste buds into. I could go on about the good points, but I'll leave it there to preserve the fun for potential readers. I paid £2.98 for The Undead: The First Seven Days - a book Amazon states as having 799 pages. I consider that very good value for money.What I did notice is that Haywood seems to have matured as a writer during the process of creating this story. The latter parts, days 4 onwards, are considerably better written than the early parts. I like that. Haywood clearly enjoyed writing this story, enough to continue after day 7.I think if I met him I'd shake his hand and say: \"Well done, fella, you had a story to tell and told it very well. Keep writing and I'll keep reading.\"And isn't that the essence of a good story teller? The ability to hook the reader and keep them wanting more. I know I do."}, {"userName": "Kevtm", "userReviewDate": "Jul 09, 2014", "userURL": "http://www.goodreads.com/user/show/7844736-kevtm", "userReview": "Absolutely hated it, and this comes from someone with a huge weakness for zombie novels.The dialogue is just terrible. As a test, drink a shot every time the protagonist calls someone 'mate'. Wake up on the floor covered in urine and realise that you've only finished one chapter. I won't even discuss the 'plot'."}, {"userName": "David Nelson", "userReviewDate": "Apr 21, 2016", "userURL": "http://www.goodreads.com/user/show/24756706-david-nelson", "userReview": "More like a 3.5...So I keep reading that Haywood is an 'amateur writer', something which I never quite get my head around as by now he's got about 20 published books. I'll come back to that.Basically this is a zombie outbreak story which is told in a pretty straight-forward, no-frills way. Nothing too arty or weird; just following one person's story and focusing a lot on the fighting and battles - It reads like a zombie B Movie. I happen to really like zombie stories though, particularly the outbreak itself and how the first few days pan out, which is kinda this book's thing.What it does well is that it's quite compelling - you want to keep reading and find out what happens. There are a couple of intricacies to this particular brand of zombies which are interesting, and the story does develop to have a proper antagonist, rather than just Howie Vs Zombies. It's also quite funny, with a sort of Shaun of the Dead type humour.What lets it down is the writing. I said he's an 'amateur' and I guess you can see that. Each day/chapter of the book gets much longer, as if you could see his growing confidence as he built his world, but for me this came to a head on Day 7 which was absolutely enormous compared to all the other chapters. This last chapter was probably about 1/3 just summarising and repeating the last 6 days, and it became a slog to read, with huge sections that I felt I could've just skipped and not missed anything. I get that the series was originally released episodically, but reading it in a compilation like this it was all fresh in my memory. The dialogue is also pretty poor. It's very practical and the characters mainly concern themselves with the plan for what to do next, but some things jarred, like when Howie is reunited with people he knows and they don't take a minute to discuss what happened to people they know, or how they are doing. There's a LOT of gay jokes which is passed off as banter between characters, which seems a bit unnecessary, but passable, but then it gets to a stage where a certain character (no spoilers) starts using a lot of insults like \"you like sucking cock you big faggot\" and it just feels absolutely crass and ridiculous, both just as a piece of dialogue, but also in terms of who's saying it and its place in the story.Overall it is entertaining, and I am interested to read day 8 onward, but it's really straight-forward, which at times helps move the story along and ground it so that it doesn't get too arty or wanky, but at times really hurts its credibility."}, {"userName": "Elizabeth", "userReviewDate": "Apr 04, 2013", "userURL": "http://www.goodreads.com/user/show/6888541-elizabeth", "userReview": "It isn't often I give a book a five star rating, but this was so genuinely fun to read that I couldn't help myself.This is a collection of the first seven books in an ongoing serial, which I didn't realize when I bought the book. I was happy about it, though - YAY! to reading it all at once.By far, the most amazing part of this book is the relationship between Howie and Dave. Utterly believable but utterly unique at the same time. A close second is Howie's evolution through the book, which isn't so much evolution as refinement. It was quite a departure, and a welcome one, from the usual \"rough and ready\" alpha male action hero that you usually find in a zombie tale.Then there's the supporting cast. What a great group of folks - whether they were good or bad, they were all interesting and individual. This is pretty non-stop action - usually that bores me, but in this case it was gripping and I had a hard time putting it down.Recommended. Now to get my hot little hands on the rest of them."}, {"userName": "Julie Greig", "userReviewDate": "Jun 02, 2014", "userURL": "http://www.goodreads.com/user/show/31928904-julie-greig", "userReview": "Be prepared to loose time!Get settled and start ordering the next seven books or - how lovely to compile the series for us - the next weeks worth of the teams adventures.Each book can be read on it's own but to really get to grips with the depth of the characters it is best to get them in order.LOVE them all :-)"}, {"userName": "Vaira", "userReviewDate": "Feb 16, 2013", "userURL": "http://www.goodreads.com/user/show/12377022-vaira", "userReview": "Brilliant epic zombie story. Very well written with great humour and wonderful characters. Highly recommend to any zombie or post apocalypse fan."}, {"userName": "Freedom", "userReviewDate": "Mar 04, 2016", "userURL": "http://www.goodreads.com/user/show/15980316-freedom", "userReview": "LOVED IT ALL...(check all my updates for my reviews for each day) laughed, cried, went through every emotion imaginable...READ THIS READ THIS READ THIS!!!"}, {"userName": "Ian", "userReviewDate": "Aug 19, 2014", "userURL": "http://www.goodreads.com/user/show/3812181-ian", "userReview": "Despite being a huge fan of classic old zombie movies and thoroughly enjoying The Walking Dead comic and TV series I've never felt compelled to try out zombie fiction. Due to the tremendous amount of five star reviews I thought I'd give this a go.It's terrible. I've no idea what the intended age range is, I'd probably have loved it in my mid teens, but as a forty something adult I'm looking for a lot more plot. Well, any plot would be nice. I've given up on it a quarter of the way through, the story really hasn't progressed anywhere, endless scenes of the main (and pretty much only) character moving from one zombie action scene to another. At one point half a page is given over to a descriptive passage of him taking a shit. When another character is finally introduced, and I hope for some meaningful interaction, he's virtually mute.The writing style is perfunctory at best, often juvenile. Nothing happens, just repetitive action scenes. I hate to write such a negative review but this was truly dreadful."}, {"userName": "Laura", "userReviewDate": "Jul 23, 2014", "userURL": "http://www.goodreads.com/user/show/32812292-laura", "userReview": "When I start reading a book, I expect to have a wonderful time all the way through it. If it's a zombie novel, I obviously expect lots of zombies and tension. As rare as it might be, this book turned out to be all that it promised; very fast-paced, entertaining and funny, It is definitely not high literature for elevated souls, but it's written in a very convincing way with sometimes repetitive dialogues that bring more reality to the plot. There was just one point I didn't quite understand which was Howie's journal. It made me think Howie would turn into a hibrid or a mutant and would be able to experience the same situations from different perspectives. Despite the fact that the approach from the virus's standpoint was very clever, it was done in a way that didn't make sense to me. All in all, I can't help recommending this book to anyone who can appreciate without prejudices this kind of literature, because for me, it's been one of the best books I've ever read."}, {"userName": "Missy~", "userReviewDate": "Oct 26, 2015", "userURL": "http://www.goodreads.com/user/show/1132228-missy", "userReview": "I haven't read the print books, I actually listened to the audio versions available thru Audible.com. I was looking for something to feed my TWD fix.These books are alot of fun. Set in England, the MC is Howie, formerly a grocery store manager, with his band of sidekicks, beginning w/ Dave.Howie and Dave are awesome, with the books set in a day to day format, showing Howie learning to be a badass hero. In the first days, fighting his way to London with a mission to save his sister Sarah. Fighting off Zombie horde's all over the English Country side. Dave is one of my favorite characters, a quiet, quirky former special forces soldier who is a one man killing machine with a fierce protective streak for \"Mister Howie\" and t rest of their group. The narrator Dan Morgan does an excellent job. Highly recommend this series of Zombie stories."}, {"userName": "Franco Boggle", "userReviewDate": "Jan 04, 2016", "userURL": "http://www.goodreads.com/user/show/18900184-franco-boggle", "userReview": "the virus has a mind of its own... thats just retarded"}, {"userName": "Jack", "userReviewDate": "May 29, 2018", "userURL": "http://www.goodreads.com/user/show/63088823-jack", "userReview": "Zombies? Really?Pretty good for a book about zombies! It’s not my normal genre, but interesting all the same.After reading the first three books in the ‘Extracted’ series by RR Haywood, I found that he had originally written a series of books about the apocalypse via a zombies outbreak/invasion. I was a little hesitant to read a book about zombies because I had never done so before. But, RR Haywood’s  writing style in the ‘Extracted’ series was so well done that I decided to give it a shot.True to form, Haywood’s characters are very well-developed, and he drawls  you into the story forcing you to turn page after page as quickly as you can in order to find out what happens next.Very good series…even if it is about the zombie apocalypse!"}, {"userName": "Cheryl McGill", "userReviewDate": "Jun 25, 2017", "userURL": "http://www.goodreads.com/user/show/29806263-cheryl-mcgill", "userReview": "Brilliant effort in the beginning...butThe first 3 chapters were brilliant and truly held my attention. Yet, by chapter 4, the author switched from a 1st person point of view to 3rd person and that is where the story lost most of its momentum. The story became boring as the zombie killing scenes became repetitive and lacked any new interest. It seemed that each \"new\" scene that included zombie killing was nothing more than regurgitated ax and knife cleaving of previous scenes. It became an effort to continue reading. It is truly a shame as the story started out so brilliant."}, {"userName": "Beverleys_Books", "userReviewDate": "Jan 06, 2018", "userURL": "http://www.goodreads.com/user/show/62636821-beverleys-books", "userReview": "R R Haywood is one of the most talented writers I've had the pleasure of reading to date. If you haven't started this unputdownable series (yes - every single 'day' is that good they warrant made up words!) - do it. Do it now. You won't regret it. Memorable characters; heart thumping fight scenes; and a new take on the 'virus' conspire to put this up there for me, along with Enders Game, The Wheel of Time series and The Dragonlance Chronicles as books I'd willingly lug around in an apocalypse ! Also: I'm painstakingly tapping out this review on my kindle ....need I say more?"}, {"userName": "Elli Lewis", "userReviewDate": "Aug 31, 2017", "userURL": "http://www.goodreads.com/user/show/52246615-elli-lewis", "userReview": "Shaun of the Dead meets The Walking Dead. This is a really entertaining Zombie story that demonstrates the excellent quality of independent authors out there. The main character is likeable, the story is gripping and it's really funny. I absolutely love Dave. As a fellow indie author, I am thrilled to be able to review this as 4* with absolute sincerity."}, {"userName": "Colleen Goff", "userReviewDate": "Jun 02, 2018", "userURL": "http://www.goodreads.com/user/show/22701161-colleen-goff", "userReview": "AwesomeI read his other series and he is such a good writer I needed more! I am not usually a fan of zombie stuff but this so well written. The characters are wonderful can't wait to read the rest of the series and anything else by this author."}, {"userName": "Gareth Hogan", "userReviewDate": "Mar 03, 2018", "userURL": "http://www.goodreads.com/user/show/48991734-gareth-hogan", "userReview": "Brilliant.Funny, action packed, and with an interesting take on the zombie virus that I find genuinely unique. Dave and Howie are a good double act, and it's nice to watch their relationship build.Finally, the battle set pieces are awesome!"}, {"userName": "Christian B Backe", "userReviewDate": "Aug 02, 2017", "userURL": "http://www.goodreads.com/user/show/68503601-christian-b-backe", "userReview": "For zombie loversImpressive and original twist to the zombie genre. Self published author, some editions g need of first chapters, but flow, pace and humor is good throughout."}, {"userName": "debrakendrick", "userReviewDate": "Jun 27, 2017", "userURL": "http://www.goodreads.com/user/show/63158743-debrakendrick", "userReview": "too lazy to write a reviewThis book already has a lot of good reviews and I'm really lazy, love to read though too lazy to write so I'll just agree with all the good review😀"}, {"userName": "Ralph", "userReviewDate": "Sep 24, 2017", "userURL": "http://www.goodreads.com/user/show/21319159-ralph", "userReview": "felt like over the top wish fulfilment"}, {"userName": "Craig Becker", "userReviewDate": "Jan 27, 2017", "userURL": "http://www.goodreads.com/user/show/408356-craig-becker", "userReview": "Death and zombiesYeah some irritating editing errors, bad word choices here and there can be frustrating, but hey death and zombies. What could possibly go wrong? Fun read."}, {"userName": "Deborah", "userReviewDate": "Jul 15, 2017", "userURL": "http://www.goodreads.com/user/show/20031902-deborah", "userReview": "WowFantastic amazing and every over brilliant word Starting the next 7 days now Fantastic writing and story I want a Dave and Howie in my Apocalypse"}, {"userName": "Charles Twyford", "userReviewDate": "Jan 24, 2018", "userURL": "http://www.goodreads.com/user/show/48896061-charles-twyford", "userReview": "Worth turning the pages.The title to this note says it all. So very few in this genre are worth the price of admission. Have fun!"}, {"userName": "Jen Kozlowski", "userReviewDate": "May 22, 2018", "userURL": "http://www.goodreads.com/user/show/21617183-jen-kozlowski", "userReview": "Read thisFunny. Action packed. Funny. Heart warming. Zombie apocolypse but with a twist or two that will fuck with your mind and draw you in further. Read this."}, {"userName": "Kaz Moore", "userReviewDate": "Nov 06, 2017", "userURL": "http://www.goodreads.com/user/show/55716624-kaz-moore", "userReview": "I've read the complete series twice now. I missed the characters and can't wait for more of the same"}, {"userName": "Sos", "userReviewDate": "Mar 21, 2017", "userURL": "http://www.goodreads.com/user/show/39918052-sos", "userReview": "Great readFor a first attempt at writing....wow...a great outcome! Enjoyed the read. Like the concept....not your typical zombie reader.Liked the characters. Liked how they evolve. But the final battle (day7) was well..ummm.... comparing the numbers in London at at the castle... cannot understand the scale of the losses."}, {"userName": "Heather Bull-Keane", "userReviewDate": "Mar 13, 2017", "userURL": "http://www.goodreads.com/user/show/47715913-heather-bull-keane", "userReview": "Great series.I look forward to the rest. Very clean, well written, better than many today that have the help of proofreaders and editors. This is the type of work that makes self-publishing shine."}, {"userName": "Grw", "userReviewDate": "Feb 09, 2017", "userURL": "http://www.goodreads.com/user/show/30087781-grw", "userReview": "Having read quite a lot of Zombie Apocalypse books recently I have to say this one stands out for several reasons.The first of these is that it's a collection of the start of a long series that has already been written so there's no wait for the next part. This, however, is also something of a downer, as reading seven parts in one go, does tend to make the recapping that would be useful in separate parts, a little repetitious. The second is that it is clearly the author's first works and as you read through you can actually see them growing as a writer, from the first tentative steps in Day One, through to the slightly long winded over explanations of Day Seven. Yet it all works.That isn't to say there are a few things that a more experience writer may not have done, such as the changing of third to first person which can be a little jarring especially early on, but which, for the large part works rather well. One of the outstanding, and somewhat novel approaches is to not only make the virus itself sentient but to allow it to express itself. To read the conflict from that angle really makes a nice change, even if the heading given to those sections as the human hero's journey really doesn't make sense.Now as for the plot itself. Yes there are cliches as there are always going to be in Zombie fiction, but while most would have gone for the everyman hero or the strong silent type, here we have both, seamlessly fitting together, with great touches of humour around the edges. Here we have the third thing I loved about this book. It neither takes itself too seriously, nor does it mock the intelligence of the reader. Sure, there's some issues with the time line and how fast things happen in each of the days, especially the latter ones, but it works. This may be because the first day starts out a bit slow as Howie is on his own, or maybe it was the author's intention, either way he manages to maintain a fairly steady build up through the week, without the fight-plot-fight-plot-fight formula that seems so popular in the genre.This isn't to say there aren't the sort of plot holes that are common in zombie fiction, such as how one character can be infected by a microscopic drop of blood landing on them, while others can be almost constantly drenched in the stuff and yet not turn? And the hero's constant need to go move on to another place and have a fight there instead of settling somewhere. That said, what some people may find a plot hole - the actual origins of the virus - I don't miss at all, although I would suspect it will get addressed at some point in the series.Meanwhile, we get to enjoy the antics of the characters we have, even if the somewhat homophobic banter between two of them can get a little tiresome at times, each of the character's is nicely done. However as is common in the genre, virtually all the leads are male, with women kept pretty much in the background, needing to be rescued or looking after the various safe houses. Still by the time you get to the Seventh day, and all the character's come together, things get a little more evened out.The week ends in spectacular fashion, as the zombie army - now with it's own leader (no spoilers) - attack, and there's a sneaky set up for the second week mixed in there, that you may not even notice (I didn't) but which will get you reading week two before you know it."}, {"userName": "Brandy Snyder Avery", "userReviewDate": "Mar 10, 2017", "userURL": "http://www.goodreads.com/user/show/43262718-brandy-snyder-avery", "userReview": "Zombie apocalypse fans, prepare to be addicted.I always wanted more of a detailed day to day life in the zombie apocalypse. Very vibrant characters in a fast paced storyline, downright addictive. Can't wait to read the rest."}, {"userName": "Lynn", "userReviewDate": "Mar 05, 2017", "userURL": "http://www.goodreads.com/user/show/8931437-lynn", "userReview": "I absolutely loved this book, it grabbed my attention from the first paragraph and kept it all the way through. The idea of the hero being a Night Manager at a Tesco store made me smile.The battle and they way the heroes won through was a bit comic book like with a small team winning against overwhelming odds. So when the Zombie apocalypse comes I need a Night Manager called Howie."}], "description": "A deadly infection spreads across Europe. The Undead Series: A terrifying account of one man desperately struggling to survive this harrowing event. The Undead. The First Seven Days Compilation Edition. Reviews from The Undead series: \"5 stars isn't enough! Far and away the best zombie series around!\" \"This is a sure-fire, cult hit of a series\" \"One of the best series out there and one of the best authors of this genre - totally gripping and will have you at the edge of your seat.\" \"each and every book will leave you begging for the next one.\" \"each one is a masterpiece all on its own.\" \"Another amazing instalment.\" \"Haywood sure is improving like a fine wine.\" \"this story simply gets better and better.\" \"Once again the subplots weave around one another, coming together with quality timing.\" \"Each time I finish reading I'm exhausted, overjoyed, anxious and fearful of what's coming next.\" \"Brilliant writing from start to end.\" \"Well done RR Haywood, please do not stop doing what you are doing.\" \"This has been the best zombie series I've read.\" \"I cannot begin to describe how exciting and spellbinding The Unread series is.\" \"I just want to keep getting lost in the story.\" \"I like zombie books. A lot. But the character development, the humour, the action and the banter in this series make it the best I have ever read.\"", "title": "The Undead. the First Seven Days\n      \n          (The Undead #1-7 )", "url": "http://www.goodreads.com/book/show/25924591-the-undead-the-first-seven-days", "average": 4.31, "cover": "https://images.gr-assets.com/books/1441395116l/25924591.jpg", "reviews": 62, "authors": [{"url": "https://www.goodreads.com/author/show/6447537.R_R_Haywood", "name": "R.R. Haywood"}], "type": ["Horror", "Horror", "Science Fiction", "Fiction", "Science Fiction"], "outlinks": ["http://www.goodreads.com/book/show/25924591-the-undead-the-first-seven-days", "http://www.goodreads.com/book/show/16146990-the-undead", "http://www.goodreads.com/book/show/21703023-the-undead-the-first-seven-days", "http://www.goodreads.com/book/show/31578285-extracted", "http://www.goodreads.com/book/show/33871930-executed", "http://www.goodreads.com/book/show/36991055-extinct", "http://www.goodreads.com/book/show/15764912-the-undead-day-one", "http://www.goodreads.com/book/show/23007252-the-undead-day-fifteen"]}