{"ratings": 1741, "userreviews": [{"userName": "Annie Weatherwax", "userReviewDate": "Nov 03, 2014", "userURL": "http://www.goodreads.com/user/show/24745723-annie-weatherwax", "userReview": "Smart and honest, Sylvia True has written a remarkable debut novel. Her clearly drawn characters were heartbreaking, complicated and real. The writing itself was stunning. The story moved at a perfect pace and left me with a breathtaking range of emotions. I cannot wait to see what she writes next."}, {"userName": "Heidi Pitlor", "userReviewDate": "Oct 23, 2014", "userURL": "http://www.goodreads.com/user/show/34872679-heidi-pitlor", "userReview": "This is a rare novel that is almost all story and no fat, and as such was a riveting read. Another reviewer said this, and I'll echo it: this is more a book about betrayal than sex. Each character is at the center of a major life crisis and must make a life-altering decision. Cinematic, down-to-earth writing and a fascinating look at the way we, as women, let our relationships define our entire lives, as well the repercussions of this when the relationships go south. A really absorbing book."}, {"userName": "Doris Zerbe", "userReviewDate": "Nov 01, 2014", "userURL": "http://www.goodreads.com/user/show/36498069-doris-zerbe", "userReview": "Finally! It's about time someone started this dialog. The Wednesday group is ground breaking in opening up the conversation about how sex addiction affects women and families. This book will be great for those millions of women (and men) whose lives are impacted by this ever prevalent blight. The characters are heartfelt and engaging. It's a fast paced read that would be great for a book club and for any suffering or affected by sex addiction. I would highly recommend!"}, {"userName": "Jeanne", "userReviewDate": "Oct 07, 2014", "userURL": "http://www.goodreads.com/user/show/8071101-jeanne", "userReview": "I won this book in a Goodreads giveaway. When it came in the mail, I opened the book just to take a peek and couldn't put it down until I finished it. WOW. Hard to believe that this is the author's first novel. The characters were so well developed and the story so riveting. I can't wait to read more from this author."}, {"userName": "Miss O", "userReviewDate": "Oct 22, 2014", "userURL": "http://www.goodreads.com/user/show/36203631-miss-o", "userReview": "I was wary when I picked this book up. I really didn’t want to read some gross sex scenes. But as it turns out, this book really isn’t about sex at all. It’s about betrayal and dealing with the trauma of learning your spouse has not only cheated on you, but can’t stop. The therapy scenes were all well done and believable. It was nice to see the women’s relationships develop. Bridget was my favorite. I like her spunk. I would definitely recommend this book, especially for any people who are struggling with family members that have addictions."}, {"userName": "Amanda Rivera", "userReviewDate": "Dec 15, 2014", "userURL": "http://www.goodreads.com/user/show/37963114-amanda-rivera", "userReview": "A gripping and sensitive debut novel. The author's well written narrative brings the reader inside the lives of five women in the throws of relationship turmoil. The characters are vivid and true to life and the plot is endlessly engaging. I can't wait to see what Ms. True writes next!"}, {"userName": "Victoriat", "userReviewDate": "Dec 28, 2014", "userURL": "http://www.goodreads.com/user/show/37779593-victoriat", "userReview": "This book was a page turner, I couldn't put it down. As a social worker I have come to know people in similar situations as the women in this book. Sylvia True was able to portray these women in a very real way and I felt very connected to all of the women. I will definitely be recommending this book to all of my co-workers and friends. Congratulations on a great first novel, and I cannot wait for more from Sylvia True."}, {"userName": "Susan", "userReviewDate": "Mar 22, 2015", "userURL": "http://www.goodreads.com/user/show/672625-susan", "userReview": "Trust me when I say, THE WEDNESDAY GROUP is going to get under your skin and you aren't going to be able to put it down! I am so impressed with Sylvia True's writing that I can't wait to see what she writes next. I still can't believe THE WEDNESDAY GROUP is a debut novel. Will these five women survive all the lies and self doubt? You will find yourself cheering for them and the next minute, yelling at them! One of the best novels I've read this year and Sylvia True is going to be an author readers will seek out when looking for a riveting and well written story!Full review left at www.freshfiction.com"}, {"userName": "Joan Mitchell", "userReviewDate": "Nov 03, 2014", "userURL": "http://www.goodreads.com/user/show/26681567-joan-mitchell", "userReview": "Five women who are very different a trend a group for wives of sex addicts. Each has a different story,but they form a bond to support each other. So very realistic I recommend this book to people who like to figure out how people cope. I received this book from Goodreads."}, {"userName": "Mary Jo Burke", "userReviewDate": "Nov 13, 2014", "userURL": "http://www.goodreads.com/user/show/5429716-mary-jo-burke", "userReview": "I won this book from Goodreads. An honest portrayal of the other side of betrayal by a spouse. The ripple effects on family, jobs,friends, and self-image. Very good."}, {"userName": "Judy Collins", "userReviewDate": "Dec 12, 2014", "userURL": "http://www.goodreads.com/user/show/11063006-judy-collins", "userReview": "A special thank you to St. Martin's Press and NetGalley for an ARC in exchange for an honest review.  Nice Cover!  Top 50 Books of 2015. Best Women's Contemporary Psychological Fiction Debut. Sylvia True delivers a compelling and powerful debut, THE WEDNESDAY GROUP, a group of women; different personalities, and ages, from all walks of life, and professions, linked by one painful, and real subject —presently taking over their lives, their family, and their innermost secret thoughts.  Living with a sex addict. THE WEDNESDAY GROUP,  addresses the emotional journey, the pain, the desperation, and in the end a safe haven, a place of support in order to make changes, develop friendship, receive guidance, and perspective, no matter how fearful or shameful, it may seem.Bridget, Hannah, Lizzy, Flavia, and Gail  share a secret. They are married to sex addicts. From porn, chat rooms, young girls, to mail prostitutes. How will they cope, survive, heal, accept, forgive, or begin to start over, to recover? Just like alcohol, drugs, abuse, cheating, gambling, and any other addiction . . . there are signs, do they choose to ignore them, denial, or face them head on? To stay, or to go…. Each of the gals in the group use different tactics with an array of heartfelt raw emotions. True dives into this highly-charged topic  with honesty, clarity, sensitivity, compassion, and humor— for an absorbing exploration into the deep personal emotions which can create havoc on a spouse’s self-esteem, as well as personal, family, and career lives. When \"their\" husbands' problems become their own. An outstanding job of character development with an array of real personalities, versus clinical statistics – drawing you in, as you become personally invested in the fate of each woman. Meet THE WEDNESDAY GROUP:  Hannah, a homemaker,  catches her husband having sex with a male prostitute in a public restroom (this was the most powerful scene, as she follows him, and in the bathroom stall, will keep you on the edge of your seat-heartbreaking).  You feel her fear and shame. For me, Hannah had the most difficult task to overcome. How will this affect her, her family? Is her husband using his past as an excuse? Were there unresolved issues he brought into the marriage, and did Hannah have her eyes open, or was she just wanting a perfect family and ignored the signs? What about diseases he may pass to her? Does she need attention from another man in order to realize she is worth loving, self-worth? How will they explain this to her children without damaging them? Gail, a prominent Boston judge,  continues to receive letters from her husband’s latest girlfriend, while her husband, a theology professor, has sex with grad students. Gail is the most put together on the exterior, highly professional and intelligent, and less outward emotion. She compartmentalizes, defends, and justifies that her husband has changed. However, could she be in denial, and down deep does she really realize this as why she uses food, as an escape? Is she more interested in outward appearances? Bridget, a psychiatric nurse at a state hospital, with a husband addicted to chat rooms, and match making websites. She is the wittiest, most verbal and outgoing, says exactly what is on her mind, like it, or not. She is aggressive and emotional. In the end, she may be as insecure as the others when it comes time to being alone, on her own. Most readers will relate to her. Beneath her rough exterior, she has a heart, and slowly learns to care for the others. Loved her scene with the last F me session which backfires on her.  Lizzy, a high school teacher,  is married to a porn addict, who is withdrawn and uninterested in sex with her. Lizzy is the most insecure, shy, and needs confirmation of herself and takes her husband’s lack of interest personally. She seeks desperately to understand his motives. Always searching for ways to interest him. Will she be able to stand on her own two feet, whenever her own career is jeopardized by association.  How far will her husband go, or how much will he lose before he changes?Flavia, a librarian,  is at work, when someone brings to her attention an article that stated her husband had been arrested for groping a teenage girl on the subway. He must face court, and Flavia must decide if she will stay or go. Flavia did not have a big role in the group; however, thought she was funny and loved her free spirit. With the language barrier, loved the part when she thought one of the gals needed to medicate before having sex, instead of meditate.  Also liked her idea of dressing up in heels, lipstick, and walking down the street. She was a nice addition to the group. Of course there is a lot of drama surrounding Kathryn,  the young psychologist running the group, with her controlling supervisor. Unfortunately, many women whose husbands are sexually addicted blame themselves and feel they may not be adequate physically, or have done something to provoke the behavior. As the feelings of shame worsen over time, they are less likely to seek the professional help needed to reach their own recovery. As in this case, it took a lot for them to open up, and share their shameful hidden secrets. In many cases, the male enters the marriage with deep-rooted and long-held intimacy problems which can be held in secret for years, as we learn from the novel. Glad to see this issue being brought front and center for awareness, to demonstrate help is out there. Sylvia addresses sex addiction, which is real, and widely apparent in today’s fast-paced busy stressful world of temptations, and in a time when sex is readily available, through the web and other areas of social media. Even our minister openly discusses this problem, as you look around the congregation and wonder what lies and secrets, which couple, what man, or woman is hiding behind the perfect façade. Loved the part when they dressed up and went out for drinks, as this was as important as the group session time, as they open up to one another!A look into the psychological barriers women are facing and its impact on their lives. An engaging novel of lies, betrayal, trust, friendship, marriage, addiction, and relationships. Looking forward to reading more from this new talented author! Judith D. Collins Must Read Books"}, {"userName": "Mlpmom (Book Reviewer)", "userReviewDate": "Mar 10, 2015", "userURL": "http://www.goodreads.com/user/show/3829694-mlpmom-book-reviewer", "userReview": "The Wednesday Group is a very emotionally charged read, feeding off the difficulties, struggles, and heartache of five different women as they each venture through life, marriage, love, and loss. A hard read for many reasons, it is also a beautiful one as each woman must face some very difficult, very trying times in their life and most importantly, in their relationships with those they love most and who are suppose to love them most as well.As horrible truths and secrets are uncovered, each woman must make some very hard choices and be able to live with them. A book all about additions and how those additions most affect those around them.The situations and struggles of not only these women, but the men in their life with the actual additions, was heart breaking, eye opening, and raw.Wonderful done and beautiful told, this is one book that anyone who is struggling with similar things in their life should read."}, {"userName": "Bonnie Hill", "userReviewDate": "Nov 07, 2014", "userURL": "http://www.goodreads.com/user/show/4550396-bonnie-hill", "userReview": "In the hands of a writer with less skill and sensitivity, this would have been just another sensational read. It's much more. Each of these women has a strong voice. Each is vulnerable but in different ways. Together they bond, and even when they fail, and fail miserably, they try to guide themselves and each other though the next step of this terrifying journey. The author has even managed to make some of the husbands likeable--well, some of them. By the unexpected plot twist, I was emotionally invested in the story because I was emotionally invested in the characters. Yes, it is a book about women who meet in a support group for wives of sex addicts. But it is really about loss, about love, and ultimately about how we try to survive when everything we have told ourselves is true turns out to be a lie."}, {"userName": "Jessica", "userReviewDate": "Nov 03, 2014", "userURL": "http://www.goodreads.com/user/show/6078945-jessica", "userReview": "When I received this book I was unsure if I would actually enjoy it but I loved reading it. I picked this book up, started reading it and was quite happy with the story. I enjoyed hearing about all the characters history and what was going on at all times. I am hoping that Sylvia True may write another one giving an update about all the characters because I want to know what happens to all of them."}, {"userName": "Katie Robinson", "userReviewDate": "Nov 03, 2014", "userURL": "http://www.goodreads.com/user/show/5867688-katie-robinson", "userReview": "This is a book about 5 women who have different lives but one thing in common. Their husbands are sex addicts. The characters are all extremely believable and so are the events that surround them. I read this book in one setting. If this is any indication on how well Sylvia can write, watch out world!"}, {"userName": "Lisa", "userReviewDate": "Nov 16, 2014", "userURL": "http://www.goodreads.com/user/show/4103620-lisa", "userReview": "ARC received via Netgalley in exchange for an honest review. The Wednesday Group is the story of five women who are completely different but share one common bond. They are all married to sex addicts and are doing the best they can to come to overcome the betrayal of their husbands while determining if they should stay in their marriages. The women make up a support group for partners of sex addicts and despite their initial differences ultimately become friends and learn to call on one another for support. This is an exceptional book with well developed, complex characters who are dealing with real issues. The storyline is intriguing and definitely kept me interested until the very end. One of the best books that I've read this year! I can't wait for more from Sylvia True."}, {"userName": "Tricia Johnson", "userReviewDate": "Nov 01, 2014", "userURL": "http://www.goodreads.com/user/show/35924455-tricia-johnson", "userReview": "This is a book you will not want to put down. I read it in a day and a half and came away with a reverence for those women who come together under dire emotional circumstances. The women are beautifully drawn, you cheer for them, you yell at them, you become involved in their angst. For me, the bond the women form and their empathic support, is the story that carries the day. Bravo!"}, {"userName": "Bree T", "userReviewDate": "Mar 05, 2015", "userURL": "http://www.goodreads.com/user/show/3913428-bree-t", "userReview": "Gail, Hannah, Bridget, Lizzie and Flavia are from very different walks of life but they all have something in common. Gail is a judge who must keep her identity a secret. Recently she’s begun receiving letters from a graduate student claiming Gail’s perfect husband is in love with her but too scared to tell Gail. Lizzie discovered that her husband is addicted to porn and she wants to work through it but he refuses to meet her halfway. Bridget has just discovered that her husband is addicted to match making websites and porn as well. In her revenge, she may have done something that will bind them together forever. Flavia was ignorant of her husband’s arrest for groping a student on the T until someone at her work brought her a newspaper clipping. And Hannah knew her husband’s secret when she married him but she thought he would stop. He hasn’t.Kathryn is a young psychologist who brings these women together in a support group. They meet every Wednesday night to talk about their feelings and experiences, knowing that the other women in the group are at least able to understand. Or so they think. However each of them are at very different stages of where they are with their journey dealing with their husband’s behaviours and secrets and at first, it doesn’t look like the Wednesday group will even make it to a second meeting. But slowly they come to trust and confide in each other as their worlds intertwine more and more each week.I was super intrigued when I read the description of this book. I feel as though the rise of the internet has probably been the downfall of a lot of relationships. Porn is readily available and in plentiful supply. You don’t need to leave the house to access it and there’s both free and paid versions. There are sites where you can sign up to meet someone to date, to sleep with. You can sign up to places that allow you to watch girls on webcam. It’s pretty easy to become obsessed with the internet and with porn. There’s a pretty lethal combination.Our female characters are all dealing with partners who have betrayed them. In some cases, the betrayal is a physical one, they’ve been intimate with other people even though they claim it doesn’t mean anything. In other cases the betrayal is an emotional one. They’ve been spending all their time and energy, time and energy that should be spent on connecting with their partner, connecting with strangers again. All of the women feel angry, hurt and humiliated and for most, if not all of them, it’s not something they can confide in to their friends over a morning coffee. And so the support group for these women is born, with young psychologist Kathryn in the role as group facilitator. She guides the sessions and asks key questions about their feelings but it’s not her job to play a very intrusive role.The women were all very different. Gail was older, with a very public and prominent career. Hannah is married with two primary school aged children, the eldest of which is being increasingly affected by the tense atmosphere at home. Lizzie, Flavia and Bridget are also married but without children so far. At first they tend to regard each other with a mix of suspicion, pity and disdain. Bridget and Gail are openly hostile toward each other but despite most vowing not to return at some point or other, they find themselves coming back week after week. Knowing that they can talk within that room and be supported by others that understand what they’re going through must be quite a powerful drawcard. That’s not to say there’s not judgement at times. There is. But they come to rely on each other, to travel towards a very unusual sort of friendship. I really enjoyed that evolution.This could be a book that is about the details of sexual infidelity but it’s not. It’s really about the women and the betrayal that they face by their partners and how that makes them feel. The actual infidelity is what brings them together but the core of the story is these women and how they find the strength in their Wednesday group to carry on, to keep working through their differences with their partner or as the case may be, to not do that and forge a different path. Their stories were all really interesting to me with the possible exception of Flavia as I don’t really felt she was a large enough part of the story to really matter. I think she maybe just served as the character who runs away from the problem, hoping that will fix it. We will never know if it did or not.The only thing I feel is a downside of this book is that I wanted more. I felt that there was a lot left unsaid at the end of the story which was no doubt deliberate but drives me mad because I’m the sort of person that needs closure. I think the story between Hannah and her husband was the one most left hanging and I found that I wanted to know so much more about his betrayal. It cuts her so deep that she can’t even bring herself to tell the other members of the group for the longest time – because in a list of humiliations I think Hannah feels hers far surpasses what the other women are going through. She also has children and the impact on them, especially their daughter is becoming extremely significant. Hannah doesn’t seem to realise that the careful politeness between her and her husband plus an extremely rigid schedule that she’s worked out, is making matters worse. There’s a huge amount of anger in Hannah and I wasn’t actually sure why she continued to stay with her husband. It didn’t seem like something she’d ever really be able to get past – or that he would ever give up. I really wished there was a lot more to their story."}, {"userName": "Ann", "userReviewDate": "Dec 17, 2014", "userURL": "http://www.goodreads.com/user/show/2562832-ann", "userReview": "What a remarkable story about 5 women who are married to sex addicts. This book tackles an unusual premise that has you wondering how each of these ladies get through their days. I wish there was one more chapter that resolved a few of the issues. I loved several of the characters more than others, some kept their secrets and other seemed to be in denial. Each helps the others as they meet every Wednesday evening. A great read and I'll look for more of Sylvia True's books."}, {"userName": "Dreena Hoffmann", "userReviewDate": "Dec 16, 2014", "userURL": "http://www.goodreads.com/user/show/33456398-dreena-hoffmann", "userReview": "At first I didn't think I could read a novel dealing with sex addiction. I'm glad I kept an open mind. This is an amazing story about the strength of a group of women and how they deal with the difficult situations handed to them. As a reader, you feel the sadness, every heartbreak, and the anger they feel. Each woman discovers an inner strength they didn't know they had. I believe even the character Gail found her way."}, {"userName": "Mary", "userReviewDate": "Aug 27, 2014", "userURL": "http://www.goodreads.com/user/show/2253828-mary", "userReview": "The Wednesday Group, by Silvia TrueBetrayal of the worst kind. How do you live with the knowledge that the person closest to you has lied and betrayed your trust? How do you cope with discovering that your marriage has been a charade and you are essentially married to a stranger? What do you tell your friends, your coworkers, your children? This is a fascinating look at the often forgotten victims of addiction. Five women meet in group therapy to help each other cope with the pain, and debilitating shame of their husbands sex addiction. This is a quick read told in the voices of the five women and the therapist who guides them. Recommended"}, {"userName": "Dianna", "userReviewDate": "Mar 08, 2015", "userURL": "http://www.goodreads.com/user/show/6759362-dianna", "userReview": "A story of five women from different walks of life who join a support group. The one thing they have in common is all their husbands are sex addicts. I wasn't sure how I would feel about this topic, but the author developed these characters so quietly that I couldn't stop till the last page was turned. And I wanted more! You will laugh with these women, cry with them, want to punch their lights out at times. But in the end you will just love them. Hoping for the next chapter in their lives.I won this from Good Reads giveaways. THANX!"}, {"userName": "Neo", "userReviewDate": "Dec 22, 2014", "userURL": "http://www.goodreads.com/user/show/38198373-neo", "userReview": "A friend had told me to read this and gave me her copy. I didn't mind this book at all and well be passing it on to my sister so she can read it and review it."}, {"userName": "Karen", "userReviewDate": "Apr 17, 2015", "userURL": "http://www.goodreads.com/user/show/42261599-karen", "userReview": "This book is a window into the world of a less acknowledged addiction. Sexual addiction . Which , from the book, is similar to substance and gambling addiction.I just finished the book, and I am left with a desire to call all of my close friends , because1) it is a book about friendship without judgement2) It is a page turner - fascinating , easy to read, and very educationalAnd 3) it may be something a friend is going thru, and without having read this I would'nt have a clue what to say if she told me.The characters in this book are nice people.I feel compassion for all of them.I've never read a book like this- never heard of one. But there should be a book like this.I highly recommend it."}, {"userName": "SophiaLN", "userReviewDate": "Feb 11, 2015", "userURL": "http://www.goodreads.com/user/show/40186283-sophialn", "userReview": "I found myself deeply connected to all the women in this book and rooted for all of them throughout the entire novel. Sylvia was able to make the women extremely relatable in a topic that is often considered taboo and foreign. I found the ending of the novel brilliant, refreshing, without a need for a \"fairytale\" ending but rather realistic and contemporary. I highly recommend this book to anyone and think that it touches on a topic that is often ignored in society, but extremely important to begin discussions on."}, {"userName": "Amy", "userReviewDate": "Jan 26, 2015", "userURL": "http://www.goodreads.com/user/show/28649604-amy", "userReview": "Wow, what a great story about overcoming addiction, not by the addict but by their spouses and families who are just as affected. This is a side of the story rarely told and the author does a wonderful job of using the different character's personalities to show different ways of dealing with the issues involved. By the time I finished this book I felt like the characters were people I knew intimately. While these characters are dealing with sex addiction issue they really could have been dealing with an addiction. I highly recommend this book."}, {"userName": "Nick", "userReviewDate": "Mar 18, 2015", "userURL": "http://www.goodreads.com/user/show/41335742-nick", "userReview": "Let me start by saying, I know some great authors and have read some great books. I can honestly say that The Wednesday Group is one of my favorites. Once I dove in it was impossible to get out. If you are looking for an emotional roller coster and a new perspective on writing, this is the book for you! Well worth the read!"}, {"userName": "Ashley", "userReviewDate": "Dec 26, 2014", "userURL": "http://www.goodreads.com/user/show/28820519-ashley", "userReview": "Did I miss something with this novel? While THE WEDNESDAY GROUP by Sylvia True is an okay read, it leaves the reader with a slightly bitter taste in their mouths. Ending unresolved, THE WEDNESDAY GROUP had me asking more questions than necessary.RELEASE DATE: March 2015PUBLISHER: St. Martin's GriffinDISCLAIMER: Novel was sent via NetGallery in exchange for a honest review. SYNOPSIS: Gail. Hannah. Bridget. Lizzy. Flavia. Each of them has a shameful secret, and each is about to find out that she is not alone… Gail, a prominent Boston judge, keeps receiving letters from her husband’s latest girlfriend, while her husband, a theology professor, claims he’s nine-months sober from sex with grad students. Hannah, a homemaker, catches her husband having sex with a male prostitute in a public restroom. Bridget, a psychiatric nurse at a state hospital, is sure she has a loving, doting spouse, until she learns that he is addicted to chat rooms and match-making websites. Lizzy, a high school teacher, is married to a porn addict, who is withdrawn and uninterested in sex with her. Flavia was working at the Boston Public library when someone brought her an article that stated her husband had been arrested for groping a teenage girl on the subway. He must face court, and Flavia must decide if she wants to stay with him. Finally, Kathryn, the young psychologist running the group, has as much at stake as all of the others. As the women share never-before-uttered secrets and bond over painful truths, they work on coming to terms with their husbands’ addictions and developing healthy boundaries for themselves. Meanwhile, their outside lives become more and more intertwined, until, finally, a series of events forces each woman to face her own denial, betrayal and uncertain future head-on.REVIEW: I'm not sure if I missed something with this novel, but I didn't enjoy it. Perhaps it was the uncertain ending, but something didn't click with me. 5 different woman are intertwined by one painful secret - their husbands are all sex addicts. Alone, embarrassed, and reeling, the 5 women come together on Wednesdays in a group to discuss their issues. With secrets at the brim, the women are a mess - their husbands secret has destroyed their lives (one women has lost a job, another is left pregnant, etc), Originally completely different, these secrets help unite the women, and when their personal lives suddenly become intertwined with their Wednesday's groups, the women decide they may need each other more than they think. The novel is told from many different perspectives - in terms of the 5 women at the centre of the story, we get to see 4 of them. I felt it kind of weird, missing the perspective of 1 of the women while being so intertwined with the other 4. We also get the perspective of the therapist at the centre of the Wednesday Group, which I thought was an added bonus. The chapters are relatively short, which is a bonus, and help us get a inside look at the lives the 4 women lead. One good thing about this novel - when I first read the synopsis of this novel, I thought it would be overtly sexual. It's not (which is good!). It's a sensitive look at a problem that is very salacious in nature. The novel ends without really resolving a lot of the problems at hand. It ends with a major breakdown of one of the main characters ... and then doesn't bother to let the readers know if the character will be okay or not. Furthermore, the novel ends with some of the women running from their problems, others left alone, etc. I felt it was just so unsatisfying to read what was considered to be 'conclusions' for this novel. The novel could have gone on for a couple more chapters, in my opinion."}, {"userName": "Helen Lane", "userReviewDate": "Feb 08, 2015", "userURL": "http://www.goodreads.com/user/show/40069674-helen-lane", "userReview": "Received and ARC from the publisher.Tough subject, very sensitively done. The characters felt real to me, and I found myself caring deeply about them. Except for Flavia. It wasn't that I didn't care about her, I just didn't really get to know her. I loved how the women's friendships developed. It was a fast, easy read. I have read other reviews about the ending, and I agree it was rather sudden, but I think it was the right ending. The women have grown throughout the book, and most importantly they have learned how to support each other -- for a long time -- regardless of how messy their lives may continue to be. I also found hope in the fact that the group will continue and new members, raw with the pain of betrayal, will also find help. It wasn't clear at the beginning of the book that the group itself would survive."}, {"userName": "Irene", "userReviewDate": "Dec 05, 2014", "userURL": "http://www.goodreads.com/user/show/3343834-irene", "userReview": "I enjoyed everything about this book. It is a wonderful first novel!(wow -that is hard to believe!)I loved the characters and felt connected to these women, dealing with such a difficult issue. They were believable and honest and their emotions were gut- wrenching.I will be looking forward to your next novel Sylvia!"}], "description": "An unputdownable debut novel about five women who meet in therapy to discuss the trials of being married to sex addictsGail. Hannah. Bridget. Lizzy. Flavia. Each of them has a shameful secret, and each is about to find out that she is not alone… Gail, a prominent Boston judge, keeps receiving letters from her husband’s latest girlfriend, while her husband, a theology professor, claims he’s nine-months sober from sex with grad students. Hannah, a homemaker, catches her husband having sex with a male prostitute in a public restroom. Bridget, a psychiatric nurse at a state hospital, is sure she has a loving, doting spouse, until she learns that he is addicted to chat rooms and match-making websites. Lizzy, a high school teacher, is married to a porn addict, who is withdrawn and uninterested in sex with her. Flavia was working at the Boston Public library when someone brought her an article that stated her husband had been arrested for groping a teenage girl on the subway. He must face court, and Flavia must decide if she wants to stay with him. Finally, Kathryn, the young psychologist running the group, has as much at stake as all of the others. As the women share never-before-uttered secrets and bond over painful truths, they work on coming to terms with their husbands’ addictions and developing healthy boundaries for themselves. Meanwhile, their outside lives becomes more and more intertwined, until, finally, a series of events forces each woman to face her own denial, betrayal and uncertain future head-on.", "title": "The Wednesday Group", "url": "http://www.goodreads.com/book/show/21853671-the-wednesday-group", "average": 3.83, "cover": "https://images.gr-assets.com/books/1426127642l/21853671.jpg", "reviews": 350, "authors": [{"url": "https://www.goodreads.com/author/show/8123138.Sylvia_True", "name": "Sylvia True"}], "type": ["Fiction", "Womens Fiction", "Audiobook", "Womens Fiction", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/21853671-the-wednesday-group", "http://www.goodreads.com/book/show/22895704-the-wednesday-group"]}