{"ratings": 37602, "userreviews": [{"userName": "notyourmonkey", "userReviewDate": "Jan 24, 2009", "userURL": "http://www.goodreads.com/user/show/122744-notyourmonkey", "userReview": "Okay, wow, I had forgotten how unpleasant I find Jaxom about half the time. He's a sympathetic character in that he gets to do all this cool stuff, but the internal monologue and motivations McCaffrey gives him are kind of tool-y. His distress over having no one real place where he fits is deeply appealing, but the way he whines about it is not. Also, hi dodgy gender issues, how I didn't miss you! They're prevalent enough in the Lessa books and the Menolly books, almost negligible in Piemur's book, but here, where you're deeply wedged into Jaxom's brain, they're even worse. His treatment of Corana, the holder girl he first takes up with in order to have a cover for training Ruth to chew firestone, is abysmal. First he almost-forces her when he's caught up in the mating tensions of the green at Fort (which is brushed away when Ruth says but she liked it), then Jaxom is glad to have his attachment to Sharra as an acceptable excuse for ditching her, except for when Sharra doesn't immediately succumb to his charms(?), he considers seeking out Corana \"for a little relief\", if only in idle contemplation. I suppose that's some of the class wonkiness in these books coming out, too (Sharra is not for 'relief' because she's Toric's sister, but Corana's father is beholden to Jaxom, so that's okay!), but the whole thing is deeply unpleasant.And don't even get me started on the whole Jaxom-Menolly thing, or Jaxom and Piemur snitting over Sharra, or poor freakin' Mirrim, who has a careless tongue but has had just as rough a deal as Jaxom but is comstantly slagged on in all these books. Still, though. Still. Like with all these books, above and beyond some of the crappy characters and weird class structure and hopefully-outdated views on women, they are so bloody compelling. Like Pern, like Valdemar, I suppose. There remains something inherently attractive about a magical being choosing you and you alone to be their special friend. I do love the mixing and merging of Craft and Hold and Weyr in this book, as the culmination of the whole trilogy. Or, really, what I consider the six original Pern books - the Dragonrider and Dragonsinger trilogies. I'm glad there's All the Weyrs of Pern that comes after it, but really this is the close of the heart of Pernese canon for me."}, {"userName": "Amita", "userReviewDate": "Apr 20, 2013", "userURL": "http://www.goodreads.com/user/show/9209104-amita", "userReview": "No extra points in the rating for the awesome dragons and unique world this time around. The shine of Pern has worn off, and all that's left is the author's writing. In that regard, this book was pretty lackluster.I had a lot of hope for Jaxom and Ruth after Dragonquest. I was pretty much completely disappointed. Jaxom is a whiny, bratty kid that I had absolutely no investment in. In fact, I actively want him to fail. Characters that are special and wonderful at everything just for the sake of it annoy me, and McCaffrey seems to be frequently guilty of this. Jaxom is a Lord Holder AND a dragon rider AND super smart and daring and skilled and blah blah. How was all this getting developed since most of his established history as a youth is him being coddled by the overbearing Lytol? His character development was less development than abrupt change. He starts off rather meek, unwilling to assert himself and letting his caretakers fuss over him and his peers tease him. Then one day he throws a hissy fit, and suddenly everyone realizes he's actually a ~man~ and ready for all sorts of responsibilities that they pile on. Because hissy fits are totally the adult way to handle things. He's now ready to fly his dragon, and learn about Hold affairs, and train in all the Craft halls, and also have time to secretly train his dragon and take it upon himself to save the day. He constantly does stupid and reckless things, but instead of being told off, he's praised for being so adventurous and doted on by everyone as he recovers. His love interests are completely undeveloped and actually rather insulting. First he only wants girl A to use as an alibi, then he kind of likes girl A because she strokes his ego (and more than his ego, if you know what I mean) so he uses her for more than just an alibi, then he completely ignores girl A and doesn't bother to talk to her again (seriously, he casually mentions her a few times, but no actual interactions or attempts at communication for the rest of the book) at all after months away and a near-death experience because suddenly he's in love with girl B for no reason except her voice is pretty. ??? Sure. Even better, when he can't manage to get girl B alone, he contemplates using girl A again. Real Romeo, there.Ruth is completely uneventful too - apparently the only unique thing about being the only white dragon ever is that fire lizards adore him, and he isn't interested in mating. Hardly worth all the build up of him being so special. We never even learn WHY he's white, or if there's any precedent for him. Unsatisfying follow through here.A few saving graces character-wise in this book: Master Robinton and Menolly. As I understand it, they are the main characters of the Harper Hall trilogy, so maybe those books will be more interesting for me - but then I was excited about Jaxom until McCaffrey actually wrote him as a main character. Regardless, Robinton seems to be the only rational person on Pern (except when it comes to his health), and Menolly is rather clever and funny. The glimpses of Brekke were also great, and I wish she could have been developed more. She had a lot of untapped potential, both in her ability to communicate with all dragons and how she dealt with the loss of her own.Plot-wise, this book has a lot of the same problems that the first two did, in that there doesn't seem to be a solid issue building up to any sort of climax, and no resolution. I was more willing to ignore it in the first two books, but this is the last in a trilogy, so I expected a little more oomph. Mostly the trilogy seems to be about discovering things about dragons or the planet that they mostly had forgotten in the passing of time. Which is fine, but could have included a little more plot structure to keep the reader entertained. Instead it just comes off like a bunch of set up for the next generation to deal with. Like, well now we've got the grubs, and all the Southern continent to explore and we know Thread comes from the Red Star - you guys take it from here! I know these are just three books in a huge collection, but a little payoff would be nice."}, {"userName": "Jerry", "userReviewDate": "Jun 12, 2012", "userURL": "http://www.goodreads.com/user/show/5855981-jerry", "userReview": "The White Dragon wraps up the Dragonriders of Pern trilogy quite neatly; however, pretty much everyone knows that it isn't the end for Pern. Although the series got off to a slightly rough start, it actually got much better as it went on. If you're a fan of science fiction, and you've never read anything by Anne McCaffrey, what are you waiting for? Give her books a chance!"}, {"userName": "Mike (the Paladin)", "userReviewDate": "Oct 09, 2009", "userURL": "http://www.goodreads.com/user/show/2187043-mike-the-paladin", "userReview": "Sometimes the runt is more important than anyone thought."}, {"userName": "Jessica", "userReviewDate": "Jan 26, 2016", "userURL": "http://www.goodreads.com/user/show/202724-jessica", "userReview": "Oh, my gosh. I read this over and over in sixth grade, giggling naughtily all the while. Good grief, Jaxom and that buxom farmer's sister! I think I read this before any of the other Pern books, though I had read DRAGONSINGER. I loved Ruth, and the idea of a dragon who was just big enough to ride, but small enough to be kept at home."}, {"userName": "Starling", "userReviewDate": "Aug 09, 2010", "userURL": "http://www.goodreads.com/user/show/2446676-starling", "userReview": "This is basically a review of the three books that make up the trilogy. There actually was a book between books two and three that I'm not counting, but which do introduce several characters in this book, but I'm not counting it as one of the main books because that book was originally published as YA and it wasn't available at my local library.I prefer to review the books as they exist, and not the book I'd wished someone had written. I also think that if a book is part of a series that is more than 40 years old, expecting it to follow conventions of the 21st Century is silly.I've just finished re-reading all three books. I gave all three of them four stars because even with some reservations about the books, I was pulled into reading them one after another and right now! That bit of magic still exists, and it isn't just that this was a favorite series way back when.One thing that any SF book of that era required was levels of world building that most series don't currently have. I'm pretty sure McCaffrey could have answered questions as to WHY any bit of Pern's culture existed, and in fact there are stories about most of those answers. And the series is SF and not Fantasy because there are stories about how Pern was settled, why Pern was abandoned by it technological parents, and even how the dragons got to be the size they needed to be to fight Thread. Back when these books were written the difference between SF and Fantasy was the ability to explain how things that looked like a fantasy were arrived at.My biggest reservation always was that her villains are just too one dementionable. They exist only so the hero or heroine can fight against them. Personally I prefer that my hero fight against people and things that are more real.Outside of that it was a fun read and I do recommend all three books."}, {"userName": "Jon", "userReviewDate": "Jun 11, 2008", "userURL": "http://www.goodreads.com/user/show/899665-jon", "userReview": "As much as I loved the first two books of the Dragonriders of Pern series, The White Dragon remains my favorite. And not because of Jaxom, whom I never liked as a lead character/protagonist. Ruth was my favorite character. Ruth, the stunted runt totally unique White Dragon. The archaeological discoveries on the Southern Continent at the original landing site are the most memorable and compelling parts of this installment in the saga of Pern. And Ruth's abilities to manipulate time and space are unparalleled in the evolution of the dragons. As with most of McCaffrey's novels, I tend to skip over the romantic story lines as they bore me to tears. Rarely does she write a romantic subplot that engages me. And her attempts at jealous revenge subplots also grates on me. But that aside, I enjoy the early Pern novels, and this one, along with Dragonsong are my favorites."}, {"userName": "Vivian", "userReviewDate": "Oct 15, 2014", "userURL": "http://www.goodreads.com/user/show/3947172-vivian", "userReview": "10/2014 Reread. The continuing adventure with Don to rediscover Pern. I love Ruth. I love Jaxom. \nThey are pleased to see us in the air together. Ramoth and Mnementh are very happy to see you on my back at last. I am very happy. Are you happier now?\nAnd fire lizards!I forgot how jam-packed the Pern stories were. Ruth and Jaxom's maturation is only a small portion of what happens as the politics expand, problems inflate and then are resolved, but really the bond between the two is what drove the book for me. The explorations of the southern continent. The discovery of the Dawn Sisters and the connection to the past is great. F'lar and the others are determined to leave the weyrs in a much better position after the Pass than they entered it. As usual, the adept statesmanship and Robinton's skills are front and center again. I look forward the the Harper Hall trilogy and more details on Robinton and Menolly.\n“I loved you first, Master.”\nFavorite quote:\nYou can, you know, be all and more, without being disloyal to anyone, or yourself.”"}, {"userName": "Jessie Potts", "userReviewDate": "Aug 13, 2015", "userURL": "http://www.goodreads.com/user/show/4743026-jessie-potts", "userReview": "Oh Pern!!!"}, {"userName": "Laura Lemay", "userReviewDate": "Dec 14, 2011", "userURL": "http://www.goodreads.com/user/show/2079913-laura-lemay", "userReview": "After Anne Mcaffrey died late 2011 I rooted around in my bookshelves for all my old pern paperbacks from the early 80's. I was utterly obsessed with these books when I was a young teenager, and they were extremely formative in my own history as a writer. The first novel I ever wrote -- longhand, in mead spiralbound notebooks -- was a thin knockoff of Dragonflight (I seem to remember it had unicorns, but I'm so embarrassed by that book I haven't managed to actually read enough of it to check). I reread all three books in the first Pern trilogy because I was curious to see if they held up to my very fond memories of them. Sadly the answer was no. Sometimes its best to let your fond childhood memories remain memories. :( (I've duplicated this review across all three books). Dragonflight: The earliest of the Pern books and the most problematic. It's a fast read and an OK story, but...ugh. My memories of the book were that it was one of the few SF books at the time that revolved around a strong female lead, one that I could identify and aspire to when I was 13. I was appalled to discover on reread that the gender politics are solidly prefeminist and really, really icky. And the writing is terrible -- terrible characters, terrible descriptions, too many similar confusing names, to many shift of POV. I was ashamed for my younger self for liking this book so much. Dragonquest: Similar gender issues in this book to the previous, but better writing and a really compelling plot. I ripped through the book in a few hours. Not great art, but good storytelling. The best of the three. The White Dragon: I didn't realize that the entire Harper Hall trilogy is supposed to take place in between Dragonquest and TWD, and I should have read those before starting this one. I didn't think much of this book; it felt much more leisurely than the fast-paced plotting of Dragonquest, with many more characters and threads (heh) and not a lot of narrative tensions. Jaxom as a character didn't much appeal to me, and it was just as gross to see the wierd gender politics of Pern from the male point of view. The big reveal as to the origins of Pern seems a sort of deus ex machina letdown (although the extended prologues always explained this, it was never a big part of the plot). It just didn't feel like a satisfying conclusion to me, and after reading this book I just felt all dragonned out. Also as a side note, everyone is always striding in these books. F'lar strode in to the room! F'nor strode out of the weyr! I mentioned it to my husband about 2/3rds through TWD and then I couldn't help laughing about it every time the word showed up after that. You could make a drinking game out of it and get truly pissed indeed."}, {"userName": "William Richards", "userReviewDate": "Oct 07, 2013", "userURL": "http://www.goodreads.com/user/show/24518776-william-richards", "userReview": "The old saying goes, \"You can't judge a book by its cover.\" I can still remember that summer day when I spotted the Michael Whelan cover on \"The White Dragon\" and how it caught my eye. I remember picking it up, reading the blurb on the back cover and deciding I wanted to read it. I was fourteen-years old and I liked that the protagonist was around my age. It was the last book of the Dragonriders of Pern series that introduced me to McCaffrey's world.But it was the story inside that cover that absolutely transfixed me! Easily, this ranks as one of my all-time favorite reads. I read the book so many times, the cover wore out and I had to keep the book held together with cellophane tape! I greatly enjoyed McCaffrey's style of writing and the incredible world she created.The story follows the life of young Lord Jaxom of Ruatha after impressing the white dragon, Ruth; a runt of a dragon compared to others. How he finds himself caught between two worlds: the life of a dragonrider and that of a Lord Holder, never quite fitting in with either. When a shocking crime is committed, Jaxom has to grow up quickly and face his responsibilities or the world of Pern could be plunged into war. While trying to avert dragonrider fighting against dragonrider, Jaxom uncovers a secret about the world of Pern that no one suspected…"}, {"userName": "Natty", "userReviewDate": "Apr 16, 2014", "userURL": "http://www.goodreads.com/user/show/64486-natty", "userReview": "Yes by all means, judge a book set in a feudalistic world surrounded by dragon on your personal interpretation of feminism on Earth circa 2013. This makes no sense to me. If you're going to read a book I think you should read a book and suspend your sense of self to really get a feel for the world that's being created. Now yes McCaffrey wrote a lot of these books in the 60's and 70's and she did not write super liberated women, though for her time they would have seemed quite progressive no doubt. However again, the stories are set in a fantasy world that is feudal in nature so how about judging the writing on the writing? The stories are creative, plausible, the science of this world has continuity and logic, the characters are well written. They are great stories meant to be entertaining and distracting, not to be analyzed like you're in 5th period English."}, {"userName": "Cass", "userReviewDate": "Jun 18, 2010", "userURL": "http://www.goodreads.com/user/show/3891953-cass", "userReview": "Okay this is the final book I have read in my recent Pern binge. Definetly one of the best books in the series, though it may be a bit confusing as a first read as it requires a knowledge of the personalities of the major players on Pern.Anne McCaffrey has written some great scenes into the story. I particular love reading as Jaxom develops from a boy into a man and into his role as Lord of Ruatha."}, {"userName": "Joan", "userReviewDate": "Oct 28, 2017", "userURL": "http://www.goodreads.com/user/show/3837733-joan", "userReview": "This is one of my favorites of the series. Ruth and his rider are just plain nice people. Both are disabled in their own way. Ruth is the only white dragon on the planet Pern and Jaxom was born early from a mother who died at the time of his birth, and whose father died a short time later, making him the lord of Ruatha as an infant. Both will have to prove themselves to the humans of Pern. The dragons accept them as they are."}, {"userName": "Karen", "userReviewDate": "Apr 18, 2017", "userURL": "http://www.goodreads.com/user/show/7788355-karen", "userReview": "I think The White Dragon is my favorite of The Dragonriders of Pern trilogy. In this story. Jaxom, Lord Holder of Ruatha, has impressed Ruth, the only white dragon in existence. Ruth is smaller than a typical dragon, but demonstrates special abilities and more intelligence than a normal dragon.In The White Dragon, more is discovered about the original colonists of Pern. And I'm off to continue my binge re-read of the Pern books! I do this every time!"}, {"userName": "BAM The Bibliomaniac ", "userReviewDate": "Jun 23, 2017", "userURL": "http://www.goodreads.com/user/show/6595648-bam-the-bibliomaniac", "userReview": "Summer Fantasy Fest read #25I think many of the ya audience would find the Ruth the white dragon dynamic fitting. He's just not into it. And that's ok. He's absolutely lovely."}, {"userName": "Tinnean", "userReviewDate": "Feb 03, 2018", "userURL": "http://www.goodreads.com/user/show/4477909-tinnean", "userReview": "This was my favorite of the first three Pern books. I loved Jaxom and Ruth, and the scene where the dragons keep Robinton from leaving always has me in tears. It was a fun way to spend the day."}, {"userName": "Sotiris Karaiskos", "userReviewDate": "Dec 07, 2017", "userURL": "http://www.goodreads.com/user/show/18940246-sotiris-karaiskos", "userReview": "As in the previous book (in chronological order) of this series - Dragondrums - this book supposed to be the last of a trilogy but is actually more a stand-alone novel. Also like the previous book the protagonist is an angry teen thirsty for adult admission and hungry for sex, as most teenagers I think. Of course, this teen is not an ordinary one as he is having many important responsibilities, to which he adds even more as he tends to get involved where he does not have to. With his ally the white dragon, however, he has all the right tools to save the world from trouble and get a girl. An interestingly enough book in which we are also learning about Pern's past. On the other hand, however, I can not say that I found the book particularly exciting, although I definitely find it interesting and definitely better than the previous one I read, I do not put a 4 only for some minor details."}, {"userName": "Bev", "userReviewDate": "May 06, 2011", "userURL": "http://www.goodreads.com/user/show/5082359-bev", "userReview": "I have said this before and I still think it's true, there are some books that are meant to be read at certain times. And if you miss that particular time, then they just won't do it for you the way they might have. I suspect that The White Dragon is just such a book. I have found, and it seems to be more often the case with science fiction/fantasy novels, that I seem to have missed the (space) boat with McCaffrey's novel. Back in the 80s, when I was in the midst of my science fiction binge, my best friend got me Dragonflight, the first in the Pern series, and I loved it. I immediately grabbed up the next Pern book I could find (this one) and put it on the shelf....and got distracted and never read it--till now.Which leads me to my first question. If I read Dragonflight now, would I discover that it too has no real storyline? Because as far as I can tell, The White Dragon doesn't. We have young Lord Jaxom, last of the Ruatha Hold bloodline, who whines and carries on about how nobody treats him like a Lord and yet he's not allowed to be a real dragonrider even though he's got a dragon--albeit an unusual, under-sized one. And he goes off and teaches his dragon to fly and destroy the deadly Threads in secret. And he has sex along the way. And, oh---this is a good one, his dragon participates in the sex too (No, NOT physically, but he loves right along with Jaxom and his lady-friends....say what? A dragon peeping tom.). And he flits here and he flits there and he saves a dragon egg and finds where the ancient men used to be and....well, it's all this major jumble. And there's no real struggle, no real plot points, and no real resolution. It all just kind of rambles to a close.Granted, I didn't read every word on every page--mainly because I was not interested and also because when I did I couldn't see that it mattered a whole heaping bunch. And maybe you've noticed that my review style has changed here and my writing isn't exactly full of coherent thoughts? Yeah, we'll blame that on side-effects.The best part (and what makes this a two-star book instead of a one-star book) is the relationship between Jaxom and his white dragon Ruth--with most of the points going to Ruth. Ruth has a very well-defined personality and I like the way he calms Jaxom down when he (Jaxom) gets off on his \"why are they treating me this way?!\" jags. I would have enjoyed this book a lot more if there had been more focus on Jaxom and Ruth.This was first posted on my blog My Reader's Block. Please request permission before reposting. Thanks."}, {"userName": "Paradoxical", "userReviewDate": "Mar 26, 2011", "userURL": "http://www.goodreads.com/user/show/1964421-paradoxical", "userReview": "[I felt like he fell into love with her too quickly and it came out of left field. I felt nothing for her as a character. (hide spoiler)]"}, {"userName": "CatBookMom", "userReviewDate": "Dec 30, 2013", "userURL": "http://www.goodreads.com/user/show/7318623-catbookmom", "userReview": "As much of an Anne McCaffrey fan as I am, it's sad that I bought this over 5 years ago and just got around to listening to it. But, as good a job as Dick Hill did in narrating the book, I can't say that it made the book any better than it was during my years'-long love of reading and re-reading this, the 3rd of the Pern books. Maybe it's just that the story can't get any better than it is, whether read or heard. Fans of Pern and her dragons and dragonriders waited 7 long years from book #2,Dragonquest, for the release of The White Dragon in 1978. It's a thick book for sci-fi/fantasy for those days, over 460pp, and more than 14hrs of narration. The book covers a period of huge change for Pern: the attempted revolt of the exiled, hard-core Old-timers and their defeat, the first steps in opening the Southern Continent beyond the Southern Weyr/Hold, and, more than anything, the discovery of the remnants of the First Settlers' original settlement. Read this book. Listen to Dick Hill's narration if you prefer audio. But read the book, and enjoy a really good story, even if it doesn't have werewolves, zombies, or slam-bang adventure in every chapter."}, {"userName": "Badseedgirl", "userReviewDate": "Nov 06, 2017", "userURL": "http://www.goodreads.com/user/show/20662786-badseedgirl", "userReview": "With this book, I have completed the original 3-book \"Dragon Riders of Pern\" series. This was definitely not what I thought is was going to be. I will go on and read other series someday, but what I will say is, if you like stories about dragons this is the series for you."}, {"userName": "Jason", "userReviewDate": "Apr 13, 2015", "userURL": "http://www.goodreads.com/user/show/17326212-jason", "userReview": "Jesus - has McCaffrey never heard of a plot? I mean, what is she waiting for, her grand finale? Forget the characterization of Jaxom that everyone's complaining about (he's barely sketched in enough to even be called a character) and this strange fetish she has for men who force themselves on women - let's just stick to the basic level of narrative, of plot mechanics, of conflict and a focused through line. The biggest problem with this book is that, for hundreds of pages, basically NOTHING HAPPENS. There is no plot. There is no guiding thread, no overarching conflict. Some stuff happens, of no particular consequence, and then, after a few pages or chapters of needless and empty dialogue between flat and interchangeable characters, something else happens, unrelated to the first happening, and the pattern repeats. How is this a book? How is this a trilogy? It doesn't even have a story. You know the old play 6 Characters in Search of an Author? This is A Well-Realized World in Search of a Story. McCaffrey has clearly invented a compelling idea for a world. Weyrs and Holds and Dragonriders and a mysterious continent to the South peopled by disgruntled warriors from the past...random mindless attacks from an orbiting red planet...Fire Lizards with their dreams and visions from collective species memory....strange tools and technologies left behind by the original settlers, now only being rediscovered....sounds fascinating, doesn't it? Sounds like a real epic reading experience.But what the hell? This is the strangest damn read of my life. Never before have I seen such a surreal discrepancy between heights of imagination and depths of ineptitude in the construction of fiction. Bits and pieces of world-building are sprinkled throughout an otherwise interminable series of unconnected and unimportant events, given no shape or texture or life. The writing is incredibly mediocre, and inexplicably devoid of incident. It's just so damn talky. And the talk is petty and casual and expositional. How did this ever invite such passionate devotion from readers? How did this ever get nominated for Hugo Awards? More to the point, how did this ever get published? I'm done with Pern. People who love this, I am willing to bet, discovered these books when they were teenagers. Fair enough. Kids love things for different reasons than adults do. But I just read them now, and I am not a teenager, and I can tell you this: skip them. I've struggled through 3 books now, and I kept telling myself there were enough hints of great things to continue, but there really weren't. Now, that is all that I am left with - hints of it. These books are sometimes involving for, like, 10 or 15 pages in a row, and you say, \"Hey, it's finally coming to life!\" and then it doesn't, and nothing happens, and you get disappointed like this again and again and again. That, I think, is the great tragedy of these books, and probably McCaffrey's career. She had a wonderful imagination, there is no question about that, but she had insufficient narrative skill to properly utilize it, and simply not enough ideas for STORY. This makes me sad, because the world-building, the sketch for this place, is undeniably memorable and worthwhile. But this, unfortunately, is a story about dragons that never takes flight."}, {"userName": "Punk", "userReviewDate": "Aug 06, 2011", "userURL": "http://www.goodreads.com/user/show/116652-punk", "userReview": "Fantasy. More dragonriding with some archeology thrown in for color and the first appearance by a female green dragonrider. Except the text calls her a \"dragon girl\" and she doesn't get the honorific apostrophe like the men do and also no one likes her very much because she's bitchy. We also get our first female crafter, a harper, but she's the appropriate combination of bossy and nurturing and everybody loves her. If, on Pern, you are female and only bossy or only nurturing, then you're out of luck; men will not find you appealing.Our hero this time is Jaxom, rider of the white dragon Ruth. Jaxom manages to have sex with women several times without characterizing it as rape. For this series, this is progress. However, it could be argued that Jaxom isn't a real man by the rules of his society because he's not a full dragonrider (no apostrophe, like a girl) and his dragon is immature which means he'll never be driven to have sex with another rider; several characters alluded as much, including the dragon girl no one likes. So he's not capable of rape because he's not a real man. Look, I don't make the rules! It's just what the book could be saying! It's not like it's been all that responsible about gender or sexual politics so far.The plot in this one has a big hole after the first chapter. The second chapter's like, A YEAR LATER AFTER THE HARPER RETURNS FROM HIS DISASTROUS SEA VOYAGE THAT NO ONE TOLD YOU ABOUT BUT DON'T WORRY HE'S RECOVERED FROM THIS VAGUE REFERENCE TO AN ILLNESS. So that's dumb. Also there's a big lull in the middle where Jaxom is sick and then recuperating. The pacing's not great. At some point I lost track of what the point even was. For a while I was looking forward to learning the mystery behind the White Dragon; surely with the way the fire lizards treated him, he must be some amazing genetic throwback, but let's say I was disappointed on that front. Three stars. I liked Ruth and Jaxom and watching them grow up, and I liked exploring the southern continent, but the pacing was just weird. I think I'm done with Pern for now, unless anyone has a favorite book from the other passes.eBook: So much better than the previous two in this series by the same publisher. It still had errors, but not nearly as many. No cover."}, {"userName": "Annie", "userReviewDate": "May 24, 2013", "userURL": "http://www.goodreads.com/user/show/7537929-annie", "userReview": "When I was very little I read all of the Pern books. Now I remember little snippets and pieces so that the books have stopped being books and started being just one long and glorious plot line. Now that I am rereading the books I have found that I actually remember whole quotes and can read one page and quote the beginning of the next page. That is a little bit freaky.The plot is one of my favorites, however I strongly dislike Jaxom. I was reading other people's reviews earlier and my view is wide spread. Jaxom is extremely annoying. However I cannot help myself from sharing his excitement at the prospect of the mountain, his irritation at not being properly trained and his impulse to save the queen egg.While his actions are note nearly acceptable in today's Earth, I understand the social structure on Pern enough to realize that, for anyone of rank, his actions and attitudes are acceptable. I do, however, love Ruth. Ruth is my second favorite dragon, dwarfed only by Orlith, whom I love for a reason quite beyond me. Ruth is everything I could want in a dragon, he's fast and agile, he always knows when he is, and his loyalty, bravery, and cool head have saved Jaxom's hide many times. I also love Ruth's connection with firelizards, and how they help him many times.Another of my favorite aspects is Cove hold. I am always heartbroken when I think of the MasterHarper aging and coming so close to death, but I love when the dragons keep him alive through the heart attack. Over all I don't think this is one of my favorite books af the Anne McCaffrey novels, but I couldn't honestly give any of the Pern novels anything less than four stars. I am happy to have found that many of my earlier memories have been renewed in greater detail and a new perspective and am happy to read the next novels."}, {"userName": "Valerie", "userReviewDate": "Jul 08, 2014", "userURL": "http://www.goodreads.com/user/show/9148191-valerie", "userReview": "[ especially closing with Lessa and the fireplace  (hide spoiler)]"}, {"userName": "Lisa (Harmonybites)", "userReviewDate": "Sep 25, 2010", "userURL": "http://www.goodreads.com/user/show/2596042-lisa-harmonybites", "userReview": "Although I lost interest in the later books of the Pern series, the original trilogy (and the Harper Hall books) remain among my favorites in speculative fiction. This is the third book in the series and you should read Dragonflight and Dragonquest first. This book feels a little different with its focus on different characters: Jaxom and his dragon Ruth. Ruth comes across as a character in his own right more than other Pern dragons, and he's an endearing one. The plot has more than enough twists and turns to keep a reader engaged and this is one of those books you can enjoy rereading years afterward. I liked how this bridges the first two books which feel more fantasy into more of a science fiction theme. Pern has a quasi-medieval feel with its powerful Lord Holders and Guild Masters. In this book you can see Pern blossoming in a kind of Renaissance with a rebirth of science and the settling of the Southern continent. I like that evolution in the book.This is a light, entertaining read with memorable characters."}, {"userName": "Gillian Murrell", "userReviewDate": "Jul 01, 2016", "userURL": "http://www.goodreads.com/user/show/18493466-gillian-murrell", "userReview": "After all these years i still love this series. Jaxom grows up so fast in this book but Ruth is the star of the story. He may have been the runt of the litter but he is smart and very fast. I also think he is waiting to fly a gold dragon which is why he has no interest in the green and bronze as he points out he is the only white dragon on Pern, so why would he not hold out for gold."}, {"userName": "John", "userReviewDate": "Mar 20, 2017", "userURL": "http://www.goodreads.com/user/show/34443064-john", "userReview": "After being disappointed with the first two Pern books I read (Dragonflight and Dragonquest), I thoroughly enjoyed reading The White Dragon. I think this book had great character development and a strong, likeable protagonist that were both lacking in the other two books IMO. I also found the plot much more enjoyable than the other two books."}, {"userName": "Carole-Ann", "userReviewDate": "Jan 07, 2017", "userURL": "http://www.goodreads.com/user/show/4165744-carole-ann", "userReview": "For the nth time of reading, Jaxom is still wonderful!! Oh and so is Ruth!!"}], "description": "Jaxom, a rebellious young aristocrat, and Ruth, his white dragon, fly into another time to retrieve the queen's stolen egg, thereby averting a dragonrider war, and find their planet threatened once again by a Threadfall.", "title": "The White Dragon\n      \n          (Dragonriders of Pern #3)", "url": "https://www.goodreads.com/book/show/127586.The_White_Dragon", "average": 4.18, "cover": "https://images.gr-assets.com/books/1307994871l/127586.jpg", "reviews": 731, "authors": [{"url": "https://www.goodreads.com/author/show/26.Anne_McCaffrey", "name": "Anne McCaffrey"}], "type": ["Fantasy", "Science Fiction", "Fantasy", "Fiction", "Science Fiction Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/127586.The_White_Dragon", "http://www.goodreads.com/book/show/1598837.The_White_Dragon", "http://www.goodreads.com/book/show/6980037-the-white-dragon", "http://www.goodreads.com/book/show/6462661-the-white-dragon", "http://www.goodreads.com/book/show/17861308-the-white-dragon", "http://www.goodreads.com/book/show/1332687.The_White_Dragon", "http://www.goodreads.com/book/show/949119.The_White_Dragon", "http://www.goodreads.com/book/show/61975.Dragonflight", "http://www.goodreads.com/book/show/28541.Dragonsong", "http://www.goodreads.com/book/show/28547.Dragonsinger", "http://www.goodreads.com/book/show/127584.Dragonquest", "http://www.goodreads.com/book/show/465904.Dragonsdawn", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/9409759-powers", "http://www.goodreads.com/book/show/38213061-leviathan-wakes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}