{"ratings": 2328, "userreviews": [{"userName": "Melki", "userReviewDate": "May 22, 2012", "userURL": "http://www.goodreads.com/user/show/5293536-melki", "userReview": "Breasts.Approximately half the population's got 'em. And throughout the centuries, women have used them to earn money. Baring them on film and in magazines. Shaking them while twirling aroung poles. Using 'em to feed babies.Wait! What?That's right. Their main purpose is for feedin' the young'uns. And not that long ago, a woman with few other options could make a living by breast feeding.After an accidental pregnancy leaves her lactating, Susan Rose earns her keep by going from house to house, feeding the babies of women either too sick, too vain, or too disinterested to do it themselves. When her second babe is snatched away and placed in the home of a mad woman, Susan devises a plan to be reunited with her son and protect him from harm.Susan is a great character. I can't imagine anyone NOT liking her. A healthy, hefty, big-boned gal, she realizes that her job is somewhat odd, but necessary. And while illiterate, she possesses common sense and a down to earth manner that serves her well. She is candid and refreshing, and truly makes this book worth reading.A page-turning mix of humour and suspense, I tore through this sucker in no time flat.And now - some breast feeding jokes:*On board a plane, a man was seated next to a young mother with a baby in arms. When her baby began crying during the descent for landing, the mother began nursing. Turning to the neighbouring passenger, she explained that her pediatrician said breast feeding would help alleviate the pressure in the baby’s ears.”“Huh” said the man. “And all these years I’ve been chewing gum.” *Why are womens breasts like a trainset a child gets for Christmas? Because they were both designed for kids but dads like to play with them.*Students in an advanced Biology class were taking their mid-term exam. The last question was, ‘Name seven advantages of Mother’s Milk’, worth 70 points or none at all.One student, in particular, was hard put to think of seven advantages. He wrote:1) It is perfect formula for the child.2) It provides immunity against several diseases.3) It is always the right temperature.4) It is inexpensive.5) It bonds the child to mother, and vice versa.6) It is always available as needed.And then the student was stuck. Finally, in desperation, just before the bell rang indicating the end of the test, he wrote:7) It comes in two attractive containers….and the cat can’t get at it.He got an A."}, {"userName": "Linda", "userReviewDate": "Aug 12, 2009", "userURL": "http://www.goodreads.com/user/show/1050198-linda", "userReview": "Susan Rose has been brought up by an abusive drunk of a father and a mother forced into wet-nursing to keep hearth and home together. When Susan, in service at the manor house, finds herself pregnant by the master's son, she is forced by her father into following in her mother's footsteps, only a few weeks after the birth of her son. Erica Eisendorfer, in a remarkable first novel, has produced a work of originality, interest, and intelligence. No \"English rose\", Susan is a spirited, strapping young woman with no formal education but a deal of common sense, optimism, and sheer grit. Her story begins slowly enough, but by the halfway point, the suspense kicks in and makes it un-put down-able. Susan Rose is a most unconventional heroine, but heroine she most definitely is. Interspersed with Susan's tale are brief vignettes narrated by the mothers of her many charges, explaining just how it came to pass that they were in need of her vital services. Now the reader sees both sides of the situation, which by contemporary standards is a rather peculiar one. The author tempers what could be a bleak topic (racism, classism, and sexism) with touches of humor and joy. Upstairs, downstairs, and all around the town - it's all here in The Wet Nurse's Tale."}, {"userName": "Sheri S.", "userReviewDate": "Jan 08, 2011", "userURL": "http://www.goodreads.com/user/show/3424990-sheri-s", "userReview": "Well, I loved this book! Normally I reserve my 5-star ratings to books that I consider an all-time favorite and would read again, but this book is not one of them!!! However, I think I've read too many books lately that have just been OK or had endings that I did not like! But, woo hoo, this fantastic tale did have a great ending and I was just SO happy that I felt compelled to give it my highest rating (normally would have given this book 4 stars, no, probably 4.5!!!)! This was a superbly written, utterly fascinating look into the world of wet nursing during Victorian times, but Susan Rose is far from the typical Victorian heroine! Following in her mother's footsteps in the wet nurse profession, she strays far from her mother's morals to do whatever it takes to protect herself and her son, which leads to a lot of mistakes, tragedy and heart breaking choices that Ms. Rose makes no excuses for. But, far from being a dark and depressing story, hers is full of gumption, determination and hope for a happy ending; which she ultimately achieves and fully deserves! But, why would I not read this story again? I must say that even though I do love it, and the author did a superb job writing about it, there is just no delicate way to address the subject matter of sex, childbirth and nursing or about having to accept, but do ultimately forgive, Susan Rose's \"that is that\" decisions. Overall, it is a story best read once, but I do highly recommend it, especially if you're a mother herself, and it's definitely the type of book that would make for a great book club reading discussion!!"}, {"userName": "Jake Rideout", "userReviewDate": "Jul 13, 2009", "userURL": "http://www.goodreads.com/user/show/2518097-jake-rideout", "userReview": "Susan Rose's mother is a wet nurse, whose profession is to feed and care for other women's babies until they can be weaned and returned home. Susan's father is a drunk who is always looking for ways to earn an extra shilling. When Susan gives birth to a baby and a desperate mother calls for a wet nurse, Susan finds herself sold to the highest bidder. This is the story of a smart, plucky, adventurous lower-class woman in Victorian England, and it is everything a reader wants in a historical novel. Susan is overweight and not particularly attractive--and she frequently makes poor decisions regarding men--but you will love her immediately. Her narration is pitch-perfect, blending humor and heartbreak while giving a fascinating glimpse into a mostly unknown profession. I loved it."}, {"userName": "Felice", "userReviewDate": "Sep 19, 2010", "userURL": "http://www.goodreads.com/user/show/2507841-felice", "userReview": "\"Mammy how I love, how I love you my dear old mammy.\" Sorry I could not stop humming that while I was reading The Wet Nurse. Not since Jayne Mansfield have breasts done so much for a career.I did pick this book up on purpose. Am I expecting? No. Am I contemplating a career change? Yes, but nothing in the diary field. I had made a note of The Wet Nurse when the hardcover came out that I wanted to take a look when the paperback was released. It was, I did and I purchased. Why? Historical interest. It certainly was not this dreadful cover that tempted me. Take a look at that. It makes those God-awful covers on the Barnes and Noble Classics look attractive. After a lifetime's worth of reading historical fiction and 19th century writers like Dickens, Trollope, Collins, Oliphant, Gaskell, etc I knew what a wet nurse was but that was all I knew. The wet nurse is an unexamined staple of period novels. Typically even the second upstairs parlor maid will have more character development and plot importance than the wet nurse. Sue me I was curious. My attitude is the give away that I did not expect to...well, respect this novel. I assumed from the cover, the subject matter and the prosaic title that I would get a few facts on milk production as a livelihood, average writing and maybe some entertainment. Why? What was it about a novel whose main character lactates for a living that made me prejudge ? Am I a snob? Am I just the tiniest bit disappointed that I enjoyed The Wet Nurse from end to end? Absolutely not. My snottiness was defeated. Author Erica Eisdorfer has done a very good job. Her main character, Susan Rose, is an illiterate country girl forced to go to London to hunt down her missing son. She is able to get a position in a household and is soon given the opportunity to better her salary by becoming the wet nurse. Susan is what Dickens would have described as a 'jolly' girl. My Mom would have said that she was no better than she should have been. She is good hearted, lusty and true but not above scheming and larceny to get ahead and recover her son. You know that if Susan is going to earn herself a happy ending she will have more than her share of adventures, heartache, horrifying employers and brutality to endure. Susan is the strength of this book, not the plot.At the end of each chapter is a somewhat abrupt interruption of the story while Susan's clients explain why she was needed in each job. These were my favorite parts of the novel. As informative as these sections were they also help the novel. They add a little balance to the story by bringing in a touch of Upstairs Downstairs to the book and with each explanation Eisdorfer brought a subtle reminder to us about how difficult surviving Victorian England was for adults and children. They also served to reinforce our view of Susan's independence and resilience. The Wet Nurse defied my snobby this-will-be-all-cheese expectations and lived up to my desire for knowledge."}, {"userName": "Aarti", "userReviewDate": "Aug 17, 2009", "userURL": "http://www.goodreads.com/user/show/149420-aarti", "userReview": "Erica Eisdorfer nails the Victorian era. She is on top of the class divide, the race divide and the gender divide. Her main character, Susan Rose, speaks in a working-class dialect that is neither stilted nor affected. I value this highly as it is a nuance that something many authors cannot master. Eisdorfer also introduces some characters only for the brief spell of one or two pages, each one sharing his or her reasons for hiring a wet nurse. These people, too, come alive off the page and you get to know their personalities very well, even if you only interact with them for two pages. I really enjoyed these vignettes that Eisdorfer put in at the end of every chapter. They were fun to read and would sometimes be alluded to later in the story as well. In fact, I feel certain that one of the vignettes has a large bearing on the end of the story, only I can't quite put my finger on how the two are connected. I will have to mull over that some more.Susan, though, steals the show. She is so wonderfully real and easy to identify with. She does not beg for sympathy from anyone, and does not have stupid affectations to get attention. Susan isn't the most fabulous and exciting woman in literature. But she sets her mind on a goal and goes for it, and one can't help admiring a woman for that.The only quibble I had with this book was its unexpected plunge into a somewhat Gothic storyline. I did not see that coming at all, from the start, and the book was a bit darker than I expected because of it. But the story is compelling and plausible, and Eisdorfer knows her Victorians. I'd highly recommend the book to any fans of historical fiction!"}, {"userName": "Barb", "userReviewDate": "Sep 15, 2011", "userURL": "http://www.goodreads.com/user/show/849475-barb", "userReview": "I picked this up at a book sale somewhere and promptly put it on the bottom of the pile to be read and mostly forgotten about. I only pulled it out because I was looking for something to fulfill the requirement of my book bingo square for \"a book at the bottom of your to be read pile\".  http://www.retreatbyrandomhouse.ca/20...So, score one for the book bingo book challenge because I really loved this. Though I almost set this back on the pile as I was choosing it. When I read there was a mystery and the protagonist, Susan Rose, had her baby stolen from her, then sold and sent away, I was very interested. I wanted to know what happened to the poor babe, did Susan get him back and if so how?I loved Susan Rose, poor, huge, homely, Susan Rose. But she was plucky and smart and capable of developing some excellent plans. I loved her plans (though as she was executing them I was worried about the fate of her baby boy). This was a fun story that made me nervous and hopeful but left me feeling satisfied in the end. I would gladly read more from this author but it looks like there isn’t any more to read."}, {"userName": "Tina Hayes", "userReviewDate": "Mar 20, 2010", "userURL": "http://www.goodreads.com/user/show/1178584-tina-hayes", "userReview": "Different from your usual reads, Erica Eisdorfer's \"The Wet Nurse's Tale\" is a story you won't soon forget. Set in Victorian England, this story spins a tale of Susan Rose as she transitions from working as a maid to a career as a wet nurse. When Susan Rose gives birth to the grandson to the people she works for at the Great House, she is forced to leave her son behind to earn money for her family by working as a wet nurse for the Chandlers. Though Susan's mother lovingly tends to baby Joey, he dies shortly after. Later Susan delivers another son, but her drunk and abusive father gives the child away. As Susan races to get her son back, there is no length she won't go to rescue the boy. Just wait til you read what happens next! Erica Eisdorfer captured the authenticity of Susan Rose's voice, which instantly warms the reader to this character. Neither beautiful nor sophisticated, Susan is a person we route for with every turn of the page because she's big hearted and loving despite her flaws. This is historical fiction at its very best."}, {"userName": "Jarucia", "userReviewDate": "Mar 28, 2010", "userURL": "http://www.goodreads.com/user/show/1402886-jarucia", "userReview": "Wonderful Read to Pass BF-ing hours...BF-ing = breastfeeding, by the way.As a mother to a newborn, I've been spending a lot of time in the rocker with my baby.As per the sentiment of the book's protagonist, Susan Rose, when one's nursing one has a lot of time to think...well one has a lot of time, period :)This book was an immensely satisfying read for me. The character of Susan Rose was very vital and her voice was a pleasure to listen to as I followed her tale.Ms. Eisdorfer does a masterful job of controlling time shifts in the story early on that eventually meet when our heroine sets out to right a wrong done to her (thought she guiltily shares the blame herself).It was a seamless read from beginning to end and while it wasn't meant to be a mystery, as such, I was compelled from one page to the next.A very fine read."}, {"userName": "Emily", "userReviewDate": "Dec 16, 2009", "userURL": "http://www.goodreads.com/user/show/440958-emily", "userReview": "I had hoped to enjoy this book much more than I did; historical fiction, woman in a trade I know little about. But in the end, it's not a book I'd recommend. As far as plot goes, I felt like it had some real merit. The character was likeable and I sympathized with many of her plights. The first half of the book seemed to spend too much time in the realm of romance novels -- not even love, just the talk of how women became pregnant. There were small sections interspersed called 'Mrs. ______'s reason'; they were the many different situations and reasons that caused a woman to look for a wet nurse. I thought this could've been really interesting, but I would've rather heard them in connection to the plot. As it was, they had tenuous strings to our plot. I didn't understand why that idea wasn't better connected to the babies who were being nursed. The second half of the novel, the plot picked up and became really interesting. But I felt like the whole plot could've been left to itself, and too much time was devoted to how the character got pregnant in the first place. I was just disappointed by the unnecessary tawdriness of parts of the book."}, {"userName": "Shannan", "userReviewDate": "Nov 22, 2009", "userURL": "http://www.goodreads.com/user/show/820575-shannan", "userReview": "The idea behind this book was new and interesting so for that I should have liked to have given it 5 stars. But there was way too much irreverent talk about how the women got pregnant (if you now what I mean). There was never anything sexy...just matter of fact statements. But too much for me to want to recommend to anyone. The second half of the book was done with all the women getting pregnant and how...and the plot thickened and became very engrossing. I liked learning about how life may have been like for poor women who worked by nursing other women's babies.One thing I really LIKED about the book was that they talked a great deal about death. So many women and babies died in childbirth. What I liked about it was that the main character who herself loses a baby, says that no matter how many women have lost babies before her, it doesn't lessen the pain of those who are going through it."}, {"userName": "Shannon", "userReviewDate": "Jun 30, 2009", "userURL": "http://www.goodreads.com/user/show/1446363-shannon", "userReview": "a delightful jaunt into Victorian England's fascinating social classes, as told by a wet nurse.Becomes a sort of adventure when she sets off to find her own child, and there's even a bit of the \"gothic\" feel to it. Creative, observant and fun main character. Basically it's \"chick lit\" for the historical fiction crowd."}, {"userName": "theolivelady", "userReviewDate": "Mar 12, 2015", "userURL": "http://www.goodreads.com/user/show/9513340-theolivelady", "userReview": "I loved the protagonist - she was awesome!"}, {"userName": "Misti", "userReviewDate": "Apr 27, 2017", "userURL": "http://www.goodreads.com/user/show/34386522-misti", "userReview": "Thank you Lacey for lending me this book; I really enjoyed it! It was funny and sad and very interesting and I really loved the main character. I even liked the little snippets between chapters that were told from the perspective of mothers who put their babies out to nurse and gave their reasons for doing so. I would highly recommend this book whether someone likes historical fiction or not; it's just a great read."}, {"userName": "Melissa", "userReviewDate": "Mar 24, 2010", "userURL": "http://www.goodreads.com/user/show/260860-melissa", "userReview": "I found the main character and wet nurse, Susan Rose, to be quite amusing. I enjoyed that the story came from the perspective of someone of the lower classes who had to \"do for herself.\" I loved much of the humor in her thoughts, basically along the lines that rich people worry about crazy things that poor people don't have time to think about and that the rich make the messses and the poor have to clean them up. Susan is practical and does what she needs to do to survive. Her values are based on her own moral compass, rather than the religious and social morals of Victorian England. She decided that she would rather have male companionship than to be an old spinster who never experienced any joy. Instead of being shamed to be an unwed mother, she welcomed the baby as something to bring some joy into her life. Susan Rose is not a woman who follows anyone's whims but her own. The author paints social problems (female servants expected to submit to the master of the house, Susan being beaten by her father, etc.) in a way that just made them matter-of-fact, the dangers of the times. Which, for someone of her class, was a part of everyday life. I liked the realism contained in the book, even if I didn't like some of the acts. I thoroughly enjoyed the book and zoomed through it in one day!I learned a little piece of history that I had not known before. I had always thought wet nurses nursed babies who mothers could not produce milk, were sick with childbirth fever or whose mothers had died. I found through my reading that some were farm wives who were needed to help with the harvets and some were wives of merchants who helped run the store. Wet nurses also nursed the babies of high society women who found nursing their own babies to be \"unfashionable\" because it would keep the wife tied to the baby and unable to attend parties, balls, dinners, etc. I had previously assumed that the aversion to breastfeeding had started in the US, in the early 1900's, with the invention of baby formula. But, apparently it started in Victorian England with the upper crust. Or maybe even before that? I don't know but think it is an interesting subject."}, {"userName": "Lauren", "userReviewDate": "Jun 18, 2009", "userURL": "http://www.goodreads.com/user/show/1045491-lauren", "userReview": "The Wet Nurse's Tale is a plot driven historical fiction novel about Susan Rose, the witty, illiterate daughter of a wet nurse who works as a maid in the \"Great House\" in her village. Susan follows in her mother's footsteps and becomes a wet nurse herself after several pantry dalliances with the young son of her employers. The first part of the novel describes how Susan became a nurse and follows her from home to home as she nurses the babies of others at the expense of her own son Joey. The second part of the novel involves Susan's second son and her quest to retrieve him from London gentry after the baby is removed from Susan's home without her knowledge. This portion of the novel is a gothic storyline, reminiscent of a low brow Bronte plot. Through it all, Susan narrates with good spirits, country crassness, and commn sense. Although illiterate, Susan is clearly knowledgeable of class relations, family dynamics, and basic human nature. This novel is very well done. The novel is told in the first person; Susan's narration is punctuated with 19th century slang. Each chapeter in the novel is followed by a two page story of a woman (or in one case a man) who paid a wet nurse to feed her child. This feature, though interesting, interrupted the flow of the story. The novel, though historical fiction, is light on history per se, but largely revolves around the social relationships of the time. There are only a handful of cues about the time period in which the novel is set - travel is done by coaches (for the poor) or trains (for the rich) and Benjamin Disraeli is mentioned. Ultimately, the time period doesn't matter - the story is timeless, meaning that it could have taken place any time from the middle ages through the early twentieth century."}, {"userName": "Colleen Turner", "userReviewDate": "Jul 15, 2010", "userURL": "http://www.goodreads.com/user/show/3339335-colleen-turner", "userReview": "I really enjoyed this! It was refreshing to read a book with a character so open, real and raw that you cannot help but feel for her at every turn. When Susan Rose's heart bleeds yours does right along with her. And when she triumphs, no matter how small, you cheer for her every step of the way. She is not perfect, as none of us are, but she is caring, strong and tough as nails when it comes to those she loves dearly.Susan Rose is a young, large woman working in the Great House of her town along with some of her many siblings. There really isn't much else for a girl in her position to do as she is poor, uneducated and has an abusive, alcoholic father who cares more for the wages she can bring home then her happiness. Her mother is extremely loving, however, and has kept her family fed by being Wet Nurse to many children over the years. When the lonely, odd son of the Great House seeks comfort in Susan's embrace, her future is set on a course with some happiness and much heart break. She herself becomes a Wet Nurse and finds a calling she did not prepare for. She wants what most women want in this world: happiness, children and the love of a good man who will love her for exactly who she is. But how can she, Susan Rose, find that?This book was a quick read and I enjoyed the author's writing style very much. Susan herself is the narrator of this journey and the book reads just as she would speak outloud to her \"Reader\" who she addresses directly throughout. I was sad to see this book end but will definitely keep my eyes out for future books by this author."}, {"userName": "Kiki", "userReviewDate": "Nov 19, 2011", "userURL": "http://www.goodreads.com/user/show/612857-kiki", "userReview": "This is a beautifully written novel about a wet nurse in Victorian London. Susan Rose is young woman from a poor family who knows her own mind and is tough as nails. Sent to work in the great house near their village, Susan and her sisters toil away for the wealthy family, ever mindful of the customs and cultural restraints of the day, until Susan is approached by the awkward young Master of the house, and her life is forever changed in many ways.This is really a novel about nursing. Interestingly, in today's culture, the very thought of giving one's own child over to a wet nurse for nurturing and feeding would be considered pretty out of the norm (as sadly, nursing itself sometimes is). But in Victorian England, before baby bottles and formula, women of all standings entrusted their infants to working class women who were hired out for specifically that purpose. These wet nurses sometimes nursed a succession of children for many years. I loved the author's writing, giving Susan a voice that is both raucous and funny, as well as tender and sweet. Susan is an observant narrator, telling us all about her experiences and thoughts on them, from visiting the Jewish temple for worship, to watching a new mother deeply in love with their child. Highly recommend.PS-- As a very personal aside, I also read some gorgeous parts of this novel aloud to my husband. There were just some moments in this book where I was struck at the author's astute observations about mother's and their newborns. Very poignant."}, {"userName": "Priscilla Herrington", "userReviewDate": "Jun 29, 2015", "userURL": "http://www.goodreads.com/user/show/19096035-priscilla-herrington", "userReview": "The Wet Nurse's Tale is a funny and captivating read that manages to convey an enormous amount of information about breastfeeding, wet nursing other women's babies - and the myriad reasons why a wet nurse might need to be employed - and life among both the lower and upper classes in Victorian England.Erica Eisdorfer has created a heroine, Susan Rose, who is unforgettable. Her mother was a wet nurse, and it seems only natural that she take up that line of work following her first pregnancy. Her tale is interspersed with accounts of those who hired her mother or Rose to feed their babies; through these vignettes we see the many different reasons for employing wet nurses, ranging from the vain who didn't want to ruin their figures to those who felt that sending their infants to live in the country for their first few months would be healthier than keeping them in the city, and including the infant whose mother died in childbirth, and the mother who had twins but not enough milk for two. I thoroughly enjoyed this book. It was so well written and the characters so well drawn that the ending was completely believable - and very exciting!"}, {"userName": "Eileen ", "userReviewDate": "Oct 14, 2012", "userURL": "http://www.goodreads.com/user/show/4491736-eileen", "userReview": "The Wet Nurse's Tale is the story of young Susan Rose, who must find work as a wet nurse when her baby is taken from her. I t was very interesting and didn't take long to read the whole book. I liked how the story showed us how hard being a wet nurse could actually be , as well as all the joys each woman experienced holding and loving these precious babies. Back in the Victorian era there were so very many mothers who just didn't want to breast feed the child on their own but who insisted that it be done from a wet nurse because it was much healthier for the baby. This tale is basically about Susan Rose who was a wonderful wet nurse and had much experience in her profession and also lady's maid as well.However,through horrible circumstances, someone stole her own baby. Susan was determined to get him back and he had to track him down and get him back using all of her skills and smarts as a wet nurse and great mother. Shows what Moms will do to save their children.It was a great story and I enjoyed the book very much. Just wished the ending was a wee bit longer. If you know what I mean."}, {"userName": "Amy", "userReviewDate": "Jul 13, 2010", "userURL": "http://www.goodreads.com/user/show/1710557-amy", "userReview": "Nice to have another view of the Victorian era, especially told from the other side of the tracks. Susan Rose is a survivor. Her life hasn't exactly been a bed of roses, but she comes through as a rose should, soft and pink in the right places but with a steely thorn for protection. She's pragmatic, loving, and caring. When life bypassed her in the physical beauty department, it gave her a heart that could fill with love.I've often wondered about the whole Wet Nurse profession. It made sense in a time when one of the highest causes of death for women was related to childbirth. But I also knew there were those who couldn't nurse or wouldn't nurse for various reasons, and lets face it, Enfamil and Similac weren't around then. I'm not even sure when the first rubber nipple came into use, so feeding an infant any way but the breast was tedious to be sure.This was interesting and a quick read. Thanks for pointing it my way, plainjane8160!"}, {"userName": "Jodi", "userReviewDate": "Aug 07, 2010", "userURL": "http://www.goodreads.com/user/show/932702-jodi", "userReview": "I absolutely LOVED this book and couldn't put it down! I loved Susan's voice in the story and how she talked to the reader throughout the book. I also loved her pluck and kind-hearted manner throughout the story. For Victorian times she was rather loose but I think she felt more resigned to her position most of the times and did what she did because she felt she had little choice otherwise. I love how she turned her \"bad luck\" of getting pregnant into a career that offered her some freedom from her horrible father. I also loved the clever way she managed to save her baby boy from the horrible mistress of the house! I also loved the ending and hope she was able to live happily ever after with her Mr. Abrams!"}, {"userName": "Cynthia  Scott", "userReviewDate": "Apr 25, 2016", "userURL": "http://www.goodreads.com/user/show/4317399-cynthia-scott", "userReview": "Very interesting and different point of view of life in 19th Century England. Women had few choices of occupation if they did not marry, or if they were widowed young with children to rear. One option that was often used was sharing the milk of their body with babies whose mothers couldn't, or chose not to, breast feed them. This is essentially is the story of one woman who became a wet nurse, as her mother had before her. The chapters are interspersed with the stories of the many reasons different women chose to, or had to, resort to wet nurses. Well researched and written and very readable. Minor implausible drama, but maybe it did happen."}, {"userName": "Ashley Lehman", "userReviewDate": "Dec 07, 2014", "userURL": "http://www.goodreads.com/user/show/37673352-ashley-lehman", "userReview": "This story hooked me immediately. Susan, the narrator, is so likable, down - to - earth, and real. As a mother who nursed my children, the life of a wet nurse is fascinating to me. At times, it was so hard to read because I couldn't imagine having to do what Susan did - leaving my own child to nurse another's. It amazes me that that was a not uncommon way to support a family; whether you chose to or were forced to (like Susan was). For all the heartache and sadness, the story is not sad in the end but triumphant. You will be on Susan's side as you read, laughing and crying along with her. A great story!"}, {"userName": "Linda", "userReviewDate": "Oct 17, 2014", "userURL": "http://www.goodreads.com/user/show/6999685-linda", "userReview": "As a lactation consultant I was fascinated by this book. It is historical fiction with a bit of romance thrown in. There is also some very sad parts and a bit of raunchy parts....all very \"british like\". There was lot of sound breastfeeding information but she threw enough \"old wives tales\" in to make it believable. The book is narrated by the main character but in between chapters tell stories of women who have given their babies to wet nurses and their reasons for doing so. I don't think it would be everyone's cup of tea but I thoroughly enjoyed this book."}, {"userName": "Rebecca", "userReviewDate": "Apr 01, 2013", "userURL": "http://www.goodreads.com/user/show/5161074-rebecca", "userReview": "What a ripper of a read! It had me from the very first sentence, and when you're picking a book up to read in ad breaks whilst watching the telly, you know it must be good!This is Susan Rose's tale of her life as a wet nurse and her character and voice could not be any richer. Narrated in conversational style, I could just imagine Susan's broad northern England accent telling me her tale in the friendliest voice. I loved this story and highly recommend it!"}, {"userName": "Michele", "userReviewDate": "Jan 18, 2015", "userURL": "http://www.goodreads.com/user/show/2548498-michele", "userReview": "Susan Rose is a wet nurse for wealthy Victorian clients. When she has a child, she must leave the baby and hire herself out to others. The child dies. When she has a second child, she vows not to let it happen again. However, her alcoholic father sells the child to somebody else and Susan Rose must find out where her baby is. Once she finds the child, she hires herself out to that family and must keep her child safe from a mad woman!"}, {"userName": "Caroline", "userReviewDate": "Sep 19, 2009", "userURL": "http://www.goodreads.com/user/show/1258852-caroline", "userReview": "This was a really engaging book, alternating the first person story of a Victorian wet nurse and short chapters from the point of view of people who hired wet nurses -- including a posthumous account from a woman who died in childbirth. It's steeped in careful personal and cultural detail (clearly the author did loads of research), but always stays pretty light."}, {"userName": "Leslie", "userReviewDate": "Aug 26, 2009", "userURL": "http://www.goodreads.com/user/show/402125-leslie", "userReview": "I read a lot of press about this book before its Aug 6th release date and the press was right - WONDERFUL! We were on vacation and could hardly wait til the family fell asleep so that I could finish the book! It's a quick read and will not disappointed you! This was a debut novel and I can hardly wait for the author to write another book!"}, {"userName": "Kelly", "userReviewDate": "May 03, 2010", "userURL": "http://www.goodreads.com/user/show/3252719-kelly", "userReview": "I don't think I would recommend this book to someone who hasn't nursed a baby or doesn't want to read about boobs on every page, but it's a gripping yarn. The narrator Susan Rose is quite charming and entertaining. If you like PBS period dramas and books like Sarah Waters' Fingersmith (and babies/boobs), then you'd probably enjoy this as well."}], "description": "Bright and clever with a sharp-tongued, adventurous heroine who offers a candid and often funny look at the business of nursing babies in Victorian England, this is a debut novel that will have everyone talking.Susan Rose isn't the average protagonist: she's scheming, promiscuous, plump, and she is also smart, funny, tender, and entirely lovable. Like many lower-class women of Victorian England, she was born into a world that offered very few opportunities for the poor and unlovely. But Susan is the kind of plucky heroine who seeks her fortune, and finds it . . . with some help from, well, her breasts. Susan, you see, is a professional wet nurse; she breast-feeds the children of wealthy women who can't or won't nurse their own babies.But when her own child is sold by her father and sent to a London lady who had recently lost a baby, Susan manages to convince his new foster mother, Mrs. Norbert, to hire her as a wet nurse. Once reunited with her son, Susan discovers the Norbert home to be a much more sinister place than she'd ever expected. Dark and full of secrets, its master is in India, and the first baby who died there did so under very mysterious circumstances. Susan embarks on a terrifying journey to rescue her son before he meets the same fate.", "title": "The Wet Nurse's Tale", "url": "https://www.goodreads.com/book/show/6006802-the-wet-nurse-s-tale", "average": 3.75, "cover": "https://images.gr-assets.com/books/1348397118l/6006802.jpg", "reviews": 448, "authors": [{"url": "https://www.goodreads.com/author/show/476271.Erica_Eisdorfer", "name": "Erica Eisdorfer"}], "type": ["Historical", "Fiction", "Historical", "Historical", "European Literature"], "outlinks": ["http://www.goodreads.com/book/show/6006802-the-wet-nurse-s-tale", "http://www.goodreads.com/book/show/7047965-the-wet-nurse-s-tale", "http://www.goodreads.com/book/show/17213298-the-wet-nurse-tale", "http://www.goodreads.com/book/show/934403.Carolina", "http://www.goodreads.com/book/show/12352782-27-views-of-chapel-hill", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}