{"ratings": 23670, "userreviews": [{"userName": "Angie", "userReviewDate": "Jul 18, 2013", "userURL": "http://www.goodreads.com/user/show/4946951-angie", "userReview": "Oy. Where to begin? I realized I was skimming pages, something I only do when I'm really bored with a story, so I checked what page I was on. 46. Forty-six! How is it possible that it moves soooo slow that forty-six pages felt like a hundred? Know what I don't need? - Adjectives in every single sentence. - The same island described a million times. - The regular reminder in every chapter that the husband is a poet and (surprise!) liked to drink. - Reminders every two pages that she's jealous. Over and over and over again. The book flashes between the present, a letter written in the 1800s and descriptions of events from the 1800s. The problem is that it goes something like this:  Women. Stuff from a long time ago. Fishing. Island descriptions. Blah blah blah.  Women. Boating. Island descriptions. Blah blah we're in the present now blah blah so I hope you were paying attention. There isn't even so much as a space between the paragraphs to the let the reader know that Shreve is switching between past and present. The different timelines can easily work if they had been grouped together in larger sections. Instead, you get 2-4 paragraphs of current stuff then jump to 2 paragraphs of history, then back to the present and on and on and on. It feels disjointed and takes you completely out of the story. Beyond the issue with how the story is told is the story itself. Romantic jealousies, distrust and assumptions that lead to tragedy. It could've been good but it failed. Badly. Don't waste your time with this one."}, {"userName": "David Abrams", "userReviewDate": "Sep 27, 2010", "userURL": "http://www.goodreads.com/user/show/175080-david-abrams", "userReview": "Anita Shreve (author of the much-touted \"The Pilot’s Wife\") has done the near-impossible in \"The Weight of Water.\" She has written two tragic tales, separated by more than 100 years, and coiled them seamlessly into one compelling narrative. This is one of the most emotional, provocative and exciting novels I’ve read in a long time. For those who dismissed \"The Pilot’s Wife\" with a shrug, this is THE Shreve novel to search out at the local bookstore. \"The Weight of Water\" is a much better crafted work than the more recent Oprah pick.In the novel, a photojournalist named Jean gets an assignment to do a photo essay on a 100-year-old double-murder that happened on the Isles of Shoals, a tiny group of islands off the coast of New Hampshire. Jean brings along her poet husband, her five-year-old daughter, her brother-in-law and his new girlfriend. They all climb aboard an old sailboat and head out for the barren islands. Turmoil brews as quick as afternoon storm clouds. Jean and her husband Thomas have a strained marriage, full of jealousy and stony silences; Rich, Thomas’ brother, has a physically passionate relationship with his girlfriend, but their relationship also shows signs of trouble when she starts to flirt with Thomas; then there’s the volatile relationship between Thomas and Rich. Let's just say, it’s a far cry from the Love Boat.Shreve skillfully gets the reader involved in the soap opera when, in the first few pages, Jean and Rich take a trip onto the island to photograph the murder scene. The attraction and tension between them is as palpable as the briny sea air.Interwoven with the modern story is the saga of what happened on the island in 1873 when two women were brutally murdered with an ax. This part of the novel, told in a memoir by another woman who hid in a cave after the murders, is even more intense than Jean’s marital woes. I don’t want to spoil any of the delicious narrative surprises Shreve has in store, so I’ll just say that there’s insanity, jealousy and incest at work on the island in 1873—problems that continue to resonate and haunt characters 100 years later.As she proved in \"The Pilot’s Wife,\" Shreve has a sure touch when it comes to accurate, detailed descriptions. With an admirable economy of words, she gets us right under the skin of the characters. Here’s Jean’s lament from the opening pages of the novel: \"Sometimes I think that if it were possible to tell a story often enough to make the hurt ease up, to make the words slide down my arms and away from me like water, I would tell that story a thousand times.\"Fortunately for us, we are given the story and all of its pain and passion.(As an aside, Shreve’s descriptions of Smuttynose Island and the rest of the Isles of Shoals were so graphic and interesting, that I immediately searched the Internet for photos of the area. I found one site [though there may be more] that had a collection of beautiful images: http://www.perpublisher.com/shoals.html)"}, {"userName": "Tory", "userReviewDate": "Aug 24, 2007", "userURL": "http://www.goodreads.com/user/show/41751-tory", "userReview": "“I learned that night that love is never as ferocious as when you think it is going to leave you. We are not always allowed this knowledge, and so our love sometimes becomes retrospective.”Anita Shreve has such a somber but beautiful voice. Her stories are incredibly emotional. The plot was somewhat scattered and none of the characters were developed enough for me to love them. However, that didn’t take away from this book for me, as it usually would. Some writers, good characters are all they have. But Shreve’s voice is stunning enough in itself, that the actual story became almost immaterial while I was reading. Not that this story was bad, because it wasn’t. Far from it. The narrative switched back and forth between a modern day photographer, the story of the island she was photographing, and a memoir written about the only surviving member of a murder that had taken place on said island. But the writing. The writing was just mesmerizing."}, {"userName": "❀⊱Rory⊰❀", "userReviewDate": "May 31, 2017", "userURL": "http://www.goodreads.com/user/show/25852225-rory", "userReview": "This is a powerful book about jealousy, envy, rage and destructive secrets. I'd seen the movie, but the book is far more powerful and the consequences more devastating. I don't understand why they changed the ending in the film."}, {"userName": "Gail", "userReviewDate": "Jan 15, 2008", "userURL": "http://www.goodreads.com/user/show/199326-gail", "userReview": "Anita Shreve could be described as a guilty pleasure...like potato chips. I thought this was one of her better efforts, with interwoven plots, some great characterization, and a very sure hand with the New England background. Even though I saw the present-day plot twist coming from about page 10, the book still held my interest...I mentally screamed, \"Look out! Disaster ahead!\" several times. I enjoyed this book very much, but most of her others, notably \"The Pilot's Wife\" (gee, how could the reader miss that little plot \"surpirse\"?) and the most dreadful, disappointing, wordy, empty \"A Wedding in December.\" That one made me swear off Shreve for good...or at least for now."}, {"userName": "Jacquelyn Mitchard", "userReviewDate": "Oct 01, 2015", "userURL": "http://www.goodreads.com/user/show/3285792-jacquelyn-mitchard", "userReview": "How many times have I read this novel and felt the weight of its somber message and its deep artistry? Six? Seven? And how many times have I visited the place where the ancient events happened, on a tiny, forbidding island off the coast of New Hampshire?"}, {"userName": "Sherry", "userReviewDate": "Aug 20, 2007", "userURL": "http://www.goodreads.com/user/show/100215-sherry", "userReview": "22. \"On a small island off the New Hampshire coast in 1873, two women were brutally murdered by an unknown assailant. A third woman survived the attack, hiding in a sea cave until dawn. More than a century later, a photographer, Jean, comes to the island to shoot a photo-essay about the legendary crime. Immersing herself in accounts of the lives of the fishermen's wives who were its victims, she becomes obsessed with the barrenness of these women's days: the ardor-killing labor, the long stretches of loneliness, the maddening relentless winds that threatened to scour them off the rocky island. How could a marriage survive those privations? Was this misery connected to the killings? Jean's marriage is enduring heavy weather of its own. On the boat she has chartered for this project, she and her husband are falling apart. Their nights are full of drink and terrible silences, and Jean feels jealousy and distrust invading her life and her work. The forces that blasted the island a century earlier come alive inside Jean, bringing her to the verge of actions she never dreamed herself capable of - with no idea whether her choices will destroy all she has ever valued or bring her safely home.\"I found this book hard to read, it jumps suddenly from first person story in the present day to telling the story of two women who were murdered in the 1800's. I didn't think there was anything remarkable about this book."}, {"userName": "Connie", "userReviewDate": "Jun 30, 2013", "userURL": "http://www.goodreads.com/user/show/4146473-connie", "userReview": "Shreve is a lyrical storyteller, but this one did not come together for me as much as some. I loved the idea of the old murder mystery, combined with the present day...but felt little attachment to the characters of the present.  I will say, I figured out the twist in the past story, but did not see the present day twist coming...kind of blindsided me. She paints a beautiful picture of her settings and I was transported to a different and harsh time. A rather sad story overall."}, {"userName": "Elizabeth", "userReviewDate": "Jan 22, 2013", "userURL": "http://www.goodreads.com/user/show/2440901-elizabeth", "userReview": "Ugh. This book intertwines two stories. One is the murder of two women and happens in a previous century. The other is about a photographer sent to where the women were killed to take pictures for a magazine assignment. The older story works well and I even liked the weird way the author intertwines the two stories where one flows into the next with only a paragraph break. The problem is that the more contemporary story falls completely apart at the end. There's a build up full of the photographer's regrets and if only's but I don't see how anything she did caused what happened in the end. *Spoiler* The photographer, her husband, her 5-year old daughter, her brother-in-law and his girlfriend are on a sailboat and a storm comes up before they can move to a safer harbor. The daughter has been strapped into a life jacket and has been sent to stay in one of the cabins with the girlfriend who is feeling ill. The photographer is holding on to the steering wheel trying to keep the boat pointed towards the waves. Her husband and brother-in-law are trying to control the sails and batten things down. The girlfriend comes up on deck without a life jacket so she can be sick over the side of the bed. The photographer thinks this is a very dangerous thing to do and tries to yell to the girlfriend. Just as the girlfriend lifts her head, the sail swings over and knocks her overboard. Her husband rescues the girlfriend (I have no idea how). Meanwhile the little girl has disappeared. So somehow, the photographer thinks she's responsible for her daughter's death because she suspected her husband of having an affair with the girlfriend(?). I can see she'd think herself responsible for her daughter's death because she didn't save her daughter or even realize her daughter was in danger but none of that has anything to do with whether her husband was having an affair. I can't see how she could expect herself to have acted differently toward the girlfriend if she didn't think there was an affair going on. Would she have left the girlfriend to be washed overboard by a wave or tipped off the boat as it rocks sideways if she thought only pure things about the girlfriend? Would she have abandoned the wheel to go find her daughter leaving everyone in danger of being capsized because the boat would have been in line with the waves? And if she's so illogical as to be full of regrets for thinkiong of the affair and truly feels responsible, then how is she living a productive life? How is she not completely overwhelmed with depression and self-loathing? How could she later meet the woman she thought was her husband's lover and try to be pleasant and casual?"}, {"userName": "Molly", "userReviewDate": "May 17, 2012", "userURL": "http://www.goodreads.com/user/show/4135485-molly", "userReview": "I have always regarded Shreve as a \"borderline junk novel\" writer. Her storylines are engaging, always containing an element of juicy scandal, but her writing style is not accomplished. There are some authors whose prose alone can make you pause in astonishment. Shreve is not one of those writers. In this novel, however, her sparse narrative blends seemlessly with the world that it describes. The novel takes place on and around the island of Smuttynose, off the coast of Portsmouth, New Hampshire (although technically belonging to Maine), a barren, rocky piece of land, inhospitable in the extreme. Today, it is uninhabited, but 150 or so years ago, there was a small colony of fishermen who lived on the island with their families. In 1873, such a family inhabited a house on the island - John Hontvedt, his wife, Maren, Maren's siblings, Karen and Evan, Evan's wife Anethe, and a couple sundry boarders. One night, when the men were at sea, someone entered the house and brutally murdered Karen and Anethe. Maren escaped, and hid in a sea cave in the bitter cold, until dawn. One of the boarders, Louis Wagner, was tried, convicted, and hanged for the murders. This much is historical fact. Rumors have persisted throughout the years, however, of Wagner's guilt. The true murderer may not yet be known. This is the premise of The Weight of Water.The novel flips back and forth in time, moving from Maren and her family to a family in the present day. Jean is a photographer, hired to do a photo shoot for an article about the Smuttynose murders. She, her husband, Thomas, and their daughter, Billie, venture to the island with Thomas' brother Rich, and Rich's girlfriend, Adaline. They are staying on Rich's boat, thus are in constant close quarters, made particularly uncomfortable by the obvious attraction between Thomas and Adaline. The stories progress in parallel, with Jean's story approaching a tragedy (which she mentions on the first page, though we remain ignorant of its nature until the end), and Maren's story approaching the murders and Shreve's invented solution of the question of who the true murderer was. The climax is shocking. I was convinced throughout the book that I knew what Jean's tragedy would be, but I was wrong. This book was effective and intriguing, with just the right amount of scandal and surprise. Definitely recommended."}, {"userName": "Carla", "userReviewDate": "Apr 24, 2010", "userURL": "http://www.goodreads.com/user/show/3239322-carla", "userReview": "Maybe it is just me but I had a difficult time with this book on an ethical basis. Two stories within a story. One in current time the other based on an actual event that occurred in 1873 on Smuttynose Island. Shreve offers the reader her own alternate theory of what happened in 1873 through one of her fictional characters removing a ficitional diary of the sole survivor (real person)from the archive of a library. We, the reader, learn the truth about the murders through this discovered diary. My problem is that Shreve's \"theory\" about the truth of the murders implicates a factual person in a very realistic way. True, this happened over a hundred years ago, but I must say if this were one of my relatives I would not be happy with Shreve's artistic license."}, {"userName": "Asghar Abbas", "userReviewDate": "Aug 24, 2015", "userURL": "http://www.goodreads.com/user/show/37421322-asghar-abbas", "userReview": "A true watery dirge. Harrowing and ultimately haunting."}, {"userName": "Barbara Poore", "userReviewDate": "Oct 12, 2009", "userURL": "http://www.goodreads.com/user/show/1714042-barbara-poore", "userReview": "My friend lent this to me while traveling in Spain since my other books were stolen. I doubt that I would have picked it up on my own. The double story of a woman who travels to an island off Portsmouth NH (Smuttynose--there is a present day brewery of that name in Portsmouth--who knew?) to research the 19c murder of two women on the island, interspersed with the story of the murders by one of the survivors. The present day story seems poorly grounded....what magazine would pay a photographer to do a pictorial on a bleak island where no remnants of the crime remain? Wouldnt they at least hire a writer? She stumbles upon an account of the murders in a mainland library and then steals the diary. If someone else were writing up the murders wouldn't she share the diary with him/her? She travels with her family, including her young child, on a sailboat. Does not seem like a logical work assignment to me......The 19c woman's diary makes for tedious reading--interesting at first, but the tragic ending (and not to give anything away, there are tragic endings for both narratives) is telegraphed quite early..... Something to read if there isn't anything else."}, {"userName": "C", "userReviewDate": "Mar 30, 2009", "userURL": "http://www.goodreads.com/user/show/1218675-c", "userReview": "This book may be best summed up as a summer read, chick lit guiltily knotted into historical fiction. Anita Shreve binds together the gristly 19th c. murders at Smuttynose, a small island off the coast of New Hampshire, with the slow keening of a contemporary marriage. As a child I grew up sailing and anchoring off the Isles of Shoals, listening to tales of the pirate Bluebeard, treasure and murder; swimming in the deep black waters; and exploring Smuttynose and the Haley house (of which I'm a descendant). So I found the details of the harsh life at the Shoals fascinating and probably more engaging than if I had just stumbled upon this book without knowing the setting. The Weight of Water is at once layered and overt - there really aren't any surprises. Yet the weaving of past and present, the setting, and the characters are engaging."}, {"userName": "Mary", "userReviewDate": "Aug 03, 2015", "userURL": "http://www.goodreads.com/user/show/11538764-mary", "userReview": "Love Anita Shreve.Read this for my circle group, luckily it was one of hers I hadn't read.I loved the way the modern and real life events of 1873 are interwoven.It's a chilling novel but I was soon engrossed.The descriptions of the harsh conditions and climate left you feeling chilled!Beautifully written and very compelling.Had me up late last night to finish!"}, {"userName": "Lisa Ruminski", "userReviewDate": "Jun 10, 2011", "userURL": "http://www.goodreads.com/user/show/5582741-lisa-ruminski", "userReview": "I found the converging stories in this novel fascinating. The movie adaptation is also worth watching."}, {"userName": "AngryGreyCat", "userReviewDate": "Sep 23, 2017", "userURL": "http://www.goodreads.com/user/show/13236257-angrygreycat", "userReview": "The Weight of Water by Anita Shreve was a library book sale find for me. The story surrounds a journalist/photographer, who is on a small boat, with her husband, young child, brother-in-law and his girlfriend. The trip is to visit an island off the coast of Maine where a horrible domestic crime had occurred years before, get some pictures and do some research. It sounds simple enough.As Jean, the journalist’s, research into the ill-fated family are appearing in her own family, trapped as they are on the small boat in close quarters with one another. Her husband the poet, whose glory days are gone, he can no longer write. The younger brother, captain of the small craft, in love with a woman who doesn’t love him. And Adaline, somewhat of a beautiful enigma, set between the two brothers. The approaching storm is a catalyst for a modern-day tragedy.Anita Shreve’s writes these family dramas with a great voice and characterization. She is able to open a window to give the reader a view into another family’s world, at least that is what it feels like. I just always find myself frustrated with some of the choices her characters make. They always seem to be these women who make choices that are bad, just bad, let’s leave it at that. I don’t want to say anything else because it will give away too much of the story. Very good writing for fans of women’s fiction."}, {"userName": "BlondeVsBooks", "userReviewDate": "May 11, 2018", "userURL": "http://www.goodreads.com/user/show/56380128-blondevsbooks", "userReview": "The Weight of Water: Ax Murder, Best Selling Novel, & Tourist Attraction\nCLICK HERE for BlondeVsBooks full review and details about the true crime\nJean Janes is researching the Smuttynose Murders. Bringing along her husband and daughter, she charters her brother-in-law’s boat to take photos and get a feel for the island. She pulls letters, journals, and information about the trial which are archived in the historic city of Portsmouth. Jean steadily unravels the story leading up to the murders, as well as the suspecting infidelity of her husband.Woven into the plot is Maren’s first-hand story. She describes the passage to the Isles of Shoals, the isolated lifestyle on Smuttynose Island, and finally the gruesome murders.The Weight of Water is eloquently written, tying together the stories of Jean and Maren with fluidity. Historical factoids and fictional elements are gracefully entwined throughout. The Smuttynose Murders actually happened, but Shreve’s version adds fictional aspects. For instance, the Hontvet’s were originally from Boston but in the story they immigrated from Norway."}, {"userName": "Craig Dube", "userReviewDate": "Nov 13, 2012", "userURL": "http://www.goodreads.com/user/show/5791632-craig-dube", "userReview": "A book selection from our Book Club group (and one that has long been recommended by my wife), I found that I was pleasantly surprised with this book and really enjoyed it. The backdrop for this story is a series of murders that took place on Smuttynose Island back in a 1873. Two Norwegian women were brutally murdered while a third woman escaped by spending a frozen March night in a nearby sea cave. Living near Portsmouth NH, this is one of the more notorious murders and one that carries some controversy (there is some question regarding the guilt of the man they tried and executed for the murders). Although I must admit that before reading this book, I had little knowledge about this case.This story is told in two voices. One being, Jean a writer/photographer who is on assignment to take some photos of Smuttynose and the site of the murders. Jean's story is a mix of her time spent on assignment with facts about the event and subsequent trial. Jean becomes increasingly interested in learning more about these murders and finds an old forgotten diary from the surviving woman on the island, Maren. It is with this diary that the second voice is heard. The diary is written long after the events on Smuttynose, after Maren has returned to Norway and is in the final days of her life. The diary recounts the history of Maren; her marriage and relocation to Smuttynose; the struggles of her new life and her recounting of the events the night of the murders. The diary gives you a real feel for Maren as an individual and especially what life must have been like for a lonely, foreign fisherman's wife on such a desolate island.As Jean is learning the story of these murders through the diary, she is also experiencing a crisis of her own. For this assignment, Jean along with her husband (Thomas) and daughter (Billie) decide to stay with Thomas' brother Rich and Rich's girlfriend Adaline on their small boat in Portsmouth Harbor. Jean begins to suspect that Thomas and Adaline may be involved in an affair and a palpable sense of tension ensues. The tension climaxes as a storm hits and the five are caught out on the open water in rough seas. Both stories end in ways that were not entirely expected. Both stories have a forlorn quality of loneliness, particularly haunting given that the loneliness these women feel are a result of the marriage and circumstances. I found both stories interesting and while there are some clear parallels between the two, the author isn't so explicit drawing those comparisons. Each story could likely stand on its own, but the combination and interweaving of the two tales, makes this book particularly interesting."}, {"userName": "Kirsty Darbyshire", "userReviewDate": "Dec 07, 2010", "userURL": "http://www.goodreads.com/user/show/4631512-kirsty-darbyshire", "userReview": "After reading the hefty and only half good Fortune's Rocks I wanted to read some more of Shreve so I picked the slimmest volume in the bookshop hoping that she could write more consistently compellingly in a shorter work. And I got what I wanted - this book would have been unputdownable if I hadn't have had so much to do. I woke up before my alarm this morning and before I got a chance to decide whether I really ought to try and get a little more sleep my head had decided I needed to finish this book off.There are two stories intertwined here. There is a modern day story told in the first person by a photographer visiting the Isles of Shoals off the coast of New Hampshire. She is photographing the islands where a double murder took place in 1873 and is staying on a boat with her husband, her young daughter, her brother-in-law and his girlfriend and we see the often tetchy interaction between them in the close quarters. The second story is told in the first person by the only survivor of the nineteenth century double murder. This is in the form of a lost manuscript that the photographer finds during her research.Shreve does a decent job of writing suspense here though the technique of switching stories and including a disjointed fragment of the older story at every point of tension in the modern day story began to get wearing after a while. The more measured voice of the nineteenth century woman does counter the sometimes hysterical tone of the modern day woman and the hysterical tone isn't a bad thing, it's a very good portrayal of someone who isn't quite certain what's going on around her and sometimes can't cope with her own thoughts.Something I have a bit of a problem with is that the nineteenth century murder is a real crime. Two Norwegian immigrant women really did die by the axe on Smutty Nose Island and Louis Wagner was hanged for the crime. Maren Hondvedt who narrates the story was a real person. Shreve weaves her fictional story through the real court testimony and comes up with a different interpretation of events. I find this all a bit chilling. Not really knowing where the line between reality and fiction is drawn leaves me a bit ambivalent about the book. It's an excellent story but I wish, somewhat ridiculously, that it all came from the author's imagination."}, {"userName": "Beth", "userReviewDate": "Mar 07, 2012", "userURL": "http://www.goodreads.com/user/show/4705693-beth", "userReview": "In The Weight of Water, Anita Shreve tells a story of pain, jealousy, and passion. Her characters and their closest relationships--with siblings, with partners--are trapped in isolated and claustrophobic spaces. Shreve tells the story of the murders of two Norwegian immigrant women on Smuttynose Island off the coast of New Hampshire in the late 19th century. She explores the 19th Century events in the context of a contemporary photographer's trip to the island to capture the location for a magazine story about the killings. The photographer travels to the island in a small sailboat with her husband, daughter, brother-in-law and his girlfriend. In the course of her research for the photo-shoot, she happens upon a previously unknown document, a letter from the one woman in the family who survived the killings. Shreve alternates sections of this letter, which describes what led up to the murders and what happened on the night they occurred, with the main structure of the book which moves fluidly between the interactions among the family of the photographer and the details of the history of the murder as it was revealed in the trial. In this way, Shreve allows the painful unfolding of events in the two different eras to play out alongside one another.The book is well-written, with effective pacing and moving detail, but the writing is not, in the end, remarkable. I enjoyed the book, I'm glad to have read it and would recommend it, but it never took my breath away. If three and a half stars were an option, that would be my true rating."}, {"userName": "Lorrie", "userReviewDate": "Jul 11, 2012", "userURL": "http://www.goodreads.com/user/show/5142243-lorrie", "userReview": "Oh, man, I'm torn, twisted, seasick, I think, after finishing this book. Two different stories were going on and Shreves had me going back and forth and back and forth till at the end my dinner was coming back up in my throat. Even though I picked this book up and read about 15 pages a couple weeks ago, I finally then read the entire book in one day. I could not put it down! It was totally absorbing and slightly sickening but very good! I want to give it 5 stars but can only give it 4 since it made me so sick. Maren, Evan, Karen, and their pilgrimage to Smuttynose Island, off the coast of Maine, was just disheartening. How these people, especially Maren & John, lived as they did is beyond my imagination....and for 4 years!!! Evan & Karen arrived only for the last year or so. Still......This story intertwined with the story of the photographer, Jean, her husband, Edward, and their daughter, Billie (Willemenia). Also Rich, Edward's brother, and his friend, Adeline, were saiing on a boat with Jean and her family while she was visiting the Shoal Islands to photograph the murder of the 1800s on Smuttynose Island. Shreve is brilliant. What a gift!! How does she do it? She, as I said, intertwines two stories so well......and at the end, there is the mention of Honora, from her book \"Sea Glass\". We'll see if I change this score from a 4 to a 5 after I get my land legs back."}, {"userName": "Nadine Doolittle", "userReviewDate": "Oct 14, 2010", "userURL": "http://www.goodreads.com/user/show/2092741-nadine-doolittle", "userReview": "I was surprised when I finished this book to discover I kind of liked it when there are so many reasons not to. 1)The long and largely irrelevant passages about Maren's life in Norway. 2) The unexplained hostility between the two sisters (Maren and Karen--yikes--imagination where art thou?)3)The past story of the murders and the present tale of jealousy went off the rails at the critical moment. Frankly, the whole narrative from the past didn't hang together very well.4)The cliched moody drunk poet husband pining for his dead girlfriend of 30 years ago. No one wants this guy, stop inflicting him on us. 5) The protag, Jean is not very bright and quite self-absorbed. She makes stupid, impulsive choices but I have no clue why.6) The child is supposed to be 5 but she seems closer to 2 or 3 to me. A small thing but it kind of bothered me. 7) There didn't seem to be a reason for anything that happened on that boat. A lack of common sense must be privilege of the upper middle class. I liked it though because of the setting, the boat, the tension Shreve built when she wasn't boring me with detail on Norwegian life. And I suppose because Jean was so flawed. Her paranoia and obsession with Adaline were compelling to watch. Painful. It was that lack of common sense, the stupid complusive choices that change our lives forever that Shreve was exploring and even if it had bumpy moments, over all I thought she pulled it off."}, {"userName": "Antof9", "userReviewDate": "Dec 31, 2008", "userURL": "http://www.goodreads.com/user/show/1717549-antof9", "userReview": "It's very rare that a book -- especially a standard-issue novel -- sends me to the dictionary. This one did not once, but twice, and early in the book. Although I've heard both words many times, and knew in general what they meant, I felt compelled to look up their real meanings, given the sentences they fell in. The sentences, with the words in italics below:\"The island is not barren, but it is sere and bleak.\"\"The Isles of Shoals, an archipelago, lie in the Atlantic, ten miles southeast off the New Hampshire coast at Portsmouth.\"Another quote that stuck out to me -- not a new expression, but a good interpretation, and also something indicative of the immigrant experience: \"I have found, in the course of my adult life, that the best cure for melancholy is industry.\"I don't have much to say about this book -- it was very interesting, but also pretty depressing. I think this is only my second Shreve book, but she seems to be overly preoccupied with extramarital affairs. I'd like to see her pick a new topic, or not write about marriage at all. She's such a good writer that her books are intriguing, regardless of the subject matter, but wow, they're depressing. I'm trying to think of anything redemptive in this book, and don't think it exists. The descriptions of a part of the country I'm unfamiliar with were very interesting, though."}, {"userName": "Jeanette Grant-Thomson", "userReviewDate": "Sep 03, 2016", "userURL": "http://www.goodreads.com/user/show/49586099-jeanette-grant-thomson", "userReview": "Make it three and a half stars. I consider this one of Shreve's better books although I find the subjects off-putting.Jean, a photo-journalist, travels with her family to investigate the rumours that persist over the murders more than a century ago on the island of Smuttynose in the Isles of Shoals. Collecting material from a library, she finds the translated memoirs of Maren Honvet, the woman who escaped after the murders of her sister and sister-in-law.Two stories are told, interwoven often without any space or indication that the subject is changing, except for the tense. Thus the grim, gruesome tale of the murders colours the present tense story, and the present tense characters live in the shadow of great horror. Unlike many parallel narratives, this has no direct connection between the two stories except atmospherically, emotionally in parts and . . .(won't spoil).Various other tragedies that occurred at Smuttynose are sprinkled through the present story, often in one or two lines, all adding to the effect of grimness and perhaps even cursedness.The brooding atmosphere of the place adds to the overall impact of horror, things gone terribly wrong.A bit too grim for my taste."}, {"userName": "Michelle Powers", "userReviewDate": "Mar 01, 2008", "userURL": "http://www.goodreads.com/user/show/424105-michelle-powers", "userReview": "One of those novels that is 2 stories in one. A contemporary story of a woman, her husband and daughter, sailing with his brother and the brother's girlfriend off the coast of New Hampshire and Maine so she can photograph the scene of a murder that took place 150 years earlier. The tension of the people on the boat is revealed right away. And then through trial transcripts and a memoir that has never been found before, the story of Norwegian immigrants who settled on this islands off the coast. While the men were fishing and couldn't get home one night, two of the women in the house were murdered with an ax, one is found the next morning hiding in a cave. (The house is the only one on the island.) Those who work in archives or libraries will appreciate how I shuddered as the main character stole a file from an unorganized archival collection--the file which contains the truth about the murders. The story is not very surprising and the ending while not predictable is not shocking. The language and storytelling is very smooth and sort of carries the reader along very easily. I enjoyed the exploration of emotion between the characters in the contemporary story."}, {"userName": "Sharon", "userReviewDate": "Jun 04, 2012", "userURL": "http://www.goodreads.com/user/show/2640326-sharon", "userReview": "This novel is really two stories in one. First there is the story of Norwegian immigrants coming to America, and secondly we have the contemporary story of a photographer going to the island where the immigrants lived to photograph and research a 100 year old murder. A murder of two women took place over 100 years ago on the island of Smutty Nose in the Isles of Shoals. Maren Hanvent moves to this very remote, sparse island with her fisherman husband. They are followed by her sister and brother with his wife, living lives full of hardship off the coast of Maine. One hundred years later, Jean does a photography shoot of the island traveling with her husband, Thomas, daughter and her husband's brother and girlfriend. Jean is jealous of Thomas's attention to the girlfriend, who has all Thomas's poetry memorized and recites lines back and forth with him. The characters are not very likeable, but it did not really detract from the story. There are interesting similarities in both storylines, which would make this a great novel to discuss in a book club."}, {"userName": "Bookfanatic", "userReviewDate": "Nov 02, 2015", "userURL": "http://www.goodreads.com/user/show/4398710-bookfanatic", "userReview": "This novel and Shreve's other book, \"The Last Time They Met\" are intertwined. The hero and his spouse appear in both novels. If it were me, I'd read \"The Weight of Water\" first. It explains the shocking ending of \"The Last Time They Met.\" You don't have to read \"The Last Time They Met\" to realize the full impact of this story. Like so many of Anita Shreve's works, this one is very emotional. She has a way of ending a book in such a way you're left thinking about it days later. This isn't light summer reading for the beach. She explores how jealousy and misunderstanding can lead a person to do unthinkable things that forever shape their lives and lives of others in tragic ways."}, {"userName": "Silvana (Por detrás das Palavras)", "userReviewDate": "Apr 27, 2015", "userURL": "http://www.goodreads.com/user/show/10311832-silvana-por-detr-s-das-palavras", "userReview": "Este foi mais um livro que li no âmbito do projeto conjunto que tenho com a Denise do blog Quando se abre um livro. Um dos motivos pelos quais a Denise me enviou este livro era possibilitar-me fazer \"as pazes\" com esta autora. E, em parte, conseguiu! Consegui gostar mais deste livro que que aquele que li anteriormente.A ilha dos desencontros apresenta-nos duas histórias em dois momentos temporais distintos. Um no passado e outro no presente. No início, a forma que a autora escolheu para integrar partes da história passada no momento presente é muito confusa. Como não deixa nenhum separação física, nem nenhuma outra indicação, quando dava por mim já estava na parte da história do passado em Jean narrava situações do crime que marcou aquelas ilhas há muitos anos atrás, e que ela estava a investigar. Focando-me no presente e na história de Jean e todos aqueles que faziam parte do seu círculo, tenho a dizer que em alguns aspetos a história é pouco clara. Penso que tal se deveu ao facto de a autora querer que as coisas fossem indutivas para o leitor, mas comigo não funcionou muito bem. Esta forma usada pela autora, o leitor acede a poucas informações, não nos é dado muito sobre as características e modos de vida das personagens. Fica sempre no ar um clima de dúvida e mistério, que me deixava sempre com mil e uma hipóteses na cabeça. Se houve momentos que até gostei, por outro lado existiram outros que me deixaram um pouco frustrada e desiludida. Essa desilusão foi maior com o final do livro, no desfecho da história de vida de Jean. Paralelamente à história de Jean, temos a história de Maren. Maren é uma mulher norueguesa que depois do casamento parte com o marido para os EUA. Tal como a parte que descrevi anteriormente, esta é também muito intuitiva, mas possuiu mais mistério. Desde cedo que desconfiei quem era o/a responsável pelas mortes das mulheres, porém os motivos são mais difíceis de identificar. Achei a Maren uma mulher estranha e com uns padrões relacionais também eles estranhos. Não simpatizei com ela, e nem sei bem o porquê. Aqui não senti tanto a falta de uma narrativa tão desenvolvida, porém, no final precisava de alguns dados que me permitissem saber como é que a Maren, o Evan e John terminaram daquela forma. Outro aspeto que fiquei sem entender foi qual a relação entre os dois momentos da narrativa. Era só uma questão de investigação? O que é aproxima estas duas histórias??? Dúvidas, dúvidas e mais dúvidas... Fiquei sem entender.Em conclusão, posso dizer que, em parte, fiz \"as pazes\" com a autora uma vez que gostei mais de ler este livro o que acabou por me deixar o sentimento de querer ler mais algum livro dela. Sentimento que não surgiu quando li o primeiro livro. Obrigada pelo empréstimo, Denise!"}, {"userName": "Christine", "userReviewDate": "Oct 07, 2014", "userURL": "http://www.goodreads.com/user/show/9951095-christine", "userReview": "After reading this, nothing was left of my energy to write a review so I'm writing it just now. It was okay overall since it is averaged but between the two stories involved (SPOILER) I like the \"now\" story more. Every time the Isles of Shoals is brought up and because I don't live in the West nor I've seen it in a picture or read of it in a book prior, I can only imagine isles of rock not worthy to be a place to live in. Charcoal color, gray to black stones, shading style in drawing, dark blue waves, stormy weather, dark atmosphere, cold, harsh, unforgiving. Why would you even go there?? I was enveloped in a depressive mood the whole time I'm reading this book. x___x And I don't want to remember how this book made me feel and all those things I've imagined Thomas and Adaline is doing in the yacht and this thing between the brother-in-law and what happened to sweet Billy. I can't understand why they decided to be married.. or am I just still too young to understand why. Stories like this shatters my mental image of why people enter into marriage. /dead/ It's important right? You should marry the only person you love and no other reason satisfies. Lol my beliefs. Shite. Since reading this book, I like to put on e in shit now like bullshite. Lol. I don't think I'll try to read this book the second time. Why? Because it's so harsh like 'seeps the sunshine left inside of me' kind of harsh. The past event isn't the branding type but the \"now\". It was the happening now part that kills me because they don't love each other. They're just there but they're not in love anymore. Depressive shite. x___x I cannot remember how it ended actually but the feelings I felt. Every time I'll see this book, it will somehow emanate some gray smoky aura.. gloomy."}], "description": "Librarian's note: An alternate cover edition can be found hereA newspaper photographer, Jean, researches the lurid and sensational ax murder of two women in 1873 as an editorial tie-in with a brutal modern double murder. (Can you guess which one?) She discovers a cache of papers that appear to give an account of the murders by an eyewitness. The plot weaves between the narrative of the eyewitness and Jean's private struggle with jealousies and suspicions as her marriage teeters. A rich, textured novel.", "title": "The Weight of Water", "url": "https://www.goodreads.com/book/show/228534.The_Weight_of_Water", "average": 3.63, "cover": "https://images.gr-assets.com/books/1327936566l/228534.jpg", "reviews": 1551, "authors": [{"url": "https://www.goodreads.com/author/show/3530.Anita_Shreve", "name": "Anita Shreve"}], "type": ["Fiction", "Historical", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/228534.The_Weight_of_Water", "http://www.goodreads.com/book/show/984596.The_Weight_of_Water", "http://www.goodreads.com/book/show/8150339-the-weight-of-water", "http://www.goodreads.com/book/show/1061976.The_Weight_of_Water", "http://www.goodreads.com/book/show/828717.The_Weight_Of_Water", "http://www.goodreads.com/book/show/11812810-a-ilha-dos-desencontros", "http://www.goodreads.com/book/show/5191.The_Pilot_s_Wife", "http://www.goodreads.com/book/show/89399.Fortune_s_Rocks", "http://www.goodreads.com/book/show/14965.Light_on_Snow", "http://www.goodreads.com/book/show/3121162-testimony", "http://www.goodreads.com/book/show/96081.Sea_Glass", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}