{"ratings": 714, "userreviews": [{"userName": "Vonia", "userReviewDate": "Oct 23, 2013", "userURL": "http://www.goodreads.com/user/show/5204784-vonia", "userReview": "Daniel Wallace undoubtedly has a great imagination. His stories are written like sophisticated fairytales; more complex and therefore more meaningful, engaging, and rewarding. The Watermelon King takes place in the same city Big Fish was, Wallace’s best known work, mostly due to the phenomenal motion picture version. Ashland, Alabama is best known for its Watermelons. At least historically. Once upon a time. Before our protagonist’s mother, Lucy Rider, came into town, with an open mind. Something the Southerners happen to find appalling. Why change their traditions? How dare some stranger come and open their minds to new ideas? They like the way things are. I really liked how the novel was divided into two parts; how this division was done- ingeniously interweaving the two points of view (Ashland’s citizens and Thomas’s). **** Spoilers **** At first, all of them find Lucy’s personality magnetic. They fall in love with her, each for their own reasons. The women find her mesmerizingly different; a new friend and new fun. The men, of course, cannot turn a blind eye to her unparalleled beauty. Lucy returns their affections. She has this way of making each one of them feel as if she has chosen them as her favorite. Even the town retard finds his way into her heart. In fact, some say he most of all. When she discovers Iggy’s illegitimacy, she spends hours of her day teaching him how to read. Everything is great until Lucy finds out the traditional of all traditions, the one that ensures the growth of watermelon in Ashland. Every year, at The Watermelon Festival, the oldest and most loved tradition in all of Ashland, the oldest virgin in the city is paraded in ceremony and the forced to consummate with one of three selected Queens. Finding this understandably cruel and wrong, Lucy claims that she has evidence that Iggy is not The Watermelon King; she was the one who took his virginity. Due to Iggy’s ugliness and retardation, she is hardly believed, but the rules state that they must wait it out for evidence of her claims. Or evidence to the contrary. The Watermelon Festival but two weeks later, there is no festival that year. That year, the watermelons suffer. And all of a sudden, all of Ashland turns against her. Nine months later, her baby is born. She manages to have a friend, Anna, rescue her son by surreptitiously taking him out of town to her father’s. Even more appalled by Lucy’s actions, she is shunned. In every way, this is the end of her. The rescued baby is Thomas. Thomas Rider. His story is examined in the second part of the novel. His family, as far as he is concerned, is Anna and his grandfather. Thomas’s grandfather is a pathological liar (maybe by choice), creating fictional answering for everything from mundane questions to those more serious like Thomas’s beginnings and in his career as a real estate agent. He is the top selling agent around, almost entirely due to the stories he tells his clients regarding previous tenants, in order to have them believe that they would be able to, for example, channel the spirits of the deceased or be able to strike it rich from oil on the land. In this way, his grandiose stories serve as a vessel for Wallace’s imagination. When Thomas is of age, with Anna’s blessing, he returns to his birthplace and begins the process of finding himself, finding out who he is. After learning the story of his mother from various sources, he is told that The Watermelon Festival can begin again, now that he has returned; they always knew he would, that it was only a matter of time. As a virgin, he, of course, is to be The Watermelon King. Although he is aware he can simply leave town, something compels him to stay; to see it all out and let his destiny unfold. As is not always the case, I found the ending well orchestrated. Iggy’s sacrifice, paying his debt to Lucy, was not a good thing, but inevitable in a way. Thomas finally begins to fall in love- also, fittingly, with a young Lucy named after none other than his mother. Like the princess and her prince riding into the sunset, the two of them escape the clutches of Ashland under the cover and distraction of the fire Iggy started. The End."}, {"userName": "Lily Tice", "userReviewDate": "Jul 10, 2017", "userURL": "http://www.goodreads.com/user/show/13867913-lily-tice", "userReview": "DNF. I got about 40% in and just can't bring myself to finish it. I think this story had a lot of potential, has some interesting language, and I'm generally accepting of slow-burners, but this just didn't move fast enough for my taste or have gripping enough characters to sell me, even close to the halfway point of the book. I picked this book up because I'm a huge fan of Big Fish (both the book and movie), and because I loved/still love the cover design of my edition. Watermelon cults and magical realism? Yes please. I liked the premise, I just think the novel format wasn't the right home for it, in my opinion. This would be an excellent short story, with just a few (or even one) narrator in the vein of Faulkner's \"A Rose for Emily\" or Shirley Jackson's \"The Lottery\". As a short story, I think this would make a chilling literary piece that could be picked apart in a higher education lit class like the best of them. But as a whole novel? I'm personally not convinced. I'm still open to experimenting with Wallace's other work, and still love the masterpiece that is Big Fish, but for now I'll accept this book as \"not for me,\" and that's okay."}, {"userName": "MB Shakespeare", "userReviewDate": "Mar 18, 2018", "userURL": "http://www.goodreads.com/user/show/78667658-mb-shakespeare", "userReview": "An 18 year old returns to his birthplace to learn of the mother he never knew.Fave quotes: \"There is so much for them in the world and yet they refuse to see it…because they're small-minded. Because they come from small towns….people from small towns have small minds, small hearts and a small vision. Most of them anyway. There are exceptions. Some of the ones who get out are okay, but for the most, there's just no hope for them.\""}, {"userName": "Hannah N", "userReviewDate": "Jan 14, 2018", "userURL": "http://www.goodreads.com/user/show/40006334-hannah-n", "userReview": "Sometimes you read a book and think, \"what in the world did I just read?\". The way that the novel was put together led to a lack of cohesion and made it feel like two separate stories. The book wasn't bad it just wasn't ordered in a way that benefited the plot."}, {"userName": "Katlyn", "userReviewDate": "Jun 25, 2017", "userURL": "http://www.goodreads.com/user/show/2564683-katlyn", "userReview": "Colorful and creative. A fast read."}, {"userName": "Jessica", "userReviewDate": "Dec 28, 2012", "userURL": "http://www.goodreads.com/user/show/801515-jessica", "userReview": "My CurledUp review: While the city of Ashland, Alabama, exists in the real world (it is seat of Clay County with a 2000 census population of 1,965), Daniel Wallace has been fictionalizing it and its people since his first novel, Big Fish. Providing as much a sense of place and background as William Faulkner’s Yoknapatawpha County, Ashland is a small-town suburb of Birmingham, Alabama, where folks either get out or die trying. In Wallace’s third and most recent novel, The Watermelon King, readers are invited back to Ashland for a new adventure of mythological proportion.Divided into four distinct sections, The Watermelon King begins with our hero, eighteen-year-old Thomas Rider, setting out on the ultimate quest in search of the details of the life and death of his mother, Lucy, in the hopes that he will find out who she was and who he is. While not a terribly original premise, one mustn’t be discouraged. Wallace is becoming a master of modern-day mythology, and while the novel is a journey of discovery, there is plenty of symbolism and diversion to maintain one’s interest.Thomas’ voice appears at first as an almost omniscient Greek chorus where our only real knowledge of him is as the recorder of each townsperson’s story. From the local innkeeper, realtor, festival committee chair, carpenter, and pharmacist to the town widow, negro, and idiot, the majority of the town’s and Lucy’s past as well as Thomas’ beginning is discovered, and the varied personalities are established.Part Two brings the reader reminisces of Thomas’ childhood and is most like Big Fish, relying on the father/son (or in this case the grandfather/grandson) bond and on oral storytelling traditions. Some of the interactions between Thomas and his grandfather parallel imagery and symbolism in Wallace’s previous novels including Thomas’ grandfather’s tendency to stretch the truth a bit and a story about Thomas’ ability to communicate with the natural world and an extraordinary comfort level underwater. Wallace also details visits to a neighbor who traditionally gives Thomas a lucky dime as a Christmas gift, which shadows a different grandfather’s lucky penny found in Wallace’s second novel, Ray in Reverse. Both parallels serve as foundations in Wallace’s carefully constructed town of Ashland, where lucky coins symbolize the willingness and innocence of a child’s trust and faith in his loved ones, while stories of people moving easily between the human world and the natural world mirror old Greek stories where mortals are sometimes given the ability to walk among the gods.As Thomas matures he begins to tire of his grandfather’s elaborate responses to every question Thomas asks about who he is and who his mother was. Thomas realizes, along with the reader, that although his grandfather has defined himself by his stories, it has also been his sole means of avoiding the bare truth. Thomas is forced to watch this tragic flaw become his grandfather’s demise: “Because he was not made out of flesh and blood: he was made up mostly of stories, a high-wire act of a life balanced on the suspension of disbelief, and as he became deprived of his stories he actually seemed to shrink.” Part Three thrusts the reader back into present-day Ashland, where the Watermelon Festival is getting under way. The festival, in which a virginal Watermelon King is chosen to sacrifice his virginity to ensure the fertility of the town’s soil and a healthy watermelon crop, bares resemblance to Shirley Jackson’s “The Lottery”. Followed by a plethora of folklore, mythology, and biblical symbolism, the reader is lead down the path towards surprising, albeit somewhat open-ended, conclusions. Wallace’s use of biblical symbolism as we watch Thomas, the prodigal son, turn into a savior - complete with a last supper - and symbolic crucifixion contrasts with the heavily weighted symbolic comparisons of Lucy as a Greek goddess or an otherworldly siren whose Electra complex causes a swift fall and return the harsh realities of mortality.Wallace’s multi-layered story unfolds as slowly and seamlessly as the petals of a flower and is immensely pleasurable to read. His foundation for Ashland is solidified in The Watermelon King, and fans of his work are surely looking forward to the next development in a world that is both recognizable and yet fantastic."}, {"userName": "Maria", "userReviewDate": "May 05, 2015", "userURL": "http://www.goodreads.com/user/show/2190427-maria", "userReview": "I'm not really sure where to start with this book. I did like it, overall, but it had some elements I didn't really care for. For one, there was that magical factor like what you always see in \"folksy\" movies, but I didn't feel like it really worked for this book. Maybe it was the lack of sparkles and harp music playing in the background, but I just couldn't really suspend my disbelief and get into it like I can in a movie. It's hard to swallow magic in a story that occurs in an otherwise realistic setting. At least give me some princesses and dragons.Then, there was the pace of Part 1. The idea of introducing the back story through various interviews was good, but the execution of it felt absolutely interminable. It was obvious from the first few pages what Part 1 was getting at between Lucy and Iggy, what everyone was going to say had happened between them, but everyone just kept dancing around and around it. Get to the point, already! I feel like if a storyteller wants to take their time getting through a story, then their foreshadowing should be subtle. This was like taking an anvil to the head and then having to wait in the ER for eight hours only for the doctor to come in and say, \"Well, it looks like you sustained blunt head trauma,\" and send you on your way.Part 2 was where I started to enjoy the story more. I found the majority of the characters totally unlikeable and was completely put off by the culture of the town, but the story picked up the pace and I was able to enjoy the writing style a lot more now that it didn't seem to be beating a dead horse. From here, there was one more skull-crushingly obvious episode of foreshadowing (namely, who would be the Queen), but the author made up for that with a plot twist that actually did come out of nowhere and shake up the earlier story. I absolutely did not see this anvil coming at me.I don't want to give away whether or not the town achieved its goal in the end, but I'll say that I'd hoped the revived festival would be a failure, simply because I didn't feel that the town deserved any better. The way they excessively scorned and mocked men for being virgins and women for being promiscuous, the way they behaved towards Iggy both before and after the Lucy business, the racism and gratuitous use of the \"N\" word (which in my opinion can't even be \"excused\" by the time period, since it was set in the 1980s, though it was backwoods Alabama, if that's worth anything, I guess), the horrible plotting as far as Lucy's baby... I wanted them to fail because their culture and attitude were awful. The part with the car, just before the ending note from Iggy, seemed like maybe the author was off his game a bit. Maybe it was just because the excitement was pretty much over, and I'd reached the part you find in most \"folksy\" stories where the author has to wrap things up in a nice pretty package and satisfy the folksy readers who want a happy ending. In a way, it was sort of nice that the book didn't leave me hanging, but at the same time, I feel like it could have gone from the previous chapter straight to Iggy's note, and any reader could've concluded what would happen afterwards. The business with the car making noises and what the noise could mean just didn't feel like it was taking me anywhere. If the noisiness of the car had anything to do with advancing the plot, then it was too subtle for me to pick it out of there. But I'll admit; once I feel like the story is concluded, if the book continues to go past that point, I tend to go into skim mode.I suppose there were actually more elements here that I disliked than elements I liked, but with some authors, I can find myself enjoying a book even while I hate nearly everything about it. This seems to be a recurring feeling among many books I've read lately. Hmm."}, {"userName": "Danielle Raub", "userReviewDate": "Jan 22, 2012", "userURL": "http://www.goodreads.com/user/show/3735872-danielle-raub", "userReview": "Nothing truly captures the American spirit like a down-home southern helping of watermelon with a side of virgin sacrifice. Daniel Wallace’s The Watermelon King revisits the fictional town of Ashland, Alabama, the setting for his novel Big Fish and seriously the most magical realism-charged town since Márquez's Macondo. If you’ve never read One Hundred Years of Solitude, shame on you. I hope ants carry you away and devour you. You probably don’t get that reference which only further proves the degree to which you suck. The novel unfolds by way of folklore, tall-tale, and myth; accounts told by a smattering of small town characters reliving the glory days of Ashland’s legendary Watermelon Festival. Thomas Rider returns to the town of his birthplace searching for answers about his origins, and specifically, information on his mother, Lucy Rider. Through interviews with a number of the town’s colorful characters, he learns the truth about his mother and her hand in the demise of Ashland, a once thriving and prosperous town, now dusty, dry, and balls-hot. Seriously, this place sounds hella-miserable.During the course of Thomas’s proverbial find-yourself-quest, he uncovers something extremely....interesting… about Ashland. Apparently, their crops depend on an odd, ritualistic fertility tradition that pretty much boils down to this:1. Pick virgin guy2. Gather a gaggle of single chicks3. Select the soon-to-be exploited single chick that best fits with the soon-to-be-exploited virgin guy4. Make them have sex in a fieldSeed is sown. And so comes a new prosperous year for Ashland and its inhabitants (Pun Count: 2)So, as you can probably discern, something goes horribly amiss with Lucy Rider and whatever happened has left Ashland, Alabama in a state of, “oh lawds, we used up all our virgins.” Verdict?There were a few turns of story that I wasn’t too sure of, one in particular that definitely threw me for a loop. I'm personally not so fond of this plot twist; it's really the only aspect of the novel that keeps me from loving it. Regardless, I promise it will be shocking at the very least. I'm pretty sure when I read it I said out loud, \"bitch wha?\"So overall, I liked The Watermelon King. Wallace manages to create a world saturated in magical realism, always teetering on the edge of the real and fantastic while interweaving the two effortlessly. Every character is a story-teller, constantly playing with the improbable; forming a tale that is poignant and original but not without an element of violence coupled with fear that can’t be shaken. By the way, those of you who have read Big Fish, or perhaps saw the movie; yes. The incredibly creepy swamp lady is still there, more fantastically, still alive, and just as charming as ever. Just consider yourself lucky if she doesn’t smash any watermelons at your feet because apparently that means you're the new Watermelon King. Or I guess you could consider yourself lucky since you'll likely be de-virginized sometime in the immediate future.You shall get laid! So it is, and so shall it be."}, {"userName": "Rebecca", "userReviewDate": "Jun 10, 2008", "userURL": "http://www.goodreads.com/user/show/1216058-rebecca", "userReview": "If I were to write one of those cheesy quotes for the front of books, my quote for The Watermelon King would be \"Storytelling as storytelling should be!\"I picked up this book thanks to a suggestion on Things Mean A Lot, a book blog I've been checking out lately. The blogger there had nothing but good things to say about Daniel Wallace's writing and storytelling ability. And with such a glowing review how could I resist?One of the actual cheesy quotes on the back of this book compared Wallace to Roald Dahl and I have to say I agree. I grew up reading Roald Dahl and loving the obvious imagination he put into his books. It's obvious Daniel Wallace has the same big imagination.The Watermelon King plays out in Ashland, Ala., the world's biggest watermelon patch. However, after the arrival of one Lucy Rider and her desire to stop the archaic practice of naming a watermelon king, the watermelons stopped growing in Ashland. See, the problem Lucy had with the town naming a watermelon king was that it was based on a legend that went something like this:The fertility of our land and the fertility of our people have always been intertwined. Fertility to us is everything. And so it has been our belief that no boy shall reach manhood with his virginity intact. If this were to happen, the land would dry up and we would have no more watermelons. So each year at the watermelon festival the oldest male virgin in town is chosen as the watermelon king. He goes out to a field where he is greeted by three females who take a handful of watermelon seeds from a bag. Whichever girl ends up with the golden seed is the one he sleeps with that night.But Lucy Rider, new to their town, will have none of that, so when the king is picked that year, she says she's had sex with him and she' pregnant with his child. Within the week all of the watermelon field in town wither up and die.The ensuing story is told by her son, who comes to the town to learn about his mother and hopefully find out who his real father is, which could be difficult considering every man in town is keen on taking credit for the deed. This book is fairly short and so fun I'd recommend it to just about anyone."}, {"userName": "Stephanie", "userReviewDate": "Apr 09, 2013", "userURL": "http://www.goodreads.com/user/show/5813341-stephanie", "userReview": "My impression of this book is mixed, but I did not like where the story ended. I don't know if I was rushing through it, but the pacing was great at the beginning. Wallace expertly unfolded stories within stories, letting the reader come to understand Lucy Rider, the main figure of this novel. Her son has come to the small town she died in (as a result of giving birth to him), and he's trying to find out about her and about himself. Each townsperson featured tells his or her part of the story, and Wallace weaves these perspectives in and out, until going back to the beginning... the birth of the protagonist and what his upbringing was like with his grandfather and his mother's friend. His return to the town awakens so much there in Ashland, and the way he was just swept along into it began to feel so rushed. I don't know what else, but he was such a lackluster character compared to the vivacious personality that was his mother. I was looking for more from him, rather than just going along with the tide in the way he did.I suspected Lucy was pregnant before going to Ashland, and I suspected she and Iggy hadn't slept together. I was disappointed in her for sleeping with various other men in the town. I was disgusted by the incest element, and I felt it threw the whole story away. I loved the thoughts about seeds being life and death, and I wanted Ashland to find its revival, so I was disappointed that the town was burned down at the end. It was all just so bizarre... I thought it was heading somewhere different. I was greatly disappointed in Hargraves-Rider... he was a champion there at the beginning, and it seemed like his whole character twisted along the way. What can I say.. I was loving the book at first; I was disappointed by the choppy and odd ending."}, {"userName": "Jamie Wallace", "userReviewDate": "Nov 23, 2014", "userURL": "http://www.goodreads.com/user/show/4742925-jamie-wallace", "userReview": "This novel, set in the small, southern town of Ashland, creates an atmosphere of fable and tall-tale that’s very similar to the one that imbues Big Fish with a sense of magic.Though the beginning was something of a slow burner, I enjoyed the second half of the book very much and found myself shirking other duties in order to read the last few chapters. The cast of characters is both charming and unnerving. The ideas that Wallace plays with are ones that run deep – identify, family, tradition, sexuality. Despite the thematic gravity and sometimes very dark turns in the story, he handles the narrative with a light hand that keeps you, the reader, from feeling weighted down by the pain and grief that runs through the story.Despite the many fanciful turns in the events of the novel, the characters seemed very real. Wallace’s characterization is subtle and stretched out over a series of brief encounters that make up the first half of the book as the protagonist, Thomas Rider, interviews citizens of Ashland, the place of his birth, about his mother. Though certainly not “normal” by most standards, you can almost believe that a place like Ashland might exist … and the Watermelon King, too.Hal Jacobs of the Atlanta Journal, Constitution said it well.“In The Watermelon King, Wallace hits all the right notes of magical realism, creating a world where the supernatural fits alongside the ordinary, where storytellers stretch the plausible, and terror, fear and violence lurk below the surface.”Originally posted as part of a weekend edition on the writing blog, Live to Write - Write to Live."}, {"userName": "Rusty", "userReviewDate": "May 11, 2013", "userURL": "http://www.goodreads.com/user/show/3379953-rusty", "userReview": "I remember my mother wondering why the teachers in our small town stayed only a year or two. My response was that they didn't feel part of the community. How often, I asked, have you invited them to your home. She never had.This story is about a small town so immersed in its own history and folklore that people do not seem important. The festival revolves around the area's greatest crop - watermelon. One man, who has never had a woman, is selected as the watermelon king and rides in the parade with a watermelon vine scepter and a watermelon rind crown. He dispenses watermelon seeds to the women of the community. At the height of the festival one woman, who received the golden seed, comes to him.A beautiful red-haired young woman comes to the town. Her beauty is admired by all the males who weave tales about their encounters with her. Soon it becomes obvious that she is with child. When a simple man she is teaching to read is selected as the watermelon king she implores the city fathers to dispense with the practice. They refuse her request until she states that the man is the father of her child. Since it is too late to select another king and none seems available the festival is cancelled. The woman is ostracized and isolated in her house. The tale spirals to an unexpected climax when the woman's son visits the town to find whatever he can about his mother. A most interesting read."}, {"userName": "Laura", "userReviewDate": "Aug 16, 2013", "userURL": "http://www.goodreads.com/user/show/5003983-laura", "userReview": "This started out quite good, I thought. I enjoyed the little snippets of story that the main character was getting from other people, all told in their own voices. I was curious where the story would go, waiting to learn who Thomas's father was. I didn't forsee who it turned out to be (though I usually don't try and guess plots in books as I read them), but for some reason I wasn't really surprised. About halfway through, the story started to lag for me. This isn't a long book, but it felt that way at times; like the author was padding it with some fluff to make it a novel instead of a short story. Regardless, I was still enjoying it pretty much right up 'til the end. Then the whole bit with the vines happened. (I'm intentionally being vague so as not to create a spoiler.) It was just a little offhand thing, almost, but it made me want to toss the book aside. I actually *believed* it all, felt that, crazy as it was, the plot was actually *possible*, in a small town. I didn't feel I was suspending my disbelief much at all, so this totally fantastical vine bit was jarring and annoying. All-in-all, a decent read with an obnoxious ending."}, {"userName": "Courtney", "userReviewDate": "Oct 16, 2009", "userURL": "http://www.goodreads.com/user/show/1352671-courtney", "userReview": "Written by the same author who did Big Fish. I didn't like that movie, as I found it a tad too surreal for my tastes, and thus would probably never have picked this similarly surreal book up without my book club's invitation. Furthermore, there were several times throughout the reading when I wondered if the book warranted my continued attention due to it containing a smattering of objectionable language and a theme of examining sexuality in small town culture. But after finishing the story and discussing the its merits and weaknesses with a few friends, I feel like overall it could be called an uplifting read. There was admirable writing--times where I noted absolutely delightful wording and phrases, as well as characters who showed traits worthy of emulation, and an ending that makes the reader continue to contemplate truth and self-knowledge long after the book cover closes. I would have wondered if the author was trying too hard to be \"deep\" except for the fact that he is obviously concerned with the idea of \"truth\" and therefore would not likely have been so self-betraying as to write in anything but sincerity."}, {"userName": "Snotchocheez", "userReviewDate": "Jun 24, 2010", "userURL": "http://www.goodreads.com/user/show/1899836-snotchocheez", "userReview": "Stylistic indulgences and a really strange, rushed ending almost killed this dreamy fable/fairy tale of life in a small town in Alabama for me. But not quite. I am convinced that Mr. Wallace has got the \"chops\" to tell an amazing story (although at this time I've still yet to read \"Big Fish\"). \"The Watermelon King\" packs in a scant 225 pages quite a punch. Wallace transports us to a surreal fictional Ashland, Alabama in the not too distant past, a town with a ritual Watermelon Festival that doubles as a fertility rite, preserving the population and survival of the town by crowning the eldest virgin male the \"king\", and requiring him to impregnate the town's eligible females. While intentionally surreal, Mr. Wallace grounds his prose in the realities of Alabama life and touches upon race and sociological mores that imbue the novel with poignancy. My only real problems with the book were the herky-jerky POV changes and an ending that (for a book with unpredictable subject matter) had a very predictable ending that just seemed kind of tossed away. Still looking forward to reading \"Big Fish\" and anything else Mr. Wallace decides to come up with."}, {"userName": "Karen", "userReviewDate": "Oct 13, 2012", "userURL": "http://www.goodreads.com/user/show/2421965-karen", "userReview": "Since I love the movie \"Big Fish\", I decided to read something by this author. \"Watermelon King\" starts out five big stars. We learn about Lucy Rider 19 years after her death through a series of interviews by her son, now 18 years old. There are several underlying stories of this twisted small town. Relationships are based sometimes on real feelings, sometimes on fantasy. The middle section of the book shows us the son's childhood, growing up with his mother's friend and his grandfather. The grandfather tells tall tales, the taller the better. However, no one but the reader recognized the one story that is true. I have to admit, I was pretty sure I had guessed this long before it came, but the way it was written was lovely, wrapped up in a fairy tale. However, once this tidbit is revealed, and you are pretty sure how the inheritance of the son will end up, part three is a little disappointing. Especially when the tale gets tall again, coming in the first-person telling of the only fact-based character in the story. Overall a fast read with a sweet cast of characters."}, {"userName": "Merial", "userReviewDate": "Jul 07, 2015", "userURL": "http://www.goodreads.com/user/show/10528234-merial", "userReview": "Daniel Wallace is hands down one of the most brilliant modern writers of fantasy and fiction. Like his other novels, this read truly like storytelling and orature, which was only aided by the interview and word-of-mouth style of the book's first half. I found myself being continuously amazed by Wallace's originality, wit, and fearlessness.  From the very first page I was captured by the book and was unable to put it down. It simply felt so unique from anything else I have read. Wallace never fails to provide shocking twists that manage to be both believable and propel the mystical and eccentric worlds he creates. While Ashland, the book's setting, is completely out-there and fantastical to an extreme, it also felt as though it could easily be a place that existed in the modern world. The Watermelon King perfectly balances wild fantasy with believability, and it is through this that the book achieves success."}, {"userName": "Kerry", "userReviewDate": "Mar 05, 2009", "userURL": "http://www.goodreads.com/user/show/1874367-kerry", "userReview": "I really enjoyed Big Fish so I was very interested in checking out another Daniel Wallace book. The Watermelon King did not disappoint. It had more than a few similarities to Big Fish (at least in tone and in a couple of the characters) and it blended mythology, tall tales and a search for reality and identity in a very engaging way. The way the author structured the book, first as a series of short interviews reconstructing the events that lead to Thomas' birth, then with his own story of how and why he came to return to the town where he was born and his mother died were interesting enough but I was fascinated and more than a little impatient to see what would happen when the two stories collided once he returned to Ashland. It kept me fascinated right up to the last page. All in all, a great read and I look forward to checking out more of Wallace's work."}, {"userName": "Kris - My Novelesque Life", "userReviewDate": "Aug 05, 2014", "userURL": "http://www.goodreads.com/user/show/6275022-kris---my-novelesque-life", "userReview": "3.5 STARS\"An endearing, often outrageous blend of fable, tall tale, and page-turner, The Watermelon King brings readers to Ashland, Alabama -- the fictional town immortalized in Daniel Wallace's Big Fish -- whose reputation is based on the long-ago abundance of watermelons. Thomas Rider knows almost nothing about his parents, only that his mother died the day he was born in Ashland. He travels there in search of his past, learning of the town's bizarre history. Gradually with the help of an offbeat, utterly unforgettable cast of characters, Thomas finds himself immersed in a series of events that turns everything he knows upside down.\" (From Amazon)A great quirky tale from a quirky small town. I was supposed to study for a final an instead read this book."}, {"userName": "AndPeggy", "userReviewDate": "Mar 26, 2015", "userURL": "http://www.goodreads.com/user/show/7113453-andpeggy", "userReview": "3.5 starsThe first part of the book as told as a series of interviews by a young man looking to find out what happened to his mother in a small town. The second and third sections are then told in a more straight-forward manner as Thomas recounts growing up with his grandfather and going to visit the town his mother died in. Each voice is unique and the characters and town are drawn with vividness. The truth of Thomas's father is forecast, and is a bit of a predictable and unsavory downer. But the book still sits at 3.5 for me because of the richness of the narrative. A quick read that is equal parts light, funny, tragic, and heartbreaking."}, {"userName": "Tung", "userReviewDate": "Jan 09, 2008", "userURL": "http://www.goodreads.com/user/show/763514-tung", "userReview": "The third of Daniel Wallace’s published works, and I only read it out of a sense of completion since I’d read the other two Wallace works. In this book, Wallace’s desire to be creative is overwhelmed by his lack of talent as a writer. The story is about a man returning to his grandfather’s and mother’s backwoods Southern hometown and trying to unravel the mystery of their past. The watermelon festival is a town tradition integral to the story. The plot is ridiculous, the characters unsympathetic, the prose fairly plain – just overall not a very well-written piece. I’m beginning to think that Big Fish was an aberration for him."}, {"userName": "Erinn Maine", "userReviewDate": "Jun 11, 2013", "userURL": "http://www.goodreads.com/user/show/16807741-erinn-maine", "userReview": "Big Fish is hands down my favorite movie, so I wanted to read something by the author. I thought reading Big Fish was too obvious a choice, so I went with The Watermelon King. Wallace definitely brought me back into his world quickly and I was entranced. I felt the hazy over-exposed light of Tim Burton. But the twists and turns and plot choices similar to a Lifetime movie or episode of SVU, pulled me out just as quickly. But, overall, I appreciate things where redheads are prominently featured and adored."}, {"userName": "C.E.", "userReviewDate": "Jul 25, 2012", "userURL": "http://www.goodreads.com/user/show/990760-c-e", "userReview": "I wanted to like this book. Really, I did. Ultimately though, I never connected to what I'm sure Wallace wanted me to see as a bunch of quirky, colorful characters and what I think is intended as some sort of magical realism/modern day fairy tale. In the end, although there are moments, I found it dull--not in the \"I can't stand to read this book\" so much as the \"I just finished this book and I'm already forgetting it existed\" sense. Well written and original,just not particularly memorable."}, {"userName": "Christie", "userReviewDate": "Dec 19, 2007", "userURL": "http://www.goodreads.com/user/show/697131-christie", "userReview": "this is one of the strangest and most unique tales ever. set in the south - told from multiple points of view, as is typical for Wallace - and a host of eccentric characters. in short, it is a tale of a boy searching for the answers about his mother - this journey takes him south to an odd town looking to rejuvenate their ancient harvest/fertility ritual and sagging economy. the mother plays a significant role in the tale - everyone who met her was in love with her. A definite must-read. Tim Burton needs to make it into a movie."}, {"userName": "Keith Davis", "userReviewDate": "Nov 26, 2009", "userURL": "http://www.goodreads.com/user/show/2439329-keith-davis", "userReview": "A young man returns to the small Alabama town of his birth and encounters a weird \"wicker-man\" like fertility ritual revolving around the town's watermelon festival. The revelation of the identity of the young man's father seemed tacked on for shock value, and the magic-realist ending seemed a little much for novel that had been fairly realistic up to that point, but even with those qualms it still a very good novel."}, {"userName": "Annie", "userReviewDate": "Aug 09, 2008", "userURL": "http://www.goodreads.com/user/show/894006-annie", "userReview": "I thought that this book was going to be really good. I loved \"Big Fish\" and looked forward to this book with anticipation. I love how Daniel Wallace weaves in and out of the story.I have to say that I hated this book, after finding out who the father was, and wished I had never read it. I would recommend anyone interested NOT to read it.This story could have been a beautiful story. Instead it rolled ungracefully downhill into the gutter."}, {"userName": "Kiesha", "userReviewDate": "Feb 07, 2017", "userURL": "http://www.goodreads.com/user/show/17962174-kiesha", "userReview": "What did I just read?! I am not quite sure why I kept reading this book. It was interesting but weird as crap. So strange yet I couldn't just not finish it. I picked this up to fit the food category in my reading challenge. At least I can cross that off my reading challenge..."}, {"userName": "Heather", "userReviewDate": "Aug 13, 2009", "userURL": "http://www.goodreads.com/user/show/1170729-heather", "userReview": "This is one effed up little tall tale, right here. It's tricky because it's kind of predictable, except the one thing that is totally not predictable. I gasped out loud when that thing happened, and read the next three pages with my mouth hanging open. (I know, because my sister was sitting beside me and she said, \"You gasped out loud and now you're reading with your mouth hanging open.\") I really enjoyed this book. But then, I've always had a soft spot for the village idiot."}, {"userName": "Jamie L", "userReviewDate": "Jun 08, 2009", "userURL": "http://www.goodreads.com/user/show/188197-jamie-l", "userReview": "Wallace also wrote Big Fish. I never read the book, but the movie was certainly quirky. The characters in The Watermelon King are quirky, but the story doesn't get weird until the end. It was a light read. If someone asked me if they should read it, I wouldn't say no, but I probably wouldn't recommend it, either.cheers!!"}, {"userName": "Alex", "userReviewDate": "Oct 17, 2010", "userURL": "http://www.goodreads.com/user/show/3872139-alex", "userReview": "Very different. Liked the movie Big Fish so I bougt this book YEARS ago. Finally got to it and it wasn't what I expected. Good thing I waited because the theme is something I probably wouldnt have been ready for until now. very adult. somewhat funny and somewhat disturbing. overall a quick easy read."}], "description": "An endearing, often outrageous blend of fable, tall tale, and page-turner, The Watermelon King brings readers to Ashland, Alabama -- the fictional town immortalized in Daniel Wallace's Big Fish -- whose reputation is based on the long-ago abundance of watermelons. Thomas Rider knows almost nothing about his parents, only that his mother died the day he was born in Ashland. He travels there in search of his past, learning of the town's bizarre history. Gradually with the help of an offbeat, utterly unforgettable cast of characters, Thomas finds himself immersed in a series of events that turns everything he knows upside down. Comic, poignant, and wholly original, The Watermelon King is a magical novel steeped in the power of identity, myth, and good old-fashioned southern storytelling.", "title": "The Watermelon King", "url": "http://www.goodreads.com/book/show/27443.The_Watermelon_King", "average": 3.45, "cover": "https://images.gr-assets.com/books/1388181184l/27443.jpg", "reviews": 82, "authors": [{"url": "https://www.goodreads.com/author/show/15393.Daniel_Wallace", "name": "Daniel Wallace"}], "type": ["Fiction", "Fantasy", "Magical Realism", "Adult", "Young Adult"], "outlinks": ["http://www.goodreads.com/book/show/27443.The_Watermelon_King", "http://www.goodreads.com/book/show/2443447.The_Watermelon_King", "http://www.goodreads.com/book/show/129984.Big_Fish", "http://www.goodreads.com/book/show/27441.Mr_Sebastian_and_the_Negro_Magician", "http://www.goodreads.com/book/show/15803016-the-kings-and-queens-of-roam", "http://www.goodreads.com/book/show/31451136-extraordinary-adventures", "http://www.goodreads.com/book/show/159342.Ray_in_Reverse", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}