{"ratings": 1893, "userreviews": [{"userName": "Anne", "userReviewDate": "Nov 20, 2015", "userURL": "http://www.goodreads.com/user/show/1720620-anne", "userReview": "[ (hide spoiler)]"}, {"userName": "Caroline", "userReviewDate": "Oct 30, 2016", "userURL": "http://www.goodreads.com/user/show/38672507-caroline", "userReview": "THIS IS THE 100th BOOK I HAVE READ THIS YEAR I AM SO PROUD OF ME!!!Honestly though I loved this one. It is easily one of my favourites in the series! It was so good to see the characters grow and develop in ways that I hadn't really anticipated. I'm so keen to continue this series (I say that every time but oh well) because it is amazing but also I don't want to catch up and have to wait for book 14 to be released."}, {"userName": "Mindi", "userReviewDate": "Feb 24, 2015", "userURL": "http://www.goodreads.com/user/show/6157592-mindi", "userReview": "What I really love about this story is that more than 100 issues into the series, Kirkman is still able to surprise me.For a while I felt like the conflict with Negan would never end. I just kept waiting for the inevitable to happen...big bad hurts the group in countless ways before ultimately being taken out in a spectacularly satisfying fashion. That didn't happen. At first I felt betrayed. WTH, Kirkman, I stuck with you for this long and you give me no awesome payoff? But then I thought about it for a while, and I realized that's what makes The Walking Dead so good. You don't always get the payoff you want. Instead, you get the closest thing to reality in the landscape of a very unrealistic zombie apocalypse. The good guy doesn't always win, good people die, and sometimes you just have to deal with it.Did Rick make the right decision? Only time will tell, but Rick is a very human character with way more responsibility than anyone in an apocalyptic world would want. I think he is a man honestly trying to do his best, and so far his best has been pretty good. Things have changed drastically with this story since the beginning, and now we even have a time jump to contend with. I'm intrigued about the new threat that was presented at the end of this compilation, and as always, I'm eager to see how they incorporate the graphic novel into the television series. They are now very different animals, but both are still outstanding."}, {"userName": "Randy", "userReviewDate": "Apr 14, 2016", "userURL": "http://www.goodreads.com/user/show/131730-randy", "userReview": "The end of All Out War...and the beginning of what comes after."}, {"userName": "Erin Cataldi", "userReviewDate": "Apr 13, 2015", "userURL": "http://www.goodreads.com/user/show/3670585-erin-cataldi", "userReview": "Book Ten showcased the massive war between Negan and the saviors and this books highlights the after effects. After Alexandria is destroyed, the remaining communities unite for one last stand against the Saviors. They are enraged at how unfair Negan has been fighting (he was infecting all their weapons with walker blood to infect and kill all the wounded) and decide to take him down once and for all. The aftermath of their war leads to the biggest status quo change that we've seen soo far. Shit is on the mend. The only problems are little problems. Too much good may be occurring, I fear what book twelve will bring. This much peace and prosperity cannot last!"}, {"userName": "Dan", "userReviewDate": "Jan 10, 2018", "userURL": "http://www.goodreads.com/user/show/6822586-dan", "userReview": "[ now that the Whisperers have shown up (hide spoiler)]"}, {"userName": "Rade ", "userReviewDate": "Nov 29, 2015", "userURL": "http://www.goodreads.com/user/show/8187431-rade", "userReview": "Actual story: 3 starsTwist at the end: pushed to 4 starsLike many, I expected the fight between Negan and Rick to get brutal. It was but it ended pretty fast. Besides that nothing much happens for a big chunk of the book. The survivors fight some zombies, ration food, divide up the jobs and/or responsibilities, converse, make ammunition, the sort of thing we saw in many other installments of this comic. What makes this one unique is the ending where a big twist awaits. I just hope it does not end in \"haha I am a bad guy and I want to kill the normal humans that are trying to survive the zombies, which are totally not our enemy so don't even think about bring that up,\" type of story arc since we have seen it plenty of other times. If so, than I hope they end the comic right there. Also, why does it look like that some of these characters only show anger on their face? They have furred brow in every scene, even if they are talking about the most mundane things. Anyway, highly recommended as this graphic novel seems to be getting better and better (even though I sometimes think it overstayed its welcome like The Simpsons TV show did years ago)."}, {"userName": "Sam", "userReviewDate": "Jul 10, 2017", "userURL": "http://www.goodreads.com/user/show/1768003-sam", "userReview": "This volume holds issues 121-132 of this epically good series and finds our survivors trying to rebuild after the war with Negan and the Saviors without completely losing their humanity. It starts with Negan trying to continue the war and take over all of the communities with more carnage and chaos on both sides, and some interesting uses of some captured zombies. There is a pleasant lull in the middle as rebuilding works begin and things seem to be settling down but then a very morbid discovery is made that seems to suggest that the walkers are not as mindless as originally thought, posing a whole new risk and terror to the surviving communities. As ever the story is supported by the superb greyscale illustrations showing all of the tender moments as well as all of the gory ones."}, {"userName": "Dominick", "userReviewDate": "Dec 21, 2016", "userURL": "http://www.goodreads.com/user/show/5913578-dominick", "userReview": "The consistent twelve-issue arc collections for this version of the series once again creates a unit that does not function terribly well as a coherent book. The first half finishes off the Negan storyline, and does so in a fairly satisfactory way, even if we all KNOW that leaving Negan alive is eventually going to bite Rick in the ass. The second half jumps us forward several years--five or so, I'd guess, though I don't recall anything that spells it out. Most of the latter half of the book is, I guess you would say, a slow burn. There is little in the way of developing plot, but instead mostly just getting us used to the new world, now that Rick and company have established a relatively thriving set of interacting communities. Carl's now a teen, Rick is having trouble letting him go (argh); Rick has become a living legend and is having a hard time dealing with that (a potentially more interesting development); Eugene and Rosita are now together but probably falling apart (because what would TWD be without a least a little bit of soap opera action?), etc. Some old faces are mysteriously gone (explanations to come eventually, presumably), and a few new ones get brought in (on the \"not a good sign\" front: I finished the book a few hours ago but remember the names of almost none of these new folk), and by the end of the volume we seem to be gearing up for the next big crisis. (Seem to be? Clearly, we ARE.) I am curious to see where things go but do wish Kirkman could find some way to get around the structural problems that so often end up making these books failures AS books, however successful they may be as parts of a larger whole."}, {"userName": "Jacquline", "userReviewDate": "Feb 25, 2015", "userURL": "http://www.goodreads.com/user/show/8313741-jacquline", "userReview": "I couldn't be more excited that this book has finally come out, and I eagerly await the book twelve. The first chapter was quite eventful, especially when Rick took Negan hostage. The Saviors have not fallen, but they have not become a nuisance anymore to any of the groups. It is really interesting to see the groups come together to attack the Saviors, and they have finally won, even though Negan had a great plan to defeat the group by soaking their weapons in zombie blood to get the others to turn, but luckily Rick's group is sharp and knew what was happening before things got really bad. Basically the first chapter of the book was continuing the war from the previous book. The second chapter shows about two years later, the groups formulating a system to trade goods and build factories to produce bread, bullets, et cetera. Andrea and Rick seem to be married, and Carl even calls her mom. Maggie has a son, Hershel, and he's at the talking stage. Rick and Maggie's group have a road cleared out to travel between both areas of living. The groups even ride out to keep the herds from coming too close, moving them systematically and mapping the area out to know what they are up against. They even have horses. The really intriguing part of the second chapter in the book is that we see zombies talk and attack. At the very end, we learn that there are people underneath the zombie exterior, taking what they want, but we do not know what that is yet until the next book. Also, Negan is rotting in jail, and he believes he is going to get out and destroy Rick. The other part of the book that captivated me was how there was a group lingering about, and they were brought into Rick's group. There are five of them, and they seem trustworthy, but how trustworthy they are is up for the reader to decide. Kirkman does not let his audience down with how amazing the story line is. Before I picked the book up, I thought that the series should end at this one, but after reading it, I am waiting for the next one. I hope it is all that I want it to be. Who knows, maybe Daryl Dixon's character will finally arrive."}, {"userName": "Carolyn F.", "userReviewDate": "Dec 25, 2015", "userURL": "http://www.goodreads.com/user/show/2624012-carolyn-f", "userReview": "[they found a way to not only make the dead move, but through electrical impulses, move their bodies in an intricate way (hide spoiler)]"}, {"userName": "Grace", "userReviewDate": "Nov 26, 2015", "userURL": "http://www.goodreads.com/user/show/743207-grace", "userReview": "Just when I think things are going to get predictable, a new surprise comes along. This volume gives a satisfying resolution to the war with Negan and opens a new chapter for our heroes...and I for one can't wait to see what the future holds.Also, SPOILERS...Zombies that whisper? And that wield weapons? So awesomely creepy."}, {"userName": "Janice", "userReviewDate": "May 27, 2015", "userURL": "http://www.goodreads.com/user/show/12055175-janice", "userReview": "The time gap between the first half and second half of this book threw me off. Let me amend that, everything about the second half of this book threw me off. The world of our dearly beloved characters changed in so many ways, that the characters themselves became unrecognizable."}, {"userName": "Singleton Mosby", "userReviewDate": "Aug 18, 2015", "userURL": "http://www.goodreads.com/user/show/4745553-singleton-mosby", "userReview": "The story of the war against Negan was excellent. Too bad it had to end at some point. And what an interesting, and brave way to continue. Even though I do not really like the 'post-war storyline so far, overall TWD keeps being superb."}, {"userName": "Michael", "userReviewDate": "Mar 28, 2015", "userURL": "http://www.goodreads.com/user/show/4004781-michael", "userReview": "WOW what a twist at the end and a threat that is unlike anything ever seen."}, {"userName": "Carol", "userReviewDate": "Oct 17, 2016", "userURL": "http://www.goodreads.com/user/show/4156507-carol", "userReview": "By the end of this book I was talking to it, \"No Way, You Have To Be Kidding Me!!\". My husband was trying to sleep but I got his attention with my comments. Great ride."}, {"userName": "Nicole", "userReviewDate": "Feb 11, 2018", "userURL": "http://www.goodreads.com/user/show/14238381-nicole", "userReview": "At this point in the series, I feel a lot of repetition. I don't know if it has anything to do with the fact that it is and has been on television, but I was ready for the gang to run into something new. By the end of this book, I have hope for that.This series has been in the making for several years now, and I sometimes have to go back a book or two once I get a new one. That was still the case when I read this edition. Once I was caught up to speed, it was the same feeling of urgency, hope, and despair all wrapped up in one book. I have to say, that I can't wait to see how the new developments from the end of this book play out in future books.Overall, I gave this book 5 stars. There is a part of me that, since The Walking Dead has been mainstream, that wants to quit reading this series and leave it for later years. But, then I remember spoilers are a thing, and I would rather be caught up with the books. Although that has no impact on the content and review of each book, it is a little discouraging to continue the series. Regardless, The storyline still provides new and exciting plot twists, a realistic amount of disappointment and despair, and I am still holding a few characters very dear to my heart. The artwork at this point, I feel, may be rushed. Comparing it to older books in the series, something is different, but I can't put my finger on it. Still beautiful artwork, though."}, {"userName": "Janne Paananen", "userReviewDate": "Mar 10, 2018", "userURL": "http://www.goodreads.com/user/show/4853662-janne-paananen", "userReview": "Pienen tauon jälkeen taas Walking Deadin kimpussa. Yhdennentoista kirjan ensimmäisessa osassa saadaan edelliset pari kirjaa veivattu sota sadistista Negania vastaan päätökseen. Tämän jälkeen sarjassa tapahtuu pieni aikahyppy ja toisen osan keskiössä on jo hieman varttunut Rickin poika, Carl. Murrosikään kasvaneen pojan hormoonit alkavat hyrrätä ja mieli tekisi jo isompiin saappaisiin. Edellisten kovin sotaisten jaksojen jälkeen tämä seesteisyys tuntuu ihan mukavalta vaihtelulta. Yhteisö on keksinyt tavan tuottaa ruokaa ja tarvikkeita. Vaihtokauppareittejä toisten yhteisöjen kanssa muodostetaan ja on aika luoda uudenlaista moraalista koodistoa, kuten miten rangaista väärintekijöitä tai yhteisölle uhaksi olevia jäseniä. Jotta homma ei olisi yhtä harmoniaa ja hyvää meininkiä, odottaa kirjan lopussa pieni yllätys. Hyvin kulkevaa tarinan kerrontaa. Pidin myös aikahypystä. Tuttujen hahmojen vanheneminen ja muuttuminen toi tarinaan lisää syvyyttä, joskin sitä olisi voinut hyödyntää vieläkin enemmän. Nyt se näkyi lähinnä vain Rickissä ja Carlissa.Hetkinen, olikos tässä kirjassa zombietarinassa zombieta ollenkaan?"}, {"userName": "Hans", "userReviewDate": "Aug 22, 2017", "userURL": "http://www.goodreads.com/user/show/1311381-hans", "userReview": "[using zombie innards or \"out-ards\" to trick or attack (hide spoiler)]"}, {"userName": "Justin Vargas", "userReviewDate": "Mar 27, 2018", "userURL": "http://www.goodreads.com/user/show/43997904-justin-vargas", "userReview": "OMG QUE BUENO ESTUVO ESTE VOLUMEN La verdad es que pasaron muchísimas cosas en este volumen , sin duda uno de mis favoritos Empezando con la continuación de la guerra contra Negan ,lo que pasa después y lo que se viene No me esperaba esa conclusión para la guerra , me gustó bastante El salto temporal es algo que se necesitaba Y lo mejor para el final ¡¡LOS SUSURRADORES!!"}, {"userName": "Lori", "userReviewDate": "Feb 18, 2018", "userURL": "http://www.goodreads.com/user/show/647632-lori", "userReview": "Lots of surprises in this one... and many new possibilities.Noteworthy quotes:\"We're just watching the sunset? This is boring.\" (Carl)\"Yeah, isn't it great?\" (Rick)\"Totally.\" (Carl)\"We whisper and the dead don't mind. You'll see. You'll be dead soon yourself. Then you'll see.\""}, {"userName": "B.A. Wilson", "userReviewDate": "Oct 25, 2017", "userURL": "http://www.goodreads.com/user/show/24206425-b-a-wilson", "userReview": "It is so strange to be reading at a point that is past the show. I feel like I'm cheating on the show, which makes no sense, as really the opposite occurred. Anyway, this one is also full of unexpected resolutions and moments of hopefulness. Pages: 296"}, {"userName": "Neil Williams", "userReviewDate": "Apr 15, 2018", "userURL": "http://www.goodreads.com/user/show/75390850-neil-williams", "userReview": "Dang it, I was thinking of stopping after this one but it ended with SUCH a good cliff and rebooted world (the A New Beginning arc, post-apocalyptic new civilisation forming after the all out war with Began). So I guess the continuing story continues for me too..."}, {"userName": "Victoria", "userReviewDate": "May 22, 2018", "userURL": "http://www.goodreads.com/user/show/2029868-victoria", "userReview": "Better! I like post-apocalyptic world building."}, {"userName": "Jonas Lee", "userReviewDate": "Nov 15, 2016", "userURL": "http://www.goodreads.com/user/show/24134605-jonas-lee", "userReview": "I loved this compilation. So much came about with Negan and at the last chapter, it was refreshing to see how they are flourishing and surviving. Then...the ending... ho-ly-shit."}, {"userName": "Olly", "userReviewDate": "Jan 20, 2018", "userURL": "http://www.goodreads.com/user/show/60870294-olly", "userReview": "Molto deludente la conclusione della saga di Negan, troppo veloce e semplice"}, {"userName": "Darren", "userReviewDate": "Sep 17, 2017", "userURL": "http://www.goodreads.com/user/show/4198472-darren", "userReview": "Great as always. Christmas present from my step son. Cheers Sam"}, {"userName": "Mark C. Volain", "userReviewDate": "Mar 04, 2018", "userURL": "http://www.goodreads.com/user/show/5234063-mark-c-volain", "userReview": "Finally some progress."}, {"userName": "Andrea Nava", "userReviewDate": "Jul 03, 2017", "userURL": "http://www.goodreads.com/user/show/36292540-andrea-nava", "userReview": "Sólo puedo decir una cosa:Waaaaaaaaow."}, {"userName": "Jennifer Mutters", "userReviewDate": "Aug 07, 2017", "userURL": "http://www.goodreads.com/user/show/35957713-jennifer-mutters", "userReview": "Now I have to get the next one :) Keeps me on my toes."}], "description": "After Alexandria is destroyed by Negan, the remaining communities unite for one last stand against the Saviors. The aftermath to their war leads to the biggest status quo change in the history of this acclaimed series. Collects THE WALKING DEAD #121-132.", "title": "The Walking Dead, Book Eleven\n      \n          (The Walking Dead: Hardcover editions #11)", "url": "https://www.goodreads.com/book/show/24567929-the-walking-dead-book-eleven", "average": 4.42, "cover": "https://images.gr-assets.com/books/1424991149l/24567929.jpg", "reviews": 127, "authors": [{"url": "https://www.goodreads.com/author/show/12425.Robert_Kirkman", "name": "Robert Kirkman"}, {"url": "https://www.goodreads.com/author/show/16962.Charlie_Adlard", "name": "Charlie Adlard"}, {"url": "https://www.goodreads.com/author/show/518948.Stefano_Gaudiano", "name": "Stefano Gaudiano"}, {"url": "https://www.goodreads.com/author/show/16966.Cliff_Rathburn", "name": "Cliff Rathburn"}, {"url": "https://www.goodreads.com/author/show/6560735.Rus_Wooton", "name": "Rus Wooton"}], "type": ["Sequential Art", "Sequential Art", "Horror", "Horror", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/24567929-the-walking-dead-book-eleven", "http://www.goodreads.com/book/show/24073191-the-walking-dead-book-eleven", "http://www.goodreads.com/book/show/138398.The_Walking_Dead_Vol_1", "http://www.goodreads.com/book/show/6465707-the-walking-dead-compendium-1", "http://www.goodreads.com/book/show/30071.The_Walking_Dead_Book_One", "http://www.goodreads.com/book/show/138396.The_Walking_Dead_Vol_2", "http://www.goodreads.com/book/show/30069.The_Walking_Dead_Vol_3"]}