{"ratings": 3695, "userreviews": [{"userName": "Aj the Ravenous Reader", "userReviewDate": "Apr 28, 2015", "userURL": "http://www.goodreads.com/user/show/30248594-aj-the-ravenous-reader", "userReview": "\"Love was the only reason to do anything. The only value worth living for. A goal truly worth making any sacrifice for.\"  1890 France, an eloquent portrayal of the so called courtesans, fine exhibition of *ahem* erotic paintings, wild and passionate display of something more than just erotic paintings *double ahem* plus *blushes*......a touch of mythology, a stroke of witchcraft and dark magic, sprinkled with paranormal all blended in a very exquisite art of storytelling and spellbinding writing intensified by a rich, fantastic tale of love, obsession and possession...this book will ultimately put you in a trance from start to finish, well except for the very last page (which is basically the reason I deducted a star.)This novel is as elegant and as beautiful as a very rare, exotic painting whose every element completely fascinated and mesmerized me despite being a newbie to both historical fiction and *ahem* erotica.^^Also, this will give you a very unconventional-rated PG tutorial on creating nude paintings.^^Recommended to everyone older than 18 or maybe 21? Teehee.^^  Thanks to Netgalley for an ARC of the book.^^"}, {"userName": "Laura", "userReviewDate": "Feb 11, 2015", "userURL": "http://www.goodreads.com/user/show/8429172-laura", "userReview": "*I'll be posting the review tomorrow*"}, {"userName": "David J. Montgomery", "userReviewDate": "Jan 25, 2015", "userURL": "http://www.goodreads.com/user/show/24653380-david-j-montgomery", "userReview": "M.J. Rose is one of the masters (mistresses?) of romantic suspense, and THE WITCH OF PAINTED SORROWS shows just how good she is. If you like a little erotic romance with your thrills -- and a dash of the supernatural -- you're going to love reading this.This isn't really the kind of book I ordinarily read, but Rose knows how to tell a story, so I always enjoy her work. She creates good characters, but the best part is her intricate plots and use of beautifully-written settings. Reading THE WITCH OF PAINTED SORROWS (love that title, by the way), you'll think you really are in late-19th-century Paris."}, {"userName": "Sammy Loves Books", "userReviewDate": "Jun 09, 2015", "userURL": "http://www.goodreads.com/user/show/14227114-sammy-loves-books", "userReview": "An 1800's French Romance with a twist...My thoughts...I HATED the heroine. She was weak, conniving, and deserved to die from her own stupidity. She lied to, and stole from her loving grandmother who gave her refuge from her husband. This book almost became a DNRBut curiosity got the best of me. I HAD to know how this train wreck would end.I can only be Mad at Myself for not jumping off this train two weeks ago!! Gaaahhh, I can't believe this book has an average rating of 3.52!!!"}, {"userName": "Carole (Carole's Random Life in Books)", "userReviewDate": "Dec 03, 2014", "userURL": "http://www.goodreads.com/user/show/5892196-carole-carole-s-random-life-in-books", "userReview": "This review can also be found at Carole's Random Life.3 StarsI have mixed feelings regarding this book. I was so excited to read this book since the description held such promise. I saw that this book was set in Belle Époque Paris during the late 1800s and it just sounded wonderful. I thought that it was beautifully written with wonderful detail in many ways. I also found myself waiting for something to happen and thought the book seemed to drag in some places. Sandrine goes to Paris to be with her grandmother and to get away from her husband in New York. When she makes it to her grandmother's home, she finds the house empty and learns that her grandmother is now staying in a different location. Sandrine is drawn to the house and meets Julien, the architect that her grandmother has hired, at the home. It becomes quickly apparent that something strange is happening as Sandrine seems to know things that she shouldn't know and acquires new skills with an alarming speed. Sandrine is a character that did not elicit any feelings from me. I didn't like her or dislike her. To be perfectly honest, I am not sure that I know her very well. Her character seemed to change so much with dramatic personality differences. These personality changes makes sense in regards to the story but it also prevented me from connecting with the character. The only character that I really liked with Sandrine's grandmother but her role diminished as the book progressed.I believe that some readers will have issues with the relationship between Sandrine and Julien since they are both in other relationships. Sandrine has left her husband but has not done anything to permanently end the relationship and Julien is engaged and plans to continue with his plans to marry. The attitude that a spouse should look the other way was common at the time and plays a large part of this book. The setting of this book was wonderfully detailed and vivid. There were so many beautiful descriptions found in this novel. I loved the descriptions of the painting and learning about Sandrine's ancestor. I did find myself ready for something to happen at many points in the book. I think that the story did get a little overwhelmed with the description at a point and the pacing could have been better. I think that this book is quite unique and manages to bring so many wonderful and unexpected elements together in one story. This is the first book by M.J. Rose that I have had a chance to read. I am still undecided about whether this is a series that I will continue with future installments.I received a copy of this book from Atria via Net Galley for the purpose of providing an honest review."}, {"userName": "Magdalena aka A Bookaholic Swede", "userReviewDate": "Mar 21, 2015", "userURL": "http://www.goodreads.com/user/show/1379514-magdalena-aka-a-bookaholic-swede", "userReview": "I have for a while now wanted to read an M.J. Rose book. The stories in the books have intrigued me and I love the covers for them. I was quite glad when I got the chance to read this new one.Sandrine Salome has left her husband and fled New York to take refuge at her grandmother's house in Paris. But she discovers when she gets there that her grandmother is planning to turn the house into a museum and she also forbids Sandrine to visit the house. But she can't help feeling drawn to the house and one day she defies her grandmother and goes to the house and there she meets Julien Duplessi, the architect that is to turn the house into a museum. With Julien, Sandrine feels something she hasn't felt with her husband; passion. But will the passion ultimately destroy her? Because the women in her family are said to being under a curse; that they should never love anyone that that will only lead to destruction...I was quickly drawn into the story of this book about courtesans, witches, possessions, and passion. It was an intriguing story and very beautifully written. Sandrine starts out as a young woman in mourning for her father and for her failed marriage, but as the story progress she changes, she starts to paint and it consumes her. But as she learns more and more about her family's story about La Lune, the famous courtesan she slowly starts to lose herself to La Lune. Was La Lune a witch? A woman desperate to live again century's after her death? Sandrine's grandmother tries everything to keep her from the house, from painting. Everything that has to do with La Lune, but Sandrine is in love and love is the very thing that La Lune feeds on...As I read on I soon got a feeling of doom about the ending. I just knew that this book couldn't end happy and the ending was...let's say I really want to read the next book in the series!In the end, I just want to say that I’m I enjoyed reading The Witch of Painted Sorrow very much and I’m looking forward to reading the rest of the books in this series and other books that M.J. Rose has written.I received a copy from the publisher and france book tours in return for an honest review!"}, {"userName": "Susana", "userReviewDate": "Nov 24, 2014", "userURL": "http://www.goodreads.com/user/show/7301000-susana", "userReview": "Arc provided by Atria Books through Netgalley Release Date: March 17 thDNF at 30%I'll start with the positives: The pretty cover and the enticing title...both of them, made me click the request button.The writing:The story is mainly told in such a boring, fastidious way, that I cannot in full conscience give it more stars.Who knows? Maybe the story does get better...although I doubt it, with such a simpering leading character... I'll admit that I am not this book's intended audience, mainly because I like strong plots. And even while reading fantasy, I like it to have solid bases.For me, being bombarded on all sides with fashion décor is not what I consider a strong plot...strong descriptive abilities, yes.Plot? Non. The flimsy way in which the paranormal aspect was inserted in the story, was so vague and unremarkable, that I just couldn't force myself to keep reading this. It was like Sandrine tripped in it: Oh, here it is, I must follow it. When I reached the twenty percent mark, what did I have?Long, boring, pretentious descriptions of this and that.I am all for setting a story's tone, but with such nonsense \"floating\" around, there was no reason for me to suffer through this.The sound of \"tears being shed\"?o_OThis is not magical realism, nor does this read as an horror novel_much less sci-fi! what's with those time dates on the paintings?_, and those were the only logical \"explanations\" for what happens, or for what the character says. But with such sugared, cheesy descriptions _ of all that is pretty and nice _ the plot doesn't have a proper strong voice as an historical romance.Also, I really dislike soap opera twists, and having a guy drop dead because he was slapped, was really pushing it. Slap a guy, and he has a fulminant asthma attack?Really? -_- Well, if he were in a House's episode maybe...Not that he didn't deserve to die! He was an eighteen year old messing around with a fourteen year old girl! *off with his balls!* Oh, and insta love? Can I just say how \"lame\" that description felt?I lost count of the amount of pointless descriptions this book has...so, here's an idea: why not develop a proper romance between grown ups? Then there were the plot inconsistencies: For instance, the thing with Sandrine's age?We are told that she was already involved with Leon when she was fifteen, but at the beginning, we are told that he dies in the morning of her fifteenth birthday...So, what is it? Fourteen sounds \"problematic\", but fifteen doesn't? :/ Then there's a phrase in which we get a demure twenty five year old Sandrine, imagining how it would feel to turn around, and to kiss an almost complete stranger _ the love interest _ and how she had never done anything so spontaneous...Are you kidding me?For someone with such a good memory, she sure has selective amnesia. Hello?What about the time when \"you\" were fourteen and were caught in bed _completely naked _ with \"your\" beau?I can't even....First and probably last book, I'll ever read by this author."}, {"userName": "Evie", "userReviewDate": "Nov 22, 2014", "userURL": "http://www.goodreads.com/user/show/4335276-evie", "userReview": "Set in 1890s Paris, The Witch of Painted Sorrows is an irresistibly atmospheric, flavorful and intensely captivating gothic novel. I was thoroughly impressed with M.J. Rose's smooth and spellbinding writing style and the amount of historical and cultural detail she included in this story. The combination of the sensual, sexually charged plot line, the gripping intrigue, the emotionally powerful and deeply intimate details of the main character's life and the breathtakingly painted historical tapestry of Belle Epoque simply swept me off my feet. I think I found my new favorite historical fiction author! Sandrine Salome arrives in Paris hoping to find refuge from her dangerous husband at her grandmother's lavish and breathtaking mansion. However, upon her arrival, she discovers the mansion is empty and locked up, and her grandmother explanations seem rather suspicious and evasive. Together with charismatic and fascinating young architect, Julien, she begins to explore Paris's night world, with all its forbidden and dangerously alluring sides, dipping her fingers in the occult and exploring her deepest desires. The Witch of Painted Sorrows surprised me. In a very good way. The story was more substantial and more captivating than I expected. The suspense kept me turning pages and I was undeniably mesmerized by Rose's evocative prose and careful world building. On top of everything else, this book was simply very entertaining to read. I gasped, I blushed, I held my breath a few times, and I kept on turning pages, telling myself \"just one more chapter\", \"just one more page\". I just couldn't put it down. Art, erotica, witchcraft, danger, possession, history - The Witch of Painted Sorrows has it all. It's an explosive and highly addictive blend of flavors and themes, and I am certain fans of paranormal mysteries set against rich historical backgrounds will find this book truly unputdownable. I know for sure, I will be following M.J. Rose's writing carrier closely."}, {"userName": "Melinda", "userReviewDate": "Feb 14, 2015", "userURL": "http://www.goodreads.com/user/show/30751354-melinda", "userReview": "The setting creates an amazing ambiance – belle epoque Paris stirs the peruses attention, conjures the imagination. Rose takes full advantage and fulfills expectations with unbridled intent.Rose manipulates language in such an enticing manner, enhancing the entire narrative, hypnotizing, sultry whatever the label it is lush. Her prose seduces the reader.The characters offer sophistication, nimble not short of corporeal. All enchanting with their individuality and role.With the perfect blending of supernatural, romance and mystery, all marrying to create a sensual reading exploration. The plot is involved, down right spellbinding, intoxicating with the turn of every page.The ending leaves you craving more, your thirst not quite satiated while it is teased with one suspense filled ending inciting a riot of anxiety until the next sequel.Provocative, opaque with a metaphysical presence, rousing. Highly recommend this wonderfully sculptured novel. Rose succeeds again, not surprising due to her unlimited talent and exceptional creativity."}, {"userName": "Wheeler", "userReviewDate": "Jan 09, 2015", "userURL": "http://www.goodreads.com/user/show/28537122-wheeler", "userReview": "M.J. Rose’s new novel, The Witch of Painted Sorrows, feels more like a very long draft of a novel rather than a fleshed-and-thought out story. Along those lines, Sorrows does not pick up until the last 100 pages or so. Up to that point, it’s a horrible slog, not just a slog like the last 100 pages.Furthermore, the plot elements introduced at the beginning to propel the main character to Paris, where the book takes place, feels haphazard at best and the very first draft at worst. Her husband is described as “dangerous.” He is a killer! Except he’s not. The main character’s treatment of her husband, meant to be a plot point, appears more like she’s actually crazy because of the level of hysterical thoughts and feelings attributed to him.“But I would not live with a brute who had my father’s blood on his hands.”Hysterical.Also, there’s a sleep rape scene which is portrayed as totally OK. Switch the genders and it would not be OK.Sleep rape is not OK.All in all, not worth reading.This book (an advanced uncorrected proof) was received, free of charge, from the Goodreads First Reads program.Update on Jan. 26, 2015The author, Ms. Rose, took to Facebook on Jan. 18 to complain about my review and defend the offending scene in the book, which I believe I have correctly described as sleep rape perpetrated by a female on a male. This can also be called made to penetrate.I don't have a problem with portraying rape in fiction. I have a problem with portraying rape as anything other than rape, and therefore, acceptable.The offending lines in my original review (above) (besides being negative in general) are as follows:\"Also, there’s a sleep rape scene which is portrayed as totally OK. Switch the genders and it would not be OK.Sleep rape is not OK.\"As I wrote in the original post, my problem is the portrayal of sleep rape as acceptable, as the norm, or as Ms. Rose would have one believe, not possibly because the victim is a man and the perpetrator a woman.Ms. Rose proceeded to defend the scene to her nearly 80,000 followers.Many of those commenters wrote that I must be puritanical, prudish, that I confuse sleep rape for lovemaking or that I live in the 19th century.As evidenced by Ms. Rose's post on Facebook, she intended the scene to be seen positively.\"An early reviewer has blasted the book claiming I have a sleep rape scene. Ahem. In said scene Sandrine - a FEMALE - arouses her MALE lover while he is sleeping and they proceed to make love while he is half-asleep.\"Please observe what is wrong with Ms. Rose's defense of the sleep rape scene: \"a FEMALE - arouses her MALE lover while he is sleeping.\"Ms. Rose uses the argument that because a woman is doing the perpetrating, it's obviously not rape. Unfortunately, this is a wrong-headed and entirely false conceit. Neither rape nor consent know gender or gender roles.She also uses the argument that what her main character does to her lover is acceptable because of their romantic relationship.This would not be an acceptable argument if the gender roles were reversed. After all, marital rape has been illegal in all 50 states since 1993.Below are three very good articles on the issue from three different publications:Slate -- When Men are Raped by Hanna Rosinhttp://www.slate.com/articles/double_...Choice quote: \"By portraying sexual violence against men as aberrant, we prevent justice and compound the shame.\"Vocativ -- The Hard Truth About Girl-on-Guy Rape by Elizabeth Kulzehttp://www.vocativ.com/underworld/cri...Choice quote: \"Of course, for even the gentlest male sleep-rapist, 'I assumed she’d be into it' doesn’t exactly fly in court. Consent reigns supreme, and to pursue a female without it is to invite culpability. In 'made to penetrate' cases, the line is often far more ambiguous. Still, there are plenty of female aggressors who don’t leave much to interpretation.\"Pacific Standard -- When Women Sexually Assault Men by Livia Gershonhttp://www.psmag.com/politics-and-law...Choice quote: \"THE NOTION THAT SEXUAL assault of a man by a woman is impossible, and even laughable, rests on the same gendered assumptions that are also used to downplay assaults on women by men\""}, {"userName": "AH", "userReviewDate": "Dec 03, 2014", "userURL": "http://www.goodreads.com/user/show/3255548-ah", "userReview": "This book starts off quite slowly and may be painfully slow for some readers. It's told from the point of view of Sandrine, who in 1894 left her husband in New York and traveled to Paris on her own to live with her grandmother. When she arrives at their ancestral home, she is surprised to find that her grandmother is no longer living there and that the house in under renovations. Her grandmother lives not far from the house and takes Sandrine in. Sandrine's curiosity about the house takes her back and she and the architect make some fascinating art and jewelry discoveries. Her grandmother doesn't want Sandrine to live in Paris, nor does she want Sandrine anywhere near the family home. It appears that an ancestor known as La Lune was a powerful witch and she wants to possess Sandrine. Since the story is told from Sandrine's point of view, she cannot see the changes to her personality. Her grandmother does and she is terrified. The local Rabbi is called in to help. While I found the beginning of the book to be a little slow, I did enjoy this book because the writing was well done and some passages were beautifully written. I loved the fact that the story took place during the 1890's in Paris where so much was happening in the art world. The addition of the spiritual world, the hunt for eternal life, and the secret societies made this book incredibly fascinating.I also admired Sandrine. I can't even begin to imagine the hardships a young married woman would have to endure in order to escape from a brutal marriage. Traveling to Paris on her own was a gutsy move. Dressing up as a man to attend art school, even more so. Thank you to NetGalley and Atria Books for a review copy of this book."}, {"userName": "Bj", "userReviewDate": "Mar 29, 2015", "userURL": "http://www.goodreads.com/user/show/27341466-bj", "userReview": "*I gave this audiobook a B for the story and A+ for the narration at AudioGals*If you’re looking for an audiobook that is unique, defies romance sub-genre conventions, and has a fantastic, theater like narration performance, then The Witch of Painted Sorrows may well be a great choice for your next listen. This story combines a number of my favorite romance sub-genres, including historical and paranormal romance, to produce an interesting combination that will likely appeal to lovers of either sub-genre. Bringing to life what living in Paris, France may have been like at the end of the nineteenth century, The Witch of Painted Sorrows explores both the intense, bohemian art scene, as well as, the influences of the occult that permeated certain circles of the Belle Époque. While the unusual subject matter would likely have been enough to initially draw my attention to give this title a try, without a doubt, what absolutely sold me as I started to listening was the off-the-charts performance. One word of caution though – if adultery is a hot button topic for you, then you may want to skip this one, as this romance ventures into the world of free love and mistresses that were somewhat prevalent in the day.For the full review see AudioGals."}, {"userName": "Dianne", "userReviewDate": "Mar 10, 2015", "userURL": "http://www.goodreads.com/user/show/7395171-dianne", "userReview": "Darkly enchanting, M.J. Rose’s The Witch of Painted Sorrows follows a young woman’s escape from a loveless marriage to the home of her courtesan grandmother’s mansion in the dazzling and magical city of Paris in the late nineteenth century. But has she traded one danger for another? In an era where the occult flourishes, the arts are the rage and women are still banned from a venerable artist’s college, Sandrine will find her true self, true love, true passion and true terror. Are the tales of LeLune true? Is there a witch among her ancestors? Has Sandrine been possessed by her or has the bohemian lifestyle she embraces simply shattered her finely honed façade and revealed the earthy woman she is meant to be? When unexplainable things happen, Sandrine fears that the tales her grandmother has only told her portions of as she admonishes her never to fall in love, may be more fact than dark fancy. Unless she learns to believe and determines what the past is trying to tell her, she may be the next victim lost to LeLune as she dares to explore love and life on her own terms. M.J. Rose has filled her tale with a veiled atmosphere that almost breathes darkness and turmoil. Her Characters are deep, passionate and are free-spirits bound only by the era’s social acceptance, rarely daring to step too far outside the box of propriety unless it is veiled beneath the current rage. Very dark, this tale has a raw magnetism that will draw the reader in and hold them until that very last page. If you are serious about literature that teases your imagine and pulls it onto a shadowed path, the rich eloquence of M.J. Rose’s words will resonate in your soul as part of an era long gone in a city that holds its own magic.I received this ARC edition from Atria Books in exchange for my honest review.Publication Date: March 17, 2015Publisher: Atria Books ISBN: 9781476778068Genre: Adult FictionPrint Length: 384 pagesAvailable from: Amazon | Barnes & Noble Reviewed for: http://tometender.blogspot.com"}, {"userName": "Nancy", "userReviewDate": "Jan 02, 2015", "userURL": "http://www.goodreads.com/user/show/7092147-nancy", "userReview": "A Paranormal Romance Set in Belle Epoque FranceSandrine Verlaine flees her New York home after her father's death leaving behind the husband whose corrupt business dealings were responsible for her father's suicide. In Paris, Sandrine is surprised to find that her grandmother, a famous courtesan, has left her lovely stone house and gone to live in a hotel. Sandrine's grandmother warns her against going to the house, but Sandrine is drawn to it. There she finds love and discovers a talent for painting, but the house is also filled with the spirit of La Lune, a famous courtesan, whose spirit begins to take over the girl. The setting in Belle Epoque Paris is historically accurate and well described. I enjoyed the detail and learned about the occult underground that flourished in that period. I was not as enchanted with the characters and the plot. I loved Rose's previous novels centered on Jac L'Etoile and the perfume business. For me, Sandrine hasn't the appeal and the paranormal seems a bit heavy handed. The grandmother is an interesting character, but I thought her developmen hard to reconcile with the self-contained business woman at the beginning of the novel. If you're a fan of Rose's books, you may enjoy this novel. However, I can't recommend it as highly as her previous books. I reviewed this book for Net Galley."}, {"userName": "Jennifer", "userReviewDate": "Feb 21, 2015", "userURL": "http://www.goodreads.com/user/show/2473504-jennifer", "userReview": "I can appreciate a good ghost story, and The Witch of Painted Sorrows does not disappoint. It's historical, cultural, artistic, mysterious, supernatural, suspenseful, seductive, passionate, erotic...shall I go on? Author M.J. Rose writes with a dark and gothic tone, and I honestly didn't expect to like this novel so much but I was intrigued from the first chapter. I don't want to spoil any of the storyline because how it all plays out is part of the big reveal at the end, so I'll just say that I enjoyed The Witch of Painted Sorrows and would recommend it to fans of gothic fiction. Also, if you have access to the audio version, it is well-done and the accents helped transport me to the characters' country and time. Check it out!My favorite quote:“Love,” I wanted to shout, “was the only reason to do anything, the only value worth living for, a goal truly worth making any sacrifice for.”"}, {"userName": "Kenzie", "userReviewDate": "Dec 31, 2014", "userURL": "http://www.goodreads.com/user/show/11746220-kenzie", "userReview": "I loved the setting of this book -- beautiful and dark Paris in the late 1800's -- and found myself immediately sucked into both the story and the surroundings. The Witch of Painted Sorrows was filled with mystery, magic, and romance. You could feel the passion and sensuality through M.J. Rose's writing. I also loved her descriptions of the paintings and the emotion that the characters felt and had. Sandrine was an interesting main character and I couldn't help but be more curious about her background and her story. I was intrigued and fascinated by La Lune as well. The background and family history was unique and interesting. I loved her grand-mere and would have loved to learn a little bit more about her and how she became a courtesan. The ending caught me off guard, but I rather liked it. *E-book received in exchange for an honest review via NetGalley*"}, {"userName": "Artemiz", "userReviewDate": "Nov 05, 2014", "userURL": "http://www.goodreads.com/user/show/7534408-artemiz", "userReview": "The Witch of Painted Sorrows by M.J. Rose was a good story. Unfortunately this story did not speak to me as the previous books that I had read by M.J. Rose. My problem probably is that i read recently Erotic Exchanges: The World of Elite Prostitution in Eighteenth-Century Paris and that's why I could not enjoy the story as I should, since I inadvertently compared the information.But the story itself is interesting. It's not like the usual overpowering spirit stories. Sandrine Salome is a descendant of long road of ladies of demimonde and artists. Most of those ladies have met with sad ending and according to legend the very first of them - La Lune - is responsible for their tragic love stories and their grisly ends, since she was the first to lose her love, to turn to witch for help and to become witch herself. As long as the woman of Verlaine family did not fall in love, they were safe, but if they did ...When Sandrine meets Julian in her grandmothers house she does not understand what she has awakened, since nobody has told her the legend, but the legend gets more and more power day by day and at the end Sandrine has to make a choice - to lose the one she loves or to save her love, her dreams and to share her life with the one who will help her to save her love.This story is filled with art and literature and love and myths. It's a good story!"}, {"userName": "Erica", "userReviewDate": "Feb 18, 2016", "userURL": "http://www.goodreads.com/user/show/2644090-erica", "userReview": "Oh, man.What was I thinking? How'd I even get my hands on this book?After three chapters, I knew I was very much in the wrong place.That cover? It looks YA. I think that plus the title may have been what mislead me. It's not YA. It's also not the type of magical-realism/witchy book I enjoy. Oh, yes, I know everyone else drinks this kind of thing right up but me? Nah, it's not my cup of tea.This tea is made of rose petals, starlight, belladonna, and some arsenic. It is served with sugar, cream, and a splash of some spicy liqueur in a 14-karat gold-rimmed bone china cup that's hand-painted with pink peonies and yellow roses. You hold it with your pinky finger in the air and think of pretty things, female things, catty things, naughty things, dark things (but not too dark) and you smile knowingly.My tea is hot, black, and comes in a .5litre taupe stoneware mug. I grab it with my fist and I go about my business.This book and I, we are not meant to be.I hope the rest of you enjoy it, though!"}, {"userName": "Rachel McMillan", "userReviewDate": "Dec 18, 2014", "userURL": "http://www.goodreads.com/user/show/2201736-rachel-mcmillan", "userReview": "from blog: I was completely in the mood for this book: which is thick and dark and magical and enchanting and suited the darkest night of the year. A perfect Solstice book! It is a treatise on liberty and passion woven with a deft pen that understands the complex nature of art, but also inserts a magical tapestry of precise historical authenticity. Perfect escapist fiction, The Witch of Painted Sorrows features impeccable descriptions of artistry, witchery, magic and dark spiritualism set against the lush and unmistakable canvas of the Belle Epoque. It is romantic and savoury, especially upon Sandrine's encounters with the dashing architect Julien. While she is all romance and magic, he is all precision and atheism and the two clash in mind and spirit all the while against age-old sorcery, enchanted baubles, slick-cobblestoned alleys and spirits that go bump in the night.Sandrine even dresses as a man in order to gain admittance to a renowned art school, her form and talent becoming more and more unmistakable as she realizes that her hand may hold the brush that spreads paint wide and colourful and evocative, but her spirit is melded with someone elses.The descriptives are perfect, the sensual whiff of Parisienne culture and custom transformative. Paris is as much a character as any dimensional human borne of Rose's pen. Alchemy, The Picture of Dorian Grey, the promise of life eternal......all intertwined with the magic of a gorgeous, gilded era.I enjoyed this sumptuous book immensely, though I do warn readers of stark mature and sexual content. To add, those sensitive to dark arts may be off-put by Sandrine's possession by La Lune, the exorcisms she undergoes, and the uninhibited passions, wrongs and triumphs as La Lune attempts to find peace as a wearied soul.Not for everyone, but perfect escapist fiction. If you don't mind some rated 18A content, then treat yourself to Rose's talented pen. note: I received this book from Netgalley in exchange for an honest review."}, {"userName": "Marcee Feddersen", "userReviewDate": "Dec 23, 2014", "userURL": "http://www.goodreads.com/user/show/3963830-marcee-feddersen", "userReview": "This book was a wild ride. Set in the late 1800's in beautiful, but dark Paris, Sandrine has fled America to escape her brutal husband.She arrives at her courtesan grandmother's house to find it closed up and her grandmother living in a lavish apartment, and not too happy to receive a runaway granddaughter. Not because she doesn't love her granddaughter, but because she is fearful for Sandrine if she is in Paris.Sandrine disobeys her grandmother's wishes and goes to their family home, handed down through generations of her courtesans ancestors. While visiting there, she meets a handsome architect who is cataloguing the estate. Sandrine finds herself inexplicably drawn to a previously hidden bell tower and then to the discovery of a ruby necklace,And then her adventure begins. She discovers that she is suddenly a talented painter, when previously she had failed, she finds passion with Julien, when she had always thought of herself as frigid, and she finds the confidence to pursue what she wants, whether it's admission to a male only art school or another woman's fiance.This was a great mix of a gothic love story, mixed with a ghost story. The only word for the writing was lush. The ghost story was scary, the love story was passionate, and reading it made you felt like you were in the dark, slightly sinister Paris of the 1800's.I will say the ending was a bit of a kicker for me. I wasn't expecting that, and at first I was taken aback, but then I decided it's nice when you don't have the typical ending.Thank you to NetGalley and Atria books for giving me this ARC for review."}, {"userName": "Sandi *~The Pirate Wench~*", "userReviewDate": "Mar 06, 2015", "userURL": "http://www.goodreads.com/user/show/1849875-sandi-the-pirate-wench", "userReview": "Setting: 1894 Paris3 1/2 StarsAfter the tragic death of her father, New York Socialite Sandrine flees to her grandmothers mansion in Paris to escape the husband that was the cause of her fathers death and his abusive behavior towards her as well. A famous courtesan, Sandrine's flamboyant grandmother, has had this mansion for a long time and it has been home for a long line of courtesans. When Sandrine arrives and finds her grandmother doesn't live in the mansion anymore she is curious as to why, and also why it is being renovated and her grandmother lied?Sandrine also ignores her grandmothers fears that it is haunted and that she is in danger.She decides to explore the house and she discovers a hidden chamber with erotic paintings.Something has been going on since she arrived..a connection of something between her, the past, and now the present.Sandrine is affected by these painting's and she feels the need and the urge to paint and the desire to explore her sensual side. She continues to ignore her grandmother's increasing hysteria that some sinister influence is at work...until it maybe too late.I had a little trouble at the beginning getting into this book. I don't know if it was just the writing itself or I found it didn't have enough \"meat\" to keep my attention. But I'm glad I stuck with it as the author did a great job of skillfully re-creating the historic \"Belle Epoque Paris\" with super natural mystery and vivid characters as well. It was both fascinating and haunting and I look forward to see what she comes out with in the next book of this trilogy."}, {"userName": "Darlene", "userReviewDate": "Mar 04, 2015", "userURL": "http://www.goodreads.com/user/show/1603234-darlene", "userReview": "Originally posted on Peeking Between the Pages: http://www.peekingbetweenthepages.com...The Witch of Painted Sorrows is the newest novel from best-selling author M.J. Rose. I really didn’t think she could top the last series I read of hers that I loved but she has and in a big way and it starts with this absolutely beautiful book cover. The Witch of Painted Sorrows is the first in a new series and it is utterly fantastic! I was swept away to 1890s Belle Époque Paris and into an enthralling gothic tale full of the supernatural and a sensuality that drips of the page.Sandrine Salome has come to Paris to her grandmothers to escape her dangerous husband. Sandrine has always loved her grandmother’s mansion and is mystified when she arrives to find it all closed up. Apparently her grandmother is renting an apartment while renovating the mansion and even more troubling is how evasive her grandmother is being about all of it. Sandrine’s grandmother insists that she leave Paris as soon as possible; that it’s not safe for her to stay there. She warns her to stay away from the house as well but this is something Sandrine finds impossible because she feels such a pull to it. It’s like the house is alive for her and needs her to be a part of it. With her grandmother not there Sandrine meets the handsome Julien and the bell tower that she was never meant to find. The bell tower is the beginning of Sandrine’s journey into the occult, the hidden night world of Paris, and into the life of a long ago courtesan and witch called La Lune who has no intention of ever letting Sandrine leave Paris or the house.Upon discovering La Lune and the bell tower Sandrine’s life begins to change. She discovers that she can paint and extremely well. She finds that she’s not the cold and sexless woman she felt she was with her husband. She has an erotic side to her just waiting to be released. Yet with the good comes the bad and something is trying very hard to possess Sandrine and take over her life. The question is will it succeed?Once again I am amazed by the captivating story that M.J. Rose can spin. I know when I delve into a new book she’s written that I’m going to be glued to it until I turn the last page and it was even more true with The Witch of Painted Sorrows. I love the paranormal and everything that goes with it so this book was perfect for me and I enjoyed each and every minute. I love how vividly the author built Sandrine’s world with the painting, possession, and erotic romance so much so that I could see the scenes flashing by in my mind. My only complaint is now having to wait for the next one and really it can’t come soon enough!The Witch of Painted Sorrows has something for everyone – historical fiction, erotic romance, and the supernatural. Highly recommended!"}, {"userName": "Kimberly", "userReviewDate": "Jan 11, 2015", "userURL": "http://www.goodreads.com/user/show/10525991-kimberly", "userReview": "Within the pages of The Witch of Painted Sorrows by MJ Rose you will find Sandrine Salome a married woman with no understanding or experience of romantic love who has lived a 'passionless' married existence. In order to understand her reasons for leaving New York City to go to her grandmother's home in Paris, France, you will need to meet La Lune. I don't want to give away too much but Sandrine's journey of self-discovery will thrust her into a world of occult ridden Belle Epoque Paris. The question remains who does she become and will she survive?If you enjoy the artists of Belle Epoque Paris, i.e. Gustave Moreau, Ecole des Beaux Arts, parisian mansions, sexy handsome men and a grandmother who is let's say anything but dowdy, then my friends you will definitely enjoy The Witch of Painted Sorrows. Sandrine's romantic suitor, Julien Duplessi is a fellow art lover, living in a parisian mansion with every interest in getting to know the beautiful and shy Sandrine. Against her grandmother's warnings, what follows is a tale so beautifully written with erotic scenes of lovemaking and what is thought to be true passion could be veiled by a sinister ghostly spirit named La Lune! The Witch of Painted Sorrows is the first in a new series, so you may have an open-ended ending and some situations might not be immediately explained or revealed enough to the reader's satisfaction. I say this because if you are expecting every question to have a solution or answer immediately, you might be frustrated. However, for me I did not find this problem. Instead, the ending is fantastic and not predictable. It leaves you yearning for the next book in the series. I want to know what will happen to certain characters how their life evolves. I loved the scenes in those parisian mansions with Sandrine and Julien discussing art, artists, making love in that art studio, walking through Paris, eating in those beautiful cafes. Oh, MJ Rose brings adventure, lust, love, possession and occultism to you in the form of The Witch of Painted Sorrows and I hope every reader enjoys it as much as I have."}, {"userName": "Althea Ann", "userReviewDate": "Mar 15, 2015", "userURL": "http://www.goodreads.com/user/show/3846743-althea-ann", "userReview": "The cover and the description of this book lured me in like a witch's spell of compulsion...I have to admit that I'd previously read one other book by this author, and I really didn't like it very much. This one is silly and melodramatic to the extreme - but I enjoyed it.Sandrine Salome Verlaine (the name right there tells you a lot about what this book is like) arrives in Paris, fleeing personal tragedy and a bad marriage. Arriving unexpectedly upon the doorstep of the grandmother she hasn't seen since she was fifteen, she expects a loving welcome.However, her grandmother, a famed though aging courtesan, seems oddly trepidatious about Sandrine being in Paris. And when Sandrine starts pursuing a newfound love of art, she becomes even more apprehensive.Little does she know that, against her directives, Sandrine is secretly snooping around her childhood home and associating with the handsome young architect she's hired for a renovation.Soon, Sandrine is caught in a swirl of secrets and sex; mixed with occult rituals and the legends of her family concerning a long-dead courtesan and (it is rumored) witch, known as La Lune...Will Sandrine's grandmother save her from the arcane influences that are sweeping her away? Does she even want to be saved?As I said, the melodrama is on full display. There are plot events that happen for no reason at all other than the drama. We're not aiming for a realistic depiction of France or the time period, here. However, I have to award extra points for Gustave Moreau as an art professor! Recommended for those in the mood for a sexy, fun read with a dark occult element.Many thanks to NetGalley and Atria books for the opportunity to read. As always, my opinions are my own."}, {"userName": "Lilac Wolf", "userReviewDate": "Nov 05, 2014", "userURL": "http://www.goodreads.com/user/show/4646172-lilac-wolf", "userReview": "This book is mesmerizing. I can't believe how much I enjoyed my time in this world. Sandrine is a wonderful character. She is grieving for her father and running from her husband. With little choice she ends up with her grandmother, who happens to be a courtesan. France certainly has a history of that. But her grandmother refuses to discus family history with Sandrine. A lot of trouble may have been saved if she had.Sandrine discovers Julien, an architect with a growing career. Then she discovers the artwork of an ancestor, the one who had the house built, La Lune. The two events become intertwined with Sandrine's dual obsessions with her own artistic path and her affair with Julien.The descriptions of events paint such a picture! When Sandrine is lost in her painting, it makes you feel the energy and passion. Then you want to paint, as well. Then when she is lost in her love affair with Julien...let's just say it is very sensual.I can't really fit this book into any one category. It's part historical fiction, part romance, part women's literature. A seriously good read full of art, culture and steamy romance."}, {"userName": "Alisha-Dear Constant Reader", "userReviewDate": "Feb 09, 2015", "userURL": "http://www.goodreads.com/user/show/2463184-alisha-dear-constant-reader", "userReview": "Boring, boring, why is this book so boring? Oh, Sandrine, you dull, dull woman. For a supposedly strong character, Sandrine is achingly weak. \"I'm going to be who I was meant to be, by pretending to be other people!\" Blah! The Witch of Painted Sorrows reads like a fantasy of what a weak woman thinks a strong woman must be like. That's Sandrine.Sandrine is a terrible character, but beyond that, the plot is painfully slow. Any time things felt like they were moving along, Rose decided to toss in a paragraph or two about color and paint, or long rambling antiquities descriptions that didn't add a thing to the plot. I love a good mood as much as the next reader, but the heavy handed way that these details were applied suggest globing it in, rather than gentle touches.Overall, the plot is loose and flimsy, tied together with meh sex, cliche French stuff, and a dash of the occult. It's completely forgettable."}, {"userName": "MartyAnne", "userReviewDate": "Jan 06, 2015", "userURL": "http://www.goodreads.com/user/show/5731600-martyanne", "userReview": "In __The Witch of Painted Sorrows__, M.J. Rose writes a tale weaving from a place, time and history in Paris with forces of naiveté, of worldliness, and perhaps a small amount of magic. One single flaw I found was the reiteration of the foreshadowing,rendering it unsubtle. It is as if the author was desperately trying to prepare us, again, for the fate of the final page."}, {"userName": "Cheryl Kravetz", "userReviewDate": "Jul 02, 2014", "userURL": "http://www.goodreads.com/user/show/8288796-cheryl-kravetz", "userReview": "Witch of Painted Sorrows – March 17, 2015 Atria Books By M.J. RoseReviewed by Cheryl KravetzTravel back in time to the magically beautiful world of Belle Époque Paris, where you will meet Sandrine Salome, a young woman who is running away from an abusive husband in New York to her grandmother's mansion in Paris. Sandrine’s grandmother is a favored courtesan who entertains men at the highest level in Paris, following in the many haunted footsteps of her glamorous ancestors.La Lune, the house named for one of Sandrine’s ancestors, world renowned for its lavish art collection and elegant salons, is closed and being renovated. Sandrine’s grandmother insists it's too dangerous to visit but an unseen force is drawing Sandrine home. At the house, she meets Julien Duplessi, a handsome architect, who introduces her to Paris and its art world, forbidden occult underground, nightclubs as well as to desires she never knew existed. Slowly, Sandrine is overcome by the spirit of La Lune, a legendary sixteenth-century courtesan, a witch, and a brilliant artist, who exposes her to a darkness that possesses her very soul. The Witch of Painted Sorrows explores the brilliance and intrigue of Belle Époque Paris, brings to life the fine line between explosive passion, and complete abandon that can lead to ruin, and show how obsession can easily and completely take over a person, transforming that person into someone else. M.J. Rose has been one of my all-time favorite authors since I discovered her a few years ago with her book The Reincarnationist. And after reading an advance copy of her new book, The Witch of Painted Sorrows, coming March 17, 2015 from Atria, she has made it to the top of my favorite author list. I love the way she blends extensive research with her wonderfully vivid imagination, weaving a mesmerizing, spellbinding, intriguing, and completely fascinating story that will stay with the reader long after the book is finished. The only problem I can see with this book, is the fact that I have to wait nearly another year before M.J. has another book ready for publication!"}, {"userName": "Jo Reason", "userReviewDate": "Dec 24, 2014", "userURL": "http://www.goodreads.com/user/show/5203694-jo-reason", "userReview": "I loved it, what a great character is Sandrine, strong and willful in such a masculine world, she knows what she wants, but then again is it really her???. It started a little slow, but it was important as it gave depth for the rest of the novel. I loved the art references and details, well written and descriptions of the era and place, Paris in the 1890´s. This is a love story, ghost story and historical fiction. No as dark as it could be but it was just the right amount for me.Great title and cover art. My favourite part was the Eiffel Tower part. thrilling moments. There are some erotic moments which I enjoyed, but other readers might not, if this is the case skip them, don´t miss this book just for this.This is the first time I have read anything written by this author and I am very much looking forward to the second in the series.See the review plus other stuff on my blog,click here"}, {"userName": "Patti", "userReviewDate": "Dec 10, 2014", "userURL": "http://www.goodreads.com/user/show/10605505-patti", "userReview": "The Witch of Painted Sorrows was my first exposure to M. J. Rose's writing and it will not be the last. I enjoy a bit of escapist fiction from time to time and this book really fit the bill. The prose was just pleasantly purple enough to do justice to its setting in the Paris of Le Belle Epoque without being overwrought and gagworthy. Our protagonist Sandrine was a sympathetic and interesting character with a story arc that held my interest. While the plot was a little predictable at times, the journey was enjoyable because of the quality of the prose.I received an advance review copy of The Witch of Painted Sorrows from NetGalley in exchange for an honest review."}], "description": "Possession. Power. Passion. New York Times bestselling novelist M. J. Rose creates her most provocative and magical spellbinder yet in this gothic novel set against the lavish spectacle of 1890s Belle Époque Paris.Sandrine Salome flees New York for her grandmother’s Paris mansion to escape her dangerous husband, but what she finds there is even more menacing. The house, famous for its lavish art collection and elegant salons, is mysteriously closed up. Although her grandmother insists it’s dangerous for Sandrine to visit, she defies her and meets Julien Duplessi, a mesmerizing young architect. Together they explore the hidden night world of Paris, the forbidden occult underground and Sandrine’s deepest desires.Among the bohemians and the demi-monde, Sandrine discovers her erotic nature as a lover and painter. Then darker influences threaten—her cold and cruel husband is tracking her down and something sinister is taking hold, changing Sandrine, altering her. She’s become possessed by La Lune: A witch, a legend, and a sixteenth-century courtesan, who opens up her life to a darkness that may become a gift or a curse.This is Sandrine’s “wild night of the soul,” her odyssey in the magnificent city of Paris, of art, love, and witchery.", "title": "The Witch of Painted Sorrows\n      \n          (Daughters of La Lune #1)", "url": "https://www.goodreads.com/book/show/22608277.The_Witch_of_Painted_Sorrows__The_Daughters_of_La_Lune___1_", "average": 3.44, "cover": "https://images.gr-assets.com/books/1414642981l/22608277.jpg", "reviews": 751, "authors": [{"url": "https://www.goodreads.com/author/show/69003.M_J_Rose", "name": "M.J. Rose"}], "type": ["Historical", "Fantasy", "Fiction", "Romance", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/22608277-the-witch-of-painted-sorrows", "http://www.goodreads.com/book/show/25562025-the-witch-of-painted-sorrows", "http://www.goodreads.com/book/show/22608210-the-witch-of-painted-sorrows", "http://www.goodreads.com/book/show/678967.The_Reincarnationist", "http://www.goodreads.com/book/show/12147341-the-book-of-lost-fragrances", "http://www.goodreads.com/book/show/15802432-seduction", "http://www.goodreads.com/book/show/3856268-the-memorist", "http://www.goodreads.com/book/show/18144112-the-collector-of-dying-breaths", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/9409759-powers", "http://www.goodreads.com/book/show/38213061-leviathan-wakes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}