{"ratings": 282, "userreviews": [{"userName": "Patrick D'Orazio", "userReviewDate": "Nov 05, 2010", "userURL": "http://www.goodreads.com/user/show/4328815-patrick-d-orazio", "userReview": "This is the second book I have read recently that uses the template of a classic novel and layers over that the invasion of the undead. The first: Pride and Prejudice and Zombies, while entertaining based on the novelty of a comedy of manners having brain eating zombies in it, didn't flow quite as well as this re-envisioning of The War of the Worlds. Much like in the other book, the author here has let the original storyline remain in place, perhaps retaining upwards of 85% of the orginal text, while adding the additional concept of zombies being the result of the creatures that travel from Mars from earth and the residue found on their spaceships. The narrator does conjecture on this point (perhaps they passed through a field of asteroids,etc) but since this story retains its orginal ending, for the most part, we can assume that the martians did not intentionally bring this plague upon mankind, as they have no experience with bacteria on their own planet. I have always enjoyed War of the Worlds, including the movies that have been derived from it. Eric Brown does a solid job here adding an element that pretty much makes sense. The irony is that both the undead and the Martians have need of humans-for their flesh and for their blood, which makes them both horrifying, although it is made clear that the most pertinent fear of all in this story is of the undead, who are vast in number and without intelligence. It is interesting to compare and contrast the difference between the concept of being devoured alive vs. being sucked dry like a giant bloodshake and which of these two methods would be worse. While I would begin to grow weary of a great many full length re-writes of classics with zombies or other creatures of horrible legend if it became the fashion to do, I felt that P&P was an interesting novelty and WotW was a natural for a remake with the rotting fellows. Eric Brown hit the mark on this one and his own written passages smoothly transition with the rest of the novel-while it is clear what writing is his and not of the original just because of the subject matter, he does an excellent job in making the transitions from Wells to his own words seemless and unnoticeable, which is quite a trick given the original novel was written well over a century ago."}, {"userName": "Stephen North", "userReviewDate": "Oct 17, 2009", "userURL": "http://www.goodreads.com/user/show/1697928-stephen-north", "userReview": "Eric seemlessly adds zombies to the tale. I couldn't really tell where his voice ended and Mr. Wells started. If you are looking for gruesome violence you may want to look elsewhere, otherwise I think Eric did a great job."}, {"userName": "Spencer ♡", "userReviewDate": "Feb 17, 2015", "userURL": "http://www.goodreads.com/user/show/40356450-spencer", "userReview": "I was pleasantly surprised by this book. I had it for a long time before I decided to start reading it in October 2015. I figured that, hey, it was Halloween season and Halloween means spooky things, so why not finally read the book about aliens AND zombies? That’s a pretty awesome combination if you ask me, so I really don’t remember why it took so long for me to read it. I definitely don’t regret it, though.One of the things I was most concerned about when I first started the book was how well Eric Brown’s writing would mesh with H.G. Wells’. Wells is, obviously, one of the driving forces in the science-fiction genre, so it was only natural that I worry about some modern-day writer coming in and possibly butchering a classic story with modern lingo and lots and gratuitous blood. Listen, I know Plus Blood, Guts, and Zombies is in the title, but there can be too much blood in a book. I first read the original The War of the Worlds for school one year and I had enjoyed it, though I was young enough that I couldn’t quite appreciate it yet.My worry was unfounded. Somehow or another, Brown managed to replicate Wells’ voice in such a way that, if I hadn’t read the original book, I might have had trouble being able to tell where Wells’ stopped and Brown began and vice versa. It was amazing how seamlessly the zombies (and extra blood and guts) were knitted into the original story. Considering that the original is already about Martians, I can’t really say that the addition of zombies was entirely natural, but all things considered, it was a match made in heaven. I don’t know if anyone else could have pulled it off the way Brown did. I have a lot of respect for him after impossibly making a classic story even more appealing to people like myself. I loved this book, I really did. It sounds crazy. It sounds insane. Who would put zombies in the The War of the Worlds? Eric S. Brown, that’s who. And it was a wonderful, amazing idea. This was so much more fun than you’d expect. It sounds like it might be dumb, I know it does based on that title, but it’s way better than you’d think. I’d love to find the time to reread this book one day. I really do recommend it, both to people who already like science fiction and classics, and people who aren’t super into either but might like to give one a try. It’s unbelievable. Definitely read this book if you have the slightest interest!"}, {"userName": "Jill", "userReviewDate": "Aug 03, 2011", "userURL": "http://www.goodreads.com/user/show/5574453-jill", "userReview": "Invaders from the Red Planet come to earth, causing zombies to swarm the planet, thus threatening all of mankind instead of just Great Britain. *** The possibility of life on other planets has been written about in many genres, especially science fiction. Author Eric S. Brown’s fascination with zombies has led him to modify H.G. Wells classic, “War of the Worlds”. While the Mars invaders in that original novel were limited to Great Britain, here zombies are created worldwide, as particles falling off the Martian spaceships spread throughout earth’s atmosphere.Brown’s version can be liken to his purchase of a frosted cake from a bakery to which he added a few sprinkles for decoration whereupon he takes credit for creating the entire confection. To say that the addition of zombies to this timeless tale is superficial is an understatement. Unlike Well’s original, this version needs additional editing. There are some sentences with either a misspelled or missing word. For example on page 87, “It was my unfortunate luck that a dead man already killed the ditch home.” There are also a few minor formatting issues, although they do not affect the flow of the story. Readers interested in other War of the Worlds adaptations can read George H. Smith’s, “The Second War of the Worlds”; Was and Manly Wade Wellman’s “Sherlock Holmes’ War of the Worlds”; J.M. Dillard’s “War of the World’s: The Resurrection”; Max Allan Collin’s “War of the Worlds Murder”; Tony Wright’s “War of the Worlds: Aftermath”; Douglas Niles’ “War of the Worlds: New Millennium”; Gabriel Mesta’s “The Martian Wars”; or, “War of the Worlds: Global Dispatch” edited by Kevin J. Anderson.Readers interested in other zombie tales can read any one of Eric E. Brown’s numerous books on zombies or “World War Z” and “The Zombie Survival Guide” by Max Brooks."}, {"userName": "Jean-Pierre Vidrine", "userReviewDate": "Jul 08, 2011", "userURL": "http://www.goodreads.com/user/show/3313006-jean-pierre-vidrine", "userReview": "When the first of these classic books with horror elements added turned up, I didn't think I would bother with any of them. Maybe I convinced myself that what was done was a crime against the long-dead author. Then this book turned up. I couldn't deny that I was curious. That's when I realized that the reason I wasn't interested in the other zombified classics had nothing to do with sensitivity to the original authors' integrity. I simply wasn't interested even in the original book, let alone any reworked version. But I was definitely a fan of the original War of the Worlds. For me to dismiss this work simply because it revamps and old classic would be hypocritical. I'm a huge fan of Orson Welles' radio play, George Pal's movie, and Marvel Comics' excellent Killraven series. So, I had to check out this book.Upon finishing the book, I was a little uncertain about how I felt about it. Surprisingly, this \"Blood Enriched\" version didn't feel so very different from the original. Eric Brown very nearly seamlessly writes in H. G. Wells' style, but for a word usage here and there that had me scratching my head. Perhaps I was expecting this book to be far more radically different from the original. I failed to reckon that Wells' novel did have elements of a good horror story already. After all, it is a story about inhuman monsters attempting the wholesale slaughter of humanity. Eric Brown just introduced a second group of monsters. Eric did have more of a voice in the ending of the book, however. The famous ending of the Martians remains as Wells wrote, but there is more. With all of the above stated, I did enjoy reading this novel. And that's all that matters."}, {"userName": "Tony Mosley", "userReviewDate": "Jan 31, 2017", "userURL": "http://www.goodreads.com/user/show/59818315-tony-mosley", "userReview": "I like how the book puts you in the perspective where you can visualize the story like its a movie. It also shows you in detail how advance earth was in their time and how the outbreak effected it. Plus the novel gives you a feel of how the characters reacted to the conflict and how they are dealing with it."}, {"userName": "Rick sullivan", "userReviewDate": "Aug 06, 2012", "userURL": "http://www.goodreads.com/user/show/10137288-rick-sullivan", "userReview": "I was really impressed with this. I had thought that it would likely be campy and silly but I honestly couldn't really tell where Wells left off and Brown started. Not without sitting down with the original. Brown worked the zombies very well into the original plot and did it in a logical manner. A very, very good read. Wells fan of \"War of the Worlds\" won't be disappointed."}, {"userName": "Tessie", "userReviewDate": "Oct 10, 2012", "userURL": "http://www.goodreads.com/user/show/5782822-tessie", "userReview": "Entertaining book. I enjoyed it. I loved the original book so when I saw this in the store I had to see what it was like. It kept me entertained and was a fast paced book. Good read for Halloween time of the year. I like the subtle message that we should learn to live for the moment because you never know what the future may bring!"}, {"userName": "John", "userReviewDate": "Feb 04, 2013", "userURL": "http://www.goodreads.com/user/show/4192809-john", "userReview": "Interesting take on H G Wells, just OK not great. But entertaining."}, {"userName": "Christy S", "userReviewDate": "Apr 03, 2011", "userURL": "http://www.goodreads.com/user/show/2817589-christy-s", "userReview": "most excellent!!"}, {"userName": "Nancy", "userReviewDate": "Nov 14, 2012", "userURL": "http://www.goodreads.com/user/show/13279784-nancy", "userReview": "I was pleasantly surprised that I remembered as much as I didof the original. And the introductionof the zombies worked really well."}, {"userName": "Terri Luer", "userReviewDate": "Mar 29, 2011", "userURL": "http://www.goodreads.com/user/show/1456630-terri-luer", "userReview": "It's as if zombies should have always been present in The War of the Worlds."}, {"userName": "Andrew #2!", "userReviewDate": "Jan 09, 2014", "userURL": "http://www.goodreads.com/user/show/3282527-andrew-2", "userReview": "3.5"}, {"userName": "Karielle at Books à la Mode", "userReviewDate": "Jan 21, 2011", "userURL": "http://www.goodreads.com/user/show/1127449-karielle-at-books-la-mode", "userReview": "Blurb: The classic science fiction tale that will eat your brains!Never before in the history of warfare had destruction been so indiscriminate and so universal.Panic descends upon planet Earth once more as H.G. Wells's terrifying cosmic invaders blaze a path of fiery destruction across Victorian England, leaving thousands of undead in their wake. Our adventurous narrator must survive the apocalyptic alien threat while fighting off raging, bloodthirsty zombies. Who will triumph when man, Martian, and flesh-eating monster meet? Packed with fearsome supernatural creatures at every turn, Wells's original masterpiece is scarier, gorier, and more suspenseful than ever!What Stephanie Thought: I haven't read the original The War of the Worlds, so when I picked up The War of the Worlds, Plus Blood, Guts, and Zombies, I wasn't entirely sure what to expect. Maybe if I had read the rudimentary novel, I could have enjoyed it more, but not having done so, I found much of this book disappointing.I normally am a fan of science fiction because of the element of the gory and of the unknown. I was excited to read this because I knew it would involve zombies, but the zombies played very minute roles in the plot.I'm not sure why this had to be drawn out to 306 pages, but the best way I can explain what happens is that a mysterious cylinder carrying Martians appears, containing a Heat-Ray gun that zaps dead people into zombies. A few days later, another cylinder appears, containing more Martians, and another gun. Then a THIRD cylinder appears...and it's pretty much self-explanatory from there. Aside from the three cylinder appearances, nothing actually happened within the book, making it really hard to finish. In terms of style, it wasn't difficult to get through, which was pleasant because usually classics take a little more analyzing than usual. The quality of the writing however, was very bland and unmoving. There's this one scene with the zombies that attempts to be extremely bloodletting: \"Their brains must have cooked inside their skulls like eggs frying in a pan.\" Okay, \"eggs frying in a pan\"? Real original. Real horrific. Nothing particularly motivated me to keep reading. It took me a while to finish the whole novel, and though it was a pretty facile read, in the end, I felt like I didn't get anything out of it.The War of the Worlds, Plus Blood, Guts, and Zombies wasn't the worst I've read, but it definitely isn't something I'd be interested in reading again. The monotonous way the author writes seems to drone on and on, and the action never presents itself as suspenseful or the least bit amusing, even.Stephanie Loves: \"I crouched at the foot of the staircase with my back to the wall, shivering violently. Then I heard the screams from outside, down the road. The voices I heard belonged to the living and now the dead had found them. I shuddered and prayed for their souls.\"Where Stephanie Got It: Paranormal Haven for review.Radical Rating: 5 hearts- Satisfying for a first read, but I'm not going back. ♥♥♥♥♥"}, {"userName": "Megster", "userReviewDate": "Dec 18, 2010", "userURL": "http://www.goodreads.com/user/show/4004103-megster", "userReview": "The original War of the Worlds story is somewhat difficult to wade through just because of the 18th century style of storytelling, which is rather dry and impersonal. Although the action in the book is intriguing, the narration seems detached and unaffected, as if too much time has passed between the events of the story and the time the narrator is telling the story. The zombie action is pretty lame so far. I ended up not finishing the book. It was on loan through work (bookstore) and there were other things I wanted to read. Perhaps I'll revisit it during a self-imposed zombie book-a-thon."}, {"userName": "Regina", "userReviewDate": "Jun 23, 2011", "userURL": "http://www.goodreads.com/user/show/5426510-regina", "userReview": "this was alright but I really don't feel that the author added much at all... I would recommend just reading the original War of the Worlds and don't bother with this one... shame really as I did enjoy Pride, Prejudice, & Zombies..."}, {"userName": "Tim Dunn", "userReviewDate": "Aug 03, 2011", "userURL": "http://www.goodreads.com/user/show/5954467-tim-dunn", "userReview": "90% War of the Worlds, 10% Zombies added, not really that great. I loved War of the Worlds, so it's hard to knock that part, but very light on anything actually added to the story. Not worth the time to read it, just read the original and imagine the rest and save yourself time and money."}, {"userName": "Rachel", "userReviewDate": "Jan 06, 2010", "userURL": "http://www.goodreads.com/user/show/2821053-rachel", "userReview": "Ponderous and depressing. I struggled to finish it."}, {"userName": "Samori705", "userReviewDate": "Jan 31, 2011", "userURL": "http://www.goodreads.com/user/show/4344228-samori705", "userReview": "Too complicated. The language was from a different time period"}], "description": "The invasion begins . . . and the dead start to rise. There's panic in the streets of London as invaders from Mars wreak havoc on the living, slaying the populace with Heat-Rays and poisonous clouds of black smoke. Humanity struggles to survive against technology far beyond its own, meeting fear and death at every turn. But that's not the only struggle mankind must face. The dead are rising from their graves with an insatiable hunger for human flesh. Friends, neighbours and loved ones lost to the war of the worlds are now the enemy and the Earth is forever changed. It's kill or be killed, if you want to survive, otherwise you might become one of the walking dead yourself.", "title": "The War of the Worlds: H.G. Wells's Classic Plus Blood, Guts and Zombies", "url": "https://www.goodreads.com/book/show/6490135-the-war-of-the-worlds", "average": 3.83, "cover": "https://images.gr-assets.com/books/1348763639l/6490135.jpg", "reviews": 20, "authors": [{"url": "https://www.goodreads.com/author/show/101327.Eric_S_Brown", "name": "Eric S. Brown"}, {"url": "https://www.goodreads.com/author/show/880695.H_G_Wells", "name": "H.G. Wells"}], "type": ["Horror", "Horror", "Humor", "Fiction", "Science Fiction"], "outlinks": ["http://www.goodreads.com/book/show/6490135-the-war-of-the-worlds", "http://www.goodreads.com/book/show/9329837-the-war-of-the-worlds-plus-blood-guts-and-zombies", "http://www.goodreads.com/book/show/10488331-the-war-of-the-worlds-plus-blood-guts-and-zombies", "http://www.goodreads.com/book/show/8308089-bigfoot-war", "http://www.goodreads.com/book/show/11725411-dead-in-the-woods", "http://www.goodreads.com/book/show/6658090-season-of-rot", "http://www.goodreads.com/book/show/22020393-kaiju-apocalypse", "http://www.goodreads.com/book/show/38312463-casper-alamo"]}