{"ratings": 4372, "userreviews": [{"userName": "Elyse", "userReviewDate": "Mar 15, 2018", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "Update News: WINNER OF THE NATIONAL JEWISH BOOK AWARDManuscripts had laid undisturbed more than 300 years. A discovery had been made.Helen Watt, British historian is 64 years of age with failing health. She used a cane to walk. She has Parkinson’s disease. Helen’s strength -knowledge & passion for history and Jewish studies stand out - her ruthless commitment to her work reflect who she is - but her illness is quietly just ‘being’. Helen operates much bigger than her disease. She is not Jewish, but has done a lot of work with Jewish history and taught as University professor. Since Helen is about to retire at the University, she would like to go out with a bang. So there is some urgency and competitiveness in getting the documents she learns about to the college before anybody else gets their hands on them. Ian and Brigette Easton, lived in a house from the late seventeenth century. It was built in 1661 by Portuguese Jews. It changed hands a few times until 1910 when Brigette’s aunt bought the house and allowed it to deteriorate. Brigette inherited the property from her aunt. Their plan was to renovate and then open up a gallery in the house. The Easton’s had many building delays. It seemed that Brigette’s late aunt had spent decades offending members of every historical preservation group in the area. After The Easton’s finally obtained all the requisite permissions, the electrician found a stash of papers under their stairs. He thought they were Arabic. He didn’t realize the papers were dated more than 300 years ago— and the lettering was in Portuguese and Hebrew. NOTE — After finishing the book - I found it ‘a little’ funny that I remembered reading about Brigette’s aunt ‘offending’ people — ( who died before Brigette inherited the house). The more we get to know Brigette in this story - I can say ....”the apple doesn’t fall far from the tree”. Ian had been a student of Helen Watt at University—and he called her to come examine the papers they found in their house. Helen recognized some correspondence between 17th century Rabbis on the documents. She told the couple -(Bridgette & Ian), that the papers needed to be assessed before they could safely be moved.Helen tried to explain a little more to Brigette & Ian of what the electrician and covered. She explained that any document that contain the word God could not be thrown out in Jewish communities, but instead had to be buried as a person would be buried. Brigette ‘might’ have wanted to toss the found 300 year old documents away - if she could have gotten away with it....so she could get permits and just remodel her old house already. The woman represents everything annoying about ultra modern women today ...lol Synagogues, and religious Jewish communities stored these documents in troves called genizah’s, until a burial could be arranged. Helen was adamant that the papers found belonged to England’s history— and not the Jewish community. She believed the documents found belonged at a major research university.Helen needed help - and calls a colleague to recommend a post grad student to be her assistant. Aaron Levy, American Jew, a college post grad student had been working on his dissertation, but was struggling to finish it. He was trying to prove there was a Jewish connection with Shakespeare’s writing. Aaron, about 40 years younger than Helen, - 25 ish - resembled a man named Dror, from Helen’s past that she had history with. Whether or not it was because Aaron, reminded Helen, or Dror, from many years ago ( who we learn more about later in the book)— or because Aaron came off being a basic arrogant schmuck, - Helen & Aaron were not off to a good start as a cohesive happy team. Helen was aware right off the bat that Aaron didn’t like her much, but at least he didn’t pity her. The documents discloses letters written by Ester Velasquez, under the care of Rabbi Moseh HaCoen Mendes. Mendes fled Portugal - and went to Amsterdam after the Inquisition killed his parents and left him blind. From Amsterdam, he went to London to try to help with the Jewish community. There’s interesting facts about the struggles of the Jewish community during this time too - hiding their religious identity-or at least keeping it pretty quiet - but they were relatively safe in London- so many Jews didn’t want to rock the boat by pressing for more civil rights. Ester became the secret scribe for Rabbi Mendes. Her brother, Isaac, didn’t want the job. Ester was proficient in Latin & Greek - but even being literate at ‘all’ was astonishing for women in the 1600’s. She yearned for knowledge and to converse with the great philosophers ..(Spinoza, Descartes, etc.). The story of Ester is fascinating - she’s MORE than JUST a woman born before her time - a female radical thinker/ philosopher - She took huge risks that would be risky today. She took risks in signing the documents. She took risks with her communications in all her relationships - with both men and women She entered into a marriage for convenience with a homosexual- that some people today would judge harshly.And......Esters inquiry about God & Love - the existence of God - freedom to think freely - religious beliefs - social obligations - are presented in depth. I have been asking myself...., “If I HAD to pick a FAVORITE character in this novel .....would it be HELEN.....( with her inner strength).....I learned from this woman. She made me cry. Helen truly taught LIFE LESSONS - so subtle - but truthful - ‘emotions rise’.... and I saw just HOW STUBBORN we as people can be. CHANGE - changing our lives - even if we have dreams to make it better - can be so darn scary - Helen showed us what happens when we don’t take those risks. Or....Ester for OBVIOUS reasons ..... she never EVER stopped climbing the mountain— her life was a one-way ticket UP......she never stopped pressing the limits of her circumstances. She was incredibly inspiring. Even her mistakes - are forgiving. Or....*Aaron Levy*: I have a special heart for Aaron. I GOT HIM RIGHT AWAY! It helps to be Jewish to understand his pompous arrogance. I knew his attitude was just his outer shell ....and that once it was stripped away - we’d see a beautiful struggling soul. I have much more I’d like to say about Aaron....but I’ll leave it for discussion with my buddies who are reading this right now ( or have finished it)- Melissa ....Jan ....Lisa....and anyone else who wants to jump in for discussion.  My fear is I’d give spoilers away.....So.....“Melissa”..... I wanted to CRY *FOR* Aaron TWICE....Plus....I was SO MAD AT HIM TOO! I hated a choice he made.YIKES......Forgive me.....( nobody has to read this review)....I see I wrote it out of NEED to complete my OWN EXPERIENCE......( trying to)...I DON'T THINK I CAN CHOOSE A FAVORITE CHARACTER....I have a soft spot of all of them!!!!!I think this book is extraordinary, brilliant, ambitious, and exquisite! I took my time reading it. I looked up philosophers: Spinoza - etc. I thought about it when I wasn’t reading it. I wrote Melissa private messages - who read it before me - as I was dying to talk about it. I loved the scenes where Aaron is writing his friend Marisa who went to work on aKibbutz in Israel. The author got EVERYTHING about Kibbutzim life right!! I started craving my tomato and cucumber breakfast ( called the dairy meal). The volunteers staying on a Kibbutz would have contests with the Israelis as to who could dice their tomato & cucumber fastest. The Americans always lost. BUT.... by chance we did win....they had to give us a yummy chocolate bar. “The Weight of Ink” is a heavy-weight book: intellectually challenging and satisfying!!! .....Rachel Kadish is AMAZING!!!!The only time I had thoughts that maybe this book could have been cut shorter was once when Ester, Mary, Thomas,and John ....were on their boat on the river. I’m not sure why I felt that part went on too long ......yet I actually liked it too. My thoughts though were on another part of the story - curious as to what would develop. The SUPPORTING CHARACTERS are memorable, too!!!The dialogue is intimate- engrossing - authenticThe INNER THOUGHTS of THE THREE MAIN CHARACTERS: Helen, Ester, and Aaron are painfully - butterflies- in - my - gut- WONDERFUL!!There is history - Philosophy- Jewish history - theology: exploring christianity and Judaism. Interfaith relationships are explored - homosexuality - the existence of God- 17th century life: conditions of the times : The plague, and the fire in London. 20th century Kibbutz life in Israel- RICHNESS in SUBSTANCE. The roles of women are explored. There is mystery, tragedy, triumph, dreams and disappointments.....and GORGEOUS POETIC imagery!!!POWERFUL and WONDERFUL!!! “Where words are scarce they are seldom spent in vain, for they breathe truth that breathe their words in pain”. THANK YOU RACHEL RADISH!!!"}, {"userName": "Jaline", "userReviewDate": "Nov 08, 2017", "userURL": "http://www.goodreads.com/user/show/7234171-jaline", "userReview": "This book is a journey – through time (1600’s, mid-1900’s and early 2000) and space (Amsterdam, Israel, and London) whose only requirement is that we give ourselves over to the story being told and flow with it.I loved this book. The writing is exceptional and although it deals with history and philosophy primarily, it is not in any way dull or boring. The characters are extraordinarily well developed and contain such a treasure trove of human thoughts and feelings on so many different levels, that their very integrity led me to a deeper understanding of each one’s inner nature. And my own.”I care neither to defend nor attack him. Much as I detest the man, I’ll never know the full circumstances behind his choices. Life is muddy. Denying that – thinking there’s only one noble path above the fray – can be a poisonous approach to life.”The story is told primarily from two points of view. Ester, a young Jewish woman in the 1600’s whose passion for thought and philosophy in a time when women were impossibly shackled to hearth and home, grabbed my heart and held it through the entire book. Helen, an historian who is 64 and in the grip of an aggressive and accelerated onset of Parkinson’s disease, touched a profound level of empathy within me. I deeply admired her courage and dedication to the one opportunity remaining for her to shed light on a little-known aspect of historical significance.The relationships between the people in this book are so well written that I felt I was evolving along with them – or dissolving, as was sometimes the case.This book is a long, satisfying, fulfilling read and I highly recommend it to those who are willing to invest their time in learning something new, seeing life and living through different lenses, and experiencing the different times, places, and cultures found within these pages.Edited to add: Thank you to Goodreads friend Iona whose fabulous and enthusiastic review of this book caught my attention and caused me to put it on my priority reading list!"}, {"userName": "Ioana", "userReviewDate": "Sep 16, 2017", "userURL": "http://www.goodreads.com/user/show/1721356-ioana", "userReview": "Unlimited stars!!! WOW. SWOON. Fanning self. Holy Mother of Books. Absolutely awestruck by the pure MAGNIFICENCE of this BRILLIANT mellifluous poetic historically rich masterpiece... Unadulterated GENIUS. Whoa. AAA! I'm sure I could not string enough accolades together to do justice to Kadish's work. I had such a hard time thinking of where to begin this review because Weight of Ink is too incredible, really, to describe, at least by a non-poet like myself. Nothing I could say could ever do justice to this work and I feel like even trying to talk about it in mere-human language is doing it a disservice. But I'll try something, because in the very least, I hope to convince you to make some time for this book in your life.First off, The Weight of Ink is, quite literally, weighty. At over 550 dense, long pages, it takes Herculean effort, attention and dedication to get through. I know many of us like to read widely and don't always appreciate savoring a book for months, but my recommendation would be, if you're not ready to spend weeks on end reading nothing but this book, to set aside some time each week while also continuing your regular reading. I took an extended vacation this summer (to Israel, where this book is partially set) - and was happy to bask in these glorious pages without other distractions, but I rarely have that leisure or patience at hand on my regular days. Whatever you do, my recommendation is to please be patient with this book. The pleasures it offers forth are profound, but not if you approach it as a \"book to finish\". This novel is an experience that is best imbibed to the core.A very quick synopsis: the story alternates timelines between modern day England (and the story of academic historian Helen), Helen's coming-of-age in Israel some decades ago, and the 1660s Portugal/England Jewish community.But really, this is a story about BOOKS, reading, knowledge, and the passion that each of us, as readers, holds for these intangible but empowering and delectable pleasures. (This is why it's so important to let it seep through your entire being while reading, and not to rush). Helen is a historian who has come across a newly discovered genizah, a trove of Hebrew/Jewish writings from a 1660s Jewish-English household, and The Weight of Ink details her journey into the life of the scribe who has set down these words - a woman who may have had previously undisclosed links to Spinoza, a Jew excommunicated from his community for his 'heretical' beliefs. Helen's world, the scribe's world, Spinoza's world - all revolve around books/reading/documents. And that's just the beginning - again, I have no words really to adequately describe the poetic nature of Kadish's words, but her language is divinely inspired and does full justice to her themes.There may be other books that I consider just as brilliant but right now they've all been eclipsed from memory - The Weight of Ink is not just by far my most favorite book of the year, it may be the favorite for a lifetime. No other has ever paid such reverent homage to the art of books, knowledge, and reading."}, {"userName": "Melissa Crytzer Fry", "userReviewDate": "Feb 19, 2018", "userURL": "http://www.goodreads.com/user/show/3857699-melissa-crytzer-fry", "userReview": "This is one of those books that, when you close its covers upon reading the final pages, you know you’ve read something special. It is also the kind of book that, days later, sinks even deeper into your subconscious and makes you realize just how impressive a literary accomplishment it is.I was immediately intrigued by the dual-period style and the book jacket’s promise of a story about “two women of remarkable intellect.” I should note, up front, that rarely in dual-period novels do I find both stories equally compelling. I generally feel one is stronger and often favor the historical storyline, but in this novel, they both carried tremendous weight and were done so well!I suppose the beautiful cover drew me to this book as well, and the title with the word “ink” in it was part of the attraction – as I was an avid letter writer when I was younger (with pen-pals from across the world). I assumed – and was correct – that there would be epistolary elements to the book as well … another thing I love. But once wrapped inside the pages of this book, I was gripped by the incredible characters, full of depth and flaws, wants and desires, facing obstacles and celebrating triumphs. And did I mention the writing? The writing is gorgeous, poetic, lyrical and so adept at reaching inside the characters' heads and hearts! As my friend Jaline’s reviewsaid better than I have, here: \"The characters are extraordinarily well developed and contain such a treasure trove of human thoughts and feelings on so many different levels, that their very integrity led me to a deeper understanding of each one’s inner nature.\"It is a long book (560 pages with some very small print in some parts) and also includes a great deal of historical background, period language, and religious + philosophical themes. BUT these elements happen to be the VERY reasons I loved this book so much.1)\tLength – With the publishing industry’s typical 320-page standards, I often feel that many books feel rushed and underdeveloped emotionally. (Admittedly, some slim books still portray that emotional authenticity, but many do not). This book takes its time with a slow unspooling of history and character and flashback. And it’s all the richer for it. At the end, you will feel you know Helen Watt, Aaron Levy and Ester Velasquez.2)\tHistorical background/period language/– The book jacket reveals that this book focuses on Jewish documents (and, therefore one can assume, Jewish faith). I grew up in an Evangelical protestant area of rural Pennsylvania, so I came to this book with very little understanding of Judaism, Jewish history, or culture. I knew not a single person of Jewish faith growing up, and when I attended a Methodist college, still lacked exposure to this religion. That was NOT a detraction to reading this story; it was quite the opposite. This book taught me just how deep my ignorance was regarding the historic and continued persecution of those of Jewish faith (not just during WWII). I am humbled for the learning opportunity.3)\tReligion – If you are at all interested in religion, and maybe even if you’re not – how and why people have faith and why others do not, or why others have an alternative kind of faith – this is an excellent book that poses so many fabulous questions.4)\tPhilosophy – I will be honest. I absolutely abhorred the philosophy classes I took as part of a liberal arts curriculum in undergrad. And yet, I truly enjoyed the philosophical components of this book (of which there are many, and they are – as you might expect - written in realistic, stilted philosophical language). But they were so integral to this story, they fascinated me.I was hooked by this book immediately, so when I saw an incredible e-book deal, I bought it in addition to the hardcopy my husband bought me for Christmas. That means I am able to share some of the highlights from my Kindle on my Goodreads review. I hope you’ll enjoy them. And if you can’t see them, let me know and I will paste some into the body here.This really is a story of intellect in so many ways: the literary way in which it’s written; the exposure to current academia (which includes some fun being poked at the rigors of academic research); and the intellect of the characters, themselves.It is not a ‘light’ read. But it is satisfying and sustaining. It’s the kind of story you want to commit to – and by that, I mean, don’t rush it. Take your time. Savor the incredible literary language and metaphors, get to know the characters and their secrets, enjoy the slow unraveling of an interesting mystery rooted in historically accurate details, enjoy the new historical insight you may gain.If you enjoy dual past-present storylines, literary fiction, Shakespearean references, unapologetic women, and a mystery hidden within, read this book! If you love the written word and others who love the written word, read this book! I am still awed by the author’s ability to create prickly and, by many standards, unlikeable characters that, by the end of the book, you literally will be crying with/for."}, {"userName": "Stephen P", "userReviewDate": "Jul 06, 2017", "userURL": "http://www.goodreads.com/user/show/11602286-stephen-p", "userReview": "I don’t need plot. Most of the time I choose books that don’t have such a thing or that I spend time performing rituals and rites in hope that one won’t appear. So what is it with this book that it is about plot, wonderfully plotted, yet I cannot leave it for long or if I do I can’t wait to return.What I think, a hazy belief, is that Kadish has skimmed along the line where story abuts literature. A thin porous line it can be. Often, a work where story is so predominant it is just that; a nice or interesting tale, heartfelt or sentimental. So, what is it and what is it about this book that lifts it above and past this line?Kadish’s style is so engaging, so clean, that rarely did I know that I was reading. If someone pointed out that I was I would have been surprised. Normally I know when I’m reading. I’m bright in this way. There is a book with pages and words running across, a pair of glasses on the bridge of my nose. Not so here. Stop a moment. You’ll need rest. This review is long. It is this spare and telling vernacular which does not show a similarity to the great works of literature, the grand wordings, the poetic phrasings. Does that mean… Of course there have been others.The content is ruthlessly engaging. A young girl, Esther is adopted by a Rabbi in Amsterdam in the 1600’s after her parents die in a fire. He leaves the Jewish community there to venture to London, bringing she and her brother along, to the help the congregating refugee Jews to follow their faith closely. Her mind is bursting with the curiosity of learning, of thought. The Rabbi had been blinded as a young man during the Spanish Inquisition in Portugal. In London he no longer has a scribe to write out his thoughts for him. She becomes the scribe against Jewish law for a woman to participate in the religion at this level. She is honored to serve her beloved, learned, kind Rabbi. Hours each day she writes as he speaks and thinks. She thinks. They talk. Women are not supposed to be doing this, They are not to be thinking about these things; morality, philosophy, religion, much less scribing for a pious Rabbi. The more she learns the more her mind reaches for that which is true for her, an honesty that perches and resides within. An independence of thought. Her thinking is pure and vast. There is no place for this. Not for her. Not for a woman. Her thoughts being kindled, in large part by being not only mentored by him but as one who is to be respected for her thoughts, understandings, ability to assimilate, has burst into a rapacious hungered flame. She lives for thought. She lives for the hope that she might be able to communicate with other thinkers, others whose lives have been devoted to thought.“There was life in London. There was life in her. And desire. A flame leapt in her, defiant of the bounds which she prisoned it.”“The thoughts were heretical, and they were her own. A frightening alluring hunger surged in her…”“Somewhere across this bridge, beckoning her, were books that would be hers to explore and question-and yes, argue against-for in her new daring now nothing seemed impossible, and she allowed herself to admit even this: that she thought the sages scant in their exploration of what she most wished to understand-the will that sets the world in motion and governed it. Shutting her eyes, letting the crowd steer her, she saw behind closed lids the books that awaited her, the thinkers’ collected voices inked onto each crowded page. An ecstasy of ink, every paragraph laboring to outline the shape of the world. The yellow light of a lamp on leaves of paper, the ivory-black impress of words reasoning, line by line.”Even if this book didn’t have other admirable qualities this young woman, is one of the most forceful, appealing characters I have met. She is so much of what I would like to be, to have been, the character I love to read about win or lose. But how stifled she found herself as she grew, by jewish tradition, the violence of anti-Semitism, the bottom tier of social status forced upon women especially if they didn’t, “Marry well,” and had financial means. We’re still in England, no less wet and foggy, but it is 2005. We are settled in the world of academia, where a stodgy, icy, resentful professor nearing her retirement is studying a trove of pages from the 1600’s which has been presented to her by a former student renovating a historic house he bought, and a young post graduate student who has been assigned to her. He is coy, shiftless, and somewhat in love…with himself. Others, especially women, are objects for him to use to get his narcissistic needs met. His thesis on Shakespeare has stalled similar to the professor’s health gradually stalling. But she is determined to take the disorder of these manuscripts and turn them into a significant find that nearing the end of her career will establish her, her name, in a field, a world, dominated by men.The story in different chapters goes back and forth between these worlds. There is nothing seamless about this…on the surface. It so easily might have been. This book has, and rightfully so, been compared to, A.S. Byatt’s Possession. The storylines follow similar paths. Two markings where Kadish veers off; where Byatt’s writing style is precise, articulate, at times a silken touch to the fingers, Kadish’s prose has a coarser feel, heated and leveraged. It is composed of blood’s pounding, the tense grab of the necessity of choices and their consequences. It seems right that Kadish must have been there too and speaks with the fire of experience. Turning to the sentimental to engross a set of genre readers would have been such an easy fall. She writes here in my view for the integrity of the writing itself. Her considerable skills are devoted to this cause. The scars snaking down my hand where I held the book while reading attests. I believe my struggle with this book is that in its danger of yielding to the sentimental it may have crossed that porous line at times unbeknownst to me since I was enraptured with Esther’s character, the nerve crushing violence, the suspense, the symbolic and metaphoric activity. Then the deft crossing back to 2005. The struggles of these more modern characters, not drawn to mimic the 1600’s section but in its own right to address more modern problems in a similarity that evades me but I know is somehow still there.I think there might be some who read it and who might think it is mere genre, others may read it and see a powerful piece of literature, in its own vernacular, taking place. I’m giving it 4 stars too unsure and probably cowardly to give it that last one. It is there just beneath my bed, its faded blink only barely out of my touch."}, {"userName": "Lisa", "userReviewDate": "Mar 22, 2018", "userURL": "http://www.goodreads.com/user/show/15493045-lisa", "userReview": "The Weight of InkRachel KadishMY RATING \t⭐️⭐️⭐️⭐️⭐️PUBLISHER\tHighbridgePUBLISHED\tJune 6, 2017NARRATED\tCorrie JamesAn complex but emotionally rewarding story of two women centuries apart who sacrificed much by choosing a passion of the mind over the heart. SUMMARYTwo women of remarkable intellect are the subject of this monumental and award winning novel set in London in the 1660’s and early 21st-century. Helen Watt, is an ailing historian with the love of Jewish history, right on the verge of retirement. She has just been called to the home of a former student to review a cache of 17th century Jewish documents, discovered during his home renovations. Helen, with the help of Aaron Levy, an embittered and unsympathetic American graduate student, soon realize they have uncovered something stunning. They are in a quest to unlock the secrets of the documents, the identity of the documents scribe, and the meaning of their own lives.Ester Velasquez, a bright, young immigrant from Amsterdam tirelessly scribes for an aging blind rabbi, despite prohibitions against her doing so. As a result of her work, she learns much from the Rabbi. Her mind is opened to new ideas and self discovery, and she soon longs to do so much more. Despite offers of marriage, Ester staunchly chooses her scholarly work, and she further desires to engage with the brilliant minds of her day, particularly the controversial Dutch philosopher Benedictus de Spinoza. Ester’s story illuminates the standing of Jews in London, the plague (1665) and the Great Fire of London (1666)REVIEWThe Weight of Ink is a deftly woven epic story of self-discovery of two women. Ester is in the beginning of her adult life and looking forward, and Helen is completing her career, looking backwards over her life. Both women compellingly chose to focus their lives on scholarly work over love in spite of traditional roles for women. Two true Bluestocking women! Poignant, moving and thought-provoking, this book will draw you in like a moth to a flame, and leave you amazed. This is undoubtably one of the best books I have read in 2018. Rachel Kadish’s writing is masterful and absorbing. She effortlessly transports us back and forward across the centuries, with memorable characters that keep you grounded and propel the story. With close to 600 pages or 23 listening hours, this is by no means a light or quick read, but it is well beyond satisfying. In January 2018, The Weight of Ink was named a winner of a 2017 National Jewish Book Award The Audible version of this book narrated by Corrie James was performed with perfection. “Love must be, then, and act of truth-telling, a baring of mind and spirit just as ardent as the baring of the body. Truth and passion were one, and each impossible without the other.”\t\t\t\t\tRachel Kadish, The Weight of Ink"}, {"userName": "Margaret", "userReviewDate": "Jan 20, 2018", "userURL": "http://www.goodreads.com/user/show/991805-margaret", "userReview": "5/5\tRachel Kadish’s The Weight of Ink is simply my favorite read of 2017. Its basic structure consists of two alternating narratives. The first, taking place in London in the late seventeenth century, contain the writings of Ester Velasquez, a young Sephardic Jew who was born in Portugal, grew up Amsterdam, and finally is brought to London as a young girl, along with her brother Isaac, by a distinguished but blind rabbi, after their parents die. Rabbi HaCoen Mendes had hoped that Isaac would serve as scribe, but Isaac has other desires. Ester, on the other hand, loves the word, the learned life, and ends up acting as the rabbi’s scribe. Such learning and work was denied to women in the late 1650’s, but the rabbi allowed her to help. The second narrative frame takes place, primarily in London, in the years 2000-2001. The main characters here are Helen Watt, an aging history professor, and her assistant, Aaron Levy, who is an American graduate student “on loan” to Helen as she takes three days to look into a stash of ancient papers discovered by a former student when he and his wife undertake a remodeling of a seventeenth century home they purchased. And yes, those papers turn out to be primarily the papers of Ester Velasquez, and those three days are but a mere beginning of a great academic adventure. If you think you’ve read a book with a similar structure, you would be right. A. S. Byatt’s Possession also alternates between the lives of contemporary scholars investigating newly found texts from the past. If you liked her book, I think you will love this one.\tThe writing in Kadish’s book is simply superb. Even if she had a less compelling story, I would be swept away by the words. Let me quote the opening section, “written” by Ester Velasquez and dated June 8, 1691 as an example. (And there are many, many other passages that could have served as well.): Let me begin afresh. Perhaps, this time, to tell the truth. For in the biting hush of ink on paper, where truth ought to raise its head and speak without fear, I have long lied. I have naught to defend my actions. Yet though my heart feels no remorse, my deeds would confess themselves to paper now, as the least of tributes to him I once betrayed. In this silenced house, quill and ink do not resist the press of my hand, and paper does not flinch. Let these pages compass, at last, the truth, though none read them.But the story does compel. This book will keep you in your chair as you turn page after page of this 564 page long novel. Kadish allows her characters in both narratives free reign, and we hear of their past and present lives, and their inner thoughts and outer actions. Even the minor characters (for example, the librarians with whom Helen and Aaron work) are created in depth and flesh out the communities in which they live and work. And we learn in some depth, in both narratives, about the philosophers and writers of the seventeenth century. This being a novel, several of those characters are fictional, but others are taken from history; you are likely to recognize their names and their ideas. This is the kind of historical novel that sends you searching to learn more about some of these thinkers. The focus is primarily on Jewish texts and thinkers, but not entirely. And because Ester is a woman doing work a woman is forbidden to do, there is also a focus on the issue of women being able to choose the lives and vocations they wish. I was transported by this powerful book—by its passionate language and the struggle of its characters to find and ride the meaning this world. Loved it so much I forgave its sometimes too neat shape and its language with its richness of fruit five minutes past ripe (but only five minutes). I abandoned myself to its power but finally I had to draw back a bit because of a final twist too far. But now that I’m more than a month out of the text, that twist fades away under the extreme light of the rest of the book. This one’s a treasure."}, {"userName": "Jeanette", "userReviewDate": "Dec 04, 2017", "userURL": "http://www.goodreads.com/user/show/11869072-jeanette", "userReview": "Oh! Oh! Oh!Do you love the written word? Are you a patsy for any historical site and love to read history books for fun? Are you part philosopher? Does your birth position within the era, family order, vocational direction and almost any other category you can define which could describe the intersection where aptitude and desire toward work or vocation cross- is it all wrong? If you answer yes to most of these questions, take on this one. It is super, super long. About 3 books length. And not an easy read in any measure. If you know Spinoza, Shakespeare, Harvey in specifics? Or if you have studied the Torah or loved conservation library tasks? But first and foremost if you are NOT in love with history itself and the written word to record it- this book is NOT for you. It's in 2 periods (mid to late 17th Century England and 2000-2001 era in the same location) and has about 7 or 8 prime personalities cut to atom sized precision. Add the plague, Jewish persecution and diaspora and some mysteries solved along the way and you have a scrumptious story. There are myriads of quotable passages among the pages. Most have heart in philosophy. But a few also dwell in female role dynamics. Plotting is so complex that those who want an easy answer? No! They come in droplets of piecing by Library Patricia or Conservation Patricia. Only receiving their last names within the last 150 pages. Aaron, Helen, Rabbi, Ester- those are the primes but not near all. This was an outstanding entertainment for me. Think piece supreme."}, {"userName": "Kathryn Langlois", "userReviewDate": "Jun 18, 2017", "userURL": "http://www.goodreads.com/user/show/4967176-kathryn-langlois", "userReview": "I received this book as a free Goodreads giveaway and had no expectations. Fast-forward eight days and I feel as though the author reached into my soul and twisted until I believed I was living in the pages of her book. I don't know if that makes sense, but after the initial few chapters I found that I related to, empathized, and cared about the book's three main characters- Aaron, Helen and Ester so much more than is typical for me. The unfolding of the story is captivating and the author does a great job of pacing the story (with the exception of the first few chapters). While structurally similar to other books I've read, the writing in this book seems stylistically unique, by which I mean it's some combination of the following: meditative, implicit, poetic, unfurling. --->basically, I can't describe how it's unique...The story was wonderfully illuminating in regard to the plight of Portuguese Jews of the inquisition, and Refugee Jews in Amsterdam and England. One of my favorite elements of this book was each main characters' quest for the light and desire within themselves and their consequential struggle to define what their purpose would be. The ending was not my favorite, but neither did it ruin the feeling of the book as a whole. Great story, great characters, great puzzle."}, {"userName": "Lorna", "userReviewDate": "Dec 28, 2017", "userURL": "http://www.goodreads.com/user/show/6700518-lorna", "userReview": "The Weight of Ink is a beautiful and intricate tale of two women living almost four hundred years apart. Ester Velasquez fled Portugal to Amsterdam at the time of the Inquisition and then emigrated to London in the mid-1660's when she is given the opportunity to scribe for a Jewish rabbi. Helen Watt is an aging historian and professor of Hebraic History at a university in London at the first part of the twenty-first century and close to retirement. Professor Watt is summoned by a former student to his home just outside London where a cache of seventeenth-century Hebrew documents has been discovered. As Helen Watt is in the last stages of Parkinson's disease, she enlists the assistance of a graduate student, Aaron Levy. It is interesting and heartwarming to witness the changing relationship between them as they realize the import and gravity of the documents they have discovered and a looming deadline as they each become more involved in the life of Ester Velasquez.I loved this book as the writing was lyrical and beautiful and as the lives of these two women began to unfold, I literally could not put the book down. This is a book about books, art, history, philosophy, knowledge and ideas that involves many multi-faceted layers. \"Our life is a walk in the night, we know not how great the distance to the dawn that awaits us. And the path is strewn with stumbling blocks and our bodies are grown tyrannous with weeping yet we lift our feet. We lift our feet.\""}, {"userName": "Kelly", "userReviewDate": "Apr 19, 2018", "userURL": "http://www.goodreads.com/user/show/94602-kelly", "userReview": "I know Possession. I’ve read Possession. You, madam, are no Possession.Do not name drop unless you know what you’re doing, book marketers. In this case, you set the bar far too high and honestly never convinced me I was at the right bar to begin with. Never mind the truly, madly, deeply overwritten metaphors that absolutely blossom from nearly every page. The historical part seemed interesting, but I can just as easily read, you know, an actual history on the topic, so you’ve gotta have something more than that for me. I will admit that I decided I was done no more than a quarter of the way through so perhaps she got her act together later, but I somehow doubt it. I’ve been at this particular rodeo of purple prose and Dramatic Foreshadowing one too many times before. It seldom surprises me. I wish publishers understood better what people liked about the biggest best sellers. We could all avoid a lot of needless disappointment in the “Let’s Find Or Manufacture a Copycat” mill that follows. Don’t make the cookie when you don’t know the secret ingredient. That’s all I’m saying."}, {"userName": "Neocortext", "userReviewDate": "Jun 27, 2017", "userURL": "http://www.goodreads.com/user/show/664778-neocortext", "userReview": "I really liked this book--it's got a quiet intensity about it, much like its characters, who are academics all, and of the restrained type. The three points of view--Helen, a Gentile historian on the brink of retirement; Aaron, a Jewish-American graduate student; and Ester, a scribe-by-chance living in exile (or excommunication) from her Amsterdam community in 1660s London--all have reason to protect themselves from the scrutiny and expectations of their communities, and themselves, and all manage their needful restraint in manners appropriate to their age, gender, and situation. Because of this thoughtful appropriateness, the book provides ample opportunity to reflect upon their respective situations and the material or cultural circumstances that encourage or even support the characters' responses. But even more interesting--and, to my mind, rare--is that this allows the characters to develop as their circumstances grow increasingly fraught and as they themselves mature.Frequently, \"character development\" simply refers to the extent to which the book reveals more about the character: more backstory, more situations, more information. This mode, properly, should be called something more like \"character expansion,\" I think, because in such stories, the characters don't actually change: there's just more information that reinforces or explains why the characters are the way they are, but the character doesn't mature, gain new insight or understanding, or try out new approaches to their problems or their world. In Kadish's book, however, all of these characters do, refreshingly, actually develop in the truest sense of the word.The best books, to my mind, educate me: I learn about history, techniques, skills, information of some kind. In rarer, and still more fulfilling instances, I also learn something about a way of approaching storytelling: Garcia Marquez did this for me when I encountered him in the 80s, or Faulkner, or Anne Carson--or Agatha Christie, too. Kadish, here, made me realize how incredibly rare it is that I don't just learn about a character, but learn from a character. One way or another, Helen, Aaron, and Ester taught me that becoming a fuller, more developed human being requires becoming more vulnerable both to one's strengths and desires, and it did it in that most persuasive manner that is, uniquely, story's own: not theoretically, but concretely, in the particular material realities that circumscribe our daily lives."}, {"userName": "RoseMary Achey", "userReviewDate": "Sep 12, 2017", "userURL": "http://www.goodreads.com/user/show/5338290-rosemary-achey", "userReview": "I had a very difficult time with this highly rated novel. The writing was very good at times, but other times I felt it would benefit from a strong edit. If you are looking for a light, quick read-this certainly is not the book. Unfortunately, I didn't love any of the characters in either the contemporary or the historical story. Lots of readers loved this one, I just was not one."}, {"userName": "Susu", "userReviewDate": "Aug 16, 2017", "userURL": "http://www.goodreads.com/user/show/5507954-susu", "userReview": "Best book I've read this year!"}, {"userName": "Jan Rice", "userReviewDate": "Feb 28, 2018", "userURL": "http://www.goodreads.com/user/show/5864678-jan-rice", "userReview": "There's a book with the subtitle \"What's the right thing to do\" (Justice: What's the Right Thing to Do? by Michael Sandel), and that, I'm thinking, is what The Weight of Ink is about. What is the right thing to do?The story moves back and forth between the seventeenth century and the earlier 2000s. In the seventeenth, the focus is on Ester, a young Jewish woman of Sephardic descent who has fallen on hard times. Her circumstances in Amsterdam had allowed her to pursue her love of learning far beyond the norm for a girl, so that subsequently, as a destitute immigrant to England, she finds herself in the highly unusual circumstance of scribing for an elderly, blind rabbi, since she can do the job and no one else is available. Ester's story is juxtaposed against that of Aaron, an American graduate student in London -- a history ABD (\"all-but-dissertation\") -- and his struggles with intimidating professor Helen Watt as he flails around trying to find himself.At some point it struck me that this novel was dealing with sexism, contrasting Ester's dilemma over using her intellectual potential with Aaron's inability to mobilize himself despite his society's furnishing him a straight road ahead. And of course it is; Ester couldn't have it all:Nowhere in the known world, it seemed to her, could she live as she'd been created: at once a creature of body and of mind. It was a precept so universal as to seem a law of nature: one aspect of a woman's existence must dominate the other. And a woman like Ester must choose, always, between desires: between fealty to her own self, or to the lives she might bring forth and nurture.andYet sacrifice of the self is everywhere viewed as the highest calling, and the more so for a woman, who must give every element of her life to others. Kindness is at all times counseled to women, who are called unnatural if not kind.Yet how can a kindness that blights the life of even one--though it benefit others--be called good? Is it in fact kindness to sever oneself from one's own desires? Mustn't the imperative to protect all life encompass--even for a woman--her own?Then must we abandon our accustomed notion of a woman's kindness, and forge a new one.But then I thought about all I'd been reading about Philip Roth (given his recent death)--that he only set himself free after he doubled down on self-discipline and became a \"monk of fiction\" (David Remnick, The New Yorker, June 4 & 11, 2018). He had no children, and his marriages didn't last. When someone gave him a kitten, he had to give it back because taking care of it was too much of a distraction.I'm not saying everything is equitable. I'm saying that those who know what they're here for often make sacrifices, no matter whether they're men or women.Last year (2017), David Brooks wrote a column entitled \"The Strange Persistence of Guilt,\" based on an essay of the same name by Wilfred McClay. Because of the breakdown of moral consensus within society, according to their way of thinking, people seek expiation in the only remaining way: by assuming the victim status, which unfortunately entails blame and culture wars.I can see what Brooks and McClay are saying. But a different way of thinking is that guilt comes, not from the breakdown of moral consensus but from breakdown of consensus about how, more generally speaking, we should be spending our lives. In other words. not how much charitable work we should be doing (that is, activities conventionally understood as being \"good works,\") but, given the overload of demands and needs and tasks, how we should choose to spend our time. Not being able to do it all means we don't respond to everything, which is a prescription for guilt. And those who feel guilty are predisposed to look for someone to blame. Solution: we should figure out what we're here for, as Philip Roth did, and Ester in the book. And bottom line: all three of the main characters, Ester, Aaron, and Helen, are trying to answer the question of what's the right thing to do.So for me the book's strength is as an attempt to illuminate modern problems. While it's ostensibly a historical novel, and while the author did research her settings, Ester is essentially working out a modern problem. The seventeenth-century protagonist often seems to me like a modern character in period costume because her way of thought is essentially like our own.I enjoyed the story, both the modern and seventeenth century parts, and its climax, too, although I'd say the book didn't need to be quite so long.https://www.newyorker.com/magazine/20...https://nyti.ms/2nCc63Hhttp://www.iasc-culture.org/THR/THR_a..."}, {"userName": "Bonnie Brody", "userReviewDate": "Jul 24, 2017", "userURL": "http://www.goodreads.com/user/show/7630898-bonnie-brody", "userReview": "A couple has inherited an old house in a suburb of London. As they remodel, they find some ancient documents under their stairs. Upon seeing that the leather binder looks very old and the lettering might be in Hebrew, they contact Helen Watt, a professor of Hebraic studies at a nearby university. When she visits the house to check out the couple's findings, she is shocked to realize that the documents likely originated in the 17th century. It is possibly a treasure trove. Helen is ill with Parkinson's Disease and asks a colleague to recommend a graduate student to help her translate these documents. Enter Aaron Levy who has been working on his doctorate for, what feels to him, forever, and not making much headway. His doctoral thesis is about the connection of Shakespeare with the Jewish populace of his day.The novel takes us into several worlds - the lives of Helen and Aaron, as well as 'Aleph' and a rabbi, the mysterious authors of the antique documents. Aleph was a scribe and served to write down the letters and sermons of a blind rabbi. Helen has a history with the Jewish people and, though not a Jew herself, she has spent some of her youth in Israel. Aaron is in an existential void and finds that, with these ancient papers, he may have another chance to complete his doctorate. It is early in the novel when the two contemporary scholars recognize that the found documents were written by Portuguese Jews, once faced with the Inquisition, and later sent to England. As they face academic competition and the fragility of the documents themselves, they also have to navigate their own personal relationship. This is a fascinating book that takes the reader back in time to the 1600's when London fought the plague, when women were not permitted to do much besides marry and raise a family, where Jews regularly wore crosses around their necks so as to remain safe and secreted. It is also about the present, the ways that human beings deal with morality and ethics. It takes a wonderful look at the philosophy of the 17th century and how it might have been interpreted then and now.I found the shifting of chapters from the past to the present very nicely done. I just wish that as much emphasis was placed on Helen and Aaron as was on Aleph and the rabbi."}, {"userName": "Anna", "userReviewDate": "Jun 28, 2017", "userURL": "http://www.goodreads.com/user/show/4417002-anna", "userReview": "Not for a long while has a book so utterly consumed me with its intricate story--the undeniable grace of its complex narrative. To say I could do little else the last few days but read it is an understatement. The scope and depth of Rachel Kadish's achievement, her life-gift to the world, fills me with admiration; no it's more than that: this big, beautiful book fills me with wonder, awe."}, {"userName": "Robin", "userReviewDate": "Jun 24, 2017", "userURL": "http://www.goodreads.com/user/show/11249194-robin", "userReview": "There's some books that speak to your soul and that inspire the mind and touch the heart and The Weight of Ink is one such novel. It did remind me of A.S. Byatt's Possession or Elizabeth Gilbert's \"Signature of All Things\", Serena Jeter Naslund's \"Ahab's Wife\". This is a saga of a story that never skips a beat, is so beautifully written that I found myself underlying passages which I rarely do with novels. This is a book to savor. I absolutely Loved it!"}, {"userName": "Jamie", "userReviewDate": "Aug 14, 2017", "userURL": "http://www.goodreads.com/user/show/892011-jamie", "userReview": "(4.5) Though I have docked half a star for some excessive description, it might only have bothered me because I'm a pretty impatient reader. This is beautifully written with very interesting characters and settings--scholars/historians, rare manuscript library/ians, non-conformist 17th-century women, the Inquisition, and London during the Plague!If any of that interests you and you want to immerse yourself in a deep and satisfying novel, check this out!"}, {"userName": "Karen", "userReviewDate": "Jul 16, 2017", "userURL": "http://www.goodreads.com/user/show/41376337-karen", "userReview": "I received this ARC from netgalley.com in exchange for a review. I just couldn't get into this story. Maybe I'll try to read it again at a later date. Abandoned at 20%, no rating."}, {"userName": "Janet", "userReviewDate": "Jun 03, 2018", "userURL": "http://www.goodreads.com/user/show/2013209-janet", "userReview": "If you enjoy historical fiction, strong women protagonists, literature and mystery, this book is for you.At 560 pages, it is not for the ADD sufferer but I did find it surprisingly readable and not overly pedantic given the subject matter. I know very little about Judaism, particularly before the WWII era but Kadish's talent brought the 1600's (time of the plague) to life for me in a way that previously only Geraldine Brooks has been able to do. The alternating storylines between 17th century and present day was a very effective tool for presenting this story and allowed Kadish free reign of her imagination which captured mine. Like other reviewers, I'm now intrigued to find her backlist."}, {"userName": "Jo Ann", "userReviewDate": "Sep 02, 2017", "userURL": "http://www.goodreads.com/user/show/227587-jo-ann", "userReview": "As one who appreciates and loves all forms of communication, and especially hand-written messages, the printed page, etc., just the TITLE of this book drew me in...I mean, \"the weight of ink?\" What portents of discovery were promised here?The discoveries in this book did not disappoint. While reading it, I felt such a reverence for the characters, for their strength of character, as well as their human needs and foibles, as well as for the written word where the weight of ink lies. Imagine being forbidden, as was Ester in the 1660's, to learn to read and write and fulfill/enjoy her love of both! We are so fortunate. The lives of Ester, a young emigrant to London from Amsterdam whose rabbi permits her questions and learning, and even permits her to be his scribe, and Helen, a lover of Jewish history who seeks truth in the ancient letters discovered during a home renovation, intertwine as the story progresses. We discover these women's, as well as other pivotal characters within the story, needs and decisions impacting the outcomes of their lives. We're asked to determine how important it is to \"stay with our tribe?\" We're given insight into the life of a kitbbuz in Israel, and we're permitted to view how ancient documents are reverenced, handled, and the sometimes cutthroat politics of publishing. We're invited to listen to arguments about the nature of God, and so much more.To repeat, I feel/felt a \"reverence\" before these characters' lives and the history they represent in this book."}, {"userName": "Christine Nolfi", "userReviewDate": "Sep 26, 2017", "userURL": "http://www.goodreads.com/user/show/5194381-christine-nolfi", "userReview": "One of my favorite books of 2017. Highly recommended for readers of historical novels with a literary bent."}, {"userName": "Booknblues", "userReviewDate": "Feb 23, 2018", "userURL": "http://www.goodreads.com/user/show/4280875-booknblues", "userReview": "I am always drawn to book which is told during two different times in history, but it is a plot which is not always successful. I found Rachel Kadish's book The Weight of Ink to use this plot device very succesfully. The characters were all multi-dimensional and well drawn. Those in the year 2000, the aging and ready to retire history professor, Helen Watt, who specializes in Jewish history and the young but confused scholar, Aaron Levy, who is pursuing his doctorate degree and the 17th century female scribe, Ester Velasquez.Certainly at times, one time drew me more than the other, but it was never consistent. Sometimes I longed for the 20th century and others, I long to travel to the 17th. Ester was an unusual woman who longed for knowledge that was not readily available to a woman of the 17th century:More than half the candle remained. She could read an hour before it guttered, longer if she took another candle from the drawer. How many had she burned already this month? Her hours of night reading seemed to grow ever more necessary, for each day’s study compelled her to explore these volumes further, and with a fierce attention impossible when others were about. On nights when she could rouse herself after her first sleep, she forced herself from bed and down the stairs to the rabbi’s room. Once there, she studied until she could read only by brushing tears of strain from her eyes. In vain were her most solemn determinations to burn only one candle; for when that candle guttered, she lit another—and after all, was the household’s allowance not abundant enough to pay for but one more? She’d use the rabbi’s coins to purchase replacements the next time she was sent abroad inThere were times for me where the book dragged a bit, because of Ester's love of philosophy and this part often being told as epistles. I'm not all that familiar with Spinoza or other philosophers of the time, but it was interesting to uncover some of this history."}, {"userName": "Elizabeth A", "userReviewDate": "Jul 20, 2017", "userURL": "http://www.goodreads.com/user/show/3123067-elizabeth-a", "userReview": "Book blurb: Set in the London of the 1660s and of the early 21st century, The Weight of Ink is the interwoven tale of two women of remarkable intellect: Ester Velasquez, an emigrant from Amsterdam who is permitted to scribe for a blind rabbi, just before the plague hits the city, and Helen Watt, an ailing historian with a love of Jewish history. As the novel opens, Helen has been summoned by a former student to view a cache of 17th-century Jewish documents newly discovered in his home during a renovation. Enlisting the help of Aaron Levy, an American graduate student as impatient as he is charming, and in a race with another fast-moving team of historians, Helen embarks on one last project: to determine the identity of the documents' scribe, the elusive \"Aleph\".I'm a fan of historical fiction, especially ones that have strong woman characters who buck society's expectations to follow their own hearts. This one also has old documents, recently discovered, which sheds new light on life in the 17th century. The story follows two timelines, one present and one past, and unlike many novels that utilize this device, the author does a superb job of making the two story lines dance and complement one another. I loved the writing, the settings in both timelines, the mystery, and for much of the reading I thought this might be a five star read. I did not however enjoy the Aaron Levy thread, and while I understand why the author might have added him, I could have cared less about his rather predictable story. The book could also have used some tighter editing.I was fully immersed in these worlds as I was reading, I found myself talking to the characters and pondering their various dilemmas. How could I not thoroughly enjoy a story about unconventional women with a dash of history and old letters, a pinch of mystery, with a teaspoon of philosophical musing thrown in? I'm off to look into her back list.I listened to the audiobook which is wonderfully narrated by Corrie James, and I'd recommend trying this one on audio."}, {"userName": "Amanda", "userReviewDate": "Jul 22, 2017", "userURL": "http://www.goodreads.com/user/show/2937472-amanda", "userReview": "This is a book that on the surface appears to be something I'd love: historians finding a trove of archival documents that suggest deep philosophical understanding by a Jewish female scribe in the 1660s (very rare for the time), then flipping back and forth between the life of the scribe and the historians' inquiry into the documents. My three-star rating reflects the disappointment of not enjoying this as much as I thought I would. Two major quibbles. First, I felt I didn't know enough about the historical context of Jews in London and Amsterdam to understand exactly what was going on in the 1660s sections. The author didn't explain who the different religious and philosophical characters were (and there are opportunities to do so during the present-day sections). Second, too many negative stereotypes of librarians and archivists. It's all very much in keeping with the antiquated understanding of special collections libraries as the keepers of the documents and people who need to grant access to \"appropriately vetted\" scholars. The historians are required to wear white gloves while using the manuscripts, which is not accepted practice (it actually can cause more damage to the documents because your hands are more clumsy with gloves on). In one scene, the librarian kicks a historian out of the reading room for handling a document with shaky hands! Seriously, there are better ways to handle that situation without making librarian look like the bad guys who care more about integrity of documents than about people using them for valuable research. Just not sure what purpose this view of the librarians served in the book..."}, {"userName": "Lynne", "userReviewDate": "Jul 15, 2017", "userURL": "http://www.goodreads.com/user/show/17408049-lynne", "userReview": "Really enjoyed this historical fiction book that takes place in London and Israel in the 1600s and the 1950s and the 2010s."}, {"userName": "Anmiryam", "userReviewDate": "Jun 27, 2017", "userURL": "http://www.goodreads.com/user/show/2490546-anmiryam", "userReview": "This book was truly the perfect book for me and while it took longer than usual to read, I relished every moment I got to spend with it. Real review to follow."}, {"userName": "Laurie", "userReviewDate": "Jul 03, 2017", "userURL": "http://www.goodreads.com/user/show/1050800-laurie", "userReview": "In the 1600s, Esther Velasquez is denied by Judaic law the right to read or write religious or philosophical works. In the 2000s, historian Helen Watt is having things mansplained to her by the department head. Some things never change. Esther, a Portuguese Jew whose family fled to the Netherlands when Portugal expelled the Jews, is in a unique position. Not only does she long to read and write, she doesn’t want to marry and take the standard position of mother and housekeeper. She and her brother live with a blind Rabbi, and the brother is the official student, reader, and writer for him, with Ester listening in. But when they move to England and the brother leaves, Ester is the available scribe. And no one will find out a woman is doing the transcription. And it’s perhaps a gray area; she is, after all, just writing down a man’s words, not her own. Helen Watt receives a call from a former student. He and his wife, while renovating an old house, have found a cache of old papers, looking to be in Arabic, Hebrew, or Spanish. Could Helen come and take a look? She’s not eager; she doesn’t imagine they could be anything important. Probably old shopping lists. But she’ll take a look, taking a grad student to do the grunt work. The papers are from 1691, and Helen realizes that they could be an important find. Now she must race against the rest of the history department, her own worsening physical state, and her impending mandatory retirement to get the papers bought, stabilized by the university library, and translated. The story that emerges is one no one imagined. “Weight of Ink” has been compared to A.S. Byatt’s “Possession”, and it does certainly have similarities. But “Possession” is in large part a tale of two passionate love stories, while “Weight of Ink” certainly has passionate love stories in it, they are minor streams merging into the larger river of Ester’s desire for education and her evolution from scribe to something much more. This is a great literary mystery, with new things turning up right up to the end. I really liked Ester; I warmed up to Helen as I found out more about her. The cast of characters is huge; not all are likable but that’s how life is. There are a lot of issues dealt with; homosexuality, pregnancy out of wedlock, Jewishness in the time of William and Mary, women’s issues, class, interfaith relationships, and philosophy all both entertain and educate the reader. While the book is slow in places, I never found it boring and it was actually a pretty fast read for a 600 page book! Five stars out of five."}, {"userName": "Deanna", "userReviewDate": "Mar 04, 2018", "userURL": "http://www.goodreads.com/user/show/25852459-deanna", "userReview": "Superbly interleaved threads: a contemporary story of two very different, flawed, and relatable academics (historians) making their way through found documents from London in the plague era, and a woman who lived that era. Oh, this long, slow-moving tale could have been dry and tiresome. Instead it was rich, thoughtful, enlightening, and rewarding. The three central figures were complex and engaging. As flawed as each was I couldn’t help respecting them, which matters. And I learned so much about a period in the Jewish European experience I knew nothing about. Coincidentally, I recently read The Doomsday Book, a time travel genre book of the 90s that has a strong fan base, though I was somewhat disappointed. Doomsday Book was also an interlaced story of contemporary academicians of history and England in the plague years. The two books were written to different purposes, at different times, and not for the same audiences, so comparisons are unfair beyond the superficial. Yet for me, Weight of Ink is all I would have hoped for from the story idea to experience England in the seventeenth century from the modern perspective, and much more than I would have known to hope for. Beautifully and deeply conceived and constructed, and delivered with a kind of reserved passion and intelligence that makes a classic."}], "description": "An intellectual and emotional jigsaw puzzle of a novel for readers of A. S. Byatt’s Possession and Geraldine Brooks’s People of the Book.Set in London of the 1660s and of the early twenty-first century, The Weight of Ink is the interwoven tale of two women of remarkable intellect: Ester Velasquez, an emigrant from Amsterdam who is permitted to scribe for a blind rabbi, just before the plague hits the city; and Helen Watt, an ailing historian with a love of Jewish history.   As the novel opens, Helen has been summoned by a former student to view a cache of seventeenth-century Jewish documents newly discovered in his home during a renovation. Enlisting the help of Aaron Levy, an American graduate student as impatient as he is charming, and in a race with another fast-moving team of historians, Helen embarks on one last project: to determine the identity of the documents’ scribe, the elusive “Aleph.”   Electrifying and ambitious, sweeping in scope and intimate in tone, The Weight of Ink is a sophisticated work of historical fiction about women separated by centuries, and the choices and sacrifices they must make in order reconcile the life of the heart and mind.", "title": "The Weight of Ink", "url": "http://www.goodreads.com/book/show/30971715-the-weight-of-ink", "average": 4.23, "cover": "https://images.gr-assets.com/books/1479239299l/30971715.jpg", "reviews": 720, "authors": [{"url": "https://www.goodreads.com/author/show/429.Rachel_Kadish", "name": "Rachel Kadish"}], "type": ["Historical", "Fiction", "Historical", "Literature"], "outlinks": ["http://www.goodreads.com/book/show/30971715-the-weight-of-ink", "http://www.goodreads.com/book/show/34540616-the-weight-of-ink", "http://www.goodreads.com/book/show/34471004-the-weight-of-ink", "http://www.goodreads.com/book/show/1577123.Tolstoy_Lied", "http://www.goodreads.com/book/show/1426503.From_a_Sealed_Room", "http://www.goodreads.com/book/show/21272796-i-was-here", "http://www.goodreads.com/book/show/22828702-the-new-diaspora"]}