{"ratings": 566, "userreviews": [{"userName": "Emma", "userReviewDate": "Aug 30, 2017", "userURL": "http://www.goodreads.com/user/show/26734926-emma", "userReview": "I love Roopa Farooki's novels. True to form, this novel is based around a 2nd or 3rd generation British/Pakistani family. We follow the perspectives of three siblings, who were orphaned by the unexpected death of their mother around five years prior to the start of the novel. Sweet, dependable big brother Asif tries to parent his autistic sister Yasmin, while holding down a boring city job. His adherence to his sister's need for routine means he has very little social life. Yasmin is finishing her A-Levels, and will soon be the subject of a documentary, in an attempt to give the general public a better understanding of her condition. The third sibling, Lila, is an unrepentant hot-mess. She flits between new boyfriends and new jobs, refusing to settle down, and resenting her younger sister for always taking her parents' attention.It's a family novel, about sacrifice and love. It's a little darker than many of Farooki's other novels, as it deals with themes of depression and aspergers, but I still thoroughly enjoyed it."}, {"userName": "Anum Shaharyar", "userReviewDate": "Mar 05, 2018", "userURL": "http://www.goodreads.com/user/show/10920641-anum-shaharyar", "userReview": "I think one of the major reasons I was so amazed that Roopa Farooki’s book was good was because no one ever discusses this author. Ever. I’ve been reading about and discussing and analysing Pakistani literature for a while now, and Farooki is so completely absent from the discourse that I expected this book to be a total bomb. Which is why when I began, and the words flowed together so smoothly, my first impression was that of shock, and my second one of happiness.The plot and the characters and the narrative are all secondary. First and foremost is the fact that Farooki writes really well. And that’s a compliment only very few Pakistani authors can lay claim to. Her words are effortless; a façade that is so carefully constructed that it only crumbles in a few odd places. Overall, I notched this book one star higher just for the writing. Another star was given for the characters, who are complex enough to retain interest. Asif and Lila, older siblings to the autistic Yasmin, deal with their mother’s death and their loss of any parental guidance (father gone in an early death) in completely different ways. Asif, stepping in as the sole caretaker, both perfects and resents his role as Yasmin’s indulgent guardian. Lila, selfish and volatile, completely tears herself away from her family, destroying every other relationship in its wake, but unable to separate herself completely. Unfortunately, while Asif and Lila, and even Yasmin, make for compelling characters with their own distinct narrative arcs, it is the plot that lets the book down. I did not much care for Yasmin’s documentary filming, about the life of a non-neurotypical, nor was I overly invested in Asif or Lila’s tumultuous love lives. Even though both the siblings have compelling, vastly different personalities, and hence completely different trajectories in how they meet, fall in love, and sustain their relationships, it doesn’t make for a strong enough story to keep me reading for long. Asif’s slow acceptance of his worth and his realization that the gorgeous woman at his work place might be interested in him might be an interesting character study, but it isn’t a great narrative arc. Same with Lila and her blind boyfriend, who gets ten points for representation and not much else. And while we are talking about representation, we might as well discuss Yasmin, whose Asperger’s combined with her synaesthesia should have made her one of the most interesting characters in this book. Unfortunately her larger than life siblings hold most of the attention, reducing Yasmin’s chapters to a more boring side note. Even though Farooki has tried her hardest to make Yasmin three dimensional, I always become uncomfortable trying to figure out if the representation is actually true. Even though I know that no two non-NT people are the same and I’m all for disability representation, I always need to take a step back and wonder whether the book isn’t using the representation the way people are using feminism and social activism these days, just because it’s in the spotlight. Overall points for representation though. RecommendationThis is the kind of book that I didn’t love but would understand if someone did. It’s the kind of book you can appreciate, with its comfortable phrases and character building and control over pacing. Definitely recommended.ORIGINAL UPDATE:That turned out better than expected, which is such a great thing to experience. Review to come!***I review Pakistani Fiction, and talk about Pakistani fiction, and want to talk to people who like to talk about fiction (Pakistani and otherwise, take your pick.) To read more reviews or just contact me so you can talk about books, check out my Blog or follow me on Twitter!"}, {"userName": "Heather", "userReviewDate": "Jun 10, 2010", "userURL": "http://www.goodreads.com/user/show/3335666-heather", "userReview": "Based on the number of made-for-tv movies and specials on the topic, Americans are in love (or at least in fascination) with all things autistic. There is something engrossing in watching people with autism and trying to figure out how their minds work, because clearly their neurons are producing in ways that a typical person's brain is not. As a special educator, I've had more than my fair share of experience with children with autism. Ranging from non-verbal, stereotypical autism to high-functioning Aspergers Syndrome, I've pretty much seen it all.It should therefore be taken as a great compliment when I say that Yasmin, the main character in Roopa Farooki's The Way Things Look to Me felt so authentic that I started comparing her to students I've worked with as though she was a real person. The novel revolves around three siblings-Yasmin, who has been diagnosed with Aspergers Syndrome, and her older brother and sister, Asif and Kalila (Lila for short)-all in their late teens, early 20s. Asif drops out of university to take care of Yasmin when their mother dies unexpectedly when he is 18. Lila, younger by a year, flees home as soon as she can-and goes down a path of self-destruction that she lays squarely at the feet of Yasmin. Yasmin herself is just finishing her A levels, prior to going off to university. High functioning, verbal, extremely intelligent, Yasmin is poised to make the difficult transition from the sheltered world of her elite private school to real life.The book examines the many ways that being a typical sibling of an exceptional child can be challenging, frustrating, and difficult. Both Asif and Lila felt that they had to fight for their mother's attention-Asif by always being the \"good boy\", and Lila by being loud and argumentative and difficult. The novel revolves around Asif and Lila's attempts to find happiness despite the baggage they carry about their childhood, and despite knowing that now that their mother is gone, they will not be able to escape Yasmin.At the beginning, the most sympathetic character is Yasmin herself, which is saying something for Farooki's ability to write characters. Given that many people with Aspergers Syndrome do not feel or show emotion in typical ways, they can sometimes be seen as cold or unfeeling. When Farooki writes from Yasmin's point of view, it is clear that despite her limitations she is much more self-aware than her siblings. As the story develops, and flashbacks of their childhood are given, a clearer picture emerges of what made Asif and Lila the way they are. Farooki does not attempt to make us feel sorry for Yasmin, nor does she demonize Asif and Lila. What you get in this novel is an honest, warts-and-all account of living with autism."}, {"userName": "Bel Murphy", "userReviewDate": "Oct 09, 2012", "userURL": "http://www.goodreads.com/user/show/6265309-bel-murphy", "userReview": "Responsibility for the care of Yasmin falls to her older brother when their mother dies suddenly and the impact of having a family member with ASD is deftly explored in this lovely book. An overarching theme in the novel is one of sacrifice. Asif is forced to abandon his student life in a prestigious University to assume the role of head of the family on his mother's death. This, in turn, leads him to forego a bright future for a monotonous career and the relentless daily grind of maintaining predictable routine for his sister. Middle sister Lila is the 'rebel' of the family. She rejects conformity with reckless abandon, living in squalor and embarking on a string of unsatisfying relationships. However, it emerges that Lila harbours a simmering resentment of her younger sister and the way in which Yasmin's needs held her mother hostage and monopolised her attention. The relationships in the book are developed beautifully and show that there is always light at the end of the tunnel."}, {"userName": "Ruth Booth", "userReviewDate": "Sep 11, 2016", "userURL": "http://www.goodreads.com/user/show/52825343-ruth-booth", "userReview": "The book tells the story of Yasmin (who has Asperger's) and her two older siblings, Asif and Lila. Each chapter depicts the story from the perspective of one of the 3 characters and is set both in the present time and occasionally goes back to give the reader some back story. Basically the siblings are left with no parents so Asif becomes the carer for Yasmin, and I think the reader is supposed to feel some sympathy towards him. Lila on the other hand takes no responsibility for her sister and in fact quite frequently suggests that she feels Yasmin does not in fact have Asperger's and is just spoilt. I actually really liked Lila whilst I wanted to shake Asif and tell him to man up. Perhaps this was intentional??The idea behind the story is great. And it's a very easy read - flowing quite well. But I have issues with both the love interests that Asif and Lila gain through the novel. It makes the book feel a little trivial and more like a chick lit novel than I think it should. I have decided that if I am not getting an overwhelming desire to go to bed early to read my current book, than I won't mark it higher than 3. And I can't say I was ever desperate to find out what happened. That being said, I could see many others loving the characters and their development so please don't let this rating put you off. It's worth a read. And I would try another novel by this writer."}, {"userName": "Vi Vian", "userReviewDate": "May 31, 2017", "userURL": "http://www.goodreads.com/user/show/68222914-vi-vian", "userReview": "a nice book to read but not as memorable as it should be. i like that the writings by the author flows very naturally and is not complicated. i expected this book to be a \"heavy\" reading which is dark and potentially depressing as it deals with how two elder siblings (asif and lila) cope with their youngest sibling(yasmin)'s asperger's syndrome. what attracted me to this book in the first place is that being an elder sister myself, i couldn't imagine being tasked with taking care of a challenged family member FOREVER. how would i cope with the situation? can i even begin to understand the dedication and responsibility involved? and so i set out to finish this book with the goal of trying to understand what is involved. i have a niggling feeling that the author glosses over the hardships a little too much though. character-wise, lila and asif are very believable. you can easily relate to them and they could be just passing by you on the streets. as for yasmin, i think not enough is given to us by the author to see the depth of her asperger's syndrome and how it affected everyone around her to a greater extent. seeing as i have no first-hand experience in encountering asperger's syndrome, i do not know if yasmin belongs to the majority or minority of asperger's sufferers but i do hope she is in the majority. in the book, she is quite functional and independent to a certain extent and that is probably what make the book not as depressing as i dreaded and expected. it makes me think that people with asperger's syndrome CAN take care of themselves more than what we believe and that we don't need to be overly-protective of them. at the end of the books, readers will probably be like me, curious about what next steps will the three siblings take? can yasmin really find happiness for herself? the author does not have a conclusive ending, but the lack of conclusive ending does not annoys me like it usually does as it gives me hopes and i sincerely root for yasmin and her siblings to have the life they want for themselves."}, {"userName": "Anne", "userReviewDate": "Apr 14, 2010", "userURL": "http://www.goodreads.com/user/show/546484-anne", "userReview": "There seems to have been a glut of novels recently that have a main character with Aspergers Syndrome and/or synesthesia, Roopa Farooki's lead character in The Way Things Look To Me is Yasmin, a nineteen year old girl who has AS and sees emotions and sounds as colours, or to use the correct term, is synesthetic.Although Yasmin is the lead character and the plot of the novel centres around her, she actually does not play a big part in the story. It is the effect of Yasmin's AS and her need for structure in her life and how that has affected her siblings that is the central point of the novel.Asif is Yasmin's brother, and since the death of their parents, her carer. Asif is described by everyone as a 'nice boy', he has given up his Cambridge studies, his love-life and his future to do his duty and care for Yasmin. Lila is Yasmin's sister, a self-confessed bitch who lives in chaos, spends hours scrubbing at her eczema blighted skin so as to appear beautiful and treats men as throw-away commodities. Yasmin is totally self-absorbed, she doesnt have any comprehension of what effect her behaviours have had on her family, as long as her breakfast is yellow and the order of her day is uninterrupted then she is fine.When a TV production company start to film a documentary about Yasmin and her gifts, Asif and Lila start to unfold. We see how damaged they are underneath their coping exterior. This is a well-written and well-researched novel, with some very flawed but very understandable and likeable characters. Asif and Lila are the stars of the novel, even is Yasmin is the central pin.A very emotional story, but also witty and uplifting and compassionately written. Long-listed for the 2010 Orange Prize but sadly did not make the short list."}, {"userName": "Elaine", "userReviewDate": "Apr 23, 2011", "userURL": "http://www.goodreads.com/user/show/2352900-elaine", "userReview": "Aargh! How did this book end up on my shelf? I don't know but I took it on vacation, and read it one jetlagged sleepless night. To me this is the negative definition of \"chick lit\", and I say that as someone who loved Judith Krantz, Jilly Cooper, Lace, Bridget Jones, to say nothing of the Brontes and Austen, and many other exemplars of the genre. This books takes a \"creative\" and \"challenging\" family premise -- a sibling with Aspergers -- clothes it in bad prose and plot improbabilities, and then lets one note characters suffer and then fall in love. One sibling is improbably saintly, his character early on depicted as so nerdy and colorless as to make the \"happy twist\" where he gets the (most beautiful) girl so improbable as to seem bizarre. Another is routinely bitchy and repulsive, yet in the logic of such books, a charming and thoughtful \"Mr. Wrong\", instantly perceives that she is gloriously unique and precious (and NOT because she's beautiful), persists through all kinds of terrible treatment, and eventually gives us another completely fantastic (and laboriously dull) happy ending. All is justified by (of course) flashbacks that conveniently root character traits in suitably dramatic childhood episodes... Don't know how I got this one, as I said, and the Aspergers treatment may or may not be on the money, but the trappings are just too trite."}, {"userName": "Baljit", "userReviewDate": "Feb 11, 2010", "userURL": "http://www.goodreads.com/user/show/846699-baljit", "userReview": "This novel tells about the relationship between 3 siblings, Yasmin who has Aspenger's Syndrome, Lilla, arty, crazy and non-conformist and Asif, a young bright accountant who's always been the good boy of the family. It goes thru events, past and present, of the family coping with Yasmin's condition, and how it lead to resentment from her siblings, that they were sidelined by their mum. Their mum sudden death, leaves a vacum in which they struggle to come to terms with each other.Thru all this, Yasmin sees the world differently. She's highly intelligent, but is unconnected from her own feelings and from others, and she cant define her happiness and her hopes for the future."}, {"userName": "Robin Nicholas", "userReviewDate": "Jan 09, 2012", "userURL": "http://www.goodreads.com/user/show/1476299-robin-nicholas", "userReview": "This book started slow for me and really started to pick up steam as it went on. It is about a family of three siblings who have been left behind by their parent's deaths. The youngest sister has Asperger's Syndrome, which has had an impact on the entire family. Written from all of their different points of view, it is an interesting window into that world. The author does an amazing job of describing what it would be to live in the shoes of someone who has Asperger's Syndrome. As I was reading this book I literally started to turn the pages faster and faster as I went along. Good book."}, {"userName": "Teodora Grigorie", "userReviewDate": "Nov 01, 2016", "userURL": "http://www.goodreads.com/user/show/15982629-teodora-grigorie", "userReview": "This is not a life-changing book, but I think the story is very well written. I loved how the author played with the words and how consistent the story was. It was also interesting to discover more about the way people with Asperger syndrome experience life. The 3 stars don't reflect the quality of the book, but the intensity of the story."}, {"userName": "Katelijne Sommen", "userReviewDate": "Mar 26, 2017", "userURL": "http://www.goodreads.com/user/show/15293132-katelijne-sommen", "userReview": "While this book mostly achieves what it aims to achieve, and has a few nice passages, it remains a fairly unremarkable and stylistically dull attempt at trying to portray a radically different way of looking at life."}, {"userName": "Carol", "userReviewDate": "Jun 25, 2011", "userURL": "http://www.goodreads.com/user/show/4320450-carol", "userReview": "A good book on how Asperger's Syndrome can effect the family of those living with a person with the syndrome. Throw in some wonderful writing, great characters, and you have something that will have brad appeal!"}, {"userName": "Zanne", "userReviewDate": "May 09, 2013", "userURL": "http://www.goodreads.com/user/show/9528697-zanne", "userReview": "Why the hell are such juvenile books being passed off as adult fiction? Waste of paper, time and space."}, {"userName": "Mahak", "userReviewDate": "May 23, 2013", "userURL": "http://www.goodreads.com/user/show/15797963-mahak", "userReview": "This book is a bible on how to write a novel with all the cliches possible. Makes Karan Johar's 'My Name is Khan' look like a masterpiece. Strictly avoidable."}, {"userName": "Sharon", "userReviewDate": "Oct 29, 2016", "userURL": "http://www.goodreads.com/user/show/4964695-sharon", "userReview": "Found the POV of an autistic woman particularly interesting and informative."}, {"userName": "Gail Cohen", "userReviewDate": "Sep 01, 2011", "userURL": "http://www.goodreads.com/user/show/6176490-gail-cohen", "userReview": "Mash up of The Curious Incident of the Dog in the Night and Bridget Jones' Diary"}, {"userName": "Joan", "userReviewDate": "Oct 21, 2011", "userURL": "http://www.goodreads.com/user/show/6601395-joan", "userReview": "Quick read, not perfect but not a bad book."}, {"userName": "Jacqueline", "userReviewDate": "Apr 08, 2018", "userURL": "http://www.goodreads.com/user/show/12030315-jacqueline", "userReview": "Don’t even bother to read this book. There’s no development of characters and relationships. There’s no focus in the story plot. It felt like three separate stories that are too cliche and superficial. The protagonist Yasmin is diagnosed with Asperger’s Syndrome (AS). I often have a soft spot for characters like her and was looking forward to learn more about her. I was left disappointed to find her character under and poorly developed. Yasmin’s obsession with colours, routines and the lack of social skills feel stereotypical and tokenistic. It feels like the author googled up AS and just recreated this character when there is so much more behind the behaviours.None of the characters are likeable and it just wasted my time skimming through this book with an underwhelming ending."}, {"userName": "Hera", "userReviewDate": "Jan 30, 2018", "userURL": "http://www.goodreads.com/user/show/75814430-hera", "userReview": "I love the way character's with complicated minds are described and shared different perspectives in the book. Indeed life is not always easy, we can't always be happy nor always hopeful. We don't choose the life we live, but we can choose how we live it, to be courageous or not."}, {"userName": "Meriel Custance", "userReviewDate": "Dec 13, 2017", "userURL": "http://www.goodreads.com/user/show/53273462-meriel-custance", "userReview": "Loved this book! A love story through and through!"}, {"userName": "Mirjam", "userReviewDate": "Dec 03, 2011", "userURL": "http://www.goodreads.com/user/show/7104014-mirjam", "userReview": "Genuinely lovely.Snuck up on me, too. The first chunk wasn't much fun, so little so that I started to have the conversation with myself about having the conversation with myself about letting it go. Totally depressing state of affairs for these afflicted young people bent on blaming their deceased parents for everything ...I kept reading only because the writing was so lovely, and because of Asif. As pathetic as dude considered himself, he was simultaneously so believably righteous and good that I cared what happened with him.And, in the end, I was thrilled for him. As far as a coming-of-age story goes, this is so sweet, so surprising -- Farooki turned darkness into light so deftly that it, well, sneaked up. It's for the same reasons that this totally makes sense as a love story(s), too, especially for how it's structured, which keeps it ever fluid without ever seeming fractured. I wondered, in parts, how accurate Yasmin's voice was ... but before long, I let myself believe in that too.Basically, I bought this book (even though I checked it out from the library) all the way through -- pretty cool considering how sappy and sticky it might've become if any number of other writers had had the basic idea.Bravo. And yay! And off to find a copy of Bitter Sweets to read more from Ms. Farooki."}, {"userName": "Maria Goodin", "userReviewDate": "Feb 17, 2014", "userURL": "http://www.goodreads.com/user/show/15911906-maria-goodin", "userReview": "I thoroughly enjoyed this and will be looking out for more work from this author. It was told from three viewpoints, which kept it interesting and added variation. All three characters were well depicted and believable. I have a special interest in what makes us who we are, but it's rare to come across a book where the characters are not presented as ready-made individuals. This book looks at what made each of them who they are today, going back to their childhoods, and I really enjoyed that aspect of psychological development. My criticism might be that the big 'event' which the sister is building up to, and which is promised in the blurb, really turns out to be a non-event in that she simply decides not to proceed with it (don't want to give too much away here!). Also, the final message of hope rounds the book of very nicely and neatly, but is perhaps too idealistic. It felt like everyone just suddenly resolved all their problems and now felt positive about the future, which is great now that everything is going well for them, but how long will that last? Whilst the ending maybe wasn't as great as the rest of the book in my opinion, I am happy to give it a rare five and can't wait to dig out some more of her work."}, {"userName": "Dora Okeyo", "userReviewDate": "Mar 20, 2016", "userURL": "http://www.goodreads.com/user/show/5565423-dora-okeyo", "userReview": "I was introduced to Roopa's writing the first time I bought her book, 'Bitter Sweets.' It came as no surprise when I reached out for this book to add to my collection, and like Bitter Sweets this story centers on family. It's well told from the perspective of three siblings : Asif, the eldest who is an Accountant and the good boy, Kalila or Lila who is second and always changing her look based on who she is dating, and who is ashamed of her Eczema, and finally Yasmin who has autism. Taking care of Yasmin after his parents die is hard on Asif but he does not complain out loud as much as Lila.Each viewpoint is vivid and compelling and you see the struggles this family overcomes and more so you understand how Yasmin views the world and her family based on the choices they make and how they interact. It is a book worth reading, not because a character has Autism, but because for once the character comes off as a beautiful soul who understands more about those around her than they give her credit for."}, {"userName": "Jule", "userReviewDate": "Aug 15, 2015", "userURL": "http://www.goodreads.com/user/show/36549340-jule", "userReview": "This is one amazing book. Farooki is skilled in putting so much emotion and action in just over 300 pages, you will not want to put this novel down. Be it the sibling relationships, which are realistic in their strained love, or be it the wonderfully complex and deep characters that, once again very realistically, have so many internal struggles, or be it the cute romance stories that make the book so hopeful and help forward its message of possibility of change. Mainly, you will love this book for the portrayal and POV narrative of Asperger’s Syndrome, which is well researched and heart-breakingly written. It is just an emotional roller coaster, and you will probably cry, but like I said: it ends well, it gives you hope, which I liked a lot. It is just a fantastic book, and I am pretty much lost for words. The characters are fantastic, the relationships are amazing and interesting, there is representation, there are mental illnesses and self harm, there is lots of responsibility and inner turmoil. It is amazing, okay? Simply amazing."}, {"userName": "Diane Safer", "userReviewDate": "May 09, 2011", "userURL": "http://www.goodreads.com/user/show/5344819-diane-safer", "userReview": "Summary:Novel told from the perspective of London-born siblings still coping with the death of their unmarried mother after five years. At 23, Asif Murphy has become the reluctant head of the family that includes brooding Lila, a year younger, and 19-year-old Yasmin, whose Asperger's requires Asif to enforce a strict schedule. Asif, however, shares Lila's complicated feelings for this girl who so monopolized their mother's affection and time, resulting in \"a childhood of uneven treatment without the satisfaction of actual neglect.\" The two turn apoplectic after learning that Yasmin will be featured in a TV show about living with autism, but are both too busy to notice when their sister's perspective begins to change. Told in first-person sections, these chapters form the basis for Yasmin's show, point to Farooki's title, and reveal the book's somewhat faulty heart. Basing a novel around an autistic child is less than inspired, but Farooki rises above the cliché to deftly depict how family can encapsulate strife while also being a form of salvation."}, {"userName": "Cmorice", "userReviewDate": "Jun 27, 2014", "userURL": "http://www.goodreads.com/user/show/6107084-cmorice", "userReview": "Les choses comme je les vois Asif, Lila et Yasmine sont frère et s?urs. Lila a fui la maison, contraignant Asif à s?occuper de Yasmine, qui n?a pas idée du ressentiment qu?elle cause. Qui voit la musique en couleurs et se rappelle si bien de tant de choses que parfois sa tête lui fait mal. Qui n?est pas heureuse, et sait qu?elle est spéciale. Un jour, une équipe de télévision vient réaliser un reportage sur le syndrome d?Asperger et la vie de Yasmine. Un roman à trois voix doux-amer et touchant.Le Mot de l'éditeur : Les choses comme je les voisAsif, Lila et Yasmin sont frère et sœurs. Lila a fui la maison, contraignant Asif à s’occuper de Yasmin, qui n’a pas idée du ressentiment qu’elle cause. Qui voit la musique en couleurs et se rappelle si bien de tant de choses que parfois sa tête lui fait mal. Qui n’est pas heureuse, et sait qu’elle est spéciale. Un jour, une équipe de télévision vient réaliser un reportage sur le syndrome d’Asperger et la vie de Yasmin. Un roman à trois voix doux-amer et touchant."}, {"userName": "Jane", "userReviewDate": "Nov 16, 2011", "userURL": "http://www.goodreads.com/user/show/2994679-jane", "userReview": "Yasmin Murphy has Asperger's syndrome. Both parents have died and her siblings are to take care of her now. Her older sister who has been angry since Yasmin was diagnosed as a child has been angry and bitter because of the extra attention their mother has given Yasmin. Her older brother, who is the one caring for Yasmin now, is accepting, self-effacing, and lacking in confidence in himself. The book tells the story from all 3 views. Yasmin's parts of the story are intersting because we're getting into the inner workings of her particular coping with Asperger's. The sister is way too angry for me to accept her as anything but over the top in acting out. And the brother (whose name is Asif and is teased by being called As If) has some credibility. This is not a serious depressing story but not much humor either. Each character comes to some revelations and learn some acceptance by the end."}, {"userName": "Julie lit pour les autres", "userReviewDate": "Oct 08, 2015", "userURL": "http://www.goodreads.com/user/show/3875723-julie-lit-pour-les-autres", "userReview": "Dans un style dépouillé et limpide, Farooki nous offre une fenêtre dans la vie de Asif, Leila et Yasmine. Asif, le grand frère responsable, qui prend le relais de sa mère à sa mort auprès de Yasmine, la plus jeune soeur autiste ; Leila, l'enfant du milieu, déchirée par la rage et la honte, qui agit sur des coups de tête face à son impuissance quant à la condition de sa plus jeunes soeur...et Yasmine, bien sûr, jeune fille à l'intelligence prodigieuse qui peine à décoder les émotions de son frère et sa soeur. Les trois personnages sont bien développés, et chacun d'entre eux est à la recherche, à sa façon, de la paix intérieure. Ce roman pourrait plaire aux amateurs d'histoires de famille centrées sur la croissance et le développement des personnages. Si l'intrigue amoureuse paraît un peu contrainte, c'est la relation conflictuelle entre les trois personnages qui offre le plus de satisfaction. Une auteure que je lirai de nouveau."}, {"userName": "Megan.nelson", "userReviewDate": "Dec 25, 2011", "userURL": "http://www.goodreads.com/user/show/1325546-megan-nelson", "userReview": "This was one of those pleasant surprises I sometimes find on the New Fiction shelf at the library. It is the story of 3 orphaned London siblings in their late teens to early 20's trying to sort out their lives without their parents help. Asif, the oldest, most responsible sibling has taken on the care of his youngest sister, Yasmin, who is a genius with Asperger's syndrome. The chapters told from her perspective seem to capture the unique thought processes and perceptions of someone with Aspergers, while the chapters told from the view of Lila, a brash, wreckless, resentful 22 year old help describe how it feels to have a sibling whose special needs often overshadow the other children in the family. Because the author is British, the language is punctuated with modern slang ( lots of \"snogging\", \"sodding\" and \"effing\"), which is fun to read. The characters are well developed and stayed with me after I completed the book, but at times, I felt they were caricatures."}], "description": "Roopa Farooki deftly explores the relationships and rivalries among siblings in this beautifully written novel, longlisted for the Orange PrizeWhen your little sister is anything but normal, is there a \"normal\" way to feel towards her?The Murphy family is not like any other family on their block. Since both of their parents passed away, the three Murphy siblings, now entering adulthood, must grapple with the world's challenges - and each other - on their own. There's Yasmin, the youngest, who sees music in color and remembers so much that sometimes her head hurts, but whose autism renders her frustratingly distant. Lila, the stubbornly rebellious middle child who has never been able to forgive Yasmin for claiming so much of their mother's attention, leads a wayward existence, drifting between jobs and men. Asif, the responsible yet worn-down older brother, tries to hold the family together, but his commitment to caring for Yasmin has prevented him from having his own life. When the unthinkable threatens the family's delicate balance, will they stand together or fall apart? The Way Things Look to Me is a deeply moving portrayal of a family in crisis, caught between duty and love in a tangled relationship both bitter and bittersweet.", "title": "The Way Things Look to Me", "url": "https://www.goodreads.com/book/show/6046352-the-way-things-look-to-me", "average": 3.61, "cover": "https://images.gr-assets.com/books/1335082233l/6046352.jpg", "reviews": 95, "authors": [{"url": "https://www.goodreads.com/author/show/355875.Roopa_Farooki", "name": "Roopa Farooki"}], "type": ["Fiction", "Contemporary", "Family", "Health", "Young Adult"], "outlinks": ["http://www.goodreads.com/book/show/6046352-the-way-things-look-to-me", "http://www.goodreads.com/book/show/11199333-the-way-things-look-to-me", "http://www.goodreads.com/book/show/8767609-the-ways-things-look-to-me", "http://www.goodreads.com/book/show/1379403.Bitter_Sweets", "http://www.goodreads.com/book/show/6978406-half-life", "http://www.goodreads.com/book/show/6046351-corner-shop", "http://www.goodreads.com/book/show/21794729-the-good-children", "http://www.goodreads.com/book/show/13343213-the-flying-man", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}