{"ratings": 244, "userreviews": [{"userName": "Eryn✵", "userReviewDate": "Oct 13, 2017", "userURL": "http://www.goodreads.com/user/show/17568354-eryn", "userReview": "4 STARS\"The Yellow Wallpaper\" will always be my favorite short-story by Gilman. However, her others are good too. Not nearly as good as her most famous short-story (A Yellow Wallpaper), but very thought provoking and pro-feminist.Wonderful!"}, {"userName": "Paul", "userReviewDate": "Sep 26, 2011", "userURL": "http://www.goodreads.com/user/show/4643325-paul", "userReview": "Interesting set of short stories about the role of women. Charlotte Perkins Gilman was a feminist writing in the late nineteenth and early twentieth century. The stories vary greatly in quality and some are formulaic, although they make a point that needed to be made again and again; women are perfectly capable and independent and tend to be held back by domineering and thoughtless men. The gothic stories are excellent, especially the title story about a descent into madness. The Yellow Wallpaper has been used by analysts (especially Freudian and Lacanian). It is deliberately ambiguous and tries to dispose of the nineteenth century ideal of the true woman being angelic. The other gothic stories (The Giant Wisteria and The Rocking Chair)are genuinely creepy. The stories do vary in quality, but the message is clear and still relevant and thought provoking. Developing Darwinian ideas the point being made is that women not men are the central and driving force of human evolution."}, {"userName": "Bettie☯", "userReviewDate": "May 28, 2009", "userURL": "http://www.goodreads.com/user/show/1108123-bettie", "userReview": "The Yellow Wall-paper was featured in New England Magazine(January 1890)647-656.One of those sprawling flamboyant patterns committing every artistic sin.Other stories:That Rare Jewel (1890)The Unexpected (1890)"}, {"userName": "Alice Lippart", "userReviewDate": "Oct 11, 2016", "userURL": "http://www.goodreads.com/user/show/27078093-alice-lippart", "userReview": "Interesting collection, but gets a bit repetitive."}, {"userName": "Will", "userReviewDate": "Feb 18, 2012", "userURL": "http://www.goodreads.com/user/show/1121158-will", "userReview": "Read it way, way back when I was 12. Even at the time, I remember thinking \"Y U NOT GET OUT OF ROOM LOL U CRZY.\" But the sheer banality of it makes it disturbing... I mean the wallpaper? You can't even trust the wallpaper to have your back now? It's like you got attacked by the laundry hamper.And of course, the social context of the protagonist is even creepier, with the very kind Man Who Will Take Care Of Her. Which is why at the end, you're concerned not about the result (either crazy or lost woman), but concerned that she may have, at the end, made the right call for her. And THAT... that's just scary."}, {"userName": "Julie", "userReviewDate": "May 12, 2016", "userURL": "http://www.goodreads.com/user/show/20397850-julie", "userReview": "The best collection of short stories I've ever read."}, {"userName": "Evan", "userReviewDate": "Jul 27, 2017", "userURL": "http://www.goodreads.com/user/show/36933560-evan", "userReview": "The titular story is a classic for a reason, and it's powerful stuff. At her best on the specifics of women's experiences under patriarchy, but so very white and unable to write character's who aren't. Also, can only capture the middle-class. A good polemicist for women#s rights, but limited by her outlook."}, {"userName": "Zee", "userReviewDate": "Mar 21, 2011", "userURL": "http://www.goodreads.com/user/show/3135769-zee", "userReview": "Gilman's prose is of the scary type. Scary for its' intellect and practical advice for all women. First of all, she is an unapologetic feminist. These well-structured little stories could be divided into three themes which showcase Gilman's adeptness in her art. The first third of the book displays distinct Gothic elements where houses (what Freud called the 'Unheimliche') become objects that reflect female repression. In 'Yellow-Wallpaper', Gilman's most famous and disturbing story, the house is portrayed as a domestic prison, a warden, and later as a mirror that depicts the awful break-down of the main character. In truth, I was not prepared for the subtle horror of the final scene due to Gilman's clever use of language. There were also undertones to this story that paralleled partly with Virginia Woolf's own tragic death. Gilman's inspiration came from personal experience after being admitted to a mental institution whereupon the regime was so bad that it almost made her lose her mind. In her preface, she states in particular how the story was written to all doctors who think total rest and complete detachment from any activity are sure cures for a curious, flexible mind. The second set of stories are mostly humorous satire's based on the style of different well-known authors such as Austen and R.L. Stevenson. While they were well-written these did not particularly interest me so much. The last part of the book however clearly hammered home the political and socio-economic potential of women in the world. The stories prove that Gilman was a woman very much ahead of her time. The stories themselves muct have caused a real stir and they are worded in such a way to stamp out any kind of protest from the 'male chauvinistic pigs' that she is comstantly pounding. While the stories were entertaining, I did tire of the overly feminist tone, and soon the plots all began to merge together. Allow me to explain: a woman at the dregs of her life (a mere 50 years old) suddenly gets the urge to live for herself for once. Her children are married off, the husband is conveniently dead, so there is nothing stopping her. The children are trying to get at her money (what little is left of it) by getting her to sell off the property and move in with them. The matriarch refuses and instead of explaining what she'll do with her life, sets about renting off her property, setting up 'ladies clubs', starting up a jam-making business, whereupon in a year her income doubles and trebles. In two years she becomes a millionaire and laughs in the face of her children and everyone else who considered her a helpless good for nothing old lady. End of story. As I said, while this is entertaining, it does get tedious. But all in all a must-read even if just for 'The Yellow Wallpaper'."}, {"userName": "Sonatajessica", "userReviewDate": "Aug 25, 2014", "userURL": "http://www.goodreads.com/user/show/3577389-sonatajessica", "userReview": "Browsing through the other reviews most readers seem to have only commented (and read) the story from the title, \"The Yellow Wallpaper\". If I had done the same I would hand out 5 stars now. That story is absolutely stunning, it is disturbing and fascinating, creepy, so well crafted and not that simple to decipher, a true gem. Most of the other stories in this collection, which claims to be the most complete collection of Perkins Gillman's stories, are straight forward feminist stories. Surely relevant at the time, even shocking I assume, she constantly reveals society's double standards and presents modern thinking, confident women that make smart, confident choices. But there are 40 entries in here and almost all follow the same path, the same structure and hand-feed the same message. Naturally, the reading experience turns samey. I understand that the intention of this compilation was not to give a varied impression but, as I mentioned above, a complete picture of her writing. Nevertheless, I wished there would have been more stories like the \"YWP\", stories that leave something to the reader to work with, think about and stir something up. Not all the feminist stories read dated, sometimes I wash shocked that the presented and criticized stereo-type still holds some relevance today, but they all read highly predictable. Some people will consider this an interesting read for the historical significance, but I want more form the short stories I read, I want a personal significance. All that being said, the writing of Perkins Gilman is remarkable, within a few sentences she gives you 3-dimensional characters and setting, a true short story champion.I need to mention the two gothic horror stories that for that reason stand out, \"The Rocking-Chair\" and especially \"The Giant Wistaria\", that second story reminded me a bit of Shirley Jackson, it was really good. I wish there would have been more writing like this. Coming back to \"The Yellow Wallpaper\", it seems like a lot of people read it in high school years, I am positive it would have been over my head at the time, now I loved it and want to read it again in a couple of years because it seems like on of those that offers so many things that several reads should give you several interpretations. I love a story that gives me enough to have my interpretations but leaves room to ponder and wonder. Great, disturbing story!!"}, {"userName": "Renee", "userReviewDate": "Nov 15, 2016", "userURL": "http://www.goodreads.com/user/show/4067771-renee", "userReview": "Recommended by a librarianI got this basically to just read The Yellow Wall-Paper and I highly recommend reading it. What I took away from it, and was validated by reading Chartlotte's essay \"Why I wrote the Yellow Wall-Paper, wasn't that this was simply a story about a woman's decent into madness., but about a woman who was suffering post par-tum depression. Because of the time period her husband, the doctor,ignored and placed the label of \"hysteria\" upon her. Researching the author has found not only did she suffer from depression but also depression after the birth of her daughter and didn't care for the way women were treated.The MC talks about not being able to deal with her baby and how she begins to hate everything she used to love and is tired all time. Her husband takes her to a house far away to \"recover\" but he's not actually treating her. He's making it worse by locking her away and not allowing her to really see people or do anything but sit around and stare out a window.The MC's fascination with the awful wall paper is understandable, she has nothing else to do with her time and her mind in unwell.Her husband won't allow her any excitement or to even write in her journal. I have seen post- partum depression and it is scary, I have been lucky to not experience more than basic \"baby blues\" but I do suffer from depression and anxiety myself, the worst thing you can do is lock yourself away and give into the crazy thoughts in your mind.This was an interesting, complicated and slightly horrific read. I took away a very sad but not uncommon ending, someone might take away something different.See the entire blog post here: http://liberalcurvygoddess.blogspot.c..."}, {"userName": "thewanderingjew", "userReviewDate": "Sep 01, 2014", "userURL": "http://www.goodreads.com/user/show/2309191-thewanderingjew", "userReview": "These stories are written in a different time frame, almost a century and a half ago, they are more literature than the made for TV tales turned out furiously on the computers of modern day authors, turned out with stories of violence and sex to attract an audience, rather than with interesting stories about life’s challenges. This collection of short stories was simply a pleasure to read. Each one, on its own, had a different theme about women. One story was about a misunderstood woman going mad after the birth of her child, when her hormones were batting each other around like baseballs. A\\Another was about a young woman wronged, who haunts the dreams of those living in the home she once lived in with her fatherless child. The next is about a pampered woman who finds her own strength and grows independent. Then there is the story of a bitter, over zealous aunt who makes a deceitful bargain with her great nephews, only to be chastised by the minister for her duplicity.The selection of stories is wholesome. They is a mixture of the real with the mystic. There is no stupid sex or foul language. There is really no violence to speak of and there are happy endings, of a fairy tale nature, in some cases. They cover the gamut of women’s issues, career, emotion, freedom, purpose, love, marriage, divorce, devotion, loyalty, faithfulness, religion, responsibility, and even vengeance, but all of the stories are treated in such a way that they do not tax the reader, but rather they entertain perfectly with the style and the message."}, {"userName": "Claire", "userReviewDate": "Feb 24, 2016", "userURL": "http://www.goodreads.com/user/show/10003027-claire", "userReview": "Had to return the book to the library before finishing. Got up to \"Mrs. Elder's Idea.\" I have been enjoying the various twists on received wisdom in the stories I have read so far. Will resume when I get the book again.Got the book 10/17/16The book opens with \"The Yellow Wallpaper\" and closes with \"Why I Wrote the Yellow Wallpaper.\" On first reading the story,a long time ago, I got swept up in the main character's mindset of the need to be free and the final freeing. (I'm not saying I was a good reader) So imagine my surprise when I saw the theatre version that clearly shows developing insanity. In actuality, I think the two are in tension. The story is brilliant and the ending essay indicates that it changed some 19 century physicians from using the \"rest\" cure.I enjoyed most of the stories in between, though short stories are not my favorite to read. All had some twist on \"duty\" or assumptions--usually gender related, wherein both men and women held these assumptions that needed to be disrupted, sometimes age related, where usually the young needed some thought adjustment. A few added the dimension of ghost story.However, some of the later pieces were more allegory than story, no plot, just idea. One could have been an early version of Herland (though I would have to check dates to be sure).It was interesting to read these critiques of received wisdom in the late 1800s and early 1900s, to see the precursor of the feeling \"that has no name.\""}, {"userName": "Jessica", "userReviewDate": "May 09, 2013", "userURL": "http://www.goodreads.com/user/show/8391461-jessica", "userReview": "The stars are for the title story, really. If I were to have rated the rest of Gilman's stories in this collection, I would have been frustrated with Goodreads rating system for forcing me to give them even a full star. The Yellow Wallpaper is a remarkably imagined story that delves deep and rather eerily into the product of a mind wrought of suffocation and hopelessness. It is a haunting piece that is a foundation for Gilman's reputation as a feminist intellectual to stand upon (and perhaps the only one at that). I am often irked by the one-sidedness of feminist literature, but The Yellow Wallpaper is a fascinating read. That cannot be said about the rest of the stories in this collection, however; they fall flat in comparison to the title piece and read as nothing but one-sided propaganda. What's even worse than that is it isn't even informative or intellectual propaganda. The remainder of the collection as a whole is weak and unable to stand on its own as even decent literature. The motives of the characters are repetitive and unrealistic, while the endings are idealistic and often too simplistic they are silly. It was mind-numbing to read story after story of feminist maundering. I applaud The Yellow Wallpaper and its ability to maintain relevance still today, but it makes my distaste for Gilman's other stories that much stronger."}, {"userName": "Kayl Parker", "userReviewDate": "Mar 13, 2015", "userURL": "http://www.goodreads.com/user/show/27626845-kayl-parker", "userReview": "1// \"Women were always mysterious enough, heaven knows; but \"the higher education\" seems to have added an intense self-consciousness of their own intricacy. Where they used to be queer and couldn't account for it, now they are queer and can give you a thousand reasons.\"2// \"...he felt that all her uncertainties were accounted for, and that the error was his - in having married too many kinds of people at once.\"3// \"In her soft-carpeted, thick-curtained, richly furnished chamber, Mrs Marroner lay sobbing on the wide, soft bed.She sobbed bitterly, chokingly, despairingly; her shoulders heaved and shook convulsively; her hands were tight-clenched; she had forgotten her dignity, her self-control, her pride. In her mind was an overwhelming, unbelievable horror, an immeasurable loss, a turbulent, struggling mass of emotion. In her reserved, superior, Boston-bred life she had never dreamed that it would be possible for her to feel so many things at once, and with such trampling intensity. She tried to cool her feelings into thoughts; to stiffen them into words; to control herself - and could not. It brought vaguely to her mind an awful moment in the breakers at York Beach, one summer in girlhood, when she had been swimming under water and could not find the top.\""}, {"userName": "Robert Day", "userReviewDate": "Jun 27, 2013", "userURL": "http://www.goodreads.com/user/show/13307338-robert-day", "userReview": "This isn't just about Yellow Wall-Paper, it's about life from the perspective of a woman who sees that women are treated differently to men and who has the balls to write a whole slew of stories that express that.. over and over again.The author had a bit of an obsession about the theme of women's rights and who am I to disagree. After all, they are set almost a hundred years ago and I have no idea how valid these views are.I do know that, aside from the obsessional quality of it all, these stories are entertaining, easy to read and well written, albeit in a style that is slightly different to the modern way.I also know that if a woman's lot was anything like that portrayed here, they deserve my deepest sympathy and.. well, I'm glad times have changed (imho).I actually read this book because the lead story is a recommended read for the Masters in Creative Writing at my local Uni. Would I pay 4 grand to sit this course? Hmm; we'll see."}, {"userName": "Céline :)", "userReviewDate": "Jan 25, 2015", "userURL": "http://www.goodreads.com/user/show/7297961-c-line", "userReview": "THE YELLOW WALLPAPER:Wow, this book was intense! It follows a woman as her mind slowly degrades and becomes obsessed with the yellow wallpaper that covers the room she is staying in. It was really fascinating to read from her perspective and follow her downward spiral as she loses control of reality. I look forward to studying more of this novel in class :)"}, {"userName": "Sherri", "userReviewDate": "Nov 03, 2008", "userURL": "http://www.goodreads.com/user/show/1280578-sherri", "userReview": "I had never read \"The Yellow Wallpaper\" before, and I thoroughly enjoyed it. It took me forever to read the full book of stories because all of them had the same strong-woman struggling against oppressive society theme - good for one or two stories at a time but gets old when you're reading 20+ stories. Thus, taken in little bits, I enjoyed it immensely."}, {"userName": "Kim", "userReviewDate": "Jun 23, 2009", "userURL": "http://www.goodreads.com/user/show/759318-kim", "userReview": "The early stories were all excellent. Toward the end they became more advice in story form than real literary shorts. Excellent book though and cool to see the viewpoint of the late teens and early twenties as far as feminism goes."}, {"userName": "marissa sammy", "userReviewDate": "Jun 23, 2007", "userURL": "http://www.goodreads.com/user/show/122026-marissa-sammy", "userReview": "Intriguing, compelling collection of stories; I found the short stories more interesting than the excerpts of longer works. There's a strength and fierce longing underpinning each story that is undeniable."}, {"userName": "Rosie", "userReviewDate": "Jan 24, 2014", "userURL": "http://www.goodreads.com/user/show/3898547-rosie", "userReview": "I only read the stories relevant to my Lit course work, those that were more flippant and transparent were the reason this only got 3 stars from me, I preferred the stories with a bit more of an issue towards it, they seemed to place more of a reality on the stories."}, {"userName": "Jen", "userReviewDate": "May 05, 2011", "userURL": "http://www.goodreads.com/user/show/4195140-jen", "userReview": "Charlotte Perkins Gilman was an early 20th century, Utopian feminist writer. Her short stories highlight the plight of American women at the time. She was one also of the first people to write seriously about independent women and also mental issues (The Yellow Wallpaper)."}, {"userName": "T-mere", "userReviewDate": "Sep 09, 2008", "userURL": "http://www.goodreads.com/user/show/1465732-t-mere", "userReview": "PG is always worth reading!"}, {"userName": "Fred Aguilar", "userReviewDate": "Dec 07, 2009", "userURL": "http://www.goodreads.com/user/show/3012705-fred-aguilar", "userReview": "just starting. Jenn's rec."}, {"userName": "Jen", "userReviewDate": "Sep 09, 2008", "userURL": "http://www.goodreads.com/user/show/1512691-jen", "userReview": "The Yellow Wallpaper still resonates for me on soooo many levels...and I usually dislike short stories."}, {"userName": "Anne", "userReviewDate": "Mar 01, 2007", "userURL": "http://www.goodreads.com/user/show/13840-anne", "userReview": "Well recommended by the fabulous Anj. A short read - but intense!"}, {"userName": "Grace", "userReviewDate": "Sep 09, 2008", "userURL": "http://www.goodreads.com/user/show/1503996-grace", "userReview": "One of my fav's, depressing but very interesting."}], "description": "Charlotte Perkins Gilman was America's leading feminist intellectual of the early twentieth century. The Yellow Wallpaper and Other Stories makes available the fullest selection ever printed of her short fiction, featuring the pioneering feminist masterpiece of the title, her stories contemporary with The Yellow Wallpaper, the fiction from her neglected California period (1890-95), and her later explorations of \"the woman of fifty.\" Together, these impressive works throw new light on Gilman as a writer of fiction. She shows women who no longer have a traditional domestic function but who nevertheless find a new purpose and succeed on their own terms.", "title": "The Yellow Wall-Paper and Other Stories", "url": "http://www.goodreads.com/book/show/6425940-the-yellow-wall-paper-and-other-stories", "average": 3.9, "cover": "https://images.gr-assets.com/books/1355059876l/6425940.jpg", "reviews": 27, "authors": [{"url": "https://www.goodreads.com/author/show/29527.Charlotte_Perkins_Gilman", "name": "Charlotte Perkins Gilman"}, {"url": "https://www.goodreads.com/author/show/138739.Robert_Shulman", "name": "Robert Shulman"}], "type": ["Short Stories", "Classics", "Fiction", "Literature", "Health"], "outlinks": ["http://www.goodreads.com/book/show/6425940-the-yellow-wall-paper-and-other-stories", "http://www.goodreads.com/book/show/52296.The_Yellow_Wall_Paper_and_Other_Stories", "http://www.goodreads.com/book/show/200864.The_Yellow_Wallpaper_and_Other_Stories", "http://www.goodreads.com/book/show/99300.The_Yellow_Wallpaper_and_Other_Stories", "http://www.goodreads.com/book/show/286957.The_Yellow_Wall_Paper", "http://www.goodreads.com/book/show/531509.Herland", "http://www.goodreads.com/book/show/99302.The_Yellow_Wallpaper_and_Other_Writings", "http://www.goodreads.com/book/show/86502.Herland_The_Yellow_Wall_Paper_and_Selected_Writings", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}