{"ratings": 9221, "userreviews": [{"userName": "Clouds", "userReviewDate": "May 09, 2012", "userURL": "http://www.goodreads.com/user/show/9374686-clouds", "userReview": "Christmas 2010: I realised that I had got stuck in a rut. I was re-reading old favourites again and again, waiting for a few trusted authors to release new works. Something had to be done.On the spur of the moment I set myself a challenge, to read every book to have won the Locus Sci-Fi award. That’s 35 books, 6 of which I’d previously read, leaving 29 titles by 14 authors who were new to me.While working through this reading list I got married, went on my honeymoon, switched career and became a father. As such these stories became imprinted on my memory as the soundtrack to the happiest period in my life (so far).2003 was a wonderfully rich and diverse year for Sci-Fi and Fantasy!My beloved Locus Sci-Fi Award went to this, Robinson’s \n\nYears of Rice and Salt\n\n.The sister award, the Locus Fantasy went to Miéville’s \nThe Scar\n (which is awesome!)Gaiman’s superb \nAmerican Gods\n took the Nebula.The prestigious Hugo was awarded to Sawyer’s \nHominids\n.\nThe Separation\n, by Chris Priest picked up the Arthur C Clarke.The BSFA award went to \nFelaheen\n by JC Grimwood.McKillip’s \nOmbria in Shadow\n, got the Mythopoeic and shared the World Fantasy.The other co-winner of the World Fantasy was \nThe Facts of Life\n by G. Joyce.Eight awards – eight different winners. How often does that happen?I was pretty cautious before starting \n\nThe Years of Rice and Salt\n\n. I’d only read one other Robinson before – \nRed Mars\n, many years before – and found it tough going at the time (but that’s another review). I chucked this into my suitcase for my honeymoon, content that if it was too much of a grind for around-the-pool reading, my wife was packing plenty of lighter fantasy fare I could borrow.My fears were all for naught – this is totally different kettle of fish to the Mars Trilogy.Alternative history premise: the black plague obliterated Europe and the Eastern civilizations scrap over global conquest.Story lens: reincarnation! A small family (?) of souls reincarnate in different forms and relationships with each other over ten novellas covering seven hundred years in a great karmic cycle.I like Buddhism. I like alternative histories. I like the interlinked novella approach.For holiday reading, this was perfect. I devoured a novella every time we took one of Malta’s quirky buses to a tourist trap. I sipped at them leisurely while lounging on the beach. I chatted about the wonderful ideas with my new wife while we enjoyed room service on our balcony. I loved the little between-life moments of the reincarnation.By turns this book made me excited and tranquil. It reminded me a little of David Mitchell’s brilliant \nGhostwritten\n with a touch of Wilbur Smith in each little adventure. It was one of those books I didn’t want to end. Surely there could be one more reincarnation? One more story? I’m surprised by the number of negative reviews I’ve found, I guess it helps that I’ve always held Buddhist inclinations. I give this five-stars without hesitation.Not long after we returned from our honeymoon one our cats, Callie, escaped and was killed on the road near our flat. She was the prettiest, most affectionate kitty I’ve ever met – adored by all who met her (even dog people). When I found out that she had died, it was this book that came to mind. One of the stories involves a soul 'demoted' to a life as a tiger for one cycle.I told my wife that Callie “was just too good to be a cat and they had to call her spirit back so she could be reincarnated as a person”. The idea was comforting. Those words were still in my head when, very shortly after, I discovered we were having a child. When I look into my baby son's eyes now, I wonder if, just maybe, there’s a bit of Callie's endless curiosity looking back. That makes me happy."}, {"userName": "Bradley", "userReviewDate": "Jan 22, 2018", "userURL": "http://www.goodreads.com/user/show/4213258-bradley", "userReview": "This one's going right in the category of OMG this is epic SF of a very serious nature and scope.It goes well beyond the \"normal\" subgenre of alternate histories to throw us into a vast and very impressive exploration of China and India as they completely dominate the culture and space of the entire world under the slight alteration: that most of the Caucasian world died off in the Black Plague.It's really gorgeous and it flows really well. Expect many short novellas giving us snippets of time from the plague and progress it forward until we have a fully technological world. Christianity is a footnote. Muslims are dominant, as are Buddhists, but what really fascinated me was the poetry, the history of science and different terminologies, the odd similarities to our own history, including population pressures, various warcraft and a world war, the suffrage of women, medicine development, and so much more.But what works best for me was a really brilliant thread of reincarnation. As in, tying all the novels together in a later scholarly work that reconciles a few great souls from incarnation to incarnation through history. We get the lives of those characters in the whole novel, and it really is gorgeous. A Buddhist SF that not only focuses on being self-referential and consistent, but it does it in a very detailed and academic way that feels almost too gorgeous for words.Brilliant doesn't really do the work justice.I'm not going to say it doesn't get slightly overburdened by the science bits as if it was just a vehicle for some particularly juicy fundamental discoveries, but I also like that kind of stuff. I didn't mind. It did make the text a bit large, however. :)I was reminded very favorably of some other epic SF tomes like Poul Anderson's Boat of a Million Years. We have all of Time to work in and the idea exploration is breathtaking. This one might become one of my favorite KSR novels. Easily."}, {"userName": "Ted", "userReviewDate": "May 26, 2012", "userURL": "http://www.goodreads.com/user/show/7213075-ted", "userReview": "[The Books deal with the following :1. Awake to Emptiness – the discovery by Mongol invaders that western Asia/Eastern Europe are no longer inhabited by living humans.2. The Haj in the Heart – taking place in Al-Andalus (Spain) in the 16th century, with no interference from the Spanish Inquisition3. Ocean Continents – the discovery of the Americas by China4. The Alchemist – the development of the scientific method in Samarkand5. Warp and Weft – a Japanese samurai warns Native Americans of the threat they face from the Chinese on the West Coast, and the Moslems on the East Coast6. Widow Kang – a Muslim scholar attempts to form a synthesis of Taoism and Islam, in order to bring peace to the increasingly hostile major religions7. The Age of Great Progress – the rise of a civilization and leader in southern India, which attempts to right the wrongs of the Chinese and Islamic hegemonies8. War of the Asuras – a 70 year world war between China and the Islamic states, with the leagues of Books 5 and 7 drawn in.9. Nsara – the aftermath of the war, in Muslim France10. The First Years – civilization in our own time, with many of the same problems, and some different ones (hide spoiler)]"}, {"userName": "Saadiq Wolford", "userReviewDate": "Apr 15, 2008", "userURL": "http://www.goodreads.com/user/show/537754-saadiq-wolford", "userReview": "Dear Kim Stanley Robinson,I think your Mars trilogy is one of the greatest pieces of science fiction every written. I've read it twice in the past ten years and will probably read it three more times before I grow old. I even read the first book in your eco-thriller trilogy and, though there's not much plot to speak of, thought it was interesting. In short, I love you, man, you're mi hermano.But, damn, how did you manage to screw The Years of Rice and Salt up? The concept is golden: the plague completely wipes out ol' whitey in 14th century Europe, leaving the rest of history to be written by the Chinese, Arabs, Native Americans, and so on. That is enough alternative history for a trilogy, let alone a single book.And, yet, it is DULL. I gave this my best effort, patiently wading through 400+ pages in search of a compelling narrative thread before giving up. If you want to write a philosophical treaties on Eastern thought, than please do so and sign me up as one of your eager audience. But don't try to cram it into the guise of novel and string the reader along with the barest of narrative threads...it's just not the right format. I'm giving you two stars: one for originality and one because, at heart, I'm nostalgic for your earlier work and know that you're down with the program."}, {"userName": "Travis Johns", "userReviewDate": "May 27, 2008", "userURL": "http://www.goodreads.com/user/show/129586-travis-johns", "userReview": "lesson to be learned: just because you like one book (or in this case, three) by a particular author doesn't necessarily have to imply that you will have to like all books. This, my darlings, is a blatant case in point. Thy premise: The black plague knocks out 99 percent of Western Europe - so far, so good. However, instead of focusing on the immediate after effects of such an event, as is the case with the first chapter, albeit in somewhat of a too stylistically poetic fashion, the novel instead embarks on a parallel (note, parallel, not alternative) history of the world as the rest of the world matures in the void of the white man's burden... which is also an interesting notion, except for one small snatch - each and every single story focuses on the reincarnated souls of approximately 4 individuals, all with similar names who are somehow or another responsible for, oh, basically EVERY major invention and innovation in the history of mankind, and somehow in the thick of it all, nearly always end up being massacred at the end of their respective chapters... by about the third chapter, oh my children, the proverbial jig was, oh, just kindasorta up and I was officially bored... and only reading the novel for a.) hope of improvement and b.) lack of any idea as to what i wanted to read next.... ho hum. Back to the parallel history aspect - just slightly weak. especially with regard to temporal events. somehow, nearly every major invention in the novel coincided with its temporal occurrence in our respective tomes - the telescope and gravity in the 17th century, an industrial revolution with trains and steam ships in the 18th, a world war in the mid-20th, etc. Many apologies, but being a history buff, I know how it all happened - if i want to read about alternatives, I'd hope that it would be something other than just a word scramble of proper nouns as to the wheres and whats that form the specifics of said alternication... not to mention that one single Sufi alchemist somehow manages to claim the merits of Newton, Gallileo and Kepler all in one... erm, mildly suspect, ja? eh, just thought I'd share..."}, {"userName": "Claudia", "userReviewDate": "Apr 18, 2018", "userURL": "http://www.goodreads.com/user/show/20498957-claudia", "userReview": "“TRIPITAKA: Monkey, how far is it to the Western Heaven, the abode of Buddha? WU-KONG: You can walk from the time of your youth till the time you grow old, and after that, till you become young again; and even after going through such a cycle a thousand times, you may still find it difficult to reach the place where you want to go. But when you perceive, by the resoluteness of your will, the Buddha-nature in all things, and when every one of your thoughts goes back to that fountain in your memory, that will be the time you arrive at Spirit Mountain.”After reading this novel, I believe that KSR can stand proudly among the great philosophers of our time - I already included him among the most erudite writers ever lived. If I ever hear one more saying that speculative fiction is not literature, I will smack them on the head with this book.In Red Mars trilogy I was astounded by his knowledge in physics, genetics, biology, politics, sociology, economics and a great deal of other fields. Here, his knowledge of history, geography, culture and religion blew my mind. The amount of research he does for every book he writes is enormous. And to take all this knowledge and adapt them to an alternate history which gives you the creeps how accurate it feels, is just amazing.The blurb is precise in outlining the setup in which events are taking place. But in all these years of turmoil, we follow a few souls which reincarnate repeatedly, as different persons in different ages, always meeting but almost never knowing that they know each other since the beginning of times. The only time when they recognize each other is in the bardo, when they realize that soon there will be another rebirth and they try to do something different and meaningful in the next life.To recognize them, their names begins with the same letter. There are several characters more or less important, but three of them are the main ones:K – the revolutionary one, the Yang, the Water element as I saw them, always trying to change the world;B – the faithful one, The Yin, the Earth element, always trying to temper K and aiming to Nirvana;I – the scholar, the Wind element, which usually acts as a binder between the K and B.Technically, this is not a novel; it consists of 10 stories, chronologically following each other on the timeline, each with its own set of characters which are different but all the same. We have no plot, no action and not exactly an ending. What we do have are lots of philosophical debates on Buddhist and Muslim precepts, extensive descriptions of cultural, social and political environments throughout the epochs and most of all, a vision of how the world would have looked like if Christianity disappeared and Islamic states and China would have ruled the world. There are also other nations which made their significant contribution in this alternate history, such as the historical state Travancore (India) and the Haudenosaunee (North-American natives). It may sound boring, but it isn’t; and keep in mind that this is not a favorite subgenre of mine. There are, as in every book, fragments more interesting than others or some which could have been shorter. But in every of the ten stories there is something to keep your interest going and I savored every word – Book 6 is my favorite; it has the best debates I ever read on any given subject. As to quote the author: “Certain moments give us such unexpected beauty”.Although I mentioned that religion is an important part of the book, KSR brilliantly juggles through different point of views – atheists, fervent religious and agnostic. One example below and one of my favorites:“The religions that say you should sacrifice or even pray to a god like that [who nevertheless act like bad children, deciding capriciously whom to reward and whom not to], to ask them to do something material for you, are the religions of desperate and ignorant people. It is only when you get to the more advanced and secure societies that you get a religion ready to face the universe honestly, to announce there is no clear sign of divinity, except for the existence of the cosmos in and of itself, which means that everything is holy, whether or not there be a god looking down on it.”There are also concepts which today sound inconceivable, such as the Islamic Queen Katima, the founder of Nsara (Nantes), which later will be an important city in Firanja (Europe). Here’s the modern map for a better picture of the world:Bottom line is, it’s a book you’ll either love or hate, that’s how I see it. It’s not an easy read and you have to be in the right mood to enjoy it. In the end, it is the story of the human species: no matter the setting or who rules the world, humans will always be greedy of power, always fighting for supremacy and money but there will also be genius, selfless minds to drive us forward. The question is how much we will last.There is a lot more to say about it, but I will just leave you with some of my favorites quotes and hope you’ll give it a try some day.There was no need to speak in this singing world, so huge, so knotted; no human mind could ever comprehend it, even the music only touched the hem of it, and even that strand they failed to understand—they only felt it. The universal whole was beyond them. And yet; and yet; sometimes, as at this moment, at dusk, in the wind, we catch, with a sixth sense we don't know we have, glimpses of that larger world—vast shapes of cosmic significance, a sense of everything holy to dimensions beyond sense or thought or even feeling—this visible world of ours, lit from within, stuffed vibrant with reality.“It doesn't work like that,” Butterfly informed him as they panted off together into the mists. “I've seen a lot of people try. They lash out in fury and cut the hideous gods down, and how they deserve it—and yet the gods spring back up, redoubled in other people. A karmic law of this universe, my friend. Like conservation of yin and yang, or gravity. We live in a universe ruled by very few laws, but the redoubling of violence by violence is one of the main ones.”“It takes courage to keep love at the center when you know just as well as anyone else the real state of things! It's easy to get angry, anyone can do that. It's making good that's the hard part, it's staying hopeful that's the hard part! It's staying in love that's the hard part.” Khalid waggled his left hand. “All very well, but it only matters if the truth is faced and fought. I'm sick of love and happiness—I want justice.”“To a very great extent human history has been the story of the unequal accumulation of harvested wealth, shifting from one center of power to another, while always expanding the four great inequalities. This is history. Nowhere, as far as I know, has there ever been a civilization or moment when the wealth of the harvests created by all has been equitably distributed. Power has been exerted wherever it can be, and each successful coercion has done its part to add to the general inequality, which has risen in direct proportion to the wealth gathered; for wealth and power are much the same. The possessors of the wealth in effect buy the armed power they need to enforce the growing inequality. And so the cycle continues. […] All the world's various religions have attempted to explain or mitigate these inequalities, including Islam, which originated in the effort to create a realm in which all are equal; they have tried to justify the inequalities in this world. They all have failed; even Islam has failed; the Dar al-Islam is as damaged by inequality as anywhere else. Indeed I now think that the Indian and Chinese description of the afterlife, the system of the six lokas or realms of reality—the devas, asuras, humans, beasts, pretas, and inhabitants of hell—is in fact a metaphorical but precise description of this world and the inequalities that exist in it, with the devas sitting in luxury and judgment on the rest, the asuras fighting to keep the devas in their high position, the humans getting by as humans do, the beasts laboring as beasts do, the homeless preta suffering in fear at the edge of hell, and the inhabitants of hell enslaved to pure immiseration.My feeling is that until the number of whole lives is greater than the number of shattered lives, we remain stuck in some kind of prehistory, unworthy of humanity's great spirit. History as a story worth telling will only begin when the whole lives outnumber the wasted ones. That means we have many generations to go before history begins. All the inequalities must end; all the surplus wealth must be equitably distributed. Until then we are still only some kind of gibbering monkey, and humanity, as we usually like to think of it, does not yet exist. To put it in religious terms, we are still indeed in the bardo, waiting to be born.”“Still, it brought home to them yet again how insane their opponents were. Ignorant fanatical disciples of a cruel desert cult, promised eternity in a paradise where sexual orgasm with beautiful houris lasted ten thousand years, no surprise they were so often suicidally brave, happy to die, reckless in frenzied opiated ways that were hard to counter. Indeed they were known to be prodigious benzedrine eaters and opium smokers, pursuing the entire war in a jerky drugged dream state that could include bestial rage.”Versus \n“Every sura of the Quran reminds us by its opening words—Bismallah, in the name of God, the compassionate, the merciful. Compassion, mercy—how do we express that? These are ideas that the Chinese do not have. The Buddhists tried to introduce them there, and they were treated like beggars and thieves. But they are crucial ideas, and they are central to Islam. Ours is a vision of all people as one family, in the rule of compassion and mercy. This is what drove Muhammad, driven by Allah or by his own sense of justice, the Allah inside us. This is Islam to me! That's what I fought for in the war. These are the qualities we have to offer the world that the Chinese do not have. Love, to put it simply. Love.” “Against all that, certainly, but for what? What the Chinese were fighting for, Bai decided, was . . . clarity, or whatever else it was that was the opposite of religion. For humanity. For compassion. For Buddhism, Daoism and Confucianism, the triple strand that did so well in describing a relationship to the world: the religion with no God, with only this world, also several other potential realms of reality, mental realms, and the void itself, but no God, no shepherd ruling with the drooling strictures of a demented old patriarch, but rather innumerable immortal spirits in a vast panoply of realms and being, including humans and many other sentient beings besides, everything living, everything holy, sacred, part of the Godhead—for yes, there was a GOD if by that you meant only a transcendent universal self-aware entity that was reality itself, the cosmos, including everything, including human ideas and mathematical forms and relationships.”And I end up with this prescient quote:“They believed in a god of mercy, their Christ was all love and mercy.” “Hard to tell that by what they did in Syria.”More info on it you may find here: http://kimstanleyrobinson.info/node/345"}, {"userName": "Mosca", "userReviewDate": "Dec 29, 2008", "userURL": "http://www.goodreads.com/user/show/1837675-mosca", "userReview": ".....................................What if the White European Christians had almost all died out in in the fourteenth century?Kim Stanley Robinson has written an Alternative History that isn't steam punk, nor Nazis winning WW2.This is a smart, well constructed, work of historical inquiry that spans seven centuries without the assumed Caucasian and \"Christian\" historical domination. There are a small cast of well constructed thoroughly \"human\" characters who live through those seven centuries in a very different Eurasia, Africa, and eventually the two Americas than the ones with which we, today, are familiar.These seven centuries are seen in the context of a traditional Buddhist cosmology. This means that a handful of characters live, die, and are reborn through many lifetimes in different cultures, religions, genders, races, and even species. They are almost always unaware of their past lives or their souls' recurrent intentions. And, most times, the reader is also left unaware of these links. These individual karmic paths are not essential to the main intent of this book. They are, however, fascinatingly traceable for the attentive reader. And these paths very frequently and subtly reassemble groups, friendships, and love attachments through the centuries according to Buddhist karmic law. If you read to love characters, you will be well rewarded following the labyrinths of karmic paths that separate souls and reunite them in new cultures and contexts.These seven centuries of Earth's history rewritten are presented to us in a manner that loves us as humans (and \"souls\") while walking us through our seemingly eternal karmic traps of wars, domination, disappointments, betrayals, and redemptions.Of course, those historic scientific discoveries \"we all know\" are now reworked in new cultural contexts with different results. This is the beauty of Alternative Histories. But with this handful of sleepwalking \"souls\" reborn repeatedly in their own karmic cycles, this vast history of civilizations reconfigured takes on an unexpected intimacy.Enjoy this one."}, {"userName": "Bettie☯", "userReviewDate": "Jun 22, 2015", "userURL": "http://www.goodreads.com/user/show/1108123-bettie", "userReview": "[Book information comes from wiki and acts as aide-mémoir to the audio file:\nBook One, Awake to Emptiness, begins with Bold and Psin, scouts in Timur's army, discovering a Magyar village where all the inhabitants have died from a plague. Timur turns his army around and orders the scouting party executed to avoid the plague, but Bold escapes and wanders through the dead lands of Eastern Europe (encountering only one lone native). Upon reaching the sea he is captured by Turkish Muslim slave-traders and sold into Zheng He's Chinese treasure fleet. Bold befriends a young African slave, named Kyu, whom he cares for after the Chinese castrate him. In China, they are kept as kitchen slaves until escaping and eventually making their way north to Beijing where they find work at the palace of Zhu Gaozhi, heir to the Yongle Emperor. The vengeful Kyu hates the Chinese for what they have done to him and he incites violence between the eunuchs and the Confucian administrative officials.Book Two, The Haj in the Heart, begins in Mughal India where a Hindu girl named Kokila poisons her husband's father and brother after discovering their plot to defraud the village. She is executed for her crime, but is reborn as a tiger that befriends a man named Bistami, a Sufi mystic of Persian origin. Bistami goes on to become a judge for Mughal Emperor Akbar, but later falls into his disfavour, being exiled to Mecca. Bistami spends one year in Mecca before travelling overland to the Maghreb and Iberia (Al-Andalus). Bistami then joins a caravan led by Sultan Mawji and his wife, Katima, who seek to leave Al-Andalus and found a new city on the other side of the Pyrenees, beyond the control of the Caliph of Al-Andalus. They build the city of Baraka (on the abandoned former site of Bayonne, France) and create a model society in which Sultana Katima is highly influential. Katima seeks to change the Islamic religion to create equality between men and women, by rejecting the Hadiths and relying only on her interpretation of the Quran. She rules the community after her husband dies (something not allowed in normal Islamic practice), but the Caliph of Al-Andalus eventually hears of their \"heresy\" and sends an army against them. The community flees further to the north.In Book Three, Ocean Continents, the Wanli Emperor launches an invasion against Nippon (Japan) but the huge fleet is swept out to sea by the Kuroshio Current and they are set adrift on the unexplored Pacific Ocean. The fleet hopes to be brought back to China eventually by the great circular currents of the Pacific, but they accidentally discover the New World. The sailors make landfall on the West coast of North America and make contact with the indigenous population (the peaceful Miwok people), but quickly leave once Admiral Kheim discovers they have inadvertently infected the indigenous people with devastating diseases. They take a small girl with them (who they have taught Chinese and named \"Butterfly\") and sail south where they meet another civilization rich in gold. There they narrowly escape being ritually sacrificed by using their flintlock firearms, something the natives have never seen before. They eventually return to China and tell the Emperor that he could easily conquer this new land and gain its great wealth.Book Four, The Alchemist, takes place in Samarkand, in the 17th century. An alchemist named Khalid, attempts to fool the Khan into believing that he has discovered the Philosopher's stone (which supposedly can turn Lead into Gold), but his fraud is uncovered and his hand is chopped off as punishment. Khalid becomes depressed and disenchanted with Alchemy (the prevailing belief of the scholars of the time) and decides to destroy all his Alchemical books (which come to Samarkand via the trade routes from all over the known world). However, his friends Iwang (a Tibetan Buddhist mathematician) and Bahram (a Sufi blacksmith) instead convince him to test the veracity of the claims in the books and thus see if there is any true wisdom to be gained. They devote themselves to practical demonstrations and experiments that greatly improve knowledge of various aspects of physics, chemistry, mathematics, biology, and weaponry, and in the process create the scientific method. Their discoveries create interest (and alarm) amongst the religious madrasahs of the city, many of whom also go along with the new fashion of building and testing scientific apparatuses. But most of all, they catch the eye of the Khan's powerful advisor, who sees in their inventions the possibility of great military technology, to fight the rising Chinese threat to the East.Book Five, Warp and Weft, describes how a former Samurai, fleeing from Japan (which was conquered by China along with most of the rest of East Asia) to the New World, travels all the way across the continent to meet the Iroquois people. They name him \"From West\" and make him a chief of their confederacy. He helps organize their society into a larger defensive alliance of all the North American tribes (the Hodenosaunee League) and shows them how to make their own guns with which to resist the Chinese coming from the West and the Muslims coming from the East.Book Six, Widow Kang, follows the life of Chinese widow Kang Tongbi during the reign of the Qianlong Emperor. She takes in a poor Buddhist monk, Bao Ssu, and his son whom she finds scavenging, but the monk is wrongly implicated in a series of queue cuttings and is killed by Qing magistrates. Later, Kang meets a Hui Muslim scholar named Ibrahim ibn Hasam and together they discover it is possible to remember their past lives. They marry and move to Lanzhou in western China, where they undertake work to try to reconcile Islamic and Confucian beliefs. Kang creates and collects works of proto-feminist poetry and becomes a known writer. There is a Muslim rebellion in the region due to the Qing intolerance of new Islamic sects coming from the west, but the revolt is crushed with massive force.Book Seven Seven, The Age of Great Progress, is set during the 19th century and begins during a war between the Ottoman Empire and the Indian state of Travancore. The Indians have previously defeated the Mughals and the Safavids and have developed more modern forms of warfare, emphasising surprise and mobility, they have also invented Steam engines and Ironclad warships which they sail straight to the city of Konstantiniyye and capture it with the aid of military balloons. The Ottomans are defeated easily. A Muslim Armenian doctor named Ismail ibn Mani al-Dir, who had served the Ottoman Sultan, is captured and sent to Travancore where he learns of the amazing advancements that have been made on the sub-continent such as railways and factories. He happily joins the hospital of Travancore and begins work in anatomy and physiology. Ismail eventually meets their ruler, the Kerala of Travancore, who pursues scientific and philosophical advancement (a kind of Enlightened Despot). The Kerala's aim is to drive the Muslim invaders away and peacefully unify India into a kind of democratic confederation. Later, during the Xianfeng Emperor's reign, in the Chinese colony known as Gold Mountain, major flooding in the Central Valley of California forces the evacuation of Chinese colonial towns and Japanese settlers alike. The Japanese had originally fled to the new world to escape Chinese oppression in their homeland, but find themselves once again under the Chinese yoke. A displaced Japanese slave, Kiyoaki, and a pregnant Chinese refugee, Peng-ti, manage to flee to the great coastal city of Fangzhang. There Kiyoaki joins a secret Japanese freedom movement which is being aided by Travancore, with Ismail acting as a go-between agent.Book Eight, War of the Asuras, is set in the 20th century, during the \"Long War\". The world has become divided into three large alliances, the Chinese Empire and its colonies, the fractured Muslim world (Dar al-Islam), and the democratic Indian and Hodenosaunee Leagues. At the outbreak of war the Muslim states put aside their differences and unite to flight the larger threat of China (whom they fear will soon achieve global hegemony). The Indian and Hodenosaunee Leagues stay neutral at first, but eventually ally with China, as they see the Muslims as their greater enemy, however the Muslims invade northern India all the way down to Burma to stop the Indians and Chinese from linking up. The war drags on for decades causing major changes in the societies involved, with rapid industrialisation, mass conscription and mass casualties (both sides are forced to use women in the fighting to make up for manpower losses). Being the first industrial war, new devastating weapons and methods are employed, such as trench warfare, poison gas and aerial bombing. The story follows Chinese officers, Kuo, Bai and Iwa as they desperately fight in the trenches of the Gansu Corridor, where the ground has been blasted down to bedrock by sixty years of bombardments (the latest massive artillery pieces lob shells into space on ballistic trajectories). The new Chinese government, the \"Fourth Assemblage of Military Talent\" (the Qing Dynasty having been overthrown by a military coup during the war) orders a new offensive against the Muslim lines in Gansu. Kuo, Bai and Iwa are told to use poison gas and then frontally assault the enemy trenches. They do this successfully, but are then beaten back by the second line of Muslim defences, losing tens of thousands of soldiers and gaining nothing. However they are then told that their attack was merely a diversion for the real offensive which is being conducted by the Japanese (who have recently been freed by China in exchange for alliance in the war) through Siberia. The Muslims are in retreat but the Japanese get bogged down at the Ural Mountains. In the meantime, Kuo is killed by a shell which penetrates their bunker, Bai and Iwa are then ordered to move with their company south through Tibet to support their Indian allies. At a pass in the Himalayas they witness the Muslim artillery blasting the top of Mount Everest down so that the tallest mountain in the world will be in Muslim lands. After extreme difficulties they manage to breach the Muslim defences at the pass and the Chinese army pours through to meet up with the Indians, turning the course of the war in their favour. However Bai is plagued by visions of his dead friend Kuo, who tells him that none of this is happening and that he is already dead, killed by the shell earlier. Bai does not know whether he is indeed living real life or is already in the afterlife.Book Nine, Nsara, follows the life of a young Muslim woman named Budur and her aunt Idelba in Europe, in the aftermath of the Long War. Budur's family is highly traditional and as there are not enough men left after the war for marriage prospects, she is forced to live in seclusion with her female cousins in the family's compound in Turi, a city in one of the Alpine Emirates. Idelba is an educated woman and was involved in physics research in Firanja before her husband's death, she is just as unhappy in Turi as Budur and wishes to return to her former work. One night, Idelba escapes and Budur follows her. Together they leave the life of captivity in the Alps and move to the more liberal and cosmopolitan city of Nsara (Saint-Nazaire in France). There they stay at a zawiyya, a refuge for women, Idelba restarts her work in physics and Budur enrols in university where she studies history. The history class is presided over by Kirana, a radical feminist lecturer who questions everything about Muslim society. Budur becomes close to Kirana who opens her eyes to the injustices that women face and how they can seek emancipation and liberation (the two have a brief affair). Life at the university allows for open debate about all issues and Kirana focuses on the nature of history and contemporary events, such as the Muslim defeat in the Long War, which she blames on the failure of the Islamic countries to properly mobilize women for the war effort (something which the Chinese did almost totally). There is also a newfound interest in ancient history as the field of archaeology is taking off (theories about how and why the plague killed off the Europeans centuries before are a popular topic).Book Ten, The First Years, follows Bao Xinhua who moves to the west coast of Yingzou after witnessing the assassination of his friend, and revolutionary, Kung Jianguo. He marries and raises two children before accepting a diplomatic post in Bangladesh. In his later years, he moves back to Fangzhang to teach history and the philosophy of history.\n (hide spoiler)]"}, {"userName": "Zab", "userReviewDate": "Jul 27, 2007", "userURL": "http://www.goodreads.com/user/show/87312-zab", "userReview": "In retrospect, it's surprising that there aren't MORE fantasy novels about a group of people being reincarnated multiple times, with lives sprawling through a centuries-long alternate history. But, if there were, most all of them would not be as good as this.The reincarnation plot (complete with matter-of-fact scenes set in the \"bardo\" between lives) is an excellent way of tempering what would otherwise be a sometimes depressing plot. Basically, the novel starts shortly after the Black Plague kills everyone in Europe, so world history is dominated by the interactions between China, Japan, Muslim cultures based in north Africa and Europe, and an alliance of Native Americans.It's certainly long, and the arc of history sometimes dominates the arc of narrative, and towards the end we get some multiple-page lectures about theories of history. But, overall, an excellent job."}, {"userName": "Aerin", "userReviewDate": "Nov 05, 2015", "userURL": "http://www.goodreads.com/user/show/61519-aerin", "userReview": "Now there is nothing left to doBut scribble in the dusk and watch with the belovedPeach blossoms float downstream.Looking back at all the long yearsAll that happened this way and thatI think I liked most the rice and the salt. The Years of Rice and Salt is a thick, dense alternate history spanning continents and centuries. Its vast cast of characters includes, as the blurb puts it, \"soldiers and kings, explorers and philosophers, slaves and scholars\". Through their eyes we see the forces that shape their world, which develops in strange and yet intriguingly familiar ways through the centuries.That description to me sounds like a roadmap to Boredsville, and though I'd heard good things about this one, part of me was expecting a plodding, dry tome focused more on history's big machine and prominent personalities than on any relatable human drama. Normally I'd avoid that sort of thing like the plague -- which, incidentally, is where the book diverges from our reality:Here, instead of killing a third of Europe's population, the Black Death kills 99%. White people are more or less nonexistent, Christianity is a footnote, and China and the Muslim nations have become the dominant powers shaping world history.In ten sections, the book takes us from the Middle Ages to the 21st Century, and from China and India to the European wastelands and the New World. It is not only emphatically unboring, it's one of the most ambitious and stunning novels I've read in a long time.The book is structured around its Hindu/Buddhist conceit, following the same set of characters through several incarnations as they struggle to evolve and pursue nirvana. Though their races and genders (and occasionally species) morph through time, they fill similar roles in every avatar. The character whose name starts with K is disaffected, angry, an iconoclast - often tortured or martyred for hir idealism, whether as a mutinous slave, a radical feminist, or a hotheaded scientist. K's foil is B, hir friend or partner (but rarely lover) who is the more hopeful, pragmatic and effective of the pair - it is B who is usually the POV character. Then there is I, who is usually a scholar or a mystic, and romantic partner to either B or K. And S, who is a dick, always antagonizing the other characters (which they get pretty pissed about in the bardo between incarnations, when they remember who they have been in other lives: \"And you!\" [K] roared. \"What is your EXCUSE! Why are you always so bad? Consistency is no excuse, your CHARACTER is NO EXCUSE!\")In this way, the book avoids one of my main frustrations with sprawling epics like this - the lack of developed characters with an arc to get really invested in. Though the setting changes, here we're essentially following the same handful of people throughout history. And they do develop as themselves, but they also stand in for all of us. Whether you believe in reincarnation or not, the story of humanity is the story of generation after generation striving to avoid the mistakes of the past and achieve the closest thing to perfection it is within our power to attain. And none of us ever gets there, but every new generation picks up the baton and gives it a shot anyway.B: Come on, you can't deny it. We keep coming back. We keep going out again. Everybody does. That's dharma. We keep trying. We keep making progress... Here we are. Here to be sent back again, sent back together, our little jati. I don't know what I would do without all of you. I think the solitude would kill me.K: You're killed anyway.B: Yes, but it's less lonely this way. And we're making a difference. No, we are! Look at what has happened! You can't deny it!K: Things were done. It's not very much.B: Of course. You said it yourself, we have thousands of lifetimes of work to do. But it's working.K: Don't generalize. It could all slip away.B: Of course. But back we go, to try again. Each generation makes its fight. A few more turns of the wheel. Come on-- back with a will. Back into the fray!And so, through genocides and world wars, injustice and devastation, these characters reveal their world to us as they endeavor, in small ways, to improve it. They make scientific discoveries, write influential books, build egalitarian societies, thwart wrongs large and small. Each section is told in a different style, which brings to mind  Cloud Atlas (something several people pointed out to me when I described the book, though the two actually strike me as very different -- Cloud Atlas is about the repetition of themes across time, the connectedness of everything; Rice and Salt is about the impact of history on human lives and vice versa, and the will to evolve). Strangely, it also reminded me of Neal Stephenson's  Anathem, another unexpectedly engrossing, satisfying philosophical SF tome - alternate universe rather than alternate history, though really, there's not much difference between the two. I felt the same way reading both books -- that thrill of having discovered something precious and perfect.There's plenty in here to satisfy different interests: a vast and well-developed alternate history, an intriguing cast of characters, a crash-course in some tenets of Eastern spirituality, a meditation on the human condition, an array of metafictional highwire tricks, and ten ripping good stories.Highly recommended."}, {"userName": "Jack", "userReviewDate": "May 08, 2008", "userURL": "http://www.goodreads.com/user/show/1130606-jack", "userReview": "A classic of speculative fiction. This one has really stuck with me, and continues to inform my thinking on any number of topics, not least the clash of civilizations, the impermanence of human culture, the non-inevitability of European historical domination, how indigenous American societies might have survived and thrived, and more.The book starts somewhat slowly, but is worth sticking with. Terrific circular structure to the storytelling becomes more and more powerful as the various tales and the trip through alternate-history intertwine. Robinson's ability to fully imagine an alternate timeline in which a bipolar world evolves that is dominated by Islam and China is truly amazing."}, {"userName": "Ben Babcock", "userReviewDate": "Jan 06, 2009", "userURL": "http://www.goodreads.com/user/show/1188122-ben-babcock", "userReview": "I dug into The Years of Rice and Salt with much gusto, for its premise was an intriguing example of why alternate history can be so seductive. Yet almost immediately, my expectations were completely torn apart and shoved in my face. Sometimes this can be good; other times it ruins a book completely. In this case, while I quite enjoyed some of the philosophical aspects of the book, it failed to sustain my interest for its 760 pages.In this version of history, the Black Death decimates the white Christian population of Europe. The Holy Roman Empire vanishes. Columbus never makes his infamous \"discovery\" of the New World. The Renaissance never happens. Shakespeare is never born. Robinson takes the discoveries our history often attributes to dead, white, male Europeans and transfers them to Muslim and Buddhist Chinese and Middle Eastern men and women. Muslim alchemists invent calculus while trying to measure the speed of light; a Chinese fleet ordered to invade Japan gets blown off course and winds up, eventually, in North America.Given the fact that the back cover copy promises \"a look at history that could have been—one that stretches across centuries.... Through the eyes of soldiers and kings, explorers and philosophers, slaves and scholars,\" perhaps my expectations were too simple. Robinson uses reincarnation as a plot device to carry his characters across eras and around the world. Although the characters don't retain their memories of past lives (except for a few instances) while living a new one, this device forces the reader to interpret their actions as part of a great karmic cycle. This is particularly the case for the first part of the book, where the narration reinforces the idea that each life is a chance to \"embrace the Buddha-nature\" and move on to the next plane of existence. Later in the book, the emphasis shifts from the characters to the necessity for society as a whole to come to grips with its own existence and embrace peace before it's too late.And therein lies my problem with the book. Although the reincarnation device was not what I expected, I tolerated it. This isn't the first book I've read with reincarnated main characters; it probably won't be the last. However, the narrative style of The Years of Rice and Salt is demonstrably inconsistent in a way I can't reconcile with any dramatic purpose.In the first \"book,\" each chapter is numbered but untitled but has a short snippet that described what would take place: Chapter 1, \"Another journey west, Bold and Psin find an empty land; Temur is displeased, and the chapter has a stormy end.\" I liked those. Each chapter also ended with a fourth-wall-breaking remark, such as, \"What happened in there we don't want to tell you, but the story won't make sense unless we do, so on to the next chapter. These things happened.\" I hated these; they were annoying, and I was glad when they stopped after the first book. So did the chapter descriptions though. In Book 2, the chapters had numbers and titles but no descriptions. In Book 3, the chapters had neither numbers nor titles. In Book 4, the chapters had titles but no numbers! And so on, changing apparently on whim, with neither rhyme nor reason. This irked me even more than the book's story—it distracted me from the story, which is a cardinal sin. Robinson's editor should have stepped in, either to standardize this practise or make sure there's an evident reason for it.Suppose I'm just a complainer, though, who's way too obsessive over meaningless design decisions that don't actually pertain to the plot. Does The Years of Rice and Salt redeem itself in its story, in its heart-warming characters who struggle against centuries of adversity to advance the plight of humanity? Not really.Reading this book, I was reminded of Umberto Eco, whose novels don't even try to pretend they're anything other than didactic philosophical treatises wrapped in a fiction taco shell. And I know some people find that unforgivable; I, on the other hand, don't mind it—if the author can pull it off. Robinson, at least in this book, falls short of the mark. He flirts with the concept of parallel history, chronicling the development of science in an order suspiciously similar to our own history's, just via Muslim and Chinese scientists. Oh, and there are airships, naturally. This flirtation undercuts the differences explored in the development of moral philosophy, governance, equality, power equity, etc. Once and a while we're treated to an interesting chapter in which one of the reincarnated characters shares a theory on the role of women in government or whatnot, but then we get page after page on the development of the law of universal gravitation (or later, smugly veiled references to relativity versus quantum mechanics).I loved the sense of difference created on a macrocosmic level, watching China and Islam duke it out for control over the world. I liked how the indigenous peoples of North America actually prevent wholesale takeover of the continent by other of those two factions; indeed, their egalitarian style of government influences much of Europe and West Asia. For all of these broad strokes, however, Robinson neglects the minutiae of his characters' various lives. The detail he adds to the settings, many of which would be unfamiliar to Eurocentrically-educated readers like myself, doesn't quite compensate for this lack of characterization. Overall, The Years of Rice and Salt stretches itself too thin."}, {"userName": "Chadwick", "userReviewDate": "Jul 14, 2008", "userURL": "http://www.goodreads.com/user/show/157567-chadwick", "userReview": "An alternate history, in which the what-if is, what if European culture had been totally eradicated by the Black Plague. Using the conceit of a group of repeatedly reincarnated souls returning again and again as the thousand-odd year saga unfolds, Robinson hits yet again with a thoroughly brilliant work that asks all of the important questions that face us concerning life on earth, most crucially: how do we get it right? In The Years of Rice and Salt, the world ends up being divided between Islam and China for most of what we consider to be the years 622-2002 C.E. All of the great scientific advances, all of the discoveries of the renaissance are undertaken by these two civilizations. Much of the ensuing history parallels very closely what we consider to have actually happened. A notable difference that Robinson proposes lies in the failure of either China or any of the Muslim powers to completely colonize the New World (due, perhaps to the lack of Europeans as an enemy on the Eurasian continent, leading to constant strife between the two powers), allowing the Iroquois League to expand into a major world power, with the help of the members of the Japanese diaspora. Their matrilineal succession and league-based structure becomes an inspiration for various progressive and revolutionary groups in both China and the Dar-al-Islam. Like much of Robinson's work, this is emphatically a utopian novel, but with the author's characteristic intellectual rigor. One of the functions of the reincarnation device is to emphasize that utopia is something that is built incrementally, taking lifetimes of failure and imperceptible, minuscule progress before any possibility of change can be enacted. This is further driven home by the conversations between the principal characters during their brief spells in the bardo, as they await their next incarnations, momentarily reminded of all of their previous lives. I think that this work is notable for a number of reasons. What sticks with me upon this first reading is Robinson's focus upon gender equality as crucial for social progress. That is, of course, obvious to most educated readers alive today, but his imagining of the rise of feminism in the monolithic cultures of Islam and imperial China is quite sharp. One character goes so far, in attempting to explain Islam's loss in the novel's analogue of WWI, as to say that Islam's greatest weakness lies within its conversion of fully half of its society to illiterate beasts of burden.Robinson may be preaching to the choir, but this novel is a great example of the unique potency of speculative fiction to ask questions about how we fix the fucking mess we're in."}, {"userName": "Daniel Roy", "userReviewDate": "May 03, 2011", "userURL": "http://www.goodreads.com/user/show/5368477-daniel-roy", "userReview": "Let me start by saying that I'm not generally a fan of Kim Stanley Robinson's work. I loved Red Mars, then stumbled through Green Mars and gave up in disgust at Blue Mars. I found they were filled with exposition and endless descriptions of landscapes, and I really didn't like the fact that the main characters stuck it out through three novels instead of allowing more interesting characters to take their place.I felt drawn to The Years of Rice and Salt, even though the same annoyances seemed present. That being said, if like me you were burnt by Blue Mars but are intrigued by the premise of this book - do yourself a favor and pick it up. It's a work of staggering immensity, yet such a personal and touching novel that one wonders how historical scope and intimate drama could ever be weaved together so finely. The \"immortality\" of the main characters, while a mere plot device in the Mars trilogy, is at the core of the theme of Years of Rice and Salt : it speaks of the role of individuals in History, of how individual actions and lives weave the tapestry of History, and how the dramas of daily lives influence and are influenced by the unfolding twists and turns of Humanity. The individual lives it depicts are poignant, and play superbly against the backdrop of this alternate history where China and Islam are the two major powers of the world. More than a plot device, reincarnation is used here to paint deeply personal portraits of each period of history. Of particular interest is the role that Native Americans play in this alternate history : the way their culture grows and envelops other nations is, I felt, the true tragedy at the heart of Rice and Salt, speaking of squandered opportunities when the West conquered the New World.The novel builds like a puzzle through 11 stages of human history, and what finally emerges is a humanist, ecologist and even feminist tale of compassion, tolerance and hope, something that transcends its alternate history roots to speak of the Heart of Mankind. If it were just for its historical scope, The Years of Rice and Salt would have been an interesting anecdote in the alternate history genre. Instead, this novel is a major achievement that transcends science-fiction, and should stand at the very top of the alternate history genre for years to come, and as Robinson's crowning achievement."}, {"userName": "Jess", "userReviewDate": "Aug 12, 2014", "userURL": "http://www.goodreads.com/user/show/5037696-jess", "userReview": "Finishing this book was a chore. It was impressively researched, decently written, and incredibly insightful, but at the end of the day I found myself glancing at my watch and trying to remember why I was supposed to care. The marketing of the book is quite misleading. This isn't just a straightforward alternate history book--What if the Black Death killed off 99% of Europeans and the rest of the world's civilizations survived? Rather more importantly, it is a story about reincarnation. You start in the fourteenth century just as everybody's realizing that European civilization has become completely extinct, and over the course of the book you jump forward in time a couple decades or centuries at a time until roughly the present day, all the while following the stories of a handful of reincarnated souls. These souls are quite handily identified because, whether they are a fourteenth century nomadic Mongolian warrior or a seventeenth century wealthy Chinese widow with bound feet, their names always start with the same letter. Usually two souls in particular are the \"main characters\" in any given section, but they are surrounded by a little crew of other souls who are trying to achieve enlightenment together. Ostensibly, the crew of souls is getting better and better at life until they finally reach their ideal state.Except maybe not? Because despite this elaborate setup of reincarnation as a method of exploring alternate history, the whole purpose remained frustratingly unclear. The author introduced and dropped literary motifs and themes seemingly randomly throughout the book. And once I figured out that every section was going to end with the main soul-characters dying and being reincarnated, I found it very hard to give a damn about what happened.Some sections were more interesting than others. But given the number of sections, I was surprised at how limited the scope turned out to be. There were no sections located in Africa (though African characters showed up in other sections of the book), and way too many sections located in China. The characters came from all walks of life, so that the same soul could be reincarnated as a Sultana, a literal tiger, and a simple Chinese foot soldier, which was really quite gratifying. But it became difficult to recognize the souls over time. The author started out carrying over personality traits as the souls were reincarnated, and then just decided to drop that idea, I suppose.All that said, it would be rude not to mention just how ridiculously thorough the research on this bad boy was. It was all completely plausible--both the historical technology, events, and philosophy discussed, and how it would all have been subtly or dramatically changed without the influence of Europeans. The idea that the Native Americans would have actually had a chance of holding their own against invaders from the Old World was extremely provocative. It made me a little sad, actually, to see how they might have progressed as a unified world power in their own right if they hadn't been wiped out by European diseases and greed. Possibly the most interesting plot point of the alternate history was that without Christians (the religion was basically wiped out along with its practitioners), there would still be religious wars. But instead of being between the three main monotheistic religions of Islam, Judaism, and Christianity, the religious wars would be between the concept of one god (Islam), many gods (Hinduism), and no gods (Buddhism). The resulting wars, as imagined by Robinson, lasted for generations, and led to rapid technological innovations as people found new and exciting ways to murder each other.The concept of gender equality in this alternate history was also pretty fascinating. Still tied to religious ideology, the whole concept of women-as-people came into and out of fashion depending on a number of factors. You have fifteenth century woman heads of state and seventeenth century woman philosophers and twentieth century woman scientists... only for their also to be concubines, harems, and bans on the education of women. It was a depressing pattern of ups and downs.Look, I would've enjoyed this book a lot more if the stakes were made clear at the outset, and if the main driver of the plot was action, rather than discussion. It's not a bad book, simply exasperating in its execution. If you want a really, really thorough and imaginative alternate history, and you're deeply curious about what the world would look like without European imperialism, check this shit out."}, {"userName": "Jeff", "userReviewDate": "Aug 17, 2010", "userURL": "http://www.goodreads.com/user/show/4165061-jeff", "userReview": "I picked this up from the library after reading good things on the AVClub in a section about alternate histories. I found the premise of The Black Plague wiping out almost the entire population of Europe and how that would affect the socio-political development of the rest of the world to be very promising. Unfortunately, this premise is mere backdrop for an extremely boring story. (Someone really should re-visit this idea in the future because it holds so much potential).I appreciate that, had Christianity not developed as strongly, the predominant religion would probably be Hinduism, and I like how this book is written from the point of view of an author in such a world, but the central part of the narrative being so focused on the death/trial/reincarnation cycle quickly became tedious to the point of being annoying. Every time one or both of the main characters died, I found myself saying, \"Ugh...again!\" I quickly found myself not caring about the eventual outcome of the two main protagonists, or the rest of their group. Maybe if the author had spent a little more time fleshing out the characters with each \"life\" instead of shoe-horning so many \"lives\" into the book, I may have been more invested in the main characters. Slogging through the book became a chore. This is the first book that I just quit reading. I do not know how it ends, and I just do not care. For a book to be boring is one thing, but to be repetitively boring is asking a bit much."}, {"userName": "kaśyap", "userReviewDate": "Dec 17, 2013", "userURL": "http://www.goodreads.com/user/show/8660547-ka-yap", "userReview": "A sprawling historical narrative spanning centuries. The major theme dealt with in this book is the speculative philosophy of history.Does history as whole have a structure? A direction? Is there a teleological sense to history? Is history a progress? The author’s opinion here seems to be in the affirmative and so he leaves us with a lot of optimism at the end of the story.This book is set during the period of Christian domination. In this alternate history, a plague kills almost all the Christians. So the Muslims, Chinese, Indians and Native Americans become the major players in this part of history. This is set in Buddhist metaphysical and mythological setting. So our main characters for the whole 700 years are the same people who keep passing through the cycles of birth and death. This aspect of the story highlights the role of individuals in Human history.Technological progress here happens at the same pace as our world. The same inventions and discoveries happen. This changelessness in the history of ideas once again, I believe, signifies the author’s view of history as a progress. Epic in scale and ultimately leaves us with a message of optimism and hope. Shows the interconnectedness of the world and human endaevor."}, {"userName": "S.A. Parham", "userReviewDate": "Aug 13, 2007", "userURL": "http://www.goodreads.com/user/show/275867-s-a-parham", "userReview": "I'd seen this heavily recommended by others with similar reading tastes, so I had high expectations for it. The premise - what if the Black Plague killed 99% of Europe's population - was intriguing. For the first two or three sections, the reincarnation system of recycling the main characters even worked for me. But after a while, I started to feel like I was reading a textbook. \"This happened in this era. This happened in the next era.\" Half the time, I didn't see the characters long enough to form any interest in their fates or accomplishments. I don't normally read books concurrently, but this one was so underwhelming that while I wanted to finish it, I couldn't stick to it for days at a time. It certainly could have been about 200 pages shorter than it was. I'm hoping it is just this novel, but I fear it's Robinson's style and will be moving his Mars trilogy much further down my reading list than earlier planned."}, {"userName": "Fantasy Literature", "userReviewDate": "Jan 23, 2016", "userURL": "http://www.goodreads.com/user/show/8491232-fantasy-literature", "userReview": "In The Years of Rice and Salt, Kim Stanley Robinson uses the Black Plague to remove the Europeans, leaving the Old World to the Chinese, Islam, and the many cultural groups that end up in India. The Chinese discover the Americas, their diseases spread through the Native American populations, and their armies plunder the Incans. The novel begins with the Plague, but its vignettes move from one period of history to the next until it reaches the end of the 20th century.How do you write a novel about one set of characters that spans centuries? Robinson uses reincarnation to cast a set of souls in various times and places as he follows his alternate history. The characters can always be told by the first letter of their names. Bold, a soldier, eventually becomes... Read More: http://www.fantasyliterature.com/revi..."}, {"userName": "Peter Tillman", "userReviewDate": "Jan 27, 2016", "userURL": "http://www.goodreads.com/user/show/8101737-peter-tillman", "userReview": "The most impressive Robinson I've read since, since.... well, ever, I guess. This is AltHist played with the net up, and the writing and characterization are just about as good as it gets. The opening episode -- just after the point of deivergence, when the Black Death exterminated humanity in Europe -- is nightmarish, chilling. I recommend The Years of Rice and Salt to your attention, with the caveat that it has the usual KSR strengths and weaknesses, and so will alternately thrill and annoy you. At least some of the annoyances will make you think. This is a very good piece of work by an author who knows where he's headed, and just how to get there."}, {"userName": "M.G. Mason", "userReviewDate": "Aug 08, 2011", "userURL": "http://www.goodreads.com/user/show/5992644-m-g-mason", "userReview": "Kim Stanley Robinson is one of those rare breeds in SciFi today, he writes what is traditionally called “hard” science fiction but he differs from the likes of Alastair Reynolds, Greg Bear and Peter F. Hamilton in that there is a great deal of focus on the fundamental changes in society that new technological advances bring. In this way, he is very much like Ray Bradbury.This is a departure from Robinson’s hard scifi though as he branches out to explore the realms of alternative history; but the quality of the narrative does not suffer for the change in genre. This is book that explores and perhaps, gives us a clear indication of Robinson’s personal philosophies. I wasn’t surprised to discover later that Robinson is a Buddhist. Hinted at increasingly through his “Mars” series, this is the clearest indication yet.Europe has been ravaged by the Black Death far more than it was in reality, so when travellers from the east reach western Europe they see devastation from which the European powers would never recover and the few remaining survivors are reduced to barbarism.With Christianity and its influence on Europe (and eventually the New World) seemingly dead, we witness the rise of Islam, Buddhism and other eastern religions across the world unrestricted. We follow what at first I thought were the same families through history but are actually the same people reincarnated over and over again (hence his Buddhist beliefs). Far from feeling bludgeoned by his beliefs, Robinson is trying to write the novel as though the world he has created actually happened. Free from Christian traditions and mythologies, this is a world where the major faiths are Islam and Buddhism fighting literally or figuratively for dominance in the world.The nations that develop go through pretty much the same events from our history: the discovery of the Americas, the enlightenment, reformation in Islamic Spain, world wars, female emancipation, atomic technology, a cold war and the global economy.This is a heavy going novel considering the subject matter covering over 600 years of alternative history in ten books (chapters set in different time periods). Not for the feint of heart, but a rewarding and enlightening experience nonetheless. Robinson tried the alternate history experiment a second time in Vinland: The DreamSee more of my book reviews at my blog"}, {"userName": "Cpd", "userReviewDate": "Jul 08, 2007", "userURL": "http://www.goodreads.com/user/show/169061-cpd", "userReview": "We had people over for the Fourth for the fireworks and, of course, the house had to be cleaned and by that, I mean all the books sprawled about the floor in lazy, often surly piles, crowding every available planed surface had to be reined in and brought to order. Rice & Salt got rammed into a corner atop the largest bookshelf in the living room and I'm looking at it now -- it balefully staring back at me. I do not like this book. In fact, I've been trying to dump it for the last -- however long I've had it since after I read it, which, I think, is a good three years. Plot, character, story development, etc, I just didn't enjoy but, BUT there is so small part of me that refuses to add it to the Salvation Artm/Sell @ the Strand bag in the kitchen. Dunno why. The book is as if Steven Spielberg and Umberto Eco did movie together and this book is the adaptation of that film.The fucked up part? I've read it twice. A book I don't like, I've read it twice.What's it about? *Sheesh* Come to the house and get it out of here if you want to know that...~cpd"}, {"userName": "Nikki ", "userReviewDate": "Dec 11, 2010", "userURL": "http://www.goodreads.com/user/show/223837-nikki", "userReview": "Rather than a novel, this is more like a series of short stories/novellas. It follows the same characters through various incarnations. In some of them the connections are easy to make, in others it's not so easy. The alternate history aspect is interesting, and couldn't have been fully explored without this device, I suppose, but I found it jarring to be jerked from time period to time period, culture to culture, and I never really fell in love with the characters as continuations of the previous characters. There were characters I found interesting in each separate story, but I didn't necessarily like them in their other incarnations, I mean. If I had, maybe I'd have cared more.As it is, I ended up abandoning this book for a while, and almost skimming to finish it. I really liked \"The Alchemist\", and kind of wanted more of it than that -- that and the first story especially stick in my head.An interesting idea, but the execution didn't work for me. I might reread it someday."}, {"userName": "Koshin", "userReviewDate": "Jun 20, 2007", "userURL": "http://www.goodreads.com/user/show/142790-koshin", "userReview": "I really enjoyed this book. I wanted to read the book on its premise alone: What if Europe had been wiped out by the plague, how would world history have been shaped without a European influence?The book is a series of different short stories that catalogue the lives of people at different points in the alternate history, from the time after the plagues in Europe until the modern era. Each story is an alternate history different important points that coincide with history :- The Islamic renaissance, discovery of the Americas, the advent of steam power and the industrial revolution, world war, post world war era with advances in technology and globalization. Each story has a main cast of characters who are in essence the same group of characters reincarnated over different lives."}, {"userName": "Derek", "userReviewDate": "Jun 13, 2011", "userURL": "http://www.goodreads.com/user/show/5420722-derek", "userReview": "I was very disappointed. It's not that the book is badly written - it isn't - but I thought I was reading a \"what-if-European-civilization-had-never-developed\" novel, but really it seems completely irrelevant that the Europeans were wiped out in a plague. Instead, it's a series of vignettes about life in other parts of the world, that seem like they could have occurred with or without Europeans present."}, {"userName": "Luca Signorelli", "userReviewDate": "Mar 27, 2018", "userURL": "http://www.goodreads.com/user/show/48242978-luca-signorelli", "userReview": "KSM is by no mean the greatest writer alive, but this is by far his greatest work, and one of the best alternative history novels ever written, in particular the first and last \"novelettes\" (the books is divided in self contained sections chronologically ordered from 1362 to our days, with the same characters appearing again and again in different incarnation). The premise is intriguing - in 1348-1352 the Black Death doesn't \"just\" kills one third of the European population, but 99% of it. And ten years later, the Mongol hordes of Timur are entering Europe (instead of moving east, as it happened in real history). And a small band of Mongol scouts cross into the Moravian gate and a spooky landscape of dead cities.... From here KSM create a \"what if\" that moves human history from an European dominated modernity into a world where China, India and a galaxy of Islamic states are the main superpowers (and Europe is a backwater wilderness). I dont want to spoil anything of it, but KSM did his homework, and most of the scenarios he create is credible and not marred by too much PCs prejudices (just something here and there). Epic, sweeping, very well written, read it"}, {"userName": "Patryx", "userReviewDate": "Mar 26, 2018", "userURL": "http://www.goodreads.com/user/show/5121397-patryx", "userReview": "Viviamo in un universo dominato da poche leggi, ma il moltiplicarsi della violenza tramite la violenza è una delle principali\nUn libro che ripercorre l’intera storia mondiale dal 1300 al XXI secolo, solo che non è la storia che noi conosciamo perché l’epidemia di peste che colpì l’intera Europa tra il 1347 e il 1352 ha ucciso il 99% della popolazione e non solo un terzo. Trionfo della morte, Palazzo Sclafani, Galleria regionale di Palazzo Abatellis, Palermo (1446)Protagonista indiscussa del romanzo è la Storia: gli eventi fondamentali (scoperta dell’America, scoperte scientifiche, imperi coloniali, guerre mondiali) si svolgono ugualmente? Cosa sarebbe potuto cambiare?La risposta di Robinson è,  mutatis mutandis, che la natura dell'uomo avrebbe comunque portato gli eventi verso le medesime direzioni (abusi di potere, guerre, sperequazione sociale, intolleranza) ma (forse) non verso la medesima conclusione grazie all’influenza di elementi culturali divenuti centrali per la scomparsa del pensiero occidentale e della religione cristiana. Un planisfero in cui la rappresentazione dei territori non è europacentricaIo ho letto con interesse questo libro: mi incuriosiva capire cosa si sarebbe inventato l’autore per giustificare gli eventi storici cruciali (ad esempio le scoperte di Galileo) in un mondo in cui il centro culturale e politico si è spostato in Asia. Alcune soluzioni sono interessanti ma la riedizione fedele di tutta la storia umana in Oriente alla lunga può annoiare; inoltre l’autore spesso si lancia in spiegazioni filosofiche e storiche che prendono il sopravvento sulle vicende dei personaggi, i quali, nel corso dei vari secoli, cambiano lentamente e con grande difficoltà: ma questo, secondo me, è coerente con la tesi dell’autore e con la sua volontà di mettere in primo piano la Storia attraverso le storie di persone comuni che, generazione dopo generazione, hanno la responsabilità di imparare dal passato per non ripeterne gli errori. Forse Robinson non è molto originale (almeno in questo romanzo), ma sicuramente è un ottimista. \nQuesta è la storia, non gli imperatori, i generali e le loro guerre, ma gli atti sconosciuti di gente sconosciuta. Il bene che fanno per gli altri si tramanda come una benedizione, fa per lo straniero ciò che tua madre ha fatto per te, e non fare ciò di cui ti ha parlato male. Tutto si tramanda e ci rende quello che siamo."}, {"userName": "Tim", "userReviewDate": "May 17, 2013", "userURL": "http://www.goodreads.com/user/show/5903197-tim", "userReview": "This is the fourth KSR book I've read so far. The previous 3 were his \"Science In The Capitol\" series. In \"The Years Of Rice And Salt\" KSR travels back to the past, to a world where Europeans play no role. Thanks to the 14th Century Black Plague. No, this time it's about \"what if the world would have been dominated by the East, under influence of the Islamic and Buddhist religions, ...\".As you can imagine, beliefs, religion, spirituality all play a key role in this novel. It's such an epic work (763 pages), that maybe, yes, it would have been better to split it into several novels. But on the other hand, it's not about all those specific stories in each proper era and setting - the book is divided into 10 books, so to speak, 10 stories in which the same characters play a role and meet each other again through reincarnation, but they don't recognize themselves until very late - but rather about the message behind it, about creating a better world for all and yourself. About growing as a human being. About equality. And yes, there's thus also political influence in this novel.You can read about each of the ten books on KSR's website: click here.KSR must have done a tremendous amount of research to come up with this kind of story/ies and combine them so that they make sense, somehow, that you see an evolution in how the main characters respond to the happenings in each of their 10 lives. How they act as the person they incarnated as - be that a warrior, a slave, a doctor, a scientist, an emperor, and so on - and how afterwards (in the bardo / afterlife where our fellowship regroups each time) they understand (or don't and act foolishly) their behaviour and how to change it in the next life, until the circle is round. It's also nice to see how KSR sends each group back, but in a future life. However, to me the descriptions of the future weren't always clear. It was sometimes hard to visualize it.\"The Years Of Rice And Salt\" is certainly not an accessible work. It takes time and focus to grasp it all, not only because of the writing style, but also the cultural terminology. Luckily, KSR added blocks of info in Book 6. but why only there? Still, it takes definitely one (or more) re-read(s) (which I should do, but not now) to understand, to see the bigger picture, to see the complete puzzle.The book (also) contains a lot of food for thought, be that spiritual or political. In addition, when reading these stories, you can try to apply them to how the West conquered the East, the Native Americans, Africa, etc... was it that different? Money, power, religion, ... also play(ed) a big role.In any case, this is a eye-opening masterwork and kudos to KSR for having undertaken this gigantic quest."}, {"userName": "Jonathon", "userReviewDate": "Mar 06, 2014", "userURL": "http://www.goodreads.com/user/show/2337128-jonathon", "userReview": "I knew the basic premise going in; what if the black death had killed off 99% of the population of Europe instead of the historical 30%. What I didn't expect was the form it would take in a novel: a series of somewhat interconnected short stories following the reincarnation of various characters through hundreds of years of history. At first I didn't know what one had to do with the other until the novel began to bring up themes of reincarnation as do-over, a chance to try things again in different ways. And isn't that what alternative history as a genre is? In interviews, author Kim Stanley Robinson has said that this book came to him when he tried to find the biggest change that could have happened to history while still leaving history recognizable. Or, he was trying to create an uber-alternative history, thus the meditations on the form within the book.The world of the novel really got under my skin, its point of view sometimes more likely-seeming than actual history. China discovering the new world? Samarkand initiating the Renaissance? A South Indian ocean-spanning empire in the 1800's? These didn't happen? And that great world-building (as all great sci-fi and alt history novels should have) is probably what is going to stick with me the longest.The short stories themselves were a mixed bag. Some I loved; the Golden Hoard general, the Chinese Columbus, the Samarkand Renaissance, the modernist stylings of the 60-year World War chapter. Some, not so much; the post-war spy thriller, most of the chapter on the resettling of Europe. And although I liked how the novel ended, I wish there were some way to bring the bardo (afterlife) back in one more time to wrap things up."}, {"userName": "Art", "userReviewDate": "Feb 07, 2009", "userURL": "http://www.goodreads.com/user/show/1314511-art", "userReview": "In an alternative history, the Black Death destroys Europe and the world is divided between China and the nations of Islam, with India and the New World asserting themselves in lesser ways. It is seen through the eyes of the same group of people, reincarnated time after time, striving to make the world a better place. It's a neat premise, and it starts out fairly strong... but I honestly wish the author resisted the temptation to include page after page after page of various character musing about what history is, how Islam / Buddhism / atheism fits into all of this, how human beings can live in all that chaos and whether it's all worth it. And I further wish that the author, having set up (er... stolen) a very neat trick with the reincarnation, had resisted illustrating exactly what he's done and who was the inspiration.This happens a bit too much, I'm afraid: an author feels so smug about being so damn clever, they can't resist wallowing in it towards the end of the book. Not directly, of course. They get a character to spell it out. It usually ruins a perfectly good book.Over-research, over-stated, over-thought and over-impressed with itself, this book gets real old real fast. You will find yourself not being able to put it down, but once you're done, you'll be glad it's over. And if you're a writer yourself, you'd likely come away with a ton of better ideas. Just don't overdo it yourself."}], "description": "It is the fourteenth century and one of the most apocalyptic events in human history is set to occur - the coming of the Black Death. History teaches us that a third of Europe's population was destroyed. But what if? What if the plague killed 99 percent of the population instead? How would the world have changed? This is a look at the history that could have been: a history that stretches across centuries, a history that sees dynasties and nations rise and crumble, a history that spans horrible famine and magnificent innovation. These are the years of rice and salt.", "title": "The Years of Rice and Salt", "url": "https://www.goodreads.com/book/show/2723.The_Years_of_Rice_and_Salt", "average": 3.72, "cover": "https://images.gr-assets.com/books/1419079388l/2723.jpg", "reviews": 993, "authors": [{"url": "https://www.goodreads.com/author/show/1858.Kim_Stanley_Robinson", "name": "Kim Stanley Robinson"}], "type": ["Fiction", "Science Fiction", "Science Fiction", "Fantasy", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/2723.The_Years_of_Rice_and_Salt", "http://www.goodreads.com/book/show/41143.The_Years_of_Rice_and_Salt", "http://www.goodreads.com/book/show/6634725-the-years-of-rice-and-salt", "http://www.goodreads.com/book/show/77508.The_Years_of_Rice_and_Salt", "http://www.goodreads.com/book/show/9966682-gli-anni-del-riso-e-del-sale", "http://www.goodreads.com/book/show/77507.Red_Mars", "http://www.goodreads.com/book/show/77505.Green_Mars", "http://www.goodreads.com/book/show/77504.Blue_Mars", "http://www.goodreads.com/book/show/23197269-aurora", "http://www.goodreads.com/book/show/11830394-2312", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}