{"ratings": 3338, "userreviews": [{"userName": "Carol [Goodreads Addict]", "userReviewDate": "Feb 20, 2015", "userURL": "http://www.goodreads.com/user/show/10717098-carol-goodreads-addict", "userReview": "Thirty-Four and a Half Predicaments is book number seven in the Rose Gardner series by Denise Grover Swank. First, let’s get this out of the way. “Hello, my name is Carol and I am a Rose Gardner addict.” Whew! Ok, I feel better now. I have waited for this installment to the series for so long and it was everything I thought it would be and more. My fingernails are chewed down to the nub and I might need high blood pressure medicine now. Denise Grover Swank, I’ll send you the doctor bill. Rose Gardner is loyal to her friends and she will do anything for them. Now, Neely Kate needs her to help to get over her sadness. So what would cheer up Neely Kate best? A good mystery to solve. Rose wants to know more about her mother. She has the journal she kept but she has so many questions. With things slow at her landscaping business, it is the perfect time to get Neely Kate’s mind onto something else but her own sadness so they decide to work together to piece together the events leading up to her mother’s death. Joe and Mason seem to have come to some sort of working relationship but they aren’t telling Rose much of anything as to what they are working on. Joe’s sister, Kate, is still in town and Rose is no closer to understanding what she is trying to do other than to aggravate Rose. \n“If only I could stay out of trouble. Try though I might, trouble seemed to have a knack for following me.”\nRose and Neely Kate, as usual, get themselves into all kinds of crazy predicaments as they question people about Rose’s mother. The more they uncover, though, the more Rose realizes that perhaps some of these secrets were better left hidden. It’s beginning to look like her mother might have been involved in something unsavory. There are also questions regarding Rose’s father. Does she really want to find out the answers?\nI feel like I got to know Skeeter Malcolm better in this book. He needs Rose to take up her role as The Lady in Black again to help Skeeter get some information. I love how Skeeter doesn’t intimidate Rose, no matter how hard he tries. I know he is the Lord of the Underworld and all but I kind of like him. I like the way he is with Rose. Their relationship, I feel, takes another step in this book. Of everyone involved in her life, it seems like he is the one who is the most honest with her. And Jed, her body guard. I wonder if he has a crush on Rose? He would absolutely do anything for her. Rose is getting better and better control over her visions. She still can’t control it when she has random visions but she is getting better at forcing and directing them. I am concerned, though, with some side effects she is experiencing from them.\n As Rose and Neely Kate investigate her mother’s past, Rose begins finding threatening notes on her truck. And someone tries to run her off the road when she is in Mason’s car. Were they trying to hurt Rose or did they think it was Mason? Are their lives in danger? This was such a good book. Rose and Mason seem stronger than ever but there are so many secrets. And Rose just can’t seem to keep herself out of trouble. I realize this is an ongoing series but I completely DID NOT expect that cliff hanger ending. I might have shrieked out loud! I am still shocked! So now the countdown starts until November when Thirty-Five and a Half Conspiracies comes out. I don’t know how I will ever make it."}, {"userName": "Jamie Davis", "userReviewDate": "Feb 13, 2015", "userURL": "http://www.goodreads.com/user/show/11968352-jamie-davis", "userReview": "Holy Crap, THAT just happened!How on earth do you write a review for such a powerful book without adding spoilers? EEP! Denise Grover Swank brought the Rose Gardner Mysteries to another level of intensity! Thirty-Four and a Half Predicaments brings our favorite characters out in full force. Neely Kate and Rose dig themselves into another mystery as they attempt to decipher Dora's journal. Rose is determined to find out what happened to her biological mother, and as any Rose fan knows, digging into Fenton County's secrets leads to trouble. Skeeter and Rose are forced to redefine their relationship on more than one level when their investigation takes them into his territory. Rose alone is capable of corralling Skeeter's temper, even when she's the one that ignites it!J.R.'s evil plots make him a powerful presence, and the effects of his scheming are far- reaching. His character still invokes fear without ever needing to make an appearance, and he taints every person he touches in some form or another. I think Rose Gardner readers are all waiting breathlessly for him to \"get his\" in retribution for all the pain and misery he's caused for decades. He's certainly the epitome of evil, and you can continue to despise him in this book as well. Denise is truly a gifted author, and it's evident as always with this book. As one mystery comes to light, another grows from the shadows. The web of secrets continues to grow, yet we understand precisely what we need to in order to continue our Rose Addiction and still be clamoring for more. The humor, the emotional anguish, and the relationships that continue to grow allow you to connect to the characters on a deeper level. When you finish a book written by Denise, you can't help but feel like you're leaving behind friends. If you want the truest definition of a book hangover, then read Thirty-Four and a Half Predicaments. You'll be on the edge of your seat dying for more even as you flip the last page!"}, {"userName": "Jo Ann Reinhold", "userReviewDate": "Feb 26, 2015", "userURL": "http://www.goodreads.com/user/show/11617106-jo-ann-reinhold", "userReview": "Thirty-Four and a Half Predicaments: Rose Gardner Mystery #7\"Some Secrets are better in the past\" -Denise Grover SwankFirst let me say that I was lucky enough to receive an advanced readers copy of this wonderful book but that fact has no bearing on how I feel about it....I love this series and the wonderful author who puts her heart into these stories.If you are a follower of the Rose Gardner mysteries then this is truly a can't miss book! So many of the questions are answered in this book and some major events take place, events that will have you on the edge of your seat as you read. Some relationships and association are strengthened while others will be stretched to the breaking point.Rose decides to investigate her birth mothers death and finds a twisted knot of secrets, innuendos and speculation that might implicate her in a crime but also puts Roses life at risk as she continues to try and unravel the truth.From Twenty- Eight and a Half all the way through to Thirty-Four and a Half these books will keep you entranced with the story of Rose Gardner!"}, {"userName": "Angela Shockley", "userReviewDate": "Apr 04, 2015", "userURL": "http://www.goodreads.com/user/show/31138582-angela-shockley", "userReview": "Between a rock and a hard place… Rose is in a pickle now!!Thirty-Four and a Half Predicaments is not only a wild ride, it changes everything for the rest of the series, which I hope goes on for a LONG time!! I might have said this about the Ripple of Secrets novella at some point, but that simply laid the groundwork for what happened in this book and beyond! If you are a fan of the Rose Gardner Mysteries, you cannot miss this book. Too many important things happen. It’s not a one-off “mystery of the book” story, but explores Rose’s past with information that has ramifications on her future… especially where JR Simmons is concerned.Things are changing for pretty much everyone. In a nutshell, this is my takeaway on what goes down: Neely Kate has to deal with a devastating loss. Rose, Neely Kate and MILDRED (yes, President of the Busy Body club) form a surprising alliance in an effort to solve a mystery… and hilarity ensues! Hilary continues to be as uppity, nosy, and harassing as ever. Kate is as mysterious as she is persistent… I just don’t know whether or not to trust her. Skeeter demands his time with the Lady in Black and she gives him a piece of her mind. Rose uncovers dirt from her mother’s past that put her in danger. Then all hell pretty much breaks loose as Joe and Mason both have their own problems to deal with.Predicaments gives all of my favorite characters a bit of face time, while also upping the ante with the JR Simmons mess (and it is a mess, given that it stretches decades and crosses lines with pretty much everyone you can think of.) The ending comes with a few revelations that are both shocking, yet somehow expected given the situation in which Rose, Joe, and Mason have gotten themselves entangled. My one issue, and not enough to take even a fraction of a star away, is that I believe Joe and Mason should have let Rose know exactly what they were doing from the beginning of their “partnership” to take down JR so that her own actions wouldn’t interfere with their plans. I believe what happens at the end has far more to do with Rose’s meddling than it does anything Joe or Mason were doing behind the scenes.Predicaments is funny, exciting from start to finish, and just all around fantastic. May I give this book 11 stars? 20? 100?! This book explored more into the mythology that has been a low roar behind everything since the second book. AND I LOVE IT! Thank you, Denise, for giving your fans a chance to read this story in advance! *****FIVE HUNDRED THOUSAND STARS*****I received an ARC in exchange for an honest review, but let’s be honest…I was going to read and review this bad baby whether or not I got an advanced review copy! *fangirl* :)"}, {"userName": "Monique", "userReviewDate": "Feb 21, 2015", "userURL": "http://www.goodreads.com/user/show/23498832-monique", "userReview": "Firstly, let me just say, anytime I get to read a Rose Mystery, is a happy day for me. And this book made my day! If you have never picked up a Rose Gardner Mystery, then you can start with this book but you are definitely missing out on a brilliant series. This is number seven of the series and there are three novellas as well. If you have already started this series, then you are sure going to love Thirty-Four as it is jammed packed. Denise's writing is pure magic with this series and this book in particular. It falls under the Mystery / Women Sleuth category but you could add romantic comedy as well. In Thirty-Four, Rose is at a loss as to how she can help her best friend Neely Kate recover from depression. One attempt is to take her to the Hair Salon for some pampering, which does cheer her up, but not as much as running into Hilary there and Neely Kate ripping into her. Rose then decides that solving a twenty-five year old mystery is going to keep Neely Kate occupied. The two of them set off even with Joe's blessing, as how much trouble can they get into? Rose and Neely Kate, have a great banter and they join up with Miss Mildred, Rose's old neighbour. Neely Kate has so much fun at Miss Mildred's expense, you will be laughing out loud like I was. Others from previous books are back too. Skeeter is still the current Crime Boss and uses Rose's abilities again as the Lady in Black. Joe's sister Kate is still in town, popping up at odd times. And of course there is Mason, Rose's Assistant DA boyfriend. Their relationship is getting stronger ever day and they are even talking about marriage down the line. Mason is still looking into saving Rose from false allegations that Joe's father JR made up. These two will do anything to protect each other. Rose, with Neely Kate and the White Tiger aka Miss Mildred, get themselves into some funny predicaments and a little bit of danger before they uncover the mystery. I didn't not see the ending coming, as I am sure most won't and I will be waiting on tender hooks for the next book which is due in November, 2015."}, {"userName": "Ian", "userReviewDate": "Jul 22, 2015", "userURL": "http://www.goodreads.com/user/show/6703235-ian", "userReview": "Two decades earlier, Rose's mother died in a car crash. The police at the time decided it was an accident and the case was closed, but Rose has good reason to believe her mother was murdered. As she investigates she uncovers a web of lies and corruption that stretch all the way to the present day and the people who are closest to her. Book 7 of the Rose Gardner series is close to the best. I've enjoyed them all, they're entertaining fun reads but apart from book 1, Twenty-Eight and a Half Wishes I wouldn't say any of them are brilliant. Until now. This book is breathtakingly good right up to the conclusion which left me speechless."}, {"userName": "Amy", "userReviewDate": "Apr 22, 2015", "userURL": "http://www.goodreads.com/user/show/7018674-amy", "userReview": "Holy Crap!!! Talk about an amazing cliff hanger.I love Rose Gardner and have read the entire series. I have to say I'm amazed!!! A lot of books get less intriguing as there are more books written in a series. This is totally not the case. This series is getting better with each book. Denise took this series to a whole new level with this book. I cried, laughed and got so pissed I had smoke coming out of my ears. I can't remember the last book I had this many emotions all around once. I can't wait to see what happens next for Rose and Mason. Let's hope they make it through this together. This is a must read book."}, {"userName": "Janice L Fater", "userReviewDate": "May 24, 2015", "userURL": "http://www.goodreads.com/user/show/30603449-janice-l-fater", "userReview": "DisappointedI loved this series and didn't mind paying for them. But will there ever be happiness or an ending?"}, {"userName": "Theresa", "userReviewDate": "Jul 24, 2017", "userURL": "http://www.goodreads.com/user/show/61221433-theresa", "userReview": "5 Mind Twisting Stars... The events leading up to the predicaments Rose finds herself in throughout this book are revealed, stating a convoluted history of her mother's and her connection in a nefarious plot.... key players are introduced and their roles in Rose's life are uncovered leading to some answers and even more questions... acts of love and betrayal take center stage in this ever changing plot to lead to a shocking conclusion... heart pounding and heart breaking, this addition to the series was exhilarating from the start and leaves me in deep anticipation for the next novel:)"}, {"userName": "Liz", "userReviewDate": "May 12, 2015", "userURL": "http://www.goodreads.com/user/show/11293149-liz", "userReview": "This series just keeps getting better and better! I am loving the development and growth of all the characters. The 'in-between' novellas have been fantastic to add a little extra background and to keep our thirst for the next novel satiated for a while. My review is a brief of all the characters in the present as I don't want spoil it for any future readers....I will start with the emotional scenes with Neely-Kate and Rose: they are just beautiful and handled so delicately as these are real life situations that do occur in the real world to real people. The depth of emotion and tact and Rose's feelings of apprehension to discuss the loss or even what to say to Neely-Kate have been written so well. I also liked the little snippet of the happy Neely-Kate come through when she exclaimed \"Ding dong\" about Bruce Wayne.I really like Mason and his relationship with Rose but I really don't think they are going to last the pace; I smell something is brewing! I get nervous whenever anytime I read Mason's name, which is a lot, as the deeper he is digging on his mysterious case the more secrets are being exposed!Joe: there is nothing I can put here that won't spoil it for anyone who hasn't read the book yet. I still like him. I believe there is more depth to his character than DSG is writing in her books at the moment. Again, there will be another twist for us.Bruce Wayne: I am really enjoying the growth of his character. He is starting to believe in himself, even if it is a little at a time, since Rose awarded him a partnership. He is a genuinely nice guy and he deserves to get the nice girl. I look forward to reading more about the growth of his and Anna's relationship. He deserves someone lovely to be with.Rose: she cannot help herself with all her noseyness into other people's business but also into her own affairs. I am pleased some questions have been answered but not too many as I like the slow build up! Her character has developed brilliantly since \"Twenty eight and a half wishes\". I like how strong she is as a person and does not seem to be afraid to speak her mind. I like her relationships with Joe and Mason but I love her relationship with Skeeter Malcolm and I look forward to reading about more developments in the next book. The question of her paternity has been a bit muddled, even though there appeared to be answers in this book, I am wondering if there will be another twist for us? I do, however, think there are going to be a few more surprises the next book. Skeeter Malcolm: I love him! His character is great and who doesn't love a bad boy?!!! The relationship he has with Rose is confusing him as he cannot control her like he controls everything/one else in his life. Rose shows courage and daring with the way she talks back to him without any fear! I love how sweet and caring and taken by her he is, even though he always has an excuse why. He is as surprised as Rose is with her business acumen - especially for dodgy business!All that is left to say now is: WHAT AN ENDING!!! I can't wait for Thirty five and half conspiracies!This is a fantastic series that just keeps growing from strength to strength! Well done Denise Grover Swank!"}, {"userName": "TJ", "userReviewDate": "May 21, 2015", "userURL": "http://www.goodreads.com/user/show/2346207-tj", "userReview": "As much as I LOVE the Rose Gardner series, I hate, Hate, HATE complete and total cliffhangers... You know, the kind that tie absolutely no threads up, ratchets up the suspense then just... quits. Did I express how much I HATE that plot device? It reeks of manipulation and 90% of the time I will intentionally choose NOT to read anything more in the series just on principle. Because I have invested so much time and love in Rose and her cohorts though, I will wait, along with every other slighted fan, to see how the next book goes. It really is a credit to how wonderful the stories in this series are that in spite of the ending, I couldn't bring myself to rate it any lower than a four!"}, {"userName": "Karen Smith", "userReviewDate": "May 03, 2015", "userURL": "http://www.goodreads.com/user/show/31384596-karen-smith", "userReview": "omg, what a cliff hanger ending. please don't make us wait until November for the next book. this story developed the characters further, I loved the way rose and skeeters story turned and didn't see that side in previous books. I want rose to have her happy ending but I equally want many more books as there is so much that you can do with roses story. if I could change one thing I would stop using the phrase 'ornery grin' as its over used and becoming irritating. please let there be another between the books novella, your readers need it!"}, {"userName": "JoAnna Morris", "userReviewDate": "Mar 20, 2015", "userURL": "http://www.goodreads.com/user/show/6421102-joanna-morris", "userReview": "I received an advanced copy in exchange for an honest review. I know that when I pick up a Rose book I will not be disappointed and this installment is not exception! I don't know how she does it, but DGS manages to enthrall you with her story and it never gets old. Never once do I find myself thinking of the ending, to me Rose can carry on. I think this might have been my favorite in the series so far and I am anxiously awaiting the next!"}, {"userName": "Samantha Smith", "userReviewDate": "May 13, 2015", "userURL": "http://www.goodreads.com/user/show/43031463-samantha-smith", "userReview": "OMG! have just read this book in less than a day! couldn't put it down. a fantastic continuation of Rose's other adventures looping back to past books! My heart was torn and sad as I lived out Neely Kate's miscarriage with her!I can't believe the nail biting ending and that we have to wait until November for the next!"}, {"userName": "Angela", "userReviewDate": "Apr 09, 2015", "userURL": "http://www.goodreads.com/user/show/27140494-angela", "userReview": "Received an advanced copy for my honest review. Holy crap. Each Rose book gets better and better. And this one tops them all. I don't discuss spoilers in my reviews, so let's just say Oh My Stars and Garters covers how I feel. The whole book is like that. Once you start reading you will not be able to put it down."}, {"userName": "Pamela ", "userReviewDate": "Mar 11, 2015", "userURL": "http://www.goodreads.com/user/show/3925721-pamela", "userReview": "Simply put - I LOVED it!!!"}, {"userName": "Ellen Smith", "userReviewDate": "Jun 07, 2018", "userURL": "http://www.goodreads.com/user/show/38013430-ellen-smith", "userReview": "I love the Rose Gardner mysteries, and this was no exception! Stayed up late finishing this and went straight into reading the next book in the series!"}, {"userName": "Marci Crawford", "userReviewDate": "Jun 24, 2015", "userURL": "http://www.goodreads.com/user/show/33253361-marci-crawford", "userReview": "Now, I really wanted to give this book a lower rating, but I talked myself into a 3 because I'm holding out hope that Deinse Grover Swank is going to blast my socks off with the next book. It surprised me, that after the previous 6 novels ending so well that this one ended as it did. There were so many unanswered questions and then to just end it 'cliffhanger style' is so not cool and very unlike the others in this series. I generally love everything about this series, the characters, their troubles, and how they get intertwined together and figured out. I've been reading this series since it began, read all of the in betweens, and the wait until the next full novel to come out is always way too long. The wait for book 8 is going to be painful! This book, #7, took some things to a whole new level...in both a good and bad way. Let's quickly talk about Skeeter Malcolm...am I the only one that wouldn't be upset if Rose 'got together' with him? Sure he's a bad guy, but he's no JR! Rose would be good for SM and would make his heart 2x bigger! Mason would get over it, and I'm not really sure that I like Mason so much anymore, but I always have been a Joe fan even if that ship has sailed as the end of this book may have implied.The plot of this book was very complex, not difficult to follow, but a ton of different angles to it. How things connect: who's leaving her/him notes and why?, Roses birth mother to JR, who's her daddy?, did her mother do something bad?, who's out to get Mason? the list goes on... I couldn't stop reading I wanted to know all of the answers!Incorporate all of that along with Neely Kate's recovery, Joe's sister appearing, the new nursery worker, Jed, and other and you have a recipe for an extremely filling and satisfying novel.Loyal readers of this series love getting their endings fulfilled and anxiously awaiting the next in series to find out what new shenanigans Rose and friends are getting into. They consider this a quick witted, light hearted read even if the situations are not always so light, the happy endings make up for that. This book was also riddled with 'filler'. Since there is so long intween books I sometimes need a refresher, I don't mind a little filler from the previous book, but this one had filler going back to the beginning of time and very frequently placed. I felt that 7 books in this amount and frequency was unnecessary and found myself skipping pages to get to the book 7 stuff. If someone is starting this series on book 7, they should be left in the dark and confused, yet enticed enough to go back to book 1 and read through the series like everyone else. If this filler had been left out there would have been more pages to fill with answering the questions that are most likely going to be closed out in the next book and this book could have ended successfully and not made me want to scream and throw my iPad!I like this series, but hate cliffhangers. Again, I'm holding out hope that the author is going to redeem herself in the next book and is not finding herself being sucked into the leave 'em hanging style of writing to make more money, at $5+ a pop I can find something else to read that will be just as satisfying.Even after this, I have to say... if you haven't read this series yet, I would encourage it!"}, {"userName": "Melanie Hodges", "userReviewDate": "Feb 11, 2015", "userURL": "http://www.goodreads.com/user/show/40151110-melanie-hodges", "userReview": "Curiosity killed the cat! First of all, there should be an option to rate higher than 5 stars, but then where would you stop on this occasion? Thirty four and a half predicaments follows on from Ripple of Secrets so if you haven't already read that, STOP NOW and read that first or this won't make much sense, especially when it comes to Neeley Kate. Without giving the story away, this book gives all the characters we've grown to know and love their own important role to play. It involves Rose trying to find out more information regarding the truth about her birth mother. However, nothing is ever simple with Rose is it. The more she uncovers, the deeper the lies and more complex the situation becomes. It's a good job she has her best friend and partner in crime Neeley Kate to help her solve the mystery. There are other problems to consider, nonetheless the unravelling of the evil J.R Simmons who seems to have more fingers in pies than I ever thought possible! There are some fabulous twists in this 7th book in the series. As soon as you think one thing is happening, it turns out to be something completely different and surprising. I will say that I really enjoyed seeing a different side of Skeeter, but to say more would be telling so I'm afraid you'll just have to buy the book and read it yourself. If you've been reading this series this is an absolute MUST READ! One million stars *************************************I should also say that I was lucky enough to have received this as an ARC in exchange for an honest review. Thank you very much for this opportunity. On another note, I will keep my pre-order as it is so I can have the complete collection."}, {"userName": "Rhea", "userReviewDate": "Apr 05, 2015", "userURL": "http://www.goodreads.com/user/show/20236441-rhea", "userReview": "Every time I get a new Rose Gardner book, I pace myself to make it last longer because I love them so much. I tried to do that with this latest installment but found myself unable to put the book down and had to finish it. This 7th novel is the MOST suspenseful of all the previous books and I greatly appreciate how Denise Grover Swank is spinning this complex tale of conspiracy and secrets. In my imagination, she has a huge whiteboard at home with flow charts that make the subway system look simple. For all the people angry about the cliffhanger ending, I say chill out. It's not the end of the series; it's just building towards an explosive next book. Even if most of the other books were stand-alone novels, rather than feel cheated out of a finite ending, why not be excited that the mystery is getting even deeper and more complicated. Writing books is about more than happy endings and making everyone feel good. Sometimes authors need to do what is best for the story, to drive it forward and keep it going and growing. If you've read 7 books in the series, chances are pretty good you'll read number 8 and when it comes out, I suspect the plots will be so deep, we will be mind-blown. Denise Grover Swank continues to be one of my favorite authors and as long as she keeps writing Rose Gardner books, I'll keep buying and reading them. My fantasy is that years from now, I'll be reading about the love triangle of Rose, Joe and Mason as it continues in the Fenton County nursing home."}, {"userName": "Beth", "userReviewDate": "Apr 14, 2015", "userURL": "http://www.goodreads.com/user/show/21641867-beth", "userReview": "I received an advanced reader copy for an honest reviewWow, what an exciting read! This book was an amazing ride, so many great things that I want to share and I will try to do so without giving away any spoilers!Rose is a true gem, she is a superstar among book heroines in my humble opinion. She has really grown throughout the series and this book is no different, she's willing to stand up for what she believes in and will not be intimidated, even by the likes of Skeeter Malcolm or Hilary Wilder. As she digs into the life of her birth mother, many unsettling things are thrown at her and she continues on with courage ensuring the truth is uncovered.Since there were some pretty serious issues being dealt with by the characters in this book, I especially enjoyed the humor and laugh out loud moments that came from none other than Miss Mildred, I know it's hard to believe but you'll love those scenes as well!The men who love her are still front and center in her life, and as much as I want to say about this, it's pretty clear to me that Mason is a man that would do anything for Rose and go to the ends of the earth to do so.And last but not least, the ending....it's one that will make you say \"NO\" I need more, what's going to happen next, and I have to wait until when for the next book...all I can say is it's going to be a long torturous wait to find out what is going to happen next, where loyalties lie, and who will save the day :)"}, {"userName": "Cassie", "userReviewDate": "May 12, 2015", "userURL": "http://www.goodreads.com/user/show/9726784-cassie", "userReview": "WHAT A BOOK!! Like the rest of this series, I couldn't put it down. There were moments of laughter, tears, hope, and forgiveness that kept me reeled in. I was definitely not expecting that ending and I think my jaw is still on the floor. Please let there be a novella between now and November!!!!I am not giving up on Joe. I think he has a plan to get everyone out of it or that he will figure one out in the end. I refuse to believe he will let Rose down in the end. I'm still holding out hope for a Joe and Rose reunion, since I still believe it's their destiny; he just needs to do something that makes her realize how much she actually loves him.I still would like Hilary to be having JR's baby and not Joe's. I still think that JR sent her in there after giving him those photos of Jonah and Rose. I don't think there is a way I can be happy with Hilary getting Joe's baby in the end. I'm still waiting for something to happen to Mr. Too-Good-To-Be-True-Mason that shows that he isn't so good and innocent after all...I don't see if happening in reality, but wouldn't that be an unexpected twist. I cannot wait to get more info on the mysterious little sister Simmons....actually if Denise would like to write me a whole mini series about her and the rest of the Simmons, I wouldn't be mad at her. LOL"}, {"userName": "Kristin Jennings", "userReviewDate": "Apr 13, 2015", "userURL": "http://www.goodreads.com/user/show/2309183-kristin-jennings", "userReview": "Reading a Rose Gardner novel is like jumping on a rollercoaster you know and love, but between this ride and the last the tracks have been changed all around. Denise Grover Swank has created characters that the reader cannot help but connect emotionally with, and as the storyline progresses you are dragged (willingly) with them through sorrow, joy, confusion, love, betrayal, hope, and fear, with a large dollop of humor along the way. I love the way Rose has blossomed (sorry) and grown in all aspects of her life during this series. In this book she is making more reasoned choices, discovering who she is, what she needs and wants, and trusting herself more. Her relationships are complex, rich, and real, and that's what attracts us, the reader, as well as every semi-decent character in Henryetta, to her. Simply put Rose is an extraordinary person who keeps getting into extraordinarily dangerous situations, while dealing with love, friendship, family, and the prejudices of an entire town.Thirty-Four and a Half Predicaments is the best book in this series so far, and that is saying something as it is the seventh one, and I didn't want to put it down. This story is one exhilarating ride that will leave you gasping for breath when it's over, and believe me, you won't be able to wait to do it all over again!I received an advanced copy of this book in exchange for an honest review"}, {"userName": "little 'ole me", "userReviewDate": "Apr 12, 2015", "userURL": "http://www.goodreads.com/user/show/26420405-little-ole-me", "userReview": "I settled down read this latest installment of the series and got so carried away that when I finished I have had to go back and re-read the book as i couldn't get my emotions into check to write a comprehensive and understandable review.....2nd read has no happened and i can now write with a little more clarity and less emotions!The 7th installment doesn't let you down from the stylish front cover of the book to the classy writing from Denise, Rose and her gang are up to their own shenanigans in this book. we see some more depth to characters who have just joined the series and we are left wondering how they are going to be intertwined in the story and then we have characters who we know are wrongun's but we still love them and can reason in our own heads as to why what they do is ok! it also has some very sad scenes which cant help but bring tears to your eyes.the last chapter was a fast page turner and i was left bereft when it finished, i now have to wait until November for book number 8."}, {"userName": "Stef", "userReviewDate": "Dec 01, 2015", "userURL": "http://www.goodreads.com/user/show/5562268-stef", "userReview": "Crazy good story. A nice romance to go with the drama, suspense, comedy, action packed craziness. Must read series in order for the characters. This is a fun series to read, makes me laugh out loud & can't wait to read the next book. .Book 7More Craziness and what a cliff hanger . . . Rose gets taken to jail somewhere in the book. Some business transactions, more time with Rose & Skeeter, more savings of lives and paybacks. Love this series. . . More interesting turns of events with everyone involved. Makes you laugh out loud in a lot of areas. Love this series.======= If you are looking for other great suspense/action/Comedy/romance books check out my other reviews. Also Recommend this series and the following:> Rose Gardner Mystery Series by Denise Grover Swank> Body Movers Series by Stephanie Bond > Rock Chick Series by Kristen Ashley> Bobbie Faye's Series by Toni McGee Causey> Stephanie Plum Series by Janet Evanovich"}, {"userName": "Ellen Anderson", "userReviewDate": "Apr 08, 2015", "userURL": "http://www.goodreads.com/user/show/23972290-ellen-anderson", "userReview": "This book started off with all of us feeling the pain of Neely Kate losing her babies. Totally heartbreaking. Leave it to Rose to help get her out of the rut by trying to find out information about Rose's birth mother, Dora Middleton. I am happy to say that the Lady in Black makes another appearance in this book also. I don't know why I love the scenes between Rose and Skeeter, but I do. Right there is about all I will say about what actually happens in the book. There are so many shocking twists and turns that you don't see coming. I will tell you that the entire time I was reading it, I was so caught up in it all that I was tense and felt like I was holding my breath, waiting to see what the next sentence was going to bring. I don't think it's to soon to be saying, PLEASE Denise Grover Swank, how soon can we get the next book? I need it!I was given an early copy of this book in exchange for an honest review."}, {"userName": "Theresa Kay", "userReviewDate": "Apr 13, 2015", "userURL": "http://www.goodreads.com/user/show/26290182-theresa-kay", "userReview": "This series just keeps getting better. This installment has a great mystery and \"edge of your seat\" action, but it also has some laughs and some major feels. Rose's chracter growth is one of my favorite parts of this series and in Thirty-Four she just amazes me even more. She is able to remain steadfast and loyal without being a doormat. Some of my favorite parts of this book were when Rose was facing off with people, especially Skeeter. I adore the dynamic between the two of them. Mason is just as sweet and wonderful as ever and I loved seeing how his and Rose's relationship continues to deepen. The new questions that are introduced and the \"OMG I can't believe that happened\" ending have me super anxious for November to come so I can read the next one.** I received and ARC from the author in exchange for an honest review"}, {"userName": "Sandra Lancaster", "userReviewDate": "Apr 12, 2015", "userURL": "http://www.goodreads.com/user/show/25041773-sandra-lancaster", "userReview": "I received an ARC (advanced readers copy) of this book for my honest review.Denise does it again! I absolutely LOVE her books and this one is no different. Being a huge fan of the Rose Gardner Mystery series I was honored to receive an ARC. This book will keep you wondering and guessing about things,while also answering questions that have been haunting us for quite some time. You will go through all the emotions in this book. Denise has an excellent way of drawing you in and engaging you in the story. I read this book straight through,so be prepared you will not want to put the book down. And the ending will have you wishing November comes fast. Looking forward to the next book and hope this series goes on and on."}, {"userName": "Abby", "userReviewDate": "Apr 09, 2015", "userURL": "http://www.goodreads.com/user/show/2278704-abby", "userReview": "I've been anxiously waiting for the release of this book so was thrilled to receive an ARC in exchange for an honest review. I absolutely love this series and this book is just amazing. These characters have managed to get into my heart and some (like Hillary) under my skin and I loved every minute of it. I feel like this book was a bit more intense than the others, but still had plenty of lighthearted moments only Rose can bring to situations. Some of my favorite passages were those with Rose and Skeeter - so well done by the author! The ending left me stunned (no spoilers here!) and I can't wait for the next book in the series. Superb job DGS!"}, {"userName": "Nicole", "userReviewDate": "May 16, 2015", "userURL": "http://www.goodreads.com/user/show/979812-nicole", "userReview": "Hmmmm. I'm not sure how this is going to shake out, but I'm pretty intrigued. There's also so much going on with Joe. I know that Rose is with Mason, and he's pretty cool, but I don't know...the Joe thing isn't entirely resolved. The end of the book worked better for me than the beginning, and I'm sure there must be something more going on than is apparent, but I cannot for the life of me see any hints as to where the next story will be going (which I love). I'm only sorry that I've caught up to the end of the series so far, and will now have to wait for subsequent books to be published before moving on to the next episode. Can't wait!"}], "description": "Rose Gardner hates seeing her normally flamboyant best friend Neely Kate struggle with depression. So when Rose stumbles onto a piece of evidence indicating her birth mother might have been involved in a crime, she does the one thing guaranteed to cheer Neely Kate. She convinces her friend to help her solve a mystery. Though their penchant for investigating has gotten them into plenty of pickles in the past, what can go wrong if they’re looking into a case that went cold a quarter of a century ago? But the deeper they dig, the more dirt they unearth. While she’s busy unraveling the past, Rose must also reprise her role as the Lady in Black as part of her ongoing agreement with the king of the Fenton County underworld. In so doing, she discovers a mysterious enemy is intent on attacking her friends, and her assistant DA boyfriend might be next on the list. As both situations reach a boiling point, Rose must face the possibility that certain secrets were meant to remain buried and not even her special talent can get her out of every predicament.", "title": "Thirty-Four and a Half Predicaments\n      \n          (Rose Gardner Mystery #7)", "url": "http://www.goodreads.com/book/show/24778061-thirty-four-and-a-half-predicaments?rto=x_gr_w_carousel_bp", "average": 4.5, "cover": "https://images.gr-assets.com/books/1432380257l/24778061.jpg", "reviews": 275, "authors": [{"url": "https://www.goodreads.com/author/show/4921525.Denise_Grover_Swank", "name": "Denise Grover Swank"}], "type": ["Mystery", "Romance", "Suspense"], "outlinks": ["http://www.goodreads.com/book/show/24778061-thirty-four-and-a-half-predicaments", "http://www.goodreads.com/book/show/23700728-thirty-four-and-a-half-predicaments", "http://www.goodreads.com/book/show/25451975-thirty-four-and-a-half-predicaments", "http://www.goodreads.com/book/show/22847270-twenty-eight-and-a-half-wishes", "http://www.goodreads.com/book/show/23290347-the-substitute", "http://www.goodreads.com/book/show/25860522-after-math", "http://www.goodreads.com/book/show/15836745-twenty-nine-and-a-half-reasons", "http://www.goodreads.com/book/show/20687181-thirty-two-and-a-half-complications"]}