{"ratings": 80330, "userreviews": [{"userName": "Adam", "userReviewDate": "Apr 10, 2007", "userURL": "http://www.goodreads.com/user/show/54068-adam", "userReview": "Besides the bad writing and the clichéd, predictable storytelling, the message of this book is really ugly. Tall, handsome angels are associated with Protestantism, and foul demons are associated with, well, everything else (e.g., New Age spirituality, Eastern religions, and any philosophy that does not place Christ at its center). Personally I think New Age philosophies, astrology, and crystal power are all pretty silly, but deliberately associating them with Satan is not only ridiculously simplistic, it's really hateful. Furthermore, the idea that taking a college-level class on Eastern religions might imperil one's immortal soul deliberately attacks the very notion of ecumenicism, not to mention the values of love and understanding. It's really depressing that this book is so popular with evangelical Christians, and that so many of them mindlessly accept Peretti's ideas about secular society and non-Christian religions. Also, the very notion of a \"Christian horror novel\" is almost as idiotic as \"Christian porn.\" Christians should be able to read a novel by Stephen King, recognize that it is a made-up story, and then go back to getting their information about good and evil directly from the Bible, instead of fearfully rejecting anything not labelled \"Christian,\" yet revel in all the B-grade, watered-down versions of mainstream media that are labelled Christian. Speaking of which, I'm not even sure if This Present Darkness can technically be called \"Christian,\" since in it, Peretti has created his own bizarre cosmology nearly from whole cloth--one that ignores the very real notion of personal responsibility, since good and evil in this novel are solely the province of unseen angels and demons--which is why I honestly can't recommend this novel to anyone, Christian or non-Christian."}, {"userName": "Annette", "userReviewDate": "Dec 08, 2008", "userURL": "http://www.goodreads.com/user/show/1426170-annette", "userReview": "I remember \"This Present Darkness\" with fondness from my early - mid teen years. While some may disdainfully complain that Peretti is nothing but a fantasy writer for Christians and that his works cause the easily influenced to see demons behind every tree, in my opinion he does the church a service by reminding us of the supernatural forces which actually *are* at work in our world and which many of us have done out best to forget in this \"modern\" era. Do they function exactly as Peretti describes? No, I am certain they don't. This is clearly fiction, and the author would not claim otherwise. And I don't envy the line he has to walk between theology and story telling, fearmongering and faith. Certainly there are going to be some slip-ups, and equally certainly no single group of Christians is going to agree exactly where they are. :) But there are undeniably some good principles behind the action, and a darned good story to boot. I still recommend \"This Present Darkness\" and its sequel \"Piercing the Darkness\" to anyone looking for a good read and perhaps an eye-opening glimpse into the spiritual forces beyond our ordinary perception."}, {"userName": "Brian Hodges", "userReviewDate": "May 08, 2008", "userURL": "http://www.goodreads.com/user/show/1148633-brian-hodges", "userReview": "Christian fiction at its very best.Peretti doesn't make the mistake that a lot of other Christian authors make. He doesn't ever stop telling his story to preach some valuable theological lesson. Rather he weaves it seamlessly into the narrative. The overarching theme of this book is \"the power of prayer\". But the story is straight out of a Stephen King novel. A small town is under attack from dark forces, both in this world and in the spiritual realm. The story is told from the points of view of humans and their angel protectors. Truly fascinating. Even if you think Christianity is a farce, this book still stands on its own.I will also say that the sequel \"Piercing the Darkness\" wasn't nearly as good."}, {"userName": "Bibi", "userReviewDate": "Nov 12, 2016", "userURL": "http://www.goodreads.com/user/show/33411728-bibi", "userReview": "I read this some 15 years ago and still it resonates. A great depiction of good v. evil. Angels v. Demons. Highly recommend!"}, {"userName": "Lyn", "userReviewDate": "Mar 14, 2012", "userURL": "http://www.goodreads.com/user/show/5253785-lyn", "userReview": "Written as a \"Christian science fiction\" or a Christian fantasy, this involved a behind the scenes war between angels and demons, taking place invisibly while Earthly struggles are taking place contiguously. Obviously there is going to be a certain audience for this kind of fiction, but it was well written and entertaining."}, {"userName": "Eddy Wood", "userReviewDate": "Sep 01, 2008", "userURL": "http://www.goodreads.com/user/show/1101140-eddy-wood", "userReview": "This book was written in 1986, but I read it for the first time just recently. There are some things about the book that seem a bit dated now, but at the time I'm sure Frank Peretti was breaking new ground in a lot of ways.This book was written at a time when the big enemy to the church seemed to be the occult, and it exercising influence in American daily life, and surreptitiously leading Christians astray; hence the main themes of the book.What this book did that was unique in its time was give a full-on view of the spiritual warfare that happens all around us as we fight the “good fight”.I found the human characters engaging with a lot of depth. They seemed, for the most part, totally unaware of the battles raging all around them.It was very easy to root for the angelic characters, and I enjoyed seeing how Mr. Peretti described their militaristic tactics to win battles.The demonic characters were a despicable bunch, with no redeeming qualities whatsoever; as one would expect. But, they also had tactics of their own, and somehow expected victory against God’s host.This book reminded me of how temporal and fleeting this life of the flesh really is.We must empower the ministering spirits that have been put in charge over us by praying and speaking words of authority in Christ.I would encourage anyone, Christian or not, to read this book.If you are looking for excellent Christian Fiction for young people, please try Vicki Silver Mysteries: “The Stolen Gem” and “Cruise Control” by Alissa Wood."}, {"userName": "Sharae", "userReviewDate": "Apr 26, 2012", "userURL": "http://www.goodreads.com/user/show/9090105-sharae", "userReview": "Hands down, the most eye opening book I've ever read that actually changed my views and outlook at everyday happenstance in the world. I couldn't wait for the sequel but darn it. It just did not stack up to the first. Sure it's fiction but man..this particular fiction has become my fact by deliberate choice because for me there is no down side in doing so. The book is a sparkler. I passed it on to my husband, who couldn't put it down, then my son who also loved it and finally I convinced my non-reader daughter to buckle down and read it. She was not disappointed. If you're a christian, Frank Peretti pulls away the curtains and give a view of what \"might\" be going on in the day-to-day goings on of angels in the upper and lower realms. So enjoyable, so entertaining, so satisfying in the end. O man. can anyone come up with something to compare. I had high hopes for the \"Left Behind\" series that crashed and burn when I couldn't get past the first chapter of the first book. SO there it sits, on my shelf for treasured books only. To be re-read every few years until I die."}, {"userName": "Jonathan Terrington", "userReviewDate": "Oct 07, 2011", "userURL": "http://www.goodreads.com/user/show/6313408-jonathan-terrington", "userReview": "I must honestly admit first and foremost that this is a book I read many years ago and as such I cannot offer properly any views about the quality of writing. That is except to admit while not the worst nor the greatest quality of writing Peretti is in my eyes a powerful story teller (although I must admit in my view his Monster is in some aspects more powerful) and for what he (I believe aimed to do his work is fine).This Present Darkness is in many ways a thriller but I do not believe that the thriller elements are the main focus of this novel. Instead I believe it is the Christian message that Peretti aims to transmit through his work. After all this is a Christian novel tackling the spiritual world.This Present Darkness focuses on showing how demonic influence affects the physical world through branching its story into two narratives. The first addresses the issue of what is happening in the physical world. The second reveals the background influence of angels and demons as they guide human beings in order to continue spiritual warfare.It is the spiritual aspect of this book that I love on the whole however. Because the Bible from my point of view is quite clear on the fact that angels and demons do influence our world in many ways. The power of prayer is revealed in various ways in this book and the power of Jesus name is also revealed. I disagree with some ideas that this book makes Jesus name into just a magic word because I personally think that too few Christians understand the power in that name and that this book attempts to reveal the power. I also disagree with the complaints I've read about how Peretti aligns New Age mysticism and the demonic realm as it seems pretty clear to me how such things match up. Peretti I believe attempts to show what is stated in Matthew 12:30 which is that “He who is not with me is against me, and he who does not gather with me scatters.\" (NIV) An idea which applies to spiritual things such as the New Age Mysticism. What Peretti attempts to show I believe is that such things open avenues into which evil demonic forces can work and as such it's best not to have anything to do with them.On the whole I believe Frank Peretti does an excellent job of making more real those aspects of the Bible particularly mentioned in Daniel and Revelations. Of course I do disagree with some of his ideas but on the whole I don't believe his book was meant to be fully accurate but rather present a depiction and insight into the ways in which the unknown spiritual real affects the mundane. Take the book as you like that is my opinion and mine alone you don't have to agree or disagree."}, {"userName": "Vicki", "userReviewDate": "May 27, 2011", "userURL": "http://www.goodreads.com/user/show/4628162-vicki", "userReview": "I read this book decades ago and it had a really significant impact on me at the time. Though I was definitely a person of faith, the idea of spiritual warfare going on all about us in this modern day was very foreign to my understanding of how God works in world events today. Frank Peretti's fictional story of the community of Ashton was an enjoyable read back then, but it really challenged my thinking.I have just re-read it because, surprise, it is our current book club selection. I was foggy enough on the details that it was almost like reading a new book, but the story line came back to me quickly and I didn't have to struggle with whether or not I believed it was likely that angels and demons might be interested or involved in how human issues might be resolved.The premise of the novel is that a college community has become a place of interest to the Universal Consciousness Society, a New Age/Eastern Mysticism group which actually has built a significant membership among the respectable members of the community. The members keep their relationship a secret from the community, as well as the unsavory and questionable business practices they employ to take control of both the college and the community.The story begins as two spiritual warriors appear in the community to observe and assist the humans who will eventually rise up to thwart the powerful group before it is too late. Peretti moves from the perspective of the angelic warriors to the powerful and ruthless community members to the young minister who feels called by God to intercede for this community through prayer and to the newspaper editor and the news reporter who begin to uncover the seedy goings on around them.It doesn't take long to realize that the Universal Consciousness Society is a front group for demons who are intent of spreading their earthly kingdom from a power base in this quiet little community. And, though angelic warriors are involved, there is no foregone conclusion that Good will overpower Evil. In fact Evil is so powerful that even the angels know they can't win until a power shift occurs and that will only happen if people who are believers start to pray earnestly for intervention.This is an exciting saga that moves quickly and dramatically through several skirmishes between good and evil, climaxing in a great spiritual battle scene before the final outcome for this little community is known. Lots of scripture, lots of great examples of prayer warriors in action as well as spiritual awakenings on the part of several of the key characters. It's a good story. I liked it even more the second time around."}, {"userName": "Hope", "userReviewDate": "May 10, 2010", "userURL": "http://www.goodreads.com/user/show/1768876-hope", "userReview": "How do I review a book like this? I asked myself this question many times as I got further and further in, close and closer to the end.How can I write a review worthy of this novel?Now we must pause, and we must reflect…\tWhat made it so good?\tHow can you even explain what made it so good?There are no normal, straightforward words that can convey what this book really is. So I’ll go into descriptive/comparative mode now…This book is dark, it’s frightening, maybe even slightly gritty. Kind of gave me that creepy feeling that The Screwtape Letters successfully conveyed, but it wasn’t stifling because it wasn’t told exclusively from a demon’s perspective. This novel is sort of, I guess, like walking down a long black tunnel all by yourself, alone and afraid, and then suddenly hearing a friend’s voice. Or, more appropriately, it’s like when you’re driving home in a storm, the sky so dark that it feels like nighttime, and suddenly the sunlight starts seeping through the clouds, and the rain stops. You feel safer, and you don’t really know why. I once read a quote in another book that said, “You live through the night, knowing dawn is coming.” And I guess that’s sort of how this book felt. And see? I’m banging my head against a wall because I just didn’t get that right at all. It’s impossible to review this book well. It just is. I think the overall message of this book is that we need to pray more. I know I don’t pray enough. I’m a Christian, and this is a very Christian book…and as I read it, I felt like this is real. We can’t see it, certainly, but we can feel it. And that’s the point of this book. We’re not dealing with flesh and blood, we’re dealing with the world rulers of this present darkness… The spiritual goes along with the physical. You can’t really separate the two, they’re inexplicably connected in ways that we’ll never fully know. This book gives you a glimpse of that, and it’s unbelievably creepy.Aside from the beautiful Christian themes (yes, beautiful), this story is gripping. Remember it’s a mystery/thriller and do yourself the favor of not peeking ahead! As you read, a certain amount of “WHAT THE HECK?!” dread will be building up inside of you. It’s ominous because you’re absolutely certain that there’s going to be a train wreck but you’re not exactly sure how it’s going to come about, or if it will even happen at all in the end. I’m not going to tell you.I always feel, after I write a review, that I didn’t write it very well. Or that I did a terrible job of conveying the meaning of the story. But honestly, this is probably the best I can do. When I read the last sentence and closed the book, I smiled to myself. For once, I had nothing to say right after finishing a story…I was speechless.This novel is about angels and demons, good and evil. It’s about miracles. It’s about spiritual and physical struggles. It’s about redemption.…It’s about finding the light when you’d been lost in the darkness. And I can’t recommend it more."}, {"userName": "Sarah Booth", "userReviewDate": "May 04, 2012", "userURL": "http://www.goodreads.com/user/show/3524795-sarah-booth", "userReview": "I didn't realize that this book was based on Fundamentalist Christianity when I downloaded it from Audible.com. The story started out just like any science fiction fantasy book and then introduced a Christian component which I was perfectly fine with though I originally thought it was merely a basic good vs. evil type story. Being a C.S. Lewis fan (also of his Christian essays and books) I didn't have any problem with the book until it started to demonized and vilify \"Eastern Mysticism\". Now many religions and philosophies fall under that umbrella and while it was never specifically stated it insinuated that, among other religions that strive to do good, Buddhism is anti-Christian and even Satanic in nature which just isn't true. Part of the reason I believe that it was Buddhism that was being rebuked is: the importance of meditation, the reference to dragons (described as dragons but written as demons) (which mean a different thing in Buddhism than it does in Christianity) and several other practices I saw misinterpreted and maligned. The book portrayed these aspects in a very ugly light and was often out and out incorrect in what the Buddhist practice is about. Granted, Buddhism is non-theist religion, but it isn't anti-theist. There is a big difference. Western Buddhism often has no problem having od or Christ incorporated into its practices. The 2,500 year old view is to be compassionate to every living thing. There's also the Three Pure Precepts: to not create evil, to practice good, and to actualize good for others. Not very demonic in my book. Saving the environment and animals that God created hardly seems to me a heretical or blasphemous act.The message about God and Christ would have been quite enlightening and influential if it weren't for the Eastern beliefs bashing which really turned me off from the book. If it weren't for that I would have given the book 4 stars **** As it was well written for fantasy writing, and had a decent adventurous story line. It would have been very easy for them to be a quiet satanic cult under the guise of Christianity which they did cover, but it satanism that uses, always, Eastern 'Mysticism' or religion as its right arm. Again, I would have liked it had it not equated Eastern Religions with Satanism. One's failure to believe in God does not equate being evil. There are many who are moral and ethical who believe different things or incorporate different aspects into their beliefs. Hate is not what Jesus proposed but loving those who may not be awake in the manner in which you think they should."}, {"userName": "Louize", "userReviewDate": "Dec 20, 2010", "userURL": "http://www.goodreads.com/user/show/3019973-louize", "userReview": "I have recently reread Daniel’s story from the Bible. Allow me to say that Daniel was my favorite Bible character when I was growing up. He was a prayerful man who did not bent to any pagan rule, even if it meant being fed to the lions on a pit. He was a man miraculously saved by an angel. He was guided by God, not only to see visions but interpret them as well. His book was, for me, the first evidence there was of spiritual warfare. Although angels appeared many times in the Bible, their battles were never mentioned as it was in Daniel’s vision (v.10:13). Beyond what the Scriptures revealed regarding the spiritual warfare is mere conjecture.\n“There, kneeling in earnest prayer, his head resting on the hard wooden bench, and his hands clenched with fervency, was a young man, very young, the blond man thought at first: young and vulnerable. It all showed in his countenance, now the very picture of pain, grief, and love. His lips moved without sound as names, petition, and praises poured forth with passion and tears.”\nLike Daniel, Frank E. Peretti’s main character Hank Busche is a prayerful man, a pastor, protected by angels and chosen to fulfill a mission for the small college town of Ashton. He faced discouragements every day, including a sexual scandal to stain his character. But Hank, and his wife Mary, knows that there is a stronger force gripping their small church and town; which can only be defeated through God’s intervention.The Strongman’s cloud of demons is looming towards Ashton. Victory will be theirs to claim through the global tyrant Alexander Kaseph, owner of Omni Corporations. Possessing demons have wormed into the lives of the townspeople and started ejecting possible threats to their sinister plan. But Hank Busche and Marshall Hogan, editor of Ashton Clarion, are the two biggest threats of them all.\n\"I'm sorry, we cannot allow any more demons into the church this morning.\"\nGod has equal plans for Ashton. The captain of the hosts, Tal, was sent to derail the enemy’s plan. One by one, the angels came and strengthened as more and more “Remanants” started praying and praising God.This Present Darkness is a very engaging fantasy. It has the charisma that drew me into the lives and battles of the characters. I cannot help but root for the heroes of the story. It was greatly entertaining to read some of the angels’ punk and swag. The good blend of intense action, drama, mystery and humor have to be mentioned, too. I have to commend Peretti for giving “the Power of Prayer” great emphasis. Let us be reminded, though, that our prayer life is far more effective through the knowledge of God’s Word and solemn worship. The Bible is the most powerful text book I’ve ever known. Confronted with evil influences, teachings or temptations, we fight with the truth – the Living Word of God. Needless to say, for me, Peretti’s mystical approach of admonishing demons is rather off. Believing and living according to God’s Word is the best way in keeping the enemy away.Furthermore, prayer and worship brings us into the presence of God. Prayer is an open communication that empowers and comforts us. Contrary to the book’s suggestion, our prayers do not empower angels. Not once was it ever mentioned in the Scriptures. It is God who empowers them according to their purpose; the same thing may be said with us.Please, understand that it is not my intention to discourage anyone from reading this book. It is a well-written and captivating story. I just wanted to point out that this is a fantasy based on the creative conjectures of a best-selling author."}, {"userName": "Kristen Overton", "userReviewDate": "May 07, 2008", "userURL": "http://www.goodreads.com/user/show/1147788-kristen-overton", "userReview": "Back when I was into Christian Literature, I really loved this author. I've moved past a lot of Christian Authors, persay, but Frank Peretti will always have my heart. He's very witty and well spoken (and a ham if you've heard him speak in public). This book was written with a lot of creativity and enlightenment, and though I've moved past a lot of the 'spiritual warefare' movement that ripped through the bible belt in the 90's, this book is still one of the most riveting I've ever read. It's flat out scary at times."}, {"userName": "Gary ", "userReviewDate": "Aug 17, 2017", "userURL": "http://www.goodreads.com/user/show/27528763-gary", "userReview": "I forgot I had read this. I thought it was good, but in the context of the 90s when the New Age movement was booming and conservative Christianity was looking for a response. Peretti put all of it in a Christian context and showed us an invisible world behind the scenes that although fiction, became reality for many people."}, {"userName": "Joseph Lewis", "userReviewDate": "Jul 25, 2013", "userURL": "http://www.goodreads.com/user/show/10409638-joseph-lewis", "userReview": "Yes, its over stylized with unrealistically gentle depictions of evil, but its the grand-daddy of them all and deserves its five stars."}, {"userName": "Anton Styles", "userReviewDate": "Jun 11, 2013", "userURL": "http://www.goodreads.com/user/show/21236685-anton-styles", "userReview": "I forgot all about this book until it popped up on Goodreads... I read it almost 10 years ago, as a sensitive, emotionally-wounded teenager, as I was being funneled through a fundamentalist religious conversion.Basically, this book introduced a paranoid neurosis into my awareness of self-in-the-world. \"The world\" (read:everything except for fundamentalist warfare-obsessed Christianity) is painted as basically evil, and all well-meaning people who aren't Christians are actually playthings of demonic spirits from the Dark Side. If that view of things seems OK to you, it might be nice to think about your social relationships—how close are you to people with diverse beliefs? Do all those close to you reflect the same philosophy of self, God, and humanity, that you share? I was taught to be extremely wary of non-Christians, basically to only interact with them in service of the Ulterior Motive (to convert them to OUR way). After a few years, I started to feel like this attitude was generating more heat than light. I got to know a bunch of \"spiritual\" people—yes, spiritual in the \"vague\" or \"new-age\" way. I thought a bunch of what they thought was silly and strange, and I still do, but I realized that they're actually beautiful people, and the whole teaching that had been drilled into me every week for years—that Satan and his Army of Angry Creatures were clamouring at the door of every heart—came to look like the childish, cartoonish caricature that it is. I started to actually *relate* to people. It was like walking into air and suddenly realizing that I'd been in hazy fog for years.This story-book would have been ok as a D-grade horror novel, but as an actual spiritual teaching? It's like believing that the Orcs of Mordor will come to eat you if you don't depend on Frodo.In the final analysis, I think this book added nothing but silly, superstitious complication to my spirituality.(I should add that with greater literacy, the narrative itself is awkwardly awful — it probably should only be read for comedic value)"}, {"userName": "Liz", "userReviewDate": "Jan 22, 2009", "userURL": "http://www.goodreads.com/user/show/1886137-liz", "userReview": "I read this book twice, about a decade apart, and would read it again. Since I have an open mind about religion I could read it as a story and not as a religious philosophy. My dad didn't like the book because he didn't agree with the religious views in the book, but I saw them as background for the characters.Anyway, the book is about the basic fight between angels and demons, but you see it from the angels' and demons' perspective, as well as from the humans' perspective that they are protecting/controlling. I found it a very interesting read both times."}, {"userName": "Lou Rocama", "userReviewDate": "Sep 09, 2012", "userURL": "http://www.goodreads.com/user/show/2774017-lou-rocama", "userReview": "My boyfriend gave me this, and it had me on the floor laughing. I never actually read any of it past the cover blurb, but the idea of a nefarious new age plot to enslave the world struck me as hilarious, considering the things I knew about Wicca from my adolescent 'I wanna be a witch' phase. It involves a lot of gardening and smelly candles, from what I remember. Watching lunar cycles, I guess. 'Dancing about without your drawers on', as Pratchett's Granny Weatherwax says. Even now, I'm having trouble coming up with a dastardly plot involving these actions. The closest I can get is public indecency.Perhaps Buddhism is a bigger den of evil, though if you're like Tofu Roshi, the hyperoxygenation caused by endless deep breaths in meditation would leave you unable to tie your own shoelaces, much less stage an evil world takeover. Best to stick with tending the compost.Ah! Compost! Of course! The common denominator of all those terrible new age religions. Possibly the Eastern ones too, though I'm not terribly familiar with them, beyond the great Tofu Roshi. I'm sure some awful plot involving compost is the answer.Perhaps the Terrible New Agers (inc.) planned to hoard all the world's compost, leaving the Good People without fertilizer unless they left the True Path. Shame this doesn't take the nitrogen based stuff common today into account, but I'll just pretend the New Agers didn't know about it, since they're uneducated hippies. Then the Devout Hero saves the day by bringing chemical fertilizer to the small farms held in the evil clutches of the Terrible New Agers, thus ending their dependence on compost and ruining the Terrible New Agers Dastardly Plot.Am I close? No? Well, drat."}, {"userName": "x", "userReviewDate": "Jul 05, 2010", "userURL": "http://www.goodreads.com/user/show/2634044-x", "userReview": "I had to read this book for school and it is one of the worst books I have ever read.The plot was ignorant and unbelievable, the characters were boring, and I felt like I was being preached to the entire time. None of this should come as a surprise considering it is a Christian novel with an agenda of course. I especially found it absurd that the villains would be controlled by demons while engaging in Eastern meditation and preaching unity and self-awareness. I understand that this book was supposed to be about the power of prayer or something like that, but it seemed to me that it was more about the evils of New Age religions and philosophy. I could have looked past this if the story was at all interesting or engaging, but at one point I almost fell asleep while trying to get through this book. It is that dull."}, {"userName": "Peter Ibsen", "userReviewDate": "Aug 16, 2009", "userURL": "http://www.goodreads.com/user/show/2011186-peter-ibsen", "userReview": "Damn, It was a long day that involved my spend over 100$ on my truck, so to relax I got a pizza and went to the library to find a good horror novel. They were closing early and this looked somewhat promising. I did not realize it was a christian propaganda book untill halfway through. Damnit. It does get a couple stars for being page-turnery. But once you realize what the message is (new-age, mystasism, eastern religion, meditation, humanism... is SATAN IN THE FLESH) and notice that the author wont write vulgarities or nasty words, and every problem is solved in prayer, its gets to be a drag. And I am ok with a religious themed book, but this was pure propaganda. Which sucks all the more because once I figured that out I knew that it would end with God winning. boooooooooring.p.s. does anyone know any good horror novels. I don't have a TV or Computer so i need cheesy novels for my mindless entertainment."}, {"userName": "Andrea", "userReviewDate": "Nov 15, 2010", "userURL": "http://www.goodreads.com/user/show/2566047-andrea", "userReview": "This book annoyed me in so many ways. There were multiple typographical errors. The characters all began sentences with \"Aw\". Not every sentence, but enough to be really irksome. THe idea behind this book is interesting but the characters were so unbelievable. The Christians were either fanatical or really evil in disguise. Everything that happens is attributed to either demons or angels. It was just too much. I did finish the book and I have to say at least the pace did pick up about halfway through. Still, not worth a lot of time."}, {"userName": "Donovan", "userReviewDate": "Feb 25, 2012", "userURL": "http://www.goodreads.com/user/show/7565775-donovan", "userReview": "This is the first of 2 books that were given to me during a very difficult and painful part of my life. I am not one to read religious (particularly Christian) based books if it's not a horror but these were different. This Present Darkness is the first of the two that I have read and is simply the good versus evil story with a much more contemporary drive behind it. More important is the 'hope' that this book can inspire - particularly if you are having a hard time trying to come to terms with why things happen. I don't think you could consider this a feel good book but if you are Christian oriented in your faith, then you will probably enjoy this more than others will.While I am not a Christian myself, this was a particularly interesting read - especially with how it introduces Angels & Demons.Plot ***Spoilers***This Present Darkness takes place in the small college town of Ashton. Bernice Kreuger, a reporter for the Clarion, Ashton's town newspaper, is falsely arrested on prostitution charges after taking a photograph at the annual Ashton Summer Festival. When she is released the next day, she discovers that the film in her camera was destroyed.Marshall Hogan, owner/editor-in-chief of the Clarion decides to go to the town police station/courthouse and confront Alf Brummel, the police chief, about the incident. Brummel denies any wrongdoing on behalf of the police department and insists it was all a mistake. Brummel then advises Marshall to drop the matter. Marshall does not fall for Brummel's story and, ignoring Brummel's advice, begins an investigation.As the investigation continues, Marshall and Bernice begin to realize that they're onto something much bigger than they thought. They slowly uncover a plot to take over the town via buying the college, that is being carried out by The Universal Consciousness Society, a powerful New Age group. When the Society decides Marshall has found out too much they take the Clarion, and his house. They also falsely accuse him of murder, adultery, and molesting his daughter, who attends the college and who unwittingly has been pulled into the Society. When he and Bernice are caught in a desperate attempt to keep the society from winning out, he is arrested and thrown in jail, and she escapes, running off to find help.Meanwhile Hank Busche, the unwanted pastor of the little Ashton Community Church discovers that there are many demons in the town and wonders why they have all congregated here. When he gets to be a nuisance to the demons they have the Society falsely arrest him for rape.Hank and Marshall meet in jail. They compare stories and finally put both halves of the puzzle together.During the time that this is happening the story take on a spiritual dimension - revealing a perspective based on the idea of unseen forces at workMeanwhile, Bernice finds help and makes contact with the County Prosecuter, the State Attorney General, and the Feds. When Alf Brummel finds out about this he releases Hank and Marshall."}, {"userName": "Jill Williamson", "userReviewDate": "Jun 11, 2009", "userURL": "http://www.goodreads.com/user/show/955038-jill-williamson", "userReview": "Review by Jill WilliamsonBernice Krueger, reporter for the Ashton Chronicle, finds herself in jail after being in the wrong place at the wrong time. She came to Ashton to investigate the supposed suicide of her sister. Now, she and her boss, Marshall Hogan, start investigating some strange occurrences in town.Hank Busche is a small town pastor who is trying to keep his argumentative congregation from falling apart. Little does he know, there are dark forces in town that are set on seeing him fail. As demons characters carry out their assignments, Marshall and Hank become more determined to discover the truth. But can two men fight a host of demons they cannot see? And why is the host of heaven standing around and watching? Aren’t they going to do anything to stop this evil plot from taking over the town?Wow. This book has changed the way I think of angels and demons. There are many references in the Bible that lead me to believe there is a spiritual war going on around us that we can’t see. But never have I read anything to give me such a clear picture of how that might look. In Daniel 10, Daniel has a vision of an angel coming to speak to him. The angel says in verses 12-14, “Do not be afraid, Daniel. Since the first day that you set your mind to gain understanding and to humble yourself before your God, your words were heard, and I have come in response to them. But the prince of the Persian kingdom resisted me twenty-one days. Then Michael, one of the chief princes, came to help me, because I was detained there with the king of Persia. Now I have come to explain to you what will happen to your people in the future, for the vision concerns a time yet to come.”This has always amazed me. That God told this angel to come and talk to Daniel, but the angel got held up fighting some demon over in Persia. In the Bible, angels are sometimes referred to as princes. I believe this angel was talking about how he was fighting with the prince of the Persian kingdom, who was a fallen angel, or demon, since he was resisting one of the host of heaven. It’s this idea that Peretti builds his story around. The idea that there are angels and demons waging war around us in a dimension that we cannot see. They can see us, but we can’t see them. And in Peretti’s story, the demons want to rule Ashton and the angels are there to make sure God’s plan prevails.This Present Darkness is an awesome story. Marshall, Bernice, and Hank slowly stumble onto the truth and have to work together to save Ashton. I love how Peretti showed the angels as mighty warriors interacting with one another. I also loved how Peretti showed the power of prayer. I kept rooting for the characters to pray, already! This book was thrilling, scary, amazing, and brilliant. I can’t say enough wonderful things about it. Everyone should read this book at least once in their life, if not over and over again."}, {"userName": "Lisa (Harmonybites)", "userReviewDate": "Jun 22, 2011", "userURL": "http://www.goodreads.com/user/show/2596042-lisa-harmonybites", "userReview": "This gets as high a rating as it does because I have to acknowledge it does have its merits when contrasted to the books in the genre I've read, even if this is emphatically not a book for me. I tried this because I'm working through a list of recommended reading, \"The Ultimate Reading List\" and decided not to skip the \"Inspirational Fiction\" section of Christian fiction despite not being a believer. After all, I do love CS Lewis, so I thought there might be one gem on the list. This did well in presenting a community, that of small town Ashton, in displaying a sense of humor, and gets points for imagination.In this novel, dark forces are gathering in the town--a battle of good and evil, with two chosen humans, the young pastor Henry Busch and the weary, cynical publisher of the small town newspaper, Marshall Hogan. Demons hover over both trying to break them or at least wear them down--demons with names like Complacency, Deception, Lawlessness and Jealousy. Also gathering are an Angelic host, but they need \"prayer cover\" from believers to have the strength to defeat the evil. What kills this novel for me is what Peretti sets as his forces of darkness. The Reverend Olive Young is one of those personifications of evil--because, after all, he cares about \"saving the whales\" and his congregation is described as \"different, liberal, even bizarre.\" But the most venom goes into the descriptions of Professor Langstrat, a woman who actually teaches her psychology students to ask difficult philosophical questions of ontology and metaphysics, but worst of all, promotes such New Age ideas as goddess worship.Sorry--I've known too many wonderful people who consider themselves part of the New Age movement or even Pagans--kind, compassionate honest and wise, to put up with this bigoted demonization of them for the purposes of fiction."}, {"userName": "Jeanette", "userReviewDate": "Jul 15, 2009", "userURL": "http://www.goodreads.com/user/show/2383998-jeanette", "userReview": "Frank E. Peretti's book This Present Darkness is brilliant. This is my second time reading this book, and I am even more impressed than the first time that I had read it, which was many years ago. As I read through it, I realized that I didn't remember large parts of the story and was so glad to have decided to read it again.The story centers around two principal characters, Hank Busche, a new pastor of a small church in a nondescript college town, and Marshall Hogan, recently transplanted publisher of the local newspaper. Points-of-view change not only among various earthly characters but also among both angelic and demonic beings.It is absolutely fascinating to get a glimpse of what the spiritual realm of our existence might be like! The overarching message of this story is the unequaled spiritual power of saints' prayers over the workings of evil. Peretti does a masterly job of storytelling, weaving multiple threads of experience, POV, plot, goals, schemes, attacks, counterattacks, and the spiritual awakening of mortal characters. As I finished reading, my only consolation in \"leaving\" the POV of angels is that I have the sequel Piercing the Darkness sitting next to me, which I will eagerly open up to read as soon as I have posted this review!"}, {"userName": "Matt Piechocinski", "userReviewDate": "Apr 30, 2010", "userURL": "http://www.goodreads.com/user/show/1007776-matt-piechocinski", "userReview": "Okay ... I did what everyone told me to do:1. Keep in mind that it's written from the viewpoint of the fundamental religious right.2. At the height of the Reagan era.and, I still almost couldn't finish it. I'll be the first to admit that I don't agree with Peretti's agenda, but I'll also say that I imagine that there's pleanty of \"normal\" Evangelicals, just as there are Republicans. But, Peretti, I hope is just blinded by his faith, and just not flat out retarded.The Cons:For some reason, I don't think Mr. Peretti buys into any religion except Christianity, the Liberal left, higher eductation, women's rights, and philosophy.His characters were pretty thin, and cookie cutter.The end is pretty Scooby-Doo. ZOINKS!The Pros:Marshall Hogan as an everyman. He was pretty much the best character in the book.I dunno. You really know what I think the best religious book out there is, and a true testament of what it means to have Faith? The Excorcist. No lie."}, {"userName": "Hilary", "userReviewDate": "Feb 12, 2010", "userURL": "http://www.goodreads.com/user/show/3282620-hilary", "userReview": "A common criticism of Peretti is that the writing isn't that great. It isn't wonderful, I'll grant you that, but it's certainly not intrusively bad. Another common criticism is the personification and representation of angels and demons, and that may depend on your personal theology. I'm not sure where my belief falls there, though I know those particular ones aren't real, but that's less important.What is important, and unique about this book, to my mind, is the way it made spiritual warfare real to me. Before, I could never fully understand it but this book gave me a glimpse of why prayer is important, however it works in real life. It gave me an idea of why it could be important to pray, to listen to the Spirit when we're prompted to pray, why God won't intervene unless we ask Him, and what might happen when we do obey."}, {"userName": "Pamela Shropshire", "userReviewDate": "May 17, 2018", "userURL": "http://www.goodreads.com/user/show/6535930-pamela-shropshire", "userReview": "I read this back in the 1980s or 90s, when everyone was reading it. A co-worker handed it to me and said I just had to read it, it was amazing, etc. You never know how those things are going to go, do you? I did enjoy the book. Peretti does a good job of building the suspense and making you care about the characters. As far as the supernatural stuff, okay, yes, I am a Christian, and I believe in angels and the devil, etc. I don't necessarily believe that angels and demons physically fight each other like in this book, but of course, no one can know whether they do or not. For that matter, no one can know for certain that God exists. I have chosen to believe He does, but I would never claim to have proof of His existence.Anyway, pretty good book (certainly better than the sequel and other books by Peretti, although he wrote some YA novels that were pretty good), but I'm really surprised it showed up on the Great American Reads list. I hadn't thought about it in years."}, {"userName": "Maddison", "userReviewDate": "Oct 05, 2017", "userURL": "http://www.goodreads.com/user/show/5128911-maddison", "userReview": "[possession of his child (maybe)? (hide spoiler)]"}, {"userName": "Jerry", "userReviewDate": "Jul 08, 2017", "userURL": "http://www.goodreads.com/user/show/5855981-jerry", "userReview": "The book that started it all..."}], "description": "\"For we do not wrestle against flesh and blood, but against the rulers, against the authorities, against the cosmic powers over this present darkness, against the spiritual forces of evil in the heavenly places.\" Ephesians 6:12Ashton is just a typical small town. But when a skeptical reporter and a prayerful, hardworking pastor begin to investigate mysterious events, they suddenly find themselves caught up in a hideous New Age plot to enslave the townspeople, and eventually the entire human race. The physical world meets the spiritual realm as the battle rages between forces of good and evil.This Present Darkness is a gripping story that brings keen insight into spiritual warfare and the necessity of prayer. Since its original publication more than 2.7 million copies have been sold. The companion volume, Piercing the Darkness, continues the story of the battle between spiritual forces.", "title": "This Present Darkness\n      \n          (Darkness #1)", "url": "http://www.goodreads.com/book/show/17309.This_Present_Darkness", "average": 4.23, "cover": "https://images.gr-assets.com/books/1388202265l/17309.jpg", "reviews": 1665, "authors": [{"url": "https://www.goodreads.com/author/show/5544.Frank_E_Peretti", "name": "Frank E. Peretti"}], "type": ["Christian Fiction", "Fiction", "Christian", "Fantasy", "Thriller"], "outlinks": ["http://www.goodreads.com/book/show/17309.This_Present_Darkness", "http://www.goodreads.com/book/show/637979.This_Present_Darkness", "http://www.goodreads.com/book/show/13056432-this-present-darkness", "http://www.goodreads.com/book/show/2625240-this-present-darkness-darkness-set-1", "http://www.goodreads.com/book/show/17303.Piercing_the_Darkness", "http://www.goodreads.com/book/show/365006.The_Oath", "http://www.goodreads.com/book/show/65684.Monster", "http://www.goodreads.com/book/show/19747756-house", "http://www.goodreads.com/book/show/17324.The_Visitation", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}