{"ratings": 37335, "userreviews": [{"userName": "Khanh, first of her name, mother of bunnies", "userReviewDate": "Nov 02, 2015", "userURL": "http://www.goodreads.com/user/show/4527753-khanh-first-of-her-name-mother-of-bunnies", "userReview": "This book is a travesty. This book is, quite frankly, an insult to all the victims, direct and indirect, of school shootings. School shootings are a fairly new epidemic, one of the most well-known being Columbine. It is also a morbidly intriguing one; the psychology of the people that committed said acts are deeply complex, and not to be taken lightly in exploration.And yet that's what this foolish, belittling, dare I say, stupid little book does. It boils down the intricate psychology behind said act, behind the perpetrator down to \"he was evil.\" Boom. Simple. That's it, right? That must be it. One does not simply wake up one morning and decide \"I'm going to kill my classmates.\" It is a simplistic, idiotic, fatally flawed frame of mind. Any minute bit of research, the dumbest fucking idiot in the world has access to a Wikipedia page, and even the merest glimpse into one of these pages would show that the reasoning behind these acts is not simply \"he was evil.\"This book is all black and white. The victims are good, sympathetic, pathetic, nearly indistinguishable from each other in their blandness. I feel this is a betrayal in portraying this way. The victims are diverse, they led different lives, they have hopes and fears and imperfections. Some of them are good. Some are not. Some are bullies, jerks, assholes. The writer of this book doesn't show that. Just because they're victims, they are all milquetoast in their mournability once they are lost, and to be honest, I can't recall any of them with clarity because there are so many of them and they're all utterly unmemorable. I can't remember their deaths. It is a crime to portray the victims in that way. The shooter is evil and bad. Has been evil and bad, and will have grown up to be more evil and bad had he have gotten away and lived.The book is sensationalistic. Like come on, when the bad guy is about to kill you, would this moment really have happened? Like, REALLY?\n“You know, sweaty chic doesn’t suit you,” I muse.Tyler falters, though only for a moment. “I should have known. Come to protect your sister? What are you going to do—hit me again?”\nAgain, this is just speculation, but to me, this is nothing that dramatic bullshit to make the book read better.Tyler. The perpetrator. My god, what a one-dimensional character he is. Dare I say, murderers are always complex people. We read crime novels, mysteries, we watch mystery shows because it's the motivation of such an act that fascinates us. Some of my favorite book series in the world are murder mysteries because they are so addictingly macabre in their portrayal of the psychology behind such an act.Tyler's character is as fleshed out as a vegetarian steak. He did it because he was bad. He did it because he wanted to be visible. Bullshit. People don't just kill because they wanted to be seen. They kill because they were bullied, oppressed, whether real or felt. They kill because of real or imagined slight that was amplified enough to fuel their rage to want to kill. They kill because they were abused, over and over, until the rubber band of their mind snap. The psychology of such an act is so complex, and this book fucking misses the point completely. The diversity of the book - students of different color - feels so false. Token persons of color, that's all. This book deserves to disappear from the face of the earth."}, {"userName": "Emily May", "userReviewDate": "Jul 10, 2015", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "We're not just fighting for survival - we're fighting for hope and a thousand tomorrows.\nI am so disappointed. So so disappointed. This Is Where It Ends promises a look at a frightening and very real problem in the U.S. - school shootings - written by a We Need Diverse Books member. It should have been amazing. It could have been amazing if it wasn't dampened by cheap, sensational writing and a black and white sense of victims and villains.School shootings are horrific things that open up so many questions. What does it take for someone to snap in such a way? What can possibly make someone turn a gun on their classmates and teachers? What is it about these people that makes them different from everyone else? Are they that different? In other circumstances, could that be me?But this book never looks at such things. This is a very underdeveloped tale of drama. Right away, the different narrators tell their own sympathy stories - each is hurting, abused, though not really flawed, and diverse (and often victimized because of it). No mistake can be made: these are our victims. And they all have the same narrative voice.On the opposite side, you have the shooter - Tyler Browne. He is vindictive and one-dimensional, walking around smiling and enjoying himself as he murders kids. As his past is revealed, it becomes clear Tyler is also abusive and a rapist. He is almost cartoonish in his villainy.We are never taken deep inside his mind to see what made him do it. The flashbacks show that he was once different, but a piece of the story is clearly missing - when and how did he become this way? When did he go from being Autumn's loving brother to someone who deliberately antagonizes his father to get him to beat his sister? Some answers are given, but they are vague and superficial. Documentaries and articles on the subject of school shootings often reveal that the shooters were bullied, victimized or simply unloved and ignored. They are usually consumed by sadness and anger that eventually explodes. This is quite a simplistic explanation and yet Tyler isn't even offered that. He is simply an evil shooter. It makes me feel very sad that he isn't given more humanity.So much potential to look at an important issue and the psychology of teen shooters is wasted on cheap thrills. So many serious issues are brought up - abuse, rape, racism, etc. - and yet the pages remain devoid of emotion. This book is like a shallow action movie where there are people with guns and others running around trying to survive. That's it. No depth.Blog | Facebook | Twitter | Instagram | Youtube | Pinterest"}, {"userName": "Jesse (JesseTheReader)", "userReviewDate": "May 18, 2018", "userURL": "http://www.goodreads.com/user/show/8114361-jesse-jessethereader", "userReview": "Hm... I'm going to need to think this one over before I share my thoughts."}, {"userName": "Regan", "userReviewDate": "Feb 24, 2016", "userURL": "http://www.goodreads.com/user/show/19645927-regan", "userReview": "3.5"}, {"userName": "Rose", "userReviewDate": "May 26, 2015", "userURL": "http://www.goodreads.com/user/show/3399699-rose", "userReview": "[ him sexually assaulting a girl (hide spoiler)]"}, {"userName": "Hailey (HaileyinBookland)", "userReviewDate": "Oct 14, 2017", "userURL": "http://www.goodreads.com/user/show/21937982-hailey-haileyinbookland", "userReview": "[also suicide is not graphically described but still present. (hide spoiler)]"}, {"userName": "Emma Giordano", "userReviewDate": "Apr 22, 2017", "userURL": "http://www.goodreads.com/user/show/30604861-emma-giordano", "userReview": "This is a really hard one to review because on one hand, I think it is a fantastically written book that deserves all the praise, but on the other, it wasn't really for me and I did not enjoy it as much as I thought I would. So I'm settling in the middle with a good 4 star rating (5 for overall great writing, 3 for my personal reading experience) and hopefully I won't fail at explaining why I appreciate the genius of this book, but why it also wasn't that enjoyable for me.Unfortunately, I believe I placed too many personal expectations on this book, thinking it would be a high-intensity suspense novel, but I got an entirely different reading experience than anticipated. My own personal hype is absolutely a huge reason as to why I don't think I enjoyed this book to it's full potential. I think, had I been more aware of the actual plot of the book as opposed to just knowing \"it's about a school shooting,\" I probably would have been more prepared to read it with an unbiased mind.It seemed that the majority of this story actually occurs through flashbacks (which is another personal book pet-peeve of mine), and the present plot was fairly static, in my opinion, until about 70-80% of the way through the book. The course of the story is essentially that someone starts shooting, there's multiple multiple flashbacks, a scene in the present every so often that is focused on mostly dialogue between characters, more flashbacks, and then the climax/falling action/ending. I'm in no way suggesting that this format suggests a \"bad book\", it's just the polar opposite of what I like to read.The writing was also really well done. The story was very vivid, especially regarding characters. The prose was eloquent, but not distracting and absolutely fueled the story in a positive way. The book itself is really interesting to me because the entirety of the story takes place over the span of less than an hour, which is pretty unheard of for the novels I read. At points, it was difficult to keep up because you have four perspectives occurring at the same time, so it often felt like you had to rewind time a bit and replay the last few minutes for someone else to fully grasp the other point of views. It is definitely something that I feel would be hard to accomplish and although it wasn't my favorite method of storytelling, I think it came across well in the end.I say in a lot of my reviews that I am a plot-based reader. I don't need to fall head over heels in love with characters as long as there is something big driving the story. So I prematurely imagined this book would be a really elaborate, action filled novel, when it is, in my opinion, ENTIRELY character based. If you are a character-based reader where the peak of your reading pleasure comes from complex characters with intricate back stories,  please read this book . It's the book for you, I promise. The characters are really the driving action of the story. I honestly can't recall better written characters. They are all individual, unique, with clear cut past experiences, current motivations, and future hopes. There's also a great load of diversity in this novel as well, with 2 LGBT+ main characters as well as 2 Latinx main characters (one being LGBT+) and more. I will say that I personally am not emotionally invested in this particular set of characters. Again, it could be because I didn't go into this story with the intention of being attached to them, but I can completely understand why so many readers are emotional over these characters. They're flawlessly constructed, really well written, and are the types of individuals who should represent a story like this.While plot based novels are my niche, I think the fact that this story is focused on the victims and survivors of such a tragedy was the better direction for this story. It was heartbreaking to see what these characters experienced, what they lost, and what they cannot regain. This story shows school shootings for what they are; a horrific, traumatizing experience. No character leaves this story unscathed and the images/messages that will be received from this story are the ones that deserve the spotlight. Though I was hoping for a loaded plot, I feel it would have overshadowed the real meaning of the story and shifted the focus in a negative way. But I can say with sincerity that all the decisions the author made regarding this novel were the right ones, even if it wasn't what I wanted from the book at first.So ultimately, I don't think I enjoyed this book to my full potential, but I can still appreciate the art of it's construction! It is a book I would recommend to others, and I will definitely be reading from this author in the future."}, {"userName": "Kelly (and the Book Boar)", "userReviewDate": "Jul 16, 2015", "userURL": "http://www.goodreads.com/user/show/11183856-kelly-and-the-book-boar", "userReview": "Find all of my reviews at: http://52bookminimum.blogspot.com/Here’s another book I read nearly a month ago and never reviewed. This time it wasn’t because I’m lazy even though I am, it’s because I feel bad giving this one a negative review. But a negative review is what I must give when I read a book about a “Columbine” type school shooting and . . . .\nThis Is Where It Ends was easily my most anticipated YA contained in the BuzzBooks sneak preview. I requested it immediately and was thrilled to receive an advanced copy. I love books that push the envelope with respect to subject matter and I figured this was definitely not going to be stereotypical YA fare. And while it did deliver a story free of instalove and Mary Sues, it had a lot of problems.1. Did you know Opportunity, Alabama is a real melting pot? Yeah, no one else does either. I’m all for books having a lot more diversity when it comes to characters, but don’t set it in a town where 80% of the population is white . . . \n2. Speaking of the town, it’s also small. Like under 7,000 people. Do you really think a single gunman type of school shooting would last for 54 minutes? In 2015? Where nearly every child is going to have a cell phone handy and be able to call the local po-po???\n3. Back to the characters. Diverse = good. Multiple narrators with little to no development = cardboard cutouts. Cardboard cutouts are bad – well, mostly . . . \nSpeaking of cardboard cutouts, Mitchell would like this for Christmas:\nSo bottom line is This Is Where It Ends was a book with a lot of potential (and a most excellent cover) that wound up being nothing special. If you want a YA book about a school shooting that is special, check out Jennifer Brown’s Hate List. I read that one back before I started reviewing, but Rose wrote a real good one : )ARC provided by NetGalley in exchange for an honest review. Thank you, NetGalley!"}, {"userName": "Marieke", "userReviewDate": "Jan 16, 2015", "userURL": "http://www.goodreads.com/user/show/10846682-marieke", "userReview": "TIWIE has a lot of things I'm very excited about, like queer girl main characters. And PoC main characters. And tragedy. And courage. And hope. And at least one wholly unintended Les Misérables reference. I'll share more information when I can, but feel free to ask me any questions. And thank you for sharing my excitement! <3"}, {"userName": "Whitney Atkinson", "userReviewDate": "Aug 18, 2016", "userURL": "http://www.goodreads.com/user/show/14457130-whitney-atkinson", "userReview": "3.5 starsThis book is simply unforgetable. It's the first book I've read about a school shooting, and it was just as horrifying and jarring as you would expect. I'm very glad i'm not in high school anymore, because for the rest of my life I'm going to be a little bit startled walking into an auditorium. Sadly, I think this book's only selling point is the subject matter, however. It was gripping and tragic, but the characters, writing, and structure didn't support that very well. I liked how diverse this book was, but it was very hard to interconnect the 4 perspectives as they were described because the way this book is told is very confusing. A lot of the time I was grappling for details, not sure what was going on or who was who. The characters themselves didn't have a lot of time to be fleshed out, and by the end of this book, I didn't find myself particularly attached to them. This book has very sensitive and violent material so I wouldn't recommend it for everyone, but it was absolutely crazy and is such a horrible reality that I think it's an important read if you can get your hands on it, even though the execution of it was shaky."}, {"userName": "Erin Clemence", "userReviewDate": "Apr 23, 2017", "userURL": "http://www.goodreads.com/user/show/16907451-erin-clemence", "userReview": "HOLY. COW. I am at a loss for words with this novel. It literally took me three hours to read, because it was so gripping and suspenseful, I did not want to stop reading it, not even once. (Before you ask- how can you possibly read novels on school shootings? Don’t you work in a high school? People who read about murders and murderers know there is danger in the world- it is your opinion if you want to be prepared for it and understand it (as best you can) or if you want to be surprised by it and dwell in ignorance for as long as possible. That is my opinion).“This is Where It Ends” is the debut young adult novel by author Marieke Nijkamp. It highlights one day in the life of a public high school where students, having just finished listening to a speech by the principal, get up to leave the auditorium. Soon, students and teachers alike are scrambling- the doors are locked from the outside and everyone is trapped. Then, shots are fired and a student walks into the auditorium with a gun, demanding his peers “finally listen to him”…and the shots keep coming. This story has a lot of characters acting as protagonists, as Nijkamp does her best to show the effect of that day on as many students as possible. Although this is initially confusing, the characters very quickly develop into real people and a relationship with the reader is formed. The chapters are short (switching from one teens’ perspective to another), which helps make this book a super quick read (another contributing factor- each short chapter ends with a gripping cliff hanger). The characters are strong and developed, and I love how Nijkamp spends a bit of time focusing on the shooter as well and the choices that brought him to the auditorium that day. The story is a non-stop, gripping thrill ride that I did not want to end. The ending, of course, was bittersweet and not-entirely happy, but it played out as realistically as one can imagine (frighteningly). I do not have enough positive adjectives to describe my love for this book. Not since “Ninteen Minutes” (Jodi Picoult, of course), has a book on a school shooting touched me to my core. Nijkamp tells one hell of a story- a never ending thrill ride from beginning to end. I ran the gamut of emotions- from a desire to comfort the students, a paralyzing fear for them at the thought of losing their young lives, and of course both sadness and relief when the event had come to a fatal close. A touching, paralyzing, suspenseful tale of bravery, cowardice, love and hate and how we all come together in crises to help those around us."}, {"userName": "Melissa ♥ Dog/Wolf Lover ♥ Martin", "userReviewDate": "Sep 30, 2015", "userURL": "http://www.goodreads.com/user/show/17438949-melissa-dog-wolf-lover-martin", "userReview": "It took me awhile to decide how to rate this book. I didn't connect with all of the characters but I still enjoyed the story. Although, in this case, I'm not sure enjoy is the right word. The story is told through several different POV. They were friends, brothers and sisters all living in Opportunity, AL going to Opportunity High School. And they all had one very, very bad day! The story starts out with the shooter almost right off the bat. There are a few little things going on with the POV's talking about what they are doing at the moment, the moment before it all goes downhill. We learn a few things about the different kids through their thoughts of things that happened in the past. But even still this book didn't grab me like I thought it would. I thought I would love it! I gave it three stars because I could feel the terror everyone went through and I felt really bad for everyone going through what happened. I really can't explain what it was that didn't make this a 5 star book for me. I'm just going to leave to the non connection I had to anyone in the story. I still think the author did a great job in creating a very horrific situation, if your just concentrating on that event. I'm so happy for those that could love it and for the many more that will love it as well. And I'm glad I liked it just enough =)MY BLOG: Melissa Martin's Reading List"}, {"userName": "Mary", "userReviewDate": "Jul 21, 2015", "userURL": "http://www.goodreads.com/user/show/17156965-mary", "userReview": "I'm numb.I can’t even begin to describe the whirlwind that is in my head and heart after finishing this book. A complete and utter silence descended upon me the second I finished it. I was numb. I was speechless. I was heartbroken. I was angry. I was relieved that I was never forced to live a tragedy like the one described in this book. It’s the start of a new semester at Opportunity High School in Alabama, and the entire student body is assembled in the auditorium, to listen to the start-of-semester speech from the principal. When the assembly ends, they figure out that the doors are closed and cannot be opened. Then, someone starts shooting. The story is told from the perspective of four different people, all connected to each other and to the shooter. I found it to be a very emotional and personal book, a very fast read, because once I picked it up, I couldn’t put it down. It’s a very conflicting feeling: wanting to read, but fearing what you’ll find written on the next page. I think it’s so incredibly difficult to write about a tragedy like this. It’s very difficult to “get it right”. It’s why this is a you-either-love-it-or-hate-it book. But it hit the mark with me. I loved how it was written, I loved the characters and I think the author did a wonderful job developing them (given the fact that everything takes place in less than an hour, although we get a lot of flashbacks as well), I felt connected to them and to their story. Marieke tackles a myriad of difficult subjects and, while it would have been great for her to explore them more, I think she does them justice. The cast is diverse (POC and queer characters) and that was refreshing to see. The writing is gripping and poignant and terrifying. It transmits such an intense sense of dread to the reader, that it makes it difficult to continue reading at times. You feel how scared everyone is, how helpless and overwhelmed they are. It’s horrifying.The thing that I loved the most, probably, is that it’s a story about the victims and the survivors. Not about the shooter. It doesn’t explore the “why did this happen” angle, because in situations like this one, we never get a straight answer. We never learn the why. Instead, it focuses on friendship and courage and love, it’s emotional and moving. Humanity permeates its pages. And there’s a tiny sliver of hope hidden in there.Favourite quotes:“We’re more than our mistakes. We’re more than what people expect of us.” “You can’t always keep your loved ones with you. You can’t always settle your life in one place. The world was made to change. But as long as you cherish the memories and make new ones along on the way, no matter where you are, you’ll always be at home.” “Grief is one big, gaping hole, isn’t it?“ I say quietly I don’t even know if he hears me, but my words are as much for myself as for him. \"It’s everywhere and all consuming. Some days you think you can’t go on because the only thing waiting for you is more despair. Some days you don’t want to go on because it’s easier to give up than to get hurt again.” ★★★★★ To everyone who got this far, thank you for reading and have a wonderful day! Also, feel free to share your thoughts, comment or tell me anything :)"}, {"userName": "Rachel Reads Ravenously", "userReviewDate": "Nov 03, 2016", "userURL": "http://www.goodreads.com/user/show/14514998-rachel-reads-ravenously", "userReview": "DNF about 1/3 of the way through. This book is just..... shallow. Superficial. Not once did I connect to a single character. They all felt like caricatures of real people instead of relatable.I can see what the author was trying to do with the subject and having a more diverse character base, but it just didn't work."}, {"userName": "Sue (Hollywood News Source)", "userReviewDate": "Jun 04, 2015", "userURL": "http://www.goodreads.com/user/show/6511257-sue-hollywood-news-source", "userReview": "This is going to be a controversial book. A teenager with a gun, shoots up a school filled with students. A terrorist.  Told over the span of 54 harrowing minutes from four different perspectives, terror reigns as one student's calculated revenge turns into the ultimate game of survival. I was initially skeptical of the premise of This Is Where It Ends, books with multiple POVs usually doesn’t work well for me. Like I always say incorporating a handful of POVs is tricky. The author is juggling too many plates, some characters will not get their appropriate growth. The transition is awkward, there is no distinction between the voices. But for this story’s case it suited perfectly. The fluidity of the plot and the character’s tone is so authentic.This book is so delicate. I fear if I keep talking I’ll blurt out random spoilers. Trust me, this is the kind of story you should start with a blindfold. So instead, ill bullet proof the selling points.This book also captures how diverse the world we live in. We have: • PoC main characters • Disabled characters • Lesbian charactersThis is Where it Ends is dark and rough around the edges. Full review to come closer to the release date."}, {"userName": "Dana Kenedy (Dana and the Books)", "userReviewDate": "Jul 23, 2015", "userURL": "http://www.goodreads.com/user/show/372001-dana-kenedy-dana-and-the-books", "userReview": "So good. Many feels happening right now."}, {"userName": "Melanie", "userReviewDate": "Jul 14, 2015", "userURL": "http://www.goodreads.com/user/show/10890208-melanie", "userReview": "Disappointment after disappointment, it seems these days. An incredibly unfair, black and white portrayal of a school shooting. Had so much potential *sighs*Full review to come."}, {"userName": "sue", "userReviewDate": "May 10, 2018", "userURL": "http://www.goodreads.com/user/show/7377874-sue", "userReview": "This is definitely not a book for everyone. Its a subject matter that is 'real' and will effect you emotionally due to children being shot and killed.I knew I would have to put on my big girl panties to read this, which I did, however it still it was poignant, heartbreaking and sometimes came over as cold.There were many POV to this story and each portrayed what they saw or experienced with many social media activities going on.Its just that there was something that bothered me, that was the lack of warmth in some of the children who were dead, the reporting of this was sometimes cold hearted, maybe the author didn't intend that, but it did come across to me like that at times as I was quite invested within the pages.Nontheless, this was a book I have been trying to reach to read and I am glad I did.Thank you SOURCEBOOKS Fire via Net GALLEY for my copy"}, {"userName": "Kaye", "userReviewDate": "Jan 17, 2015", "userURL": "http://www.goodreads.com/user/show/4016487-kaye", "userReview": "[This review is not final. Quotes removed for reposting here, but you can find them in my blog post.]My knee-jerk, first things first thought on closing This Is Where It Ends could be summed up in three words.\"I'm not okay.\"And that, I think, is okay. Because this is a book that ends on a note that you should absolutely, 100% not be okay with.This Is Where It Ends is deeply, darkly visceral and gripping. It takes you by the throat and tugs you downward into emotional compromise and utter panic. It all too realistically portrays every parent or guardian's nightmare and the event that every student cannot imagine occurring on their campus, to their friends, in their lifetime.In the span of 54 minutes - just 54 - every student and faculty member present in the auditorium of Opportunity High School, Alabama, is fighting for their lives against one boy, one of their own. Only now, instead of being their brother or classmate or ex-boyfriend...He's the boy with the gun.I mean, the summary alone should tell you what's coming. I'm not sure how I still was so detached from what was coming at the very beginning, but Marieke makes sure to acclimate you to the assembled cast. They are ordinary, wonderfully diverse American teens. They are bored by the principal's default sermon to usher in the new semester, worried about younger siblings or fraying relationships or trouble at home.They are all expecting to stand up, gather their belongings and file off to their relevant classrooms.And that's what starts to drive this home, as things go from bad to...I don't know, is there something past utterly wrong and tormenting? What frightens us about a school shooting is that it can happen anywhere. On my campus, we talk in orientation about what we should do, where we should go, who we should listen to. We're introduced to the emergency phones, the fire escapes, the concept of being calm, quiet and orderly no matter what catastrophe has us in its clutches.But there's a difference between hearing about that and being thrust headlong into it.And, though everyone in This Is Where It Ends reacts differently, I had to tear up and press my fist to my mouth for all of them. Because you never know how you will react. You never know what action may be the last you take on - even if it's something that will make you a hero.The narrative is beautiful, equalizing and real. I gave a particularly watery smile in a moment where Tomas and Fareed, best friends and brothers no matter what - in a situation where it truly, deeply counts and cuts into you - are doing their best to rescue their classmates, friends and siblings.Even in that moment, waiting for some sort of outside help and trying to form a solid strategy, Tomas spares a thought for Fareed and how, with his Afghani heritage, accent and Muslim faith, he may seem a threat to the police officers rather than a hero.You know me. Even when my heart is in my throat and I'm turning pages as fast as I can without cutting myself, I've got that eye for Muslim representation.I found myself getting very reluctantly attached to all the teens, but Fareed in particular had me closing my eyes and telepathically wiring messages to Marieke's brain: Marieke, I love you. You wouldn't do this to me, right? ...Right?(For all the scientifically minded, the fact that Marieke has shown no sign of receiving said messages concludes that we have yet to break the telepathic barrier.Or maybe it's just me and you should get a better test subject.Anyway - and avert your eyes, because this may or may not be a spoiler! - [spoiler]she didn't do it to me.[/spoiler] She's evil. But not that evil.)I think the thing that hit me the hardest about This Is Where It Ends is that skillful blend of tragedy and hope, darkness and light. Some of it felt a little strange to me - a first kiss in the middle of worrying over a wounded, potentially dying sibling, for instance - but I'm holding off on the judgey side because, again, who the heck knows what they'd do in a particular situation when they don't know what else is going to happen?I certainly don't. And I have plenty of witnesses that can confirm that I don't claim to know everything. Okay? Okay.But, overall...the ending. It just catches in your throat. Nothing is going to be okay. I started the preview off on that note. I'm telling you right now, guys. Nothing is going to be okay.Newtown happened. The Aurora shooting happened. Columbine happened. Everyday, there's something vicious and violent that bites down into our world and rips families and friends and loved ones apart, leaving us to grieve with no proper answers and no promise that we'd ever feel whole or healed again.It's not okay. It's never okay. But one way or another, we will never forget. And we will never lose hope."}, {"userName": "Jen Ryland", "userReviewDate": "Dec 19, 2015", "userURL": "http://www.goodreads.com/user/show/6497049-jen-ryland", "userReview": "[ Suggesting that the shooter might also have been a rapist just confused me more. It's a pet peeve of mine when rape is casually thrown into a plot as shorthand that characters are bad guys or victims and the issue is not really dealt with. (hide spoiler)]"}, {"userName": "Stacey", "userReviewDate": "Nov 22, 2016", "userURL": "http://www.goodreads.com/user/show/399175-stacey", "userReview": "I love, love, love this cover! Every time I see it I have to pause and look at it.School shootings, unfortunately, have become all too familiar. A little piece of my heart breaks off each time I hear about another one. This is a good moment by moment account told by four narrators. The relationship between the shooter and his sister was especially good and suspenseful. Thank you Marieke Nijkamp for taking on a harrowing subject. It will resonate with the YA audience."}, {"userName": "Sarah", "userReviewDate": "Jul 01, 2015", "userURL": "http://www.goodreads.com/user/show/7591340-sarah", "userReview": "(Source: I received a digital copy of this book for free on a read-to-review basis. Thanks to SOURCEBOOKS Fire and NetGalley.)\n\n“If you cooperate, some of you might go home today. All you have to do is listen carefully to what I’m saying. No screaming, no running, no phones, and certainly no attempting to disarm me. Today, you’ll all listen.”\n\nThis book was pretty shocking, mainly because this sort of thing happens in real life to real people.I had a bit of a hard time keeping track of the characters in this book because there were so many of them! I slowly began to pick up the relationships between them, but it did take me a while. It was easy to see why these kids would be so scared though when someone just walked into their school hall and started shooting people, but I had a hard time really feeling for these characters, they just didn’t speak to me the way I expected them to.The storyline in this followed a couple of the kids who were in the hall with the shooter, and a couple of other kids who were outside of the hall, we also got some tweets from kids both and in the hall and at home. My main thing about this book though, was that it seemed in poor taste. This kind of thing unfortunately happens to real people in real life, and writing a fictional book about something that kills people just seems a bit wrong. I also hope that this book won’t give people ideas! I would hate for someone to do this sort of thing in real life after reading this book. The ending to this was okay, but I can’t help feeling like this book just left a bad taste in my mouth.6 out of 10"}, {"userName": "Jenna Major", "userReviewDate": "Mar 24, 2016", "userURL": "http://www.goodreads.com/user/show/14772037-jenna-major", "userReview": "5/5 STARS!!!What it is about!This book is a take on real-life school shootings. It follows different point of views of students, an alumni, texts and even twitter while it moves through the short period it takes to have such a traumatic event. This book is gut wrenching and raw and I doubt you will finish reading it without a few tears. My Review:This book is a very fast-read because you just cannot put it down. You need to know what happens next and who survives. It is a light read and can lack description but that adds to the book as we hop through POV's and move forward through the shooting. I read this late into the night and suffered through many different emotions this book entails. I loved the smaller characters that don't have POV's, we got to see them through the eyes of multiple people and with each view, they were still suffering. THERE IS A WHOLE LOT OF SUFFERING AND SADNESS!!!  I cried so much at the end of this book but also throughout. School-shootings are an absolute tragedy and horrific events already, but through reading this it makes me an infinite times more devastated and awestruck at the violence and death/injuries. I recommend this book to virtually anyone because it makes you think and reflect upon your own life and will potentially give you a new perspective!"}, {"userName": "Cora ☕ Tea Party Princess", "userReviewDate": "Nov 30, 2015", "userURL": "http://www.goodreads.com/user/show/4166936-cora-tea-party-princess", "userReview": "5 Words: Not my cup of tea.I had really been looking forward to this one. There was so much hype, I was seeing it everywhere, I'd heard good things...But.I knew it wasn't looking so good when I was ready to DNF by the second chapter. Up until then it was just dull and confusing. But then it picked up a little, started to get more interesting... And quickly trailed back to just dull and confusing.I found the characters to be pretty one-dimensional. I couldn't even tell them apart, never mind connect with any of them.It felt like the author had picked up a \"make your book diverse\" checklist and tried to tick every box. A story which could have been amazing and heart-breaking just didn't come together because so much was going on in so few pages. There was a lot of telling, very little showing and a one-voice-fits-all cast of characters. Shame.I received a copy of this for free via NetGalley for review purposes."}, {"userName": "❤️ Book Diva ❤️", "userReviewDate": "Jan 10, 2018", "userURL": "http://www.goodreads.com/user/show/69294514-book-diva", "userReview": "Although I did find the book very good, I found that the ending ended very quickly. Without giving anything away, it was a book that was hard to put down and an exciting read where you wanted to know \"What's going to happen next!\""}, {"userName": "Jeannette Nikolova", "userReviewDate": "Jul 18, 2015", "userURL": "http://www.goodreads.com/user/show/2574284-jeannette-nikolova", "userReview": "*** GIVEAWAY: You have the opportunity to win \"This Is Where It Ends\" if you enter the giveaway in the next 8 days! To learn more, click here. ***\nRead on the WondrousBooks blog.\nI'm really sad to write this review. Out of all of the books that I've ever requested on NetGalley, Everything, Everything and This Is Where It Ends were the two I was most hopeful about. I was honestly so excited to receive this book and I went through quite the disappointment reading it.The theme of the book, although not a novel one, is one which, sad as it is, has become a part and certainly a problem of our society. It's entirely too often that we hear about school shootings and it won't ever become less of a tragedy.What put me off the most about This Is Where It Ends is that the author, realizing that the theme of the book is going to touch the readers deeply, is reaching out in a very unpleasant way. I don't know about you but I really dislike writers who intentionally make themselves quotable. If your thoughts are interesting enough, the readers are going to quote them anyway. But there were too many paragraphs, especially at the end of each chapter, which felt like shameless self-promotion.Other than that, I couldn't really feel a connection to the characters. Again, there was the intentional victimization in order to make them more likable, but it just made them annoying to me. All of them would constantly whine about their sad lives way before the shooting. I especially disliked Sylv and Autumn.On the other hand we didn't really learn all that much about the characters' actual motivation. Yes, sure, we were able to read their thoughts, but WHY? Why did Tyler decide to shoot all of these people? I know that he felt alone, yadda-yadda, but what made him snap? What made him the way he was even before? Why did he start treating Autumn differently? How did he decide that this was the right thing to do for him? I didn't get any real insight into this. Everything is neatly answered, but all of the answers just seemed shallow and unrealistic.I feel like many people are afraid of giving this book its actual rating lest it be considered insensitive to all of the victims of actual school shootings. Because I sure don't think that the book was as deep and insightful as everyone makes it out to be."}, {"userName": "Diane S ☔", "userReviewDate": "Aug 26, 2015", "userURL": "http://www.goodreads.com/user/show/4159922-diane-s", "userReview": "So many school shootings, one after another, so this book is a timely one. I cared very much about these high school kids, wanted to get an understanding and wondered how the author would portray the shooter and the motivations of said perpetrator. For the most part I thought she did this very well. Narrated by four different students, inside and outside the school, aided by twitter feeds and flashbacks, we get a varied perspective as well as each of their stories. A bit overly dramatic but who am I to say. I don't know how I would react because I have never been involved in a situation such as this. I found this suspenseful, tension filled, poignant and heartfelt. My only complaint was how the police were portrayed. Don't think it would have taken them as long as it did to take action, or at least I hope not. But this is a story, so..........ARc from Netgalley."}, {"userName": "Amber Robertson", "userReviewDate": "Dec 17, 2016", "userURL": "http://www.goodreads.com/user/show/30813900-amber-robertson", "userReview": "2.5 StarsWow. I can't even formulate how I feel about this. I'm distressed. I'm disturbed. I'm also crying. I haven't cried while reading a book in a while, but here I am. A full review for this bio is impossible to write due to the fact it would be completely spoiler filled. This book, however, is a journey that has you in the edge of your seat and praying for all the characters involved. There are some missing elements to it, but for the most part it's an amazing book and I highly recommend it."}, {"userName": "Ecmel Soylu", "userReviewDate": "Jul 02, 2015", "userURL": "http://www.goodreads.com/user/show/32717688-ecmel-soylu", "userReview": "[Kitabın sonunda Tyler 30 küsür kişiyi mi ne öldürüyor ve bunlardan biri Tomas, yani Sylvia'nın abisi ve Fareed'in yakın arkadaşı. Öldüğünün gecesi ne mi oluyor? Sylvia ve Fareed dahil sağ kalan bütün öğrenciler okula geri dönüp dilek feneri yakıyorlar ölenler için. Kendi çaplarında felsefe yapmaya falan devam ediyorlar. Benim arkadaşım, abim gözümün önünde ölse uzunca bi süre depresyondan çıkamam sanırım. Bu ne ya. şldfkslşdfk  (hide spoiler)]"}, {"userName": "Carrie", "userReviewDate": "Aug 09, 2015", "userURL": "http://www.goodreads.com/user/show/36817401-carrie", "userReview": "The principal of Opportunity, Alabama's high school finishes up her speech welcoming the students to the new year. But when the principal dismisses the students to class they find that the doors are locked and then the shooting begins. This is Where it Ends tells the tale of the horror of a school shooting from four different points of view during the horrific events that take place over the course of the next fifty four minutes. Living in the U.S. this type of event happening is becoming far too common on the news so when I first read the synopsis for this story I was quite intrigued with how it would be written. What I was expecting was the book to be so full of emotion that it would end up being tough to even get through. However, I think what it lacked most was the emotional attachment that I though would be involved. As the POV changes I'd often forget who it was that was telling the story at that time. Another kind of small nuisance for me in this story was the focus on race, religion, sexual orientation in describing characters that just didn't seem to fit the situation. This seemed to just halt my attempt at connecting with the characters as human beings in a horrific situation and instead make me think there was a checklist to make sure that the high school was diverse. A bit odd to worry about the color of one's skin or sexual orientation when facing a gunman. Overall, 2.5 stars, not the emotional read I was hoping for, characters didn't seem to be fully developed personality wise, including the shooter, to get my attention and get me invested in the story."}], "description": "10:00 a.m. The principal of Opportunity High School finishes her speech, welcoming the entire student body to a new semester and encouraging them to excel and achieve.10:02 a.m. The students get up to leave the auditorium for their next class.10:03 a.m. The auditorium doors won't open.10:05 a.m. Someone starts shooting.Told from four different perspectives over the span of fifty-four harrowing minutes, terror reigns as one student’s calculated revenge turns into the ultimate game of survival.", "title": "This Is Where It Ends", "url": "http://www.goodreads.com/book/show/24529123-this-is-where-it-ends", "average": 3.65, "cover": "https://images.gr-assets.com/books/1431358364l/24529123.jpg", "reviews": 6375, "authors": [{"url": "https://www.goodreads.com/author/show/6439440.Marieke_Nijkamp", "name": "Marieke Nijkamp"}], "type": ["Young Adult", "Contemporary", "Fiction", "Realistic Fiction"], "outlinks": ["http://www.goodreads.com/book/show/24529123-this-is-where-it-ends", "http://www.goodreads.com/book/show/27906794-this-is-where-it-ends", "http://www.goodreads.com/book/show/25823344-this-is-where-it-ends", "http://www.goodreads.com/book/show/33918883-before-i-let-go", "http://www.goodreads.com/book/show/35120779-unbroken", "http://www.goodreads.com/book/show/38614483-ch-opak-kt-ry-ba-si-by-sam", "http://www.goodreads.com/book/show/31556153-feral-youth", "http://www.goodreads.com/book/show/29748943-the-radical-element", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies"]}