{"ratings": 1126, "userreviews": [{"userName": "Heather", "userReviewDate": "Jul 27, 2011", "userURL": "http://www.goodreads.com/user/show/355321-heather", "userReview": "This book was given to me after two of my friends devoured it and sang its praises from the rooftops. I was psyched to read it. Locavorism! Sustainability! Gardening! Recipes! That sounds like something I would adore!I suppose I probably would have adored it if not for two things, only one of which is the fault of this book: 1) I read it right after tearing through the Hunger Games series. I'd wager that no book could fare well with that trilogy immediately preceding it. Where I found those irresistible, I found this one irritating. That brings me to 2) The author's tone grated. At first, I was only mildly bothered, but the more I read the more annoyed I became. I think at one point I even said out loud, \"Oh, I'm SURE the grocery store was REALLY THAT CHALLENGING for you. I'm sure this is in no way a histrionic, virtuous account of what must've been just a trip to the goddamn grocery store (to buy -- I can barely type this -- tortilla chips that the author admits she could just as easily have made and DIET FUCKING COKE).\" Her use of \"scare quotes\" became \"tedious\" and \"unnecessary\" after a while, too.I absolutely agree with a number of Gussow's points (I came into this book already on her side, generally), and I freely admit that she's given me a great deal to think about (for instance, why I'm so hyperaware of eating fruit in season but far less aware of seasonality as regards vegetables). My interest in the water subsidies for California farmers, a thing about which I formerly knew nothing, is piqued. I do want to try some of her recipes. And again, I wholeheartedly agree that our food system is broken and is dire need of repair and rethinking. But dear lord, lady, if I hear one more anecdote about how you were megabitchy to the point that your friends are terrified to serve you meals or stock particular toilet paper, or find your disdain and clear sense of superiority so palpable, I'm going to scream. You've put your message in the ugliest, most sanctimonious package.And before I drive away my friends who loved this book, know that two stars means \"it was okay.\" I couldn't honestly give it the same rating (three stars -- \"it was good\") I'd given, for instance, My Life in France, which was perfectly charming and had a delightful voice, or various Sherlock Holmes stories, which I come back to again and again, or a variety of memoirs. How can this book be held against David Sedaris and get the same rating? For me, it cannot. When I look at my other two-star ratings, I know I've made the right choice for myself. I'm not mad I read it; in fact, I'm glad I did. But I'm even MORE glad that I'm DONE reading it."}, {"userName": "Kate Singh", "userReviewDate": "Apr 01, 2018", "userURL": "http://www.goodreads.com/user/show/36312215-kate-singh", "userReview": "Really enjoyed it at first. I wound up skimming the rest. It's about an older couple that buys river font property with an old home that winds up being rotten all the way to the frame. The book is the experience of tearing down and rebuilding a home and the comfort they take in the huge garden, the river they live on, and the stress of a crazy neighbor (we all must have one). I grew tired of the story after a few chapters."}, {"userName": "Stephanie", "userReviewDate": "Jan 31, 2013", "userURL": "http://www.goodreads.com/user/show/761675-stephanie", "userReview": "This book is part memoir, part essay collection with the central topic of growing food and local-based agriculture. It was published in 2001, so written likely in the late 1990’s so it was written as the local food movement was beginning to pick up steam (at least I think so). The initial chapters of the book follow Joan and her husband Alan as they build the house in Piermont, NY where they plan to live the last part of their life. The latter part of the book is a little less cohesive but loosely details her first few years living and gardening in her new space and it also becomes more treatise on the importance of farmers and of eating locally. Gussow has an engaging writing style and this is mostly a personal story – of what growing her own food means to her. She does deal with some of the larger issues in America’s agricultural system but she primarily touches on this through stories and slips it in here or there without getting too pedantic or instructional. She emphasizes again and again how eating locally/growing one’s own food not only makes ecological sense but is just more delicious and I realized that over the past few years, as I’ve grown some of my own food, I’ve embraced this fact unconsciously. I’ve never been a big fan of tomatoes until the past few years. I thought it was just my tastes changing but it has coincided very closely with me growing my own tomatoes and I really think I’ve started liking them because I now know what a real tomato tastes like! She emphasizes the superiority of this straight-from-the-garden produce with a smattering of really delicious looking recipes. In the end this book is kind of all over the place and sometimes Gussow can get a little holier than thou. Despite this the book makes a strong point and makes it in a pretty enjoyable manner."}, {"userName": "Susan Connell Biggs", "userReviewDate": "Apr 04, 2010", "userURL": "http://www.goodreads.com/user/show/1353984-susan-connell-biggs", "userReview": "While I really do love books where you get to witness other peoples' lives, this one didn't quite do it for me. There seemed to be a greater focus on the frustrations of trying to build a garden and a house where probably neither belonged than real learning about sustainable gardening. Why, if you are as committed to sustainability, build on a plot of land along a river but below the flood line? Why if you've been living in a house for 30 years that never felt like a good fit, would you not be more diligent in investigating the \"dream\" house you're about to buy? Thanks for being so candid and honest, but you lose a little credibility by being so naive in your homesteading. Also, Dye Gussow doesn't seem to understand how much she's made us care about her house and her husband, so when they fall out of the story (which isn't really a story at all) in the middle of the book, we're left feeling like the author doesn't know her audience enough to know what matters to us. The best parts of the book are the journal entries; they are beautifully written. And the recipes look intriguing. I haven't tried them, but will make some copies before returning this one to the library. I like Joan. I like her writing. I just think this book needed some focus. I'd much rather read a short article she's written or attend a lecture."}, {"userName": "Katy", "userReviewDate": "Apr 12, 2009", "userURL": "http://www.goodreads.com/user/show/1063364-katy", "userReview": "Although I did enjoy Plenty, and Animal, Vegetable, Miracle which are books with a similar themes, this is the book that really spoke to me about gardening and its importance to the health of our bodies and our planet. I want to be Joan Dye Gussow when I grow up! Given the 2001 publication date, I think this book may have been an inspiration to the previous authors in their endeavors. I like that, for Gussow, this is a way of life for her. Some years she eats all of her produce out of the garden, some years, nature has other ideas. She does the best she can without getting preachy about it. I give this book a big thumbs up and now I am headed outside to work on my garden!"}, {"userName": "Iseult", "userReviewDate": "Nov 24, 2017", "userURL": "http://www.goodreads.com/user/show/11231211-iseult", "userReview": "This book was ho-hum until I read the chapter about her drowning a possum, which is disgusting and unnecessary. She had talked of illegally trapping and setting them free in the woods before, and after drowning the poor creature found a wildlife rescuer neighbor who would take the baby skunk she trapped. I don't know why it was suddenly not an option to release the animal into the woods when you might not get fined even if someone did see you. I was weirded out the rest of the book, but I'm not really including that in the three stars. It just wasn't that interesting, especially the house renovations/building part. I knew I wouldn't be interested in that, but I didn't think it would be talked about as much as it was. I say disorganized in part because it was in no way chronological, and so oscillated between them living in their first house and thinking they would just need to renovate the existing house they bought, finding out they needed to demolish it, and living in the new house while it was still being built so I had to stop and figure out the timeline. I don't know why she would write it that way because then she needed to mention several more times about how upset she was about finding out they couldn't renovate the house but had to tear it down (I mean you'd think from the way she described it that she wouldn't have been so surprised.) And why did they choose this house knowing it would flood all the time and gardening would be so much harder? The view of the river, I suppose.Anyway, I read this book for the organic gardening/semi-self-subsistence/eating local part, and that didn't really start being discussed until toward the middle. In this part as well, there didn't seem to be a specific reason for not going chronologically. Some parts of her writing about eating locally/seasonally made my roll my eyes, like when she melodramatically described shopping at a typical supermarket as so overwhelming with choices, and how would she know what kind of tortilla chips to buy out of several varieties if the tv she doesn't own didn't tell her? She says this after stating in the beginning that her and her husband picked out all the windows, doors, etc for their house, so I doubt she can't make decisions for herself. It's especially funny because she makes gardening sound like a lot of work (I think she continued to produce around the same amount of food after her husband sadly passed away), so you'd think picking tortilla chips for a party would be no big deal (and couldn't she have made them herself anyway?)I appreciate the author because she seems to have supported healthy eating before the modern movement, and championed local eating before the term \"locavore\" came into fashion. I'm also glad to know that she can grow all these things because I live near NYC and I read \"Animal, Vegetable, Miracle\" also about local eating and growing your own food, but since that took place in Virginia, I wasn't sure of the possibilities other than the usual fare at our farmer's market. I think she mentioned she could grow kiwis, so that's interesting. But this book as a whole didn't excite me."}, {"userName": "Tammy", "userReviewDate": "Mar 17, 2018", "userURL": "http://www.goodreads.com/user/show/16778942-tammy", "userReview": "The most remarkable thing about this book, for me, was picturing my parents' house in Massachusetts while reading about the house that Joan and Alan bought along the Hudson River. I guess because my mother has always had a garden and the house they recently bought is an old farmhouse. Anyway, this is an illuminating book about a woman's quest to grow as much of her own food as she can, and an informative look at our food system. It's also interesting to learn about the adventure/drama of their \"new\" home and the struggles with living and farming in a flood zone. I had this book on my TBR list, and got the extra impetus to read it thinking I might count it toward the 2018 Read Harder Challenge task to read a book with a female protagonist over the age of 60. I will probably use a fictional book for the task; however, I will say that Joan is a 60+ female who has a lot of interesting things to say, and who is someone I admire. I will hold on to this book in case I ever leave the Southwest and end up with a yard in New England some day..."}, {"userName": "Jennifer", "userReviewDate": "Sep 03, 2017", "userURL": "http://www.goodreads.com/user/show/1788274-jennifer", "userReview": "The dust jacket copy promises that Gussow presents \"a version of The Good Life that is with the grasp of all of us.\" This is not true. Gussow's efforts to make sure she and her husband eat only the vegetables that they grow and that there is a large variety of said vegetables takes an amount of work that most of would not or could not commit to given our circumstances and nature. What is true is that Gussow's gardens are amazing, prolific, and surprisingly varied, as are her efforts to preserve the fruits and vegetables she manages to produce. Expanding her diet in winter means experimenting with different growing and storage methods, some of which fly in the face of common sense but work out in the end.I am inherently too lazy to be a gardener, yet I admire the effort Gussow takes to build a better diet for her and her family, friends, and community. Her memoir of her garden is one that leads naturally to contemplating our own diet and what impact it has on our health and our world."}, {"userName": "Sara", "userReviewDate": "Jun 05, 2018", "userURL": "http://www.goodreads.com/user/show/795600-sara", "userReview": "I think if I had read this book before reading Animal, Vegetable, Miracle by Barbara Kingsolver it would have had a bigger impact on me than it did today. While I enjoyed it, and can see why Joan is considered a matriarch of the local food movement, I still had many moments where I questioned certain choices she made. Perhaps it's because I've lately been studying permaculture, but her chapter on dealing with gardening pests seemed almost completely self inflicted. Planting companion plants to bring in beneficial bugs and/or adopting a cat to help take care of rodents could have solved many of her problems. Aside from being nitpicky about techniques though, it was yet another read that reinforces the unsustainability of our current food system and gives inspiration to those of us looking to become more self sufficient."}, {"userName": "Jennifer Warren", "userReviewDate": "Jun 13, 2017", "userURL": "http://www.goodreads.com/user/show/68082566-jennifer-warren", "userReview": "Inspiring. Good gardening tips, realistic descriptions of actual gardening, good recopes"}, {"userName": "Shannon", "userReviewDate": "Mar 10, 2017", "userURL": "http://www.goodreads.com/user/show/4471689-shannon", "userReview": "What a great book. I randomly ordered this book as it was a \"you may also enjoy\" title and I am so happy I did. As a gardener in the same area as Joan Dye Gussow, I related to much of what she talked about. I also had a lot of \"ah ha\" moments in regards to eating local and growing your own food. It just all make sense and I am so happy I have a little urban homestead here in NJ. I can't wait to read other's written by her and dive into some of the book's she referenced. For anyone that truly cares about where their food comes from, this is a great read for you! #shanmullphoto #mayernikkitchen"}, {"userName": "jess", "userReviewDate": "Apr 27, 2010", "userURL": "http://www.goodreads.com/user/show/670054-jess", "userReview": "I've been making an effort to reach back farther than Michael Pollan and the new \"locavore\" movement when I'm thinking about our food sources, nutrition, food production, and that brings me to people like Joan Gussow. Speaking of, Michael Pollan writes: the national conversation unfolding around the subject of food and farming really began in the 1970s, with the work of writers like Wendell Berry, Frances Moore Lappé, Barry Commoner and Joan Gussow. All four of these writers are supreme dot-connectors, deeply skeptical of reductive science and far ahead not only in their grasp of the science of ecology but in their ability to think ecologically. The book is part nutrition guide, but it is subtle. It's just there because Joan's a nutritionist and probably can't help it. There are recipes buried in the chapters, focused on the precise moment in the garden and suspended in a lovely web of Joan's life experiences. This book is part gardening know-how, which is almost entirely anecdotal, wise and heartfelt. There is a lot of great information about eating locally year round from a lady who has done it for many years. How to store carrots is easy to learn. But how to cook parsnips so you will love them in the long dark days of winter when parsnips are about the only thing left to eat, that requires a special kind genius. This book is part political agenda - and everything she says makes the most perfect sense. Sarah Palin needs to stop using the phrase \"common sense conservative\" entirely because Joan Gussow has cornered the market on rational conservation. Treat every drop of water like it matters - because it does. Treat everything you put in the earth like it's going to come back to you - because it will. Joan Dye Gussow moved to small town exurb NY, within an uneasy commuting distance from NYC. After decades in a house she never really loved, she & her husband bought an old house in a nearby town with the intention of repairing the house and establishing a garden that would see them into their golden years. This story starts with the discovery of that house, and then follows Joan through all the contractors, river rats, architects, fellow gardeners and friends. The house has to be demolished and rebuilt, but the garden flourishes. Gardening is contagious, and Joan & her husband find themselves mentoring a community garden in the lot next door. Her husband is diagnosed with an aggressive cancer, and leaves her just at the time when they were supposed to spend their final decades together. It's a stark reminder that every day should be a celebration of the work you do together and the love you share. I read the part about his death on an airplane somewhere over the middle of the country somewhere in the middle of the night in an unknown time zone and I wept the whole body weeping only a premenstrual newlywed can manage. The hum of the jet engines thankfully drowned out my tears. This Organic Life moves through the years, the geography, the seasons of the garden and the seasons of life like it is all one, beautifully intertwined story. Because, of course, it is."}, {"userName": "R.T. Payne", "userReviewDate": "Apr 04, 2014", "userURL": "http://www.goodreads.com/user/show/29681826-r-t-payne", "userReview": "Before there was \"Animal, Vegetable, Miracle,\" before there was \"The Omnivore's Dilemma,\" I was lucky enough to stumble across \"This Organic Life.\" (Or maybe my sister gave it to me? It's all an early-20's blur.) It was a great read, but more importantly, it was an eye-opener. Joan Dye Gussow taught me how to make parsnip pancakes, and that you can actually grow sweet potatoes in Zone 8, and that there are times when being a total pain in the butt in the grocery store is justified for the sake of future generations. I read it back when I worked in the miserable pre-career purgatory known as Customer Service, and my empathy for the non-empowered front-liners was boundless. So I didn't yell or preach. But I did make a habit of asking as sweetly as possible, \"Where are these apples from? Oh, they're from New Zealand? Any idea why you're selling New Zealand apples when there are zillions of apples grown right here in Washington?\" It was empowering. It was exhilarating. I was making a difference, dammit! I imagined Joan standing beside my shopping cart, egging me on.Just a decade later, grocery stores go out of their way to celebrate Washington produce. Local farmers build fan bases like rock stars. Farmers markets have blossomed in my area, not only providing produce grown right over the fence from own backyards, but building community in ways that go far beyond shopping, cooking and eating. I think \"This Organic Life\" deserves credit as an instigator of this change. There were many \"back to the land\" books written earlier, especially in the 60's, (and I read several of them because Joan points back to them in her book). But I'm pretty sure \"This Organic Life\" was an inspiration for \"Animal, Vegetable, Miracle\" -- Barbara Kingsolver obviously loved it, and her blurb is on the front cover of my copy. And that book, along with Michael Pollan's, really ignited the \"Locovore\" movement. These days, we're all grocery shopping on the shoulders of literary giants.A life story as well as a locavore manifesto, the book is a bit quirky, plotwise. There's a section about demolishing and rebuilding an old house that could fairly be called \"a gigantic tangent.\" It's definitely not a straightforward journey from A to B. But it's full of down-to-earth advice on cooking and gardening you can pounce on and use right away, as well as thoughtful musings on the larger issues in contemporary agriculture that will stay with you for a long time. (My favorite is the chapter that unflinchingly explores agriculture's human and animal death toll.)As with other gardening books, I'd recommend reading \"This Organic Life\" in late winter or early spring. It's frustrating to find gardening tips you could have used, if only you'd read it a month earlier."}, {"userName": "Jessica", "userReviewDate": "May 01, 2011", "userURL": "http://www.goodreads.com/user/show/86946-jessica", "userReview": "I hadn't heard of This Organic Life before receiving it as a Christmas gift from my sister, but it proved to be a delightful work of garden-inspired thoughts on diet, life, and responsibility. I've already read a number of books in this genre (notably Deep in the Green and Home Ground) but this one took a much more overtly environmental stance than the others, which tend to focus more on the joy of gardening while only brushing against the cultural and societal significance of producing one's own food.Dr. Gussow's main argument is that we are killing our planet by choosing to consume foods shipped halfway across the world and completely out of season, instead of producing our own food and supporting local farmers. She is most convincing and convicting, and the synchronicity of picking up this book right around the same time I discovered King's Hill Farm helped me decide to sign up for their community-supported agriculture program. We'll be eating lots of locally grown produce now, for cheaper than we'd pay to buy it (imported from all parts of the world) at the grocery store.The only part of the book I found disappointing was her section on meat-eating, which she seems to justify entirely based on the fact that death is part of life, as if the fact that she has to kill the occasional groundhog or rabbit to keep them from ruining her crop supply means that it logically follows that eating animals (and not the ones she's killed, either, which she disposes of, but cattle and chickens raised by other people) is necessary. She doesn't even acknowledge the possibility that one can be vegetarian for environmental and ethical reasons and still agree that killing, when done responsibly and respectfully, is okay and maybe even required at times. Her section on why she eats meat is very short and dismissive, and I felt it really wasn't in keeping with the rest of the book, which is extremely well thought-out and sensitive. It seems as if she would rather skip over the topic entirely but knew people would expect her to explain her choice one way or the other.As I said, though, that's really the book's only flaw. The rest of the text is a very compelling argument for growing one's own food and eating seasonally, as well as a joyful celebration of the act of gardening. It's the combination of the two - purpose and delight - that makes This Organic Life work so well.Oh, and it's full of recipes, too."}, {"userName": "Penny", "userReviewDate": "Feb 17, 2017", "userURL": "http://www.goodreads.com/user/show/1126426-penny", "userReview": "I've read this three times now as I really enjoy the story of the garden and the house, with Ms. Gussow's wisdom on food and nutrition as a bonus."}, {"userName": "Ami", "userReviewDate": "Nov 28, 2010", "userURL": "http://www.goodreads.com/user/show/2281833-ami", "userReview": "The beginning chapters of \"This Organic Life\" are a combination of a memoir, a gardening how-to reference, and a cookbook. All of these elements were well written in a random, delightful, meandering manner that made the book exciting and interesting to read. I thought to myself, \"What fun it is to read how this woman learned to garden organically and how she moved a million plants and trees to a new house that she and her husband were remodeling. And that recipe looks delicious. I must try it. Oooooh, what a nice tip about storing sweet potatoes, I definitely need to remember this advice.\" (Disclaimer: this isn't the exact thought process that occurred in my head, but you get the general gist of my thinking.)Then suddenly, half-way through the book, everything dissolved into a polite lecturing tirade concerning the environment and petroleum usage; without much mention of my two favorite characters in the book (the husband sadly passed away and the new house is literarily abandoned). I realize that environmental concerns and politics are the driving force behind why this author chooses to garden and provide her own vegetables. Of course, I expect her arguments and urgings to be in the book. Yet, everything became unbalanced and lopsided. Instead of delighting in the book, I finished it out of obligation and a hope that things would return to the way it was in the beginning. Sadly it didn't."}, {"userName": "Melissa", "userReviewDate": "Aug 03, 2008", "userURL": "http://www.goodreads.com/user/show/260860-melissa", "userReview": "Take my five stars with a grain of salt as I am an aspiring organic gardener/foodie/locavore/econerd. Reading this brings me back to the realization I have such a looooong way to go. I love Gussow's earthiness, common sense, frugality and her complete lack of concern over what others think of her. Gussow is refreshing in that she does not claim (as many other environmentalists do) that giving up meat entirely will save our planet. She suggests instead that eating MUCH less meat and making sure our animals are treated humanely and raised sustainably would be a realistic solution. I'm not saying its bad to be a vegetarian, but do you REALLY think most Americans would go vegetarian? I'm just sayin' folks! Her main points: we must grow as much of our own food as possible and/or buy from local farmers, we need to eat with the seasons what can be grown locally and stop importing food, we must get over the \"I will have whatever I want, whenever I want it\" mindset, we must stop wasting our resources (soil, water, organic materials to make compost, etc.) and be better at making do with what we have, and that we should employ organic methods of gardening and farming. Definitely some good goals to slowly work toward. Although, she makes her points much more eloquently than I and frequently makes her case with the superior taste of a warm, just picked strawberry, peach, blackberry or tomato. I can't argue with that! There are also some interesting recipes included."}, {"userName": "Ellen Bell", "userReviewDate": "Dec 01, 2013", "userURL": "http://www.goodreads.com/user/show/17596587-ellen-bell", "userReview": "This book is a memoir chronicling ten or so years of of a nutritionist/local food advocate's life during which she and her husband move, start a new garden, build a new home, and begin a community garden in their new city. The book rambles a lot, getting off topic and then back on again. Nearly the first half of the book is devoted to the tale of Gussow's and her husband's purchase of an old home they attempt to restore, only to find out it must be torn down due to structural deficiencies. This story seemed to go on and on, without any real point relating back to her life as an advocate of the local food movement. It wasn't until the last half or so of the book that I really began to feel like I was getting to know Gussow and understand what she was all about. She made some interesting arguments and points about the real cost of food, the relationship between death and food production (regardless of whether you're a vegetarian or meat eater!), and the relationship of society to agriculture in terms that the field of economics is unable to explain or understand. She makes a compelling argument for eating locally and, more importantly, understanding all the reasons why one ought to do so. But, in the end, I found this book to be more of a chore than a joy to read, primarily because of all the tangents relating to her new home adventure."}, {"userName": "Joseph", "userReviewDate": "Jun 14, 2013", "userURL": "http://www.goodreads.com/user/show/5095190-joseph", "userReview": "unlike the listing, this book is 261 pages.a very earnest book. the author is an advocate of local eating, and she uses this book to explore what it means to eat and live locally. well, mostly. she makes a lot of good points about the connectedness of farming to eating and the health of the planet to both, but at times can come across as preachy, which she freely admits in on section of the book.nevertheless, i had a hard time putting this book down. i think it would have been valuable to have a sketch of her property, as it was a bit difficult imagining her homestead, but she does give very vivid detail of her home and garden.the one concern i had was the same paradox i find with most environmentalists concerned with climate change (as i am), and that is the tendency to still trave, presumably by jet, around the country and world. going to a conference in Norway doesn't sound feasible to me if you're concerned about your carbon footprint, and a tad hypocritical. she also likes to point out her accomplishments serving on such and such committee or whatever. it's the way she writes about it that seems smug and self-righteous.still, i recommend this book. read it, then go garden and pick up Barbara Kingsolver's Animal, Vegetable, Miracle."}, {"userName": "Amy", "userReviewDate": "Nov 07, 2007", "userURL": "http://www.goodreads.com/user/show/188144-amy", "userReview": "At first I was mainly astounded by the series of incredibly poor decisions this grown couple made, which led them to buy a very expensive house that regularly flooded, was structurally extremely unsound--this was actually visible to the naked eye--yadda yadda yadda. But the garden they planted (before closing) kept them going. Eh, that was a little worrisome/annoying to me as a reader.Joan grew on me, though. Like a friend who keeps dating train wrecks and you eventually sigh and tell yourself, \"Stop acting as though logic is in play here,\" I had to give up on worrying about the flood-prone ruin of a house and piece of land the couple bought, and stop nervously awaiting the death of someone important to the story, and just try to enjoy the author's striking and astounding obsession with growing produce. She eventually convinced me as a reader that she really does understand that not everyone has the time, knowledge, or land to grow all of their own produce. But she also convinced me that it's imperative that we change our thinking about food sources, growing methods, farmers, and consumption, because the variety, flavor, safety, and supply of our US-produced food are all taking a nosedive."}, {"userName": "Jessie", "userReviewDate": "Nov 16, 2015", "userURL": "http://www.goodreads.com/user/show/781083-jessie", "userReview": "This book was recommended and lent to me by a friend so I felt compelled to read it cover to cover as soon as possible, which is really the only way I managed to get through it. The author's stream of consciousness writing style is highly annoying and frustrating to me. I had to re-read several passages to figure out the timeline of her stories or what she was talking about. At times, she jumps topics without any warning.I'm not really sure what the point of the book was - but it covers a lot of interesting information about growing your own garden, providing your own food, living on a river in a small town, renovating an old house, dealing with frustrations, farming, and the future of food in the United States. I live in a city apartment so I was under no illusions starting out that this book would \"inspire me to grow my own food\" - but, honestly, even if I lived somewhere with a lot of acreage, I'd now be less inspired to garden than more. The litany of hardships for personal gardening on a large scale far outweigh the emphasis on any positive benefits of this activity. All in all, this book reminded me a lot of \"A Year in Provence\" - but not as entertaining to read."}, {"userName": "Happyreader", "userReviewDate": "Aug 19, 2010", "userURL": "http://www.goodreads.com/user/show/901783-happyreader", "userReview": "A charming and radical book of an old-school nutritionist trying to live out her food ethics. For those who love gardening, home planning, and cooking, you’ll enjoy the charming tale of her building her dream produce garden and dream home (in that order) and the useful gardening and cooking tips. For those of a more progressive bent, you’ll enjoy her cutting edge thinking on local food, food supply issues, and environmental management. What’s really noteworthy is that she manages, for the most part, to avoid the self-righteous and shrill tone of some other books in this genre. She does an especially good job of this in “What a Sacrifice” where she thoughtfully delineates the benefits of home cooking and using local ingredients, going beyond the merely economic to the social and soulful benefits, while also acknowledging that she sometimes needs to rein herself in since some people simply aren’t ready for what she’s espousing. I found her and the book inspiring and am really looking forward to reading her latest book Growing Older when it comes out."}, {"userName": "Stacy", "userReviewDate": "Feb 02, 2011", "userURL": "http://www.goodreads.com/user/show/2360394-stacy", "userReview": "Reminiscent of \"Animal Vegetable Miracle\", this is a memoir of a retired professor and her efforts over the years to be self-reliant and raise her own vegetables and fruit. An average writer, I feel like Gussow spends too much time talking about how hard it was working on her old Victorian home, and later on the decrepit home she buys on the bank of the Hudson river. There are some recipes scattered through out, somewhat randomly rather than being strongly incorporated into the text. More than anything, I wish there was more how to homestead. But I liked her emphasis on how each region needs to support local farmers, raise their own food if necessary, acknowledge the power of nature and our dependence on her, and to give up some imported luxuries in favor of sustainable local foods. This may mean the rest of the nation besides Florida and California goes without oranges, and we all go without bananas, but eventually something is going to give in our current indulgent agricultural lifestyle.Like Barbara Kingsolver, this author comes across as a bit overbearing/self-righteous, but I admire what's she's trying to accomplish in encouraging sustainable agriculture in the northwest."}, {"userName": "Amanda", "userReviewDate": "Feb 11, 2015", "userURL": "http://www.goodreads.com/user/show/38181640-amanda", "userReview": "Organic, yes. Suburban, yes. Homesteading? Depends on your definition. As for confessions, there are some. About half of the book is comprised of anecdotes about the trials of gardening in two totally different soils (one perfected over the course of 34 years, one clayey and flood-prone), into old age, against the wishes of meddlesome neighbors, and through the death of her husband. The “confessions” delve toward the end into more of a rant. Mrs. Gussow is entitled to rant on the topics that she does (relocalization of American agriculture, the welfare of farmers, the effect of climate change on food production, etc.) because she is something of an expert in these areas and her complaints are quite real.She has a lot to say, from direct experience in most cases, about feeding yourself from your own land, local and seasonal eating, GMOs, water shortages, and the systemic problems with America's food supply today.[Note: This review was excerpted from a post on my blog. You can read the whole thing here.]"}, {"userName": "Molly", "userReviewDate": "Nov 27, 2007", "userURL": "http://www.goodreads.com/user/show/391301-molly", "userReview": "I read this third in a mini-series (of my own determination) of books on eating locally, responsibly and sustainably. What started with Plenty, lead to Animal, Vegetable, Miracle and finally here. This, published in 2001, was the first chronologically, and given that Barbara Kingsolver is quoted on the cover was obviously influential for at least one of the others. That being said, this is definitely the weightier of the three. Speaking of the information, it must be rated as outstanding. Obviously the author knows what she is talking about and her publishing track record on this topic is clear. But, and maybe you can tell this from the rather technical feel of my review, it didn't read as lyrically as either Plenty or AVM. So, this gets a 4, great read for those interested in eating locally and growing your own food (its full of potential pitfalls, tremendous successes and some rather delicious sounding recipes!) but it suffers- really through no fault of its own- having been read after Kingsolver's stellar work."}, {"userName": "Lisa", "userReviewDate": "Sep 01, 2011", "userURL": "http://www.goodreads.com/user/show/916015-lisa", "userReview": "I started her other book first....which follows this story, and I was intrigued enough by that one to read this one before I finished that one. They are written in the same flavor, both of them enjoyable to me because eating local and gardening are becoming more and more important to me as time goes on. This one has recipes for the produce she reaps from her garden and I was sure to bookmark those. She also spurned me on to freeze fresh veggies from the garden because I can't tell you how many times I have thrown away fresh produce from my garden or CSA. Today I froze two meals worth of fresh green beans that I couldn't have possibly made myself eat! Baby steps. When she talks about what it feels like to walk into a grocery store I could totally relate...it is the exact same for me....being surrounded by bad food is suffocating. And wrong. I also ordered several books that she mentioned on gardening."}, {"userName": "Brian", "userReviewDate": "Sep 20, 2011", "userURL": "http://www.goodreads.com/user/show/1237367-brian", "userReview": "I read this book because I'm interested in what the author claims to be doing: homesteading in a non-rural setting. She presents some very good information on growing your own produce, and the trials that are faced in doing so. She seems to do an admirable job in producing fruit and vegetables on her suburban flood-prone plot, but it's a little hard to pick out the good information from the surrounding confessions! These confessions give a memoir-like tone to the book. There's a bitter undercurrent to the narrative which becomes a drag to push through. It's an understandable bitterness, what with the personal hardships touched upon in the book. The through-line weaves and wanders, jumping from current thoughts to loosely related journal entries written years earlier. Like I said, though, there is some great information, and a good presentation of someone trying to make a difference through her own life for the future world."}, {"userName": "Elaine", "userReviewDate": "Mar 26, 2013", "userURL": "http://www.goodreads.com/user/show/9225232-elaine", "userReview": "I didn't find this very engaging at all, but there were some tidbits of practical, experience-based advice on growing your own food, based on lessons-learned by the author. It's basically memoir of the author's life as they buy a riverside plot of land next to the Hudson River and deal with the frustrations and challenges of turning it into a productive homestead to supply all their vegetable/fruit needs, and while some of it was interesting, it didn't hold my attention. I did find it inspiring that she was able to produce her own food, and save enough for the cold season, so it IS possible in this day and age, in this climate (of course, this is what all the early settlers to survive), but also discouraging in how many setbacks and challenges they faced. Maybe I'll try to read it again when I'm more in the mood for an autobiography."}, {"userName": "Kristen", "userReviewDate": "Dec 28, 2010", "userURL": "http://www.goodreads.com/user/show/1634760-kristen", "userReview": "If you are interested in eating locally and/or growing and/or producing your own food and you haven't already read it, I would recommend Barbara Kingsolver's \"Animal, Vegetable, Miracle\" because it is better written than this book.That being said, this book contains more information about local food, sustainability, the environment, our food system, etc. Although much of the information is interesting and I agree with most of her views, it was a chore to read through much of the book (her writing-style is difficult), and Gussow definitely has a \"preachy\" tone. Also, the part about gutting, demolishing, and rebuilding their newly-purchased home didn't really seem to fit in with the rest of the book.I will definitely try some of the recipes, and having learned that she managed to grow sweet potatoes in New York, I plan on trying to grow them in my garden this summer."}, {"userName": "Sarah", "userReviewDate": "Mar 04, 2009", "userURL": "http://www.goodreads.com/user/show/1246122-sarah", "userReview": "I picked up this book because I am interested in organic gardening to support my family with home-grown food and because I'm taking a creative non-fiction writing class that encompasses the memoir.This book was really interesting, though Joan does get a little preachy about the environment now and then. This book is not only enjoyable (especially if you like to read about someone else's garden) but it helps you think about issues on eating locally, the vital role of local farmers, and the importance of growing and eating your own food. While the author is highly biased, she has a long life of experience with growing food and thinking through those previously mentioned issues. Not only that, but she inserts her own recipes here and there that all look mouth-watering! A fascinating read and I plan on buying this book."}], "description": "Joan Dye Gussow is an extraordinarily ordinary woman. She lives in a home not unlike the average home in a neighborhood that is, more or less, typically suburban. What sets her apart from the rest of us is that she thinks more deeply - and in more eloquent detail- about food. In sharing her ponderings, she sets a delightful example for those of us who seek the healthiest, most pleasurable lifestyle within an environment determined to propel us in the opposite direct. Joan is a suburbanite with a green thumb, but also a feisty, defiant spirit with a relentlessly positive outlook.This Organic Life begins with Joan and her husband Alan's trials and tribulations growing vegetables for their own table while coping with careers and a sprawling Victorian house in Congers, New York. Motivated to go \"off -the-grid\" of the global food system in their later years, the Gussows find and fall in love with a dilapidated Odd Fellows Hall on the banks of the Hudson River. Joan's often hilarious accounts of the \"renovation\" of the \"dream\" (some would say \"nightmare\") house and the creation of their new gardens are spiced by extracts from her own journal, and over thirty wonderful recipes using fresh, seasonal fruits and vegetables.There is also an occasion pontification about a food distribution system run amok! At the heart of This Organic Life is the premise that locally grown food eaten in season makes sense economically, ecologically, and gastronomically. Transporting produce to New York from California -- not to mention Central and South America, Australia, or Europe -- consumes more energy in transit than it yields in calories. (It costs 435 fossil fuel calories to fly a 5-calorie strawberry from California to New York.) Add in the deleterious effects of agribusiness, such as the endless cycle of pesticide, herbicide, and chemical fertilizers; the loss of topsoil from erosion of over-tilled croplands; depleted aquifers and soil salinization from over-irrigation; and the arguments in favor of \"this organic life\" become overwhelmingly convincing.", "title": "This Organic Life: Confessions of a Suburban Homesteader", "url": "http://www.goodreads.com/book/show/77141.This_Organic_Life", "average": 3.94, "cover": "https://images.gr-assets.com/books/1385445894l/77141.jpg", "reviews": 145, "authors": [{"url": "https://www.goodreads.com/author/show/43774.Joan_Dye_Gussow", "name": "Joan Dye Gussow"}], "type": ["Gardening", "Food and Drink", "Nonfiction", "Autobiography", "Environment"], "outlinks": ["http://www.goodreads.com/book/show/77141.This_Organic_Life", "http://www.goodreads.com/book/show/438139.This_Organic_Life", "http://www.goodreads.com/book/show/8380007-growing-older", "http://www.goodreads.com/book/show/77140.Chicken_Little_Tomato_Sauce_and_Agriculture", "http://www.goodreads.com/book/show/9642172-an-organic-lifeeating-for-your-health-and-the-planet-s", "http://www.goodreads.com/book/show/1157042.The_Feeding_Web", "http://www.goodreads.com/book/show/1157045.The_Nutrition_Debate"]}