{"ratings": 708, "userreviews": [{"userName": "Dana Kenedy (Dana and the Books)", "userReviewDate": "Nov 04, 2015", "userURL": "http://www.goodreads.com/user/show/372001-dana-kenedy-dana-and-the-books", "userReview": "This review can also be found on my blog, Dana and the Books.This Secret We're Keeping is a student/teacher romance done right!The story is told with two narratives: Matthew's POV in 1993 (the teacher) and then Jess's story (the student) in the present time.  We get to see how the relationship came to be, the scandal surrounding out, and the emotional turmoil when they meet once again seventeen years later.It's definitely a character driven story and thankfully the characters were wonderfully fleshed out (even Jess's dog felt real!).  With superb characterization, the POV shift flowed smoothly from chapter to chapter and I never once felt disjointed within the narrative.Student/teacher relationship novels are often side-eyed, but Rebecca Done did it wonderfully.  She took a taboo topic that could have been so sleazy if in the hands of a lesser author and made it into a fantastic story.  She didn't romanticize anything; it was wrong, it was illegal.At nearly 500 pages, I felt it was just teensy bit long for what the story needed—a good 25 to 50 pages could have been cut and the story would be as good.However my little nit pick should not put you off whatsoever, this is a fantastic contemporary read and definitely worthy of a few hours of your time!This Secret We're Keeping is Rebecca Done's debut novel and I am so excited to see what her next book will bring!Thanks to Michael Joseph (Penguin UK) for providing me with a copy from NetGalley!(Amazon CA / Indigo / Book Depository)"}, {"userName": "Jules", "userReviewDate": "Dec 24, 2015", "userURL": "http://www.goodreads.com/user/show/4824134-jules", "userReview": "The Secret We’re Keeping is an emotional and heart-breaking tale of forbidden love. This book is about a relationship that develops between a teacher and one of his fifteen year old pupils. Before reading it, I was a little cautious about it. There are so many potential things that could have made me dislike this book, but almost instantly I fell in love with this story. I loved the style it was written in, the way it moved back and forth between the 1990s and present day, filling the reader in on what happened back then, and how that impacted on the two main characters over the years. Which leads me onto those characters. What great characters, very likeable and well-developed. It was impossible not to get emotionally involved in their lives, both past and present.I couldn’t put this book down, didn’t want it to end, and oh my goodness, my heart and mind still haven’t quite worked out what to do with the ending. Such an emotional roller coaster that even brought tears to my eyes on more than one occasion.If you enjoy character driven novels about controversial romance, with some suspense and a lot of emotion, then this is probably the book for you.I would like to thank the publisher, Penguin UK (Michael Joseph) for allowing me a copy of this book via Netgalley in exchange for an honest review."}, {"userName": "Paromjit", "userReviewDate": "Feb 23, 2016", "userURL": "http://www.goodreads.com/user/show/38610813-paromjit", "userReview": "This is an emotional roller coaster of a story which I adored. It is a character driven novel, and the author has created two superb and realistic characters and developed them well. The relationship between the two of them is seen through the lens of two time periods. The two of them have an intense, deep and emotionally involving affair. Matthew as a teacher goes to prison for having a relationship with 15 year old Jess. 17 years later, Matthew has a new identity, Will, when the two of them meet again. They are drawn to each other again despite their fraught history. The author is adept at handling feelings and emotions with real skill. A book which I very much got absorbed in and carried along with the intricacies in the relationship between the two main characters. Many thanks to Michael Joseph, the publishers for a copy of the book via the goodreads giveaways."}, {"userName": "Julian Lees", "userReviewDate": "Mar 23, 2016", "userURL": "http://www.goodreads.com/user/show/4286332-julian-lees", "userReview": "I am torn. Don't get me wrong, this is a very well written book but the story of Matthew (a teacher) having an affair with his fifteen year old student left me feeling morally and emotionally drained.This is a book that would not have been published if written by a man methinks."}, {"userName": "Chiara Cilli", "userReviewDate": "Dec 11, 2016", "userURL": "http://www.goodreads.com/user/show/10589022-chiara-cilli", "userReview": "Una storia ricca di mistero e pathos, imperdibile!MOST ANTICIPATED BOOK OF 2016Fin dal primo momento in cui ho saputo che Piemme avrebbe questo libro sapevo che mi sarebbe piaciuto da impazzire. Pur essendo etichettato come Thriller dalla CE italiana, è lampante che invece ci troviamo di fronte a un Forbidden Romance in piena regola, con l'aggiunta di un pizzico di Mistery che non guasta di certo! Conoscevo bene l'opinione delle lettrici italiane, dopo l'uscita del romanzo, ma ciò non mi ha dissuaso dall'acquistarlo — e ne sono estremamente felice! Quando respiro aria di Must Read, è raro che sbagli ;)E questo romanzo ha confermato tutte le mie aspettative. Anzi, direi che le ha superate!Questa è la storia di Jessica e Matthew, che diciassette anni prima erano rispettivamente studentessa quindicenne e insegnante. Io ho una passione esagerata per le relazioni proibite tra i banchi di scuola, se vanno come devono andare — e in questo libro ho letteralmente perso la testa!Abbiamo due diversi PoV: quello di Jess, in terza persona, nel presente e quello di Matthew, in prima persona, nel passato. Uno stile che ho già incontrato e che non mi è dispiaciuto affatto (:Il legame tra i due personaggi mi è entrato sotto la pelle. È immenso, lo percepiamo immediatamente, e ti trascina giù, giù, giù. I N E S O R A B I L M E N T E. Scoprire come un sentimento così forte sia rimasto assolutamente intatto, potente, anche dopo diciassette anni, mi ha sconvolto nel profondo.\n «Ti penso molto più di quel che dovrei» confessò Will e le sue parole risuonarono nel silenzio della stanza. Ma, prima che lei facesse in tempo a rispondere Ti penso anch'io, lui avanzò di un passo, le prese il volto tra le mani e la baciò con trasporto. Jess sentì il cuore gonfiarsi dell'impetuosa passione che un tempo le era così familiare. E non c'erano esitazioni, questa volta, nessun permesso da attendere, nessuna delicata esplorazione preleminare: in un istante aveva la sua lingua in bocca, il suo corpo addosso. Il sapore di lui era caldo, inebriante. Fecero insieme qualche passo barcollante, finché Jess non si ritrovò la schiena contro il guardaroba. Will la stringeva per le spalle, baciandola con un trasporto sempre maggiore, premendo su di lei. «Sei tu» mormorò. Quelle parole morirono sulle labbra di lei. «Sei stata sempre e solo tu.»Più andavo avanti con la lettura, più agognavo di sapere di più. Ogni più piccolo segreto. Più i due protagonisti si spingevano oltre, più la tensione cresceva in me e ticchettava come un ordigno che sapevo sarebbe esploso.E quando è successo non ero decisamente preparata.Quante volte ho chiuso il libro gridando: «Nooo!».Quante volte ho insultato i personaggi secondari o chiunque cercasse di ostacolare l'amore tra Jess e Matthew.Oh, Matthew. L'ho amato, dico davvero. Un uomo vero, non stereotipato, comune. Un uomo pieno di debolezze e insicurezze. Un uomo che non ha colpe, se non quella di amare la sua anima gemella con tutto se stesso, anno dopo anno.Le arringhe finali di questo ROMANZO FANTASTICO mi hanno fatto ribollire di rabbia e salire l'istinto omicida a livelli stellari. C'è stato un momento in cui il dolore di questi due amanti condannati mi ha pugnalato dritto al cuore, facendomi commuovere per la sua intensità.E poi... poi.Il finale.Un ultimo rigo per lettori che vanno controcorrente, che esigono qualcosa di diverso dalla massa, che non vogliono essere tenuti per mano fino alla fine, che vogliono proseguire da soli, perché immaginare è una cosa meravigliosa che pochi sanno fare.ÈassolutamentePERFETTO.I miei più sinceri complimenti a Rebecca Done per questo suo ESORDIO SENSAZIONALE. Non vedo l'ora di leggere un'altra sua opera!✤ Leggi la recensione sul blog ✤★ \nCOMPRA ORA CON 1-CLICK\n ★|| Facebook || Twitter || Pinterest ||"}, {"userName": "Daphne Sharpe", "userReviewDate": "Jan 02, 2016", "userURL": "http://www.goodreads.com/user/show/49771641-daphne-sharpe", "userReview": "This debut novel is a very emotional and thought provoking read. As I read this book I was constantly reminding myself that Jess was a child, aged 15, yet she made all the moves and was the strongest character in the book. Was it true love , infatuation or just a 25 year old teacher taking advantage of a vulnerable girl? Jess had a mother who was too heavily dependent upon drugs and drink to pay her any attention and Matthew was the one person she spoke to who listened to her.Matthew Langley is a 25 year old teacher at a girls school in Norfolk, Jessica is a 15 year old pupil. Their love affair led to scandal, arrest and imprisonment. 17 years later Matthew is back in Norfolk. He is now known as Will, has a daughter Charlotte and a girlfriend Natalie. Jess is a self employed caterer and still living in Norfolk with an on/ off boyfriend Zak, who wants her to move to London with him where he works as an A and E consultant .Matthew and Jess become reacquainted when she steps out in front of his car and he knocks her over. Old memories of their love affair are rekindled and gradually devastating secrets, acts of betrayal and heartache are revealed. This is a well written book full of empathy and reminds us all how tricky love is and how teenage daughters need loads of love and support in this arena. I can see this book being filmed as it is in the same genre as Gone Girl and the book would make a perfect gift for your daughters."}, {"userName": "Kindling Micky ", "userReviewDate": "Jan 15, 2016", "userURL": "http://www.goodreads.com/user/show/18967379-kindling-micky", "userReview": "The blurb and premise for this book really attracted me to it. The idea of a student/teacher situation decades on was an interesting concept. There's a thread of tragedy sliced with a little hope running right through this book but you dread an impending car crash situation.Jess was the seducer at 15 years old. Matthew was the weak, misguided and prosecuted maths teacher. Decades have passed, names have been changed and secrets are the name of the game. Clearly the context of this book makes for a tense but also a discomforting read. I felt my moral and ethical compass piqued and questioned by the black, white and grey of the issues narrated.When all was finished I had mixed feelings about the characters. Jess, years later is weak and people seem to walk over her, which was a departure from the Jess in adolescence. Clearly, she was marked by the events of the past. Matthew/Will was flaky, unrestrained in his emotions and willing to hurt those around him. I felt angry towards the older Will repeatedly.Overall, this book was an interesting read and a unique idea. There were periods where it felt a little slow but I was able to move ahead to more steadily paced sections. This was a solid debut and I would read more from this author.The publisher provided a copy of this book in return for an honest review.Reviewed for Jo&IsaLoveBooks Blog."}, {"userName": "Liz", "userReviewDate": "Oct 16, 2016", "userURL": "http://www.goodreads.com/user/show/8406391-liz", "userReview": "In my opinion a very well-written novel with two totally believable main characters. I liked the way that the story unfolded and that the narrative switched between both Matthew/Will and Jess. I also liked that the reader could make their own moral judgments without any directives from the author. I was definitely drawn into the story emotionally even though it made uncomfortable reading at times. Disappointed with the ending but maybe there's to be a follow-on book."}, {"userName": "~♥Sumi♥~", "userReviewDate": "Apr 18, 2016", "userURL": "http://www.goodreads.com/user/show/21390488-sumi", "userReview": "Ending is very disappointing."}, {"userName": "Shannon", "userReviewDate": "May 29, 2018", "userURL": "http://www.goodreads.com/user/show/36898821-shannon", "userReview": "I finally finished this book, two stars because the characters were good and so were the final chapters. Except for the last chapter though, what even was that. I'm so angry with this ending, honestly. This book was so long-winded, everything was elaborately described which was somewhat boring. I just needed this book to end. Like really end, not how it ended. Also the characters were quite good but I liked Jess and Will/Matthew the best when they were together. Thus, two stars and I'm glad I finished this book."}, {"userName": "Sherin", "userReviewDate": "Jan 28, 2016", "userURL": "http://www.goodreads.com/user/show/43617996-sherin", "userReview": "An emotional and heart-wrenching read ... A tough topic to write but considering it is written by a first time author ... the depth of emotions and twists and turns the book offers is surprising. If you can overlook the taboo subject and look at the emotional aspects and the love between the two individuals you would be rooting for their HEA ... In my opinion they both deserve a HEA after what they went through and still being worried and feeling for each other after all this time .... and I sincerely hope there's another book that covers that ... though I would have been happier to see a nice conclusion to their story ... gives a satisfying feel after the read. Anyways, if you are looking for a book with substance, emotions, storyline and not just a light read, this is your book! **I received an ARC Copy from Net Galley for review."}, {"userName": "Olivia McMullan", "userReviewDate": "Dec 08, 2017", "userURL": "http://www.goodreads.com/user/show/58030305-olivia-mcmullan", "userReview": "I liked it. Unfortunately I thought it would have a better ending, I'm not saying in anyway that it wasn't a good ending because it most certainly was, I just wasn't expecting that ending to happen, I had envisioned a completely different happier one. I also knew what the other secret that was in the book before it was even mentioned, I mean come on, it wasn't that difficult. Of course Rebecca had to put that as a plot twist or at least a side one if anything in to the story, that didn't surprise me in the least, still the other revealed about the person who called the police on them in the first place I was most definitely not expecting, I thought it was only the one person it never even occurred to me that it was someone else. Overall, It was a great book and I enjoyed it. :) I look forward to reading more of her books in the future :D"}, {"userName": "Poppy fairy ", "userReviewDate": "Jun 04, 2016", "userURL": "http://www.goodreads.com/user/show/18322003-poppy-fairy", "userReview": "The Day school Maths teacher Matthew Landley entered fifteen year old Jessica's life, he nearly killed her. When Jess sees Mr Landley with his girlfriend and daughter she wants to stop him and steps out in front of Matthew Landley's car. If Natalie finds out about him and Jess, then Matthew will never see his daughter again. As I like reading all books by Rebecca Done I'm following Rebecca on Goodreads."}, {"userName": "Renita D'Silva", "userReviewDate": "Feb 02, 2017", "userURL": "http://www.goodreads.com/user/show/17336261-renita-d-silva", "userReview": "Loved this beautifully written, emotional book."}, {"userName": "Marie Johnson", "userReviewDate": "Mar 25, 2016", "userURL": "http://www.goodreads.com/user/show/39107601-marie-johnson", "userReview": "Great book but I was a little disappointed with the ending"}, {"userName": "Tink Magoo is bad at reviews", "userReviewDate": "Nov 04, 2015", "userURL": "http://www.goodreads.com/user/show/38603325-tink-magoo-is-bad-at-reviews", "userReview": "I really really hope that that is not the end and that there will be a second book!"}, {"userName": "Federica Vantaggio", "userReviewDate": "Aug 12, 2016", "userURL": "http://www.goodreads.com/user/show/40479726-federica-vantaggio", "userReview": "[ Ma, dico io: trasferirsi a vivere con Zak solo per fargli capire che voi due non siete fatti l'uno per l'altro?! Seriously?! Are u kidding me?! Soprattutto dopo aver scoperto che ha pestato di botte l'uomo che dici di amare.Ma mollagli una cinquina in faccia e vediamo chi si trasferisce a Londra con te, smidollato!Penso seriamente che il Diazepam ti abbia dato al cervelloE Matthew che alla fine, nonostante ami Jess, rimane con la fidanzata per poi farsi mollare dalla stessa!E poi lui va a ricercare Jess e lei sta con un altro?!E finisce con quel..  \"Mi faccio coraggio e entro\" Io, bho. (hide spoiler)]"}, {"userName": "Lauren", "userReviewDate": "Jun 17, 2017", "userURL": "http://www.goodreads.com/user/show/65546665-lauren", "userReview": "Really easy read, and enjoyed the story. Would have been 5 stars but was devastated by what happened with the dog Smudge. Otherwise was worth picking it up and giving it a go. Found it very hard to not end up liking Matthew"}, {"userName": "ღ Suus ღ (pages.and.books) ", "userReviewDate": "May 10, 2018", "userURL": "http://www.goodreads.com/user/show/5271154-suus-pages-and-books", "userReview": "3,5 ster. Het verhaal gaat over een ‘verboden’ liefde tussen een leraar van 25 en een leerling van 15. Het speelt zich 17 jaar later af vanuit haar oogpunt met terugblikken naar toen vanuit zijn oogpunt. Al met al Een goed verhaal maar voor mij allemaal iets te langdradig geschreven. Het boek had minimaal 100 blz. Korter mogen zijn."}, {"userName": "Lauren (My Expanding Bookshelf)", "userReviewDate": "Feb 04, 2016", "userURL": "http://www.goodreads.com/user/show/40444496-lauren-my-expanding-bookshelf", "userReview": "Actual rating: 3.5/5This Secret We're Keeping is a strong debut novel that I just couldn't put down. It's an emotional rollercoaster and a fairly quick read for its size, about a major taboo subject - a romantic relationship between a student and teacher and the aftermath years later.This Secret We're Keeping is told both in the present from Jess's point of view (the student) and through a series of flashbacks in Will/Matthew's point of view (the teacher). I enjoyed both main characters and they felt real, although I didn't feel too attached to them. Probably because I've never been in their situation. I felt that they were both rather impulsive, in the current timeline and the flashbacks. And even though Will was a teacher, he was still quite young and in some ways still immature. He could relate quite well to his students. I did feel that Jess was slightly more mature for her age, which was probably a product of living with an alcoholic mum.As to the predictability of the story, I felt that This Secret We're Keeping was a bit of a mixed bag. Some parts I saw coming a mile off whereas other were so unexpected they practically gave me whiplash. There are so many secrets revolving around the relationship, both directly and indirectly.I was a tad confused during the final few chapters. I have an idea of what happened but it did jump around a bit. However, I have a very strong suspicion that this was just a formatting issue in the ARC I received and probably isn't in the finished version.I'm also not too sure how I feel about the ending. Yes, it is a happy(ish) and nice ending with nothing wrong with it at all, but it just didn't end the way I hoped it would so I was a tad disappointed.This Secret We're Keeping is a well done debut for Rebecca Done. The story and writing handles such a taboo subject so well and I would definitely recommend it to fans of contemporary. I look forward to seeing more by this author.I received a copy of This Secret We’re Keeping via Netgalley in exchange for an honest review.This review and many more can be found at My Expanding Bookshelf."}, {"userName": "D", "userReviewDate": "Dec 23, 2015", "userURL": "http://www.goodreads.com/user/show/4979116-d", "userReview": "Taboo romance books can be a difficult subject to write about and keep an authenticity and sincerity about them. Rebecca Done did a fabulous job of keeping to both. The dual time POV was a great way to parallel the characters' account of their relationship both past and present. The story is set in a small waterfront town in England. I'm always a sucker for an English backdrop and I absolutely love the British slang. The characters involved, Matthew (aka Will) and Jess were both very well written and developed into an equally matched storyline. Never did I want to put down the book or skim pages. The story never veered into the cheap and cheesy student/teacher relationship. It was definitely a story of intense blurred lines but viable and deep emotions and feelings. There was never a question of love rather if it was enough.The present tense story balanced out the forbidden secrets of the past story. I most enjoyed seeing the relationship evolve and regress. It changed but it didn't through the years that the story takes place. Rebecca Done did a beautiful job of taking this story beyond the 'dirty' relationship and made it more about the ripple effect of keeping secrets. Throughout the story I found myself constantly wavering on how the story would end. It most definitely ended how the story should have ended being dynamic, heartfelt, and sincere. This is one book that should definitely be on your TBR.D 4/5"}, {"userName": "Julie", "userReviewDate": "Jan 21, 2016", "userURL": "http://www.goodreads.com/user/show/10325137-julie", "userReview": "I was spellbound by this book. On the one hand every moral bone in my body is screaming that what Mathew did in having an affair with his fifteen year old pupil is wrong on every count, yet on the other hand I couldn't help but root for them both when they meet up ten years later. The path of destruction and damage has been laid, however and neither of them are the same people that they were back then. I really enjoyed reading this book even though it was disturbing at times - a pleasant change to read something different from the usual chicklit. I was lucky enough to receive a copy of this book via Netgalley in exchange for an honest review."}, {"userName": "Cristina M.", "userReviewDate": "Sep 19, 2016", "userURL": "http://www.goodreads.com/user/show/16859879-cristina-m", "userReview": "Bellissima la storia. Libro intenso, verosimile, a tratti triste, ogni tanto divertente, con personaggi veri che si appassionano, sbagliano, si pentono, vivono.Una stellina in meno per il tono ogni tanto un po' adolescenziale, che poteva anche starci nei ricordi degli anni del liceo, ma non nei capitoli attuali."}, {"userName": "Kirstie", "userReviewDate": "Mar 15, 2018", "userURL": "http://www.goodreads.com/user/show/8080104-kirstie", "userReview": "An unsettling read. I didn’t feel comfortable reading this teacher pupil romance. It felt wrong and I didn’t feel it was a love affair when they met again years later. I didn’t want them to end up together. It all felt wrong"}, {"userName": "Jelena Antic", "userReviewDate": "Mar 31, 2018", "userURL": "http://www.goodreads.com/user/show/31409275-jelena-antic", "userReview": "Toliko sam se smorila na kraju ove knjige. Jeste lepa i turbolentna i sve, ali predugo je cekao da bi bili zajedno posle svega."}, {"userName": "Shelley", "userReviewDate": "Oct 07, 2016", "userURL": "http://www.goodreads.com/user/show/28610489-shelley", "userReview": "It’s not very often that a book leaves me speechless, but I can honestly say that I had to take some time to gather my thoughts before writing this review. It’s hard to believe that this is Rebecca Done’s debut novel. This book was superbly written, the characters were extremely well developed, and the storyline moved at a lightning fast pace, giving it the distinct feel of the work of a seasoned author.This Secret We’re Keeping is the story of a romantic relationship that develops between a twenty-five year old teacher and his fifteen year old student. As a fan of forbidden romance novels, I was immediately drawn to the synopsis. The book did push my moral boundaries. A ten year age difference between a couple is not a big deal, but when that age difference is between a fifteen year old and a person who is in a position of authority over her, it does sound some alarm bells. The book goes back and forth between the present day and the early 1990s when Jess and Matthew’s relationship began. We get to see how Jess and Matthew are living their lives seventeen years after their affair ended, and how their relationship and his incarceration has changed them. The flashes back to the past were an important element in this book. It allowed me to witness the beginning of their relationship, right from their initial attraction to the start of their romantic involvement. It gave me a better insight into how it all happened, what Matthew’s motives were, what their true feelings were. I found myself sitting on the fence, undecided about how I felt about their involvement, unsure of the true nature of it, but as I read further into the book, I was able to get a clearer picture and better understanding of their intentions.This Secret We’re Keeping is a highly emotional, heartbreaking read that kept me glued to the pages. I was never able to just sit for a spell and read a couple of chapters. A couple of chapters quickly turned into a hundred pages. I never felt as though I was merely reading the words on the page, it felt like I was witnessing the story unfold firsthand. Rebecca Done has taken these characters and brought them to life. She has created them to be realistic, familiar, and sympathetic. As an avid reader, it’s always a treat when you find a book that consumes you – a book that makes you wish that you had a ‘do not disturb’ sign hanging around your neck, a story that continues to play in your head even when you’re not reading it. This Secret We’re Keeping was that book for me. I was completely invested in Jess and Matthew’s story, their family dynamics, friendships, and relationships. This book deals with a difficult topic for many readers, but Rebecca Done has handled it masterfully and honestly. It’s not portrayed as an easy love story. It’s raw and emotional. It was a roller coaster ride of feelings and heart pounding moments from beginning to end. Oh, and that ending! I am looking forward to reading more books by this talented author…perhaps a sequel?"}, {"userName": "Lia Valenti", "userReviewDate": "Aug 03, 2017", "userURL": "http://www.goodreads.com/user/show/69991080-lia-valenti", "userReview": "Una storia d'amore tormentata ma noiosa,noiosa e noiosa che nemmeno Danielle Steel !!"}, {"userName": "Vicky-Leigh Sayer", "userReviewDate": "Mar 21, 2016", "userURL": "http://www.goodreads.com/user/show/22088279-vicky-leigh-sayer", "userReview": "This secret we're keeping is a controversial novel covering the ultimate taboo subject; a pupil - teacher relationship.And what a brilliant novel it is!Jess Hart is a successful business woman with her own events catering company. She has a loving boyfriend Zak who wants her to move to London with him, but her roots and history are in Norfolk and she is reluctant to leave.Will Green has recently returned to the area with his partner Natalie, and daughter Charlotte. Natalie is renovating a house in the area, but Will is nervous about being on old territory, about who he might bump in to, and what they might say to Natalie or Charlotte, as neither of them know that he has spent time in prison.But Jess does, and after a chance meeting with her, the past comes flooding back to both of them, and we learn that Will Green is Matthew Langley.Seventeen years earlier, Matthew Langley is Jess Hart's Maths teacher and the pair of them are involved in an intense and forbidden affair. At just Fifteen to Matthew's Twenty Five, Jess is classed as a child in the eyes of the law, and the pair of them know that they would be in serious trouble if their affair should ever be discovered.But Jess is only a few months short of her Sixteenth birthday and the relationship is so mature and true that they believe they can make it through - if no one suspects them. Matthew Langley doesn't only have Jess' heart though, and a fellow teacher could be about to make trouble for them if she doesn't get her own way...Written in both present and past tense, from both Jess and Will/Matthew's view points, This Secret We're Keeping is a very different novel from anything that I have read for a while and I absolutely adored it. I am holding out hope that there may be a follow up as I would love to see what the future holds for both Jess and Will/Matthew."}, {"userName": "Laura", "userReviewDate": "Feb 15, 2016", "userURL": "http://www.goodreads.com/user/show/10281457-laura", "userReview": "Reviewed on www.snazzybooks.com So I really didn't know what to expect from this book; I had purposefully not read much about it but the synopsis really intrigued me. As I carried on reading, I got even more intrigued - and then, by the time the 'secret' is revealed, I was really engaged and interested in the characters.Rebecca Done has done a really great job of creating characters you care about, but that are also flawed and realistic. They seem like real people, and that's why I really enjoyed this novel.It really made me think about what I'd do in both Jess and Matthew's positions - and their parents' and friends' too! I felt like Matthew and Jess made such a great couple but then sometimes had to remind myself that Matthew was breaking the law by having a sexual relationship with Jess, especially as a teacher in a position of authority and trust! It really makes you question things though as you can understand how happy they are together and it makes you wonder, was he really 'abusing' her? I wouldn't say so but according to the law he is, and if I didn't know the full story behind another couple in a similar position, I'd probably feel that the adult in that position was also a paedophile. It's a real minefield and it's certainly emotional at times.I really enjoyed this novel and would recommend it if you're looking for something to make you question your own values and make you think. It's ultimately a pretty easy read but I really enjoyed it, so that makes it a really good read in my book!* Many thanks to Penguin & Netgalley for providing a copy of this novel in return for an honest review. *"}, {"userName": "Jo", "userReviewDate": "Dec 22, 2015", "userURL": "http://www.goodreads.com/user/show/30242279-jo", "userReview": "Well, what a secret! A 15 year old student, Jess Hart, and her 25 year old maths teacher, Matthew Langley, embark on a secret affair. Make no mistake, the consequences should their relationship be discovered would be disastrous; Matthew's teaching career would be ruined forever, and he would face criminal prosecution and imprisonment as a paedophile. Yet still, Matthew, as the adult, gives in to Jess's advances, knowing full well he should know better. The 'devil's advocate' in what is straightforward in the eyes of the law, is that Jess is not presented as a naive and innocent victim of a predatory older male abusing his position of responsibility, quite the contrary, and she is just a few months short of 16 when their relationship will no longer be illegal. Yet Jess does come from a background of poor parental rolemodels, alcohol abuse and general emotional neglect suggesting that Matthew, as the teacher, should have been able to provide the boundaries and stability she lacked, and that she needed. Told from the perspectives of both Jess and Matthew/Will using time slots from both before and after discovery, I found this a very thought provoking and rather sad and tragic tale; a doomed love affair, or predatory grooming of the worst sort?There are other numerous secrets which all stem from this original event, all of them destructive and life-changing, as we witness the ripple effect down through the years.A very good, if at times a bit laboured, read which comes highly recommended!"}], "description": "A pupil and a teacher. Is it ever right to break the rules? Jessica Hart has never forgotten Matthew Landley. After all, he was her first love when she was fifteen years old. But he was also her school maths teacher, and their forbidden affair ended in scandal with his arrest and imprisonment. Now, seventeen years later, Matthew returns to Norfolk, with a new identity and a long-term girlfriend and a young daughter, who know nothing of what happened before. Yet when he runs into Jessica, neither of them can ignore the emotional ties that bind them together. With so many secrets to keep hidden, how long can Jessica and Matthew avoid the dark mistakes of their past imploding in the present? From debut author Rebecca Done, This Secret We're Keeping is a powerful and provocative novel about the ties which can keep us together - or tear us apart.", "title": "This Secret We're Keeping", "url": "http://www.goodreads.com/book/show/26026070-this-secret-we-re-keeping", "average": 3.75, "cover": "https://images.gr-assets.com/books/1451216919l/26026070.jpg", "reviews": 137, "authors": [{"url": "https://www.goodreads.com/author/show/14196564.Rebecca_Done", "name": "Rebecca Done"}], "type": ["Romance", "Fiction", "Adult Fiction", "Thriller"], "outlinks": ["http://www.goodreads.com/book/show/26026070-this-secret-we-re-keeping", "http://www.goodreads.com/book/show/28774075-this-secret-we-re-keeping", "http://www.goodreads.com/book/show/30644306-una-bellissima-colpa", "http://www.goodreads.com/book/show/31277349-het-geheim-dat-wij-delen", "http://www.goodreads.com/book/show/32721445-sada-ili-nikada", "http://www.goodreads.com/book/show/31383687-my-husband-the-stranger"]}