{"ratings": 28, "userreviews": [{"userName": "Jon(athan) Nakapalau", "userReviewDate": "Aug 25, 2017", "userURL": "http://www.goodreads.com/user/show/58774673-jon-athan-nakapalau", "userReview": "Everyone of my English friends remembers Thomas with the same 'glow' that I remember (for example) Peanuts and Charlie Brown. I decided to finally read the very first Thomas adventures and was struck by two perspectives: first - Thomas seems to embody the 'stiff upper lip' that many of my English friends have - I will not complain about how hard a task is - I will get it done; second - in order for anything to run smoothly one must learn from 'honest' mistakes; if one does learn from such mistakes then the lesson will contribute to facing challenges that one will face in the future. Very glad I 'tracked' this classic into my 'finished reading list!"}, {"userName": "Matthew Hunter", "userReviewDate": "Apr 21, 2016", "userURL": "http://www.goodreads.com/user/show/3040804-matthew-hunter", "userReview": "I'm partial to Thomas the Tank Engine. Maybe it's the fact that Awdry invented Thomas to bolster his son's spirits during a nasty case of measles. The father-child angle gets me every blooming time. And it doesn't hurt that both our young ones love trains generally, and Thomas more specifically. At their enthusiastic request, we mowed through all four tales during a single bedtime read-a-long. I highly recommend these classic stories."}, {"userName": "Jennifer", "userReviewDate": "Jul 24, 2015", "userURL": "http://www.goodreads.com/user/show/10667485-jennifer", "userReview": "My two year old adores the Thomas series. This book contains the first four stories written about Thomas. He loves this book! I enjoy the stories, too. When toddlers ask for the same stories over and over again it is a definite bonus when the stories are longer and filled with interesting volcabulary. :)"}, {"userName": "Benjamin Elliott", "userReviewDate": "Oct 09, 2016", "userURL": "http://www.goodreads.com/user/show/51508227-benjamin-elliott", "userReview": "The stories were simple, introducing Thomas and building on one another. I recognized several of them from having been included in different episodes and movies that my son has watched. However, I couldn't give it a higher rating right now because it was too much text and not enough pictures to hold my son's attention. He got really excited when he saw the cover, but couldn't make it through the stories due to the lack of illustrations and the amount of text to get through before turning each page. We'll have to revisit it when he's a bit older. For now, the map on the cover linings was the most interesting part of the book."}], "description": "With the first four tales ever written about Thomas the Tank Engine and illustrated with the art from the original book, this hardcover storybook is a must-have for every Thomas & Friends fan! First published in 1946, the stories launched Thomas firmly into the hearts of countless train-loving little boys and girls and their families, where he has remained ever since. This beautifully designed new version of timeless favorite tales makes it a classic for today, tomorrow, and always!", "title": "Thomas the Tank Engine: The Very First Stories (Thomas & Friends)", "url": "http://www.goodreads.com/book/show/23743753-thomas-the-tank-engine", "average": 3.79, "cover": "https://images.gr-assets.com/books/1418771357l/23743753.jpg", "reviews": 4, "authors": [{"url": "https://www.goodreads.com/author/show/17803.Wilbert_Awdry", "name": "Wilbert Awdry"}], "type": ["Childrens", "Childrens", "Transport"], "outlinks": ["http://www.goodreads.com/book/show/23743753-thomas-the-tank-engine", "http://www.goodreads.com/book/show/734531.Stop_Train_Stop_a_Thomas_the_Tank_Engine_Story", "http://www.goodreads.com/book/show/734541.Go_Train_Go_", "http://www.goodreads.com/book/show/1306367.Thomas_The_Tank_Engine", "http://www.goodreads.com/book/show/2305729.Happy_Birthday_Thomas_", "http://www.goodreads.com/book/show/296926.Thomas_the_Tank_Engine_Story_Collection"]}