{"ratings": 3325, "userreviews": [{"userName": "Tanya D", "userReviewDate": "Oct 19, 2011", "userURL": "http://www.goodreads.com/user/show/860206-tanya-d", "userReview": "I've been reading chapter books to my seven year old, with my four year old kinda listening and mostly jumping on us. We all liked these three tales about Elmer and Boris the dragon. I liked that the chapters are short, good for bedtime and reading aloud. It had fun illustrations every couple page to keep my four-year old interested too. I loved that the story was fun and exciting while at the same time being so simple and innocent. So many \"children\" books have sad and terrible things happening in them, e.g. parents missing or dead, super mean siblings or peers, scary bad guys, etc. This tale is just a sweet adventure of a boy and a dragon. It made me happy."}, {"userName": "Cheryl", "userReviewDate": "Mar 22, 2017", "userURL": "http://www.goodreads.com/user/show/3498889-cheryl", "userReview": "As the author states in her introduction, the first story was written for amusement, and practically wrote itself. The second two were more difficult. And in my opinion it shows... they just aren't as lively & enchanting. But then, I've never been a huge fan of the first, so what do I know.... Judge for yourself. Very quick read."}, {"userName": "Claudia Badiu", "userReviewDate": "Mar 04, 2017", "userURL": "http://www.goodreads.com/user/show/30706792-claudia-badiu", "userReview": "O poveste construită din trei povești, despre prietenie, ajutor, colaborare și bunătate. O poveste în care se conturează \"imagini\" inedite cu animale din junglă care ronțăie dulciuri sau cu dragoni colorați în cele mai ciudate combinații posibile. Mi-a plăcut imaginația și neobișnuitele întâmplări, însă nu am înțeles de ce e vorba de dragonul \"tatălui\" și de ce autoarea nu oferă unele explicații referitoare la acest lucru. De asemenea au fost unele detalii care, în opinia mea, îi iau puțin din strălucire, însă cartea e veselă, plină de aventuri și de călătorii pe spatele unui dragon. :)"}, {"userName": "Liz", "userReviewDate": "Apr 12, 2015", "userURL": "http://www.goodreads.com/user/show/1611790-liz", "userReview": "I typically reserve five stars for great works of literature, but reading this book aloud to my four-year-old was an experience I'd like to never forget. To him, at his age, it absolutely is an amazing piece of literature. He would have sat through an entire book if I'd let him. Reading just three chapters at a time was hardly a fast enough pace for him. And I was shocked by his comprehension. Even at the end of the first story, he could recall all ten chapters in great detail. He studied the simple drawings on each page and soaked in every word he heard. The first of the trilogy is the best, but the other two compliment it well. I plan on reading this many more times with him. We both loved it and I would recommend it to anyone who reads chapter books aloud to their children."}, {"userName": "Tania", "userReviewDate": "Mar 22, 2018", "userURL": "http://www.goodreads.com/user/show/2938614-tania", "userReview": "Three Tales of My Father's Dragon is the compilation of a children's series written by the author in the 1940's and 50's. The three stories that make up this collection are My Father's Dragon, Elmer and the Dragon, and The Dragons of Blueland. In My Father's Dragon, we meet Elmer Elevator as he ventures out to save a baby dragon. In Elmer and the Dragon, the boy and the dragon continue their adventures together. In The Dragons of Blueland, Elmer once more helps his friend the dragon with troubles that he encounters. Elmer shows foresight and proves himself resourceful time and time again. The stories carry with them the message that careful preparedness and a large does of kindness serve you well.The stories are told from Elmer's point of view, so there's no use worrying about what his parents think of the situation. We're treated to time spent with innocence and curiosity, time spent away from the real cares of the world such as whether or not you can truly exist on only tangerines for weeks at a time. Our hero is bold with good intentions, and he does worry about his parents from time to time. I thought it was a delightful book, filled with imagination, friendship, and good intentions."}, {"userName": "Razvan Zamfirescu", "userReviewDate": "Apr 05, 2014", "userURL": "http://www.goodreads.com/user/show/19039516-razvan-zamfirescu", "userReview": "In categoria sa, cartea isi merita, cu siguranta, calificativul de \"clasica\". Doar ca ar trebui sa fiti cu bagare de seama pentru ca daca obisnuiti sa cititi cu placere, pe langa fictiunea si non-fictiunea de zi cu zi, si carti gen Mary Poppins sau Roald Dahl, asa cum fac eu, acest titlu s-ar putea sa nu va aduca o placere la fel de mare, de vreme ce cartea are un public mult mai tanar. Daca veti reusi sa o priviti prin ochii unui copil de 5-6 ani, sunt convins ca o veti aprecia, dar eu nu am reusit pana la capat si astfel cred ca am pierdut mult din farmecul cartii.Totusi, m-am bucurat mult sa o citesc. Impresia care mi-a ramas este ca am urmarit, cu gura cascata, un desen animat vechi, alb-negru, excelent. Prima dintre cele trei carti e cu adevarat grozava si nu ar trebui ratata. De cate ori veti mai avea ocazia sa cititi despre niste tigri care mananca guma de mestecat, sau despre crocodilii care abia asteapta sa primeasca acadele. Dar, pe masura ce se dezvolta, aventura nu mai e la fel de sensibila si nici la fel de palpitanta. Povestea canarilor care se imbolnavesc de curiozitate pentru ca nu stiu de ce regele lor este, la randul sau bolnav de aceasta boala mi s-a parut nemaipomenita, abia astept sa i-o citesc si lui Vladut cand o sa creasca."}, {"userName": "Victor The Reader", "userReviewDate": "Jan 03, 2018", "userURL": "http://www.goodreads.com/user/show/68171410-victor-the-reader", "userReview": "Grade: A"}, {"userName": "Amy", "userReviewDate": "Jul 30, 2017", "userURL": "http://www.goodreads.com/user/show/1530119-amy", "userReview": "All three books in the series. I read them to my daughter. She loved them. Its an adventure series (short chapter books) perfect for early readers or for ages 3+ as a parent-read-aloud book. My Father's Dragon was my favorite of the three."}, {"userName": "Shanae", "userReviewDate": "Dec 02, 2017", "userURL": "http://www.goodreads.com/user/show/70749887-shanae", "userReview": "Such a great introduction to chapter books book. My boys read and re-read this series. They're captivated by the adventure and love them all. It gives good problem solving discussions, is fun to read aloud with many voices, and is a short read (I think it was audiobook was 2 hours for all 3 books). Good, light, children's fiction. Perfect for a reader just venturing into chapter books."}, {"userName": "Kirsten Kinnell", "userReviewDate": "Feb 20, 2018", "userURL": "http://www.goodreads.com/user/show/124251-kirsten-kinnell", "userReview": "Felix loved this. Read Jan 2018"}, {"userName": "Kara", "userReviewDate": "Oct 19, 2017", "userURL": "http://www.goodreads.com/user/show/1645247-kara", "userReview": "Baby dragons, maps, tangarines: Best. Read-aloud. Ever."}, {"userName": "Becky", "userReviewDate": "Apr 10, 2015", "userURL": "http://www.goodreads.com/user/show/50448-becky", "userReview": "I really enjoyed reading My Father's Dragon (1948), Elmer And the Dragon (1950), and The Dragons of Blueland (1951), all by Ruth Stiles Gannett. (My Father's Dragon was a Newbery Honor book for 1949.) I'd read My Father's Dragon before many years ago--long before I started blogging--but this was my first opportunity, I believe, to read the two sequels.I loved the way My Father's Dragon opens:One cold rainy day when my father was a little boy, he met an old alley cat on his street. The cat was very drippy and uncomfortable so my father said, \"Wouldn't you like to come home with me?\" This surprised the cat--she had never before met anyone who cared about old alley cats--but she said, \"I'd be very much obliged if I could sit by a warm furnace, and perhaps have a saucer of milk.\" \"We have a very nice furnace to sit by, said my father, \"and I'm sure my mother has an extra saucer of milk.\" My father and the cat became good friends but my father's mother was very upset about the cat. She hated cats, particularly ugly old alley cats. \"Elmer Elevator,\" she said to my father, \"if you think I'm going to give that cat a saucer of milk, you're very wrong. Once you start feeding stray alley cats you might as well expect to feed every stray in town, and I am not going to do it!\"This opening hooked me. It is through the cat--his cat--that he learns of a baby dragon in desperate need of help. He tells of the Island of Tangerina and Wild Island. He learns about the captive dragon and the dangerous residents of the island. He is determined to help free the dragon. The cat helps him form a plan...The first book is all about his going to the islands, his adventures and misadventures as he's looking for the dragon--it's a good thing he came to the island well-prepared! Does he find the dragon? You can guess the answer to that. Of course he does! My Father's Dragon is a delightful fantasy book for very young readers. It's short and quite satisfying.In Elmer and the Dragon, Elmer starts his journey home--by dragon. His new dragon friend will fly him home. But neither Elmer or the dragon know the way home precisely. Elmer ends up having just as many adventures returning home as he did running away from home. One of the stops along the way is Feather Island, the home of all 'lost' canaries. In The Dragons of Blueland, the dragon sets off to return to his own family that he hasn't seen since his captivity. He's anxious to be reunited. But when he returns, he learns that his own family--his very large family--has been trapped in their cave. The entrance is guarded by men intent on capturing them or perhaps even killing them. He needs to find a way to help his family! So he seeks out Elmer...All three books are great. It's oh-so-easy to recommend these."}, {"userName": "Taro Yamashita", "userReviewDate": "Jan 03, 2018", "userURL": "http://www.goodreads.com/user/show/1846555-taro-yamashita", "userReview": "I *LOVED* the first book, \"My Father's Dragon,\" from the time I was a kid. I didn't know, until I went to purchase the book for my nephews, that it was the first in a trilogy. So, I bought a copy of the trilogy for me, as well as one for my nephews.The first book is unassailable as anything other than \"wonderful\" because of the place it holds in my past. My childhood imagination and wonder are so tied to it that I cannot see it through critical eyes of an adult at all. That said, if I could, I'm sure I would tell you it's just an incredibly wonderful book full of imagination, wonder, and just enough silly and scary to spark the mind of an adventurous child.The second and third books, since I'm reading them for the first time as an adult, are fun, whimsical follow-ups to the first, and follow the pattern so typical of trilogies: trying to hold on to the magic of the first, but trying too hard to develop new things within the framework of the first, and also trying to bring the fantastic down to earth by introducing more characters who are necessarily less fantastic and more \"real,\" which tarnishes the original escapist magic. Of course, the second and third books could never have lived up to the expectations set by the first for me.... but maybe for your kids, if they read them all as children, will have a better take. One thing is for sure: whether you read these books as a child or an adult, you will want to read them to the end."}, {"userName": "kingshearte", "userReviewDate": "Dec 13, 2009", "userURL": "http://www.goodreads.com/user/show/3031302-kingshearte", "userReview": "My Father's Dragon and its two sequels are books that Da read to us when we were little, and they're very cute. I'd actually kind of forgotten about them until I started working with books and saw them again. Then I spotted an edition of all three books in one hardcover volume at a used book sale, and snapped it up. I don't have a blurb for it because it didn't have its dust jacket at that time, but suffice it to say that it's about a boy named Elmer who has adventures with a baby dragon named Boris, who is just about the cutest thing ever. And I figured that, after Moby-Dick, I needed something cute and fluffy. So I read this, which took about a day, but it certainly was cute and fluffy. If I ever find myself in a position to have to read a kid a story (and since I'm moving into my uncle and his soon-to-arrive new baby's building, I just might), I will for sure read these books. Because they're adorable. Especially Boris."}, {"userName": "Krista", "userReviewDate": "Mar 16, 2014", "userURL": "http://www.goodreads.com/user/show/803654-krista", "userReview": "My 4 year old son got this for Christmas this year and loved it. I've lost count of the number of times we have read through it. This volume is a compilation of three books that all center on the relationship between a boy (sometimes called \"My Father\" and sometimes \"Elmer\") and a dragon (Boris) that he rescues from some mean, wild animals. It has all the elements of a great adventure- planning, travel, secrecy, danger, friendship, and a safe return home- that a little boy wants. This is one of our favorites!!"}, {"userName": "Nancy", "userReviewDate": "Dec 14, 2015", "userURL": "http://www.goodreads.com/user/show/6879879-nancy", "userReview": "This was a lovely book. My Vintage Book Circle group all loved it. We liked the dragons a lot. I remember being so amazed at how prepared he was. He had just the right thing for every circumstance! One person said this was the book that made her become a librarian. We all thought that it would capture the imagination of children today despite the fact that it was written in 1948. Excellent first chapter book for third graders, I would think."}, {"userName": "Anjali Williams", "userReviewDate": "Mar 28, 2013", "userURL": "http://www.goodreads.com/user/show/2750056-anjali-williams", "userReview": "I missed this series as a child but read them aloud to both my kids. They are perfect early chapter books for younger children, because there are whimsical illustrations on nearly every page, kind and resourceful characters, and nothing too scary. Sienna liked that Elmer would risk his life to make a baby dragon happy. But she didn't like the \"sad\" parts (that, for example, the dragon needs to be rescued), which made her rate it a 3, instead of 4."}, {"userName": "Sherri", "userReviewDate": "Jul 19, 2015", "userURL": "http://www.goodreads.com/user/show/16767917-sherri", "userReview": "Great chapter book to read aloud to young children about a young boy and his baby dragon friend. I think the age window for reading this book to kids is pretty short (3-10). I read it to my eight year-old and 11 year-old. The eight year-old was completely enthralled; the 11 year-old liked it, but was bored at times. Also, it's a little dated."}, {"userName": "Jackie \"the Librarian\"", "userReviewDate": "Oct 26, 2007", "userURL": "http://www.goodreads.com/user/show/289556-jackie-the-librarian", "userReview": "All three of the My Father's Dragon books in one volume. They really are all just one big story, so this makes perfect sense. The only drawback is that you lose the cover art for the first two books.A perfect read aloud for kids ages 4-8, especially those not ready for Harry Potter."}, {"userName": "Naomi", "userReviewDate": "Mar 20, 2012", "userURL": "http://www.goodreads.com/user/show/993143-naomi", "userReview": "Reading this with Arianna. She is really enjoying it, and often asks for \"one more chapter\"."}, {"userName": "Michelle", "userReviewDate": "Jul 07, 2015", "userURL": "http://www.goodreads.com/user/show/1364787-michelle", "userReview": "My children love this as a bedtime story. We read a few chapters each night, but they're begging for more. The simple, black and white illustrations are engaging. This is one we read again and again!"}, {"userName": "Renee Priddis", "userReviewDate": "May 12, 2014", "userURL": "http://www.goodreads.com/user/show/13626355-renee-priddis", "userReview": "A fantastic book. I read this to my kids. They enjoyed it and so did I...a children's beginner chapter book that kept everyone's attention! Success!"}, {"userName": "Bethany", "userReviewDate": "Jun 14, 2017", "userURL": "http://www.goodreads.com/user/show/108298-bethany", "userReview": "I read the first story in this book years ago, but I can't remember anything about them other than a vaguely pleasant sentiment. This time, I read it aloud to my 4-year old. I don't like to push things on her, I want reading to be fun and all that, so I read it to her on nights she asked for it, which she did more often than not, but definitely not every night, so it took us a while to get through all three stories. But still, she liked it, remembered what was happening for the most part, and she liked to look at the illustrations, which there were plenty of. It makes a good read aloud--the language is right for storytelling, it's episodic, and it's pretty silly and fun. At this point, I'm impressed by any chapter book that holds her interest (we've had more than a few fails), and this one definitely did, so it's a win."}, {"userName": "Ellie", "userReviewDate": "Jan 25, 2018", "userURL": "http://www.goodreads.com/user/show/38560685-ellie", "userReview": "I revisited this after many years - I remember reading it together with my father when I was young! It is still a delightful read. My favorite aspect of the book is the way that the author treats the reader with such dignity - never simplifying a situation because the book is directed towards younger readers. I also like how the book humanizes an adult by talking about the adventures of his youth - it's such a nice change from the typical treatment of adults as idiots or villains that is so common in middle grade books these days. Overall, very glad to have reread this one and to have found it a lasting classic."}, {"userName": "Stefanie Delinois", "userReviewDate": "Feb 20, 2018", "userURL": "http://www.goodreads.com/user/show/33284593-stefanie-delinois", "userReview": "I recently read this to our 4 year old. It seems appropriate for her age. FYI- if you read it to your children: The mother spanks, I think they said \"whips\" her boy for bringing the stray cat in the house. Also, some of the animals threaten the boy with violence while he is rescuing the baby dragon. I might have used different language to communicate the same idea when reading it aloud to my child. Overall, it is an adventure story about a little boy who rescues a baby dragon from some wild animals. His wits and how he creatively used the things in his nap sack are what saves him. My 4 year old enjoyed it."}, {"userName": "Sheri S.", "userReviewDate": "Feb 09, 2017", "userURL": "http://www.goodreads.com/user/show/17511149-sheri-s", "userReview": "I really enjoyed each of these imaginative tales about a boy and a baby dragon. Gannett does an excellent job of painting a picture in one's imagination of a brilliantly colored baby dragon who is off on some kind of an adventure. He's accompanied by the boy, Elmer Elevator, who assists the dragon in any way he can. I found the names given to the various animals in the first tale to be particularly amusing. Overall, I would say this is a great book for kids and fun for adults to listen to as well!"}, {"userName": "Grace", "userReviewDate": "Jun 08, 2017", "userURL": "http://www.goodreads.com/user/show/15392886-grace", "userReview": "3.5 stars. I read this aloud to my four-year-old. He liked looking at the pictures while I read, but I don't think he was very engaged in the story at all. I think it's a good starting point for a read-aloud chapter book with your little one, but it's not overly interesting throughout. Cute stories-don't get me wrong, with fun and silly things that happen, but I wasn't overly impressed. I understand that it's a classic children's book and I'm glad we read it together."}, {"userName": "Elena Halvorsen", "userReviewDate": "Jul 27, 2017", "userURL": "http://www.goodreads.com/user/show/38819166-elena-halvorsen", "userReview": "Wonderful read aloudWhen I taught second grade I did a whole unit with My Fathers Dragon and the students loved it. This summer I got to read it to my own daughter who is going into second grade and she was enthralled. Such a sweet and imaginative trilogy to read aloud to children."}, {"userName": "Leslie", "userReviewDate": "Apr 06, 2018", "userURL": "http://www.goodreads.com/user/show/8084201-leslie", "userReview": "A fun listen for a sick little family. Both adults and the three-year-old enjoyed listening to it. It sounds like short chapters and I will probably get hard copies from the library to read to my son as I hear there are illustrations in the books."}, {"userName": "Sarah", "userReviewDate": "Oct 26, 2016", "userURL": "http://www.goodreads.com/user/show/6156562-sarah", "userReview": "This was very cute! We had been looking for chapter books to read out loud to a preschooler, and this was definitely a winner. He loved the stories, and now he even likes to eat tangerines...because Elmer Elevator eats tangerines."}], "description": "My Father's Dragon, Elmer And The Dragon, The Dragons Of BluelandAlso includes an introduction by the author.", "title": "Three Tales Of My Father's Dragon\n      \n          (My Father's Dragon #1-3)", "url": "http://www.goodreads.com/book/show/28875.Three_Tales_Of_My_Father_s_Dragon", "average": 4.27, "cover": "https://images.gr-assets.com/books/1350481640l/28875.jpg", "reviews": 395, "authors": [{"url": "https://www.goodreads.com/author/show/16215.Ruth_Stiles_Gannett", "name": "Ruth Stiles Gannett"}, {"url": "https://www.goodreads.com/author/show/6422577.Ruth_Chrisman_Gannett", "name": "Ruth Chrisman Gannett"}], "type": ["Fantasy", "Childrens", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/28875.Three_Tales_Of_My_Father_s_Dragon", "http://www.goodreads.com/book/show/21849366-dragonul-tatalui-meu-cele-trei-carti-cu-elmer-si-dragonul", "http://www.goodreads.com/book/show/13394036-three-tales-of-my-father-s-dragon", "http://www.goodreads.com/book/show/1874372.Three_Tales_of_My_Father_s_Dragon", "http://www.goodreads.com/book/show/8687041-three-tales-of-my-father-s-dragon", "http://www.goodreads.com/book/show/34898.My_Father_s_Dragon", "http://www.goodreads.com/book/show/240815.Elmer_and_the_Dragon", "http://www.goodreads.com/book/show/962781.The_Dragons_of_Blueland", "http://www.goodreads.com/book/show/1966143.My_Father_s_Dragon", "http://www.goodreads.com/book/show/3216377-katie-and-the-sad-noise"]}