{"ratings": 948, "userreviews": [{"userName": "lorinbocol", "userReviewDate": "Dec 02, 2017", "userURL": "http://www.goodreads.com/user/show/69875407-lorinbocol", "userReview": "i chioschi che vendono bagels, le freddure, la musica di gershwin, lo storione affumicato su amsterdam avenue, andare in psicoanalisi. realizzo che le prime cinque cose che mi vengono in mente se penso a new york sono 100% kosher. grazie a dio (il loro, sia chiaro. è sufficientemente biblico perché io non lo voglia irritare) esistono gli ebrei americani.ps: certo poi ci sarebbe anche adam sandler. ma - e anche questo l’ha detto un famoso ebreo, austriaco ma naturalizzato statunitense - nessuno è perfetto.https://youtu.be/g2akLhosPEg"}, {"userName": "Paul Secor", "userReviewDate": "May 29, 2016", "userURL": "http://www.goodreads.com/user/show/5737008-paul-secor", "userReview": "I've heard a very good friend of mine use the term \"dabbler\" more than once. That term fits Adam Gopnik very well. He's a writer for The New Yorker and will seemingly write about anything that catches his attention or, possibly, that he's been assigned to write about. (Though he's been writing for the magazine for thirty years now, and perhaps he chooses his own assignments.) Anyway, his modus operandi seems to me to be to cover a subject, but not dig very deeply into it.Through the Children's Gate is a book about New York City - primarily Manhattan - and a New York City that he knows. (Nothing necessarily wrong with that, but it seems to cover a fairly narrow scope.)One problem with Through the Children's Gate is that many of the essays are simply not very interesting. Mr. Gopnik writes a lot about his family - primarily about his children - and that ends up being close to the experience of people showing you photographs of their children. The photos mean a lot to them, probably not so much to you.When he steps away from writing about his family, there are other problems. \"That Sunday\" is a revisiting of a Sunday gig at the Village Vanguard in 1961 by the Bill Evans Trio that was recorded. It's well known in jazz history, but it seems strange to me that someone would write about that gig when John Coltrane was blowing the roof off the Vanguard later that year in gigs that were recorded. And when Ornette Coleman's groups at the Five Spot around that time were changing the ways that many musicians played jazz and the ways that many listeners heard and listened to the music. I guess that Bill Evans' music is more palatable to the average New Yorker reader than Trane's or Ornette's.When Mr. Gopnik writes about his friend Kirk Varnedoe, an art historian and teacher, he focuses on descriptions of Mr Varnedoe coaching a team of eight year old football players, which included Mr. Gopnik's son. The article certainly humanizes Kirk Varnedoe - that's a fine thing - but it generally ignores his teaching and writing, which I wanted to know more about. Instead I learned about his football coaching skills - interesting and humanizing - but there obviously was more to the man than that.Through the Children's Gate seems like a book that was cobbled together from previously written articles simply to make a book - not always a good thing, and in this case, definitely not.My favorite bit of writing in the book was an epigraph:\"Interviewer: Sir, How do you survive in New York City? What do you eat?Sid Caesar (as The Wild Boy): Pigeon.Interviewer: Don't the Pigeons object?Sid Caesar: Only for a minute. - from Your Show of Shows (attr. Mel Brooks)edit - I did enjoy reading Gopnik's Paris to the Moon. Now I'm not sure if it actually was a good book or if the fact that I've never been to Paris just made it a piece of exotica to me."}, {"userName": "Maia", "userReviewDate": "Sep 27, 2010", "userURL": "http://www.goodreads.com/user/show/1637919-maia", "userReview": "I received this book from a friend when, after years of living in NYC, I finally left--and nobody could believe it. I've always noticed that about NY (I lived there since I was 17): everyone complains and dreams of moving out, but no one believes anyone would actually do it (though people do, constantly). So I kept the book, through a move to the West and then here to Europe, without ever reading it. I'd read--with enjoyment--a few of Gopnik's pieces in The New Yorker but for the most part, I judged this to be a yuppy, overly privileged Woody Allen sort of thing: look how happy my love is, I live in the best city in the world!Well, it sort of is and sort of isn't. For starters, the whole book is under the unavoidable shadow of 9/11--which changed everything forever, as I know since I was there and my then boyfriend-now husband worked 2 blocks away. Gopnik's handling of this delicate shadow is moving and realistic. Also, the Gopnik's New York is a lived-in New York, an experienced one, of the adult, the parent, the husband. It's not the NY you see via Hollywood movies or TV shows (take any 'Friends' episode, and nothing in it is true!) where 30-something hold implausible jobs, wear unaffordable clothing and live in non-existent apartments! Having walked the streets mentioned by Gopnik and having shared those experiences--as a woman, a mother, a wife--I related completely and I could feel it, sense it, see the city. On the other hand, there are two minuses that prevent me from giving the book 4 stars: one, there's little mention of the 'other' NY: the stress, the narrowness, the crap for your money equation. Even when you're past that stage and can afford not to deal with it daily, it's still there, always, somewhere in the back. And two, Gopnik's writing is uneven. He's no Joan Didion, for eg. There are incredibly lyrical and thought-provoking passages with some incredibly bogged-down, hard to read ones.In all, however, it works. I'm looking forward to trying his first book now, about Paris."}, {"userName": "Jeannen", "userReviewDate": "Feb 25, 2008", "userURL": "http://www.goodreads.com/user/show/939916-jeannen", "userReview": "Adam Gopnik writes for the New Yorker, but since I don’t read that magazine, I first encountered him when I read “Paris to the moon”, his collection of essays about his family’s years living in Paris – first himself and his wife, and then the two of them and the children they had while they lived there. I loved that book, although it’s interesting to me to note that the only part of it I really remember is the section on their experience of the French health system as they were going through his wife’s first pregnancy. I love “travel writing” of this type – the “we moved there and this is what we experienced” type of writing, and it’s actually not common to find good writing in the genre: there are many more people traveling and writing about their travels than there are people who have the talent to actually say something interesting about their travels. (“The reluctant Tuscan” by Phil Doran comes to mind as an example of a moving to Italy story that should have been left unwritten.) Anyway, I loved “Paris to the moon,” so when I learned that Gopnik had a new book out I marched right over to Queen Anne Books and bought it (in hardcover, no less). I wasn’t all that engaged with the book at first. The title and description of the book implied that it was going to focus on the experience of moving back and living in NYC with children, but it’s another collection of essays, may of them clearly published for the New Yorker, and several of them have nothing to do with Gopnik’s children or even the experience of being parents of children in NY. The first three essays – one about 19th-century writer, one about Gopnik’s relationship with his psychiatrist, and one about Gopnik’s explorations into the world of Judaism that he was only nominally raised in -- left me almost regretting that I had bought the book. But then he began to actually write about what he was observing in his life and the life of the city around him and the book got more compelling. The essays about living in the city in the wake of 9/11 were really good and by the end of the book I was regretting that it was done, although I found the last essay to be weak – almost a forced attempt to live up to the introduction, which talked about the Children’s Gate into Central Park (there apparently are designated gates into the park, including a children’s gate). Still, this is one of the better books I read during the first few months of the year, and I can actually imagine myself re-reading some of the essays, so this one will find a spot on the travel/memoirs shelf."}, {"userName": "Shonna Froebel", "userReviewDate": "Dec 23, 2012", "userURL": "http://www.goodreads.com/user/show/14633278-shonna-froebel", "userReview": "Journalist Adam Gopnik reflects over a period of a few years on his return to New York from Paris with his young children. The reflections cover his personal life, cultural trends, and the changes to the city.His children experience imaginary friends, chess, Yu-Gi-Oh!, baseball, heelies, fantasy games, goldfish, and IM. He tells of his good friend Kirk as he declines with cancer, and yet coaches a flag football team of young boys as well as giving a series of lectures on modern art.He touches on experiences with specific New York City places and experiences such as psychoanalysis, Central Park, Times Square, The Listening Post, switch hotels, noise, and the reaction to 9/11.He also brings in more general cultural trends like the decline of department stores and independent specialty stores in favour of chain boutiques like The Gap, Victoria's Secret, and Starbucks. He touches on the way parents get involved in their children's school activities like plays; on the exercise trends: running for men and yoga for women; and on the adult's social interaction through a game called Mafia.I enjoyed all aspects of this book, and even though I have only visited New York and never lived there, I appreciate both its uniqueness and its similarity to other places.Highly recommended."}, {"userName": "Rachel Kopel", "userReviewDate": "Feb 12, 2009", "userURL": "http://www.goodreads.com/user/show/1176713-rachel-kopel", "userReview": "This was also a library sale find. I find Gopnik's writing *dense* but also cant put him down. A classic New Yorker writer. There were a couple of laughs-out-loud and I enjoyed the chance to follow his children's, especially his son Luke's, growing up. And his own life lessons as well."}, {"userName": "Russell Bittner", "userReviewDate": "Sep 26, 2012", "userURL": "http://www.goodreads.com/user/show/2270932-russell-bittner", "userReview": "J. P. Donleavy once wrote a hilarious novel titled \nA Fairy Tale of New York.\n Adam Gopnik's masterpiece could be just as aptly titled. He has, however, chosen a somewhat more prosaic title while letting the content of his non-fiction work read very much like the title of Donleavy's opus.While Gopnik's story is solidly a New York story (of both the people and the place), it's equally a story about bringing up children in \"the city that never sleeps\" (even if they do). Whether the city itself contributes in a measurable way to their development is, of course, anyone's guess. It could well be that with their privileged genetic inheritance, they were simply meant to become the extraordinary children the author makes them out to be. But Adam Gopnik, himself, has no doubt played a critical role in their development, and we have him to thank and admire for the end result.As a parent, myself, of two rather creative children, I felt (and feel) a certain kinship with Adam Gopnik and fully expect our progeny to one day share a communal spotlight.In the meantime, I thank him for an extraordinary read. It has been a long time since I could honestly say of a book that I didn't want it to end. I say that now without qualification about \nThrough the Children's Gate\n and urge not only would-be parents, but also appreciative readers to open their eyes, minds and hearts to this gift of a book.RRB10/11/12"}, {"userName": "Linda", "userReviewDate": "Nov 07, 2010", "userURL": "http://www.goodreads.com/user/show/2588700-linda", "userReview": "\"The taxi has its checkered lore, the subway its legend, and the Town Car a certain Michael Douglas in Wall Street icon quality; but if there is a memorable bus scene in literature, or an unforgettable moment in a movie that takes place on a New York City bus, I have not found it. it isn't that buses are intrinsically inimical to symbolism: The London bus has a poetry as rich as the Tube's - there is Mary Poppins, there is Mrs. Dalloway. In Paris, Pascal rides the bus, Zazie dreams of riding the Metro, and that is, evenly, that. In L.A., Keanu Reeves rides the bus, round and round in desperate Dennis Hopper-driven circles. But as a symbolic repository, the New Yo4rk City bus does not exist. The only significant symbolic figure that the new York bus has had is Ralph Kramden, and what he symbolizes about the bus is being stuck in one is more form of comic frustration and disappointment; the bus is exactly the kind of institution that would have Ralph Kramden as its significant symbolic figure.\""}, {"userName": "Louise", "userReviewDate": "Jul 27, 2011", "userURL": "http://www.goodreads.com/user/show/414546-louise", "userReview": "When it's good, it's SO good. But when it's not, it's SO boring. Gopnik's writing can be breathtakingly beautiful when he hits the mark, but it can also be mindnumbingly dull when he misses. More hit than miss with this one, but still too many too long rambles.I really enjoyed Paris to the Moon, but haven't read it in years. I'm wondering now if I felt this way about that one then.I do love his use of words and the love he has for his family, especially his kids really comes through. And being able to read about the NYC places I visited was a treat. I just wish he didn't get lost on endless tangents so often."}, {"userName": "Carla", "userReviewDate": "Feb 25, 2016", "userURL": "http://www.goodreads.com/user/show/51485849-carla", "userReview": "I was not familiar with Adam Gopnik's work - it has been years since I regularly read \"The New Yorker\". I thought that this book was going to read more like a memoir when it actually is a collection of essays - some tied together by the stories of his children. Others felt a bit disjointed. I did enjoy reading about his son and daughter and their lives in post-9/11 NYC, and loved the sensitivity with which he wrote of their childhood views of life. I also found his insightful observations of New Yorkers at that surreal time very compelling. Overall, there was much to like in this collection and I will certainly read \"Paris to the Moon\"."}, {"userName": "rob", "userReviewDate": "Jul 15, 2008", "userURL": "http://www.goodreads.com/user/show/39604-rob", "userReview": "This book is full of really interesting (or perhaps just novel) juxtapositions of personal history and greater ideas; for instance, when replacing his daughter's dead fish with another the author almost goes in for the \"vertigo\" treatment but sort of cops out at the last minute. then amazingly the daughter starts calling the new fish by the old name anyway, which apparently has ties to both his daughter's psychological development and to hitchcock's idea of suspense. i've read this book slowly over time because its more easily digested this way. An odd book, but a good read."}, {"userName": "Suzanne", "userReviewDate": "Feb 20, 2008", "userURL": "http://www.goodreads.com/user/show/888138-suzanne", "userReview": "Although I didn't think this was as good as \"Paris to the Moon\" it should be a must-read for New Yorkers with children or thinking about having children while living in the city. I particularly liked Gopnik's concern over his daughter's over-programmed imaginary friend and the adventures of trick-or-treating in high rise apartment buildings. Basically this is an enjoyable read, well-written with warmth and humor."}, {"userName": "Kate", "userReviewDate": "Jan 03, 2008", "userURL": "http://www.goodreads.com/user/show/119373-kate", "userReview": "I loved this book. Full of chapters that read as short stories (or vice versa), it brought back lots of good memories of the Upper East Side of NYC. The author has terrific insights and conveys them to the reader almost effortlessly. I went back and read the first chapter upon finishing the book...that's how much I enjoyed it."}, {"userName": "Wendy", "userReviewDate": "May 10, 2009", "userURL": "http://www.goodreads.com/user/show/2305259-wendy", "userReview": "I was looking forward to reading this after having really liked \"Paris to the Moon\". However, not nearly as many of the pieces were as gripping to me. There are some really good ones, just a few too many that needed something more. I am not sure how many tidbits I will remember from this one. I remember lots of little moments from \"Paris to the Moon\" and would recommend it enthusiastically."}, {"userName": "Lucas", "userReviewDate": "Mar 27, 2015", "userURL": "http://www.goodreads.com/user/show/3223015-lucas", "userReview": "Gopnik is a liberal, humane essayist with the sensibilities of a stand-up comic (or is it the opposite?), and my enjoyment of his work cannot be overstated. A loveletter to New York City, sure, but more broadly a love letter to all cities, to the flowering of chaos and beauty that comes from the density of a city. If you need a book to affirm your decision to not be a driver, this may be it."}, {"userName": "Marcy Huggins", "userReviewDate": "Oct 05, 2012", "userURL": "http://www.goodreads.com/user/show/13413608-marcy-huggins", "userReview": "An excellent collection of short essays on life in New York, raising children, finding a life philosophy, and being in a marriage. I laughed, I cried, I felt enriched. Can't think off a better recommendation."}, {"userName": "Janet", "userReviewDate": "Feb 09, 2018", "userURL": "http://www.goodreads.com/user/show/15580327-janet", "userReview": "I loved this book. It was sufficiently poignant, but laugh out loud hilarious. If possible listen to the audio book. It's a real NYC book!"}, {"userName": "Krista", "userReviewDate": "Sep 27, 2010", "userURL": "http://www.goodreads.com/user/show/179565-krista", "userReview": "Oh Adam Gopnik. How in love I once was with you. How amazed I was with your facility to dig into layers of everyday life and come up with wise genius. How many times did I read aloud to friends your original New Yorker \"Bumping Into Ravioli\" essay? I still may be in love with you, but this book tested my love, much like Cupid tested Psyche; I turned on the light to see you and you ran away, leaving only a poorly edited, slapped-together published collection of essays to remember you by. You even messed with my beloved Ravioli. Why would you do such a thing?And perhaps, Adam, I still love you but choose not to love one of your books. That is indeed possible. It may, Adam, not even be your fault, as this tome is so New York as to be inconceivable to one who doesn't love New York as you do. Which I categorically do not.Don't get me wrong, Adam. I read the whole thing. And I found many phrases and thoughts to be ponder-worthy. Sadly, some of those phrases and thoughts were repeated, almost verbatim, in different essays, a fault that lies not with you, perhaps, but with your editors. Or with your publishers, who put you on deadline.But even in this slipshod collection of words, your amazing clever wisdom peeks out every once in a great while;\"In my experience, at least, it is the liberal parents who tend to be the most socially conservative-the most queasy at the endless ribbon of violence and squalor that passes for American entertainment, more concerned to protect their children from it. One might have the impression that it is the Upper West Side atheist and the Lancaster County Amish who dispute the prize for who can be most obsessive about having the children around the table at six p.m. for a homemade dinner from farm-raised food.\"\"The art of child rearing, of parenting, is to center the children and then knock them off center; to make them believe that they are safely anchored in the middle of a secure world and somehow also to let them know that the world they live in is not a fixed sphere with them at the center; that they stand instead alongside a river of history, of older souls, that rushes by them, where they are only a single small incident. To make them believe that they can rule all creation, while making them respect the malevolent forces that can ruin every garden: That is the task.\"\"Childhood is just like life, only ten times faster.\"\"We didn't make the children fly. We simply lowered the heavens and told them they were flying, as we always do.\"In conclusion, Adam, I choose to still love you. I will lay this book aside and convince myself to still gasp in excited anticipation when I see your name affixed to an article in the New Yorker table of contents. I will give you a second chance. And, probably, a third chance, too, if need be. Because I know how good you can be."}, {"userName": "Cori", "userReviewDate": "Aug 06, 2007", "userURL": "http://www.goodreads.com/user/show/248780-cori", "userReview": "From my blog:When I was in graduate school, I took a course in travel writing and publishing. Throughout the semester, we had to read a number of books about travel, including Paris to the Moon by Adam Gopnik. In this book of essays, I loved the way Gopnik described the five years he and his wife and young son lived in Paris. He describes the minutiae of everyday life and then brings it around to a larger point on a humanity scale. I loved that book. I listed it as a favorite book back in 2004. So I was very excited when Through the Children's Gate came out. And although it wasn't as good as Paris to the Moon, I did enjoy many of the essays in the book. I wish I had the book here to reference, but of course I've decided to write this review at work sans the book. So I guess you'll have to trust me when I tell you that Gopnik is an amazing word chooser. I feel like he really though about each and every word in his book, making sure each one said exactly what he was trying to say. My favorite essays are those that describe everyday events in his life: the death of his betta fish and how it affected his kids; learning about IMing with his son, thinking LOL means \"lots of love\" and then subsequently signing all emails and IMs (including a few to grieving widows) that way; playing the game Mafia with his friends; and coaching his son's football team with a dying friend.I will say that there are times when I feel Gopnik is name-dropping. Perhaps if I lived in New York and was part of the literary and art scene I would have understood a few of the essays more, but I found myself skimming a couple essays, wishing he'd get back to his personal life. This also happened in Paris to the Moon — I'm just not all that current with French politics, for example. When he goes into name-dropping mode, I feel like he's trying to hard. It's like, \"look at me! I'm Adam Gopnik. And I know all of these people and I'm not really going to tell you their histories because I assume you know them, too.\" It gets a little lofty and that's kind of annoying.Overall, though, I really enjoyed this book. I like Gopnik's style when he's not being supercilious, and I think that it would appeal even more to readers who live (or have lived) in New York.My Rating: 7 out of 10 because Damn. Gopnik knows how to write."}, {"userName": "Patty", "userReviewDate": "Feb 20, 2016", "userURL": "http://www.goodreads.com/user/show/1020899-patty", "userReview": "“We can’t make any kind of life in New York without composing a private map of it in our minds – and these inner maps, as Roger Angell once wrote, are always detailed, always divided into local squares, and always unfinished.” P.3-4Gopnik, like many of the writers for The New Yorker is someone I that I always thought I should read. I have an internal censor who has always believed that reading should be good for you and that entertainment is less important than learning. My training as a librarian only reinforced this idea. I was taught that there are books that are not good enough for a public library.However, I have learned that sometimes reading starts for the pleasure of meeting some new people. So, even though I thought Gopnik might be good for me, I picked this book up because of the title. What is the Children’s Gate? Why does it matter to Gopnik? Turns out it is an entrance to Central Park near a playground and Gopnik saw his return to New York as part of his role as a parent. In 2000 it was time to introduce his children to New York City and so as a family they were entering the Children’s Gate.Now we can look back on the fall of 2000 as a life-changing moment for the whole country, but especially for New Yorkers. I did not realize when I started this book of essays that 2000 was when Gopnik returned to NYC from Paris. The book was published in 2007, which allowed some space between 9-11 and the collection. Some of the essays were written right under that tragic event and had an immediacy that I had almost forgotten.Although some of the essays in this book are a bit dated, if you are interested in families, New York City, good writing, or even revisiting the events of 9-11, you should pick this up. Gopnik is a good parent, with interesting insights into child rearing. He is an excellent writer who finds intriguing subjects including jazz, death and computers. All of these subjects are woven into a fascinating narrative.Other books of essays that I have enjoyed:The Faraway NearbyFor the Time BeingLast Watch of the NightTelling Time: Angels, Ancestors and Stories"}, {"userName": "Elizabeth", "userReviewDate": "Mar 09, 2010", "userURL": "http://www.goodreads.com/user/show/1782141-elizabeth", "userReview": "I wish Adam Gopnik would write books about all the places I've lived. First with his book about Paris, and then in this book of collected essays about New York, he captures with brilliance and eloquence all of the contradictory emotions places and spaces bring to their inhabitants. His accounts are incredibly moving, and this book in particular utilizes his childrens' growth as a metaphor for aging, loss, joy, and wonder. Though some of the selections are reprinted from pieces he published in The New Yorker, many of them were written expressly for this volume, including his tales of his first Thanksgivings back in New York, which punctuate the book and give a sense of the time period it belongs to. Particularly in these longer selections, Gopnik has a gift for weaving together disparate narratives, making them all speak to a single theme with a final flourish of beautifully drafted prose. Of course, part of the book's gravitas is provided by the time period it depicts: just before and in the years after 9/11. But Gopnik is not eager to make mileage of this event as much as he uses it to illustrate larger ideas about New York as a place and its citizens as a people. As a result his book feels like it will matter long beyond the years it chronicles and will speak to a far greater breadth of readers than those who inhabit the island of Manhattan. I can't recommend it enough."}, {"userName": "Cheryl Klein", "userReviewDate": "Dec 12, 2009", "userURL": "http://www.goodreads.com/user/show/131016-cheryl-klein", "userReview": "I adored this book -- a wonderful account of parenthood and living in New York, and observation of childhood and its pleasures and strangenesses, especially in New York. This contained two of my favorite essays from the New Yorker, which I'm happy to have between hard covers: \"Bumping into Mr. Ravioli,\" his account of his three-year-old daughter's imaginary friend, who is too busy to play with her (only in New York, kids, only in New York), which he expands into a meditation into the busyness of all our modern lives; and \"Last of the Giant Metrozoids,\" about his friend, the MoMA curator Kirk Varnedoe, coaching an eight-year-old boys' football team as he prepares some lectures on modern art and faces his death via incurable cancer. (The last one always makes me cry, and earns the tears.) But I had never read the bulk of the pages here, including his reflections on 9/11, his account of analysis with a great Freudian (final conclusion: \"Life has many worthwhile aspects\"), his misunderstanding the meaning of \"LOL\" as \"Lots of Love.\" He excels at seeing the world in a grain of sand, which can occasionally be a bit tiring; sometimes a kid's passing remark is just a passing remark. But more often it opens up new connections, new depths and delights. I recommend this highly for all parents, New Yorkers, and fans of lovely writing."}, {"userName": "Erik", "userReviewDate": "Jun 17, 2008", "userURL": "http://www.goodreads.com/user/show/1219617-erik", "userReview": "While Adam Gopnik was penning this latest collection of essays and observations about New York post 9/11, I was reading his first book “Paris to the Moon” – which recounted his Gallic sojourn pre-9/11. Now almost seven years later, I’m confess to being a bit disappointed – over-all – when comparing his latest offering to that sense of wonder when reading him for the first time. As a whole, “Through the Children’s Gate” was disjointed. Despite several top-notch essays, one too many of those included in this volume don’t have much to do with either being a father, his children, or both – which naturally left me befuddled. (Why include them? Leave them for publication in The New Yorker – his literary home and haunt – if you ask me.) Yet many of the essays are worth the price of admission as they focus on the vagaries of being a father to two young children growing up in the Big Apple – notably the “Thanksgiving” quartet, “Bumping into Mr. Ravioli”, and “Death of the Fish.” Of which several of these put a wry smile on my face with his Lord of the Rings and “Vertigo” allusions. Clever man, that Adam Gopnik."}, {"userName": "Hilary", "userReviewDate": "Feb 04, 2009", "userURL": "http://www.goodreads.com/user/show/1702050-hilary", "userReview": "This is yet another book I have owned for ages and only just finished reading now. This book was an impulse purchase, bought out of curiosity and with no knowledge whatsoever as to what the book was about.. or even who the author was. One of those, and yet this book ended up being quite the pleasant surprise.The book is comprised of essays, all dealing with the topic of turning New York City into one's home. The essays, for the most part, take place post-9/11 and the topic of that atrocity does come into play. For the most part, the essays are rather entertaining and involve the writer's family life. Honestly, the book is well worth reading just for the essay on Ravioli, his daughter's imaginary friend. The book is touching, incredibly funny, a bit sad, and a bit contemplative. It gives you things to think on without turning preachy. I would happily recommend this to anyone who enjoys say, Shirley Jackson's essays on family life. Domesticity can be quite an entertaining thing."}, {"userName": "Juli", "userReviewDate": "May 28, 2008", "userURL": "http://www.goodreads.com/user/show/1177828-juli", "userReview": "Written by a writer for the New Yorker, an ex ex-pat's renewed view of New York and the New York City life. Lots of it is too true and eerily parallel to so many of us New Yorkers. All current ex-pats from New York should read this to make you more homesick than you are now - you know who you are!A good friend of mine gave me this book because based on the title, she thought it was about bringing up kids in NYC. Since I thought I knew all about this subject, I let it sit on my shelf for 6 months and recently opened it and to my surprise, the title is a misnomer - editors take note. Yes, it is about a family moving back to NYC after living in Paris for 5 years, but the references to children and children's activities and observations are minute. So, now my friend will be disappointed, not me.This collection of essays about living in the Big Apple is hilarious, more fun than a Seinfeld episode and if you are one to find humor in a person who is adept at self deprecation, you will find this a great read!"}, {"userName": "Keerthik", "userReviewDate": "Apr 27, 2008", "userURL": "http://www.goodreads.com/user/show/1087406-keerthik", "userReview": "in general, a mild mannered cosmopolitan take on - what some might derisively call, the \"bourgeois\" lifestyle in the early years of the new millennium. it is a remarkably well thought out, compassionate book, with a concern for children - their growth, their troubles - as seen by a somewhat bemused and intelligent parent. the book contains many stellar passages about life prior to 9/11 and the immediate aftermath -- the effects of that event on sensibilities all around. he writes about shopping, cooking, raising children, Purim festivities, children's imaginary friends etc etc., splendidly humane liberal take on most affairs. what surprisingly struck me is the absence of any kind of malice in the writer's voice - no snide put downs, no efforts to shine at others' expense, no culturally chauvinistic ruminations - and i suspect, in real life too, Adam Gopnik might be a great guy to hang out with. for any one looking for a great read, fun as well as literary -- this is to be wholeheartedly recommended."}, {"userName": "Lormac", "userReviewDate": "Dec 13, 2011", "userURL": "http://www.goodreads.com/user/show/3743024-lormac", "userReview": "Well, I liked it, not as much as \"Paris to the Moon\" but I am having a hard time saying why. Maybe Paris seems exotic to me so a NYC writer's essays on life in Paris are fascinating whereas, since I lived in NYC, essays on life in NYC seem less interesting. Also, I had a really hard time with the essay on Gopnik's therapy - I lost a little respect for him, and that is not good when the reader is expected to credit the writer with insight sufficient to merit attention to his essays. If you don't have a lot of respect for the writer, can you care whar he has to say on a particular topic? Fortunately, Gopnik redeemed himself with the Purim story essay which I loved, so I was back in his corner, but the book zigged and zagged in a way that Paris to the Moon did not.I know this review is a bit fuzzy. I suppose the outcome is that I would definately read Gopnik's next book so that either means I did not dislike this book all that much, or I am a hopeless optimist!"}, {"userName": "Carolinecarver", "userReviewDate": "Sep 29, 2011", "userURL": "http://www.goodreads.com/user/show/1582255-carolinecarver", "userReview": "I love Gopnik and Paris to the Moon may have been one of my favorite books, but while I love New York and fantasize about living there, this didn't quite reach the five stars I would give to his Paris book. I found his description of his daughter's imaginary friend, Charlie Ravioli, who was too busy to play with Olivia so charming, and I think his thoughts on child-rearing, whether in NY or elsewhere, were astute and could be part of a manual for parents anywhere. I had a lump in my throat reading about teacher, art critic and friend, Kirk Vardandoe, who coached his son's football team and taught them all such valuable lessons for football and life. The fears and insecurities that arise after 9/11 and then recede as daily life with children and work must continue, and the way his son deals with these fears is briliantly rendered. All-in-all a great book and one I would highly recommend to any parent and to anyone who loves New York."}, {"userName": "Christina Boyle", "userReviewDate": "Dec 01, 2014", "userURL": "http://www.goodreads.com/user/show/2927839-christina-boyle", "userReview": "Adam Gopnik writes pretty prose. It is verbal meditation and it is nice to feel emotion - as you do when you read the stories. I have the book by my bed to read one essay before going to bed each night but his prose is intelligent and requires concentration so a half sleepy reader is going to miss out. The most intense essay is the Last of the Metrazoids. It made me cry. It's interesting to read the book some 10+ years after the WTC attack. New Yorkers treated each other with such kindness and preciousness in the aftermath after the terrorist attack. Most of that community spirit has since withered away, as it does with time. It is however a nice reminder over the holiday - in reading the essays - to feel grateful for community, even if of strangers."}, {"userName": "Jamie", "userReviewDate": "Aug 22, 2011", "userURL": "http://www.goodreads.com/user/show/568829-jamie", "userReview": "Ugh. I had high hopes for this book considering how much I loved Paris to the Moon. I was hoping this would be similar but it was not. There are so many weird references and literary name drops that made no sense to me that I found myself asking - what the hell is he talking about? And not caring enough to figure it out. And unfortunately, Gopnik falls into the trap of so many NYers that have convinced themselves that the world revolves around NY, and everything about NY is unique and precious and couldn't possibly be happening anywhere else. And that the rest of us are just as enamored of NY as they are. Barf. If you read other reviews, you'll see most of the 5 star ratings come from fellow NYers who share his myopic view of the world. Huge disappointment."}], "description": "Following the best-selling \"Paris to the Moon, \" the continuation of the Gopniks' adventures against the panorama of a different though no less storied city as they attempt to make a new home for themselves. Autumn 2000: After five years in Paris, Adam Gopnik moves his family back to a New York that seems, at first, safer and shinier than ever. Here in the wondrously strange \"neighborhood\" of Manhattan we observe the triumphs and travails of father, mother, son, and daughter; and of the teachers, coaches, therapists, adversaries, and friends who round out the extended urban family. From Bluie, a goldfish fated to meet a Hitchcockian end, to Charlie Ravioli, an imaginary playmate who, being a New Yorker, is too busy to play, the Gopniks' new home is under the spell of the sort of characters only the city's unique civilization of childhood could produce. Not long after their return, the fabric of living will be rent by the events of 9/11, but like a magic garment will reweave itself, reviving normalcy in a world where Jewish jokes mingle with debates about the problem of consciousness, the price of real estate, and the meaning of modern art. Along the way, the impermanence and transcendence of life will be embodied in the person of a beloved teacher and coach who, even facing death, radiates a distinctively local light. Written with Gopnik's signature mix of mind and heart, elegant and exultantly alert to the minute miracles that bring a place to life, \"Through the Children's Gate\" is a chronicle, by turns tender and hilarious, of a family taking root in the unlikeliest patch of earth.", "title": "Through the Children's Gate: A Home in New York", "url": "http://www.goodreads.com/book/show/7111.Through_the_Children_s_Gate", "average": 3.72, "cover": "https://images.gr-assets.com/books/1389239038l/7111.jpg", "reviews": 161, "authors": [{"url": "https://www.goodreads.com/author/show/4747.Adam_Gopnik", "name": "Adam Gopnik"}], "type": ["Autobiography", "Nonfiction", "New York", "Writing", "Travel"], "outlinks": ["http://www.goodreads.com/book/show/7111.Through_the_Children_s_Gate", "http://www.goodreads.com/book/show/9685787-una-casa-a-new-york", "http://www.goodreads.com/book/show/7003959-through-the-children-s-gate", "http://www.goodreads.com/book/show/320300.Through_the_Children_s_Gate", "http://www.goodreads.com/book/show/498106.Through_the_Children_s_Gate", "http://www.goodreads.com/book/show/6081720-through-the-children-s-gate", "http://www.goodreads.com/book/show/7062.Paris_to_the_Moon", "http://www.goodreads.com/book/show/7113.The_King_in_the_Window", "http://www.goodreads.com/book/show/10529697-the-table-comes-first", "http://www.goodreads.com/book/show/6071984-angels-and-ages", "http://www.goodreads.com/book/show/4586825-the-best-american-essays-2008"]}