{"ratings": 118, "userreviews": [{"userName": "Pamela", "userReviewDate": "Apr 18, 2017", "userURL": "http://www.goodreads.com/user/show/20048096-pamela", "userReview": "\"We are all faced with a series of great opportunities brilliantly disguised as impossible situations.\" ~ Charles Swindoll Lacey Buchanan is an amazing woman. A mighty faith-elevating warrior and an advocate for families faced with disability challenges. Families with precious, beautiful children such as her own little boy - Christian. The Buchanans have been through hell and back solidifying their courage, rebuilding their lives, and strengthening their faith through their son's physical birth malformations/defect challenges. \"Sometimes God allows what He hates, to accomplish what He loves.\"Defect, is a word I loathe. To me, it creates a perception of \"less-than\" - something abnormal and to be pitied. Christian is in no way a \"less-than\" child or to be pitied, as evidenced by Lacey's YouTube videos, Facebook page, and this inspirational biography/memoir. \"Christian is fearfully and wonderfully made. I, in my sin and craziness, am fearfully and wonderfully made. And this perspective helps me during encounters with others. No matter how people act they also are fearfully and wonderfully made.\"This book touched my heart and lifted my soul in numerous ways. And that is exactly what Lacey Buchanan hoped for when writing it. \"God pours us broken into this His refining fire to mold us, and I was more than ready for Him to douse the flames.\"However, it is also a bittersweet, heart wrenching book, in that, the Buchanans have been tested by many fires: daunting medical decisions; struggles to find competent doctors willing to 'listen' and treat with compassion; insurance rejections and appeals; public negativity and cyber bullying (it is unreal how insensitive some people can be). \"When people have nothing better to do with their time, they troll the internet. they look for ways to be divisive because they're unhappy with something in their own lives that they don't understand how to deal with.\"And of course, Lacey and her family have the same struggles as any young family, but with added stressors: juggling work and school schedules; long commutes; bills-bills-bills and more bills; medical transportation needs; loads of medical equipment to pack and tote . . . The list is really endless when caring for a disabled/other-abled child. The book itself is simplistically and conversationally written and should appeal to a broad audience, whatever one's reading comprehension level. And precious are the many photos. How could anyone not love this family? However, the book isn't without a few snafus. Line editing was sub-par. The non-linear, back and forth way in which the story is told, oftentimes back-and-forth within chapters and without delineation, gave me momentary confusion, where I'd have to go back a few pages to properly pick-up the thread. Lastly, the writing is a bit grammatically challenged. Which would be okay, Lacey not being a wordsmith, if not for the fact it was co-authored by presumably a professional writer???? \"What is life but God's daring invitation to a remarkable journey?\"All in all, snafus included, Through the Eyes of Hope: Love More, Worry Less, and See God in the Midst of Your Adversity a noteworthy, recommendable book. I pray it helps others in their times of challenging, worrisome circumstances, and life-changing detours. It did for me. FOUR **** Poignant, Inspirational Memoir of Faith, Courage, and Hope Renewal in Times of Life's Daunting Challenges **** STARS"}, {"userName": "Karen", "userReviewDate": "Dec 10, 2016", "userURL": "http://www.goodreads.com/user/show/20390649-karen", "userReview": "Lacey Buchanan tells the story of her family in this book. Her son Christian was born with Tessier's Cleft palate, one of only a several in the world. This means that his palate was not formed and his face did not look \"normal\". He was also born with no eyes, so he is blind. Christian would have to endure several surgeries though out his young life, the first at 4 days old. Lacey tells of her and her family's struggle in those first days, when Christian was in the NICU and it seemed that her world was crashing. She talks about her faith and specific verses that would come just when she needed hope and inspiration. Throughout the book, Lacey gives God the glory but also some of the blame. She went through the \"why me, why my son\" and lets the reader see her doubts and her confidence in God. As I was reading this book, I remembered when I first saw Lacey and Christian here: https://youtu.be/oWCbkyR0cy0 This link showed up in my Facebook feed, shared by a friend. I watched this video and had tears flowing down my face. I sought her our on Facebook and \"friended\" her. To my surprise, she accepted my request and I have followed her and her family for several years. She does not sugar-coat her story. In her book, she tells it like it is. Ups, downs, hurts, and successes are all shared with the reader. I really liked the way her book is written, like she is having a conversation with just the person reading her story. I highly recommend this book for those who need inspiration and especially for those who have struggled with the same issues of not being heard. What people need to remember is that children are just children, whether they have special needs or not. We love our children BECAUSE they are our children, even before they draw their first breath of air. I was given an advance reader copy from the author and the publisher in exchange for my honest opinion."}, {"userName": "Michelle Kidwell", "userReviewDate": "Nov 08, 2016", "userURL": "http://www.goodreads.com/user/show/6011726-michelle-kidwell", "userReview": "Through the Eyes of HopeLove More, Worry Less, and See God in the Midst of Your Adversityby Lacey BuchananCharisma HouseChristian, Religion & SpiritualityPub Date 10 Jan 2017 I am voluntarily reviewing Through the Eyes of Hope through the publisher and Netgalley.Lacey Buchanan struggles through the pregnancy with her Son Christian, who early on she learns will be born with a birth defect.The author talks about her struggle with having to go home while her baby was still in the NICU.Lacey Buchanan goes on to talk about the struggles with surgeries, but also the everyday joys she gets with her Son.The author shows us that despite Christian's disability he is a happy, joyful, child.I give Through the Eyes of Hope five out of five stars.Happy Reading."}, {"userName": "Felecia Efriann", "userReviewDate": "Jan 31, 2017", "userURL": "http://www.goodreads.com/user/show/7528797-felecia-efriann", "userReview": "Once I began reading this book, it was hard to put down. The way Lacey Buchanan told her story in Through Eyes of Hope is captivating and heart-wrenching. She shares her story with honesty through sharing all the details of how each challenge she faced effected her. Her overall, the story is an encouragement that even during our difficult times in life God can and will bring something beautiful out of it. Her experiences challenged me to look at the various things I face in life through eyes of hope. Instead of dwelling upon all the things that are not working to look to all the ways God is working in those situations. Lacey's story of hope is a great read that connected me to her experience causing my heart to ache with hers at different moments. Lacey grew through her experiences. I grew through reading her story. I highly recommend reading Lacey's story, Through Eyes of Hope. Through Eyes of Hope is a story of how God shows up through all sorts of challenges Lacey Buchanan faced during her journey to Motherhood."}, {"userName": "Connie", "userReviewDate": "Jan 15, 2017", "userURL": "http://www.goodreads.com/user/show/25099521-connie", "userReview": "Through the Eyes of Hope is an inspiring look at how a young couple rose to the challenge of caring for their son, Christian, who was born with special needs. They refused to give up hope, and at times even had to challenge the medical community to get the very best health care they could for him. At times, tears flowed down my face as I read about the things this young family went through. As many of us probably do when we read stories like this, I wondered if I would cope as well as they have, and then find the strength to rise to the challenge. I honestly felt exhausted reading about Lacey’s schedule when she got home from the hospital. May The Lord bless them and always make His face shine upon them. I don’t see how anyone could read a book like this and not come to realize beyond a shadow of a doubt that God works in the lives of His children. I highly recommend this."}, {"userName": "Malin Friess", "userReviewDate": "May 16, 2017", "userURL": "http://www.goodreads.com/user/show/1400585-malin-friess", "userReview": "Lacey Buchanan tells her families story of having a child who is born with significant disabilities (blindness, cleft lip and palate, and facial deformity). Her story became nationally known after a 7 minute you tube clip backed with Christian Music and flash cards of her story (anticipation, excitement, finding out of the disability, grief, confusion, and sadness when some suggested they would have been better off if they had aborted) went Viral. Watch it..it might make you cry. This book will of course appeal to strong pro-life conservative Christians. I admired how involved Lacey was with the details of Christian's medical and surgical care. At times she was not afraid to challenge insurance companies to get the best care and also challenge surgeons--and she was often right--helping her son to avoid unneeded surgery.4 stars. God does indeed make each child special--and gives parents the strength they need."}, {"userName": "Nancy DeValve", "userReviewDate": "Sep 11, 2017", "userURL": "http://www.goodreads.com/user/show/51637493-nancy-devalve", "userReview": "Lacey Buchanan writes about her son who was born with a severe cleft palate and without eyes. At first she would try to hide him when she was in public and she questioned God about why He allowed her to have such a handicapped child. But she came to understand that God uses tragic circumstances for His glory and that her little boy's story needs to be told. She is open about the rocky time their marriage went through as they both dealt with this challenge in their own ways. It is a beautiful and heart-touching story. As far as the writing itself, I felt that she jumped around a lot and it wasn't really written in a chronological order so I felt that things were repeated and felt a bit confused about where and when certain things were happening. For that reason alone I gave it four stars instead of five."}, {"userName": "Karen Bandi", "userReviewDate": "Jan 27, 2017", "userURL": "http://www.goodreads.com/user/show/64345608-karen-bandi", "userReview": "LOVE LOVE LOVE this book. It is definitely a must read.. Lacey Buchanan is the greatest mom and is such a strong person.. Her baby was born with a birth defect that is very very rare, He had Tessar cleft and Christian was born without eyes. Instead of letting it get her down, She fought for her little one and proved the doctors wrong. Christian is beautiful, smart intelligent and loves life. You definitely see God in this story. I loved it so much. You won't be disappointed get the book and be amazed at this beautiful story and their beautiful life."}, {"userName": "Marilee Kelhoffer", "userReviewDate": "Jul 09, 2017", "userURL": "http://www.goodreads.com/user/show/69143601-marilee-kelhoffer", "userReview": "I knew this story before I read the book, but was interested in reading the details of their journey. I'm sad to say I had a really hard time reading this. The story was hard to follow and seemed to jump around a lot. I wish the chapters were in chronological order or were at least titled with a date. That being said, the way the mother has advocated for her child is inspire and I look forward to hearing about their future."}, {"userName": "Pop Morgan", "userReviewDate": "May 08, 2017", "userURL": "http://www.goodreads.com/user/show/39401418-pop-morgan", "userReview": "AmazingA well written true story straight from the heart. I loved the photos of the little family and the way modern technology shared the heartaches and joys all over the world."}, {"userName": "Debbie Lipscomb", "userReviewDate": "Jun 09, 2017", "userURL": "http://www.goodreads.com/user/show/25303034-debbie-lipscomb", "userReview": "This is the inspiring story of the challenges and blessings of having a special-needs child. The author's candor reflects her faith and the lessons that she has learned since God placed Christian in her heart."}, {"userName": "Alice", "userReviewDate": "Mar 14, 2017", "userURL": "http://www.goodreads.com/user/show/5756197-alice", "userReview": "<3 I have been following Christian's life since he was a baby! He is now 5. I follow his antics on facebook and I admire Lacey. He can smell my hands any time! ;-)I am a tough reviewer so Lacey, I love you and Christian, but I can't do 5 stars. It isn't that the story isn't amazing, inspiring, wonderful, faith promoting, it just doesn't have the same elements that I would judge a similar book that are 5 stars. It is written by the author (with the help of Bethany Jett) (and read by the author which can be it is really good or a nightmare but I enjoyed hearing the accent) It does skip around but a bit (not Chronological which might have been better for me because we talk about Chandler being born, but yet he is mentioned in early chapters.) You can still follow it but I am boring and like things in order!  HOWEVER, it is great story, faith promoting and worth a read! I am a tough review so, when/if I publish my book just throw stones and be brutal!"}, {"userName": "Lindsey (Books for Christian Girls)", "userReviewDate": "Jan 07, 2017", "userURL": "http://www.goodreads.com/user/show/19266895-lindsey-books-for-christian-girls", "userReview": "About this book:“Understand how God turns tragic circumstances into something beautiful for His glory, while you love more, complain less, and see God at work in the most unlikely of places. “Now faith is the substance of things hoped for, the evidence of things not seen.” Hebrews 11:1, MEV What happens when things don’t go as planned? What happens when the storm you face is completely out of your control? The Buchanans’ precious son Christian was born with a medical condition that is so incredibly unique, it’s one of only fifty known cases in the world. This story has captured the hearts of hundreds of thousands. In Through the Eyes of Hope Lacey Buchanan tells this compelling story of trusting God in the face of adversity. You will be moved and inspired to hold on to God’s promises when things go wrong and find joy in midst of any storm.”Series: No. Spiritual Content- Isaiah 42:16 in the acknowledgments; Many Scriptures are quoted, mentioned & referenced; Prayers; Many talks about God, Jesus, hope & His strength; Talking to & wrestling with God; ‘H’s are capital when referring to God; Many mentions of God; Mentions of prayers & thanking God; Mentions of church going, Sunday school, a youth group, baptism & a pastor; Mentions of blessings; Mentions of Christian songs & artists. Negative Content- Minor cussing including: two ‘oh my gosh’s and two ‘stupid’s; Many mentions of a baby’s pain & cries (up to semi-detailed); Mentions of abortions (that it wasn’t an option for this family); Mentions of awful & hatred comments from people (some are written); A couple mentions of murder & murderers; A mention of alcohol; A mention of cigarette smoke.*Note: A couple mentions of passing gas; A mention of poop.Sexual Content- A couple mentions of awful comments about preforming sexual acts to something (goes into it a bit about their twisted plans); A mention of a comment threatening rape; A mention of a kiss; *Note: Mentions of periods, bleeding, pain & a possible miscarriage (up to semi-detailed); Mentions of labor & pain (barely-above-not-detailed); Mentions of breastfeeding, nursing & breast milk; Mentions of modesty & a church’s strict rules; A couple mentions of pregnancy hormones; A couple mentions of telltale body parts in an ultrasound.  {Non-fiction} 195 pages~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*Pre Teens- One StarNew Teens- One Star (and a half)Early High School Teens- Three Stars Older High School Teens- Four Stars My personal Rating- Four StarsI can’t recall how I started following the Buchanan family, but I know it’s been around two-three years since I started. I love seeing pictures of sweet Christian and Chandler in my news feed on Facebook. This non-fiction read wasn’t quite what I was expecting, it had more of the medical side of it all than I was expecting, for one. I, of course, wasn’t a fan of the awful comments that this family have received were written out…less is better and I personally believe that we don’t need that negativity and those prevented comments in our heads. I am so sorry that the family had to read those comments, but I’m also sad that it had to be put in this book as well. Christian’s story is inspiring, regardless, and I know the Lord will continue to use that precious little boy. Link to review:https://booksforchristiangirls.blogsp...*BFCG may (Read the review to see) recommend this book by this author. It does not mean I recommend all the books by this author.*I received this book for free from the Publisher for this honest review."}, {"userName": "Mary", "userReviewDate": "Mar 09, 2017", "userURL": "http://www.goodreads.com/user/show/29384665-mary", "userReview": "A raw, honest, beautiful read about an amazing boy and his loving family! It's heatwrenching at times, but the way the author / mother weaves in God's passion and His light among darkest times is uplifting. \"Jesus, I trust in you!\" I have added this family to my prayers!"}, {"userName": "Ashlee", "userReviewDate": "Feb 16, 2017", "userURL": "http://www.goodreads.com/user/show/4580516-ashlee", "userReview": "For a first time author, I thought the book was well-written, although I know she of course had help. I have been following Lacey's story for years now (since the video she made with Christian went viral). I am so happy that she has been given such a platform to tell her story and to inspire others to be compassionate and loving towards children with disabilities, as well as sharing her story of going from a timid nervous first time mother to a raging mama bear who became an advocate for her child. I have the utmost respect for Lacey and I look forward to continuing to enjoy her posts and stories about her family, their life, Christian's progress, and all the fun moments."}, {"userName": "S.K.", "userReviewDate": "Feb 22, 2017", "userURL": "http://www.goodreads.com/user/show/35501116-s-k", "userReview": "Loved this book. Lacey Buchanan's got a great voice and the story is so inspiring! Lots of for this family now!"}, {"userName": "Amy", "userReviewDate": "Jan 10, 2017", "userURL": "http://www.goodreads.com/user/show/10904482-amy", "userReview": "Through the Eyes of Hope is very inspiring. Lacey has a realistic and beautiful view of how God works and has worked in her life. The circumstances that she and her family have been dealt with go way beyond a physical deformity that their son was born with. This is really a story of a mother's love. I am a mother of two and yet I was in awe of the lengths Lacey went: her ability to listen to her mother's intuition and her bold presence throughout Christian's life. I found myself asking, \"Would I have done that? Would I have known to get that second opinion? Am I being the voice for my own children that I need to be?\" At the end of the book, she asks what did reading their story do for you? For me, it made me pay attention a little bit more, listen to that motherly instinct a little stronger and to not let mileage or money get in the way of what you know is right for your family. Living in the same small town as the Buchanan's, it is so easy to say \"Well, our town doesn't offer that so my children can't participate.\" But that should not be an excuse. What is a thirty minute or one hour drive to Nashville if it is going to enhance your children's life? Well done Lacey. So proud to know you!"}, {"userName": "Shari L DiBrito", "userReviewDate": "Jan 10, 2017", "userURL": "http://www.goodreads.com/user/show/34047513-shari-l-dibrito", "userReview": "The strength of this mother is a reflection of her love for, and reliance on Jesus. Christian's struggles are real, but they do not define him. Christian has the support of so many people, from family to doctors and friends, to tens of thousands of people who pray for him. I am on my second reading so that I can savor the work of the Savior and the love of these special parents. This is a book about parents and children; husbands and wives; relationships with Jesus; perseverance; advocacy and acceptance. You will fall in love with this family as you travel through six years of their lives. They can be found on facebook by searching for Lacey and Christian Buchanan. This book has given me a renewed respect for parents of non-typical children. it has also made me reflect on my own reliance on Jesus and how I can grow in various areas of my life. This book is a keeper and will have a permanent place on my bookshelf. I will definitely be buying copies to give as gifts. It is the proverbial gift that keeps on giving. You won't be disappointed!! This book is extremely well written and would make for a good selection for a book club. ***Disclaimer: I was given an advance copy of this book. This in NO WAY influenced my review."}, {"userName": "Debbie Miller", "userReviewDate": "Jan 10, 2017", "userURL": "http://www.goodreads.com/user/show/63724688-debbie-miller", "userReview": "I was honored to be a part of the launch team for this book. From beginning to end, this book show's how God's love is never ending! This story is about a family finding out that their first child, precious baby Christian, will have a rare disability. It chronicles their journey through the tears, pain, and laughter, and joy. It is the most inspirational story you will ever read!! You will not be able to put the book down!! You will fall in love with Lacey and Christian as you get to know them and their precious family. Lacey and Chris never give up and always keep fighting for their baby, Christian, so that he will have the best life possible.If you are the parent of a special needs child, as I am, this is a must read!! You will learn that you are the voice for your child!! Lacey shows so many times in this book that you learn to always listen to your inner \"Mommy voice\". You will learn many things about becoming your child's advocate. Being a special needs parent isn't an easy road, but there are many, many joyous times, as you will read in this wonderful book.God's love gives us Hope...ALWAYS!"}, {"userName": "Jan Nickell", "userReviewDate": "Jan 11, 2017", "userURL": "http://www.goodreads.com/user/show/4979540-jan-nickell", "userReview": "I believe God puts us in a certain place at a certain time for a reason.....and I believe God put me on Facebook when I happened upon the most touching video of this mother with a baby in her arms flipping through pieces of paper telling her story of her love for her child. I did not expect to see her son, Christian who was born without eyes in this momma's arms. I have followed Lacey and Christian on Facebook ever since. Their story is honest, it is real and it will move you to tears! Lacey tells you of the struggles they have faced but with their determination, their hope and their trust in God, Christian will have a loving life surrounded by his parents, his little brother and actually, the world! We have all fallen in love with this little boy who doesn't know he's different.....he inspires me! And he will inspire you! You must read this book! Thank you Lacey for sharing your son with me!"}, {"userName": "J. A.  Lewis", "userReviewDate": "Jan 10, 2017", "userURL": "http://www.goodreads.com/user/show/31563790-j-a-lewis", "userReview": "It's 1:14 a.m. and I just finished Lacey Buchanan's book. I was one of the people who happened upon the video she did on her pregnancy and Christian's birth and have followed her on Facebook ever since. This book is an honest accounting of Lacey's life with Christian both during and after his birth. The early days of Christian's life were beyond difficult but Lacey meets each challenge with grace, determination and faith that can move mountains. While not every dr. or nurse treated the Buchanan family and Christian the way they should have, Lacey truly has been able, through God's direction and grace, to redirect her course and fill it with incredibly generous and kind people and talented physicians. She is an inspiration. You won't read this one without shedding a tear or two, but it is worth every one you'll shed. Bless you Lacey and Chris. I only hope I will be able to meet you both someday and have Christian run his hands over my wrinkled face. He is a blessing to so many."}, {"userName": "Kendra", "userReviewDate": "Nov 27, 2016", "userURL": "http://www.goodreads.com/user/show/2776972-kendra", "userReview": "I was asked by the author and publishing to give my honest review. Lacy Buchanan fairy tale started like everyone else. She met the love of her life and they were married. Then came a baby in a baby carriage. But things were not like they seem. Lacey Buchanan's son Christian was born with a medical condition that is so unique, it's one of only fifty known cases in the world. This story has captured hearts of hundred of thousands. In \"Through the Eyes of Hope\", Lacey Buchanan tells story of trusting God in the face of adversity. You will be moved and inspired to hold on to God's promises when things go wrong and find joy in midst of any storm....Read more of the review at:http://lifeofstay-at-homemom.blogspot..."}, {"userName": "Theresa Smith", "userReviewDate": "Jan 23, 2017", "userURL": "http://www.goodreads.com/user/show/17811570-theresa-smith", "userReview": "I became familiar with Lacey Buchanan from her video about her son. I enjoyed learning more about her family but was surprised at the size of the book. It's a very quick read but I would have enjoyed reading in more depth about their experiences. Lacey is an attorney so it was surprising when she wrote so simply and used slang or social media lingo to make a point. Overall, though, she is an amazing woman and I am proud of her efforts to promote the dignity of human life. Her son, Christian, is lovable and a beautiful example of the gift of life. I hope her story gets attention to bring dignity to the lives of the disabled."}, {"userName": "Kelly Lindsay", "userReviewDate": "Jan 28, 2017", "userURL": "http://www.goodreads.com/user/show/60708166-kelly-lindsay", "userReview": "What a wonderful story. I was lucky enough to be chosen to be on a launch team for this book. I received a early edition and could not wait to read it and had a hard time putting it down. It is a story of hope. I have followed Lacey just after Christian was born. I saw a video she had put on Facebook and fell in love with her + Christian and have followed them every since. She gives anyone with a special needs child or adult a reason to always listen to the MOMMY inside you. You will laugh, cry and cheer when you read her story. Thank you Lacey + Chris for sharing your story + family with us."}, {"userName": "Andrea Carman", "userReviewDate": "Dec 03, 2016", "userURL": "http://www.goodreads.com/user/show/62184835-andrea-carman", "userReview": "You know, I defy the term \"disabled\" as some would apply it to Christian. I would say instead that he is a normal kid with some \"limitations.\" But, come on. He only has a handful of limitations. I have met this kid. He is a fighter. He's giving life everything he has, and in my estimation, he's a normal kid. This book is an expertly written account of one mother who chose to believe that her son is a gift - a person to be treasured and loved. This book is heartwarming, engaging, motivating, and passionate. Let your mind be transported to Woodbury, TN; and listen to the emotional memories of a courageous woman who helps her son see the world \"Through the Eyes of Hope.\""}, {"userName": "Diana", "userReviewDate": "Dec 15, 2016", "userURL": "http://www.goodreads.com/user/show/45999665-diana", "userReview": "This book was amazing!! I love seeing how God works in miraculous ways. This is definitely a book I would recommend to everyone who just needs an uplifting reminder that through all our trials and problems, God is there. He is walking us through it all and His plan is the best there is for us. This book is a story of hope that will bring a smile to anyone's face. I would absolutely be overjoyed to be able to meet Christian and the whole Buchanan family one day. They all inspired me through this book to seek God more and to read His word. Definitely a 5 star read! Thank you so so much Netgalley for this amazing book in exchange for an honest review!"}, {"userName": "Amanda", "userReviewDate": "Dec 15, 2016", "userURL": "http://www.goodreads.com/user/show/1449611-amanda", "userReview": "Rarely in life do we get what we want all the time. Lacey Buchanan is no exception to this. She has taken a situation that many people would be devastated by, and turned it into something beautiful and heartwarming that we can all learn from."}], "description": "Understand how God turns tragic circumstances into something beautiful for His glory, while you love more, complain less, and see God at work in the most unlikely of places. “Now faith is the substance of things hoped for, the evidence of things not seen.” Hebrews 11:1, MEV What happens when things don’t go as planned? What happens when the storm you face is completely out of your control? The Buchanans’ precious son Christian was born with a medical condition that is so incredibly unique, it’s one of only fifty known cases in the world. This story has captured the hearts of hundreds of thousands. In Through the Eyes of Hope Lacey Buchanan tells this compelling story of trusting God in the face of adversity. You will be moved and inspired to hold on to God’s promises when things go wrong and find joy in midst of any storm.", "title": "Through the Eyes of Hope: Love More, Worry Less, and See God in the Midst of Your Adversity", "url": "http://www.goodreads.com/book/show/30757973-through-the-eyes-of-hope", "average": 4.52, "cover": "https://images.gr-assets.com/books/1473601799l/30757973.jpg", "reviews": 33, "authors": [{"url": "https://www.goodreads.com/author/show/15403049.Lacey_Buchanan", "name": "Lacey Buchanan"}, {"url": "https://www.goodreads.com/author/show/6535008.Bethany_Jett", "name": "Bethany Jett"}], "type": ["Christian", "Biography", "Nonfiction", "Biography Memoir", "Christian"], "outlinks": ["http://www.goodreads.com/book/show/30757973-through-the-eyes-of-hope", "http://www.goodreads.com/book/show/33829078-through-the-eyes-of-hope", "http://www.goodreads.com/book/show/32824257-40-days-of-hope"]}