{"ratings": 380, "userreviews": [{"userName": "Mark Stevens", "userReviewDate": "Dec 21, 2015", "userURL": "http://www.goodreads.com/user/show/2410049-mark-stevens", "userReview": "\"Too Bad To Die\" (wouldn't Lee Child have loved that title?) is so brisk and light on its feet, that you’ll be sucked right in to this whirling plot involving British Naval Intelligence Officer Ian Fleming and the Tehran Conference of 1943.Told with fast-shifting points of view and a library’s worth of savory historical detail, this spy-thriller-suspense novel mashes the form in spirited fashion and expects you to keep up, precious little spoon feeding allowed.I’m no World War II buff, but Francine Mathews lays out the basics with ease. The setting is Cairo and Tehran as Winston Churchill and Franklin Roosevelt and later Josef Stalin meet to finalize the D-Day invasion. Our hero Fleming, with a significant legacy to live up to and just beginning to understand his true talents, is assigned to ferret out a plot to assassinate the Allied leaders. Fleming is warned that the mastermind of the plot, known by his handle “The Fencer,” may have wormed his way into either the delegation of the Brits or the Americans. Too Bad To Die is a busy book (in a good way). Be prepared for a large cast. Mathews fearlessly switches point of view between chapters. Historical figures abound, from Alan Turing to Averell Harriman to Elliott Roosevelt. Mathews’ two years of research shows, but she deals out the tidbits in smooth fashion. The chapters about Fleming, who invents the James Bond alter ego for his undercover work, set the anchor. He's got something to prove and some determination to get the job done. Along the way there are hidden transmitters, vodka-guzzling pilots, decoy dignitaries, fake Russian waiters, you get the picture.As Mathews notes in her acknowledgements, “Fleming was up to his eyeballs in secret plots” as the assistant director to British Naval Intelligence in wartime London. “His shadow falls across many of the most daring and ingenious deception operations of the war, particularly disinformation campaigns against the Axis. A great number of myths have grown up around him as well—from the outset, he was a character meant for fiction.”Too Bad To Die proves leaves little doubt of that fact. Case closed."}, {"userName": "Donna", "userReviewDate": "Mar 10, 2018", "userURL": "http://www.goodreads.com/user/show/13244359-donna", "userReview": "This book was not my 'thing', but I needed it for a book challenge. I listened to the audio and it took me 4 days to get through it, when it only required one afternoon. I thought the story was creative and well thought out, but the narrative style was my least favorite when listening to audios. It felt a little to clinical for my tastes. I wanted more than what things looked like....I wanted what it felt like and what the thoughts were. I could see the characters, but couldn't feel them. I did like the way the author pulled it all in at the ending, so 2 stars."}, {"userName": "Mal Warwick", "userReviewDate": "Jul 30, 2015", "userURL": "http://www.goodreads.com/user/show/4739424-mal-warwick", "userReview": "Imagine an espionage novel starring Ian Fleming, Winston Churchill, Franklin Delano Roosevelt, Alan Turing, Josef Stalin, Lavrenti Beria, Churchill’s daughter and daughter-in-law, one of Roosevelt’s sons, and a passel of other recognizable characters thrown together at a fateful time in 1943. Oh, and you might add James Bond to the mix.In this delightfully wicked novel, American crime and espionage writer Francine Mathews builds on known facts about the high-powered people who figure in the story — and imagines them as they might have reacted to a Nazi assassination plot directed against Roosevelt, Churchill, and Stalin. The tale is set in Cairo and Tehran, where the leaders of the three Allies came together to set the strategy for the invasion of Nazi Europe. As best I can tell, the broad historical events depicted in this book are entirely consistent with the facts. It’s the plot that is fully imagined.Ian Fleming was, in fact, assistant to the head of British Naval Intelligence and was the inventive author of some of the most dramatic deceptions mounted by the Allies. He held the rank of Commander. As indicated in the book, he was the son of a wealthy Member of Parliament who died on the Western Front in 1917. He was, in fact, educated at Eton and Sandhurst. The James Bond series of spy novels Fleming wrote after the war were based, in large part, on his experience as a master of the craft. Much of the rest is fiction.Too Bad to Die recounts the events of seven days late in November 1943. Roosevelt and Churchill, both ailing old men, have flown to Cairo with the ostensible purpose of reaching a joint strategy to deal with Stalin a few days hence at a fateful conference in Tehran. Mathews is a careful student of history, because the dialogue involving these larger-than-life figures is entirely credible, and their circumstances, and the state of their health, are all grounded in fact.The conceit around which Mathews builds her tale is that Ian Fleming departs from his desk job to tangle with a Nazi master-spy who threatens to assassinate the Big Three leaders. There’s not a lot of mystery around the identity of the master-spy, even if Fleming is in the dark, but the unfolding events make for a thoroughly enjoyable story."}, {"userName": "Cathy Cole", "userReviewDate": "Dec 10, 2014", "userURL": "http://www.goodreads.com/user/show/5086649-cathy-cole", "userReview": "Having read and enjoyed Mathews' previous historical thriller Jack 1939, I looked forward to reading Too Bad to Die, and I was not disappointed. I was hooked in the prologue when I learned the origin of the book title. Too Bad to Die is an excellent blend of history, literature and cinema as it gives us the background of Ian Fleming, the creator of James Bond, and the importance of the meeting between Roosevelt, Churchill and Stalin. Mathews' research blends seamlessly into her narrative. Her portraits of the world leaders are at once informative and familiar. By sharing scenes from his boyhood, we can also read and smile and trace the beginnings of one of literature's most famous characters. While the book satisfies on both history and mystery levels, it also delivers with a good solid pace and exciting action sequences-- although a scene of torture towards the end of the book may make some readers uncomfortable. My radar must be in fine shape because I did find the identity of the super spy/killer a bit too easy to guess, but there's a lot more to this book than whodunnit. If you're a fan of well-researched, high octane historical thrillers, Too Bad to Die is too good to miss."}, {"userName": "JoAnne Pulcino", "userReviewDate": "Jun 09, 2015", "userURL": "http://www.goodreads.com/user/show/5096613-joanne-pulcino", "userReview": "TOO BAD TO DIEFrancine MathewsTOO BAD TO DIE is a wonderful historical thriller that features British Navel Intelligence officer, Ian Fleming who prevents a Nazi plot trying to assassinate Franklin Delano Roosevelt, Winston Churchill and Stalin. In November, 1943 the big three meet at the Tehran Conference and Fleming learns Hitler’s top assassin has been given the assignment. Fleming goes undercover to discover the assassin and in the process has to face the fact that betrayal is sometimes just too close.Ms. Mathews has done an excellent job of including so many real life characters and the intrigue is very suspenseful. She is becoming one of the best spy thrillers today. She even manages to include “shaken not stirred”.Good book."}, {"userName": "Bill", "userReviewDate": "Mar 18, 2015", "userURL": "http://www.goodreads.com/user/show/1811095-bill", "userReview": "this would have been a 5 star book, except for the fact that I figured out who the bad guy was before the half-way mark of the book. I hate that."}, {"userName": "James", "userReviewDate": "Jun 15, 2015", "userURL": "http://www.goodreads.com/user/show/3775708-james", "userReview": "Author Mathews concocts a fictional thriller set at a real time in history involving Ian Fleming (later author of 007 novels). It takes place during the middle eastern conference between Churchill, Roosevelt, and Stalin in their debates and decision making in how to destroy Hitler's forces via D-Day. Fleming (a member the British Naval Intelligence unit) was actually involved in the planning of this conference but was not present and was laid up with an illness, but Mathews weaves a tale of his being made aware of a plot by a mysterious shadow of a Nazi spy who has infiltrated the conference under the guise of one of the trusted people present. The aim of THE FENCER is to kill all the three leaders. If you are a fan of James Bond, whether via books or movies, you will be interested in how she incorporates the many aspects of Fleming's creation into the story including the origins of many of the Bond adventures via martinis, women, villain ideas, and many aspects of 007's nasty confrontations, especially one in CASINO ROYALE. And I was surprised to learn that SMERSH was real. A good summer read of history learned and fictional mysteries solved."}, {"userName": "Peg Albrets", "userReviewDate": "May 02, 2015", "userURL": "http://www.goodreads.com/user/show/18313861-peg-albrets", "userReview": "very fun with Ian Fleming as a major character"}, {"userName": "Alyson", "userReviewDate": "Aug 10, 2015", "userURL": "http://www.goodreads.com/user/show/1868922-alyson", "userReview": "I have not interest in James Bond or Ian Fleming, but I really enjoyed this thriller based on Ian Fleming's life. I did the audio and it was well done."}, {"userName": "Jessica Howard", "userReviewDate": "Jan 30, 2015", "userURL": "http://www.goodreads.com/user/show/78086-jessica-howard", "userReview": "A spy thriller at its finest. Super fun - imagining the wartime activities of Ian Fleming."}, {"userName": "Delia Binder", "userReviewDate": "Jun 28, 2017", "userURL": "http://www.goodreads.com/user/show/29981413-delia-binder", "userReview": "In this \nhighly\n fictionalized story of 007 creator \n Ian Fleming's experiences in British Naval Intelligence during WWII, American author \n (and ex-CIA analyst) Francine Mathews spins the tale of a Nazi plot to simultaneously assassinate Churchill, FDR and Stalin at the 1943 Allied Leader Conference in Tehran (then under joint British and Soviet control). Ian Fleming wanted to become a Commando like his older brother \n Peter (a then-popular author of travel books and humorous adventure stories - and a handsome, successful man unlike his troublemaking disgrace of a kid brother!), but his real gift was, as the story puts it, \"Lying to The Enemy\". Concocting compelling, mad, just probable enough to be swallowed stories that would later make his creation James Bond the world's best-known fictional spy, Commander Fleming quickly rose to become Assistant to Naval Intelligence Chief, Rear Admiral John Godfrey (generally believed to be the basis for \"M\" in the Bond novels). The story's Fleming, who is on good terms with Enigma codebreaker (and grandfather of modern computing) Alan Turing, is warned by the stuttering, socially awkward genius that a Nazi operative code-named \"The Fencer\" may have somehow infiltrated the conference. Details are so vague, though, and The Fencer so good at hiding in plain sight, that Fleming elects to gather proof on his own before going to either Churchill or Roosevelt with his suspicions. Co-opting Signals Operator Grace Cowles (an ex-girlfriend he's not entirely over), and his American opposite number Michael Hudson (his oldest and dearest friend), Commander Fleming quickly finds out that The Fencer is playing a cat-and-mouse game with him, and seems to always be several painful steps ahead....The historical Fleming, though he helped plan the Tehran Conference, was unable to attend due to bronchitis. In Ms. Mathews's version, though, he's relentlessly hunting The Fencer, interrogating potential suspects in the Conference party (which includes such historical figures as Churchill's daughter-in-law Pamela and daughter Sarah, Generalissmo Chiang Kai-Shek and Madame Chiang, US Ambassador to the UK Gil Winant, US Ambassador to the Soviet Union Averell Harriman, and British Minister for War Transport Lord Leathers), meeting secretly with the Cairo's NKVD (the Soviet Union's predecessor to the KGB) Station Chief, enduring repeated stabbings and beatings, all the while picking up obvious bits that will later appear in his 007 stories. This may be the most groan-worthy aspect of the novel, as Fleming temporarily uses a British Passport in the name of \"James Bond\", NKVD Chief Nazir drinks \"vodka martinis, shaken - not stirred\", and Fleming's sometimes repulsive attitudes towards women and sex closely mirror his creation's. I liked this book, but I didn't love it. While I'd hardly call myself an expert on 007 or Ian Fleming, there are a number of things here that don't entirely jibe with what we know about the author and his creation; for one, it's pretty widely known that \"James Bond\" was the name of an American ornithologist whose books Fleming owned and admired. It also bugs me that the identity of The Fencer is pretty bloody obvious - I won't spoil it for you, but if you choose to read this book, see if you haven't figured it out yourself by about a quarter of the way through! I got Too Bad to Die via BookBub. For whatever price I paid, I'd say it was worth it...."}, {"userName": "Wesley Britton", "userReviewDate": "Oct 29, 2016", "userURL": "http://www.goodreads.com/user/show/2151250-wesley-britton", "userReview": "I’ve lost count of how many novels I’ve read over the years that fictionalize author Ian Fleming’s involvement in Naval Intelligence in World War II. In each case, known history, speculative biography, and obvious literary invention meet. Most yarns by the likes of Damian Stevenson and Aaron Cooley seek to present foreshadowings of what Fleming would write in his James Bond books. The imaginations of such writers are usually quite fanciful with Fleming being more the action figure than he actually was.I can’t recall any previous work quite as literate as Francine Mathews’ To Bad to die which weaves flashbacks from Fleming’s childhood into his investigation into a Nazi plot to assassinate Churchill, Roosevelt, and Stalin at their November 1943 conference in Tehran to plan out the Normandy invasion. Very convincingly, Mathews sketches many portraits of important historical figures from the “Big Three” to their entourages and family members, code-breaker Allan Turing, broadcaster Edward R. Morrow, Chinese leader Chiang Kai-Shek, and U.S. ambassador to Great Britain, Averell Harriman.Although little of this story happened or could have happened in 1943, Mathews is especially believable creating the milieu in which all these figures walked, notably using vocabulary and terms of English schoolboys when Fleming was young. Hints of the Bond books to come include references to martinis shaken, not stirred, a voice inside Fleming’s head giving him the alter ego of 007, a false passport giving Commander Fleming the fake name of James Bond, and a torture scene is clearly meant to seem the inspiration for a very similar situation in 1953’s Casino Royale. The death of Fleming’s father during World War I is offered as the psychological motivation for Fleming’s spinning out fantastic yarns. In short, Mathews digs deeper than many other writers to give readers more than a hot and fast page-turner. Obviously, Bond fans, World War II buffs, and lovers of espionage yarns in general are a perfect audience for Too Bad to Die. Aficionados of suspense and mystery stories should find much to appreciate from Francine Mathews’ descriptive tale, even if few readers will miss the obvious clues that reveal who the main villain is long before he levels a pistol at Fleming. Still, I can’t help but think the actual creator of James Bond would approve of this one.This review first appeared at BookPleasures.com on Oct. 29, 2016: http://dpli.ir/E1oQiL"}, {"userName": "Dana Jennings", "userReviewDate": "Nov 14, 2017", "userURL": "http://www.goodreads.com/user/show/15303954-dana-jennings", "userReview": "This novel was, for me, pure pleasure. Based on research, Mathews vivifies Ian Fleming as the Royal Navy intelligence officer that he was in 1943. The narrative traces the political intrigue of the Tehran Conference at which Churchill, Roosevelt, and Stalin carve up Europe after agreeing campaigns to defeat the Nazis. The time spans from Thanksgiving Day, November 25, 1943 to Saturday, December 4, 1943. The story is taut and fast-paced. Throughout Fleming's machinations to solve the planned murders of all three heads of state, he writes snippets on paper or in his head, lines we recognize from his future novels."}, {"userName": "R.R. Scott", "userReviewDate": "Nov 04, 2017", "userURL": "http://www.goodreads.com/user/show/17549898-r-r-scott", "userReview": "A quick, fun read about some imagined adventures for Ian Fleming, during his heyday as an officer in British Naval Intelligence circa World War Two. As a long time Bond fan, and a huge fan of Fleming the man, I enjoyed reading Ms Mathews' speculations on what a more Bond-like Fleming might have endured had the war gone the way he'd always dreamed. I'm sure Fleming himself would have loved for even just a bit of the action of this book to have come true! A good read if you're a Bond/Fleming fan, worth the time."}, {"userName": "Сибин Майналовски", "userReviewDate": "Sep 22, 2017", "userURL": "http://www.goodreads.com/user/show/9832321", "userReview": "Жалко подобие на Джеймс Бонд. Аз като фен на франчайза страдах двойно. Още повече ще страдам, ако някой духовен брат на сиелци (разбирай, със сходна тотална липса на вкус) из Холивуда реши да екранизира това недоносче. Стига ми и мъката покрай първите два филма на онзи дългоухия."}, {"userName": "Gregory Norman", "userReviewDate": "Feb 03, 2017", "userURL": "http://www.goodreads.com/user/show/28932784-gregory-norman", "userReview": "Damned good readAny idiot could figure out the villain about a third of the way in but the story works wonderfully well anyway. I'll be checking out Matthews' other offerings as well."}, {"userName": "Fred Yderf", "userReviewDate": "Jun 01, 2018", "userURL": "http://www.goodreads.com/user/show/52276527-fred-yderf", "userReview": "I GAVE UP READING IT,,"}, {"userName": "Steven Hinman", "userReviewDate": "Dec 15, 2017", "userURL": "http://www.goodreads.com/user/show/74942935-steven-hinman", "userReview": "An interesting novel, based on Ian Fleming!"}, {"userName": "Bibliothekerin", "userReviewDate": "Jan 26, 2018", "userURL": "http://www.goodreads.com/user/show/13181332-bibliothekerin", "userReview": "WHAT HAPPENED TO MY REVIEW, Goodreads??!??!?"}, {"userName": "Bonnie", "userReviewDate": "Feb 20, 2017", "userURL": "http://www.goodreads.com/user/show/1679313-bonnie", "userReview": "I seriously thought about rating this book two stars. I got a bit confused in the middle, but then it came together near the end and I figured things out. I would have liked an author's note at the end to sort out fiction from fact."}, {"userName": "Michelle", "userReviewDate": "Feb 14, 2016", "userURL": "http://www.goodreads.com/user/show/931516-michelle", "userReview": "As a huge fan of the Bond films, as well as a fan of spy novels, I had high hopes for this when I picked it up to read. They were dashed, however. I found most of the characters to be cynical, depressed, and largely devoid of feeling. Set in WWII, during the Tehran Conference of the Big Three (otherwise known as Stalin, Churchill, & FDR), OSS desk jockey Ian Fleming (who, of course, longs for a more active & adventurous role), accompanies his boss to assist and protect Churchill. Fleming is also after Nazi-sympathizing double-agent code-named \"The Fencer\" whose goal, it seems is to assassinate the Big Three with help from others such as him/herself. The novel flashbacks to scenes of character Fleming's childhood and the experiences helping to shape the man who becomes James Bond. I was curious to see how Mathews would tie-in things about Bond for which he is so famous - womanizing ways, the motivations behind duty to King & country, the vodka martini (shaken, but not stirred), the code name 007, even the name, James Bond. There was even a character who, one might argue, could very well be Miss Moneypenny.Mathews weaves history within the storyline itself and actual historical figures themselves are inserted in as well. Mathews, however, did seem to be kind to some of those figures - some more than others which left me with a cynical view of history, and I hate when that happens. The real disappointment came however, when, half-way through the novel I thought to myself, \"Hm...I'll bet the Fencer is _____.\" I was right, of course. The only plot-twist is the identity of The Fencer's known partner-in-crime (known only as \"The Kitten\") whose true identity and motives are, even at the end, not truly known, thereby leaving that particular loose-end not really tied-off - or as perhaps still a mystery."}, {"userName": "Bill", "userReviewDate": "Jun 23, 2015", "userURL": "http://www.goodreads.com/user/show/163427-bill", "userReview": "There have been many writers who have looked at Ian Fleming's life and tried to see from where James Bond sprang. Obviously, Fleming's time spent in Naval Intelligence during WWII was crucial and provided a lot of the initial impetus for James Bond. Particularly Casino Royale, which while not my favorite Bond novel, seems to draw heavily on Flemings strengths as a planner and the simple plot of Casino Royale (destroy a Soviet Agent by making him lose money at gambling) seems a natural to the man who proposed Operation Mincemeat. Also, Bond's musings over spying seem to reflect Fleming's own ambivalence about the espionage game. But what Francine Mathews has done is a bit more nuanced. She has reversed engineered Bond (and particularly Casino Royale) to create an entertaining and fun thriller with Fleming literally assuming the role of James Bond. Placing him at the Big Three conference in Tehran to stop the assassination of FDR, Churchill, and Stalin allows Ms. Mathews to create portraits of the three world leaders and those around them and humanize them, showing them in all their strengths and weaknesses. I'm pretty sure her reasons for why Fleming named his spy James Bond (and it's not Fleming's stated reason of getting the name from an author of a book on West Indies Birds), why Bond likes his martinis shaken and not stirred and other parts of the Bond canon are all fictional but fun nevertheless and the book sent me on a search for how much was true and how much was fiction. (And I was surprised at how much was true.) Highly recommended for fans of espionage, historical thrillers, and James Bond."}, {"userName": "Ronald Roseborough", "userReviewDate": "Apr 26, 2015", "userURL": "http://www.goodreads.com/user/show/2346318-ronald-roseborough", "userReview": "In this fictional tale, Ian Fleming, the creator of James Bond, is a commander in British Naval Intelligence assigned to shadow Prime Minister Winston Churchill during the dangerous era of World War II. Fleming, as a fact, was a commander in Naval Intelligence at that time. The story finds him in Egypt as a member of Churchill’s entourage as the way is being paved for talks with Stalin and Franklin D. Roosevelt in their historic meeting at Tehran in late 1943. The secret meeting will determine the course of the war, specifically the plans for the Allied invasion of Europe. While preparing for the meet, Fleming comes across an old school chum, Michael Hudson, an American now with the O.S.S., the new American spy network. They get wind of a German plot to kill the three Allied leaders while they are meeting in Tehran. There is also a rumor that an unknown spy working for German intelligence has infiltrated the Allied camp. As Fleming gets close to discovering the spy, he is attacked and wounded, necessarily leaving him out of the planned trip to Tehran. Feeling he is closest to finding the spy, Fleming disobeys orders and hitches a flight to Tehran. He is determined to uncover the spy and stop the planned attack on the allied leaders. The book is a good read, but there are so many historical figures in the story line, that you get the feeling there are too many chiefs and not enough Indians. It is almost impossible to hide the spy’s identity from the reader, as there are so many prominent personalities of the era in the plot. This causes the plot to lose some of its impact. Book provided for review by Shelf Awareness and Riverhead Books."}, {"userName": "Dan Curnutt", "userReviewDate": "Dec 18, 2014", "userURL": "http://www.goodreads.com/user/show/1065879-dan-curnutt", "userReview": "Churchill, Roosevelt and Stalin are planning to get together in Iran to discuss what needs to happen to resolve WWII and defeat Germany. The Germans know that this summit is happening and it is their desire to see all three world leaders assassinated.The Fencer and his accomplice, the Kitten, are set to fulfill Hitler's desire to see the three men terminated. Those are the code names for the spies that the Germans have in place to do their best to kill off the opposition leadership.The Fencer turns out to be a highly placed representative with one of the three government groups. It is up to Ian Fleming, the British Naval Commander traveling with Churchill's group to find and defeat the plans of the Fencer. Yes, Ian Fleming. The same Ian Fleming who is going to bring to us British Special Agent, James Bond, 007.Flemings task is to write scenario's and then paperwork that are fiction and are used as disinformation for the Germans to find. But now he finds himself in possession of information that is accurate and true (at least so he says) and the problem he has is trying to convince others that it is not fiction.The story is well written and the intrigue is good. There are so many characters involved that you will find it difficult to unearth who the spy truly is.The book is a fun read and one that would make a great gift for the reader in your home.Enjoy!"}, {"userName": "Bob", "userReviewDate": "Dec 27, 2014", "userURL": "http://www.goodreads.com/user/show/2820496-bob", "userReview": "Interesting Historical Detail But Just A So-So Thriller!, December 27, 2014Too Bad To Die is described as a WWII thriller in which British Naval Intelligence officer Ian Fleming races to foil a Nazi plot to assassinate Franklin Delano Roosevelt, Winston Churchill and Joseph Stalin at the Tehran Conference. Since I am a big fan of historical thrillers and especially those set during WWII, I was certain Too Bad Too Die was going to be a big hit with me.To its credit, I enjoyed the rich historical detail Francine Mathews packs into her latest book, and I learned a lot about many of those people who were world leaders and influencers of those leaders during WWII.Unfortunately, however, I felt that Mathews spent so much of her book packing in these historical details that they overshadowed her ability to tell a tense and enthralling thriller. For me, Too Bad To Die moved at such a slow pace that by the time any real thrills and actions occurred they were too little, too late. Further, while the tidbits about many of the 'real people' characters were interesting and, at times, juicy, Mathews' ability to present richly developed characters -- including her main character, Ian Fleming -- was just mediocre. As a result of these flaws, on several occasions I came very close to giving up on this book.Ultimately, I'm glad I finished Too Bad To Die book because it turned out to be an okay read -- but a book that is just okay is not one I'd recommend you rush out to read."}, {"userName": "Nancy", "userReviewDate": "Dec 06, 2014", "userURL": "http://www.goodreads.com/user/show/7092147-nancy", "userReview": "A Spy Thriller in Which Ian Flemmng Becomes James BondIt's WWII. The allies, Churchill, Roosevelt and Stalin, are meeting in Teheran. Flemming is attached to the British delegation. His friend, Michael Hudson, works for the Americans. Flemming receives a message from Turing at Bletchley that there is a Nazii spy in their party who plans to assassinate the three leaders. Flemming takes it seriously, almost pays with his life, and takes on the soubriquet of James Bond.If you like spy novels with a historical twist, this is a treat to read. Ian Flemming starts as an unsure youth in boarding school, trying to emulate the heroic deeds of his dead father. He hates being assigned to a desk job when the action seems to be elsewhere, but before the end of the book, he gets more action than he was prepared for. I throughly enjoyed this book. Flemming/Bond is a character you can empathize with. The period is well described. I found myself caught up in Persia during the Second World War. Churchill, Roosevelt, and Stalin make appearances, but the action is focused on Flemming, a reluctant hero, and the lady who helps him detect the spy. I highly recommend this book if you like historical novels and especially spy thrillers. It keeps you guessing. I reviewed this book for the Amazon Vine Program."}, {"userName": "Jennifer", "userReviewDate": "Dec 06, 2014", "userURL": "http://www.goodreads.com/user/show/2698688-jennifer", "userReview": "A captivatingly intense spy thriller, Too Bad to Die, written by Francine Mathews, takes readers into a dark and sinister time during World War II where the lines between enemy and ally often become blurred. Although a work of historical fiction, Mathews brings the times to life in this novel where readers will need to remind themselves that this is fiction. Ian Fleming, of James Bond notoriety, is a British Intelligence Officer with a dull desk job, or at least he thinks it is until he learns of a plot to assassinate the top three leaders; FDR, Churchill and Stalin as the three leaders assemble to discuss plans to end the war. The plot, to be carried out by a Nazi spy at the Tehran Conference, if successful could mean the end of the free world. Fleming finds himself in the middle of the case, as he must identify the Nazi spy before it is too late. Caught in a whirlwind of mystery and intrigue, Fleming must act under cover to foil the Nazi plan, as Mathews places her writing at the top of its class of thrillers. I highly recommend Too Bad to Die to suspense aficionados, as this work will not disappoint."}, {"userName": "Jennifer", "userReviewDate": "May 07, 2015", "userURL": "http://www.goodreads.com/user/show/664484-jennifer", "userReview": "I really hate not being able to give this three-stars. I loved The Alibi Club, and even enjoyed Jack 1939, but it took me forever to get through this one. I thought the premise was great - and the historical detail was spot on - but there were too many superfluous characters. I'm assuming this was done to give readers, and Fleming, a large amount of suspects from whom to choose, but it made the book drag. (I mean, May-ling and Elliott Roosevelt really did not add anything that couldn't have been gleaned from the others.)The suspect was pretty obvious, if not from the very beginning, then close to it. I kept hoping the suspect would actually start to impart his/her schemes when we got scenes from that person pov - it might have made the cat-and-mouse game more interesting. Instead, we got a half-ass confession after a brutal interrogation, and an accidental justice-is-served moment in which our hero (who, by his own claims, was not much of one) has no part. Disappointing for me, but I'll still read Mathews."}, {"userName": "Gay", "userReviewDate": "Mar 28, 2016", "userURL": "http://www.goodreads.com/user/show/34156971-gay", "userReview": "Ian Fleming (yes—that Ian Fleming who did work as a spy!) and boyhood friend, Michael Hudson, suffer through school together. They note that the good die young, but they are too bad to die, which gives the book its title. Eventually they rise to the top in their government positions and become part of the delegation to Tehran in 1943 to carve up Europe among the three super powers at the time.The Fencer, code name for a traitor in the group, is being sought by both men. The story is told mostly from Fleming’s POV, but we meet all the players—Churchill, Stalin, Roosevelt, and the women—Churchill’s daughter and daughter-in-law, Madame Chiang, and the Code officer Grace, who, for a time, is the unwitting dupe of the Fencer.Mathews has degrees from Princeton and Stanford, and four years as an Intelligence Analyst at the CIA. She has done an enormous amount of research into the time period She has written many other books, and is the author of the fabulous Jane Austen Mysteries under the pseudonym of Stephan Barron. Superbly done. Riverhead Books."}, {"userName": "Tom Donaghey", "userReviewDate": "Mar 24, 2015", "userURL": "http://www.goodreads.com/user/show/23974131-tom-donaghey", "userReview": "TOO BAD TO DIE by Francine Mathews is a nifty bit of fiction in the spy genre. Before there was a James Bond there was Ian Fleming, the man who wrote the original books. In this novel, the lead character is Fleming and the action takes place during the Cairo/Iran summit meetings of the big three. But there is a Nazi spy in the delegation and their design is to kill Stalin, Churchill and Roosevelt, winning the war for Germany in one swoop.\tFleming is an intelligence agent more know for his organization skills than his derring-do, but here he has to step out of his element and get his hands dirty. We all know he will go on to fame as a writer, but here we see the early start on the Bond character and where some of his traits come from.\tNot a top rate action adventure story, but fun because of the main characters and the look at the inner workings of this level of diplomacy at that time."}], "description": "November, 1943. Weary of his deskbound status in the Royal Navy, intelligence officer Ian Fleming spends his spare time spinning stories in his head that are much more exciting than his own life.until the critical Tehran Conference, when Winston Churchill, Franklin Roosevelt, and Josef Stalin meet to finalize the D-Day invasion. With the Big Three in one place, Fleming is tipped off that Hitler's top assassin has infiltrated the conference. Seizing his chance to play a part in a real-life action story, Fleming goes undercover to stop the Nazi killer.", "title": "Too Bad to Die", "url": "https://www.goodreads.com/book/show/22571632-too-bad-to-die", "average": 3.57, "cover": "https://images.gr-assets.com/books/1406160586l/22571632.jpg", "reviews": 84, "authors": [{"url": "https://www.goodreads.com/author/show/81794.Francine_Mathews", "name": "Francine Mathews"}], "type": ["Historical", "Thriller", "Mystery", "Fiction", "Action"], "outlinks": ["http://www.goodreads.com/book/show/22571632-too-bad-to-die", "http://www.goodreads.com/book/show/23394203-too-bad-to-die", "http://www.goodreads.com/book/show/31694176", "http://www.goodreads.com/book/show/38215177-too-bad-to-die", "http://www.goodreads.com/book/show/25147844-too-bad-to-die", "http://www.goodreads.com/book/show/22860182-too-bad-to-die", "http://www.goodreads.com/book/show/13407229-jack-1939", "http://www.goodreads.com/book/show/1399571.The_Cutout", "http://www.goodreads.com/book/show/768927.Death_in_the_Off_Season", "http://www.goodreads.com/book/show/32171109-death-on-nantucket", "http://www.goodreads.com/book/show/141814.Death_in_a_Mood_Indigo", "http://www.goodreads.com/book/show/37581710-the-company-of-demons", "http://www.goodreads.com/book/show/40024832-empire-of-sin", "http://www.goodreads.com/book/show/8343548-the-bricklayer", "http://www.goodreads.com/book/show/40193155-among-the-wicked", "http://www.goodreads.com/book/show/23818400-the-snow-garden", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/23157833-almost-dead", "http://www.goodreads.com/book/show/33555347-crime-scene", "http://www.goodreads.com/book/show/30249521-fatal-frost", "http://www.goodreads.com/book/show/40266676-remains-of-innocence", "http://www.goodreads.com/book/show/34330657-finding-claire-fletcher", "http://www.goodreads.com/book/show/28824403-outfoxed", "http://www.goodreads.com/book/show/23957469-huntress-moon", "http://www.goodreads.com/book/show/40204087-the-deepest-secret", "http://www.goodreads.com/book/show/35115882-what-the-dead-know", "http://www.goodreads.com/book/show/40267317-ragdoll", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/39791173-the-girl-before", "http://www.goodreads.com/book/show/40205081-last-witness", "http://www.goodreads.com/book/show/40205040-dead-weight", "http://www.goodreads.com/book/show/18903409-weekend-warriors", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/40193809-eye-for-an-eye", "http://www.goodreads.com/book/show/27239265-the-short-drop", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/17623604-you-only-live-twice", "http://www.goodreads.com/book/show/17377392-thunderball", "http://www.goodreads.com/book/show/17284593-casino-royale", "http://www.goodreads.com/book/show/17623578-for-your-eyes-only", "http://www.goodreads.com/book/show/40193858-the-cuckoo-s-calling", "http://www.goodreads.com/book/show/17304110-live-and-let-die", "http://www.goodreads.com/book/show/18780375-dr-no", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies", "http://www.goodreads.com/book/show/17379070-moonraker", "http://www.goodreads.com/book/show/18799804-diamonds-are-forever", "http://www.goodreads.com/book/show/40205231-the-spy-who-loved-me", "http://www.goodreads.com/book/show/17377384-from-russia-with-love", "http://www.goodreads.com/book/show/40243961-the-cape-refuge-collection"]}