{"ratings": 804, "userreviews": [{"userName": "Mai Laakso", "userReviewDate": "Feb 17, 2018", "userURL": "http://www.goodreads.com/user/show/49155830-mai-laakso", "userReview": "Tove Jansson syntyi ensimmäisen maailmansodan aikana vuonna 1914. Tuula Karjalaisen elämäkerta tästä rakastetusta suomenruotsalaisesta kirjailijasta, taiteilijasta, kuvittajasta ja sarjakuvapiirtäjästä on nimeltään Tove Jansson – Tee työtä ja rakasta. Tove Jansson teki työtään ahkerasti, vaikka hän valitsi urakseen taidemaailman, joka on hyvin epävarma ja epäkiitollinen työsarka. Hän valitsi tiensä äitinsä ja isänsä jalanjäljiltä, sillä hän kasvoi taiteilijakodissa, jossa monet aikamme kuuluisista taiteilijoista viettivät aikaansa.Tove Jansson tunnetaan hänen Muumihahmoistaan. Muumit ovat lähteneet elämään ja luoneet suuren Muumi-bisneksen. Muumikirjojen suosio Suomessa oli alkuaikoina kuitenkin hidasta, eikä suomalaiset ymmärtäneet Muumikirjoja. Muumit oli julkaistu Ruotsissa, Saksassa ja Englannissa ja saavuttivat siellä suuren innostuksen, ennen kuin Suomessa ymmärrettiin suomentaa kirjat, sillä Tove Jansson kirjoitti ruotsin kielellä.Kirja tuo esille myös Tove Janssonin yksityiselämän, joka on ollut melkein aina julkista. Hän on esiintynyt rehellisesti aitona itsenään.Tove Jansson – Tee työtä ja rakasta teoksen vahvuudet ovat taiteilijan elämän kuvaaminen yksityiskohtaisesti valokuvien kera. Tässä upeassa kirjassa kuvataan Tove Janssonin elämänkaari, joka sisälsi rakkautta ja työtä."}, {"userName": "Liisa", "userReviewDate": "Dec 29, 2016", "userURL": "http://www.goodreads.com/user/show/38789239-liisa", "userReview": "I don´t have much, if any, experience with biographies, but this one I found to be fantastic. Though it does help that the person the book is about is someone I´ve greatly admired since I was a little child. In Finland we are taught about Tove Jansson several times during our education, but it´s always been a very brief insight into her life and we´ve focused on the Moomins. Tuula Karjalainen goes through pretty much everything: Tove´s life from birth to death, her most important relationships and her career, or more like careers. There are a lot of quotations incorporated in the text and it often felt like it was Tove herself telling me about her life. Karjalainen was allowed to read Tove´s wide correspondence and was so able to share her authentic thoughts, which in my opinion makes this book so special. There are also a lot of well chosen photos that really helped to understand what kind of an artist Tove was, and how her works evolved over time. Tove Jansson: Work and Love is extremely thought provoking and emotive, it gave me huge amounts of inspiration and taught me some important life lessons. I loved every moment of reading it."}, {"userName": "Marge", "userReviewDate": "Jan 25, 2015", "userURL": "http://www.goodreads.com/user/show/16112608-marge", "userReview": "Raamat, mis võlus esimestest lehekülgedest saati. Oma osa on kindlasti sellel, et mind on alati paelunud kunstnike elulood - neis on emotsiooni ja värvi ning mitte ainult lõuendile kantavat värvi.Pean tunnistama, et pole hulk aega lugenud midagi sellist, mille pärast võtta aeg maha ja minna uksest välja, põgeneda raamatu eest, mille emotsioon matab hinge. Põgeneda millegi eest, mis kutsub kiiresti tagasi. Armastusega kirjutatud raamat armastusest."}, {"userName": "Noora", "userReviewDate": "Jan 25, 2017", "userURL": "http://www.goodreads.com/user/show/19737968-noora", "userReview": "4.5 stars There are only a few people I admire as much as I admire Tove Jansson. She was an inspirational artist, writer, illustrator, feminist and a thinker, and reading her biography fills me with the desire to cover my body with tattoos of her work - both images and words. I want to re-read all of her work again and again, slowly and almost hesitantly drown myself in her writing. Boel Westin's authorised biography will probably always be the best one in my eyes, but I think Karjalainen still offers an exciting, more art-focused perspective into the well-loved author of the Moomin books. Moreover, this is a simply gorgeous book to behold - all the way from the colourful spine to the beautiful layout and the image choices. I highly highly recommend this!"}, {"userName": "Susanna", "userReviewDate": "Feb 01, 2016", "userURL": "http://www.goodreads.com/user/show/12449184-susanna", "userReview": "Milline inspireeriv biograafia! Soovitan igaühele, kellele meeldivad muumid (häh!), naivism, iseseisvad naised vms. Raamat on väga ilus, täis joonistusi, fotosid ja kaardikesi, tekst on ladus, kuigi vahel kordav. Hea lugemine nii tükiti kui ka järjest.. Imeline!"}, {"userName": "Laura", "userReviewDate": "Dec 12, 2013", "userURL": "http://www.goodreads.com/user/show/1324321-laura", "userReview": "Elämäkerta ammentaa materiaalinsa Toven kirjeenvaihdosta, hänen läheistensä haastatteluista ja muista kiinnostavista lähteistä. Etenkin sitaatit kirjeistä, pienet marginaaleihin raapustetut piirrokset ja muu harvemmin julkisuudessa nähtävä Janssonin itsensä kynästä lähtenyt kiehtoivat. Teos käsittelee Janssonin elämää kronologisuuden sijaan teemoittain, mutta suurimmaksi osaksi hänellä näyttääkin elämänsä varrella olleen erilaisia kausia kuten maalaus, sarjakuvat, Muumi-kirjat ja aikuisten kirjallisuus. Tuula Karjalainen kirjoittaa Janssonista kunnioittavasti ja ymmärryksellä muttei näytä tiputtaneen pois vähemmänkään imartelevia asioita.Vierastin ainoastaan Karjalaisen tapaa tulkita Janssonin maalauksia, piirroksia ja novelleja hyvin biografisesti, koska kuten Karjalainen itsekin aivan viimeisillä sivuilla sanoo, Jansson on pohjannut monia novellejaan omiin kokemuksiinsa mutta samalla muokannut ja käsitellyt niitä taiteilijan vapaudella. On siis periaatteessa mahdotonta sanoa, kuinka paljon tunnelmat ja ajatukset ovat mielikuvituksen tuotetta ja kuinka paljon omaelämäkerrallisia. \"Näin kirjoittaja on varmasti tuntenut luodessaan\" -tyyppinen ajattelu elämäkerroissa herättää minussa ärsytystä, koska pohjimmiltaan se on vain yhden ihmisen tulkintaa toisen ihmisen luomasta taideteoksesta, josta n prosenttia on täysin mielikuvituksen tuotetta. Karjalainen kyllä varoo sanomasta mitään lopullisia totuuksia, ellei Tove itse ole kirjeissään tai muualla sanonut jonkun hahmon tai tapahtuman pohjautuvan hänen ystäväänsä, perheenjäseneensä tai tiettyyn kokemukseensa. Silti koko lähtökohta on minusta sen verran ongelmallinen, että olisin jättänyt tulkinnat huomattavasti vähemmälle.Teksti olisi kaivannut vielä yhden editointikierroksen, koska sekaan oli jäänyt turhan paljon lyöntivirheitä ja kankeita ilmaisuja."}, {"userName": "Huutavakilpikonna", "userReviewDate": "Jul 05, 2016", "userURL": "http://www.goodreads.com/user/show/28148410-huutavakilpikonna", "userReview": "Yleensä en lue elämänkertoja, mutta Tove on minulle sellainen esikuva, että oli pakko tehdä poikkeus. Hänellä oli mielenkiintoinen elämä ja hän ei puhunut juurikaan yksityiselämästään julkisesti. Kunnioitan ihmisiä, jotka osaavat tehdä jotain todella hyvin ja uskaltavat sanoa mielipiteensä. Näihin minun ihailemiini ihmisiin voisin lisätä Anna-Leena Härkösen ja Eija Vilppaan.Heistäkin siis voisin joskus lukea elämänkerran. Kuvia on paljon ja oli mielenkiintoista tutustua Janssonin tuotantoon kokonaisvaltaisesti. Vielä kun joskus näkisi nuo maalaukset livenä. Freskot näinkin Helsingin reissulla Hamiin tutustuessa. Taiteesta saa niin paljon enemmän irti \"aidossa\" tilanteessa."}, {"userName": "Marina Sofia", "userReviewDate": "Jan 17, 2015", "userURL": "http://www.goodreads.com/user/show/9106945-marina-sofia", "userReview": "What can I say? So much I didn't know about Tove Jansson's life and loves, but above all her art. The book gets the balance between personal and professional/artistic just right. Comes up with lots of new insights, interviews with loved ones, makes good use of Tove's archives. Great pictures and a beautiful edition."}, {"userName": "Jarkko", "userReviewDate": "Jan 31, 2018", "userURL": "http://www.goodreads.com/user/show/17842883-jarkko", "userReview": "Elämäkerran kirjoittaja Tuula Karjalainen on taidehistoroitsija ja mm. vanha Kiasman johtaja, ja se heijastuu kirjassa sekä hyvässä että pahassa. Hyvässä siinä, että kuvituksissa ei ole säästelty, ja kirja on täynnä upeita värikuvia Toven tuotannosta. Huonossa siinä, että Toven koko elämää peilataan nimenomaan hänen maalaustaiteensa, ja jossain määrin myös kirjallisuutensa, kautta. Taidehistoriaa ja suomalaisten taiteilijoitten nimiä runnotaan lukijan aivokuoreen tauotta. Toisaalta, mikäli Tove näki itsensä pitkään ensisijaisesti taidemaalarina, lienee paikallaan myös arvioida häntä hänen maalaustensa kautta. Se olisi saattanut olla mielenkiintoinen osio elämäkerrassa, mutta ollessaan näin koko teoksen punainen lanka sai se ainakin minut uupumaan pian. Kirjassa esiintyi luvattoman paljon toistoa niin osioitten välillä kuin niitten sisällä. Jopa kokonaisia lauseita käytetään pahimmillaan kahta sivua myöhemmin. Jatkuva hyppiminen ajassa taaksepäin sekoitti minut täysin. Jokainen luku tuntuu alkavan aina joko sodan ajalta tai 60-luvulta, ja sitten kun luvussa päästään 70-luvun puoleenväliin, niin seuraava kappale alkaa taas 60-luvulta.Toven elämä oli todella mielenkiintoinen, ja hän oli uskomattoman aikaansaapa taiteilija. Oli mielenkiintoista saada tietää enemmän hänen elämästään. Tämä kirja ei kuitenkaan minuun vedonnut monien vikojensa vuoksi. Tovelle viisi tähteä, kirjalle kaksi."}, {"userName": "Natalie (weneedhunny)", "userReviewDate": "Jul 13, 2017", "userURL": "http://www.goodreads.com/user/show/6548813-natalie-weneedhunny", "userReview": "Tove Jansson: Work and Love is my first real array into Tove Janssons’ life outside of my familiarity with the Moomin family. For that reason this book was a delight, to get to know the woman behind the world so many children and adults alike return to again and again and find solace in. I enjoyed seeing the progression in Janssons’ career, being surprised by her belated success in terms of money and fame - she had already been working a long time before she became a ‘celebrity’ as a writer and children's’ illustrator. Of course, she was much more than the creator of the Moomins which is also a reason I wanted to read this, to find out more about all of the other things she did, wanted and strove for in her life as an artist. Having said this, my enjoyment of this particular book came more from the subject rather than the writing of Karjalainen. Had the subject been anyone else I would probably have given up somewhere in the first half of the book. Tove Jansson: Work and Love is, as the title would suggest, greatly focused on Jansson’s work as an artist - as a painter first and foremost - but also shows off all of the other work she did over her lifetime. That and the fact that the writer of this biography is an art historian seemed exactly like what I was looking for, the perfect match. However, I found I had several issues with the way the book was written. Since Tuula Karjalainen is an art historian and supposedly knows her stuff, I found it surprising that much of her description of Jansson’s art was so lackluster and obvious. She would describe paintings in a straightforward way like ‘The girl stood by the window, next to her lied art supplies and a canvas’ (not an exact quotation). My reaction to this was that I can see all these details very well for myself, especially because the book is richly filled with illustrations, art pieces, and photographs. I was rather looking for a deeper analysis like what possible symbols could be found in the art work according to Karjalainen, what other researchers might have said, parallels to contemporary artists, etc. While there is pieces of that too in the book, on the whole I found much of the analytical side to be too one dimensional. The same problem also extended to Jansson’s writing. There are many, many excerpts from various novels, short stories, etc. - and not only that but a great deal of this book is focused only on describing each and every work Jansson wrote in her lifetime. There is literally a description of every Moomin book, every short story collection and possibly every short story she wrote. Obviously there is value in talking about Jansson’s writing and of course there will be the occasional extract as an illustrative example for various reasoning, but I found it leaning again more to the descriptive than the analytical. Sometimes Karjalainen went into the territory of analysis but then sadly, I found instead the connections to be weak and unconvincing. For example there’s mention of homosexuality and gender representation in Jansson’s work, as having been of great interest for many researchers of Tove Jansson and her writing. While Karjalainen mentions the general interest in it, and draws some of her own conclusions, I found much of the points lacking in argumentative paragraphs so that as a reader you’re only presented with the bare bones of the conclusions rather than the process behind said points. The above problems had mostly to do with the qualitative aspects of the writing, but sadly I also had some issues with the style of the writing. With style I am talking of Karjalainen’s prose, her actual writing. While I read the Swedish translation I actually started off reading the English translation of the Finnish original and I had the same issues with both versions. Karjalainen is repetitive throughout the book, mentions the same things over and over and often in almost identical phrases; it’s almost as if she’s written the book thinking you’ll be reading it in short spurts so that you’ll forget things in between picking up the book. While I wouldn’t so much mind a little bit of reminding from chapter to chapter, it was annoying to find the same lines over and over in the same single chapter. In general I found the writing often dulled down, it might be because of the focus on many of the people around Jansson while I would’ve preferred the book sticked closer to her and only dealt with others in close connection to how it affected her. On the whole I felt that while Karjalainen is possible a successful historian, she is less impressive as a writer. The things she has found out, her research to make up this book, is certainly impressive; but the technical sides of the writing were in my opinion rather prosaic. That might be more of a personal taste thing, what sort of expectations you have on writers of biographies or similarly of nonfiction. If you’re only looking for information, the above problems might be of less importance than it was for me as someone who wants nonfiction to be written as elegantly as fiction. Probably my favorite part of this book was the chapters on the Moomins - all from the beginning of the ideas, the creation, to the fame and international success - partly due to my own liking of these characters but also I think because during those chapters there was a clearer focus on Jansson herself instead of the artists or people around her, aside from drawing connections between certain people as inspirations for Moomin characters. I also enjoyed the latter parts that focused on her switch to adult fiction and her living on an isle with her partner, Tooti, in the later years of her life. I might sound quite harsh in this review, but that’s also because I was looking forward to this book so much I was quite let-down. And yet when looking beyond the prose or the repetition and sometimes, in my opinion, the lack in the analysis, I enjoyed getting to know Jansson and I do think Karjalainen has really given a good broad illustration of Tove Jansson as an artist and as a human being, and most importantly drawn a line of her entire life’s work so that fans of Jansson and the Moomins alike can see how her work developed over time. Bonus credit to the publishers of this book for producing such a visually stunning book, all the way from the cover design to the font choice, and most importantly the vast amount of illustrations, art work and photography included in the book. Aside from the writing of this biography, this is a book to own for the images alone."}, {"userName": "Agne", "userReviewDate": "Aug 05, 2017", "userURL": "http://www.goodreads.com/user/show/21979165-agne", "userReview": "A truly remarkable life, with or without the Moomins. I like the strong focus on Jansson's work, as it was her most loved pursuit (I think/also, the title). Exceptional research, fully referenced, lots of images. By the way, I found the Moomins kind of creepy when I was little, but I'm ready to give them a shot now."}, {"userName": "Karin", "userReviewDate": "Jun 02, 2015", "userURL": "http://www.goodreads.com/user/show/10277044-karin", "userReview": "'üks osa ootust ja kaks osa kevadist nukrust, ja kõik ülejäänu peab olema ainult ohjeldamatu rõõm' -nuuskmõmmik"}, {"userName": "Lena", "userReviewDate": "Oct 25, 2017", "userURL": "http://www.goodreads.com/user/show/11171520-lena", "userReview": "I am so in love with this book! It is not merely because Tove Jansson was such a great artistic personality, but also the book itself has been composed with great respect and interest to the protagonist and to the cultural background of her time. The content is very well-balanced between the personal and the artistical components, while the numerous quotes and references to Tove's correspondence give the book an authentic touch. And the cherry on top is the abundant amount of illustrations and archive photographs."}, {"userName": "Fredrikke Wongraven", "userReviewDate": "Jan 15, 2018", "userURL": "http://www.goodreads.com/user/show/28183081-fredrikke-wongraven", "userReview": "this was a beautiful book that had a lot of insight into tove jansson's life. i didn't really know a lot about her, so it was really interesting to look at her story as well as learning about female history and art history in finland.recommended read for anyone who likes moomin, finland and art history."}, {"userName": "Kiki", "userReviewDate": "Apr 29, 2018", "userURL": "http://www.goodreads.com/user/show/75870860-kiki", "userReview": "Pitkäänhän tän lukemisessa meni, mutta mielenkiinto säilyi kyllä koko kirjan ajan. Sain paljon uutta tietoa, suosittelen, vaikka ei pitäisikään muumeista, sillä kirjassa kerrotaan myös mm. Toven muista kirjoista ja maalauksista."}, {"userName": "Marina Sinelnikova", "userReviewDate": "Jan 25, 2018", "userURL": "http://www.goodreads.com/user/show/15946771-marina-sinelnikova", "userReview": "Ощущение от биографии осталось очень похожее на ощущение после книг Туве - наверное, это значит, что биография хорошая. Плюс довольно внятная картина художественной жизни Финляндии на заднем плане: я люблю контекст."}, {"userName": "Soph", "userReviewDate": "Oct 10, 2017", "userURL": "http://www.goodreads.com/user/show/8024717-soph", "userReview": "FUCK"}, {"userName": "Kirsty", "userReviewDate": "Jul 15, 2016", "userURL": "http://www.goodreads.com/user/show/56491386-kirsty", "userReview": "The best part of Tove Jansson’s centenary celebrations was, for me, the plethora of new books released, which showcased both her own work and her life. The second biography of Jansson, written by Finnish art historian Tuula Karjalainen, follows Boel Westin’s work, Tove Jansson: Life, Art, Words. Whilst the titles of both books are similar, it is Karjalainen’s which stands out, and which, I feel, provides the best insight into Jansson’s work.Jansson was born in Paris in 1914, and moved to Finland in her early childhood. The blurb of Tove Jansson: Work and Love states that she ‘led a long, colourful and productive life, shaped by the political, social and cultural landscape of 20th-century Finland’. The blurb of the book says, quite rightly, that Karjalainen has conjured up ‘a vivid picture of Jansson’s extraordinary life’. Rather than focus solely on Jansson’s literary output, as Westin’s work largely does, Karjalainen has taken into account her writing and artwork in equal measure: ‘Her life’s work is enormous. It should really be discussed in the plural, because she had several careers – as an author of fairytales, as an illustrator, painter, writer, stage designer, dramaturge, poet, political caricaturist and cartoonist’. Much of Tove Jansson: Work and Love has been built around the ‘decades of personal correspondence and journals’ which she was able to examine following Jansson’s death in 2001.Tove Jansson: Work and Love was first published in Finland last year. In her book, Karjalainen begins with a lovely section entitled ‘To the Reader’, which speaks of the early days of the relationship between Tove’s parents, Signe and Viktor. She goes on to write about the things which she has personally gained from peering into Jansson’s life: ‘Stepping in… has been a rich and wonderful experience, though I had constantly to be aware that I might not necessarily be welcome. Tove has been the subject of biographies, studies and dissertations written from many different points of view. She permitted it during her lifetime, despite not always being very interested’. The structure of the book is interesting, and certainly works well; it hovers somewhere between being a chronological and thematic account, Karjalainen believing that these elements are of equal importance in such a biography.Tove Jansson: Work and Love is incredibly well written, and such care has been given to its translation. Lovely photographs and beautiful specimens of Jansson’s art, all in beautiful colour, have been interspersed throughout. Karjalainen adds new information and thoughtful musings to the impression previously given of Jansson’s life and work. Quotes have been included from those who knew her best, and who have devoted time to examining her life. Karjalainen has even given such thought to the book’s title; it is based upon Tove’s ex libris motto, ‘Laborare et Amare', the two elements of paramount importance for her.It is clear throughout that Karjalainen has such respect for Jansson and her work, and sums her up perfectly in the following paragraph: ‘Tove’s life was fascinating. She challenged conventional ways of thinking and moral rules in a country where old prejudices, especially on the subject of sexual behaviour, maintained a strict hold… She influenced the values and attitudes of her time, but was no flag-bearer – instead, she was a quiet person who remained uncompromising in her own life choices’.Tove Jansson: Work and Love is a sheer joy for all of Tove’s admirers; it is in depth, compassionate, far-reaching and absolutely stunning. The book itself is absolutely beautiful, and its gloriously colourful back and spine are sure to delight every Moomin fan."}, {"userName": "Anna Eränen", "userReviewDate": "Dec 29, 2017", "userURL": "http://www.goodreads.com/user/show/75700450-anna-er-nen", "userReview": "Ensimmäinen elämäkerta, jonka olen lukenut. Kirjan visuaalinen asu fonttia myöten on erittäin viehättävä ja innoittaa lukemaan. Laaja teos, joka avasi Tove Janssonia henkilönä juuri sopivan verran. Teksti on raikasta, eikä lukemista tahtoisi lopettaa millään. Ehdoton lukusuositus!"}, {"userName": "Taneli Viitahuhta", "userReviewDate": "Dec 21, 2015", "userURL": "http://www.goodreads.com/user/show/16756635-taneli-viitahuhta", "userReview": "Tove Jansson was stunning, phenomenal, like a breath of fresh air in the musty chambers of Finnish art world of 1900s. The artistic and personal life of hers, condensed here neatly into depiction of works and concise biography, is quite simply inspirational beyond comparison in this sorry land of artistic opportunists, drunken \"genious\" ego-maniacs and craven dogmatists. Karjalainen's writing on the other hand is at times bit conservative in the way it portrays its subject, for examples she lapses into questionable narrative of Tove being \"insecure as an artist\" because of her letters and other private enunciations - while the public counter-evidence to the claim is outstanding! Also Tove's sexual life is dealt with in a manner that doesn't quite give enough credit for her single-minded courageousness in not hiding her partnership with Tuulikki Pietilä in any way at times when this could have even been taken for a criminal act. Also in political matters writer keeps a very civil tongue: Tove's farsighted, untimely look on the thorny link between aesthetics and politics should be decidedly celebrated. The very unique balance in her political unpoliticalness should be clearly pointed out at times when we can judge the horrific political narrative of 20th century . This is not a matter of cozy wisdom after the events, for Tove did her share in ridiculing Hitler as well as Stalin in the 40s already. But she never swam with the tide, which makes her arts and politics so powerful when unclosed in the present times.The book has a lovely collection of illustrations and the layout is gorgeous. Even taking into account its slight shortcomings, this is still the best springboard for a dive into a world of a singular vision: world of Tove Jansson's, a writer, painter, illustrator, cartoonist, scriptwriter, and an over-all artistic powerhouse of a woman."}, {"userName": "JaanaMi", "userReviewDate": "Jan 25, 2014", "userURL": "http://www.goodreads.com/user/show/25206254-jaanami", "userReview": "Rakastetusta (ja syvästi rakastamastani) Janssonista on kirjoitettu paljon. Silti tämä teos antoi paljon uutta ja säilytti kiinnostavuutensa alusta loppuun. Elämänkerta oli rakenteeltaan toimiva: enemmän kuin kronologisesti, se eteni lähinnä aiheittain ja teemoittain. Tässä elämänkerrassa keskitytään kuvaamaan paitsi Janssonin taidetta ja sen taustoja, myös Tove Janssonia henkilönä, osana omaa aikaansa ja sen arvomaailmaa sekä kulttuurista ja historiallista tilannetta. Teoksessa kuvaa lahjakkaasta, valtavan hienon tuotannon tehneestä ja kiinnostavan, täyden elämän eläneestä Tovesta maalataan paljolti hänen lähipiirinsä kautta ja hänen ajattelutapojaan ja arvojaan valotetaan kiinnostavasti mm. monille eri henkilöille osoitettujen kirjekatkelmien valossa. Rikkaan tekstisisällön lisäksi kirjassa on paljon valokuvia ja Janssonin töitä, niin valmiita töitä kuin luonnoksiakin. Ilahduttavaa oli myös se, että kirjassa esiteltiin laajasti myös Janssonin monipuolisen tuotannon koko kirjoa, ei ainoastaan muumeja (niin paljon kuin muumeja rakastankin!).Suosittelen kaikille niille, jotka jakavat rakkauteni Tove Janssoniin niin kirjailijana kuin kuvataiteilijanakin."}, {"userName": "Laura", "userReviewDate": "Jan 05, 2014", "userURL": "http://www.goodreads.com/user/show/7313532-laura", "userReview": "Olipa kaunis kirja upeasta taiteilijasta. Tove on kiehtonut aina, ja silti tämä on ensimmäinen elämäkerta, jonka hänestä luen ja lopulta huomaan tienneeni hänestä niin kovin vähän, lukeneeni liian vähän ja pitäneeni rakastamiani muumejakin liian keskeisinä. Olipa ihana tähän siis nyt todella uppotua.Ihan vähän kirjassa häiritsi Karjalaisen välillä kovin ylitulkitseva ote sekä kronologisen etenemisen sijaan valitun teemoittain etenemisen seuraksena ilmentyvä toisto, joka olisi vielä yhdellä huolellisella editointikierroksella varmaankin vähentynyt, mutta ei se onneksi tarinalta juurikaan ollut pois. Pitänee seuraavaksi tarttua johonkin Toven omaan kirjaan, tästä sitä taustaa niille ainakin saisi."}, {"userName": "Helin Puksand", "userReviewDate": "Aug 07, 2015", "userURL": "http://www.goodreads.com/user/show/41762337-helin-puksand", "userReview": "Lugemisväljakutse 32. raamat - tõsielu kajastav raamat (elulugu). Olen teadnud Tove Janssonit kui kirjanikku ja olen mitmeid tema teoseid ka lugenud. Nüüd tuleb aga välja, et ta on rohkem kunstnik. Raamat on väga soe ja inforohke, tekkis tahtmine Tove Janssoni raamatuid veel ja uuesti lugeda. Ka raamat ise on soliidne - just selle teose vääriline. Muide, seni on olnud minu lemmikuks Tove Janssoni raamatutest \"Suveraamat\", kuid pärast tema eluloo lugemist tasub vist ka muumiraamatud uuesti kätte võtta. :)"}, {"userName": "Essi", "userReviewDate": "Dec 26, 2014", "userURL": "http://www.goodreads.com/user/show/38358875-essi", "userReview": "Tove on supernainen! Mielenkiintoinen kirja, tosin omasta taidenoobiudestani johtuen vähän liian taidekeskeinen. Kirjan parasta antia olivat sota-ajan kuvaukset ja kertomukset muumilaakson synnystä. Teosta ei ole järjestetty täysin kronologisesti, minkä vuoksi eri luvuissa oli havaittavissa hieman toistoa."}, {"userName": "Nugzar Kotua", "userReviewDate": "Feb 21, 2018", "userURL": "http://www.goodreads.com/user/show/35399308-nugzar-kotua", "userReview": "Закрывая последнюю страницу книги, я ощутил глубокую грусть. Тонкая, гениальная, живая, добрая, интересная Туве. Думаю, такие люди появляются один раз в столетие. Однозначно рекомендую книгу Туулы Карьялайнен не только поклонникам творчества Туве Янссон, к коим я причисляю и себя, но и всем тем, кому интересна жизнь гениальной женщины, показанная, с одной стороны, через призму событий XX века, а с другой стороны, через призму ее собственной души. Нехронологичность повествования лишь усиливает впечатление от книги и помогает закреплять и запоминать факты, снова и снова возвращая нас к самой писательнице, ее жизни, переживаниям и творчеству. Спасибо автору.«Closing the last page of the book, I felt a deep sadness. Fine, ingenious, lively, kind, interesting Tuva. I think such people appear once in a century.I definitely recommend the book of Tuula Karjalainen not only to fans of creativity Tove Jansson, to whom I enumerate myself, but also to all those who are interested in the life of a brilliant woman, shown on the one hand through the prism of the events of the 20th century, and on the other hand, through the prism of her own soul.The lack of synchronism of the narrative only strengthens the impression of the book and helps to consolidate and remember the facts, again and again bringing us back to the writer herself, her life, experiences and creativity.Thanks to the author.»"}, {"userName": "Helene Uppin", "userReviewDate": "Feb 02, 2018", "userURL": "http://www.goodreads.com/user/show/75886418-helene-uppin", "userReview": "Kui peamine asi, mis raamatu lõppedes peas vasardab, on \"liiga pikk!\", siis pidi minu jaoks midagi valesti olema.. Tove Jansson, keda ma tatikana olen Õismäe raamatukogus ka isiklikult kohanud - mh. võitsin viktoriinis ka kummist muumitrolli! - oli ju geniaalne kunstnik ja kirjanik ning ainest, millest nii palju lehekülgi täita, kahtlemasti jagub, aga.. Minu jaoks vist lihtsalt ei õigustanud end see mittekronoloogiline ülesehitus, mistõttu tundus, et ma loen igas peatükis jälle samu asju.. Asi päädis sellega, et esimese poole raamatust lugesin korralikult ja edasi lasin diagonaalis, ainult ajuti teksti süvenedes. Võibolla läks midagi tõlkes kaduma (kui originaalkeeles oli tekst kuidagi iseäranis poeetiline näiteks, tõlge seda ei olnud), võibolla oleks juba algselt toimetaja pidanud kääre kõvemini naksutama - ei oska öelda. Tove Janssoni loomingu austajale sisaldab see tekst kindlasti palju huvitavat, kuid ilukirjanduslikku naudingut niisama-kiibitsejale nii palju ei jagu. Suhteliselt huvitavad ajastu- ja olustikukirjeldused vaheldusid kataloogilaadsete plasside raamatututvustustega ja lugu jälle takerdus. Vähemalt selline tunne jäi mulle. Siiski - raamat on ilus ja Tove pildid ning mõned hästivalitud fotod lisavad mu hinnangule tärni. Parim osa raamatust. Ja see ehk peabki nii olema, arvestades, et juttu on ikkagi inimesest, kelle elus leib tuli lauale ennekõike just raamatute illustreerimisest, kirjutamisest ja koomiksite joonistamisest."}, {"userName": "M.H.Johnsen", "userReviewDate": "May 28, 2017", "userURL": "http://www.goodreads.com/user/show/25605576-m-h-johnsen", "userReview": "Tuula Karjalainen's biography of Tove Jansson is an inspiring account of Jansson as an artist and as a person, not just as the creator of the moomins, for which she is best known. Jansson's output was enormous, spanning illustrations, paintings, political caricatures, novels, poetry, stage design, playwriting, and, of course, comic books. Karjalainen's portrait touches upon all these and the book offers beautiful illustrations and photographs throughout, all of which provides insight into Jansson's fascinating life, from the first moomin, drawn like Immanuel Kant alongside the text ‘Freedom is the best thing’, through wars, the art scene in Helsinki, lovers and sexuality, bravery and uncertainty, travels in Europe and international fame, to the house on the small island of Klovharun. It is beautifully translated (and I understand the English translation 'Work and Love' is equally well done), and clearly written by someone with a lot of knowledge and respect for Jansson. I thoroughly recommend it."}, {"userName": "Peter Pinkney", "userReviewDate": "Dec 20, 2017", "userURL": "http://www.goodreads.com/user/show/33334584-peter-pinkney", "userReview": "I came to The Moomins late in life, but love them nevertheless. I recently went to an exhibition of Tove Jansson’s work at Dulwich in London. Her artwork was beautiful. When I got home, I remembered that I had two biographies, of her, that I bought some years ago. This is the one I decided to read. I found it a bit hard going at first as it’s written by an art historian/critic, and although I love art, I’m no expert and found descriptions of paintings difficult to understand properly. However I persevered and I’m glad that I did.Jansson was a formidable person, and her talents were endless-author, illustrator, artist, cartoonist, and, of course, creator of the Moomins. The author clearly loves all aspects of Jansson, and this is an affectionate, but also searching biography. Then there is the wonderful illustrations. A delightful book."}, {"userName": "Aino", "userReviewDate": "May 10, 2018", "userURL": "http://www.goodreads.com/user/show/31088361-aino", "userReview": "Kesällä odottaa haaveiden matka Klovharulle ja etenkin sen vuoksi olen halunnut perehtyä entistä tarkemmin ihailemani Tove Janssonin elämänvaiheisiin ja teoksiin eri taiteen saroilla. Tuula Karjalaisen kirjoittama elämäkerta oli suorastaan ahmittava kuvaus Janssonista. Perhe, ystävät, rakkaussuhteet, sota, maalaaminen, kirjoittaminen, kuvitukset, vaikeat taloudelliset ajat ja maailmanmaine, masennuskaudet ja luovuuden puuskat, matkat ja saaristo. Karjalainen kertoo tästä kaikesta sielukkaasti. Suosittelen kirjaa lämpimästi.Ote kirjasta: Vivica Bandler on muistellut heidän yhteisiä kesiään Pellingin saarissa: \"...Siellä kaikki muuttui merkityksekkääksi; jokainen varpaan kastaminen meressä, jokainen keskustelutuokio. Kun oli siellä, tuntui kuin olisi päässyt kurkistamaan taivaaseen.\""}, {"userName": "Jenni", "userReviewDate": "Aug 04, 2017", "userURL": "http://www.goodreads.com/user/show/15878974-jenni", "userReview": "Kukapa meistä ei tietäisi Tove Janssonia ja muumeja. Mutta kukapa meistä oikeasti tietää millainen taiteilija noiden hahmojen takana oli ja mitä kaikkea muuta hän on tehnyt. Tämä oli mielenkiintoinen katsaus Janssonin elämään ja hänen töihinsä. Toki kertomukset muumeista ja niiden syntyvaiheista olivat kiinnostavia, mutta vielä enemmän olin kiinnostunut kaikesta muusta taiteesta jota Jansson elämänsä aikana loi, kuinka upeaa ja terävää se oli. Hieman häiritsi se, että kronologisuus ei ihan toiminut, ja välillä viitattiin teokseen joka oli maalattu vuosia ajankohtaa X myöhemmin, ja sitten taas hypättiin puhumaan jostakin mitä oli tapahtunut paljon aiemmin."}], "description": "Tove Jansson (1914-2001) on Suomen tunnetuimpia taiteilijoita, ja hänen kirjojaan on käännetty tällä hetkellä jo yli neljällekymmenelle kielelle. Jansson oli monilahjakkuus - kuvataiteilija, kirjailija, kuvittaja, käsikirjoittaja, laulujen sanoittaja ja miltei mitä vain. Tuula Karjalaisen kirjoittama elämäkerta osoittaa, miten Janssonin elämä ja taide nivoutuivat tiiviisti toisiinsa ja miten esimerkiksi Muumilaakso ja sen asukkaat syntyivät toisen maailmansodan aikoihin, jolloin kirjailijan itsensä oli paettava julmaa aikaa mielikuvitukseensa, jonnekin lempeämpään maailmaan.Ihmisenä Tove Jansson vaikutti aikansa arvoihin ja asenteisiin, muutokseen - ei koskaan vallankumouksellisena lipunkantajana, vaan hiljaisena mutta tinkimättömänä omien valintojensa mukaan eläjänä, esimerkkinä. Hänen syntymästään tulee vuonna 2014 kuluneeksi sata vuotta.", "title": "Tove Jansson: Tee työtä ja rakasta", "url": "http://www.goodreads.com/book/show/18805228-tove-jansson", "average": 4.14, "cover": "https://images.gr-assets.com/books/1384452467l/18805228.jpg", "reviews": 93, "authors": [{"url": "https://www.goodreads.com/author/show/479668.Tuula_Karjalainen", "name": "Tuula Karjalainen"}], "type": ["Nonfiction", "Art", "Biography", "European Literature"], "outlinks": ["http://www.goodreads.com/book/show/18805228-tove-jansson", "http://www.goodreads.com/book/show/22668772-tove-jansson", "http://www.goodreads.com/book/show/23606889-tove-jansson", "http://www.goodreads.com/book/show/20437591-tove-jansson", "http://www.goodreads.com/book/show/29429838-tove-jansson", "http://www.goodreads.com/book/show/23500756-tove-jansson", "http://www.goodreads.com/book/show/36452392", "http://www.goodreads.com/book/show/35648464-tyko-sallinen", "http://www.goodreads.com/book/show/17154726-kantakuvat", "http://www.goodreads.com/book/show/37655359-kuin-silloin-ennen", "http://www.goodreads.com/book/show/5002968-uuden-kuvan-rakentajat", "http://www.goodreads.com/book/show/33137166-tove-jansson"]}