{"ratings": 415, "userreviews": [{"userName": "Violet wells", "userReviewDate": "Oct 14, 2015", "userURL": "http://www.goodreads.com/user/show/4196681-violet-wells", "userReview": "“She has always been somehow weightless, free of the heavy burden of mother tongues, national histories, native soils, homelands, fatherlands, myths, that many of the people around her tote on their backs like a sack of red-hot stones.” This is Haya Tedeschi who, at the beginning of the novel, is an old Jewish woman sitting in a rocking chair in the Italian town of Gorizia, near Trieste. She is surrounded by documents, photographs, cuttings. Her head is swarming with memories, “melting in her mind like chocolate”. It should be remembered that Trieste was one of those places which was a disputed territory in both world wars. A kind of no-man’s land perennially awaiting the outcome of some new military action. Its inhabitants never quite sure of where they belonged, pressed in by borders that were continually shifting around them. In short, it’s an inspired place to set a novel about the horrors of world war two. Haya’s story is constructed piece by piece with frequent brilliantly researched documentary interludes. The artistry with which this novel moves back and forth between the personal and the public, a microcosm and a macrocosm of the Holocaust is, for the most part, brilliant. Haya’s story is told with a kind of disarming playful lyricism at times which reminded me of Nicole Krauss but without Krauss’ whimsy, her artificial sweeteners (which I enjoy) . We learn about Haya’s family’s displacement during the first world war. We learn that, like most Italian Jews, they are integrated into Italian life and do not identify themselves primarily as Jewish. To outsiders they are essentially indistinguishable from any other local resident. We see how they are forced by events to become nomads. Work takes them to Albania, Milan, Naples, Venice and Trieste. The hub of the novel is Haya’s relationship with a seemingly and, relatively speaking, innocent German soldier who is also a keen photographer. Haya is a typical young girl. Wilfully ignorant. While transports are leaving Trieste in the middle of the night she is often to be found at the cinema or dining in a trattoria. (Drndic is very tough on Haya and her family: “The Tedeschi family are a civilian family, bystanders who keep their mouths shut, but when they do speak, they sign up to fascism. For 60 years now these blind observers have been pounding their chests and shouting we are innocent because we didn’t know!…these yes men, these enablers of evil.”) Kurt Franz, the German boyfriend, leaves her when she is pregnant. A year later her son mysteriously vanishes when her back is turned. The central mystery of the novel is what happened to her son. The personal horror of the novel is the gradual unfurling of who his father was, what he did.  There’s a sense we’ve become a little immunised to the horrors of the Holocaust. This novel rips through all those palliatives. It adds new horrors to the Holocaust. Some of the things you learn are as disturbing as anything you already know. I won’t spill any beans because these details are very much an integral part of the novel’s emotional charge. You also learn a few more light-hearted facts like, for example, how when Mussolini’s Ministry of Culture clamped down on the infiltration of foreign words into the Italian language they forbade Italians to refer to Louis Armstrong by his American name; instead he had to be called Luigi Braccioforte! More unsettling we discover that the Swiss allowed the transport trains to pass through their territory when the Brenner tunnel was snowed up on the provision that the Red Cross be allowed to serve the prisoners hot soup and coffee. I read some of the other reviews of this and noticed one person objected to the Nuremburg transcriptions and especially the list of the 9,000 Jews deported from Italy. I found this list very moving because you knew every one of those people had a deeply moving human story like Haya’s. And you don’t have to read every name on the list so this seemed a rather querulous complaint. There might be a case for complaining that, at times, the documentary dwarfed the human story of Haya; that perhaps one didn’t quite get to know Haya as much as one would have liked and occasionally the large scale narrative detracted rather than added to the momentum of the small scale narrative. Personally, for example, I found the quoting of Pound, Borges, Shakespeare, Eliot and others clumsy rather than illuminating. But this is a small misgiving. There’s also a fabulous twist when, late in the novel, we learn who is narrating the novel. This is without question one of the most painful novels I’ve ever read. It’s no Schindler’s List, softening the horror with acts of moving kindness. There’s nothing uplifting about this narrative - except the artistry with which it’s constructed."}, {"userName": "Elyse", "userReviewDate": "Jan 21, 2017", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "Trieste is a city and seaport in northeastern Italy situated towards the end of the narrow strip of Italian territory lying between the Adriatic Sea and Slovenia. This book by Dasa Drndic, had me 'google-reading' about the ancient history, the Middle Ages, the early modern days, 19th century, 20th century, ....WWI, annexation to Italy and the Fascist area, WWII and the aftermath, and the Zone A of the Free Territory of Trieste in 1947-54. Any reader who loves storytelling -- will be enchanted at the start of this novel. Haya Tedeschi, was born in 1923, in Gorizia....a time when the town and the whole region became officially part of Italy. Haya, reflects back on her Catholicized Jewish family's experiences. She's sitting in a rocking chair surrounded by a basket of photographs and newspaper clippings. Haya was waiting to be reunited with her son after sixty-two years, fathered by an SS officer and stolen from her by the Germans authorities. --part of Heinrich Himmler's clandestine Lebensborn project founded in 1935....( outlaws of intermarriage with Jews and others who were considered inferior). Children who were born by an interracial couple were believed to grow up to lead a Nazi-Aryan nation.  \"I got in touch with the Red Cross. I hoped The Red Cross would help me find my grandparents' names. I might have relatives. I might have nephews. My mother had six brothers. My grandmother was a gypsy from Hungary and my grandfather was from Yugoslavia. I believe I have hundreds of brothers and sisters. Who knows how many women he slept with, and man who got my mother pregnant? Mother never told me my grandmothers' name. I am German property, because I was made in Germany at the behest of Heinrich Himmler. I was born in Germany, but when the war ended they forced Mary Bozic to take me with her, because they wanted to forget I existed. They did not want to see me. They wanted to forget that I had ever lived, but I'm not giving up. Germany owes me an apology. It owes me compensation. Me and my mother Mary Bozic. I must find out who my family are and where my grandfather and grandmother are buried. Thank you for hearing me out\". In the middle of this book there are 44 pages of about 9,000 names of Jews...( tiny print) ... who were deported from Italy, or killed in Italy or in the countries Italy occupied between 1943 and 1945. \"BEHIND EVERY NAME THERE IS A STORY\"It's 'powerful' to see all these names - each in print!!!!! It kinda does something to you! THIS is TERRIFIC historical novel. The reader gets a taste of the charming city- a cosmopolitan melting pot where at the beginning of the 20th century it was bustling with artist's and philosophers such as James Joyce and Sigmund Freud. Music, fashion, cuisine, politics, fishing, laughing, and the grand love of every day people....Dasa Drndic opened my eyes and gave me an experience of Trieste - past - and present-where I had none. The last chapters especially got to me....they would anyone!! Special thanks to *Violet* for recommending I read this. I bought the hard copy last 'year'. Sorry I took so long to read it.....and forgive me 'again' for going past my 3 sentence goal!!! Still need to try harder or read more average books."}, {"userName": "Kris", "userReviewDate": "May 20, 2013", "userURL": "http://www.goodreads.com/user/show/5974610-kris", "userReview": "The review below appears in The Quarterly Conversation, Issue 37: http://quarterlyconversation.com/trie... -------------------------------In the opening passages of Daša Drndić’s Trieste, an elderly woman, Haya Tedeschi, sits in a rocking chair in her third story apartment in the Northern Italian town of Gorizia, close to the port of Trieste:Is that the chair whimpering or is it me? She asks the deep emptiness, which, like every emptiness, spreads its putrid cloak in all directions to draw her in, her, the woman rocking, to swallow her, blanket her, swamp her, envelop her, ready her for the rubbish heap where the emptiness, her emptiness, is piling the corpses, already stiffened, of the past.As Drndić reiterates throughout the novel, “Behind every name there is a story.” And Haya Tedeschi’s story is draped in death. Born to a Jewish family that converted to Catholicism and tacitly supported the Fascists in Italy, Haya was a bystander to the Holocaust. She attended movies while Jews and partisans were transported to concentration camps; she pored over movie magazines while thousands of Jews and partisans were killed in the former rice mill San Sabba; she attended concerts with her Nazi lover, Oberscharführer Kurt Franz, while families were torn apart. And on April 13, 1945, the Holocaust was brought home to her when her infant son Antonio was stolen out of his stroller. Throughout Trieste, Haya waits for Antonio to be found, to return to her. As she waits, she echoes a refrain from T.S. Eliot’s “The Waste Land,” “HURRY UP PLEASE IT’S TIME.”In the novel’s epigraph, Drndić quotes Jorge Luis Borges: “A single moment suffices to unlock the secrets of life, and the key to all secrets is History and only History, that eternal repetition and the beautiful name of horror.” The central question of Trieste is the impossibility of coming to terms with the horrors of history, when historical cycles blend past, present, and future and there is no clear way to avoid repeating yesterday’s bloodshed. The novel itself is not built on character development or plot twists. Instead, Drndić amasses archival evidence that damns not only the Nazi regime but all bystanders for their complicity in the Holocaust. The novel bears witness, and demands its readers do the same.Jan Morris describes the city of Trieste as “an allegory of limbo,” demonstrated by its shifting political allegiances—first as a part of the Habsburg empire, then later given to Italy, briefly ruled by the Germans during World War Two, and finally given back to Italy in 1954 against the wishes of Yugoslavia. In 1943, when the Germans took over Trieste, they established a police barracks and extermination camp in the former rice mill of San Sabba. Drndić’s documentary evidence of the horrors experienced there shines a light on an often-overlooked part of the Holocaust. And the ability of local families such as the Tedeschis to blend into the majority during periods of crisis presents questions of culpability and identity. What does it mean to be Jewish? How to cope with the human toll of a commitment to national identity? Are children guilty of the sins of their parents? Are any families free from the ghosts of ancestors’ mistakes?Throughout Trieste, Drndić provides a wealth of historical evidence: trial transcripts, interviews, photographs, music, maps, genealogical charts. This documentary evidence is presented in overwhelming detail. In one 44-page span, Drndić provides a list “of about 9,000 Jews who were deported from Italy, or killed in Italy or in the countries Italy occupied between 1943 and 1945.” Drndić’s approach recalls Roberto Bolaño’s list of murdered women in Mexico in 2666, and to a lesser extent his encyclopedia of fictional literary fascists, Nazi Literature in the Americas. Drndić’s approach is different in part because of the years of archival research behind the novel, in part because of the sheer variety of documents she presents. In some cases, she even brings the dead back to life, as when she presents testimony from those who died in the concentration camps. And in the rooms of archives like Bad Arolsen lie millions of stories waiting to be told:At the baroque palace in Bad Arolsen, on huge sliding shelves marked with the names of the camps, cities, battles, regions, in alphabetical registers, lurk unfinished stories, trapped fates, big and little personal histories, embodied histories, there are people huddled there who languish, ghost-like, and wait for the great Mass of Liberation, the eucharistic celebration after which they will finally lie down, fall asleep or depart, soaring heavenward. Bad Arolsen, this vast collection of documented horror,preserves the patches, the fragments, the detritus of seventeen, yes, in digits, 17 million lives on 47 million pieces of paper collected from twenty-two concentration camps and their satellite organizations….Drndić also provides a window into Haya Tedeschi’s thoughts through morbidly lyrical passages detailing Haya’s dreams and internal visions. Throughout the novel, during her decades of waiting, Haya is haunted by ghosts.She hears voices where there are none. Her voices are dead. All the same, she converses with the voices of the dead, she quibbles with them, sometimes she slumps limply into their arms and they whisper to her and guide her through landscapes she has forgotten. There are times when events boil over in her mind and then her thoughts become an avenue of statues, granite, marble, stone statues, plaster figures that do nothing but move their lips and tremble.Her memories a graveyard, Haya is surrounded by decay and rot. She dreams of corpses and skulls, of dragging her mother by her legs to hide her. She leafs through the archival records she has amassed, which she keeps in a red basket by her feet.Now, in 2006, while she waits, while she sifts through the past as if opening dry beanpods from which the beans fall like sealed, enslaved little stories composed of images flitting by in flashes, while she digs through the red basket at her feet uncovering the crusty layers in the little piles of sealed lives, out slips the envelope, so she puts it on her lap and rocks it as if it is a stillborn child.In 2006, as Haya walks the streets of Gorizia, the dead are more real to her than the neighbors she passes:She cannot see, nor is she watching. She has wax plugs in her ears. She does not hear…. She has little memories, darting memories, fragmented. She sways on the threads of the past. On the threads of history. She swings on a spider’s web.Haya used to look to literature for answers to her pain and guilt, and the novel is filled with quotations from T. S. Eliot and Romain Rolland, Jean Giono and Ezra Pound. She even engages in a debate with Kierkegaard over despair and memory. But by the end of her period of waiting, she has grown weary of words, preferring numbers and formulas instead, “because everything is in formulas, everything.”Haya’s lover Kurt Franz lived the instability of language. An amateur photographer, he meets Haya in a tobacco shop, when he buys film. They soon begin to meet in secret, screening away the reality of war. Franz presents himself as cultured, handsome, charming, an avid gardener who loves his dog Barry, lives for music, and is a devoted son. In reality, before arriving at Trieste, Franz oversaw final operations at Treblinka, pushing through final executions and killing inmates by his own hand, or by ordering Barry to attack male inmates. And then, in 1943, he was assigned to Trieste, where he was responsible for overseeing the executions of Jews and partisans in San Sabba. Haya and Franz’s relationship illustrates the destructive power of relationships: “The way lives interweave yet never touch, only to collide in mutual destruction, inconceivably distant in their simultaneity.”Haya is not the only character haunted by Kurt Franz’s crimes. Their son, Antonio Tedeschi, was kidnapped under the Lebensborn project, a German program designed by Himmler to ensure the racial purity of the German race by providing care for pregnant women, and later by enabling German families to adopt children who met the racial and biological standards set by the Nazis. Many of these children were kidnapped. Antonio provides his own testimony in the final chapters of Trieste, the only chapters written in the first person, adding to the immediacy and power of his witnessing. He speaks of his anguish in learning that the Traubes, who raised him as Hans Traube, were not his biological parents, as well as his pain and guilt in learning that his biological father was a Nazi. He holds himself complicit in his father’s actions by virtue of having Franz’s blood running through his veins.In a telling detail, Hans is a professional photographer, which both represents his bearing witness, and provides a link with his biological father, the amateur photographer.My situation is complicated many times over. I was stolen. I am a Lebensborn child…. But theninto my life crept that murderer, S.S.-Untersturmführer Kurt Franz and that Jewish woman who spread her legs for him, for the blonde angel of death, the admirer of music and nature, the bad amateur fanatic photographer, the baby-faced executioner, she spread her legs while trains rumbled past, right there in front of her nose, on their way to killing grounds all over the Reich.Antonio notes that his story is shared by many others, as he provides testimony from other Lebensborn children. Their experiences reveal the continuation of hatred, secrecy, racism, and pain decades beyond the end of World War II. There’s no outlet for their pain, no compensation that can give them back, not only their childhood, but also their sense of self.Antonio’s voice is clear, strong, anguished. Like Haya, he attempts to reconstruct his identity through archival research. Crucially, they are both looking for some respite from the burden of history – but Drndić does not provide much hope. As Antonio says near the conclusion of the novel, “Together, we will drape ourselves in the histories of others, believing that those pasts are our pasts and we shall sit and we shall wait for those pasts to fall into our lap like a fat, dead cat.” And he concludes with a chilling reflection on the repetition of history:We should probably be able to learn something from the repetition of history, repetitio est mater studiorum, but despite the fact that history stubbornly repeats itself, we are bad learners, and History, brazen and stubborn, does not desist, it goes right on repeating and repeating itself, I will repeat myself until I faint, it says, I will repeat myself to spite you, it says, until finally you come to your senses, it says, yet we do not come to our senses, we just grow our hair, hide and lie and feign innocence. Besides, for some of us, those of us who like Santa Claus lug sacks on our backs, sacks brimming with the sins of our ancestors, History has no need to return, History is in our marrow, and here, in our bones, it drills rheumatically and no medicine can cure that. History is in our blood and in our blood it flows quietly and destructively, while on the outside there’s nothing, on the outside all is calm and ordinary, until one day, History, our History, the History in our blood, in our bones, goes mad and starts eroding the miserable, crumbling ramparts of our immunity, which we have been cautiously raising for decades."}, {"userName": "Dov Zeller", "userReviewDate": "Oct 06, 2015", "userURL": "http://www.goodreads.com/user/show/440651-dov-zeller", "userReview": "I've read reviews in which people call this book a brilliant novel, and in my mind brilliance is beside the point and whether or not this is a novel I could not say. It is a powerful weaving together of prose, poetry, oral histories and other historical documentation. A book in which a character tries to come to terms with her choices during a time of war, and for all of her years lived after the war, forces herself to look unflinchingly at her complicity and tries to unravel the mystery of her son's disappearance (a good 60 years before this novel's chronological present.)I've heard \"Trieste\" described as \"documentary fiction\", a category I didn't know existed, and one I like very much. People compare her to Sebald, and I don't know if I agree. Her writing is much messier and much harder to assimilate, there is none of Sebald's smoothness. Instead of walking and talking like a tour-guide, it is almost as if someone is talking in the way of the ancient mariner, but without any care as to who is listening. Haya doesn't seem to notice us, she is quiet and determined and perhaps a little monomaniacal (I realize that is a conflict of terms). Meanwhile, Drndic is screaming. I can feel her voice going hoarse, her mania, her horror and frustration as she uncovers more and more evidence of the horrors of history that go on unwitnessed, un-addressed, unjustified, still clawing into our collective consciousness. If only there could be some kind of reparation, so we can move onto a clean page. But there are no clean pages. Every page has the names of the dead, of the dead and forgotten who were killed unjustly and who suffered horrifically, and the dead and forgotten whose magnificent crimes were ignored. What is more horrific? That the victims are forgotten? That perpetrators, sadistic, more than willing engineers of vast killing machines, got a pat on the back and walked away to lead \"normal\" lives? One goodreads reviewer said she wished Drndic had taken another year to assimilate her raw materials before putting it all into this novelistic form, but it is the failure of the novel to assimilate its own contents that, I think, makes it such a force of nature. It is the unresolvable tension between Haya's quiet plodding voice and Drndic's rageful despair that makes this book a thorn in an ocean-sized paw. In a way this book is a critique of assimilation and the novelistic form. People want well-crafted stories that have good table manners and even do most of the chewing and swallowing for them. Drndic kind of gives us all a big, beautiful fuck you, and says, look at this mess! This is what history is! It's an overgrown, underchewed, gristly, grizzly mess! But it doesn't have to be! Or maybe it does. Because we are pitiful, spiteful and frail. We either walk away from our genealogy and our mistakes, or we're destroyed by them. I uniquely experience in this book the weight of and continuity between the two world wars, how they are part of the same inexorable tectonic shifting of history, and all of this through the life of a little port town and its own shifting national identities, and in particular, through the days of Haya Tedeschi, an Italian born Jew whose family is caught up in all the currents of these wars and doing its best to survive, often by keeping their world-view small and focused on not rattling any windows. In fact the family converts to christianity (I can't recall if it is a full conversion) and sides with the fascists because it is the path of least resistance (literally) and it is at this time, during the second world war, when the family is doing its best to stay under the radar and going so far as to resent the resistance fighters and see them as trouble-makers and the nazis and fascists as the civilizing force, that Haya meets a charming, boyish nazi officer and has an affair with him. She is around twenty years old and relatively innocent of critical thought, just letting herself be swept in the directions that bring her the most ease of pleasure and the least risk of pain. Something like that. And then she gets pregnant and her nazi reveals his true colors in an understated and chilling moment. He leaves Trieste and leaves Haya to manage on her own with the child, and she is happy to do that. But when her child disappears the course of her life changes. She spends much of the rest of her life trying to find him, and forcing herself to look at the horrors of the war and particularly those perpetrated by her sons father. At the center of this work is the tragedy and crisis of the children, particularly Jewish children, kidnapped or held \"hostage\" by the church (i.e. never returned to their family of origin after the war) so they could be raised as proper christians (the mechanics of this continue long after the war) and of the lebensborn -- children conceived as part of the nazi project of spreading their genetics far and wide. Many of the former never discovered their true identities, or by the time they did, it too late for reparation. Many of the latter were horribly abused after the end of the war, and even those who weren't often suffered (and still suffer) greatly trying to make existential sense of being born of murderers. One of the more famous lebensborn, acknowledged in this novel, is Anni-Frid of Abba. Also central to the novel is the history of the internment camp/death camp in Trieste called San Sabba. Toward the end of the novel we move away from Haya and toward her son, a professional photographer (his father was an amateur one, and, as Antonio Tedeschi/Hans Traube tells us, untalented). While I am often distracted and disappointed by shifts in perspective, this shift deepens my experience of the story -- it is very meaningful given the address of trauma through generations. Though their life experiences quite different. their emotional struggles are hauntingly similar:\"When I write about the role of my mother in the universal history of infamy, I will not know who strolled around the San Sabba rice mill, who snapped pictures of San Sabba, my mother or I, who searched through the files of the officials of the Adriatisches Kustenland, she or I, who studied the detailed form the life of SS Untersturmfuhrer Kurt Franz, Haya Tedeschi or I, Hans Traube-Antonio Tedeschi, who was it that visited Treblinka. Together, we will drape ourselves in the histories of others, believing that those pasts are our pasts and we shall sit and we shall wait for those pasts to fall into our lap like a fat, dead cat.\" (351)Some quotes from the novel (I could post many more, but not sure where to begin or end)Her grandfather was born in Gorz. Her mother was born in Gorz. She was born in Gorizia/Gorica. When the Great War broke out, the began moving, living in many places. She doesn’t know what Gorz was, nor does she know what Gorizia is now though she has been here nearly sixty years. She take walks along Gorizia’s streets, but hers are brief forays, quick walks, walks with a purpose, jaunts. Even when she takes longer strolls, when her strolls are more leisurely (when the days are mild and her room feels stale, a humid inertia), Haya doesn’t notice the big changes in her surroundings. She feels as if she has been sitting for sixty years in a shrinking room, a room whose walls are moving slowly inward to meet at a miniature surface, a line, at the apex of which she sits, crushed. She cannot see, nor is she watching. She has wax plugs in her ears. She does not hear. Gore, Gorizia, are memories. She isn’t certain whose memories they are. Hers or her family’s. Maybe they are fresh memories. When she goes out she squints at the sun, picks daisies, sits at the Joy Cafe and smokes. She has not let herself go. She does not wear black. She is not forever rocking back and forth. All is as it should be. She has a television. She has little memories, darting memories, fragmented. She sways on the threads of the past. On the threads of history. She swing son a spider’s web. She is very light. Around her, in her, now is quiet. Giros has a history, she has a history. The days are so old. (8)MINCULPOP is born, the Ministry of Popular Culture, and with it new dictionaries, orthographies, patriotism; the use of foreign phrases Is banned, and they are replaced by Italian surrogates. Maxim Gorky is dubbed Massimo Amaro, but he is swiftly removed from the libraries and bookshops; Louis Armstrong becomes Luigi Fortebraccio, and Benny Goodman is Benjamin Buonuomo; shortly thereafter MINCULPOP bans all jazz performance and broadcasts. Life in the Tedeschi family goes on. For Haya it is altogether ordinary, completely forgettable, as ordinary life is, until the day when, at the beginning of the school year in September 1938, her teachers Nella Negri, Amato di Veroli, Samuel Tagliacozzo, Massimo Pavoncello and Viola Sass do not show up to teach Geography, Mathematics, History, Italian and Physical Education. Until the day when Florian, after dinner, whispering in a conspiratorial hush, as if about to say something obscene, declares, We are Jews, and [Haya] asks, What does that mean? (47)On San Sabba So in 1976 Haya makes a little file, utterly pointless. She writes out notes, arranges them, rearranges them, as if shuffling a pack of cards. I could play solitaire with these notes, she says, which, in a sense, she does. This dog-eared file, full of cracked photographs of people, most of whom no longer exist, becomes Haya’s obsession; over the year she supplements her collection, slips into it little oddities, terse news items which after two, three, four decades she digs out and peruses, as if grabbing at dry dandelion fluff, as if catching eiderdown in a warm wind. Pointless, pointless. Forgotten dossiers, sealed archives open slowly, slowly, and what emerges is no more than water dripping from cracked sewage pipes. During the Trieste trial in 1976 only the two ‘big fish’ remain: Josef Oberhauser, brewer in Munich, former San Sabba commander and - from 1941 to the end of the war - Dr. Dietrich Allers, a high ranking official, one of the executive directors of the T4 program, a lawyer and SS -Obersturmbannfuhrer (approximately a colonel). But Allers dies a year before the trial, in 1975. Born in 1910 in Hamburg, Allers worked as an attorney until 1968, when he is sentenced to eight years in prison, which he does not serve out. So all the fuss, all the pursuit of justice - for nothing, because according to the agreements in force at the time between Italy and Germany, only those suspected of crimes committed after 1948 may be extradited. The trial goes on literally in a void: no defendants sit in the courtroom, the judges natter on, journalists snap their cameras - at no-one. In a solemn voice the judgement is read out to unschooled farmer Josef Oberhausen, but Josef Oberhausen is nowhere to be seen, so to whom is the judgement read? Oberhausen is sentenced in Trieste to life imprisonment, yet in Munich he goes on selling beer, especially during the Oktoberfest, when he is in particularly fine fettle. Three years later, in 1079, fat Oberhausen dies of a heart attack. ~On Barry, the dog of nazi Kurt Franz I don’t know how he was with children, but he was docile. After Treblinka closed, Barry was taken in by a Nazi physician and in 1944 the doctor sent Barry to his wife in northern Germany. Several years later they put Barry down, because he was old and feeble. Later, in 1965, veterinarians and psychologists from Dusseldorf asked the famous behavioral scientist Konrad Lorenz to shed some light on the dog’s behavior. Lorenz told them that such behavior in a dog is altogether plausible; that a dog’s behavior expresses the subconscious of the dog’s master, as Lorenz put it. If he has an aggressive master, the dog will probably attack other people, Lorenz said, and if the behavior of his master changes, the dog’s behavior will change as well, Lorenz said, and Lorenz can be believed, because during the war he was a loyal Nazi who ‘changed masters’ after the war and was given the Nobel Prize in 1973 for his research into animal and human behavior. (278)On the church’s role in child kidnapping during and after the war. It is known, writes Morelli, that at the time of the war many children found shelter in Catholic monasteries, in boarding schools and in schools, but not at the behest of the Pope, writes Morelli. It is well known that after the war the Jews who survived had serious difficulties locating their children, retrieving their children from Catholic institutions, writes Morelli, but until now it was only possible to surmise that the Church was systematically stealing Jewish children in order to indulge Jesus. For sixty years the Church and its ‘servants’ have been striving to prove to the world that they have no blemish on their conscience for their activities as far as World War Two is concerned, writes Morelli. For sixty years the Church has been trying to prove the innocence of Pope Pius XII and many of his bishops and priests. If there is anything that has been preserved with dedication and faith, anything that has been sacrosanct in the church books, then it is the dates of baptisms and deaths, writes Morelli, so it wouldn’t be difficult to ascertain what happened to the baptized Jewish children. If Switzerland, so-called neutral Switzerland, has mustered the strength to set up the edgier Commission, the I.C.E. - An independent commission of experts - though only on 12 December, 1996, writes Alfonso Morelli, to prove the ties between the Nazi regime and the Swiss banks who had at their disposal vast quantities of stolen Jewish property: if Australia has spoken out about the children kidnapped by their authorities, stolen from Aborigines during World War One, writes Morelli, then instead of obscuring history, the Catholic Church can get off its are and throw open its archives. And not only that, writes Morelli. It is time for the Church to stop pretending, to stop lying about how its greatest crime during the war was inadequate involvement in saving Jews, writes Morelli, it is time for the Church to stop believing that it is enough for it to launch anaemic apologies for its ‘inadvertent’ lapses, these ecclesiastical apologies, which are becoming more and more revolting over time, truly disgusting, insipid, writes Alfonso Morelli, because, he writes, it is reasonable to deduce that this letter written to Cardinal Roncalli is not the only incriminating document hidden in the vast secret archives of the Catholic Church. We are hopeful it has become clear by now, writes Morelli, that the Church should slow things down a bit as far as the panicked, nearly hysterical race to beautify, canonize, whatever, Pius XII, who, ah, now this is something that is widely known, writes Morelli, was at the head of a Church which was openly championing anti-Semitism at a time when the Nazis and Fascists were persecuting and murdering Jews on a grand scale. He, Pius XII, led a Church in which many German priests abused church birth registers in order to help the Nazis determine who should be first to wear a yellow star - and then be killed, and some German priests kept right on doing this officially for an entire decade after the Holocaust ended, in order to convince those Jews once and for all that they were guilty of murdering Christ. Just as a reminder, writes Morelli, the ‘Reichskonkodat’, a concordat signed on 20 July, 1933, between the Holy See and the Reich, is in force in Germany to this day. During that time, Eugenio Cardinal Pacelli, the future Pope Pius XII, is Secretary of the Vatican, and he is the one who signs this concordat, while Cardinal Micheal von Faulhaber, writes Morelli, in a sermon given in Munich in 1937, says, ‘Now, when the leaders of the greatest world nations observe the rise of the new Germany with a dose of reservation and much skepticism, the Catholic Church, this greatest moral force on earth, is showing its trust in the new German authorities through this concordat, which is an act of vast significance, because it contributes to the strengthening of the renown of the new authorities throughout the world,’ says Faulhaber, writes Morelli. Abe Foxman tells me, continues Morelli, and Foxman is director of the Anti-Defamation League, writes Morelli, that they placed him, Foxman, with a Polish family and his nanny had him secretly baptized, and later there were terrible problems, all sorts of complications, before he was returned to his parents. I believe that today there are tens of thousands of Jewish children in the world who were saved and then baptized, Abraham Foxman tells me, writes Alfonso Morelli, children who do not know to this day of their origins, nor will they ever learn of them, says Foxman, writes Morelli. (284)"}, {"userName": "Francisco H. González", "userReviewDate": "Nov 09, 2015", "userURL": "http://www.goodreads.com/user/show/39537363-francisco-h-gonz-lez", "userReview": "Acabo esta novela abatido, horripilado, espeluznado y nada consolado. Nada raro por otra parte, cuando la materia narrativa tiene que ver con las abominables acciones perpetradas por los nazis durante la Segunda Guerra Mundial contra los judíos, gitanos, partisanos, discapacitados, etc.Si uno desea conocer de primera mano lo que es la maldad humana en estado puro, aquí encontrará unos cuantos testimonios capaz de llevarte al borde de la náusea, sin apenas esfuerzo. Cuando al ser humano lo despojan de tal condición, se convierte en un objeto, en una materia sin valor, en una “carga” que se manipula como cualquier otro producto, una carga que será procesada, y reducida a cenizas y que luego en sacos será arrojada al fondo del mar o enterrada, a fin de no dejar los nazis rastro de sus atrocidades.Cuando la guerra acaba y los miembros de las SS y del tercer Reich son juzgados, ninguno de ellos reconoce sus crímenes, ni la maldad implícita en los mismos. Más allá de la obediencia debida, de alegar que estaban librando una guerra, que cumplían con su deber, ninguno de ellos se cuestiona, si degradar a seres humanos, darles tiros en la nuca al pie de las fosas comunes, matar a los prisioneros a golpes o dispararles como si fuesen conejos, mientras corren aterrorizados o vejarlos hasta reducirlos a un amasijo de carne arrumbada, lanzar bebés al aire y tirotearlos como si fuese una modalidad del tiro al plato, y finalmente gasearlos y matarlos haciéndoles creer que les van a dar una ducha reparadora, nada de todo esto es cuestionado por estos soldados, nada es puesto en entredicho, nada es simiente de remordimiento alguno, era el sistema decían, así eran las cosas se defendían.Una vez finaliza el exterminio quienes no son llevados ante la justicia, vuelven a sus hogares, a sus roles de padres ejemplares, de maridos perfectos, mientras escuchan música clásica en sus gramófonos y podan sus rosales, y leen la prensa y llevan vidas tranquilas en sus oficios, residiendo en las ciudades que les vieron crecer, hasta que un buen día alguien -esos pocos que lograron sobrevivir a los campos de exterminio- los reconocen por las calles, y entonces son llevados hasta la justicia, y unos son condenados a cadena perpetua, y muchos otros son liberados a los pocos años por causas humanitarias, declarados enfermos y muchos ni siquiera van a la cárcel, pues se han borrado tantas huellas como se han podido y los jueces imponen sentencias irrisorias, donde la muerte de varios miles de personas se salda con unos pocos años de cárcel en el peor de los casos.Y la reflexión que uno se hace es que la violencia siempre genera violencia y daño y malestar y no trae nunca nada bueno, y el que sobrevive y no se ciega con la venganza, a duras penas consigue sobrellevar el pasado, la tristeza, la amargura y muchas son las víctimas que tras dejar los campos deciden suicidarse.A su vez, los hijos bastardos que tuvieron los nazis, o aquellos fruto de las violaciones perpetradas en los territorios ocupados por los nazis, o los que fueron a parar a los Lebensborn de Himmler (que tras la guerra serían desmantelados) dejaron en el camino a miles de niños, más tarde adultos que nunca supieron quienes fueron sus padres, sus madres, su familiares. Niños que en esos orfanatos fueron víctimas de abusos de todo tipo, de maltratos, de múltiples vejaciones, pues sus agresores: bedeles, vigilantes, directores, veían en ellos la simiente del diablo, cuando hablamos de niños de muy corta edad. Otra barbarie más.En 1935 el título de bebé ario más bello de Berlín lo obtuvo una niña de seis meses llamada Hessy Levinsons ¿Se imaginan lo que sigue?. Sí, los padres de la niña, eran cantantes de ópera, originarios de Lituania y judíos. La fotografía de la niña se utilizó para la edición de tarjetas postales de manera que Hessy recorrió todos los territorios de Alemania impresa en una postal de felicitación. Niños y niñas judías que bajo las leyes de pureza aria, pocos años más tarde serían exterminados.Niklas Frank, hijo de un criminal nazi, abominó de su padre, de su pasado, de todas las cosas horrendas que este hizo. Es de los pocos que lo ha hecho. Frank piensa que lo que habría que haber hecho es haber ejecutado a todos los nazis, sin juicio ninguno. Porque si no nos encontramos con lo que luego ha pasado, que todo aquello ha germinado, que los nazis supervivientes, fueron luego arropados, justificados, minimizando entre todos ellos y a la larga, todo aquello, porque “El silencio se ha convertido en una enorme losa de cemento armado”.“De la Alemania nazi nació una red de canales subterráneos y que ahora llaman el duelo, la tristeza y el olvido, y que son como los tres ríos míticos que nunca se secan: Aqueronte, Cocito y Lete”.Thomas Bernhard cree que al Partido nacionalsocialista le sucedió el Partido católico, y que “ambas son dos enfermedades contagiosas, enfermedades del espíritu”. (que Haneke plasmó maravillosamente en su película La cinta blanca) Y respecto de Salzburgo dice esto: “el ser de esa ciudad es enfermizo, perverso y contaminado y que no difiere de otras muchas ciudades europeas católicas que estaban orgullosas de su nacionalsocialismo, o como fuera que se llamaran entonces”.La voz de la narración que articula todo el relato es la de Haya, una mujer que llegando al final de su vida, decide echar la vista atrás, y mirar el pasado, no desde la complacencia, sino metiendo las manos en el fango, en la mierda, removiendo lo que haya que remover, pues quizás esa y no otra es la manera de recuperar la dignidad, de asumir las contradicciones, de dejar de mirar para otra parte y asumir que ella, como casi todos los demás, sí sabía, y no hizo nada, mientras a su vez su hijo, un hijo robado, a la par, va recuperando su identidad, a medida que va conociendo quien es él, quienes sus padres, quien su madre.Cuando se organiza el traslado en trenes de quienes iban a ser exterminados en los campos de exterminio, la opinión de los que como Elvira Weiner lo veían desde fuera, en el territorio neutral suizo -neutralidad convertida en pasividad y en cooperación-, mientras los trenes abarrotados de gente aterrorizada, esperaban en las estaciones durante horas, antes de partir hacia una muerte segura, era esta:Sabíamos que esas personas iban a Alemania, sabíamos que entre ellos había judíos, sabíamos que existían los campos de concentración. Pensábamos que nosotros ya les habíamos ayudado y que si ellos continuaban ululando en la noche era su problema, es lo que pensábamos. Les habíamos dado mantas y café y sopa. Y si ellos continuaban rebelándose, no nos parecía correcto. Pensábamos: esta gente monta tanto alboroto que no nos dejan dormir. Eso es lo que nuestros vecinos escribían en los diarios.En estos tiempos tan líquidos y desmemoriados, esta monumental novela de Daša Drndić con una trabajada traducción de Simona Škrabec, muy bien editada por Automática Editorial (la bella portada es obra de Natalia Zaratiegui - http://nataliazaratiegui.com/portfoli...), es más necesaria que nunca, para que nadie olvide lo que sucedió en Europa hace apenas 70 años, ahora que las carreteras y los trenes de media Europa se pueblan de refugiados y los mares se llenan cada día de cadáveres de niños y adultos, y el horizonte se cubre de verjas, muros y concertinas, es momento de no olvidar que nuestra pasividad, nuestra inoperancia, el dejar abandonados a su suerte a miles de personas, es abocarlos a una muerte segura. Es momento de exigir a las instituciones que actúen, que no se inhiban, que se pongan el mono de trabajo y hagan de las leyes un instrumento útil, capaz de salvar vidas y no de quitarlas."}, {"userName": "Lisa Lieberman", "userReviewDate": "Feb 25, 2014", "userURL": "http://www.goodreads.com/user/show/4742884-lisa-lieberman", "userReview": "Assembly required.Daša Drndić says she spent two years researching this book. Much of that time seems to have been spent online, downloading documents from the United States Holocaust Memorial Museum's collection and other Holocaust related sites. Witness testimonies, lists of Jews deported from Italy or killed in the countries occupied by Italy (43 pages of names!), photocopied photographs inserted, W. G. Sebald-style, into the text, transcripts from the Nuremberg Trials, capsule bios of prominent Nazis.Collecting all this stuff took time, but the hard work of extracting meaning from it is left to the reader. Maybe Drndić was overwhelmed by the task she set for herself, but I'd have liked it if she'd spent another year at the very least reflecting on her material, distilling it (as Sebald does). I see this as the responsibility of an author who takes on a topic like the Shoah, to help readers navigate those dangerous shoals. The line between Holocaust literature and Holocaust porn is easily crossed.What's the difference? I'm going to let Imre Kertez, the author of Fatelessness (which I reviewed here a few weeks ago) answer that one: I am somebody who survived all of it, somebody who saw the Gorgon’s head and still retained enough strength to finish a work that reaches out to people in a language that is humane. The purpose of literature is for people to become educated, to be entertained, so we can’t ask them to deal with such gruesome visions. I created a work representing the Holocaust as such, but without this being an ugly literature of horrors.Perhaps I’m being impertinent, but I feel that my work has a rare quality—I tried to depict the human face of this history, I wanted to write a book that people would actually want to read."}, {"userName": "Roger Brunyate", "userReviewDate": "May 31, 2016", "userURL": "http://www.goodreads.com/user/show/42294189-roger-brunyate", "userReview": "Behind Every Name There is a StoryAbeasis ClementeAbeasis EsterAbeasis GiorgioAbeasis Rebecca[…]Zundler Henriette CeciliaZwirblawsky Enoc HerschZylber SzayaZynger Jerachmil.These are the first and last of a list of around 9,000 Jews from Italy or Italian-occupied countries killed between 1943 and 1945. Forty-four pages printed in four columns of small type, they stand like a granite wall separating the first half of this book from the second. Although visually the most unusual feature in this totally extraordinary Holocaust novel, it is not the only one: there are court transcripts, poems, entries from a biographical dictionary, fragments in many languages, and even grainy photographs in the manner of W. G. Sebald. And names, names, names.The protagonist, though based on fact, is fictional. Haya Tesdeschi, an old woman of 83, sits in her room in Gorizia, on the border between Italy, Austria, and Croatia, and waits to meet her son, stolen from her by the Germans as a baby, 62 years before, in 1944. But the photos in the basket at her feet go back even farther, to when her parents had not yet met and Gorizia was an international spa. As she does throughout the book, Drndic paints the picture in Homeric fashion, by conjuring up names:Ah, all the actresses, duchesses, dancers; all the poets, journalists, singers and marquises whom He gets to know and love long after his first forays to local brothels at sixteen (when He pawned His grandfather's watch); ah, Teodolinde and Clemenze, and Giselda Zucconi, and Olga Ossani; Maria Luisa Casati Stampa, amasser of exotic animals and bizarre furniture; oh, Ida Rubinstein, Isadora Duncan, the singer Olga Levi Brunner, and after her, the pianist Luisa Baccara, then the wealthy American painter Romaine Goddard Brooks, who later comes out as a lesbian; then, oh Lord, celebrated Eleanora Duse…It goes on, the list of names, famous and forgotten, beginning as an unstoppable lyrical stream, but changing eventually to a meticulous accounting of atrocity. Haya is born, grows up, meets a charming young German soldier nicknamed \"The Doll,\" bears his child. Meanwhile trains pass through Gorizia, trains whose schedules are notated in numbing detail. A nearby rice factory is converted as a detention center. The parade of names continues, but now they are the biographical entries of personnel from Sobibor or Treblinka, excerpts from their trials, and a note of what happened to them after the war (in most cases, nothing).Haya becomes a mathematics teacher, retires, and waits. She still amasses information, but the witnesses in the trials she now sees in her mind are mostly ghosts. The poets Elliot and Pound have more to say to her than the voices of living people. But her story is still about names. Somewhere in Germany, in the small town of Bad Arolsen to be precise, there are millions of them, archived documents that might reunite her with her son. And so the focus passes to the next generation, people who wake up one day to discover that they are the children of mass murderers.With the one exception of its central character, this is a book of facts. But facts marshaled with such variety of technique, such ingenuity, such anger, and such compassion that the book makes compelling reading from its beautiful start to an ending that, with so much purged away, has its own very different kind of beauty. A masterpiece."}, {"userName": "Lisa", "userReviewDate": "Mar 02, 2013", "userURL": "http://www.goodreads.com/user/show/1758411-lisa", "userReview": "Trieste, shortlisted for the 2013 Independent Foreign Fiction Prize is a shattering book, even if you’ve already read a few books about the Holocaust. That’s because it brings those events firmly into the present, not neatly tucked away in the category of events some would rather forget. Daša Drndić’s powerful story repudiates anyone who thinks it’s ‘time to move on, it was all so long ago’. The book, in revealing the existence of the Nazi’s Lebensborn Program tells us that there are men and women living today who, whether they know it or not, have identities that are false, and that the parents of some of these people are – after all this time – still searching for them.In the author’s note at the back of the book Drndić explains that her story is based on fact, and the construction of the book is testament to that. It includes family trees; archival records; newspaper clippings; photographs and testimony from various war crimes tribunals. In the middle of the book Drndić lists 35 pages of the names of the 9,000 Jews deported from Italy or killed in Italy between 1943 and 1945. I was shocked to find there the surnames of Italian families I know, and now I wonder whether their extended families were among the victims. There are also brief biographies of the SS – their backgrounds, their crimes, their court proceedings, and all too often, their contented post-war lives amid sympathisers and the world turning a blind eye. The book also includes snippets of music, and poetry and prose from writers as diverse as Ernest Hemingway, Jorges Luis Borges, Ezra Pound, T.S. Eliot and other authors and poets perhaps more familiar to European readers. It is not easy to read, not just because of the subject matter, not just because not everything is translated into English, but also because of the accumulation of detail and the way fragments leak into the narrative.It is the story of an old woman, Haya Tedeschi, whose infant, was stolen from his pram in late 1945. In July 2006 having spent a determined lifetime trying to find him, she waits to be reunited with this child.He was stolen during the period of Nazi control To read the rest of my review please visit http://anzlitlovers.com/2013/05/05/tr..."}, {"userName": "Tuck", "userReviewDate": "Feb 10, 2014", "userURL": "http://www.goodreads.com/user/show/565487-tuck", "userReview": "in this brilliant novel with its mix of archival and historical and the STORY of haya, a jewish woman in gorizia, just north of trieste, one sees techniques of bolanos 'nazi literature' Nazi Literature in the Americas, mixing historical fact with the historical novel but told from the present day (as sad and horrific as this novel is, there are some funny parts, the nazi blowup doll for soldiers to get their nut off, but not have to worry about going to town or getting a disease [never released to the soldiers though, nazis just used regular brothels, rubbers, doctors , hired women etc] and the jokes about pope ratz, being a rat and a nazi etc etc) where her stolen son (stolen by the lebersborn) whose dad was/is franz um, whatshisname, a death camp killer, tracks down his mom, after 62 years. so novel has entries of war criminals' histories, a list of 9000 names of jews killed or shipped off to be killed from italy, pictures, good advice from thomas bernhard, poetry from borges and pound, official correspondence from catholic church secret archives and international red cross tracking service, train schedules (you know which trains), and storyline of haya, old, alone with her nightmare memories where she both asks the question 'what affect was holocaust on people who 'weren't involved' and asserts that every single person has a story worth telling (but i guess only if we have somebody as bad ass at dasa drndic to tell it heh?) and the only way to understand wwii is to truly ask for the stories and have the courage to listen to the answers. this novel goes well with goldsteins croat 1941 history 1941: The Year That Keeps Returning and jan morris' trieste book Trieste and the Meaning of Nowhere and anything by niklas frank. an incredibly brave and non-mainstream novel one would expect from dalkey archive, not Houghton Mifflin Harcourt, but such it is."}, {"userName": "Elalma", "userReviewDate": "Jan 31, 2015", "userURL": "http://www.goodreads.com/user/show/9841456-elalma", "userReview": "Una delle critiche che i sopravvissuti hanno fatto alla letteratura della Shoah è quella di non rendere mai abbastanza l'orrore con le parole. Gli stessi testimoni, grandi scrittori, come Primo Levi o Boris Pahor si sono rammaricati, per la loro (presunta) incapacità di testimoniare e rendere l'indicibile a parole. Perché l'orrore più grande lo fa la Storia, quando ti sbatte in faccia le testimonianze nude e crude, senza filtri, senza emozioni, perché sono parole di uomini \"morti\" dentro, sia vittime che carnefici. Qui è riportato tutto il marciume, lo scandalo, l'abominio che risulta dalle testimonianze, dai documenti, dalle liste sotto il pretesto di un romanzo e fa male, molto. Sì, perché mentre scorre la storia di finzione, emerge una ricerca di materiale vero, le biografie di tutti i gerarchi che stettero a Trieste tra il 1943 e 1945, gli stessi boia di Treblinka, la storia della risiera di San Sabba, gli ignavi, i sadici, i bambini rapiti; tutto ciò diventa l'ossessione dei protagonisti e diventa anche quella del lettore. Mi sono chiesta anche io se tutto ciò non rasentasse quella che chiamano \"pornografia dell'olocausto\", come alcuni recensori hanno sottolineato, ma poi mi sono detta che il voltastomaco, il disagio era giusto che ci fossero, perché quando ci si volta dall'altra parte, quando si lascia scivolare la storia, quando ci si abitua, tutto diventa di nuovo possibile. Perché \"I bystander\", e cioè gli ubbidienti, i taciturni, coloro chesiamo innocenti perché non sapevamo, i neutrali, gli osservatori ciechi , gli adattati c'erano allora e ci saranno sempre. I bystander siamo noi. Ecco il perché, forse, di questi pugni nello stomaco: sono i sensi di colpa dei protagonisti. La scrittura è curata, profonda, sempre adatta al contesto: rapida e concisa nella finzione, fluente quasi ridondante nei pensieri, oppure ossessiva e claustrofobica nella descrizione degli orrori, ma sempre e comunque colpisce."}, {"userName": "Denni", "userReviewDate": "Mar 20, 2015", "userURL": "http://www.goodreads.com/user/show/10701591-denni", "userReview": "More affected by this book than virtually any other. It is an example of why literature matters. Its virtues include its unusual structure/form, the astonishing degree of research that went into it, and its beautiful and poetic language (where it is able to have such language), as well as the remarkable work of the translator. Both the author and translator should have won prizes. I learnt much that I didn't know about what was done in Europe in the 1930s and 1940s, and that, of course, is important, but the additional impact of this book is the way it turns the mirror back to reflect us, here and now, and to make us question our ability now to fail to know how our world works now. I struggled with it at first as it's slow to start and very dense, concentrated, but thank goodness I persisted. I'd found this book on the library shelves by chance when I was early for a work meeting. I read the extract on the back cover and this caught my attention because it's so beautifully written. I'm so glad I found it. I'm so glad there are still libraries. I will now buy my own copy because this is a special and important book, and I can't recommend it highly enough."}, {"userName": "Bob Mendelsohn", "userReviewDate": "Aug 11, 2013", "userURL": "http://www.goodreads.com/user/show/5992826-bob-mendelsohn", "userReview": "I was distracted by the author's use of present tense throughout the book. Never allowed things to be put in time separation. Also it read more like a history text book than a novel. I was very hopeful over and over, but constantly disappointed. Sorry, cannot recommend it at all."}, {"userName": "Carloesse", "userReviewDate": "Oct 18, 2017", "userURL": "http://www.goodreads.com/user/show/24654990-carloesse", "userReview": "Un romanzo-documentario: così il sottotitolo. L’argomento è sicuramente interessante (Olocausto, campi di sterminio nazisti, la risiera di San Saba, l’Adriatisches Kunstenland, il piano Lebensborn, le colpe dei padri, i sensi di colpa dei figli, colpe di chi agì e di chi semplicemente ignorò, chiudendo entrambi gli occhi, anche tra gli stessi ebrei che rimasero ai margini delle persecuzioni: la stessa Haya (per metà ebrea e amante di un feroce ufficiale nazista), la protagonista: cosa sarebbe stata la sua vita, cosa la sua coscienza se non le fosse stato rapito il figlio ?La parte più propriamente “romanzo” (buona e ben scritta) tuttavia rimane fioca, quasi un sottofondo, e avrebbe potuto svilupparsi ben più ampiamente. La parte documentaristica invece alla fine è un enorme dossier, non si capisce bene neanche quanto rigoroso (tutto da fonti accertate? Quanto ricostruito dall’autrice ?).Qualche merito il libro ce l’ha: tenere desta la memoria ed avvisarci che il male si annida sotto ogni bandiera: così nella Chiesa cattolica di Pio XII che si rifiuta di restituire alle loro famiglie ebree i bambini che aveva salvato (e ormai cattolicamente indottrinato: doni di Gesù che non si possono restituire così, sui due piedi); o tra i civili e democratici norvegesi nel trattare i figli del Lebensborn (tra essi anche una cantante degli Abba, fuggita per questo dalla Norvegia in Svezia: non lo sapevo!), comunque anch'essi certamente delle vittime, dei bambini innocenti, degli esseri umani, con la stessa inumana brutalità dei nazisti contro i quali volevano sfogare la propria rabbia,…Però confesso di avere proceduto a fatica tra tutto questo vasto materiale, e di essermi spesso sentito durante la lunga lettura un po’ come un piccolo canotto tra le onde."}, {"userName": "Jeanette", "userReviewDate": "Mar 22, 2014", "userURL": "http://www.goodreads.com/user/show/11869072-jeanette", "userReview": "This is a shattering read filled with circumvention. Everything is written inside/out and without much chronological order or steady language use that might be considered a \"normal\" progression. Every violation over decades is all present tense. And so you \"get\" the horrific angst of living without sanctuary or flitting/ blending/ hiding from/to/with the constantly shifting violence and death arising from 3 combatting governmental and politico identities. German, Italian, Slovenian? And the language itself changes too- with much use of Italian, instead of English.It probably is closer to a 5 star, but not for me. With the 100's of characters and the mass death and the constantly changing self-identity or loyalty mixes? Well, it was as dire as a Polish concentration camp diary times ten. And why, oh why, did these people go back to their town of Goizia at all after they had left it quite far behind the first time? If it IS called Goizia today and hasn't changed its name again.Absolutely the most depressing read of either 2013 or 2014 for me, and I have read some dire ones. I could only take about 30 pages at a time-just reading it made me too nervous. And I just skimmed the last 100 pages. How many ways can you express the chaos and misery within one place? This one would win any contest in that category, hands down.The 3 stars are given for the research and testimony. Not for any reading enjoyment. I don't recommend this book to anyone who isn't reading it toward a degree study or for some special purpose (like a book group). It entraps hopelessness and despair. Or perhaps you like to feel the suffering? Not I, and this is a prime reason why I normally do not gather with the group book readers, as this one was."}, {"userName": "kathleen", "userReviewDate": "Jun 07, 2012", "userURL": "http://www.goodreads.com/user/show/5006220-kathleen", "userReview": "An impressive work of \"documentary fiction,\" a term I hadn't heard before but which describes the genre of \"Trieste\" perfectly. I've read little of the reality of WWII in Italy, and in the region of Trieste, where it was particularly fraught. The only concentration camp in Italy exists outside of the city. It's multi-ethnicity made it of particular interest to the Nazis, who along with Jews targeted its Slavs and leftists. The story is based on historical events and records, and taking the documentary affect to the fullest, on a real family. Besides its story, its multiplicity of stories in fact, is Drndic's unusual style of telling. It is as if you are listening to a grandmother achingly and with extreme difficulty facing up to what she experienced through storytelling, punctuated with bursts of rage and weeping and references to deeply researched evidence just in case you might not believe her. After all, there is no logic to a story about how the Nazis and their collaborators behaved.Drndic explores the aftermath of the war, in the memories that linger unwanted but inescapably."}, {"userName": "Diana", "userReviewDate": "Feb 09, 2014", "userURL": "http://www.goodreads.com/user/show/7266867-diana", "userReview": "An impactful book, but not an easy read. Drndić's style is to veil the fictional narrative over actual historical facts: archival records; newspaper clippings; photographs, testimony from various war crimes tribunals, family trees. In the middle of the book Drndić lists 35 pages of the names of the 9,000 Jews deported from Italy or killed in Italy between 1943 and 1945. She also includes biographies of the SS – their backgrounds, their crimes, their court proceedings, and in too many cases, their contented post-war lives. Shocking.I did not know about the existence of the Nazi’s Lebensborn Program, and that there men and women living today whose identities are false and their real parents may still be searching for them."}, {"userName": "Anette", "userReviewDate": "Feb 03, 2012", "userURL": "http://www.goodreads.com/user/show/6834065-anette", "userReview": "http://www.thebookbag.co.uk/reviews/i..."}, {"userName": "Tittirossa", "userReviewDate": "Sep 18, 2017", "userURL": "http://www.goodreads.com/user/show/4445484-tittirossa", "userReview": "La lettura deriva da un misunderstanding legato al titolo. Pensavo parlasse di Trieste (certo se il titolo è “trieste” difficile pensare diversamente), e invece la città viene citata di striscio (per dire, metà del libro fa riferimento a Gorizia). Il titolo originale è Sonnenschein (sunshine, luce del sole), ma l’editore inglese ha reputato che non fosse molto appetibile per il suo pubblico (in effetti pure dopo averlo letto, non è che la luce del sole venga citata molto più di Trieste, magari il riferimento era alla mancanza, o alla necessità di portare alla luce tutte le verità nascoste) e quello italiano gli è andato dietro. Scelta sensata dal punto di vista del marketing (l’ho comperato), catastrofica dal punto di vista delle aspettative (l’avrei mollato a metà). Il sottotitolo è forse peggio del titolo: “romanzo – documentario” fa pensare a uno che non abbia voglia di mettersi lì a creare i personaggi (e infatti sono tutti odiosi) e al tempo stesso non abbia voglia di studiare abbastanza per un libro storico (documentario fa pensare all’attualità e quindi concede quel margine di approssimazione che nel libro è ampiamente superato). E’ evidente che vuole dimostrare qualcosa: che qualcuno è stato molto cattivo e qualcun altro si è girato dall’altra parte. Ma l’impianto è molto debole, una via di mezzo raffazzonata tra romanzo e documentario, di cui non si sa bene quanto fidarsi in quanto presenta un dodicimillesimo delle informazioni. Un’accozzaglia di dati, documenti, storie, che hanno come denominatore l’Adriatisches Kunstenland (che era la Zona d'operazioni del Litorale Adriatico durante la II Guerra Mondiale, sotto il controllo e dominio totale tedesco e dei loro accoliti di varie nazionalità) e il Lebensborn (Progetto Sorgente di Vita, uno dei programmi di Himmler per realizzare le sue farneticanti teorie eugenetiche) ma trattata senza alcun riguardo né per il romanzo né per il documentario. Non so se per incapacità o pigrizia. Ha avuto il pregio di farmi venire voglia di visitare Gorizia e Nova Goritsza e tornare a Trst, visitare la Risiera di San Saba e approfondire il vulnus di queste città di frontiera."}, {"userName": "Jennifer", "userReviewDate": "Oct 19, 2017", "userURL": "http://www.goodreads.com/user/show/12269115-jennifer", "userReview": "Im conflicted in rating this. It's like she wanted to write both non-fiction and put emotion into the text. And we dont actually get a resolution, just excerpts from _The Waste Lands_."}, {"userName": "Juan Jiménez García", "userReviewDate": "Dec 20, 2015", "userURL": "http://www.goodreads.com/user/show/22350751-juan-jim-nez-garc-a", "userReview": "Daša Drndić. El libro de los nombresLa literatura del Holocausto siempre ha sido una literatura interior, una literatura de supervivencia. Incluso es dudoso poder utilizar el término literatura para unos escritos que se agarran a la experiencia desesperadamente, a una experiencia tan terrible que rechaza envoltorios y se quiere despojada. Esto nos ha llevado a menudo a quedarnos en un solo punto, suspendido, terrible: la experiencia de los campos, la experiencia del dolor y la muerte. Y nos ha dejado huérfanos del antes y el después, más allá de unas coordenadas históricas y de unas secuelas que no tendrán final porque no pueden tener final. Cuando entrevistamos a Varujan Vosganian sobre El libro de los susurros, nos comentaba…Lo más difícil en el mundo es dar nombre a los sufrimientos. La diferencia entre Historia, literatura y cultura es que, en la Historia, el sufrimiento es abstracto. En los libros de Historia los muertos se escriben con muchos ceros. En literatura, el muerto no tiene ceros. Cada muerto tiene su cruz. Cada muerto tiene su nombre. Es muy difícil nombre dar nombre a los datos.Y ahora, al leer Trieste, de Daša Drndić, esas palabras han vuelto. Porque Trieste, después de todo, es el intento de dar nombre a las personas. A los que estuvieron pero no vieron nada, a los que murieron y a los que les asesinaron. Es intentar recomponer el tiempo que se rompió, la Historia que se quebró. Es juntar los fragmentos rotos, los brazos, piernas, cabezas, cuerpos descompuestos de tantas personas, para intentar devolver una imagen justa. Una imagen justa que es desoladora. Restaurar los colores de una imagen que busca ser olvidada, que fue olvidada.Haya Tedeschi es el primer nombre. El nombre del que deben de brotar todos los demás. La primera pieza alrededor de la que construir un puzle en el que faltan millones de piezas. Perdidas, enterradas. Haya Tedeschi ha vivido en Trieste. Primero el fascismo y luego, con este desbordado, el nazismo. Aunque judía, su familia abrazó la causa del fascismo, se hicieron carnets, miraron para otro lado y ella incluso se entregó voluntariamente a un alemán, con el que tuvo un hijo. El hijo desapareció. El alemán no era cualquier alemán. En los alrededores de Trieste estaba San Sabba. Una arrocera. Una arrocera que se utilizó como campo de exterminio. Pero nadie sabía nada. Algunos de los más terribles responsables de los campos de exterminio alemanes pasaron por allí. Pero nadie quiso saber nada. En su horno crematorio murieron cerca de cinco mil personas, pero nadie las conocía.Haya espera. Espera a su hijo. El desaparecido. Han pasado muchos años y recuerda. Recuerda la historia de su familia y su propia historia. Y a partir de ahí Daša Drndić estira y estira. Incansablemente va poniendo juntas palabras y fotografías. Nombres. El libro se parte en dos. En su centro, la lista de los nueve mil judíos asesinados en Italia. Citados uno a uno, como un corazón que hace latir lo anterior y lo posterior. Lo anterior, decía, es la historia de una familia italiana. Lo posterior es el infierno. Y quienes estaban allí para administrar ese infierno. Uno a uno Drndić hará inventario de verdugos y criminales y qué fue de ellos. Pieza a pieza recompondrá los programas de Himmler para una raza aria pura. Palabra a palabra reconstruirá el horror y página a página nos iremos hundiendo en el abismo aterrador.Trieste es el libro de los nombres, porque cada muerto debe tener su nombre y cada asesino debe ser nombrado. Pero también es el libro de los actos, en el que estos se suceden sin descanso, con una extraordinaria labor de escritura, hasta revelar algo así como una certeza. Una certeza nada amable con el ser humano. Una sensación de que nunca supimos nada porque nunca quisimos saber nada. Y que cuando supimos algo, solo quisimos olvidarlo. Y cuando no logramos olvidarlo, le damos otro sentido. Y entonces necesitamos la escritura. Escribir una y otra vez. Para no olvidar y para encontrar las palabras adecuadas. Para nombrar y hacer un pobre inventario. Para intentarlo. Para intentar creer.Escrito para Détour."}, {"userName": "Mandy", "userReviewDate": "Oct 08, 2016", "userURL": "http://www.goodreads.com/user/show/5859680-mandy", "userReview": "This documentary novel by Croatian writer Dasa Drndic is one of the most powerful and compelling books I have ever read, and deserves to become a classic of Nazi and Holocaust literature Centred around the family story of Haya Tedeschi, it tells of her relationship with an SS officer and the abduction of her baby when a few months old by the Lebesnborn programme. 62 years later the novel opens with Haya still waiting to be reunited with him after a lifetime spent searching, and reminiscing about her turbulent past as she does so.Within this narrative framework, the author has assembled an astonishing collage of eye-witness testimony, official documents, personal biographies, photographs, trial transcripts and even a complete list of the 9,000 Italians who were deported to the death camps. Much of the book covers familiar territory, as the era is well-documented in both fiction and non-fiction. But Drndic brings a new dimension to the events by setting her story in Italy and bringing to our attention some of the lesser-known aspects of the time , such as, for example, a description of the Risiera of San Sabba, the only concentration camp on Italian soil, today a little-known and little-visited memorial, and the fact that freight-trains carrying Italian Jews and anti-fascists were allowed to travel through neutral Switzerland.This book is an amazing achievement, meshing together both fiction and non-fiction with almost every page presenting the reader with a new fact, a new scenario, so that the sum total is almost overwhelming. So unremitting is the tension that I couldn’t put it down and read it almost in one sitting. Even if some of the material is familiar, our involvement in Haya’s personal story as an individual brings home to us once again the true horror of the Hitler era.The front cover calls the book “a monumental contribution to the literature of Europe’s modern history” and with that I most wholeheartedly concur."}, {"userName": "Ann Marie Olszewski", "userReviewDate": "Jul 23, 2015", "userURL": "http://www.goodreads.com/user/show/10770914-ann-marie-olszewski", "userReview": "An absolutely stunning and moving book, which forces you to confront the fact that the past is rarely past, but continues to haunt the present, often as a ravaged specter. There was a scrapbook-like quality to Haya's reminisces (she's actually taking mementoes out of a basket), but it was the last few chapters - told from the point of view of her son, kidnapped in infancy and raised by German parents - that truly resonated long after I closed the book. This is one of the somewhat forgotten aspects of the Nazi era - the children who were born and raised specifically to be the Aryans of the future, in a world where the Nazis expected to dominate. When that (thankfully) didn't happen, these children were a painful reminder of the past and an easy target for vilification. These children were unwilling collaborators - they had no choice in who their parents were, yet many of them assumed the guilt that the adults living through those years were hesitant to acknowledge themselves. In them, and in their own children, the past goes on and on. This book makes it painfully clear that for many, you never quite get over the horror of having a Nazi in the family tree.The melding of fiction and fact (certain characters were, or are, actual known figures) is seamless, and the language is gorgeous without ever becoming cloying or sentimental. For that, kudos to the translator, who did a tremendous job."}, {"userName": "Kristin Henning", "userReviewDate": "Apr 19, 2014", "userURL": "http://www.goodreads.com/user/show/13055188-kristin-henning", "userReview": "I can only compare reading this book to reading poetry or James Joyce, an accelerated telling of Nazi crimes through many voices and an abundance of episodes. One story tumbles into another, to be interrupted by another, held together by the central \"part Jewish\" family from Gorizia (north of Trieste on the Italy-Slovenia border). Haya Tedeschi's family stories float in and out, just as the town moves alternately into Italian, German, and Austrian territory over time. Author Daša Drndič manages to cram into this one book a mound of horrifying detailed accounts (from townsfolk to SS revelers, from death camp participants to Nuremberg trial witnesses). But the power is in the emotional backdrop she conveys so profoundly: a Jewish family on the move, a tormented mathematician embroiled in partisan politics, rampant maniacal hatred, dead-hearted evil, bewilderment at one's ability to look away and avoid questions or answers, outright anger at the Catholic Church, the evisceration of being denied one's religious and family identity, and the tortuous effects of rediscovering an awful, unwanted family history. \"I have arranged a multitude of lives,\" says the narrator, \"a pile of the past, into an inscrutable, incoherent series of occurrences.\" As powerful as it is to visit death camps or plow through Nazi museums and histories, this barely-fictional telling brings the fascist era to crackling reality."}, {"userName": "Jackie Molloy", "userReviewDate": "Apr 18, 2013", "userURL": "http://www.goodreads.com/user/show/7332619-jackie-molloy", "userReview": "Trieste is a City and seaport in north-eastern Italy it lies on a narrow strip of Italian territory which borders Slovenia and is very close to Croatia. Haya Tedeschi is an 82 year old woman who sits and waits for the son who was taken from her: on Monday, 30th April, 1945, Adolf and Eva kill themselves; Dachau is liberated by the Americans; and on Tuesday, 1 May the Yugoslav Army and the Slovenian 9th Corps march into Trieste. Who has the time to look for a stolen child? (page133)Drndic tells, in almost a non-fiction style, full of pictures and true testaments, the heartbreaking story of love, betrayal and loss. It is not an easy read, whatever you know about the second world war cannot prepare you this graphic depiction of this era in time. We are told of the Lebensborn, this is a project to preserve the racial purity of the a German nation, Heinrich Himmler deisgned the plan which took children and pregnant women into homes to breed a pure race, all these children being fathered by SS officers. Could this be the reason her son disappeared?This is an excellent translation by Ellen Elias- Bursac, I’m often put off when I see the word translation, they can often be a challenge if not done to a high standard, I would not of know Trieste was translated because of the skill of this translator.It is truly an international piece that should be read by all."}, {"userName": "D. Krauss", "userReviewDate": "Aug 10, 2014", "userURL": "http://www.goodreads.com/user/show/13829235-d-krauss", "userReview": "Devastating. That's my one word summary of this hard-to-read novel...oh, no, not because it's hard to read, but because of the story, which makes struggling through worth it.And what a story. In essence, it is an old woman waiting for her son to find her--which is devastating enough--but the reasons for it, the reasons. Wow.Ordinarily, any novel written with MFA-approved style gets my immediate and well-deserved thumbs down because it is technique at the expense of story. And this has all the MFA approved tropes: switching tenses, switching viewpoint, Proust-like sentences (ya know, there's a reason why there was only one Proust), some artful schematics and changes of indentation and fonts to indicate another genre such as poetry, even song...oh brother. You can just see the MFA faculty nodding in approval.But, unlike most MFA-generated novels, this is not technique in search of a story, but a story that lends itself well to device. Yes, I should pull out an eyeball for saying that, but it works. It just does. For example, one of the most powerful sections of the entire novel is a simple list: 9000 names of deported Jews.And, I tell ya, the last 68 pages just blew me away."}, {"userName": "Laurie", "userReviewDate": "Jun 22, 2014", "userURL": "http://www.goodreads.com/user/show/26553024-laurie", "userReview": "Compelling. Challenging. Captivating. Drndic's Trieste illuminates the effects of WWI and WWII on a Jewish family of Italian/Slovenia ancestry living in what is now Gorizia Italy, Trieste Italy and Nova Gorica Slovenia. This story is interspersed with transcripts of WWII war crimes trials and other non-fictional accounts including mini-biographies of several Nazi's with descriptions of the horror they perpetuated in the death camps; especially Treblinka and San Sabba."}, {"userName": "Zoe", "userReviewDate": "Jan 11, 2018", "userURL": "http://www.goodreads.com/user/show/54546643-zoe", "userReview": "At the centre of this sprawling novel, which covers almost a century in several different countries, is Haya Tedeschi, an Italian Jewish woman born in the 1920s who has been obsessively searching for the son who was snatched away from her in the street in 1944. We first encounter Haya in 2006, alone with her memories and family history and the enduring hope that her son will be found one day, and the narrative goes back into the past, jumping from one time to another to create a non-linear story that uses one family’s history to explore the brutal and tragic history of the twentieth century, with a particular focus on fascism and Nazism.The Tedeschi family come from an area of Central Europe which has existed as a fluid borderland, a frontier country, for centuries. Haya’s grandmother is a Slovene speaker, her mother and maternal aunts and uncles use mostly German in the refugee camps in which they end up spending the First World War, and her father comes from a middle-class Italian-speaking family in the Italian peninsula. In the early part of the book, which covers the 1910s to the 1930s, Drndić is mostly focused on borders and languages, and how the fascist movements of the 30s came to be in this region of ever-changing regimes and allegiances. Despite their multi-lingual, multi-national background and Jewish heritage, the Tedeschi family are remarkably detached from the political upheavals surrounding them, and we are mostly informed about these developments by the omniscient narrator.Once the Second World War arrives, the Tedeschi family stop bring able to ignore politics. Haya and her family flee from their home in Nazi territory and end up in Albania, where they cope with their situation in varied ways. Haya’s siblings are too young to understand the danger they are in, her mother thrives on denial, and Haya herself – a teenager by this time – embarks on her first romances. Despite the fact that the Tedeschi family could be targeted at any moment by the Nazi regime, they set up businesses, watch movies at the cinema, and try to remove themselves from the horrific events unfolding across Europe.Read the rest of my review on my blog"}, {"userName": "Alberto", "userReviewDate": "Mar 08, 2016", "userURL": "http://www.goodreads.com/user/show/45249777-alberto", "userReview": "http://albertogarciamiguel.com/2016/0...Trieste es una ciudad del norte de Italia, en el Adriático, a pocos kilómetros de la frontera con Eslovenia, cuando este país es apenas una franja que separa Italia de Croacia. Como ciudad fronteriza y en la convulsa historia desgajada de condados y señores de la guerra que es la historia de Italia y de la Europa del Imperio, Trieste tiene varios nombres: en esloveno, Trst, en friuliano y en alemán, Triest… Ha sido habitual moneda de cambio y ha formado sucesivamente parte de Italia o del Imperio Austro-húngaro. Su nombre, en castellano y en italiano, suena a melancolía, a lluvia, a frontera, a borde.Ese es el título con el que Dasa Drndic nos presenta una novela desgarradora, que se va haciendo más desgarradora a medida que avanza el relato. La primera parte cuenta la historia de una familia judía que vive a caballo de la frontera, que son eslovenos e italianos, que conocen el alemán y hablan italiano, una familia acomodada que sufre con los vaivenes de la primera guerra mundial y van creciendo, haciéndose mayores, teniendo hijos que sufren, que disfrutan, que se espabilan. Pero de repente, empiezan a verse privados de sus derechos por el simple hecho de ser judíos. Como muchos otros, deben hacerse el carnet del partido fascista de Mussolini para poder trabajar, para seguir dando clases o seguir en una empresa de representación de paraguas.Y la narración de la familia discurre hasta la hija, Ada Tedeschi, que tiene un hijo a raíz de su relación con un oficial alemán destinado en Trieste. Hasta aquí la historia no deja de ser hasta cierto punto, convencional. Pero a los seis meses de maternidad y cuando la guerra parece entrar en su resolución, con las derrotas de los países del Eje frente a los aliados, su hijo, Antonio Tedeschi, desaparece. Ada ve interrumpido su papel de madre. Ya nunca lo volverá a ser; nunca volverá a confiar en un hombre.En esta segunda parte, se empieza a indagar en el horror del holocausto, en lo que representa la memoria histórica y la importancia de mantenerla, de llamar a las cosas por su nombre. En Italia también hubo campos de concentración y muy cerca de Trieste se encontraba la arrocera de San Sabba, una fábrica convertida por los oficiales de las SS en un campo de exterminio. En el libro aparecen los nombres de los cerca de 9 000 judíos asesinados en Italia mismo o deportados a otros campos de exterminio. Es un listado de nombres, a tres columnas y con tipografía pequeña, que ocupan 70 páginas del libro. Desde el punto de vista editorial o comercial, esto representa una pequeña agresión al lector, un texto intrascendente, vacuo. Desde el punto de vista humano, representa un imperativo moral, una necesidad de homenaje a esos muertos que sufrieron el holocausto nazi.Viviendo en un país donde constantemente se tergiversa y se pisotea la memoria histórica y se banalizan los 40 años de dictadura atroz que vivió este país, resulta enormemente gratificante la valentía de acometer un proyecto de este tipo. La valentía de la autora, por supuesto, pero también la valentía de una editorial independiente -Automática Editorial-, de poner en circulación un libro que debería de ser obligatorio en los institutos. Porque, ¿conocen nuestros jóvenes lo que representó el holocausto? ¿Se pueden llegar a asumir las dimensiones de aquel crimen? Libros como este ayudan a ello, aunque uno no deje de mostrar estupor al recorrer sus páginas.El libro además ejerce ese papel recordatorio tan necesario, poniendo nombre y apellidos a algunos de los cómplices necesarios. El padre de Arnold Schwarzenegger fue un soldado raso del Tercer Reich, con lo que le quitaba importancia a su participación en el holocausto. Después de Vietnam, después de Irak, todos sabemos lo que un soldado raso puede hacer en una guerra como aquella. El padre de Madeleine Albright, la antigua secretaria de estado de USA, participó de manera activa en la guerra, aunque no encontrarán rastro de ello en Wikipedia. La connivencia del estado “neutral” suizo, tanto en la acumulación de los réditos de la guerra, del expolio de las gafas, de los dientes de oro, de las pertenencias de los individuos eliminados, como en la permisividad con los propios transportes: muchos de los deportados desde Italia pasaron por Suiza, utilizaron su red de transportes, fueron custodiados y protegidos por el gobierno. O la Cruz Roja, y su firme voluntad, ejercida desde sus inicios, de no participar. Pero ¿es posible declararse neutral si no lo intentas evitar? ¿No es esa permisividad una manera de convertirse en cómplice?En este apartado, el libro recuerda a otros libros testimonio, como los del nobel Aleksander Solzhenitsyn sobre los gulag y las deportaciones soviéticas y, en algunos puntos, aunque sin el vitriolismo irónico de este, a La literatura nazi en América, de Roberto Bolaño, un listado de nombres con una somera biografía. En este caso, los nombres son reales, responden a su participación en los hechos y uno, como lector, no puede dejar de sentirse abrumado por las cifras. Personas responsables, directa o indirectamente, de la muerte de medio millón de seres humanos. Personas capaces de reventar sistemáticamente la cabeza de niños que llegaban a los campos junto a sus padres. Personas que se dedicaban a cabalgar con su caballo blanco a diario y disfrutaban disparando a otras personas por el simple placer de la caza, del deporte, porque podían. Todo un sistema complejo, estudiado, de transportes, unos esfuerzos dedicados exclusivamente al exterminio. ¿Cómo pudo suceder? ¿Cómo se sostiene todavía aquello de “No sabíamos nada”?El papel de la iglesia también es clarificado a lo largo de las páginas del libro. Primero, en el desenmascaramiento: Ratzinger es denominado con el sobrenombre de “Rottweiler”, que se le puso durante la guerra, cosa que elimina cualquier atisbo de inocencia. Pero no solo eso; la iglesia como institución participó activamente en el robo de niños como el de la historia que nos ocupa, Antonio Tedeschi, o Hans Traube, como él creía que se llamaba. La Iglesia Católica, la institución así denominada, ayudó al régimen nazi bautizando a los niños robados y convirtiéndolos en católicos. Una vez acabada la guerra, el propio Juan XXIII, conocido como el “Papa bueno”, instaba a las diferentes parroquias y diócesis a no hacer públicos los documentos en los que se registraban los bautizos, a no ayudar en las investigaciones para devolver a estos niños, en la medida de lo posible, a sus familias. Y ese secretismo, esa voluntad de no ceder, no es una cuestión del pasado. Entronca con la memoria histórica puesto que esa decisión llega hasta nuestros días. Los que han conocido su verdadera historia no lo han hecho gracias a la difusión de los documentos eclesiásticos que, Papa tras Papa, siguen empecinados en mantener una institución que larva el mal en su seno, a través del goteo de casos y más casos de pederastia, y por su complicidad con las más sanguinarias dictaduras, desde África, a Latinoamérica y Europa."}, {"userName": "Krocht Ehlundovič", "userReviewDate": "Mar 26, 2017", "userURL": "http://www.goodreads.com/user/show/54757979-krocht-ehlundovi", "userReview": "Silná ako káva. Bezprostredná ako Taliani a Talianky. Skutočná ako každý deň. Asi som ešte nemal tú česť čítať dokumentárny román, ktorým táto kniha je a je to \"film\", na ktorý som pozeral červenými mokrými očami - pretože som dávno nemal v ruke tému: 2. svetová vojna a židovská problematika; z prvého radu. Už len natiahnúť ruku a chytiť sa toho. Dáša Drndić šikovným a skutočným spôsobom približuje tému holokaustu skrz život talianskej Židovky, ktorá bola z rodiny talianských fašistov a mala dieťa s nemeckým esesmanom - strašným vrahom (spočiatku má človek dojem, aký milý pán...); a to nie je všetko, ani z ďaleka. Čítal som knihy Prima Leviho, či pani Hraboveckej, avšak táto je iná, nie napísaná obeťou a to jej dáva iný rozmer. Plus, Dáša dokonalo pozná dokumenty a pozadie tohto kľukatého príbehu - v ohromnej šírke a hĺbke (dotýka sa niekoľkých generácii, rodín, časov a vrstiev), čo robí knihu výnimočnou a smutne krásnou. Tým chcem skočiť aj k štýlu knihy, ktorý nechce pustiť čitateľa, ani za cenu otriasania duše, ľudskosti, priamych scén, tragédii a akejsi nezainteresovanosti (?). Všetko začína okolo Prvej svetovej vojny a normánej židovskej rodiny/rodín. Prechádza cez talianský fašizmus a jej problémy. Potom vstupuje na mínové pole rasovej otázky, kľukatenie sa cez osudy, Druhú svetovú vojnu, smrad koncetračných táborov (San Sabba a Treblinka) - ich absurdný a surreálny svet, Hayin osud - šťastie?, k problému detí (pokrstené židovské, unesené, árijské čistokrvné produkované operáciou: \"Lebensborn\", ich osudy, ich utrpenia) a hľadania minulosti (deti nacistických vrahov) k dverám Hayi - hlavnej hrdinky. Dej je prešpikovaný reálnymi i vymyslenými dialógmi, spoveďami, dokumentami a fotografiami - to všetko na pevných nohách faktov a skutočností. Kniha zanecháva silnú stopu, ktorá rezonuje v človeku - a bude tam hrať stále. Bola neuveriteľným (doslova) zážitkom, či umelecky, či obsahovo. Nezabudnem."}, {"userName": "Kate Lee", "userReviewDate": "Dec 20, 2016", "userURL": "http://www.goodreads.com/user/show/27992587-kate-lee", "userReview": "I am a huge WWII geek. As in I will read practically anything under the sun if it has to do with WWII. I've read a lot of war novels before, but this one blew everything else out of the water. It is truly a war novel like no other.The Ups: Remember how I said Homegoing was the most ambitious novel I'd read this year? I lied...it's definitely Trieste. This book borders on the line between non-fiction and fiction so often that I can't even tell which parts are fiction or non-fiction. There are SO many facts imbedded into the text, which is why a lot of readers grew tired of the book after a while. It was overwhelming, but I decided to stick with it, especially because the facts were essential in creating a large picture of how terrible and huge the impacts of Nazi Germany were and are on the world. The general theme of the story, and a quote that is repeated multiple times, is \"Behind every name, there is a story.\" In fact in the middle of the novel there is a list of 9,000 Jews who were deported from or killed in Italy between 1943-1945. There is also a section describing the lives of many German officers and their terrible actions, and what little/no punishment they received. The horror and injustice and anger is enough to make your head spin, but that is what is necessary. Haya is referred to as a \"bystander\" of sorts, a citizen who turned her face away from all the terrible things happening to her friends around her. She, like so many others, is silent and doesn't speak up against the Nazi regime. Later, however, through her search for her missing son, it is shown that she is a victim as well; her son was stolen from her by the Catholic church to be used to purify the German race.This is a story that is trying to bring truth to a historical event some people are trying to forget. It shows the collaboration of the Church and the government in prosecuting the Jewish, it shows the corruption and secrecy that stills goes on TO THIS DAY regarding documents, it shows, most importantly, how everyone is a victim when we forget, when we say: \"It was too terrible, I don't want to hear about it.\"It was certainly not an easy book to get through. It wasn't graphic or extremely disturbing, but it was just so packed with facts and truth that it was unsettling in that respect. The Downs: I do think it is not an easily approachable novel form. I found myself wishing the plot would speed up, or being confused because I was skipping between German facts and Haya's story. I wish it was a little more approachable so its impact could reach more readers...but maybe without all its element it would not have been so powerful."}], "description": "Haya Tedeschi sits alone in Gorizia, north-eastern Italy, surrounded by a basket of photographs and newspaper clippings. Now an old woman, she waits to be reunited after sixty-two years with her son, fathered by an S.S. officer and stolen from her by the German authorities during the War as part of Himmler's clandestine 'Lebensborn' project, which strove for a 'racially pure' Germany. Haya's reflection on her Catholicized Jewish family's experiences deals unsparingly with the massacre of Italian Jews in the concentration camps of Trieste. Her obsessive search for her son leads her to photographs, maps and fragments of verse, to testimonies from the Nuremberg trials and interviews with second-generation Jews, as well as witness accounts of atrocities that took place on her doorstep. A broad collage of material is assembled, and the lesser-known horror of Nazi occupation in northern Italy is gradually unveiled. Written in immensely powerful language, and employing a range of astonishing conceptual devices, Trieste is a novel like no other. Dasa Drndic has produced a shattering contribution to the literature of our twentieth-century history.", "title": "Trieste", "url": "https://www.goodreads.com/book/show/11812200-trieste", "average": 3.94, "cover": "https://images.gr-assets.com/books/1350622271l/11812200.jpg", "reviews": 96, "authors": [{"url": "https://www.goodreads.com/author/show/3383734.Da_a_Drndi_", "name": "Daša Drndić"}], "type": ["Fiction", "Historical", "World War II", "War", "Cultural"], "outlinks": ["http://www.goodreads.com/book/show/11812200-trieste", "http://www.goodreads.com/book/show/17165900-trieste", "http://www.goodreads.com/book/show/27768645-trieste", "http://www.goodreads.com/book/show/24708479-trieste", "http://www.goodreads.com/book/show/34684868-sonnenschein", "http://www.goodreads.com/book/show/13089384-leica-format", "http://www.goodreads.com/book/show/16141032-belladonna", "http://www.goodreads.com/book/show/8590827-april-u-berlinu", "http://www.goodreads.com/book/show/33401357-eeg", "http://www.goodreads.com/book/show/15611376-canzone-di-guerra-nove-davorije"]}