{"ratings": 1220, "userreviews": [{"userName": "Sarah (Presto agitato)", "userReviewDate": "May 03, 2015", "userURL": "http://www.goodreads.com/user/show/1257768-sarah-presto-agitato", "userReview": "There have been an awful lot of books, movies, and TV shows about the Tudors. Their cultural impression is larger than life. Events of historic importance certainly occurred during their reigns, probably most significantly the Protestant Reformation, but it is their colorful antics that make them memorable. Even the Plantagenets who preceded them, ruling for 331 years in contrast to a mere 118 for the Tudors, are much less prominent in public consciousness. Somehow the many wild tales of treachery and betrayal that the Plantagenets gave us pale in comparison to the doings of serial groom Henry VIII. And really, it is Henry VIII who most represents the Tudor dynasty. There were four (and a half?) other Tudor monarchs, but Henry, and to a lesser extent Elizabeth, gets most of the press. (The recent Showtime television series The Tudors lasted four seasons but, despite the plural implied in its name, covered just one Tudor - Henry).There isn’t much that is new here about Henry and Elizabeth, but where Leanda de Lisle’s contribution to popular Tudor histories stands out is in her treatment of the other lesser known Tudors. The story begins earlier, with events that often get just a cursory mention in Tudor books. Here we have a discussion of Henry VII’s origins, the Wars of the Roses, and the fall of Richard III. De Lisle also addresses the influence of Henry VIII’s grandmother, Margaret Beaufort, and his sisters, whose marriages had important repercussions seen much later in English history. By including these events in detail, there is a historical context for the actions of the Henrys, making some of their decisions more understandable, even if not admirable.De Lisle also includes an analysis of the “usurpation” of Lady Jane Grey. The “Nine Day Queen” is often little more than a footnote in Tudor histories, but Jane and her sisters are an area of interest for the author, who wrote another book about them. Here she justifies their inclusion by showing how the shakiness of the succession after Edward’s death may have contributed to some of Mary’s, and later Elizabeth’s, paranoia. It seems that none of the Tudors could ever completely avoid anxiety about being ousted.Leanda de Lisle’s Tudor history is a readable one. She avoids getting bogged down in some of the details of dress, food, and other customs. (For that type of information, Alison Weir is much more complete). Instead, the focus here is on the overarching picture and historical context."}, {"userName": "Nicole~", "userReviewDate": "Jul 06, 2013", "userURL": "http://www.goodreads.com/user/show/20071931-nicole", "userReview": "'Tudor: The Family Story' begins at the funeral procession of Catherine of Valois in 1437 in order to relate the origins of the Tudor name. Catherine and Owen Tudor's relationship is depicted as truly romantic. I had quite a chuckle or two as Ms. de Lisle showed she has a slightly ribald sense of humor : \"There was music playing, and her servants were dancing. While Catherine watched, Owen performed a leap which span out of control, and he fell straight into her lap. As an Elizabethan poet asked, 'Who would not judge it fortune's greatest grace, Since he must fall, to fall in such a place?' \" ( 9 )Ms. de Lisle explains that \"'The story of how Henry Tudor [(i.e.Henry VII)] survived against the odds, and won his throne and his bride against even greater odds, is one of the world's great adventure stories.' It sounded irresistible and indeed how could one understand the king if you only began his life in 1485?\" (423)The author approached this family biography that spanned five generations like a top-notch forensic investigator; sifting through layers of archived evidence; exhaustively gathering information; looking at different angles to uncover hidden reasons and perhaps suggest alternate motives - with an acceptable level of plausibility - for the actions of this fascinating royal family. Ms. de Lisle took great care \"to examine more closely not how we see the Tudors from our end of the telescope, but how they saw themselves.\" (424)I was happy to read more about Margaret Tudor, Queen of Scots, Henry VIII's older sister, whose husband, James IV, was killed at the battle of Flodden against England while Queen Katherine was regent. It seemed so strange and heartless that Henry VIII would take pleasure in the win, and show little remorse at leaving his pregnant sister a widow, his nephews fatherless, and the three vulnerable in Scotland.I appreciated that Ms. de Lisle stuck to referring to family members and close surrounding characters by their given names, and did not get heavy handed with lining up their titles like cars in a traffic jam (because as we know titles changed hands as quickly as heads rolled). This is one thing I most dislike - that some medieval historians would plaster titles all over the pages; it isn't impressive at all but is rather ridiculously frustrating. Thankfully, 'Tudor' is not an example of such confusion; it is uncomplicated reading, flowed easily and made sense.'Tudor' is a work of obvious dedication and passion from an author who has brought to fruition a well balanced biography of a dynasty. It is well written, remarkably researched and rationally thought-out. For medieval history fans, this is not only a pleasurable read on a familiar subject; it also provides new insights and a fresh outlook on a fascinating royal family."}, {"userName": "happy", "userReviewDate": "Jul 31, 2013", "userURL": "http://www.goodreads.com/user/show/9369133-happy", "userReview": "[ Which he did by enobling Owen and his sons with Katherine  (hide spoiler)]"}, {"userName": "Chris", "userReviewDate": "Jun 18, 2013", "userURL": "http://www.goodreads.com/user/show/1605591-chris", "userReview": "Disclaimer: Arc read via Netgalley. Thank you Netgalley, Perseus Books, and Public Affairs Books.I can hear you asking the question – do we really need another book about the Tudors? Really. Well, I don’t know about need, but I can say this is a very excellent look at the Tudor family. If you were going to buy one book about the Tudor dynasty, this should be it. It’s not that I didn’t like Meyer’s book about the family, but de Lisle is just better.\tIn part, this is because she actually focuses on the family instead of the big two – Henry VIII and Elizabeth I, who seem to have been the focus since the BBC programs. While much of the book does deal with them, de Lisle makes sure that the rest of the family gets their time in the spot light.\tShe does from the start of the book. She actually truly looks at the marriage of Katherine de Valois and Owen Tudor. The relationship between not only gets the treatment as in looking at the start of the War of the Roses, but actually looks why Katherine would’ve married him, as well relating some interesting gossip about intimate matters. De Lisle conveys to the reader a sense of who these two often passed over dynasty founders. In particular, she looks at the development of Margaret Beaufort and the impact that she might have had on her son Henry VII, who gets far more attention paid to him here than in most other general histories.\tAnd that really is the selling point of this book - the look at the players who are eclipsed by the wives and rivals queens. When I read this, I came away with a far greater understanding of Henry VII instead just simply seeing him as a stringy bastard as he is so often simply drawn. The lives of Edward VI and Mary I are seen in greater detail here as well as their impact in terms of the monarchy. In fact, de Lisle considers the impact of Mary’s rule on how Elizabeth determined to govern and even to act the part of ruler, in more than terms of just religion. She also raises the question of how Elizabeth’s reign would have been seen if she had died early on, when she was sick with smallpox.\tThis isn’t to suggest that de Lisle focus just on the political. Her description of battle, in particular of Bosworth, is quite frankly very gripping. It is this style, part academic and part almost novelistic in approach that make the book accessible to both long time Tudor fans as well as those who are picking this up due to simply the Showtime series. She does not relate gossip, for the most part, and she does take a closer look at oft held myths or commonly repeated stories. Her take on the Princes in the Tower is plausible and her analysis of Richard III’s rule fair. This is not a blow by blow of the Essex rebellion, but a study in how a family gains, holds, and eventually loses power all the while struggling in the political arena. It is not the soap opera of naked flesh that the Showtime series presented. Warts and all, careful study and understanding. A close look at figures and issues that get swept aside in the tart’s version of the wives. It isn’t a romantic view, and for that it is far more engrossing. \tThe appendices are worth reading because De Lisle looks and debunks certain myths. While the book does tread on some of the area of her previous work, it does not seem as if she is simply repeating the last book. The Grey sisters are dealt with, as they must be, but while doing them the justice they deserve in a study, de Lisle does not let them and her knowledge of them overwhelm the work.\tTruly a wonderful study of the Tudors."}, {"userName": "Orsolya", "userReviewDate": "Jun 23, 2013", "userURL": "http://www.goodreads.com/user/show/5647191-orsolya", "userReview": "For us Tudorphiles, there really isn’t anything we don’t already know about one of history’s most dramatic families. So what’s the point of reading another book on the Tudor dynasty? Perhaps this can be answered by Leanda de Lisle in “Tudor: The Family Story”.Lisle’s version of events in “Tudor” stands out instantly, as the tone presented to the reader is not simply that of a recollection of Tudor monarchy life; but the basics and underlying psychosis of the family. Lisle begins the history backtracking to Owen Tudor and his “fall” into royalty. Although nothing new is learned by the expert reader; the family history will be understood in a new light. Lisle reveals the Tudors in a smooth way in which their emotions and actions throughout the decades make clear sense. Thus, although the story isn’t new, the fresh perception is. Lisle’s text is heavily researched and accurate, skipping the biases and speculation which are abundant even in the works of renowned historians. The pace is exciting and has a steady ratio of almost-fictional narrative to that of an academic piece. However, at times Lisle goes off on the flowery descriptions and either grazes or rushes too quickly on the historical events (I suspect that she could produce a solid HF novel).A notable characteristic of “Tudor” is the breath of life Lisle gives to some figures who are often ignored such as Mary and Margaret Tudor (the sisters of Henry VIII) and Margaret Douglas. Plus, the chronology is solid and all major points are highlighted without jumping back-and-forth which could confuse new readers. Lisle seamlessly interweaves the text with descriptions of ‘everyday’ life/culture which instead of feeling like tangents; clearly sets the stage for Tudor lie and again: makes everything clear and understandable. “Tudor” is also filled with anticipation, with even the seasoned Tudorphile wanting to know what happens (even though he or she already knows). On the negative end, Lisle has the habit of mentioning a thought or idea which is contrary to popular belief but doesn’t elaborate or offer clear sources. I would welcome new angles but need details. Also slightly annoying is Lisle maintaining the trend of quoting Shakespeare within her historic text. Shakespeare was NOT a historian and his plays were just that: plays. Not sure why so many authors insist on this. The second half of “Tudor” has more of a detective focus with Lisle debunking some much-talked about Tudor myths. The only issue with this is a lack of description/argument and notes with holes in the connection (I had many, “You got this from that?!” moments). Despite this, Lisle also displayed the strength of not following stereotypes in “Tudor”: Mary isn’t vilified, Elizabeth isn’t glorified, etc. Instead, Lisle simply sees the strengths and weaknesses of each figurehead.The conclusion of “Tudor” is exceptionally strong, wrapping up Elizabeth’s reign (but again, not overly romanticizing her); flowing into a memorable, well-rounded Epilogue in which Lisle truly brings home the Tudor message in a way not many history books have. Lisle doesn’t just stop there, as she briefly discusses some Tudor myths in the Appendices. For those readers who enjoy notes, Lisle offers pages worth while also serving up color plates and genealogical trees. Even though one may not experience new information on the pages of “Tudor”, the presentation is entirely new. Versus a straightforward look at Tudor history, Lisle opens up the personal view of the Tudors and how THEY viewed themselves which explains their actions better then a simple look at their political actions. Lisle successfully treads a middle ground where readers both new and old to the topic will find enjoyment. “Tudor” is well-written and extremely readable with Lisle showing a marked improvement in her writing (it is obvious that she has more great things in store). Although not perfect, “Tudor” is very much recommended for anyone and everyone interested in the topic. Note: My rating is more of a 4.5 but rounded to 4 versus 5"}, {"userName": "Rio (Lynne)", "userReviewDate": "Nov 02, 2013", "userURL": "http://www.goodreads.com/user/show/3803025-rio-lynne", "userReview": "Why read another a Tudor book? De Lisle takes on the family history from Owen Tudor to James I. This isn't another Henry and his wives book. De Lisle's NF books are not text bookish. They are easy to read and before you know it hours have gone by, she brought many new things to my attention (proof Margaret Beaufort wasn't the evil step mother, Henry VIII wanted 16 executors in charge of Edward, was Mary Queen of Scots raped?) I consider myself very informed on the Tudors and I thoroughly enjoyed this book. Great read!"}, {"userName": "Marita", "userReviewDate": "Jun 22, 2013", "userURL": "http://www.goodreads.com/user/show/17415449-marita", "userReview": "As other reviewers have pointed out, this is not merely another Henry VIII and his six wives book. It is a comprehensive, erudite and eloquent account of Tudor History from Owen Tudor to the death of Elizabeth I and the proclamation that named James VI of Scotland King of England (James I).In addition to the Tudor story that many know, there is a multitude of interesting details. The author also dispels several popular myths. She provides family trees, a map, several notes and appendices.It took me a bit of time to get going as I was reading other books as well, but then I found that I couldn't put the book down. I found myself highlighting many interesting passages in my Kindle copy of this book.Recommended to all those interested in Tudor history."}, {"userName": "Marilyn", "userReviewDate": "Jun 29, 2013", "userURL": "http://www.goodreads.com/user/show/6141957-marilyn", "userReview": "In all actuality, I wish that we had the option to give half stars, because after further reflection, I would give this book 3 1/2 stars. I have read nonfiction books written on the Tudor family in the past, so I pretty much am familiar with how things went from Henry VII, on down. It was a such a treat however, to learn about obscure family members, such as Owen and Jasper Tudor.I find myself, as a Lutheran at a loss of what to say, concerning the sacking of Rome, etc. These are things that I was not made aware of in the past, just as many people might perhaps be unaware of negativity within their religion. It never ceases to astound me, what has been, and continues this day to be done in the name of religion. * Addendum- November 1, 2013, I found my catechism books stored upstairs, tryng to understand what would have driven Martin Luther, and Lutherans to such violence. Also called the church, and the Pastor, but alas it is Friday. I have refreshed my memory with what our study books had to say about that time frame. It seems to me that it was filled with religion against one another, which as I stated continues to this day. I plan to educate myself further, as far as the reformation goes. I have considered this for quite sometime, and I imagine that after continuing to read on this matter, that I may not have any clearer a picture than I currently have of this time in history.I have previously read two books which broaden the picture of Edward VI and Lady Jane Grey, The first book was written on King Edward VI, by historian Chris Skidmore. The second book, on Lady Jane Grey was written by Eric Ives. I suggest to anyone with a passion for learning more about this tumultuous time frame, to add those books to your reading list. I learned so much about Edward VI, and Lady Jane Grey from reading those books. It seems to me, that we do get an idea of what these fascinating monarchs were like, when adding biographies, if you will to the books written on the family as a whole. Having said that, this book stands well enough on it's own for those of us fascinated with the Tudor dynasty.I bought the book Tudor, because I had the interest in reading the Tudor story, from the point of view of yet another brilliant historian. Since I have read, and have books yet to read on Elizabeth I, I will eventually buy a book written specifically written about Mary Tudor. I have to say, that in reading this book, I experienced many emotions. Having said that, I have reminded myself that there are things about the founder of my religion, which in all honesty I was unaware of, and upset me to see included in this book. I suppose since I have read about, and watched documents on key historical figures such as Rodrigo Borgia, I would not read of such horrors concerning Martin Luther, but then I was not aware of any reign if terror accociated with him. I do have a theologian recommended to me, who is well versed in this period of time, whom I look forward to lenghty discussions with.It turns out, they all have blood on their hands, which in the eyes of God is wrong. Just as comparing Mary Tudor's bloody reign, to Elizabeth I's , both had people murdered, just as their father, Henry VIII did. The numbers do count, of course. But, it still does not excuse the act, or lessen the fact that all of the Tudors had blood on their hands. Henry VIII had the blood of two wives, and countless more on his hands. Elizabeth I, has the blood of her cousin Mary, Queen of Scots on her hands, just as she had the blood of an astounding number of Catholics on her hands. Mary Tudor had the blood of her 16 year old cousin, Queen Jane Grey on her hands, as well as the blood of numerous Protestants on her hands. I feel that the title Queen does belong to Jane Grey, despite her brief reign. And, Edward VI, has the blood of both his Seymore uncles, on his hands. Unfortunately, Edward VI sealed Jane Grey's fate, in naming her as successor to the throne. Edward had very valid reasons for not naming either of his half sisters to succeed him. I believe that the records prove why he chose not to name Mary, in particular. I firmly believe that Mary witnessing how her father treated her mother, left her bitter and in my opinion she took her anger out on the wrong people. As for Elizabeth, she quietly watched and learned what it took to keep her head on her shoulders. Yes, these were turbulent times, but it seems to me that incarceration in the Tower should have been sufficient, particularly for family members. But then, perhaps I will never understand how someone could be so ruthless. It is interesting to me that the Plantagenets were described as \"the Devils brood,\" when in my opinion, the Tudors were just as ruthless. I think that it is wrong to excuse the brutal deeds of one monarch, and point the finger at another. I doubt I will ever be sympathatic to Mary Tudor, and that has everything to do with Jane Grey. On the other hand, I also changed how I felt about Elizabeth I, after reading John Guy's book Mary Queen of Scots. These are my opinions, I do not expect, nor would I want everyone to agree with me. I would hope that this review, despite repetition, in places will spark your interest to buy a copy of this book, and learn yet a bit more concerning the Tudor dynasty. Just one more thing, if you have a vivid imagination, as I do, the gallow descriptions are true to history, and are not for the faint of heart. I always get queasy with these."}, {"userName": "hpboy13", "userReviewDate": "Jun 28, 2013", "userURL": "http://www.goodreads.com/user/show/6427364-hpboy13", "userReview": "Leanda de Lisle has a gift for writing historical books. When the history is as compelling as that of the Tudors, no embellishment is needed, and de Lisle tells the story masterfully. This book is impeccably researched, and de Lisle backs up everything she says with primary sources, which she then uses to debunk a lot of popular myths and misconceptions that have sprung up around the Tudors.The great thing about this book is its broad scope, and de Lisle manages to weave a coherent story of five generations here, spanning two centuries of English history. Context is everything, and the whole family saga makes a lot more sense in the way de Lisle has presented it. Sure, we’ve heard this all before – Henry VIII’s wives, and his kids messing with each other – but as part of the larger story it becomes fascinating all over again. She also makes it accessible, with gentle reminders of who is who when needed, but trusting that the reader will keep up.If I had to nitpick, I would say de Lisle skips over much of Margaret Tudor’s fascinating later history navigating Scottish politics, and that she should have addressed Margaret Pole’s claim to the throne at some point (because scarcely a chapter goes by without mention of a rival heir descended from George, Duke of Clarence). But Tudor is already an impressive tome, so it seems churlish to complain about even more stuff that should have been included.Anyone who’s a fan of the time period and wants a clear picture of the history, or who just wants to know the facts behind Philippa Gregory’s fiction, would do well to pick up this book. I eagerly await de Lisle’s next offering!"}, {"userName": "Jo Barton", "userReviewDate": "Oct 15, 2013", "userURL": "http://www.goodreads.com/user/show/2090731-jo-barton", "userReview": "I love all things Tudor and despite having many historical factual books about the Tudors already sitting on my bookshelf, there is always room for one more.Leanda De Lisle has created a very readable account of this fascinating family and provides the facts in an easy to understand, and very enjoyable manner. The founding of this tumultuous dynasty was fraught with danger and political upheaval, all of which is expertly explored in well divided sections. The story starts in 1437, with the contentious marriage between Owen Tudor and Katherine de Valois, the widow of Henry V, and continues in easily divided sections through the subsequent Tudor reigns of Henry VII, Henry VIII, Edward VI, Mary I, and Elizabeth I. The book also explores the relationships these monarchs had with their Plantagenet and Stuart cousins, which provides a more subtle family portrait rather than a gloomy historical documentary.Beautifully researched and annotated, the book succeeds in portraying the Tudors as living breathing people, and despite the inherent cruelty of the era, in which they lived; the Tudor family are successfully shown as human beings with faults and foibles, and who were doing the best they could to succeed in a turbulent world.If you are familiar with the Tudors then this book will not offer up any startling new evidence, but as an aide memoir it works really well, especially if like me you devour Tudor fiction.My thanks to NetGalley and Perseus Books Group and Public Affairs Books"}, {"userName": "Julie Ferguson", "userReviewDate": "Aug 02, 2013", "userURL": "http://www.goodreads.com/user/show/1224893-julie-ferguson", "userReview": "I both read and write history, so I inhaled this 560-page book (ARC) that opens with Owen Tudor, a commoner, to the end of Elizabeth I's reign.The author, de Lisle wrote through the lens of the Tudor era, a time of warring, intrigue, and intense scrabbling over succession. The early Tudor monarchs were not royal and their paranoia of losing their thrones drove everything they did—from marriages and divorces, to politics and religion. It was a violent, cruel time. Many books on the subject have left us with impressions of \"Bloody Mary\" and \"Gloriana\" that stem from Victorian hyperbole. Tudor corrects those myths. For example, Elizabeth I executed more people than Henry VIII and Mary I did during their reigns.While well-researched and the myths corrected, Tudor is not a dry read, rather a page-turner. I recommend it to all who read well-written history and are eager for the latest research on the subject."}, {"userName": "Melisende d'Outremer", "userReviewDate": "Jul 14, 2013", "userURL": "http://www.goodreads.com/user/show/3023823-melisende-d-outremer", "userReview": "I loved it. Now I am not a fan of Henry Tudor (being a bit of a Ricardian), however, I was impressed with Leanda's documenting of the origins of the Tudor Monarchs of England (not to be confused by their ancient Welsh counterparts). I was especially impressed with the retelling of Margaret Beaufort's story - she is such a feisty women who was determined to shape her future, and that of her son, as best she could given the mores of the time. I would recommend this as a welcome and insightful addition to any Tudor library - a great starting place for those wishing to delve deeper into this period of history."}, {"userName": "oleeleeo", "userReviewDate": "Aug 25, 2014", "userURL": "http://www.goodreads.com/user/show/4308405-oleeleeo", "userReview": "I've read a good number of books on the Tudors. It's my favorite period of history.This book is extremely thoroughly reasearched and presents events in an unbiased manner. This is important because I've read enough books on the Tudors that have been slightly compromised due to an author's opinion being forced on the reader. It's frankly annoying when that happens and De Lisle refrained from making this mistake.She had a bit of a wry sense of humor which I appreciate. Just enough to make it entertaining not distracting. I appreciated her defense of Margaret Beaufort as well; the author portrayed her as a wonderfully intelligent, resourceful mother who tirelessly worked to secure the safety and legacy of her son Henry (often at great peril for her own safety). Oddly Beaufort is often recalled as a formidable, dour presence (not helped by artistic renderings of her in late life) but the author made her inspiring and likable. Her depiction of Elizabeth Woodville was also particularly poignant. The mothers in Tudors history often endured long separations from their children and dealt with their children's deaths as well. Despite the glittering romantic portayals of the Tudors in cinema these grim realities made life literally hang in the balance for these matriarchs. The Tudor kings who were judged harshly by modern critics were somewhat defended by the author as well; Henry VII was basically raised in exile and had be quite careful, almost paranoid for his own survival. Unfortunately his cautiousness became a bit exaggerated late in his reign; his laws became almost Draconian and as a result he was not popular with his kingdom. Henry Vlll started out as a jocular, athletic and beloved ruler but also suffered the same fate. His reign was remembered as being full of bloodshed and terror. Constant threats of rebellion, religious strife and plotting amongst palace insiders created an insidious petri dish of volatility.Almost anyone familiar with Tudor history has a strong opinion about the 'Lost princes in the Tower' the sons of Elizabeth Woodville taken by their uncle Richard lll. Some feel Richard ordered their murder (feeling they presented a threat to his reign). Others argue that such a sober, pious ruler would never do such a thing. Some have speculated that Margaret Beaufort was behind their demise (in order to pave the way of her son, Henry Vll to the throne). What is known is this: Richard lll never made mention of the princes after their incarceration in The Tower. He never acknowledged their deaths and certainly never held a funeral mass for them. He did not want a religious cult/martyrdom developing around the princes which was a possibility if people knew they were murdered. After Henry Vll took the throne (defeating Richard lll at Bosworth) he maintained the secrecy surrounding the princes for much the same reason. Although bones were discovered many years later (buried at the foot of stairs in The Tower) and forensic analysis confirms the bones are that of two children approximately the same age as the princes there is still no absolute cetaintly about the fate of the two boys. This is such an emotionally fraught topic, the death of two innocents. Unfortunately for Richard his reign will always be besmirched with this black cloud of ignominy. And the fact that he had a genetic deformity (likely scoliosis), aka a hunchback it adds to the image of him being a monster. De Lisle tried to explain the treachery of being a ruler and how Richard was merely maintaining his dominance as a ruler. I wasn't sure if she was giving him a pass if he ordered 'a hit' so to speak but it seem perhaps she was. If the princes had been allowed to live they could raise an army as adults against their uncle. Call me crazy but I still think Richard was an asshole. It's a matter of opinion of course! Henry Vlll and his daughter Elizabeth also executed would be rivals. Elizabeth started off beloved by her people and acknowledged them lovingly 'as her very own children'. In her later years her popularity waned with the ongoing war and her subjects enduring financial troubles. She cleverly refused to name an heir (as was expected of a monarch) for years knowing that as soon as she did the power plays and plotting against her would be set in motion. For someone with little politcal training she showed exemplary cunning. While some speculated her refusal to marry was because she was lovelorn for her Master of The Horse, Robert Dudley (and secret lover) her reasons were more pragmatic. If Elizabeth were to marry she would have less control and more plotting to contend with; she thought it best to avoid the situation entirely.Each Tudor player was covered in great detail with much attention given to the human aspects of lives. This not only made the book a pleasure to read (meaning not too dry) it also gave a three dimensional view of this most fascinating time in history. A good writer and I'll be checking out her other books. A must read for anyone interested in this period or anyone looking for a good introduction."}, {"userName": "Gilda Felt", "userReviewDate": "Nov 22, 2013", "userURL": "http://www.goodreads.com/user/show/16463173-gilda-felt", "userReview": "This Tudor historian should probably stick to what she knows best, rather than wade into areas she hasn't researched well. Perhaps the fact that it's Richard III's picture on the cover, instead of Edward VI's, should have been my first clue, but I was still shocked to find that the author's work was heavy on supposition when it came to her take on the king whose throne was usurped. What can't possibly be known either way is often stated as fact when it backs up her notions about history and she leaves out much of the other side of the story when it comes to how Henry Tudor managed to become king. This would be fine, except that she writes only enough of it to be damning.I'm not as well versed on the rest of the Tudors' history, so it's hard to know if the rest of the book is filled with as sloppy research as the first chapters are."}, {"userName": "Louis Skye", "userReviewDate": "Mar 28, 2015", "userURL": "http://www.goodreads.com/user/show/30429764-louis-skye", "userReview": "For anyone with a love of Tudor history, this book is a delight. Leanda de Lisle has exhaustively researched the Tudor family and written a book that is complex, without being confusing, and packed with details that transport you back in time. I loved de Lisle's first book on the Grey sisters and couldn't wait to read more of her work. De Lisle has a captivating writing style that brings the era alive and weaves in the intrigues of the royal court. Reading her book is like going on an epic adventure to solve the mysteries of the past. What more can you ask for in a book about history?"}, {"userName": "P.", "userReviewDate": "May 09, 2015", "userURL": "http://www.goodreads.com/user/show/3129327-p", "userReview": "A well written, fact filled, horrifying book about a lot of not very nice people. There were six Tudors who sat on the throne if you count poor, disputed Jane, and the damage they did to their little kingdom was immense. The obsession with power, the fear of losing it, and the sheer ego involved in this pursuit make for an interesting, if fatiguing read. Heads do roll."}, {"userName": "Margaret Sankey", "userReviewDate": "Jul 13, 2017", "userURL": "http://www.goodreads.com/user/show/5861086-margaret-sankey", "userReview": "Most surveys of the Tudor period try to be neutral, or they have a bent of some kind (pro-Richard III or anti, leaning towards Katherine of Aragon or Anne Boleyn), but de Lisle attempts to find sympathetic motivations for *everyone*, usually that they were just trying to survive or promote their kids, or that (given the wide dispersion of royal blood) they genuinely thought they were entitled to be in charge. There's nothing really new here, just an assemblage of all of the most charitable readings of all of the people involved."}, {"userName": "Kimberly Harris", "userReviewDate": "Mar 06, 2017", "userURL": "http://www.goodreads.com/user/show/52475471-kimberly-harris", "userReview": "This book takes a look not just at King Henry VII onward, but rather traces the Tudor blood lines back a few more generations. For a book going over so many generations, this easily could have been boring. Yet I got so swept away in the battles and drama at one point, I found it hard to put down! It gave me a great introduction to some important historical figures from the Tudor background. I better understand the angst and blood that was shed as England's different factions fought for the throne. Seeing generational struggles for keeping the throne better help me understand the bio's I've read of individuals in the Tudor family. One interesting note: The author clearly has a Catholic leaning. In a book that goes over England's reformation, no matter how fair you are trying to be, that bias comes through. I've read more from the perspective of a secular or more protestant leaning author, so this author gave me a balancing viewpoint that helped me think of \"bloody Mary\" in a new light."}, {"userName": "Sarah-Hope", "userReviewDate": "Oct 21, 2013", "userURL": "http://www.goodreads.com/user/show/9059923-sarah-hope", "userReview": "Something Old, Something New, Something Absolutely FascinatingWhen I was a child (circa 1970) my entire family spent weeks watching the BBC series The Six Wives of Henry the Eighth. That marked the beginning of my interest in Tudor history.When a new popular book on one of the Tudor monarchs comes out, I’m always eager to read it, to see how it confirms or challenges the understanding I have of Tudor history based on my previous reading. So, I was delighted to be offered an electronic review copy of Leandra De Lisle’s Tudor: The Family Story, just published earlier this month. This is the first book I’ve read that focuses on the entire family, instead of just one or a few individuals, and it’s added a great deal to my understanding of the era.De Lisle is a historian who’s a relatively new arrival on the scene (her first full-length work was published in 2005)—and a prolific one, given that Tudor is her third title in the seven years since then. The 2005 volume was a study of the transition from Elizabeth I to James I and VI. The 2008 volume looked at the Grey sisters, the eldest of whom had a brief reign as Queen Jane during the interval between the death of Edward VI and Mary Tudor’s rise to power. In other words, she’s focused on some very interesting transitional moments in addition to the lives of the monarchs themselves.Given this focus on transitions of power, Tudor is an engaging read, whether you’ve been reading Tudor history for years or are looking for a first book on the subject. De Lisle’s prose is crisp; she piles up detail without ever becoming tedious. I particularly appreciate the clarity with which she treats her sources—she takes time to explain her interpretation of key documents, and she’s also done some digging to locate documents not used in previous biographies of members of this family.Tudor offers a blend of continuity and revelation. The continuity helps readers see the period as a series of related historical events, rather than as individual reigns in isolation from one another. The revelations are many (at least if I didn’t forget a great deal of my Tudor history just prior to reading this book) and well-explained.One example of these revelations is her discussion of the deaths of the two princes in the tower that preceded the rise of Richard III. She asks, as many have, why Richard didn’t firmly acknowledge the prince’s deaths, putting to an end the possibility of uprisings led by pretenders. She also asks (a question that to the best of my knowledge is a fresher one) why Henry VII didn’t search for the prince’s bodies after his ascension. After all, proving Richard a regicide would seen an appropriate move to strengthen Henry’s claim that he served by moral, as well as military, authority. De Lisle’s answer to both these questions draws on the instability of these two reigns and the popularity of pilgrimage in still-Catholic England. Both Richard III and Henry VII were threatened by the growing cult of and movement to canonize Henry VI: the last thing they needed was a new, more-threatening religious movement viewing the princes as innocent martyrs whose deaths could unite citizens in opposition to either regime. She reminds us of the gathered throngs after Princess Diana’s death, suggesting a similar response were the prince’s deaths to be publicized. That’s the sort of new, interesting thinking this book is full of.I also appreciated de Lisle’s commentary at the end of the book, offering analogies like the above one between events in the Tudor period and our own. She compares the political villification of Catholicism in Protestant England with the west’s current villification of Islam. She reminds us of the biases created by our own popular culture: Elizabeth is played by Cate Blanchett, Mary Tudor by Kathy Bates.If you want an interesting historical read that does more than rehash earlier work and that surprises with its reflections on the past and out own time, I absolutely recommend de Lisle’s Tudors."}, {"userName": "Sarah Bryson", "userReviewDate": "Mar 11, 2017", "userURL": "http://www.goodreads.com/user/show/65731786-sarah-bryson", "userReview": "If you only ever read one book on the history of the Tudor family then this is the book to read. I have been waiting eagerly to read De Lisle’s book for some time now and when I was finally able to pick it up I could not put it down! (I read all five hundred and thirty nine pages in just five days… it was so good that I didn’t want to put the book down!) Many books that look at the one hundred and eighteen year rule of the Tudors start quite naturally at the Battle of Bosworth where Henry Tudor won the crown and the English throne. Yet the story of the Tudors, who they were as a family and how Henry came to the position to be able to make a challenge for the throne, dates back much further. De Lisle starts the story of the Tudors here, when Owen Tudor meets the Dowager Queen Catherine Valois, Queen of the late Henry V. While there is not a great deal known about how the pair met or the intimacies of their relationship De Lisle does a wonderful job in setting the foundations of how the name Tudor became intertwined with the monarchy. She details Owen Tudor and Catherine’s children and their relationship with the young Henry VI. She also provides a detailed setting of the events that were happening in England at the time and situates the Tudors within the unfolding story of the Wars of the Roses. Moving from here De Lisle discusses Margaret Beaufort, her marriage to young Edmund Tudor (son of Own Tudor) and the birth of her only child, a boy named Henry, at the tender age of thirteen. De Lisle provides a compelling story of Henry’s younger years and his flight to Europe with his Uncle Japser Tudor. Instead of just focusing on Henry and how he returned to claim the English throne De Lisle also discusses his mother Margaret Beaufort, her own struggles and tribulations and she goes into wonderful detail about a mother’s efforts to unite the houses of York and Lancaster and see her son on the throne. Through detailing all of these important events De Lisle is able to provide a detailed setting for the Battle of Bosworth and Henry Tudor’s rise from a young man to a King of England. From here De Lisle moves through the life of Henry VII, his marriage, the birth of his children and how his actions and beliefs affected the ruling and shaping of England as a Kingdom. It was fascinating to read about what happened to the men and women who lived under the rule of Henry VII. De Lisle describes the lives of the other players at court and what happened in their lives as a result of a Tudor monarch on the throne. Naturally she discusses Richard III, the Princes in the Tower and Elizabeth of York’s mother and extended family. Upon Henry Tudor’s death his son Henry VIII came to the throne. Henry VIII’s story is well known and has been written about countless times throughout the centuries and yet De Lisle manages to shed new light into the second Tudor’s extraordinary reign. She studies a man who when he first was crowned was the light and youth to the Kingdom right through to Henry VIII’s final years where he was overweight, tyrannical and obsessed with the succession of his young son Edward. De Lisle details Henry VIII’s wives and the massive events that took place during Henry VIII’s reign that not just impacted England but helped to lay the foundations for an England that we know today. I was thoroughly impressed by De Lisle’s examination of Henry VIII and his rule. She did not judge nor make up accusations as many have done in the past; she simply stated the facts and wove a very compelling narrative of this larger than life man.After Henry VIII’s death his son Edward VI came to the throne under the guidance of a council, initially ruled by his Uncle Edward Seymour. De Lisle discusses in great depth the rule of young Edward and those on his council that swayed Parliament to bend to their own personal beliefs and religious desires. The vying for Lord Protector of England was interesting to read and De Lisle weaved a compelling story of how various members of the extended Tudor began their bid for the English throne once it became known that Edward VI did not have long to live. The story of Jane Grey’s short lived rule was also detailed within De Lisle’s book, which was a fascinating read as she is an often forgotten member of the Tudor family who held the throne, even if it was just for a short period of time. De Lisle details Jane Grey’s short reign and also how Mary Tudor, oldest child of the late Henry VIII, made her bid for the throne. It was interesting to learn about the common people’s thoughts about the happenings of this short period and who they wished to be their new Queen.Once Mary I had claimed the throne as the lawful heir of Henry VIII, De Lisle describes Mary I’s reign in wonderful detail. She does not just focus on Mary’s marriage and her struggle for a child but she describes Mary’s desires as a Queen and what she wanted for her Kingdom. Mary faced a difficult battle to be recognised as Queen, after in all the Tudor period it was unheard of for a woman to be Queen and to rule in her own right rather than under a man. De Lisle discusses Mary’s desire to see England returned to a Catholic nation and her influence upon parliament. The name ‘bloody Mary’ did not come about until after Mary’s reign and although she did see to the deaths of many people during her reign for their religious beliefs she also had a strong desire for the prosperity of her Kingdom. Upon Mary’s death her half-sister Elizabeth I came to the throne. While I have read a great deal about Elizabeth I and her reign I felt that De Lisle managed to shed new light upon Glorianna. Instead of simply detailing the highs and lows of Elizabeth I’s reign and then her death De Lisle went into detail about those that Elizabeth I feared might make claims to her throne throughout the years. De Lisle discusses Elizabeth’s cousins and extended relatives, their marriages and their own desires or even lack of desire to be part of the royal court. De Lisle also discusses Margaret Douglas, Mary Queen of Scots and James V of Scotland and how the lives of these three people wove together to have major implications upon Elizabeth’s reign. I felt that I learnt a great deal about Elizabeth’s extended family in this section of De Lisle’s book and it helped to put Elizabeth and her reign into a great perspective of the people and the times. What I most enjoyed about De Lisle’s book on the Tudor’s is that she did not just focus upon the ruling monarchs, Henry VII, Henry VIII, Mary I and Elizabeth I that we know so well today. The title of the book is ‘Tudor The Family Story’ and De Lisle discusses all of the members of the Tudor family, not just those that claimed the throne. She provides details about Henry VIII’s sisters, Margaret and Mary and his brother Arthur that died as a teenager. De Lisle discusses the lives of Margaret Douglas, Henry VIII’s niece and Margaret’s children as well as the children of Mary Tudor, Frances Brandon and her daughters who would all play a role in the reigns of Mary I and Elizabeth I. Through these extended family members we as a reader are able to gain a greater understanding of the wider Tudor Family and see how family members are linked and at times the great impacts that certain family members had upon others. As I said previously if you only ever read one book on the history of the Tudors then I strongly recommend that this is the book you read. De Lisle did an amazing job of not just detailing the lives of the ruling Tudor monarchs but also providing a wealth of information about their extended relatives and family relationships. By gaining a greater understanding of how different members of the Tudor family thought and felt helped to build a deeper picture of who the Tudors were and why they made such a huge impact upon England and history. De Lisle has an easy and captivating writing style and it is easy to start reading and simply lost track of time! I loved De Lisle’s book on the Tudors and would strongly recommend it to anyone wishing to learn more about this captivating, enthralling family."}, {"userName": "Mandy", "userReviewDate": "Jun 24, 2013", "userURL": "http://www.goodreads.com/user/show/17663325-mandy", "userReview": "Tudor: The Family Story by Leanda de Lisle******I received an ARC of this book in exchange for a fair, honest review. Thanks to Netgalley, Perseus Books and Public Affairs Books***5 Stars!Beautifully researched and compellingly constructed, this is the first book on the Tudor family I have read that gives a history of more than just the major players (Henry VIII, Elizabeth I, etc. ) Starting with the founder of the Dynasty, Owen Tudor and his marriage to the Dowager Queen Consort, Catherine de Valois after the death of her husband Henry V. By outlining the early history of the Tudor family de Lisle gives the reader much needed background as to the events that followed. Margaret Beaufort has often been vilified or had her role as matriarch of the Tudor line played down in popular histories but here she is shown to be a women of strength, determination and well honed survival skills. Likewise her son, Henry VII and his actions and motives are very well explained and the book as a whole is very well referenced, managing to give background information without swamping the reader in titles and family lines. A great deal of research has also gone into defining the world or which the Tudors were a product.The book does cover all the familiar Tudor elements, Henry VIII’s quest for a son, the break from the pope and Rome, Mary I’s desire for England to be Catholic and Elizabeth’s reluctance to marry and continue the line. But where this book really shines is the detail it puts into the ‘minor’ members of the family. The non-ruling royals are presented in context and as people rather than footnotes in the lives of the ruling Tudors. Attention is payed to the family as a whole, looking at the children of Heny’s sisters Mary, the French Queen and Margaret, Queen of Scots and the role they played in dynasty’s successes and failures. As far as my readings of England’s royal history, this is the best book on the Tudor family I have read. While there may be better books that cover just Henry VIII or his wives de Lisle covers the whole family and the factors that contributed to them as a whole, rather than individuals. And she does this brilliantly, making it an easy to read and still authoritative work. Despite having read an ARC of this title, I have pre-ordered a hard copy to have in my collection as I can see this book being useful in terms of referencing and re-read value. In short, this really is the best book on the Tudor’s I have read and a good starting point for people interested in the family’s history as well as those who have read other works and want something that looks behind the well worn facts to the factors that caused history."}, {"userName": "Ruth", "userReviewDate": "Aug 18, 2013", "userURL": "http://www.goodreads.com/user/show/3458028-ruth", "userReview": "You'd think there would be nothing much left to say about the Tudors after 500 years or so. We know so much about Henry VIII and his children, and how the struggle to create a dynasty to rule England ended in only 3 generations, that sometimes you'd wander why historians don't find something better to study. Well, I'm glad they don't, because even though there are books constantly published peddling the same old same old, there are also, wonderfully, books published which challenge how we think about this family, which rose from very obscure beginnings and fundamentally changed not only England, but also Western Europe. Now, I'm not sure this book will be quite as revelatory as others have been (\"The Children of Henry VIII\" by John Guy and \"Blood Will Tell\" by Kyra Cornelius Kramer both more clearly challenge misconceptions and theories), but there is no doubting that presenting the history of the individuals in the context of their family puts them all in quite a different light. After reading this book, it's clear to me that to really appreciate what they did, their successes and their failures, you have to start at the Wars of the Roses and also understand how they were each perceived by contemporaries. This book includes a huge number of references to contemporary comments and observations and also debunks second-hand narratives in favor of using known facts, and as a result, I found myself enjoying it more than I expected.I particularly enjoyed learning more about the rather obscure individuals who played crucial roles, but which have been more or less ignored by history. What was Owen Tudor really like, and why did Catherine de Valois, a queen and mother of a king, fall for him? Is the image of Margaret Beaufort as a scheming, pious nun-mother-in-law from hell really accurate? And what of the \"other\" Tudors - the children of Henry VIII's sisters? We know the Stuarts were descended from one, and the others, including Lady Jane Grey, were essentially killed off by their cousins, but what were they like and how important were they at the time? Were they really the threat their cousins thought, or were their deaths the result of paranoia?This book really tries to answer these questions in a historically rigorous, but also entertaining way, and the result is extremely accessible, but not trite or blah.Really enjoyed it. 4 stars."}, {"userName": "Sarah - ", "userReviewDate": "Apr 16, 2013", "userURL": "http://www.goodreads.com/user/show/9479196-sarah--", "userReview": "How refreshing to read about the Tudors from their true beginnings, and not simply Henry VIII's reign and beyond. There was so much I never knew about the family prior to Henry VII defeating Richard III at Bosworth, and I do consider myself fairly well-read on all things Tudor.I was hesitant at first to read this however, because I've read previous books by de Lisle and found them to be rather slow moving. Not so here, I couldn't put it down even as her subject moved from Henry VII into familiar territory.The family is fascinating, though whenever I read about Elizabeth I find myself wanting to pull my hair out and scream at her, \"Get married already so your family's reign can continue!!!\" Alas, no amounting of shouting at her ever works.Speaking of Elizabeth, I've always had a soft spot for Elizabeth the child that I simply don't for Elizabeth the adult. I know part of this is because her mother is Anne Boleyn, whom I quite despise. The larger part though, is that her sister and predecessor Mary is often portrayed as the evil one, compared to Elizabeth's goodness. People seem to forget that Elizabeth had many more executed than did Mary - not to mention she had the nerve to execute a fellow monarch in her cousin, Mary Queen of Scots.The text it not always in-depth, but for the timespan it covers, one can't expect that or this one volume might have become a thousand pages. But it does its job well, weaving a story through centuries to how this great dynasty came to pass."}, {"userName": "Becky", "userReviewDate": "Mar 22, 2014", "userURL": "http://www.goodreads.com/user/show/50448-becky", "userReview": "Leanda de Lisle's Tudor: The Story of England's Most Notorious Royal Family was a fascinating read. It opens with a queen (Catherine of Valois, the widow of Henry V) marrying a Welsh squire (Owen Tudor); it ends with James VI of Scotland inheriting the throne of England and becoming James I of England. It covers almost (but not quite) two hundred years of English history. Henry VII. Henry VIII. Edward VI. Jane Grey. Bloody Mary. Queen Elizabeth. James I. Not to mention Mary, Queen of Scots. It focuses on the royals who reigned, but, it also pays a good amount of attention to other royals. The sisters of Henry VII. The sisters of Henry VIII. And their offspring, royal cousins. For example, Margaret Douglas and her children and grandchildren. Also Katherine Grey. It focuses on family AND politics AND religion. Also perhaps power and ambition. It avoids as much as possible drawing moral conclusions or judgments about the actions of the royal family. The book urges readers to consider everything in the context of time and culture. Kings and queens eliminated perceived threats via life imprisonment or execution. Emphasis on perceived. Guilt being a matter of perception, not of hard facts and proof. Overall, I found this book an enjoyable and informative read. I liked the thoroughness, the evenness of the coverage. The information was concise and the narrative was well written. The pacing was well done. I would definitely recommend this one!"}, {"userName": "Jill", "userReviewDate": "Jun 22, 2013", "userURL": "http://www.goodreads.com/user/show/5294307-jill", "userReview": "I've always been interested in the Tudors. Admittedly, ever since the British TV show, but still. This book claimed to not only be about Henry VIII and Elizabeth I, but also the early Tudors; Henry VII's father for example. I really liked reading about them, especially when a book can give me new perspectives on these historial figures. This much is most certainly true, for me personally, where Elizabeth I is concerned.I enjoyed reading this a lot, even if it's not my usual title for reviewing. I had some trouble in the middle, concerning the starting/ending reigns of Mary I, Jane Grey and Elizabeth I. This is probably due to the fact I already knew much of what was being discussed, safe for information about Jane Grey, who I've never been particularly interested in.Still, the new pictures that are being painted here - at least for me - make this book well worth reading, especially if you're interested in the Tudors even a tiny bit and find yourself puzzled when you hear the names Margaret Beaufort, Margaret Clifford, Margaret Douglas, or Frances Brandon (and yes, there are LOTS AND LOTS of Margarets in this book), then you should probably check it out!"}, {"userName": "Helene Harrison", "userReviewDate": "Oct 29, 2013", "userURL": "http://www.goodreads.com/user/show/8138275-helene-harrison", "userReview": "ISBN? – 9780701185886Publishing? - Chatto & Windus 2013 (first published 2013)General Subject/s? - History / Tudors / Biography / PoliticsGeneral Analysis? - An excellent book, more biography than history, but nevertheless it gives an insight into the personalities, both royal and servant, that enhanced the Tudor dynasty, from its humble beginnings to its fantastic end. Excellently researched and with an extensive bibliography. Truly fantastic. I'm tempted to call it a Tudor bible!Recommend? – Yes.Similar Books? - The Tudors: History of a Dynasty, Tudors, Tudor Queens of England"}, {"userName": "Kayla Dedik", "userReviewDate": "May 23, 2014", "userURL": "http://www.goodreads.com/user/show/6901924-kayla-dedik", "userReview": "I was dubious about tacking \"yet another Tudor book\" but I am glad I did. This book offered fresh perspectives on the oft told histories and cleared up many common assumptions about the Tudors. Lisle examined lesser known players in the Tudor family who actually influenced a great deal of events (esp. Re: the succession). Most compelling perhaps is the way Lisle analyzes actions and events by examining the past in the context of the actual time period, rather than looking at everything through the eyes of the present. This tactic shed some new light on actions and probably motives - things the Tudors did and why.Particularly, when it comes to the Tudor women, Lisle challenges present-day stereotypes and commentaries, painting perhaps a more even and realistic picture of their lives.Overall, I felt that I learned quite a few new things about the Tudors and appreciated the fresh look at such well-known material. (And as a final plus, the writing is clean and concise - not tedious!)"}, {"userName": "Victoria Johnston", "userReviewDate": "Aug 01, 2013", "userURL": "http://www.goodreads.com/user/show/22626694-victoria-johnston", "userReview": "I won this book in a competition on site. Loved it!It was quite interesting to actually read a book about The Tudors that focused solely on the family ties rather than the different reigns of the dynasty. Very well written book, just the right length to keep the reader interested and was clearly researched thoroughly by the author. Was very interested to read about some of the lesser known Tudors such as Margaret Douglas and Arbella Stuart. The book was very nicely bookended also as it started with Owen Tudor and ended with a sentence referencing him. Just like the Tudors dynasty itself.I would recommend this book to others.I hardly wanted to put it down. Every time I got off the train i cursed my bad luck that I had to wait until the next train ride to read some more!!!Infact I have recommended it to both my sister and a number of people at work."}, {"userName": "Sarah Dauterive", "userReviewDate": "Aug 22, 2013", "userURL": "http://www.goodreads.com/user/show/6648481-sarah-dauterive", "userReview": "Fantastic book that I will be sure to buy for my library. I recently read a similar historical non-fiction book studying the same time period that was half the length as this one. I really, really struggled with it and thought I would with Tudor as well. Not so! I devoured this book like it was a historical fiction that I love to read. I'm going to check out the other books by this author right now!"}, {"userName": "Terri", "userReviewDate": "Sep 13, 2013", "userURL": "http://www.goodreads.com/user/show/8191611-terri", "userReview": "I am a total Tudorphile and will read anything I can get my hands on about this family. So did we need another book about them?This book is a fluent portrait of five generations . Jealousy, murder, passion treachery and first and foremost ambition. This book is an unputdownable thrill ride.The old saying truth is stranger than fiction holds true in the tale of this fascinating dynasty."}], "description": "# Sunday Times Bestseller; BBC History Book of the Year; a Daily Telegraph Book of the Year; a History Today Book of the YearThe Tudors are England’s most notorious royal family. But, as Leanda de Lisle’s gripping new history reveals, they are a family still more extraordinary than the one we thought we knew.The Tudor canon typically starts with the Battle of Bosworth in 1485, before speeding on to Henry VIII and the Reformation. But this leaves out the family’s obscure Welsh origins, the ordinary man known as Owen Tudor who would fall (literally) into a Queen’s lap—and later her bed. It passes by the courage of Margaret Beaufort, the pregnant thirteen-year-old girl who would help found the Tudor dynasty, and the childhood and painful exile of her son, the future Henry VII. It ignores the fact that the Tudors were shaped by their past—those parts they wished to remember and those they wished to forget.By creating a full family portrait set against the background of this past, de Lisle enables us to see the Tudor dynasty in its own terms, and presents new perspectives and revelations on key figures and events. De Lisle discovers a family dominated by remarkable women doing everything possible to secure its future; shows why the princes in the Tower had to vanish; and reexamines the bloodiness of Mary’s reign, Elizabeth’s fraught relationships with her cousins, and the true significance of previously overlooked figures. Throughout the Tudor story, Leanda de Lisle emphasizes the supreme importance of achieving peace and stability in a violent and uncertain world, and of protecting and securing the bloodline.Tudor is bristling with religious and political intrigue but at heart is a thrilling story of one family’s determined and flamboyant ambition.", "title": "Tudor: The Family Story", "url": "https://www.goodreads.com/book/show/17456974-tudor", "average": 4.12, "cover": "https://images.gr-assets.com/books/1375463991l/17456974.jpg", "reviews": 156, "authors": [{"url": "https://www.goodreads.com/author/show/90578.Leanda_de_Lisle", "name": "Leanda de Lisle"}], "type": ["History", "English History", "Historical", "Nonfiction"], "outlinks": ["http://www.goodreads.com/book/show/17456974-tudor", "http://www.goodreads.com/book/show/18894594-tudor", "http://www.goodreads.com/book/show/17859587-tudor", "http://www.goodreads.com/book/show/19216214-tudor", "http://www.goodreads.com/book/show/22928892-tudor", "http://www.goodreads.com/book/show/17456975-tudor", "http://www.goodreads.com/book/show/3980321-the-sisters-who-would-be-queen", "http://www.goodreads.com/book/show/156556.After_Elizabeth", "http://www.goodreads.com/book/show/33224078-the-white-king", "http://www.goodreads.com/book/show/1324516.The_Catholics_and_Their_Houses"]}