{"ratings": 1005, "userreviews": [{"userName": "K.J. Charles", "userReviewDate": "Jul 13, 2017", "userURL": "http://www.goodreads.com/user/show/21413858-k-j-charles", "userReview": "Absurdly and gleefully enjoyable superhero comedy thriller. This might be the greatest beach book of all time. The Indian setting gives the author opportunity for a ton of sharp observations and satirical heft as well as making this distinct from the same-old US of A superhero roster; there's loads of good female characters; laugh out loud funny writing as well as huge action scenes. I am sick to the back teeth of superhero movies but wow I wish they'd do this. Just wildly fun, which is a lot harder to pull off than it looks. Spot on holiday reading, and I'm not even on holiday."}, {"userName": "Rachel Brown", "userReviewDate": "Jun 30, 2015", "userURL": "http://www.goodreads.com/user/show/11193019-rachel-brown", "userReview": "Whether or not you will like this playful novel about Indian superheroes depends largely on how much you like its distinctive voice. Here’s the opening paragraphs:#In 1984, Group Captain Balwant Singh of the Indian Air Force’s Western Air Command had dangled his then three-year-old son Vir off the edge of the uppermost tier of the Eiffel Tower in Paris, nearly giving his gentle and hirsute wife, Santosh Kaur, a heart attack in the process. With the mixture of casual confidence and lunacy that is the hallmark of every true fighter pilot, Captain Singh had tossed his son up, caught him in midair and held him over the railing for a while, before setting him down safely.His son’s future thus secured, Balwant had turned to shut off his wife’s uncanny impersonation of a police siren with the wise words, “Nonsense, foolish woman. See, my tiger is not afraid at all. He is born for the sky, just like me. Vir, say ‘Nabha Sparsham Deeptam’.”Vir had not been in the mood for the Indian Air Force motto at that point, his exact words had been, “MAA!”All these years later, Vir still remembers that first flight with astonishing clarity: the sudden weightlessness, the deafening sound of his own heart beating, the blur of the world tilting around him, the slow-motion appearance of first the white dome of Sacré Coeur and then a wispy white cloud shaped like Indira Gandhi’s hair behind his flailing red Bata Bubble-Gummers shoes. His father had said that moment had shaped his destiny, given him wings.But his father isn’t here now. Flight Lieutenant Vir Singh is all alone in the sky.#Vir, like the other superheroes, got his powers on a commercial flight to Mumbai; why and how this occurred is never explained and doesn’t matter. The powers derive from the characters’ deepest desires, so Vir, an all-Indian hero, became Superman; Uzma, a British-Pakistani aspiring actress, is loved by everyone she meets; Tia, a discontented mom who wishes she’d made different life choices, gets the ability to generate copies of herself. (One guy gets the power to control weather based on the condition of his stomach, but exactly what this power means to him is not explored.)The characters’ knowledge of superheroes and the fact that most of the superheroes they know of are not Indian provides a lot of the comedy and social commentary of the book, as they discover that all the good superhero names in English are taken, and the Hindi alternates are incomprehensible or unpronounceable to a global audience. (Vir’s suggestion, based on the highest Indian military decoration, is shot down due to no one who isn’t in the Indian Air Force having heard of it.) And is a giant superhero battle with lots of property destruction the inevitable climax of any superhero story? The characters are lightly but vividly sketched. They’re types rather than well-rounded characters, but they’re fun types. My favorites were Uzma, who just wants to be famous, Tia, whose power is more badass than it sounds, and the super-baby, or rather the hilariously bonkers cult following attracted by the super-baby. But the wry narration was my favorite part of the book, tossing off quips and references like a never-ending shower of brightly colored confetti. There is a sequel, which I will definitely read, but this book ends conclusively. I think the sequel takes place several years later and mostly involves different characters."}, {"userName": "Priya", "userReviewDate": "Jul 29, 2011", "userURL": "http://www.goodreads.com/user/show/5288208-priya", "userReview": "I tried. I really did. Thrice. Stopped at the second chapter on the first try. Couldn't go past the 25% mark on my third try. I give up.The story is about a bunch of people getting superpowers based on their heart's deepest desires, all because they happened to be on a certain British Airways flight. There's a villian trying to kill 'em all (of course there is!) and an undecided character who might be a friend or a foe (I stopped reading before this was revealed, perhaps). This whole plot sounded very interesting, but once I got reading it just couldn't keep me interested. There were a lot of things happening, true, but it was very insipid and bland (for want of better words). It was dry. I wasn't looking forward to turning the pages.So I gave up. I loved Simoquin Prophecies, but this one just didn't do it for me."}, {"userName": "Arun Divakar", "userReviewDate": "Sep 26, 2016", "userURL": "http://www.goodreads.com/user/show/2747498-arun-divakar", "userReview": "Of late I seem to be rather adept at finding and reading lacklustre books. Here is another one with a terribly disjointed storyline and droll attempts at humor.A review is beyond me for I cannot think up of anything to compensate the time spent trying to read this. I tried an incremental approach : 25 pages at first, a hesitant 50 pages and finally a last ditch 100 pages and nothing changed. That was it !"}, {"userName": "Kartik", "userReviewDate": "Mar 04, 2018", "userURL": "http://www.goodreads.com/user/show/31291929-kartik", "userReview": "Let me begin by saying I have very mixed feelings about this book.First, the positives. There are quite a few of them. My favorite part is how Basu's writing cleverly inverts tropes and stereotypes, turning them upside down. The language itself is evocative, without trying too hard, and features sly turns of phrases, witty references and jokes, and a very authentic, mature Indian voice that isn't insecure of its identity. The characters are mostly well written, choosing what they choose for complex reasons that keep changing as they process their new powers.(If that sounds interesting to you, do check out Basu's Gameworld Trilogy, which starts with The Simoqin Prophecies. It features his signature aversion to tropes, as well as his influence from Indian themes.)Now for the negatives. This book gets quite meandering after the first half or so, and the plot goes around in circles before ending with one of the worst endings I've ever read in a book that isn't otherwise horrible. A lot of the characters barely feature in the story for a few pages, and you wonder what was the point of including them at all. There are also plenty of loose ends, and chapters that go nowhere. Plus, one of the main characters (I'm not saying which one) ends up being very little more than literally just a pretty face, in sharp contrast to the other characters who are three dimensional.No, seriously, the ending is *that* bad. It's a deus ex machina that comes completely out of left field, and what makes it worse is how it's at odds with the clever subversion of lazy tropes and convenient endings the book features up until then. It's a huge let down and it effectively makes the entire second half of the book practically just filler content.The book is a fun read that features some great, witty, clever writing with very imaginative trope subversion - this is not your standard fare Bollywood/superhero movie. Just don't expect it to go anywhere or to get any real closure out of the plot."}, {"userName": "Mark", "userReviewDate": "Jul 08, 2012", "userURL": "http://www.goodreads.com/user/show/554401-mark", "userReview": "At the moment superheroes are hip and smart. Films such as the rebooted The Amazing Spider-Man (due any time now as I type), Iron Man (the third instalment now being filmed) and The Dark Knight (also the third incarnation of the Nolanverse Batman due this summer) are all current. The Avengers is one of the biggest grossing movies of all time. TV series such as Heroes and Alphas have raised the awareness (although admittedly, in the case of Heroes, crashed and burned in the end.) In text, George RR Martin’s Wild Cards series has had a rebirth, and books such as Michael Chabon’s The Amazing Adventures of Kavalier and Clay and Austin Grossman’s Soon I Will Be Invincible seem to have tapped into this zeitgeist.In such a fervent atmosphere, I think Samit Basu’s novel Turbulence will be enormous.It is, unabashedly, a new style modern superhero novel with a distinctive twist. It is also current, smart, energetic and a sparkling read.The story’s setup is fairly simple. On a plane journey from London to Delhi, Aman Sen and his fellow passengers (403 of them) experience something strange and the result is that everyone who disembarks in Delhi has superhuman abilities. Each one is different. Aman’s skill is the ability to access global communication networks without equipment. Others on the plane have similar strange powers: we have hopeful Bollywood actress Uzma who seems to charm everyone she meets, Vir who can fly at supersonic speeds without mechanical means, Tia who can be in more than one place at once. Throw in a mad scientist and his crackpot inventions and you have a Justice League team to end all Justice League teams (or rather “World-Changing-Super-Squad” as one of the characters calls themselves.)The key plot point is this: when being given such gifts, what do you do? Do you aim for helping the masses, organise world peace, stop wars, make life better, or do you concentrate on getting what you want, at the expense of others?Samit’s book looks at these thorny questions. Some of the solutions (and their consequences) are realistic, intelligent and thought through effectively. To paraphrase, the book takes on the old Spider-Man adage, ‘With great power comes great responsibility’, or, even simpler, ‘all actions have consequences’ and then follows them through to some interesting conclusions. Aman’s attempts to bring about world peace, support environmental concerns and reduce global inequality ultimately lead to more of the same: the bad guys simply find new ways of carrying on what went on before.And when one of the newly enhanced humans decides that the way forward for global domination is to rule by fear rather than reason, then Aman and many of the other characters here are divided in their actions. Do they support him in his aims for the greater good, or denounce him as a misguided despot? Some of the choices made (in what Aman calls his ‘Face Darth Vader’ moment) are not what we would usually expect.There are some lovely set pieces as the team discover and increase their new powers. A showdown between two brothers from an Indian gangster family who were on the plane and the rest of the team is brilliant in its pace and execution. The ultimate showdown at the end of the book in London is as exciting as you would hope for, and not entirely what you expect.This is good in itself. But what is most impressive is that the book takes common traditional superheroes themes and then writes about them from a very different perspective. Whilst some of the ideas are not new (see the list of other similarly themed work at the beginning of this review), as most of the action takes place not in the traditional locale of the US, but in Asia, in India, there is a different outlook to the superhero mythology that is quite refreshing and not something you would normally read in, say, a Marvel comic book. Turbulence involves topics as diverse as Bollywood, cricket, media networks, celebrity hype and Hindu god-worship. The characters are of varying social backgrounds, and each has enough variety to be both diverse and engaging.Most of all, the frenetic pace is great and the dialogue fizzes with whip-sharp quips and comments. It’s smart, it’s funny, it’s intelligently witty, it’s great.This was a welcome and very pleasant surprise. Think of it as Heroes meets Slumdog Millionaire, or Ian McDonald meets Stan Lee. Once started, I found it difficult to put down. Loved, loved, LOVED it."}, {"userName": "Holly", "userReviewDate": "Jul 18, 2012", "userURL": "http://www.goodreads.com/user/show/11058685-holly", "userReview": "(Review originally posted by me on Amazon UK)Turbulence is a book about super-humans. Now I'm the kind of person who likes his super-humans confined to comic books and movies, so from the idea of a superhero novel is foreign to me, as such reviewing one is equally foreign so I'll start from the beginning.As with many books I find that the front cover provides me with no information about what I am about to read. It does however contain a quote \"...you'll demand a sequel\" (Ben Aaronovitch). I haven't the faintest idea who that man is, but I share the sentiment. I hereby demand a sequel. So if the cover puts you off, ignore it, you're missing something good.So onto the book. This book has an interesting take on superheroes. In a set-up some may find familiar from the TV show 'heroes' seemingly random people gain seemingly random powers and proceed to do things with them. However, UNLIKE the heroes, this book handles the subject well. The characters are likable. Their reactions to things are believable. Their powers make sense.We learn early on that these powers come from whatever the person wanted. Specifically, what they dreamed about. It was interesting to discover what the characters powers really were, what they wanted and why. More importantly, it had me thinking what power I would have wanted in the same situation. What would I have done...The book handles 2 things exceptionally well as far as I am concerned.1. Powers + origins2. ReactionsPowers:One initial concern I had before reading this book, which is the same before I see anything that deals with a 'new' superhero setting was how the powers are handled. Will I just read 400+ pages of generic [insert DC/Marvel hero here] rip-off? The answer to this is no. BE WARNED, in the beginning we are introduced to Vir aka superman. This may seem like a cop-out but it leads me to origins. Vir is a fighter pilot. Vir's FATHER was a fighter pilot. Vir wanted to be the best. BUT he is also for some reason claustrophobic. His desire to be able to do his job without being cooped up in a fighter cockpit makes sense (at least that's how I read, it, feel free to correct me). This is the case with all the powers I'm seen but I refuse to state more and ruin it. Good origins make for sensible (and in some cases seemingly useless) powers.Reactions:Ignoring individual character reactions to their own powers and various plot points, which were very good, this is about something bigger. We have a superhero team, do we tell the world? The book contains a phrase something along the lines of 'Superman is real, and he isn't American'. How can you convince the world your hero-group works for everyone when all but one member is Indian? How can you prevent wars being waged when countries start blaming India for unexplained disasters? The book handles questions like these, except it asks them better and gives brilliant answers.Basically, I would recommend this book to pretty much anyone with an interest in action/super powers but also to anyone else. This book asks important questions and answers them and I think there is at least something in it that will keep most people reading."}, {"userName": "Qube", "userReviewDate": "Mar 05, 2014", "userURL": "http://www.goodreads.com/user/show/11889624-qube", "userReview": "An unlikely combination of engaging humour and a juvenile story.Mr Basu's writing is witty and humorous, and very refreshing to read. It is really unique - irreverent, sharp, and demonstrates an understanding of the melting pot that is contemporary India. I really enjoyed the first few chapters. Really did. Till the story kicked in.Think of Wodehouse, for instance. The story in any of his novels is incidental. A mere pretext, a place holder for his writing. It is his writing that one really enjoys. Mr Basu must stick to something like that. His attempt to have a story here is a disaster.His humour is multi-layered, and will be appreciated by adults. Those who have the ability to appreciate it will see a lot of humour. But the comic book story of super heroes won't appeal to anyone but kids and teens, who can't appreciate the depth of his humor. What's the point? Neither can appreciate both.It's like serving noodles and sambar.Review also posted here."}, {"userName": "Arnab Das", "userReviewDate": "Aug 10, 2011", "userURL": "http://www.goodreads.com/user/show/4116128-arnab-das", "userReview": "I'm a fan of the whole fantasy as well as sci fi genre. But this is an outstandingly boring and outrageous one. What a waste of trees!"}, {"userName": "Bjorn", "userReviewDate": "May 05, 2016", "userURL": "http://www.goodreads.com/user/show/19667916-bjorn", "userReview": "Will it all end, as eighty years of superhero fiction suggest, in a meaningless, explosive slugfest?Yes. Yes it will.I like the idea of this book; a non-US-centric take on the superhero myth, challenging the way the world is set up to work, etc. And for the first couple of chapters, I hold out hope that it'll be a fun mashup of, say, Heroes and The Satanic Verses. In the end, though, despite a few hints at interesting ideas, I find myself bored with it by the halfway mark. The characters are flat and fickle, Basu's prose reads like an excited fan's retelling of any action-laden MCU movie, and the only thing that makes me finish the book is that I'd forgotten to bring another one."}, {"userName": "Luv", "userReviewDate": "Oct 23, 2010", "userURL": "http://www.goodreads.com/user/show/2503578-luv", "userReview": "Should've been a graphic novel"}, {"userName": "El (book.monkey)", "userReviewDate": "Apr 03, 2018", "userURL": "http://www.goodreads.com/user/show/30461758-el-book-monkey", "userReview": "Although it was pretty good it didn't keep me engaged, I would often stop after half a chapter then start again. I still wanted to finish it I just personally didn't find much excitement is this book."}, {"userName": "Ashwini Nocaste", "userReviewDate": "Oct 06, 2013", "userURL": "http://www.goodreads.com/user/show/5986736-ashwini-nocaste", "userReview": "Superman exists and he's not American - a starry eyed indian's juvenilistic fantasy come true. It may be a fast paced read, but going through it became a trudge through a swampy marsh with uninspired dialogues, insincere fighting sequences and which progressed around a very cliched theme of the anti-protagonist eager to rule the world by collecting super-powered individuals. But to give the story, perhaps a fresh twist, a spanner in the banner is thrown in, which alters the plot towards the end, not without surprise, considering how much of what went before was dreamy eyed individuals' earnest desire to change the world - a desire which, surprisingly, runs through every super-powered individuals ambitions. Peeking through the rush are existential crises faced by people gaining super-powers which is hurriedly dealt with through aman's self-introspection and interactions with other characters, which seem like they have been thrown merely for good measure, but without any particular sense or direction. The plot's high moment is shifting of the anti-protagonist's loyalists towards the protagonist, for such an unconvincing reason as \"to do good\" when they had been responsible for violence before in the story. Those who had shifted loyalties were made to fight another evil force- just, perhaps, to mollify their outlook as blood thirsty villains. For Aman, an attempt is made to display the conundrums a person of his responsibility should be facing; but then again the choices for him are already laid out linearly by what others have deigned to do together and the craft of resolution is very poorly presented. I m not sure, what this book, was intended as ? an indian attempting at an anime series inspired story? where action, humour, philosophy could mix into a strong combination - if that was the intention, then i must say, this book fails on all counts with the exception of Aman meeting his cyber-clone, which was the only saving grace in my humble opinion."}, {"userName": "Beth", "userReviewDate": "Dec 06, 2011", "userURL": "http://www.goodreads.com/user/show/286675-beth", "userReview": "As someone who never reads sci-fi or speculative fiction (and only a dash of fantasy) and only knows Basu from his nonfiction writing, I had no expectations going into this book (and have nothing in particular to compare it to). And I liked it very much indeed. I underline the interesting parts of my books, and this one is now littered with marks, both for big questions - \"Do we believe in heroes because they exist, or do they exist because we believe?\" or \"What would it be like to actually get what your heart desires?\" or \"How do you maintain humanity in the face of exaggerated times and in an exaggerated self?\" - and small details - the Bollywood references about villains and their lairs, Aman's wry observations on the other characters and contemporary society.Basu rewards patience. There were multiple times I was frustrated not to know more about a character or event or thought \"Oh that's never going to work,\" but each eventual reveal/resolution was totally worth the wait and created opportunity to reconsider what I had already read or thought. The pace of action, like the flow of information, is in several different cycles, giving the reader recuperative thought time just like the characters need as well. There's a sort of wave-like, curlicue kind of feel to the book, and it doesn't simply jet along in a boring straight line - like the titular air problems, maybe?It made me think and it made me laugh. Can't ask for more than that. And how can I not love a book that evokes Satanic Verses (one of my favorites) from the get-go?"}, {"userName": "Kevin Fanning", "userReviewDate": "Jul 11, 2013", "userURL": "http://www.goodreads.com/user/show/178078-kevin-fanning", "userReview": "SO FUN. What if this ends up being my favorite book this year and the year is already so young. Best not to dwell on it. What if there really were super heroes? And what if...they weren't white?????? Could the world even deal? Does a great job of (openly) borrowing ideas from the world of comic books and the subverting/altering them in really interesting ways. About halfway through the book was miles from where I had expected it would go, which is exactly what you want. The book focuses mainly on a young man named Aman, but the women are very cool (Tia is my favorite character in the book. Although Anima is a close second.), super interesting, badass, have agency and ideas and intelligence. It's not a \"young boy turns out to be Special, must learn how to deal with his manly powers\" story, this is not Harry Potter. Aman has powers but he has plenty of ideas about what to do with them. It's more about what does it mean to get what you really want, and what does it mean to do Good in the world. Great story, loved the writing, Basu has a really deft hand with quick details (at one point describing a non-important character as \"generic sound guy\", which is perfect). RIYL if you like fast-paced, funny stories that happen to have superheroes in them. PS. I don't love the title, I feel like the book would have benefited from a longer, cooler-sounding title. PPS. HOW CREEPY WOULD ANIMA BE IN REAL LIFE. I love her but every time he described her I was like :P"}, {"userName": "Iain", "userReviewDate": "Dec 31, 2012", "userURL": "http://www.goodreads.com/user/show/5741681-iain", "userReview": "A fun and unusual take on the superhero genre: Superman exists and he's Indian. Or, in fact, many supermen: passengers on a BA flight from London to Mumbai all get granted the power that allows them their deepest wish. (Mild spoiler note: we never actually get into the how or why of this seemingly random occurence, but then I think this is a good thing. The obsessive need to do the 'origin story' as a compulsory intro in superhero fiction often gets in the way of allowing us to get to know the characters, which is actually the more important first step.)I found the writing to be a little patchy, but then I'm not too fond of the deployment of the present tense in prose fiction. It does lend the book a sense of dynamism, though, as does the occasional over-reliance on dialogue to drive the plot forward. Still, if these things annoy you, fair warning. But it's not the technical qualities of Basu's writing so much as the energy of it that made this such an enjoyable read. That, and the clever and knowing mix of Bollywood references, superhero cliches and cinematic action. Very highly recommended for anyone who loves them some flying people."}, {"userName": "Manikanta Avinash", "userReviewDate": "May 28, 2012", "userURL": "http://www.goodreads.com/user/show/2873006-manikanta-avinash", "userReview": "I liked The Game World Trilogy a lot and had high expectations on Samit-Basu. But this is a big disappointment as it looks very very ordinary. The imagination looks like a little child's who watched too many super-hero movies. I think after you watch too many super-hero movies and read so many comics, anything you try in that area will eventually look like an existing super-hero.  Even the plot was very hazy and the ending felt as if he didnt know what to do and just finished it someway. It all looked like a B-grade action movie. Suddenly Tia and Jai's gang become insignificant and he never explains the Iron-man suit (it even becomes a suit-case just like the Iron Man movie!!). The whole thing is so badly written that I cannot believe that someone as imaginative as a person who wrote the amazing Game World Trilogy could have written it. Maybe even I could have had a better imagination if I started with the basic premise of the plot.Bottomline: If you liked Game World Trilogy, don't read this. Your appreciation of Samit Basu will dampen!"}, {"userName": "Hester", "userReviewDate": "Feb 17, 2015", "userURL": "http://www.goodreads.com/user/show/2658780-hester", "userReview": "[ Except for Andy's power. And they killed him off before his power could be explored. (hide spoiler)]"}, {"userName": "Thom", "userReviewDate": "Jun 20, 2015", "userURL": "http://www.goodreads.com/user/show/7337728-thom", "userReview": "This book was really awesome. It's everything I wanted from a novel about superheroes. Whenever people try to give more depth to the superhero genre, they try two things: first, make it really realistic and have the characters immediately realize that super heroics just doesn't work in the real world, they get severely injured, sad, and basically give up, a la Kick-Ass; and second they make it ridiculously dark and gritty with lots of \"mature\" content like rape and murder, a la The Boys.This novel shows how it's difficult, but maybe not impossible, to make a difference with superpowers. The characters constantly debate the merits of using their powers to change the world for the better, and despite many, many setbacks, keep on trying. This novel doesn't shy away from trying to use powers to combat real world systematic injustices, and for that I give it so much credit.Plus, the characters are all Indian and (Pakistani-British) and it's really a nice change to have a superhero group with no pasty white guys in it!"}, {"userName": "Matt Fimbulwinter", "userReviewDate": "Sep 28, 2016", "userURL": "http://www.goodreads.com/user/show/12813262-matt-fimbulwinter", "userReview": "Yet another realistic deconstruction of superheroes. Which is one of my favourite sub-genres. Here, Samit Basu's hook is \"what if a handful of people got super powers, and most of them were from India?\"It's one of the better examples of its sub-genre. The powers are pretty standard, and the exploration of the impact, socially and physically, of the powers is well-handled. One character (Tia) has the superpower that will now be my answer to all \"what power would you have?\" questions. I felt a couple spots were left un-explored, but then, there is a sequel, so I will avoid criticizing those until I find out if they were missed, or just saved for later.I'd recommend this to anyone who likes superheroes. Or, I suppose, Bollywood movies; the influence is strong enough that even I, without much background, could pick out a few callbacks."}, {"userName": "Danie Ware", "userReviewDate": "Jan 02, 2014", "userURL": "http://www.goodreads.com/user/show/2283876-danie-ware", "userReview": "'Superman exists, and he is not an American'.Okay, this book had me in stitches. It's not often something makes me laugh out loud - let alone on commuter trains - but from its opening scene, this had me absolutely hooked. This is a tale that weaves almost flawlessly from tongue-in-cheek funny, to emotionally poignant, all the way to savagely political, with a rare and sharp insight into the politics and culture of the Indian world. Plus there's a lot of quiet geeky in-jokes, and more than a nod of homage to Watchmen, Marvel, and superhero comics in general. And when you take a slightly feckless group of b-grade superheroes, who have no real understanding of their own power and potential, and set them against the ultimate superbeing in a battle that rages through the centre of London (right outside my office) - I mean, what's not to like?"}, {"userName": "Soumyabrata Sarkar", "userReviewDate": "Feb 08, 2014", "userURL": "http://www.goodreads.com/user/show/8735355-soumyabrata-sarkar", "userReview": "JUST PURE FANTASTIC!!This is my 1st Samit Basu Reading!Brilliantly clever, Laced with bombastic comedy, in every page, and a real strong plot with a pinch of twists along the fast-paced story, this is my first \"superhero novel\" in literature! And Boy! I am glad to get into this vortex of awesome read!! Would like to recommend this to everyone! A Byapock Thing! :D :vWaiting for the sequel!"}, {"userName": "Ali", "userReviewDate": "Jul 08, 2012", "userURL": "http://www.goodreads.com/user/show/4103685-ali", "userReview": "Absolutely brilliant story of a bound of normal people who land in Delhi with super powers. Mr Basu is a brilliant writer, with an excellent sense of humour and there are references galore here to all aspects of pop culture and comics. Superb!Update: re-read July 2014, just before reading the sequel. Still awesome, still great."}, {"userName": "Eric", "userReviewDate": "Aug 11, 2013", "userURL": "http://www.goodreads.com/user/show/856728-eric", "userReview": "The ending was a little flat. But otherwise... one of the best superhero novels I've ever read. Full review here: http://superheronovels.com/2013/08/26..."}, {"userName": "Radhika", "userReviewDate": "Feb 16, 2014", "userURL": "http://www.goodreads.com/user/show/6092979-radhika", "userReview": "4.5. Awesome book! Very entertaining. Turns all tropes on their heads. I especially loved Tia! Hope there is a sequel."}, {"userName": "Apoorva Saini", "userReviewDate": "Mar 13, 2018", "userURL": "http://www.goodreads.com/user/show/78810615-apoorva-saini", "userReview": "For reasons unknown, the passengers of a flight from London to Delhi acquire powers according to what they dream in their sleeps on the plane- \"a random sample of current global societal desires\". The first half of the book is humorous, innovative and insightful that introduces the reader to more than ten brand-new superheroes and their peculiarities. Medium everything Aman turns into a communication demigod; Flight Lieutenant Vir can lift mountains, fly, and heal his own wounds; Tia, a housewife from the troubled Indian north-east can split into multiple doppelgangers; an aspirant Bollywood actress, Uzma, is amiable beyond anyone's control; a school girl Anima can be horrifyingly real-life approximation of Japanese cartoon with deadly fighting skills etc... Basu aces in launching these superheroes from the Indian subcontinent and their local contexts provide them undeniable authenticity.Unfortunately, in the second half, the plot losses clarity. Essentially the characters are confused and conflicted, which is okay, as they are only trying to grasp what they are capable of in a world of total chaos. They come from a desensitized world where one can and chooses to switch channels from Parliament attacks to Grey's Anatomy returns. The sudden empowerment is rather crushing (especially for the central characters); as everything from the enemy to the self to the ideal is in a flux and hence blurred. The world is mad anyway so no one cares now- no one even notices. Their inner conflicts with power and clashing ideologies about how the new world should function do not back up the story with the elegance that the book promises in the first half. The plot is weak in its final revelations. A particular matter of disappointment are the action/fighting scenes that have been modeled on the Manga and Marvel imagination of what superpowers can be, and are shockingly ubiquitous and familiar. What could have been a complete reinvention of the popular fantasy genre slowly slides by, leaving you with a horrible Bollywood like feel. However, the ending clearly hints a sequel, (Resistance) which I am yet to read. Overall, the book is a must for Science fiction and Fantasy enthusiasts. In terms of craft, I think Basu is a master storyteller in becoming. Thematically too, he has raised the bar high not just for himself but for all writers who are to write in this genre after him. The tightly crafted first half and a contrasting second half is a good lesson for aspiring writers illustrating how consistency is the cement in the bricks of a plot. Additionally, here are my most favorite counter passages from the book that will give you a pretty good idea about the conceptual themes that the book is dealing with (pg 83-85):\"Sundar claims he has found the beginnings of a new social-historical-cultural-scientific-psychological theory, a theory he will come up with a clever name for some time in the near future. The fundamental premise is that heroic myths and legends through the course of human history are all true- possibly exaggerated by enthusiastic re-tellers, especially the bits about gods and monsters, but the demigod heroes in these stories all actually existed. And these heroes, from Hercules to Sherlock Holmes, appeared because of these legends: the legends were not records of their actions, but prophetic texts derived from collective human aspirations that paved the way for their arrival.\"\"Bob, on the other hand, is fixed in his belief that all of this is a giant conspiracy, an evil genetics project funded by mysterious military-industrial-complex types. If Sundar's theory were true, he argues, the world would get the heroes it really needed. Not random travellers, mostly well off people on an intercontinental people complaining about the in-flight entertainment but people from the darkest corners of the world, oppressed, forgotten, left-to-rot, hopeless places; people who would have torn the world down and rebuilt it from scratch if given a choice. Superhero comics, he argues, are status-quo-ist, adolescent power fantasies from evolved countries, the worst possible instruction guide for people with powers.\""}, {"userName": "Verushka", "userReviewDate": "Jun 22, 2017", "userURL": "http://www.goodreads.com/user/show/23271825-verushka", "userReview": "What is this about?: The X-Men in India. For real. A plane of passengers are all given superpowers on their trip to India. Later, when they land, a few discover that people are after them.What else is this about?: These characters are finding out who they are, and who they can be in this new world of theirs, and yes, they read a whole heap of comic books along the way.Turbulence is such a ride, oh my god. Fun characters and funnier dialogue, I laughed every time I opened this book.X-Men In IndiaI love, LOVE that this is set in India, with a cast of Indian characters, including Uzma who is technically a British citizen too. She wants to be a Bollywood actress and when she steps of the flight, she finds everyone so welcoming, so accommodating she can barely contain her delight as well as the numerous offers she's getting to act.However, she comes crashing down to earth when she discovers Aman and his motley crew of superheros and they tell her it's really a superpower that has everyone falling over themselves to make her a star. I guess Uzma is us (readers in way), thrown into this world and trying to make sense of it. She refuses to believe until she comes face to face with Tia, who like Uzma, are the standout characters in this book.Tia is badass. She can create copies of herself  -- so she creates a copy who learns combat, absorbs it back into her and so absorbs what that copy has learned. Like I said, badass. And, she is the one who is the action hero in this by saving the day. Aman is the team's wannabe leader, who can manipulate and use wi-fi signals in a way. Or the internet to put it simply. And he runs around doing exactly what anyone would in a situation like this -- transferring money to those who need it, putting the corporate bad guys in their place and trying to put things right in a world that operates on ones and zeros. It's a heady power, one that convinces him he's in the right, before Basu brings him back down to earth with the reality of the lives lost and changed in his bid to do good.These three are the main characters in the book in a way, thrown together to stop a man from taking over the world with his band of superhero followers and of course, an unexpected enemy -- what good is an X-Men story without an unexpected enemy?The dialogueSure, Uzma, just -- think about what I said, okay? And Tia? You need to be up by lunchtime,\" Aman says.\"Why?\"\"Because Superman flew into town this evening and we're meeting him for lunch tomorrow.\"The dialogue is electric. Seriously, this is just funny and somewhat irreverent, which makes the utter seriousness that superheros are taken hilarious. And the book delves into that too -- comics these days:Sundar and Bob finally finish pleading their cases to Uzma and ask her to deliver a verdict. Both go off in a huge sulk when Uzma tells them that whoever has read the most superhero comics probably knows best how useful they can be. It turns out that neither has read any at all.This is part of a scene where Sundar (a genius mad scientist with powers), who believes that comics can help them function and face the world. Bob (controls the weather), however believes their powers are all part of a giant conspiracy, which as you know is pretty damn apt.I wish more people would take dialogue lessons from Basu. Seriously. Character ProgressionUzma is the one that goes through the most complicated, interesting journey here. She begins the book hovering in the background, trying to make sense of herself and these powers she has, and pretty much doubting everyone and everything around her. Given her power, it's an awesome level of doubt to have and Basu does not pull punches even when she falls in love. The Uzma at the end of the book is a confident woman, taking on the mantle of something she never wanted.Whew. This is such a ride. SUCH A RIDE."}, {"userName": "Isis", "userReviewDate": "Nov 07, 2016", "userURL": "http://www.goodreads.com/user/show/914674-isis", "userReview": "Entertaining novel about accidental superheros, made more interesting by being set in India, with (mostly) Indian characters. Snappy but rather superficial banter; it feels a bit like a race-bent Avengers AU, not least because it's in present tense. (Also dear god the comma splices.) A little heavy-handed on the moralizing, though really, that's okay by me because that's one of the more intriguing questions raised by this book: if you find yourself suddenly superpowered, do you have an obligation to the world to (try to) save it from itself? And do you have the right to impose your interpretation of salvation? The ending fell a little flat for me, but I enjoyed this book overall."}, {"userName": "Thomas Hale", "userReviewDate": "Jun 26, 2017", "userURL": "http://www.goodreads.com/user/show/31497275-thomas-hale", "userReview": "Everyone on a flight from London to Delhi ends up developing superpowers. Gathering together to try and figure out what happened to them and how, while becoming friends, rivals, enemies in the process. Heavily inspired by the likes of Heroes and the X-Men, this book is genre-savvy, often silly, and often brutal. It is fun to see an Indian spin on a well-trodden genre, and even if the story ends up being nothing new, the characters and set pieces are still plenty of fun, and the pacing is brisk. Curious to see where Basu goes in the sequel(s?)."}, {"userName": "Celia Yost", "userReviewDate": "Sep 19, 2017", "userURL": "http://www.goodreads.com/user/show/280515-celia-yost", "userReview": "This was a lot of fun, and I'd recommend to anyone who enjoys the superhero genre."}], "description": "How would you feel if you got what you really wanted? What would you do if you were given the power to change the world? Everyone on BA flight 142 from London to Delhi got off it with a unique superpower. A power they didn`t even know they wanted. Everyone, that is, who`s still alive. Because someone is hunting down the passengers. And now Aman Sen`s ragtag collective of rogue superhumans is in grave danger. They must decide what to do with their powers and their lives – and quickly. This explosive new blockbuster moves at hyperspeed across two continents as colliding forces move towards an action-packed finale that will leave the world – and you – changed forever.", "title": "Turbulence\n      \n          (Turbulence #1)", "url": "https://www.goodreads.com/book/show/9544621-turbulence", "average": 3.48, "cover": "https://images.gr-assets.com/books/1308055324l/9544621.jpg", "reviews": 142, "authors": [{"url": "https://www.goodreads.com/author/show/66280.Samit_Basu", "name": "Samit Basu"}], "type": ["Science Fiction", "Fantasy", "Fiction", "Comics", "Cultural"], "outlinks": ["http://www.goodreads.com/book/show/9544621-turbulence", "http://www.goodreads.com/book/show/15752728-turbulence", "http://www.goodreads.com/book/show/33000742-turbulence", "http://www.goodreads.com/book/show/17237349-turbulence", "http://www.goodreads.com/book/show/676885.The_Simoqin_Prophecies", "http://www.goodreads.com/book/show/114490.The_Manticore_s_Secret", "http://www.goodreads.com/book/show/2621107-the-unwaba-revelations", "http://www.goodreads.com/book/show/18666105-resistance", "http://www.goodreads.com/book/show/25636238-shekhar-kapur-s-devi---vol-1", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/25353286-provenance", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}