{"ratings": 1944, "userreviews": [{"userName": "Kelly (and the Book Boar)", "userReviewDate": "Oct 11, 2017", "userURL": "http://www.goodreads.com/user/show/11183856-kelly-and-the-book-boar", "userReview": "Find all of my reviews at: http://52bookminimum.blogspot.com/You want to know what happens when you’re a person of a certain age who started this book about two girls who reside in separate mobile home communities right around the same time Mr. Slim Shady got folks woke with a one-man rap battle against our POS . . . whoops, I mean POTUS? You fold laundry and do dishes and cook dinner and copy and collate and draft and format and file for days on end whilst singing . . . . \n(By the way, I learned how to add text to .gifs so now the entire interwebs are my oyster)In what may be the most fitting title in the history of titles, Ugly Girls is about exactly what it says - U.G.L.Y. white trash. Now before anyone gets all up-in-arms about me libeling these poor innocents, allow this househo to explain the term . . . . \nIt has nothing to do with residing in single or doublewides. I’m from Middle America – I know plenty of people who live or have lived in a trailer. No, Perry and Baby Girl (Dana before she decided to redefine herself and thug out) are morally bankrupt. They spend their free time jacking cars for joyrides before dumping them in the wee hours of the morn. Their friendship is one formed out of convenience rather than an actual liking of the other. And their most recent hobby????\nWhile the book spends time detailing not only each girl, but also their home lives, everything is a build up to when Perry and Baby Girl will meet Jamey, their internet friend. I’m the first of my friends to have read listened to this, so I’m not really sure how others will like it. I will reiterate that it is U.G.L.Y. If you are thinking there’s some sort of redemption arc for these children, you need to think again ‘cause it’s just not the case. That worked for me here. Some stories just can’t have a happy ending.I feel like it may have had a bigger impact if I would have read it too. Not only am I a total noob when it comes to audio books, but I can read a book this size in a few hours and really get wrapped up in it. Listening to it in 30-minute fits and starts increments over the course of a week probably didn’t do it any favors. As this was only my second audio experience, I obviously can’t compare narrators. That being said, Kathleen Early’s delivery just was a little off for me on this one.ORIGINAL \"REVIEW\"My second audio book!!!!"}, {"userName": "Ryan Bradford", "userReviewDate": "Jul 18, 2014", "userURL": "http://www.goodreads.com/user/show/1525100-ryan-bradford", "userReview": "A veiny, pulsing book. Lindsay Hunter knows that the heart is the ugliest organ. Few books feel this alive."}, {"userName": "Kevin", "userReviewDate": "Sep 20, 2014", "userURL": "http://www.goodreads.com/user/show/142320-kevin", "userReview": "This book is like a dangerous, thrilling joyride in a stolen car that gets bleak really fast and just keeps throwing mud in your face until the dark dirty end. Lindsay Hunter is the kind of fearless writer that doesn't give a shit about bestseller lists and happy ending. She revels in the sad undertow of her lost characters' lives and if you decide you can handle it, you'll revel in it too. This novel, Hunter's first, reminds me of vintage Harry Crews. It's so unapologetic that it becomes shake-your-head funny. And despite--or maybe because of--its blunt, hurried ending, you just gotta take some deep breaths when it's over and say, Daaaaaamn."}, {"userName": "Blair", "userReviewDate": "Mar 07, 2015", "userURL": "http://www.goodreads.com/user/show/272909-blair", "userReview": "I love Hunter's short stories; her style doesn't make the transition to novel length quite as successfully as I'd hoped. In Ugly Girls there are familiar elements of the author's work – the trailer parks and the Circle K, the grubbiness and dishonesty and queasy undertones of fucked-up families – but it's all dialled down, it isn't sprinkled with Cheeto dust and topped with whipped cream and crystal meth like it is in her flash fiction. Our ugly girls are Perry, pretty on the outside, rotten on the inside, and Baby Girl (formerly known as Dayna), willfully unattractive, and beneath that, a mess of insecurity and fear that's equal parts poignant and poison. There's also Perry's mother and stepdad – fading beauty Myra and soft-hearted prison guard Jim – and Jamey, whose entanglements with all four of the aforementioned form the engine of the plot. Since it lacked the colour I expect from Hunter, I wish there'd been as much to connect with emotionally here as there was in Claire Messud's The Burning Girl, with its not-dissimilar portrait of a small-town teen friendship collapsing beneath the trials of adolescence and family drama. There are some dynamite scenes, for sure. But by the end I was glad to be done with these characters.TinyLetter | Twitter | Instagram | Tumblr"}, {"userName": "Lori", "userReviewDate": "Nov 12, 2014", "userURL": "http://www.goodreads.com/user/show/369169-lori", "userReview": "Listened 11/17/14 - 11/24/143 Stars - Recommended to fans of edgy, straight up trailer trash fictionAudio: 8.3 hoursPublisher: FSGNarrator: Kathleen EarlyReleased: November 2014Typical teenage girls getting into typical teenage girl stuff, only so much worse. In Ugly Girls, the writing was always on the wall of what ultimately boils down to the story of two incredibly incompatible BFF's who test one another, pushing each another from bad decision to bad decision, eschewing the consequences in lieu of the thrill of the moment, until that one final moment. The moment neither can take back though they wish like hell they could. Though you don't want to, you'll find the edgy, hard-core trashiness of the girls intoxicating. Baby Girl has made herself physically ugly, shaving her head, outlining her lips in a grotesque clown's mouth, donning her brother's old clothes, while Perry's ugliness is more behavioral, emotional, using her physical loveliness as a weapon. Home's nothing to get all worked up over. Both live boring, dead-end lives. Baby Girl lives with her uncle and struggles with the fact that her once handsome and devilish older brother has been reduced to a drooling, temper-tantrum-throwing five-year-old as the result of a tragic bike accident. Perry, she lives with her drunk-as-a-skunk mother, who never seems to care where she is or what she's up to and her step-father, a saint of a man for being able to put up with the two of 'em.Oh god, how this book brought the memories of my teenage years rushing back to me. For all intents and purposes, I was a fairly \"good girl\". I'd sneak around with the boys in the middle of the night, sure, slipping out the bedroom window like Perry did, my father never the wiser. I skipped school and chilled at friends' houses listening to music and watching them get high. A group of us would hang out in the local trailer park - skin heads and hippies talking about the ways they were gonna change the world, gawking at the strung out pregnant girls shoving ice cream and pickles into their junkie mouths. Making nuisances of ourselves at the local coffee shop, batting our under-aged eyelashes at the cute college boys who worked here. Cruising the main streets by the beach with the windows down, radio blasting, the wind in our ears, like nothing could touch us, just passing the time till something better came along. Unlike us though, to get even with the world for the bum deck they were dealt, Perry and Baby Girl get off on having fun at other peoples expense, joyriding in the middle of the night, stealing cars, skipping school and cutting classes. They even end up in the dunk-tank overnight for attempting to steal stuff from the local pharmacy. But all that becomes child's play when the two of them discover that they're both being chatted up by the same guy - a guy who has a serious crush on Perry. When the girls finally agree to meet up and show him what's what, that's where the real trouble starts brewing. And once they start that ball rolling, there's no stopping its momentum. From slow start to awkward and abrupt ending, Lindsay's multi-charactered novel is all about the ugly. The ugliness inside of us, how feeling ugly makes you act ugly, like there's no other way to be. Ugly Girls is a hopeless, grimy, gritty sort of novel that leaves you feeling as unwashed and skanky as its characters do and makes you thankful that you aren't raising teenage girls. Though now I feel I have to go and warn my teenage son about girls like them."}, {"userName": "Leah", "userReviewDate": "May 21, 2014", "userURL": "http://www.goodreads.com/user/show/663928-leah", "userReview": "Ugly Girls lays everything out in the open from the very beginning. There's no glossing over or pretty little bows. Instead, this is a story with a stark portrayal of two unhappy and bitter girls. There's no one to root for, no team to cheer on. At times overwhelming, and without a doubt tough, Ugly Girls held me captive. Despite the gritty feeling I had when it was over I enjoyed this one immensely and I do recommend it - though have a sappy love story on deck. Trust me, you're going to need kitten videos by the time Ugly Girls is through with you.For the full review and more, head over to The Pretty Good Gatsby!"}, {"userName": "Kerry", "userReviewDate": "Nov 07, 2014", "userURL": "http://www.goodreads.com/user/show/4935386-kerry", "userReview": "I'm always impressed when an author creates a sense of dread that slowly builds through the whole book. 100% creepy and uncomfortable in the best way."}, {"userName": "Julie Zantopoulos", "userReviewDate": "Oct 25, 2017", "userURL": "http://www.goodreads.com/user/show/51094260-julie-zantopoulos", "userReview": "This was not the book for me. Not only did I not care about Perry or Dayna but the books layout bugged me. The characters were all awful and even Jim who was the most likable was meh. Trigger warnings for rape as well as some crappy representation of the disabled."}, {"userName": "Ivy", "userReviewDate": "Nov 22, 2014", "userURL": "http://www.goodreads.com/user/show/24131486-ivy", "userReview": "Hunter's collection, Don't Kiss Me, had be recommended to me ages ago, so when I saw this on the new shelf at my library, I picked it up. She's a strong writer -- that kind of modern seedy southern gothic that others like Gillian Flynn have brought into the spotlight, a trailer park freakshow, the protagonists two ugly girls from poor backgrounds. Unfortunately, the plot meanders, takes forever to pick up, and when it does, you're left with a really jarring ending that seems out of place and too sudden to even be called a \"twist\"."}, {"userName": "Leslie", "userReviewDate": "Nov 05, 2014", "userURL": "http://www.goodreads.com/user/show/14270260-leslie", "userReview": "I wanted to read a book about \"friends\" for a book club theme. This came up on my search (on Goodreads). What pained me most during my tedious reading experience is the idea that this may be labeled a YA book. I don't have kids but if I did I would not want my 14-year old daughter reading this book.The \"friendship\" between these two high school girls does not seem to be the focus. The whole milieu is one of boredom...poor white trash boredom. Kids cut school to steal cars and store goods they don't need. Mothers drink till they puke. Neighbors are disgustingly obese and emotionally coddle their adult children. Sex is ugly. Everything is ugly. There is no hope, no remorse...just a bleak landscape of damaged human beings.If there was a point to this misery, it was lost on me."}, {"userName": "Peter Landau", "userReviewDate": "Nov 05, 2014", "userURL": "http://www.goodreads.com/user/show/861304-peter-landau", "userReview": "Life sucks, and then you die. That’s a fair description of this book, which plots the dead-end course of its characters to their sordid conclusions or leaves them on the edge of the cliff. It’s not good and it’s going to get worse. You could say its a microcosm for society at large and you wouldn’t be too wrong. Fatalism is the ruling political party, not that this is an overtly political book. It’s more a traditional narrative, set in the fairly untraditional place of a trailer park, and a slice of the people’s lives who live there, which is cutting and sure to leave a mark."}, {"userName": "Matt", "userReviewDate": "Jun 16, 2014", "userURL": "http://www.goodreads.com/user/show/10709651-matt", "userReview": "Wow. So much to say about this novel. And I will when I digest it all. You should know by now what a masterful short story teller Lindsay Hunter is. This novel will show you all sorts of long-form narrative skills Hunter has in her arsenal. Coen Brothers in a trailer park (I'm also aware and not thinking of the more comedic Raising Arizona, ok? Which I know takes place in a trailer park, basically. AHHHHH). It's so great. So crazy."}, {"userName": "Marili", "userReviewDate": "Oct 29, 2014", "userURL": "http://www.goodreads.com/user/show/237594-marili", "userReview": "I feel like I need a shower after reading this book. It was just so grimy. If that is what the author was going for she did a real good job. It was just a rough book. Can't say that I really enjoyed it but I did find myself wanting to know what happened so I kept reading."}, {"userName": "Richard Thomas", "userReviewDate": "Nov 04, 2014", "userURL": "http://www.goodreads.com/user/show/3333483-richard-thomas", "userReview": "This review originally ran at Entropy Magazine.With a title like Ugly Girls, there is of course the expectation of darkness, depravity, and even physical disfigurement. In the hands of Lindsay Hunter there is so much more. If you’ve read her collections, Don’t Kiss Me or Daddy’s, then you know how she balances the humor with serious issues, the longing with loneliness—always seeking empathy, sympathy, for her lost characters, as in this case with two young girls.Perry is an attractive blonde who always gets the attention of men. Baby Girl is her opposite, shaving half her head, doing her best to push the world away. Both have baggage—Perry, a fading mother who is a drunk; and Baby Girl with an older brother, Charles, who was hurt in an accident, now labeled a “retard,” just one more reminder of how the world takes away all that they love. Add into that mix the trailer park dangers, including a predator named Jamey who has a sordid past, and you have a recipe for disaster.The people in this novel are spot on representations of poverty, whether in trailer parks or depressed parts of this country, especially the rural south. I know people that live in houses where the rug pulls back to reveal a dirt floor, shooting deer in order to survive, not for sport but out of necessity, picking pellets out of your dinner plate, heading to the bootlegger on Sunday to get your drink on.This isn’t just about everyone being rotten on the inside or showing that all of us have that the capability for ugliness. That’s there of course, but it’s more about desire and how those needs get us in trouble:“Sometimes Perry looked around and saw she was somewhere she didn’t want to be. Sometimes it was sudden and sometimes it was because she’d done shit to make it so. She could count on two fingers the number of times she was happy to end up in some backseat, but she couldn’t say that she hadn’t done everything she could to end up there. And like now. She hadn’t meant for it to turn out the way it did. She wanted to go to school, even. But here she was. And when Perry found herself somewhere she didn’t want to be, she rode it out until it was done, because it was the only thing to do.“The power in this story is not in the darkness, but in the raging against the dying of the light. It’s about when the characters can make a decision that doesn’t end up with a suspension, jail time, or worse. In every sentence of this book there is a chance, and even if it isn’t taken, even if they don’t all get out of this story in one piece, there was always that potential.Near the end of the book, Baby Girl gets shot, and she says it is a relief. She is tired of being the tough one, tired of standing up for her damaged brother, for carrying the weight. Perry finally goes to visit Travis, a boy she has a crush on, but she destroys any future with him by offering up all that she thinks she has to give. All of the adults want to be better and change things. They just don’t know how.With Ugly Girls, Lindsay Hunter is not going to wrap this all up in a bow with every situation being better by the end. No, this is the truth, the way things often go down—some making it out, some not; some learning their lesson, but most still wallowing in despair and failure. This haunting, touching, visceral story gets under your skin, and stays there. Whether we’re born monsters or made into them, born damaged or fractured over time, the humanity in us just wants to be loved, to belong, to have a quiet, safe place to rest our head at the end of the day. That need is impossible to snuff out—no matter how ugly it gets."}, {"userName": "Sian Lile-Pastore", "userReviewDate": "May 13, 2018", "userURL": "http://www.goodreads.com/user/show/3281164-sian-lile-pastore", "userReview": "This is kind of a typical story about two girls living in poverty in America, hanging out, drinking, sleeping with boys etc etc it also has a mom who drinks too much and a disabled brother thrown into the mix. While the story is one I've sort of read before, I really liked the characters here - complex, real, relatable, and a genuine, believable mix of doing bad stuff but not being bad people. Particularly liked/was interested in Jim, who seemed to want the best for his family and be a decent guy, but then ends up with outbursts of violence. I also liked how I thought it was going to be just about the two girls but ended up being about their families. A touch bleak I guess, but ended up going places I didn't expect."}, {"userName": "Jason Pettus", "userReviewDate": "Jan 23, 2015", "userURL": "http://www.goodreads.com/user/show/147289-jason-pettus", "userReview": "Lindsay is an acquaintance of mine, so to avoid conflict-of-interest issues I will not be doing a formal review of her new book at the CCLaP website; but I did at least want to mention here at Goodreads that I had a chance to read the book for the first time last week, and that I ended up really loving it. A literal example of the overused term \"story cycle,\" this is a novel in vignettes that hops from one character's viewpoint and actions to a related one's from chapter to chapter (so from a Juggalo teen girl to her frazzled alcoholic mom, then to the mom's prison-guard husband, etc). Written in a poetic style that pays very close attention to every single word being used, I would expect no less from a writer like Lindsay who first earned her chops in the unforgiving world of Chicago late-night short-story readings and open mics. Highly recommended to one and all, for whatever my biased opinion is worth."}, {"userName": "Angela", "userReviewDate": "Jan 16, 2015", "userURL": "http://www.goodreads.com/user/show/11682621-angela", "userReview": "I just ... didn't like it. The writing wasn't bad, but it read more like a student's work than a published author. None of the characters were particularly compelling, and the author seemed more interested in making the reader squirm than telling a story. The characters' vernacular was inconsistent and off-putting. Though I finished the book, it felt more like a chore than a particularly good read. I plucked this off of a \"must read\" list, and am now questioning the other selections on that list."}, {"userName": "Lauren", "userReviewDate": "Jan 06, 2015", "userURL": "http://www.goodreads.com/user/show/11521687-lauren", "userReview": "I will admit that this book has been one hell of a ride, but I was ultimately disappointed by the conclusion. I can usually appreciate open endings, but it was utterly ridiculous in just how much went unresolved. It's a decent read for suspense and keeping you on the edge of your seat, but that's all I can afford to reward this novel."}, {"userName": "Leesa", "userReviewDate": "Nov 09, 2014", "userURL": "http://www.goodreads.com/user/show/295031-leesa", "userReview": "This book is rough and not pretty. There is ugly and sadness and despair and anxiety. Hunter does all of it v. well. There are boys and girls and parents and normal and creepy and weird and gross things. Hunter does all of it v. well. Like a boss, even."}, {"userName": "Abbie", "userReviewDate": "Nov 21, 2014", "userURL": "http://www.goodreads.com/user/show/8835818-abbie", "userReview": "I have an affinity for strange books."}, {"userName": "Colleen", "userReviewDate": "Nov 13, 2014", "userURL": "http://www.goodreads.com/user/show/10487154-colleen", "userReview": "Funny and tragic, I felt right at home."}, {"userName": "Travis Mulhauser", "userReviewDate": "Jul 02, 2016", "userURL": "http://www.goodreads.com/user/show/46574024-travis-mulhauser", "userReview": "PERFECT CURE FOR THE SUMMER READ BLAHSI finished this a week ago and it has really stuck with me--I think it will continue to. The ending is surprising and transcendent and the writing throughout is vivid and clean. Ugly Girls is gritty, but never strains to be so. These are hard lives, fully-rendered, and there is not a single, false note--not a single self-indulgent sentence. This book can be crushingly sad. There is one sex scene that is so bleak and believable, so fully realized and human, that I literally had to force myself to finish it. And Baby Girl is as realized and rich a character as I have read in some time--her own confused and matter-of-fact thinking about her own sexuality and experiences are heartbreaking and endearing, and again, very, very real. This is an unflinching look at forgotten and ignored lives and it's written bravely and with remarkable empathy. I'm not doing stars anymore, but this would be a fiver."}, {"userName": "Jacob", "userReviewDate": "May 08, 2015", "userURL": "http://www.goodreads.com/user/show/2171060-jacob", "userReview": "Ugly Girls is a character study that reads like a tragic thriller. At first I was put off by the portrayals of depraved, impoverished people. It felt like exploitative. But I grew to appreciate how even the most minor characters were depicted as complete human beings. Well-rounded and believable in spite of the extreme circumstances. Almost every character remains sympathetic even as their actions grow more unforgivable. There's a lot of unpleasant scenes in the novel, including one towards the end that has to be one of the craziest things I've ever read in a book. It hurt but it was worth it."}, {"userName": "Linda Doyle", "userReviewDate": "Dec 27, 2014", "userURL": "http://www.goodreads.com/user/show/22455789-linda-doyle", "userReview": "Ugly Girls is an ugly book. By ugly, I mean that it is not a pretty, happy story. It's at once a character study as well as a study of physical beauty and its effects on self-image, and how we all judge one another by appearances. It is also a study of individuals trapped not only by their looks but by their needs and desires, so trapped that they can see no way out. It's often dismal reading, but the writing is concise, perceptive, and mesmerizing."}, {"userName": "Morgan", "userReviewDate": "Nov 28, 2014", "userURL": "http://www.goodreads.com/user/show/925540-morgan", "userReview": "Someone else called this a grimy read and that it definitely is, but in a very good way. This book does not leave you with the warm fuzzies and it runs your emotions through the gamut. However, you know all of these characters. You've gone to school with them, they're \"those\" neighbors, or the family who only stare at you while you walk by. It's a mixture of humor with profound sadness."}, {"userName": "V Nerd ", "userReviewDate": "Feb 04, 2015", "userURL": "http://www.goodreads.com/user/show/11412285-v-nerd", "userReview": "Not sure what to say about this book, it was depressing, the characters were all depressing, even the story was depressing.It is based around 2 friends Perry & \"Baby Girl\" and their tiny little life stealing cars and joy riding.Both Perry and Baby Girl start getting messages from \"Jamie\" and their friendship is put to the test."}, {"userName": "Jerry", "userReviewDate": "Nov 01, 2014", "userURL": "http://www.goodreads.com/user/show/12038973-jerry", "userReview": "This book is far from my taste. Good luck readers."}, {"userName": "K~Terror", "userReviewDate": "Nov 05, 2014", "userURL": "http://www.goodreads.com/user/show/4014136-k-terror", "userReview": "Review coming soon"}, {"userName": "Rachel", "userReviewDate": "Dec 27, 2014", "userURL": "http://www.goodreads.com/user/show/2499261-rachel", "userReview": "This book is brave, well-written, and so brutally sad in gut-deep places that while I can respect it, I don't think I ever want to read it again."}, {"userName": "Sameer", "userReviewDate": "Nov 02, 2014", "userURL": "http://www.goodreads.com/user/show/28271399-sameer", "userReview": "i think bad please let me start reading"}], "description": "Perry and Baby Girl are best friends, though you wouldn’t know it if you met them. Their friendship is woven from the threads of never-ending dares and power struggles, their loyalty fierce but incredibly fraught.They spend their nights sneaking out of their trailers, stealing cars for joyrides, and doing all they can to appear hard to the outside world. With all their energy focused on deceiving themselves and the people around them, they don’t know that real danger lurks: Jamey, an alleged high school student from a nearby town, has been pining after Perry from behind the computer screen in his mother’s trailer for some time now, following Perry and Baby Girl’s every move — on Facebook, via instant messaging and text, and, unbeknownst to the girls, in person. When Perry and Baby Girl finally agree to meet Jamey face-to-face, they quickly realize he’s far from the shy high school boy they thought he was, and they’ll do whatever is necessary to protect themselves.", "title": "Ugly Girls", "url": "http://www.goodreads.com/book/show/24675966-ugly-girls", "average": 3.2, "cover": "https://images.gr-assets.com/books/1422124465l/24675966.jpg", "reviews": 279, "authors": [{"url": "https://www.goodreads.com/author/show/3369554.Lindsay_Hunter", "name": "Lindsay Hunter"}], "type": ["Fiction", "Contemporary", "Young Adult"], "outlinks": ["http://www.goodreads.com/book/show/24675966-ugly-girls", "http://www.goodreads.com/book/show/20613663-ugly-girls", "http://www.goodreads.com/book/show/31450596-eat-only-when-you-re-hungry", "http://www.goodreads.com/book/show/16059557-don-t-kiss-me", "http://www.goodreads.com/book/show/7715816-daddy-s", "http://www.goodreads.com/book/show/19421772-three-things-you-should-know-about-peggy-paula", "http://www.goodreads.com/book/show/13552088-kitty", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/26583370-life-and-other-near-death-experiences", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/20552595-how-i-became-a-famous-novelist", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/36004055-not-perfect"]}