{"ratings": 167626, "userreviews": [{"userName": "Stephen", "userReviewDate": "Mar 05, 2010", "userURL": "http://www.goodreads.com/user/show/1413439-stephen", "userReview": "ONE READER'S CONFUSION ABOUT WHY \"UNCLE TOM\" MEANS ANYTHING BUT HERO3.0 stars. First, I am glad I have finally read this book given its historical significance and the very positive impact that it had on American history. That said, from a literary perspective, I didn't find this book to be particularly well written and am doubtful of whether it would be much remembered or considered a \"classic\" but for the aforementioned historical significance and the creation of the character of Uncle Tom (more on that below). The prose is not horrible, but neither is it exceptional. It's just okay. Since I assume everyone is familiar with the substance and background of the book I will not summarize it here. Others have done a much bettermjob of it. However, I do want to share an observation about the main character, Uncle Tom, that struck me pretty hard. Prior to reading this book, if you would have asked me about the character of Uncle Tom, I would have said that he was a character portrayed as a \"weak willed\" slave who did everything he could to please his white master no matter what abuses were heaped upon him. This opinion, wrong as I now think it is, would have been based in large part on the derogatory nature of the term \"Uncle Tom\" in the African American community as someone who has \"sold out\" their heritage and beliefs in order to be successful. After reading the book, I don't think I can adequately express how STRONGLY I disagree with that characterization. I would place Uncle Tom among the pantheon of truly HEROIC figures in American literature. Granted, Tom was no Hollywood square-jaw who armored up and went Braveheart on the slave holders slaughtering them by the bushel. However, he was most definitely a HERO in the mold of \"Gandhi\" who NEVER ONCE...NEVER ONCE compromised his principals and belief in \"non violence\" and Tom CHANGED those around him (both white and black) for the better. Tom's non violence came not from fear or cowardice, but from his deeply held Christian faith and his belief that he would rather suffer unjustly (as Christ did) than raise a hand to another. Whether you agree with that philosophy or not, it is beyond debate that to accept hardship rather than compromise your inner compass is called INTEGRITY...it's called COURAGE. In one very memorable part of the book, Tom is ordered by his sadistic slave owner to whip a female slave. Tom refuses and is savagely beaten. Thereafter, Tom is repeatedly beaten because he continues to refuse to engage in conduct he finds reprehensible. Despite this repeated abuse, Tom NEVER, NEVER backs down or compromises on his beliefs. In fact, the book goes on to describe the slave owner's realization that while he may own Tom's body, he could never acquire his soul. FOLKS, FOR ME, THAT IS A HERO!!! How many people would subject themselves to that kind of abuse rather than rationalize their principals. Reading that portion of the book, I was struck by the similarities between that scene and a speech given by Gandhi in the movie with Ben Kingsley (which I loved). While speaking to a group of South African's about the need for \"non violent\" protest Gandhi says (I am paraphrasing somewhat): \n...This is a cause for which I am prepared to fight, but my friends there is no cause for which I am prepared to kill...However, fear not for we can not lose...They can beat my body, break my bones, even kill me...then they will have my dead body, NOT MY OBEDIENCE!!!...\n I found Tom's struggle to be very similar and the character of Tom to be VERY HEROIC. For that reason alone, I bumped this up to 3 stars and HIGHLY RECOMMEND this book."}, {"userName": "Laura", "userReviewDate": "Jan 11, 2008", "userURL": "http://www.goodreads.com/user/show/771620-laura", "userReview": "Wow. I wish this was still required reading in schools. Can you imagine: a book that was credited by President Lincoln with bringing about the Civil War, and is known to have so affected the hearts of readers that it changed their opinions of slavery is hardly read in the country whose face it changed?"}, {"userName": "Tammy  King Carlton", "userReviewDate": "Aug 12, 2008", "userURL": "http://www.goodreads.com/user/show/834133-tammy-king-carlton", "userReview": "This book is one of the most moving, provocative pieces of literature I've ever read, and it's the first time that I can recall being moved to tears from a book. As long as I live, I will never be able to remove from my mind the vision of Eliza, panicked and frenzied, in the dead of the night with her baby boy in her arms, leaping across the frozen ice of the Ohio river to escape the trader her baby had been sold to. And if anyone wants to read a profound and well written narrative for the view of a Black Slave, look to George's monologue on page 127-128, where he is at the Inn with Mr. Wilson, disguised as a white upperclass gentlemen, and explaining to Mr. Wilson how he feels about his country.I was involved in the book up to that point, but after that, this book owned me. This should be required reading of every American Citizen, and it's in my top five of the most important books I have ever read. For whatever the cause of the American people, it all comes down to \"When in the course of human events...\"."}, {"userName": "Lisa", "userReviewDate": "Jun 25, 2014", "userURL": "http://www.goodreads.com/user/show/32532774-lisa", "userReview": "\"Talk of the abuses of slavery! Humbug! The thing itself is the essence of all abuse!\"I remembered this quote from Uncle Tom's Cabin all of a sudden when I accidentally paraphrased it in a discussion on gun control at school. Some issues can't be solved by half-measures. They have to be abolished.There are books that shape who you are. I remember when I first read Uncle Tom's Cabin as a young girl. Before that, I had only a vague idea of slavery in America as a historical phase, something I imagined as an evil that was no more. With this novel, I entered the world of rage. Literature has the power to engage where statistics leave you cold, it has the power to make you feel what other people feel, and to see what abstract terms mean in real, everyday life.Decades later, teaching slave trade and abolitionist movements in Humanities classes, I still felt the anger, the sorrow, the shame. And I realised that literature does that to you - it gives you a social conscience if you are brave enough to compare notes and check your privileges. The horrors of white supremacy can hardly be better told than in this tale of love and suffering and rage, so shocking to read as a young adult, and yet so necessary. I shudder when I think of our current political climate of hostility and intolerance towards any human beings that are distinctly different from our own tribe. And I feel both rage and sorrow as I know there are far too few adolescents today who are willing to put in the time and effort to read about historical brutality and injustice. I shudder when I think that Anne Frank's diary is considered boring by my students, too slow and lacking \"action\" (read: violence). Where are we heading if we don't listen to the literary voices of those who experienced past horrors? Where are we headed if we let profit and individual advantage stand above ethical behaviour and compassionate humanity? Where are we headed if we don't think our rights apply to others as well?Make people desperate, and they won't be afraid to fight. Take away too much and they have nothing to lose, and nothing to fear. When it comes to human rights, there can be no grey zones, there can be no two class system, no discrimination. There can be no exemptions. We are all equally entitled to a life in freedom and dignity. Wherever we do not guarantee that, there will be rage. Beware of the signs in mainstream society:\"The country is almost ruined with pious white people: such pious politicians as we have just before elections, such pious goings on in all departments of church and state, that a fellow does not know who'll cheat him next.\"Let's not be cheated. Let's look through the pious surface and see the egocentric hypocrites in their entitlement for what they are - instigators of violence. Let's do what is right by humankind rather than what is personally enriching or convenient.Uncle Tom's Cabin taught me that. And I have been in a reading rage ever since!"}, {"userName": "James", "userReviewDate": "Aug 07, 2016", "userURL": "http://www.goodreads.com/user/show/7365405-james", "userReview": "Book Review\n\n4 out of 5 stars to Uncle Tom's Cabin, written in 1852 by Harriet Beecher Stowe. For some reason, we didn't read this book in high school; possibly an excerpt or two was thrown in front of us, but I honestly don't really remember reading it until freshman year of college. Prior to reading it, the silly and uneducated man I was thought Ms. Stowe was an African-American telling the story about slavery in America, not all that different from The Underground Railroad stories. Please forgive me, as I had difficulty reading books that showed the harsh slices of life and cruelties people suffered. It just doesn't cross my mind that I could ever treat someone differently because of what they look like or where they came from... and the immature part of me avoided reading about those who did. But it's important to read these types of books as sometimes it is the only way to open another's eyes.Then it was listed on our syllabus to read in our spring semester for an English course. And I dove in since it was required. As I got into it, I realized how great the book actually was. And you know what, that's not the story at all. Ms. Stowe came from a Puritanical and religious family. She was an abolitionist. She wanted to fix the situation. And this book was one way she attempted to do so, by showing how any Christian could not believe in slavery. Though some of her ideas were a little too vague, and at times, she may even cross the line by doing a few of the things she tells people not to do.... the book really shines a necessary light on what people were thinking at the time. I feel like we might need to read this book again as a country... to figure out what the hell we're doing going back 150 years in time. But I don't get political, so enough of that.With this book, you need to have some understanding of society, religion and culture in America's history. I wouldn't take it on without have a decent background in knowing how things came together from 1776 to 1856. Those 80 years were very strong but also very disparate... two countries were forming, not one in America. Having some knowledge of Puritan life is helpful too. Perhaps reading The Scarlet Letter first might give you some background. Everyone needs to read this book just to see what was going on in some folks' minds at this time. It may not change your views on the entire situation, but it will give you more to think about when it comes to religion's place in government, society and daily life. And I mean that as a philosophical and sociological discussion, not placing blame or positives and negatives on different groups of people. It's just the kind of book to get you talking about something which needed to be radically changed and fixed.\n\nAbout Me\n\nFor those new to me or my reviews... here's the scoop: I read A LOT. I write A LOT. And now I blog A LOT. First the book review goes on Goodreads, and then I send it on over to my WordPress blog at https://thisismytruthnow.com, where you'll also find TV & Film reviews, the revealing and introspective 365 Daily Challenge and lots of blogging about places I've visited all over the world. And you can find all my social media profiles to get the details on the who/what/when/where and my pictures. Leave a comment and let me know what you think. Vote in the poll and ratings. Thanks for stopping by."}, {"userName": "J Cravens", "userReviewDate": "Dec 05, 2008", "userURL": "http://www.goodreads.com/user/show/1776905-j-cravens", "userReview": "The main character of Uncle Tom's Cabin, and at least one of the minor characters, are frequently mocked by modern black activists, rappers and comedians. Therefore, when I began reading this novel, originally published in 1852, I was expecting a woefully-outdated story with painful, outrageous stereotypes and archaic language, and had prepared myself for a real struggle to navigate through it in order to see how this book mobilized people in the USA against slavery.The story, its delivery and its characters turned out to be nothing like they have been portrayed to me over the years. Nothing. And more importantly, it is still a powerful call for justice and equality more than 150 years later.It was a difficult read at first, but after the first 100 pages or so, I was hooked.Harriet Beecher Stowe paints Tom not as subservient to white men -- or any men -- but as absolutely defiant, a man who serves only one master: Jesus Christ. Uncle Tom's defiance is in stark contrast to everything I've ever heard about him. Stowe never, ever implies in any way that slaves should work only to please their earth-bound masters and never pursue freedom or personal dignity -- contrary to what I've always heard. In addition to Tom, there's George, a representation of the intelligence and potential Stowe obviously felt every African American was capable. Stowe wasn't saying that Tom's way of defiance -- and his not pursuing escape -- was a better path than George's, who risks everything to escape with his family to Canada. Instead, she presents the myriad of ways people -- HUMANS -- react to and survive enslavement. Topsy isn't presented as I thought she would be -- a silly comic relief -- but as a girl who has never known anything but pain from and the contempt of others, and becomes whole only when she's offered full, unconditional love. There are NO one-dimensional portraits in the book -- the characters, white and black, portray a massive variety of values, philosophies, and thoughts of the time.I was struck not only by how full, rich and diverse the characters were, but also, Stowe's condemnation not only of slavery itself, but of the North, for not wanting freed blacks to live among them, to work in their homes or live in their neighborhoods or attend their schools. She also condemns merciful slave owners, painting them just as bad as ruthless Is the book racist? By today's standards, yes, but no more than it's also sexist. It's dated, no question: the author will very occassionally say something about blacks -- or women -- that make me cringe. The slaves and freed men presented in the book are no more benign, lazy or lacking in values than most of the white people portrayed. But I challenge anyone who has READ the book to say that the stereotypes engrained into our psyche by various contemporary commentators were ever envisioned by the author. After reading the entry about the book on Wikipedia, I've surmised that the stereotypes we hear about regarding the story are actually from the widely-seen and woefully inaccurate dramatizations of the book. And her text drips with a sarcasm, often addressed directly to the reader, that is jarring at times -- this woman hated slavery with every molecule of her body, and she presents, and skewers, every argument of the time in support of it."}, {"userName": "Brooke", "userReviewDate": "Apr 25, 2008", "userURL": "http://www.goodreads.com/user/show/1115263-brooke", "userReview": "I know, I know, it's a monumental artifact in American history, and the catalyst to the spread of the abolitionist movement to the masses. I totally appreciate the historical and cultural significance of this book. No question.But seriously, y'all? This book SUCKS as a piece of literature. For real. I just can't get past how bad the writing is--the reason why I'm such a voracious reader is simple: I read books for aesthetic pleasure. That's it. I really don't give a shit about anything beyond entertainment when I read. If I can be enlightened, challenged, whatever at the same time? Fantastic. But if your writing sucks, I frankly don't want to waste my time with your crappy-ass book. And Harriet Beecher Stowe exceeded my limit for melodramatic turns of phrase by page 3. Preferencing the book itself over what the book represents is an unpopular view in a literary culture obsessed with shattering the canon (ironic, considering that UTC is as canonical as it gets in American literature), but that's why I'm in the corporate world and not writing my disseration right now. Hence, I'm typing this review instead of beating my head against the keyboard while trying to make a connection between Heidegger's \"question of being\" and some random 17th century poem my committee chair discovered while on sabbatical in Bolivia. I win."}, {"userName": "Amira Mahmoud", "userReviewDate": "Mar 07, 2017", "userURL": "http://www.goodreads.com/user/show/23833335-amira-mahmoud", "userReview": "قراء الروايات دومًا ما يجدون أنفسهم في زاوية يضطرون من خلالها الدفاع دومًا عن تلك الرغبة والعادة في قراءتها والاستمتاع بها، ورغم أن التفضيل الشخصي وضرورة الاختيار بحرية والمتعة التي يحصل عليها الفرد من قراءة الرواية هي جميعها أسباب لا تمنع قراء الكُتب من النظر بازدراء لقراء الروايات (أو حتى من تندمج قراءاتهم بين الروايات والكُتب مثليّ) فإن السبب الرئيسي والأقوى في رأيي هو ما تحدثه الرواية من أثر في نفس القارئ حتى وإن لم تكن رواية جيدة بالإجماع فيكفي أنها أثرت في حياة ووعي قارئ ما وفي نظرته للأشياء من حوله وهذا هو الفارق بين قراءة رواية وقراءة كتاب في علم النفس أو علم الاجتماع فبدلاً من أن تصل الفكرة بأكاديمية في شكل معلوماتي صرف تصل بإنسانية أكبر ترسخها داخل نفس قارئها بشكل أعمق.وإذا أخذنا في الاعتبار حقيقة أن مثل هذه الرواية أثرت لا في فرد/قارئ واحد فقط بل في حياة فئة ما، وأن هذه الفئة هي فئة أقلية مضطهدة تعيش في مكانة أقل من مكانة الحيوانات حينها تصبح هذه الرواية هي أحدى أهم الأمثلة التي يجب أن نذكرها حين يحاول أحدهم التقليل من الشأن الرواية (والأدب بشكل عام) والأثر الذي يمكن له أن يحدثه في حياة البشربعض الأعمال تكون عصية على النقد والتقييم من الناحية التاريخية، من الصدى الذي تتركه في بيئتها أثناء صدورها وإذا أخذنا في الاعتبار حقيقة أن مثل هذه الرواية -والتي يجب أن ألح على أن كاتبتها امرأة- أقول أنها كانت سببًا في قيام الحرب الأهلية الأمريكية وتحرير العبيد حينها يُصبح مثل هذا العمل عصيّ على النقد نهايًا هذا فضلاً عن أنه لا يجب أن يخضع للتقييم، لكنني بدأتها كقارئ من مكان مختلف وبيئة مختلفة بل وزمان آخر تمامًا وعامل الزمن خاصة هو أحد أهم الأسباب التي تجعلني رغم احترامي لكثير من الكُتاب وقضيتهم وتأثير أعمالهم حين اقرأها أتعرض لها بالنقد وإذا حكمت على هذه الرواية من الناحية الأدبية سأقول أنها ضعيفة نوعًا ماعلى الرغم من كثرة القصص التي تصف مأساة العبيد؛ بيعهم وشرائهم وكأنهم قطع أثاث، فصلهم عن ذويهم وكأنهم حيوانات بلا شعور بآلالام الفقد إلا أن تلك الكثرة لم تساهم في إيصال المأساة إلى نفس القارئ بشكل أعمق على العكس كنت أشعر أن القصص مفككة وأن الرابط بينهم ضعيف للغاية لا سيما حين ابتدأت القصة بحياة شخصين ثم انحرفت للتحدث عن أشخاص آخرين لتربطهم جميعًا بنهاية مفاجئة أشبه بنهايات الأفلام العربية السعيدة ولمّ الشمل، هنا شعرت أن الحبكة أيضًا ضعيفة وأن ما اقرأه هو شذرات لمخطوطة روائية ليس إلا.رغم كل شيء، تبقى أهمية العمل ويبقى الأثرتمّت"}, {"userName": "Beverly", "userReviewDate": "Dec 17, 2017", "userURL": "http://www.goodreads.com/user/show/68708752-beverly", "userReview": "Entertainment Weekly has an interview they do in which they ask famous authors, in this case Ursula K. le Guin, several questions in a one page format about who their favorite writers are, etc. In this article, le Guin said that she liked to reread Uncle Tom's Cabin. She said many are astonished at this preference and act as if she was extolling a racist screed. Having never read it and liking Ursula K. le Guin, I decided to try it. A polemic on the heinous, Uncle Tom's Cabinet is written in such a matter-of-fact way that it ascends to greatness. I almost felt like I was reading an adventure story and couldn't wait until I found out what happened to Eva, St. Clare, George and Eliza, Cassie and Emelline and of course Uncle Tom. Harriet Beecher Stowe took real incidents and added them to the story for verisimilitude. It also reminded me of my beloved dystopian novels. In many of these, horrible things have become common place, such as children fighting to compete for food. I couldn't fathom that we in the U.S. used to sell people and own them and torture and kill them or have sex with them as we saw fit. The only reason I would not give it 5 stars is because of the extreme goodness of Uncle Tom in the midst of troubles that would destroy, even Job."}, {"userName": "Ahmad Sharabiani", "userReviewDate": "Apr 28, 2008", "userURL": "http://www.goodreads.com/user/show/614778-ahmad-sharabiani", "userReview": "893.\tUncle Tom’s cabin; or, life among the lowly, Harriet Beecher StoweUncle Tom's Cabin; or, Life Among the Lowly, is an anti-slavery novel by American author Harriet Beecher Stowe. Published in 1852, the novel \"helped lay the groundwork for the Civil War\", according to Will Kaufman. Stowe, a Connecticut-born teacher at the Hartford Female Seminary and an active abolitionist, featured the character of Uncle Tom, a long-suffering black slave around whom the stories of other characters revolve. The sentimental novel depicts the reality of slavery while also asserting that Christian love can overcome something as destructive as enslavement of fellow human beings. ...کلبه عمو توم (تم) - هریت بیچر استو (امیرکبیر) ادبیات؛ تاریخ نخستین خوانش: ماه فوریه سال 1982 میلادیعنوان: کلبه عمو تم؛ نویسنده: هریت بیچر استو؛ مترجم: حسین کیهانی؛ تهران، ابراهیم رمضانی، 1315؛ در 164 ص؛ عنوان: کلبه عمو تم؛ نویسنده: هریت بیچر استو؛ مترجم: منیر اصفیاء (جزنی) (مهران)؛ تهران، امیرکبیر، 1335؛ در هشت و 533 ص؛ چاپ ششم 1344؛ چاپ هشتم 1346؛ چاپ سیزدهم 1357؛کلبه عمو تام نخست به صورت پاورقی در یکی از روزنامه‌ ها چاپ شد و وقتی به صورت کتاب شد نه تنها در آمریکا بلکه در تمام کشورهای جهان نیز میلیون‌ها نسخه از آن به فروش رفت، و تا سالها نمایش‌هایی بر اساس آن بر صحنه تئاترهای جهان اجرا شد. دیری نگذشت که در آمریکا خانم استو از یکسو به شخصیتی بسیار محبوب و از سوی دیگر به چهره‌ ای بسیار منفور مبدل شد. حتی در گرماگرم جنگ داخلی آمریکا آبراهام لینکلن رئیس جمهور وقت آمریکا در ملاقاتی به او گفت: «پس شما همان خانم کوچکی هستید که باعث جنگی بزرگ (جنگ داخلی آمریکا) شد». به دلیل اینکه جنگ داخلی نه 9 سال بعد از انتشار کتاب آغاز شد عده‌ ای انتشار این رمان را جنجالی‌ ترین حادثه در تاریخ رمان‌ نویسی می‌دانند. تولستوی پس از خواندن این کتاب در ستایش آن گفت: «این رمان یکی از بزرگترین فراورده‌ های ذهن بشر است.»؛ ... ا. شربیانی"}, {"userName": "Alex", "userReviewDate": "May 20, 2015", "userURL": "http://www.goodreads.com/user/show/3144945-alex", "userReview": "It's not really this book's fault that it sucks. Harriet Beecher Stowe's heart was in the right place: she aimed to expose the evils of slavery. Abraham Lincoln is said to have called her the “little woman who wrote the book that made this great war.” That's patronizing and it didn't, but it didn't hurt either.But it hasn't aged well. According to this book, here'sWhat Black People Are Like- \"The African, naturally patient, timid and unenterprising\"- \"The negro is naturally more impressible to religious sentiment than the white\"- \"The negro, it must be remembered, is an exotic of the most gorgeous and superb countries of this world, and he has, deep in his heart, a passion for all that is splendid, rich, and fanciful; a passion which, rudely indulged by an untrained taste, draws on them the ridicule of the colder and more correct white race.\"I put more more quotes of this type in the comments below, if you're really interested. This comes across as racist, because it totally is, and here's the thing: there were other people who wrote about slavery and did not make statements like these. They were black people. Stowe's source for Uncle Tom, in fact, is Josiah Henson, whose book you can read for free instead of this. I know things were different back then, but I also don't think we need to over-complicate our historical relativism. If someone were to ask me what I'm reading and I were to feel compelled to explain myself - \"I know it's racist, I'm not reading it because I like it...\" then my conversation with the book as literature is condescending, and it's outlived its usefulness, and that's okay. It's okay if it did some good once and it's run out of good now. It's okay if it goes out of style. We don't have to, like, burn all the copies. But I do feel like when we have the opportunity to hear about oppression from the oppressed themselves, then that's better.(It's true that slave narratives were written for white audiences, with specific goals and formulae, and often dictated to white ghost writers, so this isn't totally straight-forward. But slave narratives are anyway more authentic than Uncle Tom, I guess.)Anyway, back to the actual book: Uncle Tom is frankly an Uncle Tom, but to Stowe's credit she also supplies lots of other perspectives. George and his Quaker allies have a \"By any means necessary\" approach to slavery, and Stowe goes out of her way to get us to root for their violent tactics. I wasn't expecting that, and I dug it.Overall, the book is badly sentimental. Y'know, it's easy to make you have feels by describing, like, a woman whose children are stolen from her and then she gets raped. You don't have to be a good writer to make a scenario like that powerful. Stowe is an okay writer, but she pours on the pathos; she can't shut up about \"isn't this awful?!\" and I didn't really need it underlined. There are a couple people here who take like fifty pages to finish giving deathbed speeches about Jesus and you're like good lord, this makes Dickens seem aloof. It's annoying. So look, this might be of interest to someone researching how white abolitionists felt back in the day; but it's not particularly good literature, and its ideas are woeful, and that doesn't leave much."}, {"userName": "Corinne", "userReviewDate": "Feb 20, 2018", "userURL": "http://www.goodreads.com/user/show/38579677-corinne", "userReview": "For me, the story is a sharp contrast between freedom obtained by George, Eliza, and their children in Canada versus what happens to Uncle Tom in bondage, i.e, his painful death, but in dignity. The two parallel stories increase the beauties of each other, enhanced further by Aunt Chloe's desperate efforts to save Tom till the end, and by the poetic justice delivered to the brutal slave owner at the end. Add to that Stowe's understanding the heart of a mother: the more defective the child is, the more the mother loves. It's so true!Via the vivid details surrounding separation of families imposed by slavery, also contrasted by acts of bravery from some whites along the way, Stowe has powerfully painted their depths of faith, without appearing preachy. And the sharp opposition between St Clare and his wife (Marie)! I can see such a snobbish, lazy, fastidious 'malade imaginaire' like Marie right here in France, even today. The death of Little Eva is a real heartbreaker, though.I shall return to read this novel more than once."}, {"userName": "Apatt", "userReviewDate": "Apr 17, 2016", "userURL": "http://www.goodreads.com/user/show/2457095-apatt", "userReview": "[He literally stands up for his fellow slaves until his last breath. (hide spoiler)]"}, {"userName": "K.D. Absolutely", "userReviewDate": "Aug 01, 2009", "userURL": "http://www.goodreads.com/user/show/2156200-k-d-absolutely", "userReview": "I decided to pick this 1852 book up because this was said to be the inspiration of our national hero, José Rizal (1861-1896) for writing his masterpiece novel, Noli Me Tangere (Touch Me Not) (published in 1887). I thought I would like to compare this with Noli to see how original or unoriginal Rizal was.My verdict: Noli and Uncle Tom's Cabin are totally different from each other except for one thing and that is the lowly's fight for freedom from slavery. Lowly in Noli are the indios or native Filipinos. Lowly in Uncle Tom's Cabin are the black African slaves.The story is about Uncle Tom who is a principled and dutiful slave, a husband to Aunt Chloe. At the start of the story, his cabin, when he was still with the Shelby's, was where the black slaves gathered to pray and sing songs of praise to the Good Lord. Some say that this book is just a big glorified religious propaganda and the characters are nothing but caricatures. I do not agree to both of these. Maybe because I just read Noli and I was able to relate the sufferings of the illiterate Filipinos with the black pre-Civil War slaves as they only have God to cling unto in their desperation to have freedom. Many of the characters cannot be caricatures because they practically leaped out from the pages to my brain while reading. Some of them transformed in the course of the novel particularly Ophelia who is an abolitionist but secretly despises the blacks. I think most of us can relate to her character because it is sometimes easy to say that we condone discrimination but deep inside we harbor prejudices against a certain race, religion, gender, age and even sexual preference. It is only when Ophelia is asked by St. Claire to take care of Topsy that Ophelia develops a caring attitude towards blacks. With her character, Stowe made us all realize that sometimes, unknowingly, we harbor some bias against some people and it is only when we reach out to them that we get to have a good appreciation of who they are.The book is surprisingly quite easy to read. There are many poignant scenes but the ones that got permanently etched in my mind are: first, the scene when Eliza and her small son are crossing the river and the son who is hungry, thirsty and sleepy keeps himself awake because he fears that his momma will give him to a man if he falls asleep. The scene is short but I had to pause and close the book because I was so sad; and second, the scene when the wicked sex-maniac slaveowner Leglee is asking Uncle Tom to whip another black slave. Tom refuses. Insulted, Leglee whips Tom until Tom is almost dead. This scene broke my heart that I have to stop reading this book in a day or two because it was too sad I had to start reading Dag Hammarskjold and ask where was God when the black African slaves were treated as commodities in America. Truly a sad phase in that great nation's history.Now I understand how our national hero Jose Rizal was moved by this novel that he decided to sit down and write his own novel. Our Rizal wrote about the sad flight of his own people. If Harriet Beecher Stowe was this little woman who started the Civil War, Jose Rizal (5'2\") as this little man who started the Philippine Revolution in 1896 against the Spanish colonizers.Two short people. But two great tall books. Books that launched and propelled races to take arms and fight for what they believed was right.Bravo to all the shorties of this world!"}, {"userName": "Marie", "userReviewDate": "Mar 14, 2009", "userURL": "http://www.goodreads.com/user/show/728995-marie", "userReview": "Wow. An important book, surely, historically, and I found the forward more interesting than most as it argued about the book's place in American Literature. (Though, sadly, like most academic forwards, rife with spoilers. Lady! I'm reading this for the first time, don't tell me who dies and who gets married and who goes to Africa!)Stowe's strength is in her more merry passages, particularly when she can put her bible down for five seconds and turn a wry, Twain-like eye on popular culture. Sadly, these passages are too few and far between, drowning under gallons of preaching and an over-sentimentalized series of accounts that rob the actions of their innate horror. She did her homework, and the accounts of atrocities of slavery jive with those I've read in Frederick Douglas' autobiography, but I would recommend Douglas' work over hers twenty-to-one. It is more compassionate, more rooted in reality, and lest damn preachy.Also, there are a few very very offensive passages that just made me gasp and want to look away..."}, {"userName": "Jessica Reese", "userReviewDate": "Aug 28, 2007", "userURL": "http://www.goodreads.com/user/show/315331-jessica-reese", "userReview": "O.k. so I was supposed to read this in my high school a.p. class. I think my friend and I may even have taken turns reading parts of it, but it never really happened. But, this last semester I actually read it twice, because that's what my Amer. Romanticism professor suggested we do, and, to be honest I was kind of scared of him for a while...But, here's the deal. It really isn't a great book. It started out as bed time tales for her kids, progressed to installments in a magazine, and then eventually became a famously historical book. That having been said, here are the things I find interesting.1) The idea of stay-at-home feminism. Notice that Stowe, while she empowers women in many ways that were uncommon among her contemporaries she still places women within \"their\" sphere. And, it is the women who are successful within their sphere (caring for the children and husband, making sure the kitchen is neat and orderly (even if they don't actually do the cooking), having a well run household, etc.)that are \"good\". These are the women who succed in life. The other women, well, they tend to be the characters we hate.  **Also interesting... the female characters in this book have an uncanny resemblance to the female characters in Toni Morrison's Beloved. I could write a lot about this (I did a paper on it), but I would love to know if anybody else sees the same similarities I do. (Besides this one crazy woman who wrote an article saying Beloved was a rewrite of Uncle Tom's Cabin... I really didn't buy her argument at all, and I would hate to think she's the only one who agrees with me...) 2) Uncle Tom as Christ. 3) The unrelentingly Christian aspect of the novel. Either you're Christian and good or not Christian and bad. Or, you are struggling between the two, and trying to attain the title of Christian. Oh, and that the best Christians are really the slaves, because they are more \"childlike\" and vulnerable therefore closer to Jesus."}, {"userName": "Amanda", "userReviewDate": "Jun 07, 2008", "userURL": "http://www.goodreads.com/user/show/1219253-amanda", "userReview": "Important? Yes. Good? No."}, {"userName": "Ann Marie", "userReviewDate": "Jul 06, 2008", "userURL": "http://www.goodreads.com/user/show/1020555-ann-marie", "userReview": "Life-changing book. This was a great read-aloud with my kids. We finished it on Easter Sunday - very appropriate."}, {"userName": "Arianne Thompson", "userReviewDate": "May 04, 2012", "userURL": "http://www.goodreads.com/user/show/7689561-arianne-thompson", "userReview": "I think the saddest thing about this book is that everybody remembers Uncle Tom, even if only as a particularly ugly byword, but nobody remembers George Harris. \"I am George Harris. A Mr. Harris, of Kentucky, did call me his property. But now I'm a free man, standing on God's free soil; and my wife and my child I claim as mine... You can come up, if you like, but the first one of you that comes within the range of our bullets is a dead man.\"He is a hell of a character, and one of the few here that could exit the pages of this book and stand his own ground in the pages of another one. That's the difficulty with Uncle Tom's Cabin, at least for me: if you judge it by our modern sensibilities about what a novel should be and do, it doesn't hold up at all. The characters are mostly one- or two-dimensional figures, often exaggerated past all believability, who are sketched out to serve an obvious purpose. Harriet Beecher Stowe wrote every page of this book to rail against slavery, and although she skewers her subject from a hundred different ways and angles, that is really her only aim. For us in the 21st century, for whom slavery has melted away from all but the darkest corners of the world, this is pretty much preaching to the choir. Let me tell you why it's still an amazing book.You might know that it was written in 1852 - a time in which the issue of slavery was boiling over in Congress and at dinner tables across the nation, but still almost ten years before the breakup of the United States and the start of the Civil War. In 2012, it is still FRIGHTENING to read this book, to listen to the author decry slavery by every means imaginable - from sarcastic narrative whispers to naked, screaming invective - and to almost hear the desperation in her voice as she throws herself bodily against this massive, monstrous evil, which for her has no imaginable end. In the last pages, she talks with faint hope about Liberia, where she imagines American slaves could go to construct a nation of their own, but that's it. At the time when she put pen to paper, this author went to bed at night and rose in the morning knowing that human beings were still suffering and dying by the millions. 160 years later, we've long since ended slavery in America, but that fear and anger and almost-hopeless despair is still fresh on the page.So I guess what I'm saying is, absolutely do read this book - and when you do, read it less for the plot and more for the real, non-fiction people who inspired it.And also for George Harris, 19th-century action hero."}, {"userName": "Angela", "userReviewDate": "Feb 12, 2014", "userURL": "http://www.goodreads.com/user/show/126714-angela", "userReview": "Um. So. I don't even really know where to start with this book. tl;dr - Should absolutely, positively be required reading for anyone who calls themselves an American. Don't be intimidated by it because it's old; it's easy to read and follow linguistically, and the story itself is riveting.I think I first learned about this book in AP US History in 11th grade & the blurb in our textbook was basically like, \"This woman wrote this book depicting the realities of slavery & it kind of went viral & started the Civil War,\" and then we got to read about a bunch of white people shooting at each other & getting their limbs sawed off for the next 5 chapters.Honestly, I think would have been better off just reading this book.The story begins with a certain Mr. Shelby reluctantly selling three of his most highly valued slaves (young beautiful \"quadroon\" Eliza, her charismatic six-year-old son Harry, & the eponymous Uncle Tom) & follows their stories as they attempt to escape to Canada (in the case of Eliza & Harry) or are sold into various situations with different masters of a variety of philosophies & temperaments. The story is built out of real life stories collected by the author either first- or second-hand, and they are woven together in such a way as to address a variety of the legal, political, ethical, and philosophical arguments of the day surrounding the issue of slavery and abolition and, like I said, is riveting in terms of keeping you interested and invested in what happens next and incredibly moving from the whole \"What is freedom / personhood?\" perspective.It's one thing to read a novel about slavery written in the present day or recent past, but there is a whole other weight that comes with reading something that was written and published before the Civil War, while the practice was still legal and common place. If you can get through this book without becoming utterly enraged and heartbroken about the things that went on in this country, for hundreds of years, under the full protection of the law, to say nothing of what the fall out was (and continues to be), I kind of feel like you shouldn't get to call yourself an American.I spent a good 18 years hating the school subject of history and completely unable to see the point of studying it; maybe if I'd been assigned fewer textbooks and more primary works like this one, I would have understood how critical it is to study and make sense of the past (particularly the parts that make us the most uncomfortable). Highly, highly recommend. (Preferably *before* the age of 33.)"}, {"userName": "Lydia Presley", "userReviewDate": "Jan 06, 2010", "userURL": "http://www.goodreads.com/user/show/50581-lydia-presley", "userReview": "There have been so many reviews done about the book it seems a bit ridiculous for me to come so late to the game and offer my own insightful and poignant thoughts (I don't think that much of myself, really!). So instead, I thought I'd write about about my decision to read this book, why it took me so long, and how it affected me personally.I'd first heard of Uncle Tom's Cabin in college. Being home-schooled in the 80's/early 90's there really wasn't any sort of required reading, and I was constantly reading books anyway. But at that time I was reading the biographies of classical composers and other literary works that caught my interest (Austen, Bronte etc).My youngest sister is now a Junior in high school and was required to read this book just this year. I'd heard of it many times since my early college years and asked her what she thought of it. She told me it was interesting. With the 1001 Book challenge and some of my challenges I chose for 2010 the opportunity presented itself for me to finally read it.I am not going to lie to you - this was a hard read. The dialect throughout the book makes for slow going until you get used to it, which still takes a while. There are entire portions devoted to the preaching of the Word. I do not doubt at all in Stowe's faith and it's apparent that she believed that slavery was wrong on all levels, both political and spiritual. Of course, there is absolutely no fault in that and I agree.Of course the book is dated. There are references made that, if put in a book of today, would cause a huge outcry. If anything, the references should be taken as an example of the history of our nation and be learned from today. I'm reminded so many times of stereotypes made (and I'm not talking about politically correct nonsense), but stereotypes not only made based on race, but on sexual orientation, religion and education - to name a few. We'd be wise to remember that 100 years from now our children's children will be reading what we record and wondering at what we say.And finally I was struck at how some things do not change. More than all, Stowe spoke for education. Today, this is the same. Education can do wonders and it should be our primary focus.So those are my thoughts as I close this novel. Is it one of my favorite books? I'd have to say no. But I respect and appreciate the effort put forth by Stowe and hope that the spirit of her message will continue to affect the young adults who read it."}, {"userName": "mai ahmd", "userReviewDate": "Jan 09, 2012", "userURL": "http://www.goodreads.com/user/show/7154074-mai-ahmd", "userReview": "كتبت الروائية هذه الرواية بعاطفة صادقة وقوية ومؤثرة كونها عاشت أحداثها لذلك كان لها تأثيرا كبيرا على تغيير مسار الحياة في ذلك الزمن ولعل هذا يثبت كم هو تأثير القلم حين يكون بهذا الوعي في زمن ساد به التخلف وعربد فيه الجهل إنني للأتذكر دائما هذه الرواية حين يقولون لماذا تُقرأ الروايات ويسخرون إتذكر أني قرأت كتاب هو نساء رائدات للكاتبة اللبنانية أميلي نصر الله وقد وضعت هارييت ستو في مصاف هؤلاء النسوة اللاتي خلّد التاريخ أعمالهن ولعل هذه الرواية أكبر ردّ على من يقللون من أهمية الروايات وقراء الروايات وعلى الرغم من أني تذكرت أني قرأت نسخة مختصرة من هذه الرواية ولكنها نسخة من كتب الجيب غير أني تأثرت كثيرا بأحداث الرواية وكأني أقرأها للمرة الأولى للحقيقة المرة التي استندت عليها إنها إنعكاس واقع واقع بشع وأنت تقرأه فكيف لو كنت تعيشه حقا !وكنت أتساءل كيف يمكن لإنسان إنسان !أن يعطي نفسه الحق بأن يتملك إنسان مثله لمجرد أنه صاحب بشرة سوداء وكيف ممكن أن نطلق على هؤلاء المجردين من كل معاني الإنسانية هذه الصفة الجليلة !موضوع الرواية يدور حول فترة العبودية خلال فترة مظلمة في تاريخ أمريكا وتسرد الرواية قصة بعض العبيد الذين تعرضوا للبيع ومعاناتهم على يد النخاسين وانتقالهم من مالك لآخر لقد كنت أشعر بالسعادة حين ينجو أحدهم والعكس فيما لو تعرض أحدهم للضرب أو التعذيب أو البيع أصبت بحساسية مفرطة طوال الوقت الذي كنت أقرأ فيه الرواية من المشاهد التي ابكتني الحقيقة هو مشهد احتضار ليزا وهي طفلة أحد ملاك العبيد وكانت ملاكا طاهرا لم تستطع التعايش مع هذا الواقع المخزي فسرعان ما حان أجلها الطيبون لا تستحقهم هذه الأرض كنت أردد هذه العبارة التي كانت أمي تقولها دائما لي وأنا أقرأ قصة احتضارها أعتقد أنه من أجمل المشاهد التي كتبته ستو ببراعة وإتقان !قوة هذا العمل في الموضوع الذي تناوله وفي الوقت الذي ظهر فيه إلى حيز الوجود كان بمثابة أغنية للحياة للإنسانية للحرية لكل الأشياء الجميلة الغائبة"}, {"userName": "Thomas", "userReviewDate": "Dec 24, 2011", "userURL": "http://www.goodreads.com/user/show/2018505-thomas", "userReview": "This book launched the Civil War, and at what cost? In her novel Uncle Tom's Cabin, Harriet Beecher Stowe writes about the plight of enslaved individuals, and she relies on religion to advance her argument that slavery should not exist. The characters often appear as nothing more than archetypes. Stowe's writing comes across as propaganda more times than not. And yet the story of Uncle Tom's Cabin itself possesses an undeniable power, a strength fueled by outright sentimentalism and moralist rhetoric.I wrote about ten pages of analysis of this book for my Social Protest Literature class. During that time I could not help but compare it to the Dove Real Beauty campaign. Dove promotes body positivity, and at the same it over-emphasizes the role of beauty and discounts a lot of diversity. Stowe opposes slavery, and she also includes sentiments of romantic racism and overt Christian bias in her book. If you read Uncle Tom's Cabin, I would recommend approaching it from a critical lens; it did a lot to progress racial equality, while still enforcing a slew of problematic ideas we still see in today's discussions of race. Overall, an important book in our nation's history and one I would encourage people to read if they possess an interest in the institution of slavery or social protest literature in general. Not the most eloquent book ever written, but revolution does not always require a lot of eloquence, as evidenced by this story and many others."}, {"userName": "Fatema Hassan , bahrain", "userReviewDate": "Jan 27, 2013", "userURL": "http://www.goodreads.com/user/show/16564718-fatema-hassan-bahrain", "userReview": "إن أردت كتابة الحكاية التي لا تموت فدع ضميرك يتلوها عليك ."}, {"userName": "Afrah", "userReviewDate": "Nov 17, 2014", "userURL": "http://www.goodreads.com/user/show/18494400-afrah", "userReview": "[ (hide spoiler)]"}, {"userName": "K.", "userReviewDate": "Jul 29, 2017", "userURL": "http://www.goodreads.com/user/show/5663034-k", "userReview": "Trigger warnings: slavery, racism, violence, suicide, death of a child, beatings/whippings. 3.5 stars. I.......have mixed feelings about this book. On the one hand, it's basically the first book that actually portrayed enslaved people as, like, PEOPLE and not stereotypes. They're fully fleshed out characters who love and hate and cry and mourn and have dreams for the future and for their families. They want education and to have their own businesses and to see their children grow up free. HOWEVER. It's repetitively written. It's VERY Jesus-y. There's a lot of \"Sure, you're enslaved and your life is fucking shit and someone whips you on a daily basis for not picking cotton fast enough. But if you just have FAITH IN GOD, everything will be fine because you won't go to hell when you get whipped to death\". And, like...THE FUCK? I know it's a product of its time and of Stowe's beliefs. But oof. So yeah. It was good and an important story. But it was also a story that made me want to bash my head against a wall."}, {"userName": "Jason Pettus", "userReviewDate": "Mar 19, 2010", "userURL": "http://www.goodreads.com/user/show/147289-jason-pettus", "userReview": "(Reprinted from the Chicago Center for Literature and Photography [cclapcenter.com:]. I am the original author of this essay, as well as the owner of CCLaP; it is not being reprinted illegally.)The CCLaP 100: In which I read for the first time a hundred so-called \"classics,\" then write reports on whether or not they deserve the labelEssay #39: Uncle Tom's Cabin (1852), by Harriet Beecher StoweThe story in a nutshell:First written serially over the course of 1850 and '51, Harriet Beecher Stowe's 1852 Uncle Tom's Cabin actually tells several related stories concerning the horrors of slavery, starting at the relatively benign Kentucky household of Arthur and Emily Shelby, who treat their slaves more as respected hired help than property. But property they indeed are; and when the Shelbys find themselves in money trouble, they're forced to sell off several of their slaves, including not only the gentle, much loved overseer of the family farm, the eternally good-natured \"Uncle\" Tom, but also the physically strong son of Emily's personal maid Eliza, particularly heartbreaking because of Eliza having had two miscarriages previously and now intensely devoted to her only remaining son Harry. She's so devoted, in fact, that after hearing of the upcoming sale, she escapes one night with him by wading across a frozen river with no winter protection, kicking off an epic chase between her, her reunited husband and fellow runaway George, and the cruel slave-hunter Tom Loker who's been hired to bring them back, an action-packed story that takes the family from the Mason-Dixon line all the way to Canada and beyond, and interacting with such famed groups as the Quakers and the Underground Railroad.Meanwhile, the docile \"perfect Christian\" Tom has decided to humbly accept his fate; but after saving a precocious six-year-old white girl named Eva from drowning during a steamboat ride to his new destination, the girl's father Augustine St. Clare buys him out of gratitude, and brings him back to his sort-of experimentally liberal home in New Orleans, where Tom is set to live a life of relative ease, or at least relative to the backbreaking manual labor that was awaiting him at his original destination. (And in fact, Stowe uses this home, and the appearance of St. Clare's Yankee cousin Ophelia, as an excuse to have a series of expositional debates over the issue of \"malignant\" versus \"benign\" slavery, with Ophelia for example being an abolitionist yet who personally finds black people abhorrent, which St. Clare argues is just as bad as being a slaveowner to begin with.) But alas, after the emotionally moving and Christlike death of little Eva, and her father's deathbed promise to make Tom a free man, St. Clare is unfortunately stabbed to death in a bar fight before he can do so; and that's when Tom ends up getting sold to the human monster Simon Legree, and taken Heart of Darkness style into the unending nightmare of the deep rural South, an infinite horror show of torture-friendly atheism and deadly black-on-black violence, where Legree is determined to make an example of Tom for his refusal to whip other slaves because of his deeply Christian beliefs. Needless to say that things don't end well for Tom, leading to the angry indignation among readers that Stowe precisely wanted them to have, even as we also finish the book watching a very different fate await Eliza, George and Harry, who manage to escape to Europe and eventually make their way to Liberia, an actual African country in the 1800s that was created specifically for escaped American slaves. (And please note that there's actually a lot more that could be said about this book's surprisingly dense plot; I'm giving here just the barest outline of the story for the sake of brevity.)The argument for it being a classic:Well, for starters, it was the second most purchased book on the planet of the entire 19th century, beaten only by the freaking Bible (and including this being the very first American book to ever be translated into Chinese); plus it had such a profound impact on those who read it, no less than Abraham Lincoln is said to have remarked to Stowe upon meeting her for the first time, \"So this is the little lady who started this great war.\" (Now, please realize that this anecdote is most likely made up; what's undisputed, though, is that just in the year of this book's publication alone, in just the city of Boston alone, over 300 newborn babies were named \"Eva\" in honor of the book's fallen child hero.) And that's because Stowe did something that no other author up to that point had ever done, argue her fans, which was to humanize the issue of slavery to a massively effective degree, when up to then most people were more used to debating it as an abstract economic issue; for example, Stowe hammers home over and over here the emotional toll that comes with having a baby literally ripped from a mother's arms and sold off to strangers, a detail about the slave industry that ended up profoundly upsetting tens of millions of middle-class white mothers when first made public knowledge, and that immensely helped change the view they had been fed their whole lives that black people are in actuality little more than animals, and are no more upset by the loss of a child than a dog would be by one of its litter dying.This incidentally makes Uncle Tom's Cabin a proto-feminist tale as well, say its fans, in that Stowe believed that only the maternal love inherent in women could bring about a society of equals, with the men of this book almost exclusively being either bloodthirsty animals or whiny hypocrites with endless financial troubles; and along the way, it also serves as a nearly perfect piece of Liberal Christian propaganda, arguing for the exact kind of \"religious social justice\" that Glenn Beck claims is a sign of Nazism. It was literally this book, its fans claim, that convinced the majority of Northerners in the mid-1800s to change their belief in the idea of compromise with the South over slavery (as best typified in the literal \"Compromise of 1850\" and resulting Fugitive Slave Act, which infuriated Stowe and was the main inspiration behind her writing this in the first place), and to instead see this indignity as an important enough basic human issue as to be worth fighting a violent, nation-splitting war over, in fact what turned out to be the bloodiest war in American history still to this day.The argument against:While few of this book's critics deny any of the things just mentioned, they also add something that its fans don't -- that in her noble but misguided attempt to \"humanize\" black people in the eyes of terrified whites, Stowe inadvertently created a whole series of new negative stereotypes that were to haunt African-Americans for the next century, chief among them the \"Uncle Tom\" of the book's title, by now a slangy insult used whenever accusing a black person of being a grinning, cuckolded, semi-retarded apologist for white cruelty, and to this day a profoundly offensive term here in the US. (For example, look at how support for presidential candidate Ralph Nader plummeted during the 2008 election, after he glibly accused Barack Obama during a stump speech of being a \"Big Business Uncle Tom.\") And that's not the only unwanted legacy Stowe left either; this book also established the racist archetype of the obese, jolly, dark-skinned \"mammy\" household servant; the lazy, singing, shucking-and-jiving \"happy darky;\" the comical-looking \"pickaninny\" black child (think Buckwheat from \"The Little Rascals\"); and more. (Of course, in her defense, even Stowe's critics agree that these stereotypes were mostly cemented in the public mind through the hundreds of stage and film adaptations* that were done of this book between the 1850s and 1950s, and not necessarily by the original book itself.) Of course, even ignoring all that, critics argue that there's a much more basic problem with the idea of Uncle Tom's Cabin being a literary classic, which is simply that it's not very good; already an overwritten, purplish victim of its mid-Victorian time period, it was also deliberately written in the \"sentimental\" style that has so profoundly fallen out of favor in the ensuing decades, with the additional problem of Stowe simply being a subpar writer to begin with, making this a perfect example of what was called at the time \"Sunday School stories\" and that by the 20th century had become known as \"Genteel literature.\" Combine this with the unbelievable amount of accidental damage it caused to post-Civil-War race relations, its critics say, and you end up with a book not to be honored but rather held up as a shameful reminder of this country's dark past, as well as the shockingly low standards by which we used to determine what exactly \"good\" literature is.My verdict:Today's book nicely illustrates a complicated question that lies at the very heart of this entire essay series, which is whether we should ultimately judge a book's worth based on how it was originally received, or on what kind of lasting impact it eventually has on history and the world at large. Because the simple fact is that both the fans and critics of Uncle Tom's Cabin are right: it really did almost single-handedly provide the catalyst for the tidal wave that eventually led to the Civil War and the abolition of slavery; but it also did inadvertently establish many of the most offensive stereotypes about blacks to rise in the Reconstructionist period and beyond, taken advantage of by entertainers and production companies to wring money from a suddenly very nervous white population, who largely wished to be assured that despite their newfound free and equal legal status, sociologically-speaking black people were still barely civilized, semi-intelligent animals, good only for singing, dancing and physical labor, an attitude that still sadly exists among huge swaths of the American South to this day, especially when you replace \"dancing and physical labor\" with \"gangster rap and basketball.\"I don't know the answer to that question any better than anyone else, making the debate itself simple proof of how relevant Uncle Tom's Cabin still continues to be; but I gotta say, the real surprise of this book is in how legitimately great it actually is, a shockingly brutal and unexpectedly nuanced story that belies its flowery prose style and less-than-stellar reputation. Because, yes, even though it suffers from the same stylistic problems as most other novels of the mid-Victorian era, and its heavy-handed \"Little Eva As Jesus No Wait I Mean Uncle Tom As Jesus\" symbolism gets awfully tired awfully fast, it also contains a kind of simple, moving power that I've rarely seen in books from this period, and sometimes tackles the various sub-issues of slavery with a subtlety that will surprise most; see for example how it's not just slave-owning farmers who Stowe condemns but also secretly racist abolitionist Northerners, who agree in theory that slavery should be abolished but want nothing to do with the more troubling question of what to do with these millions of uneducated, penniless laborers after abolition, the very issue that led to segregation, the Jim Crow laws, and all the other postbellum ugliness of the 20th century. It's a slog at many points, don't get me wrong, and absolutely must be read with open eyes and an open mind, but I found Uncle Tom's Cabin to be imminently worth my time, a book that remains as affecting and powerful as when it first came out 160 years ago. There is no doubt in my mind that it remains a classic and will for some time, even with all the complicated post-publication problems it's accidentally caused. It comes highly recommended, no matter what your race, class or nationality.Is it a classic? Yes(And don't forget that the first 33 essays in this series are now available in book form!)*And a delicious piece of trivia that I could find no good place for in the main essay: turns out that Mickey Mouse first acquired his now trademarked white gloves during the 1933 cartoon Mickey's Mellerdrammer, in which Mickey and his pals decide to put on a stage production of Uncle Tom's Cabin themselves, and which featured the already dark-colored Mickey in full blackface makeup, a film that for obvious reasons the Disney Corporation now tries to pretend never existed."}, {"userName": "Karen", "userReviewDate": "Nov 25, 2008", "userURL": "http://www.goodreads.com/user/show/424766-karen", "userReview": "Having had an abiding interest in studying the Civil War, I have been surprised at myself that I have not previously read Uncle Tom's Cabin. I have now remedied that failure. I found the book riveting in parts. Harriett Beecher Stowe is a better writer than I expected. Her powerful character development makes the book all the more heartwrenching. I loved Uncle Tom's Christ-like character. I also loved the religious allusions and overtones in the book. In 1852, when the book was published, it served as a much-needed grand national chastisement over the practice of slavery. She used the story to teach basic compassion for the slaves. It is shocking to a modern reader that teaching such basic compassion was ever necessary. Mrs. Stowe gave no leniency to northerners in her chastisement (\"We [southerners:] are the obvious oppressors of the negro; but the unchristian prejudice of the north is an oppressor almost equally severe.\"). I was disappointed that she ended the book by sending so many of her main characters back to Africa. It was an unfortunate cop out. Because of her effective depiction of slavery and all of its ugliness, I readily believe that President Lincoln said, upon meeting Mrs. Stowe, \"So you're the little woman who wrote the book that made this great war!\""}, {"userName": "Tara", "userReviewDate": "Oct 13, 2011", "userURL": "http://www.goodreads.com/user/show/6649407-tara", "userReview": "The language of the slaves was a bit hard to read at first but it was only a small part of the book. It also made the characters come alive. This was an amazing tale. I can't help but feel such sorrow when I read about slavery. For the life of me, I can't see how people justified owning another person. People can twist and turn the bible to justify anything they see fit. I'm not a Christian but liked and agreed with the last chapter of the book where the author reminds people that even if they are not participating in slave owning they are just as guilty when they turn their backs on the goings on. Too many people are afraid to stand up for what they believe is right whether that be slavery, civil rights, gay rights, animal rights, human rights, etc. Stop being quiet and stand up for what you believe in. One person CAN make a difference."}, {"userName": "El", "userReviewDate": "Nov 25, 2017", "userURL": "http://www.goodreads.com/user/show/83144-el", "userReview": "Let's just be real from the beginning: This is a problematic book, especially when viewed from a 2017 perspective. I do believe Harriet Beecher Stowe's heart was in the right place, but sort of in one of those ways where people want to do something good, and all they do is just \"like\" things on Facebook, or say to one another how bad things are, but then shrug and say \"But what can we do?\"Sure, in 1852 when this book published, it made some waves because here's a white woman (a WOMAN, y'all!) who saw that shit was pretty stinky when it came to the state of affairs surrounding slavery. There's that whole unproven comment that Abraham Lincoln said something to Stowe about her being the \"little woman who started the big war\", referring, of course, to the start of the American Civil War. There's no actual proof that statement was ever made, by the way, but that's okay because it sounds pretty cool. Don't we all want to be the little person who does something so incredible that the entire course of history is changed because of us? You're probably lying if you say you haven't at least once in your life considered it.Don't forget that men and women of color wrote slave narratives before this, and they were/are generally overlooked, but thank god here's a white woman who could put their experiences in words for them annnnnnd look how long it has prevailed. Just think about that a moment.It's probably unfair to read this book from a contemporary perspective. There's so much shit happening in our world right now and it's hard to say if any of it will get any better anytime soon. People like to say that slavery no longer exists, but what they mean is that slavery the way Stowe wrote about it doesn't exist anymore. The truth is, of course, that slavery exists in many different ways, maybe less obviously, than forcing people of color to work on plantations or to be indentured servants or whatever else. Human trafficking (which is how slavery begins) still exists. The number of people of color who are trafficked and forced into prostitution and drug-trafficking are extraordinarily high. Racism runs rampant in most of the United States, even though we like to pretend that things are \"better\" today. Racism, like sexism, is so ingrained in our everyday experiences that we barely even notice when it happens around us anymore, unless we pay really close attention. Many don't, though.So when we read a book like this, we cringe at some of the more sentimental beliefs Stowe held that she wrote in this book of hers. To break it down to a very basic level, slavery is bad, Christianity is good.That's all you really need to understand to get through this book. I imagine most of Stowe's readers were already of the same mindset - I don't know how many plantation and slave-owners would pick up this book and actually put it down and think \"Summabitch, I've been doing life wrong all this time! I am WOKE.\"But this is how the characters in Stowe's novel react. There are some characters who elicit this sort of response, generally after said character dies. Then all the survivors are all \"Shit, my life is changed, I will never be bad again - pass the Bible!\" Let's not even discuss how the best example of this is little Eva, little blond Eva. BECAUSE OF COURSE SHE'S BLOND. She's white, she's blond, she's blue-eyed, she's virtuous, she's straight up awesome-sauce.Boring.I actually read about half of this on my own around college at some point. Someone in one of my classes did an impressively bad oral presentation (with a visual aid) on this book and I was so intrigued by how pathetic it was that I had to read the book. I picked it up on my own and got about halfway when I had dinner with my mom who happened to also be reading it on her own. I had been enjoying up to that point, but she went on such a rant about the book that I didn't feel like reading anymore of it. I didn't understand whatever she was going on about at the time, but I think I get it now. It was probably the same concerns that I have now.I will say this book was great for our book club discussion this week. I appear to have liked it less than others, but I appreciated everything everyone had to say. We even went so far as to wonder if this book would have been different if it had been written by a man (a question that was raised last month when we read Frankenstein as well). Decision: The book would probably never have been written by a man. And if it had been, it would have lacked in the sentimentality, which almost defeats the entire purpose of this book. It's the sentimentality that pulls at the heart-strings, and without it, it would just be... something else entirely.I was annoyed by the polarities between the characters - everyone is either good or evil, and this is expressed through incredibly cringe-worthy stereotypes. I read somewhere (perhaps Wikipedia, if you want to go look) that this book is probably the one that put those stereotypes (like of the \"happy darky\", the \"mammy\", the \"pickaninny\") into rotation which have just been perpetuated year after year after year.Uncle Tom himself is so obvious a Christ-figure that I was annoyed that shit wasn't more nuanced than that. This probably explains why this was the second best seller after the Bible. I joked that they probably passed this book out along with the Bible back in the 1850s, a two-for-one deal.Overall, this didn't appeal to me. It felt too long for the point it was trying to make (slavery is bad, Christianity is good), but can also appreciate the point that, hey, as Christians we should probably not be keeping humans as slaves. Stowe herself didn't really have any good suggestions for how to go about fixing the slavery problem, by the way. Maybe send them back to Africa? I don't believe she meant that maliciously, rather she may have thought that if slavery was abolished, the freed blacks might just want to return to Africa, because why would they want to stick around the US? I could have that wrong; that was my impression based on her notes in the Afterword of whatever that was at the end of the edition I read.Problematic all around, but still somehow an American classic. Yes, it shows how shitty we were, and that is important to remember because we are constantly on the brink of making a lot of the same mistakes today. But it also shows some of us how little progress we've made because I hear a lot of people today making a lot of the same comments that Stowe made in this book back in 1852. That's pretty disturbing.So if you get nothing else out of this review, just remember that slavery still exists today, whether you want to admit it or not. It may look different, but it's still there, and the more aware of it we are, the more likely we can actually take appropriate steps to ending it. But to admit there's a problem shows our own complicity, and people reeeeaalllly hate to do that shit."}], "description": "The narrative drive of Stowe's classic novel is often overlooked in the heat of the controversies surrounding its anti-slavery sentiments. In fact, it is a compelling adventure story with richly drawn characters and has earned a place in both literary and American history. Stowe's puritanical religious beliefs show up in the novel's final, overarching theme—the exploration of the nature of Christianity and how Christian theology is fundamentally incompatible with slavery.", "title": "Uncle Tom's Cabin", "url": "http://www.goodreads.com/book/show/46787.Uncle_Tom_s_Cabin", "average": 3.84, "cover": "https://images.gr-assets.com/books/1414349231l/46787.jpg", "reviews": 6277, "authors": [{"url": "https://www.goodreads.com/author/show/26242.Harriet_Beecher_Stowe", "name": "Harriet Beecher Stowe"}], "type": ["Classics", "Fiction", "Historical", "Literature"], "outlinks": ["http://www.goodreads.com/book/show/46787.Uncle_Tom_s_Cabin", "http://www.goodreads.com/book/show/6689218", "http://www.goodreads.com/book/show/1499994._", "http://www.goodreads.com/book/show/400927.Uncle_Tom_s_Cabin", "http://www.goodreads.com/book/show/7569563", "http://www.goodreads.com/book/show/15845364-uncle-tom-s-cabin", "http://www.goodreads.com/book/show/890368.Uncle_Toms_Cabin", "http://www.goodreads.com/book/show/46791.Uncle_Tom_s_Cabin", "http://www.goodreads.com/book/show/800660.The_Minister_s_Wooing", "http://www.goodreads.com/book/show/123984.Dred", "http://www.goodreads.com/book/show/903191.The_Pearl_of_Orr_s_Island", "http://www.goodreads.com/book/show/20957940-uncle-tom-s-cabin", "http://www.goodreads.com/book/show/35958434"]}