{"ratings": 334, "userreviews": [{"userName": "Linda", "userReviewDate": "Mar 17, 2012", "userURL": "http://www.goodreads.com/user/show/7966073-linda", "userReview": "If you know someone who looks down their nose at reading Christian fiction and says, \"I only read non-fiction,\" I suggest you give them a copy of this series! I've not read many, if any, books that so clearly demonstrate what following Christ truly means as this series does. Unexpected Dismounts continues the story of Allison as she follows the Nudge God gave her, leading her to buy a Harley and open a home to help prostitutes begin a new life. Now she is facing some rather daunting challenges (some \"unexpected dismounts,\" as they call them in the world of Harleys) and other than one new Nudge (which God must surely intend only to be followed in a theoretical, as opposed to literal, sense!) she finds Him to be rather silent. There's nothing quite like going out on a limb with and for God and then feeling like you're stranded there. . . .especially when almost everyone around you pretty much thinks you're crazy for being there in the first place! Including those who profess to be Christians, who just want Allison to get over this phase and get back in her pew and behave like a \"normal\" Christian. Allison must decide which is worse: for people to judge her for hearing and following God's voice, or for her to decide the cost is too great and close her ears and her heart to His nudges. Nancy Rue has definitely heard some nudges of her own in writing this series. This is not your typical \"safe\" Christian fiction. But come to think of it, the Christian life was never guaranteed to be \"safe.\" From a strictly literary sense, this is a phenomenal book. Several times as I read, I stopped and thought, \"where does she come up with this stuff?!\" The characters and the interactions between them are so well-done that I truly felt as if I might encounter them in real life. But the spiritual dimension utterly transforms it from simply a \"good read\" to one that will challenge you to follow the Nudge that God is giving you. Don't miss this book and this series."}, {"userName": "Diane", "userReviewDate": "Jul 05, 2012", "userURL": "http://www.goodreads.com/user/show/3525770-diane", "userReview": "Nancy Rue is rapidly becoming one of my favorite authors. This sequel to the Reluctant Prophet followed the theme of service to the \"least of these\". This time the \"Nudge\" is not to buy a Harley--it's to wash their feet. The big reveals toward the end of the book were great. In retrospect, I should have caught them. I plead way too much stress and busyness in taking care of my mom the last few days to catch onto those. The clues were all there...Can't wait for book #3 in the trilogy to come out!!!"}, {"userName": "Leopoldi", "userReviewDate": "Feb 19, 2015", "userURL": "http://www.goodreads.com/user/show/27943750-leopoldi", "userReview": "PiercingReading this book opened my spirit to believe I indeed get nudges from Holy Spirit and I don't have to a perfect Christian or humanto hear Him and act. It is quite an adventure."}, {"userName": "Jerry", "userReviewDate": "Sep 13, 2015", "userURL": "http://www.goodreads.com/user/show/5855981-jerry", "userReview": "A Quickie ReviewThis second outing is just like the first: edgier than usual for Christian fiction, and with a likable yet flawed heroine. If you enjoyed the first book in the series, you should definitely check this one out.Score: 4/5"}, {"userName": "Teri Pre", "userReviewDate": "Nov 20, 2012", "userURL": "http://www.goodreads.com/user/show/4903813-teri-pre", "userReview": "I am loving this series! I've GOT to buy the next book!"}, {"userName": "Beth", "userReviewDate": "Dec 29, 2013", "userURL": "http://www.goodreads.com/user/show/4075354-beth", "userReview": "Great continuation, can't wait to read the third book!"}, {"userName": "Jodi", "userReviewDate": "May 23, 2017", "userURL": "http://www.goodreads.com/user/show/1918890-jodi", "userReview": "3.75I enjoyed this book and reuniting with the characters, it did start slow, but once I was through the first few chapters, the pace picked up and I was right back with Big Al and Desmond, and Chief and all the other unique characters that Nancy Rue creates. I am looking forward to reading the third and final instalment."}, {"userName": "Connie Moser", "userReviewDate": "Dec 31, 2017", "userURL": "http://www.goodreads.com/user/show/983927-connie-moser", "userReview": "very good book"}, {"userName": "Jill Koeppel", "userReviewDate": "May 26, 2017", "userURL": "http://www.goodreads.com/user/show/47914430-jill-koeppel", "userReview": "I couldn't put this book down. Wonderful way to weave our belief in God in an amazing story. Made me ask myself what is my ministry."}, {"userName": "Robin Patchen", "userReviewDate": "Nov 04, 2017", "userURL": "http://www.goodreads.com/user/show/8077100-robin-patchen", "userReview": "Just as good as the first one. Loved it. I'm reading the third book now."}, {"userName": "Victor Gentile", "userReviewDate": "Nov 25, 2011", "userURL": "http://www.goodreads.com/user/show/2528881-victor-gentile", "userReview": "Nancy Rue in her new book, \"Unexpected Dismounts\" Book Two in The Reluctant Prophet series published by David C. Cook takes us back into the life of Allison Chamberlain.From the Back Cover: Allison Chamberlain thought she was doing everything God required of her—but as her journey continues in the second book of The Reluctant Prophet series, she might have to let go of everything she loves to follow the call. Allison is already taking care of five former prostitutes, trying to adopt an orphan, and helping a woman who’s been raped. Along the way, she experiences unexpected dismounts, as every Harley owner who risks the ride eventually does. A relative challenges the adoption. An influential businessman blocks her ministry. A beloved friend is seriously injured. A piece of her past adds even more turmoil. As she picks herself up again and again, Allison realizes that some are guilty of terrible wrongs—but everyone must be responsible for righting them.The Church was never meant to be a safe place. It was designed to be a hospital where the wounded and broken could come to get rest, healing and be tended to. That was Jesus in action. He dealt with sinners, sick persons, prostitutes and demon-possessed individuals. In \"Unexpected Dismounts\" Nancy Rue gives us a story that shows, through the life of Allison Chamberlain, what the Church is all about. Ms. Rue provides the themes of bikers, prostitutes and adoption. It is quite a book.If you would like to listen to interviews with other authors and professionals please go to www.kingdomhighlights.org where they are available On Demand.To listen to 24 hours non-stop Christian music please visit our internet radio station www.kingdomairwaves.orgDisclosure of Material Connection: I received this book for free from Jeane Wynn at Wynn-Wynn Media for this review. I was not required to write a positive review. The opinions I have expressed are my own. I am disclosing this in accordance with the Federal Trade Commission’s 16 CFR, Part 255  : “Guides Concerning the Use of Endorsements and Testimonials in Advertising.”"}, {"userName": "Anne", "userReviewDate": "Apr 10, 2014", "userURL": "http://www.goodreads.com/user/show/19924977-anne", "userReview": "Not as good as RELUCTANT PROPHET. Too much action--too many characters introduced to keep a storyline going...some which simply seemed to be compact little stories of their own: a raped prostitute, a child-custody battle interrupted at the 11th hour by a long-lost aunt, freaky motorcycle accidents tied to a mysterious one-eyed creep thought to be dead. Oh, and the rich old lady who can't commit a donation to fund a second Sacrament House...so many stories that could have been removed leaving the main story intact. In fact there was so much going on, it really wasn't until the final chapters that I realized that the whole build-up was to reveal a long-held vendetta. And then the plot became silly. When the child given-up for adoption turns up and \"coincidently\" becomes the lawyer come-to-town-to-save-the-day...well, it began to feel like an episode of DALLAS. Allison Chamberlain began to take on the persona of a long-suffering soap opera character.The confession of arch-enemy, Troy Irwin, was, unfortunately, the lowest point...because of the melodrama. On page 424 Troy asks Allison, \"Do you know why I raped that girl?\" Now come on. What psychopath calls his crime by its actual name? What sociopath--as Troy Irwin has been painted to be in the previous 423 pages--is going to admit to any wrongdoing, much less rape? \"I'll tell you why,\" he continues midway down the page. A confession...really? What psycho confesses to his crimes? especially a confession to the one he is bent on bringing down? \"I did it to show you that you are never going to change things.\" Oh, the drama, the angst, the raw pent-up emotion. It's there...it's just not believable. It feels as if it were written for effect, not for truth.Hoping that the final book of the series, TOO FAR TO SAY ENOUGH, brings back some of the honesty of one caught up in unexpected, undesired service to God."}, {"userName": "Sally Ferguson", "userReviewDate": "Nov 04, 2013", "userURL": "http://www.goodreads.com/user/show/25294957-sally-ferguson", "userReview": "Set in run down neighborhoods of St. Augustine, Florida, an unexpected messenger from God sets out to correct the ills of society. By becoming an advocate for drug addicts who are trying to get off of the street, Allison Chamberlain finds herself on both sides of the law. Unexpected Dismounts, by Nancy Rue, tackles unusual plot themes of bikers, prostitutes, adoption, and Nudges from God. Wrap those themes up in street lingo and biker slang, and you’ve got an education coming that puts you right in the middle of a different world. Although a work of fiction, Rue’s characters were so consistent, they took on a life of their own. The point of view came from Allison’s own questions about people and their motives. And the emotions of doubt, fear and mistrust toward people and God were real-life snippets of our own tug-of-war with faith. I came away from the book feeling a kinship to people for whom I had not previously been able to relate. And it was refreshing to watch someone stretch in her understanding of God and His desire for her place in the world.If you pick up this book in the middle of the trilogy, like I did, you may have difficulty following the characters at the beginning. But hang on; it doesn’t take long to rev up the action to a great read!Disclosure of Material: I received this book free from the publisher through the BookCrash.com book review program, which requires an honest, though not necessarily positive, review. The opinions I have expressed are my own. I am disclosing this in accordance with the Federal Trade Commission’s CFR Title 16, Part 255: “Guides Concerning the Use of Endorsements and Testimonials in Advertising.”"}, {"userName": "Laura", "userReviewDate": "Aug 02, 2012", "userURL": "http://www.goodreads.com/user/show/2521894-laura", "userReview": "Title: UNEXPECTED DISMOUNTSAuthor: Nancy RuePublisher: David C. CookOctober 2011ISBN: 978-1-4347-6492-8Genre: women’s fictionAllison Chamberlain thought she was doing everything God required of her. She is mentoring five former prostitutes and trying to help orphans. And coping with unexpected feelings. But now she’s experiencing UNEXPECTED DISMOUNTS. A distant relative challenges an adoption Allison hopes for. An influential businessman tries to stop her prostitute ministry. A piece of her past elbows it’s way in. As Allison picks herself up over and over again, she realizes she might have to give up everything she loves just to stay upright. UNEXPECTED DISMOUNTS is the second book in her The Reluctant Prophet series. The first book The Reluctant Prophet should be read first in order to fully comprehend what is going on in UNEXPECTED DISMOUNTS.The story is written in first person, which doesn’t appeal to all readers, and starts with celebrating Lent, a practice not all Christians (or prostitutes, in the case of UNEXPECTED DISMOUNTS) engage in. Allison is caring, wanting to help others. I did find the cast of characters confusing. There seemed so many introduced at once. But it’d been a year since I read the first book and The term prophet in this series isn’t used in the biblical way, but instead as someone who teaches others how to get right with God. UNEXPECTED DISMOUNTS will show how you can step out in faith and follow God, no matter where the path goes. $14.99. 400 pages."}, {"userName": "Barbara Derksen", "userReviewDate": "Sep 18, 2013", "userURL": "http://www.goodreads.com/user/show/7599602-barbara-derksen", "userReview": "Unlike the many novels that tell the story of a world that does not exist, Nancy Rue relates plausible fiction about a woman who understands what hearing the voice of God means to those around her and acts upon that still small voice so many of us ignore. Consequently, she meets characters whom she'd not likely meet otherwise and her life is enriched because of it. Unexpected Dismounts is the second in her series about Allison Chamberlain, a woman who was raised with privilege but has chosen to turn her back on the corrupt world she came from to rescue prostitute from the life of abuse they lead. Riding a motorcycle, she traverses the streets of St. Augustine, Florida following God's plan for her life. A young boy, Desmond, the child of one of the night creatures, finds a place in her heart and she in his. he story is compelling, hard to put down, and one I would highly recommend to anyone."}, {"userName": "Melissa", "userReviewDate": "Aug 25, 2011", "userURL": "http://www.goodreads.com/user/show/721595-melissa", "userReview": "The second book in Rue’s Reluctant Prophet series is a stellar tale. Readers will come away challenged to put their faith to action. This novel is electric with action, realistic characters and a fast-paced plot. A tremendous amount of spiritual food for thought is included in this stand-out story.Allison Chamberlain hasn’t received a nudge from God in a while. She’s sure she’s on the right track providing a way out for former prostitutes and drug addicts, but Allison isn’t sure what’s next. Just when she thinks she’s headed in the right direction, her carefully laid plans get derailed. Allison needs to learn to be still and listen for God’s voice to direct her steps toward the future, and when she does, the most amazing things happen.https://www.rtbookreviews.com/book-re..."}, {"userName": "Kim Buchanan", "userReviewDate": "Jan 28, 2013", "userURL": "http://www.goodreads.com/user/show/12616611-kim-buchanan", "userReview": "Second in the series. Not quite as funny as the first, but I still really like the characters. Begins with Ash Wednesday, ends with Easter. More tangling with Troy… Allison’s attempt to adopt, oh I forgot his name…the cool kid. His aunt shows up to try to adopt him instead…but turns out it’s Troy who’s put her up to it. The adoption goes through. The son Allison gave up for adoption when she was 18 shows up. He’s an attorney. Questionable character in the beginning, but turns out to be okay. Chief has an accident. Spends most of the book in a wheelchair. I’m looking forward to #3—it’s coming out in October."}, {"userName": "Traci", "userReviewDate": "Feb 13, 2012", "userURL": "http://www.goodreads.com/user/show/2906734-traci", "userReview": "I absolutely loved this book and can't wait to read the final book in the trilogy. It makes you question so much of why we do things, are we really listening to God and what he wants us to do?Do I respond to God's nudges? Am I even listening to know when God is nudging me? Allison Chamberlain is doing her best to respond to His nudges. When she begins feeling physical pain in response to the pain of others she is taken to a new level of God's communication with her. She is balancing so many issues of great importance to her that she begins to feel like she is losing control. Loved both The Reluctant Prophet and Unexpected Dismounts. Already anxious for the next book!"}, {"userName": "Amber", "userReviewDate": "Aug 12, 2012", "userURL": "http://www.goodreads.com/user/show/9329458-amber", "userReview": "This is the 2nd of the Reluctant Prophet series. I was as impressed with it as with the 1st book. The story is well written and sucks you into the lives of the characters. It continues with the life of Allison and her involvement in the lives of the prostitutes that have come to her and are trying to turn thier lives around. She faces many roadblocks and has to deal with some personal issues from her past that threaten to interfer with the adoption of Desmond. Through it all, Allison has to face questions about God's purpose in her life and his will and struggles with the choices that are presented to her. I can't wait to read the 3rd book in the series- \"Too Far To Say Far Enough\""}, {"userName": "Rev. Linda", "userReviewDate": "Nov 10, 2013", "userURL": "http://www.goodreads.com/user/show/11359949-rev-linda", "userReview": "\"Unexpected Dismounts\" is the sequel to \"The Reluctant Prophet\" by Nancy Rue, and just like the first book in the series, left me wishing that the story would continue, as I have once again fallen in love with the characters. This one had a surprise \"bad guy\", but similar to \"The Reluctant Prophet\", shows in a wonderful way how many ways God's children can relate to Him, and how He loves them all. Next, I plan to find the third in the series, \"Too Far to Say Enough\" so I can continue to follow the lives of those that the Sacrament House has given new lives. I enjoyed the first two so much that I am giving them to special people for Christmas."}, {"userName": "Pat", "userReviewDate": "Feb 15, 2013", "userURL": "http://www.goodreads.com/user/show/15115042-pat", "userReview": "Once again I loved this book. I really like the series. This time Allison shows alittle more spunk and is really tested about her faith. How far would she go to adopt a child whos mother had signed him over to her before her death. Dealing with happenings in the drug world and prostitution world gives these stories alittle harder edge - but Allison is not afraid to face the Satans of that world to help these women. There is one more book in the series called \"To Far to say far enough\" and I am anxiously ready to read it."}, {"userName": "Ane Mulligan", "userReviewDate": "Feb 16, 2014", "userURL": "http://www.goodreads.com/user/show/4469633-ane-mulligan", "userReview": "This is the series every young person, who seeks not to be a Christian in name only but the hands and feet of Jesus, needs to read. This is what the church needs to be. With an unpredictable plot, wonderful characters you want to meet in real life—well most of them anyway, Unexpected Dismounts is as terrific a read as The Reluctant Prophet. Novel Rocket and I give it our highest recommendation – it's a 5-star must read."}, {"userName": "Curtis", "userReviewDate": "Nov 09, 2012", "userURL": "http://www.goodreads.com/user/show/5717218-curtis", "userReview": "Book 2 of the Reluctant Prophet series was even better than the first. The series is catching on with my coworkers now. The buzz is even better than when Twilight swept through the office like a wildfire. This series has way more substance than vampire fluff. This is where real faith meets the bumpy road of life. It's not smarmy or sentimental, but gritty enough even for skeptics. As one of my favorites this year, I highly recommend it."}, {"userName": "Sherry Ledet", "userReviewDate": "Nov 16, 2012", "userURL": "http://www.goodreads.com/user/show/5867163-sherry-ledet", "userReview": "Continued from The Reluctent Prophet. Allison Chamberlain is knee deep in the 'nudges' that God sends her to rescue those who can't rescue themselves from the depths of human depravity that has been visited on them on in the neighborhoods behind your home and mine, that we never see, or probably want to. If you have ever felt God's 'nudge' to do something, this may just move you to answer."}, {"userName": "Christine", "userReviewDate": "Jan 19, 2013", "userURL": "http://www.goodreads.com/user/show/1030920-christine", "userReview": "I enjoyed this second book in the series even more than the first. At times, I couldn't put it down and when I had to, I couldn't get it out of my mind. It's a compelling story with well-developed characters. I can't wait to read the third one, but I hope it's really long. I don't want this series to end."}, {"userName": "Christy", "userReviewDate": "Jul 04, 2012", "userURL": "http://www.goodreads.com/user/show/2847349-christy", "userReview": "I actually liked this one a little bit better than the last one. I think the series altogether has a huge amount of characters to keep track of and I spent over half of the last book trying to memorize and like them. But once I got past that hump, they're a pretty quick reads with lots of great plot twists."}, {"userName": "Maggie Doerle", "userReviewDate": "Mar 02, 2013", "userURL": "http://www.goodreads.com/user/show/5922377-maggie-doerle", "userReview": "One of the best books ever. EVER!!! When I say this, I am including the first book of the series: The Reluctant Prophet. And I have no doubt that the last book: Too Far to say Far Enough, will not disappoint. I feel like I am on a mission to tempt and convince everyone to read this trilogy. You will not regret it."}, {"userName": "C.J. Darlington", "userReviewDate": "Aug 18, 2011", "userURL": "http://www.goodreads.com/user/show/2777896-c-j-darlington", "userReview": "A worthy sequel to Rue's \"Reluctant Prophet\", though you don't have to have read that one to enjoy Unexpected Dismounts. The main character is compelling and deals with issues of faith, family and love just like we all do. Rue's humor adds a nice touch as well. Can't wait for the next one!"}, {"userName": "Heidi Strybos", "userReviewDate": "Aug 21, 2013", "userURL": "http://www.goodreads.com/user/show/15267080-heidi-strybos", "userReview": "Second book on a series of 3. Have to say first middle book I've ever read where author doesn't spend half the book recapping the first. Enjoyed the continuation of the story but enjoyed the first more"}, {"userName": "Dorrice", "userReviewDate": "Oct 19, 2012", "userURL": "http://www.goodreads.com/user/show/8279602-dorrice", "userReview": "This book is a continuation of The Reluctant Prophet, the second book of a trilogy. A multi-layered plot,lovable people (with a few exceptions!) and much suspense. I loved it all and am so delighted to find the 3rd book now available. It is already sitting in my Kindle."}], "description": "Allison Chamberlain thought she was doing everything God required of her, but as her journey continues in the second book of The Reluctant Prophet series, she might have to let go of everything she loves to follow the call.Allison is already taking care of five former prostitutes, trying to adopt an orphan, and helping a woman who’s been raped. Along the way, she experiences unexpected dismounts, as every Harley owner who risks the ride eventually does.  A relative challenges the adoption. An influential businessman blocks her ministry. A beloved friend is seriously injured. A piece of her past adds even more turmoil. As she picks herself up again and again, Allison realizes that some are guilty of terrible wrongs, but everyone must be responsible for righting them.", "title": "Unexpected Dismounts\n      \n          (The Reluctant Prophet #2)", "url": "http://www.goodreads.com/book/show/10302295-unexpected-dismounts", "average": 4.5, "cover": "https://images.gr-assets.com/books/1328763056l/10302295.jpg", "reviews": 48, "authors": [{"url": "https://www.goodreads.com/author/show/83430.Nancy_N_Rue", "name": "Nancy N. Rue"}], "type": ["Christian Fiction", "Christian", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/10302295-unexpected-dismounts", "http://www.goodreads.com/book/show/13401094-unexpected-dismounts", "http://www.goodreads.com/book/show/1936120.Healing_Stones", "http://www.goodreads.com/book/show/7680765-the-reluctant-prophet", "http://www.goodreads.com/book/show/3421773-healing-waters", "http://www.goodreads.com/book/show/300380.Sophie_s_World", "http://www.goodreads.com/book/show/6741871-boyfriends-burritos-an-ocean-of-trouble"]}