{"ratings": 9, "userreviews": [{"userName": "Pupottina", "userReviewDate": "Oct 22, 2015", "userURL": "http://www.goodreads.com/user/show/21008693-pupottina", "userReview": "Non è uno scrittore e non ambisce ad esserlo. Vuole soltanto raccontare la sua storia a chi crede di conoscerla in base al sentito dire; ai sensazionalismi televisivi, specializzati in cronaca nera, che hanno fatto di lui un mostro da sbattere in prima pagina; a chi ha preconcetti sui giovani ragazzi di famiglie benestanti, peggio ancora se apparentemente viziati o di bell'aspetto.Quanto è complicato dimostrare chi si è e che si è innocenti, quando qualcun altro cerca un colpevole a tutti i costi. Questo romanzo autobiografico si legge con facilità, grazie allo stile fluido e semplice. Chi legge crede di conoscere la storia, ma si accorge di non conoscerne nemmeno una piccola parte degli eventi reali o dei dettagli, nonostante siano stati ossessivamente ripetuti in tv o sui giornali.Raffaele Sollecito è un ragazzo come tanti, ma è stato l'uomo giusto nel posto sbagliato al momento sbagliato ed è così che sono cominciate le sue disavventure giudiziarie terminate otto anni dopo, il 27 marzo 2015, quando è stato definitivamente assolto «per non aver commesso il fatto». È così che finalmente la Corte di Cassazione chiude uno dei casi più controversi della storia giudiziaria italiana.Il processo è quello contro Raffaele Sollecito e Amanda Knox per l’omicidio della studentessa inglese Meredith Kercher, avvenuto nel 2007. A distanza di otto anni, Raffaele analizzai suoi errori, la sua ingenuità, le sue debolezze e descrive nel dettaglio quella che era la sua vita prima e durante quella terribile esperienza.Questo libro è una testimonianza emozionante e lucida che Raffaele ha voluto scrivere per far in modo che il mondo scopra chi è veramente. Di lui, infatti, si è detto e scritto di tutto e lo si è rapidamente trasformato dal sosia di Harry Potter, eroe positivo, in un mostro da prima pagina per giustificare le tesi dell’accusa che lo volevano uno spietato assassino da proporre all’opinione pubblica. In questo libro, si scopre chi è davvero Raffaele Sollecito: chi era prima che tutto iniziasse e chi spera di poter ricominciare a vivere daccapo, ora che è UN PASSO FUORI DALLA NOTTE.Mi è piaciuto conoscerlo grazie al suo libro."}, {"userName": "Sorairo", "userReviewDate": "Dec 09, 2015", "userURL": "http://www.goodreads.com/user/show/11366796-sorairo", "userReview": "Quale sarà la verità? ?? Raffaele si dichiara innocentissimo. Io non c'ero. Nessuno c'era. Ammetto che un po in empatia leggendo ci sono entrata, sembriamo avere un carattere simile. E non riesco a pensarlo colpevole, ma nemmeno ad essere certa della sua innocenza che mi auguro vera. Ma certo è che il sistema giudiziario è obsoleto e malfunzionante, ricco di norme poco seguite e numerose falle. Può un processo durare tanto a lungo? può un poliziotto svolgere mansioni d'indagine senza seguire l'iter di appartenenza? Non so ,ma prima di giocare al tribunale, chi fa parte di quel palinsesto dovrebbe fare un po di ordine. Perché Raffaele o meno, è pieno di colpevoli liberi ed innocenti in prigione. Pochi i criminali che scontano. E si dovrebbe lavorare seriamente sulla reintroduzione in società. Altrimenti un criminale non cambierà e usciranno solo casi umani, a nche tra gli innocenti ingiustamente in carcere."}], "description": "«Ormai per tutti ero colpevole, ero davvero io il \"mostro\" contro cui puntare il dito, per poi giustiziarlo.Come avrei potuto dimostrare al mondo la mia innocenza?Sarei riuscito a trovare il sentiero che mi avrebbe fatto riemergere da un simile inferno?»È il 27 marzo 2015 quando, assolvendo definitivamente gli imputati «per non aver commesso il fatto», la Corte di Cassazione chiude uno dei casi più controversi della storia giudiziaria italiana: il processo contro Raffaele Sollecito e Amanda Knox per l’omicidio della studentessa inglese Meredith Kercher, avvenuto nel 2007.Sono passati otto anni. Raffaele, all’epoca, di anni ne aveva 23. Pochi giorni dopo il suo arresto si sarebbe dovuto laureare. Dopo questa sentenza, oggi Raffaele – che ha trascorso quattro anni di carcere, di cui una parte in regime di isolamento – può finalmente guardare avanti, ma soprattutto lasciare che il mondo scopra chi è veramente. Di lui infatti si è detto e letto di tutto e lo si è rapidamente trasformato in un mostro da prima pagina, giustificando nell’opinione pubblica le tesi dell’accusa che lo volevano spietato assassino.In questo libro Raffaele prende finalmente la parola. Ci racconta la sua infanzia, i suoi sogni, ma anche cosa successe davvero la sera del 1º novembre 2007 a Perugia. E infine cosa significa per un ragazzo della sua età scontare ingiustamente una lunga pena; cosa significa, una volta uscito e assolto definitivamente, incrociare lo sguardo di chi ti incontra e ti riconosce, e ogni volta domandarsi che cosa penserà di te…RAFFAELE SOLLECITO è nato a Bari nel 1984. Laureato in Ingegneria informatica, si occupa di progettazione e sviluppo di software.", "title": "Un passo fuori dalla notte", "url": "http://www.goodreads.com/book/show/26866732-un-passo-fuori-dalla-notte", "average": 3.56, "cover": "https://images.gr-assets.com/books/1444003886l/26866732.jpg", "reviews": 2, "authors": [{"url": "https://www.goodreads.com/author/show/5804392.Raffaele_Sollecito", "name": "Raffaele Sollecito"}], "type": [], "outlinks": ["http://www.goodreads.com/book/show/26866732-un-passo-fuori-dalla-notte", "http://www.goodreads.com/book/show/27393379-un-passo-fuori-dalla-notte", "http://www.goodreads.com/book/show/13573505-honor-bound"]}