{"ratings": 303, "userreviews": [{"userName": "Johnny", "userReviewDate": "Oct 26, 2012", "userURL": "http://www.goodreads.com/user/show/903066-johnny", "userReview": "One must describe more than the flesh-tearing qualities of minie balls, the sickening splinters of jaws being smashed by rifle butts, the bitter irony of facing “friendly fire,” or the soul-searing screams of soldiers facing (often unnecessary) amputations in order to paint the full mural of horrors for the so-called American Civil War (aka War Between the States or War of Northern Aggression). More than in any other historical novel I’ve read, Until the End manages to touch on the loss of hope, the destruction of families, the atrocities committed by men like Mosby’s Raiders upon their own people, and the psychological pain caused by “judgments” of civilians upon women who tried to help (being labeled as “camp followers”) and men who saved entire commands by ignoring the suicidal commands of inexperienced officers. This sequel to Look Away continues to use the “brother-against-brother” trope of its predecessor, but it continues to be a very rich vein of human feelings, aggregated and compounded into an emotional “Mother Lode.”The name of the book, Until the End comes from a particularly poignant line early in the book. A weary and frightened soldier asks a veteran how much longer “they” can expect the unit to continue facing such horrors of war. The veteran answers, “Until the end, my friend, until the end.” (pp. 109-110). I particularly liked General Gordon’s speech to convince Lee not to ride into the fore of a hopeless battle. “’These men,’ Gordon continued when Lee made no move to leave his self-appointed post, ‘are Virginians and Georgians. They have never failed. They never will. Will you boys?’ he asked as he turned his stern gaze down upon the soldiers who now pressed them.” (p. 167) This was a battle at Spotsylvania Courthouse and those Virginians (Yes, Coyle was depicting a real incident on this page) went on to lose over 130 of the roughly 175 men in one unit alone. That’s the stuff of which legend is made and it spices the fictional stories in the book which are even more compelling, though less larger than life.Speaking of those very human insights, there is an observation early in the novel when (one of the two brothers posed against the other, brother against brother) Kevin Bannon’s fiancée, Harriet, realizes that Kevin may be taking his leadership role too seriously. Yet, Kevin insisted that his ability to instill action and obedience was tied to the men’s fear of what he could do to them. “I’ve seen that look before, my dear. I saw the workers in my father’s terra-cotta works back in Perth Amboy look at my father in the same manner as he went by. And even though I was his son, and they knew it, they’d talk about him as soon as he’d go by. Just like a company commander, he had power over them and that, my dear, seems to be important, very important.” (p. 34) But Harriet decides that it’s her duty “…to save Kevin from falling victim to the all-consuming attraction of power and authority that had so twisted her own father and his.” (p. 34) Of course, I wouldn’t be unveiling spoilers to suggest that there is some dramatic foreshadowing in such a determination.Sadly, some of the lines are poignant in a different way. The next quotation represents one of the protagonists philosophizing before a battle and would certainly make one of the saddest possible epitaphs a person could give himself: “I’ve done everything that was expected of me, and nothing that was right. Every time I came face-to-face with a real decision, a real choice, I buckled.” (p. 316) At another point, I read as a beloved officer fell to the ground and one of his own men thought, “Wasn’t it fitting, after all, he reasoned, that the great should share the same fate as those they command?” (p. 329) Frankly, I was glad that I was eating dinner with a very spicy hot sauce when I finished this book. That way, my tearing eyes and running nose could be covered by the idea that the food was affecting me. The truth is that the conclusion of this book was emotional to me. One expects either a major reconciliation between the brothers or a death. The book ends in a plausible, realistic way that seems like a beautiful metaphor for the country—the survivors find a way to come together while mourning losses together. As highly as I rate this novel, I’m glad it isn’t a long series in the tradition of Sharpe, Audrey, Bolitho, and the like. Coyle’s Look Away and Until the End are emotionally draining books, more emotionally involving than any other historical novels I’ve read. As a result, I was war-weary by the end because I was empathizing with the protagonists."}, {"userName": "Lynne", "userReviewDate": "Jan 21, 2018", "userURL": "http://www.goodreads.com/user/show/68728634-lynne", "userReview": "Loved the story but lots of grammatical errors. Wish I could have fixed them as I read the story."}, {"userName": "Coralie", "userReviewDate": "Mar 11, 2010", "userURL": "http://www.goodreads.com/user/show/2684841-coralie", "userReview": "A 500 page novel of the Civil War. James and Kevin Bannon are brothers. James is fighting for the Confederacy and Kevin is fighting for the Union. This novel is the last in a set, continuing the story started in Look Away. Kevin and James were estranged as a result of a bitter conflict that ended in tragedy. James was sent down South to military school, where he came of age as the war began. This book starts in Virginia in 1863 and switches between James' experiences, in detail, on the battlefield, and Kevin's experiences in battle. Although the two have several near misses, they never meet each other in battle. It was a long book, full of gory fighting and lots and lots of loss of life. Both James and Kevin have love interests that continue to give them hope for life after the war. These girls' stories make the book more interesting. The ending was sappy, I knew the ending would be sappy, yet I cried at the ending anyway. If you like war stories, you would probably like this book. Most of the 500 pages deal with the battles, and they all seem the same."}, {"userName": "Graceann", "userReviewDate": "May 06, 2009", "userURL": "http://www.goodreads.com/user/show/643332-graceann", "userReview": "Please see my detailed review at Amazon Graceann's \"Until the End\" Review\"This had the same problems as Look Away, but also the same gifts. The supporting characters are so interesting, and there was one scene, in a field hospital, that had me in tears. If the rest of the book had been that good, it would have become one of my favorites of all time. Sadly, that excellence was fleeting."}, {"userName": "Jon Kurtz", "userReviewDate": "Feb 03, 2014", "userURL": "http://www.goodreads.com/user/show/25618438-jon-kurtz", "userReview": "A sequel to the novel Look Away, this story picks up after two brothers, on opposite sides of the war, face each other at the battle of Gettysburg. A well-researched and accurate account of the later years of the Civil War, Coyle uses the two perspectives to show the horrors and wonders seen by those serving on both sides. As the Union takes control and the south begins to crumble, family conflict overshadows the most devastating war in America's history."}, {"userName": "John Parks", "userReviewDate": "Feb 26, 2008", "userURL": "http://www.goodreads.com/user/show/946406-john-parks", "userReview": "Finished it. I guess it was what I could have expected. Actually, I really enjoyed reading the battle narratives. They were alive and engrossing and still very technical. Apparently they were very accurate, too. The author read and used many first hand accounts of the fighting from both the Rebel and Union troops. The rest of the novel, though, was pretty boring. I don't think I'll read the first installment (Look Away) in this 2 book series."}, {"userName": "Maurice", "userReviewDate": "Nov 05, 2008", "userURL": "http://www.goodreads.com/user/show/1683626-maurice", "userReview": "The sequel to the epic Civil War novel \"Look away\", and what a sequel.A thrilling and personal voyage through the bloody conclusion of the Civil War, seen through the eyes of the tormented Bannon family and their dependents. A beautiful conclusion of a beautiful book!"}, {"userName": "Bob Conner", "userReviewDate": "Jan 18, 2015", "userURL": "http://www.goodreads.com/user/show/30355634-bob-conner", "userReview": "A continuation of Look Away and the intensity is still fresh. I'm amazed at how well Coyle places his characters in historically accurate settings and brings it all home to witness. Good, Good, Good; very good."}, {"userName": "Dave", "userReviewDate": "Apr 26, 2009", "userURL": "http://www.goodreads.com/user/show/1607644-dave", "userReview": "Mr Coyle kind of loses his way with this attempt at moving into 19h century war from his usual cold war fare. If you want historical fiction set during Lincoln's War please stick with Bernard Cornwell or Michael Sharra."}, {"userName": "Glenn", "userReviewDate": "Jul 09, 2013", "userURL": "http://www.goodreads.com/user/show/2089243-glenn", "userReview": "Loved this one too!"}, {"userName": "Clive Warner", "userReviewDate": "Feb 13, 2008", "userURL": "http://www.goodreads.com/user/show/899341-clive-warner", "userReview": "Coyle writes well about the US civil war with an eye for authentic detail. He deals with it much more convincingly than EL Doctorow's recent attempt."}, {"userName": "Russ", "userReviewDate": "Aug 05, 2017", "userURL": "http://www.goodreads.com/user/show/42281645-russ", "userReview": "This was the second book in a 2 part series about 2 brothers who fought on opposite sides during the Civil War. There was great attention to detail regarding the battles, although they weren't the focal point of the book. Every day people, soldiers and civilians, not Generals, were what kept this story going."}], "description": "James and Kevin Bannon, the two brothers introduced in Look Away, continue to serve on opposing sides. James with the 4th Virginia Regiment and Kevin commanding a company in the 4th New Jersey. In their struggle to survive, their fear that one day they'd encounter each other on the battlefield was finally realized during the terrible conclusion of the third day at Gettysburg. Now, in the bloody aftermath of that titanic struggle, James and Kevin continue their brutal and bloody experience of war. From the dark and inconclusive days of the Mine Run Campaign in the fall of 1863, through the terrible \"Forty Days\" that took the two armies from the Wilderness to the gates of Petersburg, the brothers soldier on. James, with Lee's Army, watches as it slowly bleeds itself to death defending a state he has come to love. Kevin, living with the realization that James is serving in the army his nation is committed to destroy, marches with the Army of the Potomac as he alternates between a desperate search for James and his terrible burden as an officer, leading men he has grown to love into bloody battles that will claim their lives.", "title": "Until the End\n      \n          (U.S. Civil War #2)", "url": "https://www.goodreads.com/book/show/51612.Until_the_End", "average": 3.91, "cover": "https://images.gr-assets.com/books/1389406376l/51612.jpg", "reviews": 13, "authors": [{"url": "https://www.goodreads.com/author/show/19467.Harold_Coyle", "name": "Harold Coyle"}], "type": ["Historical", "Military History", "Fiction", "War", "War"], "outlinks": ["http://www.goodreads.com/book/show/51612.Until_the_End", "http://www.goodreads.com/book/show/35391151-until-the-end", "http://www.goodreads.com/book/show/34570.Team_Yankee", "http://www.goodreads.com/book/show/49592.The_Ten_Thousand", "http://www.goodreads.com/book/show/1036625.Bright_Star", "http://www.goodreads.com/book/show/34577.Sword_Point", "http://www.goodreads.com/book/show/1458508.Trial_by_Fire", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}