{"ratings": 8395, "userreviews": [{"userName": "Alp", "userReviewDate": "Jun 03, 2016", "userURL": "http://www.goodreads.com/user/show/26653561-alp", "userReview": "“You look awful.”He grinned in quick response. “You look pretty bad yourself,” he said with a teasing note in his deep voice. “Like you were in a plane crash and have been living in the wild for five days. The black eye is the crowning touch, though. At least you know for certain I didn’t fall in love with you because of how you look.”\nIf this book hadn't been written by Linda Howard, it would have turned out to be another survival handbook. But this is Linda Howard. Needless to say, she's a master of turning simple plots into engaging stories.As always, the author has a way of pulling me right into her books. She weaves romance, suspense, and a bit of humor and drama into the story of two people who were thrown together in a life threatening situation. I think the romance in this book could be considered slow-burning. I could feel the sexual tension between Cam and Bailey there, but it just gradually built up and then erupted into flame eventually. To be honest, I expected hot and sizzling romance like her usual work, but what could I do except to roll with it. Hmm...I can always find my ideal hero in LH’s male leads. Her heroes are alpha men who never play games and never give up. There’s no holding back, no nonsensical issues (like love or commitment issues), no pushing away, and no emotional weakness. And Cam is no exception. He is calm, but decisive and determined. When he realized that Bailey was the only one he wanted, he made up his mind that his bachelor days were over. I loved that he took their relationship seriously.How can one not love this man?Because of her love and trust issues, Bailey kept most people at her arms length, never allowed herself to lean on anyone. But after she and Cam had survived a plane crash, she could feel the bonds between them growing, and that scared the hell out of her. Cam determined to make her trust him and he wouldn’t ever let her pull away from him or go back to her former frostiness anymore.The thing that surprised me the most was the twist ending. My jaw dropped open in profound amazement. OMG! I couldn’t believe what I just read!Although Up close And Dangerous isn’t LH at her best, I enjoyed reading it a lot and found myself engrossed in the story that I almost lost track of time. This was an entertaining and worthwhile read. Fans of romantic suspense will certainly enjoy this one."}, {"userName": "Auntee", "userReviewDate": "May 05, 2008", "userURL": "http://www.goodreads.com/user/show/886675-auntee", "userReview": "This book won't be for everyone--even fans of Linda Howard may have a hard time with it, because a lot of it has to do with surviving a plane crash, and there isn't a heck of a lot of romance or suspense. But because I don't mind a plot that hinges on survival in the wilderness, for the most part I'd have to say I enjoyed it. Not that I didn't wish that LH would have included some more of this and less of that...The heroine, Bailey, is a 32 year-old attractive widow from Seattle with huge walls around her heart. She was involved in a brief marriage of convenience (for reasons I won't get into) and now that her rich husband's dead she's forced to deal with his two very spoiled, irresponsible, nasty adult children. To take a break from them she decides to go on a vacation with her brother and his wife, and needs to fly to Denver to meet them. She decides to fly by private plane and uses the company that her husband's corporation always uses, J&L Executive Air Limo. The pilot on this trip is one that Bailey considers a grim sourpuss, tall and broad shouldered Cam Justice.Cam thinks Bailey is cold and stuck-up, and figures the trip to Denver is going to be a looong one with her on board. But less than half way there, over some rugged, mountainous terrain, there's engine trouble, and Cam is forced to make a daring, last ditch landing among the treetops. By some miracle, Cam and Bailey survive, although Cam has a serious head injury. Bailey then goes into wonder woman mode (the woman exhausted and impressed me with all she was able to accomplish) and not only pulls the dead weight of Cam from the airplane, but stitches up his head wound, keeps him from dying of hypothermia, and erects a shelter for them. All of this while she has injuries herself. Cam is grateful, impressed, and turned on by Bailey, and makes plans to get around the walls she has around her heart. It will be days before a search team will find them. If they can stay alive that long, will that be enough time for Cam to worm his way into a very cautious, distrustful Bailey's heart?I really liked Cam. He was funny, sweet, and sexy, and appreciated a strong and smart woman like Bailey. Bailey was a bit prickly, and it took me a while to warm up to her. Once LH explained her past a bit, I saw where her attitude was coming from, and I cut her some slack. I liked her and Cam together, although I didn't totally buy the love story. I thought their 'love' might have been influenced a little by their dependence on each other for survival, but what the heck, I decided to go along with it and just enjoy it.I appreciated the survival part of the story, with all the ingenuity that Bailey and Cam showed about how to salvage the plane and the stuff they brought with them to keep themselves warm and alive. At one point though I was tired of all the suffering they went through and I was ready for them to be rescued!The suspense aspect of the plot? Well, the suspense of the plane going down was very harrowing and well-done, as well as the immediate aftermath as it's up to Bailey alone for their survival. Of course we know someone tampered with the plane, but we don't really know who (although LH serves up some prime suspects) or why. The revelation at the end threw me for loop though, as I just did not see that coming.Now the romance? This is where I though LH short-changes the reader. I loved the connection that Cam and Bailey shared as they struggled for days to survive. As Cam got better, his amorous side came out, and somehow (even while practically freezing to death and wearing layers and layers of clothing) he was able to put some moves on Bailey (verbally and physically), and the payoff (when Bailey finally succumbed) was hot and sweet. But I needed to see a little bit more of this emotional and physical connection . Even though the book was over 300 pages, I thought it ended rather abruptly. I needed to see Cam and Bailey under normal, every-day circumstances, to believe that their connection was true and that it would last. A nice little epilogue would've done that for me.Nothing wrong with the writing, the characters, or most of the execution of the story. If LH would've added just a little more, I would've bumped it up a notch. This was a good story, but certainly not one of LH's (who has a ton of wonderful reads) best. 3 1/2 stars"}, {"userName": "Mo", "userReviewDate": "Jan 19, 2017", "userURL": "http://www.goodreads.com/user/show/11856352-mo", "userReview": "I have had this book on my kindle for 5 years. Went thorough a bit of a LH phase some years back and bought quite a lot of her books. Not sure why I never read this one back then.A bit implausible at times. Not as good as some of the other books I have read by Ms Howard.This was Mrs MacGyver! Wow, she could do just about anything! LOL.\nThe hell of of it was, physically, he was an attractive man - not handsome, not a pretty boy at all because his face was too rugged for that, but definitely ... attractive.\nBit of a twist towards the end that I did not see coming.Overall, a good read but nothing out of this world."}, {"userName": "Jilly", "userReviewDate": "Jun 09, 2016", "userURL": "http://www.goodreads.com/user/show/25894509-jilly", "userReview": "Have you ever heard of MacGyver? It was a show in the '80's, I think, and was about some guy who could take a paperclip, a rubber band, and a straw - and somehow make a bomb. I never saw the show, but I've seen a lot of things making fun of it.Anyway, this book is more about the ingenuity of a couple who survives a plane crash more than anything else. If you are looking for straight forward romance, this isn't the one. If you are looking for a mystery - uh, no. The main thing you are going to find here is survival stuff. If you know who this guy is, you'll like this bookSo, we have our couple who hate each other get into a plane crash. Now, they have to help each other to survive, and guess what? The reasons they hated each other was wrong! How convenient! So, of course they fall in love! Who wouldn't fall in love while you are freezing, injured, bleeding, starving, dirty, dehydrated, and sick from the altitude? It's so romantic!The only way I'll find camping romantic is if it is in a hotel room with room service!But, there isn't a lot of the romance. Just enough to be kind of gross when you consider how disgusting they must smell.Dude! A tic tac? Anything! Since I enjoyed reading about how they made their own snowshoes and shelter, I liked this book. It is Bear Grylls approved!no urine was consumed in the telling of this story because they aren't idiots..."}, {"userName": "Shawna", "userReviewDate": "Jun 10, 2009", "userURL": "http://www.goodreads.com/user/show/1802746-shawna", "userReview": "4 stars – Romantic Suspense Although I didn't enjoy this quite as much as the other/older LH books that I've read, it's still an entertaining romantic suspense read. It's kind of like a Plane Crash/Rocky Mountain High version of Survivor. The banter between sexy, arrogant ex-military Texan pilot Cam Justice and his aloof, yet smart and tough widowed client Bailey Wingate as they battle the elements to survive is loads of fun, and they have sexual chemistry so hot that it melts her frosty demeanor and the snow around them!I tell you what...I had a lot of respect for Bailey's character. I think if I ever found myself in the same situation, that I'd be in big doo-doo (and complain a heck of a lot more too) because I sure wouldn't have thought of all the rugged, survival stuff she did. And the whole building a shelter thing sounded complicated and exhausting! Overall, this is a gripping romantic suspense read with a likable H/H, and it might even make you want to take a survival class!"}, {"userName": "DarienMoya", "userReviewDate": "Apr 16, 2010", "userURL": "http://www.goodreads.com/user/show/3069494-darienmoya", "userReview": "^^NOT THE MOST HAPPY OF WAYS TO GET CLOSE!^^So I read this book a few years ago, and truthfully I was not overly impressed. The second time around was a lot better if I do say so. I interpreted it a lot differently from the first time and found it amusing and very romantic regardless of the dire circumstances.Cam Justice is a pilot, not for a big airline, but a small independently own air fleet that takes rich people to their destinations. He loves his job and shares his work with his best friend and his lioness of a secretary, things are all good. On his day off he gets a call saying he has to fly Bailey Wingate because his partner had a serious allergic reaction and his unable to fly, He is not impressed because Bailey rubs him the wrong way, but he has no other choice.Bailey is looking forward to her mini vacation with her brother and sister-in-law. She wants to escape her evil step-children who hates her existence because she controls the money left by her husband their father. This marriage was basically a business situation, because the step-children are money hungry grubbers. So until they prove some form of maturity the money remains hers to handle and it is looking like forever. Well the vacation will be a welcomed breath of fresh air, until she learns who her pilot is, seems Cam also rubs her the wrong way and this flight looks like its gonna be tortuous.Well there is hardly anytime for uncomfortable moments when the plane sputters and the engine dies, and they crash in the snowy mountains. The book now becomes a matter of survival and remaining alive until they are rescued. What is surprising is that Bailey is the one who does the work of trying to keep them alive, because Cam is seriously injured and she can’t let them freeze to death. This woman comes off all man verses wild, and she handles business. Builds a shelter and works her ass of to make sure Cam remains alive. Nothing brings people together like plane crashes and almost dying it then becomes a classic case of never judge a book by its cover. Bailey thought Cam was a hard ass with his sourpuss face, and Cam thought Bailey was a snooty rich bitch and they realize that they were “oh so very wrong”. They come to realize they could love each other and it took a bloody plane crash to do it. I find it a metaphor for how ridiculi people can be, take time to get to know each other, take the time.Well we know they won’t stay in the cold forever, and some quick talk time and lets keep each other warm sex leads to rejuvenation, and melting snow for water and eating snicker bars. A look around the crash proves the plane was sabotaged and now its figuring it out who wanted them dead.Not a blow away by Linda Howard but I did like Cam he is the type of guy I wanna be stuck with if my plane crashes or something equally disastrous happens to me. The sex was warm enough and Bailey and Cam are good together, not heavy hitting on plot just a light read. I raised it to a 4/stars because I liked Cam, and the other characters are well done, those evil step children are spoiled."}, {"userName": " Chele", "userReviewDate": "Jul 09, 2013", "userURL": "http://www.goodreads.com/user/show/3782879-chele", "userReview": "[I had my doubts after awhile about who was the actual villain but I did not expect the twist at the ending. I also expected the H/h to pull away from each other for awhile after they reached civilization. I'm glad I was wrong. They stuck to the promises they made to each other. I loved their romance. (hide spoiler)]"}, {"userName": "Kinga", "userReviewDate": "Dec 25, 2013", "userURL": "http://www.goodreads.com/user/show/110812-kinga", "userReview": "We had no winter in UK this year. This was probably the first winter in my life with absolutely zero snow. I know the US had quite the opposite of that but we just got loads of rain. I’m Polish – I miss the snow and I miss the cold, so I asked people to recommend me romance novels with lots of snow and cold and people having to share their body heat to survive or some such.‘Up, Close and Dangerous’ was a perfect choice. The hero needs to crash land a plane with the heroine on board somewhere up in the mountains. Of course they don’t like each other at first but they need each other to survive, etcetera, etcetera. The survival bits were fantastic. I was very happy I was provided with every single detail – what they ate, what they drank, what they wore, how they built a shelter, and what afflictions they suffered from. I do love me a good survival story. The romance itself though, was lacking. If you took away all the excitement of being stuck in the wilderness, there just wouldn’t be much to it.First of all, there is one lesson I learnt from Sandra Bullock in Speed the Sequel and that is that the relationships formed in extreme circumstances hardly ever survive (that’s how they explain the lack Keanu Reeves in the sequel), so maybe these two should slow down with their talk of moving in together, marriage and living happily ever after, because even though I’m sure they learnt a lot about themselves in those three days of sharing their body heat, I don’t know if it is quite enough. I mean, they should be a bit traumatized after that ordeal and maybe some time off would actually be useful. Additionally, there is that final twist, and while I appreciate the author trying to make things more interesting, that twist means that both the hero and the heroine would need at least six months of intense psychotherapy to even be a normal, trusting person again. Jumping head first into a super-serious relationship would be the last thing anyone in such circumstances would or should do. And yet, I gave it four stars. Because in the end it did what I wanted it to do and that was to have a good snow-related survival story and outdoor sex scenes."}, {"userName": "Chitra *CJ*", "userReviewDate": "Dec 10, 2017", "userURL": "http://www.goodreads.com/user/show/46841583-chitra-cj", "userReview": "\"Up Close and Dangerous\" is the story of Bailey and Cam.When Bailey Wingate decides to take a much needed vacation with her family, she hires a private jet and vows to finally have some fun- away from her vicious stepchildren who hate her for having control of their fortunes.Her pilot turns out to be ex military, the brooding Cam Justice- who when the plane malfunctions, crash lands and saves their life.The book then revolves around them staying alive in plain wilderness, and the heroine being an ingenious, super efficient survival expert extraordinaire. She was highly resourceful, inventive and brave- and not only saved hers, but also Cam's life. The is subtle chemistry in the book, but it mainly is about them trying to pull through sustaining in the snow covered mountains, while their loved ones and friends try to piece the puzzle of what happened to them.There was a surprise reveal in the end which was semi-expected due to the hints in the last few chapters, but overall this was an engaging read.Female Bear Grylls, thy name is Bailey!Safe3.75/5"}, {"userName": "Miss Kim", "userReviewDate": "Jun 06, 2008", "userURL": "http://www.goodreads.com/user/show/925549-miss-kim", "userReview": "I've never read Howard before, and I was pleasantly surprised. Very good story and it was one of those 'can't put it down' books. It has a surprise ending, and a nice HEA. I recommend for any romance-suspense lovers."}, {"userName": "Mara", "userReviewDate": "Mar 19, 2018", "userURL": "http://www.goodreads.com/user/show/3954707-mara", "userReview": "What she said:https://www.goodreads.com/review/show.... To Aaron's words I'd like to add that there wasn't much suspence either. So, the romance wasn't believable, there was no real suspence, the minor characters were over the top bland, even the murderer, and the book ended in a phtttt. Ergo the 3 stars.I may have been moved to a better rating if the stepchildren had at the end at least seen any comeuppance. :/"}, {"userName": "Mojca", "userReviewDate": "Jul 27, 2008", "userURL": "http://www.goodreads.com/user/show/1359426-mojca", "userReview": "Although everyone believes Bailey Wingate is yet another throphy-wife, her marriage to Jim Wingate was merely a business arrangement. Jim needed someone to oversee the trust funds of his two adult, good-for-nothing children and Bailey, as his PA and quite investment savvy, was the perfect choice.Now Jim's dead and Bailey has to suffer through endless tantrums from her step-children, who hate her guts.Apparently they hate her enough to kill her, since, while flying to her two-week vacation, her Cessna runs out of gas and it's only thanks to the calmness of her pilot, Cameron Justice, the Bailey, the plane and the pilot don't splatter over a mountaintop.Now the two are stranded in the snowy wilderness with (almost) zero chance of being rescued, having to rely on their own ingenuity and each other...This was one heck of a book. In someone else's \"hands\" the almost claustrophobic atmosphere with just two characters and a whole lot of wilderness would have buried the story, yet Linda Howard skillfully maneuvered the plot, masterfully twining the scenes with Bailey and Cam with little tidbits about the secondary characters.While the romance did seem a little rushed at times, specially toward the end (the two didn't even like each other at the beginning!), the explanation was utterly plausible and believable. Stranded for six days with only one person for company, one is bound to develop some feelings toward their companion...Bailey and Cam were nicely drawn and Bailey's development extremely well done, adding a tad more to making the story-arc believable.I was surprised by how well the suspense part played out. The author masterfully led the reader to assume who the bad-guy was (wonderful delineation of the character, his inner turmoil, the hide-and-seek of clues), making the grand finale with its humongous and completely unexpected twist that more jaw-dropping.Kudos to the author. This is definitely a keeper."}, {"userName": "Wendy", "userReviewDate": "Mar 18, 2010", "userURL": "http://www.goodreads.com/user/show/1730638-wendy", "userReview": "I really hadn't heard anything about this book, but when I saw it in the used book store I thought it looked good. I wasn't wrong. Bailey Wingate is a woman that is taking care of the trust funds of her step children, who are about her same age. she only does this out of loyalty to her deceased husband and former boss. But it is a lot to handle and the \"kids\" are terrible to deal with. When she decides to take a vacation in Colorado, river rafting, she boards a small plane to take her from Seattle to Denver. but things aren't all peachy keen right from the first. The pilot that was scheduled is sick and she is stuck flying with Mr. Sourpuss. Then only a little way into the flight there is engine trouble and eventually the engine completely fails. thanks to the \"sourpuss\" he sets the plane down in some trees on the side of a mountain, which saves their lives, but they aren't out of the woods yet. Cam Justice is a loner but a great pilot. He runs his air limo business with his best friend and a grumpy secretary. When his partner gets sick at the last minute he has to jump in on that flight. It really shouldn't be a problem, except that he is flying a beautiful but cold and icy Mrs. Wingate. She makes it know that she doesn't like him. But when their plane crash lands in the Idaho Mountains her real self comes out and she shows him how caring, resourceful and determined she really is. She is also a very beautiful woman that he means to get close to. Over the next 5 days they fight the cold, hunger, and a desperate situation. They both surprise each other and show their true selves. And while they overcome obstacles and a work toward survival they also discover that they are very attracted to each other and find that they don't want to let what they have found go. I liked the mutual respect that the couple found in this book. It wasn't the typical man saves woman type of story. And I didn't see the twist at the end coming, which I usually do. I give this book 4 out of 5 stars."}, {"userName": "Nancy Steinle gummel", "userReviewDate": "Mar 11, 2015", "userURL": "http://www.goodreads.com/user/show/12968957-nancy-steinle-gummel", "userReview": "Up Close and Dangerous by Linda Howard is the pick for our book club and the first book of Lina Howard that I read. Bailey. Wingate is a youngt widow who was left as trustee to her late husbands estate to distribute monthly funds to her step children who are older than she is. The step children are Seth and his sister Tamzen. They hold resentment towards Bailey. After a nasty bout with Seth, she decides to go white water rafting with her brother and his wife. The Wingates have always used the same private airlines. Bret and his partner Cam. The day Bret was supposed to take Bailey from Seattle to Colorado his assistant called Cam and told him to get into the office prepared to take Bret's flight. When Cam got in Bret was Duffy his eyes were swollen shut, he looked horrible. Bailey pulled up with 3 large suitcases and a shoulder bag. Cam grabbed one suitcase and Karen grabbed the other 2. After they stowed the luggage they got into the plane. No small talk Bailey kept it all business. They got underway after Cam did his check up. When they reached the mountain over Idaho, the engine sputtered. Cam checked all the switches then the plane shut down. They were going to crash. Cam maneuvered the plane on the thermals till he almost reached the tree line. Then they crashed. Read on to discover how they survived and who sabotaged the plane."}, {"userName": "Christel", "userReviewDate": "May 22, 2008", "userURL": "http://www.goodreads.com/user/show/655568-christel", "userReview": "Picked this one up today at the grocery store after reading the back of the book I was interested. Pretty dang good of I say so myself.Bailey Wingate has scheming step-children who would rather see her dead then alive. Saying she is younger than her stepkids and have the control of their multi-million dollar trust funds she could see why. After putting up with all the poop she can handle form them for the past year, she decided to get away for herself and meet her brother and sister-in-law in Colorado for a 2 week vacation from all the worries and arguements.Cameron Justice was a KC-130 tanker pilot in the Air Force and when he got out of the military he and his best friend Bret decide to start an air charter service. Well their charter service deals with Bailey's deceased husbands company, Wingate LTD. On the way to Colorado, Cam's and Bailey's plane crash lands in the Idaho mountains. Stranded int he wilderness they fight for survival and fall in love at the same time.But who did the sabotaging of the aircraft??? Good question. You would not believe who does it??? I won't say more just you gotta read the book."}, {"userName": "Lacey", "userReviewDate": "May 29, 2018", "userURL": "http://www.goodreads.com/user/show/44128297-lacey", "userReview": "I listened to this book on audio CD. It was pretty good for an abridged thriller. Although I could have done without the cringe-worthy love scene. Oh, and this cringe-worthy quote when the main character (female) was mad at the love interest (male), which occurred shortly before the love scene:\"I wanted to grab his penis and twist it. Then his 'Good-Time Charley' would have to be called a 'Twisted Charlie'.\"Umm, WTF. That was a really strange comment, even if you are mad. Too weird not to share, lol."}, {"userName": "Katherine 黄爱芬", "userReviewDate": "Mar 15, 2016", "userURL": "http://www.goodreads.com/user/show/3839010-katherine", "userReview": "Bailey yang merencanakan akan pergi liburan arung jeram ke tempat adiknya, tidak menyangka akan mengalami hari nahas dimana pesawat carterannya kandas di pegunungan, meninggalkan dirinya dan si pilot Cam Justice yang luka parah. Ternyata akibat pesawat kandas bisa berefek macam-macam. Efek positif pertama, Anda bisa diet instan tanpa harus bayar mahal. Efek kedua, akibat keterbatasan sarana \"kemping darurat\" mengeluarkan sisi kreativitas tinggi Bailey utk menggunakan segala bahan yang ada tersedia. Seperti nonton film Survival Life di Discovery Channel, Bailey berubah dari seorang wanita dingin dan menjaga jarak, menjadi wanita tangguh dan siap mengorbankan apa saja supaya bisa bertahan dlm kekejaman cuaca di hutan rimba bersama Cam. Itu berarti menghabiskan malam2 berpelukan bersama utk menghalau angin dingin bersalju, menjahit luka parah di kepala Cam, membuat tenda darurat dari bangkai sisa-sisa kapal kandas ala MacGyver dll. Mungkin efek yang tidak dinyana oleh Bailey adalah dia membuka topeng dirinya pada Cam Justice, kapten yang semula dianggapnya dingin dan menyebalkan, tetapi pelan-pelan berubah menjadi pria yang minta ditampol..... bibirnya. HAH!!!! Tapi sebelumnya, siapakah yang mengincar nyawa salah satu dari mereka sehingga tega menyabotase kapal terbang tersebut? Dan mampukah Bailey tetap menjaga hatinya dari bombardir pria yg kompeten layaknya Cam?Buku ini menyegarkan karena setelah sekian lama membaca buku novel Linda Howard, saya kembali merasakan aura sarkasme dan hiperbola yang selalu saya nantikan. Perubahan karakter chemistry tokoh-tokohnya mulus dan masuk nalar utk ukuran love at first sight. Tema ttg terperangkap dalam salju, mengingatkan saya pada buku Chill Factor by Sandra Brown \n, dibandingkan buku tsb, saya lebih memilih buku ini walau kadar unsur suspense dalam buku ini jauh lebih sedikit, tetapi unsur ketegangan tetap ada, naluri utk bertahan hidup dalam keadaan apapun tetap lebih menarik drpd mencari siapa tokoh busuk dibalik semua masalah ini."}, {"userName": "Emily", "userReviewDate": "May 05, 2011", "userURL": "http://www.goodreads.com/user/show/4365117-emily", "userReview": "Widower Bailey Wingate is ready for a much needed vacation with the constant verbal abuse from her adult stepchildren is taken to a higher level. When she boards the plane and see Pilot Cam Justice, she knows it is going to be a long journey. although she finds him attractive she knows he thinks she is a trophy wife, which is farther than the truth.Cam Justice has not been able to break through the icy exterior Bailey casts off, having flown with her a few times she is not his favorite passenger but called in last minute to replace another pilot has him heading out. When the plane falters, Cam realizes they are in trouble and will need to make an emergency landing. Can two strangers work together to survive the wilderness, until they can be rescued?Completely stressed me out, but in a very good way. This was an edge of your seat, nail bitter, wild ride. Linda Howard has such a way of describing the scenery and what was happening, I got chills. I am almost disappointed I am done with this one I could have read more, would definitly reread."}, {"userName": "Glamdring", "userReviewDate": "Jan 12, 2014", "userURL": "http://www.goodreads.com/user/show/6599667-glamdring", "userReview": "I really enjoyed listening to this audio book. I specially enjoyed how the narrator did Cam southern drawl... I liked Bailey and Cam couple and Linda Howard did an awesome job researching about surviving a crash plan, but I would have loved the book more if there was more romance and suspense and little less surviving stuff."}, {"userName": "Zeek", "userReviewDate": "Apr 26, 2011", "userURL": "http://www.goodreads.com/user/show/2478293-zeek", "userReview": "I have seen some of the less than stellar reviews floating around out there for Up Close and Dangerous, and knowing I've been mostly underwhelmed by LH's work here of late, I wasn't expecting much. Still I had hope that maybe, just maybe, she might one day get back to the magic of yesteryear. Once I finally got time to read it, I was pleasantly surprised.I wasn't really disappointed with this one.Oh I'm not saying it's all there- all the joyful fangirl glee I used to feel with her work- but there was definitely glimpses of old glory in this one.Sticking with her romantic suspense success, LH starts UC&D off with a peek at our erstwhile heroine's life. Bailey Wingate, The widower of an arranged marriage- arranged by she and her deceased husband- is in charge of dead hubby's bratty kids trust funds. She does an excellent job of it- and they hate her for it. I mean killing hate her for it.Thankfully Bailey's got a vacation planned and is packed and loaded for bear. (Pssst, She's going white water rafting.) So, she heads out to meet her brother and sis-in-law with Cam Justice, That's Captain Justice to you, her personal pilot for the day.Yeah you guessed it, the plane goes down, but thanks to our hero's top notch flying skills AND our plucky heroine (who just happened to over pack for her vacation leaving them with just about what they needed to survive surviving a plane crash till help comes along ) they live- and fall in love.Ok, Ok all kidding aside- this book is rather easy. Although there is a bit of a twist as to who the \"baddie\" actually is, (No,I didn't go with the glaringly obvious wanne-be killer because it just screamed it too loudly)-it's a simple romantic suspense plot line. Let's face it, LH basically started the trend toward romantic suspense awhile back- or at least was instrumental in moving it along- can you blame her for falling back on what made her great?So yes, basically LH held our hands through this one, obviously not wanting to strain our attention span, but you know what? I just don't care. I liked Cam and Bailey. I liked her pluckiness and his pride. It's a tried and true method, **cough cough** Jane Austen **cough cough** and it works, dammit.Now if only LH wouldn't have rushed the ending so much. (HA! I swear it was like I heard her say, \"I'm tired of writing now, so let's wrap this thing up.\")Something feels \"done before\" about it, and, as somebody already said, it surely isn't a Mr. Perfect, still I think you might like it if you give it half the chance. It is a Linda Howard after all."}, {"userName": "Cata", "userReviewDate": "Jun 07, 2013", "userURL": "http://www.goodreads.com/user/show/7100011-cata", "userReview": "Íntimo e Perigoso foi mais uma estreia para mim! Li-o porque era o livro seleccionado para o BookClub RSunshine!Infelizmente não consegui encontrar o livro na biblioteca, nem tive possibilidades de comprar o livro, pelo que arranjei um daqueles e-books manhosos em PT-BR [o que foi óptimo, considerando que era ler em e-book ou não ler de todo]. O problema desses e-books são mesmo as traduções que são de meter medo ao susto. Há de tudo: verbos mal conjugados, palavras mal escritas, trocas absurdas eu/ela/ele e trocas de género masculino/feminino. Obviamente, a péssima tradução retirou prazer à leitura, o que se reflecte na classificação e apreciação do livro. Quanto à história, tal como já referi aos membros do BookClub, temia que fosse parecida com o Calafrio de Sandra Brown [que não gostei], mas felizmente tal não se verificou. Gostei da história, gostei do humor e descontracção da autora e senti empatia pelos personagens, pelo que nesses aspectos, foi uma experiência positiva.Acho que por vezes a autora foi um pouco fantasiosa [como alguém à beira do colapso e sem treino médico coser a cabeça de outra pessoa que está igualmente à beira da morte], mas não foi excessivamente fantasiosa, uma vez que isso aconteceu em situações extremas.Fiquei um pouco triste com o final, pois esperava algo mais desenvolvido, mas não foi mau de todo. Seria bom ver o Cam , a Bailey e o Seth algum tempo depois para ter um vislumbre de como se aguentaram e ver Tamzin na rua da amargura [afinal a mulher era irritante e má como tudo], mas suponho que já estou a pedir de mais.Espero um dia vir a ler este livro com a tradução oficial PT-PT [que já me constou que é boa] ou em inglês. De realçar que a SdE está a fazer uma promoção no site em que os 3 livros da autora publicados pela SdE estão a 16,20€"}, {"userName": "Jane Stewart", "userReviewDate": "Sep 27, 2010", "userURL": "http://www.goodreads.com/user/show/3789528-jane-stewart", "userReview": "Nice story. Good characters.Most of the book took place on the mountain where Bailey and Cam had to survive cold, hunger, thirst and injuries. This was more of a survival story than a suspense story. I loved Bailey's common sense strength and how she saved Cam's life. I was drawn to both characters while watching their decisions and actions during their mountain experience. There was a mystery as to who sabotaged the plane. The ending was good. The side story about Seth was interesting. There is some romance but not a lot.STORY BRIEF:Cam is pilot of a charter plane flying Bailey. She is the widow of a wealthy man. They didn't like each other before this trip. The plane crashes on a mountain and they start seeing the true character and personality within each other and eventually fall in love.AUDIOBOOK NARRATOR:Natalie Ross was excellent.DATA:Narrative mode: 3rd person. Story length: 325 pages. Swearing language: s*** used once. Sexual language: mild. Number of sex scenes: two. Setting: current day Seattle and mountains near Utah. Copyright: 2007. Genre: romantic suspense."}, {"userName": "Kathleen", "userReviewDate": "Oct 25, 2012", "userURL": "http://www.goodreads.com/user/show/13954899-kathleen", "userReview": "3.5 stars. Cam's small charter plane crashes in the remote snow-covered mountains somewhere around Hell's Canyon, Idaho. He is concussed. His passenger, the wealthy widow Bailey Wingate, keeps him alive till he's ready to hike out. In the worst conditions, Cam falls in love with Bailey, realizing she's not the cold stuck-up B he always thought. A book about surviving the cold, similar to Ice -- minus the meth-heads. There are some smexy scenes, some sweet scenes, and a little suspense, with a twist. I felt the saboteur was identified too easily. Why would anyone jump to that conclusion?Quibbles: I would give it 4 stars if it had a nice long epilogue, and if fewer pages were devoted to explaining all the details of survival. Also, too much mental reflection on Bailey's part slowed the pace.Still, I really liked it. Loved this couple, both the hero and the heroine.  Update: 11-30-2014 : The audio by Natalie Ross is very good, with the same quibbles as when I read the book."}, {"userName": "Pamela(AllHoney)", "userReviewDate": "May 05, 2008", "userURL": "http://www.goodreads.com/user/show/884792-pamela-allhoney", "userReview": "For the mystery/suspense part I'd give it 5 stars but there were times I felt I was reading a survival guide and well, got a little bored. But all in all it wasn't bad and I'd recommend it to those who enjoy romantic suspense."}, {"userName": "Samantha", "userReviewDate": "Jan 08, 2010", "userURL": "http://www.goodreads.com/user/show/3073706-samantha", "userReview": "This was basically a how to survive a plane crash guide. Each chapter focuses on a new task that was completed to survive the plane crash. The bad guy didn't really make sense to me. The logic was there but it was stupid. I don't recommend this book. Very little romance and too many instructions."}, {"userName": "Cheri", "userReviewDate": "Jan 23, 2017", "userURL": "http://www.goodreads.com/user/show/56571595-cheri", "userReview": "Very slow going but the end truly surprised me"}, {"userName": "Nadia", "userReviewDate": "Apr 05, 2016", "userURL": "http://www.goodreads.com/user/show/25547640-nadia", "userReview": "I loved it! Highly recommended."}, {"userName": "Ana", "userReviewDate": "Nov 24, 2013", "userURL": "http://www.goodreads.com/user/show/18630059-ana", "userReview": "Gostei muito desta primeira abordagem à escrita de Linda Howard. Um livro que e lê rapidamente tal é o ritmo da acção, com uma dose certa de romance e mistério."}, {"userName": "Aarann", "userReviewDate": "Jun 12, 2015", "userURL": "http://www.goodreads.com/user/show/5173517-aarann", "userReview": "[I don't care what your weird math says -- being stuck in a life-or-death situation with a stranger is not the equivalent of 19 dates. First of all, the math is faulty and doesn't account for time spent sleeping and just plain away from each other while supplies were being gathered and shelters made. It also assumes they spent the remainder of the time talking and much of their energy was spent with just staying alive. I don't care what weird math they used -- these two did not know each other well enough to declare undying love within a few days, even if you discount the whole fact that they were in an intense, emotional situation. The whole thing just seemed rather... Because the Romance Publisher Said So. (hide spoiler)]"}, {"userName": "Thenia", "userReviewDate": "Sep 16, 2015", "userURL": "http://www.goodreads.com/user/show/1216094-thenia", "userReview": "[It was Cam's partner who sabotaged their plane, because apparently he was in debt and thought an easy way to get some money was through Cam's and the plane's insurance. Stupid reason, but people do impulsive, stupid things and he did regret it the moment he realized what it meant. (hide spoiler)]"}], "description": "Bailey Wingate's scheming adult stepchildren are surprised when their father's will leaves Bailey in control of their fortune, and war ensues. A year later, while flying from Seattle to Denver in a small plane, Bailey nearly dies herself when the engine sputters --- and then fails.Cam Justice, her sexy Texan pilot, manages to crash-land the aircraft. Stranded in the wilderness, and struggling to douse her feelings for the ruggedly handsome man by her side, Bailey begins to wonder whether this was a mere accident. Who tampered with their plane? Who's trying to reunite Bailey and her husband in the afterlife? Cut off from the world, and with little hope of rescue, Bailey must trust her life --- and heart --- to Cam, as they battle the harsh elements to find a way out of the unforgiving wilds and back to civilization ... where a killer may be waiting to finish the job.", "title": "Up Close and Dangerous", "url": "http://www.goodreads.com/book/show/255679.Up_Close_and_Dangerous", "average": 3.85, "cover": "https://images.gr-assets.com/books/1388350770l/255679.jpg", "reviews": 431, "authors": [{"url": "https://www.goodreads.com/author/show/16961.Linda_Howard", "name": "Linda Howard"}], "type": ["Romance", "Romance", "Suspense", "Mystery", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/255679.Up_Close_and_Dangerous", "http://www.goodreads.com/book/show/39687269-up-close-and-dangerous", "http://www.goodreads.com/book/show/7056115-up-close-and-dangerous", "http://www.goodreads.com/book/show/3261359-up-close-and-dangerous", "http://www.goodreads.com/book/show/1959612.Up_Close_and_Dangerous", "http://www.goodreads.com/book/show/24458134-up-close-and-dangerous---cinta-sarat-bahaya", "http://www.goodreads.com/book/show/17410952-ntimo-e-perigoso", "http://www.goodreads.com/book/show/6596756-ntimo-e-perigoso", "http://www.goodreads.com/book/show/469901.Mr_Perfect", "http://www.goodreads.com/book/show/420739.After_the_Night", "http://www.goodreads.com/book/show/72623.Dream_Man", "http://www.goodreads.com/book/show/420734.Open_Season", "http://www.goodreads.com/book/show/662323.Mackenzie_s_Mountain"]}