{"ratings": 187, "userreviews": [{"userName": "Reem Alkhalaf", "userReviewDate": "Mar 10, 2018", "userURL": "http://www.goodreads.com/user/show/44142877-reem-alkhalaf", "userReview": "It wasn't that good, the previous parts were much better."}, {"userName": "HannahGrace Rempala", "userReviewDate": "Oct 11, 2017", "userURL": "http://www.goodreads.com/user/show/59003010-hannahgrace-rempala", "userReview": "Username: Uprising is the 3rd and final book in the Username trilogy by Joe Sugg. The username storyline follows a girl named Evie discovering an app her Father made called the E.scape. This app was meant to be a place for Evie to escape for hours on end inside the game but only minutes in real life. After the events of the first book and the escape of the e.scapes outcast in the second it brings us onto the third book. The third book follows Evie, Mallory, Lionel and Jaspar as they try to figure out how the e.scape as ripped portals throughout the world, fight the army coming through it and how to save the world.Uprising in my opinion was an alright ending to the username trilogy, it left the series open for one's own interpretation but if wanted would allow the author to continue the series. The main things I liked about this books was how it brought a message to the reader that related to the real world, how there was also some typical teenage problems before and the relationships that grew between the characters. I also liked how the book kept me wanting to continue reading. Throughout this book it talks about the idea of how we are to connected to our devices and don’t realises or see anything that happens around us. In the first part of the book we see the Knox (an e.scape outcast left in the real world) noticing these things, partly because they didn’t really realise he was there. Knox decided to put this to a test, he shot someones drone with his bow and arrow and the only thing people were worried about was if someone got it on video. I really thought this speaks of the world now a days because we may go down that same track as we are so fixed on using devices. During this book the world also experiences a total black out, after only 29 days the president of the country the book is set it says we must put devices in our history. For me I thought that he was giving up to easy, but then again at this time there was also a portal that ripped into the world and they were most likely sparked by that too. One of the nice things to see at the start of Uprising was normal typical teenage problems. After the last two books centered around the escape it was nice to see the worry about things other than an app. They were complaining about cleaning up the hall and toilets after their prom/ball, Mallory and Jaspar had broken up and they were trying to ignore but impress each other after as well as Lionel and Evie being stuck in the middle of it. Even when we first see the portals from the escape to the real world we see Evie locking herself away in her room for the majority of the time because she thinks it is all her fault. This showed that even then they were still only human and had consequences to past actions. One of the things I loved about the book was the relationships that grew during the crisis. Evie and Mallory were not where near close during the first and even most of the second book but throughout this one we see both of them getting along, Mallory sort of took Evie under her wing. We also see a good friendship grow between Lionel and Jaspar as well, but more importantly we see the whole gang come together after such tough times. Evie and her Mother also patch things up at the end of the book as well and have a mutual understanding of what they both have to do. One of the things I didn’t like about this book so much was how there was so many deaths and sacrifices. First it was River, then Unity and after that BOTH Evie and her Mum!! This was definitely a downside to the book because after all that has happened it ended with a sacrifice where Evie and Her Mum had to overpower the app by jumping into its core. Evie wouldn’t sacrifice Knox but she would sacrifice both herself and her mother (even though theoretically Know would then die anyway if the whole E.scape dies because he is part of the games code). The only good thing that came out of the sacrifices was the after it was done Mallory and Jaspar took Lionel in and created their new trio. Although all in saying this the ending Lionel gets a message from the E.scape so maybe Evie isn’t gone after all. The message is what I think is left for one's own interpretation because it leaves the book open with so many questions. It also allows the author to be able to continue the series again if he wishes. For me the ending was good as it meant that at least the trio new that there was hope. Other things I found about this book was that the illustrations seemed to be nicer maybe even richer. The drawings to me just seemed to have a nicer finish and looked more effective making me wanting to continue reading. Overall this book was a great ending to the username series. It makes the reader ask questions about our world and the devices we are so attached to. It also leaves the ending with a closed but opening ending, it gives us hope that maybe there is more to come."}, {"userName": "océane (une.bibliotheque)", "userReviewDate": "Jan 14, 2018", "userURL": "http://www.goodreads.com/user/show/32906539-oc-ane-une-bibliotheque", "userReview": "Evie decided to put the whole e.scape adventure behind her and focus on her friends, however one character of the digital world stayed on earth, plotting his revenge. facing an uprising on a global scale, with evie's determination and the help of her friends from both worlds, she will try to restore peace at all costs.four out of five starswow, what an intense but sad finale. i was certainly not expecting this. it is the best book of the trilogy, there is no denying it. the plot was full of actions (even if it started a bit slow), and the ending is left for one's own interpretation, that's what i find really interesting. the relationship between Evie and her friends is stronger than ever, and that is something worth noticing because there is no romance as the main plot and that is rare guys. i think now more and more books are now focusing on friendship rather than on romantic relationship.however i was sooooooooooo disappointed because River died so quickly, i still can't understand why. i was hoping to see more of him but no.it is a reminder that we spend a lot of time on our phone and computer, that we do not always pay attention to what is happening around us. so thanks Joe and his crew for the ride, it was nice to discover another world."}, {"userName": "Maja Kron", "userReviewDate": "Feb 10, 2018", "userURL": "http://www.goodreads.com/user/show/19098217-maja-kron", "userReview": "This series has improved with every book and I love to see that development. This was even better than the other two and it was more action packed and the storyline and the characters and the writing, everything was just better in this one. The ending night be my favorite part of all three books, it had a great meaning to it and it was also Ipren for your own thoughts, just what an ending should be like. This trilogy has been a fun Journey and I’m sad to see it go."}, {"userName": "Elouise", "userReviewDate": "Oct 27, 2017", "userURL": "http://www.goodreads.com/user/show/63235088-elouise", "userReview": "Wow, I'm actually speechless. This was probably my favourite book from the Username: Evie series. The pictures were and still are incredible, the story line was griping and towards the end incredibly sad. It was so good to see all the characters grow and become best of friends. Defiantly sad to see the end of this series, but was great while it lasted. Like I've said in my other reviews for Joe Sugg's books I've never really enjoyed graphic novels, but after reading these I've really found a great love for them. I'll defiantly be picking some more graphic novels up, and hopefully some of them will be written by Joe Sugg again!"}, {"userName": "Madison Loveday", "userReviewDate": "Nov 11, 2017", "userURL": "http://www.goodreads.com/user/show/54339765-madison-loveday", "userReview": "This book was probably my favorite book from the Username series. The illustrations are awesome! It was so good to see all the characters grow and become really good friends. I was definitely sad to see the end of this series, but it was great while it lasted. I highly recommend reading the Username series.I've never really enjoyed graphic novels, but after reading this series I've really found a great love for them. I'll definitely be picking up some more graphic novels and hopefully some of them will be written by Joe Sugg again."}, {"userName": "Sian", "userReviewDate": "Jan 15, 2018", "userURL": "http://www.goodreads.com/user/show/29408768-sian", "userReview": "I feel a little indifferent about this instalment, I was definitely expecting more, although the graphics and illustrations were undeniably well drawn. I thought it was an interesting choice for Joe Sugg to give himself a cameo as well..."}, {"userName": "Lauren Cotter", "userReviewDate": "Oct 01, 2017", "userURL": "http://www.goodreads.com/user/show/70635133-lauren-cotter", "userReview": "Probably the best book I've read all year. Love username:Evie and username:Regenerated. This book tops it all. Absolutely amazing!"}, {"userName": "Rebekka Hindbo", "userReviewDate": "Oct 01, 2017", "userURL": "http://www.goodreads.com/user/show/31357892-rebekka-hindbo", "userReview": "Started out slow but had a beautiful if not sad ending."}, {"userName": "Jennifer Wiget", "userReviewDate": "Oct 17, 2017", "userURL": "http://www.goodreads.com/user/show/45398850-jennifer-wiget", "userReview": "what an intense finale! loved it!!"}, {"userName": "Aimee Funnell", "userReviewDate": "May 03, 2018", "userURL": "http://www.goodreads.com/user/show/58833233-aimee-funnell", "userReview": "Read this book purely to find out how the series ended, and it actually ended quite well. I’m not really a huge reader of graphic novels, but enjoyed this series"}, {"userName": "QueenOfBooks", "userReviewDate": "Jan 16, 2018", "userURL": "http://www.goodreads.com/user/show/75800603-queenofbooks", "userReview": "The ending made me cry. Such a great read."}, {"userName": "Francesca", "userReviewDate": "Oct 03, 2017", "userURL": "http://www.goodreads.com/user/show/58585949-francesca", "userReview": "This best book out of the trilolgy in my opinion, loved the storyline and the ending was very emotional which I find a love in books if it does have a volta in the end and an emotional ending."}, {"userName": "Sophie", "userReviewDate": "Nov 15, 2017", "userURL": "http://www.goodreads.com/user/show/38546408-sophie", "userReview": "I see what you did there on pages 36 and 100, Joe Sugg! 👀 👏🏼 😂"}, {"userName": "Alice Vanhoucke", "userReviewDate": "Aug 19, 2017", "userURL": "http://www.goodreads.com/user/show/42492705-alice-vanhoucke", "userReview": "It was lovely. Thank you Joe Sugg."}, {"userName": "Blue H.", "userReviewDate": "Mar 27, 2018", "userURL": "http://www.goodreads.com/user/show/61460011-blue-h", "userReview": "The thing is , i can't even remember why i liked this series at the first place. Probably because I liked Joe Sugg before but now, i can't even remember the storyline of this! I was so confused why this certain scene is happening. I guess i read too much books or it wasn't that memorable whatsoever, i am unsure."}], "description": "BOOK 3 IN THE USERNAME SERIES Evie and the gang return to face new challenges and resolve the rift between the online and offline world.", "title": "Username: Uprising\n      \n          (Username #3)", "url": "http://www.goodreads.com/book/show/36206433-username?from_choice=true", "average": 4.02, "cover": "https://images.gr-assets.com/books/1504895095l/36206433.jpg", "reviews": 17, "authors": [{"url": "https://www.goodreads.com/author/show/13435870.Joe_Sugg", "name": "Joe Sugg"}, {"url": "https://www.goodreads.com/author/show/14779172.Amrit_Birdi", "name": "Amrit Birdi"}], "type": ["Sequential Art", "Sequential Art"], "outlinks": ["http://www.goodreads.com/book/show/36206433-username", "http://www.goodreads.com/book/show/36284741-username", "http://www.goodreads.com/book/show/34444298-username", "http://www.goodreads.com/book/show/34622613-username", "http://www.goodreads.com/book/show/25898265-username", "http://www.goodreads.com/book/show/29890569-username", "http://www.goodreads.com/book/show/35997259-username-evie"]}