{"ratings": 7929, "userreviews": [{"userName": "Diane", "userReviewDate": "Jan 11, 2014", "userURL": "http://www.goodreads.com/user/show/279256-diane", "userReview": "A little Wodehouse is good for the soul.I chose this fun volume of Jeeves & Wooster because I needed some cheering up after finishing a long and depressing tome (I'm looking at you, Donna Tartt) and now all is well again. Right ho!\"Very Good, Jeeves\" is a collection of 11 short stories featuring everyone's favorite valet (\"a personal gentleman's gentleman,\" as Jeeves describes himself) and the ongoing scrapes of Mr. Bertie Wooster. In each story, either Bertie or one of his friends and relatives is in a bind, and fortunately for everyone, Jeeves is always there to advise and set things right. Goodreads lists this collection as being fourth in the series, but the marvelous thing about reading Wodehouse is it doesn't seem to matter which book you pick up first -- he's such a brilliant comic writer that you can pick up any Jeeves story and you're immersed. Each story makes sly references to previous adventures, but it won't hamper your enjoyment if you don't recognize it.This is only the second Jeeves & Wooster book I've read, but I enjoy them so much I plan to read the whole set. One of the things I especially love about them is that the stories are narrated by Wooster, who can be such a bumbling fool that it's hilarious whenever he tries to go against Jeeves. \"You know, whatever you may say against old Jeeves -- and I, for one, have never wavered in my opinion that his views on shirts for evening wear are hidebound and reactionary to a degree -- you've got to admit that the man can plan a campaign. Napoleon could have taken his correspondence course. When he sketches out a scheme, all you have to do is follow it in details, and there you are.\"Right ho!"}, {"userName": "Jason Koivu", "userReviewDate": "Oct 17, 2016", "userURL": "http://www.goodreads.com/user/show/1742824-jason-koivu", "userReview": "One of the earlier Jeeves & Wooster, Very Good, Jeeves sees Wodehouse with some matured characters, but a plot that is still taking baby steps.If memory serves (and it seldom does, so take that with a necessary grain of salt!), the first few \"Jeeves\" books Wodehouse penned were written as short stories. This one definitely is and I'm not a huge fan. Or perhaps I should say that I prefer the full length novellas of later books. These shorts felt like they were just getting off the ground only to suddenly land. The books wherein Jeeves and Wooster get to flap their wings for the length of a novel are much more satisfying. Short though they may be, almost all of these stories pack a solid comedic punch.While the stories change faces over the course of nearly a dozen shorts, the faces of the characters stay mostly the same, thus retaining a certain sense of continuity. Bertie's \"friends\" and/or old school chums Tuppy Glossop and Bingo Little pop up occasionally. That spunky bird Bobbie Wickham sticks her nose in now and then to make Bertie's life more taxing. His mostly-beloved Aunt Dahlia likewise prods poor Bertie from time to time to make sure he's not idle, much to the delight of us readers.The collection includes:\"Jeeves and the Impending Doom\"\"The Inferiority Complex of Old Sippy\"\"Jeeves and the Yule-tide Spirit\"\"Jeeves and the Song of Songs\"\"Episode of the Dog McIntosh\" (US edition: \"Jeeves and the Dog McIntosh\")\"The Spot of Art\" (US edition: \"Jeeves and the Spot of Art\")\"Jeeves and the Kid Clementina\"\"The Love That Purifies\" (US edition: \"Jeeves and the Love That Purifies\")\"Jeeves and the Old School Chum\"\"Indian Summer of an Uncle\" (US edition: \"The Indian Summer of an Uncle\")\"The Ordeal of Young Tuppy\""}, {"userName": "Algernon", "userReviewDate": "Mar 03, 2015", "userURL": "http://www.goodreads.com/user/show/4728718-algernon", "userReview": "- Jeeves, have you ever pondered on Life?- From time to time sir, in my leisure moments.- Grim, isn't it, what?- Grim, sir. All Bertram Wooster wants from life is a good night's sleep followed by a hearty breakfast, a whole day lazing at the Drones Club and maybe a vaudeville show in the evening, but troubles seems to gather around him like bees around honey. His favorite analogy is \"landing in the soup\", usually with a push from the long queue of friends and relatives who come knocking on his door. Grim, indeed! But what rich source of inspiration for Wodehouse, and what joy for the reader who, despite the rather repetitive nature of the plot twists, is always entertained by the efforts of the characters to either woo a young lady or to be released from an impulsive engagement. By the fourth book in the series, most readers know that Bertram is incapable of getting out of the soup by his own means ( If you ask my aunt Agatha she will tell you - in fact, she is quite likely to tell you even if you don't ask her - that I am a vapid and irreflective chump. Barely sentient, was the way she once described me: and I'm not saying that in a broad, general sense she isn't right.), and relies on his \"gentleman's gentleman\" Jeeves to deliver the solution. As usual, the main attraction is not so much in the plot, but in the delightful use of the English language, with the occassional French thrown in the mix: espieglerie = playfullness, mischief, roguery, trick, slyness, gaminerie The word is apt to describe in fact the whole collection of sketches and farces.  Thank You Jeeves  can be read independently of the other short stories and novels featuring the duo of scattered brain master and phlegmatic, resourceful servant, but some familiarity with the family background and with the recurring secondary characters is helpful. without further ado, let's see what the highlights are:Jeeves and the Impending Doom : Bertie is visiting the countryside, but he cannot relax, since his aunt Agatha wants him to make a good impression on a government minister, while his young cousin Thomas is planning mischief against the guests at the manor. A very large and irritable swan plays a major part in the denouement, putting Bertie in a tight spot. The silver lining can be found in the poor impression made by Bertie on the minister, indefinitely delaying plans to make him work for a living. The Inferiority Complex of Old Sippy  : Sipperley is an old school mate of Bertie, once a happy-go-lucky freelance writer, now a stressed literary magazine editor. The stress is compounded by the visits of a scary old head with literary aspirations, and by the failure of said editor to impress a young lady with his savoir-faire. After a row between Bertie and Jeeves on a point of fashion ( a horrible vase Bertie insists on displaying in his apartment), the Wooster is left to devise his own plan to save the day. Needless to say, the plan is idiotic (involving a bag of flour and practical jokes) and the result is disastrous. Jeeves saves the day, and the vase is doomed : replace the vase with some other article of clothing or decoration and you have the longest running joke in the series, the inversion of roles between master and servant. Jeeves and the Yule-Tide Spirit  : goodwill and kindness towards mankind rule the day, but count Tuppy Glossop out. He is a devious member of the Drones Club who tricked Bertie fully clothed into the swimming bath on a dare. Bertie's thirst for revenge makes him abandon earlier plans to go to Monte Carlo, to the chagrin of Jeeves who enjoys \"a little flutter at the tables\". Bertie has a second reason for a visit to the countryside, as his heart is doing its own flutters at the sight of the lovely Miss Roberta Wickam. Bobbie Wickam is one of my favorite female leads from Wodehouse, showing a wild streak of character and an apetite for practical jokes to rival the follies of the gentlemen. Another silly plan of action involving water bottles, stout sticks and sharp darning needles leaves Bertie stranded in the soup and disappointed in the gentler sex. A hasty escape down a drain pipe is in order. Jeeves and the Song of Songs  is my favorite in the collection, showcasing the resourcefulness of Jeeves at killing two or three birds with one clever plan. The story starts on a downer, with Bertie so depressed he cannot even enjoy his breakfast, but ends with a song and dance: \"- Life is like that, sir.- True, Jeeves. What have we here? I asked, inspecting the tray.- Kippered herrings, sir.- And I shouldn't wonder, I said, for I was in thoughtful mood, if even herrings haven't troubles of their own.- Quite possible, sir.- I mean, apart from getting kippered.- Yes, sir.- And so it goes on, Jeeves, so it goes on.\" The plan is to help Tuppy Glossop (the rascal with a taste for pranks from the first short story) impress his new girlfriend, a voluminous opera singer with a short temper named Cora Bellinger, while at the same time sabotaging the same efforts and returning Tuppy to the loving arms of Bertie's cousin Angela, daughter of the formidable Aunt Dahlia. Dahlia has a low opinion of the moral fibre of these young men, and is as usual keen to put them back in their place: The modern young man is a congenial idiot and wants a nurse to lead him by the hand and some strong attendant to kick him regularly at intervals of a quarter of an hour. With a little help from the popular ballad \"Danny Boy\" and the careful coreography of Jeeves, exits Cora and back in moves Angela.  Episode of the Dog McIntosh  : Bertie has a very short memory when it comes to pretty ladies, so he is soon back under the spell of the sprightly Miss Bobbie Wickam, now in his London apartment and keen on a scheme to sell a theatre script to a wealthy American. Mr Blumenfeld appeared already in an earlier collection, using his young son as a marketing guru to decide on the quality of the scripts. To win this boy's good opinion, Bobbie gifts him the dog McIntosh from the title, belonging to Bertie's aunt Agatha. Bertie must now steal the animal back before Agatha becomes aware of the missing pet. Jeeves finds a way to help Bertie that lands him deeper into trouble and opens his eyes once again to the basic frivolity of the young lady. For now, his master is safe, but I have a feeling Bobbie is not out of the picture for long: \"You know how it is. Love's flame flickers and dies. Reason returns to her throne, and you aren't nearly as ready to hop about and jump through hoops as in the first pristine glow of the divine passion.\"  The Spot of Art  : disappointed by Bobbie Wickam, Bertram Wooster turns his attention to a young lady painter, Miss Gwladys Pendlebury (spelled with a 'w'), to the dismay of his aunt Agatha and of Jeeves who casts a \"squinty eye\" at the brand new portrait of his master that hangs in the saloon: - Well, in my opinion, sir, Miss Pendlebury has given you a somewhat hungry expression. A little like that of a dog regarding a distant bone, sir.\" Bertie refuses to see reason, but a series of unfortunate events involving speeding cars, injured young men crashing at his apartment, jealous husbands, tripping over golf balls and an advertising campaign for  Slingsby's Superb Soups - Succulent and Strengthening  will wither once again the gentleman's romantic ardour, returning him to the careful supervision of Jeeves. Jeeves and the Kid Clementina  : I told you Bobbie will be back, and now she meets Bertie at a golf tournament in Bingley-on-Sea. She wheedles an invitation to dinner for her and her protegee Clementina, \"a quiet, saintlike child of about thirteen\". What Bertie doesn't know is that the kid is playing hookey from the same nearby girl school that Bertie visited in an earlier short story. With scary reminders of his past mistreatment at the hands of the young pupils, Bertie is reluctant to return to the premises, but Bobbie has once again landed him in the thick of it, with a garnish of angry policemen and assorted window-smashing flowerpots.  The Love That Purifies  : is my second favorite in the book and is a riff on the continuing troubles Bertie has around small children. At the country manor of his aunt Dahlia, dark clouds are gathering on the horizon. The lady has placed a bet on the outcome of a Good Conduct Prize between young Thomas (the devilish kid with the swan from the opening story) and her nephew Bonzo. She now risks losing Anatole, her celebrated French cook, if Bonzo is tricked into misbehaviour. And his opponent is reputed to be merciless: 'In the society of young Thos, strong men quail. He is England's premier fiend in human shape. There is no devilry beyond his scope.' Jeeves is urgently called back from his yearly holiday, and manages to turn the cards on Thomas by bringing a third kid into the play, Sebastian Moon. Judging by Wooster's own reaction to the good natured new boy, young Thomas would be unable to keep calm and to behave in his presence: I don't know why it is, but I've never been able to bear with fortitude anything in the shape of a kid with golden curls. Confronted with one, I feel the urge to step on him or drop things on him from a height. Jeeves' solution puts to an elegant use the adolescent gentlemen's tendency to defend the honour and charms of their favorite movie stars - Clara Bow, Greta Garbo and Lilian Gish. Jeeves and the Old School Chum  : deals with the matrimonial hiccups between Bingo Little and Rosie M Banks, two of the frequent support characters in the Jeeves & Wooster saga. The peace in the apartment of the newlyweds is shattered when an old school friend of Rosie arrives from America for an extended visit. Laura Pyke threatens the very fabric of British culture (the five o'clock tea) by her relentless advocacy of a healthy diet based on vegetables and whole grains. I had a great time noticing that diet crusaders are still up and about today and as fervent and dictatorial as Mis Pyke. Indian Sumer of an Uncle  : the reader tempted to think that Bertie Wooster is surrounded only ny domineering aunts can relax. It's time for his male relatives to take the spotlight, although it must be said that Lord Yaxley, aka Uncle George, is as much of a wastrel and as scatter brained as Bertie, only quite a bit older and fatter. Since he is preparing to marry a young waitrees (a health hazard most particular to the getlemen of Pittsburg, according to the book), the family asks Bertie to intervene and buy the girl off. Of course, the outcome will favor love over pragmatism (albeit from an unexpected direction), and Bertie is forced to \"exit hurriedly, pursued by a bear\". The Ordeal of Young Tuppy  : the final story is another winner, and marks the return of Tuppy Glossop, once again ignoring the charms of Bertie's cousin Angela for a new love interest, a country lady with a passion for dog breeding. The setting is once more the season of peace and goodwill: \"Every year, starting about the middle of November, there is a good deal of anxiety and apprehension among owners of the better class of country-house throughout England as to who would get Bertram's Wooster's patronage for the Christmas holidays. It may be one or it may be another. As my Aunt Dahlia says, you never know where the blow will fall.\" Peace and goodwill are scarce when the traditional football match between Upper Bleaching and Hockley-cum-Meston is about to start. Tuppy is advised to participate and impress his new lady with his prowess, not knowing that the rivalry between the two hamlets goes back a long time, and so the game is played in a manner reminiscent of its original inception: The game is one that would have a great interest for the antiquarian. It was played first in the reign of King Henry the Eighth, when it lasted from noon till sun-down over an area covering several square miles. Seven deaths resulted on that occasion. The thorough thrashing of Tuppy in the mud is finally soothing Bertie's resentments over the swimming bath incident at the Drones, and has the added benefit of returning the subdued lover to the arms of Angela. All's well that ends well in the Wodehouse universe, and love has a reliable tendency to come on top, despite countless pratfalls and misunderstandings. Jeeves delivers the goods like a phlegmatic, stiff-upper lip fairy godmother. Thanks to the BBC adaptation, I will probably always picture the duo as Hugh Laurie / Stephen Fry did on the TV screen. My final words of appreciation for the novel, echo the gratitude of Bertie after he is saved for the umpteeth time by his gentleman's gentleman. Thank you, Mr. Wodehouse: Once more you have stepped forward like the great man you are and spread sweetness and light in no uncertain measure."}, {"userName": "Barbara", "userReviewDate": "Feb 12, 2017", "userURL": "http://www.goodreads.com/user/show/2172096-barbara", "userReview": "3.5 starsVery Good, Jeeves is a collection of eleven humorous stories featuring Bertie Wooster and his valet Jeeves. Bertie is a fun-loving - but rather dim - British toff who always getting involved in hare-brained schemes that go sideways. And Jeeves is his very clever 'gentleman's gentleman' who invariably makes things right.Some of Bertie's escapades stem from his attempts to get back at his friend Tuppy Glossup. Tuppy bet Bertie he couldn't swing across a swimming pool on a set of rings.....then disabled the last ring. Of course our hapless hero had to drop into the pool in his elegant evening togs. Thus, Bertie is forever trying to get revenge on Tuppy - with disastrous results. This and Bertie's other adventures are timeless and hilarious. In this book Bertie gets treed by a swan; inadvertently drops a pail of flour on himself; punctures the wrong person's hot water bottle; loses his Aunt Agatha's beloved dog; gets caught on the grounds of a girls' school; becomes the unwilling face of 'Slingsby's Superb Soups' - and much more. One thing I love about these stories: if there's a tug-of-war between Bertie and Jeeves - over loud trousers, an inappropriate hat, a tasteless vase, a missed trip to Monte Carlo, etc. - things always go Jeeves' way in the end. Ha ha ha.If you need cheering up - or just want to laugh - you can't go wrong with these light, fun tales. Highly recommended. You can follow my reviews at http://reviewsbybarbsaffer.blogspot.com/"}, {"userName": "Carol. ", "userReviewDate": "Jul 07, 2012", "userURL": "http://www.goodreads.com/user/show/3978225-carol", "userReview": "There is really no one who can wash away the troubles, soothe the careworn brow--how does that go again?--And careworn brows forget, sir.Exactly! When my brows need forgetting. No one can soothe and forget like P.G. Wodehouse.I was idling away the morning, doing my best to make myself scarce, what with visiting family being more than a jot tiring, when I popped into the Strand to see if they could help improve the noggin. Not to say they had fish, but they did have a rather large assortment of the printed and bound word, and tucked under a table was a stack of bargain Wodehouse. \"Right-ho,\" I thought and before another moment passed, I had picked up a copy with the intent to seal the deal.It's tricky to describe how pleasurable the Jeeves and Bertie stories by Wodehouse are. Gentle farces, almost completely lacking in anything resembling modern action or soap opera dynamics, they lull one into an idyllic pastoral setting that calms and relaxes until a snort-worthy moment slides in. Besides the convoluted plots dreamed up to reunite separated lovers, or seek revenge for a practical joke, there are the witty bon mots and references that poor Bertie almost never gets, but result in a distinct upward curve of the naso-labial fold of the discerning reader. Wodehouse is a word-smith, but not one of the overflowing adjectives and adverbs variety; rather he plays with expectations and meaning in a clever and fun way.For those new to Wodehouse, the central premise is that Jeeves, an intelligent, discerning, \"personal gentleman's gentleman,\" is constantly using the grey matter to pull poor Bertie out of various scrapes. Occasionally the relationship is complicated by Bertie attempting to demonstrate cultural (that vase! that painting!) and problem-solving independence (the bag of flour gag!), but we all know Jeeves will win out.These eleven stories are no exception to Jeeves' (and Wodehouse's) genius. The usual supporting cast stops by, including Aunts Agatha and Dahlia, Miss Bobbie Wickham, Bingo, and an assortment of characters in various stages of love. Poor Bertie often finds himself in the role of matchmaker. \"Jeeves and the Impending Doom\" is undoubtedly one of the stars, as Bertie is dispatched to Aunt Agatha's place to make an impression, and is manipulated into helping Bingo manage his wayward ward. A swan proves to be his undoing. Then, Jeeves has his Monte Carlo vacation postponed in \"Jeeves and the Yule-Tide Spirit,\" so that Bertie can attempt practical joke revenge on Tuppy at the same time he presses his suit with Roberta. Luckily for us all, Sir Roderick (he of the overgrown eyebrows) is also in residence. \"The Love that Purifies\" was one of my favorites, as the plot hedges around a contest of good behavior between two small boys and various efforts to derail them, with Aunt Dahlia's chef Anatole at stake. \"Mercenary little brute!\" she said. \"I never saw such a sickeningly well-behaved kid in my life. It's enough to make one despair of human nature.\"Heartily recommended.Delicious samples:\"You!\" said Sir Roderick finally. And in this connection I want to state that it's all rot to say you can't hiss a word that hasn't an 's' in it. The way he pushed out that 'You!' sounded like an angry cobra, and I am betraying no secrets when I say that it did me no good whatsoever.(--from Jeeves and the Yule-Tide Spirit)Bingo said..., \"By the way, Bertie, would you like a cocktail?\"\"I would.\"\"Well you won't get one. We don't have cocktails anymore. The girl friend said they corrode the stomachic tissues.\"I was appalled. I had no idea the evil had spread so far as this.\"No cocktails!\"\"No. And you'll be dashed lucky if it isn't a vegetarian dinner.\"\"Bingo,\" I cried, deeply moved. \"You must act.\"(--from Jeeves and the Old School Chum)\"In a matter of this kind, Jeeves, the first thing is to study--what's the word I want?--I could not say, sir.\"Quite a common word--though long.\"--Psychology, sir?\"The exact noun. It is a noun?\"--Yes, sir.\"Spoken like a man!\"(--from The Inferiority Complex of Old Sippy)Cross posted at http://clsiewert.wordpress.com/2013/0..."}, {"userName": "Kirt Boyd", "userReviewDate": "Feb 13, 2013", "userURL": "http://www.goodreads.com/user/show/12883031-kirt-boyd", "userReview": "Jeeves and the Impending Doom, the first story in Very Good, Jeeves! made me want to write humorous fiction. Not so much because of this particular story, which is hysterical, but because it was my introduction to Wodehouse. Somewhere between when Bertie \"pronged a moody forkful\" of the eggs and b. and when he announced, \". . . it seems to be a mere matter of time before I perpetrate some ghastly floater and have her hopping after me with her hatchet,\" I was hooked.There is so much to like about Wodehouse. There's nobody funnier, of course, but the language is what always gets me. What makes the above line so funny has nothing to do with Aunt Agatha or her hatchet, but the fact that she's hopping. Great writers always choose the perfect word. Had Aunt Agatha been running, or chasing, or even skipping, the image wouldn't be nearly as funny. Humor is always about surprise; about taking two things and jamming them together in a new and surprising way. Wodehouse did this over and over again, but never quite as brilliantly as when he had Bertie say, \"Have you ever noticed how a swan's eyebrows sort of meet in the middle? Gives them a sort of peevish look.\" Jeeves and the Impending Doom is only one of eleven stories in Very Good, Jeeves! but it gets things off to a great start. There's just something about two grown men sitting on the roof of a building in the pouring rain because, as Bertie put it to Jeeves, \"The place is alive with swans!\" that is endlessly entertaining."}, {"userName": "Daniel", "userReviewDate": "Nov 30, 2009", "userURL": "http://www.goodreads.com/user/show/4695-daniel", "userReview": "Going into \"Very Good, Jeeves,\" I knew five of its stories would be repeats for me -- they comprised another collection I read, \"Jeeves and the Old School Chum\" -- but it turns out I had already read all eleven of its stories. I'm not quite sure how this happened. I don't think I'd read this particular collection before, but it's possible I had and simply forgot. I blame this on Wodehouse, whose book titles were all so bloody similar: \"Very Good, Jeeves,\" \"Thank You, Jeeves,\" \"Right Ho, Jeeves,\" \"The Inimitable Jeeves,\" \"Carry On, Jeeves,\" \"Oh Rather, Jeeves,\" \"Cheerio, Jeeves,\" \"Quite Right, Jeeves,\" \"Indeed, Jeeves,\" etc., etc. (I might have made up some of those titles, but they do have the ring of truth to them, no?)No matter. These eleven stories easily are among the best I've read by Wodehouse, and are thus worth rereading. A host of our favorite Wodehouse friends, relations and enemies are here: Aunt Agatha, Bingo Little, Cousin Thomas, Tuppy Glossop, Sippy, Anatole, Rosie M. Banks, Aunt Dahlia, Sir Roderick Glossop and Bobbie Wickham among them.I was happy to read each of these stories again, and someday will enjoy reading them a third time. But first I need to sort out which Jeeves and Wooster stories I've read and which I haven't to ensure I give each a first read before I repeat any more. Blasted Wodehouse and his vexing titles!"}, {"userName": "Jessica Jones", "userReviewDate": "May 05, 2012", "userURL": "http://www.goodreads.com/user/show/6375911-jessica-jones", "userReview": "1987 - I was twenty-five years old and holed up in the intensive care unit at the National Neurological Hospital in London, stricken from head to toe with Guillain-Barré Syndrome. Symptoms: total paralysis. Prognosis: uncertain.Guillain Barré Syndrome is a bizarre illness. It attacks the myelin sheath that transmits messages along one's peripheral nerves. One day my toes went numb. A week later I found myself in hospital, unable to move, breathe or speak. An unscratchable itch on my leg could propel me to the brink of insanity. Dust fell into my eyes and I couldn’t blink or wipe it away. I could not call out for assistance.Upon learning of my perilous condition, my mother had dropped everything, packed a suitcase and flown from Sydney. Now she sat by my bedside for twelve hours a day, every day. Each night mum grabbed a few hours' sleep at her friends' house; Chrissy and Ralph were devotees of an Indian guru by the name of Swamiji. When Swamiji heard of my situation he began to call my mother and tell her of his visions for me. ‘I see yellow,’ spake the guru. The next day mum arrived at the hospital laden with armfuls of daffodils and yellow tulips. She filled all the vases in the room with them. Two days later, Swamiji called again: ‘I see purple.’ Out went the daffodils, replaced by swathes of irises. Mum herself was dressed in a purple silk kimono that she’d borrowed from Chrissy. Then Swamiji made a personal appearance at the ICU, without shoes. Through his flowing grey beard he blew into my chakras. Matron tried to hustle him from the room but Swamiji resisted her. At that point Sister Mary entered the scene.Sister Mary had been hospitalised for an acute attack of Multiple Sclerosis but was now on the bounce back. She busied herself by ambling from ward to ward with her walking stick, rescuing the souls of fellow patients. Some of those ingrates did not wish to be saved but in me she found a compliant mark. Being fully paralysed I didn’t have much choice in the matter.Sister Mary visited most days and sprinkled my motionless body with Lourdes water that she kept in a plastic bottle. She left a specimen jar by my bed containing some small pieces of black stuff. ‘Relics of Padre Pio,’ Sister Mary said. Not being much of a Christian I didn’t cotton on to the significance of these. I was quite taken aback when I later learned that they were bits of the charred remains of a revered Catholic priest.Swamiji blew and Sister Mary sprinkled and as they did so the two of them fell into meaningful discussion of matters philosophical and theological. They could not see eye-to-eye about how best to save me but each of them gave as good as they got. Their conversation continued; Swamiji took to calling Sister Mary on the wheelie payphone on her hospital ward. She would then appear at my bedside in high dudgeon: ‘I had your friend Swamiji on the phone last night. He’s a very irritating man.’‘He’s not my friend,’ I wanted to say, but I couldn’t speak.Since I was hooked up to a ventilator, my only means of communication was by a tortuous method of blinking at an alphabet board. It was tedious and often upsetting for all concerned. Mum sat by my bedside week after week. Sometimes she read out the crossword clues and then patiently tried to decipher the answers that I blinked. But mostly she read aloud books by P.G. Wodehouse. She voiced the characters of Bertie and Jeeves and played up the ridiculousness of their awful scrapes. Mum had no way of knowing that inside my waxen, immobile body I was aching with laughter. Those books were written with a lightness and sense of the absurd that helped me to find the funny side of my own predicament.During months of rehabilitation - learning to walk, talk, write and do everything that I thought I had mastered as a toddler - I sometimes entertained the fantasy that I might one day repay my debt of gratitude to the universe and to the NHS by retraining as a nurse. I examined the qualities required: tolerance, compassion, self-sacrifice, an ability to look at blood and vomit without fainting... and I knew the truth: that me becoming a nurse would be about as useful to the world as Tony Blair becoming a Middle East Peace Envoy.No, nursing was not to be my vocation. But I've never forgotten how those long afternoons with Jeeves and Wooster helped me to escape the terror and confusion of being paralysed. 'One day', I thought, 'I would like to write a book that will help somebody else to get through a shit time'. When I was diagnosed with cancer and my boyfriend dumped me, I realised that day had come."}, {"userName": "Diane Walker", "userReviewDate": "Jan 05, 2013", "userURL": "http://www.goodreads.com/user/show/7075772-diane-walker", "userReview": "My, how I love P.G. Wodehouse. For unabashed, slightly dippy Anglophiles like me, the Jeeves-Wooster stories are a wonderful Brit fantasyland that could only be matched by a stay at Hogwarts. Bertie is a man of very little brain, whose magical powers include lots of money, leisure, an excellent liver, and a slim, clotheshorsy figure. Bertie's Lord Voldemort subs are friends who prevail upon him to housebreak, steal, \"tick people off,\" or otherwise engage in socially awkward or illegal trickery, usually to get said friends in good with the opposite sex. Other and equally important Lord V's include his terrifying aunts, Agatha and Dahlia, and elderly crusty male aristocrats who scare the water out of Bertie. Oh, and let's not forget all the women who engage themselves to Bertie, even though he'd rather be dead in a ditch, because Bertie is terminally afraid of telling them\"no,\" or giving offense. But all of this is okay, because he's got Jeeves, deadpan solver of problems and bringer of breakfast in bed. Jeeves' solutions get thoroughly FUBARed by Bertie and his friends in execution, yet Jeeves is always \"shimmering\" in the background, ready to make Bertie's rough places plain, with a word in the right ear, or some other small action he's \"taken the liberty of.\" Of course, Bertie is totally Jeeves' bitch. Bertie is everybody's bitch, but in such a slight, charming world that could never exist anywhere at anytime, man, I want to be Bertie.They have baseball and rock star fantasy camps. Why can't they have Jeeves and Wooster fantasy camps? I want friends called \"Barmy Fotheringay-Phipps\" and \"Catsmeat.\" I want a membership at the Drones club where I never have to grow up and can play the horsey British equivalents of beer pong all day. I yearn to address people with a hearty \"What ho?\" and use \"dashed\" instead of the more profane adjectives I actually use. Most of all I want my comfort and happiness in life to be the primary function of an all-knowing, all-anticipating \"serf\" who despite his so-called inferior status leads a far better life than Bertie does. I'd still be Bertie in J&W fantasy camp. He's funny. He's agreeable. He refuses to be dislodged from bed before 10. He's really slim even though he enjoys his food and his booze. He missed WW1, and has no clue that WW2 is just around the corner. P.G. Wodehouse's stories and characters are pure escape. No allegories or morals of the story here. Just peppy dialogue and intricate plots. There is no better antidote to the real world than Jeeves and Wooster."}, {"userName": "Suzanne", "userReviewDate": "Jul 06, 2015", "userURL": "http://www.goodreads.com/user/show/14528914-suzanne", "userReview": "Reading about Bertie's and Jeeves' adventures makes me happy. In my mind, Bertie is sort of like Mr. Bean, and Jeeves is the 007 of the butlering world. I think this is my 4th or 5th Wodehouse book in this series and I can't stop reading them. They're addictive!"}, {"userName": "Louise", "userReviewDate": "Jul 18, 2015", "userURL": "http://www.goodreads.com/user/show/8854624-louise", "userReview": "The perfect getaway from the stress of life."}, {"userName": "Jessica", "userReviewDate": "Dec 28, 2016", "userURL": "http://www.goodreads.com/user/show/202724-jessica", "userReview": "Delightful collection of stories, including Jeeves and the Yule-tide Spirit, which I have been trying to find for a couple of years! My favorite, however, was Indian Summer of an Uncle."}, {"userName": "Leslie", "userReviewDate": "Jan 28, 2018", "userURL": "http://www.goodreads.com/user/show/11351200-leslie", "userReview": "I love Jonathan Cecil's narration of Wodehouse books! It has been a long time since I read this collection in paperback but I still remembered some of the stories quite well. However, that doesn't really matter with Wodehouse. I had intended to listen to this slowly, one story a day but found that I couldn't stop listening at just one :)"}, {"userName": "Pam", "userReviewDate": "Mar 15, 2017", "userURL": "http://www.goodreads.com/user/show/8580024-pam", "userReview": "I really enjoyed the comic adventures and the snappy, humorous dialogue between the two main characters - Bertie Wooster and his manservant Jeeves. I also liked the format, a series of short stories, which made it easier to start and stop. This was my first Jeeves book but I plan on going back to #1 and reading through the series! My interest in the series was piqued when I recently bought \"Jeeves and the Wedding Bells\" which was written as an homage to P. G. Wodehouse, several decades after the last Jeeves book was published. I thought it made sense to read an original book in the series first. I'm going to read a few more of the books, and get familiar with the other characters, before reading about the wedding bells!"}, {"userName": "Alison", "userReviewDate": "Dec 29, 2011", "userURL": "http://www.goodreads.com/user/show/47383-alison", "userReview": "I'm giving this book 5 stars not because it is a Great Book, but because for what it is--a collection of humorous stories--it is perfection. I hadn't read any Jeeves stories in a long time, and these delighted me as much as the first time I read them. I plan to read more Wodehouse in the future. Now there's a New Year's Resolution I can keep."}, {"userName": "Mom", "userReviewDate": "Dec 15, 2015", "userURL": "http://www.goodreads.com/user/show/7813734-mom", "userReview": "Classic book series that everyone loves. I did enjoy the British speak even though I didn't really understand most of it. I needed a British to American English dictionary at my side. I will have to do that for the next installment and hopefully I will get the humor."}, {"userName": "Gayatri", "userReviewDate": "Oct 15, 2016", "userURL": "http://www.goodreads.com/user/show/57395649-gayatri", "userReview": "Amazing book. All the stories are fantastic. This book made me a jolly little bird. Cheerio, Jeeves! :)"}, {"userName": "Addy", "userReviewDate": "Jan 08, 2018", "userURL": "http://www.goodreads.com/user/show/60843405-addy", "userReview": "What a bally good book! A collection of 11 short stories consisting of assorted birds from country houses all over the English countryside, with a dash of Proletariat thrown in as well. What with the blighted Aunt Agatha and the wonderful Aunt Dahlia (the only aunt in the Wooster clan who shouldn't be locked up in an asylum) making multiple appearances, along with an intolerable uncle, wailing cousins and a couple of blighted nephews, exotic dogs, the Pyke and what not. I think, this entire piece of an unsuccessful attempt at bally writing of mine can be summed up as 'WHAT-HO!' .That's what a generous dose of Bertie Wooster and Jeeves can do to you. If you still haven't been wise enough to partake in the delightful concoction prepared by one PG Wodehouse, do it yesterday! 5/5."}, {"userName": "Pamela Shropshire", "userReviewDate": "Dec 03, 2017", "userURL": "http://www.goodreads.com/user/show/6535930-pamela-shropshire", "userReview": "A dose of Jeeves and Wooster is definitely good for what ails you. Wodehouse created a world in which the worst thing that happens is that a bobby's helmet is stolen by some inebriated (but always good-hearted) young men or Uncle George, Lord Yaxley, is planning to marry a young waitress. And the brainy Jeeves always has a scheme to set right any of these trifling wrongs.One wouldn't want a steady diet of such light fare, but occasionally it's good to remember that a merry heart doeth good like a medicine!"}, {"userName": "An Odd1", "userReviewDate": "Jan 01, 2015", "userURL": "http://www.goodreads.com/user/show/4863716-an-odd1", "userReview": "[Jeeves calls away dog-girl Miss Dalgleish on quest for spaniel so Tuppy wins game for naught, returns to Angela.  (hide spoiler)]"}, {"userName": "Heidi", "userReviewDate": "Apr 23, 2018", "userURL": "http://www.goodreads.com/user/show/22025728-heidi", "userReview": "The social (mis)adventures of Bertie and friends and the subtlety manipulative solutions from Jeeves are laugh out loud funny. I highly recommend this as a break from the heavier things of life; Wodehouse is brilliant."}, {"userName": "Lucy", "userReviewDate": "Jul 03, 2011", "userURL": "http://www.goodreads.com/user/show/4806-lucy", "userReview": "\"The old fathead!\"\"Yes, sir. The expression is one which I would, of course, not have ventured to employ myself, but I confess to thinking his lordship somewhat ill-advised. One must remember, however, that it is not unusual to find gentlemen of a certain age yielding to what might be described as a sentimental urge. They appear to experience what I may term a sort of Indian summer, a kind of temporarily renewed youth. The phenomenon is particularly noticeable, I am given to understand, in the United States of America among the wealthier inhabitants of the city of Pittsburg. It is notorious, I am told, that sooner or later, unless restrained, they always endeavor to marry chorus-girls. Why this should be so, I am at a loss to say, but--\"I saw that this was going to take some time. I tuned out. (157)\"What with one thing and another--having been at a school where they didn't play it and so forth--rugby football is a game I can't claim absolutely to understand in all its niceties, if you know what I mean. I can follow the broad, general principles, of course. I mean to say, I know that the main scheme is to work the ball down the field somehow and deposit it over the line at the other end, and that, in order to squelch this programme, each side is allowed to put in a certain amount of assault and battery and do things to its fellow-man which, if done elsewhere, would result in fourteen days without the option, coupled with some strong remarks from the Bench. But there I stop. What you might call the science of the thing is to Bertram Wooster a sealed book. However, I am informed by experts that on this occasion there was not enough science for anyone to notice\" (183)."}, {"userName": "Brian Grover", "userReviewDate": "Apr 14, 2014", "userURL": "http://www.goodreads.com/user/show/16026178-brian-grover", "userReview": "I've been meaning to read a book of Wodehouse stories for some time, and finally bit the bullet and picked one up. An entire book of these stories is a little tedious, due to the paint-by-numbers plot formula (Bertie Wooster has some social problem to contend with, he asks his butler Jeeves for advice, he ignores the advice, hijinks arise, and Jeeves swoops in to save the day, usually revealing that he ignored his employer's direction and set his initial plan in motion).But any of these individual stories is a lot of fun, if for no other reason than Wooster's breezy, booze-addled narration. To say nothing of the period language - for example, the word \"rannygazoo\" is used multiple times in this book. What's not to love about that?"}, {"userName": "J.P.", "userReviewDate": "Jun 04, 2015", "userURL": "http://www.goodreads.com/user/show/5286233-j-p", "userReview": "For too long I hesitated reading a book in this series thinking it was about a rich stuffy old fart who ordered his butler around. Also it was written ages ago so what was considered thigh slapping humor then would hardly rate a chuckle today, right? Wrong on both counts! Good writing is always timeless and this was one of the funniest books I've ever read. The chap Jeeves works for is a bumbler who gets himself into all kinds of awkward situations and constantly needs Jeeves to bail him out. Throw in eccentric relatives including a younger nephew who is anarchy personified and the result is hilarious. I've gotten most of the rest of the series and I'm looking forward to them."}, {"userName": "Tulika", "userReviewDate": "Sep 09, 2017", "userURL": "http://www.goodreads.com/user/show/8592618-tulika", "userReview": "This was the first time I read Wodehouse and the experience was hilariously memorable. Wooster and Jeeves, the master and valet, were in their element and did not disappoint. The sardonic British humour cuts smoothly, does not jar the senses and makes the point timely. Although the escapades are all very unlikely, and almost seem to be set in a parallel universe (Wodehousian?), there's an innocence attached to Wooster's thick-headed reliance on Jeeves' superior intellect. I loved the Jeeves character. He's like a small scale James Bond (no violence or anything too dangerous).Wodehouse is a master of words, seemingly shortening them (Wooster uses short forms) or by inventing them. Have you heard of the words crispish, persp., snooter, pottiness? Well that's because they aren't real words. They've been coined by Plum (as his friends called him) himself but make perfect sense while reading."}, {"userName": "John Defrog", "userReviewDate": "Mar 24, 2017", "userURL": "http://www.goodreads.com/user/show/15533592-john-defrog", "userReview": "This is my second time reading Wodehouse’s Jeeves stories, and the experience this time was pretty similar to the last one – it’s lightweight but fun. The stories are pretty formulaic – upper-class twit Bertie Wooster and his friends or relatives are presented with some sort of social dilemma (“social” as in high society), sometimes of their own making, to which Bertie’s valet Jeeves usually provides a clever solution that no one else thought of. But as the saying goes, what a formula! And really, it’s not about the formula so much as the presentation – in this case, vivid dialogue-driven characterization and fast-paced wit generously spiked with not-so-subtle social satire. I really should read more Wodehouse than I do, and this may inspire me to do so, although I’d like to try some of his other books besides the Jeeves stories next time out."}, {"userName": "Mallory", "userReviewDate": "May 06, 2018", "userURL": "http://www.goodreads.com/user/show/4333438-mallory", "userReview": "Having watched the entire collection of Jeeves & Wooster over the past few months, I dove back into this series and enjoyed it just as much if not more than before. The fun thing was hearing Stephen Fry's and Hugh Laurie's voices in my head as the main characters. This collection of stories contained many I was familiar with thanks to the show, but still found entertaining because, dash it, I mean to say, I jolly well like them!Favorite quotes: \"You know how it is. Love's flame flickers and dies, Reason returns to her throne, and you aren't nearly as ready to hop about and jump through hoops as in the first pristine glow of the divine passion.\"\"Hell, it is well known, has no fury like a woman who wants her tea and can't get it.\""}, {"userName": "John Frankham", "userReviewDate": "Mar 02, 2018", "userURL": "http://www.goodreads.com/user/show/15748696-john-frankham", "userReview": "The last, and certainly the best, of the three books of Jeeves and Wooster short stories. Wodehouse definitely in 'mid-season form' (a cricketing allusion!). Brilliant prose, plotting, wry humour.The GR blurb:'Whatever the cause of Bertie Wooster's consternation — Bobbie Wickham gives away fierce Aunt Agatha's dog; again in the bad books of Sir Roderick Glossop; Tuppy crushes on robust opera singer — Jeeves can untangle the most ferocious muddle. 1 Jeeves and the Impending Doom2 The Inferiority Complex of Old Sippy3 Jeeves and the Yule-Tide Spirit4 Jeeves and the Song of Songs5 Episode of the Dog McIntosh6 The Spot of Art7 Jeeves and the Kid Clementina8 The Love that Purifies9 Jeeves and the Old School Chum10 Indian Summer of an Uncle11 The Ordeal of Young Tuppy'"}, {"userName": "Eugene ", "userReviewDate": "May 13, 2017", "userURL": "http://www.goodreads.com/user/show/23174483-eugene", "userReview": "I don't know, maybe P. G. Wodehouse is one of those \"either you like him or you don't\" writers, but I like him! Doesn't disappoint, another fine outing here, 11 short stories with Bertram Wooster getting his fat in the fire and his ever reliable valet Jeeves putting the fire out. And the \"veddy British\" turns of phrase - oh lord, just sooo entertaining, particularly Jeeves' dry and succinct responses to Bertie's sallies. In many ways it's my favorite part of the entire ouevre. Much the usual cast of characters here, the usual dynamic at play, the usual satisfactory ending, but it never gets old and I always enjoy another visit to the neighborhood."}, {"userName": "Pauline", "userReviewDate": "Feb 04, 2018", "userURL": "http://www.goodreads.com/user/show/4560953-pauline", "userReview": "Listened to this audiobook during a long car journey and laughed all the way. Pure brilliance."}], "description": "Whatever the cause of Bertie Wooster's consternation — Bobbie Wickham gives away fierce Aunt Agatha's dog; again in the bad books of Sir Roderick Glossop; Tuppy crushes on robust opera singer — Jeeves can untangle the most ferocious muddle. 1 Jeeves and the Impending Doom2 The Inferiority Complex of Old Sippy3 Jeeves and the Yule-Tide Spirit4 Jeeves and the Song of Songs5 Episode of the Dog McIntosh6 The Spot of Art7 Jeeves and the Kid Clementina8 The Love that Purifies9 Jeeves and the Old School Chum10 Indian Summer of an Uncle11 The Ordeal of Young Tuppy", "title": "Very Good, Jeeves!\n      \n          (Jeeves #4)", "url": "http://www.goodreads.com/book/show/9862342-very-good-jeeves", "average": 4.36, "cover": "https://images.gr-assets.com/books/1402442427l/9862342.jpg", "reviews": 417, "authors": [{"url": "https://www.goodreads.com/author/show/7963.P_G_Wodehouse", "name": "P.G. Wodehouse"}], "type": ["Fiction", "Humor", "Classics", "Short Stories", "Humor"], "outlinks": ["http://www.goodreads.com/book/show/9862342-very-good-jeeves", "http://www.goodreads.com/book/show/16382.Very_Good_Jeeves_", "http://www.goodreads.com/book/show/1979793.Very_Good_Jeeves", "http://www.goodreads.com/book/show/15542245-very-good-jeeves", "http://www.goodreads.com/book/show/11215366-very-good-jeeves", "http://www.goodreads.com/book/show/24246788-very-good-jeeves", "http://www.goodreads.com/book/show/1691102.Very_Good_Jeeves", "http://www.goodreads.com/book/show/200572.My_Man_Jeeves", "http://www.goodreads.com/book/show/16387.Carry_on_Jeeves", "http://www.goodreads.com/book/show/9858081-the-code-of-the-woosters", "http://www.goodreads.com/book/show/9850375-right-ho-jeeves", "http://www.goodreads.com/book/show/9515964-the-inimitable-jeeves"]}