{"ratings": 1491, "userreviews": [{"userName": "Ilse", "userReviewDate": "Feb 08, 2016", "userURL": "http://www.goodreads.com/user/show/22848274-ilse", "userReview": "Home is where the heart is Reading Neil MacGregror’s fascinating Germany: Memories of a Nation a few months ago amply affirmed I still have a long path to go in the sighting of Germany’s history and literature. Sensing this need, two marvelous friends were so kind to bring Jenny Erpenbeck’s novels to my attention, in particular Visitation (Heimsuchung). As Visitation is fiction which is ingeniously connected with episodes from Germany’s troubling contemporary history, this short novel was a treat I could bask in, getting the best of both worlds, of history writing and excellent prose. Eastern Germany, a plot of land close to Berlin. A lake. A summer cottage. A house. A garden. Behold the ostensibly idyllic and innocent setting where Jenny Erpenbeck, German writer and opera director, stages her magnificently imaginative composition, dense with props which seem so trivial in everyday life - clothes, kitchen ware, towels, sheets - but are fraught with ambivalence. In 12 slims chapters the subsequent residents of the house and adjacent land - mostly nameless characters apart from the Jewish characters, who significantly enough do get names - are grinded through the implacable mill of Germany’s turbulent history. With seven-league boots Erpenbeck clears a way through roughly 150 unsettling years, from the Imperial Germany, via WWII and the Holocaust, the Russian occupation of East-Germany, the Communist era to Germany’s reunification and its aftermath. Notwithstanding the breathtaking pace, Erpenbeck knows how to delight and grow the reader silent with her gossamer prose. Snippets of individual lives and domestic scenes and tragedies are daintily painted, subtly etching the impact of horrendous events, changes of regime, change of power rules and morals, on ordinary lives. The graceful prose skillfully contrasts with some brutal events dealt with. Cross referencing, creating an atmosphere of menace through unveiling gradually the horror by carefully stashing away hints in minor details in a previous chapter, connecting and entwining the poignant and tragic tranches de vie of the subsequent residents and visitors, the intricate structure of the novel resembles the hidden closets in the lake house. The only figure which is constantly present and is not washed away by History is the gardener. Ineluctably, nature’s seasonal cycle urges the gardener to intervene, repetitively performing his tasks tending the garden, the intermittent sentences on his routines (sowing, planting, watering) knotting together the passage of the characters, taking the reader from one resident’s life to another, like the recurrent variations on the Promenade theme in Modest Mussorgsky’s piano suite Pictures at an Exhibition mirror the viewer pacing progressively past the paintings, until the theme merges in the movement and reaches its apotheosis in the finale, the Gate of Kiev.What would you call home? Can one create oneself a lasting home? Does the act of building equals creating a place in the world? One of the characters, the Architect, ponders on his profession: (…) planning homes, planning a homeland. Four walls around a block of air., wresting a block of air from amid all that burgeoning, billowing matter, with claws of stone, pinning it down. Home. A house is your third skin, after the skin made of flesh and clothes. Homestead.The German title ‘Heimsuchung’, seeking for a home, where one is safe and secure, exhumes the melancholy yearning of the characters in the novel. Almost all of them will be chased from and lose their homes and familiar surroundings, or even their physical and psychological integrity and worse, become effaced by the ravages of Time, like the slow decay and decrepitation of the house and garden themselves.His profession used to encompass three dimensions, height, width and depth; It was always his business to build things high, wide and deep, but now the fourth dimension has caught up with him: time, which is now expelling him from house and home. There is a poignant sense of contingency of human existence to this novel. Panta rhei. Everything is temporary. Time consumes and crushes man and his futile life and creations. Nothing last forever, apart from the powers of nature. Reading ·Karen·’s wonderful review on Erpenbeck last novel, Gehen, ging, gegangen which does divert from the historical take and deals with migration, a sense of evanescence seems a leitmotiv also discernable in her latest novel: regimes fall, and values change. Albeit stylistically very different from the poignant oral testimonies recorded by Svetlana Alexievich in Secondhand Time: The Last of the Soviets as Erpenbeck’s prose takes a much more distant approach, this novel also is a compelling account on the devastating effects of regime changes affecting people’s lives. \nThis haunting and intense novel chimes a writer’s voice I’d love to listen to again. Thank you, Philippe and ·Karen·, for putting Jenny Erpenbeck tightly on my radar. Some of Erpenbeck’s lines on the feeling of homelessness, both of Germans and of refugees are heart-rending. “Home! he'd cried out like a child that would give anything not to be seeing what it was seeing, but precisely in this one brief moment in which he hid his face in his hands, as it were, even the dutiful German official had known that home would never again be called Bavaria, the Baltic coast or Berlin, home had been transformed into a time that now lay behind him, Germany had been irrevocably transformed into something disembodied, a lost spirit that neither knew nor was forced to imagine all these horrific things. H-o-m-e. Which thou must leave ere long. After he had swum his way through a brief bout of despair, the German official had applied to retain his post. those others, though, the ones who had fled their homeland before they themselves could be transformed into monsters, were thrust into homelessness by the news that reached them from back home, not just for the years of their emigration but also, as seems clear to her now, for all eternity, regardless of whether or not they returned.”\n”As she looks back like this, time appears in its guise as the twin of time, everything flattening out. Things can follow one after the other only for as long as you are alive in order to extract a splinter from a child’s foot, to take the roast out of the oven before it burns or sew a dress from a potato sack, but with each step you take while fleeing, your baggage grows less and less, with more and more left behind, and sooner or later you just stop and sit there, and then all that is left of life is life itself, and everything else is lying in all the ditches beside all the roads in a land as enormous as the air, and surely here as well you can find those dandelions, these larks.”\n”At some point the gong sounds, calling them all to supper. Then her granddaughter comes back up from sunbathing on the dock, humming quietly to herself just as she has done all her life, even as a little girl. Which means that in the end there are certain things you can take with you when you flee, things that have no weight, such as music.”"}, {"userName": "Jibran", "userReviewDate": "Aug 14, 2016", "userURL": "http://www.goodreads.com/user/show/5407952-jibran", "userReview": "That it was published by New Directions played a significant role in my deciding to read this book before others I have lined up for the Women in Translation Month, and I thank my luck that I did. The protagonist of the novel is a house, a lakeside property outside Berlin, which has witnessed history's mood-swings from its origins as a pine forest owned by a local town mayor back in the 1600s CE down to our present times when the knocking down of the Berlin Wall forced it to change its inhabitants once again. Before I say more I’d like to say a few words about our own house (a landed estate actually) located in what is today central Pakistan, to which I had been comparing the house outside Berlin as I read the book.My family’s permanent address has not changed for the last +/- 350 years. My ancestors came from a town 150 km away and have lived here ever since, although in recent times many of us have moved out to big cities and to other countries, in search of new lives, but have always endeavoured to return to our place of origin every now and then, especially on festive occasions like Eid, and once every few years if living abroad.The oldest part of the house dates from 1870s and the rest of what stands today was built and added in the 1930s. This latter addition was done by demolishing an old extended section that was originally built sometime in the early 1700s on fallow land. An uncle of mine added the latest amendments, a new men’s parlour and few guestrooms, in 2000s, in the oldest part atop a hummock which my grandfather had left to his elder brother and moved to a newer construction in the 1930s. I can give more details, of constructions, additions, demolitions, caving-ins, earthquakes, Persian tilework, old furniture built to last generations (the old charpoys my grandmother had brought in her dowry, still in good condition after minor repairs); of births and deaths, disputes and disagreements, wars and famines, the place changing hands from Mughal India to an independent princely state, then from British India into Pakistan, through which generations of its inhabitants have passed. Many things have happened during that long stretch of time but no upheaval or misfortune has been great enough to dislodge us from our estate.But humanity has a quarrel with reality, having for eons rejected definitions of it while seeking, with the craving of an addict, one more new interpretation, whilst destroying the world in its stubborn refusal to learn from history, all that presumably for the benefit of humankind. The house in Ms Erpenbeck’s novel is located at a place which has seen the worst of European history pass through its doors, defiling its peace, trampling its serenity, destroying its meadows, and, in a cruel joke, turning the lake as a dead end for the escapees than a spot of leisurely activity for holidayers.There is a strong sense of déjà vu in each of the stories of its characters and their families, related at one time or another to the house, who have fought or traded the right to own and live on the property with each other sometimes on pain of expulsion, at times by force of exigency, yet at others when the right of ownership was first taken away, and then given back, in a back-and-forth circus of the last one hundred years, depending on which power system happened to prevail at the time. And amazingly, Ms Erpenbeck’s language corresponds closely to the confusions of history as it constructs itself, then disintegrates, and again assembles in a slightly altered formation, with a degree of repetition informing the similarities between its long line of inhabitants, as if words were recalcitrant banshees brought up in a knot to fill the air with their endless cries.The new world is to devour the old one, the old one puts up a fight, and now new and old are living side by side in a single body. Where much is asked, more is left out.August '16"}, {"userName": "Agnieszka", "userReviewDate": "Jun 11, 2015", "userURL": "http://www.goodreads.com/user/show/2446508-agnieszka", "userReview": "Long time ago, in different time, in other era, when the world was young yet, when these hillocks were part of huge mountain range a glacier went through, crushing everything on its way, changing lay of the land, curving rocks and forming basins which filled with water. Former inhabitants, lions and saber-toothed tigers gone and then we entered on the scene, embracing that land and naming lake between hills the Sea of the Mark Brandenburg.Between silent green hummocks, amid pine grooves and alder forests, nearby the lake there was a house. It was built by Berlin architect for his young wife. He used to think that it would last for ever, that they spend there the whole life. But what exactly does it mean that  whole life  ?On the doors still fly colorful birds, flowers are blooming, grapes hanging. Garden of Eden, in twelve colored panes which beauty makes you to forget that behind them is only a common broom cupboard. Creaky stairs on the second, seventh and penultimate stage. Wife’s room as always smelling of mint and camphor. Dressing room with ingenious passageway into his atelier. On the upstairs from where stretched a view on the rose bed, sandy road, shiny surface of the water the tiny bird soldered to the railing.  A house is your third skin, after the skin made of flesh and clothing. Homestead. A house made to measure according to the needs of its master  .Each and every year the gardener used to come and depending on the time of year planted, trimmed, watered, fertilized, cleared, weeded. ...he lives alone in an abandoned hunting lodge at the edge of the woods , he's always lived there , everyone in the village knows him , and yet he is only ever referred to by both young people and old as The Gardener , as though he had no other name  .There was a time and there was a life. And then time began to leak out and there was no way to stop it. And life began to shrink down to the size of a tiny dark cubbyhole. But while sitting in the darkness one could still remember that house and the lake, that one could be sure the world still existed. But what if there was no one who would remember us ? What when we finally disappear ? Who then will know about the world? Doris, daughter of Ernst and Elizabeth  .\t\t On the wooden platform one can still hear the patter of bare feet, in the bedroom still lingers faint smell of mint and camphor, from the living room on the downstairs still coming the sound of a typewriter. As the day is old and the world is old, many people can stand in the same place, one after the other  . Trucks already departed, taking away tons of rotten debris, decaying wood, broken glass. The bees have left their hives. The gardener has disappeared. In the place where once stood the house there is a gaping hole now so you can see the layers of the bygone years. Slate, clay, sand.In the twisted pines wind is blowing. The lake is still lapping against the shore. But one day even it may disappear. Because long ago, in another time, in different life, when the world was still young even in the Sahara there was water too."}, {"userName": "Fionnuala", "userReviewDate": "Oct 01, 2012", "userURL": "http://www.goodreads.com/user/show/5498525-fionnuala", "userReview": "Imagine a geologist examining a cross section of a landscape. He would point out why this layer of rock is so compressed and why that one is less so, why this layer of gravel was trapped just there and what the shape and age of those fossils indicate. He would read the layers of the landscape as if he was reading a history book with illustrations. Jenny Erpenbeck reads the layers of twentieth century Germany in a similar way. Just as pockets of petrified sand beneath bedrock can still display a wave-like pattern, immortalising the winds that blew accross the water which covered the sand long ago, Erpenbeck’s analysis is sewn through with heart stopping glimpses of turbulent passages in the lives of real people during significant moments in that period.The book which results from this examination resembles a piece of art more than a traditional story. She extracts sections from almost every decade of the twentieth century and overlays them to see the patterns which emerge, just as soil overlays sand and sand overlays rock, or vice versa as occurs in the geologically unusual Märkisches Meer area outside Berlin to which the book is a kind of monument. It is not for nothing that she quotes Georg Buchner on the fly-leaf: As the day is long and the world is old, many people can stand in the same place, one after the other.There is one particular theme that she returns to constantly and which is beautifully symbolised by an old wooden door (incongruously leading to a broom cupboard), a door which is decorated with twelve scenes depicting the Garden of Eden. Germany had it all, she seems to say, wealth, culture, traditions, the horn of plenty. But it wasn’t enough: Whether it was ’38 or’39, or perhaps 1940 when they began to use the dock belonging to the abandoned house next door, and when her husband built the boathouse beside the dock - she’s no longer sure when that was. Surely he hadn’t built the boathouse until the next-door property belonged to them, but when was that? Summer after summer swimming, sunbathing, and picking raspberries at the edge of the woods...and her laughter is the laughter of today, of yesterday...While she was spending her whole life laughing, her blond hair imperceptibly turned white...Today or yesterday, she is sitting with friends around a large pot in which crabs are floating, crabs she caught herself, gripping them firmly behind the neck, and later boiled until they turned red. Eating such a crab is not simple. First you twist the creature’s head off and suck its juices, then you rip out the claws and use a tiny skewer to pull out the meat. The abandoned house with the paradise-paneled door is a symbol for a Germany that is gone; no one has and no one ever will become old within the shelter of its walls. In summer, he always took one last swim before leaving...When he will have swum here for the last time is something he no longer knows. Nor does he know whether the German language contains a verb form that can manage the trick of declaring the past the future."}, {"userName": "karen", "userReviewDate": "Jun 25, 2011", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "oh, i love it when i get to review a book that elizabeth has just reviewed. as though i am going to be able to add anything to the discussion except a weak echo of \"i agree! this book is good!!\"so i will just quickly relate my experience with this book which is indeed pretty great.but not at first.at first it was killing me with boredom. i have been reading too much teen fiction as of late, and there, the pacing is perfect for hot summer and slipping attention span. this book is NOT for those who can't pay attention. this is some highly concentrated, deliberate prose. and at first, before the human characters come into it, it seems to be just words words words, being boring.but the significance will become clear later.aside: i recently went to the movies to see general orders no. 9. and it was a small artsy theater, and the host of the evening (who i did not find smug, but connor said was, a little) prefaced the evening by saying \"it is hard to get people to come out for a film like this, a film without human characters on a friday night when you could be going to see the green lantern\" and that was supposed to make us feel good about ourselves, like we had made the informed choice for fiber over candy bars. but seriously?that movie is soooo boring. yes, city is bad, country is good, progress is problematic, i get it. at least koyaanisqatsi had good music.but i digress. the only reason i bring it up is because the arc of the book is similar to the arc of the movie, and starting this book the day after i saw the movie, i was apprehensive when it began with a glacier, and then moved on to a whole lot of talk about plants and slow growth. bad, synchronicity, bad!line from film:deer trail becomesindian trail becomescounty road.but in this book:open land becomes family house becomes nazi toiletthat is not a quote, that is just the way the story progresses. and the book is just a damn sight better at doing what needs to be done. the details are perfection. the tone is completely detached, so whether the scene is someone pruning a tree or someone dying in a gas chamber, there is an emotional remove that only serves to make the reader's emotions more powerful. how she managed to write such a highly concentrated book is beyond me, truly. it is luminous (did i just use the word luminous to describe a book?? i think i did) this book should be read slowly and carefully and thoughtfully. and then it should be read again. she is really that good.greg's review is also good, and caused a great deal of fighting, which is funny, even if a lot of it has been deleted."}, {"userName": "Algernon", "userReviewDate": "Aug 08, 2014", "userURL": "http://www.goodreads.com/user/show/4728718-algernon", "userReview": "Perhaps eternal life already exists during a human lifetime, but since it looks different from what we're hoping for - something that transcends everything that's ever happened - since it looks instead like the old life we already knew, no one recognizes it. Yet, Jenny Erpenbeck demonstrates here that it is possible to capture the universal by examining the particular (like zooming into a Mandelbrot fractal image), amazingly in only a couple of hundred pages of personal histories succeeding each other in a patch of land by a lake in Bavaria. For me, reading the novel was like looking at a Seurat painting, like watching a time-lapse video or listening to a major symphony. I will try explain each analogy.A Sunday Afternoon on the Island of La Grande JattePointilism is a late form of Impressionism, where the viewer starts from a distance, looking at ghostly siluettes like dancing shadows moving in a sunny landscape. As he comes closer and closer the observer discovers how the painting is created by thousands and thousands of dots in contrasting colours placed close to one another. To use a more recent analogy, I have seen on the net huge posters assembled from individual portraits of people of different skin colours achieving the same effect. Erpenbeck made it easier for me to make the association with Seurat, as in the very first chapter a young girl wanders into a forest clearing and has a vision of ghostly figures strolling through the grass, dressed in costumes from different time periods: \"As the day is old and the world is old, many people can stand in the same place, one after the other. (Georg Buchner) The novel becomes a dance of succesive generations leaving behind afterimages of their time spent in the meadow by the lake, making the present a pointilist overlay that needs to be observed from a distance in order to perceive its deeper truth. Also from one of the first stories, this dance of generations is beautifully captured in the oral traditions and superstitions that are probably older than Christianity, going back to our common tribal memory. A collection of rules and traditions that gives structure and strength to a community by regulating all major events of a lifetime, from birth to weddings to funerals. This treasure chest of ancestral wisdom is getting lost in the uniformity of popular culture and globalization, but I grew up in a neighborhood when the parents and grandparents generation still had knowledge of all these quirky and enchanting customs: When a woman gets married, she must not sew her own dress. The dress may not even be made in the house where she lives. It must be sewn elsewhere, and during the sewing a needle must not be broken. The fabric for a wedding dress must not be ripped, it must be cut with scissors. If an error is made while the fabric is being cut, this piece of fabric may no longer be used, instead a new piece of the same material must be purchased. another example: If a maiden wishes to know if she will marry soon, she must knock on the wall of the chicken coop during the night of New Year's Eve. If the first creature to emerge is a hen, she's out of luck, but if the rooster responds first, her wish will be granted. These traditions endured for a long time unchanged, there wouldn't be much of a story if they were the sole focus of the book. Instead, the author chooses to zoom in on the period of rapid transition, from late nineteen century to early in the third millenium, when the whole fabric of society is ripped apart by world wars and major political movements, by alienation of newer generations from their roots and by the decay of the old fashioned system of values and ethics.Given the big picture, the composite image I have talked about until now, I might leave the impression that individual lives count for little in the master plan, but the reverse is true, as each life contains within itself the seeds of eternity. An eternity defined not by stagnation but by birth, growth and decay. One after another, they enter the meadow, dance for a while in the sunshine, then bow out and make space for the next visitor: a rich farmer and his four daughters, an arhitect, his wife, a Jewish cloth manufacturer, a young girl who hides from the Nazis, a writer, an exile from a different country, a pair of teenage friends, some tenants, an illegal squatter. Most of them have names, but names are less important than their interaction with the place. The place having a life of its own, starting with untamed forest, then a summer house, then a houseboat, a dock, a workshop, a formal garden, a ruin.  A house is your third skin, after the skin made of flesh and clothing. Homestead. A house made to measure according to the needs of its master. Eating, cooking, sleeping, bathing, defecating, children, guests, car, garden. Calculating all these whethers, all these thises and thats, in wood, stone, glass, straw and iron. Setting out courses for lives, flooring beneath feet for corridors, vistas for eyes, doors for silence. Linking the place and the people together is a mythical figure, the gardener, for me an avatar of a detached deity whose only concern is maintaining the continuity of life. He's the most important figure in the whole novel, so maybe I should try to capture him in more detail.For this I'll use the time lapse analogy. You may have seen the result in wildlife documentaries: a photographer sets his camera on a tripod then, with a special remote timer, takes a series of photos at fixed intervals. When the hundreds of photos are reassembled in sequence you obtain a fast forward movie of clouds running like wild horses across the sky, of a budding flower opening its petals or of a butterfly emerging from its chrysalis, of the sun rising and setting in a couple of seconds, of seasons chasing one another with a tree in the center of the image blooming, reddening in autumn and then losing all its leaves. The prologue of the novel stretches the timeline even wider, following the slow dance of the glaciers as they shape the landscape, flattening the plain, leaving behind a talus of rubble that will be covered with soil and forest, and then parrallel grooves that will fill with water to create a lake. The speed slows down as we approach the XIX century, and the timelapse follows the coming and going of the seasons, the rising of the house and of its garden, the slow decay and dissolution that follows unerringly after birth and growth. The gardener is not only the caretaker of the place, he is also the indifferent observer who doesn't get mixed up in family dramas, in wars or in politics. Following a rhythm as old as the stars, he racks up the deadwood, cuts the old trees and stacks the kindling for winter, spreads the manure, digs he holes for new trees or flowerbeds, waters he lawn two times a day, morning and sunset - regular like clockwork or like the breath of the oceans from where life first emerged. The gardener wheels up the next barrowful of soil and dumps it out. To tame the wilderness and then make it intersect with culture - that's what art is, the householder says. [...] To avail oneself of beauty regardless of where one finds it. I am reminded of a phrase from Malcolm Lowry about a derelict garden in Cuernavaca. He too sees our destiny not as conquerors of time and nature but as gardeners, temporary tenants (Visitors) whose task is not to destroy, but to nurture and build (beauty, art, new life) Le gusta este jardin? Que es suyo? Evite que sus hijos lo destruyan! I've talked about geological, seasonal and cyrcadian rhythms, about the drumming of waves, the whispers of the wind or the loud declamations of cannons. All these bring me to the metaphor of the novel as a symphony, where each individual character(the farmer's daughter, the arhitect, the writer, the gardener) sings his theme on his own instrument, but together they produce much more than their melodies: a tarantella of folk dance, an andante over the peaceful waters of the lake, a presto of cavalry charge and artillery, a requiem for a house in winter, an ode to the joy of living. Again the individual lives get lost in the bigger sound of the orchestra, but that doesn't mean that they are not important, that their theme songs do not reflect and enrich the basic structure of the opera. Here are the last quotes that I saved from the novel. All could be verses of songs, or sketched ideas for a haunting melody: \"If I came to you,O woods of my youth,could youPromise me peaceonce again?\"  (Friedrich Holderlin) This is the key to the gardenfor which three girls are waiting.The first is named Binka,the second Bibeldebinka.The third's name is Zickzettzack Nobel deBobel de Bibel de Binka.Then Binka took a stoneand struck Bibeldebinka's leg bone.Then Zick, Zett, Zack,Nobel de Bobel de Bibel de Binkabegan to weep and moan.  The dandelions are the same here as back home, and so are the larks.  They knew nothing more beautiful than just letting the wind carry them along. Sailing is a beautiful thing.  In the end there are certain things you can take with you when you flee, things that have no weight, such as music. That's what I will take with me from the reading of Jenny Erpenbeck masterful novel : an impression of light and shadow in a meadow, a timelapse of a house and a forest, a romantic symphony that says much more than words could ever capture. And, as with all those major Romantic symphonies and concerts, I'm sure a re-read will reveal more hidden treasures, deeper meaning and brighter beauty."}, {"userName": "·Karen·", "userReviewDate": "Nov 07, 2010", "userURL": "http://www.goodreads.com/user/show/1652898-karen", "userReview": "Stunning. A grand summer house on a lake just outside Berlin is the focal point of twelve stories of those who arrest a space there from the turmoil in central Europe between the Weimar Republic and the post Re-unification period, with all the shifts and dislocations as ideologies and regimes pass. Attempts to fix themselves to a piece of earth are fruitless. In between each chapter we have the constant gardener, whose pragmatic planting, pruning and propagating is described in a tone of incantation, in the quiet repetitive cadence of ritual: \"In summer he sets out sprinklers on both lawns, twice each day they will bow to one side and then the other for half an hour, once early in the morning and once at dusk, meanwhile he waters the flowerbed, roses and shrubs.\" A relief, a foil, a contrast to the forces of man-made history whirling and sliding around him.The set-up has been compared to Simon Mawer's The Glass Room, but the treatment here is marked by finesse and subtlety, not adjectives that I would dream of using anywhere near Mr Mawer's attempt to get a contract in Hollywood (I never heard he'd managed?). Where Mawer conveyed coincidence and corny sentimentality that turned the vagaries of history into melodrama, Erpenbeck's prose floats and shimmers like the lake at its feet, shot through with glinting sparks of light, with treasure beneath the surface just like the silver cutlery sunk in the shallows at the centre of the lake to hide it from the invading Red Army. The most impressive chapter in the book is the only one that takes place away from the house. As has happened before in that house, and will happen again, a young woman is hidden inside a cupboard, trying to survive by becoming invisible. However this time it is the granddaughter of the Jewish cloth manufacturer who once owned the next door plot: she is hiding in the Warsaw ghetto. All of the holocaust is condensed into twelve pages of heart-rending, perfectly pitched prose that alone deserves the accolades that this book has garnered. \"For three years the girl took piano lessons, but now, while her dead body slides down into the pit, the word piano is taken back from human beings, now the backflip on the high bar that the girl could perform better than her schoolmates is taken back, along with all the motions a swimmer makes, grasping for crayfish is taken back, as well as the study of knots for sailing, all these things are taken back into uninventedness, and finally, last of all, the name of the girl herself is taken back, the name no one will ever again call her by: Doris.\" Those deaths that wiped out both individual lives and humanity and civilization and culture. Everything turned to dust in the mouth. I wept."}, {"userName": "Tara", "userReviewDate": "Apr 04, 2017", "userURL": "http://www.goodreads.com/user/show/1663300-tara", "userReview": "One word: brilliant. I just had some conversation on another review of Sherwood Anderson's Winesburg, Ohio . This book is similar, but more masterful. Sold as a novel, it is really more of a novel in stories, centered around a plot of land on a lake and a house that apparently German writer Erpenbeck's family once owned. This accounts for the visceral details and the heavy emotion that hangs around the events that occur during the historical time period in which this book takes place outside Berlin. It is somewhat autobiographical.It takes a while to get into the book. At least, it took several chapters for me to get invested. So if you pick it up, keep going to the end. You will be rewarded, promise. This is the kind of writing that expands your mind. Don't give up. From the architect who builds the house, to his wife, to their daughter, to the neighbors (most of all to the Jewish neighbors, some of the most powerful passages I have ever read), to the gardener who weaves in and out of this desecrated Garden of Eden like a dispassionate god, Erpenbeck's experimental language and philosophical statements left me in awe. She has her own style and voice, reminiscent of Virginia Woolf, who could bend time and events in one breathless paragraph.This is a hugely talented writer, who is lucky to have found the perfect translator in Susan Bernofsky. A huge thanks to Bernofsky for bringing this masterpiece to the English-speaking world. It's a book one can read over and over and get something new out of it each time. In fact, I am going to go back to the beginning again now that I know what she was trying to achieve...."}, {"userName": "Greg", "userReviewDate": "Sep 22, 2010", "userURL": "http://www.goodreads.com/user/show/42508-greg", "userReview": "This is a book about a small relatively unimportant piece of land in Germany and the people who happen to have some ties to that piece of land for a hundred years or so. It's just a piece of land alongside a lake. Except for some little bits on construction little changes physically on the piece of land, but being that it is in Germany, and in what would be called East Germany for about half of the 20th Century, and being what history is there are quite a few questions that can be explored just by making up stories about a simple piece of land alongside a picturesque lake. Fill in my usual thoughts on memory and history and the holocaust and you'll get what could be the gist of my review. The book deals with harsh things but it does so in a very delicate way. I don't meant that as a bad thing. I refer anyone who cares about how I might be (mis)using the term to see the William Gaddis quote in the quote section of my profile, and please ignore the typo in the middle of the quote that is all my doing. That is my book review. Thank you for reading. This is an aside. The idea of place is tricky. What makes a place be designated as a place? Does it encompass all of the history and memory that attaches itself to a certain spatial location? Is it just the spatial location? What about a place that moves? Is there a necessary relation between physicality and place? Is a website a place? It has the word site in the word, and sites are places, right? In the past week another of the possibly historical moments flared up on goodreads.com. Again, it involved chastising someone who may or may not have done something ethically wrong, or maybe more accurate it can be said that information about one person rubbed lots of other people the wrong way. Like the Ginnie fiasco from an earlier time, it's tough to say exactly what the person did wrong. Especially since no one involved seems to even know anyone who has been wronged by the chastised person. My take on him (since no one is asking) is that he is a turd and he deserves what he gets. I can't give an answer why this is so. I can't even convince myself that my opinion is correct except that I feel it in my gut, the same way I feel that the Game guys are wrong for what they do and that racist skinheads should have the shit kicked out of them even if they haven't done anything yet. If I apply any kind of rigor to these opinions they fall weakly apart. Fortunately for the world my irrational opinions and what I think should be done to people who break my personal rules for conduct aren't enforced and all you really get for breaking them is a strict but generally silent censure in my head. I never said why I think he's a turd though. It's not that he is a stalker or a sender of knives in the mail with instructions to use them as dildos; it's rather his response to Meredith, the whole (I'm not going to try to find this actual quote, you probably already know what I'm talking about anyway) 'oh I am the type of person who just can't stand to be involved in conflict so I just can't read these accusations anymore.' Anyone who uses this answer to accusations or in an argument is a turd. A turd who should be locked away in a room so that they can't communicate with anyone else since what they are in effect saying doing is trying to trump the argument or accusation through a side-stepping method that puts them on a moral high-ground and their opponent as muck-dwelling cretin. This is the same answer that has been used in the past by more than one person on goodreads.com threads to attempt a quick moral victory when all of their actual arguments had been destroyed. See for example Scott's attack on Karen's Known World review. Weak argument, name calling (degradation of character), more name calling, and then a quick bowing out of the fight by putting oneself above everyone else (see also Seth. See also Stephen (what is it with the S's here?)). That is what makes you a turd. This whole thing will pass though. In a year from now it will be mentioned with DoctorM-gate or whatever name it picks up and someone who maybe is a member of goodreads.com right now, but who doesn't know anyone involved in the drama but who is going to befriend people involved a few months from now will ask about who DoctorM is, or what Ginniegate was, and someone will bring this person up to speed. And then someone else will probably point out about how much better goodreads.com was then (now) then it is now (in the future), and someone else will threaten to quit being involved at all because the site was more fun back then, and even more interesting in an even farther back time, and some people involved now who just lurk and grumble then will come out of lurking and grumble about how much more interesting the reviews were then, and back then (now) they wrote interesting reviews, but now (in the future) they don't write anything anymore, but just grumble about the reviews being stupid these days. And then at another then even farther in the future someone will look back to the then of the not-so-distant future and say how much better it was, but point to the end of September 2010 as being the really awesome time, when there was community and interesting conversations all because of some pervy old dude who wanted young chicks to do themselves with gardening tools (the facts blur over time) and everyone in that farther in the future time sighs and says yes, that was when goodreads.com was fun and good, and they all sigh again and say it's all so idiotic and boring now. And so on and so on, and through it all it is the same place with subtle shifts and shit but it's only through memory that the meaning and importance is built and manipulated."}, {"userName": "Trish", "userReviewDate": "May 14, 2011", "userURL": "http://www.goodreads.com/user/show/1826682-trish", "userReview": "Sometimes contact with a place transforms us. Erpenbeck traces for us German history in the last century through the lives and loves of people involved with a piece of land by a lake on which sits a summer house with an eyebrow window and a roof of thatch. This slim, quiet, extremely powerful novel carries with it the weight of change and allows us to inhabit history. There is a stillness, reserve, and lack of sentimentality about the story which paradoxically fills us with emotion. The house and gardens on the land by the lake are designed with love in mind, the windows framing the view. “A house is your third skin, after the skin made of flesh and clothing.” But when the second war came, “one could only pity a person who owned a piece of land and not a flying carpet.”WWII books are so common that it takes something unusual to yank me from the torpor that descends upon me as I contemplate another trip through that wasted landscape. The last book which was able to do that for me was Imre Kertész’s Fatelessness. And now, Erpenbeck’s Visitation. I fear I have used all my superlatives when it comes to talking about books so that when I say \"extraordinary\" it doesn’t convey the truly astonishing clarity and craft the author exhibits. Erpenbeck brings us something new: the war from the view of German citizens, broken as a citizenry when the Jews were removed, or, as in the case of ‘the architect and his wife’ living in the house they built by the lake, without much understanding. It hadn’t all been the architect’s land, to begin with. He’d acquired a large piece which included the boat house (\"paid a full half of market value\") from the cloth merchants, who had owned the parcel next door, allowing them to leave the country.  Hermine and Arthur, his parents.He himself, Ludwig, the firstborn.His sister Elizabeth, married to Ernst.Their daughter, his neice, Doris.Then his wife Anna.And now the children: Elliot and baby Elizabeth, named for his own sister.Most didn't make it out. The war intruded finally, on the land by the lake, in the form of invading Russians, at least one of whom left his seed to grow on the land by the lake.But this is not just about war. We move from the Weimar Republic through the Second World War to the Fall of the Wall. This book is about that fourth dimension in architecture, time, and how that adds to height, width, length to make something enduring, or perhaps, not so much. Any book of this quality must have a translator who can keep pace and give the work its intended gravitas. Sarah Bernofsky, the translator of this novel and three of Erpenbeck’s others, is Co-Chair of the PEN Translation Committee and has won several awards for her work. Most recently she shared the 2014 Independent Foreign Fiction Prize with Erpenbeck for her latest novel, The End of Days, a novel which takes on the theme \"what if.\" Sometimes a life can change direction on the smallest incident."}, {"userName": "Roger Brunyate", "userReviewDate": "May 10, 2016", "userURL": "http://www.goodreads.com/user/show/42294189-roger-brunyate", "userReview": "DissolutionThis prose poem by Jenny Erpenbeck is clearly art of the highest order, so much so that I feel a little inadequate reviewing it. It is the story of a house looking over a lake in Brandenburg, not far from Berlin. Built by a young architect at the turn of the century, it sees two world wars and several different regimes. Its successive inhabitants come and mean to stay—but increasingly they go, due to age, death, or exile. But the house and land are clearly the main characters; like the people, they grow, change, and eventually decay, but on a much longer time-span. In between each of the main chapters, there is a short section headed simply \"The Gardener,\" focusing on the man who looks after the property, and the detailed routine of pruning, cultivating, managing the round of the seasons. For example, we watch an orchard being planted, bearing fruit, growing to maturity, succumbing to insect infestation, and finally cut down. All this over the course of a terrible century in a tragic land.By writing with such precision about surroundings—not merely the house and grounds, but local customs, legal ordinances, detail of all kinds—Erpenbeck places human drama at a distance, and creates a time-scale in which even tragic events seems only temporary. Not for nothing does she open the book with \"Approximately twenty-four thousand years ago\" and ends with \"the landscape, if ever so briefly, resembles itself once more.\" One of the meanings of the German title Heimsuchung is indeed Visitation, as in the Visitation of the Virgin Mary—a curious choice by the otherwise excellent translator Susan Bernofsky, though it does reflect the grace that permeates this book. But another is Infestation, which is much more apt. There are natural infestations here, such as martens and dry rot; human infestations such as the soldiers of the Red Army defecating in the drawing rooms; political infestations (though kept pretty much offstage) such as the Third Reich and Soviet occupation; and through it all, the sense that the building of this house is itself little more than a passing infestation of an enduring landscape.With one significant exception, none of the characters are given proper names; instead, they have labels such as: \"The Architect,\" \"The Red Army Officer,\" \"The Visitor,\" or \"The Childhood Friend.\" The only names are given to a family of Jewish origin who either go into exile or are killed. Their chapters are the most heart-breakingly succinct evocation of the Holocaust that I have ever read, an aching poetry of promise and loss, punctuated by a few brutal phrases near the end. There are moment of violence elsewhere also—a bizarre sexual encounter in a darkened closet, two horrorstruck children watching the rape of a third—but they take second place to the persistent aura of longing and of loss. Home, the first part of the German title, is everything here, but it is more about leaving or losing one's home, and even the episodes of return are fraught with sadness. Erpenbeck quotes some lines of Hölderlin as an epigraph:\nIf I came to you,O woods of my youth, could youPromise me peace once again?\nBut she answers this in her next quotation, an Arabic proverb:\nWhen the house is finished, Death enters.\nTo do the book justice, I would need to read it at least twice more. And probably to compare the original German, though Susan Bernofsky totally convinces me with her sensitive handling of language. For Erpenbeck writes like poetry or music, where phrases echo and amplify one another within a paragraph, a chapter, and the entire novel. I would want to read it all in one sitting, to enjoy the play of these references within a living whole. Then I would want to read it very slowly, with pencil in hand, to track the sequence of events and the ways in which the various characters relate to one another and to the house. But I suspect that Erpenbeck has precisely calculated the in-between state of a first reading, in which one senses the musical structure without tying it down, and feels the interconnectedness of the people without needing to reduce their lives to a linear story. This is a book like few others, a small masterpiece.+ + + + + +PS. I have now read both Erpenbeck's other short books to be published in English, which also deal with the pathology of the middle years of the last century, but in different ways. The stories in \nThe Old Child\n (1999) are surreal or symbolic, and highly charged with sexuality or violence. \nThe Book of Words\n (2004), while even more violent in implication, handles the subject obliquely, set in a distant country and seen through the eyes of a child. Both are eminently worth reading, but the poise and clarity of Visitation is something quite new.PPS. And add to that now her most recent novel to be translated in English (although I started it when it first came out in German), \nThe End of Days\n (2013). Like Visitation, this also covers most of the history of the century, though at greater length and through a very different narrative device, showing the many ways in which a given life might have been ended, but in fact was not.PPPS (2017). I wish I could add Ms. Erpenbeck’s most recent novel to appear in English, Go, Went, Gone, to this victory parade. But although she continues her examination of the morality of state power, she is just a little too close to the subject of this one—the plight of refugees in Germany today—to find some device of literary distancing such as made the previous books so poetic."}, {"userName": "Jimmy", "userReviewDate": "Jul 26, 2010", "userURL": "http://www.goodreads.com/user/show/1325473-jimmy", "userReview": "An instant favorite. What I’m most impressed with is her ability to be so distant and cold in her poetic approach, yet somehow the overall effect is relatable, and very human. Often when I read books that are poetic in nature (see: Maud Martha, Deep North, even Silk) I feel disconnected from the characters by a veil of constructed beauty. But even though this book has all that beauty and construction and a huge bag of tricks to boot, I always felt emotionally involved. And even though she uses her bag of tricks (calling it that is a disservice to what’s going on here), it never feels heavy handed or show-offy. All of it is pulled off with subtlety, delicacy, careful pacing and craft, yet it never comes off as sterile.The book starts off with these illuminating epigraphs:As the day is long and the world is old, many people can stand in the same place, one after the other. -- Marie in Woyzeck by Georg BuchnerIf I came to you, / O woods of my youth, could you / Promise me peace once again? -- HolderlinWhen the house is finished, Death enters. -- Arabic proverbThese quotes set the tone for what is about to be revealed, which is similar to seeing several photos of the same place superimposed onto one another, the people in it appearing like ghosts crossing over for a quick visit. Time is compressed in these narratives; the concern here is not only with objective linear time, but with time seen through the blurred lens of memory. And also with the disconnect between objective time (its brutal passing, regardless of us) and subjective time (our distortions, regardless of fact). The confusion that results is somewhat eerie. I’m having trouble coming up with examples, as she creates these effects over many pages. The chapter entitled “The Cloth Manufacturer” illustrates this very well, and can actually be read as an excellent standalone short story. Here is a sentence from that chapter:I know, he, Ludwig, says, his father’s only son.The chapters differ slightly in style depending on what each is saying, yet come together as a whole perfectly... and this chapter had one of the most distinctive styles. The sentences were short, declarative, often containing repetitive information cordoned off into dependent clauses that were then displaced at the end of the sentence. This displacement is intentionally jarring and sometimes awkward, but also the repetition of information had the tone of an ominous fairy tale, like the voice of someone trying to convey a horrible event to a child in the simplest way possible. Instead of progressing any kind of plot, each chapter is more concerned with filling in every crack in the context surrounding a single place. Context over content, or context being the content. Also: extensive passages are dedicated to pure information (marriage rituals, property rights, land formations, etc.). Since I’ve been reading Walter Benjamin also, I couldn’t help but connect the two. Benjamin talks about how information has increasingly taken over traditional forms of personal and collective history:The replacement of the older narration by information, of information by sensation, reflects the increasing atrophy of experience. In turn, there is a contrast between all these forms and the story, which is one of the oldest forms of communication.This information moves along like time itself, relentless and unceasing like the endless seasons’ demands and the gardener’s constant work. Meanwhile, it is only the reader, with the advantage of having the entire book within reach, who is able to piece together the different narratives into a story. For each generation seems isolated from the ones before it and the ones to come, leaving only traces here and there, the scent of camphor and mint, but separated off like a dependent clause at the end of a sentence.We come to know time intimately as a character; and place as well, for the two are intimately bound:Home! he’d cried out like a child that would give anything not to be seeing what it was seeing, but precisely in this one brief moment in which he hid his face in his hands, as it were, even this dutiful German official had known that home would never again be called Bavaria, the Baltic coast or Berlin, home had been transformed into a time that now lay behind him, Germany had been irrevocably transformed into something disembodied, a lost spirit that neither knew nor was forced to imagine all these horrific things.In the middle of this book, the larger context of world history envelopes the smaller context of our story; we watch helplessly as our characters’ fates are dominated by the Holocaust and the war. We see time and place transformed by horrible events, distorted so that nothing is familiar. Nothing will be the same again. The consequence of linear time is its one-way-ness, we can never go back. And it is as if the novel pivots around this one point. We can never see these same places the same way, never associate them with the same uncontaminated memories. This is what makes the book so tragic: it keeps going. We see the generations roll on, they deal with what they must, and soon even the horrors are forgotten and we, the readers, are the only ones left with the memories of what happened here, in these familiar places.Two other notes. 1) The translation is excellent! Attention and detail and subtlety on the minutest level. 2) the Goodreads description says this was a bestseller in Germany. That blows my mind, that a book of this caliber and complexity can be so popular. Sadly, I cannot imagine it happening here in the US."}, {"userName": "Jill", "userReviewDate": "Jan 23, 2011", "userURL": "http://www.goodreads.com/user/show/2228181-jill", "userReview": "It is very rare that a book combines a mastery of language and cadence with an assured and innovative vision to redefine the literary landscape. Visitation is such a book. It is, to my mind, a contemporary masterpiece.It will be widely compared, no doubt, to Simon Mawer’s The Glass House, because its property on a Brandenburg lake outside of Berlin is at the heart of the novel. Yet in that book, Mr. Mawer sacrificed characters to themes. In Visitation, Ms. Erpenbeck does something far more daring: she focuses on time and place as a constant, while each of her characters is (to quote Macbeth) “a poor player that struts and frets his hour upon the stage, And then is heard no more.” She is absolutely unflinching in her ability to look beneath the surface to the tapestry of individuals who come and go while the shimmering lake and woodland remain. Each of the characters receives his or her moment on the stage, with only one who consistently appears: the gardener. There is something soothing and reassuring about his constant reemergence, as he spans the seasons, adding topsoil, sowing grass seed, gathering fallen branches, coaxing nuts from their soft husks, stacking logs in the woodshed. He is a symbol of the cycles of life, spring, winter, summer, fall, always predictable, regardless of the temporary drama being played out.To illustrate the temporal nature of all characters, each is only defined by his or her profession: the architect, the Red Army Officer, the writer, the illegitimate owner. There is one exception: the Jewish characters are named: “Hermine and Arthur, his parents. He, himself, Ludwig, the firstborn. His sister Elisabeth, married to Ernst. Their daughter Doris, his niece.” Indeed, that chapter – the Cloth Manufacturer – contains some of the most powerful writing I’ve ever read, as Erpenbeck uses cadence and repetition to move her characters towards one of the worst horrors of modern history.On the chapter on Doris, Erpenbeck writes, “For three years the girl took piano lessons, but now, while her dead body slides down into the pit, the word piano is taken back from human beings, now the backflip on the high bar that the girl could perform better than her schoolmates is taken back, along with all the motions a swimmer makes, the gesture of seizing hold of a crab is taken back, as well as all the basic knots to be learned for sailing, all these things are taken back into uninventedness, and finally, last of all, the name of the girl herself is taken back, the name no one will ever call her by: Doris.”Descriptive and passionate writing like this – in the chapters that focus on the gardener and on the Jewish family – is interspersed with the mundane elements and ritualsof life, for example: “Present exigency: The property that is the subject of the proceedings. Pending determination of ownership. Registration number 654.”The language, in many cases, is like lyrical poetry. I must acknowledge the outstanding translator, Susan Bernofsky, who expertly translated this masterwork from German to English. For literary readers, all I can say is, this is why we read."}, {"userName": "Aubrey", "userReviewDate": "Dec 08, 2010", "userURL": "http://www.goodreads.com/user/show/4119460-aubrey", "userReview": "The new world is to devour the old one, the old one puts up a fight, and now new and old are living side by side in a single body. Where much is asked, more is left out.\nWhen a home is haunted by humans for a period of time, and I say home rather than house for the neighbors and the water and the burials out of fear and desolation, a circumscribing narrative that does not sound when plucked is no narrative at all. What, then, must be done? Perhaps the humans with their incessant need for successive generations and compounding piles of data and script will save it. Perhaps the rotting here and the growth there and the lingering layers of sunken fruit trees and marveled find of plated silver will lead some archeo/anthro/paleo (depending how flung off the far on future analyst of our present histories rears their head) type to decree, this is the line, there is the marrow, here is the story of their lives, as decreed by rock and loam. Or maybe saving's the wrong word for it, and what's witnessed here is not the rise and fall of heritage and faith but a specific wounding of the earth, begun when the land was \"owned\" and ended when the house was \"destroyed.\" Who knows the thoughts of glacier's blood when fleshy beings insist on traversing its depths for various types of nourishment. Who thinks the feelings of the soil when foreign roots take hold.\nH-o-m-e. Which thou must leave ere long.\nThere is a marked difference between contemporary literature for which World War II is all and sundry, and works for which it is a shaping of the landscape. I will admit that chances of my being drawn to a piece of work increase exponentially with either handling of that particular set of time and place, but that's as much a manner of peer proximity as personal preference and, besides, I do not have to like it. How nice, then, that however my motives may have played out in initial interest, and however much I may be in error about the author's motivations, I ended with a piece to which land is land and history is history, not a data crunch of a capitalistic popularity contest. I can't riddle you the exact difference between those above mentioned two, but it has something to do with economics and horticulture, artistry and bureaucracy, the way from fairy tales of Grimm to the Berlin Wall and all the wooded and sundered way back. Humans are hierarchical and categorical creatures, and foregoing all that's accrued as consequence for the sake of entertainment does nothing but strip the vibrating solidity from its four dimensional moorings, leaving but a husk of propaganda behind. History, in its pretenses of ownership and seizure and grace, repeats itself.\nNow it seemed the village no longer existed, but perhaps the hunter was still roaming through the woods.\nSome works I favor for the craving they spark. After such a piece as this, I wish that every geological monstrosity of human settlement and human erasure gets its say in some form, some where, some time. It's not that I want to experience them all for my own, mind you. Exorcisms exact an audience.\nI a-m g-o-i-n-g h-o-m-e. No, she and her husband did not go home to Germany, what they wanted was to bring this country–only coincidentally the one whose language they spoke–back home again in their thoughts. They wanted finally to drag from beneath the German rubble some ground they could keep beneath their feet, ground that would no longer be illusory. Although their bodies would grow old, their hope for mankind's salvation from greed and envy would, they thought, remain young for a long time, the errors of mortals were mortal, but their work was immortal. And now it is precisely that young doctor whom they allow to examine their aging bodies once a year, that doctor who is taking advantage of the State to become the heir to its founders. It has once more come to pass that the invisible army, now divided, is soundlessly striking it sown forces with invisible lances and shields. Perhaps these young people, who knows the enemy only from the reports of their elders and have never seen him face to face, will soon be ready to defect and join the ranks of this foe, even if only to have at last the opportunity–after so many years of siege–to take up arms once more."}, {"userName": "Cheryl", "userReviewDate": "Aug 05, 2013", "userURL": "http://www.goodreads.com/user/show/2375838-cheryl", "userReview": "This is a swirling wash of dream-like fragments, memories, anchored by a lakeside home that withstands years of turbulent German history. The mundane, the poetic, the profound, and the tragic mingle together, indistinguishable, as in real life. I wish I could have been able to read this in the original German; the translation was stunning -- I can only imagine how even more stunning the original must have been.This book perfectly illustrates why I like Goodreads so much. It is translated from the German, and isn't the type of book to be prominently displayed in our local bookstores, not even the awesome indie ones we have in Victoria. And it’s not one that I noticed on any of the book sites that I spend too much time on (or maybe not enough time -- then I might have noticed the review on the Guardian http://www.theguardian.com/books/2010... ). So it never crossed my radar.But several GR friends loved it, and wrote wonderful and thoughtful reviews ( see Karen’s , Fionnuala’s , and Friederike’s reviews, among others). So I put this on my wish list, and one day, to my surprised delight, I found a used copy for $5 in our largest used bookstore. Like so many new books for me over the last couple of years, I would never have even pulled it off the shelf to look at had it not been for the GR community."}, {"userName": "M. Sarki", "userReviewDate": "Feb 14, 2012", "userURL": "http://www.goodreads.com/user/show/5562041-m-sarki", "userReview": "http://msarki.tumblr.com/post/5335709...In my adult lifetime I have lived in, while remodeling, four different houses. I no longer own any of these homes nor do I have any access to them other than the casual drive-by. But my sweat and brains remain a part of each of them, some rotting away as I am, and others being enjoyed and appreciated for the good work my wife and I did in making the houses aesthetic and hospitable when we were stewards of the properties. But none of these houses will remain forever, just like the rest of us. But a remnant or a memory might, or a fragment hidden between the planks among the dusty items on a shelf in the cellar. I know already what all this feels like. Jenny Erpenbeck, the author of this work I am about to speak of, does too.All the characters of VISITATION who inhabit the property from the time it is built on until its eventual return to vacant land remain as evidence that something of them had to survive. These people Erpenbeck describes as visiting there, in one form or another, take shape as memorable characters, characters we get to know pretty well such as the gardener. His patient and pragmatic labor continues on through the seasons of every different occupant, landowner, or borrower of the property he, the gardener, has maintained through all the years until he too grows old and cannot do much of anything but watch it fall apart before his eyes.But the story is much more than the succession of ownership and occupation. Giorgio Agamben wrote of the Holocaust in his brilliant book of essays titled Remnants of Auschwitz: The Witness and the Archive. Disheartening and distraught for me as anything ever written of that awful period in our history until Jenny Erpenbeck writes about her character Doris in an eleven page episode set mostly inside a pitch-dark closet. There is nothing I can say here worth the time it takes you to read the pages yourself. Powerful work by one of our strongest voices writing today in any language.In 2000 I wrote a poem based on my reading of this book of Agamben's. I do not believe I have collected the poem anywhere as yet, and it most likely is because it is hard to find other poems of mine that would feel comfortable being neighbors with it. The poem is as follows:Muselmann! Preen Our RosesNot coy but aloof inhumanity.A tread nom de plume. Aninsipid tear. Dolor overcomeby a difficulty unimaginable,impossible to realize exceptin its dying. A death so lonelythat even an outstretched handsimply grazes it, disturbs thebones, the chalking skeletonbroken-down but still alivesomehow to only what is leftof its viscosity.The translator of VISITATION, Susan Bernofsky, again has given us English-speaking folk another little masterpiece in the vein of a Thomas Bernhard or Robert Walser, as close as I can gather. Erpenbeck is no Cormac McCarthy, but who writing today is? But what Jenny Erpenbeck can do is write brilliantly, or Bernofsky in her own genius at translating works for us can help her do so magnificently, and it doesn't much matter to me who is the real hero here. Bernofsky or Erpenbeck, I am eager for more new work from this mighty duo.But I am not a lover of paperback books, or Kindle, or any of the other electronic devices out there. I do like my hardbacks. The weight and the hold they keep in my lap and my hands. VISITATION is not available in anything but paperback or Kindle here in the USA. Why New Directions decided this book wasn't worth publishing in a more permanent and collectible form is beyond me. There is no other writer today, at least for New Directions, more worthy of a hardcover edition than this fine and courageously brilliant woman."}, {"userName": "Ben Winch", "userReviewDate": "Nov 30, 2013", "userURL": "http://www.goodreads.com/user/show/5647943-ben-winch", "userReview": "I think this may be a masterpiece, but it’s not quite my cup of tea. Humble, slim, direct, economical, but also panoramic, experimental, political, all it lacks (unless I’m missing it) is a sense of humour. That and an entry to the world of dreams, which for me is (usually) what fiction is all about. It’s an earthbound book, and generally I like more sky, but it’s as if that weddedness to the earth is a discipline, an act of contrition. I respect that, but sometimes I chafed against the boundaries here. A claustrophobic world: a plot of land by a lake. But across this little chessboard sweep armies and pawns, which, like pawns (like the house, the lake), are never named, only referred to as the architect, the red army officer, the visitor. Many tenants, but that’s all they are, even those who nominally ‘own’ the place. And this is really what moved me: this clinging of the characters, hopelessly, to security; this building of castles in the sand despite the tidal waves of war and occupation. Seen from this perspective, the extreme insistence on ritual and tradition (‘When a woman gets married she must not sew her own dress. The dress may not even be made in the house where she lives. It must be sewn elsewhere, and during the sewing a needle must not be broken’ – part of a two-page litany that starts on page four) is a testament to this clinging, though when Erpenbeck hit me with it right between the eyes at the outset I hesitated, dazed, before continuing. Maybe she wanted me dazed. Throughout, she inserts lists of the most prosaic kind: of chores undertaken by the gardener, or by a householder closing up the house before leaving. I can’t pretend to understand why, unless this insistence on quotidian things were another way for the characters to try and grasp the present. And once that tone is imprinted – on the prose, on us, on the characters – she’ll take off for little flights, always with near-scientific exactitude, through memories and emotions and perception. She has learned how to lose; chapter one: having, and chapter two: losing, she kept losing and losing till she mastered it. It may be that when one has learned a thing, something else disappears from one’s head. When her granddaughter once asked her whether she wasn’t sad about it – about the house, the cows, all their possessions – she no longer even understood the question. She had rescued the children, that’s all there was to say about it.This is a book that doesn’t flinch from what it must recount, but nor – never, not at all – does it wallow. Erpenbeck seems, on this evidence, the heir to a depth of seriousness about everyday things – home, family, sustenance – which I can hardly fathom, and which makes this novel adult in the truest sense of the word. Whether it’s lost a little of childlike wonder in the bargain I’m not sure. Dour might be a word for it. But another might be inspired."}, {"userName": "Hugh", "userReviewDate": "Feb 15, 2016", "userURL": "http://www.goodreads.com/user/show/32318315-hugh", "userReview": "A spare, stark, beautifully poetic miniature that tells the story of a house by a lake in the Brandenburg area of East Germany from the early 20th century to the present day. The structure of the book is unusual, and resembles Simon Mawer's The Glass Room, in which a place remains constant while a shifting cast of occupants, tenants, invaders and usurpers uses and abuses it for a variety of different purposes. This allows Erpenbeck to explore ideas of belonging to a place, ownership, inheritance and how these can be altered at the whim of larger historical events - this is quite reminiscent of Erpenbeck's more recent The End of Days. Each chapter follows one of the occupants, and is followed by a brief interlude focusing on the gardener who is the only figure who links every section of the story, though his role changes as he gets older. The writing uses folklore elements and key sentences are often repeated several times at different stages of a chapter."}, {"userName": "Teresa", "userReviewDate": "Jan 16, 2012", "userURL": "http://www.goodreads.com/user/show/541416-teresa", "userReview": "4 and 1/2 starsI think maybe I would've given this 5 stars if I'd been able to read it straight through rather than in spurts while I was traveling. It's a prose poem of a novel, slim but encompassing the history of Germany, starting with a short prologue of the Ice Age to the building of a summer house in one particular wooded area with much more to follow. If I knew more of German history, I'm sure I would've gotten more out of it; but even without that knowledge, the ebb and flow of the seasons, and the possession and dispossession of the house and the land by owners and visitors is quite effective. Along with a focus on the \"dirty\" destructive effects of nature, the author doesn't shy away from the filth that emanates from humans, its helpless grittiness, its uses and its power."}, {"userName": "Carol", "userReviewDate": "Oct 06, 2017", "userURL": "http://www.goodreads.com/user/show/23315273-carol", "userReview": "RTC"}, {"userName": "LindaJ^", "userReviewDate": "Oct 10, 2017", "userURL": "http://www.goodreads.com/user/show/4999879-lindaj", "userReview": "I loved this short book that took me three days to read. The prose (great translator) is lyrical, poignant, factual, and subtle -- it short, it is beautiful. This is a story about place -- land on a lake in Brandenberg, Germany. For many generations it was in the hands of the mayor, until the mayor had no sons but four daughters. In the early 20th century, the may sells the parcel meant for daughter Klara, known as Klara's Wood, in three pieces - one to a cloth manufacturer who is Jewish, and one to a Berlin young architect. This book is about Klara's Wood and what it means to a dozen people who in one fashion or another occupy it from the time it was split and sold in three parcels until sometime in the late 1990's. The constants in this book are (1) the Gardiner, with short \"The Gardiner\" chapters interspersed throughout the book, and (2) the house built by the architect. While the book is about a place, the characters are richly drawn. We know them through their connection to the place. In most instances, they are present at the place when their story is the focus of a chapter. The two major exceptions are the chapters for The Cloth Manufacturer and The Girl, where the characters - Ludwig (son of the cloth manufacturer) and Doris (granddaughter of the cloth manufacturer) - are elsewhere when their memories of the place are detailed. What jumped out at me in The Cloth Manufacturer's chapter was the reference to Ludwig's current gardener (p.39): \"Here his gardener must allow an official to stick a pencil into his curly hair. The pencil stays put. Hereupon the gardener gets a big C stamped in his passport and is forbidden to enter public parks.\" Whoa -- immediately I see the connection between Nazi Germany and apartheid South Africa. I recently returned from visiting Central/Eastern Europe. One of the things we discussed with guides in Slovenia, Slovakia, and Hungary was how land that had been confiscated during their Communist days was being handled. Each country had a different process in place. I was reminded of this when the claims were made on the parcels of Klara's Woods after the reunification of Germany by the relatives of those who had originally purchased the parcels. Great book that is now being discussed by the 21st Century Literature group here on GR."}, {"userName": "Ken", "userReviewDate": "Jul 14, 2017", "userURL": "http://www.goodreads.com/user/show/730754-ken", "userReview": "What if the walls had not only ears, but eyes. Ah, the stories it could tell. But houses, like animals, are religiously circumspect. They are reflections, too, of their owners--in tastes, in care, in age. Visitation is the history of a house and 12 of its owners, a satisfying sandwich of time with thin layers between owners to talk of the gardener who cares for the grounds throughout. Set in Germany, the property reflects, too, that country's history.When the house is built, Erpenbeck waxes poetic on house and home, how the wildness we call air gets corralled and tamed by structures that box it under the capable hands of the carpenters. Houses, too, have personalities mirroring quirks of the owner. Maybe an iron bird on the rail of a porch overlooking field and lake. Maybe a hidden closet that opens sesame at the bidding of owners who know its secret latch.Time and the war bring different owners. Fates ordinary and cruel find the various owners. And the reader recognizes commonalities in the structure, the grounds, the plants. Oh. And the gardener, who works first for this owner then that one like a secret owner himself.It's a wonderfully creative piece, slow to start, true, with some wonderful descriptions. You cannot become attached to any one owner, certainly, but over time you grow sentimental about the property itself, almost as if it were some property in your family, as if it had a finite life span itself (which most all structures do) and you were bearing witness of its narrative.Here's an example of a previous owner still in the house while it's on the market, as an example of Erpenbeck's style:What is it you want, her husband always said to her when she--now the illegitimate owner--spoke with him about the property: You had your time there. She had been unable to explain to her husband that from the moment it first became apparent that she would not grow old in this house, her past had begun to send out its tendrils everywhere behind her, and that although she had long since become an adult, her beautiful childhood had begun, all these many years later, to outstrip her, growing far taller than she was--it was turning into a beautiful prison that might lock her away forever. As if with ropes, time was tying this place down right where it was, tying the earth down tightly to itself and tying her to this earth, and as for her childhood friend--who she hadn't seen in over nine years now and would probably never see again--it was tying the two of them together forever.A house concrete as a home abstract, then. One capable of conspiring with time to make you a beautiful prisoner. I like it...."}, {"userName": "Connie", "userReviewDate": "May 12, 2016", "userURL": "http://www.goodreads.com/user/show/5364077-connie", "userReview": "German author Jenny Erpenbeck has written a book with interconnecting memories revolving around a beautiful place. The Prologue shows the creation of a lake in the Ice Age in what someday will be the Brandenburg forest in East Germany. Fast forward to more modern times when a parcel of lakefront property is divided. A Jewish family builds a bath house on one lot for day trips to the lake, while an architect constructs a marvelous house on the adjacent portion as a gift to his new wife.The house is occupied by different individuals or families as history marches on, highlighting the Holocaust, the occupation of Germany by the Red Army, the division of Germany, and the Fall of the Berlin Wall. Throughout it all, the loyal gardener quietly works planting gardens, making repairs, keeping bees, and pruning trees. As the gardener becomes old and frail, the house also starts showing its age.Sometimes the reader will get part of an event from one person's point of view, and then will see another side of the same experience from another view later in the book. Many people come to this lakeside property--Jews, Christians, Germans, Russians, artistic people, sail enthusiasts, garden lovers, bureaucrats, soldiers, writers, and multi-generational families. One of the most poignant chapters involves a twelve-year-old Jewish granddaughter hiding in a secret compartment in Warsaw after her family sold the lakeside property to pay for passage to a safer place. The house, a major character itself, often changes hands for political reasons beyond the residents' control.I was happy to be introduced to this talented German author. Written in spare language in a slim volume, the book shows us the beauty and darkness, the joy and brutality, experienced by the occupants of a memorable house."}, {"userName": "Victoria (Eve's Alexandria)", "userReviewDate": "Dec 09, 2017", "userURL": "http://www.goodreads.com/user/show/1623001-victoria-eve-s-alexandria", "userReview": "Started and finished in a day. Erpenbeck’s principle dimension is time; she writes about the way it leaps, stops, rebounds, folds and repeats in such muscular but effortless prose. Visitation is a lot like The End of Days, or rather the other way around, and I’m always fascinated when a writer is compelled to return to their subject matter. It reminds me of Ali Smith’s recurrent stranger at the door, and seems to indicate something powerful and profound at work. If you can’t tell, I adored it."}, {"userName": "Friederike Knabe", "userReviewDate": "Nov 11, 2011", "userURL": "http://www.goodreads.com/user/show/1746401-friederike-knabe", "userReview": "Colourful is only that what she can still remember, surrounded by darkness of which she is at the core, her head [...] carries colourful memories, memories of somebody, who she was. Probably was. Who was she? Whose head was her head? Who owns the memories? The \"Girl \", who ponders these questions, is one of the protagonists in Jenny Erpenbeck's innovative and powerful novel \"Visitation\". Memories of innocent excitement and happiness of youth, of arriving, settling down, and then having to leave again and of families and people loved and lost form the core of the story. People and events are centred around a lake-side summer house surrounded by expansive woods and gardens in the region just east of Germany's capital, Berlin, affording it the role as the central character and integrating force of the narrative. Using her zooming lens, the author condenses many decades of twentieth century German history into time-specific, intricate and intimate glimpses into the lives of twelve different residents and their families living on the property. While the owners build and add to the house, change it and its grounds over time, leaving visible marks and impressions, they are in turn impacted by the environment and the historical events occurring beyond it.Starting out more like a fairy-tale, the novel gains intensity as it progresses: the portraits become more intense, reaching deeper into the background of the individuals, also relating their actions to specific historical time periods of the last decades: from the Weimar Republic, through the Nazi regime and the Holocaust, War and Soviet occupation, to Socialist East Germany and Fall of the Berlin Wall and beyond. The Girl's haunting account far away, having had to flee her home and Germany, stands out as one of the most heart-wrenching chapters. In others, the reader senses underlying tense emotions, despite the deceptively detached, often sparse language, that refers to most protagonists only as the Architect, the Writer, the Visitor, etc. or the Gardener. However, despite the apparent indistinctness, the individuals portrayed are engagingly realistic and anything but bland generalizations. Events beyond the calm of the summer house are alluded to, hints that may be easier to detect for the German reader. The narrator's language and style changes slightly as the story moves from one voice to the next. Erpenbeck often uses rhythmic prose, sometimes staccato sentences, repetitions, or lyrical prose to reflect her protagonists' moods and characteristics. While the different individuals pass through the house as transient residents - some return later, allowing for intergenerational connections - only the \"Gardener\", more a symbol than a person, remains as a constant, his chapters alternating with the others.The original title \"Heimsuchung\" has several meanings in German, one of which is \"Visitation\". This has an ominous or threatening undertone and often refers to ghosts or disease. An additional meaning contained in the term is \"searching for home\". Both connotations are beautifully captured in stories. For example. the Authoress looks back on a long life, that included fleeing the home of her youth all the way to Moscow and the Urals, and, even while \"going home\" now to the house and the lake, she is still searching for the \"home\" that she can emotionally return to. On the other hand, the overconfident Architect, a former Albert Speer collaborator, is on the run, the ghosts of the past having caught up with him: he is locking up, hiding the valuables, leaving the key for the next occupant of the house...Award-winning Jenny Erpenbeck is a representative of the younger generation of German authors (born in 1967). Many like her were born and raised in then East Germany. Their background enables them to take a different perspective on the past. Inspired by and based on her family's summer house, the author sensitively mixes her own memories and those of people she knew with the wide-ranging fictional reality of her novel. While recent novels like Simon Mawer's The Glass Room come to mind, in that comparable techniques were used to build the novels, Erpenbeck's voice is fresh and independent and very convincing. \"Visitation\", published in German in 2008 and now available in the highly praised translation by Susan Bernofksy, was recently chosen by author Nicole Krauss (Great House: A Novel) as one her favourite books of the year. Having read the novel in its original, all translations are mine"}, {"userName": "Jonathan", "userReviewDate": "Mar 12, 2013", "userURL": "http://www.goodreads.com/user/show/531153-jonathan", "userReview": "A Masterpiece - devastating, poetic and perfectly formed. I fully intend to read this again."}, {"userName": "Calzean", "userReviewDate": "Oct 07, 2017", "userURL": "http://www.goodreads.com/user/show/26416859-calzean", "userReview": "An intriguing book by a very talented writer. The main character is a lake-side house, grounds and gardens located in Brandenburg. The story of the house is told through vignettes of the various occupants and visitors, from the 19th century and to late 20th. The gardener is the only constant across owners.Through short, tight and poetic prose, Erpenbeck covers Germany's history, the temporary nature of life, man's greed and the beauty of the simple life. She pulls no punches which includes a haunting chapter of a 12 year old holocaust victim.Erpenbeck writes short books, novellas and short stories. But why waste words when her stories are so uniquely told."}, {"userName": "Mientras Leo", "userReviewDate": "Mar 09, 2017", "userURL": "http://www.goodreads.com/user/show/6348927-mientras-leo", "userReview": "Todo un descubrimiento. Un libro fantástico"}, {"userName": "Nancy Oakes", "userReviewDate": "Apr 07, 2011", "userURL": "http://www.goodreads.com/user/show/900340-nancy-oakes", "userReview": "Opening with the above epigraphs, Visitation is a rather stunning, although very short, novel of historical fiction that offers the stories of the inhabitants of a lakefront summer house in the woods of Brandenburg through the movement of time and history in Germany. The prologue opens twenty-four thousand years ago with an advancing glacier, then progresses geologically over the years until the Brandenburg lakes began to form. As the land comes to be settled, it too follows a natural progression -- it is parceled off and sold, a beautiful home is built, land is added, subtracted, reparceled, etc. The slow and natural progression of the landscape stands in stark contrast to the rapid events that play out throughout Germany and all of its accompanying turmoil as decades pass, but at the same time, what ultimately happens to this land and to the house mirrors what happens in this country during the twentieth century.  It is on one of these lakes that a wealthy farmer owns a large tract of land, and his daughters are each slated to receive their own parcels as their respective inheritances. But the farmer sells off parts of the land designated for his daughter Klara in three parts, to a coffee and tea importer, a Jewish manufacturer of fine cloth and an architect from Berlin, who is the builder of a fine house of “quality German workmanship.” The rise of the Nazis and the second world war result in changes of occupancy and ownership once again, and the home is requisitioned by the Russian Army as the soldiers come into Germany to liberate the country. As the powers that be begin to contemplate and to build the Berlin wall, the land and the home begin another round of inhabitants under the collectivization policies of the government of the GDR (East Germany). The fall of the wall and its aftermath also bring about their own changes. Through the entire story, the house and the land undergo a series of transformations, and the only thing that remains constant is the character of \"The Gardener,\" a somewhat mysterious and symbolic figure whose story of the work he does on the land is related after each chapter. The author offers brief but very powerful glimpses into the stories of the residents as they move in and lay down a foundation of memories and histories. Happy times spent there also serve as a safe haven and an anchor for some characters in times far removed from their carefree days on the lake. Through it all people live out their private lives in the house and on its grounds, often in contrast to the very public upheavals that have occurred in a century of Germany's history. This novel is highly reminiscent of Simon Mawer's excellent novel The Glass Room, where the author brought the events of twentieth-century European history to a particular house. But Visitation is vastly different -- where Mawer's book set forth the events of history chronologically in a traditional narrative style, Visitation isn't what most readers would consider a \"conventional\" novel. It's based more on differing personal perspectives rather than a straightforward chronicle of events. Within each chapter, people and events often float back and forth in time with no warning, and it can be a little disconcerting until you feel like you have more of a bigger picture. Erpenbeck writes her chapters in long paragraphs, so that a single event and connected thoughts are covered, generally relating back to the opening of the chapter so that events can shift or things can get a bit tangential before the chapter circles back and is over. There are times when the prose seems to transform from narrative to melody, as the author often repeats certain lines like refrains from a poem or song. And just as the style becomes comfortable, the author gives the reader a jolt. There are a couple of times where this happens -- first in a heartbreaking chapter from the perspective of a little girl in the Warsaw Ghetto (the only chapter that takes place away from the house), and second in a most disturbing chapter from the point of view of a Russian army officer. There are a few parts of the book that may seem tedious -- pieces of folklore, official documents, minor details about the house and grounds etc., but these things genuinely fit into and enhance the story and should not be glossed over. The characters have their own personas and voices, each with his or her own story, thoughts and feelings, all most excellently captured by the translator, and you cannot help but get caught up in these lives. It's a beautiful book, and all of the things that make it less than conventional -- plus Erpenbeck's focus on the landscape (if even briefly) \"coming to resemble itself once more\" despite all of the tumult in our private lives and the world in which we live -- are what appealed to me as a reader. It's a challenging book, but if your focus is on the bigger picture rather than a chapter here and there, it's ultimately a rewarding reading experience."}, {"userName": "Friederike Knabe", "userReviewDate": "Nov 27, 2010", "userURL": "http://www.goodreads.com/user/show/1746401-friederike-knabe", "userReview": "\"Colourful is only that what she can still remember, surrounded by darkness of which she is at the core, her head [...] carries colourful memories, memories of somebody, who she was. Probably was. Who was she? Whose head was her head? Who owns the memories?\" The \"Girl \", who ponders these questions, is one of the protagonists in Jenny Erpenbeck's innovative and powerful novel \"Visitation\". Memories of innocent excitement and happiness of youth, of arriving, settling down, and then having to leave again and of families and people loved and lost form the core of the story. People and events are centred around a lake-side summer house surrounded by expansive woods and gardens in the region just east of Germany's capital, Berlin, affording it the role as the central character and integrating force of the narrative. Using her zooming lens, the author condenses many decades of twentieth century German history into time-specific, intricate and intimate glimpses into the lives of twelve different residents and their families living on the property. While the owners build and add to the house, change it and its grounds over time, leaving visible marks and impressions, they are in turn impacted by the environment and the historical events occurring beyond it. Starting out more like a fairy-tale, the novel gains intensity as it progresses: the portraits become more intense, reaching deeper into the background of the individuals, also relating their actions to specific historical time periods of the last decades: from the Weimar Republic, through the Nazi regime and the Holocaust, War and Soviet occupation, to Socialist East Germany and Fall of the Berlin Wall and beyond. The Girl's haunting account far away, having had to flee her home and Germany, stands out as one of the most heart-wrenching chapters. In others, the reader senses underlying tense emotions, despite the deceptively detached, often sparse language, that refers to most protagonists only as the Architect, the Writer, the Visitor, etc. or the Gardener. However, despite the apparent indistinctness, the individuals portrayed are engagingly realistic and anything but bland generalizations. Events beyond the calm of the summer house are alluded to, hints that may be easier to detect for the German reader. The narrator's language and style changes slightly as the story moves from one voice to the next. Erpenbeck often uses rhythmic prose, sometimes staccato sentences, repetitions, or lyrical prose to reflect her protagonists' moods and characteristics. While the different individuals pass through the house as transient residents - some return later, allowing for intergenerational connections - only the \"Gardener\", more a symbol than a person, remains as a constant, his chapters alternating with the others. The original title \"Heimsuchung\" has several meanings in German, one of which is \"Visitation\". This has an ominous or threatening undertone and often refers to ghosts or disease. An additional meaning contained in the term is \"searching for home\". Both connotations are beautifully captured in stories. For example. the Authoress looks back on a long life, that included fleeing the home of her youth all the way to Moscow and the Urals, and, even while \"going home\" now to the house and the lake, she is still searching for the \"home\" that she can emotionally return to. On the other hand, the overconfident Architect, a former Albert Speer collaborator, is on the run, the ghosts of the past having caught up with him: he is locking up, hiding the valuables, leaving the key for the next occupant of the house... Award-winning Jenny Erpenbeck is a representative of the younger generation of German authors (born in 1967). Many like her were born and raised in then East Germany. Their background enables them to take a different perspective on the past. Inspired by and based on her family's summer house, the author sensitively mixes her own memories and those of people she knew with the wide-ranging fictional reality of her novel. While more recent novels like Simon Mawer's The Glass Room come to mind, in that comparable techniques were used to build the novels, Erpenbeck's voice is fresh and independent and very convincing. \"Visitation\", published in German in 2008 and now available in the highly praised translation by Susan Bernofksy, was recently chosen by author Nicole Krauss (Great House) as one her favourite books of the year. Having read the novel in its original, all translations are mine."}], "description": "A house on the forested bank of a Brandenburg lake outside Berlin (once belonging to Erpenbeck’s grandparents) is the focus of this compact, beautiful novel. Encompassing over one hundred years of German history, from the nineteenth century to the Weimar Republic, from World War II to the Socialist German Democratic Republic, and finally reunification and its aftermath, Visitation offers the life stories of twelve individuals who seek to make their home in this one magical little house. The novel breaks into the everyday life of the house and shimmers through it, while relating the passions and fates of its inhabitants. Elegant and poetic, Visitation forms a literary mosaic of the last century, tearing open wounds and offering moments of reconciliation, with its drama and its exquisite evocation of a landscape no political upheaval can truly change.", "title": "Visitation", "url": "https://www.goodreads.com/book/show/8638226-visitation", "average": 3.78, "cover": "https://images.gr-assets.com/books/1348829216l/8638226.jpg", "reviews": 266, "authors": [{"url": "https://www.goodreads.com/author/show/11572.Jenny_Erpenbeck", "name": "Jenny Erpenbeck"}, {"url": "https://www.goodreads.com/author/show/162943.Susan_Bernofsky", "name": "Susan Bernofsky"}], "type": ["Fiction", "Historical", "Cultural", "European Literature", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/8638226-visitation", "http://www.goodreads.com/book/show/9742729-visitation", "http://www.goodreads.com/book/show/3038002-heimsuchung", "http://www.goodreads.com/book/show/7822630-visitation", "http://www.goodreads.com/book/show/11221767-visitation", "http://www.goodreads.com/book/show/13377621-una-casa-en-brandenburgo", "http://www.goodreads.com/book/show/7877640-heimsuchung", "http://www.goodreads.com/book/show/20724710-the-end-of-days", "http://www.goodreads.com/book/show/26195415-gehen-ging-gegangen", "http://www.goodreads.com/book/show/1086770.The_Book_of_Words", "http://www.goodreads.com/book/show/557074.The_Old_Child_and_Other_Stories", "http://www.goodreads.com/book/show/2763298-the-old-child-and-the-book-of-words", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}