{"ratings": 1118, "userreviews": [{"userName": "David", "userReviewDate": "May 31, 2013", "userURL": "http://www.goodreads.com/user/show/3335664-david", "userReview": "This is a most unusual novel, especially for Western readers. It's strange and thoughtful and dark, full of psychological twists and turns, metaphysical tangents, and the desperately humorous shenanigans of young adults carrying on at a grim Russian boarding school that is turning them all into... what, they do not exactly know.I described Marina and Sergey Dyachenko's novel The Scar as \"swords & sorcery if written by Fyodor Dostoevsky.\" I don't think I'm stretching the Russian-lit analogy too much to call this book \"Harry Potter if written by Leo Tolstoy.\"I liked The Scar so much that I sought out other works by the Dyachenkos translated into English. Sadly, there are was only one: Vita Nostra, the first book in their \"Metamorphosis cycle.\" And it's only available on Amazon as an ebook. According to the afterword, it was translated by a Russian-born fan living in the U.S., which explains why the translation didn't read with the same professional smoothness as the Tor-published The Scar.The Scar, with its themes of morality and consequences, punishment and redemption, reminded me of Dostoevsky. Vita Nostra is an even darker story, with occasional flashes of humor surfacing in the dark waters of a story that seems to be dragging you along toward some unknown, unknowable fate, with characters who have few choices, who know they exist only to act out their predefined roles. They resist this predestination, even knowing that resistance is futile. This valiant effort to find hope in the face of crushing inevitability reminded me more of that grim old sourpuss Graf Tolstoy.Alexandra \"Sasha\" Samokhina is a 17-year-old straight-A student, preparing to apply to university. She's been a good girl, a dutiful daughter to her single mother. Then one day a stranger appears while she and her mother are on vacation at the beach, and makes an unusual demand of her. He demands she swim naked out to a bouy every morning at exactly 4 a.m.Following some instinct, Sasha complies... and each morning after her swim, she vomits up gold coins. She soon learns that the world is indeed fragile, and that refusing Farit Kozhennikov's demands has a heavy price.Farit's unusual \"tasks\" continue when Sasha and her mother go home. Sasha finds herself alienated from her friends, and distanced from her mother, who does not understand what strange pressures her daughter is under. It only gets worse when Sasha informs her mother that instead of the university they both planned on, she has to attend the Institute of Special Technologies, a technical school no one has ever heard of in a small town that's practically off the map.Aren't you tired of books being called \"Harry Potter for adults\"? But I'm sorry, it's such an easy comparison to make, and Vita Nostra may deserve that label, albeit it's set in an adult unworldly boarding school in a very Russian vein. Sasha has to ride a train to the middle of nowhere to arrive at Torpa, where the Institute of Special Technologies is located, but the Institute is no Hogwarts. The teachers are sometimes warm and friendly, sometimes cold and demanding, but they all force students to study things they don't even understand, pursuing a degree they can't comprehend, to do things after graduation that they can't even imagine.The oppressive lack of information and the constant undercurrent of foreboding, the threat of sinister consequences for failure, makes the reader as frustrated as Sasha for much of the book. What is the Institute for Special Technologies? Are they teaching magic? Are students learning to alter the fabric of reality? Are they being transformed into something inhuman? It's not really explained at all until near the end, and even then it's very abstract and metaphysical. Sasha undergoes transformations, exhibits frightening powers, and moves from a frightened, confused First Year to a confused, increasingly alienated Third Year, one with a talent that exceeds that of all her classmates, though her own teachers won't even tell her what her talent is and why she's so special.All of this takes place in a fictional Russian town with a heavy flavor of magical realism. There is a \"Sacco and Vanzetti\" Avenue. The townspeople seem to tolerate without really accepting or understanding the Institute's students. Sasha initially shares a dorm room with other students, and as she's struggling with her bizarre, incomprehensible subjects, she's engaged in petty roommate conflicts, college students getting illicitly drunk, and eventually relationship drama. The townspeople seem vaguely aware that Institute students are not \"normal,\" but dismiss them as strange, not entirely welcome visitors to their town.In a very real sense — more real than most so-called \"Young Adult\" novels — Vita Nostra is a novel for young adults. It's about becoming an adult, and discovering truly hard tasks where failure actually has consequences, and doing so amidst the swirling temptations of song, dance, parties, alcohol and sex. It's about the confusion of not knowing what you're going to be when you grow up, of seeing yourself as a free-willed individual with choices lying ahead of you and then discovering that you are at the mercy of forces you cannot control or negotiate with. It's about trying not to lose the parent-child bond even when you are forced to let go.“You’ve just seen me?” Portnov sounded surprised. “You manifest entities, read highly complex informational structures, and you’ve only just seen me?”Sasha managed a shallow nod, and then shut her eyes, trying to drive the tears back into her eyes.“What’s the matter?” now Portnov sounded worried. “Sasha?”“You are not human,” Sasha whispered.“So? Neither are you.”“But I had been human. I had been a child. I remember that. I remember being loved.”“Does it matter to you?”“I remember it.”This is not a \"traditional\" fantasy novel. It defies Western genre labels. It's as much horror as fantasy, as much contemporary realism as it is magical realism. It's rather hard to describe and it was sometimes frustrating to read and there are depths that I sensed lurking beneath this translation that might be more evident to its Russian audience. If you like dark fantasy, I think you will like it. If you like Russian literature (and don't mind a fantastic element), you will definitely like it. But it's a very strange book, and it doesn't follow a standard Western fantasy arc. Things are described in vague, esoteric terms and the relevance and meaning is never always made clear to the reader, which forces you to swim in the same existential confusion afflicted upon the characters.Please, folks, go buy this ebook. It's only $2.99. Yeah, I know, it's Amazon. Someone should tell them how to sell ebooks on other sites. But I want you to read it and I want more people to buy it because I want more of the Dyachenkos' work to be translated into English. You may not love this (my final rating is 4.5 stars for a somewhat raw translation and many moments of befuddlement) but if you want something different from the same-old, same-old fantasy novel, these are some authors who deserve a wider audience."}, {"userName": "Tatyana Naumova", "userReviewDate": "May 10, 2013", "userURL": "http://www.goodreads.com/user/show/5276112-tatyana-naumova", "userReview": "Я бы хотела сказать, что я закончила эту книгу, но я ее совсем не закончила. Но формально дочитала, да.Я бы хотела снять на нее обзор, но я начинаю плакать после первых слов - и уже 4 дубля могу только реветь.В общем, главная загадка книги решилась для меня довольно быстро, но касательно деталей я и не думала. В общем, мне вспоминается 4 курс, зимняя, кажется, сессия, когда я на консультации по синтаксису спросила:\"Ну а тут почему нельзя образовать глагол повелительного наклонения? Отлично же образуется\". А преподаватель мне строго сказала:\"Ну нельзя же от чувств образовывать повелительное наклонение\". И до сих пор сложно это понять и принять: ведь если ты можешь - значит, это можно сделать. Мне кажется, что тут речь о том, сколько тебе на самом деле подвластно - и одновременно отнюдь не в твоей власти. Я, честно говоря, не знаю, как читать эту книгу и не плакать, тут столько всего живого, больного и важного - и, в общем, все как всегда ко времени. Очень хорошо и то, что у Дяченко нет всех этих классических принцесс, очень все, знаете ли, современно звучит: чтобы быть собой, придется от чего-то отказаться, что-то поставить на карту и. Не знаю, слово \"потерять\" - оно такое жалкое, ты никогда ничего не теряешь, ты впитываешь, преобразовываешь, оно остается с тобой навсегда, ну просто не так линейно, как можно было бы предположить. И вот это все - и отказ (и когда Стерх говорит, что Саше не хотелось, но ей было нужно - это вот тоже туда, в самое солнечное сплетение), и разрушение, и принятие, и движение по своей дороге - и при этом всем очень важно и нужно понять, что. Что же нужно понять? Что развитие только вне зоны комфорта? Что ты всегда будешь расти там, где тебе страшно и больно? Что ты всегда будешь бояться и преодолевать? Что твоя воля - это единственное, что у тебя есть как инструмент развития? Ты боец и этим хорош и ценен? Честно говоря, я не знаю. Я знаю только, что иногда самое сложное начинается там, где ты отказываешься быть волей и просто даешь себе шанс не бояться. И просто звучишь. Это так много."}, {"userName": "Nenia ✨ Queen of Literary Trash, Protector of Out-of-Print Gems, Khaleesi of Bodice Rippers, Mother of Smut, the Unrepentant, Breaker of Convention ✨ Campbell", "userReviewDate": "May 19, 2018", "userURL": "http://www.goodreads.com/user/show/2190064-nenia-queen-of-literary-trash-protector-of-out-of-print-gems-khalees", "userReview": "THIS BOOK SOUNDS LIKE IT IS GOING TO BE MY EVERYTHING#NEED #NEED #NEED #NEED #NEED #NEED #NEED"}, {"userName": "Kilian Metcalf", "userReviewDate": "Nov 24, 2012", "userURL": "http://www.goodreads.com/user/show/3080991-kilian-metcalf", "userReview": "Just finished a reread of this book, and it was just as good the second time around. Maybe better because I was aware of small details I had overlooked in my rush of a first reading to find out what was going to happen next. Love you, Sasha, you rock."}, {"userName": "Lukasz", "userReviewDate": "Apr 09, 2018", "userURL": "http://www.goodreads.com/user/show/19694853-lukasz", "userReview": "In the beginning was the Word\nScience, or more specifically - the school of magic - is a trope that's used a lot in fantasy literature. Not surprising. If done well it’s a joy to read. Have Diachenko’s succeeded?Short answer - yes.Vita Nostra twists the trope in most unexpected ways. It’s strange, thoughtful and dark tale about metamorphosis (both physical and metaphysical) that contains coming of age elements.Sasha is a regular, high-school student who spends her holidays at the seaside. She enjoys the sun, fresh morning breeze, chill and happy atmosphere. Things change when a strange man with dark glasses approaches her and asks her to get up at 4 AM, go to the beach and swim naked to the buoy and back. Every single day.In the beginning, Sasha wants to ignore the lunatic, but it turns out that she just can’t. For many reasons. When she finally agrees and does her first 4 AM swim a bizarre thing happens – she vomits golden coins. She does it every day after her morning training. Things develop a bit from here, and soon she finds herself forced to enter the Institute of Special Technologies in Torpa. It’s an Institute in the middle of nowhere. Students aren’t told what’s the purpose of their studies. However, a failure in school isn’t an option. When it happens, a students’ loved ones pay the price.The students' fate remains unknown to them, but it seems they’ll change in significant and unexpected ways. For example, some of them will grow wings. Temporarily. And if you think it’s bizarre, you know nothing about bizarre. Happily, Dyachenko’s will educate you in a mind-blowing way.Students at the University are regular (at least in the beginning) teenagers anxious about growing up. They drink, smoke and have sex. They were selected for this school for reasons they don’t understand, forced to come to Torpa and pursue impossible and incomprehensible classes that will allow them to gain a degree they know nothing about.As a reader, you’re not in a better situation than students. Lack of information or at least some hints about studies' goal may be frustrating. We learn fast that students play with the fabric of the reality but how is a question I asked myself multiple times. Is it magic? What are they becoming? On the other hand, it's also one of the reasons why this novel is so fascinating and immersive. It's told in a way that allowed me to enter the world smoothly and imagine and experience impossible things. Occasional flashes of humor surface from time to time, but it’s not a joyful tale. Characters have few choices, and their existence serves a higher purpose known only be their mysterious and severe teachers. The storytelling is influenced by modernism, and magical realism works. The story happens in the modern era - telephones and cell phones exist in this place but aren't as readily available as in real life. Torpa is in the middle of nowhere, and its inhabitants are just sketched. They don't play any significant role in the story.Dyachenko's focus on their characters' psychology and inner metamorphosis. They touch philosophical and metaphysical questions with finesse and skill that made me reread the ending five times.\nWhy is being human so vital to you? Isn't it because you don't know anything else?\nThis book crafts wholly new vision of the world and the laws that govern it. As the story progresses, Dyachenko's share some insights into the world metaphysics and if you've ever been fascinated with the language and power of the words, you'll be satisfied with some of the discoveries.I could go on, but I won't. Instead, I'll tell you this - it's one of the best books I've ever read. It combines fascinating adventure with philosophical depth, impossible metamorphosis with profound psychological insights. It's strange. It's amazing. It's brilliant.Side note: I read Polish translation of the book. It seems there used to be an English version, but it's no longer available. Good news is that Tor will release a professional translation of Vita Nostra in November 2018."}, {"userName": "Cheshirka", "userReviewDate": "Oct 23, 2013", "userURL": "http://www.goodreads.com/user/show/21356947-cheshirka", "userReview": "Фух, что я могу сказать? Это великолепно, это крышеносно, это... Это как Дом, в котором для меня-с каждым разом нахожу что-то новое.По единогласному мнению колдующего народа, читать это надо в обязательном порядке, если ты маг. Писали это точно не люди в прямом смысле этого слова: такие внутренние превращения, такие напряженные мысли, чувства, Речь, мир как текст. Мне говорят, что \"Мир как текст\"-идея не новая, но я каждый раз забываю, кто еще об этом писал. Да это и неважно, потому что то, что писали Дяченко-это просто руководство к действию, это медленно кружит, кружит, а потом кааак шваркнет о землю-и не успеешь раскрыть крылья и вовремя взлететь. Сидишь, дышишь, надышаться не можешь.Дяченко умудрились вложить в книгу идею, разворачивающуюся во времени, не просто мысли и переживания, а текущий во времени процесс. Процесс(!). На каком-то моменте мне показалось, что ничего они не вкладывали, что просто хочется искать скрытый смысл там, где его нет, где просто слова и ничего больше. Это на меня так повлиял \"Цифровой\"-совершенно ужасный в плане проживаемого процесса, и великолепный просто как роман.Vita Nostra-это такой выстрел в голову, отражение Курта Кобейна и \"Игры в бисер\". Гарри Поттер по-украински, где от самой идеи Поттера осталась только школа для обучения магии и полеты.Вы еще не читали Vita Nostra? Я вам жутко завидую. Давайте, берите томик, открывайте его, задержите дыхание... И не забывайте дышать."}, {"userName": "Spigana", "userReviewDate": "Jul 27, 2014", "userURL": "http://www.goodreads.com/user/show/6732133-spigana", "userReview": "Pēc grāmatas pabeigšanas ir vēlme vienlaikus gan klusēt, gan nebeidzamā straumē izspļaut visus neatbildētos jautājumus un spēcīgās emocijas. Neparasta grāmata un ļoti atšķirīga no visa, ko lasām rietumu kultūrā. Melna, iespaidīga un lieliska grāmata, kas ievelk sevī un pilnībā nostāda galvenās varones vietā. Izcili uzbūvēta un pārliecinoša maģija, kura ir tikpat brīnišķīga cik bīstama. Te nav nekā vienkārša vai pašsaprotama un autori ir paveikuši to, kas grāmatā nebija iespējams- cilvēku valodā izstāstījuši pasaules uzbūvi. Mana krievu valoda gan neļāva uztvert visas nianses un grūti spriest par valodas skaistumu šinī grāmatā, bet grāmata mani neprātīgi aizrāva un no tās nebija iespējams pārslēgties uz ko citu. Iesaku visiem, kuri izbauda melnas fantāzijas grāmatas un nebaidās no šizofrēnijas piedevas literatūrā."}, {"userName": "j", "userReviewDate": "May 08, 2018", "userURL": "http://www.goodreads.com/user/show/2863914-j", "userReview": "A novel that will make your head hurt if you think too much about what it seems to be about. Better to concentrate on what it is actually about, which is that liminal period in your early 20s when you begin to transition into an adult, and realize how utterly terrifying and final that transformation is."}, {"userName": "Aliette", "userReviewDate": "Jul 28, 2014", "userURL": "http://www.goodreads.com/user/show/2454968-aliette", "userReview": "(cross posted from my blog review) Sasha is a normal, straight-A high-school student; until, on a holiday with her mother, a strange man with dark glasses approaches her, and asks her to get up at 4am every morning and swim to a buoy on the beach. She tries to ignore him, but when she does so, time stops passing: the same day loops over and over, trapping her in a morass of impending dread. When she finally takes the man’s advice and swims, she finds herself vomitting gold coins on the beach–and, before she knows it, onboard a train to a university in the middle of nowhere, where she will learn Specialty. The nature of Specialty is unclear, the textbook abstruse; but the penalty for failure is all too clear, ranging from the death of the students’ families to the impairment and death of the students themselves. Specialty is a book filled with incomprehensible sentences; but as the students read it, they find themselves changing in mind and body–and Sasha, who is ahead of her peers, is destined for something both huge and frightening…The parallels between this and Harry Potter are hard to ignore (magical school, specially picked students), but you should probably put them out of your mind. Vita Nostra is a different, darker book: the students are university-age, with more adult preoccupations; and the magic, far from cookie-cutter spells, is impredictable, incomprehensible, and wildly dangerous; and Sasha’s position as a special student is far from enviable. There’s a palpable, oppressive sense of doom and dread throughout the entire novel, building to a very satisfying climax (which nevertheless leaves a lot of questions dangling in the air: this isn’t a book which will do a point-by-point explanation of its worldbuilding, but it’s a book that works as it is). I read this cover to cover in an evening (which should tell you something, as any free time those days is generally against my better judgment): the book draws you in, and, especially in the last quarter or so, an accelerating build-up towards the placement exam that is meant to seal the students’ fate, is darn hard to put down. Recommended.This is my first book from the Dyachenkos, a Ukrainian husband-and-wife team, but it certainly won’t be my last: Tor published their epic fantasy The Scar, and I have every intention of trying it…"}, {"userName": "Юля Білоус", "userReviewDate": "Oct 19, 2016", "userURL": "http://www.goodreads.com/user/show/18509377", "userReview": "10 балів за оригінальність))) про дивних дітей, дітей з особливими талантами, з паранормальними можливостями чи з просто дивною зовнішністю книжок є досить, та й я останнім часом присіла на фентезі саме з темою \"надлюдей\". Сюжети в таких книжках, як правило - стандартні: є діти не такі як всі, і ці діти про це не завжди знають, а потім зявляється хтось і розказує їм про це, і, як правило, забирає до спеціальної школи чи куди там, де цих спеціальних дітей вчать і допомагають розкрити свої таланти, а потім ці діти стають героями, боряться зі злом і рятують світ... Дяченки скористалися звичайним сюжетом, але так його вивернули, що читаючи книжку, сторінками аж дух захоплювало і прочитане потім снилося, та-та))) Бо всі ті незвичайні діти, як правило діти-янголи чи діти-демони, діти чарівники, діти напівбоги, бо вони діти якихось там богів, діти з паранормальними можливостями чи такими ж тілами, але дітей,........ОБЕРЕЖНО: невеличкий спойлер про те, ким же насправді є герої Віта Ностри!так от, дітей, незвична сутність яких проявляється в тому, що вони Слова - я ще не зустрічала! А Дяченки головних героїв зробили Словами - займенниками, дієсловами, прикметниками... і щоб зрозуміти і прийняти свою сутність Слова, дитина змушена пройти нелегке навчання, скласти надважкі іспити і вибору в неї просто нема, бо інакше... інакше станеться щось жахливе.Дяченки на стільки закрутили з процесом перетворення дитини в Слово, з отим навчанням, з можливостями цих дітей, що відірватися від книжки неможливо; о, і там такі шикарні пояснення викладачів про Слова, про Мову, про Страх, про Необхідність, про Любов, про Вибір... ніби сама вчилася разом з головною героїнею))) і ще - це книжка, де жодним чином не хочеться бути як головна героїня, і уявити себе на її \"місці\" трохи важкувато, та й лячно, якщо чесно:)коротше - наполегливо раджу почитати:)))"}, {"userName": "pax", "userReviewDate": "Jul 26, 2017", "userURL": "http://www.goodreads.com/user/show/3524962-pax", "userReview": "I'm so looking forward to the official English translation (please, please, please be a good translation) and to being able to recommend it to everyone. A proof that a book can be different - I will not even talk what the book is about, but just say that here is a fantasy book (or perhaps a speculative fiction book; or a postmodern book) that kept me reading non-stop for four days. A book that does not have an antagonist. A book that is not about saving the world or even just a country. A book that is not your classical hero's journey.Fantasy can be this. Speculative fiction can be this. And it is amazing."}, {"userName": "Leonid", "userReviewDate": "Jun 20, 2013", "userURL": "http://www.goodreads.com/user/show/9165851-leonid", "userReview": "Я полностью перекроен и уничтожен.Книжка рушит сознание, захватывает, увлекает в свою реальность и не отпускает до конца.До сих пор хожу по квартире как герои романа: тыкаясь во все стены.))Очень интересно написано про мотивацию, про любовь и страх, про переступление через себя и перекраивание личности во всех аспектах. Потрясающее описание мира как закольцованное множество смыслов и слов.По-моему, в книге так же есть интересный подтекст (вспомните название), говорящий о том, что перестройка личности никогда не должна останавливаться - это закономерный процесс; поглощать реальность, пытаться понять чужеродную сущность - вот, что нам нужно делать.Просто... не бойтесь!"}, {"userName": "Ashlee » Library In The Country", "userReviewDate": "May 19, 2018", "userURL": "http://www.goodreads.com/user/show/7990992-ashlee-library-in-the-country", "userReview": "The English translation of this book is coming and the cover is so delightfully beautiful and the summary so dark. I can’t wait!"}, {"userName": "Marina", "userReviewDate": "Jun 26, 2012", "userURL": "http://www.goodreads.com/user/show/10494674-marina", "userReview": "Одна из самых удивительных книг, которые я читала!Про авторов следует упомянуть то, что Марина, до писательства, была актрисой, а Сергей - психологом. Представляете, что они пишут!)))\"Vita Nostra\" является первой книгой в цикле \"Метаморфозы\". Молодая девушка по имени Саша приезжает на море, где странный человек в черных очках заставляет делать ее определенные, бессмысленные на первый взгляд вещи, - бег трусцой по парку в пять утра, после чего нужно обязательно помочиться в кустах или купаться голой на восходе солнца. После этого, емм, ее тошнит и она срыгивает несколько золотых монет. После полугода \"занятий\" все те монеты, что она срыгнула, по словам мужчины, достаточно для поступления в своего рода институт. Там студенты делают такие же бессмысленные вещи - читают книги с набором букв, учат их наизусть, делают странные упражнения. Студенты боятся - если они не будут прилежны или провалят какой-либо курс - что-то плохое случится с ними или их родственниками. Студенты не понимают, почему и для чего они изучают все это, а самое главное, кем они станут после выпуска.Тонкая психология книги (спасибо Сергею) пронизывает всю книгу. Например, мотивация, что используют для студентов:- Страх является наиболее эффективным мотивом, не так ли? Или Вы не согласны со мной, Саша?- Нет! Почему вы не можете просто объяснить, что мы делаем? Почему?- Когда пятилетний ребенок вырисовывает кружочки, он понимает, что такое мелкая моторика руки? Вы все такие же - вы просто не сможете понять. Единственное, что осталось - это мотивировать вас учиться!- Но есть много других мотивов ...- Да. Но страх является наиболее эффективным.Также одним из самых любимых сюжетных линий семьи Дяченко является эволюция главного героя. В начале романа Саша говорит одному из студентов: \"Нам нужно хорошо учится, чтобы стать таким же, как и преподаватели. Только тогда мы сможем отомстить им за все, что они сделали.\" В конце же книги Саша говорит тому же студенту: \"Знаешь... В конце учебы мы не захотим им мстить, потому что мы станем такими же, как они».В конце я хочу заметить, что я рекомендовала эту книгу самым разным людям, вкусы которых отличались - и все остались в восторге!"}, {"userName": "Sadie Forsythe", "userReviewDate": "Feb 01, 2013", "userURL": "http://www.goodreads.com/user/show/5634574-sadie-forsythe", "userReview": "Oh, this was a wonderful read—slow and meticulous, with a tendency to make my brain quiver, but wonderful all the same. There is just so much atmosphere to it. It's easy to follow why Sasha does what she does, even though it should defy all logic. She's also a really relatable character, even in such an alien environment. There were some interesting side characters, who all played important roles and the story kept me on the edge of my seat. I would have liked to know a bit more about the other students' experiences, to see how they differed from Sasha's. But I understand that it would have been difficult to do, since the POV was fairly consistently focused on Sasha and it would have felt awkward to suddenly shift. Now, this isn't a book where the answers are easily given to you. You have to do a little mental work to figure things out. As an example, after finishing the book I went straight to bed. (I'd stayed up to read it.) I crawled under the blankets thinking, 'but I don't really know exactly what happened. I understand the broad strokes of it, but was it a happy ending?' I was a little distressed by this. But as I put it out of my conscious mind and attempted sleep, the subtler details rose to the surface and I realised, yes, I do know exactly what happened. But it took the mental sifting for me to grasp it. I love books that do that!At times the narrative got a little clunky or staccato, but I think this was the result of the translation. (Not to suggest the narrator did anything but a great job. I think sometimes there just might not be a concise way to express in English the original Russian thought.) For the most part however, it read smoothly and was surprisingly well edited. I strongly suggest picking this one up. It's a great read. I know I'll be on the lookout for more of Maryna & Serhiy Dyachenko's works. It's just a shame so few of them have been translated. If anyone has a petition going around begging for more, please send it my way so I can sign."}, {"userName": "Sana", "userReviewDate": "Apr 30, 2018", "userURL": "http://www.goodreads.com/user/show/5862550-sana", "userReview": "THIS SOUNDS AMAZING"}, {"userName": "Anna", "userReviewDate": "Jan 29, 2015", "userURL": "http://www.goodreads.com/user/show/12330458-anna", "userReview": "I surprised myself by finishing it, and doing it so quickly. I am of the generation that grew up in Poland under communist rule and had Russian at school. Unlike many other kids, I loved Russian language, I thought it was so like music, and enjoyed the learning. But many years passed and apart from odd Russian website or a song I never had much contact with it since. The reviews of this book intrigued me. Just my kind of a book, I thought. I've tried very hard to get my hands on the English translation, but it is not available here in Australia. Believe me, I've tried very hard. So, in desperation, I bought a Russian ebook (from kniga.com) and started plodding through. The first chapters were very hard. Reading Cyrillic, using hefty dictionary (the order of Russian alphabed is different from Polish or English) - for those who read the book - I felt like Sashka working with her first assignments...And then I found the rhythm, reading became easier, and a week later I am done.I loved it. I would find it very hard to describe what this book is. It is easier to say what it isn't. There are fantastic elements, and yet it is not a fantasy. There are some quite scary moments and themes, and yet it is not a horror. The story evolves about a group of young people, and yet it is not YA book. It is mystical, eerie, quite philosophical, and yet it is not trying to preach. I read plenty of Western speculative fiction, and while there are some great books in that bag, this is so refreshingly different. I am so glad I can read Russian again, the whole new world of books opens for me. I know that some Polish books (Stanislaw Lem!) are devilishly hard to translate, and I wonder if this may be the case with some Russian authors. If so I am ready :-)"}, {"userName": "Katerina", "userReviewDate": "Jun 22, 2014", "userURL": "http://www.goodreads.com/user/show/16054419-katerina", "userReview": "Таня! Это очень хорошая книжка, а три звезды я поставила потому, что читать ее жутко и страшно.Написанная удивительно хорошим русским языком повесть о девочке Сашке, которую против воли заставляют вставать в четыре утра и учиться-учиться-учиться, с одной стороны, затягивает, с другой - ей сопротивляешься, как Сашка противится тишине, как не хочешь впускать в себя инородное, страшное, чужое. Вместе с таинственным доброжелателем (кто это, кстати, был?) хочется крикнуть Сашке, Косте, Егору - уезжай, пока не поздно! Однако с ужасом мы понимаем, что, конечно, уже поздно. С тотальным разрушением приходит новое самосознание, взрослеть и меняться - больно и очень опасно, крылья приходится прятать, и мыть их неудобно, но зато можно летать, бороться с чудовищами, вмещать в себя весь мир, главное - не бояться. Пусть это и очень сложно."}, {"userName": "Fellini", "userReviewDate": "Jul 15, 2013", "userURL": "http://www.goodreads.com/user/show/6114479-fellini", "userReview": "Закачала на планшет чуть ли не первое, что попалось под руку: просто потестить читалку. Открыла - и не смогла остановиться. Прочла почти на одном дыхании, в перерывах между преодолением бродов и грязей, пока прорубали тропы, пока ехали по лесным дорогам и пробкам.Потрясающая вещь.Вроде классическая история про \"школу волшебников\", но много сильнее и сложнее всех, ранее мной читанных. Преодоление невозможного, саморазрушение для созидания нового мира в себе, на совсем другом уровне. Сложное обучение тому, что нельзя объяснить, что невозможно понять на привычном смысловом уровне.То самое волшебство, которое начинается за гранью зоны комфорта./тут могли быть цитаты, подтверждающие мои несвязные ассоциации, но мне не хотелось отвлекаться от текста, чтобы найти как это сделать/"}, {"userName": "Aleksandra", "userReviewDate": "Dec 22, 2009", "userURL": "http://www.goodreads.com/user/show/2953982-aleksandra", "userReview": "Amazing book. So interesting, great characters. Somehow this book change me and my views. I like the way how the authors show us the change and feelings of main character. What can I say more? I'm still shocked after reading \"Vita Nostra\" :)"}, {"userName": "Valeria Storozenko", "userReviewDate": "Jun 08, 2017", "userURL": "http://www.goodreads.com/user/show/13503631-valeria-storozenko", "userReview": "Слушала аудиокнигу в озвучке Игоря Князева. Это даже не аудиокнига, а целый спектакль, с музыкой, персонажей можно безошибочно узнавать по интонациям. Игорь великолепен! Книга захватывает с первых строк, очень здорово описаны все переживания и мысли главной героини, ей легко эмпатировать и представлять себя на ее месте. Под конец меня немного утомили происходящие события, концовка была очевидна, поэтому 4/5. Но общий смысл и идея - 10/10!"}, {"userName": "Ints", "userReviewDate": "Dec 24, 2014", "userURL": "http://www.goodreads.com/user/show/8501383-ints", "userReview": "Sašas Samohinas dzīve ir pārvēršas murgā. Viņai ir izteikts piedāvājums, no kura nav iespējams atteikties. Pabeigusi skolu, Saša iestājas dīvainā institūtā. Speciālo Tehnoloģiju institūtā studenti ir līdzīgi briesmoņiem, bet pasniedzēji dēmoniem. Te viņu māca, tikai nevar saprast ko un kādēļ.Šī nu nepavisam nav Harijam Poteram līdzīgā grāmatas par to, kā jaunie burvji sasniedz savu pilnbiedru un dodas pasaulē nest labo un gaišo. Grāmatas kopējo sižetu fantāzijas klasifikācijā varam ielikt pie varoņa ceļa. Te gan pārbaudījumi nenāk tik daudz no ārienes, klimstot pa svešām vietām, bet no pašas varones personības. Ar viņu kaut kādu iemeslu dēļ ir apgājušies netaisni, mācību priekšmeti ir absolūti nesaprotami. Bet nemācīties nevar, būs sliktas atzīmes, cietīs tavi radinieki, kamēr mācīsies labi, arī tiem būs labi. Paši pasniedzēji apgalvo, ka tik drastiskas metodes nepieciešamas, lai motivētu studentus. Pa labam nekas nesanāks. Tie, kas izkrīt sesijā, vienkārši pazūd. Par pašu Samohinu jāatzīmē, ka viņa ir teicamniece, un vairāk vai mazāk mācības viņai iet kā pa sviestu. Tas mani nedaudz pārsteidza, un pāris kājas paslīdēšanas man šķita acīmredzams sižeta dramatizējums, kas diez ko nepārliecināja. Skaidra lieta, ka viss noteikti beigsies labi. Bez tam ir aizdomas, ka pietiekoši ilgi turot cilvēkus bailēs, viņiem iestāsies apātija un nekāds rezultāts netiks panākts.Pašas mācību metodes un mērķis ir grāmatas lielākais pluss, ne lasītājs, nedz Saša īsti nespēj saprast, kas tas ir. Jālasa un jāiekaļ no galvas kaut kādi burtu savienojumi. Kādēļ un kāpēc nevienam no studentiem nav nekādas sapratnes. Šī grāmatas sadaļa mani nodarbināja visvairāk. Vispirms man bija grūti iedomāties, ka cilvēks var kaut ko iemācīties, nesaprotot mērķi, un nekādi draudi apslaktēt radus nespēs viņus motivēt. Tagad sekos maitekļi. Tad kad biju izokšķerējis ko vairāk, mani sāka satraukt projekcijas. Ja jau projicē, tad kas ir šis projicētājs? Hiperteksts ir skaidra lieta, tāds kā absolūts, kas kalpo visam par pamatu, dimensija, no kuras mēs redzam noteiktu skaitu dimensiju un tas viss rezultējas noteiktos objektos un jēdzienos. Taču kādēļ hipertekstam ir svarīgi, lai labākās projekcijas saprastu visu notiekošo un savā veidā atgrieztos pie pirmavota, man šķita nepamatoti. Hipertekstam projicējoties viņš no šī procesa nespēj zaudēt neko no sevis, tāpat kā mēs metot ēnu sevi nemaitājam. Bet labi, pieņemsim, ka šo lietu lasītājam neizprast ierobežotās uztveres dēļ. Nākamā problēma ir vairāku dimensiju iepakošana mūsu telplaikā, manuprāt, te nevajadzēja tik detalizēti aprakstīt. Tas, ka 3D grāmatā ir nD shēma un tu viņu redzi izmantojot acis, jo citādi nebūtu vajadzīga grāmata, rada veselu kaudzi ar problēmām fundamentālajā fizikā. Domāju, ka beigās no pilsētiņas paliktu pāri tikai liela bedre.Bet tas viss ir štrunts un mana ierobežotā prāta robežas. Maģijas (ja to vispār varam saukt par maģiju) ideja man patika. Šeit standarta burvju operēšana ar vārdiem, kas ietekmē pasaules struktūru, ir pacelta citā līmenī, te pašas pasaules struktūra ir vārdi. Lai cilvēks tam piemērotos, viņam ir jāiziet no sava Es rāmjiem un tieši šī iziešana no sava es definē galvenās varones izaugsmi. Par to, kā visu to izprast, ir šī grāmata, un tas ir jāizlasa pašam.Autoru kolektīvs nedaudz sirgst ar grafomāniju, viņi aizrautīgi rada liekvārdību un izplūst detalizētos aprakstos. Nenoliegšu, valoda viņiem ir forša, un tā kā arī pats esmu grafomāns, man patika. Taču noteiktai lasītāju kategorijai varētu kaitināt Aleksandras ikdienas soļa apraksts. Vietām gan autori saņemas un pārlec pāri dažiem mēnešiem, bet pēc laika atkal ieslīgst ikdienā.Grāmatai lieku 8 no 10 ballēm patika, nestandarta darbs, prasa diezgan lielu iedziļināšanos un pacietību. Noteikti ir jābūt gatavam tam, ka nekas tā vienkārši paskaidrots netiks, līdz visam būs jāizurbjas kopā ar Aleksandru."}, {"userName": "Rafal Jasinski", "userReviewDate": "Feb 12, 2011", "userURL": "http://www.goodreads.com/user/show/4627654-rafal-jasinski", "userReview": "Powieść o raczej umiarkowanej zawartości pierwiastka fantastycznego, tudzież nadprzyrodzonego. To, co najzwyklejsze, jest w tym przypadku największym atutem książki. W \"Vita nostra\" w sposób niemal perfekcyjny sportretowano wszystko to, co wiąże się ze studiowaniem, ujmując zarówno negatywny, jak i pozytywny aspekt tego etapu życia. Pierwsze miłości, pierwsze \"kontakty\", zakrapiane wódką zagryzaną kiszonymi ogórkami imprezy, ale też stres związany z zaliczeniem sesji, tyle że... w przypadku niezaliczenia kara jest dużo cięższa niż zniweczenie szansy na zdobycie lepszej pracy w przyszłości, czy otrzymanie \"biletu\" do wojska - to najbliżsi naszych bohaterów cierpieć będą za ich błędy.Co do wątku fantastycznego, będącego dość udaną wariacją na temat konceptu logosu - zdecydowanie należy pochwalić autorów za to, że tak długo \"trzymają karty przy orderach\". Oszczędne dawkowanie informacji na temat tego, czego tak naprawdę uczą się studenci Instytutu Technologii Specjalnych w Torpie, sprawia, że każda kolejna informacja z tym związana powoduje szybsze bicie serca. Niestety, kulminacja tych wątków nieco rozczarowuje, jednocześnie pozwalając oczekiwać od autorów kontynuacji \"przygód\" Aleksandry Samochiny. Po kolejny tom - jeśli takowy powstanie - z przyjemnością sięgnę."}, {"userName": "Roman Kurys", "userReviewDate": "Mar 05, 2017", "userURL": "http://www.goodreads.com/user/show/48577145-roman-kurys", "userReview": "Wow. This book went beyond my wildest expectations. My first read from C.M.Djachenko, I randomly picked it up while visiting family in Ukraine, because Roxi, my sister, said they were good. A year it sat on my shelf.I opened it one day...and it was over from the first 3 pages. Books is absolutely great! It is written for the eastern block audience, who will understand details and subtle difference of life. Some will think it strange and weird.I can't see this book finding much common ground. You will either get it and love it or stop reading half way through...(at least my opinion).I loved it. The concept behind the book, which you will only really understand if you finish it, fully and without skipping is absolutely awesome.I've read a lot of books, but this one surprised me.If I had to re-create the idea of the ambiance it delivers, you take Harry Potter and mix it with Kafka's dark undertones. Just go and read this to make up your own mind! :)Roman \"Ragnar\""}, {"userName": "Michele Marques", "userReviewDate": "Sep 30, 2014", "userURL": "http://www.goodreads.com/user/show/35474934-michele-marques", "userReview": "I read the English translation. This book is unusual and amazing. Sasha starts the book on summer holiday with her mother before starting her senior year at high school. Everything seems normal, until she meets Farit. He places demands on her. The early morning swims might just seem a weird order, if it weren't for the gold coins that Sasha vomits up after completing the task. Like Harry Potter, Sasha heads off to school to learn magic. Except that school is demanding to the point of cruelty. Magic requires a new way of seeing, a new way of hearing, a new way of being. On this emotional and challenging journey, Sasha will learn her true nature and become someone more than she was before.I wish the other books in this series were already available in English."}, {"userName": "Mary Regan", "userReviewDate": "Aug 20, 2016", "userURL": "http://www.goodreads.com/user/show/32616227-mary-regan", "userReview": "One of the strangest and most amazing reading experiences of my life! I only read it because Lev Grossman, author of The Magicians series (great urban fantasy--like this one), recommended it so highly, otherwise it's cheap price on Kindle would have made me look askance. Utterly compelling from the beginning and SO strange. I likened it to a \"Twilight Zone\"-type story and that's a good way to characterize it, but it's MUCH richer and deeper, than those old TV scripts. Hidden cavernous depths. It also feels very foreign in sensibility and for me, that was both unnerving and very welcome. Overall REMARKABLE!"}, {"userName": "Katie", "userReviewDate": "Jul 05, 2013", "userURL": "http://www.goodreads.com/user/show/4591311-katie", "userReview": "I am not exactly sure what the ending was about, and something makes me think this book was too intellectual for me to fully understand. I loved the suspense, the Institute, Sasha's character and the idea of metamorphosis from human to something \"other\". The \"other\" that the authors went with was not what I was expecting and I was somewhat puzzled by their choice. I was expecting Angels or some sort of spiritual conversion and maybe a resulting kind of religious statement i.e.description of God outside of the Christian framework, but that's not how it went...or was it???? I'm confused, and will probably think about this book for the rest of my life."}, {"userName": "Stacey", "userReviewDate": "Jul 27, 2017", "userURL": "http://www.goodreads.com/user/show/14236532-stacey", "userReview": "Unlike anything else I've read."}, {"userName": "Alexander Severin", "userReviewDate": "Jun 15, 2017", "userURL": "http://www.goodreads.com/user/show/54188549-alexander-severin", "userReview": "Самая лучшая книга у Дяченок. Перечитывал уже несколько раз. Одна из любимых художественных книг."}, {"userName": "Daria", "userReviewDate": "May 19, 2017", "userURL": "http://www.goodreads.com/user/show/6927935-daria", "userReview": "До конца пребывала в замешательстве. В целом, на мой взгляд, пустышка. Объяснять не надо, всё равно ничего ничего не поймёте, говорят как героям, так и читателям, у главной героини внутреннего мира вообще нет, преподаватели умеют преподавать только пощёчинами, единственный более-менее оформленный и интересный элемент мира, разумеется, Фарит. Разумеется, если уж этот_персонаж (спойлер) не оформлен, то куда дальше ехать, непонятно. Концовка даёт надежду на то, что дальше будет лучше, и, возможно, это всё искусная деконструкция читателя по образу и подобию сюжета, но ха-ха, оказывается, следующие части про других персонажей, и я не вынесу этой маскирующейся под философию тухлятины ещё два раза сначала. Плюс, сексизм этой книжки зашкаливает."}], "description": "Жизнь Саши Самохиной превращается в кошмар. Ей сделали предложение, от которого невозможно отказаться; окончив школу, Саша против своей воли поступает в странный институт Специальных Технологий, где студенты похожи на чудовищ, а преподаватели – на падших ангелов. Здесь её учат… Чему? И что случится с ней по окончании учебы?", "title": "Vita Nostra\n      \n          (Метаморфозы #1)", "url": "http://www.goodreads.com/book/show/3972188-vita-nostra", "average": 4.24, "cover": "https://images.gr-assets.com/books/1527796306l/3972188.jpg", "reviews": 73, "authors": [{"url": "https://www.goodreads.com/author/show/7580817.Marina_Dyachenko", "name": "Marina Dyachenko"}, {"url": "https://www.goodreads.com/author/show/7580816.Sergey_Dyachenko", "name": "Sergey Dyachenko"}], "type": ["Fantasy", "Cultural", "Fiction", "Science Fiction"], "outlinks": ["http://www.goodreads.com/book/show/3972188-vita-nostra", "http://www.goodreads.com/book/show/16159259-vita-nostra", "http://www.goodreads.com/book/show/38633526-vita-nostra", "http://www.goodreads.com/book/show/10090456-vita-nostra", "http://www.goodreads.com/book/show/15983376-vita-nostra", "http://www.goodreads.com/book/show/6365190-vita-nostra", "http://www.goodreads.com/book/show/12074910-the-scar", "http://www.goodreads.com/book/show/6538861-brevis-est", "http://www.goodreads.com/book/show/10824015-brevi-finietur", "http://www.goodreads.com/book/show/6365196-rytua", "http://www.goodreads.com/book/show/10248952"]}