{"ratings": 13538, "userreviews": [{"userName": "Nataliya", "userReviewDate": "Nov 20, 2011", "userURL": "http://www.goodreads.com/user/show/3672777-nataliya", "userReview": "Today, April 26th, is the 26th 27th anniversary of Chernobyl catastrophe. In case you're wondering - no, Google did NOT feature it on its home page (same as last year, sadly). But shouldn't humanity remember this disaster?****This is one of the most horrifying books I have ever read. It reads like a postapocalyptic story, except for all of it is horrifyingly real. Svetlana Alexievich, a journalist, provides real but almost surreal in their horror oral accounts of Chernobyl disaster. On April 26, 1986 an explosion of reactor 4 at the Chernobyl nuclear power station marked the transition from the idea of a \"peaceful atom\" to the worst nuclear catastrophe in history. This was a disaster largely hushed up by the government; people were lied to, the effects were minimized and brushed off, and there were not enough resources for a proper and safe clean-up. These true stories are heart-wrenching and shocking, honest and resigned, angry and hopeless. The city of Pripyat, which was home to the workers of the Chernobyl nuclear station, remains abandoned since that fateful April of 1986. People were thrown into the areas where machines were unable to function due to radiation - while wearing little more than t-shirts and equipped with shovels. People were on the burning roof of the reactor without any protection. People were dying from acute radiation sickness in the most horrifying ways imaginable. Scientists tried to sound alarm but were silenced. Produce heavily contaminated with radiation was still exported to other parts of the Soviet Union. Contaminated items from looted towns and villages appeared all over the country. People were whisked from their homes on buses and told that they would be gone for only a few days. Pets were shot to contain spread of contamination. Visiting officials came in full radiations suits; their local guide was wearing a sundress and sandals. Radiation meters readings were either ignored or falsified. Officials were bringing people out for May Day parades outside in accordance with orders from \"above\" and then watched their own family members succumb to the disease. Listless sick children live in surrounding areas and are just waiting to die. Alexievich lets the eyewitness accounts speak for themselves, with very little editorial voice. Occasionally, she clarifies the emotions or the reactions of the interviewees, but for the most part she lets them speak in their own voice. She does not preach or editorialize, and that makes the book more poignant.These are stories of people robbed of their present and future, of the disaster that is still claiming lives. Its effects will be felt for decades to come, in the sick children, mutated animals, abandoned cities and villages, and destroyed lives. \nI cried when I was reading this book. How can you not?\n5 stars for the fact that she was courageous enough to listen to the heartbreaking accounts and compile all these stories. I would not have had enough strength to do that."}, {"userName": "Manny", "userReviewDate": "Jun 09, 2010", "userURL": "http://www.goodreads.com/user/show/1713956-manny", "userReview": "The Belarusian journalist Svetlana Alexievich spent three years interviewing people who had been involved in Chernobyl: villagers from the surrounding area, \"liquidators\" (members of the cleanup squad), widows and children, nuclear scientists, politicians, even people who, incredibly, had moved to Chernobyl after the accident. She presents their words almost without comment. Sometimes she adds a [Laughs]; sometimes [Stops]; sometimes [Starts crying]; sometimes [Breaks down completely]. I am not sure I have ever read anything quite as horrifying. It is like a very well written post-apocalyptic novel in many voices, and it's all true. Here are some extracts.From the translator's preface:The literature on the subject is pretty unanimous in its opinion that the Soviet system had taken a poorly designed reactor and then staffed it with a group of incompetents. It then proceeded, as the interviews in this book show, to lie about the disaster in the most criminal way. In the crucial first ten days, when the reactor was burning and releasing a steady stream of highly radioactive material into the surrounding area, the authorities repeatedly claimed that the situation was under control.From the Historical Notes:During the Second World War, one out of every four Belarussians was killed; today, one out of five Belarussians lives on contaminated land. This amounts to 2.1 million people, of whom 700,000 are children.From a liquidator's account:We had good jokes too. Here's one. An American robot is on the roof of the reactor for five minutes, then it breaks down. The Japanese robot is on the roof for five minutes, then it breaks down. The Russian robot's been up on the roof for two hours! Then someone shouts over the loudspeaker: \"Private Ivanov! Two hours more, and you can take a cigarette break!\"From a nuclear physicist's account:There's a moment in Ales Adamovich's book, when he's talking to Andrei Sakharov. \"Do you know,\" says Sakharov, the father of the hydrogen bomb, \"how pleasantly the air smells of ozone after a nuclear explosion?\"From a politician's account:I was First Secretary of the Regional Committee of the Party. I said absolutely not. \"What will people think if I take my daughter with her baby out of here? Their children have to stay.\" Those people who tried to leave, to save their own skins, I'd call them into the regional committee. \"Are you a Communist or not?\" It was a test for people. If I'm a criminal, then why was I killing my own grandchild?\" [Goes on for some time but it is impossible to understand what he is saying]From a teacher's account:Our family tried not to economize, we bought the most expensive salami, hoping it would be made of good meat. Then we found that it was the expensive salami that they mixed the contaminated meat into, thinking, well, since it was expensive fewer people would buy it.From a widow's account:When we buried him, I covered his face with two handkerchiefs. If someone asked me to, I lifted them up. One woman fainted. And she used to be in love with him, I was jealous of her once. \"Let me look at him one last time.\" \"All right.\"From a father's account:My daughter was six years old. I'm putting her to bed, and she whispers in my ear: \"Daddy, I want to live, I'm still little.\" And I had thought she didn't understand anything.From the author's afterword:These people had already seen what for everyone else is still unseen. I felt like I was recording the future."}, {"userName": "Maria Clara", "userReviewDate": "May 10, 2018", "userURL": "http://www.goodreads.com/user/show/46308842-maria-clara", "userReview": "Horror en estado puro! Es impresionante... Estoy sin palabras. Mientras lees, hay relatos que... sobre todo el primero y el de la niña que no podía hacer pipi. Sencillamente de terror; de sufrimiento. Los otros relatos son para alucinar. Tanto que dejas de creer en el hombre."}, {"userName": "Tatiana", "userReviewDate": "Jun 02, 2016", "userURL": "http://www.goodreads.com/user/show/2250020-tatiana", "userReview": "I was about 5 when Chernobyl happened, and my family lived near the Baltic Sea, not that far from the explosion zone, relatively speaking. I can't really remember what exactly I understood about what had happened. I remember our family friend's little niece came from Belorus to stay for the summer. I have strange knowledge of the dangers of radiation and mutations and acid rains and death by \"belokroviye\" (leukemia). I knew a lot of people with enlarged thyroids and I also somehow still know that I need iodine not to get sick. Strange things I have in my subconscious. Sometimes I wonder what I learned from life and what - from Roadside Picnic (a novel prophetic in many ways). This is what Alexievich writes about - you live through Chernobyl, and Chernobyl becomes a part of you in many ways.It took me 30 years to finally be ready to find out what really happened. A lot of information is out there, but none of it presents the scope of the tragedy quite as well as Alexievich's work does. Told in personal stories, this collection of monologues leaves no stone unturned. Of course there are tales of horror and guilt and crime. But, mainly, I think Alexievich is right to conclude that what is at fault in this tragedy is Russian mentality - a peculiar beast of heroism, fatalism, idealism, carelessness, lack of self-preservation and unexplained hope that whoever is in power will know best. The same mentality that leads people to elect one dictator after another, through centuries, with the same catastrophic results."}, {"userName": "Steven  Godin", "userReviewDate": "Feb 21, 2018", "userURL": "http://www.goodreads.com/user/show/26706841-steven-godin", "userReview": "\"Sometime in the future, we will understand Chernobyl as a philosophy. Two states divided by barbed wire: one, the zone itself; the other, everywhere else. People have hung white towels on the rotting stakes around the zone, as if they were crucifixes. It's a custom here. People go there as if to a graveyard. A post-technological world. Time has gone backwards. What is buried there is not only their home but a whole epoch. An epoch of faith. In science! In an ideal of social justice! A great empire came apart at the seems, collapsed. First Afghanistan, then Chernobyl. When the empire disintegrated, we were on our own. I hesitate to say it, but...we love Chernobyl. We have come to love it. It is the meaning of our lives, which we have found again, the meaning of our suffering.Like the war. The world heard about us Belarusians after Chernobyl. It was our introduction to Europe\" - Chairwoman, Woman's committee of Children of Chernobyl.My own memories of April 26 1986 and the Chernobyl catastrophe are vague, I was only nine-years-old and not interested in the news. I do however remember my parents being glued to the TV set on that day, I didn't fully understand what was going on, but knew it was bad.Over time, my knowledge of the disaster remained sketchy, picking up bits of information here and there, but it felt to me like the whole event was brushed under the carpet, for the rest of the world to forget, no outside eyes getting on to what really happened in the clean up operation. Until now, and reading Alexievich's book, the only image that was strong in my mind is of the abandoned bumper cars from the visiting fair, rotting away in a mechanical graveyard.That's now all changed.Whatever her genre, Svetlana Alexievich is an original, a true voice, a voice that is hers and hers alone, but it's through the voice of others, the ones the rest of the world never got to here, opening up on their thoughts, living smack bang in the middle of the worse possible nightmare. Exploring pain and loss on an unprecedented scale, the forgotten speak out, making for one of the most upsetting, harrowing and heart-felt books I will ever get to read. If there is a light at the end of the tunnel, it's no more than a pinprick to the naked eye, this is writing of immense suffering, of death, the soul of mankind rocked to it's core. But it is also filled with a gigantic love, an all powerful love that no amount of radiation could ever destroy, as these people show what big hearts us humans carry around with us. Some of the accounts within, I just couldn't quite believe, that had me seeing red. Surely this is some sort of joke?, how the hell could these things be aloud to happen?, this was 1986, not 1896, the bodies in control (or should that be no control what so ever) should hang their heads in shame!. The amount of deaths and deformities that should never have been allowed to happen makes me sick to the stomach. Some were unavoidable. Most weren't.A true history of its people need be no more than the howls of despair of millions of souls. Punctuated by moments of incredible tenderness, courage and grim humour. The scale of the devastation and its insidious nature are perhaps beyond the power of the individual mind to imagine, which is one good reason why the polyphonic form Alexievich has made her own is so unique and so appropriate. Only the voice of the witnesses can do the events justice, and in Chernobyl Prayer, after some shocking facts about the explosion and its immediate aftermath, it's the testimony of those living close by, that grab you around the neck, before dragging you off into their world. Alexievich’s documentary approach makes the experiences vivid, sometimes almost unbearably so, but it’s a remarkably democratic way of constructing a book, and at no point did I ever lose attention. It's far too important for that. Svetlana Alexievich fully deserved the Nobel Prize for her work. But compare this to the agonising accounts she writes about, it soon becomes meaningless.A book I didn't want to read, but I HAD to read."}, {"userName": "Gorkem Y", "userReviewDate": "Apr 29, 2017", "userURL": "http://www.goodreads.com/user/show/5811468-gorkem-y", "userReview": "Ne yazacağımı bilmiyorum. Nerden başlamam gerektiğini mi, bu kitabın 10 üzerinde 10 mu yoksa 5 üzerinde 2,5 mu olduğunda mı, okumak için öneririr miyim? Açıkcası ne diyeceğimi bilmiyorum. İnsanların sistemler içinde (bir neslin) yok oluş trajedisini ben nasıl yorumlayabilirim ki? Bu insanların korkuları ve hayallerinin kayboluşunu mu; toprağın toprağa gömülmesini mi, yoksa doğanın bu süreçte nasıl hala çok güzel olup zehirli bir yaşam saçtığı mı? Ne söyleyebilirim ki?!Çernobil Duası-Geleceğin Tarihi, bize Çernobil Sonrası yaşamı polifonik olarak canlı tanıklardan, bilimadamlarından, çocuklardan, siyasetcilerden oluşan korolarla birlikte birden fazla anlatıma maruz bırakıyor. Evet bazen aynı şeyler çok fazla tekrarlanıyor, enerjiniz çekiliyor ama aynı zamanda nefes aldığınız anları, etrafınızda sevdiğiniz her şeyi kendiniz dahil şükran duymanızı sağlıyor. Bir devrin kapanmasının canlı metaforu Çernofil Duası.\"Burada çok arkadaşım öldü...Yulya, Katya, Vadim. Oksana, Oleg..Şimdi de Andret.. 'Biz öleceğiz ve bilimsel vaka olacağız' derdi Andrey. 'Biz öleceğiz ve bizi unutucaklar diye' düşünürdü Katya.'Ben ölünce, sakın beni mezarlığa gömmeyini mezarlıklardan korkuyorum ben, orada sadece ölüler ve kargalar oluyıor....Artık başımı kaldırıp bakınca, gökyüzü capcanlı geliyor bana..Arkadaşlarımın heps,i orda\".sf:439, Çocuklar Korosu.....İnsanlar gittikten sonra o ölü bölgede geriye ne kaldı? Eski kabristanlar ve biyo-mezarlık olarak adlandırılan hayvan mezarları. İnsan sadece kendisini kurtardı, kendi dışındakı tüm canlılara ihanet etti.Köyler boşaltılır boşaltılmaz gruplar halinde bölgeye gelen silahlı asker ve avcılar hayvanları vurdu. Oysa o köpekler insan sesine koşuyor...Kediler de...Atlar da....Vakti zamanında Meksika'daki yerliler ve dahi Hristiyanlık öncesi dönemdeki Slav kökenli atalarımız, yemek için öldürdükleri yabanıl hayvanlardan ve kuşlardan af dilermiş. Eski Mısır'da hayvanların insanlardan şikayetçi olma hakkı varmış. Piramitlerde günümüze ulaşan papirüslerden birinde şöyle yazar: \"Hiçbir boğa N.den şikayetci olmamıştır.\"Ölüler alemine doğru yola çıkmadan evvel Mısırlılar, içindeki şu ifadelerin yer aldığı bir dua edermiş: Hiçbir canlıya zarar vermedim.Hiçbir hayvanın tahılını ya da samanını almadım,sf.55 Bu kitap ile daha ayrıntılı bir yorum yapabilmeyi çok isterdim. Belki zamanı gelince döner tekrardan yaparım. Değinmek istediğim, altını çizerek vurgulamak istediğim çok fazla şey konusu. Ama, birşeyler boğazımı sıkıyor.Çernobil Duası canlı bir dystopia örneği. Ve etkisi ne yazık ki hala nesiller ve doğa içinde devam ediyor. Aşağıdaki linkte yer alan kısa metrajlı film Çernobil Duası'ndan etkilenerek İrlandalı Yönetmen Juanita Wilson tarafında çekilmiştir. Film aynı zamanda 2010'da Oscar'a aday olmuştur.https://www.youtube.com/watch?v=Qn99F..."}, {"userName": "Hadrian", "userReviewDate": "Oct 16, 2011", "userURL": "http://www.goodreads.com/user/show/4100763-hadrian", "userReview": "There was an emphasis on our being heroes. Once a week someone who was digging really well would receive a certificate of merit before all the other men. The Soviet Union's best grave digger. It was crazy.One of the poets says somewhere that animals are a different people. I killed them by the ten, by the hundred, thousand, not even knowing what they were called. I destroyed their houses, their secrets. And buried them. Buried them.These people don't exist any more, just the documents in our museum, with their names.When they all died, they refurbished the hospital. They scraped down the walls and dug up the parquet. When he died, they dressed him up in formal wear, with his service cap. They couldn't get shoes on him because his feet had swollen up. They buried him barefoot. My love.When reading or rereading this book, it's easy to treat it as a twisted prose poem or a myth. Poisonous foods growing in the fields, animals abandoned and buried, skin turning grey and sloughing off. And the book dips into that quality of some dark fable about human folly. And the sparse prose of the interviews also leads you to that impression.Beyond fable, however, this is journalism. This is a record of history and memory, an investigation of how disaster happened. It was a disaster in the Soviet Union, and it is the result of Soviet institutions, and it affected the Soviet people, now Russians, Belorussians, Ukrainians. This is a study of their institutions, the army, the firefighters, the settlers, the children. The only thing they can compare it to is the war, but that isn't entirely right. \"You can write the rest of this yourself, I don't want to talk anymore.\"“…it makes you want to philosophize. No matter who you talk to about Chernobyl, they all want to philosophize.”"}, {"userName": "Glire", "userReviewDate": "Oct 13, 2015", "userURL": "http://www.goodreads.com/user/show/7227066-glire", "userReview": "Flotando esta reseña porque ayer se cumplieron 30 años de la tragedia de Chernóbil; y me gustaría hacer un sutil recordatorio de que si aún no has leído este libro, vale la pena hacerlo.\n\n“Chernóbil para ellos no era una metáfora ni un símbolo, era su casa.”\n\nHagamos un experimento. Pregúntale a alguien, a cualquiera: ¿Cuál crees que es la peor tragedia que ha tenido que soportar la humanidad? Probablemente algunos mencionarán a Hitler, otros tal vez hablen de Hiroshima y Nagasaki, incluso algunos, quizás, mencionen el terrorismo. ¿Pero cuantos crees que te responderán “Chernóbil”?Todos lo hemos escuchado nombrar. Todos sabemos al menos lo básico: se incendió un reactor nuclear, la ciudad ahora es un pueblo fantasma, los niños y animales de la zona presentan mutaciones genéticas. Y, a pesar de saber todo eso, a pesar de haber visto terribles fotografías y documentales, si antes de leer este libro alguien me hubiese preguntado: “¿Cuál crees que es la peor tragedia que ha tenido que soportar la humanidad?”, Chernóbil ni siquiera hubiera pasado por mi mente.\n“El hombre armado de un hacha y un arco, o con los lanzagranadas y las cámaras de gas, no había podido matar a todo el mundo. Pero el hombre con el átomo… En esta ocasión toda la Tierra está en peligro.”\nVoces de Chernóbil, no es la historia de que pasó el fatídico 26 de abril de 1986, de eso, como lo dice la misma Svetlana, ya hay muchos otros libros. Este es el relato de después. La historia de los “sobrevivientes”. Acá, aunque se habla de la muerte (¿y cómo no hacerlo?), el protagonismo lo tienen las emociones de cada uno de los entrevistados -viudas, liquidadores, madres, niños, campesinos, ingenieros- su culpa, amor, miedo y aceptación. Su desesperanza.\n“Un niño de siete años. Cáncer de tiroides. Quise distraerlo con bromas. El chico se giró cara a la pared: «Sobre todo no me diga que no me moriré. Porque sé que me voy a morir».”\nTodos podemos cerrar los ojos e imaginar la guerra. Hemos crecido rodeados de ella, la hemos visto en el cine, en los libros, documentales y noticias. Que si la Primera Guerra Mundial, la Segunda, la Guerra del Golfo, la Guerra Fría, Irak, Irán, Vietnam, Ruanda, Sudán, Afganistán... es infinito. Y nos hemos vuelto indolentes, nos parece normal. Nos hemos acostumbrado a las matanzas y nos hemos acostumbrado a la muerte, pero lo que este libro nos muestra va mucho más allá. Somos testigos de una realidad más devastadora que cualquier ciencia ficción. Te abre los ojos a un mundo donde lo que todos damos por sentado no es posible: bañarse en la lluvia o el río, disfrutar el olor de las flores, comer los frutos de los arboles, recostarte en la arena a tomar el sol. Un mundo donde cada sonrisa y cada animal es un milagro. ¿Lo peor? No es invención, es nuestro mundo.\n“Hace tiempo que me he descubierto enseñándome a ser más atenta con el mundo que me rodea. Con mi entorno y conmigo misma. Después de Chernóbil, esto te sale por ti mismo.”\nUn testimonio que me ha afectado tan profundamente (más de lo que creía posible), que no estoy segura de recomendarlo. Tal vez, solo si te sientes preparado para no volver a ser el mismo. Porque este es un libro capaz de cambiar el mundo. Capaz de cambiar tu forma de pensar. Capaz de cambiarte.\n\n“No perdimos una ciudad, sino toda una vida.”"}, {"userName": "Lisa", "userReviewDate": "Jan 16, 2016", "userURL": "http://www.goodreads.com/user/show/32532774-lisa", "userReview": "Very touching voices, chronicling the Chernobyl experience and comparing life before and after the moment that changed everything. Svetlana Alexievich captures the suffering of ordinary people of all walks of life, as well as that of professional staff sent to Chernobyl to deal with the crisis immediately after it happened. She creates a social panorama of the society that was affected in its totality by the nuclear disaster.I will never forget my feelings in 1986, living in West Germany and attending a small town primary school. All of a sudden, global politics became a tangible reality and a threat. Chernobyl was the first man-made disaster that I experienced and understood. After Chernobyl, nothing was ever as innocent as before again. A wake-up call for my social conscience, you could say. But I never grasped what it was like for the people who were there, who saw it happen, who had to make decisions on their future based on that catastrophe. Reading Alexievich gave me inside knowledge of the nightmare I remember from my childhood. While we were just kept away from certain foods, and weren't allowed to play in the sandbox or go on field trips, people in proximity to Chernobyl fought - often hopelessly - for their lives.I had to put down the book several times and take a break, as the stories are painful to read, particularly those which tell of ordinary issues and problems, and of ordinary people. The individuals telling their stories are not heroes, and they don't have the privilege of being seen and heard and worshipped for their suffering, like religious martyrs or soldiers. They just happened to be singled out by the shared experience of the disaster:\"We're often silent. We don't yell and we don't complain. We're patient, as always. Because we don't have the words yet. We're afraid to talk about it. We don't know how. It's not an ordinary experience, and the questions it raises are not ordinary. The world has been split in two: there's us, the Chernobylites, and then there's you, the others. Have you noticed? No one here points out that they're Russian or Belarussian or Ukrainian. We all call ourselves Chernobylites. \"We're from Chernobyl.\" \"I'm a Chernobylite.\" As if this is a separate people. A new nation.\"It is the author's strength to put those silent voices on loudspeaker, to let them have their say, to let them show \"the others\" what it was really like to live through a nuclear accident. Alexievich gives literature a democratic touch, not putting her creativity in focus, but rather her empathy for the different people she encounters. Her literary skills lies in the careful collection and arrangement of the disparate voices to a reading experience of unique character.Intense reading! I strongly recommend it to the world of today. Read and think."}, {"userName": "Amira Mahmoud", "userReviewDate": "Jun 04, 2016", "userURL": "http://www.goodreads.com/user/show/23833335-amira-mahmoud", "userReview": "الألم من جديد، الألم مرة أخرى. وقذارة الإنسان كالعادة!يقول إبراهيم نصر الله في أحدى رواياته؛ لم يخلق الله وحشًا أسوأ من الإنسان، ولم يخلق الإنسان وحشًا أسوأ من الحرب.الحرب هذه المرة غير متكافئة بالمرة ليس لاختلاف في قوة الطرفين المتحاربين بل لاختلاف الطرفين أنفسهم، الإنسان هُنا لا يحارب الإنسان.الإنسان هُنا وبكل نرجسيته وجبروته يُحارب الطبيعة. استغلال الطبيعة بحكمة في سبيل رفاهية جديدة لنّا والمزيد منها هو أهم وظائف العلم لكن حين يتحول الاستغلال إلى حرب وتتحول الحكمة إلى جرأة تُكشّر الطبيعة عن أنيابهاالإنسان يُدرك تمامًا أن كل هذا مُسّخر له ولخدمته، ربما هذا حقًا ما يحدث وربما هي سلطة –لا أكثر- استمدها الإنسان كونه المخلوق الوحيد الذي يمتلك العقل لكن في كل الأحوال تصبح إلى هُنا علاقته بالطبيعة وبما حوله نفعيّة لكن بسلام، أو هكذا يبدو.لكن حين يصل إلى منطقة يصبح فيها ذلك العقل قاصرًا عن استغلال الطبيعة أكثر، حين يصل إلى المنطقة المحظورة لكنه يستمر في التجربة، عليه تحمل تبعات ذلك كله من بشاعة وألمالأسوأ هو أن من سيتألم ليس بالضرورة ذلك الذي تجرأ بل سيذهب معه ضحايا كُثر، وربما يذهبون هم إلى أبشع درجات الألم ويبقى هو مُحصّن ومحفوظ بصفته سياسيًا؟ بصفته عالِمًا؟ لا يهم! المهم أنه لا يتحمل السيئة إلا أولئك الذين لم يقترفوها.\nاخترع الإنسان التقنية التي لم يكن مستعدًا لها بعد، غير معادل لها.هل يمكن أن تضع بيديّ الطفل مسدسًا؟ نحن أطفال- مجانين.\nتشرنوبل، الحرب النووية حيث الإنسان يقف عاجزًا، حيث الموت والألم، حيث اللامستقبل والحاضر البشعحين يقوم الإنسان بتشويه الطبيعة التي تقف هي صامتة، ترد باعتراضات ووسائل أخرى كثيرة في رسالة ضمنية منها \"إذا تماديت سأحرمك من كل رفاهية حالية ومستقبلية تشوهنّي لأجلها، وستكون حينها معيشة الماضي الضئيلة حلم لا تطاله\" لكن يستمر في التمادي ويستمر إلى الحد الذي يقلب الآية، ويقلب السحر على رأسه فتشوهه الطبيعة حينها!حين كنت اقرأ –فقط- وصف من عانوا من تشرنوبل، كيف تشوه أحبائهم أمامهم أشعر بالأشمئزاز، كيف من يرى ذلك بأم عينه؟ ليس في أي أحد بل فيمن يُحب؟ كيف يصبح هذا واقعهم؟حين قرأت أكثر من 400 صفحة من الألم، كنت أشعر بكثير من التكرار فلا شيء جديد ولا حدث مختلف يُضاف فكل هذا يمكن أن يُكتب في مائة صفحة ويصلنيّ بقوة.فهذه سافر زوجها لتشرنوبل، تشوه، مات أمامها. هذه أنجبت طفل مشوه وهذه تخشى أن تنجب، وهذه لا يتزوجها أحد كي لا ينجب. من سيستطيع بجرأة –وسفالة- أن يُنجب طفلاً يعلم تمامًا أنه سيموت؟ بل سيتشوه –ملاك سيتشوه- وسيموت؟وهذا أخرجوه من بيته، من أرضه ووطنه، وهذه تثشبثت بالأرض رغم ما بها من إشعاعات، وما بها من آسى وهذا وهذة وهؤلاء....إلخ.لكل حكايته الخاصة، لكل وجعه الخاص الذي لا يحمله عنه أحد، ولا يمكن لشيء أن يخففه لا كتابته ولا قراءته!هُنا أدركت أن كل حكاية يجب أن تُكتب –في 400 صفحة في 1000 صفحة- المهم أن تكتب، ليس لهم بل لنّا، للإنسان، ولصلفه ونرجسيته!\nالذي بقى ولم يتغير هو المعاناة الإنسانية؛ رأسمالنا الوحيد، لا يتجزأ!\nتمّت"}, {"userName": "Greta", "userReviewDate": "Oct 08, 2015", "userURL": "http://www.goodreads.com/user/show/45248887-greta", "userReview": "I will never forget a documentary I saw about the nuclear disaster at the Chernobyl power plant in 1986. This documentary, The Battle of Chernobyl, directed by Thomas Johnson, provides a very good understanding of what happened at the time of the accident and afterwards. It contains rare original footage and interviews with people who were present, or involved in the handling of this catastrophe. It's available on YouTube and I highly recommend it, because I think it's a really good addition to this book (https://youtu.be/WWlha7Kakjs). I would have struggled understanding the translator's preface, and the tenor of some testimonies, if I hadn't seen this documentary. The prologue of the book is in fact the first interview, with the widow of a fireman who arrived at the plant a short time after the explosion. Until now, I've never heard such a heartbreaking story. I doubt anyone who reads this interview, will ever be able to forget it. The book also ends with another heartbreaking testimony, again from a widow. The long-term suffering of her husband is horrifying. In between these, there are interviews with all sorts of people affected by the Chernobyl disaster. The author wrote the testimonies down just the way they were told. That makes them very personal and honest. On the other hand, sometimes it made no sense at all what some where saying. Overall, it's an eye-opening, honest work that's very different in approach. How do people feel, think, live, after being confronted with this terrifying catastrophe. \"Chernobyl is like the war of all wars. There's nowhere to hide. Not underground, not underwater, not in the air\" (p.75). \"It was constantly being compared to the war. But this was bigger. War you can understand. But this? People felt silent\" (p.141). \"This level of lying, this incredible level, with which Chernobyl is connected in our minds, was comparable only to the level of lies during the big war\" (p.143)."}, {"userName": "Erika", "userReviewDate": "Jan 04, 2016", "userURL": "http://www.goodreads.com/user/show/23743588-erika", "userReview": "A few years ago, I left a copy of Maus I: A Survivor's Tale: My Father Bleeds History out on the table. It was designed as a sort of breadcrumb trail for my teenaged son who didn’t need to read since he already knew everything. I hoped he might be sucked in by the pictures. A week later my son walked out of his bedroom clutching the book. “Have you read this!?” he was nearly yelling with urgency. “This guy…I can’t believe…shit! I’m telling my English teacher that he needs to make everyone in the class read this book!”The Chernobyl nuclear disaster needs its Maus if only because so many young people in America have never even heard of it. (I actually asked a bunch.) There’s been documentaries, novels, nonfiction accounts, and even a horror movie, but none carry the gravitas of a really important historical retelling. Luckily Voices from Chernobyl comes very close. The author is a journalist from Belarus who won the Nobel Prize in 2015. For this account, she interviewed hundreds of residents, people on the cleanup teams, politicians, scientists, the list goes on. She sets them here as monologues from ordinary people, some horrific, some disjointed, some philosophizing, and some darkly funny. Many of the passages are almost unbearable to read like this quote from a solider on clean up duty. We came home. I took off all the clothes that I had worn there and threw them down the trash chute. I gave my cap to my little son. He really wanted it. And he wore it all the time. Two years later they gave him a diagnosis: a tumor in his brain…you can write the rest of this yourself. I don’t want to talk anymore. In another section a soldier describes killing the household pets left behind in villages that had been evacuated. The animals were radioactive and residents weren’t allowed to take them. The dogs were waiting for people to come back. They were happy to see us, they ran toward our voices. We shot them in the houses, and the barns, in the yards. They couldn’t understand why are we killing them? They were household pets. They didn’t fear guns or people. They ran toward our voices…One dog—he was a little black poodle. I still feel sorry for him. We loaded a whole dump truck with them, even filled to the top. We drove them over to the “cemetery.” To be honest it was just a deep hole in the ground even though you’re supposed to dig it in such a way that you can’t reach any ground water, and you’re supposed to insulate it with cellophane. But of course those instructions were violated everywhere….If they weren’t dead, if they were just wounded, they’d start howling, crying. We’re dumping them from the dump truck into the hole, and this little black poodle is trying to climb back out. No one has any bullets left. There’s nothing to finish him with. Not a single bullet. We push him back into the hole and just buried him there. It was just a little household poodle, a spoiled poodle. This one thing stuck in my memory. Twenty guys. Not a single bullet at the end of the day. Not a single one. Yet, as an American who doesn’t know enough about Chernobyl, I wish the book had contained more historical information. A map would have been helpful, along with an explanation of what exactly happened and an estimate of how many people were affected across what distance. Also, I couldn’t find any structure to the monologues. They blend together with no sense of chronology or related themes, which was hard on my order-seeking brain. That said, reading this is intense and deeply emotional. I’m thankful to Svetlana Alexievich for putting Voices from Chernobyl into the world because I believe every one of us should know what happened in Pripyat, Ukraine. It should be required reading."}, {"userName": "فهد الفهد", "userReviewDate": "Apr 17, 2016", "userURL": "http://www.goodreads.com/user/show/5008212", "userReview": "صلاة تشرنوبل قبل أيام قليلة حلت الذكرى الثلاثين لكارثة تشرنوبل والتي وقعت في 26 إبريل 1986 م، حيث أدى ارتفاع في حرارة المفاعل رقم أربعة في محطة تشرنوبل إلى انفجاره قاذفاً مواد مشعة تفوق قنبلة هيروشيما بـ 350 مرة، حدث هذا بالقرب من مدينة بيربات شمال أوكرانيا حالياً، وداخل حدود الاتحاد السوفييتي سابقاً، ورغم وجود غورباتشوف في السلطة وقتها، ورغم سياسة إعادة البناء والشفافية (البيروسترويكا والجلاسنوست) التي كان يدعو إليها، إلا أن هذه الكارثة تم التعامل معها بطريقة ضاعفت من كارثيتها، فكعادة الانظمة الشمولية تم رفض أي عروض مساعدة من الدول الأخرى، كما تم نفي وتكذيب أي أخبار حول الكارثة بدعوى عدم إشاعة الذعر، وترك الناس المساكين ليعيشوا ويأكلوا ويشربوا في مناطق ملوثة إشعاعياً مما جعل الكثير منهم يتعرضون للأمراض السرطانية، وكان الضرر البيئي والإنساني مرعب جداً، وتركز على الدولة الصغيرة بيلاروسيا والتي تأتي منها الكاتبة النوبلية (سفيتلانا ألكسيفيتش) لتكتب في هذا الكتاب المروع عن الناس الذين تضرروا من هذه الكارثة، تلتقي بمزارعين وأطفال، تلتقي بجنود، وتلتقي بمسؤولين وعلماء نوويين، وتكتب بأسلوبها كلماتهم وما مروا به، كل هذا يكشف لنا ببطء حجم الكارثة، تخيل كيف يمكن أن يحيط بك عدو لا تراه، لا تسمعه، لا تشمه، يتغلغل في أرضك، في منزلك، في طعامك وشرابك، كيف ستفقد الأمن إلى الأبد، تنتظر مرضاً عضالاً قد يحل بك، تراقب من حولك يموتون ببطء وبطريقة بشعة، تخشى إنجاب أطفال مشوهين تشويهاً مخيفاً، هذه هي الحالة التشرنوبلية التي وصمت ولازالت تصم جيلاً كاملاً، في هذا الكتاب نتعرف لا على ما بعد تشرنوبل، وإنما على كيف تم التعامل مع تشرنوبل، نتعرف على كيف دفع الجنود وكأنهم بلا أي قيمة إلى المنطقة ليسيطروا على التسرب، كيف مات وتسمم الكثيرون منهم، وهم يكافحون عدواً متسللاً لم يعدوا له ولا حتى بكمامات عادية، يربط الشعب حربه ضد تشرنوبل بحربه ضد النازيين وبحربه ضد ستالين وجرائمه، وكأننا نرى أمامنا تاريخ شعوب تلك المنطقة مفروداً بكل ندوبه وشقوقه."}, {"userName": "ميقات الراجحي", "userReviewDate": "Aug 17, 2016", "userURL": "http://www.goodreads.com/user/show/2799876", "userReview": "يتناول الكتاب حادث المفاعل النووي (تشرنوبل) الذي نتيجة إتفاع في حرارة المفاعل إنفجر مخلفًا كارثة إنسانية / بيئية من جراء ذلك أكثر سنة (1986م) في أوكرانيا - السوفييت. كان أول علمي بهذا الأمر في منتصف التسعينات وتمنيت يومها لو أن ثمة كتاب بالعربية أو مترجمة يحدثني أكثر عنها حتى كان لحظة وقوع الكتابي بين يدي. الذي بيّن لي أكثر حجم هذه الكارثة والتي كما يطلق عليها منطقة منكوبة في برابيت منذ حدوث الإنفجار.تخبرنا الكاتبة (سفيتلانا أليكسفيتش) أن الحادثة لم تقف عند وفاة الـ(36) شخص أول الأمر بل تعدى ذلك لسنوات متلاحقة نتيجة ما هو أشد من الموت السريع وهو السرطان الذي ضرب بأطنابه في المدينة على مدى سنوات عديدة. خلال مقابلات مطولة وعديدة من بعض أسر المنكوبين وقريبي الحدث أجرت الصحفية سفيتلاتا الكثير من طرح أسئلتها لتخرج بصورة بشعة عن أشهر حوادث الإنفجارت في القرن العشرين . بطريقة تعددات أصوات النكبة (المونولوجات) في قالب أدبي جميل وموجع رغم عدم روائية الكاتبة إلا أن الكتاب يكمن نجاحة في صدق المعاناة التي يتحدث عنها الكتاب في (3) فصول وجميع مقاطعها مونولوجات من حياة شهود عيان علي مستوى تشرنوبل. لا أستطيع الجزم بأن النص روائي لكن دون شك عمل يدخل في نطاق العمل (الإبداعي : الشعر والقصة والرواية) وغيرها من الأعمال التي يتلاحم فيها الخيال مع الواقع. فالعمل إن صحت تسميته مقابلة صحفية متعددة الشخصيات في قالب روائي. فلن تجد في النص حبكة أو تكنيك أو تعدد شخصيات مسيطرة على النص منذ البداية أو بعد مضي الربع الأول. هنا تتجسد أصوات المتضررين من الحادثة مع أولئك الذين كانوا في المحطة ومع الكثير من الشخصيات التي تسلط الضوء عليهم وعلي حياتهم وتحولها بعد الفاجعةو ومدى الضرر العضوي والنفسي عليهمو وكيف كذب النظام السوفيتي على الشعب وأوهم بقوة نظامه وقدرته علي إحتواء مثل هذه المشاكل وماقام به من تضليل للشعب."}, {"userName": "Jibran", "userReviewDate": "Oct 11, 2015", "userURL": "http://www.goodreads.com/user/show/5407952-jibran", "userReview": "[Don't hate me! (hide spoiler)]"}, {"userName": "Carmo", "userReviewDate": "Mar 19, 2017", "userURL": "http://www.goodreads.com/user/show/15850971-carmo", "userReview": "“ Demorei a escrever este livro…Quase vinte anos…Encontrei-me e conversei com antigos trabalhadores da central, cientistas, médicos, soldados, cidadãos residentes na zona evacuada…”Svetlana Alexievich, autora, Prémio Nobel de Literatura 2015Enchi o livro de post-its, achei que iria ter muito para dizer… mas fiquei muda de espanto, de incredulidade, de revolta.Seria mera repetição do que aqui foi dito, ninguém deve substituir o testemunho daqueles que viveram a experiência do desastre, sofrem as consequências vitalícias da radiação e falam pelos que não resistiram.É absolutamente avassalador ler os relatos destas pessoas. Eu até pensava que sabia alguma coisa sobre Chernobyl, pois bem, nada que se aproximasse do que aqui encontrei.É essencial tentar compreender a cultura e mentalidade soviéticas da altura; o povo era treinado a viver para o partido, instado ao dever para com a Mãe Pátria. Eram mal informados e habituados a que pensassem por eles. Quando chamados iam, iam por medo, ou imbuídos de heroísmo suicida e não hesitavam nem se arrependiam. É completamente inaceitável como isso foi explorado pelos dirigentes e como a negligência com que trataram o desastre condenou ao sofrimento e à morte milhares de seres humanos.Passaram-se trinta anos desde a explosão e, se hoje grande parte da Europa não faz parte da catástrofe, foi mérito desses homens fatalistas que deram as suas vidas em troca de uma medalha de mérito. Mas, Chernobyl não pode ser enterrado na História; “O Quarto reator ainda alberga cerca de 200 toneladas de material radioativo nas suas entranhas de cimento armado. Ninguém sabe o que se passa com ele hoje.(…) O sarcófago é um defunto que respira. Respira morte. Quanto tempo ainda durará?”“a desintegração do urânio corresponde a duzentas e trinta e oito semidesintegrações. Convertendo em tempo: mil milhões de anos. Do tório, catorze mil milhões de anos”Anatoli Chimanski, jornalista“Tenho dentro de mim tantas emoções, que não consigo lidar com elas, paralisam-me. Atrapalham-me.”Irina Kiseleva, jornalista"}, {"userName": "José", "userReviewDate": "Jun 11, 2017", "userURL": "http://www.goodreads.com/user/show/35062854-jos", "userReview": "Podés encontrar esta y otras reseñas en mi blog\n\n«Voces de Chernóbil» era un libro que tenía pendiente desde hace mucho y que compré en cuanto me enteré de que su autora fue galardonada con el Premio Nobel de la literatura en el 2015. Se trata de una crónica que recoge los testimonios de diferentes personas afectadas por una de los mayores tragedias en la historia de la humanidad. Los diferentes capítulos son entrevistas (o monólogos, como los denomina la autora) que Alexiévich seleccionó entre las más de quinientas que realizó a lo largo de diez años para así proporcionar una versión más humana de los hechos. Esto permite abordar el tema de una forma mucho más interesante y no tan fría como en un libro de historia; lo que más me impactó fue conocer la forma en la que se les mintió a la población y a los técnicos que fueron enviados sin ningún tipo de protección a investigar el desastre. Con respecto a esto último, la entrevista que más me impresionó fue «Monólogo acerca del poder ilimitado de unos hombres sobre otros», en la cual un físico admite la forma en la que el gobierno de la URSS hizo todo lo posible por ocultar las consecuencias de la explosión del reactor.En estas páginas encontramos personas con diferentes ideologías y de todas las edades: esposas de liquidadores (es decir, aquellos que fueron enviados a evaluar los daños del reactor), ancianos habitantes de zonas rurales cercanas a Chernóbil, ex miembros del Partido Comunista, físicos, bomberos y niños que hasta el día de hoy padecen los efectos de la radiación.Además, la autora incluye a modo de prólogo una «entrevista consigo misma» en la cual expresa los motivos que la llevaron a elaborar esta crónica y también aporta su propia opinión y reflexiones después de realizar las entrevistas. Los diferentes testimonios están agrupados en tres secciones. La primera sección, titulada «La tierra de los muertos», ofrece una visión general de la tragedia y cómo la misma afectó a los diferentes familiares que perdieron seres queridos cuando fueron enviados a investigar el reactor. Además, presenta la perspectiva de los soldados que, sin saberlo, fueron enviados a morir. También nos muestra cómo de la noche a la mañana muchas personas fueron marginadas por haber sido contaminadas por la radiación: «Y un día, de pronto, te conviertes en un hombre de Chernóbil. ¡En un bicho raro! En algo que le interesa a todo el mundo y de lo que no se sabe nada. Quieres ser como los demás, pero ya es imposible. No puedes, ya es imposible regresar al mundo de antes. Te miran con otros ojos. Te preguntan: \"¿Pasaste miedo ahí? ¿Cómo ardía la central? ¿Qué has visto?». O, por ejemplo, «¿Puedes tener hijos? ¿No te ha dejado tu mujer?\". En los primeros tiempos, todos nos convertimos en bichos raros. La propia palabra \"Chernóbil\" es como una señal acústica. Todos giran la cabeza hacia ti. \"¡Es de allí!\" Estos eran los sentimientos de los primeros días. No perdimos una ciudad, sino toda una vida». En «La corona de la creación», la segunda sección, las entrevistas giran en torno a las consecuencias ambientales y biológicas de la radiación, pero sin tratarlas desde un punto de vista técnico o científico (a pesar de que se incluyen un par de entrevistas a especialistas). Por último, «La admiración de la tristeza» nos muestra cómo vive hoy en día la generación que \"heredó\" Chernóbil. En mi opinión es la sección más desgarradora de todas porque incluye testimonios muy crudos, tanto de adultos como de niños que se han acostumbrado a convivir con la muerte y que no comprenden por qué su esperanza de vida es tan reducida. «Mi madre se viste a menudo de negro. Con un pañuelo negro. En nuestra calle cada día entierran a alguien. Lloran. Oigo la música y corro a casa para rezar, recito el padre nuestro. Rezo por mi madre y por mi padre».En resumen, «Voces de Chernóbil» es un gran libro que permite conocer la historia desde una perspectiva más humana a partir de la experiencia de personas que hasta el día de hoy padecen las consecuencias de la tragedia. Los testimonios son desgarradores, pero gracias a ellos se puede aprender mucho. Una lectura super recomendable para aquellos que les interese conocer más del tema, no es un libro pesado."}, {"userName": "Mia Nauca", "userReviewDate": "Sep 09, 2017", "userURL": "http://www.goodreads.com/user/show/33138824-mia-nauca", "userReview": "De esos libros que te golpean, que lo terminas y dices wow, la suerte que tengo de poder vivir tan tranquilamente, de no conocer la pesadilla que atravesaron esas personas.Gran trabajo periodístico de la autora recopilando relatos durante 20 años, y se nota la calidad del ensayo presentado. Me gustó el libro pero es realmente deprimente así que hay que tomarse su tiempo para no desistir en el intento"}, {"userName": "João Carlos", "userReviewDate": "Feb 20, 2016", "userURL": "http://www.goodreads.com/user/show/17544299-jo-o-carlos", "userReview": "\"A morte é a coisa mais justa do mundo. Ninguém escapou pagando. A terra recebe toda a gente: os bons, os maus, os pecadores. À parte isso, não há nenhuma justiça nesta vida.\" (Pág. 59)Central Nuclear de Chernobyl 1986”No dia 26 de Abril de 1986, passavam 58 segundos das 1.23, uma série de explosões destrui o reator e o edifício que albergava o reator nº 4 da Central Nuclear de Chernobyl. A catástrofe de Chernobyl tornou-se o maior desastre tecnológico do século XX.” (Pág. 19) Na auto-entrevista publicada no livro Svetlana Alexievich refere: ”- Este livro não é sobre Chernobyl. Sobre o acontecimento em si, já se escreveram milhares de páginas e filmaram centenas de milhares de metros de película. Pois eu ocupo-me daquilo a que chamariam a história omitida, os sinais, sem deixarem sinal, da nossa permanência na terra e no tempo. Escrevo e recolho o quotidiano dos sentimentos, dos pensamentos das palavras. Tento captar a vida diária da alma. A vida de um dia comum de pessoas comuns. Neste caso tudo é incomum: o acontecimento e as pessoas quando se acostumavam a um novo espaço. Para elas, Chernobyl não é metáfora, não é símbolo, é a sua casa.” (Pág. 45 – 46)Prípiat - Ucrânia (30 de Setembro 2015) (Fotografia de Sean Gallup)Num dos relatos mais pungente e angustiante Liudmila Ignatenko, mulher do falecido bombeiro Vassili Ignatenko, que vivia em Prípiat, uma cidade a dois quilómetros da central Nuclear de Chernobyl, sintetiza contundentemente ”Vozes de Chernobyl”: ”Não sei do que hei de falar… Da morte ou do amor? Ou serão eles a mesma coisa… De qual devo falar?” (Pág. 25), terminando, ”As pessoas morrem, mas ninguém realmente lhes perguntou nada. Ninguém nos perguntou pelo que passámos. O que vimos… Ninguém quer ouvir falar da morte. Do que é assustador…Mas eu falei-lhe do amor… Do quanto amei…” (Pág. 44) Memorial dedicado às vítimas de Chernobyl - na cidade de Slavutych, Ucrânia (26 de Abril 2016) (Fotografia de Gleb Garanich)Decorridos mais de trinta anos sobre o trágico acidente as repercussões humanas e ambientais permanecem dramáticas, evoluindo em função dos nefastos efeitos nas pessoas e nos outros seres vivos, directa e indirectamente afectadas, decorrentes da contaminação radioactiva e da perpetuação das suas consequências.Prípiat - Ucrânia (28 de Março 2016) (Fotografia de Gleb Garanich) ”Vozes de Chernobyl – História de Um Desastre Nuclear” (publicado originalmente em 1997 e editado em Portugal em 2016) é um excelente livro de não-ficção, numa compilação de monólogos, uma história oral que agrupa inúmeros relatos de pessoas envolvidas ou afectadas pelo desastre nuclear, com repercussões catastróficas para diversas regiões e países, nomeadamente, para a Rússia, a Bielorússia e a Ucrânia. Imprescindível…Prípiat 1986- Prípiat 2015 - Ucrânia (Fotografia de Sean Gallup)Svetlana Aleksievitch (n. 1948) (Fotografia de Gordon Welters - The Guardian)Svetlana Aleksievitch, é uma escritora e jornalista bielorrussa, galardoada com o Prémio Nobel da Literatura em 2015 \"pela sua escrita polifónica, monumento ao sofrimento e à coragem na nossa época”. NOTA: a edição da Elsinore é primorosa. Adorei o papel - \"Coral Book Ivory 1.2 90\" - cor marfim."}, {"userName": "Bjorn", "userReviewDate": "Apr 24, 2013", "userURL": "http://www.goodreads.com/user/show/19667916-bjorn", "userReview": "The first interview is with the widow of one of the firemen who were sent in on the first day. He'd been shoveling radioactive sludge dressed in only jeans and a t-shirt, his skin turned grey over an afternoon, he literally fell apart within days. She caught cancer from sitting at his bedside as he died.The second interview is with a psychologist who lived through World War II in the Ukraine and still can't find anything that compares to working in the Zone.The third is with one of the old women who moved back a few years later, lives illegally in her little cottage out in the woods. What else is she supposed to do? The radiation can't be that bad if you can't see it.The fourth is with a father trying to explain how it feels to bury his daughter, dead from a disease that, officially, cannot exist.And so on and so on and so on.Voices From Chernobyl is one of the harshest reportage books I've read. Aleksievich doesn't try for objectivity, for a whole picture, for a rational explanation of the hows and whys and the why nots of what happened on 26 April 1986 outside Pripyat, Ukraine, and the aftermath. The coverups, the reassurances, the suicidal heroism, the disintegration of the USSR along with the people who had to keep on living on radioactive ground. Chernobyl is too big, she argues; its a trauma of mythical proportions, one whose full effect we don't even know yet (certainly not in 1997), it cannot be understood with mere numbers anymore than the Holocaust or the plague can, you need stories. So the book consists of only that; interviews, with Aleksievich's own questions removed, leaving only a chorus of disembodied voices identified only by their first name and a title. Some have enough distance to it to offer their ideas of how it could happen (blame communism, blame decadence, blame deep-rooted Russian fatalism, blame alcohol, blame...), while others cannot look away from their own memories. What it all means to them.The soldiers who dove, voluntarily, into the cooling tank to vent it manually. Dead now, of course.The people sent in with orders to find entire cities clean. Who measured lethal radiation in breast milk and could do nothing about it.The flag they raised over the reactor when the sanitation was supposedly finished, to celebrate the Soviet state's victory.The radiation annihilated it within days. So they raised another one.A joke: both the Japanese and the US donated experimental remote-controlled robots to be used in the cleanup. The Japanese robot lasted an hour before the radiation fried it. The US robot lasted three hours. The Soviet robot worked for 8 hours, then its commanding officer said \"Good work, Private Ivanov, you may take a break.\" The soldiers were told vodka was good for flushing the radiation out of your system.The teacher who thought she would be safe by only buying the most expensive food, surely that would be OK... until she found out that the officials had raised the prices on food from contaminated areas to make sure people ate less of that.The official who realised, to his horror, that the pits they dug to bury the tools and machines they used at the accident site were empty; everything sold on the black market, spread all around the Union, with no way to tell a highly radioactive tractor from a normal one.The mother, fighting desperately for the life of a daughter born without a lower body; forget walking, she can't even take a dump.And so on and so on and so on.It's not the book you should read to get an overview of what happened. It doesn't have any answers, any conclusions, its subjectis too big to do anything but start to outline the questions surrounding a trauma that, argues Aleksievich, hasn't been dealt with yet. 25 years on, 15 years after being written, it's probably in dire need of a sequel. But it is an absolutely bone-chilling documentary."}, {"userName": "Aubrey", "userReviewDate": "Jan 26, 2014", "userURL": "http://www.goodreads.com/user/show/4119460-aubrey", "userReview": "There's nowhere to hide. Not underground, not underwater, not in the air.\nI was born in the age of the known Chernobyl.\nEveryone found a justification for themselves, an explanation. I experimented on myself. And basically I found out that the frightening things in life happen quietly and naturally.\nWho are our fittest.\nIn Afghanistan death was a normal thing. You could understand it there.\nWho are our heroes.\nI didn't know we weren't allowed to love here.\nRabbits reabsorb their young when the conditions of the environment are unfit for propagation.\nI've thought a few times that someday they're going to start hunting the scientists the way they used to hunt the doctors and drown them in the Middle Ages.\nThe Death of God's a popular topic. How is the Death of Science coming along?\nYou're a writer, but no book has helped me to understand.\nPhilo. Love. Sophos. Wisdom. Radiation. Kodoku.\nWe're all—peddlers of the apocalypse.\nWe've outpaced our survival. No mutations yet for surviving nuclear winter, but we evolved enough to conceptualize the end of the world a millennium or two ago.\nBut the era of physics ended at Chernobyl.\nOne can find ethics in a lab if the expiration date of an engineered fatality is eternal enough.\nI'm the product of my time. I'm not a criminal.\nAnnihilating despair on the generational level's just a social construct, y'know.\nIt was the equivalent of 350 atomic bombs dropped on Hiroshima. They needed to talk about physics, about the laws of physics, but instead they talked about enemies, about looking for enemies.\nThe facts may be easier to remember, but the show must go on.\nWe'll show the whole world! But this is me, this is I. I don't want to die. I'm afraid.\nHumans are social creatures.\nEven the dead fear these dead.\nHumans are hierarchical creatures.\nThere are over 25 million ethnic Russians outside of Russia—a whole country—and there's nowhere for some of them to go but Chernobyl. All the talk about how the land, the water, the air can kill them sounds like a fairy tale to them. They have their own tale, which is a very old one, and they believe in it—it's about how people kill one another with guns.-Svetlana Alexievich."}, {"userName": "Panagiotis", "userReviewDate": "Jan 28, 2016", "userURL": "http://www.goodreads.com/user/show/4425898-panagiotis", "userReview": "Το βιβλίο το αγόρασα από την πρώτη μέρα που βγήκε. Με είχε φάει η περιέργεια να διαβάσω κάτι από τη γυναίκα που, με τη βράβευσή της με το Νόμπελ Λογοτεχνίας, έγινε αιτία αντιπαράθεσης ανάμεσα στους φίλους του βιβλίου, πυροδοτώντας μια συζήτηση για το πόσο μια συγγραφέας non-fiction βιβλίων είναι λογοτέχνης. Έτσι βρέθηκα εγώ, ο μανιώδης εραστής της μυθοπλασίας, που ζω για να ακούσω τον ευχαριστήριο λόγο του Κούντερα όταν επιτέλους του απονομηθεί το βραβείο, να υπερασπίζομαι το δικαίωμα της Σουηδικής Ακαδημίας που, με κριτήριο «την πολυφωνική της γραφή, μνημείο του πόνου και του θάρρους στην εποχή μας», να διαλέξει έναν συγγραφέα non-fiction. Κανείς σχεδόν από όσους γνωρίζω δεν είχε διαβάσει κάτι δικό της, κάποιοι μόνο είχαν περιτρέξει αποσπασματικά λίγα κομμάτια από το έργο της.Το «Τσέρνομπιλ» είχε πρωτοκυκλοφορήσει στα ελληνικά τον Απρίλιο του 2001 από τις Εκδόσεις Περίπλους. Το είχε δε προωθήσει με ιδιαίτερη επιμονή ο Σύλλογος Υποστήριξης Ερευνών κατά της Λευχαιμίας και άλλων Παθήσεων, μια οργάνωση εθελοντών για την ενίσχυση της Αιματολογικής Κλινικής του Νοσοκομείου Γ. Παπανικολάου της Θεσσαλονίκης. Οι άνθρωποι του συλλόγου ήρθαν σε επαφή με την Αλεξίεβιτς, η οποία παραχώρησε ευγενικά τα δικαιώματα για την πρώτη ελληνική έκδοση σε συνεργασία με τον εκδοτικό οίκο. Με δικά τους έξοδα η συγγραφέας ήρθε στην Ελλάδα για να παρουσιάσει το βιβλίο σε Αθήνα και Θεσσαλονίκη. Παρ’ όλα αυτά, από όσο γνωρίζω, οι παρουσιάσεις άφησαν τους πάντες αδιάφορους. Φαίνεται πως ο Απρίλιος του 1986 μας φαινόταν πια τόσο μακριά, το Τσέρνομπιλ και ο τρόμος που μας προξένησε είχαν πια κοιμηθεί μέσα στη μνήμη μας.Αλλά ας θυμηθούμε λίγο τα γεγονότα: την 26η Απριλίου του 1986, µία σειρά εκρήξεων κατέστρεψε τον αντιδραστήρα του τέταρτου ενεργειακού μπλοκ στον πυρηνικό σταθμό του Τσέρνοµπιλ. Το ατύχημα αυτό χαρακτηρίστηκε η μεγαλύτερη τεχνολογική καταστροφή του 20ού αιώνα. Ο τρόμος, καθώς το ραδιενεργό σύννεφο παρασυρόταν από τους ανέμους, κατέλαβε την Ευρώπη. Πολωνία, Γερμανία, Αυστρία, Ρουμανία, Ελβετία, βόρεια Ιταλία, Γαλλία, Βέλγιο, Ολλανδία, Μεγάλη Βρετανία, βόρεια Ελλάδα. Σε τρεις μέρες είχε φτάσει στην Τουρκία, στο Ισραήλ και στο Κουβέιτ. Σε μια εβδομάδα ανιχνεύτηκε στην Ινδία, στην Κίνα, στην Ιαπωνία, στις ΗΠΑ και στον Καναδά. Μεγάλη χαμένη της υπόθεσης ήταν η Λευκορωσία. Σήμερα, ένας στους πέντε ανθρώπους της χώρας ζει σε μολυσμένη περιοχή. Σε δύο επαρχίες της Λευκορωσίας τα ποσοστά θνησιμότητας υπερέχουν των γεννήσεων κατά 20%. Περί τα 240.000 εκτάρια έχουν τεθεί οριστικά εκτός καλλιέργειας, ενώ το 25% των δασικών εκτάσεων και πάνω από το 50% των εκτάσεων στις λεκάνες υπερχείλισης των κυριότερων ποταμών της χώρας είναι θανάσιμα μολυσμένα. Ο τέταρτος αντιδραστήρας, ο επονομαζόμενος «Ουκρίτιε» (καταφύγιο), έχει καλύφθεί με μια τσιμεντένια και μολύβδινη σαρκοφάγο. Μέσα του διατηρεί είκοσι τόνους πυρηνικών καυσίμων. Η σαρκοφάγος σήμερα έχει ρήγματα εκτάσεως 200 τετραγωνικών μέτρων. Κανείς δεν μπορεί να φανταστεί τι θα γίνει αν ξεπεράσει τα όρια αντοχής της.Ένα από τα όνειρά μου είναι να ταξιδέψω σε τόπους όπου η Ιστορία άφησε έντονα τα ίχνη της. Το Τσέρνομπιλ ήταν μέσα σε αυτούς τους προορισμούς. Διαβάζοντας το βιβλίο της Αλεξίεβιτς, έχασα κάθε επιθυμία.Η Σβετλάνα Αλεξίεβιτς έγραψε αυτό το βιβλίο το 1996. Θεώρησε καθήκον της να μπει στην απαγορευμένη ζώνη και να δώσει φωνή στους ανθρώπους που τσάκισε η ιστορία μέσα στα σαγόνια της. Κατέγραψε τις μαρτυρίες εκατό ανθρώπων, που ήταν μάρτυρες της ίδιας της Αποκάλυψης. Μιας Αποκάλυψης αδιανόητα ζοφερής για την ανθρωπότητα:Λίγο προτού αρχίσει η εκκένωση της πόλης Πριπιάτ και καθώς απλωνόταν ο όλεθρος, κάποιοι είχαν κρεμαστεί στα μπαλκόνια τους —με μια ανατριχιαστική και ασύνειδη παραφορά— για να δουν την καταστροφή. Αργότερα ανακαλούσαν εκείνη την εντυπωσιακή εικόνα, εκείνο το πορφυρό φως. «Ήταν η όψη του θανάτου. Αλλά δεν μας είχε περάσει ποτέ από το μυαλό ότι ο θάνατος θα μπορούσε να δείχνει τόσο όμορφος». Εκείνες τις στιγμές μάλιστα προέτρεπαν οι ίδιοι τα παιδιά τους να παρατηρήσουν το θέαμα: «Ελάτε να δείτε, θα το θυμάστε μέχρι το τέλος της ζωής σας». Είναι τρομακτικό αλλά εκείνοι οι άνθρωποι θαύμαζαν την όψη του δικού τους αφανισμού.Αλλά η Σβετλάνα Αλεξίεβιτς δεν αρκέστηκε απλώς στην καταγραφή. Στο βιβλίο φαίνεται το ταλέντο της. Η απομαγνητοφώνηση των μαρτυριών έγινε υλικό για να σχηματιστούν μονόλογοι διαμάντια. Θα ήθελα να τους δω παιγμένους στο θέατρο. Κάθε μαρτυρία μεταμορφώθηκε σε ένα ολιγοσέλιδο διήγημα πικρής ομορφιάς. Κάποιες μαρτυρίες είναι ομαδοποιημένες και εκεί βρίσκεις παραγράφους που θα έπρεπε να διδάσκονται στα σχολεία. Η Αλεξίεβιτς εκμεταλλεύτηκε τους αφηγηματικούς τρόπους της λογοτεχνίας στην ερευνητική δημοσιογραφία, αφήνοντας ένα εντελώς προσωπικό στίγμα στο είδος. Όπως λέει και η ίδια: «Δεν καταγράφω στεγνά μια ιστορία γεγονότων, γράφω μια ιστορία των ανθρώπινων αισθημάτων». Πολλοί κατατάσσουν το βιβλίο της δίπλα στην Άννα Φρανκ και τον Πρίμο Λέβι, όπως αναφέρεται στο οπισθόφυλλο. Τελειώνοντάς το, τους κατανοώ απόλυτα.Να σας μιλήσω για την αγάπη ή για τον θάνατο; Δεν ξέρω… μήπως είναι τελικά το ίδιο;… Κανείς δεν θέλει να ακούσει για τον θάνατο. Κανείς δεν θέλει να αντικρίσει τον τρόμο… Εγώ όμως σας μίλησα μόνο για την αγάπη. Για το πόσο αγάπησα…Το βιβλίο σού ξυπνά πολύ έντονα συναισθήματα οργής, λύπης. Μερικές μαρτυρίες είναι τόσο τραγικά σαρκαστικές, με μια λεπτή ειρωνεία που σε ξεπερνά:Ταξιδιωτικό γραφείο του Κιέβου οργανώνει εκδρομές στο Τσέρνομπιλ. «Περιλαμβάνεται ο γύρος των εγκαταλειμμένων πόλεων. Τιμές εξαιρετικά συμφέρουσες… Επισκεφθείτε τη Μέκκα της πυρηνικής ενέργειας». Εφημερίδα Ναμπάτ, Φεβρουάριος 1996.Αυτό το βιβλίο πρέπει να διαβαστεί από όλους, ακόμα και από αυτούς που δεν μπαίνουν καν στον κόπο να διαβάσουν την ημερομηνία λήξης των τροφίμων που αγοράζουν."}, {"userName": "Nasia", "userReviewDate": "Oct 17, 2017", "userURL": "http://www.goodreads.com/user/show/11586431-nasia", "userReview": "Μόλις 10 χρόνια μετά το καταστροφικό αυτό ατύχημα στο Τσέρνομπιλ η Αλεξίεβιτς αναλαμβάνει να δώσει την πλευρά των παθόντων στην δημοσιότητα μπαίνοντας στην απαγορευμένη ζώνη και δίνοντας μια γροθιά στο στομάχι όλων όσων διαβάζουν αυτό το βιβλίο. Βρήκα τον εαυτό μου να δυσκολεύεται να το διαβάσει, να θέλει να το παραμερίσει, να το αποφεύγει, όχι γιατί δεν ήταν άξιο διαβάσματος αλλά γιατί παραήταν αληθινό και ανατριχιαστικό."}, {"userName": "Jadranka", "userReviewDate": "Nov 21, 2015", "userURL": "http://www.goodreads.com/user/show/12277740-jadranka", "userReview": "Nuklearna katastrofa koja se dogodila u Černobilju, 26. aprila 1986. godine, smatra se dosada najtežom nesrećom koja je pogodila neku nuklearnu elektranu. Moje prvo sećanje u vezi sa ovim događajem odnosi se na reportažu na RTS-u povodom obeležavanja deset godina od ove nuklearne katastrofe. Sećam se da sam sa mamom i tatom gledala televizijsku emisiju, i ono što mi je mama u tom trenutku rekla ostalo mi je urezano u pamćenju. Rekla je kako je nakon eksplozije u Černobilju bilo objavljeno upozorenje da se ne jede sveže povrće iz bašte, posebno mlada zelena salata koja je tada stizala. Kako živim u prigradskom naselju, baka, a kasnije i mama, trudile su se da uvek imamo svežeg sezonskog povrća iz bašte. Te godine sav njihov trud bio je uzaludan, a po rečima nekih, zelena salata godinama nije bila tako lepa. Roman Svetlane Aleksijevič \"Černobiljska molitva\" predstavlja pre svega zbirku tekstova dokumentarnog sadržaja o najvećoj nuklearnoj katastrofi do sada. Kako strašno zvuči ovo \"do sada\", zar ne? Autorka temi pristupa na žurnalistički način, i sam roman zapravo više podseća na skup reportaža i intervjua, a na njemu je radila desetak godina. Njeni sagovornici bili su stanovnici Černobiljskog regiona, posebno stanovnici gradića Pripjat, i brojni učesnici u otklanjanju posledica havarije, odnosno članovi njihovih porodica.Grad Pripjat se nalazi na krajnjem severu Ukrajine, u blizini granice s Belorusijom. To je bio grad u kojem su živeli zaposleni u nuklearnoj elektrani Černobilj. \"Živeli\" jer sada je to grad duhova, u kojem je život praktično nemoguć. Pravilo da se ne prelazi granica zaštićene zone i danas se poštuje iz straha, ali postoji mali broj ljudi koji se oglušio o ovu zabranu. To su černobiljski „samodoseljenici“ koji su se na sopstveni rizik vratili u svoja sela i domove.U pojedinim izveštajima se navodi da je na samom kraju, katastrofa u Černobilju, otpustila oko 100 puta više radijacije nego obe atomske bombe bačene na Hirošimu i Nagasaki. Neposredno nakon nuklearne havarije, sovjetske vlasti pokušale su da kod sopstvenih građana, ali i u inostranstvu održe utisak da se ništa značajno nije desilo. Sama činjenica da je vlast pokušavala da ovako nešto prikrije, svesno rizikujući zdravlje nebrojenog stanovništva, pojednako mi je strašna kao i sama nuklearna katastrofa koja se desila. Ne mogu reći da je \"Černobiljska molitva\" remek-delo svetske književnosti, niti mogu da pohvalim njegovu umetničku vrednost. Reč je o poprilično slojevitom delu, koje nisu zaobišle ni dnevno-političke kontroverze, posebno pošto je Svetlana Aleksijevič dobila Nobelovu nagradu za književnost 2015. godine, nakon čega je krenula rasprava o njenoj nacionalnoj pripadnosti, odnosno glavna tema je postalo pitanje čiji je ona pisac, s obzirom da je poreklom iz Belorusije, a piše na ruskom jeziku.Iskrena da budem, ne mogu da kažem da roman zaslužuje 5* sa koliko sam ga ocenila, ali imajući u vidu tematiku romana, nisam mogla da prenebregem činjenicu koliko je važno da ovo delo pronađe put do što većeg broja čitalaca, posebno onih koji o katastrofi u Černobilju znaju jako malo, ili gotovo ništa. Na samom kraju romana, autorka navodi da, iako ljudi u predelima oko nuklearne elektrane još uvek ne mogu da žive, ukrajinska vlada je pre nekoliko godina, otvorila zabranjenu zonu za turiste. Od tada, lokalni vodiči predvode ture koje posetiocima predstavljaju bogatu černobiljsku divljinu, ali i potpuno napuštene gradove, kao npr. Pripjat. Možete misliti, nuklearni turizam?! Da li ćete ovu knjigu pročitati ili ne, vaš je izbor. Da li ćete \"Černobiljsku molitvu\" posmatrati kao još jedan u nizu političkih pamfleta, ili kao svedočanstvo jednog vremena, vaš je izbor. Ono što svima, koje ova tematika zanima, mogu da preporučim jeste da vam ovo ne bude jedini izvor informisanja. Na internetu se mogu naći izuzetno dobri i informativni članci o dešavanjima u Černobilju, i to kako o uzrocima koji su doveli do nuklearne katastrofe, tako i o njenim posledicama, a snimljen je i veliki broj dokumentarnih filmova. Jer ovo nije tema o kojoj se ćuti, i ovo nisu priče koje vreme treba da pregazi. Mislim da toliko dugujemo jedni drugima."}, {"userName": "Banushka", "userReviewDate": "May 12, 2017", "userURL": "http://www.goodreads.com/user/show/47013915-banushka", "userReview": "başındaki ve sonundaki bölümlerde ağlamayan olur mu acaba, çok merak ediyorum.bu kitabı okuyup nükleer enerjiyi savunan olur mu, onu da çok merak ediyorum.\"bize bir şey olmaz.\" \"hep dış mihrakların oyunu.\" \"halkımız merak etmesin, her şey kontrol altında.\" \"provokasyonlara gelmeyin.\" \"her şey halkımızın iyiliği için.\"bu cümleler tanıdık geldi mi?daha neler neler...insanın aklı almıyor.bu sene yaptığım en iyi şeylerden biri, aleksiyeviç'leri okumaktı. çok yaşasın, çok yazsın.keşke bizi de yazacak biri olsa, onun gibi, onun tarzıyla... yaşananlar tarihe not düşülse.ağlaya ağlaya okuduğum kitabın ağlayarak yazdığım yazısı: http://tembelveyazar.blogspot.com.tr/..."}, {"userName": "Edward", "userReviewDate": "Apr 27, 2017", "userURL": "http://www.goodreads.com/user/show/5895486-edward", "userReview": "Some historical backgroundA lone human voiceThe author interviews herself on missing history and why Chernobyl calls our view of the world into question--Chernobyl Prayer: A Chronicle of the FutureA lone human voiceIn place of an epilogue"}, {"userName": "Susan", "userReviewDate": "May 05, 2016", "userURL": "http://www.goodreads.com/user/show/5837456-susan", "userReview": "This is a moving, often harrowing, oral history of the disaster at Chernobyl in 1986. It begins with the story of the young, pregnant wife of one of the first fire fighters, who responded to the fire at Reactor 4 of the Chernobyl nuclear power plant and of his slow, untimely death. This is hard to read, but also extremely humbling. The author allows the words of those who lived, and many who still live, in the affected areas to tell their own story. It is a catalogue of trauma – of lives which were disturbed by events so cataclysmic that the effects rippled around the whole planet.Imagine that you are sitting at home, browsing through books on the internet, when you are told that you need to leave your home within the next two hours. You can take only a small amount of items with you – one bag. Yet the sun is still shining and the danger is unseen. Would you be happy to go? Would you refuse to leave? Would you realise that, when you closed your front door, you would never return?Many of the locals affected by Chernobyl left their lives with no idea they would not go back. They abandoned houses, jobs, pets. Once they arrived at their destination, their luggage was taken – often buried. Houses, villages, were left abandoned, or buried in the earth. Yet people did return. One man actually reclaimed his front door – which his family had always laid the bodies of their dead relatives – snatching it in the night and taking it, like a thief, through the woods. Others did return; finding that relatives rejected them or they were tainted by association with the place they came from. Better to face an unseen enemy than to be exposed to constant taunts and fears. Others fled war zones, or racial intolerance, for the relative peace of this deserted area.This is a tragic book, but an important one. It tells not only of the tragedy of the disaster, but of the aftermath. Of illness, death, birth defects, the loss of loved ones, the way the disaster was not dealt with effectively and of the heroism of those who went in, trustingly, to try to stop the unbelievable being even worse. One man, who worked at the plant, knew his wife and daughter were out and about in the town. Should he call, and warn them, or take the party line and pretend nothing was wrong? He called – then he went home and called everyone he could contact. Undoubtedly, he saved lives, but so many lives were lost and the effects are certainly still affecting so many people today. I found this a hard read, but I could not put it down."}, {"userName": "Raya راية", "userReviewDate": "Mar 07, 2018", "userURL": "http://www.goodreads.com/user/show/23224678-raya", "userReview": "\"أكثر ما يبقى في ذاكرتك عن تشرنوبل هو الحياة \"بعد كل ما حدث\": حاجيات من دون إنسان، منظر طبيعي من دون إنسان. الطريق لا يصل إلى أي مكان، الأسلاك ممتدة ليس إلى مكان. لا، نعم وتفكّر، ما هذا –ماضٍ أم حاضر؟-يُهيأ لي أحيانَا أنني أُسجل المستقبل..\"\n\n•\tيوم السبت، 24 نيسان/أبريل 1986، مدينة تشرنوبل، الاتحاد السوفييتي. •\tانفجر القسم الرابع من مفاعل محطة تشرنوبل النووية.•\tتراكم الأخطاء وقلة خبرة العاملين بالمفاعل أدت إلى انفجاره.•\tأكبر في التسرّب الإشعاعي والتلوث البيئي شهدتها البشرية حتى الآن. •\tمدن منكوبة، تهجير سكان القرى، آلاف الضحايا الذين لقوا مصرعهم في محاولة درء آثار هذه الكارثة، آلاف المرضى بالسرطانات، والمواليد المشوّهين خلقيًا.-------------------في هذا الكتاب، نرى الكارثة في عيون مئات الشهود: زوجات رجال الإطفاء الذين شاركوا في إخماد حريق المفاعل، سكان القرى المجّرة، مدرسّون، مؤرخون، فيزيائيون، مزارعون، جنود، جدّات، أطفال رؤساء لجان، مصّورون.. نرى الآلام والصدمات والكوارث وشهادات أناس رأوا بعيونهم ماذا حدث!--------------------- يطلبون من الناس أن يحاربوا وينتصروا –كما انتصرنا على الألمان النازيين-! يحاربون من؟ ينتصرون على من؟ على الإشعاعات؟ على البيكرل؟ على الكيوري؟ على الرونتجن؟ هم حتى لا يعرفون ما هذه الأسماء وعلى ماذا تدل!------------------نرى حجم هذه الكارثة، نرى خداع السلطات وكذبها، ونرى المصائب واللعنات التي حلّت بكل من عمل على درء آثار الكارثة! شيء لم يكن يومًا في حسبان الناس ولا حتى في خيالهم، شيء لم يعرفوه يومًا، لم يقرؤوا عنه، لم يتعلّموه! بلا سابق إنذار، وفي لحظة ما، تغيّرت حياة ملايين البشر، تغيّر وجه العالم بعد تشرنوبل، انفجر تشرنوبل وانفجرت معه الشيوعية والاتحاد السوفييتي. ---------------------ألم شديد خلّفه هذا الكتاب في نفسي، وشعور طاغٍ بالحنق، على من؟ لست أدري! هل على العلماء؟ أم على العلم؟ أم على التخاذل؟----------------في بيتنا يوجد لوحة صغيرة أحضرها والدي من بيلاروسيا، وكما نعلم بأن بيلاروسيا من أكثر البلدان السوفييتية تضررًا بكارثة تشرنوبل-، حين أنظر للوحة الجميلة التي تصوّر غابةً خضراء ونهرًا صغيرًا، أسائل؛ هل يا ترى تكون هذه الغابة الجميلة مُشعّة! هل تكون ثمارها سامة ويكون نهرها ملوثًا؟! \nآهٍ يا أرضنا المسكينة كم دمرناكِ!-------------الكاتبة والصحفية سفيتلانا ألكسدروفنا أليكسييفيتش، تستحق من الجميع كل التحية والإكبار على جهودها الجبارة في جعل العالم يرى الكارثة من وجهة نظر من شهدوا عليها....."}, {"userName": "Filipe Miguel", "userReviewDate": "Dec 31, 2016", "userURL": "http://www.goodreads.com/user/show/5855795-filipe-miguel", "userReview": "Chernobyl, Pripyat, Ucrânia, EuropaMiscelânea de testemunhos das vítimas, familiares das vítimas, conhecidos das vítimas ou individuos que, directa ou indirectamente, lidaram com vítimas do desastre nuclear.Svetlana Alexievich apresenta-nos as vozes de quem por dentro viveu o drama de 26 de Abril de 1986 e subsequentes anos, décadas.Com mão de ferro, a autora não se inibiu na prosa, pincelando a tela com suavidade onde deveria ter contornos dóceis e esborratando-a, violentamente, de forma crua, onde se impunha um pincel mais bruto, mais cruel.Aqui e ali em círculo, parecendo repetir o anteriormente lido, acolá trazendo novas vozes, novos assuntos, novas perspectivas. «As Vozes de Chernobyl» não são de \"audição\" fácil. Exigem dedicação, perseverança. No final fica o amargo de lermos sobre vidas destruídas, mas também o alerta para as consequências do poder desmedido do Homem.\"Alguns vinham de lugares a dezenas de quilometros, chegavam de carro, de bicicleta, só para assistir aquilo. Não sabiamos que a morte podia ser tão bela. Eu não diria que não tinha cheiro. Não era um aroma de primavera ou de outono, mas algo completamente diferente, não era aroma de terra. Não... Picava a garganta e fazia os olhos lacrimejar\"Nota: 4.0/5.0"}, {"userName": "Ahmed", "userReviewDate": "Jul 24, 2016", "userURL": "http://www.goodreads.com/user/show/11260920-ahmed", "userReview": "نيتشه كان بيقول إن اللي بيبقى من الإنسان ما يكتبه بدمه،والكاتبة لم تكتب فقط بدمها،بل كتبت بكل ما تملكه من حياة وعرق ودموع ودماء وروح،كتبت لتبقى كتاباتها لعنة تلاحق الإنسان.وقال الله ليكن الإنسان في الأرض،وليكن معه الفساد والظلام والهلاك والدمار والدماء،ولتكن الطبيعة وكوارثها أحن على الإنسان من نفسه عليه،ولتُتضرب لنا الأمثلة على أن اختراعات البشر قادرة ليس فقط على إبادته،بل تكون قادرة على تشوية فطرة الخالق في كونه،فكانت الحروب أسوأ اختراع إنساني وُجد،وعندما لا يجد الإنسان من يحاربه يحارب نفسه.قصتنا هذه ليست مجرد قصة تتناولها الشفاه وترويها الألسنة وتتكاتبها الصحف والأقلام،بل هي المآساة الأزلية،مآساة الإنسان،أراد الكمال فاقتحم عالم يجهله سعيا وراء كماله،وكانت النتيجة كارثة اقشعرت منها الطبيعة وعجزت على أن تأتي مثلها،ملايين البشر تغيرت حياتهم للأبد،ومناطق فقدت كل ما كان يربطها بالحياة،كل ذلك لأن الإنسان يسعى لكمال مهزوم في النهاية.طبعة الرواية رديئة والورق نفسه سئ،ولكن ما كُتب على ذلك الورق يشفع لأي شئ،فما كُتب كانت قصة حياة أُزهقت وطبيعة فُسدت،ومعاناة إنسانية لا مثيل لها.رواية مؤلمة كما ينبغي للألم أن يكون،لا تنتمي لتلك النوعية التي تستخدم الألم بابتذال كوسيلة للتأثير على القارئ واستبزاز لعاطفته،بل هي مجرد حقيقة ،حقيقة الألم."}], "description": "Winner of the Nobel Prize in LiteratureOn April 26, 1986, the worst nuclear reactor accident in history occurred in Chernobyl and contaminated as much as three quarters of Europe. Voices from Chernobyl is the first book to present personal accounts of the tragedy. Journalist Svetlana Alexievich interviewed hundreds of people affected by the meltdown---from innocent citizens to firefighters to those called in to clean up the disaster---and their stories reveal the fear, anger, and uncertainty with which they still live. Composed of interviews in monologue form, Voices from Chernobyl is a crucially important work, unforgettable in its emotional power and honesty.", "title": "Voices from Chernobyl: The Oral History of a Nuclear Disaster\n      \n          (Голоса утопии #4)", "url": "http://www.goodreads.com/book/show/357486.Voices_from_Chernobyl", "average": 4.43, "cover": "https://images.gr-assets.com/books/1316637138l/357486.jpg", "reviews": 2148, "authors": [{"url": "https://www.goodreads.com/author/show/7728207.Svetlana_Alexievich", "name": "Svetlana Alexievich"}, {"url": "https://www.goodreads.com/author/show/39840.Keith_Gessen", "name": "Keith Gessen"}, {"url": "https://www.goodreads.com/author/show/14773334.Svetlana_Aleksijevi_", "name": "Svetlana Aleksijevič"}, {"url": "https://www.goodreads.com/author/show/14529042.Alma_Lapinskien_", "name": "Alma Lapinskienė"}], "type": ["Nonfiction", "History", "Cultural", "Science", "Nobel Prize"], "outlinks": ["http://www.goodreads.com/book/show/357486.Voices_from_Chernobyl", "http://www.goodreads.com/book/show/1116094.Voices_from_Chernobyl", "http://www.goodreads.com/book/show/27778352-voces-de-chern-bil", "http://www.goodreads.com/book/show/29675406-chernobyl-prayer", "http://www.goodreads.com/book/show/34855528-ernobil-duas---gelece-in-tarihi", "http://www.goodreads.com/book/show/24799164-voces-de-chern-bil", "http://www.goodreads.com/book/show/26882851-tschernobyl", "http://www.goodreads.com/book/show/30107995", "http://www.goodreads.com/book/show/29499480", "http://www.goodreads.com/book/show/30307451", "http://www.goodreads.com/book/show/29217313-vozes-de-chernobyl", "http://www.goodreads.com/book/show/28272856", "http://www.goodreads.com/book/show/32296255", "http://www.goodreads.com/book/show/30180880-ernobiljska-molitva", "http://www.goodreads.com/book/show/29440004-chernobyl-prayer", "http://www.goodreads.com/book/show/4025275-war-s-unwomanly-face", "http://www.goodreads.com/book/show/23342906-czasy-secondhand-koniec-czerwonego-cz-owieka", "http://www.goodreads.com/book/show/5586087-zinky-boys", "http://www.goodreads.com/book/show/17257133-ostatni-wiadkowie-utwory-solowe-na-g-os-dzieci-cy", "http://www.goodreads.com/book/show/26927251"]}