{"ratings": 7208, "userreviews": [{"userName": "Jasmine Marie", "userReviewDate": "Feb 17, 2016", "userURL": "http://www.goodreads.com/user/show/34960364-jasmine-marie", "userReview": "*4.5*I don't know what it is about these books, but I always finish them within a few days. Even this 600+page book. I think this is my favorite book in the series. And a lot of it had to do with the different POV's. In this story we get Mare (duh), Evangeline, Iris, Cal, and Maven.Mare- I had saw reviews for the previous books stating that they didn't like Mare and that she was annoying and stuff. And I didn't notice it in the first two books, and not even in the third book, but damn I was so annoyed with her in this book! She was so petty that I didn't want to be petty anymore-and I love being petty. Like honey, sweety, it isn't that deep. Her POV was my least favorite and I was always looking forward to the other POVs more.Evangeline- Her POV was definitely a highlight for me in King's Cage. And one I looked forward to in this book. It was interesting to see her relationship between her family, her lover, Mare, and Cal. I do wish we got more background information about Elaine, since we don't know much about their history. But Evangeline's POV provided some pretty cool action scenes. I think it was her chapter where there was a Silver duel out on the Harbor that was so intense and one of my favorite scenes from the book.Iris- MY FAVORITE. She was so facinating to me! She's a Silver princess from the Lakelands. So that makes her a double threat-one against the Scarlet Gaurd and Norta. She was cunning, wicked, clever, but also a little remorseful. Her chapters also provided some awesome action scenes. Not gonna lie, I did ship Iris and Maven... That one scene where Maven said they made a good match MY HEART Cal- Now I do like Cal, I used to love him. He didn't do anything wrong in my eyes, but I lost interest in this series in the past year so for my love for him faded away. But nothing much really happened in his POV. It was pretty much thinking about his mother (aw), Maven (aw), and his role as king. I think he only had about 2-3 chapters. I don't think his chapters were really needed. We do get a little snippet from the prequel novella to the series, Queen Song. You don't need to read that novella, but I loved that novella so much and have read it a few times-one of my favorite novellas ever!Maven- Maven, Maven, Maven. His was also a POV I adored, but like Cal's, we only got about 3 chapters from him. I hated him in Red Queen, mainly because he was the rival to the Mare/Cal ship and he just had to face my wrath. Plus, he seemed too nice and too trustworthy HAHAHA ya girl called his backstabbing ass!! Anyways. It wasn't until KC where I actually liked him and in this book he became my baby. And it was really depressing to read his POV. He's really messed up. He's also a good actor, able to hide his emotions and draw raw emotions out of others easily. Sometimes I was impressed, other times I was sad.I also want to give a shoutout to Julian Jacos. I feel like he's one of those characters that was always forced into the background, but he had his chance to shine in this book. And I think a lot of that had to do with the fact that we got more Silver perspective in this book. We're always told how cunning Silvers can be, how they always have to appear deadly around court. So I think that's why we saw a more wicked side to Julian, because he had to be scarier than the other Silvers. He was always one of my favorites, so I'm happy to have seen more of him.So I took a half star for two reasons. 1). Mare and 2.) the endingTo me, the ending was really predictable. I honestly knew it was coming for years (which probably explains my hopes for the series, you just got to scroll down if you want to see it). If you feel like you know what's going to happen... Then you're probably right. But I did like how the ending was kind of an open ending, I feel like that's the best way for dystopian books to end, especially when dealing with overthrowing a form of government. Rebuilding takes years, and I don't think anyone wants to read another four books about how Norta is rebuilt. Though I wouldn't be surprised if there is a spin off, especially if it deals with the Lakelands.what was the point of Kilorn?And thank you to anybody who has ever liked the review I wrote below over the last two years. I never expected for 700+ people to like it. It honestly blows me away on how many people have liked and left a comment. So thank you!!*******************************************************************************2/1716: I hope by the end of this series that Cal gets to be the King. That him and Mare end up together and rule the kingdom in the right way. I would be super happy if the book ends like this: Cal is my Silver King. And I am his Red Queen."}, {"userName": "Virginia Ronan ♥ Herondale ♥", "userReviewDate": "Feb 16, 2018", "userURL": "http://www.goodreads.com/user/show/69106439-virginia-ronan-herondale", "userReview": "Maven, Maven, Mavenmore Maven that's all I need!!!I don't careabout Mare.Don't give a damnabout Calthat caveman!I couldn't care lessabout Kilornthat little a...Maven, Maven, Maven more Maventhat's all I'm living for!!!Maven, my precious Maven,I hope you liked my lore! *bows* And I'm out! <333"}, {"userName": "Andreea Pop", "userReviewDate": "Dec 22, 2015", "userURL": "http://www.goodreads.com/user/show/4858513-andreea-pop", "userReview": "A bit late to the party of cover love (I blame life for this, I'm sorry) but omg THAT. COVER. And the TITLE. Blood both red and silver on that absolutely beautiful yet terrifying crown. My new aesthetic. ***I'm scared, I'm scared, I'm scared. This book better be bloody brilliant and all my sweet cinnamon rolls better end the series alive and safe and happy and in love. Even though I'm currently a mess, I trust Victoria Aveyard will do her magic and all will be well. \nOr else I'll drown in my own tears. And I'm not even going to blame Aveyard for it. I'M GONNA BLAME TIBERIAS FKING CALORE."}, {"userName": "Melissa", "userReviewDate": "Jan 23, 2016", "userURL": "http://www.goodreads.com/user/show/25265945-melissa", "userReview": "EDIT 14/09: WE GOT THE TITLE!! 'WAR STORM' sounds so badass tbh.WHEN DID THIS HAPPEN OMFGFOUR BOOKSF-O-U-R BOOKS THIS SERIES IS GOING TO KILL ME"}, {"userName": "Cindy ✩☽ Savage Queen ♔", "userReviewDate": "Jul 23, 2017", "userURL": "http://www.goodreads.com/user/show/3222333-cindy-savage-queen", "userReview": "Rise. And rise alone.  Red Queen was the book that fully immersed me into the YA book world. Taking me from an occasional reader to a full-on bookaholic. For that, it will always have a special place in my heart. Let's start with saying this book is monstrous in size compared to its predecessors. But fortunately, it never feels excessive and it doesn't needlessly drag on. This series has been a tumultuous journey and this book is no exception. CharactersMare \nShe did it. Mare did exactly what I had hoped she'd do. She chose the revolution. Though I do question some of her other choices later in the book she continually stood firm when it mattered. Cal How I felt about Cal most of the book\nIt's important to note, Cal is not a bad person. He is just so rooted in his beliefs, and the way for his people that he is unable to fully embrace the change, the revolution, his country needs to undergo. He does ultimately do the right thing though so I guess I have to give him some credit for that. But I can't escape that linger feeling that if the tides had been in his favor he would've ridden that wave and stayed the course. Maven \nI know it’s completely irrational, but I still had this desperate hope that somehow, someway Maven would redeem himself. Show some sliver of goodness, of the person he could’ve been if his mind hadn’t been poisoned. But instead, Ms. Aveyard just doubles down on Maven's villainy. Honestly, it almost felt like a bit of a regression in terms of his character development. In King's Cage, we had Mare seeing Maven as a broken young man. A victim of mind manipulation, with which he had no say, who felt completely and utterly alone. And honestly, it made me feel for him. He was a monster, but not one of his own making. However, in this book, despite the addition of Maven's POV, rather than further establish or understand his brokenness. We are lead to believe, at least in some instances, that Maven chooses to remain this monster? It doesn't make sense. If Elara mind manipulation is so complete and irrevocable there shouldn't be a choice. Evangeline Never thought I'd say it but...\nHonestly, it's amazing what some perspective can do for a character. I never cared for Evangeline in the first book, but as the series went on her actually become one of my favorite characters. Like most of the others, she was a product of her environment. Being able to see things from her point of view gave me a much greater appreciation of her and everything she has been through. Iris \nWhat can I say, she's the enemy. So hating her is a given. RelationshipsMare & CalI think a lot of people will be disappointed, but personally \nMaven & MareThis relationship has always been my favorite. From friends, to love interests, to enemies they always had the most interesting dynamic. But I don't think I alone in saying that I found their end disappointing. Cal & Maven We finally got Cal and Maven's perspectives in this book, yet we did not get a single brother only discussion or confrontation? I call BS! Ugh...such a missed opportunity. \nMare & Evangeline This friendship, or at least cease-fire, was unexpected but rather delightful. Two strong women who have been deeply shaped by their circumstances, coming together against all odds and developing an understanding and appreciation of each other. I'm here for it!Cal & Evangeline These two have been thrown together time and time again. Two high houses of Norta looking strengthen their hold on the nation with a political marriage. Neither of them ever wanted the other. It was simply what was expected of them by their families. But by books end, I think they did have a mutual respect for one another and how similar they really were. The ending was not what I expected. In a way, it's what I thought I wanted. And in many ways, it is a fitting end. But it also doesn't truly feel like an ending? It feels like the sort of end that actually marks a beginning. As though this story is not actually over. Does that make sense?"}, {"userName": "Pang", "userReviewDate": "Oct 27, 2015", "userURL": "http://www.goodreads.com/user/show/10517119-pang", "userReview": "[Maven (hide spoiler)]"}, {"userName": "Rachel E. Carter", "userReviewDate": "Jan 12, 2017", "userURL": "http://www.goodreads.com/user/show/29482005-rachel-e-carter", "userReview": "[Mare + Maven as HEA (like Warner and Juliette from Shatter Me) where he redeems self and his brother rules country (hide spoiler)]"}, {"userName": "Hamad", "userReviewDate": "May 16, 2018", "userURL": "http://www.goodreads.com/user/show/54464244-hamad", "userReview": "Full review and other non-spoilery reviews can be found HereWar Storm??! more like Clouds with drizzle!For a book this big (almost 700 pages), with this cover, name and the fact that it is a finale, you would expect it to be so action-packed and interesting. Actually this dragged on way more than necessary, I thought it was something in me so I asked my reading buddies and they were not enjoying it so much too!The fact that almost nothing important happens till chapter 20 made me consider DNFing this many times, I pushed my way through it but the final result was still complete disappointment!Here is a non-spoilery summary of what this book is like (Skip it if you haven't read King's cage):Maven: Mare and Cal, I love you both and I want to kill you both :DMare: Maven ❤️... No, No... Cal ❤️...(He should apologize or I will keep being a *****) Maven ❤️... No, he's hopeless... Cal ❤️ (I wish he would bring back that long chestnut hair), Maven ❤️....Cal: I want the crown, I want Maven, I want Mare but the crown is more important!Evangeline: Elane ❤️🤤Iris: I want the whole world... Nymph rocks!Farley: Was I even pregnant?Kilorn: Am I even important anymore?Cameron: I got my own POV last book, let me become useless now 😌Jon: Fate and future and stuff... Bye 👋Mare's family: please don't leave again *Mare leaves again* Hugs and cries, *Mare comes back* Hugs and cries, please don't leave again ...etcShort \"fighting scenes\"the end A buddy read with Mare & Evangeline"}, {"userName": "Cesar", "userReviewDate": "Jun 13, 2017", "userURL": "http://www.goodreads.com/user/show/34467577-cesar", "userReview": "2 starsI have finally finished the Red Queen series and my overall thoughts: Meh.My thoughts on this book?I knew from the start that I would not enjoy War Storm based on so many flaws I had with the series. I actually checked on both amazon and goodreads and I saw a lot of people not being happy with how it ended. And I can say that they were right. The ending was so disappointing, especially since we had to read four books to get where we are now in the finale.This \"War Storm\" was nothing more than a light drizzle that lasts for 5 minutes.If you've seen my previous reviews on the Red Queen series, you would know that I lean more on the meh to downright hating the series. I sort-of liked Red Queen, Glass Sword was somewhat tolerate but still had flaws, I did not like King's Cage, and surprise surprise, I did not like War Storm. This has got to be by far the most mediocre series I have read. I am not holding back on my thoughts on this review. I am unleashing my inner Khanh and spilling all the tea. I will be splitting my review into two parts. Part one is my thoughts on War Storm and the second part is my retrospective thoughts on the series as a whole. War Storm is like a gymnast performing a routine. Their routine is flawed at the beginning and at the middle. But they fail on the end. That is what I pictured War Storm as I read it. We're talking about a book that is nearly 700 pages and this is the best it could come up with. Disappointment after disappointment, especially with the plot and characters. There's no shock that Mare is her usual annoying, bratty self along with the other characters being boring or just annoying. I had to endure over 657 pages of slow pacing and annoying characters. It was a miracle I even bothered to finish this considering how much I despise Mare. Even most of my friends gave up after Glass Sword because they could not stand Mare. But I'm finally done.This review will be spoiler free.Now, let's talk about this dumpster fire of a series.Part 1: The ReviewWar Storm is the final book in the Red Queen series. Mare along with the Scarlet Guard is preparing for war as Maven and his army will try to kill Mare and Cal and also rule supreme of Norta. The stakes are high since this war could mean dismantling the monarchy or result in the Scarlet Guard failing.Sounds promising? Wrong.The threat of war is there but it was mainly about each character going through an existential crisis that took up a good chunk of their chapters. It was drama after drama combined with uninteresting characters and unnecessary chapters.The one only one good thing to come out of this book is Evangeline, our sapphic queen. She is by far, the best character to ever grace this crap series. Along with Cameron, she is my favorite character because while everyone is running around being stupid, Evangeline keeps a level head and acts logically instead of with her feelings. She's sarcastic and straightforward with her thoughts. No sugar coating from this queen. I really did like her arc in this story. She is the sole reason why I didn't give this book a 1-star. Everything about her is just good. I may not have liked her at the beginning of the series, but she definitely grew on me. Her and Cameron.Mare: Annoying, bratty, love, annoying, bratty, love, love!Evangeline & Cameron: Shut the fuck up. *slaps Mare*Now onto the bad things.CharactersExcluding Evangeline, every other character in this book are just not good. If I had to make a list of worst being at the bottom and the best being at the top, it would look something like this:1) Cameron2) Evangeline3) Maven4) Iris5) Cal6) MareMare by far is the most annoying and bratty character I have ever met in my life. I could not stand her whining and complaining so much. I didn't have a good opinion on her at the beginning and now I just hate her. She remains static throughout the series, never changing. If I had to describe her in 3 words, it would be: Bratty, annoying, and bland. I always think of her as a horse in my head because that is what mare means, a horse. A dumb, annoying, horse. It got on my nerves of how much she pines over Cal to the point where I just stopped caring about their romance. I wouldn't even call it a romance to begin with. She could die and I wouldn't care less. In fact, I will go to my rooftop and scream Halleluja at the top of my lungs. Cal. Oh, Cal. My sweet, sweet Cal. I don't hate him, but my opinion on him went down after King's Cage. I wouldn't say he's a bad character, but like Mare, he did annoy me in the romance department. I still think of him as this boy king who only wants to do what is right. As flawed as his ideas were, I still rooted for him. I especially cheered for him when he decided to pursue his goals instead of pining over Mare. Granted, he pinned over her in this book which only hindered any development he had going. We also get to see from his POV in this book and to be honest: They were completely unnecessary. There are only 4 0r 5 chapters with his POV and they offered nothing to the story. If they weren't there, the book would be slightly shorter and nothing would change. Cal isn't a bad character, but I wished he wasn't so diluted in the last two books.Iris. Hmmm. I'm not sure how to feel about her. I get why she was involved in the plot because of her marriage with Maven, but I did find her POV to be intriguing. As a character, she's cunning and deadly while being devoted to her land and her family. But there was something I found lacking in her. She's a cunning person, but that's about it, not much of a personality. Like I said, not a bad character, but not exactly compelling. The best way I would describe her would be colorful wallpaper. You know she's there, but not exactly something worth looking at again.Maven. Victoria didn't do him justice here. I often find myself comparing him to the Darkling from the Grisha trilogy. But looking back now, I find Maven's character to me smothered down by everyone else. We do get his POV in this book as well and they offered more insight into what goes in his mind. Not a lot of development for him here, but at least I got to see what he's actually thinking. But with how Victoria wrote his arc, he didn't get to shine much. Which is disappointing because I really wanted to get to know him more. Plot\"You know, maybe this rebellion would be further along if they didn't rely on teenagers so much.\"That quote pretty much sums up my entire thoughts on the series. I would actually change it by adding \"love-struck idiot teenagers\" to it and that would sum up the Red Queen series. The plot for War Storm was slow and dragged on for so many pages. It didn't help that Mare's chapters were too long. As if I need another reason to hate her. The main issue with the series is the pacing issue and how sometimes the plot goes all over the place. Whether it be the Scarlet Guard or the other royal families, I could for the life of me not keep up with how the plot went everywhere and nowhere. The EndingI won't spoil the ending, but I will say that is was disappointing and underwhelming. I was expecting much more for the ending. But when I had 50 pages left of the story, I knew it would be a rushed ending. It reminded me a lot of the ending of The Fate of the Tearling where it also ended in a bad way.Had the characters been written well instead of being archetypes, the plot be more fast-paced, gotten rid of the unnecessary scenes, and the ending was this could've been a decent finale. Instead, we got War Storm.And I swear, if Victoria decides to make a spin-off series or continue the series, I'm gonna be fucking pissed.Part 2: Retrospective review.I’ve been with this series from the start when Epic Reads hyped up the hell out of Red Queen. When I first read it, I knew it would be the generic story of rebellion and power. The Red Queen series brings nothing new to the dystopian genre and is a basic series. And I think that’s where the problem lies with how Victoria didn’t try to make this series stand out among the other dystopian books. What’s worse is that it follows the same tropes most paranormal/dystopia novels have: Love triangle. When putting into consideration of how the Red Queen series is built upon, it’s just average, to say the least.Mare, in particular, was what made the series all the more generic. As mentioned in my review, she is nothing more than the generic protagonist who for some Godforsaken reason is the beacon of the rebellion while struggling to figure out her love life. If you take away her being the image of the rebellion and the love triangle, there is nothing remotely interesting about Mare as an individual. You could argue that she wants the best for her family and the other Reds, but that’s pretty much every main character of a dystopia novel. She has no strong characteristics other than being a stubborn girl. There is also the issue of the love triangle. From the start, the shipping wars began with people wanting MarexCal and MarexMaven which as the series progresses, becomes less and less interesting. With how bland the series was, the one thing I saw that was prevalent in the Red Queen fandom was who Mare was going to end up with. And if you did complete the series or finished the 3rd book, then you know who the love interest will be. It’s painfully obvious who she would choose. This love triangle was nothing more than a plot device for drama between Mare, Cal, and Maven. There shouldn’t even have been a love triangle to the story if it was going nowhere.I will give credit where credit is due by saying that parts of the series were entertaining. Granted, a majority of each book has slow moments but the parts that shined were what stood out to me and I liked those parts. As scarce as they may be, they did help me with finishing the series. But they were scarce in the void of pointless plots and characters.The one thing I noticed in book 3 and 4 was how this book was trying to be political. It failed on so many levels that I wouldn’t even say this is a politically heavy series. Especially since it doesn’t go into detail about the structure of each country. Given how the structure of the Reds and Silvers are in class, it’s difficult to dismantle such a status quo. There will always be fights among the Reds and Silvers over power. I see no change in this power dynamics. There are two series that are politically heavy and they did a much better job than what King’s Cage and War Storm tried to do. They are the Winner’s trilogy by Marie Rutkoski and the Powder Mage trilogy by Brian McClellan. I highly recommend those two if you want a much better political story.Is this a bad series? No.Is this a good series? No.Is this a generic dystopian series? Yes.My overall experience with the Red Queen series was disappointing. Not a terrible series, but not something to write home about.\nVerdict\nA disappointing ending to a generic book series. If you liked the Red Queen series, then I'm glad that someone found enjoyment out of it. This series just wasn't for me and I won't exactly be missing it after a few years.Thanks for reading my review.-Cesar"}, {"userName": "Nasom", "userReviewDate": "May 26, 2018", "userURL": "http://www.goodreads.com/user/show/67824881-nasom", "userReview": "[ Maven’s capture was pure trash. After all these books and battles, they captured him so easily??? And the way he died was so stupid for the main villain of this series. Please tell me what the point of the lakelander attack at the end was if they did not get killed?? Like I genuinely did not get the point of that plot  (hide spoiler)]"}, {"userName": "Jeff", "userReviewDate": "Nov 18, 2017", "userURL": "http://www.goodreads.com/user/show/68159473-jeff", "userReview": "GUYS. This cover is gorgeous.And I hope this story will be too.Yup, I know you people out there. The previous books weren't the best for me either.But hey, everyone deserves a second chance!DON'T DISAPPOINTMENT ME AVEYARD."}, {"userName": "daphne", "userReviewDate": "Jan 04, 2016", "userURL": "http://www.goodreads.com/user/show/31616869-daphne", "userReview": "2018...Uhm... WHAT?"}, {"userName": "Kendall", "userReviewDate": "Feb 10, 2017", "userURL": "http://www.goodreads.com/user/show/1536490-kendall", "userReview": "If this book doesn't end happy I've got to swear off all series until they're all published and I know for certain if it's worth reading. My heart cannot handle being so invested in characters to have them turn out miserable/sad/or broken! (thanks for nothing Tearling, Hunger Games, and Divergent)CAL BETTER FIGURE HIS SHIT OUT."}, {"userName": "jessica", "userReviewDate": "Jun 04, 2018", "userURL": "http://www.goodreads.com/user/show/10171516-jessica", "userReview": "well, folks. its happened. another series has come and gone. and yet again im feeling relatively unimpressed about the whole experience. maybe its the fact that i turned 27 today and im just getting too old and cynical for this type of book or maybe the book/story/writing/plot is to blame. why not both?! my old age aside, this left me feeling very… unsatisfied. i appreciate the effort that went into telling/writing this story, but i felt like this often dragged (which was frustrating because of its length), i wish i would have gotten more cal and maven (did we really even need iris’ perspective??), and i just didnt feel like this was the ending this series (or cal) deserved. to me, this book definitely focused on quantity over quality, which is a shame. but i guess it is what it is and im finally free of this at last. \n3 stars"}, {"userName": "Cait • A Page with a View", "userReviewDate": "May 20, 2018", "userURL": "http://www.goodreads.com/user/show/47412532-cait-a-page-with-a-view", "userReview": "2.5 stars.This series is one of my absolute favorites, but my enthusiasm definitely varies with the individual books. Red Queen and King's Cage are 5 stars and total favorites! This last book feels more like Glass Shard to me in that it's fine and everything, but did take some serious effort to drag myself through the story. Both books have a lot of people running back and forth, small battles, SO MUCH PLANNING, and just feel like they're constantly setting the stage for something else. Maybe I just connect better with stories that are more character-driven. King's Cage was amazing with how much it really dove into multiple characters and created such an emotionally complex plot. I really can't say the same here... The story is told from the POVs of Mare, Maven, Cal, Iris, and Evangeline, aaaaaand they more or less feel the same. And Cal chose a crown over Mare, so they spend a chunk of the story apart, but there's barely ANY tension or reason to care. Evangeline was definitely the strongest character, though. Some of her personality came through and there were 2 moments I genuinely laughed at and got into. And Mare felt way more human when viewed through Evangeline's POV, so it was wonderful to get that stronger sense of her character. There was also a big focus in the plot with whether Evangeline would stop being a puppet and act to create the future she wants with the woman she loves, so it was fun to see how much she has changed since the first book. But there still wasn't a whole lot of... character to these characters. I mean this is the fourth book - at this point I want to be so familiar with the characters that they're like old friends I can predict or laugh with. I want to be invested in SOMETHING at the very least. This was 650 pages of bland characters & shifting alliances in a story without much personality. This book could've easily been 300 pages shorter.There was SO MUCH potential with Maven's storyline too! The previous book was absolutely brilliant. And I was so excited to see what could happen with such a complex character. Maven is still obsessed with Mare and consumed with jealousy for Cal here, while both of them struggle with whether there's any hope of saving him. Unfortunately, this whole part of the story rang pretty hollow for me as well... it could have/should have been a lot more (but was still the only part I actually cared about). The ending was seriously underwhelming, but I'm still happy to know how it ends. It was also just fun to be back in this world. I also appreciated how War Storm had the most diverse characters yet!This really is one of my favorite series because it's like the best blend of dystopian & fantasy. I really don't think I went into this final book with too many expectations (or at least I tried not to), but I'm still feeling pretty let down in almost every area of the story. It's not that I was hoping to see something specific and am sad it didn't happen. I'm just surprised by how empty a 650 page book was. This was the most distant I've ever felt from these characters. We'll see if my rating changes over time... for now it's super neutral."}, {"userName": "Kisses A", "userReviewDate": "Feb 27, 2017", "userURL": "http://www.goodreads.com/user/show/41833669-kisses-a", "userReview": "[I am gonna say that if you have hope for Maven then dont bother to read this book because it will only hurt you and leave you depressed.The chapters from his view was the saddest. We got a close up look at the raw pain he felt. So guys Victoria Aveyard led us to think that book 3 actually had a reason. She gave us hope that Maven could actually be fixed. This book was so lazy for fixing Maven. They didnt even try. They just killed him at the end. How pathetic. I hate it sm. Mare is annoying as f***They characters were still so bland and Evangeline felt like the only saving grace besides Maven. What i am angry abt is that the author gave Maven so many layers and showed us a broken, sad and painful side of him leading us to think that he could be redeemed in some way. She even made Mare friggin Barrow have very mixed feelings abt him throughout the series leading me to believe that he was not just your common villian. That he could be saved. After kings cage i taught Mare had seen a side of Maven that no one else had and it was not all for nothing.And to make it even worse she was the one to kill him. Like why make me see this hurt side of Maven if you are just gonna kill him like a common murder like every other book? So much potential wasted. And this book just felt bland and the plot felt like glass sword. So darn boring. Maybe it could have been a duology but instead the author made me fall for the villian along with many other readers just to snatch that hope. As a ya book authors should try to portray that people can change nd ppl will say that not everyone changes but Mare spent so much time thinking about and obsessing over Maven that i would have taught she would have accomplished something positive. But she was her barbaric ole self to scared to show her true self hiding like a scared little gurl. I am never gonna read another va book. She played with my emotions well and i am so done. But then again i should not feel disappointed because as others say this is just recycled storylines and nothing original. Doe she even realise that by making us love Maven and killing him would only lead to us trusting her future books even less? Why tho?Maven was the only reason this series even seemed a bit remotely interesting to me and deep down i knew it would not be happily ever after because only some very talented authors can turn around their stories like that but stupid me still had hope. There are tons of alternatives for him instead of death. Surprisingly i did not hate Cal. He was just kinda like wallpaper. I actually liked Evangeline and i didnt mind reading from her point which is shocking. As always i found the other characters boring and predictable with Maven being the only one with actual layers to his character. I would have liked to know more about the boy he liked who died though but right now i am just so upset over everything. And if you were wondering how it ended then Mare kills Maven and she leaves and tells Cal that they need time to heal and not to wait for her. So she ends up with none of them. This one of the only satisfying thing however Cal shippers may be disappointed.  (hide spoiler)]"}, {"userName": "Nadia", "userReviewDate": "Mar 18, 2016", "userURL": "http://www.goodreads.com/user/show/41912759-nadia", "userReview": "[After reading King's Cage and the part where Mare and Cal were talking about how perhaps a newblood healer could fix the part of Maven's mind that was damaged by Elara, I held onto my hope for Maven redeeming himself. Fingers crossed. (hide spoiler)]"}, {"userName": "Chelsea", "userReviewDate": "Feb 24, 2016", "userURL": "http://www.goodreads.com/user/show/5028126-chelsea", "userReview": "(5/16/18) actually started reading the book and it's horrible. (Original rating) There's no reason to drag this into four books. There's probably going to be a book for every character as well....*Sigh* thank god for free ebooks.*I rated this book two years ago. Before you comment that I shouldn't have rated it please understand I don't give a fuck. 🤷🏻‍♀️"}, {"userName": "Lara (Bookish_turtle)", "userReviewDate": "Aug 19, 2017", "userURL": "http://www.goodreads.com/user/show/64318901-lara-bookish-turtle", "userReview": "[Just want to start by saying that EVANGELINE TRYING TO GET CAL AND MAVEN BACK TOGETHER IS ACTUALLY MY FAVOURITE THING IN THE UNIVERSE I WANT TO THANK VICTORIA AVEYARD SO MUCH FOR WRITING THIS I WILL READ IT ON REPEAT. Chapters 16 & 23 are some of my all time favourite pieces of literature in the universe, and I will be forever grateful that they have been written. Other than that I'm just going to give a general OH MY GOODNESS EVERYTHING WAS INCREDIBLE AND FANTASTIC AND I AM STILL REELING IT WAS SO GOOD!!! FARLEY WAS AN ALL ROUND LEGEND AND THE ACTION SCENES WERE SO WELL WRITTEN AND THE STAKES WERE HIGH AND EVERYTHING WAS AMAZING!!! Until we get to the epilogue...I met Victoria Aveyard in person a few weeks ago, and she said there would be closure. She didn't promise everyone would survive (though they basically did really. Maven was the only major loss in the book, which I didn't see coming. I actually faced a lot less emotional trauma than I expected...) or that it would be a happy ending, but she said that since it was the last book, there would be closure. AND I SINCERELY DISAGREE WITH THIS STATEMENT!!!As I sit here eating my leftover Thai food, I have so many questions. I would list them, but I don't know where to start and the list would be too long, and also, you probably already have them in your head. But seriously though, I just need another book. Here's to hoping that this: Aveyard Short Story Collection will answer all my questions, because I have SO MANY THAT I DON'T KNOW HOW THEY CAN EVER ALL BE ANSWERED!!But seriously though, WHY IS CAL NOT IMMEDIATELY BACK TOGETHER WITH MARE?! WHEN THEY WERE FIGHTING BEFORE THEY STILL WERE SO IN LOVE WITH EACH OTHER THOUGH THEY TRIED TO DENY IT AND EVERYBODY WAS INFURIATED BECAUSE THEY WERE JUST PRETENDING THEY DIDN'T CARE. AND THEIR EMBRACE ON THE BATTLEFIELD AS WELL! THAT SURELY SHOULD MEAN THAT THEY ARE STILL GOOD TOGETHER. AND I GET THAT CAL'S STILL UPSET ABOUT MAVEN BECAUSE I AM TOO! I'M STILL UPSET ABOUT STUFF THAT HAPPENED THREE BOOKS AGO OF WHAT HE DID. BUT CAL ADMITTED THAT MAVEN WAS LOST, HE WAS GOING TO KILL MAVEN HIMSELF UNTIL HE LOST HIS NERVE (which is completely understandable) BUT HE KNEW THAT MAVEN HAD TO DIE, AND HE KNEW THAT MARE WAS GOING TO DO IT, AND HE DIDN'T TRY TO STOP HER! WHY IS THIS SUCH A BIG OBSTACLE I JUST WANT THEM TO BE TOGETHER AND BE HAPPY AND I KNOW THEY HAVE STUFF TO WORK OUT BUT I WANT THEM TO WORK IT OUT TOGETHER, NOT SPEND TIME APART!!! (I'm only slightly obsessed...)I really think that Victoria Aveyard should take epilogue writing lessons, because the entire rest of her books are always perfection, and then she just writes an epilogue which will emotionally damage me forever. (hide spoiler)]"}, {"userName": "Sandra", "userReviewDate": "Oct 21, 2015", "userURL": "http://www.goodreads.com/user/show/11347937-sandra", "userReview": "Review #1: 10/21/2015so... there's going to be ANOTHER book in this series???alrighty then..."}, {"userName": "AleJandra", "userReviewDate": "May 05, 2016", "userURL": "http://www.goodreads.com/user/show/25897549-alejandra", "userReview": "4.5 Shame and pride, sorrow and relief  STARS \n\n\"The guns will quiet, the smoke will clear, and the soldiers, Red and Silver both, will come home.\"\n\nHay muchas cosas negativas que les puedo decir de este libro. Pero si ya han llegado a este punto de la serie, creo que ya no tiene caso mencionar todas aquellas críticas que ya discutimos con anterioridad. Aquí la gran verdad de este libro, la razón por la que le estoy dando las 5 ESTRELLAS, es porque Victoria Aveyard de alguna manera, logro hacerme leer su serie completa, a pesar de ser un género que no me gusta, con libros de más de 500 páginas, y con una historia llena de subidas y bajadas. Pero lo logro, que es más de lo que puedo decir de otras historias, que, aunque quizá sean mejor, nunca han mantenido mi interés.Especialmente en este momento de mi vida en el que estoy tan metida en las novelas gráficas, que regresar a leer una novela me cuesta el doble de trabajo, así que si, solo por eso, War Storm se merece un aplauso de pie. Pero bueno, hemos llegados al final, es tiempo de decirle adiós a todos los personajes con los que hemos sobrevivido tanto por más de 3 años. Así que sin más vueltas:Hablemos de War StormSPOILER ALERT📚 Sinopsis Honesta:El Reyno de Norta se enfrenta a una guerra civil, y guerra con sus imperios vecinos. Silvers y Reds tendrán que afrontar muertes, peleas, sufrimientos y difíciles decisiones. Esta es la historia de una REVOLUCION, NO UNA HISTORIA DE AMOR. Llena de batallas, enfrentamientos y manipulaciones. Uno de los puntos fuertes de esta historia, que para mí la hizo diferente y sobresaliente a todas las demás, es que la historia tiene tantas tramas, que la relación amorosa de los protagonistas queda en segundo plano. Si la vemos obvio y juega un punto fuerte en la historia, pero no es el eje principal. \n\nPara mí el eje principal, es la revolución, los silver, reds y newblods, tratando de sobrevivir juntos. Ver como tratan de cambiar un sistema de gobierno completo, es muy interesante de ver. Los juegos de traiciones y alianzas entre las personas al poder, y que al final cada decisión se lleva acabo de forma calculada, y cada uno solo ve por si mismo, y por lo que creen que es correcto. Hablemos de los personajes:➦MareMare no es un personaje que me fascine, pero si la respeto, desde el primer libro se ha mantenido fiel a sus convicciones, a pesar de amar a Cal y Maven, nunca ha dejado que sus sentimientos por ellos opaquen sus ideales y su búsqueda por la igualdad entre silvers y reds. Y así siguió su camino hasta el final, tomo malas decisiones, cometió errores, pero siempre siendo fiel a sí misma, como debe de ser, no pude pedir más para este personaje. Y si fui feliz con su final.\n\n“He still hasn’t turned away from the crown, and I am still just as dedicated to my cause, if not more so. I can’t still be in love with a king, when everything I’m doing is to destroy his throne. Destroy all notions of kings and queens and the kingdoms at the mercy of their will.”\n\n➦CalPobre Cal, le toco lo peor, sufrió sufrió sufrió. Tomo muy malas decisiones y tuvo que afrontar las consecuencias, pero lo entendí, y logre perdonarlo y no pude dejar de sentir lastima por su situación. Al igual que Mare, me gusto que sus sentimientos por ella no opacaron sus propios ideales. Al final el mismo tuvo que decidir a donde llevar a su país, y que tipo de gobernador quiere ser.\n\n“When the storm breaks, I’ll be ready. I promise you that.” Ready to fight. To lose. And probably die.”\n\n➦IrisNo me gustaron sus capítulos, y odie al personaje, poderosa pero aburrida como villana. Su traición fue lo mas obvio de la historia, se veía venir desde su primer capítulo. Lo mejor de ella, fue verla en batalla, que casi matara a Cal fue de lo mas intenso. ➦EvangelineAl final fue el personaje que más evoluciono, y la única que logro su final feliz.➦MavenOh mi Maven hermoso. Sus capítulos, aunque pocos fueron los más tristes. El chico perdido, roto y sin salvación. Todo el libro se la paso contra la esquina, sin salida, con todos en contra, hasta el mismo. No importante cuanto deseáramos verlo redimirse o ser feliz, el pobre ya había caído demasiado hondo en la locura, llore su desenlace, pero él no quería ser salvado.\n\n“He has no loyalties, and no love in his heart. The boy who calls himself king is a shell, empty, a danger to everyone and everything.”\n\n\nMis partes favoritas:\n-\tEl enfrentamiento entre Cal e Iris fue épico.-\tLos \n“This is the last time” \n de Mare y Cal.-\tEl reencuentro entre Maven y Cal quería ver una pelea épica, pero su encuentro en la isla fue suficiente para romperme el corazón en cachitos.-\tQue Jhon reapareciera, esa platica con Mare lo fue todo.-\tFarley, toda ella es perfecta.-\tY por supuesto el enfrentamiento entre Maven y Mare.Como llore en este momento:\n\n“I like the hair. We can still run. Together.”\n\n En conclusión: Llegamos al final, para darnos cuenta de que realmente no hay final.Nos dejan un final abierto, se que a la mayoría les molesta este tipo de finales, a mí personalmente me encantan y son de mis favoritos."}, {"userName": "Alexander Hamilton", "userReviewDate": "May 26, 2018", "userURL": "http://www.goodreads.com/user/show/62795872-alexander-hamilton", "userReview": "I expected an absolute shitty ending, and was still disappointed."}, {"userName": "- ̗̀ dany  ̖́-", "userReviewDate": "May 30, 2018", "userURL": "http://www.goodreads.com/user/show/47960008---dany--", "userReview": ". : ☾⋆ — 1.5 ★[SHARP INHALE] I’M FREEEEEEEEEEEEEEEEi never have to think about this series again. i know that sounds harsh but these books have brought me so much unnecessary anger and frustration that it’s truly a relief to finally FINALLY be done with the series once and for all. i can finally put these books down and be DONE with the characters and the story and v*ctoria av*yard’s nasty ass personalityi actually didn’t completely hate this book (which was a very pleasant surprise!! i’m not gonna lie!!) but it was still uselessly long and very poorly plotted out and the final battle + the end was so UNDERWHELMING i genuinely wanted to claw my eyes out. like!!!!!!! @v*ctoria DID I REALLY JUST GO THROUGH 650 PAGES FOR THAT?????????????? i’m not gonna go into much detail about that since it’s very clearly a spoiler. however i WILL MOST DEFINITELY TALK ABOUT EVERYTHING ELSE THAT I DIDN’T LIKE● unrestrained pining: mare and cal spend the first 40% of the book going off about how they CAN’T be with each other despite the fact that they’re ~~ so in love ~~ because???/?????? because cal????????? is gonna be king of norta??????? BITCH THOSE ARE NOT EXCLUSIVE TO EACH OTHER THEY DON’T MATCH UP AT ALL!!!!! like being honest for a second cal and mare don’t need to be married to be together???? they don’t even have to make it public????? EVEN IF CAL MARRIES SOMEONE ELSE (EVANGELINE), MARE CAN STILL BE HIS LOVER?????? JUST AS ELANE IS EVANGELINE’S LOVER DESPITE THE FACT THAT SHE’S GONNA MARRY CAL?????????????? the worst part about this is that evangeline, in canon, in text, brings up this idea and she’s like “hey like u can be lovers lmao i don’t care i’m a lesbian i’m gonna hang out over here with my lesbian lover” and mare is like “I CAN’T BE WITH CAL HE CHOSE THE CROWN OVER ME :(” god i’m so fucking angry i don't even like mare and cal together but this was just so beyond STUPID● strategizing/war stuff:  this book was trying way too hard to be the hunger games with all the surprise attacks and battles between the countries ON THAT NOTE when the FUCK did so many countries show up in this universe????? and why doesn’t the book have a map????? v*ctoria i’m a tired college student and i can’t keep up with all these useless countries. anyway the battle scenes didn’t make sense at all, and i feel like v*ctoria had all these sequences perfectly played out in her head but when it came down to writing them she kinda got a little excited and forgot to put some stuff in because spatially i could not for the life of me make sense of what was going on ● iris + the lakelands: USELESSSSSSSSSSSS. DIDN’T DO ANYTHING. WASN’T EVEN ON THE EPILOGUE BECAUSE V*CTORIA HERSELF DIDN’T CARE. NEXT. ● cal and maven:  “I swear, these Calore brothers are trying to out-idiot each other.” this is an actual quote from the actual book and truer words have never been spoken, god bless. even though i love maven with every piece of my heart, he did some dumb shit in this book. cal also did some dumb shit. mostly cal did dumb shit. this boy can’t be king even if his life depended on it??? he’s awful at politics???? and no offense but maven in particular felt really out of character to me in the scenes where politics were involved because he just??? sucked??? when he was otherwise brilliant in the previous books???? why did u do my boy like that v*ctoria. why. i’m also extremely mad that we didn’t get the redemption arc we deserved because no OFFENSE but maven had the potential to become a new warner from shatter me and yet here we are :(● zero character development:  THIS BOOK WAS ALMOST 700 PAGES LONG V*CTORIA WHYYYYYYYYYYYYYYYYanyway i had zero hopes for this book and was still somehow disappointed even though i did like some parts of it lmao bye bitch you best believe i’m never reading anything by v*ctoria av*yard ever again!!!!!!!!!!!"}, {"userName": "Jenny Han", "userReviewDate": "Mar 28, 2017", "userURL": "http://www.goodreads.com/user/show/61855216-jenny-han", "userReview": "I sort of jumped off of this series when Aveyard started attacking her own fandom and calling them out for criticising her work. Like—yeah—it’s our fault somehow. I just refer authors like this to my new favourite author on twitter Jay Cole’s response:\nAnd how she couldn’t understand how so many people preferred Maven when Mare was “such a strong female character”. Not that she wasn’t the most annoying character that walked planet Earth. But I started this series so I guess I’ll see this book next year."}, {"userName": "joanna ☽", "userReviewDate": "Dec 23, 2017", "userURL": "http://www.goodreads.com/user/show/75293221-joanna", "userReview": "I’m not sure what I think about this. All I know is that it’s 1am and I shed a couple tears, but I’m going to have a think and sleep on it first and maybe change my rating. Full review to come soon. -there’s no law that says i have to ignore all my responsibilities to read this on release date.... but i’m gonna do it anyway"}, {"userName": "Pol", "userReviewDate": "Nov 25, 2016", "userURL": "http://www.goodreads.com/user/show/61912916-pol", "userReview": "I think why I’m over Aveyard and not just her but YA authors in general these days. It used to be if the story was great it was published, but it has slowly contracted over time to accepting people from the top universities, who are incidentally a lot of the time white brunettes or blondes, and they might be mediocre but they just really don’t move you on the page with any substantive feeling. YA authors can say no one like their books because they’re women or they’re political or blah blah blah but I honestly don’t have that much sympathy for them anymore. Just look at where most authors came from. Aveyard herself was a graduate of the University of Southern California, Leigh Bardugo graduated from Yale, Roth from NorthWestern, Sarah J Mass from Hamilton College, a college Forbes in 2016 rated it 50th in its America's Top Colleges ranking of 650 schools, which includes military academies, national universities and liberal arts colleges: all of these are top colleges with some of the highest rates of employment success in America. Don’t get me wrong, I’m sure they must have worked some, but, seriously though, if you have the money and can afford to move to college you were already pretty well off to begin with. I just graduated from high school last year with top marks—not really an achievement in my shitty town—but because I live in the rust belt and we’re essentially dirt poor, I had to turn down Harvard because I couldn’t afford to leave my family and siblings. This was highlighted by the fact in King’s Cage, Aveyard’s version of imprisonment was Mare being trapped in the most luxurious hotel room imaginable. How horrible.  So, no offence, but before you call yourself oppressed maybe live a little more in a blue collar job with no days off working hard manual labour in a till-the-death wrestle with poverty like the rest of us before you attribute that word to your life – because you’re a women or whatever lame excuse you can tweet to cast yourself as a heroine is not enough. Especially when the hardest thing you have to do in your job is open and close a word document for a living. And most of their smack-talking is just so much bullshit. Roth went on drugs because people called Carve the Mark racist. The rest YA authors are all constantly taking a break for “mental health concerns”. Honestly, mental health problems were invented by a generation of spoilt brats with too much money and time on their hands to over-think things; if one more person say I’m worried about my mental health I’m going to whack them with a crowbar. I think the problem is I come from a blue-collar work life where I was literally out changing an engine gearbox to 11:30pm the other night and I just don’t have sympathy for authors in this industry at all when they tell me how hard their life is. All I hear is white noise. Aveyard has finally tipped me over the ledge. I cannot put up with YA authors bullshit anymore. I’m discontinuing this series and just YA books in general."}, {"userName": "Emma", "userReviewDate": "May 15, 2018", "userURL": "http://www.goodreads.com/user/show/28489639-emma", "userReview": "4.5 stars. What a satisfying ending. RTC."}, {"userName": "Saya ☽ Queen Of The Night", "userReviewDate": "Nov 14, 2017", "userURL": "http://www.goodreads.com/user/show/34317765-saya-queen-of-the-night", "userReview": "[burn, red as my rage] I would like something extremely important to be known about this book; other than it’s utter existence is trash i’d like you all to know that this book has abused literature by using the word “sneer” over 70+ times[please take a moment to let that sink in]the offending word has now made history for being the most overused word by Victoria Aveyard [catchphrase] i’d also like to give special recognition to each and every individual who has also suffered through this garbage journeynot all heroes wear capes, and those of us who have come this far are certainly heroesthank you for wasting our time War Trashi will always remember how shitty this series waswe have all lived a lieshouldofstoppedatredqueen🥀😷[pre-review]this series book covers are always bombDO NOT PUT ME TO SLEEPI HOPE THIS BOOK CAN REDEEM THE PAST TWO. and please don’t make Mare bore us to death againplease or else I’m going to throw my own War Storm 😒"}, {"userName": "Bookaholic", "userReviewDate": "Dec 13, 2015", "userURL": "http://www.goodreads.com/user/show/6486208-bookaholic", "userReview": "Another book means more betrayals, tears, deaths, and pain. I'm really not sure whether I should be excited or scared for the characters..."}, {"userName": "Suzanne", "userReviewDate": "May 18, 2018", "userURL": "http://www.goodreads.com/user/show/4852457-suzanne", "userReview": "4.5* This was the very best installment though I didn’t like some of the things that happened. There was action from the get-go with some crazy happenings. This was a good conclusion though some of the conclusion I would not say is satisfying but it’s not against the plot as much as character(s). Those that read it will know what I’m talking about after finishing the book. I had a love/hate relationship with this saga. A couple of the books were only okay while a couple were pretty good. However this was a good one for sure. My quick and simple overall: intriguing finale and does give a pretty good ending to the series though not to the some of the characters. Really not sure how to word it...."}], "description": "Victory comes at a price.Mare Barrow learned this all too well when Cal’s betrayal nearly destroyed her. Now determined to protect her heart—and secure freedom for Reds and newbloods like her—Mare resolves to overthrow the kingdom of Norta once and for all… starting with the crown on Maven’s head.But no battle is won alone, and before the Reds may rise as one, Mare must side with the boy who broke her heart in order to defeat the boy who almost broke her. Cal’s powerful Silver allies, alongside Mare and the Scarlet Guard, prove a formidable force. But Maven is driven by an obsession so deep, he will stop at nothing to have Mare as his own again, even if it means demolishing everything—and everyone—in his path.War is coming, and all Mare has fought for hangs in the balance. Will victory be enough to topple the Silver kingdoms? Or will the little lightning girl be forever silenced?In the epic conclusion to Victoria Aveyard’s stunning series, Mare must embrace her fate and summon all her power… for all will be tested, but not all will survive.", "title": "War Storm\n      \n          (Red Queen #4)", "url": "http://www.goodreads.com/book/show/27188596-war-storm", "average": 3.99, "cover": "https://images.gr-assets.com/books/1510773212l/27188596.jpg", "reviews": 1390, "authors": [{"url": "https://www.goodreads.com/author/show/7074943.Victoria_Aveyard", "name": "Victoria Aveyard"}], "type": ["Fantasy", "Young Adult", "Science Fiction"], "outlinks": ["http://www.goodreads.com/book/show/27188596-war-storm", "http://www.goodreads.com/book/show/40165899-war-storm", "http://www.goodreads.com/book/show/22328546-red-queen", "http://www.goodreads.com/book/show/23174274-glass-sword", "http://www.goodreads.com/book/show/30226723-king-s-cage", "http://www.goodreads.com/book/show/25005214-queen-song", "http://www.goodreads.com/book/show/25944381-cruel-crown"]}