{"ratings": 360, "userreviews": [{"userName": "Christina  Torretta", "userReviewDate": "Mar 05, 2015", "userURL": "http://www.goodreads.com/user/show/8264810-christina-torretta", "userReview": "Great listen! Overall loved the story and plot. The characters are great. Very interesting start with book 0 and a great finish! Read in order!Received from audiobookreviewer.com for an honest review."}, {"userName": "Brad T.", "userReviewDate": "Jan 10, 2014", "userURL": "http://www.goodreads.com/user/show/3634478-brad-t", "userReview": "The cliff hangers got tedious. And the mastermind was too big of an idiot to have ever pulled this off."}, {"userName": "Julie Powell", "userReviewDate": "Mar 24, 2017", "userURL": "http://www.goodreads.com/user/show/1054964-julie-powell", "userReview": "A good conclusion to this part of the series. There are plenty of battles and revelations as to why, and though not original, this story is well-written and fast-paced."}, {"userName": "Jill James", "userReviewDate": "Jul 02, 2017", "userURL": "http://www.goodreads.com/user/show/1627545-jill-james", "userReview": "Loving it."}, {"userName": "Jeff Seneca", "userReviewDate": "Aug 21, 2015", "userURL": "http://www.goodreads.com/user/show/40360624-jeff-seneca", "userReview": "Very disappointing \"end\" to series. First of all, the mastermind really turned out to be not that bright. He was a tale of two characters. In one sense he was larger than life, the villain smart enough and resourceful enough to have pulled off this gigantic deed, however he was dumb enough to let emotion cloud his judgement and go in to the field? With all his familiarity and deadliness with knives he somehow doesn't kill Hopper first time out? Then there is the sneaking around. Nobody figured out until Hopper that this dude was sneaking around and eventually killing his own men?What really got me was the ending though. It felt rushed. Two people rush the facility and somehow break out the prisoners throw a grenade and suddenly everything is solved. What about the rest of Agents and all the rest of the United States? Taking out that one place solved everything? Finally, Dan's story was completely overlooked. Now I know there are more books and they are going to focus on those stories, however the author even states that this was the wrap for the main story arc? Huh? Two major characters, three if you count Noah, can't be left out of the main story arc. Series books don't work that way. Very frustrated."}, {"userName": "Megan", "userReviewDate": "Feb 16, 2014", "userURL": "http://www.goodreads.com/user/show/7756793-megan", "userReview": "I liked the story but the blurb at the end made it seem like this was all the story was supposed to be. I know that since then the author has written at least one more, which is good because I feel that so far there were a lot story lines and characters that were opened up that never really went anywhere. Of the prequel and the 3 main books this one was by far my favorite. There was a lot more to it than the others, there was a little more dimension. This book had the most interesting scenarios but I still wanted more. One minor issue with this book was that it was not edited or proofread as well as the ones before it. There were a lot more typos and even a few continuity errors that were really obvious. At one point the character lost his jacket to a creature, it was made very clear in the text like it was an issue (maybe because he was less protected without it) and then just a couple pages later his jacket keeps him from being bitten. There were others too but that one really stood out."}, {"userName": "Lorre", "userReviewDate": "Apr 13, 2015", "userURL": "http://www.goodreads.com/user/show/6349980-lorre", "userReview": "I liked this one more than the 1st and 2nd book.It could have been a 5-star book but there were a few inconsistencies in the stories and the Agent's leader wasn't believable. He seemed too impulsive and not enough in control of his emotions and to have patiently planned all of this on his own of the course of 10 years. The plan itself is a bit weird as well... the leader wants to take over the world and control it but the Agents kill every person who's immune and all his Agents are male. So he wants to control a lot of empty land with a handful of males with no women to repopulate his new world?The overall story and writing style are good though. It's a different take on zombies... it's a disease that comes from ingesting contaminated food and water so it's not contagious through scrathes, bites, saliva. But they are a bit faster and seem somewhat more intelligent than the classic zombie."}, {"userName": "Meg McGregor", "userReviewDate": "Sep 14, 2015", "userURL": "http://www.goodreads.com/user/show/5554878-meg-mcgregor", "userReview": "This is the fourth book in a series of relating how the contamination of the Southwestern United States began with varied attacks on water sources, food supplies, etc.I like how suspenseful the books were and that the action was non-stop! I also liked how each book concentrated on a handful of characters, helping make character development stronger, and causing me to want to find out what happened to each of the different groups of people.This book is one of the best! I was at the edge of my seat wondering how Sam and Delta were going to survive! You know their stamina is incredible. Sam is not a young man but he can run and run and run just like the Energizer Bunny. I just hope the Bunny doesn't become contaminated! LOL"}, {"userName": "Zelma", "userReviewDate": "Aug 19, 2015", "userURL": "http://www.goodreads.com/user/show/16500056-zelma", "userReview": "So I have been reading this series non stop for the past couple of days. I would have givin it 5 stars but the only reason is the swearing. Most people it is fine but I don't like to bring products into my house that my children can't read which is why I tend to stick with teen and young adult. This is one book I'll remove from my tablet when I am done. As for the story goes I did enjoy it. Very typical for a Zombie book and as I stated above I couldn't put it down. I just wish there wasn't such bad language in it. Easy to read and characters are developed and the author is quite descriptive. This item is free on amazon at the moment."}, {"userName": "Blaine Moore", "userReviewDate": "Sep 17, 2014", "userURL": "http://www.goodreads.com/user/show/5095561-blaine-moore", "userReview": "In this conclusion to the main storyline, the main characters have all split up, and we follow Sam and Delta to Salt Lake City where they find the people behind the infection. I enjoyed their rescue attempts and the fight to end the conspiracy, but I never really felt invested into why so many people would be onboard with mass genocide, or why they felt a need to go after the tiny percentage of survivors when they'd be an inconsequential threat to their plans in the future thanks to everybody else being infected or dead."}, {"userName": "Lou", "userReviewDate": "Feb 15, 2014", "userURL": "http://www.goodreads.com/user/show/8698022-lou", "userReview": "Although I did enjoy this series as I said in each review I just couldn't get my head around running zombies. To be fair I wouldn't actually call these zombie books at all as the infected are not dead coming back to life just humans infected by an ingested virus and turning into maniacs. This one only got three stars because there were a few spelling/grammatical errors which are my pet hate and it also felt a little rushed and unbelievable after the previous ones."}, {"userName": "Kelly Higgins", "userReviewDate": "May 24, 2016", "userURL": "http://www.goodreads.com/user/show/11552893-kelly-higgins", "userReview": "Even though it is not the last book in the series, it definitely seemed like a conclusion at the end of this book. The beginning of this was a carry on. And these are not really the type you can pick up mid way in a series and still understand what is going on, which I think is the main downfall. Agents are still hunting for survivors in this book. More action. Unexpected hero."}, {"userName": "Daniel A. Daniel", "userReviewDate": "Jan 24, 2015", "userURL": "http://www.goodreads.com/user/show/32251400-daniel-a-daniel", "userReview": "The fun goes on!What a ride! I love this story and all it's characters, good and evil, am going to start on fourth installment and see where it takes me. Kudos to the writer, keep up the great work!"}, {"userName": "Phil Jones", "userReviewDate": "Aug 10, 2014", "userURL": "http://www.goodreads.com/user/show/18892857-phil-jones", "userReview": "The ending was a little weak and felt like he just stopped given he said this is the end of the main story arc.The story was enjoyable enough but it just felt unfinished.Lets see where books 4 and 5 go even though they are not the main story."}, {"userName": "Cal Steinbeck", "userReviewDate": "Dec 14, 2016", "userURL": "http://www.goodreads.com/user/show/19015282-cal-steinbeck", "userReview": "These books make no sense. I've decided to quit reading them now. Byeeeeeeeeeee terrible plot. Byeeeeeeeeeee awful plot holes. Byeeeeeeeeeee two dimensional characters."}, {"userName": "William B", "userReviewDate": "Aug 16, 2013", "userURL": "http://www.goodreads.com/user/show/14977839-william-b", "userReview": "If you enjoy post apocalyptic books, I highly recommend this series's."}, {"userName": "Justin", "userReviewDate": "Jun 13, 2014", "userURL": "http://www.goodreads.com/user/show/16847791-justin", "userReview": "This one was the hardest one to read so far in the series. It was still a good read but I just found it was a little harder to get through."}, {"userName": "Ruben Pena", "userReviewDate": "Jun 24, 2015", "userURL": "http://www.goodreads.com/user/show/22069447-ruben-pena", "userReview": "Very fast pace, it makes you want to get the other book, and find out what is going to happen next with the survivors."}, {"userName": "Nita Garcia", "userReviewDate": "Jan 27, 2015", "userURL": "http://www.goodreads.com/user/show/5319940-nita-garcia", "userReview": "omg I loved this series so much on to book 4"}, {"userName": "Colin Hickey", "userReviewDate": "Jan 12, 2015", "userURL": "http://www.goodreads.com/user/show/37483020-colin-hickey", "userReview": "After a good build up the story wrapped up too quickly / easily for me. Expected the agents who created this contamination would be more complex and would have liked to see this background expanded."}, {"userName": "Cindy", "userReviewDate": "Jul 29, 2014", "userURL": "http://www.goodreads.com/user/show/9019817-cindy", "userReview": "Interesting different take on the apocalyptic theme."}, {"userName": "Adriane", "userReviewDate": "Jan 30, 2014", "userURL": "http://www.goodreads.com/user/show/7324190-adriane", "userReview": "My first zombie book set, no bad."}, {"userName": "Diane", "userReviewDate": "Jan 11, 2014", "userURL": "http://www.goodreads.com/user/show/4920926-diane", "userReview": "Action, drama, good vs evil, If you like end-of-the-world books, pick up this series. I couldn't put it down."}, {"userName": "Elaine Plourde", "userReviewDate": "Jul 16, 2016", "userURL": "http://www.goodreads.com/user/show/18005309-elaine-plourde", "userReview": "I'm on my forth book now after reading these three within a week almost. I' still enjoying it and am hoping for a good ending."}, {"userName": "Geoff", "userReviewDate": "Jan 15, 2016", "userURL": "http://www.goodreads.com/user/show/2802754-geoff", "userReview": "Yeah, sinking further into mediocrity."}, {"userName": "T. Jackson", "userReviewDate": "Oct 04, 2016", "userURL": "http://www.goodreads.com/user/show/15905982-t-jackson", "userReview": "Really great story. Loved the characters."}], "description": "The American Southwest has been destroyed, ravaged by violence and infection.In order to stop the chaos from spreading, Sam and Delta must journey to Salt Lake City, to the heart of where it all began...Can the survivors alter the course of history, or has humanity's fate already been sealed?", "title": "Wasteland\n      \n          (Contamination #3)", "url": "http://www.goodreads.com/book/show/18159048-wasteland", "average": 3.66, "cover": "https://images.gr-assets.com/books/1372848681l/18159048.jpg", "reviews": 26, "authors": [{"url": "https://www.goodreads.com/author/show/6565271.T_W_Piperbrook", "name": "T.W. Piperbrook"}], "type": ["Horror", "Horror", "Apocalyptic", "Science Fiction"], "outlinks": ["http://www.goodreads.com/book/show/18159048-wasteland", "http://www.goodreads.com/book/show/19032425-wasteland", "http://www.goodreads.com/book/show/18886707-contamination-boxed-set", "http://www.goodreads.com/book/show/23299722-the-last-survivors", "http://www.goodreads.com/book/show/25496251-the-last-escape", "http://www.goodreads.com/book/show/25927373-the-last-humanity", "http://www.goodreads.com/book/show/18914679-escape"]}