{"ratings": 224, "userreviews": [{"userName": "Blair", "userReviewDate": "Sep 03, 2011", "userURL": "http://www.goodreads.com/user/show/272909-blair", "userReview": "Ross Raisin wrote one of my favourite books of last year, and indeed of all time, God's Own Country, so I'd had his second novel Waterline pegged as a must-read since its release. Although I found it equally impossible to put down - reading the book from cover to cover in one sitting - Waterline is a very different animal to Raisin's debut. Where God's Own Country was bleak, darkly funny and thrilling, Waterline is bleak, bleak, bleak. That isn't to say it's bad: it is an incredibly powerful and emotive novel and packs a punch like nothing else.Mick Little is a middle-aged Glasgow cabbie, a former shipbuilder and father to two adult sons, one emotionally distant and the other literally distant (living in Australia). The book opens in the immediate aftermath of the death of Mick's wife, Cathy, which has affected him profoundly. Initially, the story explores Mick's attempts to come to terms with his grief: his struggle to make a connection with his uncommunicative son Craig, his retreating memories of Cathy, his pathetic, faltering attempts to look after himself. I have to confess that at this point, I was fighting off boredom and was unsure whether the book was for me. If you happen to read it and have the same concerns, stick with it - the plot gets far more interesting, and much darker, as it goes along. Written in the third person, but using Mick's own Glasgow dialect, the narrative follows our protagonist as he impulsively journeys to London and finds himself working illegally in a hotel. Mick's pride prevents him from even considering going on the dole to be an option, but increasing desperation to scrape a living forces him further and further down the food chain.Occasionally, the novel dips into brief asides exploring the perspective of different characters. These characters are typically never heard from again, but the point is not that they have anything to contribute themselves - they represent the reader, or at least how the reader might view Mick if he or she were to step into the character's life without knowing any of his backstory. Through these snippets, we are forced to question our perceptions of the homeless and destitute - how many of us stop to think about how such people have come to end up in this desperate situation? The anonymous observers certainly don't, dismissing Mick as crazy, threatening or an object of ridicule, or simply ignoring his existence. While Raisin's narrative isn't explicitly making a political point, there is an undercurrent of political commentary which is presented as an integral part of Mick's working-class identity. I found it particularly poignant that the story highlights the importance of charity services - soup kitchens, hostels, support workers - in restoring some hope to Mick's life, at a time when many of these services are facing debilitating cuts in funding.Devastating, shocking, moving, timely, significant - Waterline lives up to all of these superlatives and more, but it's a tremendously harrowing and difficult read. I think this is one of the reasons I powered through it so quickly: had I stopped, I might have felt too emotionally exhausted to go back to it. Because it was often hard to read and more thought-provoking than entertaining, I didn't enjoy this anywhere near as much as God's Own Country, but I think it is an important book and one that confirms Raisin's exceptional talent. I hope Waterline earns the author a clutch of award nominations, and I can't wait to watch his career unfold in the future.PS: this excellent review by Alan Garner from the Guardian is worth a look - http://www.guardian.co.uk/books/2011/..."}, {"userName": "Patrick", "userReviewDate": "Feb 15, 2017", "userURL": "http://www.goodreads.com/user/show/36235386-patrick", "userReview": "At times bleak and despairing a novel about grief,depression,families and friends.Set initially in working class Glasgow the scene then shifts South to London where we encounter the world of the homeless.Parts of this section were laboured and repetitive I found.This novel is well written,permeated with humour and phrased in vernacular of Glasgow.Four stars."}, {"userName": "Amy", "userReviewDate": "Oct 12, 2011", "userURL": "http://www.goodreads.com/user/show/3096541-amy", "userReview": "“And see if he did put a claim in then the reminders would be there the whole time—for months, years, however long it took—and even that is still ignoring the main thing: why should he get a windfall? Him that brought it into the house and handed her the overalls to wash and here’s two hundred grand, pal, take it, it’s yours—you deserve it.”After the death of his wife to mesothelioma, Mick has to start his life over, struggling with the guilt from her death attributable to residue from his job in the shipyards. While his children hint at getting a settlement, to punish the company that virtually saturated their employees in asbestos, Mick resists any idea of what he imagines a payoff for her death. While the story proceeds with his descent into grief, it never plays into the stereotype of the grieving widower who travels through five stages of grief to recover and find love again with a sweet old lady down the street. Instead, his journey is literal. Unable, emotionally, to reside in the house anymore, he starts sleeping in a shed outside, and his focus changes to minor things to avoid thinking about the bigger issues. He begins finding a kinship more with the birds he feeds than with other humans.“He listens, enjoying the sound of it, as they begin skittering on the concrete outside the shed door...Until recently there’d been just the one – probably the same patient guy that’s been coming all the while –but he’s obvious gone and let dab to all his mates that they can come and eat here, and now there’s a whole mob of them. Good for him, no keeping it all to himself. Obviously no an English bird. A genuine Southsider, that sparrow. “The quote above reveals a wry humor that Mick has, told in his warm Glasgow accent. It’s revealed again as he’s run out of money, and thinks about the possibility of asking his brother-in-law for money:“…he’d be pure delighted, guaranteed. A great song and dance over it, the ceremonious fetching of the chequebook, the smug showy putting on of the wee reading glasses. How much would you like, Mick? Really, it’s not a problem. How much?”Instead of resorting to that indignation, Mick chooses another option: complete departure, from both Glasgow and reality. He ends up in London living a life he’d never imagined, and one that he hopes to hide from his sons left behind, who know nothing of his location.Mick’s voice is full of irony and desperate humor, especially when he remarks on the cheap condolences friends make when they see him. He’s a realist that knows far too well how little people really feel about his loss. In this many vivid side characters are pulled in, and while they don’t appear long, they are memorable for the way they are described. Midway through the novel I glanced at the author’s photograph in the back. It stopped me in my tracks. It’s a young guy that wrote this aged voice! It sort of put me off, for a day anyway, because I couldn’t imagine how a young man (anyone younger than me qualifies in that regard) could create such a complex persona that melds humor, regret, guilt, and anxiety in one realistic character. Topping it off is the Scottish voice that Mick delivers his thoughts in; sometimes an accent is hard to read because it doesn't flow, but in this case it was much of the charm. (Would make a killer audiobook!)Especially noteworthy is that while it is essentially a quest motif, the fact that neither the reader nor the protagonist knows the object that is being sought makes it mysterious. The pace speeds up as you literally follow Mick through a labyrinth of people and places, and you really don’t know where he’s headed. And the questions continue to plague you: what happened to his sons? Who were the men at the door? Will he go back to Glasgow? What was up with Craig?This is on target for my top five titles of 2011. Not only because of the main character and the plot, but also because of what it reveals about those living outside the margins of society. While the underbelly of large cities is often presented as a place of crime and prostitution, Waterline exposes the remote lives of immigrants and the homeless, attempting to live an honorable life while no one wants to meet their eyes."}, {"userName": "Carol Peters", "userReviewDate": "Dec 28, 2017", "userURL": "http://www.goodreads.com/user/show/33120943-carol-peters", "userReview": "Boring."}, {"userName": "Lisa ", "userReviewDate": "Jun 15, 2012", "userURL": "http://www.goodreads.com/user/show/3437180-lisa", "userReview": "Ross Raisin does a fine line in dark and deep. His first novel was shortlisted for nine literary awards and I'd go so far as to say this will follow.It details the downward spiral of Mick after his wife dies from methothelioma - a condition he blames himself for from his time working on the shipyards, bringing the dust back home. We meet Mick and his family at the funeral; Craig, his taciturn son who says little to his father and feels a lot for his dead mother and Robbie, the younger son who now lives in Australia and reluctantly leaves his father to his new widower life.With the guilt of his wfe's death pressing down on him and no way to find a lead into this new life that he doesn't want - old friends and colleagues think to leave him to himself is helping him, he can't get his old job back and money is running out - Mick withdraws from life as he knew it and eventually heads for London.From a job as a kitchen porter to prowling the streets of London looking for a dry place to sleep we follow Mick as his grief and guilt for his wife take a good hold that never dissipates.A harrowing but truthful account of sadly, an all too famiiar tale of these times. Ross depicts a picture that shows clearly how any decent, hard working person can become a victim of the times and end up in this situation. He never prettifies this picture, it is dark and gloomy and it's hard to get out of; the horrific facts are drawn out with no drama or build up, it is how it is and that makes the impact resonate more thoroughly.Mick is a Glaswegian, no nonsense fella, he's a working man and proud; his voice comes across as such, never feeling sorry for himself, living life one day to the next but the guilt over his wife never assauges. He comes across as a likeable man, sunk deep into depression but never bitter. He comes to rely on 'Beans' and the partnership of the two men adds a little ironic warmth to the story although it also intensifies the grimness of it too.After reading this I defy anyone to look at 'down-and-out' people the same way. It's quite heart rending to know that so many people are out there in this situation and are looked down upon when in actuality they are humans that have had a rough time and need a little compassion from those that have. No one knows their story and assumptions are easy to make.The whole story, from the asbestos cover up in the shipyards, to the shipyards closing, but always working at whatever comes along, to the death from the asbestos is the story of many people showing how politics and greed affect lives and Ross has taken it that one step further where most imaginations won't go and shown us how much farther that story can and does go.Fabulous prose that really gets into Mick's head and eats away at the readers conscience.Don't expect a happy ending, by now, we now that's not what Ross Raisin deals with but do expect to be stunned by the detail and grimness thereof. You'll come away from this book feeling a little dirty, probably relieved and most likely a bit guilty but you will keep thinking about it."}, {"userName": "Sarah", "userReviewDate": "Sep 25, 2012", "userURL": "http://www.goodreads.com/user/show/9889525-sarah", "userReview": "Following the descent of a recently widowed man into homelessness, Waterline is my read of the year so far. The grief and terror Raisin depicts as Mick attempts to process the death of his wife and manage his new life on the streets is truly moving. Much like God's Own Country this novel focuses on themes of isolation and withdrawal, or rejection, from society. The narrative switches from Mick's voice to outsiders, such as the reader, who encounter the homeless on a daily basis but keep their eyes to the ground. In many ways the narrative structure feels like a telling off: a reminder that the homeless haven't always been homeless. The outside judgements are interspersed with Mick's mundane but touching flashbacks of his 'old' life, his wife chopping vegetables or sifting through clothing rails. The sense of despair is countered somewhat by Raisin's positive description of the support offered by homeless and religious organisations ('the hallelujahs') and charities. Providing basic care is one means of support the charities offer but importantly they also serve to bring the isolated individuals together. The friendships, albeit fleeting, Mick makes whilst working at the hotel and with fellow homeless man Beans, are one of the most successful elements of the novel. As in God's Own Country, Raisin's handling of dialect is masterful and gives the novel a great deal of momentum. The Glaswegian vernacular is engaging and his use of colloqulliasms against the London setting adds a powerful emotive element to the story. Waterline forces the reader to recognize the voice of the very people they pretend to neither hear nor see everyday."}, {"userName": "Bettie☯", "userReviewDate": "Jul 09, 2011", "userURL": "http://www.goodreads.com/user/show/1108123-bettie", "userReview": "Book at bedtime: Ross Raisin's long-awaited new novel after the success of his prize-winning debut 'God's Own Country'.'The sun is on his face, and he spots the postie turning in through the gate... He is awake, that's obvious enough, but he has this sense of unrealness. That it's him that's not real. That's aye what it feels like. As if all these goings on around him - the sunshine, the television still quietly on, the post tummelling onto the mat - they are all part of some other life, one that he can see, but he's no a part of.'After the death of his beloved wife Cathy, ex-Glasgow shipbuilder and union man, Mick Little finds himself struggling. The shipyard's gone and with it his old way of life, and now his wife too. With the ties that bound him to his old life suddenly loosened, he sets about finding a new way to live. Tracing Mick's journey from his old life in Glasgow to the harsh, alien world of a hotel kitchen, to the rough streets of London, this is an intensely moving portrait of a life being lived all around us, and a story for our times.Today: Mick's new life down in London begins with a gruelling job in the bleak surroundings of a London airport.'God's Own Country' was nominated for eight major awards, winning the Betty Trask and the Sunday Times Young Writer of the Year awards.Reader: Alexander MortonAbridger: Sally MarmionProducer: Justine Willett."}, {"userName": "Alan", "userReviewDate": "Jul 04, 2011", "userURL": "http://www.goodreads.com/user/show/698826-alan", "userReview": "got a good review at the weekend from various papers and I really liked his first novel 'God's Own Country'.I am tempted to give it 5 stars because it ended up a moving account of one man's descent into poverty and homelessness after the shock of his wife's death. He is an ex Clydebank shipbuilder, and feels guilty because he has caused her death through the asbestos he brought home on/in his clothes. Unable to cope with the grief anf guilt and too proud to go on the dole (on the broo) or to claim compensation he 'runs off' to London where he works in a hotel with immigrant workers. Losing that job he becomes homeless, drinking 'superlager' and eventually begging at atube station before getting a place in a hostel. It has none of the exuberance, humour or punch of God's Own Country, instead it is a somber and detailed description of decline, a very different read. Although his book is partly set in Scotland and his protagonist Scottish I think with Raisin, McGregor, and Cartwright we are seeing a wave of English writers tackling 'working class' problems in the way that Scottish writers (Kelman, Welsh, Warner) have been doing for some time. Long may it continue."}, {"userName": "Tuck", "userReviewDate": "Dec 20, 2012", "userURL": "http://www.goodreads.com/user/show/565487-tuck", "userReview": "really great novel about family man who loses his wife, his job, his sons' loves, his respect and selfworth, then goes to the streets and lives rough and nobody knows where he went. his family finally tracks him down and he screws up the courage to meet his sons again, or so we suppose. the ending is a bit ambiguous in only that we know someone died, alone. but then, don;t we all?brilliant pacing, controlled descriptions of uncontrolled decent into illegitimacy. story itself reminds me of izzo's A Sun For The Dying but raisin writes to me like ondaatje The Cat's Table coetzee Summertime banville Ancient Light while so far anyway, really really addressing marginal and poor folks, farmers, drunks, fuckups, ship builders, social workers,i hope ross raisin can hang in there as i would love to read his best novel of the year soon."}, {"userName": "Elizabeth", "userReviewDate": "May 05, 2012", "userURL": "http://www.goodreads.com/user/show/9285345-elizabeth", "userReview": "I had to read this for my book club. Please don't ask me to read it again, ever. I was the only person at the group who did not rave about it's realism, and how it changed their view of guilt (because his asbestos covered clothes gave his wife cancer), depressed (due to being widowed) and homelessness (because he lost the plot of who cared about him and would have supported him in his guilt & grief if only he had TOLD THEM).The best section was how social workers tried to connect with him, and help. The funniest bits involved his weird friend among the homeless in London, good old Beans."}, {"userName": "Paul Servini", "userReviewDate": "Aug 12, 2011", "userURL": "http://www.goodreads.com/user/show/2708232-paul-servini", "userReview": "Had this recommended to me through radio 4's Open Book programme. I loved the sensitivity with which the author paints the portrait of his lead character."}, {"userName": "Ron", "userReviewDate": "Aug 29, 2016", "userURL": "http://www.goodreads.com/user/show/52000217-ron", "userReview": "Well written; but gruelling story. I could only read it in small doses"}, {"userName": "Tolkien InMySleep", "userReviewDate": "Apr 21, 2018", "userURL": "http://www.goodreads.com/user/show/37012198-tolkien-inmysleep", "userReview": "I didn't think I was going to like this book after 50 pages or so, but it definitely drew me in. One man's journey from guilt-ridden grief in Glasgow to alcohol-dependant homelessness in London brought up a lot of personal stuff around emotional withdrawal. Not a book I'm likely to read again, mind."}, {"userName": "Irene", "userReviewDate": "Jan 25, 2018", "userURL": "http://www.goodreads.com/user/show/75944478-irene", "userReview": "I loved this book, despite my reservations at the beginning. What an insightful exploration of grief, male relationships and homelessness. I was challenged and moved in equal measure. Would highly recommend."}, {"userName": "Shaun", "userReviewDate": "May 09, 2018", "userURL": "http://www.goodreads.com/user/show/7807748-shaun", "userReview": "What a sad, sad book. I doesn't feel like much at first then then becomes a page-turner. My second read by Ross Raisin and like his style."}, {"userName": "Just This", "userReviewDate": "May 17, 2017", "userURL": "http://www.goodreads.com/user/show/1539554-just-this", "userReview": "sad, personal, idiosyncratic. written in mild glasgae. it's no In God's own Country but it's an enjoyable read for the same reasons."}, {"userName": "Garry", "userReviewDate": "Jun 04, 2013", "userURL": "http://www.goodreads.com/user/show/4480042-garry", "userReview": "A waterline is the marking on a ship that shows where it sinks to. Mick was a Glasgow shipbuilder at one time, before the industry went belly-up. It was there that he picked up the asbestos fibres that eventually killed his wife. Memories of her washing clothes coated in fibres, of shaking the fibres out the front door mat, haunt him. Fueled by guilt and depression, Mick sinks below the waterline.The funeral, the family, the well wishes... it all gets too much and Mick snaps. He up and leaves for the anonymity of London. His descent is both swift and complete, literally reaching the gutter.This is a beautifully written novel. Its prose is tight and economical - it paints its pictures without ever feeling the need to resort to try-hard imagery. There is liberal usage of Scottish grammar and slang - I have found this annoying in other novels, but it felt totally natural in this one.The most striking thing for me was the way in which character development was paced. I found the graph below on a website about making coffee (apparently it describes an inverse sigmoid relationship between caffeine dose and flow for a fixed grind setting), but it perfectly describes Mick's path through Waterline. The initial stages are relatively stable, but there are signs of slippage. The descent is rapid, and only fully stabilises at the very end of the novel. We never see the recovery, but there are signs that it will happen - we are left with a feeling of hope.The reason I sought out this graph is that Waterline feels like a novel in two halves. I loved the first half, but the second half was much harder to read. I realised towards the end of it that I had almost forgotten Mick's Glasgow life. He had fallen so hard and fast that his former self seemed like a world away... And then I realised that the author had been very clever. I, as a reader, felt as disconnected from Mick's past as he was himself. I was no longer hoping for him to recover to his starting point - reconnecting with humanity was enough. This downgrade of dreams, this reevaluation of what it means to be 'successful' will stay with me for a long time.I rate Waterline very highly because it ticks a lot of boxes. And it contains this line....The man's eyes are large and swollen, the top lids delicately folded scrotums."}, {"userName": "Sarah", "userReviewDate": "Apr 26, 2012", "userURL": "http://www.goodreads.com/user/show/436416-sarah", "userReview": "\"So this is grief, well. Sat at the kitchen table with all your joys and your miseries sleeping and snoring about you and you sat there wondering what to do for your breakfast…He closes the eyes and tries picturing her, her face, before that, while she looked healthy still. It’s a blank but, the brain doesn’t want to go there, so he sits with the eyes closed just. A moment of peace. You keep on. What else can you do? You keep on.\"Ross Raisin begins his novel “Waterline” in the midst of a gathering of friends and family — but not an occasion of joy or celebration — rather for the wake of Mick Little’s beloved wife Cathy, who has perished after a long and painful battle with cancer. He stands in his house staring at the sympathy cards acquaintances have sent — at the words that cannot express what so profoundly must be shared — and wonders “what’s next?”Soon the guests begin to depart, and within a week, so too do his sons, his daughter-in-law, as well as the “highlanders,” his wealthy brother and sister-in-law. In the absence of company, Mick begins to determine what, exactly, is next. But this question becomes one with which he cannot answer, as it means planning a future without Cathy, and so he does everything in his power to avoid the question altogether.But with the refusal to make a plan without his wife — with his inability to cope with feelings of responsibility for her death — he is forced to make short-term decisions, such as what to do when the money runs out, where to go when he no longer has work, where to sleep the night when he’s without a bed, or a roof for that matter.As a shipyard worker in Glasgow, Mick understands that it was he that brought home the asbestos that caused his wife’s cancer, and he begins to ask the question we all inevitably ask when a loved one perishes — why them and not me?While Raisin is wise to sprinkle humor in even the most unlikely of situations, if you’re looking for a pick-me-up, I advise you to move on. But if you’re searching for a truly masterful story about the power of grief, as well as the process of pulling one’s life together stitch by bloody stitch, I must say — Raisin is a master of his craft, and the story is not one you’ll soon forget.For more book reviews, please visit www.theornamentedline.wordpress.com."}, {"userName": "JudithAnn", "userReviewDate": "Jun 25, 2012", "userURL": "http://www.goodreads.com/user/show/4207502-judithann", "userReview": "This is a beautiful book. The things in it aren’t pleasant, as Mick has a hard time with the death of his wife. He doesn’t want to live in the Glasgow house where they lived together any longer and moves into the shed in the back garden, before making a more radical move out of Glasgow itself.Mick’s situation is getting more and more desperate. Not only that, mentally he’s not quite there either. He’s tuned out of society for the most part (at some point he realises that Christmas must have come and gone – months ago – without him noticing). First, he looks at others in similar situations as a by-stander, knowing that he’s not at all like them. But of course, slowly he starts to become one of them and more or less gives up on life.But his family is still there (his sons and in-laws) who are willing to help if he wants them to. It was so frustrating to see how Mick wanted to stay away from them as much as possible. They reminded him of a better life and he felt ashamed of himself, too. He felt he could not face them for most of the book.Not a very great deal happens in the book but still it reads quite easily. It’s written beautifully, though, mostly in the form of Mick’s thoughts. As he’s from Glasgow, you’ll find the writing full of the Glaswegian ways of saying things, which takes a little getting used to, but it feels very natural very soon. For instance, “No much” for “Not much” (“No” for “Not” all over, really), sentences ending in “but”: “He would have been the same but.”, “Messages” rather than “Shopping”. Because of the language, it really feels like Mick rather than some third-person narrator speaking and that is quite nice.I felt like I understood Mick and could easily see how he did what he did (or not do). Ross Raisin put down a very believable character that you hope will find his way in life again.I think if you read and enjoyed Dirt by David Vann or The Bee-Loud Glade by Steve Himmer, you’ll also enjoy this book. The story in Waterline is less odd, more likely to happen in reality. Also, Mick is socially isolated rather than physically, whereas in the other books, the men are both.Definitely recommended for lovers of literary fiction!"}, {"userName": "Mac.Hawk", "userReviewDate": "Dec 27, 2016", "userURL": "http://www.goodreads.com/user/show/51802794-mac-hawk", "userReview": "Couldn't get into it, gave up after 1/4 0f the book."}, {"userName": "Sally", "userReviewDate": "Mar 29, 2015", "userURL": "http://www.goodreads.com/user/show/5733902-sally", "userReview": "\"If you start taking down all the things in the place that are fingered with memories, then that's the whole house emptied.\",, 3 April 2015This review is from: Waterline (Kindle Edition)Utterly believable narrative, following Mick Little, once a Glaswegian shipbuilder, now a driver, in the aftermath of his wife's death. From the fairly normal beginning, where he is hanging up condolences cards and his family are staying with him, Mick's life soon disintegrates entirely. As the relatives go home, and his employer has no work for him, Mick finds himself unable to sleep in the house, in debt and increasingly dependent on superlager...Written in dialect (which the reader soon becomes used to,although it took me to the latter part of the book to work out that 'on the broo' translates as 'on the dole' and has nothing to do with alcohol!) which gives a really authentic feel to the writing.Mick tries to distance himself from his memories, from the difficult relationship with his son and from the seemingly patronising attitude of his wife's better-off family, and those around him:\"We've no been thinking about anything else. Really, Mary? Ye sure about that? You've been thinking about what DVDs to watch and that your fence needs a varnish, but no, see, what we've really been thinking about is Cathy and this terrible situation here. That's what's been on our minds the whole time. And have ye gave much thought, Mary, how it's Cathy copped her whack and it's no you?\"The author takes a deprived, depressed character and builds a convincing storyline that engages our sympathies; the postscript tells of the research he did for the book in a centre for the homeless.Every bit as good - in a very different way - to his other work, 'God's own Country'."}, {"userName": "Jan", "userReviewDate": "Oct 02, 2013", "userURL": "http://www.goodreads.com/user/show/16798568-jan", "userReview": "I liked the insightful story despite the labor in reading it & reminded me of Scottish lit of the past, hard to come by in US. I look forward to reading 'Out Backward' for the story and the Yorkshire speech.What happens to community & individuals when a giant industry closes. We follow an man of little education & less ability to verbalize his feelings. His wife has died, there is miscommunication within family - he struggles & falls. I thought of the many street people I've seen in the past, long before the current economic falling worldwide & realize the varied 'legitimate' ways people reach this point.Written in the Glaswegian voice can be difficult to follow even knowing the speech, it took me half the book before the speech became easier to read. A Scots-Eng dictionary is useful. Just a few: Chap the door - knock. Greet - grieve, cry. Keek - look. Crabbit - grumpy. No - not/nae. Aye - yes. Scunner - disagreeable, bad, disgust, dislike. But at the end of a sentence can mean - although. Raisin frequently used older words, not the more current slang like, brilliant, chuffed."}, {"userName": "Mark Walker", "userReviewDate": "Dec 03, 2013", "userURL": "http://www.goodreads.com/user/show/17523782-mark-walker", "userReview": "This is very good. It can be read as a tribute to the people who work with those whose lives have collapsed. It shows what hard and often unrewarding work it is - trying to help people rebuild their lives. The book reminded me in a number of ways of George Orwell's Down and Out in Paris and London. An interesting technique that Ross Raisin uses is to write a small bit from the perspective of an anonymous stranger - this person describes a scene which has a little detail in to show that one of the people they are seeing is Mick, the main character. The role of the Highlanders (Mick's posh relatives) is to show the pecking order ingrained in our society and that as well as the obvious snobbery of looking down at the homeless, there is also inverted snobbery. It doesn't portray any trite solutions to the problem of the disintegration in people's lives, it just asks us to acknowledge that it happens and not to make judgements about people."}, {"userName": "Emmkay", "userReviewDate": "Aug 25, 2014", "userURL": "http://www.goodreads.com/user/show/7135572-emmkay", "userReview": "Knocked me sideways. When the novel opens, Mick, a former shipyard worker, is immersed in the strangeness of having a houseful of relatives after the funeral of his wife, Cathy. We see him interacting with his middle-class in-laws and his grown sons, the one from Australia and the other, more taciturn, living on the other side of town. After they depart, Mick finds himself unable to cope with Cathy's loss but unable to acknowledge his difficulties to others, and he starts what becomes a dramatic slide. Really, really wonderful - on class, economics, the gender dynamic that holds men back from communicating effectively with each other, their partners, or themselves. Also wonderful in the voice that Raisin creates for Mick and his Glaswegian cadences. It was a painful read and I had to put it down and give it a little rest from time to time, but it's rewarding in every way."}, {"userName": "Wwmrsweasleydo", "userReviewDate": "Nov 05, 2014", "userURL": "http://www.goodreads.com/user/show/6330152-wwmrsweasleydo", "userReview": "There is a wonderful depth to the characterisation and the descriptions of places in this book. It is beautifully written. I was hardly phased by the scots dialect after the first couple of pages. That gave it rhythm and added to the feeling that Mick was confiding in me personally. It's a fairly miserable story but it has poetry and there's a hopefulness to be found in every kind act or thought directed Mick's way, whether he's prepared to accept it or not. Raisin successfully pulls us along on a journey where every step feels right and its consequences inevitable, until we find ourselves standing on rock bottom with the central character. There is a rising up after that, but it's not sudden enough to give you the bends and when the book ends Mick has only got to just about having his head above water. Although he's his own worst enemy, I got very fond of Mick."}, {"userName": "Hannah", "userReviewDate": "Mar 24, 2012", "userURL": "http://www.goodreads.com/user/show/970418-hannah", "userReview": "3.5 starsWaterline reads largely like a character study of Mick Little. Mick is a Glaswegian former ship-builder who falls apart when his wife passes away. Unable to complete seemingly simple tasks (going to the shop, speaking to his two sons) he disappears, into the homeless population of London. I kept waiting for some plot resolution in Waterline (i.e. for Mick to reconnect with his devastated & broody son Craig, etc) but that's just not the kind of book Waterline is. Other 'characters' are introduced briefly, but only to set the surrounding scheme for Mick. This can be a little disorienting until you accept that's how the book is written."}, {"userName": "Just", "userReviewDate": "May 17, 2014", "userURL": "http://www.goodreads.com/user/show/31448186-just", "userReview": "I read this book to the end reluctantly. Initially I found it very difficult to deal with the Scottish lilt, which after a while just became irritating. Once Beans was introduced the story became a little more interesting but still it just seemed to go on and on about nothing really. I like the idea that the story shows how easy it is to get into Mike's situation and how difficult to get out of it, but I couldn't understand the need to introduce characters to the story that just didn't add anything. Not really my idea of a good read."}, {"userName": "Sandra", "userReviewDate": "Sep 03, 2015", "userURL": "http://www.goodreads.com/user/show/8882805-sandra", "userReview": "Really, really difficult to rate this. As a convincing, heart-tearing vivid and penetrating piece of fiction, an insight into the life and mind - and voice! - of a man bereaved of wife, job and reason for existing, it could hardly be beaten, and Ross Raisin did a superb job in keeping me turning the pages, but, goodness was it depressing and doom-laden, with a heart-stopping ending. To say I 'loved' it would be a lie. Nevertheless, it is an amazing piece of work."}, {"userName": "Paul", "userReviewDate": "Sep 10, 2011", "userURL": "http://www.goodreads.com/user/show/3844934-paul", "userReview": "Glaswegian ex-shipyard worker struggles after the death of his wife, descending into homelessness, guilt and decay.Cheery summary but realistically imagined and clearly a lot of research has gone into it, which ultimately makes the ending seem a bit trite. Also once or twice the Glasgow patter mis-fired I felt which jarred on my Glaswegian ear, but overall the rhythm and tone of the main character's inner monologue worked well."}, {"userName": "Sally", "userReviewDate": "Feb 14, 2014", "userURL": "http://www.goodreads.com/user/show/27155950-sally", "userReview": "This is quite a disturbing book to read given the subject matter - homelessness, mental health issues and alcoholism. Although I initially disliked it intensely, I finally sat down and got stuck into it, mainly just to finish it. To my surprise, by the end of the novel, I had a great deal of respect for Mick and the effort he and his family made. I only gave it 2 stars as it is a fairly depressing read and the cadence of the text irritated me. Now to read something cheerful!!"}], "description": "Mick Little used to be a shipbuilder in the Glasgow docks. He returned from Australia 30 years ago with his beloved wife Cathy, who longed to be back home. But now Cathy's dead and it's probably his fault. Soon Mick will have to find a new way to live - get a new job, get away, start again, forget everything.", "title": "Waterline", "url": "https://www.goodreads.com/book/show/11076198-waterline", "average": 3.76, "cover": "https://images.gr-assets.com/books/1328377261l/11076198.jpg", "reviews": 42, "authors": [{"url": "https://www.goodreads.com/author/show/1100631.Ross_Raisin", "name": "Ross Raisin"}], "type": ["Fiction", "Cultural", "European Literature"], "outlinks": ["http://www.goodreads.com/book/show/11076198-waterline", "http://www.goodreads.com/book/show/15816521-waterline", "http://www.goodreads.com/book/show/2477196.Out_Backward", "http://www.goodreads.com/book/show/30335538-a-natural", "http://www.goodreads.com/book/show/36205146-read-this-if-you-want-to-be-a-great-writer", "http://www.goodreads.com/book/show/30079450-book-2", "http://www.goodreads.com/book/show/18305962-os-melhores-jovens-escritores-brit-nicos", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}