{"ratings": 8597, "userreviews": [{"userName": "Alexandra Bracken", "userReviewDate": "Oct 25, 2016", "userURL": "http://www.goodreads.com/user/show/2276707-alexandra-bracken", "userReview": "Well I like it ¯\\_(ツ)_/¯Edited to add: If you're in need of a serious recap of PASSENGER before you read WAYFARER, check this out: https://static1.squarespace.com/stati..."}, {"userName": "Christine Riccio", "userReviewDate": "Feb 04, 2017", "userURL": "http://www.goodreads.com/user/show/10093827-christine-riccio", "userReview": "I didn't love it as much as Passenger, but it was beautifully written and the characters are brilliant, thoroughly enjoyed it! Here's my full booktalk: https://www.youtube.com/watch?v=OpKAf..."}, {"userName": "Kat O'Keeffe", "userReviewDate": "Feb 04, 2017", "userURL": "http://www.goodreads.com/user/show/4672379-kat-o-keeffe", "userReview": "Fantastic conclusion to this duology! This series has such a great balance of adventure and romance, and I just love all the history and the beautiful writing! At times I did feel that the pacing was a little off, there were some slow parts, but overall I thoroughly enjoyed this duology. And while this story was complete and I'm very satisfied with it, I STILL WANT MORE! A sequel, a prequel, a spin-off, different characters, whatever -- I just adore this world and this society of time travelers and I could totally go for more!If you want a duology that features time travel and romance and adventure, with lovely writing, a colorful cast of secondary characters, and a satisfying conclusion -- CHECK THIS ONE OUT!"}, {"userName": "Cait • A Page with a View", "userReviewDate": "Jan 05, 2017", "userURL": "http://www.goodreads.com/user/show/47412532-cait-a-page-with-a-view", "userReview": "3.5 stars and I am so torn about whether to round up or down. I like how everything wrapped up, but kind of wanted... more. And again, if you're more into the faster pacing of YA books this might be a bit too slow. It did drag in parts for me even though this story had a ton to cover.These books do such a great job of handling issues with race, gender, and sexuality throughout time (and just oppression in general. Like the book is dedicated \"for all those history has forgotten\"). And the diversity in this book is awesome!Etta and Nicholas were separated for waaaaaay too long in this story, though. I spent most of the story waiting for them to finally see each other again, which made me a bit less interested in whatever was happening at that time. I wasn't as emotionally invested as I wanted to be then and wish I had known their romance wasn't going to be a main focus. And I really wanted to see more between Sophia and Li Min.Alexandra Bracken's writing is so strong and easy to read, though! I think she's an incredibly talented writer and am impressed with the sheer scope of this story. Just the alternate histories and technicalities of time traveling alone were super complicated. So this is just an odd duology for me because I was never particularly invested in the story, yet I REALLY like these characters, the overall idea, and the writing! I think it's a solid 7/10 star read -- I'd recommend it if you like slower, more detailed historical fiction."}, {"userName": "maymay❀", "userReviewDate": "Jan 28, 2018", "userURL": "http://www.goodreads.com/user/show/49148508-maymay", "userReview": "after what felt like 16 years, ive finally completed this book. let it be known your girl aint a quitter.this book wasn't bad but i just slumped 100 times in between and it was loooooonnnnggg bro. RTC ~~~~~~~~~~~~~~~~~~~~~~~~~honestly just looking at the cover improves my day. Buddy read  with my big sister, nutella"}, {"userName": "Alyssa", "userReviewDate": "Feb 12, 2016", "userURL": "http://www.goodreads.com/user/show/8472395-alyssa", "userReview": "4.5 stars.***Review posted on The Eater of Books! blog***Wayfarer by Alexandra BrackenBook Two of the Passenger seriesPublisher: Disney-HyperionPublication Date: January 3, 2017Rating: 4 starsSource: Review copy sent by the publisherSummary (from Goodreads):All Etta Spencer wanted was to make her violin debut when she was thrust into a treacherous world where the struggle for power could alter history. After losing the one thing that would have allowed her to protect the Timeline, and the one person worth fighting for, Etta awakens alone in an unknown place and time, exposed to the threat of the two groups who would rather see her dead than succeed. When help arrives, it comes from the last person Etta ever expected—Julian Ironwood, the Grand Master’s heir who has long been presumed dead, and whose dangerous alliance with a man from Etta’s past could put them both at risk. Meanwhile, Nicholas and Sophia are racing through time in order to locate Etta and the missing astrolabe with Ironwood travelers hot on their trail. They cross paths with a mercenary-for-hire, a cheeky girl named Li Min who quickly develops a flirtation with Sophia. But as the three of them attempt to evade their pursuers, Nicholas soon realizes that one of his companions may have ulterior motives. As Etta and Nicholas fight to make their way back to one another, from Imperial Russia to the Vatican catacombs, time is rapidly shifting and changing into something unrecognizable… and might just run out on both of them.What I Liked:SPOILER-FREE REVIEW. (Unless you haven't read Passenger.)One-line summary: This book is every bit as fascinating, captivating, and thrilling as its predecessor, and a page-turning, satisfying conclusion to the series.I was extremely excited when I received this book early for review, but also wary. It's a long book (500+ pages), and the story is at an intense point (from the end of Passenger). I was nervous to read Wayfarer, because there are so many ways that this book could end, and most of them are bittersweet (or just plain cruel). I'm so happy to say that Wayfarer was incredibly engrossing and it ended rather perfectly - Bracken found a way.This book picks up a little after the end of Passenger. Nicholas and Etta have been separated in time and space. Etta wakes up as a captive of the Thorns, and she meets someone she never thought she'd know. She, Julian Ironwood, and the Thorns set out to secure the astrolabe from Cyrus Ironwood. Meanwhile, Nicholas and Sophia seek help from Rose Linden, only to be turned around several times. Looking for information, the pair accumulate a number of favors they must return. They meet Li Min, a mysterious and secretive traveler who helps them more than once. But Nicholas has one goal, and that is to find Etta. Sophia wants to find the astrolabe. And Li Min knows more than she is letting on. I'm still reeling a little, so bear with me as I go about this review. I've just finished the book and I'm in a pleasant state of shock, partial numbness, and total satisfaction. This book... I don't remember my exact expectations, before starting it. Hoping that Nicholas and Etta would survive and be together? In any case, I'm so pleased by what was written, and its delivery.One thing I do recommend is a reread of Passenger, or checking out some sort of spoiler-filled review or post. Bracken has a spoiler-y graphic available on her website. I wish I had reread Passenger, because besides the ending, I didn't remember a ton of specifics. The good thing was, as I continued to read Wayfarer, I realized that I didn't need to remember too many specifics, because more and more came back to me. At first though, not the case.One of the best parts of this book was the character development and introduction/development of new and smaller characters that had no or little role in Passenger. For example, I thought Sophia played a bigger role in this book - an enormous role. She is the most important \"secondary\" character (arguably a primary character? She doesn't have a narrative in the books though). I understood and liked Sophia so much more, in this book. She seems ruthless and blunt and sometimes harsh, but she is so determined and driven. She is someone you want on your side, because she is a dirty fighter.Julian Ironwood, Nicholas's half-brother, is another secondary character who quickly becomes very important in Wayfarer. He betrayed his grandfather and sought refuge with the Thorns, which is how he and Etta meet. When she wakes up, she tries to escape, and she runs into Julian. Julian is a coward and a runner, but we get to understand him better in this book. He is an idiot and a poor brother, but he learns this and matures a lot, over the course of this book. I enjoyed the presence of Li Min and Henry Hemlock. I won't say much on either of them, but both are vastly important in this book, and play critical roles in pivotal points in the story. I didn't love or hate Li Min, but I adored Henry Hemlock. His interactions with Etta were wonderful.Etta shows her fight and her tenacity in this book! She keeps moving, with grief, guilt, even pain weighing her down. She knows that Nicholas is out there, and she knows that the astrolabe must be found and taken out of the Ironwoods' grasp. Her goals are lofty but she never quits.The same can be said about Nicholas. He wants to find Etta and never stops hunting for information and leads. He and Sophia travel to so many different places and times, and make various (terrible) deals for information, to find Etta. Finding the astrolabe is important but to Nicholas, finding Etta is everything. Nicholas has such a pure and good heart, such upstanding morals. He's a good guy who considers everything, weighs everything, and questions everything. I liked seeing how his mind worked, and I liked seeing him push through pain and doubt.Etta and Nicholas are separated from much of the book, so I can't really say much about physical romance, but their relationship is strong through space and time. It's amazing how they never cease thinking about each other, hoping that the other is alright, and fighting for each other. They do interact at points toward the end of the book, I will say that. I died emotionally no fewer than seventeen times while reading this book. There were times when I actually teared up (my Goodreads statuses are proof). There were some painful parts in this book! Bracken took me on an emotional roller coaster. But for the better!I love the varying settings that Bracken takes us through! Between Etta and Nicholas, we are introduced to so many different times and places. The most interesting, in this book, was probably Carthage, 148 B.C. How intriguing!By the climax of the book, you'll be wondering how on earth Bracken can end this book with something happy or positive. There seems to be no way, with certain revelations about the astrolabe, and a darker force that is at play, and certain deals with devils that are very unfair. But Bracken made the ending worth all of the anguish and agony! I promise. What I Did Not Like:I don't really have much to say here, other than I do wish there had been more Nicholas/Etta interaction! I don't want to spoil anything, but the romantic in me would have loved more interactions. Of any kind. Not really a dislike, but I do recommend a Passenger reread, if that one isn't fresh. For example, I read Passenger over a year ago. A reread might have helped, at least initially. After a certain point in Wayfarer though, some things started to come back.Would I Recommend It:I highly recommend this book, and series! Time-traveling novels can be tricky, and very messy. I haven't read a ton of them, but one of my favorite series of all time happens to be a time-travel series - the Ruby Red trilogy by Kerstin Gier. I can safely add this Passenger duology to those ranks. This is a wonderful, fascinating, and imaginative series! With a very satisfying ending.Rating:4.5 stars. I'm still trying to decide if to round up or down. But rest assured, I loved this book, all 532 pages of it. It is worth the full spectrum of emotions that I experienced! I look forward to reading more from Bracken in the future.Pre-read squees:WHY DID I NOT HAVE THIS ADDED TO MY TBR SHELF AHHHHHHH. My only issue with reviewing/reading ARCs is that you read a book in November, it publishes in January, and you'll be stuck waiting until the next January to read its sequel. -_-Come oooooon, January 2017!!!!!!"}, {"userName": "Beth Hudspeth", "userReviewDate": "Jan 12, 2016", "userURL": "http://www.goodreads.com/user/show/18107143-beth-hudspeth", "userReview": "Y'all, look at this beautiful cover!!!Why did I read Passenger so soon?! I know better than that!NOW, I need to know what happens! Spongebob says please hurry up!"}, {"userName": "alexandra", "userReviewDate": "Apr 01, 2015", "userURL": "http://www.goodreads.com/user/show/6784858-alexandra", "userReview": "3.5/5 ✩ full review to come!i love love love this ending but found the first half of the book confusing. but still, SO GOOD!"}, {"userName": "Trina (Between Chapters)", "userReviewDate": "Mar 26, 2017", "userURL": "http://www.goodreads.com/user/show/9323164-trina-between-chapters", "userReview": "It took me 2 months to read this and it was such an up and down ride. This was my experience:1. Actively reading it and skimming because SO MANY DESCRIPTIONS.2. Taking a break from the book for weeks at a time.3. Dreading picking it back up. 4. Picking it back up and being surprised that I was really into it!5. Got bored again and started skimming.6. Repeat.As far as the ending of this series, I have mixed feelings. I enjoyed the new elements added in this book which added some intrigue to the story, and the ending was pretty satisfactory (although kinda abrupt), but overall I felt the book was just far too long for what actually happened.Honestly, the story is fine, I just hated the writing. I can't even tell you what about the writing didn't work for me, it's just that my eyes glazed over every time I was reading and I wanted to fall asleep. This is the 3rd book by Alexandra Bracken that I've read and I've had the same experience with all of them. Her writing is just not for me."}, {"userName": "✨    jamieson   ✨", "userReviewDate": "Jan 28, 2017", "userURL": "http://www.goodreads.com/user/show/7706640-jamieson", "userReview": "[ thankgod he didn't die bc i would have been so angry (hide spoiler)]"}, {"userName": "Ashley Nuckles", "userReviewDate": "Jan 11, 2017", "userURL": "http://www.goodreads.com/user/show/55308610-ashley-nuckles", "userReview": "DEFINITELY 4.5 STARS!! I don't know where to begin with Wayfarer, honestly. This book was a literally more of a rollercoaster than any book I've read recently! It was addicting and exhilarating and kept me on my toes and had me in tears at the end. I don't think I've ever been the type of person for anything but devastation-tears. This book changed that."}, {"userName": "Dannii Elle", "userReviewDate": "Feb 06, 2017", "userURL": "http://www.goodreads.com/user/show/44487975-dannii-elle", "userReview": "My full review is available on United by Pop.Be still, my beating heart!This contains the tangled stories and twisted histories of the youngest generation of the existing time travelling families. Diverse and disparate as these characters are, they all have a common cause: to relocate the missing astrolabe. This artefact will allow the owner dominion over history's course and, if passed into the wrong hands, could see Earth transgressed from its existing and correct timeline.The characters each travel to a multitude of eras and infamous historical figures, battles and placed are all mentioned over the course of the novel. The sheer volume of information imparted is breathtaking and yet Bracken's lyrical and melodic style of writing carries the readers along the course of the narrative with an ease and grace that belies the density of the plot. The setting was constantly shifting and yet I never felt confused or like I could not conjure each setting in my mind.This has been rejected by many due to the slower pace of the novel but, for me, that was part of the charm of it. The suspense steadily grew and amalgamated until I was gripping the book with white-knuckled fists and literally buzzing with tension. The ending was an emotional release that provided an abundance of tears, both happy and sad, and was the perfect conclusion to a five star duology."}, {"userName": "Summer (buttermybooks)", "userReviewDate": "Dec 19, 2016", "userURL": "http://www.goodreads.com/user/show/21403715-summer-buttermybooks", "userReview": "Oh man. Have you ever read a book that is just *so* good that it knocks you on your ass and you cant read anything else for at least a week? YEP. That is exactly what WAYFARER did to me.I grabbed an early copy of WAYFARER at YallFest in November and all but drove straight home to read it. I had already reread PASSENGER the previous month in preparation for this release so the need to find out what had become of Etta was TOO REAL. And Alex didnt disappoint! The beginning of WAYFARER drops you right into the action and sends you on a mad dash through centuries of alternate timelines and feuding families that will tangle up your heart strings until its knock down drag out conclusion!To say that this is one of the best books of the year would be an understatement. I know some of you will assume that I am only saying this because I am a fan of all of Brackens work, but let me list the reasons why you should believe me: DIVERSITY!!!! PEOPLE FROM ALL WALKS OF LIFE!!!! LGBT COUPLES!!!! UNPROBLEMATIC LOVE INTERESTS (sweet cinnamon roll, Nick) STRONG FEMALE CHARACTERS!!!! CHARACTER DEVELOPMENT!!! (seriously never thought I’d love Sophia) ALTERNATE HISTORY!!!! HOT DADS!!!!! (okay, I am only assuming Henry is hot but, like, really) BANTER!!! (Seriously, I love Julian and his mouth) MORE FOCUS ON FRIENDSHIPS, NOT ROMANCES!!!!!!! (even though yall know i LIVE for the romance, this was refreshing!) PRAGUE!!!!!!!Alright, if that hasn’t convinced you, I will also create a 17 page word document Double Spaced 14pt Font MLA format JUST so you will read this book!!!!!!!"}, {"userName": "Chesca", "userReviewDate": "Sep 20, 2016", "userURL": "http://www.goodreads.com/user/show/35614518-chesca", "userReview": "[fell off a cliff (hide spoiler)]"}, {"userName": "mith", "userReviewDate": "Apr 01, 2014", "userURL": "http://www.goodreads.com/user/show/7621359-mith", "userReview": "you can read this review HERE as well!---Since I've read Bracken's first series--or, rather, the first two books--The Darkest Minds, it was clear that she had the whole writing thing figured out. At least, I thought so. Bracken was talented, and it showed, by how she fleshed out her characters, the complexity of her story lines, and how she had the ability to make you feel with her words.With the Passenger duology, she truly shines in those aspects and more. I absolutely adored Passenger and Wayfarer not only lived up to its predecessor, but it went beyond my expectations.To say \"I loved it\" would feel like an understatement. At moments, it genuinely took my breath away, and it was totally because of the relationships in this book.It goes beyond just Nicholas and Etta in this book; more than just Etta and her mother, Rose. In Wayfarer, there were a few new additions to the cast, and one character actually got a lot more screen time. One of them was Henry, Etta's father.I loved them. So, so, so much. Those two were probably one of the best father-daughter relationships I've ever read about, if not the only touching one. And that was a remarkable feat on its own because not only was Henry introduced in this book, he was only present for a short amount of time. Yet, Bracken managed to depict a wonderful and loving bond between Etta and Henry. My heart absolutely ached for Etta because this was what she'd yearned for her entire life and was unable to experience it. Bracken did a beautiful job with these two.Then there was Nicholas and Sophia, two people who hated each other with a passion. Their journey--wow. It's not that they became friends, no. It's that they managed to save each other, fight for each other, have one another's back, time and time again. They grew to have a mutual respect for one another and the complexity of their companionship was extremely well developed. There were also two other duos that I really liked--Etta & Julian, and Sophia & Li Min. Both Julian and Li Min were new characters and they were so much fun to read about! Etta wasn't having any of his nonsense, while it was interesting how Bracken weaved Sophia and Li Min's arc! I don't want to say too much else away because it's something you should experience!So! I'm finally moving on. About Sophia. Can I just say how much I fell in love with her in this book? She was in Passenger but not as a truly major character or a likeable one either. But in Wayfarer, she truly shines. We not only get her backstory but we see her grow into a more fierce young woman, who, at times, shows her vulnerability. Sophia was already someone to behold and that doesn't change here at all. She quickly grew to become one of my favourite characters!Okay, now for my OTP. Nicholas and Etta, the feelings they give me! My poor darlings go through so much in this book, spending so much of it separated--over 60% of the book!--yet everything they do is to get back to each other. Their loyalty and love for one another was so sweet, so beautiful, and it's so well written!The ending to the series is a strange one, but rather appropriate I think. I honestly had no idea what to expect, but I thought it was a fantastic finale and it definitely pleased me.As always, the places and times mentioned here were wonderfully well done. It definitely shows that Alexandra Bracken did her research--each setting it lush and beautiful!So all of that gushing being gushed, I thought this was beyond excellent. Bracken's writing is practically flawless, in my opinion, and I will always recommend this series! One of the easiest 5 stars I'll ever give, definitely."}, {"userName": "Coreen  (AsThePlotThickens)", "userReviewDate": "Feb 08, 2017", "userURL": "http://www.goodreads.com/user/show/43075248-coreen-astheplotthickens", "userReview": "“Without mistakes and misjudgments we would stagnate. It is no shameful thing to be beaten when outnumbered, not when you were brave enough to try. Nor is a scar or injury something to despair over, for it is a mark that you were strong enough to survive.”\n\nIt is no shameful thing to be beaten when outnumbered but it is shameful to feel emotionally detached to a great novel and I am ashamed.Wayfarer was way better than the Passenger, a lot of things happened in this book. New characters were introduced. New adventures, ordeals and partnership materialized but I still didn't enjoy it as much as I want to.\n\nREASONS why THREE STARS\n\n•The first half of this book was so darn confusing, the timeline structure and the way things work was just too hard to grasp so I ended up dragging myself to finish this one.•This happened, that happened, now what? which means;Too much happened but nothing remotely fascinating.•I don't feel any emotional attachments to the characters —I did feel something but not strong enough to give this novel more than three stars— which is why I am extremely glad to just be done with it.\n\nREDEEMING Qualities\n\n•This book handled social issues so well; things such as racism, gender inequality, sexuality and stereotyping were showcased but also conquered by the characters which makes this book so damn good.•The landscapes; though confusing were the best part of this novel. Every time a character travels through time, landscapes and structures often changes which makes the imagination of the reader go wild with new discoveries.•The ending was as gorgeous as the book cover.I'm planning to reread Wayfarer next year —or the year after that— I don't exactly know when but I will read this again when my mood demands it. ★★★☆☆"}, {"userName": "Gaby", "userReviewDate": "Oct 26, 2016", "userURL": "http://www.goodreads.com/user/show/10653116-gaby", "userReview": "Caution: Read only if seeking extreme wanderlust, adventure, feels/swoons, wibbley wobbley timey whimey-ness, kickass ladies, and MORE.(I actually don't know why you wouldn't want all of those things in your life. Please join me in this book hangover ASAP.)"}, {"userName": "lolo'", "userReviewDate": "Feb 05, 2017", "userURL": "http://www.goodreads.com/user/show/52888957-lolo", "userReview": "HOLY FUCKING SHIZ MAN HOLY FUCKING SHIZ MY HEART IS CRYING."}, {"userName": "Taylor Knight", "userReviewDate": "Feb 04, 2017", "userURL": "http://www.goodreads.com/user/show/12627819-taylor-knight", "userReview": "I loved this book so much! Alexandra Bracken's writing is absolutely amazing and I'll definitely buy any and all books written by her. She has such a great way of putting words together that makes her books so easy to read without being generic and boring.As for the characters, I like Etta but Nicholas is where it's at for me. He's so amazing and he is the star of this duology for me. I also really liked how new characters are introduced to keep the story exciting and interesting. I will say that I was kind of confused for the first 80-90 pages or so. It might be partly because it's been a year since I read Passenger but I've seen a few other people say they were a bit confused as well. Overall, I loved Wayfarer. The concept, the setting, the characters, the writing, everything about this book is expertly written. With diverse characters, awesome action, beautiful writing, and a killer concept, I highly recommend this duology."}, {"userName": "Gabry", "userReviewDate": "Apr 26, 2017", "userURL": "http://www.goodreads.com/user/show/33245151-gabry", "userReview": "4.5 stelline perché la trama, pur essendo bellissima ed originale e ben costruita, è davvero molto confusionaria. Non bisogna distrarsi un attimo altrimenti si perdono le redini. È stata comunque una bellissima lettura ed un'avventura stupenda da vivere con Etta e Nicholas, molto emozionante."}, {"userName": "Jiana", "userReviewDate": "Jan 28, 2018", "userURL": "http://www.goodreads.com/user/show/10502567-jiana", "userReview": "I don't even care if this book disappoints me because the cover is 1) purple 2) beautiful and 3) it looks great on my shelf• Buddy read with coffee •"}, {"userName": "Liv (Stories For Coffee)", "userReviewDate": "Dec 12, 2016", "userURL": "http://www.goodreads.com/user/show/23837960-liv-stories-for-coffee", "userReview": "What a conclusion to one of my most favorite fantasy duologies! This was everything I wanted and more, and I only wish that Wayfarer was lengthier so I could continue glimpsing into these precious characters’ lives. This book left me completely satisfied by wrapping up every loose end and giving each character the ending they deserve. It blew me away and made me fall for Bracken’s beautiful descriptions that were pieced together to create a world that I never wanted to escape.The second novel in the Passenger duology picks up right where we left off in the first novel. Characters are separated from each other through time and must find a way back to one another before chaos ensues. New characters are thrust into this story as the novel progresses, as well! And they all successfully find a special place in my heart because of their quirks and dialogue that I adored. Not only are there more characters, who are incredibly diverse, but there are new settings that are introduced too. Bracken expertly describes each location around the world and time period in a simplistic and realistic way that makes you feel as though you are Nicholas or Etta traveling through time. She writes such wondrous scenes of chaos or peace in ways that made Wayfarer feel like a movie running through my mind, ever changing and evolving into something fantastic.There wasn’t a single detail in this story that I didn’t fall in love with. There were intense action scenes that left me flipping rapidly through pages to see what came next. There were laugh out loud funny lines said by new characters who made the story ten times more interesting with their presence. There were hard hitting lines about racism throughout time that made me so grateful that Bracken included them in this novel in a respectable and realistic way. From the characters to the settings, this book is full of diversity, epic romances, twists and turns that will leave you breathless and wanting more. There is never a dull moment in Wayfarer, and I am so glad that it kept me on my toes the entire time. So much develops from Passenger and makes you wonder what will happen next. This was such a fantastic conclusion to a duology. I could not have asked for more and am grateful that I was left completely satisfied with this ending. I am sure to reread this duology over and over again because I cannot get enough of Etta, Nicholas, and their fantastic race through time."}, {"userName": "Mary", "userReviewDate": "Feb 01, 2018", "userURL": "http://www.goodreads.com/user/show/17156965-mary", "userReview": "2 weeks I spent struggling with this book *sigh*THE GOOD:* POC male main character* interracial relationship* I like how Alex handled time travelling, it made sense to me and I wasn’t constantly in a state of “wait what”* lesbian side characters - SOPHIA IS BAE* it addresses issues like feminism, racism, white privilege - they’re not explored in very much detail, but they’re thereTHE BAD:* TOO. BLOODY. LONG. I struggled for 2 weeks to get through it and it required sheer force of will to do so* confusing at times - it got difficult for me to keep track of all the characters and families and everything that was going on* much of the strength of the first book was in Etta and Nicholas TOGETHER. For 99% of this book they were apart and I was not amused* b o r i n g. like….wow. I just… no* predictable ending. i’m sorry.* Etta did not behave like an 18 year old girl. I was legit shocked at the end of the book when I was reminded that she’s a teenager. What?* So Dramatic™YAY or NAY: um NAY, unless you love overly long, descriptive books that confuse the shit out of you at one point or anotherFavourite quotes:“Because one moment in life does not define a person,“ Li Min said. \"Without mistakes and misjudgments we would stagnate. It is no shameful thing to be beaten when outnumbered, not when you were brave enough to try. Nor is a scar or injury something to despair over, for it is a mark that you were strong enough to survive.”“The worth is in the fight, not the conquest. Do not give up.” ★★To everyone who got this far, thank you for reading and have a wonderful day! Also, feel free to share your thoughts, comment or tell me anything :)Buy it from the Book Depository :)If you liked this stupid review, consider buying me a coffee because it keeps me warm :)"}, {"userName": "Nicklein Mae", "userReviewDate": "Jan 12, 2016", "userURL": "http://www.goodreads.com/user/show/6058998-nicklein-mae", "userReview": "What a beautiful cover! && Julian is alive??? No effing way! I am NOT liking that. I hate him but I think I'd give him a chance to redeem himself. But I'd still hate Sophia though. Jes sayin'."}, {"userName": "Nouf *LostinFantasy*", "userReviewDate": "Jan 13, 2016", "userURL": "http://www.goodreads.com/user/show/33795465-nouf-lostinfantasy", "userReview": "Actual Rating: exactly 4/5.\n\n\"How sad for them, she thought, that they had grown up without any thorns with which to protect themselves.\"\n\nIt's kind of hard to write a review for a sequel when I never did for the first one. (For a great review of book one, you can read my friend Shahad's review of Passenger. So well put, and mirrored my thoughts on it exactly!) But I am so happy to say that Wayfarer turned out to be a wonderful conclusion to Passenger. And that ending...There is so much I love about this duology. Alexandra Bracken wrote such a detailed and wonderfully emotional story. It's as much about time travel as it is about family-ties and heartbreak, love and revenge.((BTW, if you've read Passenger but have trouble remembering the events-- and yeah how the time travel works exactly -- there's a really cool and very helpful recap! https://static1.squarespace.com/stati...))I love time travel stories! And I love the explanation for the characters' time traveling ability here. We get a satisfying idea of how it works in the first book. But in this sequel, the origins behind the astrolabe and the four families is revealed. And the war between the travelers intensifies as they all hunt after the astrolabe. There's the Thorns on one side, Rose on another, Etta, and Nicholas, Cyrus Ironwood, the Shadows and an old sinister threat they never saw coming. Every single one has their own agenda and reason for it.I loved the world-traveling to different points in history that Etta and Nicholas took in the first book. There's even more traveling here! But better yet, in this book, the travelers' actions actually severely impact and shift world events as a result of everyone fighting for their own version of the timeline. And so, Etta and Nicholas are each faced with hard questions and choices, and not one easy option. So, the plot is definitely exciting! Before I talk about the wonderful characters and relationships in this book, I'm going to mention the writing - or rather its pace. The writing is beautiful -- but, in other ways, because of the slow pace, it's also the book's biggest flaw. This book is definitely an improvement on Passenger in terms on pacing, but it still moves a bit slowly at some points with the long descriptions, and also too-long inner monologues every time a character decides on something new. Sometimes you want things to move just a bit faster. Especially, Nicholas and Sophia's journey. I found Etta's parts moving along quicker. But it's worth it to be patient because we get great character development and there's enough action, especially during that explosive climactic part. Still, could have been 50 pages shorter or more, maybe.(If you haven't read Passenger yet, below are a couple of big spoilers for the first book. But don't worry, no big spoilers for Wayfarer).This time, Etta and Nicholas are separated for most of the book, (after the final events in Passenger took Etta away from him). And while I love their romance and partnership and waited for their reunion, that didn't bother me. It gave opportunity for each to move the same story forward with their own journey - Etta meets her father, Henry Hemlock, leader of the Thorns. And Nicholas gets caught up in a deadly deal while trying to find Etta. But the best part about this were \nthe new partnerships\n and character dynamics this provided! And amazing character development for everyone! I wasn't a fan of Sophia in the first book, but in this one, she is a lot more fleshed out and sympathetic, and so badass! She and Nicholas made awesome from-hate-to-friendship partners.It provided some funny moments: \nHe was yanked back by his collar before he could swim closer.\"Would you stop making eyes at that bloody ship? It’s a siege,” Sophia grated at him. “If they catch us, they won’t just kill us; they’ll make a whole show of it. Use our decapitated bodies to boost morale.”Right. Yes. Siege.\nThey go from despising each other and death-threats to being partners who could relate, and friends who become very protective of each other. \n\nAs much as Etta was his heart’s helpmate, Sophia was the sword at his side on the expedition he undertook now.\n\n A new character Li Min - a fellow traveler and female pirate - joins and helps them too. She has a heavy and dark past, but she's a great ally to Sophia and Nicholas. And there's even a bit of romance between her and Sophia. And though it's subtle, it works very well, showing a bit more of Sophia's softer side.\n\nNicholas wondered briefly if it was his destiny to be surrounded by women possessing varying degrees of murderous intent.\n\nAnd Etta gets to know her father, Henry Hemlock, who she's never met, and his side of the traveler family, which make up \"The Thorns\". And it leads her to learn more about her mother, Rose, and her secrets. (Rose is, btw, an amazingly complex anti-herione that deserves more page time --and even her own book).But also she meets Nicholas's spoiled and carefree half-brother, Julian Ironwood who (as was hinted at the end of Passenger) is not dead, and turns out to be a very fun addition to the story! And Etta gets stuck with him on her side of things, and they make a hilarious mismatched pair!\n\"You’re rather handy, Linden-Hemlock-Spencer,” he said. “That was some brilliant teamwork, if I do say so myself.” \"I’m not sure you know what that word means,” Etta managed, her teeth clenched. “You’re the brawn, I’m the brains, kiddo,” he told her. “You don’t need my help with this.”\nAnd some more later - I loved this line:\nShe blinked. “That was… surprisingly useful.” \"As I like to say, always aim to disappoint in life,” Julian said. “That way you’ll never fail to be a delightful surprise when you don’t.” \nAnd, like with Sophia, there's some great character development for Julian!But safe to say - absolutely no love triangles in this! Etta and Nicholas's romantic arc is just as strong even with them apart for so long. But the family dynamics and friendships are just as impactful in this book which was my favorite part.I do wish that the characters that were separated for most of the book and only met near the end had more scenes together - like Henry and Rose (can I get their love story please - I need that special Target edition with their novella!), Nicholas and Julian (I would have liked more resolution there), and a little more of Sophia and Nicholas after everything. But I just want more of these characters because they were all so likable and complex and just wonderful! Overall, I'm happy with this book and conclusion to the story. And I would love for novellas to start appearing showing us what happens next to the characters and more of their journeys! And even if not - the ending of this book was perfect enough! And if you're hesitant to read this because Passenger felt a bit slow-paced then just remember the fun parts of that book (when it started to pick up with the time-traveling), because this book has a lot more of that, and just overall more surprises."}, {"userName": "Jordan (thejordanjournals)", "userReviewDate": "Jan 30, 2017", "userURL": "http://www.goodreads.com/user/show/38806008-jordan-thejordanjournals", "userReview": "The best part of this book was the ending and realizing that I wouldn't have to suffer through another page of it. I really should have spared myself the two weeks I spent reading this and just DNFed it, but I was holding out hope that it would surprise me the way Passenger did in the end. Not the case. This is the third novel I had read from Alexandra Bracken, and I'm pretty sure it will be my last. I have severely struggled through each of her works, which I find painfully slow and full of completely unnecessary background noise and inner thought. I would find myself drifting off or becoming distracted but not realize it for a page and a half. However, I never once had to reread the sections I zoned out during because there was just so much filler crap that I really didn't miss anything important. Bracken really writes oversaturated scenes to try to build atmosphere or characters or who-knows-what, and it just doesn't resonate with me. I had noticed that I struggled with her works in the past, but it wasn't until this book that it became so glaringly apparent that I was not a fan of her writing style. This book could have been half the length that it is.One aspect that I felt was greatly lacking in this second book was the same atmospheric quality the first book had. I remember thinking that the various countries and time periods in history felt very distinct and were beautifully described. I had just wanted more time spent actually time traveling in the first book. In Wayfarer, we get a great deal more time traveling and visit something like 2 dozen locations; but, each location didn't feel as individualistic as they did in Passenger. Everything started to bleed together and feel the same. I couldn't tell a difference from 1919 Russia to 1100 Japan. That atmospheric quality felt totally absent in this book. That was one thing I really liked about Passenger.Now the main characters. The two main characters spend about 400 pages out of this 530 novel on different journeys. Literally. They have absolutely no page time together until the final climax scene at the end. The first book was very heavily focused on their relationship and partnership as they time-traveled together. I think their relationship was a main backbone of Passenger. By the time they finally reunited in Wayfarer, it had been so long that I wasn't even sure why they liked each other anymore. They spend a lot of time fretting over each other's wellbeing, and they both admit that they had only known each other for a month. So with the characters reinforcing that they hadn't actually spent much time together, it made me question why they were going through so much trouble searching for the other. That kind of brings me to my next point: I have no idea what the point of this novel was. The actual plot line was so convoluted with the main characters' inner thoughts and hardships, and the introduction of mystical creatures and organizations, and witches, and the fear of timeline shifts that I don't even know what the basic structure of this plot is. I felt like so much extra nonsense was thrown in there to up the ante and increase the stakes. Without all of that, I don't know how entertaining this book would have been (to think that this book could have been more boring hurts my head). In the end, we don't even learn what exactly set Rose off on this epic mission to save time. We can infer what happened or who came to see her, but it isn't conclusive. All in all, this book was just not for me. The writing style wasn't for me. The plot wasn't for me. Nothing redeemable came out of it in the end, and I honestly wish I would have walked away from it sooner.**My copy of Wayfarer also came with a short story entitled Pathfinder, which focuses on Rose in a 1918 New York City. Below are my thoughts on that novella, which I gave 3/5 stars.This was a rather entertaining sneak peak into the life of Rose as a seventeen year old. I enjoyed reading in her perspective. She is definitely a spitfire and lose cannon, which we see a little glimpse of in the duology. I really enjoyed seeing a little bit of her relationship with Henry as well. Henry is such swoon-worthy characters, and I figured this out in only 30 pages. To be honest, I enjoyed their dynamic and their personalities much more to those of Etta and Nicholas. I kind of wish the series was about Rose and Henry instead. Rose is just such a complex and morally gray character. I wish I would have had more of this story."}, {"userName": "Isaa Jason", "userReviewDate": "Oct 03, 2017", "userURL": "http://www.goodreads.com/user/show/44684680-isaa-jason", "userReview": "• ● ■ 1,8/5 STARS ■ ● •Genre: Young Adult> Fantasy> Time TravelWOW: Still, black main male character.EW: The whole book tbh..POV: 3rd-person, female and male.LOVE TRIANGLE: NopeLOVE INTREST: YesDO I SHIP IT: Not really. I don't really care about it :p__________________✎Review:FINNALLLLYYY I'VE FINISHED THIS BOOK. JEEEEZZ.Okay, book one was better for me. I really didn't like this book. I took me more then 6 months to finish it. And im so sad to say that, because i love Alexandra Bracken. And i really wanted to like these books. But it's just not for me. Not enough happens, it's not the writng style i like. I don't really care about the main charachters. I don't really enjoy time travel. Also feel, like this book was way to long. It felt like Alexandra didn't really know what to do next.. Like, she knew how she wanted to end it, but how did she get there? I liked the beginning of this book. I thought that it was gonne be much better. But no.. Sadly, not at all. The ending of this book is really good. A good ending to a series. Altho i still have some quetions, i feel like it was the best i could get.---------------------♥The Characters:__Etta Spencer:I liked her more in book one. It really felt like she wasn't there in the book. In this book she isn't with Nicholas, so i thought we would really get to know her. But no.. She didn't to anything that 'wow' me. __Nicholas CarterThis guy tho, is a really good writen character. I loved reading his parts, but that was mostly because he was with Sophia. I love was he did in the ending. I don't have much more to say about him. He's smart, so he made smart choises... xd __Sophia IronwoodI love her. Also the fact that she is into girls, is just awesome. Points for Alexandra!This girl is so intresting. I just loved it when she talked. I would not read any more book in this world if they come out, but it is a book about her, i would. I love her that much. __In General: I didn't really care about the most of them. The father of Etta was also very intresting. I wish we had more to see of him. But thats about it. The rest was okay. But maybe thats just me._____________________________■ TV-SHOW OR MOVIE?Yeah, i told you guys in my Passenger review that i would like a movie out of this. And i still think it could work. But im not really like : \"PLEASE PICK THE RIGHT FOR THE MOVIE UP! SOMEONE MAKE THIS IN A MOVIE PLEASEE!' It would be fun if it happend :)________________✧Beste Quotes:\" I wanted to find something that would make my mom proud of me. Something i could excel at\"I really felt the same about that. I love doing things that makes my mom proud of me._____________________________✗Little notes: - Don't read it if you didn't liked the first book. It's not that diffrent. - I think i just don't like time travel. It's always so messy. So maybe that a big part of my dislike.______________-❖REST OF THE SERIES:Passenger series: #1. Passenger #2. Wayfarer <_____________________________Thank for reading :3"}, {"userName": "Theresa", "userReviewDate": "Jan 20, 2017", "userURL": "http://www.goodreads.com/user/show/7822909-theresa", "userReview": "4.7 out of 5 stars! GUYS I'm so sad this series is over because I love t so much! Alex is such an amazing writer and Wayfarer did not disappoint at all, it was just as good if not beret than Passenger for me! I love Alex's writing and I think she is so talented. All of the characters in this book were so well developed and felt so real it's just amazing and hard to put into words just how great it is to read. I highly recommend this series! There are a few things with the time travel that I found hard to really wrap my head around and understand, which is why I have it 4.7, but honestly this is now one of my all time favorite series and it is such a satisfying conclusion!!!!"}, {"userName": "Sharon", "userReviewDate": "Sep 28, 2017", "userURL": "http://www.goodreads.com/user/show/23218431-sharon", "userReview": "[Teenagers and up. (hide spoiler)]"}, {"userName": "Vathna Dany", "userReviewDate": "Mar 06, 2018", "userURL": "http://www.goodreads.com/user/show/66878483-vathna-dany", "userReview": "Actual rating: 4.5 starsOh my, I loved this even more than the first book. Can Alexandra Bracken write a spin-off series featuring some of the other characters? Two books are definitely not enough!RTC"}], "description": "All Etta Spencer wanted was to make her violin debut when she was thrust into a treacherous world where the struggle for power could alter history. After losing the one thing that would have allowed her to protect the Timeline, and the one person worth fighting for, Etta awakens alone in an unknown place and time, exposed to the threat of the two groups who would rather see her dead than succeed. When help arrives, it comes from the last person Etta ever expected—Julian Ironwood, the Grand Master’s heir who has long been presumed dead, and whose dangerous alliance with a man from Etta’s past could put them both at risk. Meanwhile, Nicholas and Sophia are racing through time in order to locate Etta and the missing astrolabe with Ironwood travelers hot on their trail. They cross paths with a mercenary-for-hire, a cheeky girl named Li Min who quickly develops a flirtation with Sophia. But as the three of them attempt to evade their pursuers, Nicholas soon realizes that one of his companions may have ulterior motives. As Etta and Nicholas fight to make their way back to one another, from Imperial Russia to the Vatican catacombs, time is rapidly shifting and changing into something unrecognizable… and might just run out on both of them.", "title": "Wayfarer\n      \n          (Passenger #2)", "url": "http://www.goodreads.com/book/show/20983366-wayfarer", "average": 3.89, "cover": "https://images.gr-assets.com/books/1460655052l/20983366.jpg", "reviews": 1552, "authors": [{"url": "https://www.goodreads.com/author/show/2973783.Alexandra_Bracken", "name": "Alexandra Bracken"}], "type": ["Fantasy", "Young Adult", "Science Fiction", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/20983366-wayfarer", "http://www.goodreads.com/book/show/30343665-wayfarer", "http://www.goodreads.com/book/show/34615666-traveller", "http://www.goodreads.com/book/show/10576365-the-darkest-minds", "http://www.goodreads.com/book/show/16150830-never-fade", "http://www.goodreads.com/book/show/16150831-in-the-afterlight", "http://www.goodreads.com/book/show/20983362-passenger", "http://www.goodreads.com/book/show/18052136-in-time"]}