{"ratings": 18082, "userreviews": [{"userName": "Ariel", "userReviewDate": "Feb 13, 2017", "userURL": "http://www.goodreads.com/user/show/6536286-ariel", "userReview": "This is the kind of book I want to write. Which is a pretty big thing to say, I suppose.What I really appreciated was that Nina LaCour abandoned the idea that a novel has to be entirely plot driven. This is a book about relationships and emotions and I liked being caught up in Marin's brain. I loved that it took place in winter, on an abandoned university campus, where everything amplified Marin's feelings of emptiness and isolation. I like that things like being coloured or queer were present but not plot devices. It all felt real and relevant. I also, and I cannot emphasize this enough, loved Nina LaCour's use of technology. I've made a video all about this, but I'm really irked by teenager representation that doesn't involve the internet or cellphones. Here it was masterfully intertwined. It never took me out of the story, it made it feel more grounded and real. I also loved that the book was short. It told it's story and then it stopped. It never dragged or wasted time. I love brevity, what can I say! I also really enjoyed that there was lots of cross-generational relationships - teenagers, parents, grandparents - because sometimes YA feels like a bizarre teen-only world.I'm giving this 4 stars because I don't think it was my perfect book. I think some of Marin's reactions to things were overly angsty and that there weren't many powerful moments. I said this is the type of book I want to write because it felt like something that Nina LaCour poured herself into, something subtle and strong, a message she wanted to share. It isn't a new favourite for me, but I appreciated it lots."}, {"userName": "Kat O'Keeffe", "userReviewDate": "Mar 29, 2018", "userURL": "http://www.goodreads.com/user/show/4672379-kat-o-keeffe", "userReview": "WOW. this was definitely a slower paced book, but SO beautifully written and very powerful in a quiet kind of way. an emotional and complex exploration of grief and loneliness and healing and disillusionment. i am very much looking forward to reading more by nina lacour, because while i did really like this book, i personally tend to enjoy stories that are more light-hearted, so some of her other books sound a little more my style (like \"everything leads to you\" which i already own so i'm bumping it up the TBR!)if you've loved books by john green and jandy nelson and gayle forman, or if you're in the mood for a gorgeously written book that's both melancholic and healing, i would definitely recommend this!"}, {"userName": "Lola  Reviewer", "userReviewDate": "Mar 17, 2017", "userURL": "http://www.goodreads.com/user/show/14596170-lola-reviewer", "userReview": "This is possibly the prettiest book I’ve held in my hands. As pretty as the picture looks, the hardcover is twice as lovely. So I’m definitely glad I enjoyed the story, because otherwise I would have felt morally obliged to donate the book. Nina LaCour doesn’t write; she paints. Delicately and purposefully. Her words are colors that blend into one another to create a magnificent landscape. This is a book about family, first love, grief and solitude. Before she began college, Marin lived with her grandfather. They weren’t close – so many secrets between them – but they had each other, which was more than Marin could have wished for.But one day, her grandpa dies unexpectedly and Marin is alone in the world again, for the second time since her mother died. Mabel is three thousand miles away, with a new boyfriend, and Marin isn’t ready to open up to anyone.I could feel Marin’s fragility and loneliness in every word. I can’t imagine what it must be like to be without family. It can destroy a person. Tear them to shreds.Fortunately, sensing something is wrong with her friend and former girlfriend, Mabel visits Marin at college for three days. Will this encourage her to talk about her past and feelings?If I had to choose one word to describe this story, I would say it’s ‘‘quiet.’’ Tranquil. Melancholic, even. You must know this is unlike those novels that have dozens of events which form a plot. It’s not about going from point A to point B; it’s about digging up point A and putting its pieces back together. Blog | Youtube | Twitter | Instagram | Google+ | Bloglovin’"}, {"userName": "Melissa ♥ Dog/Wolf Lover ♥ Martin", "userReviewDate": "Mar 27, 2018", "userURL": "http://www.goodreads.com/user/show/17438949-melissa-dog-wolf-lover-martin", "userReview": "This book was everything to me. \n\"'Finish each day and be done with it. You have done what you could. Some blunders and absurdities no doubt crept in; forget them as soon as you can.\"'\n••••••••••\nYou go through life thinking there's so much you need. Your favorite jeans and sweater. The jacket with the faux-fur lining to keep you warm. Your phone and your music and your favorite books. Mascara. Irish Breakfast tea and cappuccinos from Trouble Coffee. You need your yearbooks, every stiffly posed school-dance photo, the notes your friends slipped into your locker. You need the camera you got for your sixteenth birthday and the flowers you dried. You need your notebooks full of the things you learned and don't want to forget. You need your bedspread, white with black diamonds. You need your pillow-it fits the way you sleep. You need magazines promising self-improvement. You need your running shoes and your sandals and your boots. Your grade report from the semester you got straight As. Your prom dress, your shiny earrings, your pendants on delicate chains. You need your underwear, your light-colored bras and your black ones. The dream catcher hanging above your bed. The dozens and dozens of shells in glass jars. The cab was waiting at the station. The airport, I said, but no sound came out. \"The airport,\" I said, and we pulled away. You think you need all of it. Until you leave with only your phone, your wallet, and a picture of your mother.\nFirst off the book cover it one of the best ever. And the inside pages are beautiful too. The front page with the one light in the dorm room speaks so many volumes to me. Marin is trying to make a new life for herself. She has a roommate in college, she's trying to get a job, which she eventually does at a wonderful place, she's just trying to live from day to day. She's alone while everyone is away for the holidays. There are a few left in the dorms but not many. And her best friend Mabel is on her way to see her. What is going to happen? Will Marin share the reasons why she left everything, everyone?I can't believe I have had this book for so long and just now found out what a jem I had. It went straight to my favorites list. Is if for everyone? No. But I'm not everyone. I'm ME. It touches a part of me that made me feel happy/sad/hopeful. Did I cry. Yeah. And that ending. I can't even. How could such a small book pack such a powerful punch to me. I'm going to do some things that were in the book. Just some little things. Everything is in the little things people. EVERYTHING...Mel ♥Melissa Martin's Reading List"}, {"userName": "Nat", "userReviewDate": "Feb 21, 2017", "userURL": "http://www.goodreads.com/user/show/23381142-nat", "userReview": "“The trouble with denial is that when the truth comes, you aren’t ready.”Marin hasn’t spoken to anyone from her old life since the day she left everything behind. No one knows the truth about those final weeks. Not even her best friend, Mabel. But even thousands of miles away from the California coast, at college in New York, Marin still feels the pull of the life and tragedy she’s tried to outrun. Now, months later, alone in an emptied dorm for winter break, Marin waits. Mabel is coming to visit, and Marin will be forced to face everything that’s been left unsaid and finally confront the loneliness that has made a home in her heart.“If our past selves got a glimpse of us now, what would they make of us?”This book came so unexpectedly into my life, but I'm eternally grateful that it did so. There's simply so much to love about We Are Okay that I'm feeling slightly overwhelmed writing this, but thankfully lists exist for me to break it down point by point:• We have a switching narrative between the past and future, which adds tremendously to the ongoing intrigue. Usually with books that have a similar structure, I struggle connecting with either the past or the present but that was not the case with We Are Okay. Far from it, actually. I kept switching my love for the chapters set in the past and those set in the present. • The author gets so many things right. From leaving your home and friends and childhood behind, to tackling loneliness, grief, friendship, f/f love, bisexuality, heartbreak, and talking about books and paintings, positive adult figures, and so much more. But I especially want to address how Marin’s broken longing felt so palpable. I could virtually feel her grief coming off the page, which is by no means an easy feat to achieve in writing.• Speaking of, LaCour's words blew me off the page. I just loved how certain scenes drew a perfectly fitting picture in my mind.Exhibit A:“She leans over our table and turns the sign in the window so that it says CLOSED on the outside. But on our side, perfectly positioned between Mabel’s place and mine, it says OPEN. If this were a short story, it would mean something.”I had to laugh at how witty that passage was.And then hiding my smile at this gentle and still scene following at nighttime:“So I turn over and find Mabel closer to me than I’d realized. I wait a minute there to see if she’ll move away, but she doesn’t. I wrap my arm around her waist, and she relaxes into me. My head nestles in the curve behind her neck; my knees pull up to fit the space behind hers.She might be asleep. I’ll only stay here for a couple of minutes. Only until I thaw completely. Until it’s enough to remind me what it feels like to be close to another person, enough to last me for another span of months. I breathe her in. Tell myself I need to turn away.Soon. But not yet.“Don’t disappear again,” she says. “Okay?”Her hair is soft against my face.“Promise me.”“I promise.”My heart. These two have my heart.• The summer chapters are set in San Francisco, mainly at the beach, which is one of my all-time favorite locations.“Tourists descended onto our beach, sat in our usual places, so we borrowed Ana’s car and crossed the Golden Gate to find a tiny piece of ocean to have for ourselves. We ate fish-and-chips in a dark pub that belonged in a different country, and we collected beach glass instead of shells, and we kissed in the redwoods, we kissed in the water, we kissed in movie theaters all over the city during matinees and late-night showings. We kissed in bookstores and record stores and dressing rooms. We kissed outside of the Lexington because we were too young to get in. We looked inside its doors at all the women there with short hair and long hair, lipstick and tattoos, tight dresses and tight jeans, button-ups and camisoles, and we pictured ourselves among them.”\n• And since Marin’s from San Francisco but moved to NYC for college, the winter chapters set for the perfectly gloomy and quiet atmosphere. And as this books mentions, “It was quiet, maybe, but it wasn’t simple.”• I loved the attention paid to details. You could tell how much the story meant to the author just by little things such as the names of the girls:“Just different enough,” I said.“As usual.”Since we’d met, we had a thing for our names’ symmetry. An M followed by a vowel, then a consonant, then a vowel, then a consonant. We thought it was important. We thought it must have meant something. Like a similar feeling must have passed through our mothers as they named us. Like destiny was at work already. We may have been in different countries, but it was only a matter of time before we would collide into each other.”• And now that I've successfully circled back to my favorites, I have to talk about how stunningly earnest their relationship felt. We get to see them through all the stages: from strangers to friends to lovers to something more to something undefinable and then... And then going back and forth until they find their footing. It was everything I wanted and more. They're so good for one another.• Like I wrote in my review for Queens of Geek, I live for books that write about girls. Girls supporting girls. Girls loving girls. Girls, girls, girls!!! And so this book fulfilled my heart while reading about Marin's remarkable roommate and compassionate new boss and noteworthy best friend.“I look at her. I wish her everything good. A friendly cab driver and short lines through security. A flight with no turbulence and an empty seat next to her. A beautiful Christmas. I wish her more happiness than can fit in a person. I wish her the kind of happiness that spills over.”This is still one of the kindest things I’ve ever read. My eyes are burning again.\n• Side note: the amount of times my eyes teared up while reading was low-key alarming. But it was like I couldn't help it, especially towards the end. Like Marin said, “I was crying, trying not to cry.” We Are Okay is tragic and hopeful and morose and every adjective in the world that will help encompass the beauty of this story.• And last but not least, I delighted in the fact that the families played such a big part in this book. Specifically centering on Mabel's Mexican-American family and how fervently they welcomed Marin with open arms. Ana and Javier are two of the kindest souls and made my heart swell more than once with their words and actions.All in all: I'm beyond grateful that I picked this up on a whim because I don't think I'll find anything like it soon. But I know that I'll look forward to any of Nina LaCour's future works to come out.P.S. This song felt really fitting for the mood this story is conveying (since it also mentions summertime and being seventeen and drinking whiskey). I listened to it on repeat until, to paraphrase this book, its sound turned to nothing.\nNote: I'm an Amazon Affiliate. If you're interested in buying\n We Are Okay, just click on the image below to go through my link. I'll make a small commission!\nThis review and more can be found on my blog."}, {"userName": "softlykaz (on hiatus)", "userReviewDate": "May 29, 2017", "userURL": "http://www.goodreads.com/user/show/42130592-softlykaz-on-hiatus", "userReview": "Do you ever think about a book and then wonder what the last person who also read it and related to it was doing or if they’re okay?Because right now I want to write something but I honestly don't know what to say. My thoughts are lying face down on the floor with passion and I just wish someone could put a blanket over them and tell them they're fine. And I swear it's like  every book makes me sad in a different way but really...it’s all the same. So yeah. I guess I'm just going to keep arranging words until something slips out and everyone claps and someone feels something??\n“I was okay just a moment ago. I will learn how to be okay again.”\n(x)This book was so full of sadness and loneliness that it might as well have been made of it. You're reading and your heart feels like someone is crushing it so slowly with a combine harvester and you just want to lay your head down on a soft bread roll and maybe just be quiet for a bit. You're reading and lying on your side and a little tear trickles into your ear (which is the most tragic of all eye moisture) because you're both sad and dramatic and listening to this song and thinking that your heart would actually envelop Marin in blankets if it had arms or blankets.It goes like this:Marin's story starts and you know something tragic has happened and she's left everything behind but you don't know the whys or the hows. You guess maybe it has something to do with her grandfather and the things left unspoken and unanswered (like the room where she never sat foot and the picture he \"couldn't\" find). Or maybe it was Mabel and somewhere between them walking to the beach in sweats with a blanket and alcohol and sitting on the shore kissing and the three thousand miles she traveled to see her... something went terribly wrong.See at this point, you don't really know Marin's story, but something about her words and feelings resonates with you so accurately, so intimately. There's no tangible plot yet but still... it feels as if someone has dipped their finger in a lake of you and made a ripple that goes on and on and on.Your understand her kind of lonely.The kind of lonely that doesn’t depend on your surroundings, that doesn’t give a shit about the 300 unanswered messages from people that genuinely love and care about you, that is engrained so deep in your soul it’s like you’re permeable and your own skin can’t protect you from it.The kind of lonely that just makes you want to hide inside yourself more, reminding you that you’re just an insignificant blip in the infinite structure of the universe, brought into this physical reality when you wish you could just exist fleshlessly in your head so they can’t see you and you can’t let them down.You understand her kind of sad.The kind of sad where it’s not enough to feel sad, you have to feel guilty for feeling sad because you feel as if you’re manipulating the people around you by being sad, berating yourself for making a separate physical entity stop the process of their life just to make sure your bricks were still up in a wall. When you’re constantly afraid that you’re being too sad, too loudly, too obviously, that you have dug yourself into a bottomless hole of self-pity and the walls are too high to see anyone else’s problems but your own and you're so scared it's going to ruin your relationships with everyone.The kind of sad that is just not fair because you haven't earned it. When your life is in such an objectively good place but then it all comes back at once and there is no escape, you have fallen back into a destructive mindset and you're trying so hard but it keeps pulling you back in and you feel as if you're losing your grip on yourself and you're just going to keep shrinking until you can barely feel yourself there anymore.And something about all of these things combined still makes me feel dangerously close to tears.\n“I thought that it was more likely the opposite. I must have shut grief out. Found it in books. Cried over fiction instead of the truth. The truth was unconfined, unadorned. There was no poetic language to it, no yellow butterflies, no epic floods. There wasn’t a town trapped underwater or generations of men with the same name destined to make the same mistakes. The truth was vast enough to drown in.”\n(x)But what this book tells you is this: you will be okay. That loneliness in the moment is no guarantee of loneliness in the future. That feelings are transient and situations change and we just need to get through this rough patch to the place where things are better. That you can be content and happy but little twinges of sadness will always seep in and it’s okay, because happiness has never been a fixed point in one’s life and life is just a series of challenges and ups and downs and you must learn to go with the flow.That it can be hard and it's another day in the bathroom stall, sobbing for five minutes. Another day of giving in to depression naps in the middle of the day, another day of being unable to graduate from under your duvet. But then happy shows up. And it’s your cat purring on your lap, it’s curling up on the couch for a book, it’s a girl smiling at you on the train, it's a rainy night and blankets and your soul is warm, it’s a lovely comment a stranger left on your review, it’s some stupid meme your friend sent you, it’s finding money in your jeans pockets, it's in coffee shops and bookstores and sunsets and your grandmother's embrace, it’s your best friend coming home from college in two weeks, it’s your otp being canon and an uploaded new chapter of your favorite webcomic.Happy will show up. And you will learn to find it even if it’s not where you expected it.And you will be okay.\n“it’s a dark place, not knowing. It’s difficult to surrender to. But I guess it’s where we live most of the time. I guess it’s where we all live, so maybe it doesn’t have to be so lonely. Maybe I can settle into it, cozy up to it, make a home inside uncertainty.”"}, {"userName": "emma", "userReviewDate": "Jul 14, 2017", "userURL": "http://www.goodreads.com/user/show/32879029-emma", "userReview": "The person who will like this book is a very particular one.If you don’t like character-driven stuff, STAY FAR AWAY FROM THIS BOOK. No, seriously. Leave this review right now, even. There is not even a question of you possibly liking this book. SO GET OUT OF HERE, OKAY?Just kidding. You can stay if you want. But only if it’s for my charming personality and not for a potential recommendation.Okay. Now I am going to try to make A Point that is perched on a very thin line. And I will almost certainly fail ini this endeavor.As someone who writes a lot of negative reviews, I understand that people have varying opinions on books. Duh. That’s, like, part of what makes this whole reviewing thing fun. And even with the books I love most, I try to never be like, “What the hell!!!! It’s illegal for you to give this one star!!!”Except for Alice’s Adventures in Wonderland. Because I’m currently thirty-seven months away from achieving the “sole Goodreads admin” phase of my eighteen-step world domination program, and when that happens it literally will be impossible for you to give one star to the greatest book of all time.If you think about it, I’m really just being considerate.But back to this point I’m procrastinating.Here’s what I’m trying to sidestep, but will eventually just have to come out and say in some way, shape, or form, and I may as well do so succinctly and now:If you don’t like this book, I think you’re wrong.The major complaint I’ve seen about it is that it’s “boring.” And I get that. And like, I’m really sorry, but depression is not exactly a day trip to the amusement park. So it’s not going to rank alongside heists and nefarious plotting and research montages in terms of top-five most entertaining storylines.But that doesn’t mean it’s not an important book.If you don’t want to read a depiction of mourning and depression and a semi-realistically-staged healing process, that’s fair - so just STAY AWAY. Don’t blame the book for being boring. It’s not fun to be depressed.There were bits of the overall depiction that I didn’t like. Things that felt too convenient, or dramatic, or cheesy. There was a strange twist I never understood, and the relationship at the core of the text confused me to no end, and there was maybe a little too much hope. (Depression isn’t there and gone.)But generally, this is one of the better renditions of depression I’ve seen in YA. It’s also so f*cking good at discussing some of the difficulties of going to college. It captures that initial loneliness.(Wow. I’m really making myself excited to start all over again when I start at a whole new college at the end of the summer. Yay, transferring.)Jesus Christ I wish I had a half star. This book was not a three star read, but I’m equally opposed to giving it four, goddamn it.Anyway. I feel preach-y and I hate myself for it and I want to shut up. So I’m just going to say this book is also beautifully written and then throw in some quotes and leave.Bottom line: Only read it if you know what you’re getting into. Because if you two-star it for being boring after reading this review, I get to pinch you.Read the fine print.SOME QUOTES“I wish you more happiness than can fit in a person.”“I could say the night felt magical, but that would be embellishment. That would be romanticization.What it actually felt like was life.” “We were nostalgic for a time that wasn't yet over.” “If only I had something to take the edge off the loneliness. If only lonely were a more accurate word. It should sound much less pretty.”"}, {"userName": "Warda", "userReviewDate": "Apr 21, 2017", "userURL": "http://www.goodreads.com/user/show/30036082-warda", "userReview": "[4.5 stars] I'm crying buckets. I haven't cried this much over a book since I finished reading A Court of Wings and Ruin. This book was stunning. Absolutely stunning. I felt every single word. Some of them were just outright painful, but I was connected, grieving alongside Marin.It is an incredible story about a girl who's coming to terms with the death of her grandfather and her losses in life, which she's experienced so much of so young. Such a short book, but so beautifully impactful."}, {"userName": "Elise (TheBookishActress)", "userReviewDate": "Mar 12, 2018", "userURL": "http://www.goodreads.com/user/show/52545435-elise-thebookishactress", "userReview": "“If only I had something to take the edge off the loneliness. If only lonely were a more accurate word. It should sound much less pretty.”\n\nThis book is a quiet heartbreak.\n It is not an action-packed story, it’s crafted with immense subtlety, it’s not going to make you scream at One Specific Significant line. It is a book to feel, a book to hurt, and a book to heal. The thing I keep coming back to about this book is the \ncharacter development.\n This is a book specifically about the regret of Marin. Marin at once does not want Mabel here, regrets her being here, but also desperately wants Mabel to love her. She has walls up and she wants them down but she is terrified for them to ever come down. Marin has lost everything, including Mabel. Her best friend. Her friend, her maybe something, who she has lost. And let me be clear, it’s not a romance between them. That is what is perhaps the saddest part. I once saw Nina LaCour talk about this, and she said something I thing is really true: being queer and in love with your best friend is different than being straight and in love with your best friend. One is an experience in first love, and one is also that, but with an added experience of fear – not of rejection but of disgust. We have learned to be ashamed of love and we carry that with us, through thick and through thin. This book was very Well Written and very underplayed and somewhat slow. But I think it’s a book worth reading. It won’t leave you quickly. This is a book about learning the people you used to love were something beyond what you believed them to be. It is a book about learning to move on. But I think most of all, it is a book about \nlearning to be with yourself and be with your grief.\n \nI could say the night felt magical, but that would be embellishment. That would be romanticization.What it actually felt like was life.\nI’ve been trying to understand for months how I felt about this book because I think sitting on something like this is absolutely essential. We Are Okay is an incredibly slow, an incredibly quiet, an incredibly subtle story, but thinking back on my experience reading it two years ago, I feel like crying. It means the world. Blog | Goodreads | Twitter | Youtube"}, {"userName": "Elyse", "userReviewDate": "Jun 12, 2017", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "I was drawn to this book from the first time I saw it. Soon after, I saw several 'low' . I was still curious. I knew parts of this book took place in the SF Bay Area... parts in New York....plus I had read that the author, Nina LaCour, lives in Oakland, Ca. I was 'jazzed'. How bad could this book be? NOT BAD AT ALL FOR ME!!!! I LOVE LOVE LOVE THIS BOOK!!!!I read this book slow over 3 days. ----The story takes place over 3 days too! It's a tiny book. It could be read in one or two hours, but that's not how I read it. I knew early on that I didn't want to say goodbye to MARIN!!! I didn't want to leave her... I just wanted to be there - with this young girl as much as possible. I wanted to tell her ---\"I understand the loneliness- the grief - the fears - the emptiness. I related to her and her situation. THIS STORY BROUGHT UP PAST MEMORIES for me..... .....of the summer between my Senior Year in High School and College .....of living alone with only my mother -passing each other like distant roommates. ......years of living in an apt. -- threadbare- just my mother and I. ......I thought of David Vann's book, \"Aquarium\", ... even though the stories are different. This book brought back feelings I had from that powerful book, too. ......I remembered a time - living in Oakland - around the time Martin Luther King died...of not knowing where my mother was for a couple of days - scared and worried.  ......I thought about my grandparents and their pawnshop store on Broadway Ave. in Oakland. I thought about my private time with my 'Gramps' before he died. I was only 7 when he died of a stroke - two years after my dad died of a heart attack.  ......I thought about all the many kids that grow up with with only 1 caretaker-adult. ( especially an only child).  ......I also thought of our own older daughter. ( a sweet happy memory). There was reference to the play \"The Turning of the Screw\", in \"We Are Okay\". Our daughter played the leading female role at the San Jose Rep. She was 12 years old. It was her first equity performance -- phenomenal show -- performances were extended beyond the standard 6 week run.  ........I 'still' wish I didn't have to say goodbye to Marin. I like Mabel too!! To me .... this is close to a perfect book! It may not be for everyone- but for some of us it allows our souls to sing!!! One excerpt: \"It was a summer of trying not to think too deeply. A summer of pretending that the end wasn't coming. A summer I got lost in time, when I rarely knew what day it was, rarely cared about the hour. A summer so bright and warm it made me believe the heat would linger, that there would always be more days, that blood on handkerchiefs was an exercise in stain removal and not a sign of oblivion\". I've already been reading pages again. I absolutely treasure this book!!!!!!Even the 'acknowledgments' .... the touching sharing by author Nina LaCour moved me - and warmed me all over!!!"}, {"userName": "Chelsea (chelseadolling reads)", "userReviewDate": "Oct 02, 2017", "userURL": "http://www.goodreads.com/user/show/16219087-chelsea-chelseadolling-reads", "userReview": "Whyyyyyyy did I put off reading this for so long? I adored it."}, {"userName": "Raeleen Lemay", "userReviewDate": "Feb 10, 2017", "userURL": "http://www.goodreads.com/user/show/3452652-raeleen-lemay", "userReview": "I'll start out by saying that I never originally intended to read this book, but I received a copy in the mail a few days ago from Penguin and it's super short, so I decided to give it a go.(I sort of wish I hadn't)This book was way too over the top on the melodrama for me... It was a very forgettable read, and it's just not the type of book I enjoy to read anymore. If you want to read a great Nina LaCour book, I highly HIGHLY recommend Everything Leads to You because it has a strong plot and great characters, where this one did not in my opinion.The one thing I will say that I really appreciated about this book was how it was super diverse but not in an in-your-face type of way. One of the main characters is a POC, and the two main characters both identify as LGBTQ+, but they don't put labels on themselves and it's never really talked about, but you GET IT. It was all really subtle and natural, and I commend LaCour on that."}, {"userName": "Cait • A Page with a View", "userReviewDate": "Dec 22, 2016", "userURL": "http://www.goodreads.com/user/show/47412532-cait-a-page-with-a-view", "userReview": "3.5 stars. This is a really fast read and focuses on forgiveness, hope, and coming to terms with the past. Marin is alone in her NYC dorm over the winter because she has nowhere else to go... and then Mabel comes to visit her. It's clear that they used to be more than friends but something happened to drive a wedge between Marin and her past. The reader slowly finds out everything as the story goes (it's split between Marin's current life and her past in California).The isolated setting of the dorm in a winter storm painted such an empty, lonely setting to match Marin's mindset and her reasons for her connection with Jane Eyre. You can FEEL the grief in the pages. That mindset is actually one of the reasons I took a star off, though... it was just hard for me to push through. I totally took on her hopelessness and this story wasn't a particularly enjoyable experience for me. BUT the reasons I didn't enjoy it as much would probably be viewed as a strength of this book by most people!I did like how the romance wasn't the focus of the story, yet their relationship still had a lot of depth. And it was nice to see slightly older characters, too. They felt like regular people I would know -- everything they did seemed super normal, so the writing was really strong!Check this out if you like realistic contemporary YA books about dealing with traumatic pasts or just want to see more normal rep for f/f relationships!Thank you to the publisher for sending me an ARC."}, {"userName": "- ̗̀ cinnamon apple ̖́-", "userReviewDate": "May 05, 2018", "userURL": "http://www.goodreads.com/user/show/68941034---cinnamon-apple--", "userReview": "“I was okay just a moment ago. I will learn how to be okay again.”this book feels like a journal to me. i felt like Nina LaCour just ransacked my bedroom and found my nonexistent journal and was like \"hmm well she's sad and gay so let's make a book about that\" and the rest is history.i feel like 2018 is the year i finally read books by the authors i've been wanting to read for years. Maggie, Adam, Schwab, Becky, et cetera. and now, it's nina!! i've been interested in her books ever since Everything Leads to You came out. it's just because i'm a lazy ass who has mood changes and doesn't pick up her anticipated releases until years after. (i swear i'll read you soon <3). i regret nothing after reading this book.this book feels like a safe place for me. it's quietly beautiful, inside and out (look at the cover !!! ohmygod). while i was reading this, i was listening to soft piano, then classic taeyeon, then xxxtentacion's sad songs. you could say i was in tears by the first paragraph. Nina's writing is simple yet impactful. from the suddenness of marin's thoughts, to mabel's concern. everything just felt lovely and this is one of my favorite books so far this year.i think it's because i just relate so so much to marin and how she feels inside. i've felt her kind of loneliness countless of times. where even my favorite book couldn't make me want to crawl out of the hole i've dug myself in. i've felt her kind of sad. to the point where i'm afraid of being too sad, too scared, too loud. if her character was written another way, i feel like i would have given this a lower rating (3.75 stars probably). i've been in the same place as her—i've experienced all the uneasy thoughts and emotions she feels throughout this novel. and i think that's what makes me love this book as much as i do.because, even though it's not even 300 pages, it still impacts you more than any 700+ novel could ever try to do.(x)i loved the rep in this: a latinx bisexual woman, lesbian woman. idk man, i just love when latinx povs are featured in books (and done correctly!) and it made me like the book even more ahhh. i absolutely loved the relationship/friendship between mabel & marin. it was so sad to read, sure, but you could tell they still deeply loved and cared about each other. i loved how mabel was always looking out for marin the best way possible, and how she made marin a better person. i also love how marin grew and how she finally overcame her grief and loneliness!!!! my babiessss.even though the book has an overwhelming sense of loneliness and sorrow, it still tells a message: you will be okay. that the sadness and loneliness you feel deep inside your chest will go away. it will slowly disappear, and happiness will soon take over. i know it may seem impossible, but trust me, it will happen. and that's what We Are Okay shows you.you will be okay.“I wish you more happiness than can fit in a person.”is it slow? yes. does it have plot? barely. is it very character driven? very.if we share at least SOME of the same reading tastes, i'm 97.99% you'll love this. it's a story about a girl who's grieving, who's sad and lonely and filled with too many emotions. and her overcoming it and accepting herself and being OKAY.(x)(also btw, i rec this for literally everyone. please read this book)“And I think of how time passes so differently for different people.”"}, {"userName": "Saania Zee Jamal ϟ", "userReviewDate": "Aug 22, 2016", "userURL": "http://www.goodreads.com/user/show/10376232-saania-zee-jamal", "userReview": "If I were to ever marry a book cover, it would be this one."}, {"userName": "destiny ☠ howling libraries", "userReviewDate": "May 17, 2017", "userURL": "http://www.goodreads.com/user/show/15335689-destiny-howling-libraries", "userReview": "“The trouble with denial is that when the truth comes, you aren't ready.”Winter break has come, and while everyone else has gone home to see families and significant others for a few weeks, Marin would be perfectly content to stay in her dorm room, alone with her grief, pretending that her life from before doesn't exist anymore. Life is never quite that simple, though, and Mabel is coming to visit, shoving her way into Marin's after. Marin has a lot of skeletons in her closet that need to be faced, but can she handle letting go of her denial long enough to heal - and to move forward with Mabel? ---This book is intentionally vague to start off with; you realize very quickly that the grief that Marin is recovering from has something to do with her grandfather, who raised her (as her mother passed away in a surfing incident when Marin was a baby), but it takes a long time to dig into the meat of what happened, and why it was so traumatic that Marin completely ran away from her old life, as well as all of her former friends and loved ones. Due to the ambiguity of the writing, I actually felt like the beginning of the book dragged a little bit. I kept thinking that there was no way that the twist was going to be a big enough one to be worth spending the entire book drawing the scenario out, but without spoiling anything, I will just say that I was pleasantly stunned by the ending.I didn't realize this was an LGBTQ+ book when I picked it up - because I have somehow been living under a rock and had no idea that Nina LaCour was an LGBTQ+ own-voices author - so I was taken off-guard early in the book when the reveal occurred that Mabel was not only a former best friend, but also a former lover; the detail gave a really nice taste of tension to her entire visit, and kept me guessing as to how their relationship would end up.The writing itself was enjoyable, though nothing truly remarkable; Marin is a likable narrator who has made some questionable choices, but not without reason. The way she desperately wants to still be liked by Mabel, despite having been the one to disappear on their friendship, felt so authentic, especially in the way her walls gradually came down. I found myself frequently frustrated by her choices, yet still completely in understanding of why she was making them.I can't say I really recall any parts of this book particularly touching me, making me laugh, making me pause and think, or evoking any other noteworthy opinions - until the ending, when I was completely and fully shattered. I sobbed my way through the last several chapters, and closed the back cover feeling like I had undergone some brutal, but beautiful, catharsis. The ending of this book alone solidified it as a 4-star read for me and put Nina right up near the top of my \"authors I need to read more from\" list.I would recommend We Are Okay to anyone who enjoys a solid YA contemporary about grief, family (blood-related or not), positive lesbian/bi rep, and a heaping dose of heartache."}, {"userName": "prag ✨", "userReviewDate": "Jun 08, 2017", "userURL": "http://www.goodreads.com/user/show/29249069-prag", "userReview": "This is a book about sadness.\nI wonder if we will become okay again. I hope for it.\nThis is a book about sadness. It's a book about pain and loss and love and death. It's about the death of a grandfather. It's about the death of a spirit. It's a book about family - and about Marin's dead mother. It's about Jones and Birdie and Ben and Laney and Hannah and Mabel.\nI wonder if there’s a secret current that connects people who have lost something. Not in the way that everyone loses something, but in the way that undoes your life, undoes your self, so that when you look at your face it isn’t yours anymore.\nThis is a book about sadness. It's a book about getting better. It's a book about taking care of yourself. It's about getting up. And taking help when you can't.\nThere are many ways of being alone. That’s something I know to be true. I breathe in (stars and sky). I breathe out (snow and trees).\nThis is a book about sadness. It's a book about coping with grief. Learning to live with it. About having people to rely on. About being okay.\nWe are okay.\n3.5 stars. (It made me cry.)Queer Book #6 of Pride Month"}, {"userName": "Caroline", "userReviewDate": "Jun 04, 2017", "userURL": "http://www.goodreads.com/user/show/38672507-caroline", "userReview": "16/11/17- Revising my rating to 5 stars instead of 4 because the more I think about this book the more I realise it's one of my favourites of the year (and also I can't stop thinking about it). “I was okay just a moment ago. I will learn how to be okay again.”I'D seen a few reviews of this book which called it 'boring' and I almost let them deter me from reading this. I'm so glad I didn't because honestly this book was lovely and melancholic and strangely beautiful and I genuinely enjoyed reading it!! I can understand why some people would find it boring because it is definitely slow; it isn't a plot heavy book, it's about the main character and her struggle with grief.Grief is such a powerful human experience to read about and the prose in this book completely nailed what it's like to feel alone in the aftermath of a big loss. The setting for the story (an empty university dorm during winter snowstorms) reflected the isolation of the main character Marin and I honestly just found it so beautiful and relatable. In a way it reminded me of a Haruki Murakami book- there was a lot of reflection on life and love and loss. I don't have heaps to say about this book. I definitely recommend it! I think the writing was super beautiful, there were moments that made me tear up. A lot of people wouldn't enjoy it because it is a slower book. Honestly though, it's the kind of book I would love to be able to write (if I was this good at writing) because I think creating a good story just around one character is really impressive."}, {"userName": "Carlos.", "userReviewDate": "Sep 27, 2017", "userURL": "http://www.goodreads.com/user/show/34048559-carlos", "userReview": "Me cuesta la vida darle cinco estrellas a un libro, pero es que este se las merece. Es increíble que un libro te haga sentir tantas cosas en apenas 250 páginas. Y no sé, me ha encantado.Esta es una de las historias más especiales y duras que he leído en mi vida. A pesar de ser tan corto es un libro lento, de los que te van descubriendo cosas poco a poco. De los que te dejan con las ganas, y no descubren toda la verdad hasta el final. O sea, my kind of shit. Me he enamorado de la prota y de su forma de ver el mundo. Que a ver, está muy en la mierda, pero tiene una forma de ser tan soft que me encanta. Ha sido genial poder conocerla y entender que la hace ser como es. Y no sé, que me encanta.Es un libro muy triste. Desde que lo empiezas hasta que lo acabas, te hace sentir triste. Que un libro consiga ese aire de melancolía continuo me encanta. Es que soy un dramas. Y no sé, que me cuesta mucho hablar de libros que disfruto tantísimo. Espero que cuando hable de él en el canal tenga más ordenadas mis ideas y pueda deciros algo más, pero por ahora sólo os digo que lo leáis, coño."}, {"userName": "Cece (ProblemsOfaBookNerd)", "userReviewDate": "Feb 13, 2017", "userURL": "http://www.goodreads.com/user/show/5138611-cece-problemsofabooknerd", "userReview": "*3.5 starsThis is such a hard rating, because the last quarter was incredible, but the middle was definitely a solid 3. I loved the exploration of grief itself. It was done beautifully and I cried multiple times throughout reading this. Nina LaCour has such beautiful writing, I just get frustrated sometimes by her more... tropey moments? She has these plot elements that happen that are so unrealistic and I find myself get frustrated because her writing is incredible and I want the plot to live up to that writing.Anyway, the end was amazing and I sobbed. Marin was a wonderful character and I loved how lonely and aching this entire book felt. And I will be doing a full video review in the next couple of weeks to talk a bit more about how I felt!*Thanks to Penguin Teen for sending along a copy of this book!"}, {"userName": "Stacee", "userReviewDate": "Sep 17, 2016", "userURL": "http://www.goodreads.com/user/show/7359586-stacee", "userReview": "I'm a huge fan of Nina LaCour's words, so as soon as I saw We Are Okay, I downloaded it. I had absolutely no idea what it was about.Marin is a wonderful character. She's spliced into these two versions of herself and I loved getting to know the summer and the winter Marin. The setting of the dorm and the time changing chapters were a perfect way to show how isolated and changed she's become.There are some heartbreaking reveals and yet the ending is so so so hopeful. The prose is gorgeous {but of course, it's Nina} and the friendship between Marin and Mabel is broken and so honest.If you're not reading Nina's words, you should be. And you should start with this one, because I think it's the best thing she's written.**Huge thanks to Dutton Books and Edelweiss for providing the arc in exchange for an honest review**"}, {"userName": "Whitney Atkinson", "userReviewDate": "Jun 14, 2017", "userURL": "http://www.goodreads.com/user/show/14457130-whitney-atkinson", "userReview": "3.75 StarsThis is a very subtle book. It's about grief, regrowing, uncovering truth within your family, and recovery. It was beautiful. The writing was awesome and impactful, the tone of the story was completely dreamlike, and I enjoyed the subject matter.However, it employs a type of storytelling that isn't my favorite--a back and forth jump between \"then\" and \"now\"-- and also, since this book deals a lot with memory and inner monologue rather than action, its pace felt a bit sluggish. I was never enthralled to pick up this book, but that might just be because I got a copy of Whichwood in the mail and decided I wouldn't start it until I finished this one. Either way, I think it's a great story, but it's for someone who wants to read a contemporary with deeper meaning and tragic themes about loss of a family member."}, {"userName": "Nina", "userReviewDate": "Jan 28, 2018", "userURL": "http://www.goodreads.com/user/show/44463467-nina", "userReview": "This book was perfect! It made me laugh. It made me cry. And I'm so glad I finally decided to read it. What I loved the most about 'We Are Okay' was how there were no huge plot twists or other crazy things that were supposed to make this book more \"interesting\". It was just a book about life and it was heartbreaking and beautiful at the same time. I loved the main characters and I loved Nina LaCour's writing style. Long story short, I pretty much loved everything about this book!It's been almost three months since I've last given five stars to a book that I hadn't read before and I sincerely thought something was wrong with me. There were moments during which I thought that I could never really love a book again because for some reason, I just always found something that bothered me about the books. But ultimately, I guess I've just been reading the wrong books because this was a solid five-star read for me!"}, {"userName": "Kelly (and the Book Boar)", "userReviewDate": "Jul 11, 2017", "userURL": "http://www.goodreads.com/user/show/11183856-kelly-and-the-book-boar", "userReview": "Find all of my reviews at: http://52bookminimum.blogspot.com/Over the past week I’ve been bombarded by Goodreaders who are angry I don’t drink the NA Kool-Aid which will force me to 5-Star books that don’t even have a release date yet as well as young humans who can’t understand why a person would ever 1-Star something by their favorite YouTuber. In an attempt to prevent further butthurt (since it appears I kinda sorta read this one wrong as well), allow me to post the following disclaimer:\nFirst things first, this cover is so freaking perfect that it made me hesitate requesting a copy of We Are Okay from the library. Why? Because I assumed it was a graphic novel and my current schedule is pretty much only open to Kindle reading at the moment – proving once again . . . . \nPer usual, I didn’t read the synopsis before starting, but even if I had I think I would have had a rough start. At first I thought the “tragedy” being referenced was going to be of the rapey variety and, pardon me, but rape being turned into a tired trope pretty much makes me want to barf. However, I’m no quitter (or more like I am missing the gene that would allow me to quit) so I continued on and basically ended up reading what amounts to be a pretty standard story of a young woman transitioning into adulthood via her first year far away from home. She’s lonely, she doesn’t know what she wants to be when she grows up, she’s having a bit of a hard time making new friends, she misses the high school love interest she left behind but isn’t sure where they stand. The only thing that makes this different from many teens’ transition to college is that she suffered a loss on top of everything else. The plot is fairly simple without a lot of action. It does the wibbly wobbly between past and present and, for me, the past were the parts that held my interest. I think most people who love this one will love it due to the writing . . . . \n“Someone always dies. It’s just a matter fo who, and when. You remember her with songs, with shrines of shells and flowers and beach glass, with an arm around her daughter, and later, daughters of your own named after her.”\nFor me, though? It was just . . . ."}, {"userName": "Freckles", "userReviewDate": "Sep 25, 2017", "userURL": "http://www.goodreads.com/user/show/3946446-freckles", "userReview": "OMG, já jsem přeložila knihu!Tolik jsem se těšila, až budu mít konečně hotovo, ale teď mám za sebou i poděkování a nějak si neumím představit, co dál. Strávila jsem s Marin a Mabel a ostatními postavami tolik času, že si neumím představit, že mi už nebudou dělat společnost.Když nějakou knihu čtete z pohledu redaktora/korektora, je to trochu jiné počtení, než když ji čtete jako „obyčejní“ čtenáři. Čtete podrobněji a všímáte si věcí, které byste jinak jen přelétli očima. Čtete pomaleji. A když s nějakým příběhem strávíte tolik času, poznáte ho víc do hloubky. Špatné knihy jsou pak mnohem horší a dobré knihy jsou ještě lepší. U překladu tohle platí ještě mnohem víc.Když jsem Všechno je v pohodě četla poprvé, byla jsem spokojená. Ale nebyla jsem úplně odvařená. Prostě fajn příběh, jak jen takhle smutný příběh může být fajn. Byla jsem ráda, že to bude můj první překlad. Bude to v pohodě, myslela jsem si.Když pak kniha vyhrála Printz Award, docela jsem čubrněla. Není to špatná kniha, říkala jsem si. Ale že by byla až tak dobrá? Tak dobrá, že vyhraje nejprestižnější ocenění young adult literatury?Překládala jsem dál. A s každým dalším slovem jsem se víc a víc zamilovávala. Do stylu, do příběhu, do postav, do emocí. Naprosto chápu námitky všech, kteří tvrdí, že se v knize zas tak moc neděje. Dokonce i ty, kteří říkají, že to velké odhalení není žádná bomba. Protože není. Během posledních pár let jsme si jako čtenáři zvykli na traumatické zážitky, sebevraždy, rakovinu, duševní choroby, znásilnění, války a kdovíco ještě. Možná tak moc, že si neuvědomujeme, jak velký dopad můžou mít na život jednotlivce různé „všední“ tragédie. Že je lidem, kterým se to děje, úplně jedno, jak málo je to šokující.Všechno je v pohodě vás tedy spíš nešokuje. Ale když budete číst pozorně, když se necháte unést kouzelným stylem Niny LaCour, možná zjistíte, že vás to dojímá úplně stejně. Přiznávám, že nejsem úplně nestranná, ale na druhou stranu se mi normálně nestává, že by se mi během čtení nesčetněkrát rozmazala písmenka před očima, protože je mi té postavy prostě tak moc líto. Možná je to i tím, s kolika věcmi z tématu se dokážu ztotožnit. Ostatně, kdo si nikdy nepřipadal sám? Kdo nikdy neměl pocit, že přestože je okolo spoustu lidí, nikdo vás doopravdy nevidí? Kdo nikdy neměl pocit, že ho nikdo doopravdy neposlouchá? A teď si představte, že opravdu nikoho nemáte. Jsou Vánoce a vy budete celý měsíc úplně sami. (A kdyby se vám něco stalo, nikomu by to nebylo líto, našeptává malý protivný hlásek v hlavě.) Je hodně druhů samoty, píše se v knize. Jaká je ta vaše?Když čtete knihu, máte deset stránek přečtených třeba za deset minut. Když ji překládáte, strávíte s deseti stranami třeba půl dne. Žijete ve světě s postavami. Prožíváte s nimi jejich trápení. Znáte je líp než sami sebe. Špatné knihy jsou horší, dobré knihy ještě lepší. Tahle byla mnohem, mnohem lepší. Jsem ráda, že to byl můj první překlad. Je mi líto, že už skončila. Ale hlavní je, že nakonec bude všechno v pohodě."}, {"userName": "Tatiana", "userReviewDate": "Feb 16, 2017", "userURL": "http://www.goodreads.com/user/show/2250020-tatiana", "userReview": "The story actually starts out in an interesting way - the MC is staying in a dorm all by herself over the winter break and has all the plans of keeping herself busy - learning meditation, reading, coking, etc. I would totally read a YA novel about staying secluded FOR PLEASURE and enjoying the bliss of disconnecting and being alone for awhile. But alas, We Are Okay is not a book about that, it appears to be about the things well covered by it must be hundreds of YA books about grief and loss. Not interested."}, {"userName": "Suzanne", "userReviewDate": "Jun 28, 2017", "userURL": "http://www.goodreads.com/user/show/4852457-suzanne", "userReview": "This is one of the most beautiful and captivating novels I have EVER read! It really demonstrates how betrayal, heartbreak, and loyalty can change a person to their core. I have not read anything else by LaCour but I will be fixing this soon because her writing is just so beautiful! I recommend this to anyone because it is just an incredible little book."}, {"userName": "Puck", "userReviewDate": "Jun 17, 2017", "userURL": "http://www.goodreads.com/user/show/18562856-puck", "userReview": "An intimate and honest book about grief, We Are Okay tells us about Marin who suffers from the loss of her grandfather four months ago. In silence and in loneliness she keeps the tragedy to herself, but now her childhood friend Mabel comes to visit, Marin finally has to face her past and her emotions. “The trouble with denial is that when the truth comes, you aren't ready.” This is a book about grief, loss, and solitude, but if I had to describe this story in one word, I would say “quiet”. “Melancholic”. The story takes place in New York in a snowy winter, at an empty college campus. Mabel and Marin are the only ones staying there, apart but together, with the past between them like a buried treasure chest. By switching between the college dorm in New York and San Francisco in the summer four months earlier, we slowly dig that chest up, and find out why Marin rather wants to keep things hidden.  “If our past selves got a glimpse of us now, what would they make of us?” But although grief is the main subject, Nina LaCour accurately tells us about many different issues. From leaving your childhood home and your friends behind, discussing literature and art, female friendship, to lesbian romance: with her gentle, beautiful writing the author paints a story that feels so very alive. Slowly Marin’s heavy sorrow will crawl underneath your skin, making you cry only she allows herself to cry, because then you both stop pushing everything away and look the truth in the eye.  “The truth was unconfined, unadorned. There was no poetic language to it, no yellow butterflies, no epic floods. There wasn't a town trapped underwater or generations of men with the same name destined to repeat the same mistakes. The truth was vast enough to drown in.”  I adored all the different relationships in this book. Marin and Gramps, tenderly living together but each hiding many a secret from each other. Marin and her amazing Mexican-American family, with Javier and Ana as one of the kindest people I’ve ever read about. But mostly I loved Marin and Mabel, who go from strangers to friends to lovers to something more undefinable and then…they try to find their footing again.  “Mabel, I want to say. We don't have much time left. Mabel. There is me and there is you and the snow has finished falling. Let's just sit here.” I teared up many times while I was reading, but the last 25% of the book I was completely in tears, from sadness and from happiness. This novel is tragic and hopeful and while not much happens plot-wise, the personal journey you go on (with Marin) is very heartfelt. I’m so glad that I read this and I can’t wait to read more from Nina LaCour in the future.Ps. This song felt very fitting with the story and the emotions that the characters face (my silence is my self-defense), so I’ll leave it here."}, {"userName": "Jennifer", "userReviewDate": "Jun 10, 2017", "userURL": "http://www.goodreads.com/user/show/2473504-jennifer", "userReview": "We Are Okay is a new-adult/young-adult realistic fiction novel written by Nina LaCour. The main character is a new college student but a part of the story is told in flashbacks when she was younger, thus: new-adult/young-adult. This story is complicated and haunting, but is told in a minimal style and the writing is just lovely. It's beautifully lonely if that makes sense. Themes include death, grief, solitude, family, friendship, sexuality, forgiveness, and secrets. After my reading experience, I wasn't depressed or sad. I ended with a sigh and a smile. That's what Ms. LaCour can do despite the heavy themes. I'm so glad I listened to the recent hype. Check it out!My favorite quote:\"How many times do you get the chance to do something over again, to do it over right? You only get to make one first impression, unless the person you meet possesses a rare and specific kind of generosity. Not the kind that gives you the benefit of the doubt, not the kind that says, Once I get to know her better she’ll probably be fine, but the kind that says, No. Unacceptable. The kind that says, You can do better. Now show me.\"6/13/17:Complicated in the most beautiful way ♥️RTC"}, {"userName": "Aliix", "userReviewDate": "Oct 22, 2017", "userURL": "http://www.goodreads.com/user/show/32906167-aliix", "userReview": "Mi corazón llora... Es tan hermoso este libro...Marin ha dejado todo de lado,el clima cálido de la playa, su antigua vida, hasta su mejor amiga Mabel, mientras se replantea su existencia sola en la habitación compartida en aquel crudo invierno,da vueltas en su cabeza todo lo que sucedió meses atrás, espera con angustia e incertidumbre la visita de Mabel, ¿Que suceso ocurrió que la hizo huir repentinamente de casa?¿Por qué Marin rehuye su pasado y evade el dolor?Nina LaCour en menos de 206 paginas nos cuenta la historia de Marin, lo que es la pérdida de quienes amamos,el tener que crecer y tomar decisiones, el dolor. la soledad y el reedescubrimiento de tu identidad cuando los cambios llegan.\"We were miraculous.We were beach creatures. We had treasures in our pockets and each other on our skin.” Darle 5 estrellas es poco, Nina tiene una facilidad de hacerte sentir los sentimientos del personaje, su desesperación, su tristeza y de darnos una historia llena de todo con una naturalidad y calidez bellisima.“I wonder if there's a secret current that connects people who have lost something. Not in the way that everyone loses something, but in the way that undoes your life, undoes your self, so that when you look at your face it isn't yours anymore.”"}], "description": "You go through life thinking there’s so much you need…Until you leave with only your phone, your wallet, and a picture of your mother.Marin hasn’t spoken to anyone from her old life since the day she left everything behind. No one knows the truth about those final weeks. Not even her best friend, Mabel. But even thousands of miles away from the California coast, at college in New York, Marin still feels the pull of the life and tragedy she’s tried to outrun. Now, months later, alone in an emptied dorm for winter break, Marin waits. Mabel is coming to visit, and Marin will be forced to face everything that’s been left unsaid and finally confront the loneliness that has made a home in her heart.", "title": "We Are Okay", "url": "http://www.goodreads.com/book/show/28243032-we-are-okay?from_choice=true", "average": 3.99, "cover": "https://images.gr-assets.com/books/1471899036l/28243032.jpg", "reviews": 3642, "authors": [{"url": "https://www.goodreads.com/author/show/2889003.Nina_LaCour", "name": "Nina LaCour"}], "type": ["Young Adult", "Contemporary", "Lgbt", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/28243032-we-are-okay", "http://www.goodreads.com/book/show/34281321-we-are-okay", "http://www.goodreads.com/book/show/36309075-estamos-okey", "http://www.goodreads.com/book/show/18667779-everything-leads-to-you", "http://www.goodreads.com/book/show/6373717-hold-still", "http://www.goodreads.com/book/show/11699055-the-disenchantments", "http://www.goodreads.com/book/show/27158835-you-know-me-well", "http://www.goodreads.com/book/show/34112478-sneak-peek"]}