{"ratings": 150, "userreviews": [{"userName": "Mrs. Strudthoff", "userReviewDate": "Oct 27, 2014", "userURL": "http://www.goodreads.com/user/show/23401733-mrs-strudthoff", "userReview": "This is the first book in a new series by Lisa Greenwald. The series is called \"Seagate Summers.\"Remy, 11, and her parents spend the summers on Seagate Island. Remy does not deal well with change. She loves traditions and wants everything to stay the same as it always was. So, this summer is more than a little difficult for her. First, her grandmother died so Remy misses having her at Seagate Island this summer. Her dog Danish also died and Remy misses spending time with him at Dog Beach. Then, her two best friends on the island Micayla and Bennett are acting . . . strangely. The three of them always spent their entire days together--just the three of them. Now Micayla seems to be making different friends. And Bennett. Well, Bennett is starting to like to spend time doing \"male\" stuff with his father and other guys and their fathers. Plus, Remy doesn't quite understand why she's acting strangely around Bennett this summer; that's never happened before and she doesn't like it. Sort of by accident, she starts a doggie daycare and asks Micayla and Bennett to help her. They agree, but the business blossoms quickly and they have to enlist the help of the twins who are visiting their grandfather for the summer. Remy isn't real wild about these twins--she thinks they are negative because they constantly put down her beloved Seagate Island.The characters in this book are realistic and I think anyone who has ever been 11-going-on-12 will be able to relate to Remy, her emotions, and her friendships. I think this is a great start to a new series."}, {"userName": "Crowinator", "userReviewDate": "Feb 05, 2014", "userURL": "http://www.goodreads.com/user/show/283407-crowinator", "userReview": "For books that I read professionally as a children's/teen book reviewer, it is near impossible to give a fair star rating on a site like Goodreads, where I want to focus on my personal response to books over my professional. (Unless the book is truly terrible, of course, which is when my personal and professional opinions usually intersect.)Personally, I find this book well-written and heartwarming, but just not my thing. It's contemporary, it has way to much in it about dogs, it has minimal conflict or drama, and it's so very very slow to get going. It's too far outside my reading interests for me to have truly enjoyed reading it. But professionally, as a reviewer and librarian thinking about the appeal for its target audience (which, let's face it, is not 30-something adults who love adult and YA speculative fiction), this is a sweet, sensitive, and safe book for middle grade kids and tweens. I wouldn't hesitate to give it to any young dog-obsessed child or 4th or 5th grade girl on the cusp of dealing with friendship misunderstandings, burgeoning popularity awareness, awkward but innocent crushes, and the wobbly feeling you get when everything you wish would stay the same is changing. The story feels a bit old-fashioned, but I'm willing to concede that I might think so because of my lack of experience with contemporary middle-grade novels (though the fact that the eleven-year-old narrator is on the naive side contributes, too). Maybe it feels old-fashioned to me because it is so gosh-darned gentle. All of Remy's worries are soothed by the end. What makes the gentleness work, though, is that Remy creates her happy ending by learning about her flaws (she is quite judge-y in the beginning), listening to her friends, and taking active steps to fix misunderstandings before they become unfixable.This book is the start of a series that I imagine will focus on Remy's summers on Seagate island and whatever normal, everyday things happen to her and her friends. My personal side is yawning and wishing for robots or explosions or zombies, but the librarian side of me that hands books to kids is happy."}, {"userName": "Rebecca G.", "userReviewDate": "May 22, 2015", "userURL": "http://www.goodreads.com/user/show/35082006-rebecca-g", "userReview": "Welcome to Dog beach is about a girl who has recently lost her dog in a world she calls paradise and now her life is about to fall apart. I rated this book 4 stars because the author could have used more detail on the story. However, I liked the fact that she used appropriate details in the text, that simple detail brought the text together. My overall favorite character would have to be Remy, the main character, because she perseveres through the death of her late grandmother's dog. In conclusion, This book kept me at the edge of my seat waiting for what would happen next. I hope my classmates enjoy this book as much as I did."}, {"userName": "Sophia", "userReviewDate": "Jan 02, 2015", "userURL": "http://www.goodreads.com/user/show/27364914-sophia", "userReview": "I like the main character because she likes dogs like I do. I like the little Yorkie too! The story made me feel happy!"}, {"userName": "Kerry", "userReviewDate": "Aug 12, 2017", "userURL": "http://www.goodreads.com/user/show/14355035-kerry", "userReview": "I'll probably recommend this to my kids (I picked a random kindle book from our library that had \"beach\" in the title to try to find more summer reading list words!). I had no idea it was a book intended for kids until I started reading it. I think that both of my kids (7 and 9) would enjoy it. It's cute."}, {"userName": "Melanie", "userReviewDate": "May 28, 2018", "userURL": "http://www.goodreads.com/user/show/1208986-melanie", "userReview": "Endearing and heartwarming story about a girl grappling with loss and new surprising realizations. Lessons learned on not judging others beforehand and appreciating the present moment. I read this to my daughters who are a little younger than the main character. Made me remember that even in our cell phone culture how certain things stay the same throughout generations with this age group."}, {"userName": "Bella", "userReviewDate": "Oct 06, 2014", "userURL": "http://www.goodreads.com/user/show/34117762-bella", "userReview": "{originally posted on my blog: Ciao Bella}After reading all of Lisa Greenwald’s books, I think it is safe for me to say that she is the queen {or, at the very least, one of many :)} of middle grade realistic fiction. She has nailed the perfect combination of developed main characters, true-to-life friendships, adorable budding romances, and entertaining problems and solutions! Really, it’s more of a case of when to read her novels rather than if. Welcome to Dog Beach, her most recent release, follows up in the success of her past books, and I am excited to see what the rest of this series will bring.Remy has always enjoyed staying on Seagate with her family and friends each summer. From the annual trivia contest to the Seagate Halloween celebration near Labor Day, there’s no shortage of traditions that make her favorite place so special. However, growing up brings along change, like new neighbors, new feelings, and new ideas, all of which Remy is not so sure she wants to deal with. I’ve found that realistic fiction best captures the difficulties of growing up; here, Greenwald tackles a topic that everyone has had to dealt with at some point: change. It’s clear to the reader from the very first chapter that Remy is someone who thrives on consistency and who will doubt herself when something different comes along. While older readers may be shaking their head at times due to the pre-teen drama, I have no doubt that younger audiences will relate to Remy’s anxious feelings about friendship fights and first crushes. Her instant connection with readers coupled with the author’s terrific development makes Remy a character who’s hard to forget.What I usually love most about small beach town stories is that you often feel as if you’re a member of the community! Greenwald introduces a large cast of supporting characters, and while not all have major roles in the story, each manage to leave their mark in Seagate. You’ll smile when you read of a new relationship and grimace at the grumpy café owner. You’ll sympathize with the new mom and disapprove of the moody tweens. It’s not a long book, so their time may have been short in this one, but I hope to see the more memorable citizens of Seagate again in Book Two. I will say that some of the older secondary characters lack the depth I wished to see; it sometime seemed as if they were only there to teach Remy an important life lesson.The plot is oh-so sweet, involving classic MG material, such as the ups and downs of new {and old!} friendships, but it also takes on deeper themes, like grieving over the death of a beloved relative and pet. While I enjoyed the story, I think it could have been made even stronger if more attention was put on Remy’s grieving instead of all of the tension that came with her “drama queen” attitude. Nevertheless, the pacing was spot-on, the dialogue was perfect for the character’s age, and thankfully, you realize quite a growth in Remy’s character by the very end.Overall, Lisa Greenwald lived up to my high expectations! I have a soft spot for beach towns, but one look at the development of the protagonist, the supporting characters, and the plot should tell you that it’s a worthwhile read for anyone. The second book couldn’t come out soon enough."}, {"userName": "Amy", "userReviewDate": "Feb 06, 2014", "userURL": "http://www.goodreads.com/user/show/10588534-amy", "userReview": "I won an advanced reader edition of this book and the reason I entered the contest is that I am hoping to introduce my niece to her first chapter books. According to the description, it is a book about a twelve year old girl who is trying to come to terms with the loss of her grandmother and her dog and the changing dynamics of friendships. I thought this would be a fantastic book for my niece to start reading because she recently lost a pet and she's young enough that she's still friends with boys without the stigma of being \"in love\", though I am sure that will change soon. It was good, but I'm not sure it's something I should be encouraging my \"pre-teen\" niece to read. I feel like she is already exposed to a lot of pressure from her peers and the mindset of superficial \"pre-teen\" drama, I dont need to add fuel to the fire with a book about those exact things. Maybe I will hang onto it and re-read it in a couple years to see if I think its something she could relate to. I did like the fact that Remy, the young voice of the book tries to be a good person and a good friend, but for the first half of the book I kept thinking \"This girl is spoiled and self centered!\" Finally, Remy's friend tells her she is self centered with explodes into their first \"fight.\" While I appreciate that the book discusses real life drama among young people today, I think they are exposed to enough of that already. I was kind of hoping for this book to be overly sappy and sweet, about a little girl who misses her dog but grows up accept the loss and perhaps find a new friend to share her time. It ends up being a lot more \"poor me...me...me\" Bottom line, I came to not like Remy and I am an adult so I feel silly saying that! HA! She does redeem herself in the end and I think she portrays a good message. I also got jaded with the redundancy of the \"the scream.\" I like the concept of what Lisa Greenwald was trying to portray there... to help an old man connect with the younger generation, but I thought the idea of \"a scream\" was lame and didn't make much sense. I think the \"talent\" could have been more substantial and meaningful than just a noise. I kind of got sick of reading about it. I can imagine my niece saying, \"Aunt Amy, why do they keep talking about this scream!?\" I'm also in disbelief that young people today would be interested at all in horror films of that time era, therefore they wouldn't recognize \"the scream\" and would think it was lame in comparison to the graphics in movies today. I think I am partially disappointed because my own \"pre-teen\" isn't to the stage in her life where she cares about brand name clothing or has the desire to wear make-up yet. (THANK GOODNESS!) Maybe my niece is the exception to the rule, and if that is the case I am totally okay with that! So I think I will hold onto this book and give it to her in a couple years when she can relate more to the characters and what's happening in their dramatic little world. For now, It's too soon."}, {"userName": "Katie Fitzgerald", "userReviewDate": "Dec 20, 2013", "userURL": "http://www.goodreads.com/user/show/2281988-katie-fitzgerald", "userReview": "Remy has always loved the summer she spends on Seagate Island with her best friends Micayla and Bennett. The three friends have many traditions, and Remy is comforted by the predictability of each summer and of the way things never seem to change on Seagate. This year, though, Remy’s grandmother has died, as has Remy’s dog, Danish, and Micayla and Bennett seem different - older, and interested in new things. Remy really hates change and would love for everything to stay the same, but no matter how she tries to cling to tradition, no one else seems as determined to hold onto the past. It’s a good thing Remy has started a dog-sitting business, which she runs at Seagate’s Dog Beach, because lately it seems like dogs are the only ones who understand her.Lisa Greenwald’s latest book has much in common with her previous titles, My Life in Pink and Green, My Summer of Pink and Green, and Sweet Treats and Secret Crushes. All of these books involve girls with an entrepreneurial spirit who are part of three musketeer-type friendships and whose friendships undergo major changes during the middle school years. Greenwald’s wriitng improves from book to book, and Welcome to Dog Beach is her best novel to date. The story has a strong sense of place, and the many businesses and colorful characters on Seagate Island come perfectly to life so the reader loves the island as much as Remy does. Dog lovers will appreciate the many scenes devoted to dog-sitting and watching dogs play together, but even readers with no particular fondness for animals will be able to connect with the themes of friendship, change, and first crushes. (It’s also not a depressing dead dog story, which is a major plus.) Remy’s feelings about everything that happens to her are so real that the reader experiences them vicariously and reacts to them viscerally. This book is a true middle grade story through and through, and happily, it’s only the first in The Seagate Summers series.Welcome to Dog Beach will find an audience among readers who have enjoyed Fetching by Kiera Stewart, the Annabelle Unleashed series by Leslie Margolis, and Because of Winn-Dixie."}, {"userName": "Brooke Minor", "userReviewDate": "Oct 04, 2015", "userURL": "http://www.goodreads.com/user/show/46026451-brooke-minor", "userReview": "The book Welcome to Dog Beach by Lisa Greenwald is by far one of the best books that I have ever read in my entire life! This book is about an Twelve year old girl named Remy who spends her summers in a place called Seagate Island. Every summer she and her family go there and visit her grandmother and her adorable dog Danish. Danish had technically been Remy's dog, but Danish lived with her grandmother. This past year Remy's grandma died and so did Danish, so Remy has been devastated ever since. She was really excited to come to Seagate and spend her summer like she did every year, but it did not turn out the way she thought it would.  This book is filled with happy and sad moments. One of my favorites parts in this story was when Bennett and Micayla, her friends and Remy start a dog sitters club. They take care of a lot of the dogs on Seagate Island when their owners are not home. There were not any parts of this story that I did not like.  This book is full of cliff hangers. When I set this book down I was always left on the edge of my seat wondering what would happen next. If you are the type of person that likes fiction books then this a great pick for you. This is also a great book for teenagers because it talks about friendships and how to keep them strong. There is also a sequel to this book called Dog Beach Unleashed that I have not read yet, but hope to soon. This book is an awesome book. So the next time you are looking for a great fiction book to pick up, choose Welcome to Dog Beach by Lisa Greenwald."}, {"userName": "Ms. Yingling", "userReviewDate": "Dec 22, 2013", "userURL": "http://www.goodreads.com/user/show/2636606-ms-yingling", "userReview": "Remy loves spending her summers at Seagate, but now that her grandmother has passed away, the house just isn't the same. Even her grandmother's dog, Danish, is no longer living, so all of her old haunts seem sad and empty. Things are even odd with her best friends Micayla and Bennett. Bennett is being all disgusting and boylike, wanting to spend time with Calvin instead of the girls, but even so, Remy is starting to look at him with twitterpated feelings. Micayla is going to be living on the island year round, and Remy resents that she is making other friends. Remy isn't too thrilled to be hanging out with Calvin's sister Claire, who is clothes obsessed, whereas 11 year old Remy just wants to enjoy summer. Remy starts to have quite a dog walking business, and this makes the summer more bearable. Not only does she get to know the owners and get back to ordinary life at Seagate, but the dogs help her through her other problems. Just realized that this is supposed to be the first book in a series. Awesome!Strengths: I particularly like that Greenwald always gives her characters a unique interest, and Remy's somewhat reluctant dog business is fun. The interaction between the characters is very true-to-life for middle school, from the different levels of maturity to the small conflicts that seem very large at the time.Weaknesses:There are quite a number of books where people spend the entire summer somewhere, and it just doesn't seem realistic to me."}, {"userName": "Lyn", "userReviewDate": "Apr 07, 2014", "userURL": "http://www.goodreads.com/user/show/1352473-lyn", "userReview": "For eleven-year-old Remy there is no greater place on earth than Seagate Island. She’s spent all of the summers of her life there. She’s glad to be back this summer even though she’s missing her dog, Danish, who recently passed away.Every summer she and her friends Macayla and Bennet enjoy their traditions, eat at the same places and relish Seagate Island yearly activities. Remy appreciates the sameness of the little island, but this year she may have to accept that things change no matter how much she tries to keep them the same. Even her best friends seem to be changing. A set of twins, Calvin and Claire are visiting their grandfather and are new to the island. They make no secret that Seagate bores them. Not all changes are bad. Remy stumbles into a dog sitting business and Macayla and Bennet jump right in to help. Before the summer is over Remy and Macayla have their first disagreement ever. Remy finds her feelings for Bennett are changing. Bennett on the other hand seems to relish the company of Calvin who is his own age and lives right next door.Remy tells her story in first person with humor and emotion. Welcome to Dog Beach is a promising start to Greenwald’s new series. I’m looking forward to the next book."}, {"userName": "Tami", "userReviewDate": "Apr 11, 2014", "userURL": "http://www.goodreads.com/user/show/1472968-tami", "userReview": "Haven't received my copy yet, just received notice I had won. 4/11/14Received my copy and hope to start soon. Have 8 others plus my current read in front. 4/18/14Started 5/5/14Finished 5/6/14Remy loves summer because it means she gets to live at Sea Gate. She loves that her best friends Bennett and Micayla are there. After her grandmother and the family dog both past away, she is looking forward to a summer where nothing has changed. But it has, she notices differences in both Bennett and Micayla and there are new twins their age in town. Remy turns to dogs for comfort and hatches a plan to bring the friends back together.The blurb says Remy is 12 and the book said 11 but either is an appropriate age for the storyline. Cute fun read, and any child from about 8 up through young teens would enjoy. My niece is 6 and she would love the dog parts, but not so much the first crush/love parts. Luckily, the author stayed age appropriate with those. The characters are fun and I think the dogs are the best characters in the book. Great read for the audience it is aiming for."}, {"userName": "K Lafo", "userReviewDate": "Mar 16, 2014", "userURL": "http://www.goodreads.com/user/show/27958430-k-lafo", "userReview": "A wonderful read for middle-graders. Welcome to Dog Beach follows the story of Remy, an eleven-year-old who just wants everything to stay the same, but is forced into rapid change due to the death of her dog and increasingly complex relationships. The author avoids minimizing the emotional turbulence of growing up as she speaks to the issues pre-adolescents deal with- identity struggles, friendship changes, new romantic feelings, etc. I would describe the book as character-driven with a focus on the inner-life of the protagonist and the lessons she learns along the way. As such, it is not an action-packed story that keeps you on the edge of your seat, which might cause the book to be less appealing to some young readers. However, the author has created a lovely setting and dynamic protagonist that many middle-grade students will enjoy. *I received this book through a Goodreads giveaway"}, {"userName": "Bekka", "userReviewDate": "Mar 09, 2014", "userURL": "http://www.goodreads.com/user/show/3089890-bekka", "userReview": "Thanks to Netgalley.com and Amulet Books for early access to this title.3 1/2 stars. This was really cute! I quite enjoyed this charming tale of a young girl, Remy, and her friends who visit the Seagate Island (a take-off on Martha's Vineyard?) every summer. I enjoyed their adventures, and how they create a doggy day-care for the other island residents and visitors. I especially enjoyed the problems in this book, how these 11 year olds are growing up and their friendships are changing. I think this is a great book for other kids to read to see the realistic and positive ways the solutions are portrayed. The book at times does feel a bit on the preachy side, but not so much that it detracts from the overall charm. This is the first in a series, and I'll look forward to the others coming out! I'd like to spend a summer on Seagate Island myself!"}, {"userName": "Janice", "userReviewDate": "Jan 09, 2014", "userURL": "http://www.goodreads.com/user/show/25369592-janice", "userReview": "What happens when your best friend suddenly isn’t interested in hanging out with you? And your other friend is busy with someone new? 11 year old Remy is about to negotiate some big changes in her life. Ever since she was born, she has been spending her summers on Seagate Island. She always hangs out with the same people, does the same things every year and is pretty much happy with how her life is going. But this year is different. In a book that examines what it means to be a friend; Remy has to negotiate some unfamiliar territory. Along the way she makes a new friend, starts a dog sitting business and discovers that while things change, it can be a good thing. This is a great book for tweens that are starting to see some big changes in their own lives. The scenarios are plausible and easily relatable. It’s a thoroughly enjoyable read."}, {"userName": "Susan  Dunn", "userReviewDate": "Apr 30, 2014", "userURL": "http://www.goodreads.com/user/show/659923-susan-dunn", "userReview": "Remy and her parents have been going to Seagate every summer for Remy's whole life. But the year that she is eleven, things are starting to change - and Remy doesn't like change. First of all her dog Danish recently died, and it seems strange and sad to be a dog-friendly Seagate without her constant companion. Her best girl friend is suddenly distant, and Remy finds herself with a crush on her best guy friend. The three kids find themselves starting a dog watching business, but misunderstandings and interlopers threaten to ruin everything. This is a great portrayal of that awkwardness of young adolescence, and of not wanting familiar childhood traditions to vary. Give it to fans of Lauren Myracle's Eleven."}, {"userName": "Shanthi D", "userReviewDate": "Jan 27, 2015", "userURL": "http://www.goodreads.com/user/show/34212748-shanthi-d", "userReview": "Welcome to Dog Beach by Lisa Greenwald is a charming story. It is told from the perspective of Remy, a twelve year old girl, who does not enjoy change. Her family goes to Seagate Island each summer where they relax and hang out with their friends. This summer will be the first that Remy will spend without her dog, Danish, who passed away during the year. Along with that change, her relationship with her two Seagate best friends, Bennett and Micayla, starts to fall apart during her vacation to the “perfect” Island. I think that although this is a good book, Remy makes Seagate Island seem too perfect and glorifies it a lot. I would recommend this book to anyone who enjoys reading realistic fiction books about the summer time."}, {"userName": "Alexa Hamilton", "userReviewDate": "Apr 05, 2014", "userURL": "http://www.goodreads.com/user/show/165593-alexa-hamilton", "userReview": "Super sweet (almost too sweet) book about a girl whose dog died but she still learns the power of canine companionship through the doggie day camp she winds up running. This book is set on a beachy, summer island where everything is safe and the biggest issues are fights with long time beat friends because when you're 11, everything changes. Remy is not super naive--she has some wisdom beyond her years as an only child. It's not a nuanced book at all but if you know a girl who loves dogs and lazy summers, this book is probably for her."}, {"userName": "Yapha", "userReviewDate": "Nov 20, 2015", "userURL": "http://www.goodreads.com/user/show/3722795-yapha", "userReview": "Remy loves spending each summer on Sea Gate island, with the customs and traditions she can count on. But this year is different. Both her beloved grandmother and her dog have died. Her two best friends on the islands are changing, and everything is different. While initially fighting the changes, her summer is off to an awful start. Gradually she begins to find ways to make it better for herself, embracing both new friends and old. A sweet story about the inevitable changes that come with growing up. Recommended for grades 4 and up."}, {"userName": "Karen Arendt", "userReviewDate": "May 14, 2014", "userURL": "http://www.goodreads.com/user/show/1604297-karen-arendt", "userReview": "Such a sweet and gentle story of summer, friendship, first crushes, and change. Remy's family visits Seagate Island every summer and she loves it there. What she doesn't like, though, is change, and this summer will be full of change. Remy struggles with thinking of other people first and accepting new people into a long established group of friends. The story is told is such a way that readers will empathize with Remy rather than dislike her, though. A great story for girls who love friendship stories and a perfect start for summer reading."}, {"userName": "Peggy Clayton", "userReviewDate": "Jul 03, 2014", "userURL": "http://www.goodreads.com/user/show/5913182-peggy-clayton", "userReview": "I am glad that a local bookstore was at farmers market giving away their Arc's as I picked up this teen book and loved it. I saw the really cute cover and that got me then when reading it was so funny and cute. I am going to send it to my granddaughter who is at camp and I am sure she will love it as she is 12 and likes dogs and dog stories."}, {"userName": "Tosha Holliman", "userReviewDate": "Jan 04, 2014", "userURL": "http://www.goodreads.com/user/show/13647172-tosha-holliman", "userReview": "I won this through a Goodreads giveawayI found Dog Beach charming. I like to read books before I give them to my children, and most I cannot enjoy but I really did this one. I think as a girl we have all at some point been in a situation like this. I hope my daughter enjoys it like I did and I am sure she will."}, {"userName": "Laura Phelps", "userReviewDate": "Jun 26, 2014", "userURL": "http://www.goodreads.com/user/show/7165542-laura-phelps", "userReview": "A light friendship, coming-of-age story. This will appeal to middle grade kids who like dogs (the cover is very “awww” worthy); the writing is accessible and the issues that eleven-year-old Remy deals with will be very familiar and comforting to that readership."}, {"userName": "Monique", "userReviewDate": "Jan 23, 2014", "userURL": "http://www.goodreads.com/user/show/25040385-monique", "userReview": "I won a copy through Goodreads First Reads Giveaway!This is a sweet book that deals with easily identifiable issues many eleven-year-olds go through especially when it comes friendship transformations. I have been able to share it with my middle school students and many have really enjoyed it!"}, {"userName": "Linda", "userReviewDate": "Jul 05, 2014", "userURL": "http://www.goodreads.com/user/show/575578-linda", "userReview": "Seagate Island, where her family vacations every year, is Remy's special place until this year. Remy's dog has died and her two best friends are spending more time with other kids on the island. Will her plan help make this a good summer and keep Seagate Island a special place?"}, {"userName": "PWRL", "userReviewDate": "Jul 05, 2014", "userURL": "http://www.goodreads.com/user/show/4579023-pwrl", "userReview": "O"}, {"userName": "Bridget", "userReviewDate": "Jan 23, 2017", "userURL": "http://www.goodreads.com/user/show/28345861-bridget", "userReview": "Eleven year old daughter thought it was boring. No interesting twists."}, {"userName": "Rebecca Easton", "userReviewDate": "Jul 14, 2016", "userURL": "http://www.goodreads.com/user/show/48377331-rebecca-easton", "userReview": "It was awesome the best book ever!"}, {"userName": "Nancy Brown", "userReviewDate": "Jul 21, 2014", "userURL": "http://www.goodreads.com/user/show/3742785-nancy-brown", "userReview": "A gentle coming of age story about a girl, summer vacation, love of dogs, changing friendships."}], "description": "Twelve-year-old Remy loves the traditions of Sea Gate, the island where her family spends every summer vacation, but after her grandmother and a special dog die, and her relationship with best friends Bennett and Micayla changes, Remy takes comfort in the company of the Dog Beach--where she hatches a plan to bring her friends closer and recapture the Sea Gate magic.", "title": "Welcome to Dog Beach\n      \n          (Seagate Summers #1)", "url": "http://www.goodreads.com/book/show/18228243-welcome-to-dog-beach", "average": 3.96, "cover": "https://images.gr-assets.com/books/1411447424l/18228243.jpg", "reviews": 36, "authors": [{"url": "https://www.goodreads.com/author/show/2568433.Lisa_Greenwald", "name": "Lisa Greenwald"}], "type": ["Childrens", "Realistic Fiction", "Childrens"], "outlinks": ["http://www.goodreads.com/book/show/18228243-welcome-to-dog-beach", "http://www.goodreads.com/book/show/20707367-welcome-to-dog-beach", "http://www.goodreads.com/book/show/19534024-welcome-to-dog-beach", "http://www.goodreads.com/book/show/5742272-my-life-in-pink-green", "http://www.goodreads.com/book/show/15842654-my-summer-of-pink-green", "http://www.goodreads.com/book/show/7785751-sweet-treats-secret-crushes", "http://www.goodreads.com/book/show/10806006-reel-life-starring-us", "http://www.goodreads.com/book/show/20702015-pink-green-is-the-new-black"]}