{"ratings": 22447, "userreviews": [{"userName": "Brendan", "userReviewDate": "Jul 14, 2007", "userURL": "http://www.goodreads.com/user/show/134752-brendan", "userReview": "To be honest, Gourevitch's book doesn't sound inviting. What book about genocide could? And its title alone suggests a kind of vicious, heart-stopping sadness that many of us would prefer to turn away from. Which may, in fact, be the point. Either way, Gourevitch's writing won't let you turn away. He tells the story of the Rwandan genocide in a prose so wonderfully crafted and infused with anger and insight as to be nearly hypnotic. From the opening pages, the young reporter confronts his own very mixed emotions as he tours a schoolhouse where decomposed cadavers, piled two and three high, carpet the floors of several rooms.\"I had never been among the dead before,\" he writes. \"What to do? Look? Yes. I wanted to see them, I suppose; I had come to see them . . . Yet looking at the buildings and the bodies, and hearing the silence of the place, with the grand Italianate basilica standing there deserted, and beds of exquisite, decadent, death-fertilized flowers blooming over the corpses it was still strangely unimaginable. I mean one still had to imagine it.”This is precisely what Gourevitch so brilliantly accomplishes in We Wish to Inform You: allowing us to imagine, with uncomfortable immediacy, such unimaginable inhumanity. It took 100 days in 1994 for ruling Hutus to slaughter 800,000 of their Tutsi countrymen. But such a statistic only cracks open the door to a world where the victims were killed not by gas or ovens but with swinging machetes; where preachers presided over the killing of their parishes, husbands over the killing of their wives; where the French army intervened in favor of the killers and the U.S. government didn't intervene at all; and where the United Nations peacekeepers, before abandoning the country altogether, fired their weapons only to stop dogs from eating the corpses. Apparently, international concern was focused more on disease than genocide.Through a myriad of interviews -- with unflagging energy he talks to survivors, killers, politicians and generals -- Gourevitch helps bring a dose of understanding and even, improbably, hope to the madness. He is at his most interesting, though, when speculating on the fate of Rwandan society. In a remarkable bit of analysis, he suggests that the very fact of Rwandan culture that helped usher in the killing -- Rwandans' tendency to do as they are told -- may, in fact, help restore calm. How else can the government integrate so many killers back into society except to order that it be so?Read the full review here: http://bit.ly/2dZMCvO"}, {"userName": "Orsodimondo", "userReviewDate": "Nov 20, 2012", "userURL": "http://www.goodreads.com/user/show/10490224-orsodimondo", "userReview": "NON VI DIMENTICHEREMO Murambi, tombe collettive.Questa non è solo una storia africana. Non è solo una lotta tra hutu e tutsi. È una storia che riguarda l’umanità intera. Perché non esistono essere umani più umani degli altri. Murambi, Memoriale del Genocidio.Nel più piccolo paese dell’Africa, il Rwanda, in un territorio di poco più grande della Sicilia, in un paesaggio che a volte ricorda le Langhe, altre la Svizzera, tra il 6 aprile e la metà di luglio del 1994 si è consumato il genocidio più cruento e rapido della storia dell’umanità: si calcola che in circa cento giorni siano stati uccisi un milione di rwandesi, per la maggior parte tutsi (il calcolo attualmente si è avvicinato al milione e duecentomila morti, di cui i tutsi furono l’80%). Gli assassini furono efficientissimi e riuscirono ad ammazzare anche più di diecimila persone in un solo giorno (quattrocento morti all’ora, uno ogni sette minuti).Tuttora in Rwanda si continuano a scoprire fosse comuni.  Murambi: si stava costruendo una Scuola Tecnica secondaria – il vescovo locale spinse la popolazione tutsi a rifugiarsi in questo luogo per via della presunta protezione delle truppe francesi – il conto dei morti arriva a 65.000 – adesso gli edifici destinati alla scuola sono stati trasformati in un memoriale del genocidio.A dieci anni dai fatti, io ho voluto essere presente alle commemorazioni del genocidio oltre che per documentare le cerimonie, funebri e non, ufficiali e non, per vedere come sta il paese: per vedere soprattutto come sta la gente, come ha reagito all’orrore, come vive o sopravvive.“Ntituzabibagirwa” è scritto sulle croci delle tombe a Murambi, nel sudovest del paese, dove furono trucidati almeno sessantamila persone, bambini e vecchi inclusi, donne e uomini. Per me sarà impossibile dimenticare. Spero di non essere il solo.Le mille colline.Se un difetto, uno e uno solo, posso indicare per questo splendido e devastante racconto è la mancanza di note, come nella consuetudine statunitense: lo fanno per facilitare la lettura, ma io ne ho sentito la mancanza. Per il resto, che dire? Già il titolo è un pugno nello stomaco, come il resto.Probabilmente il libro più bello mai scritto sul genocidio rwandese. Murambi, memoriale del Genocidio."}, {"userName": "Melissa", "userReviewDate": "Mar 29, 2011", "userURL": "http://www.goodreads.com/user/show/48646-melissa", "userReview": "When I would tell my friends about how great of a book this is, I got a lot of, \"I can't read that, it's too upsetting.\" This came from my progressive, non-profit sector, CSA share-owning friends. And I know what they mean. But seriously, you should read this book anyway.And not just because it's important to understand the things that have gone on in this world during our time (and before) in order to change the future. Also because Gourevitch discusses some things in this book that I've never read discussion of anywhere else.For instance, he writes about Rwanda's then-Vice President and now President Kagame: \"Because he was not an ideologue, Kagame was often called a pragmatist. But that suggests an indifference to principle and... he sought to make a principle of being being rational.\" And, oh man, really, you have to read the rest of that paragraph, it's on page 225. He says: \"against those who preferred violence to reason, Kagame was ready to fight.\" And he doesn't mean violent fighting, he means engaging in taking principled stands against those who wish to get people wrapped up in insanity instead of engaging with others in a reality-based and clear-headed way. I mean, golly. For some reason, reading that makes my heart race with excitement.There's another part, too, that makes me pretty much freak out, and it's on page 259 when talking about how the people guilty of genocide tried (and mostly succeeded) in reshaping the conversation about the genocide to hide their guilt. He says, \"With the lines so drawn, the war about the genocide was truly a postmodern war: a battle between those who believed that because the realities we inhabit are constructs of our imaginations, they are all equally true or false, valid or invalid, just or unjust, and those who believed that constructs of reality can -- in fact, must -- be judged as right or wrong, good or bad.\" I practically jumped out of my seat when I read this because I have this pet, uhhh, hobby of raging against people who believe we all construct our own realities and that there is no such thing as objective truth. Gourevitch shows us, in this book, how denying objective reality can be a matter of life or death or, at the very least, justice or injustice. I have more to say about the book, like how I learned from it that that crazy person who crazy people on street corners across America give out weird political tracts about, Lyndon LaRouche, spread information that the Tutsis committed genocide against the Hutus, not the other way around, and they did it with help from British royalty or some such thing. Ahhh, you know, I always assumed that LaRouche guy was insane because his followers tend to have those crazy eyes, but thanks, this confirms it. And I have more to talk about than that. Lots more. Hey, you should read the book, and then we can talk about it, ok? Whattayasay?"}, {"userName": "Heidi", "userReviewDate": "Apr 29, 2008", "userURL": "http://www.goodreads.com/user/show/454236-heidi", "userReview": "This is not an easy book to read. But Gourevitch takes a tragedy about which most of the world knows very little -- the genocide of Rwandan Tutsis in 1994 -- and he thoroughly explores it, and along the way he humanizes it. This is a story about genocide, about war and politics, yes, but moreover it's a story about the people who lived through the horror of genocide, and those who died. Gourevitch talks to anyone who will tell him their story, it seems: survivors of the genocide, military officials, humanitarian aid workers, politicians, and even accused and confessed murderers, and he tries to make sense of how such a large-scale monstrosity could occur, and how it could be so easily ignored by the rest of the world. He condemns the UN and Western nations rather harshly, but long before you reach the end of the book you are convinced that they deserve every ounce of condemnation he gives them, and more, for their failure to intercede in one of the most devastating human tragedies of the 20th century.This is not a book that can (or should) be read quickly. It's frightening, and educational, and mind-boggling, and gripping, and infuriating, and most of all it's terribly sad. It's also a fascinating insight into a darker part of humanity -- not only those who committed the genocide, but those who, through inaction, allowed it to happen. It is important, it is well worth reading, and it is highly recommended."}, {"userName": "Chrisiant", "userReviewDate": "Aug 27, 2007", "userURL": "http://www.goodreads.com/user/show/291423-chrisiant", "userReview": "I read this book while volunteering in Burundi, a country that has experienced a parallel civil conflict to that of Rwanda, but with much less international attention. The book is full of chilling stories, exposing both the horror of the actions of the Rwanda orchestrators of the genocide, the willing and complicit participants in carrying out the genocide, and the willful inaction and facilitation of the conflict by international actors, including the U.S. government. Most striking to me was the sheer volume of stories in which important local religious leaders figured. Many trusted pastors purposefully gathered their parishioners together so that the Interahamwe militias would be able to slaughter them more efficiently. The title of the book comes from one of these stories, in which the parishioners write to their pastor and to local officials asking for their intervention only to be told that it is God's will that their kind be eradicated.This is a very difficult book to finish, but it's well worth it. Lots of food for thought on the current inaction regarding events in Darfur, Sudan. The international community always seems to be able to proclaim \"never again\" in the wake of instances of ethnic cleansing, but actually acting on that promise seems distressingly a rare occurrence."}, {"userName": "Ioana", "userReviewDate": "Dec 05, 2015", "userURL": "http://www.goodreads.com/user/show/1721356-ioana", "userReview": "It happened, therefore it can happen again: this is the core of what we have to say. It can happen, and it can happen everywhere. ~ Primo LeviHow do you \"rate\" a book about genocide? On the merits of the reporting? On its \"balanced\" or \"just\" interpretation of history? On its tone or political slant? On the first-hand accounts presented? On your personal horror at both reading about what happened, and at probing the limits of your own ignorance? (How did I not know this?!)The 5 stars is first and foremost a Thank You to Gourevitch for writing such a well-documented, historically detailed, passionate account of the Rwandan genocide. After reading We Wish to Inform You, I am more than ashamed that I knew very little of the tragedies Rwandans suffered during the 1990s (and beyond, past and present). This book provides an excellent history, and contextualizes events enough to allow even those very poorly educated in the matters of African colonization like myself to grasp some kind of understanding (or informed incomprehension).I also appreciated hearing the voices of the Rwandans Gourevitch interviewed as part of his research and reporting. Both factions - Tutsis and Hutus - are represented, though the voices of the Tutsis are what shapes the narrative. These voices do not quite constitute an oral history, but offer the same effect: a nuanced and humanized perspective that is much more insightful into the human condition, imho, than traditional histories, which are fascinating of course, but which tend towards the abstract.I am not quite sure how to rate other aspects of the work, but I also figure, any flaws are minor compared to the overall appraisal, which is that I think everyone should read this book, because as humans, we should not be ignorant of such potentialities in our own natures. Usually when reading history, I am more critical (or at least, I try to be!) - but in this case, there is a dearth of written material on the subject, and general public awareness is also limited, if it exists at all. Also, the \"flaws\" I refer to may not even be flaws - one, for example, is that Gourevitch editorializes at times and does not always stick to the more detached journalistic voice. But... in this case - how can I blame him? Gourevitch is not a historian (plus historians editorialize all the time, if history is interpretation). And, as a child of Holocaust survivors, he is understandably passionately empathetic with the Tutsi's case (as probably we should all be, as human children).Content-wise, I would not do the work any justice if I attempted any kind of brief summary. But I will say this: one aspect that sadly did not surprise me, yet still angered me to tears, was the \"West's\" complicity in both turning a blind-eye to the Tutsi's plight, and in fomenting conflict in the region to begin with in the process of colonization and subsequent support for dictatorial puppets. Highly Recommended."}, {"userName": "Pink", "userReviewDate": "Nov 29, 2014", "userURL": "http://www.goodreads.com/user/show/14084605-pink", "userReview": "This was fantastic. A blending of superb writing and journalistic skills, to tell both the individual and national stories of the Rwandan genocide. I was marking sections in my book to quote from, but I ended up with 20+ passages. It answered all of my own questions of how it happened, why international governments or agencies didn't step in to help and what happened afterwards. Essential reading."}, {"userName": "Emma Sea", "userReviewDate": "Apr 19, 2017", "userURL": "http://www.goodreads.com/user/show/5558652-emma-sea", "userReview": "I was astoundingly ignorant about what happened after the initial 100-day massacre. This isn't only my fault: Gourevitch shows how Western media - and governments - completely ignored and misrepresented what happened in Rwanda and Zaire. And you don't kill 1,000,000 humans in four weeks without huge long-term fallout. The median age in Rwanda is now 18 years, 43% of the population is aged 14 or under, and 63% of the country lives under the poverty line. 52% of children die before reaching 5 years of age."}, {"userName": "Irene", "userReviewDate": "Dec 31, 2011", "userURL": "http://www.goodreads.com/user/show/7296554-irene", "userReview": "Realized I'd only read half of this so I'm finishing it this weekend. I feel like it was an experiment. But ppl call me a \"conspiracy theorist.\" To me this was planned on high though. Very scary. Excerpt from the book:Even if not taking sides were a desirable position, it is impossible to act in or on a political situation without having a political effect (speaking about humanitarian aid organizations assisting the \"refugees\" [Hutu powers in exile aka genocidars] in the D.R.C.) The Humanitarian mindset is to not think, just to do. Humanitarians do not like to be called mercenaries yet the humanitarian mindset of not to think and just to do IS a mercenary mindset. When Humanitarian aid becomes a smoke screen to cover the political effects it actually creates and states hide behind it using it as a vehicle for policy making then we can be regarded as agents in the conflict."}, {"userName": "Dan", "userReviewDate": "Aug 07, 2008", "userURL": "http://www.goodreads.com/user/show/934928-dan", "userReview": "Although I read this book only recently, over a decade after the events of the genocide in Rwanda I think that time has only reinforced and strengthened the impact of this book. While I cannot claim to have been old enough to be properly plugged into the political landscape during as the events were unfolding, it is indeed damning that I could have come away from all of the news coverage that the genocide eventually produced with such a deeply flawed understanding of the massacre.“We wish to inform you that tomorrow we will be killed with our families” follows the events of the Hutu-led genocide of around 1 million Tutsis beginning in 1994. Though, of course the history of this unprecedented violence trails decades back to the Hutu takeover of the Tutsi-dominated government and countless other small scale slayings of Tutsis beginning in the 1940s. Which itself has roots far back into the settling of the area of Rwanda and grouping of these separate people under a common border by British colonialists. The book provides a startling look at how seemingly minor differences in ethnic origins and social class of two groups of people can be magnified and manipulated for the justification of horrifyingly inhumane actions – all which occur long after time has erased most outward differences. Gourevitch leads us through the main events that occurred leading up to and then following the governmental program that was designed and executed deliberately to erase the Tutsis from within Rwanda’s borders. This includes a number of stories about the acts of cruelty and (a fewer number) of human kindnesses in a time of “complete chaos”. As you may have guessed, the title of the book is taken from an actual letter that was sent from captured Tutsis to their local pastor begging for assistance – a letter that went largely ignored. It also leads the reader to the refugee camps that were dominated by the Hutu political escapees, attempting to flee from justice. Then describing how the international support largely went to these refugee camps, and how these funds and resources were largely capitalized by the Hutu majority to continue to send out raiding parties to annihilate any surviving Tutsis.This raises one of the main points of the book. The surprising indifference of the international community during the early stages of the genocide and how the UN and leading countries (the US and France amongst the worst offenders) attempted to avoid any responsibility for helping the Rwandan people. Then, when belated foreign aid was sent, how poorly it was managed and how the funds were often funneled to fuel the killings.“We wish to inform you” is a book that I would recommend to pretty much anyone with any sense of introspection or feeling of duty to an increasingly interconnected world. The reading is surely not pleasant, but it is certainly shocking and a wake-up call – demanding a re-evaluation of humanity as a whole and one’s place in it."}, {"userName": "Mikey B.", "userReviewDate": "Sep 02, 2008", "userURL": "http://www.goodreads.com/user/show/1484029-mikey-b", "userReview": "Informative...The second part of this book is better than the first. Although interesting, the first part seems detached and meandering; a nice set of interviews - but for the most part they seem to be after-the-fact interviews. The second part becomes more unified and emotional. It is concerned more with the here and now; of how Rwanda is 'coping' with the genocide (indeed, if it can ever hope to do so). Sometimes I feel the author is painting a 'rosy' picture of Rwandan president Paul Kagame. Nevertheless he does score points in detailing how the international communities have been insensitive to Rwanda; particularly in terms of the refugees (or fugitives from justice) in camps that were receiving humanitarian aid from several UN organizations.Gourevitch also points out the hypocrisy of the UN providing aid, but it's unwillingness to risk lives (like to prevent a genocide of close to 1 million people). The book reminds me of the points brought out by Daniel Jonah Goldhagen's book Hitler's Willing Executioners: Ordinary Germans and the Holocaust: a genocide has many participants and they can be eager participants who believe in the righteousness of their cause. A genocide is organized - machetes were ordered, lists were made, groups assembled. These points are well brought out in the book of Gourevitch. For a more immediate 'feeling' of the Rwandan genocide read Roméo Dallaire's heart-wrenching Shake Hands with the Devil: The Failure of Humanity in Rwanda. Dallaire and Paul Rusesabagina (represented in the movie \"Hotel Rwanda\"), are interviewed in this book of Philip Gourevitch."}, {"userName": "Jennie", "userReviewDate": "Jul 08, 2008", "userURL": "http://www.goodreads.com/user/show/731088-jennie", "userReview": "How can you call a book about genocide great? It was informative and powerful. Tragic and very very sad. It made me so angry at times I had to put it down for fear I would throw it across the room. This book had me so frustrated with the politics involved that I just want to scream in frustration.I have to add some of the most powerful, to me, statements made in this book:\"In May of 1994, I happened to be in Washington to visit the United States Holocaust Memorial Museum, an immensely popular tourist attraction adjacent to the National Mall. Waiting amid the crowd, I tried to read a local newspaper. But I couldn't get past a photograph on the front page: bodies swirling in water, dead bodies, bloated and colorless, bodies so numerous that they jammed against each other and clogged the stream. The caption explained that these were the corpses of genocide victims in Rwanda. Looking up from the paper, I saw a group of museum staffers arriving for work. On their maroon blazers, several war the label buttons that sold for a dollar each in the museum shop, inscribed with the slogans \"Remember\" and \"Never Again.\" The museum was just a year old; at its inaugural ceremony, President Clinton had described it as \"an investment in a secure future against whatever insanity lurks ahead.\" Apparently, all he meant was that the victims of future exterminations could now die knowing that a shrine already existed in Washington where their suffering might be commemorated, but at the time, his meaning seemed to carry a bolder promise.\"\"The West's post-Holocaust pledge that genocide would never again be tolerated proved to be hollow, and for all the fine sentiments inspired by the memory of Auschwitz, the problem remains that denouncing evil is a far cry from doing good.\"\"According to its mandate, the UNHCR provides assitance exclusively to refugees - people who have fled across an international border and can demonstrate a well-founded fear of persecution in their homeland - and fugitives fleeing criminal prosecution are explicitly disqualified from protection. The mandate also requires that those who receive UNHCR's assitance must be able to prove that they are properly entitled to refugee status. But no attempt was ever made to screen the Rwandans in the camps; it was considered far too dangerous. In other words, we - all of us who piad taxes in countries that paid the UNHCR - were feeding people who were expected to try to hur us (or our agents) if we questioned their right to our charity.\" It was well established that the Hutus were the refugees, many of which were those who were directly involved in the genocide of the Tutsis. And they were protected by the UNHCR.\"The world powers made it clear in 1994 that they did not care to fight genocide in central Africa, but they had yet to come up with a convincing explanation of why they were content to feed it.\"\"Never before in modern memory had a people who slaughtered another people, or in whose name the slaughter was carried out, been expected to live with the remainder of the people that was slaughtered, completely intermingled, in the same tiny communities, as on cohesive national society.\"There were more. Truly, a great book. Makes me have little use for those, like the UN, who sit and discuss doing something about a genocide but in the end can't come to any conculsions. Doing good is necessary in this world, not just denouncing evil."}, {"userName": "Hana", "userReviewDate": "Dec 05, 2013", "userURL": "http://www.goodreads.com/user/show/10571559-hana", "userReview": "I read this book about the Rwandan genocide several years ago, thought about it again as I was reading The Great Partition: The Making of India and Pakistan by Yasmin Khan, and picked it up to reread when I was pondering the current crisis in Syria and Iraq.What triggers genocide? What leads once-peaceful peoples to willingly, enthusiastically participate in mass murder, rape, and other unthinkable atrocities? Like Yasmin Khan, Philip Gourevitch focuses on a detailed analysis of what was happening on the ground in the months, weeks and days leading up to the start of the horror; and like Khan his intense devotion to primary research helps Gourevitch avoid simplistic answers. What comes through very clearly in both cases is the extent to which deliberate incitement was to blame--in the Rwandan case local Hutu leaders fanned the flames with provocative radio broadcasts and those radio broadcast even helped time and coordinate the mass violence against Tutsis. Gourevitch does a masterful job demonstrating how the UN and western organizations fled the scene, allowing the catastrophe to escalate unchecked. And then, in what are the book's most provocative and though-provoking chapters, Gourevitch demonstrates that the subsequent 'humanitarian response' to the massive exodus from Rwanda of Hutus fearing reprisals, led to yet another disaster as the Congolese refugee camps became centers that protected and aided the Hutu killers. Here's how Gourevich recalls it in a superb recent New Yorker article on the moral hazards of humanitarian relief work. \"Everyone knew that the Hutu génocidaires bullied and extorted aid workers, and filled their war chests with taxes collected on aid rations. Everybody knew, too, that these killers were now working their way into the surrounding Congolese territory to slaughter and drive out the local Tutsi population. (During my visit, they had even begun attacking N.G.O. vehicles.) In the literature of aid work, the U.N. border camps set up after the Rwandan genocide, and particularly the Goma camps, figure as the ultimate example of corrupted humanitarianism—of humanitarianism in the service of extreme inhumanity. It could only end badly, bloodily. That there would be another war because of the camps was obvious long before the war came.\"All of which still has me wondering about the subtexts for humanitarian and military aid in Syria and Iraq. From Turkey to Lebanon to Jordan, even those accepting refugees have their own hidden and not-so-hidden political agendas. The military agendas are even more muddied. In such situations the instinctive western 'fix it' mentality can do more harm than good. I have no answers, but Khan and Gourevitch's books are both essential historical reading for anyone who wants to at least ask some of the right questions."}, {"userName": "Jimmy", "userReviewDate": "Jul 23, 2015", "userURL": "http://www.goodreads.com/user/show/3357765-jimmy", "userReview": "In April of 1994, the government of Rwanda called on everyone in the Hutu majority to kill everyone in the Tutsi minority. Over the next three months 800,000 Tutsis were murdered in the most unambiguous case of genocide since Hitler's war against the Jews. Philip Gourevitch's book is a history of the genocide's background, a horrible account of what happened, and what it meant to survive the aftermath. Belgians dispatched scientists to Rwanda when it was a colony. They measured Rwandan cranial capacities. They concluded Tutsis had \"nobler\" and more \"naturally\" aristocratic dimensions than the \"course\" and \"bestial\" Hutus. After independence, Rwanda's revolutionaries became what V. S. Naipaul called \"mimic men,\" who reproduced the same abuses they rebelled against. They became \"two nations in one state.\" Supernaturalism ruled. Dian Fossey spoke of her cleaning lady taking her hair and fingernails. She knew she had to take that stuff seriously in Rwanda. Fossey would later be murdered. When the wholesale extermination of Tutsis began, the UN forces did nothing to stop it. Foreign governments fled. The radio encouraged the slaughter. Hutu oppositionists were assassinated. Some would later protest they took lives to protect their own families. When they could, they tried not to kill. In 100 days, 800,000 were killed. That's 4.5 people per minute. That does not count the maimed and raped. Dogs were shot because they were eating the dead. Even UN troops killed dogs, but somehow never used guns to protect any living humans. Ten Belgian troops were murdered. Belgium withdrew. The soldiers shredded their UN berets on the tarmac to protest the cowardice and waste of their mission. Major General Dallaire declared he could stop the genocide with just 5,00 soldiers and a free hand. The same day, the UN Security Council passed a resolution cutting the force by 90%. All they could do was hunker down and watch the slaughter. Madeleine Albright opposed even that. She had fled Nazi persecution and said it should never happen again. Later the refugee camps themselves protected the killers. Humanitarian workers would later say, \"It's time to get over it and move on.\" The genocide became a nuisance. Five out of every six Rwandan children had witnessed slaughter. How do you fix that? Depression became a problem. But the central prison system was left in good condition. By 1997, 125,000 Hutus were in prison. How does the government put those people all on trial? The courts were closed. It took 2.5 years to even have a trial. True justice would have meant enormous amounts of even more killing. And Hutu lies kept the world confused. It was President Clinton's biggest regret he didn't intervene. It's still true today, if the US does nothing, no one does. He would visit Rwanda and apologize. Surprisingly, it had an impact."}, {"userName": "DoctorM", "userReviewDate": "Jun 07, 2009", "userURL": "http://www.goodreads.com/user/show/175916-doctorm", "userReview": "The Rwanda genocide of 1994 took place while I was moving between teaching jobs--- something horrible and ghost-like on a television screen. It always had that air of Stalin's old line that \"one person's death is a tragedy; a million deaths are only a statistic.\" Philip Gourevitch's \"We Wish to Inform You That Tomorrow We Will Be Killed With Our Families\" makes the deaths--- yes, almost a million in a hundred days or so ---into tragedy: the tragedies of individuals, of a nation, of the so-called 'international community'. The book itself is finely crafted. Gourevitch writes with a light hand--- nothing here is hammered home, there's no gratuitous Grand Guignol Heart-of-Darkness here. He lets individual stories speak for themselves: victims, aid workers, even a handful of the killers. And he provides background information that makes the story of the 1994 genocide more comprehensible--- the colonial fantasies that turned local and tribal differences in Rwanda into ethnic divisions, the history of thirty-odd years of smaller, sporadic mass killings of Tutsis by Hutus, the concerted Hutu Power campaign that led up to the genocide. And Gourevitch explains how a highly-organised political system could mobilise its population to effectively, relentlessly slaughter almost a million fellow Rwandans with machetes and small arms in a few weeks.Gourevitch is hard on the outside powers that failed to stop the killing despite clear warnings, on the French who saw the genocidaire Hutu government as a Francophone client government they'd support on purely realpolitik grounds, on the US for finding excuse after excuse not only for its own inaction but for blocking others' actions to halt the killing, on the UN for its botched and haphazard and counterproductive relief efforts. Gourevitch, like David Rieff, also drives home the point that humanitarianism without a political context, without a political goal, far too often fails to get at the root causes of disaster--- in this case, well-organised mass murder by a highly-organised political party ---and only treats symptoms. This is a key book not only for looking at Africa in the last twenty years, but for anyone interested in the politics of humanitarianism and the fate of any effort to make \"human rights\" something other than a bitter joke. If you're interested in international law, Africa, humanitarian aid, or any hope for the future--- read this book."}, {"userName": "GoldGato", "userReviewDate": "Jul 05, 2012", "userURL": "http://www.goodreads.com/user/show/6401606-goldgato", "userReview": "\"God no longer wants you.\" So spoke a local pastor, a man of religion, as he ordered the massacre of 2,000 of his Tutsi neighbours and friends. The mass killings that took place in Rwanda in 1994 stand as the most hideous since Hitler and Stalin, yet they were aided by the French government, who supported the maniacal Hutu Power government. This book tears apart the excuses given by the Western powers as to why they didn't interfere, why they just let more than 800,000 Tutsis be obliterated without lifting one finger.Gourevitch brings passion to his words and outlines the history of not only Rwanda, but of its ties to Uganda, what-was-then-Zaire, Burundi, and other African countries. In Rwanda, a Tutsi was called an inyenzi, a cockroach. So when the government called on its Hutu citizens to cleanse the land, they immediately took their machetes and went to work. How could so many humans kill so many others? The book strips down the national ethos of Rwanda, showing an ingrain mob mentality often referred to as 'community'.\"I cry, you cry. You cry, I cry. We all come running, and the one that stays quiet, the one that stays home, must explain. This is simple. This is normal. This is community.\"When the rebel Tutsi group started taking control, the Hutu murderers fled across the borders to camps...funded by the great Western powers. The money was spent, because it had to be spent, and Hutus not only lived well, but were then allowed to return to their original homes, while their maimed Tutsi neighbours squatted in burned-out villages.\"Do you know what genocide is? A cheese sandwich. Write it down. Genocide is a cheese sandwich. Genocide, genocide, genocide. Cheese sandwich, cheese sandwich, cheese sandwich. Who gives a shit?\"We always look at the Holocaust, and the Great Purge, and we say to ourselves, ah well, that would never happen where I live. While this book is about Rwanda, it is really more about the internal compass inside every human being which points us to being part of the mob, to not stand out. Maybe the zombies have already arrived, and they are us.Beware of those who speak of the spiral of history; they are preparing a boomerang. Keep a steel helmet handy. (Ralph Ellison)Book Season = Year Round"}, {"userName": "Anna-Emilia", "userReviewDate": "Apr 25, 2017", "userURL": "http://www.goodreads.com/user/show/9291901-anna-emilia", "userReview": "“What distinguishes genocide from murder, and even from acts of political murder that claim as many victims, is the intent. The crime is wanting to make a people extinct. The idea is the crime.”\nWhat happened in Rwanda, 1994? The answer isn't as clear as one may think, and the questions that arise aren't simple either. I'm so, so glad I read this book. I'm too young to remember anything disasterous or political from the 90's and everything I've heard about Rwanda since 1994 has been from my own, knowledgeable parents or my high school history book. They don't really talk about what happened anywhere and no one seems to know anything other than that the country was divided into two peoples and the Hutus decided to start killing off the other. Over a million from the Tutsi people died. And that's about it. This book doesn't shy away from what actually happened in Rwanda and I'm not going to lie, this is not a fun book and it's even hard to read at times. It presents the situations as it was, what led to the genocide and what happened after it. Why did a million Hutus participate in the murdering and brutalizing of over a million Tutsis? The truth is that tensions dating back a long time culminated in having the government systematically call upon every Hutu to kill all Tutsi, even their family, friends and neighbours. And so they did. Where was the rest of the world and why didn't they interfere?\n“Rwanda had presented the world with the most unambiguous case of genocide since Hitler’s war against the Jews, and the world sent blankets, beans, and bandages to camps controlled by the killers, apparently hoping that everybody would behave nicely in the future.”\nThe way Gourevitch has written everything chronologically makes this book and the accounts of this part of history easy to follow. I was left with no questions (and after looking it up, sadly, the two sides are still fighting even 20 years later). His writing is effortless and intelligent, every chapter has it's own meaning and no information seems unnecessary. You get the whole picture from different perspectives; those who were almost killed, those who saved others, and those who killed and organized it all. What struck me personally the most was the silence of the international community (and the disasterous mistakes the UN and others made funding the genocide). From a western point of view this is sickening. We, who claim to be intelligent and far from barbarious turned a blind eye when millions were crying for help. Officials from that time said things like \"we can't truly say if this counts as a genocide or not\". Are you serious? Just because there was nothing in it for the 'big guys' means they do nothing, or just the bare minimum. Some countries even openly supported the government organizing the slaughter (this has to do with the Hutu government fooling the international community that they as a people were the ones being killed and hunted). This deeply saddens me as my thoughts keep going back to countries in Africa and the Middle East where people are dying of hunger by the thousands right this very moment. Yet we don't take action because of dangerous political tension in those countries. To every man themselves. Highly, highly recommend for everyone interested in history, philosophy of the human race, and intelligent and thought provoking reads."}, {"userName": "Andy", "userReviewDate": "Feb 28, 2008", "userURL": "http://www.goodreads.com/user/show/25108-andy", "userReview": "I think too many people will find it easy to rubber-stamp a favorable opinion on this book and talk about how terrible the Rwandan genocide was and how this account really brings it to life. This overlooks the fact that this is honestly not a well-written book; just because it is a book about a historic atrocity still insufficiently understood by the West does not make it good. The biggest shortcoming is that the book does not look deeply enough into the motives of the killers. The biggest takeaway of the Rwandan genocide for me was that people who were friends and neighbors for years were suddenly able to turn on each other in abrupt and gruesome fashion. What drives an individual person to do this, and what makes simmering ethnic conflict among a population \"tip\" over into an extremely rapid genocide? I was hugely disappointed by what I thought was a very inadequate treatment of these questions. Instead, most of the book is a recounting of horrors. These can be quite powerful when Gourevitch cuts himself out and lets the Rwandan survivors tell their own stories, the same way that some documentaries are best when the narrator/director steps out of the picture. When Gourevitch steps back in, it's annoying and actually detractive from the sheer power of the Rwandan story. I wanted to swat him back out. This is particularly evident in his excessively starry-eyed depiction of Paul Kagame. Even if it is accurate, Gourevitch's account of him bleeds so much hero worship that a) it's a little off-putting, just tell his story without the flourishes and his heroism will come out naturally! b) I can't take it seriously because it doesn't seem to make a real attempt at being unbiased. In the book's favor, it makes some very interesting points about the misdirection of Western relief and the paralysis on \"apolitical\" aid agencies that everyone should read and understand. A sub-essay extracted out of this book on how the West messed up Rwanda even more than it already was on its own would easily get five stars from me. It does also track over the basic history of the conflict and does embed it in the history of neighboring African governments; explaining this kind of thing is where the narrator can help a lot and I wish the author had tried for more here and less elsewhere! Another big flaw the book has, which could easily be patched up in a new printing run, is that it has no index."}, {"userName": "Rikelle", "userReviewDate": "Jan 06, 2009", "userURL": "http://www.goodreads.com/user/show/1065336-rikelle", "userReview": "How do you rate a book that is about something so absolutely horrible. When I was younger I remember reading books on the holocaust and thinking this could never happen again. How naive I was. Not only has it happened again, it continues to happen and the world barely notices. I have read books about the Rwandan genocide from the victim's point of view. Those books give you the horrible gut wrenching emotional side of it. This book helps you understand the political side of it. My only gripe is that I really didn't like the author's style. I felt he jumped around a little too much and it was sometimes hard to follow - yet it was still riveting. I remember the news conference when Clinton's Press Sec. DeeDee Meyers was so hesitant to call the Rwandan turmoil genocide. I never understood why our government was so unwilling to label it as that. Through this book I came to understand that calling it such required action not just morally but legally. After the holocaust our country signed agreements that we would not let this happen again and that we would aid if it ever began again. We failed to act and must take part of the blame. Our government pretended to not know what was going on but the truth always comes out. The Hutus were broadcasting it across the radio waves for all to hear and the victims were calling out for help - we failed to answer and perhaps we encouraged worse to happen. My eyes have opened and I hope that I will be a source of action and that the world will notice that this conflict continues and the atrocities are still being comitted in the Congo."}, {"userName": "Bryce", "userReviewDate": "Aug 08, 2014", "userURL": "http://www.goodreads.com/user/show/2205083-bryce", "userReview": "I admit that I did not know much about Rawanda's genocide before reading this book. I was a preteen when it occurred ibn the early 90s and global news wasn't really one of my life priorities. So I learned so much from this account. All of it tragic and frustrating and hopeless. It made me ashamed of my country, for the United States' aggressive refusal to respond to a genocide. It made me wonder at the people of Rawanda, that they could be less into participating in a slaughter of nearly a million of their neighbors, friends and countrymen. And so angered that sloppy reporting could lead to the international community harboring murders, after the killing was forced to stop. I understand what happened now, but will never actually understand what happened."}, {"userName": "stephanie", "userReviewDate": "Jul 06, 2007", "userURL": "http://www.goodreads.com/user/show/86145-stephanie", "userReview": "possibly one of the best books i've read on rwanda. horribly depressing, horribly great, just. absolutely wonderful work. i put it second to  The Age of Genocide only because that is possibly the end all book on genocide, because of it's breath, scope, and wonderful, wonderful history. but this is maybe the best book on rwanda i've read. and read again. and again."}, {"userName": "Sumit Singla", "userReviewDate": "Aug 03, 2016", "userURL": "http://www.goodreads.com/user/show/18177815-sumit-singla", "userReview": "Gruesome. Horrific. Visceral. Disturbing. And even harrowing. These are some of the adjectives that come to mind when I think back about this book. I wish this had been fiction, and not cold, hard fact.However, the truth remains that nearly a million HUMANs were pretty much hacked to death by other HUMANs, over a period of a 100 days. Imagine an orchestrated ethnic cleansing involving 10,000 murders a day. That's more people than 11 Airbus a380s can accommodate. Staggering. And even after reading the book, I find it absolutely incomprehensible how WE - the human race, can behave in this manner. What makes it worse is the inaction of the Western world, which saw these macabre events panning out, but chose to largely ignore them. Sadly, the seeds of conflict seem to have been sown in the colonial times themselves, resulting in the purge of 1994. Even more sadly, because this conflict didn't happen in the Western world, it largely seems to have escaped notice.What makes this book even more difficult to read is because Gourevitch does not treat the victims as mere numbers or statistics. Through his interviews and finely crafted prose around the survivors, he tells not just one but many tales of death, destruction, rape, and horror. The only criticism I have is that there isn't enough focus on female survivors - and no description of the horrors of rape and sexual violence that they had to go through. Indeed, at some points, rape seems to have been spoken of only as a 'tool' to humiliate the menfolk. Unfortunately, women (except Odette) don't seem to find much mention in this otherwise finely researched book.And perhaps it would've been great if Gourevitch had chosen to delve deeper into the history of colonialism and how the 'apartheid' resulted in the events of 1994.Nevertheless, a great book with a lot of perspective. I can't really say that I 'loved' it, but it does deserve 4.5ish stars for sure."}, {"userName": "Ivana", "userReviewDate": "Mar 21, 2017", "userURL": "http://www.goodreads.com/user/show/49070593-ivana", "userReview": "Tri týždne hutného textu o veci, o ktorej som vedela jediné - že sa stala. Spomienky, výpovede, fakty i zavádzania, snaha vysvetliť problém rwandskej genocídy bežného človeku zo Západu. Tak som sa cítila, keď som to čítala, že nechápem, nemôžem, neviem... ani som nevedela Peťovi zreprodukovať, čo som to vlastne čítala. Chabé útržky, kúsky informácií, ale bola som neschopná v tom prvom momente po dočítaní nejako rozumne vystihnúť, čo sa tam vlastne stalo. Najviac ma ohromilo to, čo nasledovalo po tých prvých najvypuklejších troch mesiacoch. Že nebol koniec, naopak, prerástlo to celé do akejsi dlhej agónie bez nejakej možnosti šťastného konca. Prečítajte si to."}, {"userName": "Tim", "userReviewDate": "Aug 10, 2011", "userURL": "http://www.goodreads.com/user/show/4859431-tim", "userReview": "A first hand examination of the Rwandan genocide of 1994. Gives a number of survivor stories, a thorough look at the country in it's aftermath (up to 1998). An excellent view of the international communities role in the genocide, it's inaction, and the debacle of humanitarian aid which aggravated the situation and wound up giving money and supplies to many of the Genocidaires. It did not seem to be as explanatory of the causes of the genocide or the organization and planning and execution. These were certainly addressed, maybe not as thoroughly as I would have liked.3.5 stars"}, {"userName": "Tenzing", "userReviewDate": "Apr 24, 2007", "userURL": "http://www.goodreads.com/user/show/66338-tenzing", "userReview": "Here's the review of this book I put on my blog:On the flight home I read Philip Gourevitch’s ` We Wish to Inform You That Tomorrow We Will be Killed With Our Families’. In spite of many accolades for the author, I didn’t like his writing. However, the book is worth reading as a disturbing reminder of the violence and cruelty man is capable of committing in the name of such recently constructed ideas as ethnicity and nationalism. This sort violence is perhaps among the most serious problems facing our world. The self-interested and shameful inaction of the leading powers of the world to stop the genocide in Rwanda, and the counter-productive efforts of international aid organizations in the aftermath, are also worth reading about. I know nations are powerful arbiters of world affairs and it may be foolish to think much of significance can be done without governments backing them, however I wonder if large agglomerations of bureaucrats accountable primarily to powerful vested interests such as rich business lobbies, can ever really be relied upon to genuinely respond to the threats that oppress the lives of those living in poorer parts of our world.Some of Clinton’s words to survivors of the Genocide captured my reservations about resorting to violence as a force for change - “…because each bloodletting hastens the next as the value of human life is degraded and violence becomes tolerated, the unimaginable becomes more conceivable.” For all of Clinton’s big words, we should keep in mind it was his administration that undertook considerable verbal acrobatics, insisting `episodes of genocide’ and not `genocide’ were taking place in Rwanda. Under UN conventions, acknowledging the latter would have obliged the United States to act.Going back to Clinton's words, I feel strongly that violating fundamental human rights and lowering standards of human behavior can never be an isolated incident. I mean that such negative actions will resonate and harm many more than the unfortunate direct recipients. The United States' trade and resulting economic power now allows one unsavory authoritarian regime to prop up numerous other governments that think nothing of the dignity of every human being (Sudan and Burma are easy examples. I'm thinking of the refusal by big C to support U.N. sanctions on Burma for its murder of unknown numbers of Buddhist monks protesting the regime.)"}, {"userName": "Jack", "userReviewDate": "Mar 31, 2008", "userURL": "http://www.goodreads.com/user/show/101651-jack", "userReview": "This is a devastating book. It gives a few family narratives in the context of genocide and hits your soul with the sadness of friends and neighbors and families killed by friends and neighbors and family. The book does a descent job of giving some causalities to the genocide without necessarily falling into justification. It also works with the tensions of justice and reconciliation wondering how the post genocide RPA government can navigate between the lines of justice and stability, between the needs of Rwanda and the stupidity and arrogance of the west and how to create a nation from such huge destruction.This book also works with the politics of humanitarian aid organizations specifically looking at how these organizations funded the Hutu power exiles in Zaire and how they claimed neutrality despite knowing that Hutu Power hierarchies were replicating themselves in refugee camps and buying arms with aid money. These organizations helped fund mass killings while providing a place for the genociders to hide. In many ways the description of aid work mirrors the longer narrative found in Maren's book.This book is powerful in its sadness and the questions it asks, and there is a lot more in it than described in this lil review."}, {"userName": "Lazy Mimi Reads", "userReviewDate": "Apr 04, 2017", "userURL": "http://www.goodreads.com/user/show/29952524-lazy-mimi-reads", "userReview": "After every genocide, the international community bands together and screams \"never again\" repeatedly. From the Armenian genocide to the holocaust, we see the writing in the sand yet we do nothing to stop it. The Rwanda genocide does not get as much attention as the holocaust because of the sentiment: \" Africans are always killing each other\" This book sheds light on the historical context of the genocide and how extremists used the culture of obedience and high poverty rates to pit neighbor against neighbor. Gourevitch shows how complex the situation is and acknowledges the stories of the survivors and the perpetrators. Gourevitch has helped to shed light on Rwanda as a country and Africa as a continent. Hopefully people will read this book and will be able to dispel the notion that \"Africans are savages\"."}, {"userName": "Chrissie", "userReviewDate": "Mar 30, 2008", "userURL": "http://www.goodreads.com/user/show/632247-chrissie", "userReview": "Obligatory reading for all. We must wake up and start learning from history. At least read the book and try to understand what happened. Determining how many stars to give is impossible - I certainly did not \"really like\" the book!"}, {"userName": "Linda", "userReviewDate": "Aug 19, 2016", "userURL": "http://www.goodreads.com/user/show/6787827-linda", "userReview": "Heavy read!"}, {"userName": "David Schaafsma", "userReviewDate": "Sep 12, 2012", "userURL": "http://www.goodreads.com/user/show/269235-david-schaafsma", "userReview": "Amazing story of Rwandan genocide, still haunts me. Reminded of it by reading Stassen's equally haunting and disturbing Deogratias..."}], "description": "In April of 1994, the government of Rwanda called on everyone in the Hutu majority to kill everyone in the Tutsi minority. Over the next three months, 800,000 Tutsis were murdered in the most unambiguous case of genocide since Hitler's war against the Jews. Philip Gourevitch's haunting work is an anatomy of the killings in Rwanda, a vivid history of the genocide's background, and an unforgettable account of what it means to survive in its aftermath.", "title": "We Wish to Inform You That Tomorrow We Will Be Killed with Our Families", "url": "http://www.goodreads.com/book/show/11472.We_Wish_to_Inform_You_That_Tomorrow_We_Will_Be_Killed_with_Our_Families", "average": 4.27, "cover": "https://images.gr-assets.com/books/1442723264l/11472.jpg", "reviews": 1408, "authors": [{"url": "https://www.goodreads.com/author/show/7372.Philip_Gourevitch", "name": "Philip Gourevitch"}], "type": ["Nonfiction", "History", "Cultural", "War", "Politics"], "outlinks": ["http://www.goodreads.com/book/show/11472.We_Wish_to_Inform_You_That_Tomorrow_We_Will_Be_Killed_with_Our_Families", "http://www.goodreads.com/book/show/12994928-desideriamo-informarla-che-domani-verremo-uccisi-con-le-nostre-famiglie", "http://www.goodreads.com/book/show/25051185-we-wish-to-inform-you-that-tomorrow-we-will-be-killed-with-our-families", "http://www.goodreads.com/book/show/25665599-we-wish-to-inform-you-that-tomorrow-we-will-be-killed-with-our-families", "http://www.goodreads.com/book/show/33357559-chceli-by-sme-v-m-ozn-mi-e-zajtra-n-s-aj-s-rodinami-pozab-jaj", "http://www.goodreads.com/book/show/108230.We_Wish_to_Inform_You_That_Tomorrow_We_Will_Be_Killed_With_Our_Families", "http://www.goodreads.com/book/show/270949.Standard_Operating_Procedure", "http://www.goodreads.com/book/show/235786.Cold_Case", "http://www.goodreads.com/book/show/18046030-yazar-n-odas", "http://www.goodreads.com/book/show/36601332-yazar-n-odas-2", "http://www.goodreads.com/book/show/25700623-the-paris-review", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}