{"ratings": 436, "userreviews": [{"userName": "Shareen Wornson", "userReviewDate": "Feb 27, 2012", "userURL": "http://www.goodreads.com/user/show/3287843-shareen-wornson", "userReview": "This book is longer than her first book (took me two nights to read) and Sarah has done better with her writing in this book as well. For those that were left wanting to know what happened to the little girl who was abused in the first story - this is Sarah's answer. She talks about how she got away from her abusive mother and how she was able to build a life for herself. It is good to know that in spite of her abuse and likely HUGE odds of leading a very dysfunctional life, Sarah was able to find some WONDERFUL people to help her grow and become the successful and \"normal\" person she is today. I am really thankful that she shared her story, and again - I hope that people will read this and that it can help. We can't just bury our heads in the sand when we think someone is being abused. I don't know why more people don't want to be involved in helping our innocent children. And, even if we are wrong - isn't it better to err on the side of the safety and well being of a child than to allow the abuse to continue and pretend that we didn't see anything? The more we tolerate abuse, the more children will be tortured and destroyed. How can this ever be OK?"}, {"userName": "Loni", "userReviewDate": "May 11, 2012", "userURL": "http://www.goodreads.com/user/show/1588261-loni", "userReview": "This book was absolutely amazing. I couldn’t put it down and read it in just over a day. This book truly shows how strong a person can be no matter what they are put through. Sarah lived through hell at the hands of her mother but was able to turn all of her experiences into something that made her a stronger person and I am sure, a much better mother. Sarah proves that no matter how tough life is, regardless of situation, we are able to overcome the most unbelievable circumstances. I actually read this book before reading Why Me, but I am going to purchase that book right now, as I cannot wait to read it."}, {"userName": "John", "userReviewDate": "Jun 20, 2012", "userURL": "http://www.goodreads.com/user/show/38140-john", "userReview": "Grabbed it from the Kindle store and wasn't sure what it was. It was All about childhood abuse endured by the author. It was not a happy read, but provided some insight for me into the topic."}, {"userName": "Julie Gausman", "userReviewDate": "Jan 21, 2018", "userURL": "http://www.goodreads.com/user/show/65718517-julie-gausman", "userReview": "What it isI absolutely loved this book! I was never abused by my parents! But I was abused by others. I have been going through therapy for over 20 years. I just wish I could be that strong! I am in the best relationship U have ever been in, I have 2 wonderful sons and a wonderful step-daughter and grandson. I have a wonderful relationship with God! But I don't ever see me being completely happy! I have so much hurt in me! I wish I had the courage and strength that Sarah has! Maybe someday!! Excellent book!"}, {"userName": "Marcia Stultz", "userReviewDate": "Dec 30, 2017", "userURL": "http://www.goodreads.com/user/show/69421740-marcia-stultz", "userReview": "In my dreamAfter reading a portion of this book, one night before going to bed.I awoke, the next morning,fighting to remember what appears to be a very interesting dream. It was during the latter half of the day that I realized that it wasn’t a dream, instead it was “What It Is”. It lingers. 👍🏾"}, {"userName": "Aaron", "userReviewDate": "Apr 05, 2018", "userURL": "http://www.goodreads.com/user/show/31888340-aaron", "userReview": "Reader CommentsThis book is highly recommend to victims of child abuse. This book does a good job at helping readers who are victims of child abuse to move on."}, {"userName": "DJ Looseleaf", "userReviewDate": "Dec 21, 2016", "userURL": "http://www.goodreads.com/user/show/62011171-dj-looseleaf", "userReview": "Read this book (vs the other two)Similar to the other two books in the series except with a theme of acceptance and resolution, much more fulfilling read."}, {"userName": "Janet Livingston", "userReviewDate": "Apr 30, 2018", "userURL": "http://www.goodreads.com/user/show/57194579-janet-livingston", "userReview": "Child abuse😥Sarah is a tremendous person for all she had gone through. This story made me so thankful DCF is Not like they were back then"}, {"userName": "Lizzie Winns", "userReviewDate": "Nov 17, 2017", "userURL": "http://www.goodreads.com/user/show/25994349-lizzie-winns", "userReview": "And that's what it is.This is the type of book that stays with you, long after you finished it. Great read and would recommend to others."}, {"userName": "Cathy", "userReviewDate": "Feb 17, 2017", "userURL": "http://www.goodreads.com/user/show/8303706-cathy", "userReview": "InterestingI liked the book, but the use of \"it is what it is\" was used too much. I understand her reasons for saying it, but there were other ways to express the same sentiment."}, {"userName": "Mary", "userReviewDate": "Jan 23, 2016", "userURL": "http://www.goodreads.com/user/show/7114619-mary", "userReview": "I am a survivor. I am a survivor of horrific physical and mental abuse inflicted on me by the one person in my life that was supposed to love and protect me and teach me right from wrong. I am a fighter because I did not allow my past to dictate my future and I fought for years to successfully overcome the demons left over from my childhood. I spent my entire life punishing myself for the acts of my mother. I spent years trying desperately to figure out why she was the way she was and what I could have done so wrong to make her hate me so much. My journey to overcome my childhood demons was difficult and painful; but in the end, I realized that my past is what it is and it was up to me to decide my future."}, {"userName": "Kelly", "userReviewDate": "Aug 04, 2013", "userURL": "http://www.goodreads.com/user/show/10572129-kelly", "userReview": "I thought is was an amazing story of how a child could overcome something so horrific. It is unfathomable how a mother could do this to her child. It makes me so sad and angry that CPS, who is supposed to protect children fail miserably time after time. If CPS won't protect these children, who will?? I felt an even more emotional response to this story after the birth of her son who has the same birthday as my daughter 2/2/07. I commend Sarah and all the abuse victims who tell their stories not only as part of their own healing process but to try to help others who are experiencing this. Bravery and strength don't even come close to describing what is has taken to get to the point of being able to tell their personal life story."}, {"userName": "Traci Domergue", "userReviewDate": "Jun 15, 2016", "userURL": "http://www.goodreads.com/user/show/12672884-traci-domergue", "userReview": "DeservingI am so glad to have had the pleasure of reading your three books! You deserve everything good in your life! Its sad to say, but some people just weren't made to be parents and they don't even deserve a second thought! You were and will always remain a precious child of God! He always shows up for us! I guess we have to go through the horrible stuff in life to get to the wonderful things ....continue with your story...I'm sure you have helped many out there that thought they had no hope or voice! May God bless you and your sweet family!  Sincerely, Traci Domergue"}, {"userName": "Norma Budden", "userReviewDate": "Aug 14, 2012", "userURL": "http://www.goodreads.com/user/show/6444954-norma-budden", "userReview": "It's wonderful when a person can rise above the circumstances of her life and turn it into a masterpiece. Instead of continually wondering why her mother treated her as she did, Sarah came to accept her childhood for what it was - one fraught with child abuse, a past she could not change - and rose above the circumstances so she could truly embrace a family of her own.I had the privilege of meeting Sarah and her family in 2011 and can truly say she's a wonderful person to be around. She has one of the most beautiful smiles I've ever seen and I can tell when she smiles that it still feels like a gift."}, {"userName": "Ray", "userReviewDate": "Nov 27, 2016", "userURL": "http://www.goodreads.com/user/show/7991458-ray", "userReview": "Fantastic Part TwoI read Why Me yesterday and had a lot of questions at the end. I'm glad to see this follow up answered all of them. Although I still struggled to emotionally attach, I was far more drawn into this one than the first. The largest appeal to What it Is is the fact the trauma of abuse permeates so many factors of life, even after the abuse ends, that in many ways you never truly get past it; you merely learn to cope with it and eventually overcome many obstacles. This book demonstrates clearly the irrational fears and self blame that haunt a victim for years and that alone makes it well worth reading."}, {"userName": "Christy", "userReviewDate": "Sep 28, 2011", "userURL": "http://www.goodreads.com/user/show/5060267-christy", "userReview": "A sad, but amazing story of a young woman who was able to survive and overcome severe, escalating abuse from the one person who was supposed to love and protect her - her Mother. \"What It Is\" goes hand and hand to \"Why Me.\" It is here in \"What It Is\" that Sarah tells us more of her story. It is a miracle that she survived and I am so happy for her that she turned out to be such a beautiful and strong woman. Sadly, there are victims of abuse all over the world. I hope this book helps them... No one should ever feel scared."}, {"userName": "Kate", "userReviewDate": "Oct 22, 2015", "userURL": "http://www.goodreads.com/user/show/5888299-kate", "userReview": "Depressingly dark and horrifying, it is nothing short of miraculous That Sarah has been able to come as far as she has. One could feel the pain she felt as she continuously tries to convince the readers (and herself) that she has put this all behind her. It's very clear that she is still haunted by the demons of her childhood. Who wouldn't be? Altogether, an average book of a horribly inexcusable childhood."}, {"userName": "Cheryl", "userReviewDate": "Dec 28, 2014", "userURL": "http://www.goodreads.com/user/show/2465265-cheryl", "userReview": "Heartfelt and uplifting Sarah Burleton is an amazingly strong, intelligent, and accomplished young woman. It is a testimony to her extraordinary resilience that she has written such a meaningful book about love and determination, as well as the horrific abuse she suffered as a child. You must also read \"Why Me?\" God bless you, Sarah. I admire you so much."}, {"userName": "Janet", "userReviewDate": "Oct 16, 2012", "userURL": "http://www.goodreads.com/user/show/6092516-janet", "userReview": "This was a really good book.To have the courage for someone to talk about there upbringing and still remember it.I will read her next book also and hope I will be moved by it like this one.I do have to say that in some of the things she was talking about I could relate that's is the scary thing.Mike you should read it.Maybe it will jar some memories."}, {"userName": "Alicia Northam", "userReviewDate": "Nov 30, 2015", "userURL": "http://www.goodreads.com/user/show/36346334-alicia-northam", "userReview": "Kinda blunders along...I read through this entire book expecting to find answers to all of the authors questions. Nope. She waxes a little too lovey dovey for me about her husband and kids, too!"}, {"userName": "Tory Klementsen", "userReviewDate": "Sep 08, 2012", "userURL": "http://www.goodreads.com/user/show/6138640-tory-klementsen", "userReview": "A very fast read and a heart wrenching book that ends too soon. I will never understand the abuse of a child...but Sarah Burleton proves that our tests in life make us stronger. It is a lesson I wish no child ever had to learn in this way, but that is what it is."}, {"userName": "Jolie", "userReviewDate": "Aug 07, 2012", "userURL": "http://www.goodreads.com/user/show/5122879-jolie", "userReview": "There are no words to express what I felt reading this book. The author suffered horrendus child abuse by her mother and went on to rise above it. I compare her story to \"A Child Called It\". I don't know if I could read this book again because of how painful the story is. But I will reccomend it."}, {"userName": "Becky Pierce", "userReviewDate": "May 08, 2012", "userURL": "http://www.goodreads.com/user/show/6120545-becky-pierce", "userReview": "Heartbreaking to hear the story BUT amazing to see how it is possible to move past anything and use it for good. It is what it is...no need whining and crying about it - the ending was awesome. Be thankful for the life you have - regardless if you think it is good, bad, unfair...it is what it is."}, {"userName": "Kim", "userReviewDate": "Aug 25, 2012", "userURL": "http://www.goodreads.com/user/show/9910060-kim", "userReview": "A heartwrenching book about a woman coming to terms with the abuse she suffered for years at the hands of someone she should have been able to trust with her life: her mother. There are some editing issues that an editor should have caught which were sometimes distracting from the narrative."}, {"userName": "Marlene", "userReviewDate": "May 08, 2012", "userURL": "http://www.goodreads.com/user/show/9090742-marlene", "userReview": "great read. her words are uplifting and sad at the same time."}, {"userName": "Cindy ", "userReviewDate": "Apr 12, 2014", "userURL": "http://www.goodreads.com/user/show/26978383-cindy", "userReview": "Very good endingI am so happy to know that at least a st this child made it through their abuse and thrived."}, {"userName": "Sarah", "userReviewDate": "Aug 17, 2013", "userURL": "http://www.goodreads.com/user/show/8973550-sarah", "userReview": "Awesome book. True story. Gripes the heart."}, {"userName": "Suzanne", "userReviewDate": "Feb 18, 2013", "userURL": "http://www.goodreads.com/user/show/12903699-suzanne", "userReview": "Better than her first book."}, {"userName": "Tracy Oliphant", "userReviewDate": "Jun 28, 2012", "userURL": "http://www.goodreads.com/user/show/6026489-tracy-oliphant", "userReview": "A friend suggested this one and she knows what I like.. She was right..."}, {"userName": "Marianne Long", "userReviewDate": "Sep 07, 2015", "userURL": "http://www.goodreads.com/user/show/5982782-marianne-long", "userReview": "Another great readGreat book, way too many typos, which are annoying, but overall I loved this story and will read more of her books."}], "description": "I am a survivor of horrific physical and mental abuse inflicted on me by the one person in my life that was supposed to love and protect me and teach me right from wrong. I am a fighter because I did not allow my past to dictate my future and I fought for years to successfully overcome the demons left over from my childhood. I spent my entire life punishing myself for the acts of my mother. I spent years trying desperately to figure out why she was the way she was and what I could have done so wrong to make her hate me so much. My journey to overcome my childhood demons was difficult and painful; but in the end, I realized that my past is what it is and it was up to me to decide my future.", "title": "What It Is", "url": "https://www.goodreads.com/book/show/12108006-what-it-is", "average": 4.01, "cover": "https://images.gr-assets.com/books/1353034925l/12108006.jpg", "reviews": 34, "authors": [{"url": "https://www.goodreads.com/author/show/4455161.Sarah_Burleton", "name": "Sarah Burleton"}], "type": ["Biography", "Nonfiction", "Business"], "outlinks": ["http://www.goodreads.com/book/show/12108006-what-it-is", "http://www.goodreads.com/book/show/12496895-what-it-is", "http://www.goodreads.com/book/show/9678501-why-me", "http://www.goodreads.com/book/show/18982058-why-them", "http://www.goodreads.com/book/show/19092397-annie-s-anorexic", "http://www.goodreads.com/book/show/24014876-why-her", "http://www.goodreads.com/book/show/20429521-why-me---the-complete-set", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}