{"ratings": 94, "userreviews": [{"userName": "Kendall ", "userReviewDate": "May 09, 2018", "userURL": "http://www.goodreads.com/user/show/42327848-kendall", "userReview": "What Happened That Night by Sandra Block is a quick, fast, and entertaining character driven novel. 5 years ago Dahlia was on her way to becoming a successful lawyer at Harvard University. One night Dahlia decides to attend a party with her friend and is brutally raped. Dahlia wakes up the next day and has no memory of the horrible assault. Years later, Dahlia is currently working as a paralegal and is suffering from PTSD from that horrible night. One day, Dahlia walks into her office and sees some of her male coworkers watching a video of a girl being brutally assaulted. Although, it's not just some girl... it's Dahlia herself on this video. All the horrible flashbacks and memories begin to surface for Dahlia. I feel like some of the scenes involving the brutal assault were hard to picture and hear about in the novel. But, the author was good about not going into too much detail involving the rape history. Dahlia meets James one of her coworkers along the way. He seems to be struggling with some issues of his own. James and Dahlia form a friendship and he tries to help Dahlia seek revenge on her attackers. I really liked James' character! He is such a sweetie :).The short chapters had me flying through this novel! I loved multiple POV and short chapters :).I felt like some of the parts were a little predictable which caused my rating to be a little lower. Additionally, I felt like it was missing something. I can't quite put my finger on it. Overall, it was an entertaining read :).3.75 starsThank you to Netgalley and Sourcebooks Landmark for the arc! Published to GR: 5/9/18Publication date: 6/5/18"}, {"userName": "Louise Wilson", "userReviewDate": "Jun 03, 2018", "userURL": "http://www.goodreads.com/user/show/42343152-louise-wilson", "userReview": "One moment Dahlia is a successful Havard student. The next, she wakes up from a party, the victim of a brutal assault.When a young, happy, carefree girl goes to a party, she is brutally attacked. When she wakes up she can't remember who it was that attacked her. Five years later, she still struggles with panic attacks and nightmares. She dropped out of Havard and now works as a paralegal. Dahlia two friends, Daisy and Eli, have always supported her. Eli even goes to the support groups with her. She met and has formed a strong friendship with James who also attends the support group. Then, a video surfaces online, and Dahlia sees her attack for the first time. She now knows exactly what happened to her. I really liked the characters James and Dahlia, and the strong friendship they formed. The story is also told from their point of view. The chapters are short. The sexual assault part in this story is quite graphic and therefore might not be suitable or might upset some readers. This is a well written book but I did feel the ending was a bit rushed. I would like to thank NetGalley, SOURCEBOOKS Landmark and the author Sandra Block for my ARC in exchange for an honest review."}, {"userName": "Selena", "userReviewDate": "Apr 27, 2018", "userURL": "http://www.goodreads.com/user/show/1932900-selena", "userReview": "I received a free e-book of What Happened That Night by Sandra Block from NetGalley for my honest review. Absolutely astonishing, gut wrenching, yet amazing. I was absolutely blown away by this book. I have never read anything by Sandra Block before but I will be reading some of her other books after reading this one. This is such a powerful book and written with so much thought and depth. A young, pretty, smart and happy girl goes to a party one evening and after that night, everything changes. She can't remember the details of the night but she know what happened. Through it all she fights to take back her life from those who stole it from her. Such a strong, emotional story of something that has happened to real women."}, {"userName": "Mandie", "userReviewDate": "Feb 16, 2018", "userURL": "http://www.goodreads.com/user/show/58327890-mandie", "userReview": "This book was great. It was gripping and emotional. It touched on so many realistic topics, that could happen to anyone! I would recommend.I voluntarily read and reviewed an advanced copy of this book. All thoughts and opinions are my own."}, {"userName": "Shannon", "userReviewDate": "May 07, 2018", "userURL": "http://www.goodreads.com/user/show/60039400-shannon", "userReview": "Thank you to Sourcebooks #partner for sending me What Happened That Night by Sandra Block. I enjoyed this one! Short chapters with multiple POVs = happy Shannon. Pub date June 5th!Five years ago, Dahlia was viciously attacked by multiple boys while she was a student at Harvard. She still struggles with nightmares and panic attacks but the worst part about it is that she can’t remember everything that happened that night. Now, after dropping out of Harvard, she works as paralegal.Dahlia has two great friends, Daisy and Eli, who support her through everything. Eli even goes to support groups with Dahlia. During one of her support groups she meets James who also deals with his own struggles. Come to find out they actually work at the same place!One day at work, as Dahlia walks into the lunch room she finds a bunch of guys surrounding a phone. She’s curious enough to ask what they are watching. To Dahlia’s horror, it’s a video of her attack. James ends up coming to Dahlia with a plan. She is so angry with her attackers she agrees! MuahahaI really loved James and Dahlia. Their friendship slowly turns into something *more*. The short chapters had me flying through this one! Betrayal, revenge, lies and secrets oooo juicy!"}, {"userName": "Liz Barnsley", "userReviewDate": "Mar 14, 2018", "userURL": "http://www.goodreads.com/user/show/16471876-liz-barnsley", "userReview": "A timely and relevant psychological thriller/character drama centred around two very different and quirky characters, one of whom is recovering from a suicide attempt following trauma and one who has suffered a horrible loss. It is gripping and cleverly written, I love how the main protagonists worked out their issues, not following any one path but rather working through things as they went. The author manages to portray the realities of justice and the many layers of recovery really well and it was a bit of a page turner. One of the huge strengths of this was the growing relationship between Dahlia and James, I loved them both in different ways and What Happened That Night doesn't follow a usual path, it has a resoundingly satisfactory ending and whilst if I had one bug bear it was that a certain twist was very obvious early on and not really required to my mind, overall this is a book that I will happily recommend.I'll be reviewing it on Liz Loves Books nearer the time of publication."}, {"userName": "Chandra Claypool (wherethereadergrows)", "userReviewDate": "May 13, 2018", "userURL": "http://www.goodreads.com/user/show/9722719-chandra-claypool-wherethereadergrows", "userReview": "I could not, in a million years, imagine what it's like to go through the trauma that Dahlia did, have PTSD of the event (that she cannot remember) and then see the attack come online years later. UFF. What I LOVE about this book is that the revenge factor is clear - but it's executed with the code of not killing anyone. The characters - how do you NOT fall in love with James?! Absolutely LOVE his character. The build up of friendship with Dahlia to something more was so much better than any instalove I've had to endure through. This felt so real and sincere between two people who have dealt with tragedy and can understand and accept the other's quirks. What's not to love?! Dahlia is also such a strong character. The ups and downs she goes through, the backlash after the attack of blaming the victim (her) from even her own family and how she deals with the consequences of her emotional roller coaster - really heart wrenching and I felt so MUCH for her throughout this read. My favorite secondary character? Has to be Natasha - I think if you read this book you'll totally understand why. Told from the point of view of Dahlia and James with a few chat room chats between the demons of the story, the short chapters keep your attention from page one to the very end. I felt my eyes drooping at one point but could NOT stop so fought my way through, stayed awake and finished the book. The author does a great job in putting you right inside the mind of and portraying Dahlia's heartache, James's Asberger Syndrome and even the pathetic and entitled minds of the Hawk Club. There are some graphic parts regarding the attack that may be hard for some readers. I think the author did it tastefully though and it was necessary to really get you inside Dahlia's head.If I had to be picky in any way about this, the ending did feel a teeny bit rushed after all the detail given throughout the rest of the book. I was so engaged in the characters that I didn't quite see the little twist! I knew there was one heading in that direction but my mind, weirdly, wasn't trying to figure it out and was enjoying the read outside of the twisty part. I am completely satisfied and could NOT put this book down. It gave me a little bit of \"The Accused\" movie with Jody Foster throughout. Oh sweet, sweet revenge - sometimes it is just SO satisfying!Thank you to the publisher for this copy <3"}, {"userName": "BAM The Bibliomaniac ", "userReviewDate": "May 15, 2018", "userURL": "http://www.goodreads.com/user/show/6595648-bam-the-bibliomaniac", "userReview": "Netgalley #55Many thanks go to Sandra Block, Sourcebooks, and Netgalley for the free copy of this book in exchange for my unbiased review.You know at first this book was only so-so, but now I can’t put it down! I love the James Dahlia dynamic, and the Ramona/Robert mini plot is heartbreakingIf it weren’t for the author seeming to blatantly ruin her own twists. I’d have rated it higherThere is one conversation that could be rewritten or the story in someway edit the book so that a HUGE plot twist is not spoiled. That was really disappointing. There has to be a way to do that. Otherwise I highly support the revenge angle. I love strong female characters who take no crap. All in all I'd say I'd recommend this book to other readers."}, {"userName": "Jamie Rosenblit", "userReviewDate": "May 14, 2018", "userURL": "http://www.goodreads.com/user/show/2364302-jamie-rosenblit", "userReview": "Review to come!"}, {"userName": "Mrs Mommy Booknerd http://mrsmommybooknerd.blogspot.com", "userReviewDate": "Jun 06, 2018", "userURL": "http://www.goodreads.com/user/show/4827402-mrs-mommy-booknerd-http-mrsmommybooknerd-blogspot-com", "userReview": "#FirstLine ~ It sucks me in.Holy Man! This book is rock solid. Block has managed to tackle some very tough topics with such a genuine and authentic voice. She is not afraid to let the characters lead the story and share their own truths. Her brilliantly thrilling book left me memorized. It was paced perfectly and the characters were those that you could not help but be moved by. This book literally knocked my socks off. It will make a PERFECT book club pick!"}, {"userName": "Sonja Yoerg", "userReviewDate": "Apr 12, 2018", "userURL": "http://www.goodreads.com/user/show/6978062-sonja-yoerg", "userReview": "A fast-paced suspense read with memorable characters and rock-solid writing. I was utterly captivated by Dahlia’s quest for healing through revenge and totally charmed by her relationship with James. Rape, suicide, and autism are tough subjects for any author to handle but Block’s intelligence and compassionate approach allow her to succeed. What Happened That Night is a timely story with plenty of controversy for book club discussion. Highly recommended!"}, {"userName": "Lisa Elizabeth", "userReviewDate": "Feb 11, 2018", "userURL": "http://www.goodreads.com/user/show/105323-lisa-elizabeth", "userReview": "This book was trying to hit all the notes to be a topical book, dealing with sexual assault, self-harm, suicide, LGBTQ identity and autism but it ended up being messy and offensive and pretty poorly written."}, {"userName": "Kathy", "userReviewDate": "Jun 04, 2018", "userURL": "http://www.goodreads.com/user/show/27490595-kathy", "userReview": "Be forewarned: What Happened That Night is a book that is very hard to put down once you start it. It is a compelling, character-driven read.Five years ago, Dahlia was a student at Harvard ready to go on to law school. All that changed, when she went to a party and was brutally sexually assaulted. While she has no memory of the assault, her physical and emotional trauma was so great that she dropped out of school, losing herself to PTSD. Stronger now through therapy, Dahlia works as a paralegal. She still struggles with the past, but she is moving on as best she can. Until she finds a group of co-workers in the break-room gathered around a terminal watching her assault online!! Now that she knows what happened to her, she is determined to bring those in the video to justice, and they are just as determined to stop her from doing so. Each ups the ante bit by bit until you want to scream because you can't turn the pages fast enough!! Block does an excellent job of building the main characters and building suspense. She also is skilled at handling difficult topics such as sexual assault, suicide, Asperger's well. I loved the relationship between Dahlia and Frank! Many thanks to NetGalley and Sourcebooks Landmark for allowing me to read an ARC of this book in exchange for an honest review."}, {"userName": "OutlawPoet", "userReviewDate": "Feb 23, 2018", "userURL": "http://www.goodreads.com/user/show/245365-outlawpoet", "userReview": "---- Possible spoilers! ----This is a pretty good thriller.You have two unconventional main characters and I really liked them. It was nice not reading about conventionally handsome man and ordinary Mary Jane Investigates! Instead, we have two people who don’t conform to social norms and who have each experienced true tragedy in their lives.Unfortunately, I figured out the main secret of the book at about 30%. Regardless, I still enjoyed the read. Readers should be aware that there are rather graphic descriptions of sexual assault. Some of this definitely isn’t the easiest thing to read, but the author handles it well. It never felt gratuitous. It did feel sickening, but that was the point.I admit that I thought things would spiral out of control for our main character a bit quicker and a bit more intensely. However, the tension and suspense were still there.A good, fast read!*ARC Provided via Net Galley"}, {"userName": "Karen Whittard", "userReviewDate": "Feb 15, 2018", "userURL": "http://www.goodreads.com/user/show/30631037-karen-whittard", "userReview": "This book is completely gripping all the way through. Fantastically written. Great characters and a great read. Throughly enjoyed."}, {"userName": "Debbie", "userReviewDate": "Jun 05, 2018", "userURL": "http://www.goodreads.com/user/show/12691311-debbie", "userReview": "Wow!!A woman was drugged and gets raped on campus and doesn't remember a thing, except birds chirping, men in line, laughing, and, of course, the pain. Now, she suffers from PTSD, imagine that.The last part of this book was killing me. I feared for Dahlia. She was crazy with her revenge. I wanted to holler \"you go girl!\" so many times but I just couldn't. My fear was so strong for her. That kept me going for like over half of this book.I'm not going to spoil it for you and tell you what happened. Just know if you have a heart problem, you may want to use caution before picking this book. Because mine was beating like crazy and it kept on until the very end. However, if you like really good suspenseful books, pick this one!A really good book that would not let me put it down or go to sleep for a while after I finished.Huge thanks to Sourcebooks Landmark and Net Galley for providing me with a free e-galley in exchange for an honest, unbiased review."}, {"userName": "Anne", "userReviewDate": "May 22, 2018", "userURL": "http://www.goodreads.com/user/show/57161856-anne", "userReview": "I adored this book! Block is one of my favorite authors and this one has become my favorite. It's such a timely book as well as it deals with a long-ago gang rape at a party that surfaces in the present as a video, both humiliating Dahlia and spurring her on to revenge for this vile crime. Dealing with other pertinent issues such as Aspergers, gender identity, bullying, cyberstalking, and suicide, none of it feels forced or sappy. I literally had to stop \"adulting\" for the day so I could read it in one sitting. This one will stay with me a long time after I've read other novels. Highly recommended!Thanks to NetGalley for this ARC!"}, {"userName": "Michael David", "userReviewDate": "Feb 18, 2018", "userURL": "http://www.goodreads.com/user/show/43787758-michael-david", "userReview": "WHAT HAPPENED THAT NIGHT is a suspenseful, sad, romantic and sometimes violent thriller. I really loved the character of Dahlia. Once she decides to get revenge on the people who brutally attacked her years earlier, the book really kicks into gear! I also loved her growing friendship/relationship with James, and how he supports her. Author Sandra Block does an excellent job building the tension and also making us truly care about the characters. There were some nice twists and turns that I didn't see coming. I am eagerly anticipating reading more from Sandra Block, and this book is highly recommended! Thanks to author Sandra Block, publisher Sourcebooks Landmark and NetGalley for an ARC of this book."}, {"userName": "Suz Jay", "userReviewDate": "Mar 16, 2018", "userURL": "http://www.goodreads.com/user/show/14684876-suz-jay", "userReview": "I was excited to have the opportunity to obtain an Advanced Reader Copy (ARC) of this book from NetGalley.“It’s like an itch that I need to scratch, even if it draws blood, even if I tear the scab off. Because now it’s out there, that night. Part of my life that I could never account for was finally given back to me. Like a gift, spiked with poison.”During her time as an undergraduate at Harvard, Dahlia was gang raped. Unable to rebound from the brutal attack that she barely remembers, she attempted suicide, but survived. Years later, when she has a steady job as a paralegal and a solid support system in her friends Eli and Daisy, Dahlia discovers a recording of her rape posted online. She follows clues to discover the identity of her rapists and extract revenge on each of them. But the men work to destroy her before she can take them all down.Block uses the points of view of Dahlia and James, her hot IT guy love interest and co-conspirator to tell the tale. The villain POV is provided in the form of chatroom conversation between the rapists. WHAT HAPPENED THAT NIGHT is a well-plotted thriller with solid characterization. Dahlia, from her “survivor” tattoo to her endless supply of moxie, is a protagonist that readers will cheer for. Like a phoenix, she rises from the ashes of despair, and takes charge. In James, she finds the perfect sidekick. He possesses the computer mojo Dahlia needs and, unable to deliver his own revenge, he’s ready to give her the tools to punish her rapists. Dahlia and James’s relationship makes for a great subplot and an opportunity to showcase their personalities. WHAT HAPPENED THAT NIGHT is a thriller with heart and soul."}, {"userName": "Heidi Lynn", "userReviewDate": "Feb 19, 2018", "userURL": "http://www.goodreads.com/user/show/8843732-heidi-lynn", "userReview": "First, I want to thank Sandra Block, Sourcebooks Landmark and NetGalley for providing me with this book. What Happened That Night by Sandra Block was a book that brought out a lot of emotions out in me due to the subject material at hand. This book has subject matter that could be a trigger for anyone that has been in a date rape or gang rape situation. That being said this book may not be for everyone. Read at your own risk. My heart ached for Dahlia for 5 years ago she was drugged and gang raped by 5 boys. She went from being a pretty girl that night to a changed girl that night. She had no clue who did this to her. She got seizures, tried to kill herself, turned to alcohol. All because of what these sick monsters did to her. Fast forward to present day when she is working and sees the video of her being raped!! Yes, there was a video that she never knew about! Now Dalia wanted to find out exactly who these men were and wanted revenge.James was one of the characters I liked the most in the book. He was in the IT department and had Asperger’s. He and Dahlia hit it off right away."}, {"userName": "Yvonne (It's All About Books)", "userReviewDate": "Jun 06, 2018", "userURL": "http://www.goodreads.com/user/show/17970468-yvonne-it-s-all-about-books", "userReview": "[As soon as I saw the cover, I just knew I had to read this thriller. And it turns out my coverlove instinct was absolutely right. Dark, gritty, painful and strong... What Happened That Night is without doubt a story that will crawl under your skin, unsettle you and leave you with an uncomfortable but satisfied feeling after you finish it. Why? Let's just say that there are a lot of trigger warnings in place for the more sensitive readers, including for rape, violence, suicide and graphic scenes in general. If you can stomach those elements, you will find yourself a very interesting thriller in What Happened That Night. The writing style is engaging and I liked the diversity of the main characters and their development. Dahlia is a very strong character with a lot of problems, but I like her style. James is also a favorite, and I appreciate that his Asperger's syndrome plays a role throughout the story. The dynamics between Dahlia and James are interesting as well and is part of the reason this book works. That said, I did have my doubts about the credibility of it all, especially involving the revenge plan  Dahlia and James have developed. I seriously doubt they would be able to get away with all that... And I saw credibility holes in the plot as well. More importantly, I was also able to guess one or two mayor plot twists early on even though I kept hoping I was wrong. That might just be me reading a lot of thrillers in the first place though. Because there is no doubt What Happened That Night is a superfast, dark and twisted thriller that will chill you to the bone.Dahlia used to be a successful Harvard student on her way to becoming a lawyer, but that all changed one horrible night. She wakes up after a party after having been brutally assaulted. The worst part: she doesn't seem to remember anything from that night, just that her life will never be the same. Years later, she still suffers from PTSD and hasn't properly been able to deal with that night... Until one day, a video turns up online and Dahlia sees for the first night what really happened during the attack. And now she knows who to blame, she is out for her revenge...What Happened That Night isn't any easy read and trigger warnings are in place, but if you like your thrillers dark and gritty you will be in for a treat. This story has an original ring to it, both because of the selection of characters and the plot itself. True, I had my doubts about the credibility and I was able to guess one or two key plot twists, but that doesn't take away this is still a pretty darn good and twisted thriller. (hide spoiler)]"}, {"userName": "Kath", "userReviewDate": "May 22, 2018", "userURL": "http://www.goodreads.com/user/show/5826296-kath", "userReview": "Dahlia had her whole life ahead of her. Top grade student she was well on her way to her law degree until that night, at that party, five years ago, something horrible happened to her. She knows she was assaulted but her memory is gone. Fast forward to the present day and we reconnect with her as she is now, still suffering badly from that night, and with her education cut short after what happened, she is now working as a paralegal. One day, a video appears on the web which she sees colleagues watching. She has a look and recognises herself. It's a video of her attack, Not only that, it identifies her attackers. She now has the evidence of what happened to her. But, with her memory of the way the Police handled her after she initially reported the attack, how they treated her, how they blamed her, she isn't about to take it to them to investigate. No way. With her hackles up and her rage unleashed, she remembers the old adage; revenge is a dish best served cold.Its hard to say that I enjoyed this book due to the nature of what happened to Dahlia. Indeed, it was at times a hard book to read. But the author does a great job of giving enough to set the scene but not too much that it is overpowering. It was harrowing and horrible, especially when we \"met\" the guys involved in the events that took place and the way they \"talked\" about them. But this was offset very well by the friendship that blossomed between Dahlia and James, a colleague who offers to help her with some of the investigative side of things. James's own story in itself adds to the colour of the whole book. It's hard to say much more about the specifics about what happens in the book without giving anything away but suffice to say that the main theme running through the narrative was about a young woman taking back her life. Whether she achieves this and whether it helps her, well, you'll just have to read it for yourself.Not having gone through anything nearly like what happened to Dahlia, it was hard for me to really connect with her apart from obviously feeling deeply for what she went through. I couldn't quite connect with her fully and thought that some of the things she did were a little bit off. But then, not having walked in her shoes, who am I to judge. I just can't help thinking that maybe there was a different way to go. That speaks more about me than the author but I have to be honest in my review. I actually better connected to James and what he was going through. And I really did feel for him, maybe more than Dahlia. All in all, a tough but on the whole satisfying read which I definitely think could be a great book club read as it definitely made me think and question my morals and ethics.My thanks go to the Publisher and Netgalley for the chance to read this book."}, {"userName": "Jen", "userReviewDate": "Jun 05, 2018", "userURL": "http://www.goodreads.com/user/show/3156542-jen", "userReview": "A psychological thriller that will leave the reader turning the pages long into the night, What Happened That Night is the story of Dahlia. Dahlia is a Harvard student who was brutally attacked one night by a group of men and eventually had to leave school. She is now a paralegal suffering from PTSD and has no recollection of the night she was attacked. One day, she walks into the staff lounge to get a cup of coffee and finds lawyers from her firm watching a video. She looks at the screen and there it is- the brutal attack she endured, all caught on film. Now she knows who, and what, they did to her that night that changed her life forever. She begins to exact revenge on the men who hurt her most. This is a fast paced, compelling read but it is hard to read at times as it deals with very hard topics. I quite enjoyed watching Dahlia overcome what happened to her and take control over the situation. The revenge tactics were a bit far fetched for me, yet I couldn't put the book down. With excellent character development and just the right amount of suspense, What Happened That Night was a great story of redemption. For me, this was ⭐️⭐️⭐️/5 stars. Thank you @sourcebooks for this advance reader in exchange for my honest review."}, {"userName": "Kelli Martin", "userReviewDate": "Jun 03, 2018", "userURL": "http://www.goodreads.com/user/show/5238017-kelli-martin", "userReview": "This book bounces between 3 different viewpoints- Dahlia, Dahlia 5 years ago and James. Sandra Block defense knows how to keep you guessing. I would have liked a little more detail at parts. And somethings didn’t work for me, like the length of the video. I just have a hard time believing everything that is supposed to have happened, did happen within that time frame. Or how easy it was for Dahlia and James to do what they did. Or how Dahlia thought she would be able to just walk into the party and find what she was looking for. My heart broke for Dahlia when she found out who the 4th guy was. There were so many different parts that in the end, fit together like a puzzle. While reading, you think ‘what does this have to do with the story?’ Then once it’s revealed, it makes sense. I gave this book 4 stars because like I said previously, I would have like a little more detail and those parts that didn’t quite make sense. Thanks to Netgalley and Sourcebooks Landmark for the opportunity to read and review this book prior to release."}, {"userName": "Wendi Lee", "userReviewDate": "May 30, 2018", "userURL": "http://www.goodreads.com/user/show/30649545-wendi-lee", "userReview": "Trigger warning: rape and assault. This is a revenge novel, pure and simple. Five years ago, Dahlia had a promising future. She was a pre-law Harvard student. She had her whole life under control. Until she went to a campus party, and everything was ripped away from her. She stopped going to school, grappled with depression, and settled for a job as a paralegal. She trusts no men except Eli, her bestie. Until she meets James. Until she sees a video of what happened to her that night, and James volunteers to help her get revenge. Both Dahlia and James are very compelling characters, and of course I was rooting for Dahlia the whole time. I did feel that some of the things they did were implausible (although I’m in no way an expert), but it didn’t hinder my reading experience at all. And I guessed the big twist almost right away, but that didn’t bother me either. All in all, a very good read. Thank you to Netgalley and the publisher for an arc."}, {"userName": "Kathy", "userReviewDate": "May 10, 2018", "userURL": "http://www.goodreads.com/user/show/3446463-kathy", "userReview": "4.5 stars.What Happened That Night by Sandra Block is an empowering novel of healing for a victim of a horrific sexual assault.Five years earlier, Harvard  college senior Dahlia Edelman attends a finals party where she is roofied and sexually assaulted by several men.  With only brief flashes of memories of what happened to her and angry over her treatment by the police, she eventually falls into a deep depression and leaves Harvard before graduation. With the support of her best guy pal, Eli Sawyer, Dahlia is now getting her life back on track as she completes her degree through night classes while working as a paralegal. Her life is completely upended when she discovers  someone has posted an appalling video of her sexual assault online. With the help of her friend, Daisy and her co-worker/friend James Gardner, Dahlia begins to uncover the identities of the men in the video in order to exact her revenge for the heinous and brutal assault.Although Dahlia has not regained her memories of the night she was brutalized, she has taken many steps to regain control over her life. She still regularly talks with her counselor, she carries a weapon to protect herself and she has also taken self defense courses. Dahlia's life is a little solitary as she mainly hangs out with Eli, works and attends classes but she has achieved a measure of peace. At a support group meeting, James catches her eye but she is still quite surprised when he seeks he out at work the next day.  Dahlia is taken off guard by how much she enjoys spending time with James, but her world is thrown into chaos after the video is posted online.James is socially awkward and he is very literal during conversations. A computer geek, he is quite intelligent and lives a fairly quiet life with little social interaction outside of work. James immediately connects with Dahlia and although he is somewhat abrupt when he first asks her out, the two hit it off. He is angry on Dahlia's behalf when the video surfaces and he does not hesitate to join her as she seeks out her own brand of justice against the men who assaulted her.Dahlia's attackers are now wealthy with successful careers  but she and James gradually figure out how to take them down. They cleverly put James's computer skills to work and they ruthlessly set their plans in motion. Dahlia feels no remorse for what she is doing but she does have reservations about their plan for one of the men. However, when she recalls his actions on the video, she easily overcomes her hesitation.  When shocking new information comes to light about the finals group, Dahlia is unstoppable as she does everything within her power to get justice for herself and right this terrible wrong.What Happened That Night is an absolutely riveting, emotional and suspense-laden mystery. Dahlia and James are absolutely delightful characters who are struggling to overcome the tragedies that have left powerful scars on them.  Although some of the  content is graphic, Sandra Block deftly handles these difficult topics and passages with a great deal of sensitivity. With an absolutely stunning and completely unexpected plot twist, the novel concludes on a uplifting and positive note. An absolutely brilliant read that I HIGHLY recommend to fans of the genre."}, {"userName": "Cathy Geha", "userReviewDate": "Jun 05, 2018", "userURL": "http://www.goodreads.com/user/show/21182032-cathy-geha", "userReview": "What Happened That Night by Sandra BlockMixed feelings on this book…I can see it appealing to New Adult readers wanting a young woman who has been raped to achieve revenge against the group of men that attacked her BUT I am not sure how I feel about what she chose to do to the men to extract that revenge. The way Dahlia and James went about achieving her revenge seemed hard to believe and their relationship was difficult for me to understand. It was an unsettling book and I am still sitting on the fence as to how I feel about it right now.Did I like it? Not sureWas it well written? First person point of view of James and Dahlia with flashbacks – Style fine –Was it believable? Not to meWould I read another book by this author? PerhapsThank you to NetGalley and Sourcebooks Landmark for the ARC – This is my honest review.3 Stars"}, {"userName": "Piepie", "userReviewDate": "May 29, 2018", "userURL": "http://www.goodreads.com/user/show/663327-piepie", "userReview": "[transgender (hide spoiler)]"}, {"userName": "Pattyh", "userReviewDate": "Mar 02, 2018", "userURL": "http://www.goodreads.com/user/show/27158252-pattyh", "userReview": "Thank you Netgalley for the opportunity to read What Happened That Night by Sandra Block. This is a tough story or any story dealing with physical abuse or rape. A young woman is assaulted one night and it is a tramatic event that leaves her devistated. Years later, she discovers a video of her assault and it brings back all her bad memories, fears, and sadness. She will fight back - and someone will pay.This is a sad book, at least it was for me. Difficult to read, but will get you thinking."}, {"userName": "Diane Merritt", "userReviewDate": "Apr 03, 2018", "userURL": "http://www.goodreads.com/user/show/45494099-diane-merritt", "userReview": "Took me a little to get into this book.. Revenge is sweet sometimes. Was rooting for her all the way through. A tough subject matter. Good read!Thanks to the publisher and netgalley for an early release of this book"}], "description": "One moment Dahlia is a successful Harvard student. The next, she wakes up from a party, the victim of a brutal assault. Her life veers into a tailspin, and what’s worse, her memory of the attack has been ripped away, leaving a cold rage in its wake.Now, years later, Dahlia is a tattooed paralegal suffering from PTSD, still haunted by that night. Until one day, a video surfaces online, and Dahlia sees her attack for the first time. Now she knows what happened to her. And she knows who to blame. Her rage is no longer cold, but burning, red hot. And she is about to make everyone pay.", "title": "What Happened That Night", "url": "http://www.goodreads.com/book/show/36662489-what-happened-that-night", "average": 4.12, "cover": "https://images.gr-assets.com/books/1515343139l/36662489.jpg", "reviews": 74, "authors": [{"url": "https://www.goodreads.com/author/show/1370782.Sandra_Block", "name": "Sandra  Block"}], "type": ["Thriller", "Mystery", "Suspense", "Fiction", "Thriller"], "outlinks": ["http://www.goodreads.com/book/show/36662489-what-happened-that-night", "http://www.goodreads.com/book/show/39740707-what-happened-that-night", "http://www.goodreads.com/book/show/24488233-the-girl-without-a-name", "http://www.goodreads.com/book/show/22511172-little-black-lies", "http://www.goodreads.com/book/show/31423097-the-secret-room", "http://www.goodreads.com/book/show/25994082-little-black-lies---free-preview", "http://www.goodreads.com/book/show/25995338-the-girl-without-a-name---free-preview"]}