{"ratings": 86, "userreviews": [{"userName": "Maureen Timerman", "userReviewDate": "Jan 10, 2018", "userURL": "http://www.goodreads.com/user/show/3840941-maureen-timerman", "userReview": "Such a sweet love story and then you realize that they have never met, and all because they share a love of God, and mankind.We see sacrifice at the ultimate, giving up the life you desire for your sister, and giving up the man you love.This story is based on faith, but there is sadness, and I found myself also admiring the step-father, so little time in the family, but what love and compassion he shows.The author has woven a perfect story of love of God, family, and fellow man, and kept me page-turning to the very end.I received this book through Celebrate Lit, and was not required to give a positive review."}, {"userName": "Carrie Schmidt (Reading is My SuperPower)", "userReviewDate": "Feb 17, 2018", "userURL": "http://www.goodreads.com/user/show/6084197-carrie-schmidt-reading-is-my-superpower", "userReview": "3.5 stars What Dreams May Come is such a unique story, made even more special by the fact that the author based it on her real-life romance with her husband.Part of what makes it so unique is that the hero and heroine have never met in person … and still don’t for the majority of the book. In fact, the book also begins in the middle of their relationship (though it appears to be the end). Additionally, Terry tells the story from both Scott and Susannah’s perspective, and part of it is told in a semi-flashback (Scott rereads the emails Susannah had sent him while they were first getting to know each other). While this took a bit of getting used to, I ultimately really liked the format for this specific story.Susannah is really young but spiritually mature, and in her first few emails to Scott (who is older) you can see how sheltered she has been. (Not that this is a bad thing, just an observation) She unfortunately has to grow up quickly and take on the care of her sister Kitty who has cerebral palsy. (Kitty is a fabulous character, by the way! Such a great personality even without a spoken voice.) Her plans with Scott – whom she has still not met in person – are put on hold, and so are her dreams. And, by default, so are Scott’s dreams.Their individual confusion is one I would guess many have experienced. That feeling of ‘did I totally misread God and His plans for my life?’ that can be common in your early twenties (or late adolescence). I absolutely could relate to their questions, their rethinking of what they thought they knew. I also really appreciated that their relationship was built on shared beliefs, shared goals, and falling in love with someone’s heart – not their physical looks.Bottom Line: What Dreams May Come by Alana Terry is a sweet, light love story that explores what happens when we give our dreams to God and let Him dream His dreams for us. Grandma Lucy and Kitty stole the show for me, personally – their characters consistently made me smile and want to spend more time with them. You will root for Scott and Susannah to find a happily ever after, though it may take a different shape than you originally imagined, bringing you right alongside their story and how they feel, too.(I voluntarily reviewed a complimentary copy of this book)first seen at Reading Is My SuperPower"}, {"userName": "Hope", "userReviewDate": "Nov 03, 2017", "userURL": "http://www.goodreads.com/user/show/13246091-hope", "userReview": "I normally avoid Christian fiction, but decided to give this a try since (1) it's about missionaries, which is quite a switch from your typical romance novel, (2) I like epistolary novels and the blurb said letters were included, and (3) it was by an established author so it had less chance of being badly written.The author invested very little time in fleshing out her characters. And there are very few descriptions of people and places so it's hard to picture anything. (The one exception was the pink prom dress.)The praying and Bible verse quoting were so thick that it felt more like a sermon than a story. When will Christian authors realize that truth can be heard and understood without the need for them to bash us over the head with it?Heaven only knows why I keep giving Christian fiction a chance."}, {"userName": "Esther Filbrun", "userReviewDate": "Dec 29, 2017", "userURL": "http://www.goodreads.com/user/show/16539097-esther-filbrun", "userReview": "How can you describe a book that you loved so much, and yet one that ripped through you like a knife because it’s so real? For me, that’s a little bit like what What Dreams May Come was like. Heart-wrenchingly beautiful, and at the same time painful to watch. And one that made it to near the top of my list for 2017 in the end.I expected a sweet romance when I picked this up, but instead I was given a novel with depths of grief and dashed dreams that completely blew me away. It wasn’t that this story was deep, necessarily—it was just good. And for me, I was able to relate to the main character, understand her pain and (SPOILER ALERT!) cheer when she finally got what she was wanting.Overall, this isn’t a very deep book. But there are deep elements to it, so if you like something that’ll make you think, something you can laugh (and maybe cry!) with, and something with a good romance, I think you’d enjoy this story. Alana Terry is quickly becoming one of my more recent favorite authors, and I’m really looking forward to reading the next book in this series soon—I think it’ll be pretty good as well!Note: I received this book for free from the author, and chose to share my opinions of the book."}, {"userName": "Trisha Robertson (Joy of Reading)", "userReviewDate": "Feb 11, 2018", "userURL": "http://www.goodreads.com/user/show/21132617-trisha-robertson-joy-of-reading", "userReview": "This sweet love story will take you on a journey of the heart. While you won’t travel across the globe, your heart will travel on an unexpected journey all it’s own.Susanna feels a called by God to be a missionary to the world. After high school she began working at the local assisted living facility, as a nursing aid. But her greatest heart’s desire is to share the gospel to the world. She finds an missionary agency that offers a summer program, and this seems like the answer to her prayers. After a few emails and a phone call she feels a connection to the recruiter.Scott enjoys traveling the globe and supporting the missionaries. When he receives an email from a young lady on the other side of the country who seems to be on fire for God and have a deep longing for the mission field, he is surprised by the sudden connection he feels with her.I appreciated the strong faith in this story, the deep roots of prayer and the reminders of trusting God even in the hard times when things don’t seem to be going as planned. The chapters alternate between telling the story from Susanna’s point of view then Scott’s point of view, and for me this switch back and forth was a bit choppy in places. However, by the end it all fits together.A story with a deep well of emotion and strong roots in faith. This sweet heart-warming story is sure to edify your convictions of sharing the gospel and to remind you that you don’t have to travel the world to share the love of God. I give this story 3.5 stars and would recommend it to those who enjoy reading stories of tender love, and deep faith.(I receive complimentary books for review from publishers, publicists, and/or authors, including Netgalley. I am not required to write positive reviews. The opinions I have expressed are my own.)"}, {"userName": "Lydia Howe", "userReviewDate": "Oct 27, 2017", "userURL": "http://www.goodreads.com/user/show/35587655-lydia-howe", "userReview": "This book was a quick, sweet read. I don't generally read books that run fully on romance, but I wanted to because I really like this author and the book is based on her real-life love story. I thought the author did a really good job of making it realistic (I mean, not that I would have thought it was realistic if it wasn't based on a true story), and not making it be all lovely-dovely. The romance was built on solid facts (as opposed to \"Oh, he's cute so I'll like him\"), and that makes me happy because I think that leads for a much stronger story. (And way stronger in real life.)"}, {"userName": "Amber Stokes", "userReviewDate": "Oct 27, 2017", "userURL": "http://www.goodreads.com/user/show/3571177-amber-stokes", "userReview": "Knowing this has its main basis in reality makes the romance extra sweet! The story unfolds slowly, taking its time to share how the two main characters ended up in such a tragic situation, far apart and unable to see how anything could change. I like how the tension feels authentic and the heroine's love and loyalty are so strong. This is a bittersweet but inspiring tale about trusting God with the dreams He gives and opening your heart to hope again."}, {"userName": "Fizzy", "userReviewDate": "Feb 11, 2018", "userURL": "http://www.goodreads.com/user/show/6471931-fizzy", "userReview": "Sometimes you sit down and write a review of a book and the words are easy and the sentiments flow like gravy. Other times your heart knows what it wants to say but you brain can’t turn that into words. This is the second time. I really enjoyed this book, with a background of truth, and a theme of faith. I enjoyed getting to know Susannah and Scott. This book steps into the end of their love story. They’ve already fallen in love, via phone calls and emails. They’ve yet to meet face to face. I wondered for chapters and didn’t really find out what happened until about a third of the way through the book. And then … the overwhelming need to pass out a plethora of Gibbs’ smacks began.Susannah was so very sheltered I wondered how she would function on an international mission stage. Away from home, without constant oversight, without guidance from her family. I enjoyed the changes between their two perspectives as each chapter started, though for the bulk of the book it was all Susannah as Scott was apparently reading her old emails. They were both characters of depth and a deep faith. They interacted with God like a best friend which was so refreshing … and sometimes really hard to do. They were both flawed, I mean not obviously, deeply, overwhelming flawed but flawed all the same. And they frustrated me to the core.I got bogged down in the story as they both kept lamenting about how they couldn’t be together anymore. They both CONSTANTLY thought of little but the other. It almost felt whiny. I mean it wasn’t whiny but it was. They both acted like their love was something they had to sacrifice for everyone else. And God. Susannah believed that in order to fulfill the promise she had made to her mother she had to sacrifice her love for Scott, her calling to missions, and even the core of herself. Scott believed that he had to sacrifice everything because Susannah said so. In all their prayers and inner monologues instead of asking God what the next step should be they were asking Him to take the love they had for each other. I mean really people?!?I loved the scenes with Grandma Lucy (I fell in love with her character in Beauty From Ashes) and the truth that only she can share. I wish she had played a bigger part in Susannah’s story. I loved that even though Susannah’s mother had passed away her new step-dad still stepped in and played a role in her and her sister’s lives. There was so much to love in this book. But then I remember the whining and I have to step back a minute. There is a lot of truth to learn here. Truth about God as the father. Truth about God as a best friend. Truth about learning when to trust that God will carry you through to His perfect end. Truth that sometimes we all put words in God’s mouth (so to speak) and instead of assuming that God has taken something from us we need to instead assume that God will show us the way.Now, bring on book two in the series!I was provided a complimentary copy of this book by CelebrateLit. I was not compensated for this review and all thoughts and opinions expressed are my own. I was not required to write a positive review. Originally published at https://fizzypopcollection.com/what-d...."}, {"userName": "Crystal Scott", "userReviewDate": "Feb 17, 2018", "userURL": "http://www.goodreads.com/user/show/16139067-crystal-scott", "userReview": "There are several things that I look for in a book, the genre, the writing style, the story line are just a few. When I was offered to review Alana Terry's new book, What Dreams May Come, I couldn't wait. The description grabbed my attention and I knew this was going to be a great book. What surprised me the most was learning that she had written this story before her and her husband had met but it was their true life love story. This made me even more ready to read this book. The story of Susannah and Scott is one that will pull you and have your heart melting. All Susannah longs for is to become a missionary and she is determined to follow God's calling for her life. She longs for the day that she can leave Orchard Grove and take the gospel to many nations. Scott loves his life and loves traveling while offering never-ending support to missionaries. He is a missionary recruiter. He receives Susannah's application and can tell the passion she has for becoming a missionary. This is one young lady he can't wait to meet.What Dreams May Come is the first book in Ms. Terry's new series, A Sweet Dreams Christian Romance. This is going to be a remarkable series, one you will definitely want to add to your bookshelves. Be prepared to travel with Susannah and Scott as they travel the globe spreading the love of Jesus and as they write their own story. “I received a complimentary copy of this book from the author/publisher. I was not required to write a positive review. All opinions expressed are mine alone.\""}, {"userName": "Jessica Baker (A Baker's Perspective)", "userReviewDate": "Feb 08, 2018", "userURL": "http://www.goodreads.com/user/show/36114324-jessica-baker-a-baker-s-perspective", "userReview": "This was such a sweet, non traditional romantic story. I loved the fact that Susannah and Scott didn't meet face to face until much later in the story. It was a great example to young couples today - you really need to get to know your potential partner before making a commitment such as marriage. Being separated like this allowed them to connect on a spiritual level. But what I found most intriguing was the way the author wrote from both of their POVs. So you really got to see what it was like for both characters. Their prayers, their struggles, and their conversations with God.What does one do when they felt the Lord speaking to them so surely about something, such as a potential mate, but then all of a sudden you feel as if that's not the right path to take? You really need to spend time with the Lord, and keep going, which is exactly what these characters did. Maybe not the way we would have, but in their own way. I enjoyed their natural conversations with the Lord. It flowed out of them as if they were speaking to a friend. Something we could all learn from.Overall I thought this was a very sweet romance, and would recommend that all young adults read it, male and female. It would be a great book to share in a youth group setting as well. I received a complimentary copy of this book. I was not required to write a favorable review. All thoughts and opinions are my own."}, {"userName": "Fiction Aficionado", "userReviewDate": "Oct 17, 2017", "userURL": "http://www.goodreads.com/user/show/39426033-fiction-aficionado", "userReview": "Those who are familiar with Alana Terry’s Kennedy Stern suspense series will find this new contemporary romance series sets a different pace. In fact, this first book is a bit different to most other contemporary romances too, because the hero and heroine don’t meet until the end of the book! And yet, as odd as that might sound . . . it works. As well as being a sweet romance, it’s the story of two people who are struggling to (a) understand why the path they believed God had for them has suddenly been blocked; and (b) accept this new direction in spite of their hearts.The book actually begins in the middle of Scott and Susannah’s story. At the opening, it has been four months since the event that set Susannah’s life on a new course—away from Scott and her dream of overseas missions—and the story looks both forwards and backwards from this point, showing Scott and Susannah trying to move on and surrender their hopes and dreams to God, but also filling in the story of how their relationship grew without them ever having met face to face and what happened to change everything. I thought this was a strange way to tell the story at first, but as it progressed, I became convinced it was also the most effective way to tell the story.The plot develops at a gentle pace that suits the characters and the tone of the story. There were a few times I felt the story was moving a little too gently in the early stages, but in way, that added to the experience. I was restless—wanting things to move on, wanting answers—in exactly the same way as Scott and Susannah, and their disappointment and confusion was palpable. I couldn’t help but want to know the rest of their story.I’m not going to say anything else about the plot, because I think it needs to unfold in its own way, but if you’re looking for a sweet contemporary romance that’s a little outside the normal mould, this is for you.I received a copy of this novel from the author. This has not influenced the content of my review, which is my honest and unbiased opinion."}, {"userName": "Suzie", "userReviewDate": "Feb 06, 2018", "userURL": "http://www.goodreads.com/user/show/7431258-suzie", "userReview": "A somewhat predictable, yet sweet, romance with plenty of pull on the heartstrings, What Dreams May Come is an uplifting and encouraging read.Though I didn’t feel like the cover fit the story well—the hero and heroine don’t meet in person until the end of the book—it wasn’t too distracting. I would probably label this more women’s fiction with a romance thread than straight romance, though.When Susannah makes a decision to keep a promise, everything between her and Scott comes to a screeching halt. There’s a touch of depression in Susannah that’s not at all explored—a missed opportunity I would have liked to see taken advantage of. Yet, Susannah’s sacrifice is something I admired about here. She’s young and a bit clueless, but not to the point of annoyance.Overall, a light read that brings home the point that God wants to give us the deepest desires of our heart even when we’re afraid to ask Him for them.Disclosure statement:I receive complimentary books from publishers, publicists, and/or authors, including NetGalley. I am not required to write positive reviews. The opinions I have expressed are my own. I am disclosing this in accordance with the Federal Trade Commission’s 16 CFR, Part 255."}, {"userName": "J.E. Grace", "userReviewDate": "Jan 31, 2018", "userURL": "http://www.goodreads.com/user/show/51898288-j-e-grace", "userReview": "What Dreams May Come is laced with Bible principles and scriptural insight. It's a story of struggles, pain, loss, fulfillment, and trust in the Lord.I loved the character of Kitty and how the author made her come to life for me, even though she didn't have a speaking voice. Susannah's love of her special needs sister and how she put everything on hold to be her caregiver after her Mother died, was admirable and very inspirational. She became real to me based on the everyday struggles and her questioning of God's purpose for her life.The character of Scott was also well-developed and he was portrayed as a man who loved the Lord and a person with immense patience. His love for Susannah never faltered even though he waited for God's timing to finally act on the relationship.What Dreams May Come was a very enjoyable and heartwarming read."}, {"userName": "Tina at Mommynificent", "userReviewDate": "Feb 13, 2018", "userURL": "http://www.goodreads.com/user/show/23527482-tina-at-mommynificent", "userReview": "Alana Terry is a very gifted writer. Her stories always completely suck me in, and I can’t put them down so I was thrilled to receive an ARC of this book from the author. I had a lot in common with the main character of this one, even down to being called to missions when I was twelve years old so it was fun to read her journey, especially knowing that it was similar to the author’s journey as well. (I’ve actually always thought Alana Terry and I would be good friends in real life!) I did actually feel that the main character was a little too good to be true at times, and the resolution of the book left a bit to be desired, but all in all, this was a pretty good read. In particular, I was inspired by the character of Grandma Lucy. How I would love to have someone like her in my life!"}, {"userName": "Virginia Winfield", "userReviewDate": "Feb 08, 2018", "userURL": "http://www.goodreads.com/user/show/10270452-virginia-winfield", "userReview": "I love how Alana Terry incorporates Carl and Sandy in many of her books. This latest is based on her real life and I love how it reads. I don’t think that I would have wanted to meet my husband throughemails but it is a wonderful love story. I look forward to reading more in this series. I received a copy of this book from Celebratelit for a fair and honest opinion that I gave of my own free will."}, {"userName": "MJSH", "userReviewDate": "Feb 15, 2018", "userURL": "http://www.goodreads.com/user/show/59507608-mjsh", "userReview": "This is the first book written by Alana Terry that I have read and it’s so appropriate that I started reading it on Valentine’s Day and the story is a retelling of her love story with her husband! The book is definitely geared towards the Christian reader and has wonderfully encouraging Scripture as well as prayers liberally sprinkled throughout the story. The writing focuses on the heartache of two devoted Christians who fall in love but are kept apart due to life circumstances. The main characters’ doubts, cries of grief and sorrow for love perceived to be lost, struggles to understand God’s bigger plan, and striving for peace and contentment even when submerged in confusion are all so real and touchable. Susannah is barely an adult at almost twenty but has a heart for international missions and for reaching the lost. She is gentle, loving, diligent, and patient. Scott is in his thirties, already an experienced world traveler as a support personnel to the international missionaries. He’s “a missionary to the missionaries.” He is devoted, kind, thoughtful and loving. The book starts out with the first few chapters recounting their “courtship” via phone calls and emails and dwells a bit in the past to catch the reader up to what’s actually happened to keep the two apart. Then the book switches back and forth from Susannah’s world in tiny town of Orchard Grove in Washington and Scott’s world in Massachusetts. I really enjoyed their attending Urbana Missionary Conference together since I have wonderful memories of that conference when I attended. The book was enjoyable and made me reflect upon my own thought processes and prayers during difficult situations that broke my heart. I received a copy of the book from the author/publisher via Celebrate Lit Tour. I was not required to write a favorable review. All comments and opinions are solely my own."}, {"userName": "Alicia", "userReviewDate": "Feb 13, 2018", "userURL": "http://www.goodreads.com/user/show/39826582-alicia", "userReview": "“What Dreams May Come” by Alana TerrySusanna and Scott have similar goals in life. For Susanna, itis to serve her calling to God and share the Gospel with others around the world. Scott has been doing this for several years now and still does at least twice a month, when he isn’t working as a missionary recruiter. Susanna’s recruiter. Emails with questions and answers soon turned to emails and texts and phone calls. Since she is one coast and he is on the other, a long distance relationship, a caring and honest one develops quickly and eventually they make plans to meet. But life happens, and each time something got in the way. Soon after, Susanna tells Scott she has made a commitment to her mother and she will not be able to travel or be a missionary and it would be best to part before meeting one another. But will it?Scott wants to be there for Susanna. Wants her to know she would not be taking something away from his life but adding to it. He is upset with himself he didn’t say all this before she cut off all communication. Turns out life and God have their own plans and Scott will get to say all those things and much, much more. “What Dreams May Come,” is an interesting and compelling read. I felt the characters were quite real and very well written. The plotline was engaging and realistic. I did feel the book could be condensed in a few places. Otherwise, it is a nice and enjoyable read with a bit of wisdom thrown in throughout. Rating: 4.3⭐️⭐️⭐️⭐️** I voluntarily read and reviewed an advanced copy of this novel. All thoughts and opinions are my own."}, {"userName": "Deana Dick", "userReviewDate": "Feb 10, 2018", "userURL": "http://www.goodreads.com/user/show/6244880-deana-dick", "userReview": "I have been a huge fan of this author for awhile. Her writing always bring me to a point where I can escape and jump into the book and be part of it. This book is extra special because I get to see a softer and transparent look at her life through a story that brought tears to my eyes. I know when I was getting ready to graduate, I had plans to attend college and become a teacher. I had a boyfriend and figured we would just follow each other to college and see what happens. Sometimes what we want doesn’t always happen the way we plan. This book is one that gives hope, reinforces how we need to continue to have faith and patience. I loved Susannah right away. She has such a big heart and wants to go into the mission field. God placed that desire on her heart and she was excited to follow her dream. I loved how she became friends with Scott . It was nice to read about how their relationship developed and their dream of mission work was shared between them. When a tragedy strikes, Susannah makes a heart-wrenching decision that will change everything in her life. The beauty of her selfless act choked me up. How many of us would give up everything to take care of a loved one? I wanted to hug Susannah and tell her “Well done thy good and faithful servant.” The story was emotional at times and really made me examine my life. Have I been following what God had planned for me? Did I let my dream die because I became discouraged? Thank you for sharing your story with readers. I won’t forget how a young woman dreamed big and had faith to allow God to open doors for her. What may seem impossible , is right before our eyes, if only we continue to trust God. I received a copy of this book from Celebrate Lit. The review is my own opinion."}, {"userName": "Jeanette Fallon", "userReviewDate": "Feb 17, 2018", "userURL": "http://www.goodreads.com/user/show/4253820-jeanette-fallon", "userReview": "God did have plans for Susannah and Scott.  Susannah tried to remain faithful but she was discouraged and disappointed.  She thought GOD wanted her to stay in Orchard Groves to care for her sister and to forget her dreams.But that wasn't the plan.  Inspirational story.  You can't help but want a happy ending but not sure it will happen.I was pleasantly surprised that part of the story was based on the author's story.I received this free to review.About the AuthorAlana is a pastor’s wife, homeschooling mom, self-diagnosed chicken lady, and Christian suspense author. Her novels have won awards from Women of Faith, Book Club Network, Grace Awards, Readers’ Favorite, and more. Alana’s passion for social justice, human rights, and religious freedom shines through her writing, and her books are known for raising tough questions without preaching. She and her family live in rural Alaska where the northern lights in the winter and midnight sun in the summer make hauling water, surviving the annual mosquito apocalypse, and cleaning goat stalls in negative forty degrees worth every second.GiveawayTo celebrate her tour, Alana is giving away a $50 CBD gift card!!Click below to enter. Be sure to comment on this post before you enter to claim 9 extra entries! https://promosimple.com/ps/c600"}, {"userName": "Debbie", "userReviewDate": "Feb 17, 2018", "userURL": "http://www.goodreads.com/user/show/7607495-debbie", "userReview": "\"What Dreams May Come\" by Alana Terry is the first book in the \"A Sweet Dreams Christian Romance\"series. What I liked about the book is that it's fiction but based on the actor's real life love story and that this novel is definitely clean and wholesome. \"What Dreams May Come\" by Alana Terry is a perfect example of a Christian romance with no swearing and no explicit (or even implicit) bedroom scenes.This book is a real example that God's plans are higher and are meant for our best. I recommend reading \"What Dreams May Come\" by Alana Terry to everyone, even mature teens and preteens that are wanting and desiring a relationship. I would recommend to teens because even alot of Christian fiction for teens today have a hint of improper behavior described in the books. I also recommend having a few tissues handy because this book might cause a few tears. The book has a happy ending and no this isn't a spoiler alert, read the book info, but the fiction part isn't all happy.I am definitely looking forward to reading the other books in this series. I was given a complimentary copy by the author and Celebrate Lit. These opinions are my own."}, {"userName": "Gail Hollingsworth", "userReviewDate": "Oct 22, 2017", "userURL": "http://www.goodreads.com/user/show/4403638-gail-hollingsworth", "userReview": "This was a very inspirational story of young love. Told through experiences, emails, prayers and scripture, it was loosely based on the author's actual life and how she met her husband. Susananah had felt the call to missions from God from an early age. Plans were made and she began communicating through a young mission recruiter named Scott. Over several months time through email and phone calls they fell in love, without even having met. Before Scott could fly to meet Susananah her mother was killed in a car accident. A promise made to her mother to care for her younger sister with CP if anything ever happened to her, weighs her down and she breaks it off with Scott. She loves her sister but also wonders why God put the desire for missions in her heart if he was going to allow this to happen.I truly felt Susananah's heartbreak throughout the story. She often questioned God. But needless to say, God's plans are not always our plans. Sometimes even He goes a roundabout way to get His will done and teach us at the same time. I received a complimentary ebook copy of this story but was not required to write a review."}, {"userName": "Sandra", "userReviewDate": "Oct 24, 2017", "userURL": "http://www.goodreads.com/user/show/35503288-sandra", "userReview": "Beautifully written, clean, Christian romance which will keep you enthralled to the very end. Young Susannah has a heart for God and for the mission field, willing to go wherever God calls her; however she also has a heart for her sister and has promises she made to her mother. Then, as my Dad used to say \"someone put a wrench in the works\", and Susannah is torn apart and her heart feels broken. While looking for a job which might lead her to the mission work she wants to do, she meets Scott through letters, email and telephone calls and she is sure he is the man that God has planned for her to marry. Should Susannah break her promise to her mother to look after her sister or should she answer the 'call of God' to meet Scott and prepare herself for the Mission she feels God is calling her to fulfill.This story will delight you, and keep you interested to the very end as you read and understand all the ways God works in our life to bring us to the place where He wants us to be. I was blessed to be able to read an ARC copy of this book, while waiting for the final book to be launched. I thoroughly enjoyed this story."}, {"userName": "Carol Keen", "userReviewDate": "Feb 10, 2018", "userURL": "http://www.goodreads.com/user/show/32537546-carol-keen", "userReview": "I hadn't read this author before, even though I'd seen some of Alana Terry's books here and there. This is a clean romance that was also an interesting read. It has plenty of realism and gentleness. It has the feeling of real life being altered to become a solid work of fiction. It can be a bit slow at times, but I still didn't want to put it down. I love books with more than one point of view, which this book has. I tend to like how that adds depth to the story. My only aggravation is that Susannah was depressed and it was touched on, and then it felt passed on over. I did like the premise. So often we do have goals, dreams, passions, things deeply rooted and dear to us, and it's often the case that everything seems to delay or fight to keep us from that very thing we seek to obtain. I had to have missed something because later I found out who's love story this is based on, and it made it all the richer for the reason. God is woven into the story in ways that are easy and real to me. My copy came from Celebrate Lit. My review is my own, my thoughts and opinions are my own, and this review has been left of my own free will."}, {"userName": "Jennifer  Bunderle", "userReviewDate": "Feb 18, 2018", "userURL": "http://www.goodreads.com/user/show/29622919-jennifer-bunderle", "userReview": "Immediately engaging! What Dreams May Come is one you’ll want to/have to read this one from start to finish in one sitting! This one is a heart-tugging, faith-driven, well-written, and highly-readable delight from Alana Terry. Cleverly based on her own love story, you’ll appreciate anew the person who creates these lovely and memorable stories!Alana Terry’s Sweet Dreams Christian romance series features likeable characters whose faith is foundational despite life’s very real challenges. These stories will inspire and remind you of someone you just might know who needs to be reminded of the truth of God’s very real love for them. Disclaimer: I received a complimentary copy of this book. A favorable review was not required, no compensation was received, and all views expressed are my own."}, {"userName": "Joan", "userReviewDate": "Feb 07, 2018", "userURL": "http://www.goodreads.com/user/show/8435102-joan", "userReview": "I can always count on Terry to provide me with thought provoking fiction. She always takes an issue and creates a plot around it. This time it is the issue of God giving one a dream, a passion, and then allowing circumstances to prevent that dream from coming into reality. While Terry does not give readers any neat theological answer, she does take us into the strong feelings of a Christian wondering what in the world God is doing. The fictional end leaves us hanging about the possibility of a missionary future. But we know the story is based on Terry's own life. Since she's a homeschooling mom and pastor's wife in Alaska, she must have come to grips with her missionary dream and the ensuing reality of life.I received a complimentary digital copy of this book through Celebrate Lit. My comments are an independent and honest review."}, {"userName": "Janice Sisemore", "userReviewDate": "Feb 18, 2018", "userURL": "http://www.goodreads.com/user/show/17960693-janice-sisemore", "userReview": "What dreams may comeA wonderful inspirational story. Susannah wants to be a missionary but life circumstances get the way. Love how she cares for her disabled sister and she ends up being her main caregiver. Her sister cannot care for herself at all and can only have formula even being grown. Susannah meets Scott through Email when checking into missionary work. Her and Scott fall in love through phone calls, mail and emails but will they ever get together. I love how the book was written, in current time for Susannah and the emails written to Scott in the past time. I kept wandering through out the book how it was going to end up, that is one thing I really loved about the book. I received an advanced copy of the book from Celebrate Lit Publishers."}, {"userName": "Jaycee Weaver", "userReviewDate": "Mar 06, 2018", "userURL": "http://www.goodreads.com/user/show/72786382-jaycee-weaver", "userReview": "One of a kindI love stories rooted in real life. This was such a sweet story of two hearts connected, unseen, across miles. I liked how it was told almost like flashbacks in bits and pieces. Sometimes it felt a little too sweet and good, making it almost hard to connect with Susannah. But then when she’s finally coming to terms with what she’s sacrificed and how isolated and alone she feels, and yet keeps persevering in what she knows is right...the tears flowed. I look forward to the next story in the series!"}, {"userName": "Alicia Beck", "userReviewDate": "Feb 16, 2018", "userURL": "http://www.goodreads.com/user/show/31450930-alicia-beck", "userReview": "My ReviewWhat Dreams May Come is a sweet romance with some sadness/heartache in it too. I have read books by this author before and this was another good read. This heavily is about being impatient when things do not work out the way we feel they would. Susanna and Scott are two of the main characters and those distance separated them they became quite close through calls , emails, and letters. When Susanna loses a member of her family she did not hesitate to take on a responsibility and closed a door in her life at that time. Kitty was probably my favorite character found in this story. I would describe this book as a light read. Disclaimer: I was given a complimentary copy of this book but all thoughts and opinions are my own ."}, {"userName": "Andrea Byers", "userReviewDate": "Oct 24, 2017", "userURL": "http://www.goodreads.com/user/show/40421353-andrea-byers", "userReview": "I have loved Alana's Kennedy series, and this new book is right up there, but without the suspense. A well rounded story with likable characters make it very east to step into. Looking forward to more of these characters in future books, and was thrilled to have a glimpse of Carl, Sandy and Woong in this one. :)"}, {"userName": "Kim Paulus", "userReviewDate": "Oct 27, 2017", "userURL": "http://www.goodreads.com/user/show/2949367-kim-paulus", "userReview": "A true love story! Alana shares her story of how she met her true love (husband)! I read this story in one sitting. Even knowing that they will eventually wind up together did not diminish the want to root for them! This author ventured away from her normal genre of mystery, intrigue; I am so glad she did!! I was gifted with this copy but the opinions of this book are my own."}], "description": "She's got her heart set on becoming a missionary. He's determined to recruit her for the job.But is it possible to fall in love with someone you've never even met?Susannah's convinced that God has called her to the mission field. That's why she's serving him with single-minded focus in Orchard Grove, waiting for the day when she can leave her small town to take the gospel to the nations.Is falling in love with her missionary recruiter part of God's plan for her life or a distraction from the real goal?Scott loves his life. Traveling the globe, offering spiritual support to missionaries around the world offers enough excitement that the loneliness hardly ever gets to him ...Until he receives an application from a young girl with a heart for the mission field as large as his own, a young girl he finds himself falling for even before they get the chance to meet face-to-face.Unfortunately, a promise Susannah made to her family may tear her and Scott even farther apart than the miles that separate them.Book one in an inspirational sweet romance series by award-winning Christian author Alana Terry, who has won awards from Women of Faith, The Book Club Network, Grace Awards, and several others, What Dreams May Come is based off of the author's own experiences falling in love with (and eventually marrying) her missionary recruiter.", "title": "What Dreams May Come\n      \n          (Sweet Dreams Christian Romance #1)", "url": "http://www.goodreads.com/book/show/36242150-what-dreams-may-come", "average": 4.28, "cover": "https://images.gr-assets.com/books/1505440331l/36242150.jpg", "reviews": 44, "authors": [{"url": "https://www.goodreads.com/author/show/7048073.Alana_Terry", "name": "Alana Terry"}], "type": ["Contemporary", "Romance", "Christian", "Christian Fiction", "Religion"], "outlinks": ["http://www.goodreads.com/book/show/36242150-what-dreams-may-come", "http://www.goodreads.com/book/show/25335376-unplanned", "http://www.goodreads.com/book/show/17798886-the-beloved-daughter", "http://www.goodreads.com/book/show/27423786-paralyzed", "http://www.goodreads.com/book/show/23202955-slave-again", "http://www.goodreads.com/book/show/30296610-policed"]}