{"ratings": 15894, "userreviews": [{"userName": "Ana ", "userReviewDate": "Oct 25, 2012", "userURL": "http://www.goodreads.com/user/show/13346584-ana", "userReview": "This is a novelization of the greatest love triangle of the 21st century, that of Brad, Jennifer and Angelina. I'm only halfway kidding. Co-stars who hated each other get drunk and married in Vegas. Hilarity ensues. The book also features a list of well-known characters, such as Meg Koranda from Call Me Irresistible, Fleur & Jake Koranda from Glitter Baby, and April Robillard from Natural Born Charmer."}, {"userName": "♥Sharon♥", "userReviewDate": "Aug 02, 2015", "userURL": "http://www.goodreads.com/user/show/12125670-sharon", "userReview": "I have officially placed Susan Elizabeth Phillips on my favorite author’s pedestal. I love her writing style, her plots are always creative and she works her magic with the development of her characters. SEP also dares to give you supporting characters that could possibly steal the show but instead strengthens the plot and keeps the reader engaged. Georgie York and Bramwell Shepard really do love to hate each other. Their lives were spinning in the same circle for a while as young TV stars. Bramwell was a reckless, self-absorbed and self-satisfying guy. Georgie was the one that everyone fell in love with, the one that made all the right choices. But she made one decision that involved Bramwell that she was ashamed of and something she would struggle to let go of. Bramwell ~ could be a real prick, a trait that followed him from his younger days when he put Georgie’s heart through the ringer. But he was a prick that I quickly fell in love with. He was super sexy and slowly but surely his sweetness surfaced.\nGeorgie ~ she was rather sassy and a bit feisty. She was always the good girl, the one that never rocked the boat. But life has changed her. She has come to be a flirtatious and passionate woman living her life satisfying her needs instead of everyone else.\nFollowing different paths within their movie careers, Georgie and Bram live their lives without having to spend any time together. But being a star and living in Hollywood isn’t as easy as it appears. \nWhen Georgie’s life is in a little bit of a downward spiral she decides to escape for a few months. Her escape begins with a trip to Las Vegas only to have it end with her married to Bram. Once she gets past the utter shock of it she immediately goes into damage control mode. They’d remain married putting on the show of their lives.\nThe plan was supposed to be simple. Both Georgie and Bram had the “script” they would go by while remaining married but their outside worlds started to leak through the cracks that were in their plan. They each had their own intentions and their own goals. But things started to change. Georgie was seeing things in Bram that weren’t there before and Bram didn’t know what the hell to do with this sexy and desirable woman. They both struggled with this unexpected place they were finding themselves in. Was it love or was it lust? What side would they land on?\nWhat I Did for Love was such a wonderful read. SEP has the knack for adding in fantastic supporting characters. In this one I loved Chaz and Aaron. Chaz was Bram’s housekeeper who was always a bit grumpy and lacked a sense of humor. She was paired with Georgie’s PA Aaron who lacked the typical hot guy persona. These two were very different yet so perfect for each other. They went on a bit of a journey themselves and I really enjoyed it. Then we have Paul and Laura who offered up that side romance that rounded out the story perfectly. Oh and the Epilogue was perfect. ❤"}, {"userName": "Tammy", "userReviewDate": "Oct 14, 2008", "userURL": "http://www.goodreads.com/user/show/785960-tammy", "userReview": "This was discussed earlier in Celeste's review, but I think it is fair to say that What I Did for Love is the author's commentary on Jennifer Aniston, Brad Pitt and Angelina Jolie. In fact, it was extremely difficult for me to picture anyone but Jennifer Aniston and Brangelina while reading this book. The similarities are obvious ... Lance's (Brad Pitt's) interest in architecture. The fact that he leaves his wife while filming a movie with St. Jade (Jolie), a do-gooder that travels worldwide to help the less fortunate and who has no qualms about stealing another woman's husband. Even the physical description of Jade fits Jolie - tattoos, pouty lips and all. And then there is Georgie (Aniston) who became \"America's Sweetheart\" on a popular sitcom where she was forced to sign a contract NOT to cut her hair or change her hairstyle. Now she is filming a series of bad romantic comedies. Sound familiar? While Georgie is trying to create a public image that she is over Lance and her disastrous marriage, she has the misfortune of running into Bram Shephard (John Mayer?). As a teenager/young adult, Bram co-starred on Georgie's sitcom for several years. There is bad blood between them because Bram was a playboy, a jerk and downright cruel to Georgie. In fact, a sex tape was released of Bram that ultimately ended up being the reason for cancelling Georgie's sitcom. Bram and Georgie somehow end up in Las Vegas together. End up at a party together. Get drunk. Get married. And when the paparrazi find out and start hounding them for a statement the next morning, Georgie and Bram decided it would boost both of their careers if they stayed married for one year. I am disappointed to say that I had a very hard time forcing myself to finish this book. I didn't find myself invested in the characters or really caring what happened to them. There were a few scenes that kept my interest - Georgie and Bram visiting a posh erotic boutique with peepholes in the dressing rooms was HOT!SEP is an auto-buy for me. I love her writing style and enjoy her sassy sense of humor. She is the queen of metaphors. For instance ... \"grape lollipop eyes\" ... \"gumdrop green eyes\" ... \"caramel brown eyes that slid over her like hot fudge on a sundae\" ... all of these are from previous SEP books that I really enjoyed. But in this book ... well ... surfers bobbing on the ocean waters like fetuses in amniotic fluid was just too much for me.I think I need to go back and re-read Match Me If You Can or This Heart of Mine to remind myself why I love SEP's books."}, {"userName": "Mo", "userReviewDate": "Aug 06, 2015", "userURL": "http://www.goodreads.com/user/show/11856352-mo", "userReview": "While I did enjoy this one, it just didn't hit the high notes that her previous books did. What was missing? I have no idea. Maybe the fact that I just finished two really good suspense books ... this one was just too different ... maybe. My mind was still on the other books and the fact that I was dying to read the conclusion to the Trilogy ... (BTW, thank you Sharon for Book 3.)\n\nTwo enemies find themselves working without a script in a town where the spotlight shines bright . . . and where the strongest emotions can wear startling disguises. \n\nIt's kinda pathetic really but when the hero in a book is blonde or has light coloured hair, I don't like him as much as my heroes with dark hair!!\nBut there were no easy answers, and eventually she dozed off to the sound of the brass wind-bells.\n\n\"Ever since we woke up in Vegas, we've been on this crazy Ferris wheel ride.\"\nLoved the banter between Georgie and Bram.Most of it is set in LA. I visited there recently so it was nice to see references to the places I visited ... and the places I should have visited. Should have gone to The Ivy one day to see if I could spot a celebrity.Still a great read by a fabulous author.Something happens in the book between Bram and Georgie and I think that coloured my feeling for him and no matter how much he tried to redeem himself, he never quite made it for me."}, {"userName": "Karen", "userReviewDate": "Mar 11, 2015", "userURL": "http://www.goodreads.com/user/show/6972914-karen", "userReview": "Another winner!"}, {"userName": "Milica's Bookshelf", "userReviewDate": "May 04, 2016", "userURL": "http://www.goodreads.com/user/show/52006095-milica-s-bookshelf", "userReview": "Susan Elizabeth Phillips je zaista odlična i zabavna spisateljica. Više i ne znam u kojoj sam njenoj priči najviše uživala. Sad mi je trenutno na umu samo Bramwell Shepard. ♥ Ovaj glavni junak je pravi selfish asshole -.- a i dalje ga volim."}, {"userName": "Consuelo", "userReviewDate": "Aug 18, 2017", "userURL": "http://www.goodreads.com/user/show/50381960-consuelo", "userReview": "Creo que me quedan unos cinco libros de todo lo publicado por esta mujer en castellano. ...y me los voy dosificando. ...Maravillosa. ..que diálogos, que chispa y que personajes....he dicho que adoro a SEP?"}, {"userName": "Michelle", "userReviewDate": "Feb 09, 2009", "userURL": "http://www.goodreads.com/user/show/1824225-michelle", "userReview": "If writing this craptastic novel is what Ms. Phillips does 'for love' then I can only hope she is more motivated in the future by hatred. I am normally a huge fan of Susan Elizabeth Phillips but this book was a total bomb. I found myself skipping pages, hoping that the end would be better. She added a couple side plots that were a lot more interesting than the shallow, self-involved main characters, who had lots of unconvincing sex, no chemistry with one another, and nothing to make me interested in them at all. Unfortunatly, she didn't wrap up the side plots very well at the end. I've rarely seen an established author go this far downhill with a novel. I can only hope she takes a vacation and starts fresh for the next one."}, {"userName": "Jennifer", "userReviewDate": "Jan 06, 2016", "userURL": "http://www.goodreads.com/user/show/2473504-jennifer", "userReview": "Review to come..My favorite quote:“As for your back rubs... Study an anatomy book, pal, because what you've been rubbing isn't my back.”"}, {"userName": "Kajol", "userReviewDate": "Dec 06, 2010", "userURL": "http://www.goodreads.com/user/show/4228829-kajol", "userReview": "Hehe... I am going to start of with my almost common line, \"Oh. My. God! I loved it!!!\"This book was amazing. The beginning was a bit boring, but still interesting enough to keep me reading. The story got deliciously exciting and let me just tell you that even though the lead characters were a bit twisted, I couldn't hep but love them. Bramwell Shepard, the oh-so-gorgeous actor with those beautiful lavender eyes, amazing body and a mouth that makes you think dirty, he's not only the Hollywood bad boy but has layers to him that add glamor to his personality. With his snarky comments and a made-up cocky attitude, boy he's walking-talking danger to good women with weak hearts.Georgie York, once the costar of a favorite television sitcom, has a sweet, smart-mouth, charming and yet funny personality, is now a heartbroken divorcee of that two-timing, spineless jerk of a husband Lance and is suffering from paparazzi attacks into her not-so-personal life. Where Lance is codling up with his new wife Jade, a successful actress who has not only managed to snare Georgie's unfaithful husband behind her back, is also pregnant with his child. This book kinda seemed to remind me of Jennifer Aniston and Brad Pitt's divorce, how Brad met Angelina on a movie set in which they both worked together and after which they got married. Like Brad had an extra marital affair, just like it says happened with Lance and Jade. Anyway, that just might be my imagination running away.I loved the plot, it made me laugh and scowl, inciting other such emotions and looks with every new page. Lance was one of those characters who I absolutely hated. Like, really.. and couldn't help but think- What a douche?! It was really nice reading about the improvement of Georgie's relationship with her dad. It was touching how Paul overcame his sorrows and reconciled with is daughter and found his new love. This book is about love, friendship, second chance and trust. A good read, an excellent story and a truly wonderful concept."}, {"userName": "Lisa Kay", "userReviewDate": "Jun 25, 2009", "userURL": "http://www.goodreads.com/user/show/2459470-lisa-kay", "userReview": "[Repeated attempts by Georgie to have both of them acknowledge their love and Bram continuing to reject her. Repeatedly. Or did I repeat that already? (hide spoiler)]"}, {"userName": "♡Karlyn P♡", "userReviewDate": "Aug 15, 2008", "userURL": "http://www.goodreads.com/user/show/1131400-karlyn-p", "userReview": "I’ve read everything by this author, and will without a doubt be first in line to buy her next book. I think this book would have been better titled ‘Ripped from the Headlines!’ The direct similarities to so many true Hollywood tales were abundant! And as someone who doesn’t follow celebrity BS, I wasn’t that entertained. While ‘What I Did For Love’ was a decent read, it wasn’t SEP’s typical great read. The core story is about two young Hollywood TV child stars that grew up to hate each other, and later who fall in love while pretending their impromptu drunken Las Vegas marriage isn’t really a sham. Unfortunately the story does not come together until the end, and by that point I really didn’t care what happens to these two nut cases. The story centers on a lot of negative issues, which was a buzz kill to read: their hate for each other, their lagging careers, their broken family life, and (last but not least) their identity crisis. And its not just Bram and Georgie with all the negative issues, it seams everyone had some huge issue that this story needed to resolve: homelessness, weight gain, being able to stand up for yourself, grief…etc. And yes, the book solves everyone’s problems. It is interesting that my two least favorite books by SEP stars a Hollywood hero with an identity crisis. Breathing Room (which was a lot better than WIDFL) being the other. I wanted to really like this one, but without likable characters and some humor added here and there, it just wasn’t meant to happen. The only reason I gave it 3-stars as it did come together in the end for a decent ending. If you have not read SEP, do not start here. In fact, read everything else first."}, {"userName": "Anzu The Great Destroyer", "userReviewDate": "Jan 16, 2011", "userURL": "http://www.goodreads.com/user/show/2278800-anzu-the-great-destroyer", "userReview": "Ooooh this was a disaster!So I wanted to read something good, ok? I’m in a foul mood – most of the books I’ve read lately were a big disappointment - so I chose something to lift my mood up: SEP. I was having high expectations, of course, but I was sure SEP won’t let me down.Oh hell… she let me down so badly..I hated the book (even though the summary sounded very good); I hated the characters, hated the story and hated the non-existent humor. Booohooo but I’m not in the mood for drama when it comes to my SEP books.Sooo, I ended up reading the first quarter of the book (meh), skimmed the middle and tried my best to read the last chapters (I didn’t get sh*t from them) and failed. So dnf’d it when I was 85% through.The conclusion? The first one star book coming from an author I love so much. It’s painful but I hate being biased (from time to time).The next one will be about Ted (finally!!!) so I’m going to stab a blind dude in the kidney (not joking) if it sucks."}, {"userName": "Celeste", "userReviewDate": "Feb 02, 2009", "userURL": "http://www.goodreads.com/user/show/1062992-celeste", "userReview": "Hmmmmmmmmmmmmmmmmmm, what to say? Well, I'll start by saying, I think she fashioned this book (in the beginning at least) after Brad Pit, Jennifer Aniston, and Angalina Jolie! You'll understand if/when you read it! Trust me! If you follow celebrities even a little you'll see the similarities, no problem.I only gave three stars because, while I enjoyed the book, it didn't really grip me and make me feel as if I HAD to continue reading. When I read a book, it generally takes me a day to two days to finish reading it. This book took me almost an entire week. Which in my world, is an eternity! My husband even mentioned, \"you're still reading that book?\" lol. Which says a lot for him to notice something like that!Having said that, I am glad I read it, and of course remain a big fan of SEP's. It just wasn't one of my favorites for this author."}, {"userName": "P. Dangelico", "userReviewDate": "Feb 02, 2018", "userURL": "http://www.goodreads.com/user/show/41887574-p-dangelico", "userReview": "SEP can do no wrong."}, {"userName": "Marilyn", "userReviewDate": "Feb 13, 2009", "userURL": "http://www.goodreads.com/user/show/440537-marilyn", "userReview": "Susan Elizabeth Phillips is one of the few romance authors I read, and I usually love her books, but this one? Meh. One of her strong suits is humor. I didn't even smile as I trudged through this story with characters based on Jennifer Aniston, Brad Pitt and Angelina Jolie. Even the sex scenes are blah. Only one character, Chaz, was remotely interesting. The book reads like it was written to fulfill a contract obligation rather than from the heart. Phillips can do, and has done, much much better."}, {"userName": "Антоанета", "userReviewDate": "Apr 27, 2017", "userURL": "http://www.goodreads.com/user/show/38648425", "userReview": "Искрено се забавлявах с тези двамата :D През цялото време тази игра на котка и мишка и саркастичните диалози поддържаха интереса и ми беше интересно какво ще се случи. Имаше и някои изненади, предвид че предварително си бях изградила представа как ще се развие сюжета, но не стана точно така. Любовното обяснение на Брам на края беше доста екстравагантно и никъде другаде не съм прочела подобни нещо. Но финалът ми беше леееко сладникав и малко ми бягаше от изградените опърничави образи."}, {"userName": "İlkim", "userReviewDate": "Apr 25, 2011", "userURL": "http://www.goodreads.com/user/show/5318323-lkim", "userReview": "Birbirlerinden nefret eden aynı dizi oyuncularının önce arkadaş, daha sonra da birbirlerine aşık bir çift olmasını anlatan, komik diyalogları ve eğlenceli kurgusuyla müthiş bir kitap daha. Hiç sıkmadan akıp giden bir üslubu da var. Kesinlikle tavsiye edilir."}, {"userName": "Preeti ♥︎ (Romance She Reads)", "userReviewDate": "Jul 19, 2017", "userURL": "http://www.goodreads.com/user/show/32506772-preeti-romance-she-reads", "userReview": "Not quite up to my favorite SEPs’ standard, but still I liked it as all her stories, characters and atmospheres enthral - irrespective.‘Skip and Scooter’ was a nice touch with a fascinating world and story of their own. All the secondary characters were well drawn, with the ubiquitous older strong female character/s also thrown in (thankfully not the H’s ex!).Secondary romances also checked out.As for the h/H themselves, they start out strong but lose momentum midway. The 3rd act could have been executed better. The h’s unexpected turnabout, anger and need for revenge didn’t do anything for me. Otherwise I loved her throughout.As for the H, his precipitous enlightenment of love was also eyerolling ott. I liked and rooted for most of his d-b moves, as that’s what makes for a good angsty romance. A bad boy doesn’t develop a halo overnight and if he does it should be slightly tarnished, slightly off kilter. and he was perfect that ways!The Jen-Jolie-Brad analogy was unambiguous, and alternately amusing and annoying. Although I felt that descriptively, the h’s ex fitted more into Tom Cruise mould. So was the author batting for all the dumped Hollywood women? Chaz and Paul, the h’s father were my favorite sec characters."}, {"userName": "Leggere Romanticamente", "userReviewDate": "Sep 13, 2017", "userURL": "http://www.goodreads.com/user/show/31491491-leggere-romanticamente", "userReview": "4 stelline e mezzo!Sul blog trovate la mia recensione qui ----> http://www.leggereromanticamente.com/...Vi ricordo che l'autrice nel 2018 sarà alla #Rare18Rome!"}, {"userName": "Jane Stewart", "userReviewDate": "Sep 28, 2010", "userURL": "http://www.goodreads.com/user/show/3789528-jane-stewart", "userReview": "I liked the anticipation and emotions I felt while reading this book.STORY BRIEF:Georgie and Bram starred in a TV sitcom for eight years. Bram was unreliable due to drugs, alcohol and sex. Georgie initially liked Bram but he hurt her during his bad boy days. Now they dislike/hate each other. Georgie is a good girl. Everyone loves her. She married Lance an A list movie star. Lance had an affair, divorced Georgie and married Jade (think Angelina Jolie). Georgie is tired of everyone feeling sorry for her and believes that if she gets married, the tabloids will leave her alone. Bram and Georgie accidentally show up at the same party in Las Vegas. Someone drugs their drinks, and they wake up the next morning shocked to find they are married. They decide to stay married for awhile; each has their own reasons.REVIEWER’S OPINION:I love this author’s talent. She doesn’t churn out books as fast as I would like, because she writes quality which takes time. Georgie and Bram insult and lie to each other. The conversations are clever and entertaining. I loved the character development. There are several characters who change, grow, become better, or become different by the end of the story. Whenever I put the book down to do something else, I couldn’t wait to get back to it. It’s a little longer than most romance novels, and I enjoyed every minute.REVIEWER’S COMMENT TO OTHER REVIEWERS:I noticed some reviewers complained that it was too much like the Jen/Brad/Angie saga, but I say who cares what it was like. It was entertaining. There are only a limited number of story lines out there for romance novels. Every story I’ve read has already been told by someone else. The key is the author’s voice, and this author’s voice is one of the best. Some reviewers said they didn’t like Georgie and Bram. I didn’t think about that as I was reading the book, but I agree that some of their early actions were not likeable. However, by the end of the book they both had gone through changes from who they were eight years earlier. I liked the people they became and many of the things they did for others. The best part of the book was all the changes that various characters went through, not just Georgie and Bram, but others as well. In addition, the period of dislike created some interesting conflict and entertaining dialogue.AUDIOBOOK NARRATOR: Julia Gibson did an excellent job. But for some undefinable reason I think I preferred reading this instead of listening to it.DATA:Narrative mode: 3rd person. Story length: 401 pages. Swearing language: strong but not often used. Sexual language: mild. Number of sex scenes: 7. Setting: Los Angeles area, California, Las Vegas, Nevada, and Mexico. Copyright: 2009. Genre: contemporary romance.OTHER BOOKS:For a list of my reviews of other Susan Elizabeth Phillips books, see my 5 star review of “It Had To Be You.”"}, {"userName": "Ivana", "userReviewDate": "Jan 18, 2017", "userURL": "http://www.goodreads.com/user/show/20918593-ivana", "userReview": "Suzan mi je jedna od omiljenih autorki i obožavam sve njene knjige koje sam pročitala. Priče su uvek zanimljive i smešne, a knjige se brzo i sa uživanjem čitaju.Ova knjiga mi se dopala odmah pri samom čitanju sinopsisa. Ona popularna glumica, on posrnuli glumac, partneri iz popularne serije, mrze se, a u braku. Volim takve zavrzlamice, poslovne dogovore koji se na kraju završe sa \"i živeli su srećno do kraja života\". :)Iako je Brem stvarno sebičan i misli samo na sebe, meni se sviđa. Džordži je baš zabavan lik i sviđa mi se kakva je kad je sa Bremom. Kraj je odličan, sviđa mi se to što vidimo koliko su glumci tinejdžeri iz popularne serije odrasli i sazreli."}, {"userName": "Lana", "userReviewDate": "Feb 13, 2009", "userURL": "http://www.goodreads.com/user/show/933870-lana", "userReview": "I am a very big fan of Susan Elizabeth Phillips and really love her work. I have read all her books, but this one just doesn't work. It is sort of like buying a pair of shoes and one of them is a half size smaller than the other; so even though you love the shoes...you can't enjoy wearing them. Ok, this is a dumb analogy but that is what came to mind and how it feels reading this book. The characters, Bram and Georgie, just don't work for me. And it is so obviously the story of Anniston/Pit/Jolie, which I am absolutly sick of hearing about! Susan, what were you thinking?"}, {"userName": "da AL", "userReviewDate": "Jun 18, 2017", "userURL": "http://www.goodreads.com/user/show/50966750-da-al", "userReview": "a fun story about the complexity of hetero life. as usual, Julia Gibson does a fab narration"}, {"userName": "Jacob Proffitt", "userReviewDate": "Nov 09, 2016", "userURL": "http://www.goodreads.com/user/show/1331641-jacob-proffitt", "userReview": "[literally taking her (freely-offered) virginity and walking away without a backwards glance (hide spoiler)]"}, {"userName": "Crystal", "userReviewDate": "Feb 01, 2009", "userURL": "http://www.goodreads.com/user/show/182835-crystal", "userReview": "This book wasn't brilliant. while it was characteristic Susan Elizabeth Phillips, it wasn't her best. so why couldn't I put it down? it's almost embarrassing--it's been awhile since I stayed up late finishing a book--why was this the one? I just didn't want to put it down. some of her similes, metaphores, and other descriptions are awkward (like early in the book when she says surfers in the ocean float \"like fetuses in amniotic fluid\"--so weird!) but somehow the overall book caused me to suspend disbelief and just keep reading and enjoying. (I was, however, both distracted and annoyed by SEP's attempts to comment on the whole Brad/ Angelina/ Jennifer situation via her plot. the characters for Jade and Lance were annoying in their lack of real or developed character, which is unusual for an SEP book. one of her usual writing habits, love it or hate it, is her overdeveloped supporting characters/ cast. She should stick to her usual stories, and stay out of \"real world\" celeb gossip. it reminded me of Make Him Look Good and that author's attempt to comment on J-Lo and Marc Anthony. yuck.)you won't feel smarter or a better person for reading this book, but I bet you'll enjoy it a lot. (and isn't it always fun to figure out which of the characters in the current story are characters from previous novels of hers?)"}, {"userName": "Ian", "userReviewDate": "Oct 29, 2012", "userURL": "http://www.goodreads.com/user/show/6703235-ian", "userReview": "As a young TV star, Georgie's first love was her co-star Bram. Back then he was completely self absorbed and after he took her virginity he walked out on her, leaving her alone and humiliated. Fast forward 10 years and Georgie's husband has left her for a saint, she's had three box office flops and is looking a little frayed around the edges. She runs away from Hollywood only to run into Bram and after a drunken tryst finds herself wedded to him. He's still the bad boy she loathes but she's desperate for some good publicity so they continue the charade, but as she gets to know him she discovers a passion and a compassion that she sorely needs. What I Did for Love isn't my favorite Susan Elizabeth Phillips book, but of the half dozen or so I've read I think it's the most balanced. What I often find with SEP is the supporting characters are much more interesting than her protagonists and it's true with this one as well. For me the real stars in this book are Bram's cranky house keeper and Georgie's dowdy agent."}, {"userName": "Mandy", "userReviewDate": "Aug 09, 2016", "userURL": "http://www.goodreads.com/user/show/21293910-mandy", "userReview": "Loved this! I love how this author is able to make you hate the hero at first but totally fall in love with him by the end of the book. Loved the epilogue for this one!"}, {"userName": "New Adult e dintorni", "userReviewDate": "Sep 08, 2017", "userURL": "http://www.goodreads.com/user/show/42536707-new-adult-e-dintorni", "userReview": "TROVATE LA RECENSIONE SUL BLOG: http://newadultedintorni.blogspot.it/... Che dire se non il genio è genio, la SEP è la SEP, e per me ha acquisito di diritto, già da tempo, un posto d'onore sul podio tra le mie tre autrici preferite, e non molla, non si sposta di una virgola. La regina del romance. Per me è un porto sicuro, una lettura che non può deludere. I suoi plot sono interessanti, le sue ambientazioni originali, i suoi intrecci ti tengono impegnata, i suoi personaggi sono sfaccettati, tridimensionali. Sfido chiunque legga questo libro a dirmi che non ha pensato a uno dei più grandi triangoli amorosi del jet set Hollywoodiano, quello di Brad, Jennifer e Angelina.Io ho sicuramente trovato delle attinenze e non è proprio così il processo di creazione di un libro? Una situazione che cattura la tua attenzione dandoti ispirazione e facendo scattare l'estro, certamente per chi ne ha e ha in mano gli strumenti per svilupparlo.Questa è la storia di Georgie York, meglio conosciuta come Scooter, ruolo che ha interpretato per svariati anni, nella serie televisiva \"Skip and Scooter\" la fidanzatina d'America per i suoi fan. Questa serie si è interrotta da molti anni ma tutti ricordano Georgie e la amano ancora per quel ruolo.Il libro inizia con i paparazzi che la inseguono per farle vedere l'ecografia che mostra il figlio che il suo ex marito e la sua nuova moglie aspettano (entrambi famosissimi e bellissimi attori). E' passato un anno dal suo divorzio, ma la ferita non è ancora rimarginata e tutto questo interesse per lei non l'aiuta di certo.Georgie era sposata con un attore conosciutissimo, un sex symbol, entrambi avevano fama e ricchezza, ma un bel giorno mentre il suo ex, Lance, è impegnato nelle riprese di un film scocca la scintilla con la sua attuale coprotagonista Jade, la donna perfetta, bellissima e che porta avanti grossi impegni umanitari. La perfezione fatta donna! Che antipatia, (mi infastidiva già allora, figuratevi ora). Lance come avrebbe mai potuto resistere a tanta perfezione? Chiede il divorzio e ora, tra un film e l'altro si dedica con la sua nuova compagna, a salvare il mondo e a fare figli.CONTINUA A LEGGERE LA RECENSIONE QUI: http://newadultedintorni.blogspot.it/..."}, {"userName": "Natalia", "userReviewDate": "Apr 30, 2018", "userURL": "http://www.goodreads.com/user/show/52662522-natalia", "userReview": "Another addicting and easy to read romance story. I wasn't expecting a lot of it, it didn't disappoint me but it didn't pleasantly surprise me either. It was alright, fun and entertaining.The story follows Georgie. She's an actress and when she was young she used to play in a very famous tv show. Now 8 years later everyone still sees as the teenage girl she played on the show, but now her career is going nowhere. Moreover after her diverse with her husband she's left in a bad position without having too many options. Bram is the bad boy sort of character. They used to play the main characters on that tv show, but the show was cancelled after the many scandals he was involved in. Years later he has almost no money and his career is almost non existing.Because of their complicated history they hate and can't stand each other. However after they were drugged one night, they find out that they have gotten married. Another scandal is the last thing Georgie wants, so she and Bram make a deal and deiced to stay married.The premise definitely doesn't sound that original and it wasn't, but the book was entertaining. Georgie was snarky and a really fun character to read about. She and Bram were constantly arguing. I love the from hate to love trope and I also love the fake dating (in this case fake marriage). Here it was a really fun combination between the two.Also I liked how we got to learn more about the time they played together on the show through her flashbacks."}], "description": "Perennial New York Times bestselling author Susan Elizabeth Phillips is easily one of the most beloved authors of women’s fiction in America—and with her wonderfully witty What I Did for Love.It’s not easy being famous when your life is falling apart… Georgie York has been dumped by her movie star husband, her own film career is tanking, and her public image as a spunky romantic heroine is taking a serious beating.What should a down-on-her-luck actress do? NOT go to Vegas…NOT run into her detestable former co-star—dreamboat-from-hell Bramwell Shepard…and NOT get caught up in a ridiculous incident that leads to a calamitous elopement. Before she knows it, Georgie A Georgie York EXCLUSIVEhas a fake marriage, fake husband, and maybe (or not) a fake sex life.It’s a paparazzi free-for-all, and Georgie’s non-supporting cast doesn’t help. There’s Bram’s punk-nightmare housekeeper; Georgie’s pushy parent; a suck-up agent; an icy studio head; and her ex-husband’s new wife, an international do-gooder who just might win the stupid Nobel Peace Prize!As for Georgie’s leading man… Bram, with his angel blue eyes and twisted black heart, has never cared about anyone but himself. Still, he’s giving the performance of his life as man in love—thanks to the half a million dollars she’s paying him. It was official. She’d married the devil. Or had she?Two enemies find themselves working without a script in a town where the spotlight shines bright…and where the strongest emotions can wear startling disguises.", "title": "What I Did for Love\n      \n          (Wynette, Texas #4)", "url": "https://www.goodreads.com/book/show/3519956.What_I_Did_for_Love__Wynette__Texas__5_", "average": 3.88, "cover": "https://images.gr-assets.com/books/1327882881l/3519956.jpg", "reviews": 1010, "authors": [{"url": "https://www.goodreads.com/author/show/41313.Susan_Elizabeth_Phillips", "name": "Susan Elizabeth Phillips"}], "type": ["Romance", "Romance", "Contemporary", "Womens Fiction", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/3519956-what-i-did-for-love", "http://www.goodreads.com/book/show/8142669-what-i-did-for-love", "http://www.goodreads.com/book/show/20320647-lo-que-hice-por-amor", "http://www.goodreads.com/book/show/23601784", "http://www.goodreads.com/book/show/11019777-a-k-kap-y-al-nca", "http://www.goodreads.com/book/show/36163813-cosa-ho-fatto-per-amore", "http://www.goodreads.com/book/show/24870580-ta-sam-uradila-zbog-ljubavi", "http://www.goodreads.com/book/show/3519957-what-i-did-for-love", "http://www.goodreads.com/book/show/73070.It_Had_to_Be_You", "http://www.goodreads.com/book/show/73089.Match_Me_If_You_Can", "http://www.goodreads.com/book/show/73086.Kiss_an_Angel", "http://www.goodreads.com/book/show/73080.Nobody_s_Baby_But_Mine", "http://www.goodreads.com/book/show/73064.Natural_Born_Charmer", "http://www.goodreads.com/book/show/28168785-runaway", "http://www.goodreads.com/book/show/35148447-juliet", "http://www.goodreads.com/book/show/35913695-hidden-secrets", "http://www.goodreads.com/book/show/40198274-kiss-me-while-i-sleep", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/35839275-kian", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/26186801-someone-like-you", "http://www.goodreads.com/book/show/18800300-from-thin-air", "http://www.goodreads.com/book/show/18950617-sweet-caroline", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/18800331-to-hope", "http://www.goodreads.com/book/show/33016164-royally-bad", "http://www.goodreads.com/book/show/34609092-royally-ruined", "http://www.goodreads.com/book/show/40193474-the-finishing-touches", "http://www.goodreads.com/book/show/40193549-roses", "http://www.goodreads.com/book/show/19032297-accidentally-in-love-with-a-god", "http://www.goodreads.com/book/show/29231863-splinter", "http://www.goodreads.com/book/show/23622993-claimed", "http://www.goodreads.com/book/show/40243614-just-jilted", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/18800455-the-pms-club", "http://www.goodreads.com/book/show/18800812-gypsy", "http://www.goodreads.com/book/show/35708042-bodyguard", "http://www.goodreads.com/book/show/18800579-willow", "http://www.goodreads.com/book/show/30126159-mosaic", "http://www.goodreads.com/book/show/40389026-summer-island", "http://www.goodreads.com/book/show/12369122-because-of-you", "http://www.goodreads.com/book/show/29373539-the-lullaby-sky", "http://www.goodreads.com/book/show/28441063-secretly-hers", "http://www.goodreads.com/book/show/23271170-tycoon-takedown", "http://www.goodreads.com/book/show/18800411-come-high-water", "http://www.goodreads.com/book/show/33001355-before-i-knew", "http://www.goodreads.com/book/show/40205166-the-paradise-of-glass", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/21425515-once-haunted-twice-shy", "http://www.goodreads.com/book/show/40272947-the-pursuit-of-tamsen-littlejohn", "http://www.goodreads.com/book/show/40193595-the-story-of-beautiful-girl", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/30184217-say-goodbye-for-now", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/18800690-love-is", "http://www.goodreads.com/book/show/40494988-thirty-five-and-a-half-conspiracies", "http://www.goodreads.com/book/show/20489452-thirty-one-and-a-half-regrets", "http://www.goodreads.com/book/show/20687181-thirty-two-and-a-half-complications", "http://www.goodreads.com/book/show/40198652-twenty-eight-and-a-half-wishes", "http://www.goodreads.com/book/show/15836745-twenty-nine-and-a-half-reasons", "http://www.goodreads.com/book/show/36685093-the-unimaginable", "http://www.goodreads.com/book/show/29339972-thirty-six-and-a-half-motives", "http://www.goodreads.com/book/show/23263614-thirty-three-and-a-half-shenanigans", "http://www.goodreads.com/book/show/40199170-thirty-and-a-half-excuses", "http://www.goodreads.com/book/show/24778061-thirty-four-and-a-half-predicaments"]}