{"ratings": 13244, "userreviews": [{"userName": "Meredith", "userReviewDate": "Aug 10, 2017", "userURL": "http://www.goodreads.com/user/show/30978160-meredith", "userReview": "2.5 StarsHaving read glowing reviews from some of my GR friends, I wanted to love When You Disappeared. But of course, I have to be the person who didn’t love this book! Married for 10 years with three children, it might seem like Catherine and Simon have the perfect marriage. But when Simon disappears without a trace, Catherine comes to learn that she never really knew the man she married. Flash forward 25 years, Simon has returned determined to punish Catherine for her wrongs. The two share with one another what happened over the course of their time apart, and buried secrets begin to emerge. At this point, it seems as if the reader is being set up for an expert game of cat and mouse. But as they share more and more, and tell and tell and tell, NOTHING really happens. And things move SLOWLY. All I wanted to know was why Simon left?!  Little clues do emerge, and I was hoping I was being teased for a big reveal. But as I read more and more, and NOTHING happened, I grew rather frustrated. And once Simon finally told Catherine his rationale for leaving, I wanted to jump in the book and beat the crap out of him!  Not because of why he did what he did (which is just stupidly awful), but because I had to wait so freakin long to find out! Sadly, it all just felt so contrived.I received a copy of this book from NetGalley and the publisher in exchange for an honest review."}, {"userName": "Kaceey - Traveling Sister", "userReviewDate": "Aug 18, 2017", "userURL": "http://www.goodreads.com/user/show/13442817-kaceey---traveling-sister", "userReview": "A Traveling Sister read with Brenda and Lindsay! 3.5* Catherine wakes up in the morning oblivious that her world is about to change forever. Her husband is gone! And she is frantic! He never showed up to work…maybe lying injured or dead in a ditch somewhere. The hours turn into days and eventually fall away into years. Simon has never been heard from again…until now!We’re also given a view into Simon’s world during his disappearance. What would have motivated him to leave his family? What is the unforgivable act that triggered his vanishing act? And why stay away so long? There are whispers throughout this book of what drove a wedge between Catherine and Simon and eventually led to Simon leaving. There-in lies the mystery, buried deep within the pages. (Unfortunately not deep enough for me as I guessed most of it early on. I know…junior detective in the makings…Lol!).Told in past and present tense from the POV of both Catherine and Simon. Including the journey Simon traveled to find himself in his new life. Which at times became soooo far-fetched! He was not at all a likable character. In fact, I ended up having a love-hate relationship with this book. I absolutely loathed everything about Simon, wishing him ill-will at every turn. Yet, I couldn't pull myself away from tale he told.Aren't the best books the ones that make you feel unsettled, setting off a wave of emotion within you? Especially if that emotion may be a troubling one. Well this book did just that!Thank you to NetGalley, Thomas &Mercer and John Marrs for a copy of this book in exchange for an honest review.For this review and our Full traveling sister review please visit Norma and Brenda’s fantastic book blog: http://www.twogirlslostinacouleereadi..."}, {"userName": "Brenda - Traveling Sister ", "userReviewDate": "Aug 13, 2017", "userURL": "http://www.goodreads.com/user/show/10841164-brenda---traveling-sister", "userReview": "Traveling Sisters NetGalley Sister Review by Brenda with Lindsay and Kaceey’s thoughts.When You Disappeared started off with seven of us for a Traveling Sister Group read, and then they started to disappear with three sisters dropping out and the thread started to read like a thriller itself. Norma with a full weekend ahead had to drop out as well, leaving Kaceey, Lindsay and me as the last standing Sisters for this read When You Disappeared is a family drama thriller that is heavy on the drama and light on the thrills. Some parts of the story dragged and were unrealistic for us. We had the believability police on duty for this one and reporting back to the rest of us. We found much to be unrealistic but came to the conclusion it was for the convenience of the story and thought it was written more for drama than believability. The story is told by Catherine and Simon in two different timelines which we all enjoyed. At times when the story dragged we really wanted Catherine to put down the wine and do something. We really had some strong feelings of dislike for Simon and there was nothing likable about his unlikeable character for us. The story had no suspense for me and I was rushing to get to the end but for Kaceey and Lindsay the suspense kept them turning the pages to see how it ended. In the end, we all found the ending to be over the top and underwhelming. We still recommend for thriller lovers who really like a lot of drama to their thrillers. Thank you to NetGalley, Thomas &Mercer and John Marrs for a copy of this book to read and review.All of our Traveling Sisters Reviews can be found on Norma’s and my sister blog:http://www.twogirlslostinacouleereadi..."}, {"userName": "Lindsay - Traveling Sister", "userReviewDate": "Aug 16, 2017", "userURL": "http://www.goodreads.com/user/show/54886546-lindsay---traveling-sister", "userReview": "3 stars. This novel had such potential with a highly enticing premise, however, the extreme lack of believability meant the story fell flat for me.I enjoyed the way the story unfolded. The novel was told through Catherine and Simon’s perspectives ranging from 28 years ago to a present-day meeting. The author, John Marrs, does a great job revealing pieces of the story in a suspenseful and intriguing way, all the while making me curious to see how the story would play out. Unfortunately, many of the situations, particularly those involving Simon seemed highly unlikely and absurd. Believability is a huge requirement for my reading enjoyment - I have a hard time truly immersing myself within a story that isn’t realistic (the “believability police” within me kicks in quickly!). My reading mind can stretch to accept slightly exaggerated situations, but the list is fairly long of the things that I found far-fetched within this novel. There were some very serious parts to this story that really pulled at my emotions and maternal instincts. I had a hard time reading some pages as there is such a devastating family loss that deeply affected me. Overall, I found this to be an averagely enjoyable read with nothing that truly made it stand out other than its lack of believability. A big thank you to NetGalley, Thomas & Mercer and John Marrs for a copy of this novel in exchange for an honest review!To find this review along with our Traveling Sister Read review, please visit Brenda and Norma’s fabulous blog at:https://twogirlslostinacouleereading...."}, {"userName": "Pauline", "userReviewDate": "Sep 13, 2017", "userURL": "http://www.goodreads.com/user/show/57991562-pauline", "userReview": "I found this book very hard to read as the characters were very unlikeable. I did feel sorry for Catherine who was abandoned by her husband. She did not know what happened to him and she was left struggling to look after her three children. Her husband Simon was a very selfish man, not caring about his wife and children and taking advantage of everyone. I would like to thank NetGalley and the publisher for my e-book in exchange for a honest review."}, {"userName": "Kendall ", "userReviewDate": "Aug 10, 2017", "userURL": "http://www.goodreads.com/user/show/42327848-kendall", "userReview": "DNF.... 50 percent in and just can't anymore.Boring boring boring.... and plot is just unbelievable and stupid. No thanks 👋🏻."}, {"userName": "Linda Strong", "userReviewDate": "Jul 29, 2017", "userURL": "http://www.goodreads.com/user/show/13684015-linda-strong", "userReview": "Catherine wakes up one morning to find her husband gone. She checks his shoes .. no, his running shoes are right where they always are. His car is still there, his keys are not missing. His wallet is on the dresser. Where is he and what has happened to him?Twenty Five years later Simon appears on her doorstep. He has all the answers, and he knows it's time that Catherine had them, too. But neither of them know the whole truth!The story line is perfect. When Simon shows up, he confesses to all he's done in the past years. Every other chapter or so the reader hears Catherine's voice .. to learn how her life has turned out. And of course, the one question she wants answered ... Why? I have to share with you .. I did not like Simon. I could not find any redeeming qualities. His total disregard of his family .. just disappearing. Did he never think about how they were .. were they eating... where were they living? It got worse with each story that Simon had to share.The ending is stupendous. Never, ever had any inkling of what was coming. Excellent writing.Revised edition: Previously published as The Wronged Sons, this edition of When You Disappeared includes editorial revisions.Many thanks to the author / Thomas & Mercer /Negalley for the advanced digital copy. Opinions expressed here are unbiased and entirely my own."}, {"userName": "Stacey", "userReviewDate": "Sep 15, 2017", "userURL": "http://www.goodreads.com/user/show/399175-stacey", "userReview": "3.5 I've been told that the secret to a lasting relationship is communication. So it's the same with Catherine and Simon.Alternating from the perspective of Catherine and Simon 25 years ago to present. Simon is the perfect father and husband. One day he doesn't come home. The police are called, the community rallies up search parties with no luck. Family and friends start to suspect Catherine has something to do with it. Over time he's presumed dead and Catherine and their 3 children try to move on with no answers. However, Simon is out there and he can't live with who Catherine says she is. He contemplated suicide, but leaving without a trace would be easier. We see how each of them cope over the 25 years.It's an interesting premise for a novel and Marrs does a good job with the characters. I haven't come across a novel that I have completely despised a character as much as I despise Simon. Does this man have any redeeming qualities? No. I read on hoping for a twist. No, still an ass.Thank you Net Galley, John Marrs, and Thomas & Mercer for the opportunity."}, {"userName": "Mackenzie - Traveling Sister", "userReviewDate": "Nov 12, 2017", "userURL": "http://www.goodreads.com/user/show/57632045-mackenzie---traveling-sister", "userReview": "This is a really lovely book by John Marrs, and I have to admit, it was difficult to put down. I saw many reviews and it does seem this is a polarizing book. Some hated it, some loved it, and most hate-loved it. Having read it, I can understand these opinions. I will say that even those who seemed to dislike the book the most, admitted that it really made them feel something, and that is a marker of a great book in my opinion. This is a book I won't soon forget.I would not characterize this book as a psychological thriller, or even really a domestic thriller. Though there are secrets not unveiled until the end, you understand from early on much of what is going on. You know where Simon went the day he disappeared, and you know what Catherine went through as she struggled to find her footing. As the blurb says, Catherine of course is a mother of three who wakes up one day to find her husband missing. In a very real way, she does not initially really think of him as missing. From early in the day, there is a very reasonable explanation for why he is not there.But as the first chapter unfolds, we see Simon returning to visit Catherine 25 years after his disappearance. She's in the same cottage where they made their home. Simon is in a bespoke suit. These are two people who have lived very different lives from the ones they pictured when they were first newlyweds.The story moves back and forth between Simon and Catherine, and begins the day he disappeared and then flashes forward to present day, when Simon and Catherine are telling their stories of where they have been and what happened to them. This is a book that is completely about the journey. At times it is difficult to read. Simon seems so selfish and Catherine seems so wounded. But ultimately, it was hard to clearly decide who to blame until the very end of the book.I don't want to spoil anything, because this is really a good read. I will say that contrary to many readers, I wasn't left completely hating either Simon or Catherine. There were of course things that I hated about them (one in particular), but mostly I just felt sorry for them. This is a novel about the lasting damage that can occur through our childhood. Our parents, our environment, our friends, and our experiences from a young age truly shape how we approach situations as adults. We see this theme not just through Simon and Catherine, but through other characters as well: Sophia and Luca; James, Robbie, and Emily; Dougie; Doreen. I recommend this book fully, with the caveat that there are some sensitive topics that arise throughout."}, {"userName": "Ingstje", "userReviewDate": "Sep 24, 2017", "userURL": "http://www.goodreads.com/user/show/16236266-ingstje", "userReview": "After reading both of his novels I can say that I’m officially addicted! He’s got what it takes to completely transport me to another country and another lifetime and he really let the characters come alive so much in this novel that they crept under my skin. When You Disappeared is a deeply character-driven family drama and I was really invested in the characters (or one of them at least). This is a novel that’s all about the journey and isn’t fast-paced in that way but more of a slow unfolding and discovery of the characters throughout the story. Don’t expect it to focus on an investigation after Simon went missing and you’ll be absolutely fine.The novel starts with Simon’s return after 25 years and then turning back to his decision to disappear and leave his childhood sweetheart Catherine and his 3 children so many years ago. He actually planned to take his own life but in the end he decided that would be too easy, better to let his wife suffer and wonder what happened to him so he just vanished… until now. The reason why he left is surrounded by mystery but it must be something terrible is all I could assume. It is much worse than I thought though… that ending, knowing, finally understanding it, realizing… it’s harrowing!When he knocks on her door after such a long time and after she’s overcome the shock of seeing him again, Catherine demands why he left and what she did to him that make him take this action. He’s there to tell her why he’s resented her all this time but first she has to hear what she made him do while he was away. He tells her he set fire, he stole and killed and it was all due to her. She quashed his dreams and ideas and all he knew was that true happiness was non-existent. When you think you’ll have it, something dark and rotten will turn it around and take it away. He’d seen it often enough, with his mother, with the ‘perfect’ family of his friend Douglas, and then what his wife did. It sounds bitter and there is definitely a heaviness I felt when I was reading this book but thankfully positive notes became more and more prominent the further I advanced into the novel.There’s nothing that gives an idea as to what happened but the alternating storylines of their pasts gave me a pretty good idea of who these people were, their true selves come forward through their actions and how they coped with their struggles. I learned how he led a decadent life without worries while she tried to pick herself up, got 3 jobs to provide for her children. Even though Catherine did something so awful that Simon gave up everything and I should probably have sympathized with him for making such a grave decision, I didn’t, not one moment really. He pushed his family out of his mind just too easily, he did atrocious things and I found myself not feeling sorry for him and not sympathising anymore. I was wondering if the author was going to make me feel guilty and swing my sympathies by the end of the novel but I can’t say. I can only confirm that I felt deeply for one of them in the end.It took until the end of the novel to be enlightened why he finally came back and is even so many years after the facts still trying to instill guilt. Their interactions in the present were like a dance, seeing what their truths did to the other when hearing them so honestly declared. It was fascinating to see how they spent their lives and slowly they are coming to the crux of the story with a twist, a turn of events that I never imagined and was so tragic.I’m not sure this novel is for everyone, it’ll have some divided opinions probably because of this unlikeable character and the lack of exciting things happening, but I was really drawn into it. When You Disappeared was a rich story that had me completely immersed."}, {"userName": "Al *the serial series skipper*", "userReviewDate": "Aug 12, 2017", "userURL": "http://www.goodreads.com/user/show/4167077-al-the-serial-series-skipper", "userReview": "[Simon, the MC , abandons his wife and 3 kids, he ups and leaves one morning, while she still mourns the death of one of her children. His wife, Catherine, tries to find him, she tries everything from asking his best friend who's a detective to going on live tv to appeal to strangers, all to no avail, she is certain he wouldn't just walk out and leave. The police dig up her garden because they think she killed him, she has a miscarriage. She struggles to get by for years though she's weary and she almost gives up. We are also told what Simon has been up to for years, but I honestly don't care to recount it.Twenty five years go by and he comes to her door, he's seeking forgiveness and he wants her to know why he left all those years. He left because he knew she had an affair with his bestfriend Doug. It turns out that he had a friend Doug, who loved him but couldn't have him because he married Catherine. Doug goes on with his life, marries and gets divorced. He gets jealous of Catherine's relationship and sodomizes her, Simon hears them but doesn't help, he's in his head wallowing in self pity while his wife gets raped. Catherine is too ashamed to tell him what happened so she just sweeps it under the rug. Meanwhile, Simon kills Doug and buries him. He is ok for a while until Catherine tells him she's pregnant. He is certain that the child is Doug and wishes she has a miscarriage, she doesn't and gives birth to a baby boy. Simon can't deal,so he kills the baby in the bath, he lets him drown. Catherine is devastated, inconsolable, she blames herself because she was supposed to be watching him, Simon lets her . He basically abandons his family for 25 years while he went around gallivanting around Europe and America killing who ever gets in his way with no remorse at all. He makes another family and doesn't think about the one he left. He was a monster in all sense of the world. I hope he died alone. (hide spoiler)]"}, {"userName": "Deborah", "userReviewDate": "Jan 11, 2014", "userURL": "http://www.goodreads.com/user/show/24383684-deborah", "userReview": "I started this book last night and it's now just after 2am, that's how addictive it is I just couldn't put it down. This is I believe the first book by this author which is incredible, what a first book!In general I prefer my books lighter than this with a male character that I actually like but wow you should really give this book a chance, I only intended to read the first couple of pages to see if it's a book I'd want to read in the future and that was it I was hooked, couldn't put it down.In order to give a balanced review you could argue that it's a little far-fetched and yes I suppose it is but it's written in such a way that the story just grabs you and takes you along for the ride."}, {"userName": "Sara", "userReviewDate": "Jan 22, 2018", "userURL": "http://www.goodreads.com/user/show/68335863-sara", "userReview": "For me, this wasn't so much a thriller but I still thoroughly enjoyed it. I was hooked right from the start and needed answers. A great page turner. This is one that has sat unread on my Kindle for a while and I'm so glad I finally decided to start it."}, {"userName": "Rachel Wallace", "userReviewDate": "Mar 06, 2018", "userURL": "http://www.goodreads.com/user/show/24415743-rachel-wallace", "userReview": "3 Stars While some aspects of this Brit-Lit Thriller were good and extremely captivation, others were a bit far-fetched. SUMMARYCatherine and Simeon have known each other since they were eleven years old, have been a couple longer than most people can remember and are now married with three children. Although their family recently suffered a devastating loss, their marriage seems incredibly solid. Just when they seem to be healing from their loss and the whole family is beginning to move forward, Simeon goes out for his morning run and never comes back. The police are alerted, the whole area is searched over and over again. Finally, after months of investigating, the police stop searching and the whole village is left to assume he either had an accident of some kind and his body never surfaced or he abandoned his family. Catherine just knows he would NEVER leave them and continues to search for years. Pretty early in the story we learn that he purposely left this family but the question of 'why' he left continues to haunt the reader until the very end of the book. What could have been so bad that he would leave Catherine, their three children and the life they build together???? The book is written from the POV of both Catherine and Simeon, skipping back and forth in time from the events leading up to Simeon's disappearance to the present day, 25 years later. It works well for the story and was never confusing. WHAT I LOVEDI have to say I absolutely adore Brit Lit!!!! I love the variations in the wording - mum for mom/ jumper for sweater etc. I love both quaint countryside settings and the large city feel of London. I just find it all so charming. This book was gave me my much loved British experience. I found the character study portions of the book fascinating!!! Loved Catherine's metamorphism from a dependent housewife to the sole family breadwinner, I was impressed with how she adapted to her change in circumstances even though she had a rough start. Learning of Simeon's childhood; how his mother was in and out of his life and the long term effects it had on his life made me feel badly for him BUT didn't excuse any of the sociopathic things he did. Most of all, I found the parts about how someone can be so different at various stages of their live / circumstances fascinating and the concept of how you can think you know a person and they can do something you NEVER imagined possible. Definitely thought provoking material. It was addictively readable. I was glued to it from page one to the very last sentence. I ABSOLUTELY needed to find out why Simeon left, what he did while he was gone and how Catherine and their children made it without him. While I totally and completely hated Simeon as a person, he did make a very despicable yet interesting character so I cannot count it against the book. WHAT I DIDN'T LOVE Toward the end, the story was told of what exactly the family's the devastating loss was and how it occurred. Those chapters were incredibly hard to read. I had to skim it because it was WAY too disturbing for me to read in it's entirety and then I had to remind myself over and over that it was just a work of fiction. There were several things in the book which seemed highly improbable and made me roll my eyes. The biggest issue was Luciana's story. I highly doubt her situation has even once happened in real life to anyone ever in the history of the world. I can't say more without a spoiler but you will know what I'm referring to if you read it. Then, the very last couple of pages involving Simeon's reaction to everything made me roll my eyes too. Just kind of a weird way to end the book. I would say melodramatic, but considering what all happened, maybe calling it 'weird' or an 'odd choice' is the correct description. OVERALLThis is a book I would recommend for people who like thrillers and are either okay with a few disturbing elements or are able to skim through the more disturbing passages. It is well written enough so the reader has a growing sense of fascinated unease starting about a third of the way through the book and gaining momentum as it progresses. In the end, it leaves the reader feeling like they have been on a long rough journey."}, {"userName": "Sarah", "userReviewDate": "Aug 31, 2017", "userURL": "http://www.goodreads.com/user/show/897583-sarah", "userReview": "You can find all of our reviews at https://reallyintothis.comHappy Reading, friends! WHEN YOU DISAPPEARED BY JOHN MARRS BOOK REVIEWWhen You Disappeared is my first John Marrs book & it certainly won’t be my last. I love any book with a George Michael reference.DO YOU EVER THINK HE JUST WON’T COME BACK?Years ago, my husband was a stay at home dad. He took care of both kids, cleaned, did the laundry, ran errands & much more. He was & is the backbone of our household. One time, we had a particularly difficult morning loading up while traveling with my Aunt. We were all loaded in the car & my husband ran into the hotel to check us out. He was gone for a Really long time & my Aunt asked me in a joking way, “Do you ever think he just won’t come back?”YOUR HUSBAND IS GONEHe did eventually come back to the car & we had an enjoyable trip. Luckily, have a spouse that I love & trust. But, so did Catherine. As a reader, when I put myself in Catherine’s place I can’t breathe. You’ve got kids, a house, bills & your husband disappears without a trace. The police arrive, your in-laws are suspicious & your children need their father. He’s still missing & you’re left to take care of your family- alone.JOHN MARRS HOOKED MEWhen You Disappeared is a quick read that is fast-paced & keeps you invested in learning why Simon disappeared. What is he hiding? Did his fatherly roles take a toll on him & he couldn’t hang anymore? Is he just an awful person that did his family a favor by leaving them behind? John Marrs hooked me early on & layered this story so well. The ending had my stomach doing flips.THE VERDICTI was Really Into This book. It’s just what I want when something is billed as a “psychological thriller.” I winced, I was on the edge of my seat & I didn’t see the ending coming- at all!Special thanks to John Marrs, Thomas & Mercer & NetGalley for providing our copy in exchange for an honest & fair review."}, {"userName": "Erika M", "userReviewDate": "Sep 30, 2017", "userURL": "http://www.goodreads.com/user/show/58761429-erika-m", "userReview": "ARC provided by NetGalley in exchange for an honest review. DNF. Too slow, or maybe too uninteresting for me. I don't mind the writing style, but the story isn't grabbing my attention. I have a long list of books to read, I'll set this aside for now. Thank you to the publisher and NetGalley for my copy."}, {"userName": "Petra", "userReviewDate": "Dec 01, 2017", "userURL": "http://www.goodreads.com/user/show/28393395-petra", "userReview": "2.5 stars. This was ok, but I can't honestly go as far as saying that I enjoyed it. Quite a frustrating read. I had the urge to slap the male protagonist, Simon. He had no redeeming features whatsoever. On top of that, I couldn't even find a lot of sympathy for the female lead, Catherine, who ends up raising their three children by herself after Simon simply disappears one day. Told from Simon and Catherine's perspectives and switching between the present and the past, this was a character driven family drama, which I found very, very slow. Nothing wrong with the writing itself, but some of the story, in particular some of the events in Simon's life after his disappearance, were extremely far-fetched. Unfortunately, I guessed some of the secrets before they were revealed so that added to the lack of suspense. Overall, a bit underwhelmed by my first experience of a John Marrs' book, but I have his latest on my Kindle and will definitely give it a try.The audio version is nicely done by a male and a female narrator."}, {"userName": "Tracy Fenton", "userReviewDate": "Sep 09, 2014", "userURL": "http://www.goodreads.com/user/show/18478389-tracy-fenton", "userReview": "This is a brilliant debut novel. I literally could not put it down and have recommended it to everyone I know! So many twists....a gripping book. Can't wait for the author to write another book."}, {"userName": "The Book Review Café", "userReviewDate": "Sep 13, 2017", "userURL": "http://www.goodreads.com/user/show/57975133-the-book-review-caf", "userReview": "Imagine one day your husband disappears, you have no idea what has happened to him, as time passes you grieve, you go on to build a life without him and then when you least expect he turns up on your doorstep, I’m sure you would be shocked to say the least! and even more so when he reveals what he’s been up too! And this is pretty much the premises for When You Disappear. The story opens with the day Simon left and follows the impact this has on his family, and on Simon himself, when he reappears twenty-five years later, Catherine will finally learn who he really is, and that’s when the book gets really interesting as there are shocks and dark buried secrets galore. I absolutely loved The One by John Marrs so I really wanted to read When You Disappeared the author’s debut novel. Although it made for a good read I did have mixed emotions regarding the book as a whole some parts I really enjoyed and other parts I struggled with. Personally I felt this book read more like a mystery until just over the halfway mark when the psychological thriller element kicked in. I do have to mention Simon what an evil, cold hearted individual John Marr’s has created he doesn’t have one endearing feature, and at times he literally made my blood boil, sometimes I think having strong feelings for a character even if they are negative ones can actually heighten my enjoyment of a book, but unfortunately I disliked him so much it actually distracted from my enjoyment of When You Disappeared.When You Disappeared is told in alternating chapters past and present from the two main characters POV, unfortunately I did find the constant change sometimes made the chapters feel disjointed. Although I can see why the author used this ploy I did find it slightly distracted from my enjoyment of this book. I would describe this book as a Character driven family drama and so I found the pace quite slow, although I do feel the author builds on the suspense and tension as he slowly reveals Simon’s darkest secrets. There is no doubt the author hasn’t written a captivating tale that many readers will enjoy with an original plot. It’s an impressive debut and one I’m sure many readers will enjoy."}, {"userName": "Anna", "userReviewDate": "Dec 07, 2013", "userURL": "http://www.goodreads.com/user/show/1632609-anna", "userReview": "Twenty-five years ago, Catherine awoke to find her husband had vanished. As the days turned into weeks and then months, and no trace of either him or his dead body was found, Catherine and her three young children went through every hellish emotion as they desperately tried to cling to normality. Twenty-five years ago, Simon chose to walk out on his wife and children. Hitching to Europe, he began a new carefree life, giving little thought to those he left behind.Today, Simon knocks on Catherine's door to finally lay the ghosts to rest. Why did he leave? The answer to this is told in alternating chapters by husband and wife, both now and in the past. The twisted web of secrets and lies had me reading long into the night, as each chapter became more layered, more complex, more shocking, more heart-wrenching. An original, dark, disturbing, gripping read; a true page-turner."}, {"userName": "Liz", "userReviewDate": "Oct 08, 2017", "userURL": "http://www.goodreads.com/user/show/23068367-liz", "userReview": "[That scene where Simon burns down the hostel was probably the most shocking scene for me in terms of his deluded selfishness and it still reels me up! (hide spoiler)]"}, {"userName": "Ally", "userReviewDate": "Feb 13, 2018", "userURL": "http://www.goodreads.com/user/show/54302126-ally", "userReview": "This book was so frustrating. I wanted to know what happened but I HATED some of the characters."}, {"userName": "Samantha Curtis", "userReviewDate": "Jan 29, 2018", "userURL": "http://www.goodreads.com/user/show/18011025-samantha-curtis", "userReview": "Brilliant read."}, {"userName": "Jules", "userReviewDate": "Feb 06, 2018", "userURL": "http://www.goodreads.com/user/show/4824134-jules", "userReview": "When You Disappeared is about a man who walks out on his wife and children, and turns up 25 years later. Will Simon’s wife, Catherine finally get answers as to where he’s been all those years and why? This was an enjoyable thriller, but not one I fell in love with. I didn’t fully connect with the characters, and found Simon rather unlikable, which in turn left me less shocked or surprised by his actions. The One is still my favourite book by this author, as I absolutely loved it.I borrowed this book in audiobook format through Amazon Kindle Unlimited."}, {"userName": "Danielle (The Blonde Likes Books)", "userReviewDate": "Nov 25, 2017", "userURL": "http://www.goodreads.com/user/show/19967008-danielle-the-blonde-likes-books", "userReview": "John Marrs gets me every time! After reading (and loving) The One earlier this year, I was eager to pick up his other books! While I was reading this one, I kept thinking about how it was good, but not as twisty as The One...then I got to the end, and WOW. It was twist after twist, and I LOVED it! This was easy to read, and once the story got going, I didn't want to put it down. I loved how things played out, and loved to hate Simon. I especially enjoyed the ending of the book!"}, {"userName": "Sandie Bishop", "userReviewDate": "Aug 28, 2017", "userURL": "http://www.goodreads.com/user/show/12874414-sandie-bishop", "userReview": "This is a tricky book to review, as it is well written with very well developed characters but I can’t really say that I enjoyed it due to the subject of the story. For a husband to walk away from his family, leaving them with no clue as to whether he is dead or alive seems rather callous. As a reader we know that he is alive and well but Catherine and the children can but imagine the worst case scenario when after days, weeks, months and then years pass they have no sign of him. The years pass and we see Simon living a seemingly carefree life for the majority of the time, anything that happens that threatens his peace causes him to burn his bridges and walk away to start a new chapter of his life in a new place. His methods are definitely questionable as are his morals at some points and I found him to be a very self centred person. Catherine and the children slowly manage to rebuild a new life for themselves but it takes much longer for them to find peace. Even towards the end of the story when Simon eventually faces his demons – again for selfish reasons I felt – although I understood more about him, I still found him a very unlikeable character. His behaviour changed the lives of many people around him who he purported to love deeply, and even at the end of his story I still felt that he did not accept any responsibility for the pain he had caused. In his eyes, there was always someone else who had made him react the way he did. Because of this, I would say that this is a compelling read which provoked a lot of feeling in me but to say that I enjoyed it would be a step too far.I can imagine some reviewers marking this book down because of that, but the depth of the personalities of the characters I felt made this a good read. Therefore I would give it a strong 4 stars.I have found this to be quite a complicated tale which has made me feel strongly about the main character. I don't want to give anything away but I have had mixed feelings as his side of the story is related through the book. I definitely side with wife Catherine throughout, and it's a wonder that the children turned out so well adjusted all things considered. I have found it a compelling read but the word enjoyable doesn't seem appropriate."}, {"userName": "Zoe Mann", "userReviewDate": "Dec 04, 2017", "userURL": "http://www.goodreads.com/user/show/65629974-zoe-mann", "userReview": "'When you disappeared' by John Marrs is a roller coaster journey that will leave you with whip lash and asking yourself.. what the **** just happened? Catherine and Simon have just gone through every parent's worst nightmare of losing a child. For weeks Catherine's legs couldn't physically hold her weight and sorrow so she has been curled up in bed mourning the loss of her son. She now feels ready to face the world and to rebuild her and her family's lives, however, when she wakes up her husband Simon isn't there and when he still hasn't returned by dinner time she reports him missing. With all of his belongings still exactly where they always are she has to face the reality that something dreadful has happened to her beloved. Catherine goes through the motions again of someone whose life has been turned upside down. After months of no answers she accepts that her husband is dead as what husband would leave his already grieving wife and 3 children behind? 25 years later Catherine has come full circle and her children are grown. The family go to Simon's grave every Christmas but they have accepted he is gone and have moved on with their lives. You can only imagine Catherine's surprise when a tall, tanned, elderly man shows up unannounced on her doorstep claiming to be her dead husband and wanting to explain what happened all those years ago. You will not be prepared for what is about to be revealed and Catherine will be left wishing she never opened her door to the man she once loved who is now a stranger. 'When you disappeared' was a slow burner for me. It took me 2 weeks to complete when I can complete books in 1 sitting. I don't feel the speed you read a book is a representation of the quality. I have whizzed through books in barely a few hours which have been utter garbage. I just want to include this so people stick with it and believe me the build up and scene setting is worth every minute. Finally John Marrs please write a second instalment. I need to know what happens to Catherine after her world is once again blown wide open. Thank you to net galley for an ARC in return for an honest review."}, {"userName": "Tina Woodbury", "userReviewDate": "Dec 02, 2017", "userURL": "http://www.goodreads.com/user/show/5859754-tina-woodbury", "userReview": "For all of my reviews: www.readingbetweenthepagesblog.wordpr...Catherine wakes up one morning to find her husband, Simon, gone. She isn’t too concerned and assumes he has just gone out for a jog. It isn’t until he does not show up for work and does not return home that she realizes something must have happened to him. This is the premise of this story…where did Simon go? And why did he leave without a word?The story alternates time periods and the perspective of Catherine and Simon. This format works really well for this book and John Marrs does a fantastic job of building the storyline and slowly revealing all of the hidden secrets, big and small, that this story has to offer.It was a bit of a slow burn for me. I enjoyed Catherine’s storyline more than Simon’s. I found myself really despising Simon for leaving his wife and children without a word. She is suddenly thrust into being a single parent and needing to provide for her children both emotionally and financially. I can’t imagine the courage it would take to do that! How does one not completely fall apart while missing the love of your life under circumstances that you don’t understand.As if I didn’t feel bad enough for Catherine and the children, there is a part about halfway through the book involving the family dog that nearly broke my heart (no, he didn’t die). I had to step away for a moment to compose myself…grrr that Simon!This book won’t go down as an all-time favorite, but I did enjoy it and look forward to reading more by John Marrs.*Thank you NetGalley, Thomas & Mercer, and John Marrs for the opportunity to read and review this book for my honest opinion."}, {"userName": "B.E.L.L.A.Mc", "userReviewDate": "Oct 31, 2017", "userURL": "http://www.goodreads.com/user/show/47382252-b-e-l-l-a-mc", "userReview": "[FREE to read with Kindle Unlimited in the UK. (hide spoiler)]"}, {"userName": "Dani Jade", "userReviewDate": "Dec 12, 2017", "userURL": "http://www.goodreads.com/user/show/41664104-dani-jade", "userReview": "When You Disappeared\n\n (apparently also - and possible more widely - known as \n\"The Wronged Sons\"\n for some bizarre reason) tells the story of married couple Catherine and Simon, beginning when Catherine wakes up one morning to discover her husband has disappeared. It is set partially in the present day - when Simon has reappeared on Catherine's doorstep after 25 years, finally ready to explain - and partially in the past, starting 25 years ago on the day he disappeared and alternating between Simon and Catherine's points of view. A little while ago, I read \nThe Good Samaritan\n by this same author, John Marrs, and really enjoyed it. It was twisty, thrilling and mysterious and the central character was just the right amount of psychotic that meant she was, if not likeable, at least enjoyable to read about. I was hoping for the same again in this book. Sadly, it fell short of my expectations. The bulk of the book was much more family-drama than thriller, and what twists and mysteries there were were small and somewhat predictable. This would have been fine if it was interesting - and Catherine's chapters were; I enjoyed her spirit and her ability to overcome. But Simon's chapters were boring to me and I just did not care about his character and what he was up to most of the time at all. I found myself skim reading his chapters after a little while. I'm still giving it three stars as I did enjoy Catherine's chapters and honestly I believe I wouldn't have been disappointed in it if I hadn't previously loved another of the author's books. I still fully intend to read more of his work - I think maybe \nThe One\n next."}], "description": "When Catherine wakes up alone one morning, she thinks her husband has gone for a run before work. But Simon never makes it to the office. His running shoes are by the front door. Nothing is missing—except him.Catherine knows Simon must be in trouble. He wouldn’t just leave her. He wouldn’t leave the children.But Simon knows the truth—about why he left and what he’s done. He knows things about his marriage that it would kill Catherine to find out. The memories she holds onto are lies.While Catherine faces a dark new reality at home, Simon’s halfway around the world, alive and thriving. He’s doing whatever it takes to stay one step ahead of the truth.But he can’t hide forever, and when he reappears twenty-five years later, Catherine will finally learn who he is.And wish she’d stayed in the dark.\nRevised edition: Previously published as The Wronged Sons, this edition of When You Disappeared includes editorial revisions.", "title": "When You Disappeared", "url": "http://www.goodreads.com/book/show/34884315-when-you-disappeared", "average": 4.06, "cover": "https://images.gr-assets.com/books/1498763199l/34884315.jpg", "reviews": 851, "authors": [{"url": "https://www.goodreads.com/author/show/7264719.John_Marrs", "name": "John Marrs"}], "type": ["Thriller", "Thriller"], "outlinks": ["http://www.goodreads.com/book/show/34884315-when-you-disappeared", "http://www.goodreads.com/book/show/18481773-the-wronged-sons", "http://www.goodreads.com/book/show/22845313-the-wronged-sons", "http://www.goodreads.com/book/show/18901156-the-wronged-sons", "http://www.goodreads.com/book/show/37423136-when-you-disappeared", "http://www.goodreads.com/book/show/35451741-the-good-samaritan", "http://www.goodreads.com/book/show/31422849-the-one", "http://www.goodreads.com/book/show/26205001-welcome-to-wherever-you-are", "http://www.goodreads.com/book/show/39926632-her-last-move", "http://www.goodreads.com/book/show/37581710-the-company-of-demons", "http://www.goodreads.com/book/show/40024832-empire-of-sin", "http://www.goodreads.com/book/show/8343548-the-bricklayer", "http://www.goodreads.com/book/show/40193155-among-the-wicked", "http://www.goodreads.com/book/show/23818400-the-snow-garden", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/23157833-almost-dead", "http://www.goodreads.com/book/show/33555347-crime-scene", "http://www.goodreads.com/book/show/30249521-fatal-frost", "http://www.goodreads.com/book/show/40266676-remains-of-innocence", "http://www.goodreads.com/book/show/34330657-finding-claire-fletcher", "http://www.goodreads.com/book/show/28824403-outfoxed", "http://www.goodreads.com/book/show/23957469-huntress-moon", "http://www.goodreads.com/book/show/40204087-the-deepest-secret", "http://www.goodreads.com/book/show/35115882-what-the-dead-know", "http://www.goodreads.com/book/show/40267317-ragdoll", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/39791173-the-girl-before", "http://www.goodreads.com/book/show/40205081-last-witness", "http://www.goodreads.com/book/show/40205040-dead-weight", "http://www.goodreads.com/book/show/18903409-weekend-warriors", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/40193809-eye-for-an-eye", "http://www.goodreads.com/book/show/35005051-the-forgotten-girls", "http://www.goodreads.com/book/show/27239265-the-short-drop", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/17623604-you-only-live-twice", "http://www.goodreads.com/book/show/17377392-thunderball", "http://www.goodreads.com/book/show/17284593-casino-royale", "http://www.goodreads.com/book/show/17623578-for-your-eyes-only", "http://www.goodreads.com/book/show/17304110-live-and-let-die", "http://www.goodreads.com/book/show/18780375-dr-no", "http://www.goodreads.com/book/show/17379070-moonraker", "http://www.goodreads.com/book/show/18799804-diamonds-are-forever", "http://www.goodreads.com/book/show/40205231-the-spy-who-loved-me", "http://www.goodreads.com/book/show/17377384-from-russia-with-love", "http://www.goodreads.com/book/show/40243961-the-cape-refuge-collection"]}