{"ratings": 7105, "userreviews": [{"userName": "Heather", "userReviewDate": "Jan 23, 2014", "userURL": "http://www.goodreads.com/user/show/1066224-heather", "userReview": "I really like this series and this was probably my favorite book in the series so far. Again, it's interesting and heartbreaking to learn the history, but I think the author does a good job of helping us picture what life really would have been like for these characters and the cultural challenges and moral dilemmas they faced, as well as the struggles of faith and endurance. Many of the stories and examples are very inspiring for us to apply in our lives.I am inspired by the examples of endurance (one day at a time), encouragement, and forgiveness in POW camps. I'm inspired by the selfless examples of soldiers, medical teams, and peasants putting their lives in danger to help save someone else. The selflessness in the midst of the horrible despair and destruction is incredible. It's interesting to think about all the ways that the war changed the individuals and society as a whole. Life really would never be the same. Many had grown and changed for the better and others longed for the purity of life before the war. The circumstances are different today, but we still face challenges and moral dilemmas and trials that we can also choose to face with faith and love.Here are a few of my favorite quotes from the book:\"I do believe that what we're doing is right and necessary. I hesitate to say that the war is a struggle of good against evil, there's too much evil in all of us to make that kind of claim....American troops are mostly a bunch of civilians who got pulled into this thing, not trained warriors, but what we believe turns out to run pretty deep in us.....What I'm thinking about tonight is the cost of everything we have gone through. I know I'm not the same man I was, and I don't like some of the changes\" (p. 167).\"When this war is over, evil will still be with us. It will be forever, no matter how many wars we fight. I want to find a place where we can make a family and we can try not to be evil ourselves. That's the only war we have a chance to win\" (p. 169).\"He had never seen courage manifested so tangibly on such a grand scale\" (p. 193).\"So what do you believe in? Really?\" (p. 195)\"She had felt her own lack of spirituality and longed to have the Lord touch her, maybe shake her shoulder when she needed it. But today, the idea took on a new perspective. She was so far from home and the things she found comfort in, and she was about to do something sacred: offer her healing touch. She wanted to bring her spirit to this act, so that these boys, some taking their final breaths, would know that life wasn't only ugliness and hatred. She wanted them to know that nobility also existed--goodness and kindness. She didn't want to get caught up in all the bandaging and tugging bodies here and there and forget that it was Easter\" (p. 214).\"She knew the Lord would restore the boy's vision, that in the next life this young face would be made whole, and the boy would be as handsome as he ever had been. But right now his skin was gone, his nose and ears. What mercy he would receive would come later, but for a long time now, he was going to suffer. She told herself that life was a learning experience, and that suffering was actually a kind of sacrament, a holy experience to lift a person to a higher plane, but when she looked at the boy, she could only wonder what he would think when he finally saw himself\" (p. 215).\"What if they had fought this battle without an Easter, without any promise at all?\" (p. 221)\"The German people knew how to endure...He loved their dogged determination to survive....He had felt like a man without a country for quite some time, but this loss seemed to teach him the truth. Every German was an orphan now--with the country so devastated--but the fact was, the homeland wasn't in the buildings. It was in that little girl's spirit--the one who had clung to her little brother. And in the people's will. He felt more hope tonight than he had in a long time\" (p. 257).\"He couldn't help them all...but he would help this family\" (p. 298).\"There were lots of different kinds of victims of this war. When you're out there in the battle, you don't realize how many of them are back at home\" (p. 314).\"We need you. Some of what you say sounds like self-pity, and there's no time for that. We have to put things behind us and get the Church going again\" (p. 329).\"I'm certain that no one here got through this war without wondering at times whether God had given up on us. But we created the war, not God, and now I know that he is waiting to welcome us back to him. I have seen horrifying things in these last two years. You have seen far more, and I know you are suffering now. But God is waiting for us to return to him. We must give him back our hearts\" (p. 331).\"Wally fought the impulse. He didn't want to let Hisitake off the hook that easily. What he had done to them men--to Wally personally--was inexcusable. But then Wally saw that Hisitake was crying...A kind of tingling passed through Wally's body, and he hardly knew what to make of it. It was a spiritual feeling, a change coming over him. Some weight seemed to lift from inside his chest. Wally actually fought it, told himself he didn't want this. He wanted to hate this man, always. But what had started as a hint, an idea, began to build into a powerful emotion, as though his spirit were being altered. He felt calm and right, and the thought that began to fill his head was that he never wanted to hate anyone again\" (p. 397).\"You're the best man I've ever known...I figure I'll never again have a friend as good as you guys\" (p. 418).\"He would never be thankful for the things that had been done to him, but he was thankful for the result. He hoped he would cling to what he had gained\" (p. 426).\"Most of the faith she had possessed, she had learned here at this navy base, or in her ward in Honolulu. She would always be thankful for that. So she said a prayer. She thanked the Lord for the things she had learned, and she prayed that she might not ever lose what she had gained during the war\" (p. 437).\"All these years, all we talked about was the war ending. We didn't take into account all the ways the war would come home with the warriors\" (p. 440).\"How long are we going to feel this way--like everything we get is just too great to believe? I don't want to complain about anything, ever again....He hadn't slept on a bed yet, with sheets, and he hadn't seen his family, but he was almost sure he would always appreciate such simple pleasures for the rest of his life\" (p. 451).\"Through all of these years he had been too intent on surviving to devote much of his mental energy to grieving\" (p. 473)."}, {"userName": "Laura Gubler", "userReviewDate": "May 19, 2010", "userURL": "http://www.goodreads.com/user/show/3415766-laura-gubler", "userReview": "American history is my absolute favorite school subject! This is the reason Historical Fiction is my favorite book genre. WWII, however, has always been the part of our history that I only learned what was needed to \"pass the tests\" this being because of all the things that happened to the Jews. It was always a very hard thing for me to think about. I have owned the Children of the Promise book series for over 5 years now and finally brought myself to read them THANKS to my father in law. This book series was absolutely profound to me. I cannot really put into words all the feelings I had while reading these books. There was so many spiritual feelings throughout. So many times I cried for good and for bad. Dean Hughes touches on so many areas of the war all around the world. He stayed as close to the \"real thing\" as I think was possible. So many movies romantisize this war, the biggest war in history but Hughes told it like it was. But at the same time it is not a series that was to hard to read as far as the gore of it all. He gives a very real look into a fictional family and all that they experienced during \"the duration\". I could go on and on. This book series is now and will always be my favorite book series. I would recommend this series to all."}, {"userName": "Sandyr", "userReviewDate": "Feb 12, 2009", "userURL": "http://www.goodreads.com/user/show/1713964-sandyr", "userReview": "I have now finished the entire series and loved all of the books. The parts I liked the most was the historical detail on the war. I learned alot from the descriptions of what each character went through in the war. I really felt like I was there. The other part I liked was that each of the characters were fully developed and I saw myself in some of them or I saw people I knew. I could really relate to their personalities. Great series, I highly recommend."}, {"userName": "Melanie", "userReviewDate": "Sep 19, 2014", "userURL": "http://www.goodreads.com/user/show/1533138-melanie", "userReview": "Such a great series! I'm grateful to have discovered it after all the books have been released. It would have been hard to wait for books to come out because each book ends in such a way that I want to hear more. The war comes to an end in this book and I'm anxious to hear about the reuniting of the Thomas family. The war has obviously changed their lives forever."}, {"userName": "Leslie", "userReviewDate": "Jul 24, 2016", "userURL": "http://www.goodreads.com/user/show/14292981-leslie", "userReview": "Loved this book! I put 4 stars though because I briefly read the synopsis in the jacket cover inside and felt it gave away a huge spoiler so as I was reading, I would hesitantly read if I thought that moment was coming. Again, joy and heartache. I cried multiple times at this because I have come to care so much for these characters."}, {"userName": "Tiffany", "userReviewDate": "May 17, 2009", "userURL": "http://www.goodreads.com/user/show/1074814-tiffany", "userReview": "I love this series. When I think of WWII, I think of the Jews and the concentration camps. I love this series because it focuses on a whole different aspect of the war. It gives great detail to fighting on the front line as well as the POW camps in Japan. I'm amazed at some of the conditions the American Soldiers dealt with when fighting in Europe. I'm excited to see how the series ends!"}, {"userName": "Shannon", "userReviewDate": "Mar 12, 2010", "userURL": "http://www.goodreads.com/user/show/712479-shannon", "userReview": "Oh my goodness. I seriously can't stop with this series. and they are all 300+ books. Tim tries to hide them whenever he is home because he knows I'm only half paying any attention to him. I love the characters in these books. I seriously get so wrapped up in their lives. It's a powerful story and I love the history that comes in the book too. How little I knew/know."}, {"userName": "Andrea", "userReviewDate": "Oct 05, 2009", "userURL": "http://www.goodreads.com/user/show/2810154-andrea", "userReview": "I loved this series - couldn't put it down! I love the way the chapters weave through the different family members' lives. It's like reading several novels in one. Despite the length of these books, I was captivated from the start and just kept reading. I really love the author's writing style."}, {"userName": "Rebecca", "userReviewDate": "May 21, 2009", "userURL": "http://www.goodreads.com/user/show/1735399-rebecca", "userReview": "Wally's experiences bring tears to my eyes-and I've read this book about 4 times now. I am so grateful for my freedom!"}, {"userName": "Charly Troff (ReaderTurnedWriter)", "userReviewDate": "Oct 29, 2017", "userURL": "http://www.goodreads.com/user/show/72233814-charly-troff-readerturnedwriter", "userReview": "Every book in this series is so amazing. Because of the scope of the project, the author does give some exposition (this is especially common when he transitions from one character to another, he'll take a few paragraphs and tell you what is happening both with the character and the war). I understand why he did it and I often skimmed this but it didn't take away from the books in any real way. The character development in this book is so amazing, I have absolutely fallen in love with the Thomas family. The problems the characters face are real life problems that I often didn't have an answer to right away. I love how diverse the cast is and I love the way Hughes has his characters face social problems that really made me think about our world today and how I feel and act. Reading this series has been life changing for me."}, {"userName": "livvy.jane33", "userReviewDate": "Jun 08, 2017", "userURL": "http://www.goodreads.com/user/show/55424140-livvy-jane33", "userReview": "No words. I loved every second. I've grown to know and love these characters so much that it's hard to think that they are not real. I cried. Again. I've even grown to enjoy LaRue. Sometimes these characters frustrate me, but that's because I want them to be happy. Yes, I want this fictional family to be happy. Snigger and move on. Favorite in the series so far. So, so amazing. Thank you Dean Hughes for helping me understand the war better, and creating a series that I can learn from and grow."}, {"userName": "Jillian", "userReviewDate": "Oct 25, 2017", "userURL": "http://www.goodreads.com/user/show/9801822-jillian", "userReview": "This was good, as it tied up some loose ends and took you through the end of the war. Left enough conflict open that it made me want to dive right in to the next book!"}, {"userName": "Kelly Porter", "userReviewDate": "Feb 11, 2017", "userURL": "http://www.goodreads.com/user/show/59642038-kelly-porter", "userReview": "Love this series!"}, {"userName": "04kaitlynr", "userReviewDate": "Nov 07, 2011", "userURL": "http://www.goodreads.com/user/show/6159685-04kaitlynr", "userReview": "Children of the Promise: When we Meet Again is a good WWII book. It gives you a good idea of what it was like during WWII including a perspective of what it was like for a POW, a seargent, a nurse, and rebellious teen. In the following paragraphs I will summarize the book.Alex Thomas is a seargeant for the paratroopers. He served a mission in Germany a few months before the war started so, as you can see, it is a little bit harder for him to be in the army. However, he made a statement saying, \"I told you once that I would never be your enemy,\" to a German friend. He has a fiance back in England who is a German, and faught against Hitler. He gets taken out of his regiment and is sent into the OSS to help scout for places for the paratroopers to land. During his time there, he meets another man named Otto, who is doing this for his grandma, who died in a bombing raid. He tries to survive while helping the paratroopers. How will he survive?Wally Thomas is a POW in Japan. He has been there about 3 years and has survived a variety of sicknesses and beatings that were inflicted upon him. He works in a mine shaft and has to dig out coal and sometimes logs that collapsed with the ceiling. The officers treat them terribly and are treated terribly themselves. In this book, Wally survives a harsh beating, more harsh than usual, which is deadly for the POW's. After that beating, he is taken to be tortured by kneeling on bamboo for however long the officers felt like it. Can he get through it?Bobbi Thomas is a nurse in Hawaii. She is engaged to Richard Hammond, but is questioning how committed he is. She tries to figure out what he is feeling for her, but then David Stinson, her old college professor who she once had feelings for, came along. He had signed up for the marines but he was opening an old wound that had just healed for Bobbi. She likes David very much because he is so devoted to her. Who should she marry?LaRue Thomas, who lives in Sugarhouse, Salt Lake, is having problems with her dad. It is typical teenage stuff like wanting independence to make her own decisions. She is also the most popular, and beautiful, girl in the school and is having problems with who she should date. One day she starts to talk to a boy who she sees at church, but isn't very popular. She goes to him whenever she has a problem. Part of the reason she likes to talk to him is because he can't be manipulated, unlike all of the other boys she flirts with. To make matters worse, she is the LDS stake president's daughter, so her dad is counting on her to set a good example for everyone else. What should she do?I suggest that you read these books if you like WWII, LDS books, adventure, or all of the above. It is definately a book you will want to read. I loved these books and it gives you a pretty good idea of what it was like to be alive during WWII. If you were a German, almost nobody trusted you unless they knew you from before the war, and even then you couldn't always be trusted. Hopefully you will read this book because you're missing out if you don't."}, {"userName": "Ashtynne Degroff", "userReviewDate": "Dec 11, 2016", "userURL": "http://www.goodreads.com/user/show/59641986-ashtynne-degroff", "userReview": "Alex was trying to get to know a guy he was with in his foxhole, when a they were getting attacked by the Germans. Meanwhile in the Philippines, Wally was trying to get better after he was just about killed by the Japanese guards. Bobbi was on a medical boat that was trying to get all of the wounded and move them to Hawaii so they could be safe and try to survive. Alex was soon set out on a new mission that was very crucial and could help stop the war. Then while Alex was preparing for the job, his wife, Anna was giving birth to a baby boy, who they named Gene. Bobbi was about ready to try and get some rest, when suddenly, her ship was attacked and some of the patients, doctors, and the nurses were killed. Wally was soon back working in the mine, and as they were working in the mine, all of the Japanese guards suddenly sent them all back to the train and rumors were spreading like wildfire that the Japanese surrendered and the war was over! The theme for this book is You can always look at good things in a positive way. While the Thomas' family was slowly falling back into place, they all recognized it and were all really grateful for all of the things they were offered. A lot of people really try to stop and be grateful for what they had and that the war was finally coming to a close. Wally had so much to be grateful for and when the war was over, he knew that he would never forget the experiences that he was able to have during the war.  I really liked all of the detail and excitement that this book has to offer. I also love the plot and the whole book altogether. I really thought that this series was the best series in the whole world . (other than Harry Potter) :) I really have nothing bad to say about this book. I rated this book a five star because it has all of the quality and the great things that a book needs to call a great book great!"}, {"userName": "Bonnie", "userReviewDate": "Mar 17, 2012", "userURL": "http://www.goodreads.com/user/show/1431063-bonnie", "userReview": "In this 4th book in the series, Hughes continues to write a compelling story full of \"real as life\" history and experiences of the characters during the winding down of WWII. I love the way the characters are so believable and the history is so rich..I also love the honest and real lessons and examples that are weaved into the story. One of my very favorite parts of the book was when Wally was at the train station waiting to begin his long journey home after being a POW for three plus years. He watched as a couple of American soldiers humiliated an older Japanese officer by making him take off his boots and sword and taking them from him. He felt sorry for the officer and told him that he was sorry that the men had acted that way..\"The officer took one long look at Wally, then acknowledged his concern by bowing his head. In that instant, Wally felt the same tingling sensation, the same sense of relief he had known when Hisitake had stood before the men, back at the camp. And again the thought filled Wally's head: I never want to hate again. And what was even better, he felt no need to hate. This man was not his enemy, and twice now God had sent him that sweet clarity..the love of a brother. The American boy had a pair of boots that would eventually mean nothing to him, the other a sword, but Wally had a greater gift. He had escaped the bitterness that he had feared he might harbor all his life.\"..Anxious to see how everyone does now that the war is over, but a little sad to be starting the last book in the series."}, {"userName": "Patti", "userReviewDate": "Jul 13, 2014", "userURL": "http://www.goodreads.com/user/show/1913087-patti", "userReview": "“When We Meet Again” is #4 in “Children of the promise” series of five. I liked it just as much as the others, but still had to skim a few of the awful war scenes. Wally’s difficult life as a POW in Japan was hard to read also, but some of that shifts as we find out the impact of dropping of the atomic bomb and its effect on the nation. Now, as the war nears its end, Wally has some major life changes as he survives the terrible ordeal he has experienced.Anna has a sweet baby boy and she has to endure the absence of Alex who must remain in Germany as he helps the country heal. That is not an easy task as so much devastation has destroyed cities and the trauma that has left German citizens utterly poor and desperate. One of the things I like about Hughes’ story is that of the challenges of an LDS family. Not all is perfect and Pres. and Sis. Thomas must struggle to work together, and to deal with everyday problems. So much they deal with is true life. Nothing is sugarcoated in this close family.I love that there is a Book #5 to see the family healing. I can hardly wait to begin it this afternoon…"}, {"userName": "Amanda", "userReviewDate": "Aug 26, 2009", "userURL": "http://www.goodreads.com/user/show/2348819-amanda", "userReview": "I was really impressed with this book. Dean Hughes has a way of weaving intriguing details of history into human stories to remind us that these events didn't just occur, but they impacted people. He obviously has a wonderful observant eye and knack for using the right word or phrase to describe the way people are, how they feel, and what they are experiencing. I feel better able to relate to people because of this book--which is a main reason why I read. From the earlier books, I knew that Hughes was an excellent story teller, but I believe he is more than that. He is able to represent many types of people, what feels like in an accurate way, and he honestly portrays them with faults included. Hughes addresses ideas that are not just important for the period (World War II), but for us today. Many things that were happening then are still impacting us today.Well done! I would reread again."}, {"userName": "Heidi", "userReviewDate": "Jan 05, 2014", "userURL": "http://www.goodreads.com/user/show/2269664-heidi", "userReview": "More like 3.5 stars. In this fourth book some of the familiar characters start doing things which are out of character for them, just to heighten the excitement and adventure. I got the sense that Hughes ran into a dead end with some of his characters and then had to cast them out of their well-earned place of safety into another dangerous situation, just so he could carry their storylines into book 5.I was tempted to just start skipping all the chapters about Bobbi. She's doing fascinating work as a nurse in Pearl Harbor and then on a naval hospital ship, but all she can think about is whether she likes Richard enough to marry him (assuming they both survive the war). Ditto the chapters about Bea and her factory work. Ditto the chapters about Anna endlessly longing for Alex.Once more, Alex's and Wally's stories carried me through. Alex's stories were exciting, Wally's stories were heroic without being preachy."}, {"userName": "Tiffany", "userReviewDate": "Dec 15, 2012", "userURL": "http://www.goodreads.com/user/show/15508923-tiffany", "userReview": "This is my summary of the entire series. I love this series of books. It is a great history of the World War II and how it affected a regular family trying to deal with the changes the war brought. It is LDS historical fiction, so it's about an LDS family living in Salt Lake City during the war. It follows the story of the six children in the family. The four oldest go off to fight the war; Alex in the army, Wally in the Army Air Corps, Bobbi as a nurse in the navy, and Gene in the Marines. It is an amazing read about their experiences all around the world, and their coming together again when the war is over.I learn best through historical fiction, and had a hard time putting these down. I feel like my eyes were opened to what life was like during this time period. By the last book though, I was ready to move onto a new subject."}, {"userName": "Angie", "userReviewDate": "May 12, 2016", "userURL": "http://www.goodreads.com/user/show/2687901-angie", "userReview": "When this book started even grimmer than the book before it, I started to wonder why I was voluntarily putting myself through this—again. But then the war ended and the reunions started happening, and I was like, \"Oh yeah. That's why.\" Wally's story in particular just about makes me explode with happiness, and Alex has some tear-jerky moments too.I loved these books as a teenager, and I'm grateful I've been able to read them again as an adult. As a kid I mostly loved the books for their stories, and I still do now, but I understand certain things a little better. The books mean even more to me now, which doesn't happen often. (I wish my adult re-read of the Work and Glory books had been this positive.) Dean Hughes certainly does this series justice—he was the right guy to tell this story."}, {"userName": "Julia", "userReviewDate": "Jan 23, 2011", "userURL": "http://www.goodreads.com/user/show/1235091-julia", "userReview": "This was far better than Far From Home. The beginning was a little slow for me, but it gradually got better & better as I kept reading. I was especially touched by the ending. As soon as Wally & all of the other POWs came into San Francisco & caught sight of the Golden Gate Bridge I couldn't hold back the tears. I cried even more when I read about the huge blimp that had the words, \"Welcome Home POWs!\" on the side of it. I really wish this book had been more about Wally, but I understand why Dean couldn't have done it, because no one will ever really understand what those POWs went through when they had been captured by the Japanese at this time. I couldn't agree more with what all of the women were shouting when the POWs came into San Francisco: \"You're all heroes!\" VERY great read. :)"}, {"userName": "Jaclyn", "userReviewDate": "Aug 03, 2011", "userURL": "http://www.goodreads.com/user/show/1923838-jaclyn", "userReview": "I admit, I cried at the end when the war finally ended. Parts were extremely touching and there are story lines I'm interested in seeing concluded. However, I'm getting quite worn out by this never-ending series. I have had to force myself through the last couple books and I am still really perturbed by the author's portrayal of President Thomas (cliche! cliche!). I probably wouldn't read the last book in the series except for that I need to see Peter, Alex, and Wally all brought home to their families....I seriously doubt I will be reading Hughes second series. I've enjoyed the historical perspective and the information I've learned regarding WWII. But his characters are too trite and his speed too stagnant for me to want to continue."}, {"userName": "Katie", "userReviewDate": "Mar 28, 2012", "userURL": "http://www.goodreads.com/user/show/8095111-katie", "userReview": "The Children of the Promise books are amazing, inspiring and faith building. I recommend them to anyone that loves a story about war and love, but also a story about faith and family. Also, if you love reading about World War II, like I do, this is a book for you! It is fiction, the stories of the children that you follow are not real but the actual events happening were real. The author did a lot of research and work to make these books so interesting and gripping. I can't tell you how many times I have had to put these books down because I was crying and felt so touched by the story. They are really amazing books, I highly recommend them!"}, {"userName": "Linda Brough", "userReviewDate": "Feb 26, 2013", "userURL": "http://www.goodreads.com/user/show/2937673-linda-brough", "userReview": "This is the 4th book in the series. I think that this book kept my interest more than the others. There were more personal experiences and not so much war battles. I do like historical fiction and this book gives a little insight to what the world was like after WWII. There was destruction and sadness and loss in so many countries that I can imagine how difficult it was to look ahead and see hope and have the faith to continue on when life was so hard despite the end to the battles. No wonder the greatest generation exists. They lived through some very tough times. I have one more book to read to finish up this story and I am starting it today."}, {"userName": "Nancy", "userReviewDate": "Aug 29, 2011", "userURL": "http://www.goodreads.com/user/show/6147556-nancy", "userReview": "This book in the series of Children of the Promise, is about the Thomas family, who are LDS. World War II ends, and the family learns that Wally is alive, and coming home. He has been in a Japanesse prisoner of war camp. Alex is staying behind in Germany to help find German war criminals. He is also trying to locate his brother-in-law. He sends his father-in-law out of Germany to be with Alexs mother-n-law, and his wife, Anna, and their son. He has asked his father-in-law to bless his son, and give him the name of Eugene, after his younger brother, who was killed in the war. I have enjoyed this serise very much."}, {"userName": "Jessica", "userReviewDate": "Oct 01, 2008", "userURL": "http://www.goodreads.com/user/show/1522824-jessica", "userReview": "This is book 4 of 5 in the \"Children of the Promise\" series. The author did a fabulous job researching the era in which his stories are set, and his writing style is gripping!This is a fabulous series of historical fiction - I highly recommend reading them! But don't start reading them unless you have a few days to dedicate. I own all the books and would be happy to loan them to any friends who live close enough. From the back cover: \"Set during World War II, Children of the Promise is an epic series that will take you from the battlefronts of Germany and Japan to the home front, where an ordinary LDS family struggles to survive both physically and spiritually.\""}, {"userName": "Barbara", "userReviewDate": "Apr 14, 2008", "userURL": "http://www.goodreads.com/user/show/747170-barbara", "userReview": "This is my favorite of the Children of the Promise series. I love all of the characters, and I've learned even more about World War II. I read a part of the book and think it is as good as it gets, and I want it to keep on going, but then the next part is more exciting, and even better. I love the Thomas family, and love reading more about them. Volume 4, When We Meet Again is a great book, and I couldn't put it down! I especially liked reading about Wally, who was in a Japanese POW camp. But then again, I liked it all!"}, {"userName": "Christina", "userReviewDate": "Nov 01, 2008", "userURL": "http://www.goodreads.com/user/show/334273-christina", "userReview": "LaRue is beginning to realize she doesn't like who she has become. Wally is struggling as a POW, then the camp is liberated. Even though the war has ended, Alex is asked to remain in Germany to help. Bobbie and Richard are engaged, and Peter is alive but cannot find his family.The entire series is well researched and in depth. He does a good job of placing characters in many of the important events of the war (sometimes he's even a little too obvious about it). The characters are multi-faceted and develop well as the series goes on."}, {"userName": "Marie", "userReviewDate": "Feb 07, 2010", "userURL": "http://www.goodreads.com/user/show/1562106-marie", "userReview": "This is another in this series I love, and it has been the best yet. It was hard to put down, it was so riveting. Perhaps it was because he is a good writer, which he is; perhaps it was because the ship in the Pacific was at Iwa Jima, as my own dad's ship was; perhaps it was because this long, hard world war was coming to an end. Whatever the reason, I was glued. I think I should probably keep it around for those self-pity times I might start to engage in, and remember how extremely hard people had it/how much suffering happened all over the world during and after WWII."}], "description": "The Thomas family members face ongoing challenges in the dark years at the close of WW2. Alex's values are tested as he works to complete an intelligence assignment in Germany while wondering if he'll ever see his beloved Anna and their son again. Wally struggles to survive the torture he endures as a POW, and Bobbi has to make a difficult choice between the men in her life. Back home in Utah, LaRue and her father, President Alexander Thomas, have drawn their own battle lines.", "title": "When We Meet Again\n      \n          (Children of the Promise #4)", "url": "https://www.goodreads.com/book/show/1207895.When_We_Meet_Again", "average": 4.31, "cover": "https://images.gr-assets.com/books/1388427103l/1207895.jpg", "reviews": 178, "authors": [{"url": "https://www.goodreads.com/author/show/6421982.Dean_Hughes", "name": "Dean Hughes"}], "type": ["Historical", "Lds", "Christianity", "Fiction", "Religion"], "outlinks": ["http://www.goodreads.com/book/show/1207895.When_We_Meet_Again", "http://www.goodreads.com/book/show/571508.Rumors_of_War", "http://www.goodreads.com/book/show/571512.Since_You_Went_Away", "http://www.goodreads.com/book/show/1238338.As_Long_As_I_Have_You", "http://www.goodreads.com/book/show/433160.Far_From_Home", "http://www.goodreads.com/book/show/1238339.The_Writing_on_the_Wall", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/26583370-life-and-other-near-death-experiences", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/20552595-how-i-became-a-famous-novelist", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/36004055-not-perfect"]}