{"ratings": 7645, "userreviews": [{"userName": "Jacqueline", "userReviewDate": "Jun 17, 2014", "userURL": "http://www.goodreads.com/user/show/2999717-jacqueline", "userReview": "[ Seriously? she gets kidnapped because her entire protection team, including the hot shot operator who loves her, leaves her alone in her hotel room and waits for her in the lobby? Seriously? Seriously?  (hide spoiler)]"}, {"userName": "Tigmode Sandvigen", "userReviewDate": "Jun 25, 2014", "userURL": "http://www.goodreads.com/user/show/1233118-tigmode-sandvigen", "userReview": "I loved KGI books and was staggeringly disappointed by the previous book, After The Storm, where I felt like I'd been waiting for Van' story for so long and then it was just a horrendous letdown.When Day Breaks was only marginally better in that it was not as bad as ATS. Faint praise indeed. I get lust at first sight. I get crazy sparks and physical chemistry. I get those things, but I don't get spending 10 minutes with a group of people, taking a nap and waking up having decided somebody is THE ONE.I know Maya Banks had some serious health issues this past year but I'd have rather waited for 2 good books in an otherwise compelling series than what we got in Swanny and Van's stories.Is she cranking out too much, too many too close together in all her writing? I don't know and I can't say, but if this is what we have to look forward to in Joe and Rusty's stories, I'd rather they stay unwritten and that we skip Hancock altogether."}, {"userName": "'Q' aka CoCo", "userReviewDate": "Mar 17, 2014", "userURL": "http://www.goodreads.com/user/show/28917847-q-aka-coco", "userReview": "When did KGI turn into girls?I used to love this series. Ms. Banks could write an Alpha male with hot sex scenes mixed into crazy special operations mission plots. This? This was an insecure man that had inner dialogue ad nauseam about how he wasn't good enough. The sex was slow, sparse, and agonizingly sweet... and the mission? I get more excited watching my kid's cartoons--no suspense. Even the plot twist was kind of lame. I don't know what happened with this series but I think I'm done. They've really gone downhill."}, {"userName": "[Aengell]", "userReviewDate": "Feb 17, 2014", "userURL": "http://www.goodreads.com/user/show/7221205-aengell", "userReview": "This one really wasn't mine... Not at all, I'm afraid. I love Maya Banks and her novels, but lately the aspects about her works that I liked once are the ones I don't like at all now. I will make an example of When Day Breaks and list all the things I didn't like. 1. Too Much. The whole scenery was too mushy and too stuffy and too... filled with feelings and unnecessary tears and ... For my tastes it was just over the top. Also there was MUCH, MUCH too much Talking. After the first four chapters I became so bored of the characters always, constantly talking. It was way too much talking and way less showing. Swanny and Eden just talked about how they have the special connection, how they are attracted to each other, how they like each other, how much it was just fate that brought them together. Meh!! Sorry, but they were really constantly talking about things, whereas I would have preferred to see some development in their relationship, some rocks thrown their way. But no. Everyone was constantly talking about how Eden and Swanny are made for each other, not to mention how much they talked about it themselves. The story and the flow of the action suffered a lot from that, the action and crime and mystery became unimportant and faded into the background until the very end. 2. Beauty.Okay, the premise of the story sounded great. Beauty and the Beast themed, hero thinks himself not worthy of the love of the beautiful heroine. Nothing new, but that wouldn't have bothered me if it was put into a fresh package. But no. I love the Beauty and the Beast theme, but this is the first were exactly that \"conflict\" got on my nerves. Swanny was always whinning about the fact that he was oh so ugly and hideous. Really, every other page he talked about the fact that he was so undeserving of Eden, just because she was beautiful! Nothing about \"I'm traumatized by my past and she is innocent\", no. Just \"It still brought him to his knees when he thought about the fact that someone as beautiful as Eden wanted him\". Duh. Really, just duh. Calm down. It's not all about the outer appearance. That really got on my nerves. 3. Eden.Just as often as Edens superiority to Swanny was mentioned, her beauty was mentioned. She was a shallow and uninteresting character. And the poor thing didn't do anything, but she was just perfect. She was constantly described as beautiful on the outside as well on the inside. Beautiful. Innocent. Pure. Nice. Sweet. Nice. Loveable. Caring. Nice. Sweet. Beautiful. You see a pattern? I saw it throughout the whole novel. And it felt more like a campaign fighting discrimination against supermodels. Everyone was sure that Eden worked very hard and had a very hard job and it was ... yes, very hard. I just was annoyed and thought: I don't know whether that was supposed to be an excuse for her not eating normally, but okay. Still, I don't see it as an high priority to make clear that supermodels work hard and do sports to stay fit. Thank you, but no.4. No Story.As in, there really wasn't a remarkable story at all. The Action was there at the beginning and at the end. The 250 or what pages in between? Nothing but the above mentioned things. And why am I so ranting about this novel although I love Maya Banks' writing? Because I was really, really disappointed and I don't know whether to expect Maya Banks as I know her or Maya Banks as I know her NOW, when I read another novel by her. The above mentioned aspects have been there in the last few novels of this series, too, and in another few of her newer works."}, {"userName": "Amy McGlone", "userReviewDate": "Jun 17, 2014", "userURL": "http://www.goodreads.com/user/show/18691972-amy-mcglone", "userReview": "I was rather anxious to read and review this one. I am always hesitant to review someone like The Maya Banks. I mean come on, she's phenomenal, what could a little ole reviewer from Kentucky have to say? Ya know what I mean? So I adore the KGI series (thanks Tonya ;) ). Adore it. It's an addiction. We've got sexy, bad ass, military guys - kickin butt, takin' names, & rescuing the damsel in distress. Who doesn't love that?? I never - EVER - thought I would say this, but... I was disappointed with Swanny's book. With the KGI series, readers have come to expect a couple of things. 1. The aforementioned hot, sexy, military guys (check that off the list) 2. Damsel in distress (check) and finally 3. Kick butt and takin' names (no check here). And yes, I'm fully aware I just repeated myself. There was very little fighting in this book. There was very little interaction from the entire Kelly family. Very little interaction with the brothers. There was also several key characters missing from this book that we generally get an update on in a KGI novel. It was more of a babysitting job than it was a recon mission. I feel as though I was jipped. While the story itself was indeed a great story, it's just not what I have come to expect from the KGI & Maya. Please, I am not discouraging you from reading this story, it is after all a piece of KGI. I am warning you that it's not a typical KGI addition. ~Amy TTP"}, {"userName": "Alli", "userReviewDate": "Jun 26, 2014", "userURL": "http://www.goodreads.com/user/show/10602576-alli", "userReview": "Always loved Banks and her great action books but these last two books have been a waste of time and money. The romance was so poorly developed and so unbelievable that it should have not even been written. If not for the other books in this series, I would swear this book had been written 20 years ago and just recycled here. No action, not even a full paragraph devoted to a bad guy, none of the stuff I actually like about Maya Bank books. If you want to read it just because you read the series, wait until the local library carries it, otherwise you are wasting your money. trust me, not worth it."}, {"userName": "Nicole", "userReviewDate": "Jun 22, 2014", "userURL": "http://www.goodreads.com/user/show/3053000-nicole", "userReview": "I have such a love-hate relationship with this series. The books either blow me away, or leaving MUCH to be desired. While I wasn't as upset with this book as I was with the last, the book felt boring and like it dragged on. The hard hitting suspense and action that was common in the early books was non-existent here. I needed more, all the way around. C-Full review can be found here: http://thebookpushers.com/2014/06/24/..."}, {"userName": "Kelly", "userReviewDate": "Jun 26, 2014", "userURL": "http://www.goodreads.com/user/show/8138873-kelly", "userReview": "I'm sad to say I think I am finished with the KGI series :( When this series started I LOVED it & these were automatic pre-orders for me! The last two books have been huge disappointments for me. The insta-love in this story did not ring true at all. I could have seen if maybe Swanny explained that her letters and pictures are what got him through being held captive??? Then she came on sooooooo strong (for really no reason)& turned out to be a virgin, COME ON!! I have to say that was it for me...that is when I quit reading it. I don't even feel like this is the same series I was reading or the same author? I was sticking this series out because I so wanted Rusty's story but I don't know maybe when hers comes out I'll give Maya Banks another shot, as for now I am done."}, {"userName": "Audrey", "userReviewDate": "Jan 03, 2014", "userURL": "http://www.goodreads.com/user/show/22848899-audrey", "userReview": "Well.I hoped that KGI could get better after After the Storm. I was mistaken.This book is extremely repetitive and boring. It's actually horrible.Let's start with the cons first, shall we?Cons:I understand that the author wants to catch up readers on characters of other books in the series, but it would be nice if she spent half as much time on developing the plot of this book as she did on rehashing old ones. To make it worse, she repeats the same phrases over and over to describe events, others characters. It's seriously like phrases are copied and pasted into the next book. That's not good writing. It's laziness.Ms. Banks also repeated several phrases about the characters that made me want to scream outloud Yes I know that!! Mrs Kelly is the matriarch of the family she is wonderful, bla bla bla bla.If I had to read about Eden's beauty or inspiring sunshine in others again I would want to hurl more. I got it. She's beautiful, she's a bottle of sunshine, all warmth and rainbows. No need to repeat that over and over. Or the fact that she is apologizing each 2 lignes to Swanny to being to forward! seriously. And it goes on and on and on with Swanny and his scars and him not being good enough. Well there is the thing when a man said is not good enough it's probably true... The characters were pretty bad too. I'm sorry, but as much as I wanted to like Swanny, I found that I couldn't. His is boring. His insecurities about his scars are grounded in reality but his shame about his face and self-consciousness didn't mesh well with his pride for them. At one point, he said they serve as a reminder that he survived something terrible and one would think that this would allow him to be able to cope better. But no, it doesn't obviously. And I was very confused because he said he wasn't vain enough to consider plastic surgery, but was ashamed of the scars the entire book and the last book too when he was introduced. It was like a never-ending circle of him not believing someone as \"beautiful\" as Eden should be with him because he's \"hideous\". a bit of a spoil: but another character needed plastic surgery and he didn't think it was vain then. If you can support plastic surgery for others, why not for yourself, especially if you're so hurt by people's reactions to you. I'm sorry to say, I got tired of hearing him harp about the scars, and not doing anything about them if it so huge a burden. I was so tired (again) of reading his disbelief that Eden could want him out of everyone else in the world. He didn't seem to have a personality. He was just this really self-conscious guy who fell in love (in few hours; the exact time the plane has to make to go to Eden location) with a beautiful woman. And he's quiet, really quiet. Apparently. (and it's sarcasm)Eden. Oh god sweet Dear Eden. I disliked Eden's character because she's not a real person. At least Swanny had flaws that made him human. But nope, not Eden. Eden is perfect. She is beautiful, she could protect herself (or so I was told because what happened near the end didn't inspire me to believe that), she's sweet, caring, angelic, lovely, virginal, etc... Where are her flaws? What can we use to relate to her as a person, because we all have flaws. Even in a moment where she was perfectly justified to be angry and cranky, Banks portrayed her as being understanding and forgiving which didn't make any sense. And it was all to give her a personality that's different from the stereotypical view of models as cranky, snobby women. So in order to have Eden not stereotyped, Banks made her a saint. And I can't buy that. No one is that perfect. I also didn't like that Eden's father and brothers treated her like a child instead of an adult woman. They made important choices for her and instead of taking a stand against this, she blindly accepted it. It's ridiculous. Utterly ridiculous. I had a hard time believing that Eden was an independent adult of 24 and not a child. Her sexual innocence, her deference to her father and her brothers had me doubting her age. She is like a porcelain doll. People can tell her anything in a wrong way, she'll comply with a stupid huge smile on her face because she is so sweet and so nice. Seriously again.The plot was bleeeeeh, have seen better obviously. It actually wasn't completely horrible, but it was not horrific either.I find that since many books now, KGI is a shell. With a nice good philantropic family (apparently) but that's it, how is it runned and successful: I can't explain, (thank you fiction), because they do so bad job, I don't understand why no people in their teams are not kill in each book now. They screwed up all the time. And this in collecting info, verifying info... and they are military! wow.Even Hancock who made an appearance in this one, goofed up too because he didn't bother to find out information either, he just acted. His character has been introduced as a highly trained man but also erased from the file of the usa military, and the guy do what he did. well no sorry I don't bought it and even I didn't want because it doesn't look like this character. I shook my head at that part because he ripped into Steele for doing that and then two books later did the exact same thing. Even in the beginning, the incident that spurred the whole plot was poor. Does reconnaissance not exist in this fictional world or what? It didn't make sense to me. There's not a lot of action that moves the plot forward either. There's a lot of sitting around and waiting in this one, which made it boring. Joe called the mission a babysitting job, and honestly, it was the most accurate statement in the whole book. They babysat her and then even then, didn't do it properly.The romance between Eden and Swanny wasn't believable either. While they were instantly attracted to each other, there weren't really any conversations between them that made me believe they truly loved one another by the end. Swanny was in awe of her beauty and ability to \"love\", I will choose to set an interest on him, even with his scars and Eden was drawn to some quality about him that I didn't quite catch. Since most of their conversations consisted of him telling her he wasn't good enough for her and her calling him beautiful to prove to him otherwise or apologizing to being to forward, I don't quite understand how they fell in love.Another point that irritated me was all of the inner thoughts of Swanny and Eden. Since they were the same thoughts repeated over and over, I didn't particularly care to read them more than once. And while I should have found it cute that they didn't know how to talk to one another, at the same time, I found it ridiculous. I kept thinking to myself, just tell her/him. What's the big deal?We have a short too short introduction of the new babies. It's badly done for me. We can see again Donovan, and seriously since after the storm I cannot see Donovan as other thing than a creepy guy. Not what this character deserved..........ProsUm, well, although Hancock's behavior was jarringly different than the previous Hancock we've seen, it was nice to see him in a different light. I like his character and I hope to see him again but I hope his tough personality isn't dismantled the way Steele's was.In this book we delve into Skyler and Edge's characters. We found out some information about Edge's background and Skyler was fleshed out. She seems nice and I honestly saw more chemistry between her and Swanny than I did between Swanny and Eden..........For the endI was hoping and, this since a long time now, to read a book like the firsts ones of KGI, but it still no happened. This book was so bad to me. I'm so disappointed. I sincerely hope Ms. Banks returns to her earlier formula for this series but changes her language, and remove her pink care bear glasses. Even her love declarations are starting to sound repetitive boring and withour flavor.I know Mrs Banks said she doesn't read reviews, but maybe she should start..."}, {"userName": "CC", "userReviewDate": "Jan 14, 2014", "userURL": "http://www.goodreads.com/user/show/25476191-cc", "userReview": "First I am a fan of the KGI series and have enjoyed those I have read. I missed the last couple because they are not yet in the library on audio so I skipped ahead.This might possibly be the WORST written book ever! Maya Banks could not have written this book. I have read tons of her books and I have never thought it was poorly written. I really hope this was a ghost writer or an editor who was subsequently fired. ok on to the book.I listened via Overdrive. Must the narrator make Swanny sound like a hick from the sticks? It was so annoying.The beauty and the beast storyline usually works for me. But not when the Hero spends 75% of the book inside his own head bemoaning his ugliness I just wanted to scream. Eden is too perfect, Swanny is a freakin Moron. Totally lovesick over her perfect looks. What a freakin hypocrite!ok - so why was this book so terrible? Well I think there were probably 10 novel lines/paragraphs in the entire story and they were just copy and pasted everywhere. If you were told anything once, you were told at least 50 times. No joke. Small details - Swanny is huge - to past set ups - KGI meets their wives on the job - are told, retold, told again, and again and again and again and then about 100 more times. And each time they are told like you have never heard the detail before. I guess the author thinks her readers have gotten so stupid we cannot remember a detail given to us only a few pages before. If I had no life I would sit and count the number of times certain sentences showed up just to prove my point. But lucky for me I do have a life.The other really horrible and annoying issue was that most of the book was spent inside Swanny's head. I hate this style. Pair that with him continually telling HIMSELF all of the above facts and recollections and I wondered about his sanity.No OW/OM drama. Safe read."}, {"userName": "Auntee", "userReviewDate": "Dec 30, 2013", "userURL": "http://www.goodreads.com/user/show/886675-auntee", "userReview": "Hmmm, that doesn't look like Swanny...Ahhhh....just okay for me. Really there was not much too it. Swanny falls in love with a supermodel who is not only beautiful on the outside, but is perfect on the inside. And she falls in love with him. Actually, she makes the first move. But why? Swanny is horribly scarred--she deserves so much better than him (this is Swanny's inner monologue repeated over and over...). This got to be so annoying...Anyhow, Eden has a baddie gunning for her (this is tied to her father's past) so Swanny and his team are hired to protect her while she does this important ad campaign. Of course the KGI team leaves he alone for just a few minutes( like they usually do when they're protecting someone) and Eden may end up with an experience similar to Swanny's!That's about it. A lot of \"I don't deserve someone as wonderful as her\" from Swanny and \"I'm not good enough for her\" thoughts that got to be a bit ...boring. I think this story could've been a novella--and it may have worked better that way. There just seemed to be an awful lot of filler. I was hoping for a better story for Swanny, not this Beauty and the Beast theme.Oh well, maybe this series has run its course. Please marrying off Joe soon! 3 stars (less)"}, {"userName": "Libby", "userReviewDate": "May 16, 2014", "userURL": "http://www.goodreads.com/user/show/31449394-libby", "userReview": "I tried, I really did, but I just couldn't finish this. It was tooooooo boring. I kept thinking I should read just a bit more, because something (anything!) interesting must be about to happen, but it Just. Never. Did.Basically, it went like this: Man with a facial scar meets pretty woman. He worries she won't like him because she's physically 'perfect' and he is not. She says she does want him. And repeat. Again. And again. And again. Are they ever going to move on from this endlessly tedious rut? Frankly, it got to the point where I just didn't give a shit any more. Once I started to feel like pitching my e-reader across the room, I knew it was time to throw in the towel on this one.The 'love' story also had a very unrealistic and rather bizarre timescale. The protagonists had only spent about 5 minutes together before she was throwing herself at him in a, frankly quite unhinged, way. I would have run a mile to get away from someone like that. The characters were undeveloped and I didn't understand at all what they saw in a each other. Strange.I enjoyed the earlier books in this series, but I get the impression that the author was either in a huge rush or has simply lost interest in KGI. The book felt slapped together, incredibly repetitive and just, well...dull."}, {"userName": "Jessica's Totally Over The Top Book Obsession", "userReviewDate": "Sep 17, 2014", "userURL": "http://www.goodreads.com/user/show/28967089-jessica-s-totally-over-the-top-book-obsession", "userReview": "Very cute and Very sweet......"}, {"userName": " ~V~", "userReviewDate": "Feb 13, 2014", "userURL": "http://www.goodreads.com/user/show/3284461-v", "userReview": "When Day Breaks is book 9 in Maya Banks KGI series and features Daryl Swanson or “Swanny” as he’s known by his teammates, as the hero. We were first introduced to Swanny in Whispers in the Dark, book 4. He was Nathan Kelly’s Army teammate, they were both captured in Afghanistan and tortured but escaped with the help of Nathan’s now wife, Shea. They both came away with internal and external scars, but Nathan now has Shea to help him deal with his, sadly Swanny is on his own and leading a pretty solitary existence aside from his job, his main and only focus is his team and family with KGI. Ryker, a fellow Army buddy, ends up calling in a favor from Joe Kelly (Nathan’s twin and fellow team leader) and KGI…his sister, Eden Sinclair, a famous model, is in trouble and he needs their help to protect her.This is one of my favorite romantic suspense series, Maya Banks knows how to blend in just the right amount of romance and suspense…never having one overpower the other. Book 8, After the Storm, unfortunately lacked the romantic chemistry that has been such a big part of past books…even the suspense was a bit lacking but this book definitely felt more on par with the others. I loved that Swanny “knew” about Eden from when he and her brother were serving together..how Ryker would share her letters and pictures with all the teammates while they were freezing their butts off in the Afghani mountains. It made his crush on Eden all the more realistic and sweet! When Eden first lays eyes on Swanny, she’s immediately drawn to him and sees past the physical scars that seem to horrify others. That definitely endeared me to her, she wasn’t some superficial model who was all about the looks…she genuinely cared about others and her attraction to Swanny felt real.It was heartbreaking to see such a big tough guy question why a beautiful woman like Eden would want someone as damaged and scarred as he was but she was a tough cookie and finally knocked some sense into him. As is common with a lot of romances, they are pretty quick with their declarations of love but it didn’t seem to bother me quite as much as it has with other books. It could be because of the fact that they knew of each other from years back, because of their connection with her brother, or it could just be that I felt that their attraction and connection was genuine and real. The suspense/action was a little more fast paced this time around and focused solely on Swanny’s team. Although Joe and Nathan Kelly are the team leaders and had some page time, I did miss the involvement of the other Kelly brothers and family, but it was fun getting to know the newest members. Skyler is the only female operative on their team, she’s kick*ss and a riot and Edge is another bad*ss alpha male who fits in so well that it seems like he’s been part of this group from day one! The camaraderie that is shared between this team and every other member of KGI is fantastic and is another reason this series is a fav!I would say that the only negative, which is something that I also noticed in the last book, is that the characters have a tendency to repeat their thoughts many times…a few things became quite repetitive, it gets old hearing the same thing over and over. Regardless of that, this book was still quite enjoyable and one I would recommend! I’m sure it could be read as a stand alone, anything that was mentioned from past books was explained pretty well so the reader shouldn’t feel lost and the plot line is self contained, but I would highly recommend reading this series from the beginning. The earlier books, which are focused more so on the Kelly clan, really are the best of the bunch and shouldn’t be missed!**I received a copy of this book from the publisher via The Blogger Girls in return for a fair and honest review.http://thebloggergirls.com/2014/06/13..."}, {"userName": "Bj", "userReviewDate": "Oct 16, 2014", "userURL": "http://www.goodreads.com/user/show/27341466-bj", "userReview": "*I gave this audiobook a C for the story and A- for the narration at AudioGals. Narrator: Adam PaulSometimes you go into a listen with certain expectations. In the case of When Day Breaks, I was expecting a hardcore, suspenseful listen with, given many of Maya Banks’ prior works, a racier edge to the passion side. Unfortunately, when I discovered that I actually had something completely different, I was just never able to really warm up to what turned out to be more of a sweet romance bearing a slight resemblance to Beauty and the Beast with some light action and suspenseful scenes tying it all together. The one aspect of this audiobook that did leave me greatly impressed was the narration. This was my first experience with Adam Paul, and I will surely be looking for more of his works in the future. See the full review at AudioGals."}, {"userName": "Elizabeth", "userReviewDate": "May 23, 2014", "userURL": "http://www.goodreads.com/user/show/4086440-elizabeth", "userReview": "***********************SPOILER ALERT*********************************I’ve had a difficult time writing this review so I’m just going to list what I liked, what I didn’t like and then my overall thoughts on the book.What I liked:**I liked the introduction of Eden’s father and brothers into the series. I would like to see them all in future books.**I liked Swanny finally getting his happily ever after**I also liked reading about the secondary characters and learning more about Skylar and Edge, the two new members of Nathan and Joe’s teamWhat I didn’t like:**Swanny’s (and Eden’s) internal monologue. What will turn me off a book most is the extreme amount of internal talking the main character(s) do in between dialogue. This happened several times in the book and I probably skipped about 40% of the story because of it. During one instance, I counted five pages in between someone asking the hero a question and him speaking again. Five pages. **Less than twenty-four hours pass after Swanny and Eden meet and he puts her hand on his junk. I understand there was an instant attraction and Eden is coming on to Swanny like a dog in heat, but I mean give me a break. Eden’s life is at risk, and she is groping her bodyguard and asking him to share her hotel suite with her instead of the female member of the team. *sigh***Eden is throwing every kind of game she has at Swanny to get him in her bed and when he’s there, she confesses she’s a virgin. And Swanny says, “Sure, your life’s in danger and you’re working the most important modeling job of your career but I’ll take your virginity no problem since we’ve known each other forty-eight hours.” Ugh!I really wanted to like this book, I really did but I felt that the author didn’t let the story develop naturally. I wish we could have had more dialogue, especially since there are so many other characters in the story. We did get a little misdirection in the mystery/suspense part of the book but overall I felt dissatisfied. I really tried to keep an open mind, especially when I had so many issues with the last book in the series, but I just couldn’t enjoy the story. I will continue to follow the series because I love the characters; I just wish I didn’t have to weed through the filler elements to get to the actual dialogue.***I was gifted an eBook copy from the publisher via Net Galley in exchange for an honest review. All conclusions reached are my own***"}, {"userName": "Auntee", "userReviewDate": "Dec 30, 2013", "userURL": "http://www.goodreads.com/user/show/886675-auntee", "userReview": "Ahhhh....just okay for me. Really there was not much too it. Swanny falls in love with a supermodel who is not only beautiful on the outside, but is perfect on the inside. And she falls in love with him. Actually, she makes the first move. But why? Swanny is horribly scarred--she deserves so much better than him (this is Swanny's inner monologue repeated over and over...). This got to be so annoying...Anyhow, Eden has a baddie gunning for her (this is tied to her father's past) so Swanny and his team are hired to protect her while she does this important ad campaign. Of course the KGI team leaves he alone for just a few minutes( like they usually do when they're protecting someone) and Eden may end up with an experience similar to Swanny's!That's about it. A lot of \"I don't deserve someone as wonderful as her\" from Swanny and \"I'm not good enough for her\" thoughts that got to be a bit ...boring. I think this story could've been a novella--and it may have worked better that way. There just seemed to be an awful lot of filler. I was hoping for a better story for Swanny, not this Beauty and the Beast theme.Oh well, maybe this series has run its course. Please marrying off Joe soon! 3 stars"}, {"userName": "Keri", "userReviewDate": "Nov 20, 2013", "userURL": "http://www.goodreads.com/user/show/2335749-keri", "userReview": "Ok where to start?? This isn't actually a review, as much as inner ramblings. So I liked Swanny in the other books, but here?? Not so much. I had to go to the dentist to take care of some cavities that formed while reading (skimming) this book and I had to check my sugar levels, because it was soooo sticky sweet. I tried to do the drinking game every time Swanny thought he wasn't good enough for Eden, I passed out the 2nd page after they met. Then we have Hancock, he comes in and says he slaughtered the wrong guy...and innocent man and he is like welp!!! We will just have to live with that for the rest of our lives..show of hands on who wants to go kill the cra-cray sister??? That doesn't scream hero material to me, that screams let's strap you down and give you a lethal injection!! Then we are back to Swanny who just gave Eden necklace and swore he would never keep anything from her, but somehow forgets that he has put a tracker in the necklace??? But doesn't remember for several hours after her kidnapping and she is being cut up then you remember??? Really??? So we are headed for the HEA and I learned my lesson with the drinking game, now I will eat mini marshmallows every time Swanni thinks Eden is perfect or he isn't good enough. So now on top of going to AA, I now have to go back to the dentist and take care of more cavities and go to Weight Watchers...great!! I still not even sure what Swanni looked like other than he had a scar and was tall. PS to my friends, I wasn't making fun of anybody struggling with alcohol or their weight, taking insulin or challenged with dental hygiene or currently on death row. Promise. I was just making the point that I am pretty sure I am done with this series."}, {"userName": "♥Rachel♥", "userReviewDate": "May 03, 2014", "userURL": "http://www.goodreads.com/user/show/5481477-rachel", "userReview": "3.5 StarsEden is a supermodel whose beautiful face has graced countless magazine covers. But her life is about to be turned upside down when an attempt is made on her life which throws her into the protective arms of Swanny, and his teammates at KGI. Swanny remembers Eden’s pictures and sweet, thoughtful letters her brother shared during their time in the military while stationed in Afghanistan. The thought of Eden in danger brings all of his protective instincts to life. When his team is sent in to guard her, Swanny takes point in the assignment even though he’s not technically the leader. He just can’t help it. Right away Eden zeroes in on him just as he’s focused on her, but he can’t fathom why. He knows the facial scar he gained while held captive brings out pity in others, sometimes even disgust, so what could Eden, one of the most beautiful women in the world want with him?This story is one of instant chemistry and attraction. Both Swanny and Eden felt an immediate magnetic pull between them, but both are plagued by insecurities and doubt. Both wonder if the other feels as strongly and as deeply, but that doesn’t hold them apart for long. I truly felt for Swanny, who felt like Beast to Eden’s Beauty:“What could I possibly have to offer you? I feel like we’re caught up in a modern Beauty and the Beast situation. I’m not handsome. Most would consider me ugly. I’m scarred not just on my face but on my entire body. How could you want someone like me?”He went through unimaginable horrors in Afghanistan while held captive, and so it’s not only scarred him physically, but emotionally as well. Eden doesn’t see any of the scars when she looks at Swanny. She sees a completely sexy, honorable man. Eden is just as insecure with Swanny wondering if he thinks of her only as a superficial beauty. But Swanny sees Eden’s beauty inside and out.I really enjoyed this story and Eden and Swanny had lots of chemistry leading to some pretty hot scenes. This was an insta-love/lust situation and it didn’t bother me, because I get that. There are times I’ve met someone, and had an instant, strong connection, and just clicked, so I can totally relate. The only drawback for me with this story was the repetitive inner thoughts from both characters. Even so I wouldn’t mind continuing with this series because I do adore romantic suspense. A copy was provided by Penguin in exchange for an honest review."}, {"userName": "Drea", "userReviewDate": "Jun 25, 2014", "userURL": "http://www.goodreads.com/user/show/31693597-drea", "userReview": "Not what I was expectingI have read this series since the beginning, and have anticipated each new release. To me, the last good book in the series was Shades of Gray. This one was too repetitive. If you never read a book in the series before you really wouldn't need to after reading this one. I was so tired of reading the same thing over and over! Also, I like a good balance of action and romance, and this one was a bit too heavy on the romance for my taste. I was bored and found myself skipping pages- not a good sign. If you've never read a book in this series DO NOT start with this one. It may turn you away from some really good books."}, {"userName": "Lynne", "userReviewDate": "Jan 28, 2014", "userURL": "http://www.goodreads.com/user/show/26433444-lynne", "userReview": "I was hoping for either Joe's story or Sean & Rusty"}, {"userName": "Susan", "userReviewDate": "Jun 29, 2014", "userURL": "http://www.goodreads.com/user/show/19258602-susan", "userReview": "Seriously? What happened? There is more teen angst in this book than in all of the Twilight books."}, {"userName": "Luzie", "userReviewDate": "Jun 03, 2017", "userURL": "http://www.goodreads.com/user/show/42006839-luzie", "userReview": "4,5/5 stars"}, {"userName": "Mateja", "userReviewDate": "Nov 30, 2013", "userURL": "http://www.goodreads.com/user/show/2655289-mateja", "userReview": "3.5 starsI am a big fan of this series. It's the perfect mix of suspense and nonstop action with a strong emphasis on family loyalty and unconditional love. But I was sad to see that it was mostly loyalty to the beloved characters that kept me reading this time. Every once in a while a book from this series comes out that deviates strongly from what I think is the perfect recipe for a romantic suspense novel. As is the case with When Day Breaks. It lacked action and sadly the strong \"family feel\" that this series is known for. But what little there was of it, especially the Kelly brothers' presence, I thoroughly enjoyed. I really liked Swanny. I think his struggle with being terribly scarred (inside and out) was portrayed really well and I liked that the author decided to pair him with a stunningly beautiful woman, just to show that outside beuty isn't all that matters in the world and in love. But I didn't like Eden, the main female character all that much (I just had to look up what her name is in the book's description) and the way other people reacted to her. I feel like the majority of this book was a morality lesson on not judging people based on some preconceived notions of what kind of people models really are and realizing their work was hard and includes a lot of sacrificing. I didn't mind the message of it, but I did find it be quite tedious to read about constantly.So this one was a disappointment, but it is the ninth book in the series and for every less than stellar book two are released that are absolutely phenomenal, so I've made peace with it."}, {"userName": "Mary Catherine", "userReviewDate": "Jul 21, 2014", "userURL": "http://www.goodreads.com/user/show/4744343-mary-catherine", "userReview": "What's happened to the KGI series? In a series that was once action-packed and sexy, I find myself now wading through a flowery (!!) romance of simpering men and \"perfect\" women. I didn't find strength in any of the characters, least of all Swanny, who had been depicted in previous books as broody but dangerous. Eden felt like a one-dimensional character meant to change readers' opinions of supermodels. Together, their romance felt instant and was not fleshed out at all. What I loved so much in other books in this series was also the inner turmoils of the characters, yet everything in this particular relationship was physical. Using the \"Beauty and the Beast\" aspect here didn't exactly work for me since Banks only focused on the physical scars and not the mental or psychological scars (touched upon but barely). And where exactly did we get a villain? Hardly mentioned and the \"conflict\" was over and done with in a paragraph or two. I loved the first books in this series, and even some of the later ones that began dividing the readers, but this one was just not for me. I couldn't find a single thing to like. I'm not giving up completely on this series but with the disappointment that had been Donovan's story and now this, my loyalty to KGI is wavering."}, {"userName": "Angie Byrne", "userReviewDate": "Jun 02, 2014", "userURL": "http://www.goodreads.com/user/show/31603740-angie-byrne", "userReview": "Read this in a day as I couldn't put it down, waited a long time to get it. I do have to say that I was a little bored with all the soul searching/ introspection and actually skimmed some paragraphs as the wording in each was practically identical.I love this series and eagerly await each instalment but feel this was weak writing with very little believable plot. I mean, come on, in this day and age who is still a virgin at 24? And Swanny has so many scars, doesn't believe in one night stands but has still had a few lovers in six months? Umm.Definitely not one of my favourites, which is a shame."}, {"userName": "Chitra *CJ*", "userReviewDate": "Sep 01, 2017", "userURL": "http://www.goodreads.com/user/show/46841583-chitra-cj", "userReview": "[ with the doubts Swammy had about her not wanting to be with him for all time and the heroine actually wanting to work for few more years- it was VERY predictible that the heroine was gonna get scarred up in one way or another- and it happens- But Im glad that she gets treated and is able to continue her career  (hide spoiler)]"}, {"userName": "Malinda", "userReviewDate": "Feb 04, 2014", "userURL": "http://www.goodreads.com/user/show/14108764-malinda", "userReview": "3.5-4 starsThis was a pretty good story. I already liked Swanny from previous books and was hoping that he's find someone that would love him past his scars. Eden ended up being a great match for Swanny as she has a big heart and doesn't care about his scars.Eden is a model and considered one of the most beautiful women in the world. She lost her mom years ago but is close to her dad and 2 brothers. Regardless of her job as a model, Eden is very down to earth and a nice woman. She's milking her career while she can, knowing that models have a short shelf life and she needs to work while she's in demand.Swanny used to be a soldier but lost a lot when he was taken as a PoW with Nathan Kelley. They escaped together and returned to the states (in book #4 Whispers in the Dark) but Swanny was left badly scared. Swanny ended up joining the KGI team and has been relatively happy. His main problem is that he believes his scars make him unworthy of a good woman and Swanny doesn't think he can find someone that would be willing to look past his scars.Eden is on a modelling job and is just leaving when there are shots and her bodyguards protect her and get her to safety. She doesn't know what's going on but thinks it's just a random shooting that couldn't possibly be aimed at her. What she doesn't know is that her Dad pissed off some people years ago. They caused her mother's death and now her Dad has received threats against her (just before the shooting). Eden's Dad quickly gets KGI on the job (one of Eden's brothers served with Swanny and Nathan and called them in ASAP) and everyone flies out to where Eden is. Eden is kept in the dark about the exact nature of the threat against her because her Dad is footing the bill and he insisted she shouldn't know. Swanny isn't happy about this but goes along with it. From the first time Swanny and Eden are in a room together, it's obvious that there's a mutual attraction. Eden hasn't felt this kind of attraction to any other man and doesn't care about Swanny's scars so she's very interested in pursuing something with Swanny. Swanny thinks Eden is beautiful and nice but can't seriously think she's want to be with someone like him. He has some image issues due to his scars but I also think it's a bit because of what he went through during his time as a PoW. As KGI starts providing Eden with security on her next modelling job (taking place in Paris), Eden starts trying to get to know Swanny more as soon as the plane leaves the ground. Swanny is cautious and doesn't think she's serious. Eden tries to show him she likes him but isn't sure how to handle his rebuffs. Fortunately, he soon realizes (with a little help from a friend) that she's only going to be open to him for so long and if he continues to rebuff her, she'll give up and he's an idiot to lose his chance. Although he's still unsure of her motives, Swanny decides to take the chance.Things between Eden and Swanny move rather quickly as there's a very strong attraction between them. Swanny is torn between worrying about getting his heart broken and worrying about being too distracted by Eden and not doing his job well enough which could put her in danger. Eden is pretty good about doing what she's asked to and not fighting them on the security precautions and things stay surprisingly calm for a while. This gives the love at first sight between Eden and Swanny to mature between them and solidify so that they both find they'd like more in the future. But they're both a little bad about talking of their feelings and don't get things out in the open as they should (at least not right away). They are rather busy though because while there's no more attacks on Eden, there is plenty to do with her modeling and the full schedule that goes with it. Swanny and Eden try to take as much time together as they can and things continue to deepen between them. Eventually, the bad guy does strike again in a big way and Eden eventually finds out the truth of who's after her. We also find out that Hancock (from previous books) is very close to Eden and her family and Hancock's interference causes some issues which ends up putting Eden in danger. There's much drama and some worrying before things get worked out. Thankfully, everyone comes out alright and Swanny and Eden start their HEA together.This was a pretty enjoyable story. I liked Swanny and was so happy he found a woman to appreciate him. Eden is a good woman and I liked how she was with Swanny and the fact that she never let him believe he wasn't good enough for her. My only real complaint is that there was a point that I felt the action plot didn't get enough attention. It wasn't too bad though and the end certainly had an action packed conclusion. This was a good addition to the series. I'd recommend it. :D* note - I listened to the audio version of this book and the narrator did a very good job."}, {"userName": "Christine", "userReviewDate": "Feb 06, 2015", "userURL": "http://www.goodreads.com/user/show/667272-christine", "userReview": "My first thought after abandoning this book is that maybe it was written for men. Eden was called \"every man's wet dream\" more than once ... and maybe that's exactly what this was intended to be? I mean here we have \"the most beautiful woman in the world\" (according to TIME magazine), who is also beautiful on the inside, a world-famous model, adorable without her makeup, tough, in shape, bold and passionate when it comes to chasing the man she wants, and yet amazingly still a virgin at 24. Oh, and she doesn't just look past a man's disfiguring scar to see the real him inside -- she just *knows* from the first moment she sets eyes on him that he's perfect. I'm not a fan of love at first sight; I usually dismiss it as lust at first sight, but in this case I'm not sure what it was except, perhaps, every man's wet dream. After all the hero is shy, with low self-esteem, and here's the most beautiful woman in the world literally throwing herself at him, all the while understanding him perfectly. I don't understand it at all. Eden was simply too perfect to be remotely likable. Her characterization didn't make much sense. Plus, she and the hero spent endless chapters having essentially the same conversation over and over again about how she really does want him even if he thinks he's not good enough for her. Meanwhile, there's supposed to be someone trying to kill her ... bullets, anyone? That might have helped with the monotony but they weren't flying fast enough."}, {"userName": "Fanny", "userReviewDate": "Apr 09, 2015", "userURL": "http://www.goodreads.com/user/show/23899791-fanny", "userReview": "[ Que fuera virgen a pesar de ser super modelo, que a pesar de ser virgen no fuera para nada insegura, que la autora nos \" obligara \" a creernos que su vida de super modelo fuera dura, etc.  (hide spoiler)]"}], "description": "THE ALL-NEW KGI NOVEL BY NEW YORK TIMES BESTSELING AUTHOR AUTHOR MAYA BANKSThe Kelly Group International (KGI): A super-elite, top secret, family-run business. Qualifications: High intelligence, rock-hard body, military background. Mission: Hostage/kidnap victim recovery. Intelligence gathering. Handling jobs the U.S. government can’t…  Eden is said to be one of the most beautiful women in the world. Her face has graced countless magazines and her body has sold millions of dollars of clothing. But her fame and beauty has earned her more than she ever imagined. Evil is stalking her, determined to extinguish the ethereal beauty forever. Swanson or “Swanny” as his teammates call him is always up for the next mission. He came back from Afghanistan wounded and scarred. Hardly the kind of man who even belongs in the same room with Eden. And yet there’s something about the quiet beauty that stirs his blood and makes him dream of the impossible. Because Beauty loving the Beast only happens in fairy tales and KGI doesn’t deal in fairy tales. Ever.", "title": "When Day Breaks\n      \n          (KGI #9)", "url": "https://www.goodreads.com/book/show/18809304-when-day-breaks", "average": 3.85, "cover": "https://images.gr-assets.com/books/1388134403l/18809304.jpg", "reviews": 670, "authors": [{"url": "https://www.goodreads.com/author/show/24978.Maya_Banks", "name": "Maya Banks"}], "type": ["Romance", "Romance", "War", "Romance", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/18809304-when-day-breaks", "http://www.goodreads.com/book/show/20320869-when-day-breaks", "http://www.goodreads.com/book/show/19486400-when-day-breaks", "http://www.goodreads.com/book/show/16033902-rush", "http://www.goodreads.com/book/show/16033906-fever", "http://www.goodreads.com/book/show/16033909-burn", "http://www.goodreads.com/book/show/9962040-in-bed-with-a-highlander", "http://www.goodreads.com/book/show/1333030.Sweet_Surrender", "http://www.goodreads.com/book/show/28168785-runaway", "http://www.goodreads.com/book/show/35148447-juliet", "http://www.goodreads.com/book/show/35913695-hidden-secrets", "http://www.goodreads.com/book/show/40198274-kiss-me-while-i-sleep", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/35839275-kian", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/26186801-someone-like-you", "http://www.goodreads.com/book/show/18800300-from-thin-air", "http://www.goodreads.com/book/show/18950617-sweet-caroline", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/18800331-to-hope", "http://www.goodreads.com/book/show/33016164-royally-bad", "http://www.goodreads.com/book/show/34609092-royally-ruined", "http://www.goodreads.com/book/show/40193474-the-finishing-touches", "http://www.goodreads.com/book/show/40193549-roses", "http://www.goodreads.com/book/show/19032297-accidentally-in-love-with-a-god", "http://www.goodreads.com/book/show/29231863-splinter", "http://www.goodreads.com/book/show/23622993-claimed", "http://www.goodreads.com/book/show/40243614-just-jilted", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/18800455-the-pms-club", "http://www.goodreads.com/book/show/18800812-gypsy", "http://www.goodreads.com/book/show/35708042-bodyguard", "http://www.goodreads.com/book/show/18800579-willow", "http://www.goodreads.com/book/show/30126159-mosaic", "http://www.goodreads.com/book/show/40389026-summer-island", "http://www.goodreads.com/book/show/12369122-because-of-you", "http://www.goodreads.com/book/show/29373539-the-lullaby-sky", "http://www.goodreads.com/book/show/28441063-secretly-hers", "http://www.goodreads.com/book/show/23271170-tycoon-takedown", "http://www.goodreads.com/book/show/18800411-come-high-water", "http://www.goodreads.com/book/show/33001355-before-i-knew", "http://www.goodreads.com/book/show/40205166-the-paradise-of-glass", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/21425515-once-haunted-twice-shy", "http://www.goodreads.com/book/show/40272947-the-pursuit-of-tamsen-littlejohn", "http://www.goodreads.com/book/show/40193595-the-story-of-beautiful-girl", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/30184217-say-goodbye-for-now", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/18800690-love-is", "http://www.goodreads.com/book/show/26813208-thirty-five-and-a-half-conspiracies", "http://www.goodreads.com/book/show/20489452-thirty-one-and-a-half-regrets", "http://www.goodreads.com/book/show/20687181-thirty-two-and-a-half-complications", "http://www.goodreads.com/book/show/40198652-twenty-eight-and-a-half-wishes", "http://www.goodreads.com/book/show/15836745-twenty-nine-and-a-half-reasons", "http://www.goodreads.com/book/show/36685093-the-unimaginable", "http://www.goodreads.com/book/show/29339972-thirty-six-and-a-half-motives", "http://www.goodreads.com/book/show/23263614-thirty-three-and-a-half-shenanigans", "http://www.goodreads.com/book/show/40199170-thirty-and-a-half-excuses", "http://www.goodreads.com/book/show/24778061-thirty-four-and-a-half-predicaments"]}