{"ratings": 11622, "userreviews": [{"userName": "Jeffrey Keeten", "userReviewDate": "Oct 14, 2016", "userURL": "http://www.goodreads.com/user/show/3427339-jeffrey-keeten", "userReview": "”The white poor have been with us in various guises, as the names they have been given across centuries attest: Waste people. Offscourings. Lubbers. Bogtrotters. Rascals. Rubbish. Squatters. Crackers. Clay-eaters. Tackies. Mudsills. Scalawags. Briar hoppers. Hillbillies. Low-downers. White niggers. Degenerates. White trash. Rednecks. Trailer trash. Swamp people.”My mom was always rather class conscious. I’d make a new friend at school, and the first thing my mother would do was go through my new friend’s family history with me. When I started chasing after girls based more on how long their legs were or how pretty their eyes were, my mother was always quick to inform me if they were really worth my time. She saw every girlfriend as a potential daughter-in-law. I remember with one brown-eyed girl that I thought was the prettiest doe I’d ever seen, my mother informed me in a voice of doom that she was...Catholic. I couldn’t have cared less if she were a Martian. My mother cackled when she found out I was taking a girl from a well-to-do family to prom. She told me that they would never see me as good enough for their daughter. All of this was rather baffling to me. After reading this book, I started to really think about how class conscious my mother was. Of course, when I asked a girl to go to the movies or to go for a ride in my car, I wasn’t thinking of her as my future wife. I was just enjoying her company and plotting how best I could steal a kiss. My family was never what I would call elevated. The differences between us and most other people could be measured in hair breadth differences. We were landowning Protestants, and my mother’s family were also landowning Protestants, so that lifted us up to a rung that gave us a thin demarcation line from those who worked for other people. My mother was never malicious about being class conscious; in fact, she regularly helped anyone who needed it. She was definitely someone who would give a person the shirt off her back, regardless of where they fell in the hierarchy of life, but she wanted her sons to find good wives, and finding one, in her opinion, from a similar position in life would insure a better chance for success. The story of America is the story of the poor. Convict labor, the disadvantaged, and slaves built America. The poor fought our wars. The exemptions for the sons of planters in the South and the ability for those of means in the North to pay someone to take their place in the ranks of soldiers insured that a disproportion of the poor lost their lives for “the cause,” whatever that cause turned out to be. Nancy Isenberg teaches a class on the 400 year history of class in America. As you read this book, your opinion of Benjamin Franklin, Thomas Jefferson, Theodore Roosevelt, Andrew Jackson, and even Pocahontas will alter slightly. Isenberg lifts every rock and reveals some beliefs of people we admire that do not fit the image we have of them. Even though I knew about most of the circumstances she discusses, she illuminates many aspects that I had no idea about. For example, young women were being sent over from England to Virginia in 1620. ”The transportation of female cargo would ‘tye and roote the Planters myndes to Virginia by the bonds of wives and children.’ Sexual satisfaction and heirs to provide for would make slothful men into more productive colonists.”To defray their transportation costs, the men were expected to trade 150 pounds of tobacco for each of these women. Women are cargo. Women have historically always been considered possessions and passed from father to husband to son, but then that is another subject slightly outside the scope of this book. What is of interest to the main subject is that they (the powers that be) perceived poor men as lazy, and the only thing standing between them and success was being more industrious. Of course, most of the success pours upwards; very little of it stays with the sharecropper who is trying so hard to get ahead to experience some version of the American dream. Thank goodness he is at least getting laid now!I was reading a book the other day about a young lieutenant who discovered that his unit being sent to war during WW2 was made up of mostly Southerners, and few of them knew how to read. This was in 1944. When I think of poor white trash, my first vision is of a trailer park in Mississippi, not that disadvantaged whites don’t live everywhere in the United States, but the stereotype still brings to mind a state South of the Mason Dixon line. Getting those states to embrace the idea of education for all and recognizing the benefits of an educated population has always been a struggle. Whenever a politician argues that we need to get rid of Federal guidelines and let the states control the direction of education for their residents...I shudder. Of course, there are advantages to keeping people minimally educated. They are easier to manipulate and exploit.Politicians going back to the 1800s in America realized the importance of convincing poor whites to vote for them. They might even play the fiddle and convort with them for an afternoon before returning to their mansions in the evenings. ”Americans had a taste for what he called a ‘democracy of manners,’ which was not the same as real democracy. He meant that voters accepted huge disparities in wealth but at the same time expected their elected leaders to ‘cultivate the appearance of being no different than the rest of us.’” A man who works on the presses at the company I am part owner of said to me that he was going to vote for Donald Trump because he identified with him more than he did with Hillary Clinton. Similar genitalia? During the hotly contested Bush/Kerry race, most of the people who worked for me voted for Bush because they “liked” him better. He was a guy they would feel comfortable having a beer with. I even had one guy tell me that he liked Bush because he was a “dummy like me.”What the hell? Personally, I prefer people in the White House a helluva lot smarter than me. I understand there really isn’t much separation between the parties these days, but there is separation. It is interesting to me that every 1%er I’ve ever met is a tax expert. They seem to know more about taxes than about the businesses that fuel their livelihood. They certainly know more about taxes than they do about the people whose backs they make a living off of. Interesting enough, Trump’s main support is coming from white people without a college degree. I’m surprised that Trump can even give a speech around that silver spoon, fork, knife, and plate that he was born with filling his mouth. The nugget that has emerged about him that most annoys me is that he hasn’t paid federal income tax for possibly up to two decades. I’ve paid a pile of Federal income tax every year of my life since age 16 and state and local taxes as well. Which leads me into another quote. ”In 2009, the 1 percent paid 5.2 percent of their income in state and local taxes, while the poorest 20 percent paid 10.9 percent. States penalized the poor with impunity.”This is the American dream? I’m in the 28% tax bracket. After deductions, I think I come out somewhere around 17% of my income going for taxes. How can it be possible that I pay a higher % in taxes than the very richest Americans? How can the poorest 20% ever climb up another rung on the ladder if they are paying twice as much as the top 1% in state and local taxes? This is a travesty. I’m hanging on to being middle class by my fingernails, but I have nothing to complain about compared to the poorest 20%. Needless to say, this book will create a lot of discussion among those who read it. The four hundred year history of this country exploiting and discriminating against the poor and manipulating them politically is lurid and made me at times feel queasy. There are some eye opening observations, and the photographs scattered throughout the text help to provide a true visual element to support the research. It made me reevaluate my own place in this universe. I questioned my own preconceived notions about who someone really is. I can only hope that in the process this book has helped shake out the last vestiges of my own brainwashed ideas of class structure. I have an uncontrollable urge to read The Grapes of Wrath. If you wish to see more of my most recent book and movie reviews, visit http://www.jeffreykeeten.comI also have a Facebook blogger page at:https://www.facebook.com/JeffreyKeeten"}, {"userName": "Navidad Thelamour", "userReviewDate": "Sep 15, 2016", "userURL": "http://www.goodreads.com/user/show/50404233-navidad-thelamour", "userReview": "“If this book accomplishes anything it will be to have exposed a number of myths about the American dream, to have disabused readers of the notion that upward mobility is a function of the founders’ ingenious plan…”\nNancy Isenberg’s White Trash: The 400-Year Untold History of Class in America is a tour de force of research and hard-hitting assessments of our country’s attitude toward the “poor” and “shiftless” masses. It delves into the historical inaccuracies and missteps of a nation, our nation, and is a read to be savored and thoughtfully digested.Isenberg commences from the stance that she is addressing the fallacious and glossed-over condition of class relations in the U.S., because many Americans (truly, the world) genuinely believe in America as a classless society of un-threatened upward mobility potential. Firstly, if there is, in fact, someone—anyone—out there who honestly believes that class relations don’t exist front and center in America then 1) you need to run and grab this book (and 10 more just like it immediately, now, on your lunch break even!) and 2) might I ask, “What rock have you been hiding under?”Nancy Isenberg’s survey of American culture from Plymouth Rock to Sarah Palin offers something for everyone. Here she unravels history and popularized tales of John Locke, Benjamin Franklin, Thomas Jefferson and Andrew Jackson, the “cracker” president, and even Pocahontas has her Disney-romanticized “diva” status stripped away and re-examined. Isenberg methodically tackles the rise and fall of the Confederacy, the eugenics craze that swept America for decades (still seen today in the form of modern-day dating websites such as eHarmony and Match.com), “The New Deal,” LBJ’s “Great Society” policies, desegregation and shifts in American culture that led to the rise of modern-day “white trash reality TV.” And while I did feel a bit leaden down with the dozens of pages of historical facts on these former presidents in Part I, when I was more interested in the meat of the argument, the task of setting the foundation for her argument was achieved, and Part II onward flowed seamlessly. Historical documentation, photographs and illustrations also helped to set the scene and illustrate her assertions in a way that was easily digestible.With White Trash, Isenberg demands us to ask ourselves, “What really is the American dream? Does it really exist? And if not, what truly stands in its stead?” These are the questions that you will explore, sometimes overtly and sometimes not. She offers some truly eye-opening observations and threads together the fabric of our American history into a full picture for readers to take a step back from and justly scrutinize. Within these pages, you’ll find humor and biting wit, punchlines that sink deeply into your psyche and assertions that are backed by meticulous research. Isenberg takes a clear and definitive stance in White Trash, writing specifically from a poor-white-centric lens, and honestly, that really appealed to me. Thankfully, she strips away the politically correct, granola pedagogy that we Americans like to think of as good manners and gets straight to the point of her argument: that the idea of American classlessness is a fanciful notion that never truly existed, and that poor whites have always been a significant force at the center of the debate. From the annihilation of Native Americans to the freeing of slaves, from the Great Depression to desegregation, poor whites have always factored in, in some way, to the persistent class struggle at hand. For both those who feel securely aware of the condition of the world around us and for those not as confident in their versing of the historical foundation of the very American soil that we stand on, take a trip down this historical rabbit hole, because here you will find a detailed chronicle to expand upon your current understanding and opinions. You’ll find an analysis that is as ripe with raw insights as it is well-researched. Isenberg takes a blunt stance, a no-nonsense stance, and that always wins the day with me as long as the claims are buoyed in verity. She did that here, and her White Trash gained a strong 4 stars in the process. **** *Thanks again to Viking for reaching out to me and sending me a hardcover copy of this book!The Navi Review | Twitter | Bookstagram"}, {"userName": "Will Byrnes", "userReviewDate": "Mar 09, 2017", "userURL": "http://www.goodreads.com/user/show/1526851-will-byrnes", "userReview": "“All history is the history of class struggle.” Sound familiar? It should. Well, the actual quote from, Karl Marx and Frederick Engels’ Communist Manifesto, is “The history of all hitherto existing society is the history of class struggles.” Doesn’t have quite the same ring, but it gets the job done, however transmogrified it might have been in popular recollection and various translations. And it may or not be the case. Certainly in America one is considered suspect for subscribing to the notion, usually by folks who are better off. But whether class is the be-all and end-all of historical analysis, it would be difficult, and dishonest, to contend that it does not hold, at the very least, a very significant role in human history. It is the history of class in America, and the myths that accompany it, to which Nancy Isenberg has applied her considerable labor and intelligence. She begins at the beginning, the 1500s. Richard Hakluyt a well-known 16th century writer, promoted development of the New World to the English leaders of the time.\n… what Hakluyt foresaw in a colonized America was one giant workhouse. This cannot be emphasized enough. As the “waste firm of America: was settled, it would become a place where the surplus poor, the waste people of England, could be converted into economic assets. The land and the poor could be harvested together, to add to—rather than continue to subtract from—the nation’s wealth. Among the first waves of workers were the convicts, who would be employed at heavy labor, felling trees and burning them for pitch, tar and soap ash; others would dig in the mines for gold, silver, iron, and copper. The convicts were not paid wages. As debt slaves, they were obliged to repay the English commonwealth for their crimes by producing commodities for export. In return they would be kept from a life of crime, avoiding, in Hakluyt’s words, being “miserably hanged,” or packed into prisons to “pitifully pine away” and die.\nLarge numbers of the earliest Europeans to inhabit these shores were not so much the vaunted seekers after freedom of one sort or another that highlight our usual imagery. They were in fact the social detritus that England was looking to offload. Along with the poor, the criminal, and the unconnected, our mother country dropped off their toxic class system. Even in promotion of the New World in the earliest times, it was portrayed as a place where England could throw out the garbage, or at least put society’s waste people to some use during their brief time above the ground.Nancy Isenberg - from PRS Speakers.comIn an addled vision (and altered history) of America, many thought that, for various reasons, the New World was or would be the place where class came to die. You’re kidding me, right? It never was. It is not now, and it never will be. What we have now is less of a class struggle, which implies two opponents, and more of a class massacre. For example, the Republicans propose an ACA replacement that absolutely has to include an extra tax break for CEOs earning more than $500K, while effectively denying coverage to millions and raising costs catastrophically for millions more? Clearly those who have, well those who are of a Republican (Koch-brother-backed) frame of mind and have, seem to think that those of us who do not have shouldn’t. But it has almost always been thus. Isenberg traces the history of class in America, with a specific look at the lower echelons of white America. Slavery, of one sort and another, is never far from the history she describes, but she is not writing about slavery, per se. She traces the persistence and character of class in America, from its English (and presumably Dutch) roots, up to modern times. She looks at the structures that have enforced a lower level of existence on so many in diverse parts of the nation, with particular attention to the English ideal of connection to (meaning ownership of) land, as a core defining measure of one’s civic virtue. Only those with land were considered worthy of voting. Even after the American Revolution, the old ways persisted:\n During the colonial period, the right to vote for the lower house of colonial legislatures had been defined in traditional British terms: Only people who had freehold landed property sufficient to ensure that they were personally independent and had a vested interest in the welfare of their communities could vote. - from The Right to Vote and the Rise of Democracy, 1787–1828 by Donald RatcliffeI am nobody’s idea of a history nerd, but I have read a fair bit over the last fifty years or so, and am no virgin at looking at class structures. Yet, I found this book filled with stunning revelations. In particular, the views of some of our foundering fathers are particularly unkind when it comes to working class people. Franklin and Jefferson both believed that the availability of vast swaths of new land would provide all that was needed for the new breed of Americans that was emerging, a safety valve on the social and economic pressures of rising population and limited resources. It did not work out quite as hoped, as the wealthy moved west as well, sucking up most of the good land, and bringing along the means to develop the land, slaves and tools, that less favored pioneers lacked. Franklin was boldly in favor of class distinction:\nFranklin understood that maintaining class differences had its own appeal. In the Pennsylvania Gazette, the newspaper he edited, an article was published in 1741 that exposed why people preferred having a class hierarchy to having none. Hierarchy was easily maintained when the majority felt there was someone below them. “How many,” the author asked, “even of the better sort,” would choose to be “Slaves to those above them, provided they might exercise an arbitrary and Tyrannical Rule over all below them?” There was something desirable, perhaps even pleasurable, to use Franklin’s utilitarian axiom, in the feeling of lording over subordinate classes.\n The notion of breeding is paramount in how class has been viewed over time. It makes it so much easier, I suppose, for the haves to justify their position if they can persuade themselves that those who have not suffer because that is their genetic destiny. Fantasy does become reality often enough as the poor, who often have to struggle just to get fed, watch their children’s development be stunted by malnutrition, some going so far as to eating clay just to feel full, and by a lack of access to good medical care. Some particularly awful examples are noted. Forced sterilization was very much an approach favored by some to keep those they disparaged from reproducing. We are introduced to a wealth of class slurs from the pages of our past, many of them news to me. Here are a few: Waste people, Clay-eaters, Mudsills, Briar hoppers, sandhillers, lubbers, tackies, scalawags, low-downers, hoe wielders, offscourings, bog-trotters, swamp people. And the more familiar: degenerates, crackers, squatters, rednecks, hillbillies, and trailer trash. And for what it’s worth, some whites were even treated to the n-word.Isenberg takes us from the teenaged indentured servants of our deep past, when voting with your feet meant running away from an intolerable, and often illegally never-ending indenture, to Honey Boo Boo and Duck Dynasty, from the reality of class exploitation over the centuries to viewing people (not limited to the poor) as cattle, and looking to breed desired traits. From how the poor, particularly lower class whites, were viewed in the 16th century to how they are portrayed in popular media today. She looks at how some have seized on a sort of hillbilly chic to further their own ends. Isenberg looks at experiments like Oglethorpe’s in Georgia, in which slavery was banned, and how his predictions of what would happen were slavery to be allowed came to pass. Sometimes Isenberg’s analysis goes a bit too far.\nA prison official said it all: “One dies, get another.” Poor whites were inexpensive and expendable and found their lot comparable to suffering African Americans when it came to the justice system. Nothing proves the point better than the fact that both black and white convicts were referred to as \"niggers.\"\nThe prison systems in America have never treated people decently, but I would find the claim of equal abuse more persuasive were some research offered to back the claim. She also refers to the TV show The Honeymooners as a satire about the working class. It was nothing of the sort. What it was was a situation comedy that portrayed working class life, during a time when the norm was to show an idealized suburban Ozzie and Harriet world. It was not satirizing working class people, but bringing them to viewers’ consciousness. I would have liked a strong, overt connection to have been made between the mean-spirited right of today. (Why are these people so bloody cold-hearted towards the poor?) and the extant views of the poor from history. There is DNA to be traced there, even if it is mostly the history of excuse-making for hating on those lower down on the ladder.Overall, I found White Trash wonderfully, if depressingly informative. Any who are foolish enough to see America as a class-free place would do well to check this book out. Class is as real today as it has ever been, and merits our attention as an ever growing number of people are being pushed by automation, globalization, and seizure of more and more of the nation’s wealth by the wealthy, into the lower rungs of class distinction. Any who are interested in American history, in how we got from there to here, are in for a real treat. But whether or not you have a particular interest in American history or class, particularly my fellow and sister Americans, I would urge you to give White Trash a look. The myth of equality of opportunity in America has never been clearer. You have nothing to lose but the chains of ignorance.Publication date – June 21, 2016Review posted – March 10, 2017=============================EXTRA STUFFLinks to the author’s personal, and Twitter pagesMore items by Isenberg-----NY Daily News opinion piece -  Donald Trump’s perverse class war -November 2, 2016-----Salon -  American history: Fake news that never goes away — and empowered the Trumpian insurrection - “Fake history is fake news, only more widely believed.”Interviews-----The Baffler - Born and Bred - Q & A with Nancy Isenberg  - by Emily Carroll - November 07, 2016Audio-----On the Media ’White Trash’ and Class in America by Brooke Gladstone-----WNYC – How America's Landless Poor Defined Politics for Generations - by Leonard Lopate-----The Takeaway – The Angry Ghost of America's Unresolved Class Warfare - 8:59Video-----PBS News Hour - The origin of ‘white trash,’ & why class is still an issue - by Jeffrey BrownOther-----February 3, 2018 - NY Times - Who’s Able-Bodied Anyway? by Emily Badger and Margot Sanger-Katz - a familiar extra-legal method for keeping people from getting needed benefits, reveling in a notion of some people as being undeserving of public aid"}, {"userName": "Matt", "userReviewDate": "Sep 28, 2016", "userURL": "http://www.goodreads.com/user/show/1232712-matt", "userReview": "In All the King’s Men, Robert Penn’s classic novel of American politics, the protagonist is Willie Stark, the demagogic and corrupt governor of an unnamed state (Willie is based on Huey Long of Louisiana). The tragedy of Willie – and All the King’s Men is an archetypal tragedy – is that he started out as a good man. He was a backcountry bumpkin who managed to rise out of poverty to become an idealistic young lawyer. Willie runs for County Treasurer promising transparency and honesty. He loses to the establishment candidate, a man known for corruption and self-dealing. The man who beats Willie accepts a low bid to build a school, taking a kickback as payment. Willie’s career takes off after an accident at the shoddily-constructed school kills three kids. Suddenly Willie the Incorruptible is a hot property. A local Democratic faction decides to run him as a gubernatorial candidate. Not because they want him to win, but because they want Willie to split the rube vote, so that their chosen candidate has a better shot. In a brilliant scene, Willie finds out that he’s being used. To everyone's surprise, he lashes out. He stands before a crowd, dispensing with his prepared remarks, and starts talking about his own “hick” upbringing.“It’s a funny story,” he said. “Get ready to laugh. Get ready to bust your sides for it is sure a funny story. It’s about a hick. It’s about a redneck, like you all, if you please. Yeah, like you. He grew up like any other mother’s son on the dirt roads and gully washes of a north-state farm. He knew all about being a hick. He knew what it was to get up before day and get cow dung between his toes and feed and slop and milk before breakfast so he could set off by sunup to walk six miles to a one-room, slab-sided schoolhouse. He knew what it was to pay high taxes for that windy shack of a schoolhouse and those gully-washed red-clay roads to walk over – or to break his wagon axle or string-halt his mules on.”After giving his own background, Willie gets to his passionate call for action: He leaned at them and said, “Listen to me, you hicks. Listen here and lift up your eyes and look on the God’s blessed and unflyblown truth. If you’ve got the brain of a sapsucker left and can recognize the truth when you see it. This is the truth; you are a hick and nobody ever helped a hick but the hick himself…\"I was thinking about this scene as I read Nancy Isenberg’s timely new book, White Trash: The 400-Year Untold History of Class in America. Because that’s who her story is about. The hicks. Of course, as Isenberg points out, they have many other names. “Waste people. Offscourings. Lubbers. Bogtrotters. Rascals. Rubbish. Squatters. Crackers. Clay-eaters. Tackies. Mudsills. Scalawags. Briar hoppers. Hillbillies…White trash. Rednecks. Trailer trash. Swamp people.”Isenberg’s purpose in writing White Trash is to puncture the myth of American equality, the notion that we are a classless society, all with the same opportunity for success as everybody else. To do so, she undertakes a reevaluation of American history through the prism of class, specifically, by highlighting the forgotten and impoverished. Think of it as A Poor People’s History of the United States. In this way, Isenberg also hopes to help us “better appreciate the gnawing contradictions still present in modern American society.”Isenberg tries to cover a lot of ground in just 321 pages. She starts with the early colonization of America, with heavy emphasis on reframing the meanings of Plymouth and Jamestown, and ends with Bill Clinton and Sarah Palin. It’s almost enough to give you whiplash. White Trash works best when it coheres around a set-piece event, slowing things down with focus and detail. The section on eugenics, and on the U.S. Supreme Court’s opinion in Buck vs. Bell, is especially effective in this way. So too is Isenberg’s eye-opening discussion on indentured servitude in early America. White Trash is not what I’d classify as popular history. The topic is not conducive to a narrative approach, and Isenberg does not try to force it into one. Rather, this is academic history. Isenberg has a position to argue, and she supports her thesis with a wide-ranging survey of sources. She does, however, make every attempt at accessibility. This is not a book aimed solely at college professors. Sure, she spends a lot of time quoting from the now-obscure 16th century writer/promoter Richard Hakluyt, who foresaw America as a kind of penal colony or trash bin, where the undesirables of England could be quarantined. But she also delves into pop culture, peering into the meaning behind Deliverance, The Andy Griffith Show, Elvis Presley, and Bill Clinton’s appearance on The Arsenio Hall Show. This is not a perfect book. At times, I thought Isenberg oversold the conclusions to be drawn from the evidence. Moving the spotlight from one group to another necessarily creates shadows. In putting the poor front and center, race becomes secondary. There were moments when Isenberg came uncomfortably close to equating the experiences of poor whites with those of blacks. (Her proposition that the American Civil War was a class war is a huge stretch). On some level, all poverty is the same. But the difference between the black poor and the white poor throughout history is massive. Whites got called nasty names and were generally forgotten or ignored by the government. Blacks, on the other hand, were statutorily and legislatively set apart as inferior beings, their subordinate status written into the books of the law. That’s a big deal. In any event, Isenberg could have made it clearer that race and class are not a zero sum game. The only people who want us to discuss either one or the other are the people protecting the status quo. Pitting marginalized groups against each other is the easiest way to ensure nothing ever changes.Another oddity is a lack of poor white voices. This is a volume filled with commentary on the poor, but almost all of that commentary comes from elites. We hear a lot about what Ben Franklin and Thomas Jefferson had to say about the lower classes. We hear far less about the experience of poverty itself, or how the poor defined themselves against the backdrop of the cosmos. It’s almost an act of meta-condescension. I understand that there is probably a dearth of primary accounts from early colonial squatters. There’s no excuse, though, when we get up to the Great Depression. My final critique is that White Trash goes to great lengths in describing how America thought about the poor. It gives very little by way of explanation as to why the poor found themselves impoverished. Isenberg details the physical ravages of poverty in the stunted, jaundiced, hook-wormed, straw-haired forms of the backcountry poor. She does not explain how they got to this point. This leads to a queasy and unspoken implication that maybe all the elitist critics were right. Maybe the poor were a lower breed, unable to rise from the muck. Maybe they are lazy, ingrown hicks. This is nonsense, of course. The structural disadvantages faced by the poor were built into the American system from the beginning, when democracy meant that everyone had a say, as long as that person was a white, landowning male. Take, for example, the history of America’s westward expansion, which is also the history of public-private corruption, self-dealing, and trading on insider knowledge. Many of the brave pioneers we still extol ended up as squatters on the land they secured at the risk of their lives. They often lost everything to people who never risked more than capital. (The losses suffered by the Indians belongs in a different category altogether). The real winners of the west were the bankers and lawyers, the investors and speculators, and the crooked politicians who helped partition huge swaths of public land for the private benefit of the few. Isenberg mentions some of these systemic issues, but doesn’t give them depth. I think that’s a shame, because without them, there is a lingering sense of otherness given to the poor, a notion they chose their lot and were content to suffer it. With that said, Isenberg makes a powerful statement about giving poor whites their due, not just historically but today. [The poor] are blamed for living on bad land, as though they had other choices. From the beginning, they have existed in the minds of rural or urban elites and the middle class as extrusions of the weedy, unproductive soil. They are depicted as slothful, rootless vagrants, physically scarred by their poverty. The worst ate clay and turned yellow, wallowed in mud and muck, and their necks became burned by the hot sun. Their poorly clothed, poorly fed children generated what others believed to be a permanent and defective breed…We think of the left-behind groups as extinct, and the present as a time of advanced thought and sensibility. But today’s trailer trash are merely yesterday’s vagrants on wheels, an updated version of Okies in jalopies and Florida crackers in their carts.Any book that dares take on American foundational myths is bound to stir up passions. That’s especially true with class, which along with race, is a particularly sensitive issue. White Trash might make you angry. It might make a lot of people angry. But it’s going to make different people angry for different reasons. Frankly, this is a book I grappled with. I even took down some notes as I read it, as though I were having a dialogue. I don’t agree with all the conclusions. That’s nearly beside the point. This is a discussion that needs to be had. This is, in fact, an important book for understanding what is happening today, all around us. (Reviewer's note: I received a copy of White Trash from the publisher, in exchange for an honest review)"}, {"userName": "Jim Marshall", "userReviewDate": "Jul 29, 2016", "userURL": "http://www.goodreads.com/user/show/2009363-jim-marshall", "userReview": "While reading this extraordinary history of the white underclass in America, I was reminded of how much of my life was spent in and around house trailers. I’m not talking about those doublewide, wannabe condos with designer touches, landscaped lawns, and air-conditioned club houses a short golf-cart ride away. I’m talking about 10-12 feet wide, 60-80 feet long pill-shaped homes that still have the tires attached. My mom and dad brought me home to such a trailer when I was born. Almost all of my cousins lived in trailers until they left home. All of my grandparents lived in trailers when they left their small Missouri farms or their small Chicago apartments. My last two years in college, I lived in a trailer manufactured in 1950 that my grandmother bought for me for $1000 in 1970. I paid $35 for a lot to park it on near Indiana University where I was an undergraduate. It made it possible for me to graduate debt free in spite of my working class origins.I mention all of this because those working class origins were absolutely invisible to me until I was in my early 20’s. Trailers weren’t working class dwellings, let alone underclass dwellings. They were my family’s dwellings, as natural and normal as my dad’s can of Hamm’s beer every evening after work and my mom’s biscuits and gravy every Sunday after church. It was just how things were. Historian Nancy Isenberg tells the 400-year-long story of social class in America, especially the white social class that we never read about in high school. We heard about the founding of Jamestown, for instance, but we never learned that most of those people brought here in the 17th century were not adventurously seeking a newer world. They were criminals and vagrants, unemployed and often-homeless people rounded up from London and elsewhere in order to get rid of them. In the words of John White, a landowner in early America, “Colonies ought to be Emunctories or Sinkes of States, to drayne away the filth.” The New World promised easy wealth, for those willing to take financial risks, but it also offered a landfill to dump those who had no resources and who were a financial liability for the English homeland. 150 years later, when Andrew Jackson came to office, the descendants of this “filth” were still around. “They lived off the grid, rarely attended a school or joined a church, and remained a potent symbol of poverty. To be lower class in rural America was to be one of the landless. They disappeared into unsettled territory and squatted down anywhere and everywhere. …They were to be spread about as scrub foliage, or in bestial terms, mangy varmints infesting the land.” Poor whites were “squatters,” “crackers,” and sometimes, before the Civil War, the \"N\" word. But mostly they were without land, and thus without economic security or political agency. We have to remember, in spite of the ringing words that follow from “We hold these truths to be self-evident,” that “all men” while obviously not including women or blacks or natives, also did not include white men who were landless. And that was most of white men, all of their wives, and all of their children. Perhaps 70-80% of the people who were here before the Civil War were disenfranchised. But that doesn’t mean they weren’t useful. Almost all of those who fought in the Civil War never had a say in whether it would or would not be fought. In the north Teddy Roosevelt’s father bought himself a substitute to fight for him since he didn’t want to hurt his wife, who was born in the south. Teddy never got over that, which may partially explain his extraordinary eagerness to go to war. In the south, no landowners were required to fight, or even to pay for a substitute. White landless men, who had absolutely no stake in the outcome, were drafted and killed in large numbers. Gentlemen plantation owners, meanwhile, could serve as officers if they chose. After all, they had something to lose. And so it went on, through two World Wars, Korea, Viet Nam, and Iraq. Those mostly in the direct line of fire were working class men and women, without college educations, without financial resources, without political power. The working class, both black and white, has served as cannon fodder for most of America’s military actions. Dick Cheney, Bill Clinton, George Bush, not so much. I want to make a turn here, because this history of social class is so relevant to what is happening right now. In another new book, “Hillbilly Elegy,” J.D. Vance, a Yale law school graduate, recalls growing up in poor white southern Ohio. In a recent interview he applies what he had learned about “his people” and the places where they live as the 2016 election approaches.“What many don’t understand is how truly desperate these places are, and we’re not talking about small enclaves or a few towns–we’re talking about multiple states where a significant chunk of the white working class struggles to get by. Heroin addiction is rampant. In my medium-sized Ohio county last year, deaths from drug addiction outnumbered deaths from natural causes. The average kid will live in multiple homes over the course of her life, experience a constant cycle of growing close to a “stepdad” only to see him walk out on the family, know multiple drug users personally, maybe live in a foster home for a bit (or at least in the home of an unofficial foster like an aunt or grandparent), watch friends and family get arrested, and on and on. And on top of that is the economic struggle, from the factories shuttering their doors to the Main Streets with nothing but cash-for-gold stores and pawn shops.The two political parties have offered essentially nothing to these people for a few decades. From the Left, they get some smug condescension, an exasperation that the white working class votes against their economic interests because of social issues, a la Thomas Frank. Maybe they get a few handouts, but many don’t want handouts to begin with. From the Right, they’ve gotten the basic Republican policy platform of tax cuts, free trade, deregulation, and paeans to the noble businessman and economic growth. Whatever the merits of better tax policy and growth, the simple fact is that these policies have done little to address a very real social crisis. More importantly, these policies are culturally tone deaf: nobody from southern Ohio wants to hear about the nobility of the factory owner who just fired their brother.Trump’s candidacy is music to their ears. He criticizes the factories shipping jobs overseas. His apocalyptic tone matches their lived experiences on the ground. He seems to love to annoy the elites, which is something a lot of people wish they could do but can’t because they lack a platform.”The ascendency of Trumpism, in other words, has been 400 years in the making. By hardwiring wealth and social class into our constitution, our educational system, and our cultural assumptions, we have ourselves created a moment of serious crisis. So why didn’t I learn about all this in school?"}, {"userName": "Catherine", "userReviewDate": "Jul 18, 2016", "userURL": "http://www.goodreads.com/user/show/1392534-catherine", "userReview": "Of the good: Isenberg argues that we do not give the history of poor whites nearly the due it deserves, and makes a striking claim for the centrality of that history to any understanding of the United States. It's a provocative position, and one that she makes good with - following her train of thought from the colonial period to the present day, it's clear that we are a nation obsessed with class distinctions, peddling a mythology of the exact opposite.Of the not-so good: Isenberg does not give us the voices of the poor in this text. Instead we read what middle- and upper-class people think about class and poverty. That's important, particularly as few poor people had access to power and few poor people were setting policies; we need to understand the mental gymnastics of politicians and cultural thinkers on this subject. But it is a decided oddity that the poor themselves are never asked what they think or what they want, and leaves the reader with the impression that the poor have no needs or solutions they can articulate. I find that hard to believe.In addition, there's a lot missing from this book. Isenberg skips over immigration practices in the north during the 19th century; she skips World War II; she skips over the George W. Bush presidency. There's no mention of child labor, or of reform efforts to change that practice, limit the workday, or allow people to unionize. Surely these, too, are to do with class? And race is not recognized as the bedfellow of class in nearly enough instances - practices like the widespread lynching of African American men by whites (including working and poor whites) are not mentioned. That seems a strange omission.I enjoyed the book and I learned a great deal. But I'm ready for the books that come after this one, in which Isenberg's omissions become the stuff of continuing conversation."}, {"userName": "J.L.   Sutton", "userReviewDate": "Jan 22, 2017", "userURL": "http://www.goodreads.com/user/show/3675162-j-l-sutton", "userReview": "This was a fascinating history from beginning to end, maybe more so because this history has not entirely played out. In White Trash: The 400-Year Untold History of Class in America, Nancy Isenberg shows the ways in which Americans have both recognized and embodied the lower classes of our society. This bottom rung of American society has variously been denigrated as waste people, offals, lubbers, clay eaters, rednecks, hillbillies and perhaps most famously, white trash. The examination of white trash history from pre-Revolution squatters to Andrew Jackson’s presidency to present political debates is intermixed with references to popular culture (such as The Beverly Hillbillies, Deliverance and Duck Dynasty) and literature; Harper Lee’s To Kill a Mockingbird is prominent in this discussion. Isenberg argues that these representations don’t just show us poor white trash, but are a reflection of American identity."}, {"userName": "Jeanette", "userReviewDate": "Jun 18, 2016", "userURL": "http://www.goodreads.com/user/show/11869072-jeanette", "userReview": "2.5 star to be fair. It's written poorly, first of all. It could easily have been edited to half of its size for the pure information it contained in total. It's verbose and with immense repetition of basically what is a colonist theory detailing to origins of present class barriers in the USA. As if the point that there ARE definitive class bars and levels within the USA and that it is not a classless society just because it is a republic is some kind of epiphany. It's hard for me to imagine an intelligent observation of the opposite assumption. Not just in the USA either. In any society and culture there are class recognition criteria. And in most they are immense to association and to ultimate work, as well.It's too bad that it was not organized better. And that the title was not more accurate too. This has been \"untold\" before now? No. The only thing she changes in the telling are some of the connotations for her and other groups she \"knows\" definitions of \"Trash\". Nevertheless, the entire \"victim\" designation she entails in the predetermination of such inadequacies \"always being with us\"- is problematic. Because I see exceptions of change continually. One very poor Arkansas boy with a single Mom became President of the USA. Oddly, that rather undercuts many of her majority assumptions to others' evaluations of worth. Affirmative action alone has given the very poorest a larger advantage to access the highest educational costs, for instance. For 50 years this has been absolutely true in my state. If you visit the top rated universities in the USA, the Middle class American background is the class most often missing of representation.Also, IMHO, the balance of origins (how they got here, where they came from) is too heavy in her definitions of that class as it exists now, while the balance of family systems and support throughout migrations and changes for work access in the last 100 years is way too light."}, {"userName": "Shauna L. Howard", "userReviewDate": "Jul 06, 2016", "userURL": "http://www.goodreads.com/user/show/8456274-shauna-l-howard", "userReview": "This book could easily be the only American history book that one would need to read to gain a greater understanding on the socio-economic problems in America. I'm not sure how I found it, but this book is one of the most informative books that I will probably read this year. Because of this book, I refuse to have any discussions about racism in the United States unless the conversation includes a willingness to take a historical \"step back\" & understand how classism & capitalism has failed everyone except the top 1%."}, {"userName": "Maria", "userReviewDate": "Aug 05, 2016", "userURL": "http://www.goodreads.com/user/show/9555257-maria", "userReview": "Nancy Isenberg's tome on the history of poor whites in America is expansive and thorough. Starting with the earliest colonists and progressing to modern day America, she illuminates the somewhat hidden history of poor white families in their many incarnations over the past four centuries. Spoiler alert: rich white men have always hated poor white men only slightly less than they hate brown people.While I must respect the research and effort that went into this volume, I admit that it was very hard to read at times. Isenberg doesn't have the skill of, say, Jill Lepore or James Loewen, when it comes to making potentially dry history more palatable, but there were still plenty of interesting anecdotes and explorations to keep me going until the end. She spent far too much time in the colonial era and not nearly enough time in the most recent 100-150 years. She could have written an entire book about Civil War-era class conflict and manipulation, and I would have gladly traded most of the discussion about pre-colonial Jamestown society for more investigation of poor whites immediately before, during, and immediately after the Civil War. Additionally, I found her discussion of Elvis and his lasting influence on Bill Clinton interesting, as well as her ruminations on \"Here Comes Honey Boo Boo\" and Sarah Palin, but felt that she missed something by not even mentioning the runaway popularity of Eminem, who has much more in common with Elvis that he'd perhaps like to admit. For me the most valuable takeaway is how it informs the Trump 2016 phenomenon/dumpster fire that our nation is currently enduring.All in all I'm glad I read it, and I may mine the bibliography for further, more focused reading, but I'll have a hard time recommending this to all but the most serious nonfiction readers."}, {"userName": "Miranda Reads", "userReviewDate": "Nov 07, 2017", "userURL": "http://www.goodreads.com/user/show/71848701-miranda-reads", "userReview": "I initially read the title and reserved this book under the impression that this would be a humorous look into white trash history. I assumed wrong.This was the history of the poor, white American as I've never heard it before. \nAmericans lack any deeper appreciation of class. Beyond white anger and ignorance is a far more complicated history of class identity that dates back to America’s colonial period and British notions of poverty.\nI noticed how how the history cycles - going from blaming the whites for being poor, legally taking money/houses/children and going back to blaming them for being poor. And at the start of said cycle, was the British colonists.\nBritish colonists promoted a dual agenda: one involved reducing poverty back in England, and the other called for transporting the idle and unproductive to the New World. \nThe main pain I had with this book - it spans 400 years. There isn't a consistency in characters and many people only stick around for 5 or less years. Thus, keeping track of who is who was a bit difficult. Also, as I mentioned earlier, the history cycles.Yes, is a history book so there isn't much wiggle-room with characters. I almost wish it could have spanned fewer years to circumvent having to include so many years. But then we wouldn't have gotten the full picture. Ah well, six of one, half dozen of the other. Also, as I mentioned earlier, the history cycles. A few times, I had to page back a bit to see if I had already read it or if it was something that just sounded similar. Overall, this book was eye-opening and its sheer breadth of information was incredible.Audiobook CommentsRead by Kirsten Potter and while she was a good reader, this book was still SO freaking boring that it was a bit difficult to read."}, {"userName": "Margitte", "userReviewDate": "Jan 27, 2017", "userURL": "http://www.goodreads.com/user/show/7481492-margitte", "userReview": "[Pardon me. This book reminds me of the mobilizing of the masses to instigate a revolution. The French reacted to their oppression through the teachings of Jean Jacques Rousseau; the Caribbean islands responded by instigating their own revolution based on the French Revolutionary slogan : liberty, equality and fraternity. Americans fought each other in the civil war as a result of this revolt washing over the American shores.The English fueled the wrath of the disenfranchised in America when American leaders(from the privileged classes) decided to throw the English out. By mobilizing the lower classes against their American upper classes, was an effort by the English to divide and conquer. America was based on a rigid class system (with lots of evidence provided in the book), established by the English, and there was enough discontent in the enslaved lower classes to overturn America's intentions of hosting the Boston Tea Party and oust the Brits. The same tactics were used in India, South America, Russia, China and Africa, where Communism/ socialism fueled the revolutions based on the same principle of divide and conquer.A common concept in revolutionary thought is that no working class can play a revolutionary role in society while the majority of its members desire to improve their situation individually, within the framework of the existing society, by leaving the ranks of their class. This truth is reinforced when the collective working class (called the proletariat in Communism circles) does not recognize itself as a stable social class with its own group interests and its own value system in conflict with those of the existing social order. The impulse toward a total transformation of society does not arise easily in a community of immigrants who have just changed their social and political status and who are still hoping to improve their conditions through social mobility. To succeed with a revolution, it is necessary to inspire individuals enough to group themselves together into a movement with a common goal. So, depending on where you stand, and from which angle you approach history, you will learn many new facts about American history by reading this book, regardless of your agreeing or disagreeing with the approach.In the book a picture is drawn of how a strong middle class was formed to protect the small upper classes at the one pole, from the white trash lower classes at the other pole in previous centuries. Keeping a middle class strong, and concentrating on the development of the needs of individuals, a rigid class system could work its magic. It worked for America for many generations through several centuries. As long as the hierarchy of classes can be maintained, a safety net protected those in power (currently the economic players).There are numerous interesting historical facts provided in the book, spread over the history of the individual states.Truth be told, class wars and class distinctions have been with mankind since the first breath of air filled the first lungs of the first human being. Everybody knows that since we live it every day of our little mundane lives. There was even a strict class system in the Bible stories about the Jewish population. The Old Testament was more or less one big war, in which cruelty reigned supreme and groups were used against each other.The enslavement of people were and are universal in many countries. Enslavement have different faces and are expressed in different concepts. It can be physical, economically, financially or socially. It can be mentally or ideologically. There are always individuals or groups who can be enslaved. \"White Trash\" by Nancy Icenberg discusses America's history of ball-and-chaining the original white settlers of America, with ample references to other groups as well. For other ethnic groups, reading this book, a new window will open on the origins of white slavery. They were the first ones to populate America. The other slaves came in later. So in this sense it is an eye-opening book on how similar people from different racial origins were treated. They have a lot more in common than distinguish them! How they ended up now in 2017 is even a bigger point of interest.There are literary millions of books, reports, documentaries, and political pipe dreams published around this topic and how it is playing itself out in American society. This book does not rock the boat, really, but it is a different approach. (hide spoiler)]"}, {"userName": "Jan Rice", "userReviewDate": "Apr 29, 2017", "userURL": "http://www.goodreads.com/user/show/5864678-jan-rice", "userReview": "I have thought of the problem of confining people in classes, castes and races as roughly analogous to curtailing the varieties of seeds and plants: you never know which ones will grow and thrive in the changing environment and which will now fail. If you've suppressed or gotten rid of all but the few that do well in the immediate situation, what will happen when things change and the only ones now available aren't suited to survive? America is a case in point. Everyone knows we were started by a bunch of debtors and misfits and people who were starving or who wanted to escape persecution, people for whom necessity was the mother of invention. They wanted a better chance and had the gumption to know it. And look! From that flotsam and jetsam, politicians and scholars and artists and writers and all sorts of thinkers and doers have arisen. As each new group made it into the light of day, there arose waves of individuals who contributed to the blossoming renaissance. That's what can happen when people are not kept down or confined in rigid classes or castes.Or so I thought.Isenberg's thesis is that there has always been a class divide in society, that class in America has not been limited to race, as we are conditioned to think here in America. Further, America was a dumping ground for England's undesirables, or waste people. These never had a chance, were never given a chance, but are kept down just as black people have been kept down. As a matter of fact, because of their sallow or burnt complexion and gaunt, unhealthy physiques--from malnutrition and overwork--they have long been considered genetically, not simply sociologically, inferior, an all-round bad breed.This is important stuff. Unfortunately, though, what we get from this author rather than a clearly delineated picture of what happened and the historical context out of which it emerged is \"proof\" by many quotations, adding up to a litany of ugly characterizations over the decades and centuries. To those quotations is added a close examination of all the names by which these left-behinds were known geographically and historically. There is a smattering of context and explanation, but it tends to be widely scattered and hard to assimilate.At the beginning of the book, as the quotations from famous or representative Europeans and Americans of the seventeenth and eighteenth century piled up, I was still able to give the quotes some context, having been reading history and Western civilization lately. Then, in the middle of the book, the hitherto constant refrain subsided to a degree, only to tune up again big time toward the end. I had to let the din die down for several days and then reread, gathering my wits before reviewing.All the loaded quotes and naming is almost prurient. The ugly repetition tends to undercut the author's disapproval of the racism about which she's writing, almost as though she were getting off on it. (I do say racism, not classism. Racism is the general term and, I think, fits here, considering the emphasis on breeding and supposed biologically determined characteristics and inferior quality. The comparison was to animal husbandry; you had to keep the breed pure, avoiding contamination by the inferior breeds and breeding out inferior cases.All this reminds me of a term I heard from a doctor--a psychiatrist--back in the '80s: piss-poor protoplasm.I knew that in Britain the lower classes were long considered a breed apart, but in America the focus on race serves to blind us to class.But the author's method of stringing together quotes and pejorative names within a historical and geographical framework does not do justice to the case she presumably wants to make. It weakens her case, as though she has nothing, or little. Tell us how the situation came to be, already! Please do the hard work of thinking it out and writing it down, and don't rely so much on letting multiple quotes speak for you!I am being hard on the author since I had high expectations for the book and was disappointed.To be fair, the author has a difficult job. She's trying to adjust our thinking here in America, where we're conditioned to think white/black and not class. She's trying to cut across that. Maybe she's still trying to convince herself that she's seeing what she thinks she's seeing.And she does provide us glimmers, off and on.I'm going to proceed by talking about some of the ideas she fields, adding my own takes, connections, and/or questions.Maybe her most-emphasized idea is the connection of white trash/waste people with wasteland, which is both empty, uncultivated land and the poorest land. The surplus people of England were dumped here to rid the old country of them and try and put them to good use--meaning remunerative use and also to do something with land perceived as empty, wild, and unused. I thought of the idea of \"wilderness\" in the Hebrew bible: everything that is outside and the opposite of civilization. In America we're conditioned to think of...well, I was going for a back-to-nature picture, but that's not what I came up with: pastoral, amber waves of grain, not grassland--in other words, cultivated, farmed land. So I can begin to see what the author is getting at regarding wasteland. In feudal times, power and wealth that now comes from money used to come from land. The nobility, aristocrats, or landed gentry had large tracts of land on which serfs, and later share-cropping peasants, toiled, and the landowners' wealth came from what that land produced. From the picture the author is painting, wealth and power apparently were conceived that way in the new world as well. But by the time America was being settled by Europeans, the industrial revolution was already getting started in England, which is where it began. Isn't that the reason there were so many surplus \"waste\" people at that particular time? Yes, the poor are always with us, but as the industrial revolution cranked up, it upended established ways of life, uprooting people and sometimes also creating the wherewithal to have more children earlier, while not yet having developed the resources to incorporate the burgeoning masses.There was a lot of what we'd now call blaming the victim. Society was deathly afraid of idlers and vagrants, and if there were hoards of them, and if they were unruly or revolutionary, that fear makes some sense.There were too many of these poor; they were expendable; they could be shuttled off to new lands where the \"waste\" people could become useful as \"fertilizer.\"The idea was, though, that they wouldn't be \"apothecaries, cheese mongers, tinkers, wig makers, and weavers,\" as many of the English settlers were by this time--that is, people without a farming background who were put on the land and expected to farm. Therefore they failed, and were considered lazy in comparison to Scottish Highlanders or German settlers who came prepared for the vicissitudes of subsistence farming--people from countries that so far were less industrialized. Maybe also the idea that people should be farmers on the land is already reflecting the romantic reaction against industrialization, but even if so, it fit the economic aims of the elite class, and with the notions of cultivated land as good land, an economy with land as central, agriculture as the way to fix surplus people into a yeoman class between the aristocrats and the slaves, and, last but not least, settlers to nail down the land.There was no way free small farmers could compete with plantations running on slave labor, though, and greater efficiency soon enabled the would-be aristocrats to dominate the economy through wealth and power, creating even more waste people.The poor gravitated to the poorest land.Even as waste people accumulated and were shunted westward, there was already the fear of inseminating new areas with degenerate and inferior people.But the poor can't always be shipped out. Isenberg referred to \"poor badges,\" and at first I couldn't tell whether she meant actual badges for beggars or whether she was speaking metaphorically of distinguishing features of the poor. Wikipedia says there really were poor badges in late medieval and early modern times to control who could beg and live an itinerant life, and it seems such badges showed up in the new world, too. The need for badges brings me to another of Isenberg's major theses: that society wants class distinctions and resists \"leveling.\" In other words, it's not simply that social mobility is economically difficult but that it's actively resisted. The medieval ideal of 'a place for everything (i.e., everyone) and everyone in his or her place' still holds. Isenberg has Thomas Jefferson selling Europe on America as a classless society in response to defamatory European ideas about America.The idea is that it is not being different that causes a backlash, it's getting out of your place. Differences among groups and classes are seemly. Freedom may be tolerable but is best achieved within one's appropriate station. Intellect and ability should match--should be made to match--that station. Limiting the availability of education and attaching the vote to property ownership are ways social mobility has been curtailed. The threat to the existing order comes when differences and distinctions erode, in other words, when people are seen as getting uppity. There is resistance to this way of thinking, and there are vested interests in our current focus on race to the exclusion of class. I've already seen a professional review that chides the author for omitting race from her book. She doesn't; it's just that she's taken a different angle and written a different book.I will tell you that it's easier for a group to focus on its problem with race than on who, more generally speaking, it welcomes. When the group chooses to racialize its focus in that way, it can get kudos from the political left, all the while remaining willfully blind to its own internal class system.Can it be that something like that, albeit not just with race, is what has happened in America at large and has led to the result of our presidential election?--a result that hadn't yet occurred when the author was writing this book. Class, caste, and race may be the ultimate representation of polarization in society. I'm hypothesizing that, not Isenberg. I used to think that social ills and dilemmas emerged from problem segments of society--from black America and from the west--California--or so I would think. Of course that's where problems emerged!--but not where they originated. We had kept black people down and shuttled waste people west--\"our\" kind of people seeing ourselves as entitled to the roles we play and outsourcing all the problem traits (traits we prefer to disown)--but the problems boomerang and come home to haunt. Complicity.Nancy Isenberg floats the idea that the poor white class was installed between the landowners and the expanding population of slaves to cushion the elites from the eventual wrath of the slaves. The only thing good about being part of that barrier class was in being made to be above the black people. However that worked or works, the two lower classes were being played against each other. The elites played/play the two lower classes against each other.Toward the end of the book, the author comes out with the old saw that the poor whites vote against their own class interests. Where do their interests lie, then? Surely not with the educated class that has kept them down and that plays them against another class to save their own skins? And that, to save their own skins, currently has them taking the fall.The book so emphasizes the unpleasant characteristics both of the poor and of the elites who put them in their place and keep them there that the term muckraking comes to mind. I didn't mind the blunt title since it's an attention-getter.* But keeping it up throughout is sensationalism. If that would shift the paradigm it might be worth it, but I think not. *I have continued to think about my presumption that the words of the title are acceptable, although I wouldn't think the n-word would be acceptable; I would in fact do as I have just done and write \"n-word.\" Why is that? In the book, the author described a racial etiquette between poor whites and black people that once (or still?) existed: if the black person called the white person \"po' white\" or \"white trash,\" he could expect to be called \"nigger\" in return. The terms, in effect, were equivalent. Why then do I feel one term would be appropriate as a book title and the other not?Here's the answer as I've discerned it so far: There is a power component to morality. We have a tendency to behave better toward those whom we think have some power over us--and if not those people themselves, then the expectations of some others whose opinions we value and whose judgments concern us.Here is a definition of power: Power is the ability to make others listen to one's story.With even greater power comes the ability to make others conform to one's story."}, {"userName": "Clif Hostetler", "userReviewDate": "Jun 27, 2016", "userURL": "http://www.goodreads.com/user/show/793473-clif-hostetler", "userReview": "[I find the above statistics to be unclear. They make it appear that Americans on average give away half their wealth at death to places other than their children, and the Danish give away 85 percent. I doubt that to be the case. It may be that the above statistics are referring to inherited wealth as a proportion of total wealth. But I can't tell from the text in the book nor from the referenced sources indicated. The following block quotation are the sources indicated in the Notes section for the source of these statistics. Since I'm not a registered user of literature search resources at a research library (and I'm too lazy to go to the public library and use their resources) I have not read the following sources. If anybody who reads this is able to clarify the meaning of these statistics, please pass the information on to me.See Sean McElwee, “The Myth Destroying America: Why Social Mobility Is Beyond Ordinary People’s Control,” Salon.com, March 7, 2015; and Lisa A. Keister and Stephanie Moller, “Wealth Inequality in the United States,” Annual Review of Sociology 26 (2000), 63-81, esp. 72. As one scholar wrote, “If you want the American Dream, you’ll have to go to Denmark,” Also, Americans grossly underestimate wealth inequality, and if shown charts comparing the United States’ and Sweden’s wealth distribution (though without identifying the countries), respondents overwhelmingly choose Sweden. (hide spoiler)]"}, {"userName": "Lata", "userReviewDate": "Dec 11, 2016", "userURL": "http://www.goodreads.com/user/show/13126933-lata", "userReview": "Thoughts later.Waiting for a hardcopy from the library so I can revisit points and collect my thoughts. This book made me think. A lot."}, {"userName": "Leo Walsh", "userReviewDate": "Aug 10, 2016", "userURL": "http://www.goodreads.com/user/show/2118933-leo-walsh", "userReview": "We American fancy ourselves classless. We tell ourselves that with hard work, anyone can succeed -- like the runaway waif Ben Franklin. And while we admit that America began as a slave state, we often think that white supremacy is a thing of the past. And that African-Americans can achieve anything they want... with a little hard work. Nancy Isenberg deconstructs this myth in her excellent history, \"White Trash.\" In it, she takes a long, hard look at America's elite and how they have denigrated the lower classes. But instead of focusing on the African-American population -- I've read many an excellent history of slavery and the civil rights struggle -- she focuses on poor, rural whites, another underclass.Unlike the slaves and their descendants, these people -- who've gone by nicknames like \"white trash,\" \"red neck,\" \"cracker,\" \"Hoosier,\" etc. -- have been historically looked down upon by the white elites. These people are less visible than poor African Americans since they live in rural and suburban enclaves, especially low-rent trailer parks. But they are more numerous. And just a beat-down. White trash were, for instance, more targeted than African-Americans during the Eugenics craze in the late 19th and early 20th century. And they have been derided by elites as diverse as Henry David Thoreau, HG Wells and Teddy Roosevelt as a sub-human branching off of the \"European family tree.\" Isenberg does a great job tracing white trash culture over the decades. Often simple farmers forced by shady land speculators onto marginal land, they lived lives of abject poverty. Due to a poor diet, they became gaunt and yellow-skinned. Their children, deprived of essential nutrients in their diet, were often driven to \"eat dirt\" in order to get them, exposing them to worm infestations. It never occurred to most middle class and elite Americans -- until FDR tried -- that these people were just malnourished. FDR failed in his major attempts to create government sponsored, self-sufficient farm communities in the south die to Conservative pressure in the Congress. The descendants of the people who benefited from government land grants in the 1800's forgot that largess, and vehemently opposed FDR's attempt to provide government training and largess in the 1930's.As the adage goes, \"how quickly they forget.\"America still degrades poor whites. Note that a lot of criticism of Trump's \"white trash\" supporters does not pose empathy for them. It mocks them as poor, uneducated and angry -- with an unspoken \"trailer trash\" subtext. Of course, that criticism of white, working-class Trump supporters is class-based. And it ignores the historical context. We forget how LBJ led to Nixon's \"southern strategy.\" LBJ grew up barely above, but surrounded by white trash in Texas. Through hard-work, natural talent and luck, LBJ became President. Since he was so familiar with poverty and squalor, his Great Society was as focused on white trash as it was on the largely urban black poor. This made him immensely popular.And then, he made an error by eradicating Jim Crow via the Civil Rights and Voting Rights Acts. Since both shook white trash society to its core. After all, during Jim Crow, a poor white tenant farmer or a factory worker scraping by in a trailer park could say, \"I'm poor... but at least I ain't black.\"By taking that away, LBJ lost the Democrats the south since he knew that white supremacist elites would rile white trash. And sure enough, Nixon (and then Reagan and W. Bush) would begin employing the \"southern strategy\" aimed a poor whites who felt alienated. Their worlds had been turned upside-down. Now, they had no one to look down upon. And the GOP has manipulated these people -- think about the non-existent \"welfare queen,\" Willie Horton and Birthers, all of which appeal to uneducated, racist white trash. The problem is that the GOP has used this racist back-lash to pursue tax, economic and social policies which further hurt poor whites. Who should be standing in solidarity with their African-American and Latino brothers and sisters, since what is good for them is good for poor whites. After all, the majority of welfare recipients -- from food stamps to Medicaid to Section 8 housing -- are the white poor.You'd never know it, though, listening to the poor whites who make up the Tea Party. Because of GOP propaganda, white trash often think that the urban poor are living large off of welfare, with dishonest mothers squeezing out child after child to buy Cadillacs and iPhones with government money... money that should be theirs. They do not realize that poor urban blacks live the same paycheck-to-paycheck existence that they do. And that, as poor people, they should stand together. But our \"America is a classless society\" myth impedes this realization. And probably will as long as we have populists like Trump -- son of a multi-millionaire who inherited $200 million whose background seems as far as possible from the experience of poor whites -- pointing his finger at foreigners and minorities as the cause their problems. While proposing tax cuts and social programs with will aid the rich at the cost of help to the poor and working classes -- regardless of race. Overall, I found \"White Trash\" amazing reading. It keeps its focus on the history. And it has helped me evolve as a person... and that's the strength of a good book, Before reading the book, I scoffed at white trash. I thought of them as a bunch of dim-witted and incompetant Barney Fifes and Gomer Piles -- though I lusted after the barely-clad Daisy Duke and Ellie May Clampett as a teenager. I used to scoff at their racism and loud-and-proud ignorance.By revealing the historical and social dynamics that raised these people, I now see them as another abused minority. A minority that has been manipulated by the elites into being racist, and then using poor white America's racism to advance the desire of the already well-off to become wealthier. Now, instead of derision, I feel empathy. And while I oppose the racism a good percentage of white trash America espouse, I can at least see where it comes from. And say that there, without the grace of God, go I. I gave this book 3.5-stars. It could have been 5-stars, but the historical survey got convoluted after LBJ. By classing Clinton. W. Bush, Jimmy and Billy Carter as contemporary \"high-profile\" white trash, it fails to address the rampant racism that the Tea Party has unleashed in the white underclass. Which we are now seeing bubble-over in the racist, xenophobic rants of Donald Trump. But since the material is so important, and historically intriguing, I rounded up to 4-stars. Recommended to anyone interested in how history has shaped contemporary America."}, {"userName": "Jessaka", "userReviewDate": "Mar 23, 2017", "userURL": "http://www.goodreads.com/user/show/4659464-jessaka", "userReview": "The name drew me in, the first chapter gave me a sense of \"The Handmaid’s Tale,\" a sci-fi book that is really real. But it went on and on, and it became so tedious that I gave up on it. It reads like a dissertation, but not as good as some. How many ways can you tell us that women were just breeders,as were their children? Some times men think they still are.So fill the earth, cut down trees, build houses and farms. Use indentured servants and slaves--all the same. Ruin the planet and kill all life on it, as long as your women make babies to the very end. But this book isn’t really about white trash because anyone in our society and in many other societies are trash if they are poor and if they are slaves. They want them for their cheap labor, but at the same time they wish them dead. They are not indispensable. If you want a good read on poverty, read “Hard Times,” both books by different writers. and “The Worse Hard Times.” Read “Nickel and Dimed.” Read books by black writers who talk about how American makes them feel. Read about the migrant workers and how shitty their life really is. And if you can get out and fight to end poverty, a condition that will never end, don't feel hopeless, because at least what you have done will mean a lot, at least to those that you have helped."}, {"userName": "Book Riot Community", "userReviewDate": "Jun 23, 2016", "userURL": "http://www.goodreads.com/user/show/33447134-book-riot-community", "userReview": "“Waste people.” “Offals.” “Rubbish.” “Lazy lubbers.” “Crackers.” These are some of the names given to the poor in America spanning from colonial times to the present day, where the term “white trash” has taken over. Isenberg offers a fascinating, detailed examination of class system in America, and how class issues involving poor people have played a part in shaping America and historical events for the past four hundred years, from the earliest British colonial settlement to Here Comes Honey Boo Boo and Duck Dynasty.Tune in to our weekly podcast dedicated to all things new books, All The Books: http://bookriot.com/category/all-the-..."}, {"userName": "Nancy Oakes", "userReviewDate": "Oct 15, 2016", "userURL": "http://www.goodreads.com/user/show/900340-nancy-oakes", "userReview": "actually, like a 3.75 rounded upI absolutely have to thank the publisher for my copy. I was on the edge of buying this book when I got the email, so thanks very, very much.I didn't actually read this book in two days, so don't let the starting/ending dates fool you. I don't think you can read this book in that amount of time since there's a wealth of information to sift through here. There is a more expanded version of this post at my  reading journal,  so feel free to go long or to take the short road. This is certainly one of the most informative books American history books I've read this year; quite frankly it was an eye opener. If someone had told me that Thomas Jefferson referred to the white underclass of his own time as \"rubbish\" I probably wouldn't have believed it, since he's revered as a founding father of this nation. But he actually did use that label, and he wasn't the only founding father or American politician to use that sort of term to describe the \"wretched and landless poor\" that have been part of our history and our culture since this country began. And that's just for starters. But that's the point here -- as the dustjacket blurb reveals, the author\"explodes our comforting myths about equality in the land of opportunity, uncovering the crucial legacy of the ever-present poor white trash.\"Just very briefly to summarize, Isenberg poses the following question in her book:\"How does a culture that prizes equality of opportunity explain, or indeed accommodate, its persistently marginalized people?,\" and it is this question, answered through an examination of an incredible array of source material, that is the focus of this study. As the dustjacket blurb notes, \"white trash have always been near the center of major debates over the character of the American identity,\" and here she examines just how this has been the case over the last four hundred years. She does this by careful examination and analysis of several sources in contemporary politics, literature, scientific theory and various policies at different moments of America's history.I will say that while it was very informative and I found myself going long stretches of time without being able to put the book down. This isn't a pop history for the masses sort of thing, and I would find myself repeatedly going to the back to read her notes, iPad at the ready. I also happen to agree with many of the major points she makes here, most especially her statement that\"We are a country that imagines itself as democratic, and yet the majority has never cared much for equality... Heirs, pedigree, lineage: a pseudo-aristocracy of wealth still finds a way to assert its social power.\" (316)This is a dominant theme that carries on throughout her work, and she does prove her point over and over again.As fascinated as I was with much of what she has to say here, I do have some issues. My biggest problem here is when she says that \"class has its own singular and powerful dynamic, apart from intersection with race.\" I'm not so sure I quite buy that statement as it pertains to class in America. Second, I didn't find the book to be an actual \"400-year\" history per se, since a large part of her focus is on the South at the expense of understanding the history of the poor white class in other regions in this country. It's tough to be fully comprehensive when writing a history spanning so much time, and given how intensely she makes her case for the eighteenth and nineteenth centuries, aside from a brief discussion dealing with a few modern presidents, a bit on the eugenics movement, and \"white trash\" in books and on television, there is little depth of discussion regarding the white underclass in the twentieth century.Regardless of its flaws, though, I would certainly recommend it because it is a valuable study that really does debunk some of the myths about the idealized conception of white equality in America as well as the reality behind the American dream itself."}, {"userName": "Paula Kalin", "userReviewDate": "Sep 17, 2017", "userURL": "http://www.goodreads.com/user/show/16174645-paula-kalin", "userReview": "White Trash by Nancy Isenberg is quite an eye opener. This is a 400 year US history lesson that states class has been with us since the Mayflower landed. I thought the British sent all their convicts to Australia to colonize, but I had little clue that the same happened in America. She talks about the white poor and slavery from the days of Franklin, Jefferson, the Civil War, LBJ to the present. Though the names given to the white and landless poor have differed over the years, they have always been there and the politians made sure they stayed there. Basically, America is not and has never been a class free society.There is a lot of good history presented here and one I was glad to read for the eye opening education. However, the book is long (15 hours on audiobook) and I did start skimming a bit in the middle. Some repetition here and there.Would I recommend White Trash to readers? Only to those that are into nonfiction and US history. 4 out of 5 stars."}, {"userName": "David Yoon", "userReviewDate": "Jan 02, 2017", "userURL": "http://www.goodreads.com/user/show/4934590-david-yoon", "userReview": "It’s an impossible task really. 400 years of class in America concentrating on the white poor. Despite it’s brick-like size it can only do so much and this focus is off putting with the noticeable avoidance of black slavery and native peoples. But Isenberg is up front, she’s interested in examining crackers, rednecks, hillbillies and the titular white trash. I’m a Canadian so I have no idea what gets taught in schools across the United States. I’m sure it’s as defanged and sterilized as what we learn in Canadian History. So it’s incredible to hear about America being seen as a potential dumping ground for the idle poor, the criminal, and orphaned of England. Or about President Andrew Jackson, redneck malcontent that did whatever he pleased with vocal supporters that favoured brawling over brainy discussion. Or the eugenics craze that swept the nation in the early 1900’s on the backs of the idea that “class was congenital”.I could have done without the last fifty years talking about the rise of white trash in the media landscape from the Beverly Hillbillies, to the Dukes of Hazard, Honey Boo-boo and Sarah Palin. It’s too much ground to cover and offered no real insight to the pop culture landscape. And in this post-Trump world it would have timely if she was able to extend her analysis to the past election."}, {"userName": "Ginger Stephens", "userReviewDate": "Mar 07, 2017", "userURL": "http://www.goodreads.com/user/show/18104355-ginger-stephens", "userReview": "The question that I found myself asking throughout the whole book: How do you turn a book about white trash into boring academia? On the whole I found this book confusing. It started out with a discussion of the Ewells from \"To Kill A Mockingbird,\" so it seemed to start in a spot that most Americans understand. Then, it lost its way. I suspect that Nancy Isenberg does not understand the difference between being poor and being white trash. All Southerners know the difference. I suspect most Northerners do, too. Since she started with a \"To Kill A Mockingbird\" reference, she should also understand. There are respectable poor folks all through that book.This book really explores the history of poor whites in the South. So, to call this a \"history of white trash in America\" is misleading. It is (and has always been) possible to be poor without being trash. According to this book, poverty and trashy behavior are limited to the South. Only once does the book foray into the North, and that is the discussion of trailer parks. After that, it heads south again and stays there.I think I gave up hope when the author managed to insult the Andy Griffith Show, the Beverly Hillbillies, and Elvis, all in one chapter."}, {"userName": "Kelly", "userReviewDate": "Sep 28, 2016", "userURL": "http://www.goodreads.com/user/show/94602-kelly", "userReview": "Definitely worth reading. Glad I stayed on that two month library waitlist!"}, {"userName": "Joanna", "userReviewDate": "Jul 19, 2016", "userURL": "http://www.goodreads.com/user/show/620387-joanna", "userReview": "This book could have been so much better. The book tells the history of class descriptions, particularly descriptions of poor whites by better off whites. Clearly, a great deal of research was involved and historical documents and quotes are presented. But the book somehow lacked heart. There were no personal stories, no voice given to the poor themselves, and very little analysis of what this all means today.Also, while the title promises an \"untold history,\" the information in this book didn't feel especially surprising or unrevealed to me. I don't think this is an area about which I'm particularly well-informed, but it surprised me not at all to hear that poor whites were a matter of discussion and derision throughout the nation's founding and history. Maybe I just absorbed this information by growing up in Texas. In any event, I expected something more fascinating or surprising here. Of course class suppression is one of the goals of systematic racism -- allow the lower class whites to elevate themselves above minorities and they will align along race lines rather than engage in populist rebellion. Is this really a new theory? Or one that hasn't been explored? Perhaps, but it wasn't all that interesting to read in this format.My enjoyment of the book was also hindered by the narrator. While not terrible, the narrator seemed at a loss for how to convey the start and end of quotes in the document that made the reading choppy. Perhaps this is the author's fault, but I think at least some of the blame falls on the narrator. She also just didn't seem enthusiastic about the book at all. I know this is an academic text, but it should have been read in a more upbeat way. This book was selected by one of my book clubs, so I'm looking forward to the discussion with the group (if we ever find a date to meet)."}, {"userName": "Amy", "userReviewDate": "Jun 21, 2016", "userURL": "http://www.goodreads.com/user/show/34043873-amy", "userReview": "WHITE TRASH VS. THE AMERICAN DREAM, Read the Book Club Babble InterviewA couple weeks ago, I bounced downstairs sporting my new Ralph Lauren t-shirt, emblazoned with the motto “Land of the Free” in red, white, and blue letters, of course! Three hours later, my review copy of Nancy Isenberg’s White Trash. The 400-Year Untold History of Class in America arrived and I began studying it right away. After reading a few chapters, the truth of Dr. Isenberg’s premise–that class structure is embedded in our society and opportunity is not equal for all–began to challenge my long-held belief and pride in the American Dream. Was it true that my beloved country wasn’t the “land of the free” for everyone? Should I change my shirt? I laughed at myself–it wasn’t my shirt that needed changing. It was my mind.I determined to learn all I could. Maybe by understanding the true roots of class and poverty in America, I might begin to understand where to find answers and then be able to take informed action, so that one day, and hopefully in my lifetime, the motto on my t-shirt wouldn’t need an asterisk.After finishing the book, I have a deeper understanding of the complexity of what it takes to actualize the American Dream, but I’m not giving up on it! Dr. Isenberg’s book is both groundbreaking and critically important if we, as a society, want to live up to our ideals and our potential.To read the interview with Dr. Isenberg just visit www.bookclubbabble.com"}, {"userName": "Jim Donahue", "userReviewDate": "Apr 03, 2016", "userURL": "http://www.goodreads.com/user/show/25830571-jim-donahue", "userReview": "Interesting, if overlong and repetitious, look at class in American society. A stronger editing hand would have strengthened this. (If I could give half stars, I probably would have rated this 3.5.)"}, {"userName": "Biblio Files (takingadayoff)", "userReviewDate": "May 14, 2016", "userURL": "http://www.goodreads.com/user/show/3007401-biblio-files-takingadayoff", "userReview": "Massive social history of class in America, starting with the European settlers up to the present day. Despite the provocative title, it's not just about white people -- after all, the fact that there's a phrase that specifies color means the default must be not white, rather a disturbing thought. And it isn't so much about what life was like for poor people, it's about attitudes of the middle class and upper class toward working class and poor people. Again, the title says a lot about that.My interest was more with 20th century than with the settlers and 18th and 19th century Americans. That's almost half the book and it is outstanding. Isenberg talks about eugenics and veterans and the Depression and war. Pop culture portrayals are fascinating and she goes into some depth about the movie Deliverance and about politics in the late 20th century.It's all quite thought provoking especially with the 2016 Presidential election. Pundits and politicians are playing the class game but this time they have divided America into college graduates and those who have no degree. \"Uneducated\" voters or \"poorly educated\" voters are wreaking havoc on the race with their uninformed opinions. It's an interesting and timely book, check it out."}, {"userName": "BAM The Bibliomaniac ", "userReviewDate": "Mar 12, 2017", "userURL": "http://www.goodreads.com/user/show/6595648-bam-the-bibliomaniac", "userReview": "4.5! Strong! RTC2017 Lenten Buddy Reading Challenge book #23"}, {"userName": "Kathrina", "userReviewDate": "Oct 16, 2016", "userURL": "http://www.goodreads.com/user/show/2569242-kathrina", "userReview": "This book does what the best historical research can do -- shift our lens just enough to recognize the fallacies that have propped up what we take for granted as what it means to be American. Coupled with my recent reading of Between the World and Me, I can see that the American Dream has probably caused more damage to the majority of Americans than it has served. It is a thinly veneered myth that protects our belief in exceptionalism while maintaining social control over all groups that struggle under a hierarchy of power. Classism is embedded in our cultural lives, ushered through the back door during the founding of this nation, manifested through the systems of slavery, indentured servitude and land ownership, expanded westward, and conflated into every domain of social interaction. The first 2/3's of this book seem narrowly focused on federal and state machinations, but by the turn of the 20th century classism has infiltrated our popular culture, defined and defining our media preferences, defining our very identities founded in class but disguised as \"taste.\" While I felt a bit frustrated that this author's inquiry could have cut even deeper into a cultural analysis of contemporary class distinctions (hello, Trump), she has certainly laid a reliable groundwork for future research. Recommended."}, {"userName": "Vannessa Anderson", "userReviewDate": "Sep 17, 2017", "userURL": "http://www.goodreads.com/user/show/1380029-vannessa-anderson", "userReview": "Because White Trash read like a textbook it was a laborious read and I found it a challenge to stay focus on the story. My take-away was how horrible white people with money and power can be to people who are not white and to women and children. I learned how horrible white people with money and power can be to white people without money and whom they consider beneath them. Then you have whites without money and power who cause harm to non-whites, women and children to feel they are above the grade.Hum /u>― many voters have Stockholm Syndrome because they continuously vote their oppressors/abusers into office. Whether they develop a psychological alliance with their captors as a survival strategy during captivity (politicians and rich and powerful individuals) or due to their refusal to educate themselves. Though White Trash was an informative read and should be read by the masses, it was not written for the masses.― reconstruction pitted poor white trash against newly freed slaves― some founding fathers believed poor people were subhuman― Theodore Roosevelt embraced sterilization of poor whites― if you can convince the lowest white man he’s better than the best colored man, he won’t notice you’re picking his pocket ― hell, give him somebody to look down on and he’ll empty his pockets for you― President Lyndon Bayne JohnsonAfter reading White Trash, I’ve come to the conclusion the real white trash are the rich white people with the power who have proven themselves to be not only white trash but psychopaths who manipulate people for their own self-interest."}], "description": "In her groundbreaking history of the class system in America, extending from colonial times to the present, Nancy Isenberg takes on our comforting myths about equality, uncovering the crucial legacy of the ever-present, always embarrassing––if occasionally entertaining––\"poor white trash.\"The wretched and landless poor have existed from the time of the earliest British colonial settlement. They were alternately known as “waste people,” “offals,” “rubbish,” “lazy lubbers,” and “crackers.” By the 1850s, the downtrodden included so-called “clay eaters” and “sandhillers,” known for prematurely aged children distinguished by their yellowish skin, ragged clothing, and listless minds.Surveying political rhetoric and policy, popular literature and scientific theories over four hundred years, Isenberg upends assumptions about America’s supposedly class-free society––where liberty and hard work were meant to ensure real social mobility. Poor whites were central to the rise of the Republican Party in the early nineteenth century, and the Civil War itself was fought over class issues nearly as much as it was fought over slavery.Reconstruction pitted \"poor white trash\" against newly freed slaves, which factored in the rise of eugenics–-a widely popular movement embraced by Theodore Roosevelt that targeted poor whites for sterilization. These poor were at the heart of New Deal reforms and LBJ’s Great Society; they haunt us in reality TV shows like Here Comes Honey Boo Boo  and Duck Dynasty. Marginalized as a class, \"white trash\" have always been at or near the center of major political debates over the character of the American identity.We acknowledge racial injustice as an ugly stain on our nation’s history. With Isenberg’s landmark book, we will have to face the truth about the enduring, malevolent nature of class as well.", "title": "White Trash: The 400-Year Untold History of Class in America", "url": "http://www.goodreads.com/book/show/27209433-white-trash", "average": 3.73, "cover": "https://images.gr-assets.com/books/1483563991l/27209433.jpg", "reviews": 2020, "authors": [{"url": "https://www.goodreads.com/author/show/143066.Nancy_Isenberg", "name": "Nancy Isenberg"}], "type": ["History", "Nonfiction", "Sociology", "North American Hi...", "Politics"], "outlinks": ["http://www.goodreads.com/book/show/27209433-white-trash", "http://www.goodreads.com/book/show/29556560-white-trash", "http://www.goodreads.com/book/show/31699854-white-trash", "http://www.goodreads.com/book/show/29458887-white-trash", "http://www.goodreads.com/book/show/244625.Fallen_Founder", "http://www.goodreads.com/book/show/340709.Sex_and_Citizenship_in_Antebellum_America", "http://www.goodreads.com/book/show/797786.Mortal_Remains", "http://www.goodreads.com/book/show/1143076.Gender_and_the_Law", "http://www.goodreads.com/book/show/8153244-madison-and-jefferson"]}