{"ratings": 1192, "userreviews": [{"userName": "Jacqie", "userReviewDate": "Nov 14, 2011", "userURL": "http://www.goodreads.com/user/show/2133111-jacqie", "userReview": "This was a prettily written book with no discernable plot. I couldn't really get a picture in my head of Escoffier, his wife Delphine, or Sarah Berhardt- their images kept sliding away, possibly because the writing of the characters seemed to be more about creating dramatic impact than developing character or consistancy. There were all sorts of imagery that were beautiful (description of an Impressionist exhibit), but I just couldn't believe anything happening in the book would really happen. There was talk about Escoffier trying to feed starving Parisians horsemeat, but he would garnish the horse with truffle and foie gras. What??!! In fact, truffles and foie gras were everywhere, in almost every meal. Now, I like both these things, but even I, a devout foodie, got tired of reading about them with every meal. If I had believed in the accuracy of the book, I would have been more interested in reading about the meals, but I couldn't believe that I was reading anything other than the fancy of the author. I do like some reliable historical accuracy in my historical fiction, and I couldn't trust that I was getting it here.So, imagery was indulged, I fear, at the expense of any realism. Maybe I'm wrong about this. But I couldn't fall into the story because I couldn't trust the author to give me something realistic in this work of fiction. Does that make sense?I also did not get the sense of any relationships in the book. Escoffier stood alone, as did Delphine. They did things that made no sense to me (filling a house with tomatoes, cutting hands with a wine bottle in the kitchen) and again I had no greater context to see what was happening. What exactly was going on between the French and the Germans that made the wine bottle meal so fraught? What was the importance of tomatoes? I don't want to wait a hundred pages to figure out the answer. So, ultimately, the book's meaning eluded me. Maybe I didn't get the symbology. Or maybe this was a matter of style over substance. Truffles garnishing horsemeat. (See, I can do a metaphor too!)"}, {"userName": "Sharon", "userReviewDate": "Nov 12, 2011", "userURL": "http://www.goodreads.com/user/show/1120957-sharon", "userReview": "Such an imaginative book based on facts. I thoroughly enjoyed the story and all the rich, vivid details of place and food. Escoffier is an important historical figure. The main points are facts: where he lived and worked, his wife, his mistress, and more. The author deftly filled in what his life could have been based on known facts she researched. It's a fascinating story about an unusual man. For those with culinary interests, there are intriguing food tidbits, but the story can be enjoyed by anyone. Culinary students learn about Escoffier's important contributions to the way we eat today but may know little about his personal life and what kind of person he was. Escoffier's housekeeper in late life and many famous people of the time are prominent in the book. Culinary folk will recognize the name of Brillat-Savarin, another brilliant chef. Both of them used truffles, caviar, and fois gras liberally in their creations, as well as wines -- the wines sometimes used to drug crayfish and lobsters before cooking. Many such charming details pepper the story. Escoffier and his wife, Delphine Daffis, a poet, lived in Monte Carlo. Escoffier worked in Paris and England and was often away from home for months or years at a time; Delphine refused to move away from Monte Carlo. A couple of lovely romantic seduction scenes involve food and are all the more sensuous and unusual for that. There are bits of other history and war history and the Titanic plays into the story as well.I loved this book and those who like historical fiction should enjoy it. Culinary enthusiasts will relish the richness of details. Although we will never know who Escoffier really was, this book is a beautiful and realistic tapestry of who he might have been. The writing is a joy to read. It helps to know a little French but isn't necessary.Best of all, I learned a great deal reading it. I think some of those who have reviewed this book poorly didn't really read and understand the book. That's apparent by comments made that are erroneous compared to the text of the book. Every author gets some of those, but authors who write intelligently seem to get more of those, unfortunately."}, {"userName": "Rebecca Foster", "userReviewDate": "Feb 24, 2013", "userURL": "http://www.goodreads.com/user/show/5875398-rebecca-foster", "userReview": "“When we cook we know perfection: we can touch it; we can create it. We are like gods.” I enjoyed Kelby’s sumptuous fictional biography of French chef Auguste Escoffier, the founder of the dining rooms at the Savoy and the Ritz Carlton and developer of menus for, among other famous ventures, the Titanic.As the novel opens he and his wife, poet Delphine Daffis, are in their eighties, living out their penurious senescence in Monte Carlo, Monaco, with a rotating cast of children and grandchildren and a cook of dubious skill, the feisty red-headed Sabine, who bears a curious similarity to Sarah Bernhardt, Escoffier’s long-time lover. Escoffier has created so many named dishes over the years – acts of homage to Sarah and to other celebrated individuals – and now it is Delphine’s last wish to have Escoffier create a last dish in her honor, before it is too late. “‘Words are clumsy and limited by nature,’ [Escoffier] said. ‘Only food can speak what the heart feels.’”The narrative flashes back to highlights from Escoffier’s cooking career in London and Paris, through third-person sections as well as through first-person chapters of ‘memoirs with recipes’ in Escoffier’s own words. “Cooking is the marriage of science and poetry...Luck has no place in the kitchen. Science. It is always science,” he insists. “If a menu is not poetry, what is it, then?”Kelby might not be the best at moving a plot along in an interesting manner, but she does write mouth-watering descriptions of feasts with preposterously rich dishes: Escoffier’s favourite ingredients included truffles, foie gras, caviar and lobsters. Despite their shared culinary subject matter, I can hardly imagine a novel more different to Nora Ephron’s Heartburn – but both are delightful in their own way."}, {"userName": "Emily Crowe", "userReviewDate": "Dec 16, 2011", "userURL": "http://www.goodreads.com/user/show/3873198-emily-crowe", "userReview": "First of all, isn't this a lovely cover, sensuously hinting at all of the good food writing contained therein? I do believe that it is the cover the first drew me to this book back when my Norton sales rep, David, was in town. He left me a copy of the ARC months ago but I'm just now getting around to reading it. Like that sweatshirt that my mom got me says, it's always a case of So many books, so little time. This is the story of the great French chef, Escoffier, and his life and loves, told in a variety of ways: from the present, in which his wife Delphine, is dying but longing for him to create a dish in her honor; from chapters of the memoir which the present Escoffier is currently writing; and from the past, in which we get third person accounts of Escoffier's feats, ranging from wartime survival to loving Sarah Bernhardt, to running the kitchen at the famed Savoy in London. This hodgepodge of narratives robs the book of any real coherence. Early on, at least, the chapters alternate on a regular basis but in the latter half of the novel it switches a little willy-nilly and the novel suffers from this lack of continuity.There are some gorgeous passages describing food in this novel--probably the best food writing I've read since Muriel Barbery's Gourmet Rhapsody. And I found my heart aching a little bit for Delphine, who on her death bed wants her husband to pay her the same compliment that he's paid his lovers through the years: to immortalize her through food. But there is very little character development here, and what little there is of Escoffier's development leaves me vastly disinterested in him. He seems to be a man of neither action nor honor. The writing serves the story well enough, and there are a few moments of simple eloquence of art, food, & truth--and that narrative integrity simply be a matter of perception: \"Impossible stories--they are the key to all good restaurants. It [the \"fresh\" sole] could be frozen; it makes no difference. The diner will think it fresh, glorious. He pays for the story. If the story is told well, with imagination and conviction and the right amount of ego and embroidery, then it is true enough. And something that is true enough is all anyone can ever ask for.\"If I had gone into this novel with any sort of expectations, I might say that I was disappointed. But instead I'll say that this was a pleasant interlude between far more serious and literary novels--an amuse bouche, if you will. In the end I found myself not caring much whether Escoffier created a dish for Delphine or not, or whether he had betrayed his country or not, or whether Sandra Bernhardt was pitiable or not. Reading about the intense passions the French reserve for their food, however? Now that was worth the prix fixe dinner!"}, {"userName": "Ron Chicaferro", "userReviewDate": "Mar 05, 2012", "userURL": "http://www.goodreads.com/user/show/4148484-ron-chicaferro", "userReview": "A truly amazing book - excellently researched and written. It's the story about the great French master chef Auguste Escoffier and his rise to fame in France and around the world. It's also a tender love story. Escoffier's love of his wife and also his powerful love for the great actress of the time Sarah Bernhardt. This novel takes place from around the late 1800's to Escoffier's death in 1920. The book is rich with powerful figures of the time - from well known world leaders to politicians and artists. The book is something else as well - a great and wonderful treasure trove of food and recipes from Escoffier's own books. Food is the golden thread that works its way through the book and holds all the characters together. Almost every page has something about the magnificent and glorious food - an almost sensual relationship begins between the reader and the words. N.M. Kelby knows how to write - her description of the food and the relationship between the characters is like a work of art. Magnificent!"}, {"userName": "Judy", "userReviewDate": "Nov 09, 2012", "userURL": "http://www.goodreads.com/user/show/3131238-judy", "userReview": "The story of chef, Auguste Escoffier, and the two women he loved, his poetess wife, Delphine Daffis, and the actress, Sarah Bernhard. This is a book that foodies would enjoy as it contains some of Escoffier's recipes, plus quotations from his books. This books is only rated 3.44 stars, but I thoroughly enjoyed listening to the audio version narrated by the author."}, {"userName": "Silver", "userReviewDate": "Nov 07, 2011", "userURL": "http://www.goodreads.com/user/show/1430273-silver", "userReview": "A charming, witty, and sometimes heartbreaking story about love, loss, endurance, and most importantly food! I found this book thoroughly enjoyable to read. I have always found the culinary arts to be interesting, and think it can be fascinating the way in which throughout time food has been used within literature. One of the things which I really enjoyed about this book is the way in which throughout from beginning to end food is used to convey a story, to inspire emotions and evoke all of the senses. I found \"The Complete Escoffier: A Memoir in Meals\" particularly charming. The books tells of the story of famous chef Escoffier and his great passion for both food and women, as he struggles between the two women whom hold his heart. His lover time lover, the notorious and outrageous actress Sara Bernhardt and his wife who he carried a deep and complex love for the poet Delphine. As proof of his lover to her Delphine requests the one thing which Escoffier cannot give because of the very nature of his love for his wife. Delphine wants to be immortalized through food, and requests him to make a dish in her name. Throughout his career he has made dishes for countless famous personalities and countless dishes for his Sara, but whenever his wife asks he refuses. She believing it a sign that he has forgotten his love for her, but he finds it impossible to find any dish that is worthy of capturing her. The story goes back and forth between the amusing episodes of Delphine as an old sickly woman trying to enable the help of their servant Sabine, to get Escoffier to make her a dish before she dies. Sabine is outspoken, and a notoriously bad cook, most noted for her resemblance to the famous Sarah. And the early days of Escoffier's life. His passion for Sarah, the devolvement of his career and his sorrows and joys."}, {"userName": "Damaskcat", "userReviewDate": "Feb 08, 2013", "userURL": "http://www.goodreads.com/user/show/6945307-damaskcat", "userReview": "Escoffier – world famous chef – won his wife Delphine in a billiard game. In spite of this unpromising but romantic start to their married life they do stay married and died within a fortnight of each other. But in between they spent many years apart with Escoffier working at the Savoy in London and Delphine remaining in France to bring up their children. The book starts with Delphine seriously ill and wanting Escoffier to create a dish in her honour. Throughout his life he has created many dishes in honour of many beautiful and famous men and women but he has never created one names after his wife.The story of Escoffier’s life is told in flashbacks. His relationship with the legendary Sarah Bernhardt dominated his life and Sabine, his current assistant, bears a resemblance to Sarah. I did enjoy this book though I found the chronology difficult to follow at times. The descriptions of famous meals are fascinating reading. I thought the characters were well drawn and I had a huge amount of sympathy for Delphine and for Sabine.What comes over very well is Escoffier’s love affair with food. Every dish had to be perfect but many used simple fresh ingredients and relied on quality for the flavour. I found the relationship between Escoffier and Delphine convincing and it was clear they meant a lot to each other in spite of the huge amount of time they spent apart. This is a book to sink into and savour and the momentous events of the first thirty years of the twentieth century provide a tense backdrop to the food reminding the reader that whatever is going on in the world people still need to eat."}, {"userName": "Diane S ☔", "userReviewDate": "Oct 19, 2011", "userURL": "http://www.goodreads.com/user/show/4159922-diane-s", "userReview": "This is a delightful but somewhat simple book. There is no overt action and yet it is fascinating. It cover a portion of the life of the famous chef Escoffier, who defined cuisine at the Savoy and the Ritz. Although the story skips around, between different time periods, which was a bit confusing at first I decided to just delight in each chapter regardless of where in history it was. The main story is Escoffier returning home to his wife, who he had not lived with for thirty years, when they are both dying and he is 80 yrs. old. The history covered was amazing, from the Franco Prussian War to World War 1, famous artists, the actress Sarah Bernhardt and famous novelists. The food descriptions were wonderful and the way he sees food, the amazing menus he created and the dishes he names after famous people, all are related clearly so that the reader understands. Superb book!"}, {"userName": "Jennifer Cain", "userReviewDate": "Nov 14, 2011", "userURL": "http://www.goodreads.com/user/show/781242-jennifer-cain", "userReview": "I received WHITE TRUFFLES IN WINTER as a First Reads giveaway. It was delicious. Although I have read books with food relations in the past, they have always seemed a little cheesy (not a bad thing). However, this is the exception. The book detailed romance and elegance. Who ever knew there were so many uses for fois gras, champagne, and truffles?Historical figures played a prominent role in the story yet it remained fiction. I enjoyed the eccentric nature of Sarah and the chef's dedication to her relationship. I did find the style a little difficult at times. However, this only added to the feeling of the work. Some may find the book a challenge and not light hearted romance reading I first expected."}, {"userName": "Patricia", "userReviewDate": "Jun 18, 2012", "userURL": "http://www.goodreads.com/user/show/5862535-patricia", "userReview": "A fictionalized life of Auguste Escoffier - the chef who set the stage for how we dine today in courses. The story is set primarily when he and his wife are approaching death and her greatest wish is that he create a recipe for her, like he has done for so many others - including many for his lifetime lover, Sarah Bernhardt. The book moves back and forth between the past and the end of Escoffier's life, telling the story of his tumultous loves, his passion for food and cooking, and his career in the restaurant industry. Well written--the descriptions of the sights, smells and tastes of food are wonderful. Interesting to read about Sarah Bernhardt - what an intriguing woman - the late 19th/early 20th century Madonna/Lady GaGa."}, {"userName": "Stephanie", "userReviewDate": "Nov 18, 2011", "userURL": "http://www.goodreads.com/user/show/3447714-stephanie", "userReview": "I LOVED this book. It reminded me of Like Water for Chocolate...I was mesmerized with the characters, the culture, the descriptions...Even though I would not have eaten some of the meals that the chef prepared, I was fascinated with his passion for his trade and how expressed himself with his meals. I also loved his tangled life as passions for those he loved.I would recommend this book in a heartbeat. It is a book that will stay with me forever."}, {"userName": "Kate", "userReviewDate": "Aug 27, 2016", "userURL": "http://www.goodreads.com/user/show/3594188-kate", "userReview": "I’ve just finished a story about a chef who won his wife in a pool game; worked in the finest hotels in the world; saved hundreds of people from a fire; cooked for kings and queens; had affairs with high-profile women; fought in wars; lived apart from his wife for decades but spent his last months with her; coined a word (deliciousness/ umami); and revolutionised the way kitchens were set up and run.It may sound like fiction but it’s all part of the life of French chef, Auguste Escoffier. It’s remarkable stuff. Yet with so much to work with, why did I find N. M. Kelby’s novel, White Truffles in Winter, bland?Kelby’s writing style is floral – descriptive, detailed and pretty. Not my usual thing but then again, if I’m reading about simmering veal stock or kneading butter into brioche dough, it’s fine.I was also fine with the inclusion of trivial facts and descriptions of cooking techniques throughout the text, even if they appeared a little forced in some instances – mention of how famous dishes came about; the correct way to make tomato sauce; and that the number of pleats in a chef’s toque represent the number of ways he or she can cook eggs, were interesting. However, the story was not dynamic and there was a feeling of emotional detachment, or rather coolness, that left the whole thing flat.Apart from dissecting Escoffier’s past, the story focused around his wife’s dying wish that he creates a dish specifically for her. However, I struggled with the love in this story. I didn’t feel Escoffier’s desire for anyone, let alone the fact that he was supposedly torn between his wife and actress Sarah Bernhardt. His relationships with both women lacked passion – without passion and desire, it’s hard to convince the reader of motive.There was light relief in the character of Sabine, a feisty young woman employed to look after the Escoffier’s in their dying days –“…she’d fallen asleep with the book in her hand dreaming of the line ‘One must not forget that good, sound cooking, even the very simplest, makes a contented home.’The next morning she awoke wanting a cigarette and a sailor. Unfortunately, neither was readily available…”Alas, not enough to make this book wholly satisfying.2.5/5 If you like reading about food, it’s a good pick, otherwise…P.S. I don’t think this is overthinking Bearnaise sauce, do you?!“Even many years later when you find yourself standing by your son’s grave, there are no words that can describe that moment, the depth of it. But a sauce can reflect that moment. Nothing speaks more accurately to the complexity of life than food. Who has not had, let us say, a Bearnaise, the child of hollandaise, and has not come away from the taste of it feeling overwhelmed?At first, it fills the mouth with the softness of butter and then the richness of egg, and before it becomes too rich or too comfortable, the moment shifts and begins to ground itself in darkness with the root of a shallot and the hint of crushed peppercorns. But then the taste deepens. The memory of rebirth is made manifest with the sacred chervil, sweet and grassy with a note of liquorice, whose spring scent is so like myrrh that it recalls the gift of the Wise Men and the holy birth whenever it is tasted. And then, of course, the ‘King of Herbs’, tarragon with its gentle liquorice, reminds us not to forget that miracles are possible. And just when we think we understand what we are experiencing, the taste turns again on the tongue, and finishes with shrill vinegar, followed by a reduction of wine, so that the acid tempers the sauce but never dominates. And, finally, in your mouth, you have the entire experience of father and child that you tried to put into words – from the fleeting comfort to the moment where you finally realize that life is beyond your control and everything needs balance, even faith.”"}, {"userName": "Sandie", "userReviewDate": "Oct 28, 2011", "userURL": "http://www.goodreads.com/user/show/1331967-sandie", "userReview": "The first thing to remember when reading WHITE TRUFFLES IN WINTER by N.M. Kelby is that while the three central characters are \"real\" the story itself is the work of the author's rather vivid imagination. In it she conjures up a tale of food, love, and the love of food. Her imaginative journey into the life of food-obsessed chef, Auguste Escoffier, his unconventionally liberated wife, poet Delphine Daffis, and the \"other woman\" in his life - the bold, free-spirited Sarah Bernhardt is as delectable to one's reading palate as the dishes created by this amazing chef who pioneered French cuisine.Being neither a gourmet cook nor an expert in fine dining, I was not personally familiar with the name Auguste Escoffier but discovered that I was, however, familiar with some of the dishes he created like Peach Melba and Cherries Jubilee (created for Queen Victoria) as well as some of the famous places where he plied his talent like The Ritz, The Carlton and The Savoy hotels.The tale is basically told in retrospect by an aged Escoffier and combines the story of his unconventional love life with unusual recipes, related in a most uncommon manner. At times the recipes almost overwhelm the story as Kelby chooses to demonstrate Escoffier's compulsion for creating the new and unusual in an effusive and highly romanticized fashion. For this reader at least, some of this descriptive writing was a little \"over the top\" and flowery in conveying the message that Escoffier could never really be as loving and devoted to any woman as he was to his first true love, food for which he abandoned family, friends and homeland. Author Kelby presents an interesting take on the life of Escoffier and his many contributions to the art of cooking. Possibly his most important contribution can be appreciated by folks such as Bobby Flay, Emeril Lagasse, Gordon Ramsey, and their ilk since it was Escoffier who raised the bar, so to speak, in elevating the \"cook\" from the status of lowly servant to \"chef\", a respected and financially rewarding profession in addition to introducing the organized discipline necessary to successful restaurant kitchen management. Overall, this is a book that makes every reader consider their own relationship with food and whether it could every reach the level of obsession experienced by Escoffier. One last question: Is the title of the book and it's placement in the novel a metaphor for the initial beauty of youth which we try in vain to preserve from the inevitable passing of time and of the ultimate decay and death which awaits us all?- 3 ½ stars"}, {"userName": "Andrea", "userReviewDate": "Feb 25, 2012", "userURL": "http://www.goodreads.com/user/show/1898129-andrea", "userReview": "This book was the selection for a book club I was asked to join. Most of the people in it are great cooks and several grow their own food. I was a little intimindated to join since I do not like to cook and I was not sure if the book was going to be too abstract for me. I am ashamed to admit I did not even realize Escoffier was a real person until more than halfway through the book. This book was something I never would have picked myself but that is the beauty of a book club- reading outside my comfort zone and finding something interesting and enjoyable. I had to frequent Google as I looked up the time frame and some of the historical references that I was not familiar with. I was never sure what was fact and what was embelished for the story.Although it may have made it a bit hard to follow, I enjoyed the fact that the narrative jumped between time frames and points of view. The descriptions of some of the culinary delights, the preparation, and presentation were downright poetic. However it just confirmed the fact that cooking is an anxiety producing effort for me. I know most of the women in the group could not get past Escoffoer’s infidelity and they did not care for him as a character. In fact he had several unscrupulous practices that were romanticised. While he was not a likeable character I do appreciate his passion for his art-and it truly was an art to him, even if he had to embellish the truth to give the illusion of what would please the aristocrats that he often served. There was something I found hopelessly romantic about his return to his wife at the end of his career, and the way they were able to reconnect on a primal level-over food of course. I don’t know if I would recommend this book to anyone I know but I did enjoy it and some of the quotes that stuck with me. Perhaps love is the worst addiction of all. describing Barnum He was an unparalleled promoter, unrepentant liar and public dreamer-a man with a chef’s heart.Happiness is our best revenge.“I love you Madame Escoffier.”“There were times when you had forgotten this.”He said nothing. It ws true and they both knew it.“To be forgotten is the saddest thing of all,” she said."}, {"userName": "Simmonsmry", "userReviewDate": "Jan 24, 2012", "userURL": "http://www.goodreads.com/user/show/1363602-simmonsmry", "userReview": "In this decadent novel, author N.M. Kelby transports readers into the world of acclaimed French chef, Auguste Escoffier, towards the end of his life as he is writing his memoirs. Also focusing on his ailing wife, Delphine, and his impudent housekeeper, Sabine, it tackles his life beyond the kitchens of the world’s finest hotels.Escoffier is a passionate chef who loves everything about food preparation down to lovingly caring for the tools of his craft. This passion, at times, overcomes everything around him. He escapes into his work and is able to ignore his surroundings and circumstances. The same appears to be true of his memoir writing, which allows him to escape into his memories and avoid the painful present.Kelby writes in a sensual, evocative style. Her mouth-watering descriptions of food provide a backdrop into which she inserts mysterious, distant characters one can never quite grasp. Their motivations are often elusive, their actions evasive, and their behaviours intriguing. All of these elements invite readers to draw their own conclusions.I found the memoir vignettes quite appealing since they combined storytelling and recipes. The cookbooks I love the most give the background and inspiration of the dish being prepared and these chapters were reminiscent of such books, adding another dimension to the novel.I must admit that before reading this novel I didn’t know much about Escoffier, who has been called the father of modern French cuisine, and was somewhat amazed at all the culinary wonders and techniques attributed to him. It reminded me of why I love historical novels: if written and researched well, they transport readers to another time and place and cast a spotlight on historical figures that have shaped our experiences in the present. Kelby manages this feat with panache and style. Stirring ingredients of truth into a bowl of fiction, she creates an extravagant recipe. ‘White Truffles in Winter’ is an indulgent read that you don’t want to resist."}, {"userName": "Wendy", "userReviewDate": "Mar 26, 2012", "userURL": "http://www.goodreads.com/user/show/5737552-wendy", "userReview": "The descriptions in this book were lush and playful. The descriptions of food and cooking were especially well done. I think that Kelby captured the right balance of the sensual and cerebral that is at the heart of a lot of fine cuisine. Yet somehow, after all of those dazzling moments, I was not completely satisfied. I've thought about that and I've decided that that feeling is actually a credit to the novel. Part of my problem is due to a personal sensitivity. I almost cannot bear stories of infidelity--even emotionally complex ones like this one. I also have little patience with characters like Bernhardt--those untouchable, doomed, self-consciously eccentric, and capricious creatures of isolated privilege. She is a more palatable version to be sure. Maybe it was the characterization as a whole that gave me trouble. I found myself immediately fixing on Delphine, but the novel never let me get that close to her. Or to anyone, really. What I wanted, I suppose, was the story of their marriage. Why did he choose her? What were they thinking? We get a sense in general but I wanted a fuller exploration--details, details, details. But that would be what--like a fast food meal? Superficially good because it relied on too much sugar, too much fat, and too much salt to mask its lack of substance? What this is closer to is a gourmet meal--complexity of flavors and ingredients, doled out in small portions. Enough to tantalize but not to fill. Sweet, salt, and fat balanced with bitter, acid, and--ah, yes...deliciousness. I'm not saying that this is the most brilliant novel I've read. Far from it. But I give it credit for not taking the easy way out even if that is what I wanted it to do. It is pleasurable and interesting. It is like the veal stock that is described in the book itself. It is substantive in a way that isn't flashy. I would give this one 3.5 stars if I could."}, {"userName": "Radostina", "userReviewDate": "Jan 16, 2013", "userURL": "http://www.goodreads.com/user/show/16458714-radostina", "userReview": "Бели трюфели през зимата е една изящна книга, която стимулира сетивата и гъделичка въображението по много и различни начини. Признавам, че когато я купувах, нямах представа нито кой е Огюст Ескофие, нито каква е значимостта му за съвременната кулинария. Очаквах биографичен роман, по-скоро скучноват и информативен, отколкото интригуващ и чувствен. Оказа се, че съм била в голяма грешка. Бели трюфели през зимата всъщност е една прекрасна плетеница от биографични факти от живота на великия готвач и художествена измислица, която умело попълва празнотата във фактологията и придава на книгата привкус на исторически роман. Като любител-кулинар, останах дълбоко впечатлена от живите детайли от кухнята, фините блюда, посветени на известни исторически личности, кулинарните тънкости, ароматите и вкусовете, преливащи от страниците, стремежа към съвършенство, стил и изисканост дори и в смутните военни времена, пълната отдаденост на страстта към готвенето като проекция на страстта към живота. Тази книга ме накара да се замисля за пореден път за това как на пръв поглед дребните неща в живота ни могат да му придадат не смисъл--защото \"смисъл\" е твърде шаблонно и банално понятие--но да му придадат обаятелност, очарование, страст и желание да го изживеем по един красив и вдъхновяващ начин. И макар на ниво персонажи да не успях да усетя добре никой от главните герои--освен може би колоритната Сабин--детайлите, изпъстрили тази странна смесица от биография, личен дневник и готварски наръчник с рецепти ме заредиха с толкова жива, бликаща енергия за живот, която дълго ще помня. Това е книга, която вероятно няма да допадне на всички; може би мнозина ще я намерят за скучна, но несъмнено ще има и такива, които са в подходящото разположение на духа, за да оценят пъстрата палитра от емоции, които тя предлага: Храната е едно прекрасно вълшебство, а да повярваш във вълшебствата и да ги създаваш, е изключителен и необходим акт.И така. Мълчаливо. Гответе."}, {"userName": "Shorty", "userReviewDate": "Aug 19, 2012", "userURL": "http://www.goodreads.com/user/show/3347032-shorty", "userReview": "A truly amazing book - excellently researched by the author, and superbly written. It's the story about the great French master chef Auguste Escoffier -a real chef- and his rise to fame in France (and around the world). It's also a tender love story. Escoffier's love of his wife was legendary, but not as well known as his powerful love for the great actress of the time Sarah Bernhardt. This novel takes place from around the late 1800's to Escoffier's death in 1920. Kelby's novel is rich with powerful figures of the time - from well known world leaders to politicians and artists. The book is something else as well - a great and wonderful treasure trove of food and recipes from Escoffier's own books. Glorious masterpieces of food are the golden threads that work its way through the book and these threads hold all the characters together. Almost every page has something about the magnificent and yummy dishes, so that an almost sensual relationship begins between the reader and the words. N.M. Kelby knows how to write - her description of the food and the relationship between the characters is like a work of art. Her words are poetic, and clearly show about life at a time when things were more simple.. except for the love of beauty in food. Nourishing and fulfilling, this book will make you fall in love; both with the author, and the characters.Magnificent!!**A special note for N.M. Kelby: I read every word that Escoffier said, in David Suchet's voice. Like when he's playing Poirot? Yeah... and I loved it even more. :D"}, {"userName": "Susan", "userReviewDate": "Nov 03, 2011", "userURL": "http://www.goodreads.com/user/show/1183221-susan", "userReview": "As the world marches toward the Second World War, the famous chef Auguste Escoffier and his wife, the poet Delfine Defis, are destitute and nearing death at their villa in Monte Carlo. During much of their marriage, the Escoffiers have lived apart, due to his long affair with the actress Sarah Bernhardt. Escoffier created and named many dishes for Bernhardt, but never one for his wife. Now, together again, Delfine wants a dish created by Escoffier for her, and hires a cook with an uncanny resemblance to Bernhardt to inspire him.I had some difficulties with this book. I found it difficult to follow what was going on in the present time, but thoroughly understood and enjoyed the flashbacks. At the end of the story, I discovered that the flashbacks had filled in for me what was going on in the present part of the story. But some of the book was frustrating for me while I was reading it. It was interesting to see Escoffier's connection between food and passion, food and love, and food and life, much as an artist or musician would make that connection with their art and passion, love and life. I particularly enjoyed the excerpts from the book that the author has Escoffier writing at the time of his death. All in all a very enjoyable and informative novel. The best part is getting to say over and over in you mind as you read the name Escoffier. It has a lovely sound."}, {"userName": "Anne", "userReviewDate": "Oct 24, 2011", "userURL": "http://www.goodreads.com/user/show/625062-anne", "userReview": "In this novel, Kelby takes on the story of unparalleled French chef, Auguste Escoffier. During her research, she found few accurate facts regarding the man, so in this work of fiction, she takes many liberties in detailing his life.In lush sensual prose she describes Escoffier's obsession with food and his ability for great passion. She tells of his time as a cook in the Franco-Prussian War, as master chef in restaurants in both Paris and London, and as a close friend to nobility and world leaders. The heart of the story, however, is his love for two very different women: the actress Sarah Bernhardt, and his wife, the poet Delphine Daffis, whose hand in marriage he gambled for in a game of billiards. To quote a favorite passage (p. 194): \"Jesus is quite a popular fellow with my people and has many small sausages named after him in the Basque and Savoy regions. However, since Christ was born a Jew in a pig-less culinary culture, I doubt very much if he would approve this bounty of saucissons and yet, it matters not. They fly off the shelves, especially at Easter.\"Guilt does wonders for the appetite.\"A wonderful read, about a fascinating man."}, {"userName": "Lisa", "userReviewDate": "Jun 08, 2012", "userURL": "http://www.goodreads.com/user/show/6137330-lisa", "userReview": "This was an uneven telling of a story. It seemed as if this was a manuscript a decade or more in the making that had its limbs pasted together. On the upside Auguste, Delphine, and Sarah had distinct points of view and voice. The recipes added luscious depth to characters and circumstances. Sometimes the dialog and narration was cohesive and captivating, especially for the final third of the book.Too many times the weight of situation was treated with allusions, as in the suicide of Xavier. Often times the tensions of WWI and tensions leading up to WWII were served as scrambled eggs. References to some WWII dynamics were anachronistic. The author did better when she told story of \"great war\" from the perspective of the minor characters. To make allusions to Hitler and Mussolini was a shallow attempt to add gravity.I would not recommend this book. I would read a overhauled new edition to this story--even if it takes another decade. The writer has skill, but lost the stamina to apply it thoroughly from beginning to end."}, {"userName": "Randi", "userReviewDate": "Mar 08, 2012", "userURL": "http://www.goodreads.com/user/show/7428509-randi", "userReview": "Loved the premise of the book but unless you're a major foodie many of the details will be over your head. The author spends more time on the food descriptions than she does on character or plot development. While I love food and cooking, I ended up skimming most of the cooking details because they made no sense to me. Wish the author had spent more time giving more insight into the choices the characters make. Why does Escoffier choose Delphine? What caused such a major rift between the two? The entire relationship between Escoffier is so complex I wish that more detail was given to the choices they made. Also while I love aspects of each of the characters at the end of the novel I can't say I like any of the characters. Each has an interesting detail, which they stay faithful to throughout the novel, but I don't feel like there is any real character development that would make you want to side with a particular character. Overall unless you're a foodie or an expert on Escoffier, there are better historical novels out there."}, {"userName": "Terryann", "userReviewDate": "Nov 28, 2011", "userURL": "http://www.goodreads.com/user/show/799650-terryann", "userReview": "Kelby, N.M. White Truffles in Winter. unabridged. 9 CDs. 10.5 Hours. Books on Tape. Nov 2011. ISBN: 978-0-307-97034-3 $40.00. FAuguste Escoffier once the King of Chefs and Chef of Kings was a passionate romantic, obsessed with the the 5th taste - deliciousness - and beautiful women. As his poetess wife of 55+ years, Delphine Daffis Escoffier, is in her death bed, Auguste reminisces about his life, his delectable inventions and his lover Sarah Bernhardt the beautiful, scandalous actress. Seen through the wry, witty and bitter eyes of Sabine, hired to cook for the couple in their last days, Escoffier is portrayed with compassion and sumptuousness. As the novel progresses, Escoffier, the paramount amour expert, orchestrates the ultimate romantic recipe between Sabine and his latest protoge. Read by the author who sounds like she's on the verge of laughter through most of the book, this delightful listen is well worth it, if even just for the luscious recipes. Recommended to fans of Julie and Julia by Julie Powell.-Terry Ann Lawler - Phoenix Public Library, AZ."}, {"userName": "Lynn", "userReviewDate": "Dec 23, 2015", "userURL": "http://www.goodreads.com/user/show/15265939-lynn", "userReview": "More like 3.5 stars. Historical fiction based on the real Auguste Escoffier, the famous French chef and his poet wife Delphine Daffis. The story tells of their long marriage, and his love for her and the immortal actress Sarah Bernhardt. How his career kept him from his family for years at a time and the toll it took on his relationship with his wife. In the end she wanted him to create a dish just for her, but he finds it impossible to express his deep love for her in one perfect dish. Of course the way he conducted his life belies this great love but who knows what goes on in someone's heart. But mostly this book is about his love affair with food. The descriptions of food in this book are magical. You want to weep in frustration because you can't taste what you have just read. Although parts of the main story drag a bit, the sections about food more than make up for it. The story is interesting and I'm glad I read it. But if you are a foodie, you will really love this book."}, {"userName": "Żaneta (deideinogod)", "userReviewDate": "May 10, 2013", "userURL": "http://www.goodreads.com/user/show/8526089-aneta-deideinogod", "userReview": "Język książki mnie uwiódł. Treść sama w sobie była niesamowita. Ważne, że forma jej nie przerosła. Były momenty, gdy się śmiałam, momenty, w których łzy napływały mi do oczu. Najważniejsza jednak jest inspiracja, którą dała mi ta książka. Inspiracja aby pochylić się nad wszystkim, co przygotowuję do zjedzenia. Aby nie być tylko kucharzem, ale artystą. Autorka przygotowywała książkę przez dwa lata i zrobiła to cudownie. Na moich oczach Escoffier ożył, stał się nieznośnym i, przynajmniej dla mnie, zarozumiałym szefem kuchni. Wielkim człowiekiem, który przez całe życie za ręce miał kogoś innego. Człowieka, który wykorzystywał, mamił i uwodził, sprzedawał wszystko, co potrafił stworzyć. Dlatego zapadł mi w pamięć. A ponadto tak wiele mi się z tą książką kojarzy... Porto, gagat i malarstwo. Sprzedane!"}, {"userName": "Pippa", "userReviewDate": "May 14, 2012", "userURL": "http://www.goodreads.com/user/show/1344835-pippa", "userReview": "This was an extraordinary novel that brought to life the complex chef Escoffier and those associated with him whilst being based on a few concrete facts. The descriptions throughout, particularly of the incredible dishes, were rich and complex. The food was brought to life and and as a reader my senses were awakened to the inventiveness and imagination of such a groundbreaking chef. Despite this incredible attention to detail and description, the novel flowed and the characters were well developed. I found myself being completely drawn in and believing that the events and relationships created by Kelby had happened. There is a lingering sadness throughout but this is punctuated well with the character of Sabine who is sharp and undisciplined, providing a stark contrast and yet complimenting the others."}, {"userName": "Becky", "userReviewDate": "Jun 08, 2012", "userURL": "http://www.goodreads.com/user/show/7364610-becky", "userReview": "Part Novel, part memoir, part recipe book, this is a lovely story well told. Brings to mind some of the best novels of Joanne Harris. Reading this book will make you want to cook!Historically the facts behind the book are true. Auguste Escoffier was a historical character responsible for much of what we would recognise about the modern restaurant experience. His recipes do indeed include many we would recognise today as absolute classics; such as two created for Dame Nellie Melba- the Peach Melba, and Melba Toast. He also was involved in scandal at the Savoy, followed by the opening of the Ritz Paris, and the the Carlton in London. All the facts are there includingg his probably affair with the 'Divine Sarah'. Wrapped around these bare facts is a quite lovely story that will draw you in and make you want to sample the tastes described. Really quite lovely."}, {"userName": "Sfar89", "userReviewDate": "Mar 13, 2013", "userURL": "http://www.goodreads.com/user/show/2800352-sfar89", "userReview": "I didn't fully enjoy this book. This book sounded like a good read, and is why I suggested it to my book club. I never felt a connection with any of the characters. I could have even put the book down half way and never picked it up again, and that wouldn't have bothered me. The cooking and food mentioned in the book were its only saving grace. I love to cook. I could feel my hunger as Sabine ate the langoustines in the stairwell, and licked her fingers clean. By the end of the book I realized that having passion and being passionate about some things in life is so important. White truffles in winter at least left me with that simple reminder. Find something you are passionate about, and embrace it. Even if the world around you crumbles while you do so."}, {"userName": "Candice", "userReviewDate": "Jan 13, 2012", "userURL": "http://www.goodreads.com/user/show/189647-candice", "userReview": "A fictionalized account of the life of Auguste Escoffier (1846-1935). Such beautiful writing! I could almost see, hear, feel, smell and taste the story. The descriptions of some of the dishes he prepared made me want to prepare them myself. Although fiction, many things were true. He did win his wife, the poet Delphine Daffis, in a poker game! He carried on a decades-long affair with the actress Sarah Bernhardt. He lived apart from his wife for a good deal of their marriage. N.M. Kelby tells his story with sensitivity and passion. The only negative remark I can make is that I often was unsure what time period I was reading about. Nevertheless, an absorbing read, one I assume most foodies will enjoy immensely."}], "description": "A breathtaking novel, rare and moving, about the world's greatest chef and his unruly heart. WHITE TRUFFLES IN WINTERimagines the world of the remarkable French chef Auguste Escoffier (1846-1935), who changed how we eat through his legendary restaurants at the Savoy and the Ritz. A man of contradictions kind yet imperious, food-obsessed yet rarely hungry Escoffier was also torn between two women: the famous, beautiful, and reckless actress Sarah Bernhardt and his wife, the independent and sublime poet Delphine Daffis, who refused ever to leave Monte Carlo. In the last year of Escoffier's life, in the middle of writing his memoirs, he has returned to Delphine, who requests a dish in her name as he has honored Bernhardt, Queen Victoria, and many others. How does one define the complexity of love on a single plate? N. M. Kelby brings us the sensuality of food and love amid a world on the verge of war in this work that shimmers with beauty and longing.\"", "title": "White Truffles in Winter", "url": "http://www.goodreads.com/book/show/16681281-white-truffles-in-winter", "average": 3.39, "cover": "", "reviews": 238, "authors": [{"url": "https://www.goodreads.com/author/show/94893.N_M_Kelby", "name": "N.M. Kelby"}], "type": ["Fiction", "Food and Drink", "Historical", "Cultural", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/16681281-white-truffles-in-winter", "http://www.goodreads.com/book/show/10770578-white-truffles-in-winter", "http://www.goodreads.com/book/show/15956604-white-truffles-in-winter", "http://www.goodreads.com/book/show/17282056", "http://www.goodreads.com/book/show/17906731-bia-e-trufle", "http://www.goodreads.com/book/show/163498.Whale_Season", "http://www.goodreads.com/book/show/1983023.Murder_at_the_Bad_Girl_s_Bar_and_Grill", "http://www.goodreads.com/book/show/181151.In_the_Company_of_Angels", "http://www.goodreads.com/book/show/27881966-the-stars-within", "http://www.goodreads.com/book/show/6435306-the-constant-art-of-being-a-writer"]}