{"ratings": 1791, "userreviews": [{"userName": "Geraldine", "userReviewDate": "Jul 05, 2009", "userURL": "http://www.goodreads.com/user/show/88046-geraldine", "userReview": "Finished listening to this after a few road trips. I enjoyed \"Bee Season\" much more--I think Goldberg bit off more than she could chew with this one. Her first novel was an intense study of a dysfunctional family, and her focus and writing talent really shone. \"Wickett's Remedy\" tried to be way too many things--history, social critique, epic, experimental combination of fiction and primary sources. The effect diluted the main character, Lydia, and the reader never really knows enough about her to care what happens to her, much less the lesser characters. In trying to master so many different styles and voices, most of the characters come off as either inauthentic, or in Lydia's case, just bland and prissy. (She's supposed to have worked hard to transform herself, but a few years behind the counter at a department store aren't enough to get a Southie girl with an elementary school education to start saying things like \"indecorous\" and \"sang-froid\"; meanwhile, everyone else from her neighborhood speaks in uniform Street Urchin With a Heart of Gold.) The book's flaws were really highlighted by the irritating book on tape reading, though--the Greek chorus of dead voices that shows up as marginalia in the novel are unskimmable in audio format, and become distracting and intrustive. And don't get me started on the cheesy sound effects, gah. There were passages of beautiful writing, especially the early descriptions of Boston and Lydia's internal monologue during her marriage, and I actually loved the very end, but the center did not hold. While I'll look for her next book, I hope Goldberg goes back to a more \"Bee Season\" theme and style."}, {"userName": "Pat Cal", "userReviewDate": "May 07, 2007", "userURL": "http://www.goodreads.com/user/show/79133-pat-cal", "userReview": "I thought this was absolutely charming. The writing was intelligent and had depth, yet wasn't too flowery. The plot went quietly for a while, and then things started to come together at the end. I enjoyed hearing the comments of those who had passed, as they were fiesty and very human. (Notice, we never heard Lydia's comments.) I also enjoyed how the historical background made dry facts come alive."}, {"userName": "H", "userReviewDate": "Jun 24, 2009", "userURL": "http://www.goodreads.com/user/show/1780629-h", "userReview": "I wish I could give this book a better review, as I wanted to like it. But the story was too slow to start, the device of having \"the dead\" speak to the reader in margin notes was ultimately distracting and did not add to the narrative, the interweaved story told of QD soda and the meandering of its founder felt forced, and the main character remained remote and unknown."}, {"userName": "Holli", "userReviewDate": "Apr 28, 2008", "userURL": "http://www.goodreads.com/user/show/1107216-holli", "userReview": "I liked the book better than the reviewer below. I was very interested in the history of the flu epidemic and felt the author did a good job in bringing the period to life. I also liked the margin comments by the dead—reminded me of the graveyard scene in Our Town. They demonstrated how there are always many sides to a story, depending on our perspective. They added a bit of humor and a reminder not to take ourselves too seriously. I question the reviewer’s statement that we never truly know Lydia. I felt that I knew her in that I experienced her growth from a girl into a mature woman, finding her way through grief and sadness. Ultimately, the nursing job allowed her to reach beyond herself to help others and to find love again. I also liked the way the author juxtaposed her story with the development of QD Soda. I didn’t like QD Soda, which was Goldberg’s point. I had a very bad cold while reading this book and have to admit that I worried some about my health while reading the passages about the flu! From Publishers Weekly The author of the bestselling Bee Season returns with an accomplished but peculiarly tensionless historical novel that follows the shifting fortunes of a young Irish-American woman. Raised in tough turn-of-the-century South Boston, Lydia Kilkenny works as a shopgirl at a fancy downtown department store, where she meets shy, hypochondriacal medical student Henry Wickett. After a brief courtship, the two marry (Henry down, Lydia decidedly up) in 1914. Henry quits school to promote his eponymous remedy, whose putative healing powers have less to do with the tasty brew that Lydia concocts than with the personal letters that Henry pens to each buyer. After failing to pass the army physical as the U.S. enters WWI, Henry quickly, dramatically dies of influenza, and Lydia returns to Southie, where she watches friends, neighbors and her beloved brother die in the 1918 epidemic. A flu study that employs human subjects is being conducted on Boston Harbor's Gallups Island; lonely Lydia signs on as a nurse's assistant, and there finds a smidgen of hope and a chance at a happier future. A pastiche of other voices deepens her story: chapters close with snippets from contemporary newspapers, conversations among soldiers and documents revealing the surprising fate of Wickett's Remedy. And the dead offer margin commentary—by turns wistful, tender and corrective (and occasionally annoying). Yet as well-researched, polished and poignant as the book is, Goldberg never quite locks in her characters' mindsets, and sometimes seems adrift amid period detritus. While readers will admire Lydia, they may not feel they ever truly know her."}, {"userName": "Tobinsfavorite", "userReviewDate": "Sep 06, 2011", "userURL": "http://www.goodreads.com/user/show/2265679-tobinsfavorite", "userReview": "This book spent a number of years hovering near the top of my reading list, but it kept getting bumped by other books until finally I just borrowed it from the library even though I was reading something else. For some reason, I thought this book would be about Lydia and Henry and the Remedy during the 1918 flu epidemic, but not very far into the book it became obvious that the book would not be about that at all. At first, I was disappointed, but the unexpected book was very good, engrossing, and quite a fast read.Some people have found the marginal notes distracting, but they're quite easy to deal with after a few pages. The chapters, distinct yet unnumbered, each end with fragmentary content: letters, news articles, undefined conversations; these can make the story seem fragmented, but the main narrative remains strictly chronological and uncomplicated. These other fragments give historical context or, in some cases, information that becomes more relevant as the reader continues.There is a lot dreadful withing its covers, but the book is not one of despair, neither is it graphic. The book is about loss and memory, and to a lesser (or not) degree, about how small choices carry larger repercussions.I know this book isn't for everyone, and yet, I can't quite see how that could be true."}, {"userName": "Sue Cronin", "userReviewDate": "May 26, 2018", "userURL": "http://www.goodreads.com/user/show/4004427-sue-cronin", "userReview": "Lost this book with about 30 pages left to read— agh!Found my book! 3.5 stars . I think my Boston friends would like it."}, {"userName": "Anna", "userReviewDate": "Nov 19, 2007", "userURL": "http://www.goodreads.com/user/show/325599-anna", "userReview": "I grabbed this because I liked Bee Season well enough and it cost $3 and I had nothing to read. I was well-rewarded for my $3 gamble. One thing that made the book extra-resonant with me was that I started reading it just before I got a bad head cold, so the whole time I was reading about the Spanish Influenza outbreak, I was sick as well. It was weird. I'm not recommending contracting the flu before you read, though.This novel isn't structured like most others; Goldberg uses margin notes to correct misremembrances (real word? don't know; don't care; you know what i mean) of the protagonist. The secondary plot is woven in through newspaper articles and other ephemera. Part of the enjoyment of reading the book is figuring out where all the secondary information fits in with the main story; it's very satisfying when you get it.One reason I liked Bee Season was the word choice and turn of phrase Goldberg has such a way with, and this book retained that quality."}, {"userName": "Sheila", "userReviewDate": "Jul 29, 2013", "userURL": "http://www.goodreads.com/user/show/3368055-sheila", "userReview": "I wanted to read this book to learn more about the 1918-1919 flu epidemic. While I did learn more about the epidemic, I was not happy with the style of writing. I found the anecdotes written in the margins of each page disrupted the flow of the story. I finally stopped reading them. There were letters written throughout the book but it took me a long time to figure out who was actually writing them. I'm not sure what they added to the story. Lydia marries a young man, Henry who is in medical school but after they have been married for a short while, Henry decides to quit medical school and develop Wicketts Remedy which he sells by mail. Then the 1918 flu epidemic hits Boston. Lydia decides to travel to Gallops Island to help with a research study to determine how the flu is spread. While that actually happened in history, it seemed to me, the author just decided to end the book abruptly."}, {"userName": "Jessica Woodbury", "userReviewDate": "Sep 29, 2010", "userURL": "http://www.goodreads.com/user/show/4271946-jessica-woodbury", "userReview": "I was lukewarm for Myla Goldberg's first novel and the same was true for her second. It's not that she's bad at writing. It's that something about the form of her novels really rubs me the wrong way. This one worked well when it was actually being a novel. But all the little extra scenes that left the narrative were distracting and didn't add much. Also the dead serving as a peanut gallery of sorts, always tossing in their two cents on what actually happened, similarly falls flat. It's a shame because, as I said, she's not bad at writing. Just maybe not at putting novels together. Also, the audiobook version of this is dreadful. Goldberg reads herself and she is just fine during the normal/novel sections. But the extra bits are strange, the additional readers and voices are strange, and all the background noises and music are super annoying."}, {"userName": "Pam Patton", "userReviewDate": "Sep 18, 2016", "userURL": "http://www.goodreads.com/user/show/17726611-pam-patton", "userReview": "I nearly set this book aside because I found one of the main characters profoundly irritating but I stuck with it, and I'm so glad I did. Though I found the marginalia a bit precious at times, I appreciated the skill in which Goldberg wove in multiple points of view. And I enjoyed the way the lovely story was told, in many ways, by inference. The chapters skip through time, and include letters written in the characters' futures. So between the story itself, the marginal comments, and the letters, a complete lifetime is told, even though the basic narrative covers only a few years.And what a lovely story. Love, grief, family, social and ethnic history. I read it over two days, and it's one of those books that makes you sad at the end because you want to spend more time with the characters."}, {"userName": "Erika", "userReviewDate": "May 24, 2010", "userURL": "http://www.goodreads.com/user/show/1037839-erika", "userReview": "I listened to this on audio. Myla Goldberg I think you might have the most annoying voice in the world. The actual story was good but I couldn't like the character very much because of her prissy little voice. The weird stuff in the middle was terrible. The dead people speaking - weird. The newspaper reports and soldiers talking - they all had the same exact voice. An annoying one."}, {"userName": "Melanie", "userReviewDate": "Dec 07, 2009", "userURL": "http://www.goodreads.com/user/show/1434941-melanie", "userReview": "I turned to this after reading Goldberg's insanely successful 'Bee Season' and found it a bit of a struggle to get into this novel. Again dark topics abound with the Influenza epidemic and WWI, but there is a lot of human interest to the characters Goldberg places in this period of Boston's history."}, {"userName": "Claire Wolff", "userReviewDate": "Jul 29, 2012", "userURL": "http://www.goodreads.com/user/show/246039-claire-wolff", "userReview": "I was really disappointed by this. It has all the makings of my ideal novel: tenement housing, romance, Spanish influenza. You know. But it was so boring I couldn't bring myself to finish it! Everyone says Bee Season is really good, maybe I just ordered wrong."}, {"userName": "Tuck", "userReviewDate": "Aug 12, 2010", "userURL": "http://www.goodreads.com/user/show/565487-tuck", "userReview": "myla adds life! ; things go better with myla ; myla's the real thing ; have a myla and smile ; the myla side of life ; etcnice historical and social drama set during span. flu times, plus quack juice gets stolen and turns into wildly successful soft drink."}, {"userName": "Steve Mossberg", "userReviewDate": "Sep 07, 2017", "userURL": "http://www.goodreads.com/user/show/366121-steve-mossberg", "userReview": "The critical consensus on this book appears to be that it's bit too rangy to hold together well, and I had the same impression. Goldberg is a really good prose stylist and a rigorous fictional historian. It was striking, however, that such an ornate and epic book should hold so few true surprises for me, or that one so fraught with tragedy should seldom make emotional connections with this reader. The whisperings of the dead in the margins are slick and humorous, but feel largely superfluous next to large-scale, multi-directional narrative. Big on whimsy, big on charm, but for me it's missing the rest."}, {"userName": "catechism", "userReviewDate": "Feb 20, 2018", "userURL": "http://www.goodreads.com/user/show/368686-catechism", "userReview": "There was way too much going on in this book and the audiobook was not a good format for it. There was the main story, which was maybe about the 1918 flu epidemic, or was maybe about a guy stealing soda. Lydia's narration was often interrupted by asides from the ghosts of dead people, who mostly commented on her great ass (?????), or by letters, or by old-timey radio jingles. It was not great, Bob. And then the story just..... stopped."}, {"userName": "Stephanie", "userReviewDate": "Jul 20, 2017", "userURL": "http://www.goodreads.com/user/show/6932010-stephanie", "userReview": "This author really did her research. I learned much about the 1918 flu epidemic in the process of reading this. I also appreciate her ways of giving the reader perspective on it from several different views and time periods. In addition to that it was an enjoyable story to read. I found the jumps between time periods not confusing, as I find they are in some books. I listened to this in a recorded format, and the narration was good as well."}, {"userName": "Ruth", "userReviewDate": "Feb 18, 2018", "userURL": "http://www.goodreads.com/user/show/5187989-ruth", "userReview": "The story was good. I think the side bars and newspaper snippets were interesting but took away from the story. I think it would have flowed better if those were put into separate chapters with the history of the Wickett's Remedy's empire. Though I am sure the author wrote it the way she did because you could read the snippet when the action had happened."}, {"userName": "Kristin", "userReviewDate": "Sep 12, 2017", "userURL": "http://www.goodreads.com/user/show/44637483-kristin", "userReview": "I loved this book. I loved the protagonist, Lydia. I really enjoyed the unique structure with the ghosts commenting off to the side. It's been several years since I read it and the story has stayed with me."}, {"userName": "Roberta", "userReviewDate": "Jan 25, 2017", "userURL": "http://www.goodreads.com/user/show/5640982-roberta", "userReview": "I was very disappointed - the change of points of view was fine but the writing was very uneven, and not particularly interesting as history or entertainment or in empathizing for the heroine. I made myself finish it."}, {"userName": "Susan Schefflein", "userReviewDate": "Dec 22, 2017", "userURL": "http://www.goodreads.com/user/show/67553442-susan-schefflein", "userReview": "This book had promise but ended with a strange conflation of letters, comments & other paraphernalia of ads, current soda history, etc."}, {"userName": "Helen", "userReviewDate": "Jan 28, 2018", "userURL": "http://www.goodreads.com/user/show/40427148-helen", "userReview": "2.5....I remember reading this, but I couldn't tell you anything about it...."}, {"userName": "Ruth Kevghas", "userReviewDate": "Sep 08, 2017", "userURL": "http://www.goodreads.com/user/show/6373771-ruth-kevghas", "userReview": "Liked it quite well right up til the end- which sort of felt unfinished..."}, {"userName": "Debsb Debs_b_hotmail.com", "userReviewDate": "May 17, 2018", "userURL": "http://www.goodreads.com/user/show/7432100-debsb-debs-b-hotmail-com", "userReview": "The book was an oddling, with 'marginalia' inscribed by ghosts - which, if you hadn't read the synopsis, you wouldn't know for a long time, if ever. The ending was abrupt, and ambiguous. Not a fan."}, {"userName": "Rosie", "userReviewDate": "Mar 02, 2018", "userURL": "http://www.goodreads.com/user/show/2179661-rosie", "userReview": "GoodInteresting sound effects"}, {"userName": "Susan Ryhanen", "userReviewDate": "Sep 29, 2017", "userURL": "http://www.goodreads.com/user/show/46022166-susan-ryhanen", "userReview": "Interesting book....didn't like the ending."}, {"userName": "Donna", "userReviewDate": "Oct 27, 2017", "userURL": "http://www.goodreads.com/user/show/1006288-donna", "userReview": "The Spanish flu epidemic and the invention of a soda. Ambiguous ending, but well written."}, {"userName": "Margaret Collins", "userReviewDate": "Jan 22, 2017", "userURL": "http://www.goodreads.com/user/show/1603139-margaret-collins", "userReview": "I really love Myla Goldberg's writing. She's a top notch story teller."}, {"userName": "stephanie", "userReviewDate": "Jul 24, 2017", "userURL": "http://www.goodreads.com/user/show/113364-stephanie", "userReview": "very much enjoyed the unreliable narrator and marginalia, as well as the interwoven storylines (borrowed from alison, added to amazon wishlist 01/06/06)"}, {"userName": "Amy", "userReviewDate": "Jan 10, 2008", "userURL": "http://www.goodreads.com/user/show/764711-amy", "userReview": "I don't know if this happens to anyone else, but sometimes a thing happens to me in a bookstore where I'll pick up a book off the shelf, because the title is intriguing or something about the cover design captures my interest, but then discover, though the description on the back cover, that this is not something I want to read at all. So I put the book back on the shelf, often scoffing at the book, and then move on.The weird part is that as soon as I walk away from the book, I completely forget the entire interaction took place. So the next time I'm in the vicinity of the book, whatever it was that attracted me the first time around calls to me again: I pick up the book, read the back cover, put the book down, scoff, and move on. Eventually, I do start to remember that I've reviewed the book previously, and even more eventually it starts to sink in that I've been picking up that same book and putting it down for almost two years. At that point, I figure that I can either devote the rest of my life to re-enacting this Memento-like scene, or I can give in and read the book, even though I'm not really interested, just so that I'll never have to pick it up again.Wickett's Remedy is one such book with which I went through this little dance, and though I'm extremely gratified to have read the book, I can't exactly say that I like it. It has lingered on my mind much since I read it with a vague sense of dissatisfaction which is directed mostly at the end.There is a lot about this book that is well-done, and it is, at the very least, a bold undertaking and elaborate play with the structure of a novel. My favorite part of the book was the marginalia, which I must admit, it took me a little while to figure out what exactly was going on. These comments, in truth, are absolutely unnecessary to the story, but they are such a unique idea and so beautifully carried that the book would have suffered greatly from their exclusion.Other 'narration novelties' didn't play out so well. The multiple points of view (which I don't all remember specifically, since it was about 6 months ago now that I read the book) didn't really all come together. The greatest disappointment on this front was the letters of Quentin Driscoll, 'inventor' of QD Soda. There seemed to me to be an implied parallel between his letters, Wickett's belief that the true remedy was the correspondence with his patients, that Quentin never wrote back to the widow, and that Mr. Finnister never responded to the woman from the nursing home. Yet, though the parallel was hinted at, it never came to fruition.And that is my final impression of the book: that it never came to fruition. Which is a major disappointment, because if the book had tied together, it would have been phenomenal. It clearly was a major undertaking for the author, and she was really striving for something remarkable with this book. The ending (the paperback's differs from the hard-cover edition) really shows this off, I think, in that the book just kind of rambles to a close - not abrupt, but a gradual petering out, like a cartoon car slowly running out of gas, putt-putting along for a while before finally spluttering to a halt; as though Goldberg knew that she still had a way to go, but she couldn't quite get there. It makes for a frustrating and ultimately disappointing read, that you can't just see the book for what it is because what it could have been casts such a long and amazing shadow.Yet, even in spite of the deep sense of dissatisfaction it left, I think this may be the best book I read all year."}], "description": "Lydia Kilkenny is eager to move beyond her South Boston childhood, and when she marries Henry Wickett, a shy Boston Brahmin who plans to become a doctor, her future seems assured. That path changes when Henry abandons his medical studies and enlists Lydia to help him invent a mail-order medicine called Wickett’s Remedy. Then the 1918 influenza epidemic sweeps through Boston, and in a world turned upside down Lydia must forge her own path through the tragedy unfolding around her. As she secures work as a nurse at a curious island medical station conducting human research into the disease, Henry’s former business partner steals the formula for Wickett’s Remedy to create for himself a new future, trying—and almost succeeding—to erase the past he is leaving behind.Alive with narrative ingenuity, and tinged with humor as well as sorrow, this inspired recreation of a forgotten era powerfully reminds us how much individual voices matter—in history and in life.From the Trade Paperback edition.", "title": "Wickett's Remedy", "url": "http://www.goodreads.com/book/show/8728727-wickett-s-remedy", "average": 3.26, "cover": "https://images.gr-assets.com/books/1328347185l/8728727.jpg", "reviews": 304, "authors": [{"url": "https://www.goodreads.com/author/show/3445.Myla_Goldberg", "name": "Myla Goldberg"}], "type": ["Fiction", "Historical", "Historical", "Adult Fiction", "Audiobook"], "outlinks": ["http://www.goodreads.com/book/show/8728727-wickett-s-remedy", "http://www.goodreads.com/book/show/19056.Wickett_s_Remedy", "http://www.goodreads.com/book/show/1812237.Wickett_s_Remedy", "http://www.goodreads.com/book/show/1353022.Wickett_s_Remedy", "http://www.goodreads.com/book/show/31946871-wickett-s-remedy", "http://www.goodreads.com/book/show/1758745.Wickett_s_Remedy", "http://www.goodreads.com/book/show/251762.Bee_Season", "http://www.goodreads.com/book/show/8008197-the-false-friend", "http://www.goodreads.com/book/show/97915.Time_s_Magpie", "http://www.goodreads.com/book/show/97916.Catching_The_Moon", "http://www.goodreads.com/book/show/5042.Bee_Season_Reading_Group_Guide"]}