{"ratings": 4074, "userreviews": [{"userName": "Anzu The Great Destroyer", "userReviewDate": "Feb 15, 2012", "userURL": "http://www.goodreads.com/user/show/2278800-anzu-the-great-destroyer", "userReview": "[\n“What if you could take everything you were looking for in a person and whisper it into someone’s ear, and they brought that person to you? And then, when you saw them for the first time, even if you didn’t know they were the one for you, you suddenly knew it anyway?”His finger traced my eyebrows, my cheekbones, as he thought a moment.“What if your heart stopped when you saw that person, and only after that did you realize that they truly were everything you ever wanted?”\n\n(hide spoiler)]"}, {"userName": "Shelby *trains flying monkeys*", "userReviewDate": "Mar 01, 2015", "userURL": "http://www.goodreads.com/user/show/1053760-shelby-trains-flying-monkeys", "userReview": "Tish works as a nurse and one of her clients has passed away and they are having an estate sale. Tish goes to it and finds a pendant that she just must have. She steals that sucker and takes it home. Upon opening it a weird red liquid comes out and burns her skin and inside of it is a image of a guy. (You guys knew that was coming didn't you?)\nThat night when she goes to sleep she realizes that she is in a different world. One where Bludbunnies can bite.\nShe also is completely naked and that guy from the locket is standing in front of her. Come to find out he had an enchantment placed on the locket to bring him his true love. Tish is now in the land of Sang, which resembles her world back in America but there are some differences. Magic, clockworks, krakens and of course the bludmen. Turns out the guy that summoned her is a bludman named Criminy Stain. Bludmen resemble vampires only in the facts that they are hard to kill and they have that pesky little blood drinking problem.\nMuch of Sang is pretty bloodthirsty. There are bludbunnies, bludmares, bluddoes..you get the gist. Tish seems to settle in pretty good. Especially after she realizes that the musician in Criminy's circus like caravan is one of her clients from back home. Back home though he is pretty much a vegetable...in Sang he is hawt. Some of this made me roll my eyes if you can't tell. Tish does have the ability to go to sleep in one world and be in the other..with the help of her trusty locket.\nI didn't hate this book. I actually couldn't stop reading it once I started. It's like a jacked up version of Alice in Wonderland and somehow..it just works. Even with a love-triangle sorta and some insta-love. That Bludman Criminy? I'd bang him.\nI read this one because the author is coming to a festival near me and I may have to fangirl..or not. It's on the maybe pile.\nThe reviews on this book from my friends on here are varied. I'm picking my friend Alkyoni's review to highlight this time. Her review is a fun look at this book."}, {"userName": "Stacia (the 2010 club)", "userReviewDate": "Jan 07, 2013", "userURL": "http://www.goodreads.com/user/show/4013351-stacia-the-2010-club", "userReview": "It all started with a locket...\n\nI could picture it shining on some young lady's neck, part of an epic story full of romance and a Prince Charming who didn't turn out to be an overbearing, soul-sucking jerk.\n\nWicked as They Come is not going to be a book for everyone. I understand why some people are completely enraptured, while others are not feeling the love. This time, I am happy to report that I fell closer to the enraptured side. Uniqueness is such a rare thing in fiction (it's all been done before, right?), and I felt like I'd been awarded a rare treat in getting the chance to read about the magical world of Sang.If you think magical means happy, enchanted fun - think again. There are ruthless KILLER BUNNIES on the loose. Yes, you read that right. Cute and fluffy bunnies are killers. So are rats, horses, and just about every other creature in Sang. For most of the creatures are Bludcreatures. Blud is pronounced blood, so yes...these are adorable little vampire creatures with fangs.In the world of Sang, Bludmen and Pinkies (humans) live side by side, but they don't always get along. Letitia, our leading lady (and quite human), falls asleep in our world one night and wakes up in the world of Sang. All of the Alice in Wonderland comparisons that reviewers are putting out there are pretty much on point. This is the first observation one might possibly make about Sang. Think of a side show carnival lead by a man who could easily be a cross between The Cheshire Cat and The Mad Hatter. THAT would be Criminy (rhymes with Jiminy, as in cricket). Criminy, a bludman, is the star of this book. His personality is large and his ways are bizarre, yet I couldn't help but be taken in by him. I loved Criminy, even if he did come across as strangely creep-tastic and not always in a good way. But he wears gloves and that's a weird love of mine, especially when I saw what he could do while still wearing gloves. Don't judge me. :p But even when the glove is on someone else, the mood can still be quite sensual...\n\nHe looked into my eyes as he slowly unbuttoned the three buttons and pulled each finger of my glove to loosen it. He brought the glove to his mouth and gently bit the tip of the middle finger. He slowly removed the glove with his teeth. It was possibly the sexiest thing that ever happened to me. And our skin hadn't even touched.\n\nI loved the world of Sang. I loved the crazy past-alternate-steampunk-fantasy world thing that was going on. I loved the idea of killer bunnies. I was on the fence about Letitia, but only because she struck me as odd for taking to the world as easily as she did. The \"other\" love interest for Letitia wasn't well sketched out, but he dropped off quickly enough and I'll be excited to actually learn more about him in book 2. Considering this series is following a PNR format of one couple per book (even though it reads more like diet-cola fantasy), it's safe to assume that any love triangle in this series is going to go belly up quickly enough, which is a relief that we won't have to endure much back-and-forth and indecisive heroines. *bullet dodged*The main hook for the Blud books appears to be a unique world and quirky characters (and cool clockwork pets!). If you're looking for anything deeper than surface level story-telling, you won't find it. Surprisingly enough, I'm okay with that. We got more than what's normally expected out of stock-manufactured PNR, so I can't really complain. Did I forget to mention the fun banter and silly moments? These are only a few of the many lines which had me smiling.\n\"He keeps hoping she'll fall and break her neck, so that he can turn her without guilt and be her knight in shining armor.\"\"Do you have any other accents?\"\"Is annoyed an accent?\"\"I've been fending off that little minx for years. Had no idea she was so diabolical. If I had, I might have liked her more. Or snapped her neck. Could have gone either way.\"\"We can invent show tunes and pizza. They won't know what hit them.\""}, {"userName": "Michelle, the Bookshelf Stalker  Queen of the Undead", "userReviewDate": "Jan 26, 2012", "userURL": "http://www.goodreads.com/user/show/3039709-michelle-the-bookshelf-stalker-queen-of-the-undead", "userReview": "Read my review here...http://badassbookreviews.com/review-w...or below.....3 cups fantasy2 cups paranormal romance1 cup steam punk1 tablespoon of historical fiction1 teaspoon contemporaryA dash of time travelMix all together at once, add a touch of magic, a gorgeous alpha male, a woman learning to stand on her own two feet, and you’ll have Wicked as They Come. I LOVED this book. I’ve been hesitant lately giving 5 stars since every time I give 5 stars, I want it really to be a step above all other books in its genre. Well there was NO hesitancy in my 5 star rating for this book. I feel in love with this book at page 10. Seriously. It was magic. It was like I was under a spell and I literally read this book slower than I needed to just because I did not want to end.The StoryTish’s life was just beginning. She left her abusive boyfriend, changed her address, was learning to be assertive, and was just learning what she wanted out of life. She was a nurse, dealing with terminally ill patients including her own grandmother. Tish is attracted to a locket at an estate sale from one of her former patients. She takes it home, and with a struggle, is able to open the locket. That evening, she goes to sleep with the locket close to her heart and with a sense of hope. She wakens to a fantasy world. This is not a regular fantasy but a steampunk Victorian bizarre circus type fantasy The problem is Tish thinks she is still dreaming. She almost immediately meets Criminy, a tall handsome man who tries to convince Tish that this is not a dream.Criminy, my lovely Criminy. Besides being beautiful, alpha, and a magician, he’s also a bludman. A bludman in Sang (the world that Tish finds herself in) is like a vampire in our own world. Except bludman aren’t dead, don’t feel cold, they are just basically a different race that lives on blud (“blood”) instead of food. Criminy is in love with Tish from the very minute he meets her. He knows that Tish is perfect for him because he basically requested her when he made a bargain with a witch for his perfect woman. Tish is what came to his world so he knows she is the one. Tish is unsure of this so-called bludman but she knows she is attracted to him and his dangerous allure.The story revolves around Tish’s growing relationship with Criminy, her fear of trusting Criminy because of what happened to her, Tish getting used to the world around her, Tish wanting to see her Grandmother again but not wanting to leave Criminy or this world. and finally a bad man that steals her locket and Criminy and Tish’s adventure in returning the locket. In other words, the plot IS the world. It’s not fast paced but perfect in its own right. The author immerses the reader slowly into the world, we discover everything right along with Tish and I felt like a kid at a fantasy show in Las Vegas. The characters are unique, the environment scary but intriguing, and the excitement of something new was as real for me as it was for Tish.There are blud bunnies. Predators in Sang are completely different than what is in our world. There are Invisibility spells, love spells, and more but this is not a magic book. There is time traveling but it’s not a time traveling book. There are mermaids, lizard men, and a piano playing “stranger” but this is not a straight fantasy. In other words, this book is the perfect combination of a little bit of everything.OverallI can’t recommend this book enough. It’s like every genre I love so perfectly blended together. If you want to fall in love with two great characters plus an entire new world, this is your book."}, {"userName": "Sh3lly ⚔ tired of damaged heroines ⚔", "userReviewDate": "May 13, 2014", "userURL": "http://www.goodreads.com/user/show/25393430-sh3lly-tired-of-damaged-heroines", "userReview": "This book has vampire bunnies.Okay, so, I think that picture originally came from this picture of a bunny eating a cherry:But still. In this world, they are called blud bunnies. There are lots of blud creatures: bludrats, bludmares...Letitia is a homecare nurse who finds herself transported to another reality called Sang through a magical necklace she finds at an estate sale. When she gets to Sang, she meets Criminy Stain, a Bludman who runs a traveling carnival. They are forced to go on a journey to chase down a ruthless human (called a pinky in Sang) trying to exterminate the Bludmen/women of Sang. I kind of pictured a steampunk Johnny Depp as Criminy. Criminy is a version of a vampire. He drinks blood, he is stronger and lives longer than humans/pinkies. This had some steampunk elements - clockwork animals, period costume (it takes place in an alternate reality in the early 1900s, as most steampunks do), but I thought it was more of a paranormal fantasy with some romantic elements. The romance was not a big part of the story until about 60%.I really enjoyed the world-building, but did not really connect with the main female lead, Letitia. While she was not annoying or unlikable, I just never felt one way or the other, really. I loved Criminy. The villains were kind of typical and the romance, when it was developing, played out in a predictable manner.This was a good read, but overall failed to truly engross me. Part of it was that I really liked the first half, but for whatever reason, I began to lose interest (pacing?), and then the resolution of the plot (which wasn't that complex to begin with), was convenient with no surprises. The ending was fine if a little unsatisfactory, but it leaves the story open to continue, which it does for three more books, I believe.Overall: Started strong, great world-building, then fizzled out, and ended predictably. But not a bad book by any means. Could have just been that this would be best read quickly instead of phased out over several days as I did, which may have caused me to lose interest somewhat?*I'm tagging this as urban fantasy even though it's not quite accurate. However, it reminds me more of UF than either PNR or steampunk."}, {"userName": "Cat Russell  (Addicted2Heroines)", "userReviewDate": "Dec 26, 2011", "userURL": "http://www.goodreads.com/user/show/4250664-cat-russell-addicted2heroines", "userReview": "If you didn't think it possible to fall in love with a gypsy king who has magic tricks up his sleeve and drinking blood on his mind, then allow me to introduce you to my newest fictional obsession, Criminy Stain. He's a cunning predator one moment and a perfect gentleman the next. He's lively, charming, charismatic, and romantic. He's also ruthless, possessive, bloodthirsty, and dangerous. He's a well-rounded, well-developed character and I feel like he was made just for me.Unfortunately, he's got his eyes, and his heart, set on Tish. She's pulled to him by magic and once they meet, he's determined to have her.I watched him playing with the long blades of grass, weaving them into patterns as he hummed an unfamiliar song, a waltz. \"What are you doing?\" I asked him.\"I'm letting you get used to the idea of me,\" he said idly. \"I'm pretending to be harmless. Is it working?\"She's understandably reluctant. Sure, Criminy is delicious, but he's also a bludman, or what Tish relates to as a vampire. And she's tossed into a world very different from her own. Sang is a fascinating place filled with true magic, clockwork monkeys, dangerous Coppers, where even the cutest and furriest of woodland creatures are bloodthirsty predators with a craving for flesh. Needless to say, she's disconcerted and for a period of time she's too fixated on returning home to truly appreciate the bludman in the magical top hat who will eventually win her heart. \"I would burn down the world for you,\" he whispered fiercely. \"Your world or my own. I would rip down this entire city with my bare hands without a second thought. I don't need to taste anything else, I don't need a comparison. I always thought that when you came to me, you'd feel that way, too.\"I enjoyed every moment of Criminy's playful dialogue, the imaginative world building and fantastic character development. This is an exciting, entertaining debut in a series that I look forward to continuing.And now I'm thoroughly convinced that Delilah Dawson must have a magical top hat of her own. And from it, she's produced a magical world with magical characters accompanied by a magical romance. I'm hooked.www.addicted2heroines.com"}, {"userName": "Dija", "userReviewDate": "Apr 02, 2012", "userURL": "http://www.goodreads.com/user/show/2857113-dija", "userReview": "[“What if you could take everything you were looking for in a person and whisper it into someone’s ear, and they brought that person to you? And then, when you saw them for the first time, even if you didn’t know they were the one for you, you suddenly knew it anyway?” His finger traced my eyebrows, my cheekbones, as he thought a moment. “What if your heart stopped when you saw that person, and only after that did you realize that they truly were everything you ever wanted?”“OK, that would be nice,” I had to admit.“That’s what happened for me,” he said gently. (hide spoiler)]"}, {"userName": "Jill", "userReviewDate": "Apr 02, 2012", "userURL": "http://www.goodreads.com/user/show/3820197-jill", "userReview": "She shouldn't have really taken the locket. But when twenty-five year-old nurse, Letitia Paisley Everett finds an antique locket in the house of one of her recently deceased patients, she's intrigued. Inside is a portrait of a man. Slipping it over her neck that night she falls asleep, only to wake up later, naked, (with the locket still around her neck), lying on a stone in the woods. Standing nearby watching her is the man whose portrait was inside the locket.\"You're here,\" he said simply.\"Do I know you?\" I asked, which came out more haughtily than I had intended.\"You will,\" he answered, kicking off the tree and walking toward me. \"After all, you're wearing my locket. And I've been waiting for you.\" Criminy Stain is a Bludman (vampire). Wanting to find a woman, his other half, he bewitched the locket and sent it out to find his soul-mate and bring her back to his world, Sang. Criminy is the Gypsy King, and leader of a travelling circus.\"I'm a gypsy. A rogue. Wicked as they come.\"Written in the first person from Letitia’s point-of-view, this is one of the most original concepts I've ever read. Incorporating steampunk, fantasy, paranormal, time travel, vampires, ghosts, magic, a circus and other dimensions. Oh, and blood-thirsty, vicious bunnies.Sang is a world full of strange animals, Bludman (vampires) and Pinkies (humans) similar in many ways to ours, but slightly offkilter. Letitia must feel a little bit like Alice in Wonderland, thrust into a reality where most of the wild animals are blood drinkers - bludbunnies, bludrats, bluddeer, bludhogs - and where she ends up as a fortune-teller with the gift of glancing (or seeing the future) as one of Criminy's carnivalleros. Criminy described variously as sinister, bloodthirsty, wicked and a thief, is actually very sweet and romantic. Persistent and patient, willing to wait for Letitia for ever to realise she loves him as much as he loves her. But yes, he is a vampire and yes, he does attack a Bludstag using only his teeth and tear it apart. At which point Letitia proclaims -Like so many women before me, I was a slave to the caveman brain, that deep old part of my DNA that whispered that ferocity would keep me safe and fed and alive and that I should most definitely find the fiercest creature around and hump it.No problem there.The plot, pacing, prose, dialogue and characterisations, are more than you would expect from a debut author. The descriptive imagery of the circus and its characters, the world of Sang are outstanding, the dialogue often humourous -\"I'm a nurse,\" I said, feeling huffy. \"I help sick people.\"\"So you can stop the diseases?\" he asked.\"Not really. I mostly help the people who are already dying, trying to make their last days comfortable.\"\"You help people die,\" he mused. \"That sounds quite sinister, and that's coming from someone who drinks blood.\"For those who don't like love triangles, there is a secondary love interest for Letitia. I wouldn't call this a triangle though, as you know who Letitia will end up with. The other love interest does get his story in the next book.Part action and adventure, part romance set in a richly imaginative universe. There won't be too many readers of paranormal, fantasy or steampunk romance who aren't going to love this one I think. The world, the writing, the plot, the characterisations are excellent. Delilah S. Dawson writes like a seasoned professional in her impressive debut. Wicked as They Come is an enchanting fairy tale for adults. Highly recommended.Steam: 2.5"}, {"userName": "MISS VAIN", "userReviewDate": "Mar 05, 2012", "userURL": "http://www.goodreads.com/user/show/4335141-miss-vain", "userReview": "\"I would burn down the world for you,\" he whispered fiercely. \"Your world or my own. I would rip down the entire city with my bare hands without a second thought. I don't need to taste anything else, I don't need a comparison. \"\nWicked As They Come is magical beginning to an intoxicating new paranormal romance series, I can't wait to dive into the next one. My only disappointment with this novel is that the next book will not follow Letisha and Criminy, but it will switch to another couple, though I have faith that this author will bring another awesome couple to gush over next.\n\"That's fascinating,\" he said. \"A world where people go around giving each other blood, but no one wants to drink it.\" \"You know in my world, blood drinkers are storybook monsters,\" I said. \"Really?\" he asked, delighted. \"That's marvelous!\" \nLetisha  Everett is a nurse taking care of her dying grandmother while mending a broken heart, and discovering her independence after wasting too much precious time with a controlling, abusive fiancé. She finds a locket at an estate sale, and quickly becomes fascinated with the history as well as the gorgeous man behind the picture in the locket. Imagine her surprise when she wakes up in an alternate universe in the early 1900's with a Gypsy King having waited over 100 years for her to return his love. \n\"It's a little scary, what you do.\" As I tried to figure out how to respond, and with words as sharp and cold as the blade of a knife, Criminy said, \"If you're scared of her talent, then you don't truly know what fear is.\"\nWhat can I possibly say about the irresistible Gypsey King,  Criminy Stain? \n\"He was an animal. He was terrifying. And he was beautiful.\"\nHe's the proprietor of a traveling circus, he demands respect, but he's also a kind, tender Bludman. In this world a Bludman is an immortal being, that drinks blood to survive. From the time he steps into this fairy tale, I'm immediately bewitched by this charming, and heroic magician Criminy. With the help of a witch she casts a tracking spell to bring his lover he's been patiently awaiting to show up and return the love. \n\"I'm a gypsy. A rogue. Wicked as they come.\"\nQuickly Letisha is thrown into the traveling circus lifestyle working closeby with magicians, two headed men, mermaids, clockwork guardians and so many more unique attributes to this successful circus. She soon discovers she inhabits a very rare but charming ability as a \"glancer\" that makes her an important part of the circus apart from gaining the heart of Chiminy. As a glancer she can view people's past, future and or their demise with just one touch. Upon  placing her hands onto Chiminy she discovers his future but decides to keep it to herself, still unsure of this new and overwhelming ability. \n\"I don't mind if you want to play coy, Leticia,\" he whispered, his lips brushing my skin just enough to make me buck. He licked a line from the curve of my ear down my neck, and I shuddered. \"But I aim to make you surrender.\" \nThis spellbound locket allows Leticia easy access to her present day life so she can tend to her grandmother and her ailing illness while she sleeps in Chininy's world. Chiminy becomes her sole protector and when he's unable to fulfill that duty she has an enchanted clockwork bracelet made to be a Eurobos serpent ready to strike at only Letisha's command. Between her snake bracelet and Chiminy's monkey I found these clockwork creatures fascinating! \nHe spun me back around to face him, and the look on his face was terrifying and more than a little thrilling. Anger and danger and excitement and desire were eloquent in his sharply cut features. No one has ever had power over him, and now I did, an insignificant Pinky. A human.\nWhen Letisha's locket necklace has been stolen, her world begins to shatter as that's her only key to visiting her grandmother is the Locket. Chiminy sets out not only to win her heart, and affections but to discover the new home of the missing locket. From here Deliah S. Dawson takes us on an exhilarating journey of love, lust, betrayal, murder, death, destruction, lies, witches, Kraken, spells, Coppers, blood thirsty stallions and bunnies, and the fight of these extraordinary characters. \n\"Just don't forget that it's a ruse, love, \" he said. \"Because once were outside the walls again, you'll be entirely in my power. And I'd hate to have to spank you.\"\nI absolutely LOVED this book! The hero is a brutal enforcer when he must be, while being a tender lover to the woman in control of his heart. I adored how this wasn't instant love on Letisha's side, she made him work for it, while quickly remaining independent and strong. I don't want to give away too many specifics of the plot but this a thrilling ride of a search for a missing locket and perhaps finding love along the way! \n\"Easy things aren't worth much.\" \"Your hand in mine is worth a great deal, Leticia.\" he said, helping to my feet. \"That's what I'll be fighting for tomorrow.\"\nWicked As They Come is truly a gem for paranormal romance lovers with a bit of fantasy thrown into the plot! Keep an eye out for the next installment titled Wicked As She Wants being released in 2013. \n\"Dammit, woman! You're scent, your stupid bloody delicious scent lingering in every crevice of my body and my wardrobe, driving me nearly mad. Do you know what it's like to want something so badly, to have it so close, and still feel that it's out of your reach? Out of control?\"\nARC provided for review by Simon & Schuster  for Pocket BooksLike what you see, find my reviews at: http://MissVainsParanormalFantasy.com"}, {"userName": "Felicia", "userReviewDate": "Apr 17, 2012", "userURL": "http://www.goodreads.com/user/show/666892-felicia", "userReview": "This was last month's Vaginal Fantasy book, so you can watch the whole review on our group page if you want! I picked this book under the theme \"Supernatural Gumbo\" and this book doesn't disappoint. Magicians, Vampires, Steampunk, Ghosts, Carnivals, it's pretty much a pastiche of everything in the genre, but really well done. I mean, yes, it's ridiculous to have rabid blood-sucking bunnies infesting a world, and the lead dude is a juggler in a tophat, but despite (or because of) the weirdness, it's very enjoyable! Will be reading more in the series for sure!"}, {"userName": "Rane", "userReviewDate": "Sep 17, 2011", "userURL": "http://www.goodreads.com/user/show/1987431-rane", "userReview": "[ and while she does jump back and forth between worlds helping her dying grandmother, it feels like she’s just buying her time until she can stay fully with Criminy in the future (hide spoiler)]"}, {"userName": "Ash Wednesday", "userReviewDate": "Jul 24, 2013", "userURL": "http://www.goodreads.com/user/show/10484016-ash-wednesday", "userReview": "3.5 STARS\"Perhaps that's the difference between predators and prey, love. I'll never stop hunting. But I expect that one day, you'll stop running.\"\"Because I want to die.\"\"Because you want to live.\"\nSteampunk, Vampires and an Alice in Wonderland Theme.All the reasons why this shouldn't have worked for me.This is only my second steampunk book (the first was meh), I'm not a big fan of vampire stories in PNR and definitely not a big fan of the whole modern woman getting transported to a magical land seeing as these stories inevitably take the Mary Sue route. Bludanimals (i.e. blood sucking bunnies, rats, horses), witty dialogue and the rich, creativity that built Sang.Oh and a freaking Kraken.All the reasons that it did.Letitia \"Tish\" Everett is recently divorced nurse who finds steals a charmed locket from a that lands her in an alternate world where \"everyone dresses like Victorian prudes\", speaks with a British accent and trades in copper and blood. This is Sang. And she lands right in the doorstep of a caravan led by her summoner, the suave gypsy king Criminy Stain. He is a Bludman, not a vampire but in certain aspects, he actually is. She discovers she has the ability to glance at the Sang-folks' future by touching them and thus gaining employ in the caravan as it's in-house fortune teller.In Sang, Bludmen and Pinkies (non-bloodsuckers) coexist openly with the prey ostracizing their predators, led by the Magistrate of Manchester, Jonah Goodwill and his enforcer team of Coppers. Goodwill manages to steal Criminy's locket from Tish after she glances on his plans for the Blud-folk. This sends our protagonists on a merry chase aboard a blud-sucking mare, a wind up car and a submarine as they discover the truth behind the locket, Goodwill and the future of Sang.Wicked As They Come is very strange for me because everything I enjoyed about it had an accompanying but to them.I liked Tish and Criminy as protagonists. Their banter was witty and the chemistry puts the \"Steam\" in \"Steampunk\" without sacrificing the usual romantic themes. Criminy is one of the most original heroes I've ever encountered. A mix of whimsy, swagger and alpha that is quite a marvel to see pulled off. There are heroes that are funny and quirky while being erotically possessive and controlling… but can they make an edible apple pie out of eight apples under their hats with a wave of their hand? Can they dance a mean jig without coming across ridiculous or silly?\n\n\"You think this is a dream?\"\"I know it is,\" I said coolly.He grinned. \"Sweetheart, you couldn't conjure me if you tried.\"\n\nHe was literally and figuratively magical, with the rabbit in the hat and colorful chain of handkerchiefs sense of childish fancy that made the erotic moments quite jarring in its kinkiness but I admit, fun and quite hot.But I found both Tish and Ciriminy's character backgrounds this side of thin. I liked them enough to enjoy the story but not enough concern to desperately want them to end up together. Especially Tish in the beginning, her desperation to get back to care for her grandmother was so intense yet I've seen but few interactions between them. Or her failed relationship with Jeff which features so prominently in her decision making process but had very little depth and complexity.I was going to complain about the insta-love but this is PNR and Criminy made a beautiful argument for it that essentially shut me up and squee in a corner. I was going to complain about the toothless and foolish ways of the bad guy but Tish reasoned it out well enough that I found myself reluctantly accepting.I am going to complain about a love triangle that felt unnecessary and pointless save for the introduction of the main character for the next book in the series. I am also going to complain about the incremental reveals Delilah Dawson's rules and details about the world she created. It feels a bit like cheating when you reveal say, blud properties at opportune points in the story than ahead. It's a lot like scrambling to lay tracks on a running train as you go along.I'm the kind of gal who likes to enjoy the ride with the tracks laid complete and ahead of me.But there's no denying the rich texture of Sang. I loved the idiosyncrasies and the little twists it has from our own world. I loved the way things ended. It's been a while since I've read tastefully done sexy scenes and despite the racy quotes I've been posting in my updates it wasn't vulgar or crass. There's something admirable about translating the eroticism of a scene without identifying body parts and degrees of moisture. Overall Wicked As They Come takes a bit of getting used to. It employs some familiar tropes that would only bother you if you you fail to recognize and pay attention to the rich creativity and imagination crowding it.\n\n\"What are you doing?\" I asked him.\"I'm letting you get used to the idea of me,\" he said idly. \"I'm pretending to be harmless. Is it working?\"\"Until you smile,\" I said weakly, and he smiled again, his face radiant.\"Can't help that love,\" he said. \"Not around you.\"\n\nAlso on BookLikes."}, {"userName": "VampireNovelFan", "userReviewDate": "Mar 23, 2012", "userURL": "http://www.goodreads.com/user/show/4897902-vampirenovelfan", "userReview": "My FAVORITE book of 2012 thus far!!\nYeah, those of you who follow me closely know I wouldn't throw that out there lightly, but there it is! I'd heard good things about the series but I wasn't in the hugest rush to read it. Man am I SO glad I got around to it!Delilah Dawson introduces us to a new world through the eyes of Letitia Everett (aka Tish), a nurse who spends most of her time tending to patients in reality, including her terminally ill grandmother. That is until she stumbles upon this interesting ruby locket at an estate sale. Unbeknownst to her it happens to be enchanted, and once she falls asleep it thrusts her into an alternate world called Sang where she meets Criminy Stain, a rebellious gypsy Bludman (aka vampire) who has been waiting for her for a long time. After all, he's the one that had the locket spell cast to deliver the love of his life to him.He leads a travelling circus mixed with fellow Bludman and Pinkies (aka humans) alike. Tish will fit right in as she realizes her powers as a Glancer, where she can see into someone's past and future with just one touch. It's a valuable ability and she learns her own fate when she touches Criminy, seeing her ultimate doom. Anchored between both worlds through wearing the locket, she can decide what she wants, but when the locket is stolen she goes on a journey with Criminy to find it. They face many enemies by land and sea, their ultimate target being the evil and manipulative Magistrate who hates all Bludmen and has a plan to eradicate them all from Sang. If they succeed, she must decide on a normal structured life or an unpredictable destiny with the person she was least expecting to love. Is Tish meant for all of this?I won't answer that question here, but I can just say that I loved loved LOVED this book! Dawson has an amazing imagination and has crafted a truly unique world with the Blud series. I wasn't sure how much I could get into the world-building because Steampunk novels can be too heavy on the details for my liking. But she was able to harness it and describe everything effectively while still keeping my attention. I seriously don't recall being bored at all and that's saying a lot.I liked that the Bludmen are really different for a change. Instead of being at the top of the food chain and rich like vampires in normal series, their race is oppressed and their people are considered second class citizens. Let's not even get into the topic of a Bludmen becoming involved with a Pinky. It's super taboo and usually the two races aren't attracted to one another (well, aside from Bludmen seeing them as food of course). Because of this I enjoyed watching the tensions mount between the two.Criminy Stain. Just one word to describe him: AMAZING!! I just don't know if we can get enough of this character. He is so unique in a genre where it's only getting more difficult to separate the best from the rest. He's a born leader, honorable and adventurous; he cares about his people and hates that they're suffering, but even still he doesn't become emo and self-loathing. He maintains a great sense of humor throughout it all. I probably haven't read about a more dynamic character since Algaliarept from The Hollows. The only downside is that I'm not sure what the second book will have in store. The book doesn't end in a cliffhanger, but I just can't tell what's going to happen next for him since the second book seems to shift focus. To ignore this character is to ignore a goldmine. He's got potential to be a fan favorite, like a Jericho Barrons, Algaliarept, Jean Claude, Curran, the list goes on.I think the love story between Criminy and Letitia is very well done and not too heavy on that sap. It's definitely more of a romantic adventure so a lot of the focus is on the adventure side of things, which is just how I like it. All the while the feelings build allowing things to happen at the right time.I really wish this series came out bi-annually simply because of him. Maybe we can coax the author into writing up some short stories or vignettes.This series is one where I would love to see a movie adaptation created for it. It could be a big hit, seeing all of this come to life. *Review also posted to Amazon"}, {"userName": "Anna (Bobs Her Hair)", "userReviewDate": "Apr 02, 2012", "userURL": "http://www.goodreads.com/user/show/3167458-anna-bobs-her-hair", "userReview": "3.5...It's definitely creative. There's adventure, bludcreatures, and spiffy gadgets. There were many longing glances from Criminy and I wish the romance would have been stronger. Criminy's POV would have been nice. Leticia's character started out strong then there were times she felt a little flat. Still, it was an enjoyable story with a good ending. Thinking, thinking, thinking.***** edited for full review *****Wicked as They Come combines sub-genres (science fiction, steampunk, and urban fantasy) in this paranormal romance. The reader travels, via magical locket, from modern day Earth to the prejudiced world of 1904 Sang. Vampires are called Bludmen; they can walk in the sun, have no aversion to garlic or wooden stakes, drink blood for sustenance, and live longer lives than the Pinkies (humans). Leticia Everett discovers she has an untapped side to her spirit. In Sang, she is bold, colorful, and exuberant yet dealing with emotional baggage. A bludman named Criminy Stain offers her unconditional love and a vivid existence if she opens her heart.The StoryLeticia “Tish” Everett is a nurse. She cares for patients who are dying and tries to make their last days as pain free as possible. She’s also left a three-year relationship with a controlling and abusive boyfriend. Leticia will never let another man control her and smother her ability to make her own choices. One day, Leticia goes to an estate sale, finds a fascinating locket, and steals it, which is against her nature. When she falls asleep that night she wakes up naked in the world of Sang. Criminy Stain finds her. He had sent the locket out to find the other half of his soul and she has finally arrived. Criminy knows he loves her at first sight. This is not something Tish is ready to hear. Thinking she is in a dream she experiences the world of Sang until she falls asleep again and returns to modern day.Eventually, Tish understands she is not living a dream. The world of Sang is strange and exciting. She discovers a hidden talent, but her anxiety builds when her locket is stolen; she is trapped. Criminy and Leticia travel across Sang searching for the locket, encountering various bludcreatures, prejudice, and ill-treatment. My ThoughtsThe beginning of the story sets up a unique and absorbing world. The prejudice and parallels the treatment (past and present) of ethnic groups was fascinating. The bludpeople seemed like gypsies and a combination of ethnic minorities. The Pinkies see them as filthy and a society of Coppers (think Ku Klux Klan) want them eradicated. The men, women, and children live a segregated life within cities and towns. A registration process is beginning where they must wear a pin with the letter “b”. The alternate dimension was very gripping.The heroine, Leticia Everett, started out strong but she slowly disintegrated as an engaging heroine. It was hard to connect with her, even though her history of abuse sets the stage for her resistance to Criminy, it didn’t make the best romance. Criminy was delegated to the side-lines shooting Leticia longing-glances, professing his devotion, and displaying his unconditional love as they pursued the locket that would take her away from him. I wanted more Criminy. As this story is told completely from the heroine’s point-of-view I didn’t get enough of him! Despite the lack of his POV he proves to be a unique hero (think Johnny Depp in a Tim Burton movie). He is brave and true to Leticia. Overall, this was a charming story that needed more romance for me to feel the love. I do recommend this book just for you to see the world of Sang. I’m not quite sure I’ll read the next book in the series. It depends on the reviews and whether it sounds interesting enough to try this author’s work again. Grade: C+ or 3.5 stars*buddy read with Mary Elizabeth (DNF) and Erika (stopped read/book on hold)*"}, {"userName": "Guilty Pleasures Book Reviews", "userReviewDate": "Mar 22, 2012", "userURL": "http://www.goodreads.com/user/show/4391611-guilty-pleasures-book-reviews", "userReview": "This review posted on Guilty PleasuresRecommended ReadWICKED AS THEY COME is a refreshing blend of paranormal, urban fantasy and romance, consisting of words so beautifully crafted I could hear carnival music in my head and could clearly visualize the sights and sounds of the Caravan in vivid technicolor. I was transported to another world, a modern day world consisting of wonders of days gone by, steampunk elements, bludanimals, clockworck pets, vampires, a strong yet wounded heroine, quirky yet sexy hero, fantasy, passion, humor, magic, and love.Tish is a nurse, taking care of her ailing grandmother and recovering from an abusive relationship. Tish finds herself in a strange land, where there are humans called Pinkies and vampire-ish people called Bludmen, cute bunnies called bludbunnies, who will eat you faster than a piranha and other assorted bludanimals. Tish has one goal in mind, getting out of this strange land and back to her grandmother.Criminy Stain, sighhhhhh, is a Bludman, the charismatic leader of the traveling carnival. He is sexy, funny, and totally in love with Tish. In my mind Criminy is a sexy mix of Russell Brand meets Captain Jack Sparrow meets Willy Wonka (Johnny Depp).Criminy and Tish set out to save the Bludmen, while on their journey Tish finds it hard to resist her growing feelings for Criminy. They set out on an action packed, at times gory, adventure that tests their strength, trust and the growing bond between them. The chemistry between the two is intense. The love scenes are quite steamy. The love scenes occur in the latter part of the book and in my opinion were paced perfectly for the story line. I cannot find one bad thing to say about this book, the epilogue was original and has me hanging off a cliff waiting to see what happens next in the wonderful world of Sang.Before reading WICKED AS THEY COME, I had not read anything steampunk-ish, never thought I would want to. Maybe it was a spell Criminy Stain put on me while I was drooling over him on the cover, all I know is as I read the blurb, I knew, without a doubt, I would read WICKED AS THEY COME. From the first page, I was immediately drawn into the story and couldn't put it down. I was not even half way through it and was telling friends \"you HAVE to read this\". Now that I have read it, I definitely want to read more of the sub-genre. I can totally see WICKED AS THEY COME as a movie, produced/directed by Tim Burton with Johnny Depp as Criminy.I recommend this book to paranormal, urban fantasy, and steam punk fans, as well as anyone looking for something different to read. I absolutely cannot wait for the next BLUD book from Delilah S. Dawson.p.s. I want a Clockwork of my own! =)"}, {"userName": "Kathleen", "userReviewDate": "Dec 30, 2012", "userURL": "http://www.goodreads.com/user/show/13954899-kathleen", "userReview": "[ Who is tending the beloved animals, so clearly treasured by the owner? That bit was left unresolved at the end. Will all those animals die? Did we go to all that effort to get to the island just so L and C could meet up with Tabitha Scowl? If so, why not meet her in Feverish? I also didn't like the way the _____ was left burning. That plot point bothered me. I felt like shouting, \"Do something!!\" It seemed that C and L just didn't care enough about that, even though they did care -- Criminy was really bothered by it. (hide spoiler)]"}, {"userName": "Katie(babs)", "userReviewDate": "Sep 13, 2011", "userURL": "http://www.goodreads.com/user/show/179852-katie-babs", "userReview": "There are certain times when I get the reading blues. Everything I read I fine boring or fails to excite. But then a book comes along and shakes you up and helps you jump start your reading excitement again. I recently finished such a book and if not for Fiction Vixen’s review, this book might still be languishing in my monster TBR pile.Wicked as They Come is the debut by Delilah Dawson. When I first saw the title, it reminded me of one of my favorite spooky movie from the 1980’s, Something Wicked This Way Comes. The cover is also eye catching with what looks like a vampire with wonderful waxed man titty abs. From reading the synopsis, you get the feeling this isn’t a typical paranormal romance. Wicked as They Come is part alternative reality, part paranormal and part Steampunk.This is one strange book. It’s a Paranormal, Steampunk acid LSD trip with a strange and eccentric hero called Criminy Stain, a big showman who ends up stealing the heroine’s heart. Criminy stole my heart and the world Delilah has created with mystical type creatures that drink blood, but aren’t really vampires, had me hooked. This is a very unique and inventive novel. It has the same feel that Morgenstern's The Night Circus had for me and that was one of my favorite reads from last year.Wicked as They Come is from the first person POV of Tish Everett, a nurse who has just gotten out of an abusive marriage. Tish enjoys taking care of her grandmother and her patients, but her life is lacking excitement. Because Tish’s abusive ex-husband did a number on her emotionally, she’s not looking for love. But fate has something else in store for her when she goes to an estate sale and finds a locket with a ruby in the middle. She snatches the locket, and as she cleans it up, she’s not only splashed with some mysterious red liquid that stains her hand, but inside is a Victorian picture of a man who Tish describes as a “extra-naughty Mr. Darcy”. She wears the locket to bed, and when she awakens next, she's naked on a stone in the middle of the woods with the “extra-naughty Mr. Darcy” watching her.Naughty Darcy introduces himself as Criminy Stain. He’s the one who has brought Tish over to the world of the Sang, or rather the spell he placed on the locket has. He’s been waiting for Tish to arrive. Tish thinks she’s still dreaming and goes along with Mr. Stain who has very sharp, pointed teeth. Criminy is a magician and in charge of a traveling troupe of carnival folk. Criminy is known as a bludman. He drinks blud. Tish is a Stranger and a Pinkie. Pinkies are humans. Many of the animals are known as bludanimals such as bludbunnies and bludhorses. Bludbunnies will tear a person apart for their blud. Bludbunnies are predators and not the cute and fuzzy animals that can be kept as pets. Also, when Tish touches the skin of another, she can see their future. And when she touches Criminy, she sees her own future and it scares her.\nBeware the bludbunnies!Criminy wants Tish to stay, but she wants to go back home. Since he has no idea how to do that, he installs her in his caravan as a fortune teller in the hopes she’ll want to stay with him. Tish finds this strange alternative Victorian world fascinating, but she can’t leave her grandmother alone.Soon enough Tish is welcomed into Criminy’s fold. There’s another Stranger who Tish recognizes from her own world, and soon enough she figures out how she can get back home. She's then jumping back and forth to her world and back to Criminy’s until her locket is stolen. She now has to find her locket so she’s not stuck in the world of the blud and with a man who makes her feel on fire with lust.I had such a blast reading Wicked as They Come. Delilah’s world and her characters are the breath of air I needed. Tish is strong, daring, and a worthy partner for Criminy. Ah, Criminy Stain, you are one cocky, yet lovable fellow. Even in the face of danger, he’s always calm and cool. Criminy hides behind a facade most of the time until he and Tish, his Letitia as he calls her, engage in that age old dance where they succumb to their desires for one another. Crininy keeps his gloves on and nothing else when he loves Tish. There's a reason for this, but it brings a hot and titillating experience to the love scenes.There’s a bit of everything here from ghosts, to submarines, evil power hungry mad men and a nice sense of empowerment for Tish, who as Leticia in her buttoned up, corset and glove wearing self can accomplish anything.If you’re looking for an oddity of a book, and I mean that as a compliment, you must picked up Wicked as They Come. You’ll fall in love of the world of the Blud and with Criminy. But beware, those bludbunnies will gnaw off your leg if they can.Pocket Books has a great thing with Delilah. I hope the Blud books will become a long lasting series with them."}, {"userName": "Kenya Wright", "userReviewDate": "Mar 27, 2012", "userURL": "http://www.goodreads.com/user/show/3414889-kenya-wright", "userReview": "HmmmmmmmmmGosh this book started off so so so so so good! I give it Two Stars for just the mindblowing begining... but sadly I had to DNF it! That's right boys and girls. I Did Not Finish it.Why?ok...First let me say that it started off so freaking great. It was like this Adult Alice in Wonderland... really airy dark fantasy! Luscious carnival people doing groovy magical things.And then some sort of wierd Love Triange was thrown into it... like it dropped from the sky...I know. I know what you guys are thinking.But Kenya, you LOVE love triangles!I do, but not badly executed love triangles....Then... The book just kind of goes Bleh in the middle.Its like the author had diarrhea and just smeared it all over the manuscript so the editors couldn't read some of the lines... so things were taken out... which resulted in lots and lots of Plot Holes... and boredom.I mean really, once you got over this great fascinating world of blood bunnies and blood horses... its like okay... give me some fun plot.I wasn't in to Criminy... I just wasn't. I mean scales all over his hands? Then what the hell was up with the protaganist not having a BRAIN? He's dragging her there... He's dragging her here...Criminy says... Criminy says....The story should have just been told in Criminy's POV. Plus, I didn't care about the damn locket and getting it back... and blah blah blah...so.. I had to DNF it!"}, {"userName": "Robin (Bridge Four)", "userReviewDate": "Apr 28, 2013", "userURL": "http://www.goodreads.com/user/show/14105531-robin-bridge-four", "userReview": "Maybe I’ve been reading too many YA books because Wicked as They Come was hot.Letitia has been left a little broken after a very bad long term relationship. Her life is a little empty, except for her job, and unsatisfying. After one of her hospice patients dies she finds a locket at the estate sale and in it is the picture of a beautiful exotic man with dark hair and eyes that seem to stare into her. The locket transports her to the land of Blud.I loved this world, it was dark and sinister and primal in many ways but it was also magical, steampunk and full of wonders. Woodland creatures have fangs and can bite and drink your blood. The costuming is Victorian with corsets, gloves and wonderfully bright color gowns for the women and the men wear long tail jackets, shirts with frilly collars, gloves and hats. It is like a Jane Austin novel took a turn into a wantonly wicked land and I couldn’t get enough. Criminy Stain is a naughty Mr. Darcy and completely swoon worthy. He is a bludman, which is like a vampire without the aversion to garlic, holy water or sunlight. He was born that way and grew up in the mischievous land of blud. He enchanted and sent out the locket to find his prefect match and while he is sure of Letitia she is not sure of him. I loved his character he was charming, endearing, patient, dangerous and witty and from what I read an extremely good kisser. While at times I wanted to slap Letitia for not swooning immediately for him and back flashing to her bad boyfriend Jeff I always loved Criminy. Just the banter and dynamic between them kept me riveted but there was also an adventure and journey to retrieve the locket and save the bludpeople from genocide. This was one of the most original worlds I’ve read in a while it was witty, sexy and fun."}, {"userName": " ~V~", "userReviewDate": "Jun 26, 2012", "userURL": "http://www.goodreads.com/user/show/3284461-v", "userReview": "Wow, what a unique and interesting book! Part UF, part PNR, part steam-punk all set in a strange world where there are Bludman (basically a vampiric race) along with Bludbunnies, Bludmares, Bludstags and Bludrats...creeeeepppy!!! Humans in this world are called Pinkies and they're a a downright rude and prejudice group of people! Then again, if you are being eyeballed to be someone's next meal, no matter where you go, i guess that might \"harden\" a person! Sang, the name of this world, is crazy...and Letitia, the heroine, suddenly wakes up in this new place thinking she's dreaming and quickly comes to realize that she's NOT dreaming and was pretty much \"summoned\" with out her knowledge. Criminy Stain is the first person she meets and the one who's summoned her...he is a Bludman and magician...he is also the head of his own traveling circus. There is just something about that man! He's funny, charismatic, he has all the signs of an alpha male...some people fear him, some worship him, women swoon, he can be harsh with others but has a definite soft spot for his woman. I would challenge anyone to read this book and not fall hard for him...even with the scaly black hands with claws and pointy teeth! What's that you ask!? You're just going to have to give Criminy a try to find out what i'm talking about. ;)I would def. recommend this to any lover of paranormal romances. It was different, fun and fast paced and soooo enjoyable. It didn't suffer any of the pitfalls that a lot of first books in a new series suffer, especially in the paranormal romance genre. Looking for something new and refreshing, look no further, this book is it!"}, {"userName": "Alaina Meserole", "userReviewDate": "Apr 10, 2018", "userURL": "http://www.goodreads.com/user/show/50620706-alaina-meserole", "userReview": "Wicked as They Come was a pretty good book. Okay so Tish is a nurse and loses a client of hers one day. Then she goes to their estate sale and sees something that she just has to have: a pendant. Then things get really weird after she got this thing and opened it. I don't want to go into so much detail because that would basically spoil so much about this book.Basically shit hits the fan after she opens this pendant.. and she wakes up in a different world once she falls asleep. I hope that made sense.. because I'm still shook from it. Anyway, she wakes up naked and afraid and looking at a guy that was from the locket. This book was weird and kind of predictable. I feel like I was high while reading this book because of what was happening in this world. Not that I hated it or anything but it was interesting.. like beyond interesting. I was intrigued AF and kind of shook too.Overall, I could probably sum this up as a trip in Alice in Wonderland.. but like on more drugs. The characters were okay and slightly lovable. I guess I just wanted more from it? I don't know I'm weird and this book was weird."}, {"userName": "mich", "userReviewDate": "Apr 04, 2017", "userURL": "http://www.goodreads.com/user/show/17575003-mich", "userReview": "[there was a huge chunk of the book, from 50%-ish, where things felt pretty random and the events that took place weren’t very interesting. It was weird too, cuz it seemed like exciting fast-paced stuff that was going on, but I was bored while reading it so. . . I dunno. Maybe it’s just me. (hide spoiler)]"}, {"userName": "Rebecca ♥ Warner, Kishan, Magnus ♥", "userReviewDate": "Mar 07, 2012", "userURL": "http://www.goodreads.com/user/show/703854-rebecca-warner-kishan-magnus", "userReview": "This review can also be found on my blog: A Match Made in HeavenThis was incredibly unique and surprising. Leticia is a home care nurse coming out of a long-term abusive relationship and she is not looking for anything serious. But someone else is. Someone is looking for someone just like her. She is strangely drawn to a ruby necklace she finds at an estate sale of a deceased patient, and without really understanding why, she steals it! That night she wears it as she falls asleep, and she wakes up in a strange magical land. She is found by a caravan gypsy king named Criminy Stain (sounds like a girl's name to me, but oh well). He is a Bludman. In his world called Sang, Bludmen are born, and besides drinking blood, their only similarities to vampires are their strength and longevity. When Leticia asked him if he was a vampire, and explained to him what a vampire was, he was rather insulted to be compared to something dead. He is very much alive and lives life to the fullest. It is a very strange world Leticia finds herself in, with Victorian dresses, magic, and clockwork pets, and where she suddenly has the power of a seer. And most confusing of all, is when Criminy tells her that she has been brought there for him. He had his heart broken once when he was younger. Now he is 130 years old and still alone. So he put a spell on the necklace to go out and find him his perfect mate. But he never anticipated that she would resist. He just assumed that if she was perfect for him, he would be perfect for her. She is drawn to him of course, he's like a wickedly delicious version of Mr. Darcy, but he is not the kind of man she ever actually imagined herself with. He's just a secret fantasy. And at first that is what she thinks he is, a dream. Criminy is extremely forward and honest about his feelings, but Leticia refuses his advances. Then her necklace is stolen and she is stuck in his world. Together they must chase down the rich and powerful man who stole it and stop his plots against Bludmen. On their journey they have to fight ghosts, blood thirsty bunnies and jealous, backstabbing mermaids, and commandeer a submarine.The world this book created is extremely unique and vivid, but my favourite part is the characters. Criminy and Leticia are not your usual hero and heroine. They have some of the familiar traits, but Leticia was really a damsel. She is brave and clever and kind, but she is not strong and never did any of her own fighting, and she cries rather easily. But I really enjoyed her character because she felt so real and genuine. And her and Criminy complemented each other perfectly. Criminy has a viscous side, like any blood drinking creature, vampire or not. But he is not dark and mysterious like you might be expecting. He is vibrant, exciting, and open, always making Leticia laugh with his magic tricks and crooked smile. They are an amazing couple. Criminy loves her so openly and freely, and although Leticia may not be there yet, I can see theirs becoming a truly epic love. I cannot wait for Wicked As She Wants. **Edit: I am sad we don't get to see it as the future books in the series are each about a different couple.This is an adult book and there are a couple of sexy scenes in it, but it was not overly emphasized. I am very glad that this is one of few adult PNRs I've read where the sex does not overshadow the romance."}, {"userName": "Melindeeloo", "userReviewDate": "Mar 30, 2012", "userURL": "http://www.goodreads.com/user/show/2766907-melindeeloo", "userReview": "4.5 stars - Tish, thinks she's still dreaming when she wakes to find herself naked in the presence of an oddly compelling man in a top hat, Criminy Stain, who just so happens to be the man pictured in an usual locket she's just acquired. She finds it hard to believed that she is actually in another world where there are lots if critters who think human blood is a yummy snack and that she's there because opening the locket triggered a spell to bring Criminy the perfect woman he's been waiting for.I just have to rave about Wicked As They Come, once the heroine makes it to the world of Sange, with its predatory vampire bunnies, I was totally hooked. I especially liked the early parts of the story set in Criminy's carnival where Tish learns about the world, meets her fellow performers and where she gets to use her newly discovered and rare ability to 'glance' and see the future. I loved the very unique world with its steampunkish trappings, and touch of magic and the off kilter characters that lived there really appealed to me. The magical gypsy Bludman, carnival master Criminy Stain was an interesting hero, perfect in his surety of his love for Tish, whom he calls by her full name Latisha, but with an edge of danger to him, because as a Bludman he is a predator too. I would say however that story with its first person narrative and alternate world was probably more UFish in tone than paranormal romance that it claims, even though the story follows the one couple. Additionally, there wasn't much tension in the romance department since the leading man is totally committed to winning the heroine from the beginning - but that didn't really bother me because the pair have places to go and things to do and I enjoyed their adventure – and there were three love scenes (mild on the sensuality scale). Others have mentioned that they were unhappy with the ending since it didn't explicitly connect the dots to the happily ever after for Criminy and Tish, but I thought that there were enough little things here and there and in the heroine's visions that I was happy and sure that they would end up together. So the bottom line is that I really liked Dawson's steampunk/paranormal/romance Blud series debut and now I can't wait for the next one – Wicked as She Wants which stars a different couple but has a character we've already getting his one HEA."}, {"userName": "Julz", "userReviewDate": "Jul 19, 2014", "userURL": "http://www.goodreads.com/user/show/4211322-julz", "userReview": "4.5 starsThis one was a hard-to-put-down, crazy fantasy that made me wish I could read it again for the first time. Those are few and far between. The heroine finds an enchanted locket that transports her to an alternate reality where bunnies can strip your bones and clockworks replace modern technology. She is unknowingly answering the call of our hero, a vampire, gypsy king, who runs a traveling carnival. Loved me some hero who was not too tall, could juggle, dance and do magic while letting his fingers do the walking with his black, scaly hands. Everybody's ideal feller. Our heroine has to decide her future while she and the hero are pitted against bad guys, blood thirsty wildlife and vengeful ghosts. Had. A. Blast! However, as a public service announcement, several vicious, man-eating bunnies bit it during the making of the story. Just thought I should put that out there."}, {"userName": "Ferdy", "userReviewDate": "Apr 06, 2012", "userURL": "http://www.goodreads.com/user/show/4596358-ferdy", "userReview": "2.5 starsAfter three years of being in an a abusive relationship, Tish Everett is free and happy. Tish is finally putting the pieces of her life back together, she spends most of her time looking after her grandmother and working as a nurse. The book begins with Tish at an estate sale of one of her former patients. Tish discovers an old locket at the sale and is stunned to find herself drawn to the man pictured in the locket. Tish wears the locket that very same night, when she awakens Tish learns that she's travelled to an alternative world called Sang, filled with coppers, bludmen, carnivals and magicians. She is welcomed by a Mr Criminy Stain, a bludman who informs a confused Tish that he is her soulmate and that his locket bought her to him. In the world of Sang, the bludmen who unsuprisingly need to feed on human blood are persecuted by the coppers - the human law enforcement. On sleeping, Tish travels back and forth between the two worlds, Tish is torn between going home to her gradmother and her growing feelings for Criminy. When Tish's locket is stolen, Tish is devestated to be trapped in Criminy's world. Criminy and Tish have to avoid the coppers when they set off to find her locket so she can return home to her grandmother. I enjoyed the worldbuilding - it was rich, colourful and lush. The world of Sang had a Victorian, steampunk, clockwork type vibe going on ..which I loved. There were quite a few interesting side characters that bought the carnival side of the story to life, unfortunately little time is spent on these characters. The hero, Criminy was devilish, loyal and protective. I liked that even though he was the master of his carnival, he wasn't rich, all knowing and all powerful. I'm beginning to dislike heroes who have it all - they're the richest, most powerful, most feared, most broody, most alpha..blah blah blah..if they're described as so indestructable how do they manage to get themselves in danger all the time and how do they fail to protect the people they love?? Moving on, the main problems I had with this book is the unremarkable storyline, the uninteresting/boring heroine and the ending that leaves a few questions. There was nothing bad about Tish really, but she was just so dull and flat - I really couldn't understand what Criminy saw in her. Her reaction to finding out she was in a different world filled with vampire-like creatures and animals was underwhelming..it was like she just found out it was going to rain. For some unknown reason, Tish randomly develops psychic powers when she's in Sang, it isn't explained where she got her powers or why she didn't have it or even a hint of in her own world..it just seemed to be thrown in because it was convenient to the story and so Tish could seem speshul. People who are in coma end up in Sang, which is basically meant to be a mirror of Earth. Tish ends up in alternate England because the locket sent her to her soulmate who is in alternate England. What baffled me was that Tish came across a few people that were in a coma in America of her world, yet it's never explained why they randomly turned up in alternate England instead of alternate America.I didn't enjoy the storyline, like a lot of books I've recently read, a large bulk of the book is just the main characters travelling from point A to B to C..I tend to find long winded journeys in books to be unimaginative and lazy writing. The ending left a lot to be desired, if I'm going to read a PNR book I want a proper HEA not an ending that leaves me thinking what exactly happened. I need it written out, I don't want an ending that's left to my own imagination..if that's what I get there's no point even buying the book when I can just make up my own bloody story.There is a sequel focused on a different couple, I won't be reading the next book unless it's got a lot of rave reviews."}, {"userName": "Alkyoni", "userReviewDate": "Jan 25, 2014", "userURL": "http://www.goodreads.com/user/show/3720870-alkyoni", "userReview": "I have a friend whose name is Tish. Tish is a nurse. A bit unlucky in love, considering that she broke up with her boyfriend recently, but it was a happy day actually (I had been telling her for ages that the guy was no good). She now has some commitment issues, but I wouldn’t worry too much about that. There’s a soul mate for everyone you know. And if he ain’t here, he might be elsewhere…So, we were on the phone the other day, and she started telling me a weird story about how she went to bed the previous night and woke up elsewhere. It was a weird place she said. Kind of reminded her of Victorian England, but not quite. There were bunnies in the forests, bunnies with fangs! People with fangs too! But they didn’t call themselves vampires, they went by Bludmen. And there was a Circus full of clockwork animals and strange people! And among them was Criminy Stain, the master of the caravan. We were on the phone for a long time, Tish and I. Her descriptions of that place were vivid, and I was highly intrigued by her Mr. Stain, although a bit sceptical when I heard that he fell in love with her at first sight. Then she started talking about that other dude she met there, and how she was attracted to him as well, and I kind of rolled my eyes because I hate it when my friends get into love triangles. We then got into a long discussion about how the people in that place treated the Bludmen. How they hated them for what they were, wanted them dead, wanted their children dead. Tish said that most of the Bludmen she met there were very nice and kind to her. Mr. Stain himself is a Bludman. We then concluded that be it here, be it elsewhere, people are always afraid of those who are different from them, and that their fear soon becomes hate, and that hate brings great misery to us all. (I have got to stop hanging around with Sookie. I'm beginning to sound like her...)She then told me of her big adventure, how she and Mr.Stain fought against an evil man who wanted all the Bludmen dead. That was the most interesting part. She also got into some details about her… erm…activities with Mr.Stain but that part wasn't very long I must add, considering that other friends of mine go on about wet pools in their undergarments and what not for HOURS. But then she started talking about them feelings and the choices that she was forced to make and the dilemma, oh the dilemma it burned, and I kind of drifted off.I woke up some time later because I had the telly on and some guy in a Kung Fu movie went “kyaaaaaaaaaaaaaaaa”. Tish had just finished talking about them feelings and had gotten back to the good part about fighting the bad guy, so I tried to stay awake and listen to how it all turned out. It was a good story overall. I’ve got to give it to Tish; the girl can describe a place that she’s been to like nobody’s business, no matter how foreign and weird it might be. Her adventure was entertaining as well. Even though she isn’t the kind of woman who doesn’t shut up about her love life, I think I’d prefer her story if she had completely left that part out because, in my humble opinion, it wasn’t that interesting. Not when it has to compete against BLUDBUNNIES for my interest.Before we hung up, she told me not to forget to call that musician that we know, Mr. Casper Sterling. Apparently he too has been elsewhere. But I don’t think that I’ll be calling him. I am not very fond of the guy."}, {"userName": "Treece", "userReviewDate": "Apr 30, 2017", "userURL": "http://www.goodreads.com/user/show/1646176-treece", "userReview": "Rating: 3 1/2 starsA creative and delightful romp of a story sometimes set in our modern world and other times, set in an alternative historical universe. I adore steampunk and the way this author uses her imagination to bring the world of Sang to life is wondrous. My issue is that I didn't always like the h, Tish/Leticia for the way she treated the H, Criminy Stain. Her flaws and issues were understandable but the way she treated the H was downright self-centered and cruel. I admired her loyalty to her ailing grandmother but she used it as a crutch when it was time to explore her feelings about Criminy and to make decisions. There were times when Tish made decisions by behaving like a spoiled child and got just what was coming to her in the end. Other times, she rose above her less admirable inclinations and was amazing.I'm interested in what happens to this couple. The ending is not quite complete but it is not a cliff-hanger either, just enough room for a sequel. There are a series of books featuring other characters that follow this first installment but none of them continue Criminy and Tish's story, only the final book. At 12.99 on Kindle, I'm not certain if I am that devoted. I purchased this first book b/c the price was drastically discounted from the original price of 7.99. If you can get this book at a steal I recommend it but if not, you might feel cheated a bit. Otherwise, it was a pleasant way to spend my time traveling to and from work, and waiting at the doctor's office etc. You get the idea ;-)"}, {"userName": "Suzanne (Under the Covers Book blog)", "userReviewDate": "Mar 06, 2018", "userURL": "http://www.goodreads.com/user/show/3575839-suzanne-under-the-covers-book-blog", "userReview": "This book has been on my shelf for a long time and I've always assumed that when I did finally get around to reading it that I would love it. I don't know why that wasn't the case. It contains all the ingredients that normally, for me, makes for a 5 stars read; slightly weird hero, interesting new world, general quirkiness, a good heroine. But for some reason, when I finally did get around to reading it, it took me 3 months to finish it. 3 months! Why did it take that long? I just kept losing interest in it. I didn't really connect with any of the characters, I found the story a little boring and although the world intrigued me, it didn't intrigue me enough that it kept me reading."}, {"userName": "Mrs.Vishous-Kattalakis-Belikov :::Para Itch Reviews:::", "userReviewDate": "Mar 23, 2012", "userURL": "http://www.goodreads.com/user/show/4531338-mrs-vishous-kattalakis-belikov-para-itch-reviews", "userReview": "Tish is a home nurse for hospice and since one of her patients passed on she's there sorting through her things. The family is selling all her antiques in an estate sale and Tish happens upon a beautiful locket. In some wierd way it calls to her, so she steals it. But once she opens it she teleports and winds up naked in a field with the sexy man she saw inside the locket who introduces hisself as Criminy Stain.“I was startled when I saw him there, leaning against a birch tree. Seconds before, I was sure I was alone, and then he appeared as if by magic. It was the man from the locket. He had the same insolent, daredevil, knowing smile, the same unruly hair. One tall black boot was kicked up against the tree behind him, and his arms were crossed over his chest, stretching the shoulders of his black tailcoat. “You’re here,” he said simply. “Do I know you?” I asked, which came out more haughtily than I had intended. “You will,” he answered, kicking off the tree and walking toward me. “After all, you’re wearing my locket. And I’ve been waiting for you.”So off Tish goes into a whirlwind adventure with the sexy Criminy Stain with blud drinking animals and an evil Magister that wants to eradicate all Bludmen from their world! As well as Criminy's carnival of freaks where she plays an integral part in. I thought it was hilarious when Tish thought she was dreaming and tried to fly:I needed to take control of the dream. I held out a hand with fingers splayed and focused my will. “Zzzzzzzsssst! Pshew! Zzzzist!” I said. But nothing happened. “What in Sang are you doing, love?” he asked. My arm dropped to my side. “I was trying to shoot lightning bolts out of my fingertips,” I said. Then, quietly, “It usually works.” “Told you it wasn’t a dream. Do you want to try flying, too?” Sheepishly, I gave a little hop, but my feet came back down to the ground. “No,” I said, feeling sullen and embarrassed and on the verge of outright panic. I really did enjoy this book. It kinda reminded me of Alice in Wonderland on acid. Blud drinking bunnies and bludrats....it was a fantastic trip! I loved every second of it and I wish we could get more of Criminy and Tish! They really had some funny and heartfelt moments and I just fell in love with Criminy. He's definitely on my book boyfriends list...no doubt! I did get a little tired of Tish and her dilydallying about who she wanted to be with....\n “What you’re seeing is pain. And you’re the only one who sees it,” he said more softly. “You’re the only one who can cut me, and you wound me deep.”\n I was like; \"duh bitch Criminy loves you and he's the one!Wake the feck up!\" But Im glad they ultimatly got their shite together. They make a great team!He was an animal. He was terrifying. And he was beautiful. I realized that I was biting my lip, that my hand was wound into the ruffled fabric at my chest. Something in me was drawn to the carnage. Like so many women before me, I was a slave to the caveman brain, that deep old part of my DNA that whispered that ferocity would keep me safe and fed and alive and that I should most definitely find the fiercest creature around and hump it. There were so many funny moments and Criminy and Tish's culture differences just cracked me up. Since Tish was from the modern world and Criminy was not it was hilarious when Tish had to explain certain things:“I don’t know,” I said, exasperated. “What else do you have in your wacked-out world? Heat sensors? Mine fields? Dirigibles? Booby traps? Machine guns? Shrink rays? What?” “Aside from dirigibles, which are rather expensive and rare outside of trade routes, most of what you just said made no sense whatsoever,” he said, as delighted as a child hearing a foreign language for the first time. “But it all sounds very dangerous. And fun. Especially the part about the boobies.” All in all, I loved this book and had a great time immersing myself in this colorful and twisted world. Awesome series....check it out!\n\"I would burn down the world for you,\" he whispered fiercely. \"Your world or my own. I would rip down the entire city with my bare hands without a second thought. I don't need to taste anything else, I don't need a comparison. \"\nNow thats what Im talkin about!!!Check me out @Paranormal Itch Reviews"}], "description": "When nurse Tish Everett forced open the pesky but lovely locket she found at an estate sale, she had no idea she was answering the call of Criminy Stain, from the far off land of Sang. He’d cast a spell for her, but when she’s transported right to him, she’s not so sure she’s ready to be under the spell of another man. (It didn’t go so well last time with controlling, abusive, domineering Jeff.) If only Criminy wasn’t so deliciously rakish….Half the inhabitants of Sang are Pinkies—human—and the other half are Bludmen, who in Tish’s world would be called vampires. But they don’t mess with any of the bat/coffin/no sunlight nonsense. They’re rather like you and me, just more fabulous, long living, and mostly indestructible. (They're also very good kissers.) But when the evil Mayor of Manchester (formerly Bludchester) redoubles his efforts to rid Sang of the Bludmen once and for all, stealing Tish’s locket in hopes of traveling back to her world himself for reinforcements, Criminy and Tish must battle ghosts, sea monsters, wayward submarines, a secret cabal, and thundering Bludmares to get the locket back and allow Tish to return home…but has she found love with Criminy? Could she stay in Sang forever?", "title": "Wicked as They Come\n      \n          (Blud #1)", "url": "http://www.goodreads.com/book/show/12381722-wicked-as-they-come", "average": 3.66, "cover": "https://images.gr-assets.com/books/1324921586l/12381722.jpg", "reviews": 782, "authors": [{"url": "https://www.goodreads.com/author/show/5135449.Delilah_S_Dawson", "name": "Delilah S. Dawson"}], "type": ["Science Fiction", "Fantasy", "Romance", "Paranormal", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/12381722-wicked-as-they-come", "http://www.goodreads.com/book/show/12381720-wicked-as-they-come", "http://www.goodreads.com/book/show/12835120-wicked-as-they-come", "http://www.goodreads.com/book/show/34859132-phasma", "http://www.goodreads.com/book/show/27223580-the-perfect-weapon", "http://www.goodreads.com/book/show/19695718-servants-of-the-storm", "http://www.goodreads.com/book/show/19290513-hit", "http://www.goodreads.com/book/show/13635645-wicked-as-she-wants", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/25353286-provenance", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}