{"ratings": 283, "userreviews": [{"userName": "Chie", "userReviewDate": "Jan 29, 2011", "userURL": "http://www.goodreads.com/user/show/4023251-chie", "userReview": "Its a quite a hippy-eish and free spirited book. She is a very good writer, she has a consistent and natural flow.The whole basis of the plot is good, my uttermost favourite thing in the book is the sort of rogue-esk feeling of some of the characters. I love how the rats and Kevin(a street kid) are central parts. Nowadays its all about 'emo/depressed girl'a 'a genius'etc and the wonders of normal people and animals are forgotten. In this they arent forgotten, I love reading about real people and animals. The rats and Kevin are very entertaining. She weaves worthy characters.Then theres the Irish mythology, incorporation of naturistic scenery. I liked that.On the other hand, the very ending degraded the whole book. The switching at the end just got out of hand, from a sacred sort of limited power, it turned to be a common limitless magicians art. For me its either completely magic oriented or not at all. Maybe just a matter of taste! Aside from that, it was just a good read, it deserves a lengthy review. Not amazing but very good. Happy to have read it."}, {"userName": "Aelvana", "userReviewDate": "Oct 31, 2014", "userURL": "http://www.goodreads.com/user/show/33911745-aelvana", "userReview": "In the final book in the Switchers trilogy, Tess is coming up fast on her fifteenth birthday. She must decide what her final form will be. Her parents, however, have sent her off to live with her cousins during this fateful phase. Tess is having a hard enough time trying to get a little time to herself so she can think over her decision when her cousins suddenly go missing. Only Tess has the power to save them, but can she do so in time?I'd figured from the beginning what Tess's final choice would be---not just the beginning of this book, but the beginning of the series. Why do authors always cop out? Anyone with half a brain is going to see the ending coming from a mile away, so the only real surprise was that the origin of Tess's power is finally explained as well.Tess continues to astonish me with her lack of imagination. She doesn't hunt out forms to become; she waits for people to tell her. This makes the end of the book feel very rushed, when she's learning a hundred things all at once, and the temptation didn't feel strong enough to make the choice at the end any choice at all. Also, the two brothers made up unbelievably fast for such a long grudge. It wrapped up too neatly for the amount of bitterness involved.The prose was generally better than Midnight's Choice, but the author decided to start in the middle of the story and then flash back. This has been done very successfully by some authors, but here it took me about three chapters after the fact to realize we'd gone back in time from the first item, and the confusion around that scene did not resolve as much as I would have liked.The rules about power continue to be arbitrary, but at least something of an explanation is finally forthcoming. There is still absolutely no reason why the power vanishes at age 15. In fact, given its origin, I would've expected some trace to stick around a Shifter's whole life, even if it does fade as people grow older and less inclined to believe in magic. Also in the list of questions the author probably never thought to ask is the unnatural consistency of how the power manifests. Every single person is a Shifter. Granted, this would be true. However, I find it extremely odd no one noticed their powers went beyond themselves. Martin, at least, should have tried something. He had the right disposition.All in all, this is not as disappointing as Midnight's Choice, but definitely not near the top of books I would recommend. Tess would have made a better secondary character than heroine. I can't see how the use of her power changed her at all, much less why Kevin couldn't have done the whole thing himself. In fact, that probably would have made a much better story. Perhaps it is worth reading just to learn a little more about their power, but don't hurry out to get it. Neutral."}, {"userName": "Oanh", "userReviewDate": "Feb 01, 2010", "userURL": "http://www.goodreads.com/user/show/880865-oanh", "userReview": "I'm happy to have finished the trilogy but found this last the least pleasing of the books in the Switchers series. It seems a bit churlish to complain about but I found Tess' continual obtuseness and inability to believe in magic, fairies and Ireland's old myths aggravating: after all, she believed in Krools and a vampire, and is a Switcher. I tried to tell myself if was KT characterisation of self-absorbed adolescence but I was more annoyed with Tess in this, than any of the other books.Still, I do love the vibrancy of Ireland's legends and the palpability of its fairy-world (and the amorality of it, too) that having Tess' story weave into a story of Irish fairies was most enjoyable.And I would have read it in a sitting if I did not have to cycle 100kms over the weekend."}, {"userName": "Kelsie Beaudoin (The Bookworm)", "userReviewDate": "Sep 07, 2012", "userURL": "http://www.goodreads.com/user/show/7110689-kelsie-beaudoin-the-bookworm", "userReview": "This book was the ending of the Switcher series, but fell flat for me. It was still interesting to read, don’t get me wrong, and I enjoyed it. But I really don’t like when authors add in other cultures myths to make the story more exciting. Adding in vampires in the second book was forgivable, but then this book added in Celtic lore. And it just seemed so tired.It was a nice end to the series, but definitely didn’t live up to the first book in my mind."}, {"userName": "Hannah ", "userReviewDate": "Jul 28, 2012", "userURL": "http://www.goodreads.com/user/show/5739754-hannah", "userReview": "i think i wouldve appreciated this book more if i was younger, because now, after just a whole day of reading this, i kind of thought it was stupid. the perspective was kind of weird. I thought it was hard to read smoothly, but it was still a good story. I hadnt read the first two books and i was still able to understand it, which was good."}, {"userName": "Vern", "userReviewDate": "May 20, 2009", "userURL": "http://www.goodreads.com/user/show/857518-vern", "userReview": "Good book. Very interesting ideas. The ending surprised me. I think I liked the first book the best, then the second one. There are some really cool things that happen in this book. She is really a cool writer. And I love the references to Ireland and Irish culture and Myth."}, {"userName": "Laine", "userReviewDate": "Jun 15, 2012", "userURL": "http://www.goodreads.com/user/show/9519322-laine", "userReview": "uh... I liked the book, but I feel the need to say that the summary for the paperback edition on this is wrong. I don't know what it actually goes to, but it's certainly not Wild Blood."}, {"userName": "Natasha", "userReviewDate": "Nov 14, 2008", "userURL": "http://www.goodreads.com/user/show/1656292-natasha", "userReview": "This was a good one, better than the other two. It was interesting and I finished it in less than a day. My favorite character in the entire series is definitely Kevin."}, {"userName": "Valkiery", "userReviewDate": "Apr 05, 2013", "userURL": "http://www.goodreads.com/user/show/5099440-valkiery", "userReview": "I remember reading this when I was young and loved these books! I'm going to have to reread these treasures. :)"}, {"userName": "Celia", "userReviewDate": "Aug 31, 2014", "userURL": "http://www.goodreads.com/user/show/32160135-celia", "userReview": "I enjoyed reading the unusual and exciting ending to this trilogy. It was a creative plot, but the language reminded me that it was a childrens story."}], "description": "With her fifteenth birthday approaching, Tess is running out of time. She must decide who -- or what -- she will become when she makes the final Switch of her life. To make the impossible decision even worse, she finds herself shipped off to relatives in the country, miles from home, her parents, and, most important, her best friend, Kevin.In the third and final installment of the Switchers trilogy, Tess will choose what form she will take for the rest of her life. Will it be human, animal, or something even wilder?t a trip!", "title": "Wild Blood\n      \n          (Switchers #3)", "url": "https://www.goodreads.com/book/show/296523.Wild_Blood__Switchers___3_", "average": 3.68, "cover": "https://images.gr-assets.com/books/1173484061l/296523.jpg", "reviews": 10, "authors": [{"url": "https://www.goodreads.com/author/show/65783.Kate_Thompson", "name": "Kate Thompson"}], "type": ["Fantasy", "Young Adult", "Paranormal", "Fantasy", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/296523.Wild_Blood", "http://www.goodreads.com/book/show/287886.The_New_Policeman", "http://www.goodreads.com/book/show/296524.Switchers", "http://www.goodreads.com/book/show/3450308-creature-of-the-night", "http://www.goodreads.com/book/show/2093204.The_Last_of_the_High_Kings", "http://www.goodreads.com/book/show/1001976.Midnight_s_Choice"]}