{"ratings": 863, "userreviews": [{"userName": "Adam Dalva", "userReviewDate": "Jan 17, 2018", "userURL": "http://www.goodreads.com/user/show/3263980-adam-dalva", "userReview": "An effective, often moving continuation of his excellent Autumn, as Knausgaard continues to write brief pieces to his unborn daughter, trying to explain the world one word at a time. As with the first book in this quartet, there is a pre-occupation with the elemental aspects of humanity, as the author explores why we have retreated inside as a species, and how we perceive infinity. In this philosophic bent, the book has as much to do with his underrated masterpiece A TIME FOR EVERYTHING as it does with the well-known memoirs that gave him his fame. Many of these are quite weird too (there's a memorable image of hundreds of human brains floating in the ocean like jelly-fish who have achieved Nirvana). I went to a lecture earlier this fall where he talked about how he wrote these - he chose all the words ahead of time and would write one a day, as the mood struck him. (As a note to writing instructors, I did this with my class and they produced the best student writing I've seen). There is a slight exhaustion in this volume, likely because these words are slightly less captivating to the author. He does a bit less with, say \"Ears\" then he did with \"Ambulance.\" To compensate for that, fascinatingly, a plot begins to emerge. 3 vignettes in a row are about escape; he begins to describe the old men in his neighborhood; the baby is born ahead of schedule. Perhaps it is the novelistic instinct in Knausgaard coming out, but 500 pages and two books in, this is beginning to feel like a sneakier project than I first thought. There is a unique narrative here, and it is worth pursuing.My favorite defined words this time were: \"Water\"; Safety Reflector\"; \"Mess\"; \"Father Christmas\" (the image of a nervous Knausgaard dressed like Santa and waiting to surprise a neighboring child will stick with me); \"The Nose\"; \"Fireworks\"; \"The Social Realm\"; \"Setting Limits\"; the hilarious \"Q-Tips\" (in which he wonders if he's been using Q-Tips wrong his whole life and everyone reading the book will think he's an idiot); and best of all is \"Operation,\" which in its initial guilt and eventual redemption is a gorgeous piece of flash fiction. I'll put the first paragraph here, and end with it:\"There was something slightly absent-minded about one of our daughters when she was little, somehow she never quite paid attention. Since she didn't seem unintelligent, I thought it might be due to a hint of dreamy introversion in her character, which in other respects was light-hearted and sociable. But a few months ago they did a hearing test at the public health centre which revealed that her hearing is significantly impaired. So what I had observed wasn't dullness, that's not why she seemed inattentive, it was because she couldn't hear us properly...I don't think I have ever felt so guilty about anything.\""}, {"userName": "Darwin8u", "userReviewDate": "Sep 18, 2017", "userURL": "http://www.goodreads.com/user/show/2294090-darwin8u", "userReview": "\"Winter has almost no self-confidence after the triumph of summer and autumn's resolute clean up that followed, for what is winter, with its snowfalls and its icing of the waters, other than a cheap conjurer?\"- Karl Ove Knausgård, WinterI'm definitely a Knausgård fan. I love his observations. I love his energy. I love his prose. He isn't always perfect, but he is constantly pushing and exploring. This book is book 2 in his Årstidsencyklopedien (Seasonal Encyclopedia) Series. Winter or Om vinteren. His first book in the series was Autumn or Om høsten. The structure of these books is relatively (and seductively) simple. Knausgård writes every day for three months on a variety of subjects that relate to the season and month he is writing about, for example, in Winter he writes about:WaterThe First SnowOwlsPipesWinter SoundsGuestsThe OtterSexual DesireAtomsLokiConversationWinter BootsVanishing PointThe 1970sThis is just a sample of the mini-essays. He writes about 20 essays a month. So, 20 for December, 20 for January, 2o for February. He also includes 3 Essays at the beginning of each month; two letters to an unborn daughter, and one letter to a newborn daughter. Essentially, these books are open letters to his unborn, and in late January, newborn daughter. His fourth child. These essays are interesting, not always directly related to the seasons, but generally dealing with people, objects, animals, and concepts that interest him. And like Montaigne's essays, the subject is often just the starting point. His curiousity and thoughfulness allow these subjects to open and spin a bit. They are sometimes uneven, and some of them fall flat, but here is a guy that will, over the course of a year, write four books with about 240+ essays on various subjects. Not too shabby."}, {"userName": "Rebecca Foster", "userReviewDate": "Jan 14, 2018", "userURL": "http://www.goodreads.com/user/show/5875398-rebecca-foster", "userReview": "My favorite of the three Knausgaard books I’ve read so far, and miles better than Autumn. These short essays successfully evoke the sensations of winter and the conflicting emotions elicited by family life and childhood memories. The choices of topic in Autumn (“Toilet Bowls,” “Vulva”) were often so peculiar that I didn’t know what they were doing there, but I think I see now what Knausgaard was trying to do. This series is, loosely, a set of instruction manuals for his unborn daughter, who is born a month premature in the course of this volume. So in the first book he’s starting with the basics of physical existence – orifices, bodily fluids and clothing – and now he’s moving on to slightly more advanced but still everyday things she’ll encounter, like coins, stuffed animals, a messy house, toothbrushes, and the moon. I’ll see out this series, and then decide afterwards if I have the nerve to return to My Struggle."}, {"userName": "Jenny (Reading Envy)", "userReviewDate": "Jan 21, 2018", "userURL": "http://www.goodreads.com/user/show/68030-jenny-reading-envy", "userReview": "This is the second volume in the four-season set of \"Season Encyclopedias,\" where the author writes an essay about a one-word object/topic/concept, in one sitting. They vary in seriousness and theme, and I think the seasons sometimes effect the essays and sometimes they don't. Still, I started reading Winter when we had a snow day, because it seemed the closest I could get to Norwegian weather. The object/nature/concept essays are interspersed with letters to his unborn/born daughter, because she comes at the end of January, which happens in this volume. I found the best way to read this was a few essays at a time, in between other reads. You may see my review of the previous volume, Autumn, here.My favorites in this volume include:Mess (about messy people and his messy house)Winter Sounds (very beautiful passage about the forest in winter!)The LocalFish (talks about his realization of the connections between the water and island as a young teen)Thanks to the publisher for providing early access to this title via Edelweiss. This comes out January 23, 2018."}, {"userName": "Lee", "userReviewDate": "Jan 28, 2018", "userURL": "http://www.goodreads.com/user/show/90786-lee", "userReview": "More of the same, maybe not as tight, definitely not as novel as the first installment Autumn, the significance feels forced at times, the whole project like practice runs, exercises, but still I enjoy reading it for the world evoked and system of associations — will read the remaining two seasons as soon as they appear. Here's a quotation toward the end that summarizes the thematic dealio throughout: \". . . most of all it probably has to do with the dynamics between the visible and the hidden, between what we know and what we don't know. The more we know about the world the greater the pull of what we don't know, and every tunnel, every grotto, every subterranean chamber is a confirmation of what we have always felt, that nothing ends with what the eyes can see.\""}, {"userName": "Caterina", "userReviewDate": "Feb 27, 2018", "userURL": "http://www.goodreads.com/user/show/5558460-caterina", "userReview": "Winter is Karl Ove’s season! His imagination cuts loose in this second volume of his Seasonal Encyclopedia. The writing is whimsical, at times fantastic, hilarious or joyful, while not losing his ruminating voice or his confrontations with mortality and eternity. There’s a sweetness to many stories involving his children and his own childhood memories, snowfall, Christmastime festivities with their blessing/curse of houseguests, and the birth of his daughter. Maybe especially because of her birth, this volume seems super-inspired. (If the word “sweetness” deters you, keep in mind this is still the depressive Karl Ove Knausgaard.) If you are new to the series, each season’s volume, covering three months’ time, contains a monthly letter to his unborn/newborn daughter, sixty micro-essays (20 per month) and about ten paintings. These musings on everyday and seasonal things, occurrences, phenomena and concepts seem like a new way to do philosophy, and maybe theology, as I said my review of Autumn. Science is sometimes a jumping-off point for his audacious imagination. It’s hard to choose favorite essays because I loved pretty much all of them, to me Winter was consistently at the top of its game, and I think the whole is greater than the sum of its parts. Just as the first essay in Autumn faintly echoed the biblical book of Genesis with an encounter with a lone apple tree in the woods, from which the family freely plucked fruit, the first essay in Winter, The Moon, contemplates the lifeless moon over which no wind, mighty or otherwise, ever stirred, then imagines a fantastic moonly genesis. Other essays that stand out in my memory: Owls, Pipes, Mess, Guests, Conversations, Father Christmas, Stuffed Animals, The Otter, The Social Realm, Setting Limits, Hollow Spaces, The Local, Winter Boots, Q-Tips, Feeling of Life, Snowdrifts, and The Brain which takes my prize for hilarious crazy whimsy. Here's a sample from The Moon:The moon, this enormous rock which from far out there accompanies the earth on its voyage around the sun, is the only celestial body in our immediate vicinity. We see it in the evening and at night, when it reflects the light from the sun, which is hidden from us so that the moon appears fluorescent and seemingly reigns supreme in the sky. . . . If one points a telescope towards the moon, one can see that it is completely lifeless and barren and consists of dust and rock, like an enormous sand quarry. Not even a breath of wind ruffles it, ever; the moon is ruled by silence, by immobility, like an eternal image of a world before life, or of a world after life. Is that what dying is like? Is this what awaits us? . . . . The moon is the eye of all that is dead, it hangs there blindly, indifferent to us and our affairs, those waves of life which rise and subside on earth far down below. But it didn't have to be that way, for the moon is so close that it is possible to travel there from here, as to a distant island. . . . . Consider the peculiar kinds of creatures which have developed on earth from primordial times until today, with the most remarkable traits to enable them to meet the physical demands of their environment, it wouldn't have taken that much of an adjustment for creatures to appear that were equipped with the qualities required to cross the short distance in space. . . . The common horsetail, a primitive, primeval plant, couldn't its spools have developed a way of spinning that could have taken them up through the atmosphere and allowed them to drift slowly through space, landing gently in the dust of the moon a few weeks later? Or the jellyfish, couldn't they have left the oceans to float like little bells through the air? Air-fish, would that have been any more remarkable than fluorescent, blind deep-sea fish? Not to mention birds. Then life on the moon would have resembled life on earth, but would still have been different, like a radical version of the Galapagos, and the moon's birds, almost weightless, independent of oxygen, would have been able to come in swarms over the earth, visible as tiny specks far, far up there, slowly growing larger, and gliding with their enormous, paper-thin wings over the fields, shimmering in the light of the moon, which for people of that time was the seat of the sacred and the terrible.Lars Lerin, whose stunning watercolors illustrate this volume, ought to be listed on the cover as a collaborator; I am in love with his darkly glowing winter scenes; they drew me into the book like an enchantment. I kept wondering why so many were night scenes until remembering that winter in Norway means it’s dark most of the time. It looks like Knausgaard chose a different artist for each season. I so appreciate that he, an art lover, turned his book into a visual as well as a literary experience and gave this opportunity to four Scandinavian artists."}, {"userName": "Ken", "userReviewDate": "Feb 15, 2018", "userURL": "http://www.goodreads.com/user/show/730754-ken", "userReview": "I'd be surprised to see much variation in other readers' takes on Karl Ove's Autumn vs. Karl Ove's Winter. More of the same. Some weaker, some stronger, some just ordinary Karl, our favorite have-a-beer-with guy (and please don't smoke).Only the conceit of writing these to his unborn daughter disappears about 3/4ths through, as the little one is born on 28 January. This means that Spring (which has already sprung, I believe, in Europa) will be essays written to his infant daughter, and Summer take the hindmost.I like KO's personality, voice, and views on life, so I'm an Olympic team Russian judge, skewed in his favor. The wonder lies in writing about all of these seemingly insignificant things in unique ways. Also in watching him go off topic in the course of three lousy pages. Well done, Sir!"}, {"userName": "Nancy", "userReviewDate": "Oct 10, 2017", "userURL": "http://www.goodreads.com/user/show/28397995-nancy", "userReview": "Winter by the Norwegian author Karl Ove Knausgaard is the second in his series of essays and letters written to his unborn daughter. Knausgaard is well known for his six volume biography My Struggle. His writing breaks all 'rules' about writing, and is spontaneous, unstudied, often confessional, and sometimes mundane. In almost daily meditations over December, January, and February, the author wrote about whatever was on his mind. Owls, Christmas, people he knows, the mythical legend Loki, and even toothbrushes. In the first letter, he warns his daughter that we expect life to be full of joy and light, but instead we encounter pain and suffering and loss. At times he shares an insight that sparks a new way of looking at things, such as the thought that society is based on a belief in the fiction that a coin has intrinsic value, but if our belief vanishes, so does a coin's value. He tries to describe inanimate things, but I note that his descriptions include concepts that are not concrete, which seems to defeat his intention. Some essays just left wondering what the point was.I have been reading several essays each night before bed. I will finish the book, just to plumb it for those unexpected gems.I won this book on a Goodreads giveaway."}, {"userName": "Stephen Durrant", "userReviewDate": "Jan 30, 2018", "userURL": "http://www.goodreads.com/user/show/1457001-stephen-durrant", "userReview": "Karl Ove Knausgaard’s talent is to hold the reader’s attention even as he writes about the small, mundane aspects of life in great detail. As I read his “My Struggle” volumes, I kept asking myself why they were for me so intoxicating. While it is not entirely satisfying, the only answer I could find was that he has an ability to defamiliarize, to portray even the most common event or thing in a new light. Knausgaard’s “Winter,” part of his new seasons “quartet,” underlines this talent. In short two- or three-page essays, he explores the common in clever, sometimes even jaw-dropping ways. Whether he’s writing about the nose, snowdrifts, guests, the otter, atoms, or any of the fifty or so other topics he tackles in these essays, he holds our attention and surprises us with his poignant and sometimes rather humorous insights. This is genius."}, {"userName": "Miguel Duarte", "userReviewDate": "Aug 30, 2017", "userURL": "http://www.goodreads.com/user/show/5124972-miguel-duarte", "userReview": "http://www.comunidadeculturaearte.com...Karl Ove Knausgård alcançou fama mundial quando se dispôs a narrar a sua vida, com um registo híbrido entre memória e ficção, num conjunto de livros ao qual deu o nome de A Minha Luta. Com uma totalidade de seis volumes e cerca de três mil páginas – quatro dos volumes estão já publicados em português, pela Relógio d’Água – este projecto chocou o mundo, ou parte dele, pelo menos, pela forma como o norueguês não poupou qualquer detalhe nem ninguém aos seus retratos do quotidiano. Praticamente todos os seus familiares são englobados nessa obra de larga escala, e quase nenhum sai de lá com uma imagem propriamente positiva, como também não sai, aliás, o próprio autor. Mas, se a atenção recaiu sobre ele em parte motivada por esses factores mais escandalosos, o mérito reconhecido foi o da forma meticulosa como o autor descreve episódios do seu quotidiano e da sua vida, uma exploração descritiva ao máximo.Após esse projecto, o escritor norueguês decidiu ser ainda mais ambicioso e, ao invés de tentar abarcar em diversos volumes toda a sua vida, pôs mãos à obra para, em quatro diferentes livros (cada um referente a uma estação do ano), fazer como que uma enciclopédia, onde, por entre cartas à sua filha em gestação na barriga da sua mulher, descreve todo o tipo de coisas, desde objectos a estados de espírito, desde pessoas a personagens mitológicas. Em textos que são um híbrido entre descrição informativa e profundas reflexões filosóficas motivadas pela coisa que dá título ao texto, o mais interessante é a forma como o autor, com grande mestria, é capaz de, partindo de um ponto, chegar, no final do texto de duas ou três páginas, a algo que, inicialmente, nos poderia parecer completamente distante ou não relacionado.No Inverno é o segundo volume deste projecto publicado em Portugal (o primeiro, No Outono, publicado no final do ano passado), pela Relógio d’Água. Como seria de esperar pela estação do ano que lhe dá nome, as entradas desta enciclopédia são agora mais relacionadas com factos particularmente invernais. ‘Neve’, ‘Frio’, ‘Prendas de Natal’, ‘Fogo de Artifício’, ‘Botas’; estas são algumas das coisas sobre as quais os textos incidem. Longe de ser um livro só ligado a motivos invernais, a época sazonal não invalida a existência de textos completamente independentes dela, como serão por exemplo os casos dos sobre ‘Procissão funerária’, ‘O desejo sexual’, ‘Cotonetes’, ‘Tampas de Esgoto’ e ‘Canos’.Neste último, Knausgård monta toda uma linha de pensamento que nos leva desde os banais canos, que nos trazem a água, até toda uma tese acerca de redes de alimentação (das quais fazem parte, além da da água, também a da eletricidade, por exemplo), que não são mais que prolongamentos do nosso ser que expõem a nossa dependência, “porque o que é o cano que termina na torneira senão um prolongamento da garganta, o cano que sai da retrete senão um prolongamento do intestino grosso e da uretra, o cabo que transporta as imagens para a televisão senão um prolongamento dos olhos, e o cabo que transporta a informação para o computador um prolongamento do cérebro?”Também esta enciclopédia sazonal é um prolongamento de A Minha Luta, acima de tudo na obsessão com o quotidiano e corriqueiro. Tal como no seu magnum opus, o foco está em mostrar que a nossa vida como humanos é, acima de tudo, só isto, mas que só isto, que parece ser tão banal, é afinal capaz de proporcionar momentos de elevada reflexão e, acima de tudo, de uma beleza efémera, como a das alterações sazonais que se repetem umas às horas, em balanços tão quotidianos como os que nos regem a nós."}, {"userName": "Didde Elnif", "userReviewDate": "Nov 22, 2015", "userURL": "http://www.goodreads.com/user/show/3077425-didde-elnif", "userReview": "Jeg valgte at høre Om Vinteren som lydbog på norsk, og det kan kun anbefales. Den er letforståelig, og det tilføjer en poesi og tone, der højner bogens indhold. Formen er den samme som Om Høsten (se beskrivelsen nedenfor), men jeg blev bekræftet i, at det er de personlige prosastykker (dem, der minder mest om Min Kamp), der taler mest til mig. Om Høsten består af encyklopædiske prosastykker. Og hvis man ikke forventer andet, så er den en fornøjelse at læse. Hvorimod, hvis man forventer Min Kamp 7, så bliver man frustreret. Jeg nød de små breve til den ufødte datter, fordi jeg holder af Min Kamp og få glimt af en fortsættelse er en fornøjelse, men det er umiddelbart et forkert udgangspunkt, for brevene er kun få side af selve bogen. Resten forsøger Knausgård at forklare den ufødte datter, hvilken verden hun bliver født ind i, ved at beskrive stort og småt fra æbler til tis osv. Når jeg giver bogen firestjerner, så er det fordi, han skriver fremragende, de små reportage iagttagelser er en fornøjelse. Detaljerige og rammende. I flere anmeldelser har han fået kritik for at holde \"lidt for meget af hverdagen\" - jeg forstår kritikken - og der er da også tendens til lal, men igen, så længe han er så velskrivende, så læser jeg hver enkelt beskrivelse som små fornøjelige prosastykker og glædes ved dét."}, {"userName": "Nikki Spoelstra", "userReviewDate": "Aug 07, 2017", "userURL": "http://www.goodreads.com/user/show/43094552-nikki-spoelstra", "userReview": "Oh, wat geniet ik van deze seizoenenreeks. Op naar het derde deel: 'Lente'."}, {"userName": "Michael Bohli", "userReviewDate": "Jan 05, 2018", "userURL": "http://www.goodreads.com/user/show/39066605-michael-bohli", "userReview": "Onkel Knausgård gelangt bei seiner Welterklärung im kalten Winter an – und scheint durch die Geburt seiner jüngsten Tochter etwas den Fokus zu verlieren. \"Im Winter\" ist zwar weiterhin eine berührende Sammlung von kurzen Texten, die grosse und kleine Dinge in unserem Leben fassbar machen und beschreiben, irgendwie wollte der Funken dieses Mal aber nicht so richtig rüberspringen. Gewisse Momente wirkten etwas belanglos, andere waren Wiederholungen für mich als Leser seiner autobiographischen Reihe.Sein Stil und immer wieder melancholische Art zu Erzählen bleiben aber faszinierend. Ebenso gelungen fand ich in diesem Band die Bilder von Lars Lerin. Er fängt die winterliche Stimmung sehr gut ein."}, {"userName": "Evi", "userReviewDate": "Mar 05, 2017", "userURL": "http://www.goodreads.com/user/show/46743776-evi", "userReview": "Terwijl ik de 'mijn strijd'-reeks niet vervolledigde trekt deze seizoensreeks me wel aan. Knausgard (waar is dat a-tje met dat bolletje als je het nodig hebt) heeft een onovertreffelijk observatievermogen als het om dingen in ons dagelijks leven gaat die we als zo vanzelfsprekend zijn gaan zien dat ze niets apart meer vormen.Zo schrijft hij in dit boek opnieuw over natuurelementen, chemische processen en het heelal, maar evengoed over menselijke aspecten, lichaamsdelen, dinosaurussen van zielen die in fijnmotorische lijven zitten die met Chinees porselein omkunnen.Ook zijn scherpe blik op wat we precies doen en het waarom daarvan vond ik wonderschoon in 'Winter'. Zo schrijft hij dat 'we met geld een hele samenleving bij elkaar fantaseren' en 'veel menselijke activiteit neerkomt op het scheppen van holle ruimtes'. Hij analyseert de ramen in een huis, en alleen daar. Hij betrekt Noorse Mythologie en volksvertellingen. Met veel respect voor mens, natuur en geschiedenis laat hij zijn woeste kop los op de wereld. Eén aanrader: lees bij aanvang van de winter... Nu de eerste lentesprietjes er door beginnen te komen is het verwarrend opnieuw de Kerstman te zien komen. Opnieuw een pareltje, voor volwassenen me dunkt."}, {"userName": "Amu", "userReviewDate": "Dec 31, 2016", "userURL": "http://www.goodreads.com/user/show/11463953-amu", "userReview": "Tämä oli vielä parempi kuin edellinen osa, Syksy, joka sekin oli loistava. Teos on monipuolisuudessaan aarreaitta: on hauskoja, vakavia, henkilökohtaisia, yleisiä ja monen muun laisia kirjoituksia. Sitä voi lukea hitaasti, tekstin kerrallaan aina kun ehtii tai sitten kerralla antautuen täysin Knausgårdin ajatusten maailmaan. Tähän kirjaan palaan vielä monta kertaa."}, {"userName": "Bruno", "userReviewDate": "Feb 04, 2018", "userURL": "http://www.goodreads.com/user/show/30210742-bruno", "userReview": "I definitely enjoyed this more than Autumn, even though the words chosen for this installment are less original and inspiring than the ones in the first volume. The ones in which we have a peak at Knausgård as a father are the most accomplished, such as Father Christmas, where he and a friend dress up as Santa Claus to surprise their respective children, Nikolai Astrup, where he and his family visit his mother in north-west Norway, Setting Limits, where he reflects on the necessity for parents to set limits for their children and Operation, in which his daughter goes through surgery. And obviously, this being Knausgård, a few of his musings have to involve childhood memories, like Toothbrushes, where he hilariously justifies his poor dental hygiene or like Winter Boots, about a pair of boots, inherited from his brother, that he would use to slide down the snow-covered slopes of his hometown along with his friends. Some of these are also clever and bizarre, like Brains, and quite funny, like Q-tips, where he describes his fascination with cotton buds. At times I get an expectant feeling, a sense that something good is about to happen without remembering exactly what, until it suddenly comes back to me on a wave of disappointment: the good thing I was looking forward to was just cleaning the earwax out of my ear. I can't wait to see what he will do with Spring."}, {"userName": "Pečivo", "userReviewDate": "Dec 20, 2017", "userURL": "http://www.goodreads.com/user/show/22461968-pe-ivo", "userReview": "Když Karl Ove naservíroval 6x svíčkovou, tak teď nemůže přijít s knedlíkama s vajíčkem. Bohužel ale přesně o to se tu snaží. Očividně po dopsání Jeho boje zjistil, že nemůže jen tak přestat psát a tak pokračuje s další kvadrologií pojmenováné podle ročních období, kterou věnuje své nenarozené dceři. Počet stránek je však výrazně nižší.Pořád je to Knausgård, ale už to občas trochu přehání, tak například celou jednu kapitolu kouká na skříň a přemejšlí z čeho se skládá. Po přečtení všech dílů předešlý ságy ho už znám jak Paliho a tak mě samozřejmě zajímá jak se mu daří a co ho trápí. Zajímalo by mne jak bych se k dílu stavěl jako nezúčastněnej čtenář. Mne by vlastně zajímalo spoustu věcí - vyhraje někdy Bohemka ligu? Prcal někdy Ovčáček Zemanovi dceru? A manželku? Je v tanku vedro? Co dělá Benjamin Slavík? Celkem 6/10. A taky jsem načal čtení druhým dilem a to se nedělá. Literatura není jako randění, kdy je dobrý začít na prvním rande druhou metou a hned si šahnout na pepíci."}, {"userName": "M. Sarki", "userReviewDate": "Mar 28, 2018", "userURL": "http://www.goodreads.com/user/show/5562041-m-sarki", "userReview": "https://msarki.tumblr.com/post/172350...…We are at each other’s mercy…As much as I respect Knausgård as a writer, there is something in this series that does not connect with me. The confessional tone, the bleeding of his personality all over the page that initially endeared me to him in My Struggle seems missing from these texts. Occasionally he does connect with me, but not in the incessant way he has previously. I suppose it is in his telling instead of showing his story. All this hardening and misery, all this suffering and loss of meaning is also part of life, and it exists everywhere, but it isn’t as easy to see, not just because it originates within but also because most people try to hide it, and because it is so painful to admit: life was supposed to be full of light, life was supposed to be easy, life was supposed to be laughing children running along a beach by the water’s edge, who stand smiling into a camera on the first day of school, brimming with expectation and excitement. Finally, near the end, Knausgård confesses something in his old style, exposing a most personal inadequacy about his sexual life. What he reveals was rather shocking as most males would never admit to anything remotely as honest and embarrassing as this confession felt to me. Hat’s off to Knausgård, and not for what he said, but how he said it. …Ever since I was a child I have regarded the feminine as something exalted and unattainable, both admiring and desiring the world of women, which was so filled with beauty, from the clothes found in it, with all their details and refinements, to the ambivalent smiles, sometimes warm and teasing, sometimes cold and dismissive, from the thin wrists to the rounded, soft shapes, the curve of the hips and the swell of the breasts, to the neat, refined movements…On the rare occasions when it actually did lead to something, my desire after years of intense fantasizing was so great that I came almost instantly, so I never got to where I wanted to be, where I could wallow in breasts and thighs, buttocks and wet clefts…I fear women, and what I fear is that I will be found lacking, that I won’t be good enough…Karl Ove Knausgård is a fine thinker and writer. But Winter, the second in this continuing series, unfortunately is not his best work. Nonetheless, I am glad I read it."}, {"userName": "Fabienne", "userReviewDate": "Feb 26, 2017", "userURL": "http://www.goodreads.com/user/show/15917431-fabienne", "userReview": "\"Mijn gevoelens schieten alle kanten op, slaan tegen de muren van mijn innerlijk. Dat gebeurt alleen als de balans tussen mij en andere mensen is verstoord. Als iemand iets wil en ik nee zeg. Of als mensen nee zeggen en ik toch mijn zin doordrijf. Ik probeer het allebei te vermijden, zowel het nee zeggen als mijn zin doordrijven. Dat is zwakte, zo gevoelig zijn voor andermans wil dat je die niet durft te trotseren.\" (p. 157) Voor mij heel herkenbaar."}, {"userName": "Marita", "userReviewDate": "Mar 28, 2017", "userURL": "http://www.goodreads.com/user/show/32709742-marita", "userReview": "Njææh. Altså for all del, men næh."}, {"userName": "Melissa", "userReviewDate": "Apr 08, 2018", "userURL": "http://www.goodreads.com/user/show/46917787-melissa", "userReview": "goed, niet alle verhalen vond ik goed maar deze serie is zo fijn tot nu toe. knausgards beschrijvingen van mensen zijn mijn allerlievelings. extra hartjes voor de mooie illustraties. wil deze de rest van het jaar herlezen zodat ik altijd een beetje winter bij me heb."}, {"userName": "Platon P", "userReviewDate": "Jan 24, 2018", "userURL": "http://www.goodreads.com/user/show/17695509-platon-p", "userReview": "Karl Ove Knausgaard’s second volume of his Seasonal Quartet, Winter, follows on the same threads as Autumn, with three more letters to his unborn daughter (the last one written in the hospital just after her birth) framing a series of short observational pieces about his surroundings. Where Autumn was a book about change, in nature as well as society, Winter digs into the feeling of collective hibernation that swallows up the northern hemisphere; a period of stasis and preparation.“Autumn is a transition, a time of emptying – of the light in the sky, the warmth in the air, the leaves on the trees and plants. The winter that follows is a state in which immobility reigns. The earth stiffens, water freezes to ice, snow covers the ground.”— KARL OVE KNAUSGAARD, WINTER (P. 129)From: https://www.pendoramagazine.com/book-...In many respects, the books are very similar, and appeal to the same kind of reader. What is remarkable in both of them is the way the range of topics is often unexpected. For the month of February, Knausgaard writes about Roosters, Fish, Buses, Winter Boots, Conversation, Habits, Bonfires, and the Feeling of Life, among other things. Some of these topics , when spotted on a list, might give the impression of fertile topics to write about, but the usual suspects receive a two-page treatment, while seemingly dull topics can be mused on for twice that length, or more. For example, Rooster receives a more detailed treatment: Knausgaard starts with the now-familiar physical description and goes on to talk about the underworld in Norse mythology and Norwegian epic poems.One of my favourite pieces is about toothbrushes, and illustrates the flow of the book. The toothbrush analysis gets double the exploration than, say, Fireworks, but that is precisely because toothbrushes relate to the everyday in such a direct way that it opens the door for a closer look. This is where Knausgaard excels: the quotidian. Both Autumn and Winter take cues from objects whose use is so ingrained in our experience, since our early childhood memories, that they completely fade into the background of our lives. The reason why these passages are longer in Winter is because Knausgaard’s art is to draw out elements from this background, bring them to the light, put them under the microscope and make sense of them; to paint this part of life lived otherwise unremarkably.“The family’s toothbrushes are in a cup in the bathroom bristles up, looking a little like flowers in a vase, with their handles like stems and their brushes a kind of corolla.”— KARL OVE KNAUSGAARD, WINTER (P. 145)The piece describes the cup of toothbrushes in his family’s bathroom, how his children will grab and use any toothbrush without a sense of ownership over them, how when he was a child using someone else’s toothbrush was unthinkable and a clear sign of lack of hygeine, and ends up (somewhat unsurprisingly, one might say) talking about his father. The first time he lied to his father he was ten years old and his lie involved brushing his teeth when in fact he hadn’t. This small detail from his memory is large in its significance, as he writes that it lead to a revelation: he could lie about certain things and never be found out, therefore not brushing his teeth became a symbol of rebellious freedom.This introspective progression from an object to something deeply rooted in his memory, usually from his childhood, is perhaps the most recognisable and successful formula for the short pieces of prose that make up Winter, which at times seems to be an amplified version of Autumn."}, {"userName": "Jay Hinman", "userReviewDate": "Mar 16, 2018", "userURL": "http://www.goodreads.com/user/show/11273960-jay-hinman", "userReview": "This was my 7th Knausgaard book and despite the 4 stars, the first I didn’t unambiguously love. Certain of these short essays were masterpieces; others were pointless self-indulgences. Seems like the concept has dropped off just a tiny bit since “Autumn”. That said, I thought it was well worth reading and his introspection and careful consideration of minutia always gives me lots to ponder."}, {"userName": "Anne", "userReviewDate": "Nov 29, 2017", "userURL": "http://www.goodreads.com/user/show/7489423-anne", "userReview": "Auch der zweite Teil des Jahreszeitenzylkus hat mir wieder außerordentlich gut gefallen. Im Vergleich zu \"Im Herbst\" sogar ein Stückchen besser. Ich denke, dass liegt vor allem an den Dingen und Themen, welche Knausgard dieses Mal anspricht. Diese waren hier vielschichtiger und doch etwas interessanter meines Erachtens. Er schafft es auf alle Fälle immer wieder selbst banale Dinge so zu hinterlassen, dass man wenigstens, wenn man diese dann das nächste Mal sieht, über sie nachdenkt."}, {"userName": "Deb (Readerbuzz) Nance", "userReviewDate": "Nov 26, 2017", "userURL": "http://www.goodreads.com/user/show/1654645-deb-readerbuzz-nance", "userReview": "Knausgaard is a master essayist. He is, for one thing, a regular person. He is a smart person, yes, but not an academic, and he leads a regular life of having to fix things around the house and to take your kids to soccer practice. He is, however, able to look carefully at things and ideas and beliefs, very carefully, almost like taking a zoom lens to them, and flipping them, and looking at them upside down and backwards, and wildly speculating about things, until the reader marvels at the brilliant thoughts that Knausgaard has about perfectly ordinary things. People keep telling me, in admiring tones, “Oh, you read a Knausgaard book,” as if it were some dense tome of physics or calculus. I urge you to banish that thought. Knausgaard is completely novel, and completely fascinating, but he is also completely readable and applicable. I can’t think of anyone who couldn’t read this book and take pleasure in reading it and feel satisfaction in the ideas taken away from the essays."}, {"userName": "Melting Uncle", "userReviewDate": "Mar 07, 2018", "userURL": "http://www.goodreads.com/user/show/17444608-melting-uncle", "userReview": "I'm a fan of Karl Ove and will read anything of his that I can get my hands on but this was my least favorite of his books.Winter is more like a sketchbook... or like listening to recordings of your favorite band rehearse. there are some really beautiful unforgettable parts but for the most part it feels like there's nothing really \"at stake\" and Karl Ove is just playing it safe here. Not really any movement or development.My favorite parts are stuff that involves humans. Less excited to hear KOK's take on snowdrifts and the like. But maybe that's more your thing!"}, {"userName": "Zac Smith", "userReviewDate": "Apr 04, 2018", "userURL": "http://www.goodreads.com/user/show/63499687-zac-smith", "userReview": "Grooves well and feels very cohesive despite its granular nature. Overall, I liked it better than Autumn. The essays feel more thematic (Father Christmas, Guests, snow and ice, etc), and are definitely more varied---some are about specific people, others more or less memoirey vignettes, others more philosophical meandering.There is an overall pattern and theme of The Outside vs. The Inside---how people look vs. how they act, the role of windows (and coffins!), and, more abstractly, nostalgia as an internal thing vs. the present day as an external thing. There is also a theme of evolution, comparing people, animals, objects in terms of their form and function. There is also a little more whimsy, in that he lets himself speculate and imagine weird things (humans evolving like whales, or brains floating under the ocean).But where he shines most, I think, is when he talks about personal things (obvs). These are touching, interesting, well paced, and illuminating.I'm enthusiastic about the next book because I think he's hit on a good rhythm in this one."}, {"userName": "Kasa Cotugno", "userReviewDate": "Jan 11, 2018", "userURL": "http://www.goodreads.com/user/show/2345554-kasa-cotugno", "userReview": "Knausgard continues these essays through the winter months, interspersed with letters to his fourth daughter. He discovers fascination with such a wide range of subjects, from otters and owls to atoms. Included are studies of some friends/acquaintances, miniatures that create entire portraits, and also glimpses into the life of his rambunctious family. Several of these resonated more strongly with me, as how he addresses the subject of \"Hollow Spaces,\" observing that mankind spends a lot of time creating hollow spaces from rooms and arenas to jewel boxes, and another I particularly liked was his chapter on Guests. Pointing out the pitfalls of being a guest as well as hosting one. I also liked the chapter on how writers delegate their writing lives, since whenever I see an author in person, invariably there is a question during the Q&A that, to me annoyingly goes, \"What is your process?\" Looking forward to what he writes about during the spring and summer."}, {"userName": "Kirsty", "userReviewDate": "Feb 22, 2018", "userURL": "http://www.goodreads.com/user/show/56491386-kirsty", "userReview": "Winter is the second book in Norwegian author Karl Ove Knausgaard's seasonal quartet. The whole of the book is addressed to his unborn daughter. From the very beginning, it felt quite open and honest, and the writing is often thoughtful, and really quite lovely. I only read a third of the book before giving up on it, however; the structure, in which short essays had been placed willy-nilly into the whole, did not work for me, and it seemed to have little or no direction for the most part. Surely the essays here could have been better ordered? As it is, barely anything goes together; for instance, an essay written about the nose comes directly after a Christmas one, with no linking sentence to give this positioning worth. Not for me."}, {"userName": "Kent Winward", "userReviewDate": "Mar 11, 2018", "userURL": "http://www.goodreads.com/user/show/1054712-kent-winward", "userReview": "I'm a sucker for Knausgard's views of the world -- taking the mundane and daily and turning it into art. And breakout his definition for \"Coin\" during the next big stock market crash . . ."}], "description": "The second volume in his autobiographical quartet based on the seasons, \n\nWinter\n\n is an achingly beautiful collection of daily meditations and letters addressed directly to Knaugsaard's unborn daughter \n2 December - It is strange that you exist, but that you don't know anything about what the world looks like. It's strange that there is a first time to see the sky, a first time to see the sun, a first time to feel the air against one's skin. It's strange that there is a first time to see a face, a tree, a lamp, pajamas, a shoe. In my life it almost never happens anymore. But soon it will. In just a few months, I will see you for the first time. In Winter,  we rejoin the great Karl Ove Knausgaard as he waits for the birth of his daughter. In preparation for her arrival, he takes stock of the world, seeing it as if for the first time. In his inimitably sensitive style, he writes about the moon, water, messiness, owls, birthdays--to name just a handful of his subjects. These oh-so-familiar objects and ideas he fills with new meaning, taking nothing for granted or as given. New life is on the horizon, but the earth is also in hibernation, waiting for the warmer weather to return, and so a contradictory melancholy inflects his gaze. Startling, compassionate, and exquisitely beautiful, Knausgaard's writing is like nothing else. Somehow, he shows the world as it really is, at once mundane and sublime.", "title": "Winter\n      \n          (Årstidsencyklopedien #2)", "url": "https://www.goodreads.com/book/show/35628595.Winter", "average": 3.81, "cover": "https://images.gr-assets.com/books/1500725622l/35628595.jpg", "reviews": 122, "authors": [{"url": "https://www.goodreads.com/author/show/3020048.Karl_Ove_Knausg_rd", "name": "Karl Ove Knausgård"}], "type": ["Writing", "Nonfiction", "Autobiography"], "outlinks": ["http://www.goodreads.com/book/show/35628595-winter", "http://www.goodreads.com/book/show/36134956-winter", "http://www.goodreads.com/book/show/35957470-no-inverno", "http://www.goodreads.com/book/show/26516421-om-vinteren", "http://www.goodreads.com/book/show/32938447-winter", "http://www.goodreads.com/book/show/35533305-im-winter", "http://www.goodreads.com/book/show/32938241-talvi", "http://www.goodreads.com/book/show/34211796-winter", "http://www.goodreads.com/book/show/7147831-min-kamp-1", "http://www.goodreads.com/book/show/7429046-min-kamp-2", "http://www.goodreads.com/book/show/7457379-min-kamp-3", "http://www.goodreads.com/book/show/7844543-min-kamp-4", "http://www.goodreads.com/book/show/8479681-min-kamp-5"]}