{"ratings": 10, "userreviews": [{"userName": "Angie", "userReviewDate": "Jan 30, 2018", "userURL": "http://www.goodreads.com/user/show/7630100-angie", "userReview": "Bonnie Burnard wrote one of my favourite novels, The Good House. I found this copy of her first collection of short stories in a used bookstore. It was published in 1988. I loved this collection. There was not a weak story in the bunch. There is no magic or vampires or alternate universes, but just fantastic and true to life stories about women experiencing grief, marital breakups, and friendship. My favourite story is \"Joyride\", about a woman who is accosted by two jerks in a pickup truck who chase her on a lonely country road."}, {"userName": "Cdubbub", "userReviewDate": "Aug 11, 2017", "userURL": "http://www.goodreads.com/user/show/23562480-cdubbub", "userReview": "These are some of the richest short stories, I've ever read. Particularly \"Music Lessons\", \"The Replacement\", \"Moon Watcher\" and \"Sister\". She's able to create a complete world in just a few short pages."}], "description": "Just how much influence do women have? If they're the characters in Bonnie Burnard's short-story collection Women of Influence, the answer is - plenty!Her characters are often extraordinarily ordinary women dealing with ordinary lives. They exert a powerful influence on those around them - friends, family, lovers, teachers - as they try to sort out their own lives. Often they muddle along; sometimes they're very adept at coping but, usually and like most people, they're not quite in control of their own destiny. From the woman who ponders her husband's infidelity in \"Moon Watcher\" to the elderly wife contemplating death in \"Reflections\", Burnard's women of influence come alive with a wonderful intensity and a pervasive compassion.Burnard constantly and fearlessly tests the strength of her characters, often in compelling plots that deal with confrontation or loss. But also running throughout these exquisite and precise stories is a thread of subtle humour that never loses its profound and sensitive understanding of human nature.", "title": "Women Of Influence", "url": "http://www.goodreads.com/book/show/684741.Women_Of_Influence", "average": 4.1, "cover": "https://images.gr-assets.com/books/1263261991l/684741.jpg", "reviews": 2, "authors": [{"url": "https://www.goodreads.com/author/show/343103.Bonnie_Burnard", "name": "Bonnie Burnard"}], "type": ["Cultural", "Short Stories"], "outlinks": ["http://www.goodreads.com/book/show/684741.Women_Of_Influence", "http://www.goodreads.com/book/show/1148316.A_Good_House", "http://www.goodreads.com/book/show/6567893-suddenly", "http://www.goodreads.com/book/show/2745689-casino-and-other-stories", "http://www.goodreads.com/book/show/684744.The_Old_Dance", "http://www.goodreads.com/book/show/17899287-crush"]}