{"ratings": 152, "userreviews": [{"userName": "Fabian", "userReviewDate": "Mar 30, 2018", "userURL": "http://www.goodreads.com/user/show/1036893-fabian", "userReview": "The entire novel is like a dystopian panorama--literally like a painting that encompasses bloodlines and locations, all within a sturdy frame. The colors of blood, moonlight, books, candles... It's like a Spanish paining wherein everyone is mid-grimace (Velasquez?), everyone has personality & biography by proxy. But the colors--they will distract you. And who could not love a tale that does nothing but remain still until the last few pages where it sludges to an awesome outcome? Especially if it includes shrunken heads, vindictive queens, star ships, virile incompetents, gore galore?Thanks to St. Martin's Press for my advanced copy. #stmartinspress"}, {"userName": "Carrie", "userReviewDate": "Apr 01, 2018", "userURL": "http://www.goodreads.com/user/show/36817401-carrie", "userReview": "Wonderblood by Julia Whicker is a dystopian fantasy read set in the distant future where a disease has wiped out most of the population. Those left on Earth fight to survive as they await the return of the space shuttles at Cape Canaveral that will signal the cleansing of the planet.I have to say this is one of those books I start out reading and then think what the heck have I gotten myself into?? Total weirdness from page one is what I got… The book starts with the talk of how everyone seems to like to behead people and what they do with those heads. But the sad thing to say I don’t blink at this but I get to where Aurora thinks she’ll survive eating the seagulls and then I get disgusted and think not the seagulls!!So anyway now we know how I ended up with the weirdness to begin with. The story starts off pretty slowly as we wade through the decapitated victims and meet Aurora what has been with her brother’s carnival. Another carnival shows up to take the land and next we know Aurora is captured by Mr. Capulatio who is a total creeper and of course thinks he’ll be ruling the world with Aurora as his queen.As the story went on I started thinking I wonder if the author is from a legalized marijuana state maybe got the idea from The Walking Dead where the survivors now are constantly at battle as if getting 90%+ of the world wiped out isn’t enough. The characters in here all sort of have Negan’s kill first ask questions later attitude with the idea of spilling blood to save the world.Then we get to learning how everyone worships at Cape Canaveral and I actually found this a really creative idea. I imagine that over the course of 500 years the idea that we once went into space before the world became ill and the disease hit would be just what some nutty person needed to create the blood obsessed world it had become.By the time I got to the end of this one though I was back to scratching my head. The potential of the idea to me really didn’t get played out as well as I hoped that it would and after wading through all the craziness and mayhem I felt a tad disappointed with the end leaving me to rate this book at 2.5 stars.I received an advance copy from the publisher via NetGalley.For more reviews please visit https://carriesbookreviews.com/"}, {"userName": "Sh3lly ⚔ tired of damaged heroines ⚔", "userReviewDate": "Oct 11, 2017", "userURL": "http://www.goodreads.com/user/show/25393430-sh3lly-tired-of-damaged-heroines", "userReview": "This was a cool, quirky, post-apocalyptic story that will have triggers for some, but was entertaining and fulfilled my weird quota nicely.I loved how the religion was based off the shuttles and their return. Cape Canaveral was the great kingdom with the heirs to the throne descendants of astronauts. This book has a little bit of everything for fans of dystopian and post-apocalyptic books. Yes, there is a pedophile and his young child-bride (she is 14, I think?). But, there are no graphic scenes. Still, you can love to hate the fanatical David (the one true king) and his psycho \"first wife.\" lolMy only criticism is that the sections with the two members of court, the hierophant and chief astronomer could have been shortened. But, they were still entertaining and neurotically fun to read. I loved the weirdness. It's got just the right amount of disturbing for the type of book it is.Thank you Netgalley and publisher for providing a digital copy to read and review.Original post:I'm confused as to whether this is a new release or a re-release? It says not due out until spring of 2018, but I'm also seeing \"originally released in 2016.\" Anyhow, I started it and got to 20% and it's pretty darn good! It's a cray cray post-apocalyptic story. Right up my alley. Think The Book of the Unnamed Midwife a little bit.There are abuse triggers, FYI. Child abuse too, although nothing explicit so far. This is grittier than the cover would have you expect, in my view. But, I'm liking it so far! On Netgalley."}, {"userName": "Mogsy (MMOGC)", "userReviewDate": "Apr 01, 2018", "userURL": "http://www.goodreads.com/user/show/4379514-mogsy-mmogc", "userReview": "2 of 5 stars at The BiblioSanctum https://bibliosanctum.com/2018/04/05/...It pains me greatly to admit I couldn’t get into Wonderblood, the latest entry into the flourishing genre of literary dystopian fiction. Debut author Julia Whicker writes beautifully, with her haunting—and haunted—world and characters enticing readers into a realm filled with harsh wonders and mysteries, where one can easily become lost in the cracks and crevices of time and place. Ultimately though, it came down to a matter of taste; I found the book too unsettling and strange, and coupled with the slow and dense plot, I had a very difficult time connecting with any of the characters or their motivations.The story takes place in a post-apocalyptic future where much of the United States has become vast swaths of barren wasteland. In Cape Canaveral, Florida, a king and his circle of royal elites preside over the faithful who live among the crumbling ruins of NASA’s facilities and defunct shuttles. There, they await the return of their ancestors in “the Rockets”, an event prophesied to be their salvation. Meanwhile, across the south, the roving tribal bands called carnivals continue to do their bloody work based on the doctrine of Wonderblood, which directs its followers to carry out killings and beheadings—lots and lots of beheadings—in order to cleanse the land of its disease.In one of these carnivals, a girl known only as Aurora is captured by Mr. Capulatio, the leader of a rival carnival who foresaw her role in his campaign to overthrow the king. Believing her to be pivotal to his rise to the throne, Mr. Capulatio keeps Aurora alive and makes her his new bride despite the anger and protestations from his first wife, the prophetess Orchid. Their sacred texts say that the Rockets will only return once the True King reigns at Cape Canaveral, so when two bright spots suddenly appear in the sky, Mr. Capulatio and his legions see it as a sign to start laying siege to the city. The royals on the other hand are mystified and unnerved by the outlaw carnival amassing outside their gates, the king sending his head hierophant and astrologers scrambling to interpret the appearance of the stella novae. No one knows for sure whether they are the long-awaited shuttles carrying their forebears, but most are convinced they are a harbinger for violent changes to come.First, what I liked: Whicker’s prose is intensely rich and evocative, painting a stunning yet stark view of the dystopian future which serves as the backdrop to her grim tale. A strong sense pervades the reader that civilization has become a ruin for so long that the world’s real history has become virtually inseparable from myth. Some of these accounts include blood and viscera raining from the heavens and poisoning the land, resulting a deadly mad-cow like disease known as “Bent Head” which killed millions and mutated animals into monstrous creatures. The people’s understanding of science and religion has also been distorted and in some cases these concepts have been corrupted and combined, giving rise to certain bizarre social or cultural practices, like keeping shrunken heads as charms and worshipping space shuttles.However, in spite of these fascinating elements, there were still a lot of holes in the world-building. Many of them are due to the limited perspectives of our characters, many of whom have insular outlooks and are operating within their own spheres of influence, presenting few opportunities to really expand and explore the world. Their voices also feel very aloof and detached, like Aurora, who doesn’t seem to possess any kind of drive or agency to affect her situation beyond the capacity of the space she’s thrust into. While a rough life of sexual assault and abuse at her own brother’s hands may have led to this acquiescent personality, it also meant that Aurora remained rather static and undeveloped throughout the story. Things didn’t go much better with the other characters either, and some of chapters taking place within the king’s court were a downright struggle to read because I didn’t feel like they did much to advance the plot or characters. The pacing would slow to a crawl in these sections so that it seemed like even after we hit the three-quarters mark, barely anything has happened at all.Others might also find the book’s topics and themes disturbing. There’s no glossing over this dystopian nightmare, where the credo is kill or be killed. Rival carnivals fight for territory amidst this chaos and lawlessness reminiscent of a Mad Max-type world, and the winners are driven by religious zeal to capture and behead as many of their enemies as they can because of Wonderblood. The character Aurora also experiences rape and abuse, first from her older brother and then from Capulatio, who manipulates her by keeping her imprisoned and unaware of her fate. It’s a cruel and merciless world, so if you’re uncomfortable with the idea then it might be wise to stay away.In sum, Wonderblood offers a uniquely imagined dystopian future replete with violent and dark themes. Julia Whicker can write well, as evidenced by her gorgeous prose, but unfortunately, the plot’s slow pacing and the lack of development and depth to the characters ultimately made this one an unsatisfying read. The lack of closure was also disappointing, with the open-ended nature of the conclusion making me suspect that a sequel will be forthcoming, though at this point I’m not sure I’ll continue because I’m just not feeling the story or the characters."}, {"userName": "Brooke — brooklynnnnereads", "userReviewDate": "May 05, 2018", "userURL": "http://www.goodreads.com/user/show/47221787-brooke-brooklynnnnereads", "userReview": "This was one weird and unusual read that I didn't see coming. Prior to reading, I thought this book may have been one part dystopian and one part space odyssey. Man, was I wrong on that account. First, before I get into my thoughts I have to say that although I'm giving it a 3 star rating, it's a 2.5 star to me. The struggle was real on deciding whether to round up or down, but I have come to the conclusion that visually it's a 3 star but in reality, it's 2.5 stars. Okay, moving on. Again, I have to emphasize that this was a weird, unusual, and odd novel. It starts off with the first chapter involving beheading people and using the head as an almost trophy of protection. Weird? Yes. It continued to be that weird throughout. Part of me is envisioning, \"The Walking Dead\" except these people....weren't dead. One of the main things that I had a hard part with for this novel is the alternating points of view between characters. Alternating points of view is hard to get right for any novel and unfortunately, this book did not seem to get it right. I felt that we barely grazed the surface of each character in both their histories and actually getting to know them. Also, what can happen with a lot of multiple point of view novels is that I become interested in one character's story and the rest I am disinterested. That also happened within this novel with me becoming more interested in Aurora's story. Another issue that I had with this novel was the pacing. It really isn't that long of a novel but for some reason, it read really slow for me. I had a tough time getting through it. It could be because I felt myself losing interest repeatedly but overall, the novel was incredibly slow and was like trudging through sand to get through. Now, with all that being said, I do have to identify some things that I felt the novel had going for it. First, the illustrations were beautiful and were the perfect addition to the novel. Secondly, there were periods of time while I was reading that I was reminded of the writings of Brandon Sanderson. He's an incredibly popular author and I remember at moments having difficulty with some of his novels. So, maybe it's a personal issue. There is potential that many will enjoy this book even though I didn't particularly. I think it was a good debut and it was imaginative but I'm hoping for more for this writer in the future.***Thank you to Penguin Random House Canada for sending me a copy of this novel in exchange for an honest review***"}, {"userName": "Mel (Epic Reading)", "userReviewDate": "May 08, 2018", "userURL": "http://www.goodreads.com/user/show/7074816-mel-epic-reading", "userReview": "While the setting and dystopian features of Wonderblood may not sound different from the average dystopian book; it is certainly in the literary realm of Station Eleven and Cloud Atlas. The story takes place in the continental USA when a disease has ravished the country and not only killed many but contaminated the actual soil of the earth. The style and tone of Julia Whicker's writing is very literary. One of the religions uses historical space shuttle names as a part of their lore. Ironically there are no space excursions or futuristic elements to Wonderblood even though it is set in the future. It has a little magic, a little science, a little horror; but a lot of beautiful and thought bending prose. Writing StyleA huge portion of the experience reading Wonderblood is being immersed in the literary style that Whicker employs. You could just as easily have been reading a historical account. The setting is the future but it's a nomadic (no technology) world and so it feels different from the average sci-fi novel. The 'magic' in the book is rooted in scientific concepts but they are not explained or analyzed in the context of modern science. Finally, there is lots of blood but it's not described in a horrific way that feels like a horror story. Wonderblood is, at its core, a literary book. The mood of the writing is as much the story as the actual plot and characters themselves. The use of descriptors (woman, girl, man) instead of names, when we are experiencing the world from certain points of view, reinforces that there is a theme to the way the story is told. This tone and style affects how the story feels as you read it. It's more than just a story about people in tough times. Yes it's awful...but not like you thinkIt's very difficult to write a dystopian story without having a lot of blood and death. It's just the nature we expect from dystopian books. Whicker certainly doesn't shy away from the horrors of her futuristic societies (we follow two different religious/social groups); but she also doesn't emphasize them either. From certain points of view the blood is horrific, and from others it's just part of a ritual. In some instances carrying a rotting head around is terrifying and disgusting; but for others it's comforting and a way of life. Whicker has normalized some of the horror to a point where we start to understand why some of our characters don't comprehend that what they are doing is perhaps morally objectionable.ReligionI think using the names of space shuttles to form the basis for a religion is a cute nod towards the science fiction genre. It’s easy to get caught up in the intricacies of each group’s religious practices that define their morals, laws, personal interactions, rituals, etc. As with most religions there are important books or texts and being able to read and interpret them is of value. The core elements of most religions exists here and yet these two religions are far from our own. Whicker is, I believe, making a point about religion throughout the book. She uses elements from our true past and skews them into these new religious groups. The insinuation, of course, is that perhaps we don't interpret or understand the culture or context of the ideals we worship. A bit of a jab at religion in general; which is ironic given the importance of the two competing religions to the book. Characters & PlotIf you're looking for an in-depth character analysis or active intricate plot you've probably got the wrong book. The core of Wonderblood is the analysis of what drives and motives humans to be a certain way. There is no real plot except that a comet appears in the sky and our two religious groups react to this appearance. For me that was enough plot to set-up the reasons why things start to happen; but I could see how many may find this book to be too unsubstantial or lacking focus because there is no real purpose to the story other than to explore morals, faith and human nature. OverallI really enjoyed this book. Upon finishing it I instantly wanted to read it again. Wonderblood is a book that could easily be analyzed and studied in any classroom at any level. It’s the kind of book people will love to hate as its literary style may be a bit more challenging than your average read. Therefore you have to put some effort into reading Wonderblood as it is riddled subtle and symbolic events and thoughts. For me, the effort was worth it. I loved contemplating the intricacies. Had I read this book as a teen I could see it having a profound impact on me (assuming I read it all the way through). As it was, even as an adult, I loved how much it made me think. I will definitely be purchasing this book for my print library. I cannot wait to read it again and revisit the morals, concepts and ideals set-up in this dystopian future. Please note: I received an eARC of this book from the publisher via NetGalley. This is an honest and unbiased review."}, {"userName": "katwiththehat", "userReviewDate": "Oct 17, 2017", "userURL": "http://www.goodreads.com/user/show/54835325-katwiththehat", "userReview": "[ child rape (off-page but referred to repeatedly) and molestation by a sibling  (hide spoiler)]"}, {"userName": "Minx -The Genre Minx Book Reviews", "userReviewDate": "Oct 18, 2017", "userURL": "http://www.goodreads.com/user/show/40042696-minx--the-genre-minx-book-reviews", "userReview": "If there has ever been a story that has left me grappling with feelings of love and revulsion, it is Wonderblood. When I first read this synopsis, I was intrigued and revolted. Dystopian society where said society is in complete disarray, barren wastelands – well hello Mad Max style setting. The “captive bride” reference left me feeling that there would be rape and all sorts of other not nice scenarios. Then there was promise of politics, ugh, not the biggest fan of that element. But I thought, “hey at least there won’t be any love triangles, I hate those,” but guess what, there sort of was. There are a lot of mixed reviews on this book so I will try and be very clear about my loves and dislikes.The setting is five hundred years post “Bent Head” disease and society has fallen into warring factions. Although not everybody, but a huge majority of the people left are worshipers of everything NASA with a special focus on the space shuttles. This is no starry-eyed dystopian society with morally grey inhabitants. This is kill or be killed, seriously messed up factions who have descended into utter madness. No one is enlightened or civilized, this society is bottom of the barrel type individuals and is absolutely straight out of my newest nightmares. I loved it and hated it! Loved it because as messed up as it is I think that it is a valid scenario of a post-apocalyptic situation. Hated it because it scared me to consider it and nothing about this scenario gave me any sense of peace.There is no vigilante hero to get behind in Wonderblood. The main character that the story incorporates is Aurora but her point of view is not continuous. The story is told from alternating point of views and at the start of each chapter you have to take a minute to figure out whose story is being told because it is not clearly noted. That may be off-putting to some readers. The characters themselves do not really develop, they are pretty static in terms of growth, but that works for this story because it is not really about the characters. The story is really about the warring factions within a society and the pinnacle of their frenzied worship on a religion based on schematics and such from a defunct space program.What needed to be improved? There were no in-depth details about what exactly Bent Head disease was. I also wished for more information about the initial collapse of society. How did it start, who was affected first? How was it that intellectuals did not survive to be a faction in this society? There was no way highly educated individuals could ever function as low as the characters in this setting did, there is just no way, because this society was a very low functioning society that had very primitive brain thinking. There were also parts of the story that started to go somewhere and then were just dropped off. Might not matter to some but I noticed and was left wondering.Overall, I appreciated the uniqueness that is Wonderblood. The idea of a civilization that worships space, space shuttles, and NASA was very cool to me. Also, to be in a society where doctors, medicine, and surgical advances were seen as abhorrent was a complete mindblower! I would have liked to have explored that concept some more. Now comes the WARNING. If you can’t stomach decapitations, mutilations, and depravity, this is not a story for you. Rape is another subject that you would have to deal with. There is nothing graphically depicted, but it is pretty clear about what has taken place. There is also the fact that the main character is a child and is taken as bride by a much older man. The ending is abrupt, so there may be more to come in this world, and this is not a world that will appeal to everyone. I say if you are a fan of post-apocalyptic, dystopian fiction that you give this story a try. It is world set in a heighten state of unrest and has all the elements that would appeal to readers of that genre.This review is based on a complimentary book I received from NetGalley. It is an honest and voluntary review. The complimentary receipt of it in no way affected my review or rating.Find this review and more at The Genre Minx Book Reviews"}, {"userName": "imyril", "userReviewDate": "Mar 25, 2018", "userURL": "http://www.goodreads.com/user/show/48604373-imyril", "userReview": "DNF. Beautifully written but not rewarding. I’m struggling with the violence and the lack of empathy for any of the characters. I may try again when I’m less exhausted but I just don’t have it in me for the time being.I received a free review copy from the publisher in exchange for an honest review."}, {"userName": "Crazy4Books", "userReviewDate": "Feb 15, 2018", "userURL": "http://www.goodreads.com/user/show/16445884-crazy4books", "userReview": "Got this book in the mail unsolicited. The carnaval part intrigues me but the ratings dont seem very promising. I won the book Tess of the Road (Yess dragons) in a Goodreads giveaway but got this instead. I hope I still get it."}, {"userName": "Stacey", "userReviewDate": "Apr 19, 2018", "userURL": "http://www.goodreads.com/user/show/68476870-stacey", "userReview": "I reeeally liked Tygo (John too, of course - and Juniper) and would like there to be a sequel. Somethings I would have changed about the story, like Aurora's age, but overall it was a unique, dystopian novel. I did win this novel as a giveaway and would like to thank the author, Julia Whicker and Random House Canada."}, {"userName": "d", "userReviewDate": "Apr 06, 2018", "userURL": "http://www.goodreads.com/user/show/22020551-d", "userReview": "Wonderblood is one of the best books I've read in a very long time. It is sort of like Blood Meridian, The Road, and Candide had a baby with a tarot deck? It is unflinching and epic like Blood Meridian but without Cormac McCarthy's pretentiousness; it's bleak like The Road but lacking its single-minded simplicity. It has the heart and wonder behind the satire of Candide. And it's archetypal like those books, like tarot cards, but much weirder. The story is set 500 years (or maybe 1000? I've seen conflicting things) in the future in a dystopian world where a sickness called Bent Head has wiped out much of the population. The descendents of the survivors worship astronauts, travel the \"deathscapes\" in carnivals that behead people, and view medicine/surgery as witchcraft. The book follows a group of characters through a series of momentous events and tracks how their views of the world change. It's about the absurdity of the human condition, how little we understand at any given moment, and faith/doubt in the face of those things.I've seen other reviewers call this YA fiction, which it's not, even though one of the characters is a teenager. Dystopian fiction is a better label, but it's literature first, so don't expect it to be plot driven - this is a book about feelings and ideas. The writing is lush and evocative, and there is just enough mystery and coincidence in the world that it feels real - like a medieval funhouse-mirror version of our own world, but a mirror nonetheless.I'm really not qualified to make this statement, but I feel it, so I'll say it anyway: Julia Whicker must be one of the greatest writers of our generation, if not one of the greatest writers alive.\"The pain of it all—Wonderblood—made the unreal real and so sometimes magic didn’t seem so much like a lie after all, and that confused her.\""}, {"userName": "Anna", "userReviewDate": "Oct 27, 2017", "userURL": "http://www.goodreads.com/user/show/30082369-anna", "userReview": "Oh man, this was like going on a first date and ALMOST feeling a spark but not quite, haha. From the blurb, I was all in. Dystopian society? Check. Carnivals? Check. Rival queens? Oh yes please.However, sadly, the execution fell flat. The idea and the strong writing is there, but I think this book should have had a lot more editing. It felt long and aimless at certain points and I really had to push myself to finish the last 10% (and shouldn't that be the best part to want to read?) I was also sorely disappointed that so much of the book was about other characters aside from Aurora. I thought it was going to center with her and even have a first person POV, but instead there were a lot of other main characters that I did not connect with. John and Marvel felt like the exact same person to me, to be honest. I know they weren't but it was hard as a reader to sense any difference in their development, they both fell flat. I think this could have been alleviated by a first person perspective for different narratives, instead of the passive and seemingly removed third person perspective that the book has. I had even MORE disappointment that there was not more world-building. We never get an explanation of what exactly Bent Head is as a disease and why the setting is post-apocalyptic. What exactly happened, other than a disease? Why did all these carnival factions rise up with this blood magic and Heads? I was also confused about Kansas versus the Cape and the differing power dynamics there... The overall world was pretty unclear to me. So what did I like? I liked Orchid as a strong and fierce female character. I liked the (small) portions with the Green Butterfly prophetess - I wish she had been integrated more. I liked the writing and Game of Thrones-esque beauty and brutality (don't read if you are sensitive to imagery of gore and violence). But I can't recommend this as-is, I really think it could have been a slam dunk with significantly more editing and investment in the characters and world-building. Sincere thank you to the author, the publisher, and Netgalley for an ARC."}, {"userName": "Brooke", "userReviewDate": "Apr 24, 2018", "userURL": "http://www.goodreads.com/user/show/16610521-brooke", "userReview": "Wonderblood takes place 500 years in the future, in a post-apocalyptic landscape ravaged by a disease called “Bent Head” and filled with carnivals, space shuttles, bloodletting, magic and more. It was very different from what I normally read, and while I enjoyed it, there was also room for improvement. The writing was beautiful, but the story itself fell a bit flat. There was little to no character development, the majority of the characters were unlikable, and I kept confusing John and Marvel’s parts. Additionally, I kept waiting for two of the characters to meet, but that never happened. I think I was expecting something more… whether that was more action or more explanation. As a reader, I felt like I was thrust into this world without really understanding what the world was. I think flushing that out a bit more would have been helpful. I also thought the ending could have been a bit more conclusive, but it seems as though Whicker has set the stage for a sequel.Overall, I think Wonderblood had a unique and interesting premise. While there were flaws, it was a fairly quick read, and I think fans of dystopian novels will enjoy it. Thank you to Netgalley and the publisher for providing me with a copy of Wonderblood in exchange for an honest review."}, {"userName": "Jolie", "userReviewDate": "Jan 31, 2018", "userURL": "http://www.goodreads.com/user/show/5122879-jolie", "userReview": "I am a huge fan of post-apocalyptic books. I enjoy reading about how a civilization would adjust if something awful happened. So, when I saw Wonderblood, I was excited. I was excited because the author had this civilization worshipping NASA and the space shuttles. It was something different from the usual post-apocalyptic stories. Then I started reading the book and became disappointed. I actually struggled to finish reading it. Which is something that I rarely do.If the author had stuck with only the girl’s storyline, I would have liked this book more. But the constant switching between characters became confusing after a while. There were several times where I would start a chapter, get a few paragraphs in and have to reread because I thought it was another character. That alone made me want to DNF it. I can’t stand it when chapters aren’t labeled when the author switches characters POV. Makes it very difficult to keep the rhythm of the story going if I have to keep going back in a chapter to reread it.I felt that there were several unresolved storylines. Such as the plotline with the Pardoness. She asked Marvel to get a surgeon to cut off her legs, which were deformed. Marvel (the Hierophant) went through all the trouble tracking Tygo (the prisoner) down and taking him from John (the Chief Orbital Doctor). Then nothing ever happened. Instead, all 3 men did something else and she was never mentioned again. The other storylines were not as major but still annoying. I dislike it when I am reading a book and a storyline is dropped.I didn’t feel a connection to the characters at all. All the characters felt flat. They were not 3 dimensional at all. Not rounded out. Put it this way, when I read a book, I like to imagine the characters as flesh and blood people. I couldn’t even with these characters. They were more paper doll-like in my mind.The end of Wonderblood confused me. It was written as a cliffhanger but there is no mention of a 2nd book. All the storylines are left up in the air. There is no resolution of anything.Now, there were some parts of the book I liked. I thought the plotline was original. I liked that the author used NASA, the space shuttles and Cape Canaveral as major plot points. The fact that these people worshipped the shuttles and NASA fascinated me.What also fascinated me was that this civilization kept heads as charms. Yes, human heads. They were supposed to protect and guide them in that horrible world. The last thing that fascinated me, and I wished more time had been spent explaining it, was that medicine and surgery were forbidden. If you were found practicing, you were put to death.I would give Wonderblood an Adult rating. There are sexual situations and disturbing scenes of pedophilia. There are some very graphic scenes of violence.I would not reread this book. I also would not recommend to family and friends. While the plotline was good and had promise, I felt that the cons outweighed the pros.The cons are: flat characters, dropped storylines, unresolved storylines and an ending that is confusing.The pros: Interesting storyline"}, {"userName": "Lisa Cleveland", "userReviewDate": "Feb 21, 2018", "userURL": "http://www.goodreads.com/user/show/33359750-lisa-cleveland", "userReview": "What a huge heaping pile of horse shit I had to crawl through, just to reach the end of this dreadful story. First off heads. Head's everywhere! Axed off. Cut off. Sawed off. Staked. Bagged. Hanging from walls, tents, around waists. Ugh. I am completely skeeved out by beheadings. Still, I kept reading. Surely it can only get better? Hurrump! No character building. The characters are all complete idjits. Finally there was no ending. None. At no time did I ever get lost in this book. The Cape, the carnival and its people not once became real to me, but I did at least expect some resolution. I'll not recommend or read anything from this author."}, {"userName": "Chris Eells", "userReviewDate": "Jan 20, 2018", "userURL": "http://www.goodreads.com/user/show/28145690-chris-eells", "userReview": "I received Wonderblood in return for an honest review.Wonderblood took quite a while before I felt comfortable with it. The characters and settings seemed to be loosely described and I often mistook one character for another. The setting is a post-plague America, but, outside of geographic references, doesn't have any similarities to the America that exists today. The story could have been set in any country... heck, any planet. It actually might have made things a bit more believable to me if they had been. The only connection to present day America comes from a bloodthirsty religion that has sprung up that mixes belief in the Space Shuttles returning to Earth and ritual killing to keep the plague at bay. Not really a solid premise.Anyhow, after about 100 to 150 pages things settled down a bit and I was able to reliably identify our main characters. Having said that, they ended up proving entirely unremarkable and uninteresting. Throughout the novel, I desperately hoped that the ending would reveal some sudden twist that explained away so much that was left unanswered, but sadly I was wrong. Wonderblood appears to be the first book in a series and the ending in this one left all the questions unresolved.In fairness, Whicker's writing is not bad. It's her subject matter that doesn't work!"}, {"userName": "Rachel Stansel", "userReviewDate": "Nov 09, 2017", "userURL": "http://www.goodreads.com/user/show/11656316-rachel-stansel", "userReview": "I am a fan of dystopian novels, and this one looked intriguing. But I just couldn't do it. Mostly, it lacks any real character building. leaving me in this bleak world where I didn't feel a connection to any of the characters. The world is bleak. The human race is decimated by mad cow, but no one remembers that was the cause. Doctors are banned and Cape Canaveral is the center of a strange religion of sorts. They believe the 5 space shuttles and their astronauts will one day return to save them. The ground is poisoned and they are trying to purify it with blood, which is really just making it worse (though they don't know that). The novel could have been really interesting with this premise, but it failed to deliver. I stopped at 45% and even that was a struggle.Full disclosure - I received a copy of the book from Netgalley and the publisher in exchange for an honest review."}, {"userName": "megs_bookrack", "userReviewDate": "Nov 06, 2017", "userURL": "http://www.goodreads.com/user/show/48328025-megs-bookrack", "userReview": "I finished Wonderblood late last night and needed to sleep on it before I could formulate my thoughts into a coherent review. Firstly, this is a debut novel for Julia Whicker and although this book did not blow me away, I would certainly be interested in other books (unrelated to this one) that she may write in the future. I enjoyed her writing style a lot which was not just agreeable but at times absolutely lyrical. At the beginning of the book, literally the first 10 to 15-pages, there was some content that almost made me give it up. It did not grab me at all and in fact certain elements of it turned me off. It is an adult sci-fi novel that is set in a very gritty, very harsh post-apocalyptic wasteland. There are triggers for abuse, child rape, sibling incest and/or sibling molestation; I could see this causing a lot of people to turn away very quickly from this book. If you can get by that, it does get a lot better and I am glad that I stuck with it. The middle is where I feel the story is at its strongest, with political intrigue and an interesting \"religious\" system. The story does take place in a future United States, which has had its population decimated by a mad cow-like disease - this story picks up in the aftermath of that although we never learn too much about the chain of events prior to the current action. Quite generally, it reminded me of Mad Max meets The Road.One of my biggest disappointments for this book was the lack of character development. I came away just feeling blah about all of the characters - there were none that I related too or even felt that I knew enough about to care for in any way. If this were a start to a series (I am not sure if it is slated as a stand-alone or a series), I would not pick up the second book, really because I just do not care what happens to any of these characters. Additionally, I didn't feel like the atmosphere was strong enough to make up for the lack of character development. Mainly, I gave this three stars due to the writing style of the author and the unique ideas included in the world she was creating - for example, I loved that the characters worshiped NASA space shuttles and had Cape Canaveral as their holiest of sites - but the execution overall fell a little flat for me. *I was given a copy of this book from St. Martin's Press in exchange for an honest review and I certainly appreciate the opportunity to read it and comment on it. I am excited to hear what others think of this story!"}, {"userName": "Arys", "userReviewDate": "Apr 04, 2018", "userURL": "http://www.goodreads.com/user/show/39265890-arys", "userReview": "Wonderblood by Julia Whicker is a dystopian YA novel that blends a somewhat surreal storytelling aspect with a twisted, post apocalyptic world. The strange and magic are venerated and space shuttles and astronauts of old tales are revered. Aurora (so named later by Mr. Capulatio) was dumped by her mother to live with her brother in a roving carnival band where magic, paranoia, mysticism and strength rule. When her brother's band is demolished by Mr. Capulatio and Aurora is taken to be his prisoner, teenage bride, and queen to be, Aurora's life takes another turn. Will it be better or worse?I thought the idea was creative, the veneration of NASA, astronauts, and the space shuttles is interesting, though after 500 years which space shuttles have been destroyed seems to have been forgotten. The environment is brutal, bloody and bleak. It felt like the characters were mostly travelling around and experiencing things for the most part, rather than finding, exploring and developing, but as a whole this was an interesting world with remnants of the familiar.Overall, if you are looking for a story with a interesting future myth-political aspect and the grotesque normalized, then Wonderblood by Julia Whicker provides an intriguing journey.(I voluntarily reviewed an ARC of this book I received for free from the publisher via NetGalley in exchange for my open and honest review. This does not affect my opinion of the book or the content of my review.)"}, {"userName": "Lori Tiron-Pandit", "userReviewDate": "Apr 09, 2018", "userURL": "http://www.goodreads.com/user/show/11892869-lori-tiron-pandit", "userReview": "I thought Wonderblood was a beautifully-written and thought-provoking book. The fact that faith, how it shapes people and how we find ourselves in need to reinterpret it to keep believing, is central to this story makes it a big winner in my heart. \"He was afraid of his destiny, chokingly, overwhelmingly afraid, and suddenly it didn't matter whether he believed in magic or she did or if it was real or if her mother was right and they were all just fools walking in a pointless, bloody parade toward the end of time. Her eyes was open. She could run or not, she could love him or not, she could miss her brother or hate him forever. It was all going to hurt.\" The faith centered on bloodshed (the Wonderblood doctrine) resides in a miserable, comfortless world, populated by characters with names that sound like Tarot cards (The Executionatrix, The Hierophant, The Pardoness, so cool!) who struggle to accept their place inside of this universe. Those ones who can sustain their faith manage to do it based on what they believe to be direct revelations, and they are the only, few ones who seem to find purpose and a simulacrum of peace. And they keep believing, even when the old religion seems dead, because there is always a new faith making itself apparent not too far off. \"I said that faith is both reasonless and the reason for everything. Beware any certainty, High Priest. For not many things are certain, and the ones that are, certainly have no reason to be.\" I hold dear those books that let me find refuge in a world that is strange, complex and mysterious, but close enough to the known reality that it is easy to draw parallels to the day-to-day. This was one of those books and I happily recommend it, and not only to those who enjoy just sci-fi or dystopian fiction, because I think this book easily transgresses genre."}, {"userName": "Tena", "userReviewDate": "Oct 29, 2017", "userURL": "http://www.goodreads.com/user/show/37246326-tena", "userReview": "I won this ARC of \"Wonderblood\" by Julia Whicker in a GOODREADS giveaway. It was disturbing, even for a dystopic. This is definitely one I will be haunted to reread again later and to see how it effects me. I guess (sometimes) this is why I read this genre. My thanks to St. Martin's Press for the giveaway!"}, {"userName": "Marne Wilson", "userReviewDate": "Oct 13, 2017", "userURL": "http://www.goodreads.com/user/show/10054249-marne-wilson", "userReview": "This book masses together a long list of tropes from a variety of science fiction and fantasy classics, but the one I was most reminded of was  A Canticle for Leibowitz. As in that novel, humanity has descended into barbarism after a cataclysmic event that is no longer fully understood (in this case, the spread of a disease called Bent Head). Just as the monks put their faith in Saint Leibowitz, a nuclear technician whose writings and diagrams they can no longer interpret, the religion in this world is centered around the ruins of Cape Canaveral and a belief that astronauts have gone to space to seek a cure and will one day return with it. Both stories start out with hints of danger and adventure and then settle down into tales of political intrigue. I have very little interest in political intrigue, but people who watch Game of Thrones to see what Cersei is going to do next might be more satisfied with this part of the story.One thing that made this book different than  A Canticle for Leibowitz is that it was always easy for a modern reader to see through the ignorant beliefs of the monks and surmise at least most of what had happened in the past. The backstory here is much murkier. I don't think anybody really did go to space to seek a cure, but I'm not entirely sure. How did the disease spread so quickly? What caused some people to believe in the concept of Wonderblood, the cure that will come to the world through bloodshed and violence? How has a society plagued by virulently contagious disease and obsessed with the idea of human sacrifice managed to perpetuate itself for over a thousand years? I have no more answers to any of these questions than I did when I started reading. And let's not even talk about the ending, which seems to be setting us up for a sequel that I don't believe is actually coming.Still, I don't want to sound like I'm entirely disappointed by this book. Julia Whicker has done many things right here. Her writing is clear and engaging, carrying me along quickly enough through the long sections of palace intrigue. Although it engages many familiar tropes of speculative fiction, I never felt that I knew where the book was going, and it kept surprising me even up to the last few pages.If you like Game of Thrones, The Walking Dead, and The Road, and you also appreciate good writing, you should give this one a try. Perhaps you'll like it more than I did.(Note: I received an advance uncorrected proof of this book through a Goodreads giveaway.)"}, {"userName": "Lyssa", "userReviewDate": "Nov 24, 2017", "userURL": "http://www.goodreads.com/user/show/2360777-lyssa", "userReview": "Won a copy from GR Giveaway. Gave it three (four?) chapters, but just have no interest in the main character. Too much time is spent away from her and on other characters that feel like they're not necessary to the story. While a certain amount of bleakness is expected for dystopian stories, this one is just brimming with 'bleak' - too much for my reading taste. (less)"}, {"userName": "Mary", "userReviewDate": "Aug 22, 2017", "userURL": "http://www.goodreads.com/user/show/6979067-mary", "userReview": "I won this ARC in a goodreads giveaway! Thank you St Martin's PressInteresting premise (but ultimately a disappointing novel) of a dystopian world where religion is all, science has been suppressed (sounds topical) and everyone is waiting for the second (?) coming of astronauts that left earth for heaven a thousand years ago. Time is a bit sketchy here since recording facts are not a big concern so could be a thousand could be 100 years. There was a plague of some sort where masses of people died and part of the new religion is beheading lots of people and spreading their blood on the ground, the same blood that spreads the disease - remember no science only religion and belief (that will save you).Unfortunately, despite a great premise that would have been my type of story, this goes nowhere. It's told from multiple points of view but none of the characters have any type of motivation for their actions or thoughts. No character to contrast the crazy with rational behavior or thought. There is just no point to any of the actions nor any overall arc to the story. Which turns out to be a series, that I for certain will not be reading. This is an ARC so possibly the final version (due out April 2018) will be different but probably not, i"}, {"userName": "Kelly Knapp", "userReviewDate": "Dec 03, 2017", "userURL": "http://www.goodreads.com/user/show/6040971-kelly-knapp", "userReview": "Dystopian books are very difficult to write or as often to read, especially when it is about our world and our country. In Wonderblood, we have all the ingredients for a great story, a near ELE situation, a radical new religion, both of these creating a blood letting society. Somehow, they don't quite work to create a great book.Part of the problem may be that I can't see how the near ELE situation could break down the scientific world so completely or allow the world to regress to living in caravans. Second, I d0n't like the fact that the book had incest so early in the book, the marriage at 14 is not so bad, but it is combined with bigamy, and the violence against women is disturbing.The one entertaining issue was the breathless wait for the return of space shuttles, carrying the saved human race.I found the book slow, with passages that were overly descriptive. Characters did not feel real or were brutal for brutalities sake rather than religious. Too much for an earth based dystopia."}, {"userName": "kerrycat", "userReviewDate": "Jan 27, 2018", "userURL": "http://www.goodreads.com/user/show/17106786-kerrycat", "userReview": "RTBR review to come"}, {"userName": "Ariana", "userReviewDate": "Apr 12, 2018", "userURL": "http://www.goodreads.com/user/show/15575133-ariana", "userReview": "Disclaimer: I received this book as part of a Goodreads Giveaway.I wasn't looking forward to reading this book but the first chapter really had me interested. That didn't last, though, and I found myself being interested in enough to keep reading but not enough to make this a good story.While I did enjoy the first chapter, and thought it was promising, the way it was written made me feel like the writer was quite stupid. Honestly it was probably because of the way it was narrated from the moron of a main character which means that we got into the character's mind a bit too deeply because it really felt like I was reading a simple-minded narration in what could have been a rich story.There are far too many characters to keep track of in this book and they're not very distinct at all. Sometimes I even wondered whether some of the POV characters even had a point. They barely had backstories, barely had goals (if they had any at all), and barely anything happened. My biggest problem with this story is that it always felt like it was still starting. I don't know what the span of the novel was, but it felt like a few days. Barely anything advanced, barely anything happened, and it almost felt like something you'd read out of the bible in terms of all myth and no science but without any epic stories involved.The worst part of all was that the story didn't even end. This isn't even a series! This is a standalone novel and it didn't end. I don't mean it didn't end satisfactorily even if it didn't wrap everything up, I mean that it didn't end. It was abrupt and pointless and not even symbolic in any way.One thing that I found off was how vague the MC was about sex then all of a sudden when the main antagonist (I honestly don't even know what he is or even how old he is) wants to have sex with her she starts narrating information about his member pretty openly. The scene itself was, like most of the novel, pointless and nothing even came from it.I was also pretty confused about the world building and lore. So many things were confusing. Sometimes there was a story attached, sometimes those stories were lies, mostly they had no relevance or no sense to them. There was potential in this novel that this post-apocalyptic seemed to revolve around the shuttle landings (for reasons never explained) but it lacked the science that should have been present despite the destruction that seemed to have come from mad cow disease. I don't believe that the entire world would succumb to this weird superstitious belief system that involved abandoning all science, spilling blood and making voodoo heads, and worshipping something so different to the religions of nowadays. Don't even get me started on the delusions of the True King or whatever he was - we didn't even find out about his problems.A ridiculous event that happened that made no sense, especially since it felt like no time had passed at all, was the main character (Aurora?) all of a sudden gained some kind of confidence to pass a type of judgment on her rival queen when there was literally nothing to lead up to this. She didn't grow as a character, it just happened.The book is also filled with bad pictures, too. I can't help but feel like they were done by the author, and it makes me think that perhaps she planned this to be some epic kick ass story and just didn't have the skills to pull it off - and she didn't. I don't know why a publishing house would even let this through the doors. I suppose to appease lesser educated YA fans, but pandering and releasing poor content is never good for any society.I just can't stand that this became a book. It's definitely not the worst thing I've read, but it was poorly put together and definitely not a finished product. It was too confusing, didn't have the proper character development, world building and lore creation, or writing skill to be executed correctly. Combine that with the unfinished, poorly done drawings that made the main character and the story seem more epic than it really was and you have a product that never should have even made it into a publishing house, let alone out of it. I wouldn't recommend this book."}, {"userName": "Shawn Birss", "userReviewDate": "May 23, 2018", "userURL": "http://www.goodreads.com/user/show/43940435-shawn-birss", "userReview": "Julia Whicker's debut novel boldly aims very high with its many characters and broad world building. She bucks genre boundaries with a science fiction premise that sets the story in a post-apocalyptic distant future, populated by characters and relationships more familiar to a fantasy novel. But what if the characters in a book of fantasy, with all of their myth and superstition and arcane tradition, really lived in a strictly material world? What stories of our present would reach a distant future, stripped of our scientific knowledge and cosmology, and how would they be told?The world of the book is tribal, the human species collectively living a post traumatic, highly vigilant life of strict and religious ceremony in an attempt to control that which has been shown to be uncontrollable. The most recent cultural memory is that of a near end of human life after a pandemic called bent head, one that spongifies the carriers brain before killing them. The sickness remains in the earth, helped along by the practice of removing heads in ritual sacrifice, and spreading victim's blood on the ground. Wonderblood is part of a prophesy in which all people see the return of the mythical astronauts, and a true king takes the throne. I found the premise of this book intriguing, and filled with possibility for storytelling and meaning. I especially liked the introduction of heretic characters, often doctors, who follow scientific principles, carefully hiding their unorthodox practices by wrapping them in more acceptable terminology. I hoped for a book showing a tension between these two ways of being. Unfortunately, my interest in the story and characters waned considerably over the course of the book. Many characters, chapters told from their perspectives each in turn, made the book feel as though it was trying for an epic scope. But by the end of the book, I felt as though I had finished a different book than I had began. Though I really did appreciate the merging of the two genres at the beginning of the book, I felt by the end that the premise didn't deliver on its possibilities as fully as it could, becoming more of an epic dark fantasy than the speculative thought experiments I thought I'd been offered. It was also a little long of the science fiction premise it postulated, and too short for the epic scope for which it seemed to be reaching. I would read Whicker again, especially if she develops another interesting premise like this book. I believe she has a lot to say about the potential dangers of faith and religion. I hope to see a more clearly defined and sharply written story from her exploring this in the future. ☠Trade Paperback, FirstRandom House, 2018Illustrated by Esbee BerniceThree StarsMay 15-May 23, 2018☠"}, {"userName": "Erin", "userReviewDate": "May 01, 2018", "userURL": "http://www.goodreads.com/user/show/32027612-erin", "userReview": "Wonderblood is Julia Whicker’s debut novel which I discovered through a post on tumblr about upcoming science fiction books. As a Floridian who grew up watching shuttle launches, I was drawn to the book because of the religion of NASA.Wonderblood’s plot follows the Aurora, who is referred to as “The Girl”, as she tries to survive wasteland that is filled with bloody carnivals, religious fanatics, and incurable diseases to return to her home in Florida. I will start off with this book was dark, unsettling, and made me uncomfortable at times. I have read some very heavy science fiction before like “Unkindness of Ghosts” by Rivers Solomon. However, Wonderblood lacked the hopefulness of “Unkindness of Ghosts” which made it a hard read.The best part about Wonderblood was the world. The world building was wholly original and I loved the details. The entire religion centers on the return of the space shuttles after the world has been cleansed with blood. America is split into two kingdoms with competing prophecies about the return of the shuttles and kings. At times, the world felt like a steampunk horror especially with the carnivals with shrunken head makers. Other times, the world felt like a whimsical fantasy poking fun at rich Floridians (apparently golf is eternal surviving the apocalypse). The snippets that we get about the apocalypse and cause of the collapse of the world is tantalizing. Bent Head and the Kansas Cow at first was not creepy to me until I realized it was reference to mad cow disease and other prion related diseases (I didn’t read the cover flap). Then it became more gross. Wonderblood’s prose painted the world so fully that it was easy to imagine the setting. Although I am familiar with the Cape Canaveral area, it was still changed and different for me to have to form a new image in my head.I really, really wanted to like Wonderblood because of the original and fantastic world-building. But, there were too many parts that just squicked me out including a scene with an underage character having sex with an adult with unclear consent and a menstruation side plot. However, all the abuse and awfulness was condemned through the plot twist. The book is very much the author writing about the ugly side of humanity in a world with desperation and running low on hope.  If you can take Game of Thrones (unlike me), then you’ll get through Wonderblood no problem.Content Warnings: Abuse, Rape, Torture, Underage Sex, Age Gap Romance,  Gore, and Body Horror"}], "description": "It's 500 years in the future, and a mad cow-like disease called \"Bent Head\" has killed off most of the U.S. population. Those remaining turn to magic and sacrifice to cleanse the Earth.Wonderblood is Julia Whicker's fascinating literary debut, set in a barren United States, an apocalyptic wasteland where warring factions compete for control of the land in strange and dangerous carnivals. A mad cow-like disease called \"Bent Head\" has killed off millions. Those who remain worship the ruins of NASA's space shuttles, and Cape Canaveral is their Mecca. Medicine and science have been rejected in favor of magic, prophecy, and blood sacrifice.When traveling marauders led by the bloodthirsty Mr. Capulatio invade her camp, a young girl named Aurora is taken captive as his bride and forced to join his band on their journey to Cape Canaveral. As war nears, she must decide if she is willing to become her captor's queen. But then other queens emerge, some grotesque and others aggrieved, and not all are pleased with the girl's ascent. Politics and survival are at the centre of this ravishing novel.", "title": "Wonderblood", "url": "http://www.goodreads.com/book/show/34964829-wonderblood", "average": 3.3, "cover": "https://images.gr-assets.com/books/1498680204l/34964829.jpg", "reviews": 96, "authors": [{"url": "https://www.goodreads.com/author/show/8259740.Julia_Whicker", "name": "Julia Whicker"}], "type": ["Science Fiction", "Science Fiction", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/34964829-wonderblood", "http://www.goodreads.com/book/show/36476940-wonderblood", "http://www.goodreads.com/book/show/25733892-wonderblood", "http://www.goodreads.com/book/show/22284155-the-iowa-review-fall-2013", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/25353286-provenance", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}