{"ratings": 764, "userreviews": [{"userName": "Vanessa", "userReviewDate": "Oct 04, 2011", "userURL": "http://www.goodreads.com/user/show/5943380-vanessa", "userReview": "Very easy, leisurely reading. This book, which won the Pulitzer prize in 1931, was mentioned in a modern novel I had just read, and I was intrigued enough to go looking for it. I guess it's out of print. It wasn't on Kindle either and the ones for sale on Amazon were being sold at $50+. Don't know why? But I found my copy on Ebay, a leatherbound book I was able to get for $20. So needless to say, I was quite excited to get this book in the mail, and to start reading it. This novel gives a nice glimpse of life and American upper class society right before and after 1900. And while it is set in Chicago, and not New York, it reminded me a bit of Edith Wharton novels. But the best thing I got out of this novel was the way it made me think about how I would stand, personally, if faced with the question of taking happiness vs living with the choices I have already made in my life, given the effects such a decision would have on family and children. While I know which side I would be on; and the main character of the novel, Jane Ward, was clear as well about what she believed was the right way to be, she pondered the issue enough to at least recognize the merits of the other side, and to wonder if perhaps only time will tell which way works out best for the ones who make that kind of decision. I would give this book 3 1/2 stars."}, {"userName": "Sandy ", "userReviewDate": "Apr 22, 2016", "userURL": "http://www.goodreads.com/user/show/10715774-sandy", "userReview": "This family saga centres on the life of Chicago native Jane Ward and her upper-class family and friends. We meet her as a young teen and watch her transformation from carefree girl to independent Bryn Mawr student to reluctant wife to worrying mother and grandmother. With so many characters involved, there are plenty of interesting and surprising events to keep the reader's interest. I found myself looking forward to my next opportunity to read a chapter or two, always wondering what would be next!The story is well-written, but firmly set in the late 19th and early 20th centuries with (some) corresponding outdated attitudes and social expectations, which may be a stumbling block for some readers. However, the issues and dilemmas which Jane faces throughout her lifetime are ageless and timeless and provide much \"food for thought\" for the reader.It is unfortunate that this winner of the Pulitzer of 1931 is out of print and consequently difficult to obtain. I was lucky enough to find a copy at a local university library -- it was in storage (in the sub-basement) and had not been checked out since 1965. It was duly retrieved and dusted off for me and, upon its return, will take its proper place in the stacks reserved for Pulitzer winners. It deserves to be resurrected and widely read!"}, {"userName": "Dree", "userReviewDate": "Sep 11, 2011", "userURL": "http://www.goodreads.com/user/show/837466-dree", "userReview": "At first I thought this book was going to be a nightmare to read--simple prose, all about a proper girl named Jane. But the story caught me. The prose began to strike me as simply being old-fashioned, as are words that you just don't hear much anymore (e.g. pigtails)--not hard words, just out-of-fashion words. I only had to look up one word* in the entire 500+ pages, which means easy old-fashioned reading!But in spite of the simple prose and vocabulary, the story does get good. Jane grows up, tries to please her family and fit in, attends 2 years of college, makes great friends, comes home, gets married, has and raises children, falls in love and makes a choice, and becomes a grandmother. Jane seems so simple, often confused, and just good. But is she really? And at what cost? Should she have made those choices? What does she know at 50 that she didn't know at 19 and 25? What truly matters? Happiness or duty? Can there be a compromise? Should we chase dreams and risk a good thing, or should we give up on joy for security?*smilax, which apparently was used to decorate at parties circa 1890-1930, is a plant genus. Plants in this genus include sarsaparilla and carrion flower. Which leads me to wonder if their parties smelled like root beer or carrion."}, {"userName": "Jimmy", "userReviewDate": "Aug 08, 2014", "userURL": "http://www.goodreads.com/user/show/11270481-jimmy", "userReview": "This book was an adequate and enjoyable read. Like the character of Jane, the protagonist, the writing itself is admirable and competent, but not exceptional nor all that very creative. Is it worthy of a Pulitzer? Hard to say, because it seems to fit a type that certainly was preferred by society and by the Pulitzer committee during the period of its publication in 1930 and its selection in 1931. But when you realize that Faulkner's \"As I Lay Dying\" was also published in the same year, you begin to think that the Pulitzer selection committee didn't know what the hell they were doing picking this book over Faulkner. But despite its lack of literary brilliance, I confess to enjoying it and would recommend it to others.What I most enjoyed about the book is its rather philosophically complex attempt to deal with human passion, love, happiness, and the passage of time. Although it pretends to project a kind of conservative preference for Victorian understandings of commitment, fidelity, morality, \"gracefulness,\" etc., it does push the envelope and question the certainty of what \"should\" be considered proper and moral in love and marriage. The main character, Jane Ward (later Mrs. Stephen Carver), is a very complex character. And many of the other female characters in the novel were also much more on the complex side. One would not expect this of a best seller (at least not one of today's best selling novels). Props to Barnes for her success as an author in this regard.What I didn't find all that impressive about the book was its very limited vocabulary and expressiveness. If she didn't use the word \"twinkling\" to describe a certain cleverly endearing look in the eyes more than 100 times, I'd be shocked. And that's just one of the more egregious examples of this limited descriptive capability. The novel is full of them. I also didn't find a lot of Jane's naivete about certain things to be really believable. A major failing of the book, though, is that Barnes just simply didn't manage to pass off the Jane/Jimmy love affair as believable. Not only did it seem forced and disingenuous; but it also seemed sordid and infantile.But perhaps the biggest flaw in the book is Barnes's utter inability to capture anything real and complex about any of the male characters in the story. She just couldn't pull it off. All the men in the novel were either one of two types: (1) the charming, dispassionate, good guy and steady/true husband and wise father -- albeit a bit clueless about love and passion, and always cuckolded --; and (2) the sneaky, handsome, rogue lady-killer and marriage-destroying gigolo doing the cuckolding. Yet the good guys, boring though they were, endured. The bad guys, as much as Barnes tried to humanize them, came off as caricatures and all came to tragic ends, getting their karmic comeuppance. I honestly didn't really like any of the men in the novel and thought that they were all portrayed simplistically in one of the two extremes. Had some of the male characters been written as complex people like the women were, the book would maybe have risen towards a higher plane of literary greatness. But Barnes just didn't have it in her, even though she tried.The final comment I'll make is that it is extremely difficult to find a copy of this book in the marketplace (at least for any decent price). It just hasn't captured the attention of any publishers to keep it in print. If you want to read this book, but don't want to spend $40 and up for an old, used copy from a second-hand dealer through Amazon.com or the online Barnes and Noble stores; you will be stuck searching for yellowed, dusty, and musty copies of it in College libraries. But make the effort to hunt one down, if for no other reason than to get a glimpse at another example of what passed for best-selling and critically-received (in its day) literature."}, {"userName": "Alexandra Harmon", "userReviewDate": "Jun 15, 2014", "userURL": "http://www.goodreads.com/user/show/5480734-alexandra-harmon", "userReview": "This is one of the best books I have ever read. It is one of those books that I will read several throughout my life, and get something new from it each time.Yes, it falls into the genre of “chick-lit,” but, it is so much more sophisticated than something like Little Women (sorry, Mom!). Jane is a completely likable, relatable character, but the author doesn’t romanticize her and sees her with a certain amount of ironic detachment. She is spirited and loving, but loses her first love through her pettiness and pride. She rolls her eyes at the vulgar gossip of her mother and sister, while obsessing over a new dress or gaining attention from a new love interest a few pages later. When she is young, she loves her freedom; when she is old, she scoffs at her own children wanting the same.It became clear within the first few chapters that Ayers Barnes was a feminist, but the book never preaches. Unlike most chick-lit, both pulpy and literary, Years of Grace doesn’t portray marriage as a finish line in the race to Happily Ever After. But neither is Jane’s marriage some kind of mid-century Lifetime melodrama, with an abusive or domineering husband. Jane is sometimes miserable, sometimes content, and often bored with her kind but often oblivious husband. And their marriage goes through many natural changes as the two characters age.This book is rather slow-moving. But slow-moving doesn’t have to mean boring. It is a character-driven, rather than a plot-driven, story, one of the best of its kind that I have ever come across.A much wordier version of this review is available on my blog: https://familiarcreatures.wordpress.c..."}, {"userName": "Tricia", "userReviewDate": "May 17, 2012", "userURL": "http://www.goodreads.com/user/show/9581187-tricia", "userReview": "A good read to reflect on life. Not super exciting, but enough to hold my attention. It is the book that that is referred to numerous times in Violets of March. It peaked my curiosity enough to buy it on eBay since it is out of print. I enjoyed the outlook of Jane as a teenager, married with children adult and then elder and her thoughts on her life and the lives of her children and parents and how it changes from one generation to the next."}, {"userName": "Danielle", "userReviewDate": "Jul 23, 2011", "userURL": "http://www.goodreads.com/user/show/5277515-danielle", "userReview": "More boring Americana. The struggles of marriage, family obligations, and the coming generation. Best line....\"you could never believe that [children] would grow up to disappoint you.\""}, {"userName": "Tracy Shapley", "userReviewDate": "Aug 29, 2010", "userURL": "http://www.goodreads.com/user/show/1857873-tracy-shapley", "userReview": "As I've noted in Pulitzers of this age, the writing was incredibly simple. A very simple story - but one I liked. It was about Chicago from the 1890's to around the late 1920's. As an added bonus, it took place in my actual neighborhood! So I dug that, obviously. The writing though, was almost just a list of things that happened. Like, \"Agnes went to the store. She bought cake there. She put the cake in the bag. She brought the cake home. She ate the cake” If this had been one of the first Pulitzers I'd read from that time I would probably have hated it. But I'm used the simple writing style and realize they used to award the Pulitzer more on story than writing style, as they do now."}, {"userName": "Roxanne Russell", "userReviewDate": "Jan 16, 2013", "userURL": "http://www.goodreads.com/user/show/12406850-roxanne-russell", "userReview": "This book settles in with many of the first twenty years of the Pulitzer winners for fiction in providing a perspective on the immense changes in American life at the turn of the 20th century. However, unlike the stories that stories that detail great downfalls or family strife in this time, Barnes presents a heroine who couches her development through her romantic connections. This story was OK- interesting enough and well-described. But it highlights Wharton's superior talent in capturing the same period and presenting the same themes so much more beautifully in the Age of Innocence and Ethan Frome."}, {"userName": "Elizabeth Hesseltine", "userReviewDate": "Jun 18, 2014", "userURL": "http://www.goodreads.com/user/show/20834889-elizabeth-hesseltine", "userReview": "Check another one off the Pulitzer list. This was similar to other prize winners. Since it is out of print, I had to request it from my public library through interlibrary loan. Well worth it! It was interesting to see how people are the same now as there were 100 years ago."}, {"userName": "Wanessa", "userReviewDate": "Apr 03, 2015", "userURL": "http://www.goodreads.com/user/show/3824066-wanessa", "userReview": "A vida de Jane Ward dos seus 14 anos até os 50 e poucos anos. As alegrias e tristezas que qualquer pessoa pode experenciar. Problemas comuns mas que realmente importam são deliciosamente descritos neste livro. ADOREI. O tipo de livro que nos faz refletir sobre a mudança de nossas próprias opinões a cada década vivida. E como o pensamento de diferentes gerações mudam mas os fatos da vida são, em geral, sempre os mesmos.:: passagens ::Perhaps people were all bored most of the time after they were 36. perhaps being bored was just part of growing up and growing old. The excitement went out of things. Life no longer had a surprise up its sleeve. But still, after you were 36, you went on living for another 36 years or so. Living and thinking about annoying trifles. (Jane)... (Jane) had been endeavoring to think of herself as a \"middle-aged\" ... Middle age is from 35 to 50. But curiously enough, in spite of that social statement, Jane had continued, incorrigibly to think of herself as 'young\".At 36 the trick was not so much to look pretty as to look young. Beauty helped, of course, but not as much as youth. (JANE)Do beautiful rainbow - colored bubbles, all made up of watery ideas and soap vocabulary, floating airily, without foundation, in the void, mean nothing in your life.There's a lot of nomad in me, you know. I guess the tent got into my blood. I'd like to go around the world. Round and round it in circles. Round it in every latitude. (Jimmy)She is dancing barefoot by a bonfire in a hatter red shawl - dancing in the dark of the moon to the tinkle of a tambourine ... She had the courage of his convictions. (p. 3131, Jimmy)THERE ARE HIGHER THINGS THAN CONVICTIONS. (Jimmy)You do get over loving anyone. But you don't always regret that love in retrospective. (Jimmy)Half trues have no place in conjugal confidence. They are cowardly, misleading. They are really lies. Whereas silence was - merely silence. (Jane)... we always read everything when we're too young to know what it means. And the trouble with life is that we're always to busy to re-read it later. There's more sense in books than you'd really believe. Though, of course, they don't teach you anything vital you can't lear for yourself. (pg 352, Jimmy)When you love people, you've got to be decent. You want to be decent. You want to be good. Just plain goos - teh way you were taught to be. Love's the greatest safeguard in life when against evil. (pg 365, Jane)IT'S NOT SO MUCH WHAT YOU DO THAT MATTERS, AS WHAT YOU FEEL (pg 371, Jane)Curious, she thought, the gap between the points of view of different generations. The fact of life were always the same, but people bought about them so differently. New thoughts about the same old action. Was it progress or merely change? Sex was a loaded piste thrust in the hands of humanity. Her mother's generation had carried it carefully, fearful of a sudden explosion. Her generation waved it non chalantly about, but, after all, with all their carelessness, they didn't fire it off any oftener than his parents had. What if the next generation should take to shooting? Shooting straight regardless of their target. (p303, Jane)Your inner life - how confusing it all was! A chaos of conflicting loyalties! You would like to think, of course, that you were the sort of woman who was capable of experiencing, once and forever, a central, domination passion. But as far as the essential sense of emotional intimacy went, she might be …( anyone's) … wife. Why had things turned out as they had? Predestination was probably the answer. Cause and effect. One thing leading to another. Free will was only a delusion. Why not turn fatalist, pure and simple, and not worry any longer? Not care.But you had to care about your children. Worry about them, too. You had to and you ought to. When you thought of them all theories of predestination where completely shattered. (p402, Jane)She felt herself suddenly submerge in an ignoble sense of relief at the realization of domestic decencies forever maintained, of vulgar complexities forever avoided. Were worlds well lost for love? … She only knew, now, that she had acted in response to an inner instinct so strong that love itself had stood vanquished before it. The instinct was victorious, but the victory was barren. She had tried to preserve the happiness of the others. In reward she had been left only with a feeble, futile feeling that, in any event, her own happiness could never been attained. A barren victory. A victory the was essentially a defeat --- (p414, Jane)(The father) He had worried and warned and watched and loved and sympathized over Jane for 41 years, and now he is dying. He was dying just a at the time Jane felt she could have rewarded his love and symphony as never before. There was no longer any necessity for worrying an warning and watching over her personal drama. She had grown up. Soon she would grow old. She saw life, mow, yet to eye with her father. She, too, had become a spectator. Her children had taken the stage. (p426. Jane)Safety first was always parental slogan. Parents invariably deplored everything the threatened their children's security. Whatever their own experience had been, they desire for the younger generation only the most conventional, the most convenient, kind of happiness. (p427, Jane)Parents knew little enough of the emotional lives of their children, but children knew nothing of the emotional lives of their parents. The emotional life of a parent was a fantastic thought.… Jane knew how they had looked. She had always known that because of the pictures in the red plush family album… She had non sense of the continuity of their personality. They had died young - those two young people. They had grown up into Mr and Mrs Ward, who had always seen to Jane, since her earliest memory, so staid, so styled, so more middle-age. (p247/248, Jane) ALL LIVES ARE DIFFICULT AT TIMES (Mr Ward)It was touching to think the anyone could have the courage to believe that life could begin over again at fifty. Love at fifty. Autumn blossoming. A freak of nature, like the flowers of the witch-hazel, bursting weirdly into bloom in October when all the others bushes were bare. (p641, Jane at Muriel late wedding)You fool the world, but you don't fool yourself. You may win the pot, but it's not worth the winning. (all pgs 465/466)But Jimmy was a gipsy. Jimmy loved success for the fun of it and comfort for the easy of it, but they would soon be bored him. Jimnmy could never have sat on this window-seat and looked at all those boats without wanting to charter a tug for Shanghai or Singapore. Jimmy would never have locked up his money in banks or sunk it in bricks and mortar … Jyimy's happiness was always just around the corner. (p541, Agnes)There couldn't be understanding between two generations. Love and sympathy, but never understanding. We must take our children's ideas on faith. We can never make them our own. Remember that and save yourself unhappiness.(p542, Agnes).You had to choose in life. And perhaps you never gave up anything except what some secret self-knowledge whispered that you did not really care to posses … She had made than in simplicity and sincerity and because of that curious inner scruple that 'Matthew Arnold had defined - \"the enduring power, not ourselves, which makes for righteousness.' But to what end … You did not know - you could never tell - just where the path you had not taken would have led you. p577, Jane\"L'amour fait passer le temps, le temps fait passer l'amour\"\"\"Eveything is a source of fun,Nobody's safe, for we care for none,Life is a joke tha's just begun ---\"When you look at a child you could never believe that it would grow up to disappoint you.The End"}, {"userName": "Kevin", "userReviewDate": "Dec 04, 2017", "userURL": "http://www.goodreads.com/user/show/1784011-kevin", "userReview": "While the novel is entertaining and well written, the conflicts are extremely anachronistic. However, it does a good job showing that the worries of our parents are different than our worries and our worries are different than our children's worries. As time passes on social mores evolve. I guess this makes the central theme of this book: \"Nothing is constant except change\"."}, {"userName": "Rick Folker", "userReviewDate": "Oct 07, 2017", "userURL": "http://www.goodreads.com/user/show/50725710-rick-folker", "userReview": "quaint and chaste"}, {"userName": "Jeff Stern", "userReviewDate": "Jan 21, 2017", "userURL": "http://www.goodreads.com/user/show/5780369-jeff-stern", "userReview": "Why are all the men in this book so terrible and why do the women fall for all of them?"}, {"userName": "Jane", "userReviewDate": "Jul 07, 2014", "userURL": "http://www.goodreads.com/user/show/13477711-jane", "userReview": "This book, which won the Pulitzer prize in 1931, was repeatedly mentioned in Sarah Jio's \"Violets of March.\" Because that book was a five-star book for me, my interest was peeked. Although out-of-print, I was able to procure a copy of \"Years of Grace\" from my local Public Library (good for them!). This book tells the story of Jane Ward, from when she is 14 years old, until she is 51, and takes place primarily in Chicago from the 1890's to around the late 1920's. It was interesting to read about customs and traditions in those Victorian days. Many words used in the text are no longer used in modern novels, or mean something totally different. The book follows Jane's life, with her first-love experience as a teenager, her college years, young married with children, then later in life, with several grandchildren. We are also introduced to her childhood girlfriends and siblings, and follow their lives through the same time period. We are privy to Jane's thoughts as she struggles with her duties and expectations as a daughter, sister, and wife, social propriety, and the desires of her heart. She meditates \"Your inner life - how confusing it all was! A chaos of conflicting loyalties!\" The generational differences are not much different than what we see today. We see how far women's liberation has come in the last 100+ years, and that was very interesting. For example, in the Victorian age, a pregnant woman would not speak of her pregnancy, much less go out in public in a form-fitting outfit, as today. There were side-trips taken over the years to New York, and Europe, which added to the interest of the book. Added to this all the references to fashions, decorating, hobbies, commerce, and transportation of that time-period made this a very interesting read."}, {"userName": "Brenda Cregor", "userReviewDate": "Jan 07, 2014", "userURL": "http://www.goodreads.com/user/show/2497735-brenda-cregor", "userReview": "How happy I am that this book has not yet been sullied by descent into paperback-hood!There is something about this novel that makes you want to sit taller, watch your language, and brush up on your French.Decency.Yes, that's it.It speaks to human decency.Forget the ill-assigned comparison between this book and THE BRIDGES OF MADISON COUNTY, which, by the way, is in paperback now.Margaret Ayer Barnes won the PULITZER PRIZE in 1931 for this, her first novel.By reading some biographical excerpts on the author, you can see why her descriptions of Chicago and Bryn Mawr College were so...real.I read the ending twice.TWICE!I cannot say, in my history of book reading that this has ever occurred.Let me explain why.The story centers primarily around Jane.Yes, plain Jane.And that is how it begins.Plain.But as Jane progresses and evolves, so does the novel's ability to captivate the reader with greater and more profound insights into the realities of marriage, motherhood, sisterhood, and daughterhood.By the end, I was Jane's champion.And when she made her greatest personal discovery, I cheered for her.At last, when the concluding words were scanned into my mind [ and by the way, they're so simple, but SO TRUE], I wanted to relive plain Jane's private triumph again.Hence, rereading the end.BRAVO, Margaret Barnes! I, for one, am glad you broke your back, so this novel could be born."}, {"userName": "Tracy", "userReviewDate": "Jul 29, 2013", "userURL": "http://www.goodreads.com/user/show/260084-tracy", "userReview": "I saw this book on a list somewhere and decided to read it. The 1931 Putlizter prize for fiction follows Jane, a girl of 14 as she ages to about 50. She falls in love and has some issues with her parents over her choice to marry, goes to college, eventually returns and marries and has children of her own. I loved the section on her annual trip to her in laws' place and the part where she gets bored in her marriage. The book, while following social norms of the time, has a contemporary feel in some ways - specifically in the feelings Jane has about her marriage, her parents, her in laws and her children. Eventually, she also faces intergenerational issues with her own children which echo the ones Jane faced years earlier.I recommend this book."}, {"userName": "Amanda", "userReviewDate": "Oct 22, 2013", "userURL": "http://www.goodreads.com/user/show/5619242-amanda", "userReview": "This one wasn't bad, but it seemed to take me forever to read it (it was also almost 600 pages). The first couple of parts were really good, and the third, Jimmy, wasn't bad either. However, the last 150 pages of the book were pretty painful. I would have given it 4 stars if we hadn't have had to read for pages and pages about her grown up children misbehaving. It was also surprisingly hard to find. The library had to special order it from KC and the only copy on Amazon was $42. Hopefully as these books enter the public domain their popularity will rise again, because this really overall was a pretty decent book."}, {"userName": "Ben", "userReviewDate": "Oct 20, 2011", "userURL": "http://www.goodreads.com/user/show/4161332-ben", "userReview": "Years of Grace is typical of the Pulitzer's I've read pre-1940 so far. Largly about families around the turn of the early 20th Century. Years of Grace takes place in Chicago, and focuses on one girl and her desires versus her duties to her family and society. It's split into three books - the first on her late teenage years, the second jumps ahead to college, her marriage and having kids and the third as a 51 years old with her own children. It has themes that resonate today about the passage of time, duty and honor. The prose is written in very short sentences but once I got through some of it and got into the rhythm of the book it became a very quick read."}, {"userName": "Quiltyknitwit", "userReviewDate": "Jun 02, 2013", "userURL": "http://www.goodreads.com/user/show/1099774-quiltyknitwit", "userReview": "An amazing, enjoyable, and quite long novel of Jane, a young woman in 1890s era Chicago. The book follows her thoughts and experiences with her family, romances, children, and friends from girlhood to middle age. There were many poignant truths in this 1931 Pulitzer Prize winning novel that hold true to the 21st century. The characters were memorable. I also gained insight into the social and cultural expectations of my grandmothers and mother (who came of age the same years as covered in the book)."}, {"userName": "Mary Garner", "userReviewDate": "Jan 09, 2014", "userURL": "http://www.goodreads.com/user/show/2861322-mary-garner", "userReview": "I have to give this novel 5 stars because it won the Pulitzer Prize! Regardless, it rates five stars for being a very readable book about life as it happens--without a single cliche; about conventional topics--without foregone conclusions. The author explores the age-old issue of generational differences with subtlety and provocative depth. The characters are satisfyingly developed and sufficiently complex. Plus, it was just fun to read a book written nearly 85 years ago, when driving in a car was \"motoring\" and the word \"awfully\" was used everywhere you might expect to read \"very.\""}, {"userName": "Cheri", "userReviewDate": "Apr 23, 2013", "userURL": "http://www.goodreads.com/user/show/106692-cheri", "userReview": "I've had this book on my list for a while after reading a book where it was repeatedly referred to as comparable to \"A Tree Grows in Brooklyn\" and that it was a story that had meant a great deal to the author in their life. I don't agree that this book bears any significant resemblance to \"A Tree Grows in Brooklyn\" other than the small section which takes place in New York, and perhaps the era may have been close. I really didn't find anything compelling about this book."}, {"userName": "Elena", "userReviewDate": "Sep 17, 2012", "userURL": "http://www.goodreads.com/user/show/11741292-elena", "userReview": "Good story and character development. I enjoyed the early 20th century voice it was written with. I did not like the writing style in the first part although I understand why the author did this. Writing was south better in the second part and on. Overall I enjoyed it and did grow to love the main characters."}, {"userName": "Taadhameka Kennedy", "userReviewDate": "Aug 22, 2012", "userURL": "http://www.goodreads.com/user/show/12095316-taadhameka-kennedy", "userReview": "The story of Jane Ward's life may not be fraught with danger and intrigue over its 581 pages, but it is told with a quiet and witty introspection. She is a woman of her time and lives a normal life of domesticity and duty. But I find myself hoping that if my normal life were put on paper I would hope it would be told with the same amount of dignity and grace."}, {"userName": "Scott", "userReviewDate": "Feb 02, 2009", "userURL": "http://www.goodreads.com/user/show/138086-scott", "userReview": "What an interesting read. A library book club selection, this book was picked due to it's Chicago setting and that it won the Pulitzer in 1931. Although it is not the most modern of writing stlyes, I thought that the book offered great reflection on the history of society and more specifically women's roles and attitudes in the early 20th century."}, {"userName": "Maura", "userReviewDate": "Jun 28, 2014", "userURL": "http://www.goodreads.com/user/show/7019167-maura", "userReview": "I really enjoyed this - a story of a life from childhood until the kids are grown. Granted, she nearly makes some crazy choices, but it was a nice snapshot into Chicago and life for upper class women in Chicago in the turn of the 20th century. Hard to hear the guy say \"I hate college women.\" different time...glad I am not there"}, {"userName": "SM Surber", "userReviewDate": "Nov 17, 2017", "userURL": "http://www.goodreads.com/user/show/17762958-sm-surber", "userReview": "Such an enjoyable book!"}, {"userName": "Melissa (ladybug)", "userReviewDate": "Apr 11, 2012", "userURL": "http://www.goodreads.com/user/show/2494726-melissa-ladybug", "userReview": "A book that follows Jane Ward throughout her life from first love at 14 and then to Married love with Grandchildren around you. This book shows us one girls decisions and what they cost her and that same girl having the fortitude to stick to these same decisions whether they were good, bad or indifferent."}, {"userName": "Marty", "userReviewDate": "Sep 28, 2013", "userURL": "http://www.goodreads.com/user/show/315571-marty", "userReview": "The latest of the Pulitzer novels my husband and I are reading, Years of Grace was very enjoyable. The story was captivating and the character development was excellent. At times the narrative seemed a bit drawn out, and we also enjoyed some marvelous insights offered by the author. We continue to be delighted that we have chosen to read these books."}, {"userName": "Joseph", "userReviewDate": "Apr 06, 2012", "userURL": "http://www.goodreads.com/user/show/1271613-joseph", "userReview": "This is absolutely one of the best novels I've read in a long, long time. It will not be to everyone's taste; it is slow in places, but that is part of its charm. It recounts the story of Jane -- a young woman from post Victorian time until WWI. A wonderful read for anyone who likes slow, introspective fiction. It captures the heart."}], "description": "She fought the battle of the generations victoriously because she understood both the years of grace and the age of jazz. Her story reveals the beauty, the drama, and the passion that can lie unsuspected beneath a quiet exterior.", "title": "Years of Grace", "url": "https://www.goodreads.com/book/show/1457221.Years_of_Grace", "average": 3.72, "cover": "https://images.gr-assets.com/books/1248301688l/1457221.jpg", "reviews": 45, "authors": [{"url": "https://www.goodreads.com/author/show/316716.Margaret_Ayer_Barnes", "name": "Margaret Ayer Barnes"}], "type": ["Fiction"], "outlinks": ["http://www.goodreads.com/book/show/1457221.Years_of_Grace", "http://www.goodreads.com/book/show/580689.Years_of_Grace", "http://www.goodreads.com/book/show/12489508-edna-his-wife", "http://www.goodreads.com/book/show/12489495-within-this-present", "http://www.goodreads.com/book/show/25776933-the-world-s-greatest-literature", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}