{"ratings": 37, "userreviews": [{"userName": "Thomas", "userReviewDate": "Sep 17, 2017", "userURL": "http://www.goodreads.com/user/show/71564445-thomas", "userReview": "Following a decrease of ungulate populations from 1944 to 1959, more than 32 cases of Amur tigers attacking both Brown and Asian black bears were recorded in the Russian Far East, and hair of bears were found in several tiger scat samples. Tigers attack Asian black bears less often than brown bears, as latter live in more open habitat and are not able to climb trees. In the same time period, four cases of brown bears killing female and young tigers were reported, both in disputes over prey and in self-defense. Tigers can tackle bears larger than themselves, using an ambushing tactic and jumping onto the bear from an overhead position, grabbing it by the chin with one fore paw and by the throat with the other, and then killing it with a bite in the spinal column. Tigers mainly feed on the bear's fat deposits, such as the back, hams, and groin.Amur tigers regularly prey on young bears and sub-adult brown bears. Reports of preying on fully grown small female adult Ussuri brown bears by a big male tiger are common as well. Predation by tigers on denned brown bears was not detected during a study carried between 1993 and 2002. Ussuri brown bears, along with the smaller Asian black bears constitute 2.1% of the Siberian tiger's annual diet, of which 1.4% are brown bears. Certain tigers have been reported to imitate the calls of Asian black bears to attract them.Bears are said by a source to be generally afraid of tigers, and changed their path after coming across tiger trails; however, this is disputed. In the winters of 1970–1973, Yudakov and Nikolaev recorded two cases of bears showing no fear of tigers and another case of a brown bear changing path upon crossing tiger tracks. Other researchers have observed bears following tiger tracks to scavenge tiger kills and to potentially prey on tigers. Despite the threat of predation, some brown bears actually benefit from the presence of tigers by appropriating tiger kills that the bears may not be able to successfully hunt themselves. Brown bears generally prefer to contest the much smaller female tigers. During telemetry research in the Sikhote-Alin protected area, 44 direct confrontations between bears and tigers were observed, in which bears in general were killed in 22 cases, and tigers in 12 cases. There are reports of brown bears specifically targeting Amur leopards and tigers to abstract their prey. In the Sikhote-Alin reserve, 35% of tiger kills were stolen by bears, with tigers either departing entirely or leaving part of the kill for the bear. Some studies show that bears frequently track down tigers to usurp their kills, with occasional fatal outcomes for the tiger. A report from 1973 describes twelve known cases of brown bears killing tigers, including adult males; in all cases the tigers were subsequently eaten by the bears.The relationship between the Amur tiger and the brown and Himalayan bear is not specifically studied. Numerous publications on these species there are mainly episodic and survey data on this issue are collected by different authors in selected areas which do not give a complete picture of the nature"}, {"userName": "Richard A Peters", "userReviewDate": "Nov 09, 2013", "userURL": "http://www.goodreads.com/user/show/22959674-richard-a-peters", "userReview": "Mr. Mountjoy really tries to give the reader everything at once: zombies, time travel, a commando story and post-apocalyptic world rebuilding. He comes agonizingly close to pulling it all off. With a bit more detail- the book is too short- this might have been an instant cult classic.A mixed team of different high speed operators are assembled for a “secret project” that lands them 3 years into the future… just after the zombie apocalypse. They spend surprisingly little time worrying about that, shrug their shoulders and set off on a mission across the country to link up with the remnants of the US Government. Along the way they slaughter zombies by z-bucket full, of course. Where it gets really interesting is how they unite various bandit and survivor groups and inspire hope in the pockets of the scattered human resistance. A fun improvement to the simple survival tale.What’s disappointing is that you never feel the warriors are in real danger. They’re armed to the teeth, are always conveniently given excellent intel ahead of trouble and are just way too lucky.Now, the action is incredibly fast paced and does flow quite naturally, but when that speed is combined with the lack of real stress for the heroes I just couldn’t get really excited or emotionally invested. That said, the author’s character dialogue is spectacular. Earthy and real, without being over-the-top macho. I bet they’ll remind you closely of people you know.All in all, an entertaining read. The flaws are not deal breakers; this book is worth the time. This book is one heck of a teaser for the rest of the series. I’ll most definitely read the next one."}, {"userName": "Rolando Gill", "userReviewDate": "Jul 21, 2011", "userURL": "http://www.goodreads.com/user/show/5004167-rolando-gill", "userReview": "Imagine a zombie apocalypse where everything goes right. First day exposed to zombies, no problem. Surrounded by zombies, no problem. Confronted by renegade raiders, no problem. Hordes of zombies leaning on a fence, fence holds, no problem. I am surprised the time traveling soldiers didn't find their intact families and cure the population of the virus. I am sure that part will be in the sequel. The author kept setting up situations and introducing disposable characters but the situation never turned bad or dramatic and the disposable characters always survived and lived happily ever after. I never expected a book about zombies where nothing goes wrong. Boring."}, {"userName": "Justin Kean", "userReviewDate": "May 31, 2014", "userURL": "http://www.goodreads.com/user/show/26961835-justin-kean", "userReview": "What a messWhat a messWow....we start with time travel, then zombies, then geek wish fulfillment, and some truly silly story progression. Essentially this is a World of Warcraft player who decided to throw in everything but the kitchen sink. It's so obviously wish fulfilment you can easily see where he put himself and his friends in the story. I'm guessing the author is probably about 18 or 19, and the writing shows. Although I do give him credit, he did publish a book which is more than I've done."}, {"userName": "Mike Porreca", "userReviewDate": "Dec 05, 2013", "userURL": "http://www.goodreads.com/user/show/26292388-mike-porreca", "userReview": "I grabbed this on a free promotion. Despite the poor editing, I still finished it. The author seemed to try and create the ultimate thriller: Time travel, commando action, zombies, etc... and he came so close to pulling it off.The story was often truly unique, not to some formula, but the editorial mistakes kept throwing me out of it. With some more polish this could be a cult masterpiece.Regardless of the flaws, definetly worth reading!"}, {"userName": "Oliver Anderson", "userReviewDate": "Mar 30, 2014", "userURL": "http://www.goodreads.com/user/show/24290188-oliver-anderson", "userReview": "Decent zombie apocalypse Decent zombie apocalypse Some of the terminology seemed forced and new. Not being in the military but reading a lot of military scifi, can't remember mikes being used for mins. Beyond that it was entertaining and will be checking out book 2."}], "description": "\"3 Years After\" is a story about a Special Forces team put together to help our nation in a most fragile time. The post 9/11 world has forced the United States government to develop new ways to fight and counter terrorism. During the initial testing of the latest technological breakthrough, Time Travel, a catastrophic failure occurs. This strands the test team three years into the future. They are greeted by a new world which has been decimated by war and infested by zombies. Will the team and humanity survive? Do they figure out what happened in time? This is the new version that has been edited.", "title": "3 Years After... (a Military/Zombie Apocalypse Series)", "url": "http://www.goodreads.com/book/show/13343196-3-years-after", "average": 3.7, "cover": "https://images.gr-assets.com/books/1348406481l/13343196.jpg", "reviews": 6, "authors": [{"url": "https://www.goodreads.com/author/show/4837204.G_R_Mountjoy", "name": "G.R. Mountjoy"}, {"url": "https://www.goodreads.com/author/show/5209103.Mo_Happy", "name": "Mo Happy"}], "type": [], "outlinks": ["http://www.goodreads.com/book/show/13343196-3-years-after", "http://www.goodreads.com/book/show/11306471-3-years-after", "http://www.goodreads.com/book/show/13741752-3-years-after-book-2-mission", "http://www.goodreads.com/book/show/17975406-savannah-after-the-end-3-years-after-book-2-5"]}