{"ratings": 219, "userreviews": [{"userName": "Alex (not a dude) Baugh", "userReviewDate": "May 01, 2016", "userURL": "http://www.goodreads.com/user/show/4449236-alex-not-a-dude-baugh", "userReview": "What is it like to be a black man and to want something so badly you are willing to put up with racial discrimination, willing to buck the system and prove those who think you lack the intelligence to fly a plane wrong, so very wrong? What was it like to become a Tuskegee Airman?In a series of thirty-three poems, Carole Boston Weatherford answers these questions, writing the history of this distinguished band of brothers, the African American pilots who fought for victory on two fronts, one in Europe against Nazism and one at home against racism.Using a composite \"you\" that not only addresses the Tuskegee airmen as a whole, but also and immediately invites the reader into their midst, Weatherford begins her history-in-verse, capturing the big and small personal and shared moments and events that mark this period in America.Weatherford skillfully orchestrates this complex history, beginning with a young boy's desire to fly to becoming one of 2,000 black pilots in the 1938 newly formed Civilian Pilot Training Program - 2,000 out of a total of 400,00 - sent to Tuskegee Institute. Training is rigorous, cadets knowing that\"The eyes of your country are on you;the hopes of your peoplerest on your shoulder.\" (pg 10-11)She then takes the reader along as the men learn and practice their new skills, even as they must still deal with racism and Jim Crow laws at every turn, knowing\"In this war, the enemy is you.In 1941 and 1942, eleven black men -if you count the three boys -were lynched in the United States.\" (pg 19)Weatherford deftly goes beyond the Tuskegee program to include the ways in which other black Americans did what they could to counter the racism of the home front, acts that give impetus to their own training. There is a poem dedicated to Dorie Miller, the Navy cook who was awarded the Navy Cross for his heroic actions during the attack on Pearl Harbor; another recounts boxer Joe Louis's victories in the ring, his benefit matches to raise money for army and navy relief funds, and his convincing the War Department to admit him and Jackie Robinson to Officer Candidate School\"along with thirteen other menwhom racist policies had barred.\" (pg 30)In another poem, readers learn that singer Lena Horne refused to go on USO tours that barred black servicemen. And refusing to perform in white-only establishments, too,\"Now Lena pays her own wayto perform for the troops. When she visits Tuskegee,she sings, perches on planes, and poses for photos.How could you not fall for Lena?\" (pg 50)As the child of a WWII nurse, I personally love that Weatherford even offers up a poem paying homage to the Tuskegee Army Airfield Nurses, finally giving this most unsung group of military nurses some of their due: \"it really takes a good nurse to KEEP 'EM FLYING.\" (pg 13)This free verse history is probably one of the best books I have read about the Tuskegee Airmen, simply because there is so much meaning and information to be culled from each poem, yet they are rather sparely written, making each word used important and expressive. And it all works. The black and white illustrations were done in collaboration with Weatherford's son, Jeffery Boston Weatherford, an artist in his own right. For You Can Fly, Jeffery used a technique called scratchboard, which results a much more dramatic illustration than just using, for example, black and white paint/india ink or charcoal on white paper. Scratchboard results in a textured illustration and these compliment the poems so beautifully.I have to admit I am a big fan of Carole Boston Weatherford's free verse histories. When she came to Bank Street this year, to accept the 2016 Flora Stieglitz Straus Award for nonfiction for her amazing book Voice of Freedom: Fannie Lou Hamer: Spirit of the Civil Rights Movement, I'm afraid I may have shamelessly fangirled. So naturally, I was really looking forward to reading this new history-in-verse and let me say, it does not disappoint and I highly recommend it.Do not miss the Epilogue or the interesting back matter that includes an Author's Note, an extensive Timeline, and a variety of Resources for Further Reading.This book is recommended for readers age 9+This book was sent to me by the publisher, Atheneum BFYRThis review was originally posted on The Children's War"}, {"userName": "Jill", "userReviewDate": "May 09, 2016", "userURL": "http://www.goodreads.com/user/show/3438496-jill", "userReview": "I'm not a huge fan of blank verse, but the subject matter of this book (the Tuskegee Airmen) pulled me in. I thought it was really interesting how Weatherford managed to include statistics in her poetry, things like the percentage of black men trained by the Civilian Pilot Training Program, and the number of black women serving in the Army Nurse Corps. She somehow manages to fit descriptions of the planes they were flying (and weapons they were outfitted with) into the poetry of “Training Planes,” “Routines,” “Red Tail Angels,” and “The Black Birdmen. She also includes vignettes about Lena Horne, Joe Louis, and Dorie Miller to provide historical context, even though they weren’t directly related to the story of the Tuskegee Airmen. While the POV is solidly in the second person for the whole book, the narrative’s scope moves between personal and global in a way that seemed smooth and natural.Again, blank verse doesn’t usually thrill me, but here are a few of the passages that I thought were particularly effective.“Tuskegee is a laboratory, / and you are under a microscope. / But the distance to your goal/ is longer than any airstrip. // The burden of past and future, / heavier than any aircraft. / The eyes of your country are on you; / the hopes of your people / rest on your shoulders. // Some days you look heavenward-- / sensing that it might be easier / to defy gravity than Jim Crow.”“Peering through a Plexiglas window-- / the only thing between you and the Nazis-- / you can’t help but pity them. / They have no clue what you are made of-- / that you cut your teeth battling the color barrier, / that you’ve seen enough action for two wars.”“Your perilous path was paved by patriots.” (Gotta love that alliteration!)This is a pretty quick read, and one that I think will appeal to even reluctant readers."}, {"userName": "Melinda Bender", "userReviewDate": "Jul 10, 2017", "userURL": "http://www.goodreads.com/user/show/54079905-melinda-bender", "userReview": "Interesting story about an African-American Air Force squadron during WWII and how they were so proud to fly for the United States despite the racial inequalities that they were facing at home during this time period."}, {"userName": "Jennifer Mangler", "userReviewDate": "Oct 22, 2017", "userURL": "http://www.goodreads.com/user/show/4970468-jennifer-mangler", "userReview": "This is a quick, powerful read about an important part of our history too few people know about. This book would be a very accessible introduction to the history of the Tuskegee Airmen."}, {"userName": "Lilla", "userReviewDate": "Feb 22, 2018", "userURL": "http://www.goodreads.com/user/show/86881-lilla", "userReview": "Great little verse novel that packs a powerful punch. I'd love to see this in the hands of more of our kids. It's an important story to tell, and I love the illustrations that accompany the poetry."}, {"userName": "Angel Durant", "userReviewDate": "Apr 13, 2018", "userURL": "http://www.goodreads.com/user/show/53102350-angel-durant", "userReview": "The book is good i liked how it put you as a one of the airmen and how it is a quick read and you could read it in maybe 2 or even 1 day"}, {"userName": "Hoover Public Library Kids and Teens", "userReviewDate": "Oct 07, 2017", "userURL": "http://www.goodreads.com/user/show/2775666-hoover-public-library-kids-and-teens", "userReview": "Gentle yet stirring, Weatherford’s 40-plus free-verse poems create a composite portrait of the first African-American military pilots, trained at the Tuskegee Institute before fighting on the front lines in WWII, and the rampant racial prejudice that these military heroes battled throughout the war. (from Publisher's Weekly)"}, {"userName": "Bridget F", "userReviewDate": "Jun 16, 2017", "userURL": "http://www.goodreads.com/user/show/66729952-bridget-f", "userReview": "You Can Fly: The Tuskegee Airmen starts out at the Tuskegee Institute where they are giving African American males the chance to prove themselves as pilots. Weatherford wrote this book in the second person point of view, and it is the story of African American men being able to fight for their country in the air. The first part of this journey is training to be a pilot. You learn the ropes of “yes, sir,” and “no, sir.” Then, you take ground classes in math, science, and flight. The next thing you know, it’s your turn to fly solo. In the meantime, there is a different kind of war. A war where defying gravity seems easier than lifting Jim Crow laws. A war where black men are being lynched. It is December 7th, 1941, and Pearl Harbor has been bombed. Next, you are graduating flight school. Questions of blacks defending a country that does not treat them equally begin to rise. Finally, you get your call to battle, knowing you are making history. This book tells a compelling story about an important time in our nation’s history. The poetry in this book gives a sense of rhythm and creates a clear image of what is happening. I really liked the comparisons in this book, such as being unsure of which is harder to defeat, gravity or Jim Crow. This was an excellent read. I could see this book being used in the classroom. I would have students do research into civil rights movement at this time in order to understand what the black men were up against. The students could create a timeline of the events of civil rights and the events of the war."}, {"userName": "Terri", "userReviewDate": "Aug 18, 2016", "userURL": "http://www.goodreads.com/user/show/1578420-terri", "userReview": "I read \"You Can Fly: The Tuskegee Airmen\" by Carole Boston Weatherford and Jeffrey Boston Weatherford for the Chapter and Verse Book Club that I belong to.I appreciate that this is an important story that celebrates not only the Tuskegee Airman but many World War II black heroes and role models. However, the subject is not unique - there are several good books on the subject. There is, however, a nice sense of history here, and of those who have come before. Boston Weatherford manages to cram in lots of interesting facts and information here that provide a bigger picture of World War II and the role that black Americans played in it. This would be a useful text to use in the classroom in a study of World War II, black history, etc. One of the essential questions to discuss with students is asked on page 35: \"How could a black man be expected to fight...and defend a country that doesn't respect his rights?\" Then on page 36: Is \"...a segregated America worth defending?\" And what, then, inspired the Tuskegee Airmen to fight for the right to defend their country? The book includes excellent back matter. The timeline and resources would also be useful in the classroom.The choice to use poetry and scratchboard drawings to tell the story is unique, but not necessarily successful. The free verse poetry, with a few exceptions, is marginal at best. It felt more like prose (and not even poetic prose at that). Placing the words on the page to look like poetry doesn't magically make them poetry. I would have liked more use of imagery and more play with form.The scratchboard illustrations, while interesting, don't necessarily set a tone or enhance the text. Many of the details of the drawings are lost in the small formatting of the book, though the compact size of the book itself makes it more likely that late elementary and middle school students might actually carry it around. However, the illustrations themselves may have had more of an impact had they been larger, and may have benefited from more of a picture book sized formatting.All in all, \"You Can Fly: The Tuskegee Airmen\" is a worthy read. Recommended for grades 4-6."}, {"userName": "Deborah", "userReviewDate": "Jun 29, 2016", "userURL": "http://www.goodreads.com/user/show/2187302-deborah", "userReview": "Read this book LOUD, sing it, share it--it is glorious. Powerful short vignette poems chronicling the advent and soaring success of the Tuskegee Institute program to train African-Americans to become air-force pilots. The voice of each poem is poignant, aspirational, and brutally honest about the pervasive, dehumanizing racism rampant in the military and throughout the country they swore to serve and protect with their lives. Scaffolding the pilots' heart stories are verses on the heroes of the age, like Private Joe Louis, Lena Horne, and Dorie Miller, as well as the victimized, the black men and boys lynched between 1941 and 1942.I love the scratchboard illustrations and varied types of poems. The stanzas in \"Ground School\" simply and elegantly simulate the flight V formations. The time line of African-American Civil Rights and Military historical benchmarks is awesome. There is also a fabulous Resources bibliography that includes PRIMARY SOURCES! Yeah!This slim volume packs a meaty punch. It makes for a great read-aloud and middle grade book club title. Personally, I'd love to pair it with Marilyn Nelson's \"American Ace\" for a poetry slam. I absolutely love them!"}, {"userName": "Kristin", "userReviewDate": "Oct 02, 2016", "userURL": "http://www.goodreads.com/user/show/10381638-kristin", "userReview": "This middle grade book tells the story of the Tuskegee Airmen in prose. It gives a great history lesson of African-American military and pop culture in short excerpts. There is a timeline and pages of resources at the back of the book. This would be a great resource in History/Social Studies classrooms."}, {"userName": "Abby Johnson", "userReviewDate": "Mar 30, 2016", "userURL": "http://www.goodreads.com/user/show/53329-abby-johnson", "userReview": "This small package packs a powerful punch. This nonfiction in verse is written in the second person, putting the reader right in the middle of the action while highlighting the many accomplishments of the Tuskegee Airmen. Hand this book to kids interested in WWII and military history."}, {"userName": "Brenda Kahn", "userReviewDate": "Jun 29, 2016", "userURL": "http://www.goodreads.com/user/show/2700654-brenda-kahn", "userReview": "Spare, powerful and evocative. Impressive art debuted by author's son."}, {"userName": "Edward Sullivan", "userReviewDate": "May 28, 2016", "userURL": "http://www.goodreads.com/user/show/2574606-edward-sullivan", "userReview": "The story of the Tuskegee Airmen in verse with insight cultural and historical details. Sorry to not see Pat and Fred McKissack's Red-Tail Angels listed in the suggestions for further reading."}, {"userName": "Crystal", "userReviewDate": "May 14, 2016", "userURL": "http://www.goodreads.com/user/show/938799-crystal", "userReview": "Great overview of the Tuskegee Airmen. The history is shared through poems. I really appreciated the timeline and resources at the end too."}, {"userName": "Dawn Moews", "userReviewDate": "Apr 19, 2017", "userURL": "http://www.goodreads.com/user/show/25187401-dawn-moews", "userReview": "(18-19: 0, 1, 1)"}, {"userName": "The Reading Countess", "userReviewDate": "Feb 26, 2017", "userURL": "http://www.goodreads.com/user/show/2027269-the-reading-countess", "userReview": "Absolute perfection. Poetic narrative about the famed Tuskegee Airmen. But look closer. You'll see more history squeezed in a half page of text than you and I got in school. You might appreciate the timeline at the end that puts everything into perspective. You'll also marvel at the scratch drawings the author's talented son embedded in the book and appreciate not only the mother-son duo, but the artistry that goes into scratch art. You might even google how one does this method for entirely too long to comfortably admit. Highly recommended."}, {"userName": "Heidi Busch", "userReviewDate": "May 27, 2018", "userURL": "http://www.goodreads.com/user/show/22239759-heidi-busch", "userReview": "The Tuskegee Airmen fought during WWII. This slim book does a wonderful job of sharing their story in simple language. I like the scratch board pictures. I believe reluctant readers who often look for a “skinny book” will be holding a gem when they find this one. The resources at the end are also valuable."}, {"userName": "Sarah W", "userReviewDate": "Jun 28, 2017", "userURL": "http://www.goodreads.com/user/show/1152622-sarah-w", "userReview": "This novel-in-verse takes on the training and combat missions of the Tuskagee Airmen."}, {"userName": "Matthew Krukowski", "userReviewDate": "Apr 17, 2018", "userURL": "http://www.goodreads.com/user/show/71850393-matthew-krukowski", "userReview": "It is a really good book on giving a different perspective on world war two and the freedom of African Americans."}, {"userName": "Vanessa", "userReviewDate": "Jan 19, 2018", "userURL": "http://www.goodreads.com/user/show/8543445-vanessa", "userReview": "didn't get into this much. Some good info."}, {"userName": "Kelly", "userReviewDate": "May 25, 2017", "userURL": "http://www.goodreads.com/user/show/2181790-kelly", "userReview": "Provides lots of opportunities for the read to investigate further and do some more research. Accessible to all readers of varying reading ability. Good discussion starter."}, {"userName": "Diana Pettis", "userReviewDate": "Aug 02, 2017", "userURL": "http://www.goodreads.com/user/show/4188695-diana-pettis", "userReview": "💘 this book. History told in kid language."}, {"userName": "Stacey", "userReviewDate": "Jan 30, 2017", "userURL": "http://www.goodreads.com/user/show/7207800-stacey", "userReview": "Wow! I always love a book written in verse. Even better when I learn things. Can't wait to share with my students."}, {"userName": "Kevin Summers", "userReviewDate": "Jun 19, 2017", "userURL": "http://www.goodreads.com/user/show/16694459-kevin-summers", "userReview": "I don't 'get' the illustration style, but the poems are great."}, {"userName": "Renee", "userReviewDate": "Nov 10, 2017", "userURL": "http://www.goodreads.com/user/show/1282184-renee", "userReview": "Novel in verse that seemed to try to cram in too many facts. I expect more imagery from novels written in verse."}, {"userName": "Rebecca Gomez", "userReviewDate": "Apr 30, 2018", "userURL": "http://www.goodreads.com/user/show/22527440-rebecca-gomez", "userReview": "Inspiring."}, {"userName": "Jim", "userReviewDate": "Mar 10, 2018", "userURL": "http://www.goodreads.com/user/show/5814532-jim", "userReview": "I really liked this kid's intro to the Tuskegee Airmen."}, {"userName": "Elizabeth S", "userReviewDate": "Jul 21, 2017", "userURL": "http://www.goodreads.com/user/show/891566-elizabeth-s", "userReview": "Great, inspirational, true story. Only downside is that I'm not a big fan of books in verse."}, {"userName": "Kim", "userReviewDate": "Apr 29, 2018", "userURL": "http://www.goodreads.com/user/show/10770958-kim", "userReview": "After reading The Crossover, I have kids clamoring for novels written in verse. This is a great nonfiction alternative."}], "description": "Award-winning author Carole Boston Weatherford’s innovative history in verse celebrates the story of the Tuskegee Airmen: pioneering African-American pilots who triumphed in the skies and past the color barrier.I WANT YOU! says the poster of Uncle Sam. But if you’re a young black man in 1940, he doesn’t want you in the cockpit of a war plane. Yet you are determined not to let that stop your dream of flying.So when you hear of a civilian pilot training program at Tuskegee Institute, you leap at the chance. Soon you are learning engineering and mechanics, how to communicate in code, how to read a map. At last the day you’ve longed for is here: you are flying!From training days in Alabama to combat on the front lines in Europe, this is the story of the Tuskegee Airmen, the groundbreaking African-American pilots of World War II. In vibrant second-person poems, Carole Boston Weatherford teams up for the first time with her son, artist Jeffery Weatherford, in a powerful and inspiring book that allows readers to fly, too.", "title": "You Can Fly: The Tuskegee Airmen", "url": "http://www.goodreads.com/book/show/27206496-you-can-fly", "average": 3.96, "cover": "https://images.gr-assets.com/books/1462176591l/27206496.jpg", "reviews": 59, "authors": [{"url": "https://www.goodreads.com/author/show/57825.Carole_Boston_Weatherford", "name": "Carole Boston Weatherford"}, {"url": "https://www.goodreads.com/author/show/8008670.Jeffery_Boston_Weatherford", "name": "Jeffery Boston Weatherford"}], "type": ["Poetry", "Nonfiction", "History", "War", "Childrens"], "outlinks": ["http://www.goodreads.com/book/show/27206496-you-can-fly", "http://www.goodreads.com/book/show/30130901-you-can-fly", "http://www.goodreads.com/book/show/107465.Moses", "http://www.goodreads.com/book/show/22747807-voice-of-freedom", "http://www.goodreads.com/book/show/25785628-freedom-in-congo-square", "http://www.goodreads.com/book/show/1004012.Freedom_on_the_Menu", "http://www.goodreads.com/book/show/23217536-gordon-parks"]}