{"ratings": 2156, "userreviews": [{"userName": "Heather", "userReviewDate": "Mar 14, 2008", "userURL": "http://www.goodreads.com/user/show/327795-heather", "userReview": "I loved, loved, loved this book. I felt this book is a rare gem that few people know about. It was like listening to a wise grandma casting her pearls of wisdom that are still very applicable today. The thing I loved the most is that I think anyone could relate to Eleanor Roosevelt! She was an extraordinary woman, yet so ordinary(like you and me) at the same time.This is one that I will definitely read again."}, {"userName": "Trish", "userReviewDate": "Mar 23, 2017", "userURL": "http://www.goodreads.com/user/show/1826682-trish", "userReview": "This is a great book that discusses what we should seek in a politician. Eleanor Roosevelt's control and calm is what I admire most. She was comfortable in her own skin by the time her husband and her best friend, Tommy, died, when she wrote this book. She was well situated financially, but it was more than that: she gives examples of people who never did learn, in all their years, how giving is more rewarding than taking, and sharing is what a good life is all about. And she ought to know. Eleanor Roosevelt became a force and a celebrity in her lifetime despite suffering in childhood from great shyness. She wasn’t pretty and she was inexperienced, and in the man’s world of the time, she was often underestimated. She learned early that discipline gave one some breathing space in a confusing and fast-paced world. This is a personal book, but because she was a public figure from marriage, she includes observations about public life as well. Many of the difficulties that are crippling us as citizens now were already apparent when she wrote this in the late 1950’s. \"If people come up the financial ladder but still maintain a low educational standard, with its lack of appreciation of many of the things of artistic and spiritual value, the nation will not be able to grow to its real stature.\"This is true for our leaders as well. Not only do we need boldness in our leaders, we need a lack of corruption, and values that elevate the chores we must undertake to allow states their individuality at the same time they add heft and stability to the group we call a nation. \"Nobody really does anything alone.\" Our greatness, if we have any, is ever only displayed in relation to, in concert with, our fellow citizens. Like happiness, greatness means nothing in solitude. The last chapter of this book is called Learning to be a Public Servant. Our consciousness has been raised lately and we are much better aware of what we think constitutes a good public servant, so reading this chapter refreshes for us what kind of person we are looking for to lead us in government. The first thing E.R. notes in this chapter is that few people begin their careers planning to run for office. Politics provides an uncertain future because one’s position comes up for reassessment every couple of years. And secondly, politics is not generally as remunerative as other careers. A competent person will be generally looking for stability and security in a career so that politics, if it comes up at all, is an accidental or situational possibility. If a person decides to run for office they must be sure they have enough money to do so: that is, they must be able to take the risk of losing the job again and therefore not be forced into compromises that tarnish either the candidate or the office.The family of the prospective politician must be thoroughly onboard with such an uncertain life in the public eye. And the politician must truly love people and his/her constituency to be able to spend all the time one needs to do the job well on their behalf. He/she is the conduit to introduce the particulars of his/her own state to the nation, to the world, and at the same time bring the world and the nation’s interests back home to his state, explaining on both sides and seeking agreement between needs. E.R. talks about ‘timing,’ and how important it is for a politician to sense the best time to propose, the moment one can be assured one’s attitudes will be rewarded with agreement and compliance. The politician must be able to move people towards new ideas and grasp the moment that is auspicious for general acceptance. It helps, she says, for a politician to be able to draw people to himself/herself. The only reason E.R. did not talk more about women in politics, she says, is because women seem to be more sensitive to criticism than men, and therefore take themselves out of the fray. Even that holds some truths for us today.We live in a world in a state of flux, she wrote in 1960…\"The problems are new…To meet these new challenges we look for new ingredients in our public servants, an elasticity and flexibility of mind that enables them to change to meet changes; an alert and hospitable intelligence that can grasp new issues, new conditions, new peoples. We look especially for a man who knows that he thinks and can make his views clearly understood without ambiguity or hedging…It is no longer possible for us to look back over our shoulders if we are to keep abreast of our world, let alone maintain leadership. We cannot say “Nothing has changed,’ or ‘The old ways were best.’ The point is that the old conditions are gone and we are left confronting the new.\"What is so very interesting about Eleanor Roosevelt is that she says she is an optimist but does not believe “everything will have a happy ending.” She writes that she had seen too many examples where this was not true. Instead, she is congenitally hopeful, in part because she believes that we can remake our world when things get out of whack. And most instructive of all is what she says of youth:\"There is no human growth without the acceptance of responsibility and I think it should be developed as soon as it reasonably can be…it is often people who refuse to assume any responsibility who are apt to be the sharpest critics of those who do…Nearly every one of us, at some time or other, thinks what a great waste and pity it is that the older generation cannot teach the younger generation, cannot share their experiences, cannot save the young their mistakes…and yet it is possible this is the best way. After all, so much that the older generation learned is wrong! And perhaps they didn’t always learn as much by their experience as they thought they did.\"Most of the chapters begin with a strong statement, for instance: \"Happiness is a by-product, not a goal.\"The rest of the chapter is a casual, articulate discussion of the topic with examples from her life. It must have been the crowd she hung with, but juvenile delinquency referred to drunken brats from wealthy families making no effort to involve themselves with important themes and jobs. The poor, she theorizes, see how important they are to the cohesion and survival of the family group so they do not have similar problems.Look how things have changed in fifty years, that the poor see no future for themselves and so can sometimes set themselves at cross purposes to that of the larger society. This, and drug abuse rather than alcohol, have changed the dynamic. The wealthy have not as much security as before, so must continually scramble, besides the fact that the ceiling has been lifted on wealth. No longer is it crass, crude, and criminal to flaunt one’s wealth in the faces of, and obtained at the expense of, those with less.E.R. is so grounded and unfussy, so kind and humble that we wonder if such a person could exist today. Much of what she says I recognize as the attitudes of earlier generations of women in my family. Those women are all dead now, but there is some comfort in reading someone articulate where they got their firm views about what is expected of individuals and citizens. This was a comforting, insightful book to read at this time, to give us perspective, and hope."}, {"userName": "Melissa Yael Winston", "userReviewDate": "Oct 23, 2009", "userURL": "http://www.goodreads.com/user/show/1835423-melissa-yael-winston", "userReview": "In this book, Eleanor Roosevelt outlines eleven actions that each person must take in order to lead a fulfilling life. They are as follows:1. Learning to Learn--This first key makes the others possible. A fulfilled person must be curious and must learn to use his or her mind as a tool to understand and influence the world. Roosevelt insists that beyond discipline and training, a sense that life is an adventure makes people not only willing but passionate to learn about themselves, their fellow human beings, and the world. Interests cultivated by the curious mind beget new interests, which beget new interests, and so on, until the interested person is the fulfilled person.2. Fear, The Great Enemy--For a woman whose husband intoned, \"We have nothing to fear but fear itself,\" this key does not surprise the reader. \"Fear has always seemed to me to be the worst stumbling block which anyone has to face,\" Roosevelt writes. \"It is the great crippler.\" Roosevelt's suggestion for overcoming fear is self-discipline--once one has faced certain fears, the strength and confidence gained from those experiences foster the overcoming of new fears. On the flip side, not facing one's fears makes one weaker, and when one is weaker, one has a harder time facing other fears. \"Do the things that interest you and do them with all your heart. Don't be concerned about whether people are watching you or criticizing you. The chances are that they aren't paying any attention to you. It's your attention to yourself that is so stultifying.\"3. The Uses of Time--As someone who never feels like I'm productive enough, I was especially interested in Roosevelt's ideas on the subject. One statement, credited to a deceased relative, sticks out: \"We have all the time there is.\" Roosevelt solves the problem of the best way to use time in three ways: 1) achieving an inner calm that allows for one to function contentedly in a stressful environment, 2) concentrating on the task at hand (TAKE THAT MULTITASKING!!!), and 3) arranging the day so that certain tasks are completed at certain times, planning for everything that must be done, and remaining flexible enough to handle the unexpected. Roosevelt also stresses the importance of maintaining good health in order to facilitate the other methods. But these steps are secondary to having something to use one's time for. \"The most unhappy people in the world are those who face the days without knowing what to do with their time. But if you have more projects than you have time for, you are not going to be an unhappy person.\" One must decide what one's life (i.e. time) is going to count for, and then make it count.4. The Difficult Art of Maturity--Self-respect and self-knowledge as well as an understanding of one's limitations and the limitations of others are all crucial components of maturity. Another important factor is an awareness that as people, we are interdependent. Roosevelt stresses that teaching children as early as possible how little they can do alone is key to helping them become happy, productive adults. Being able to take and use criticism and evaluation are also indicators of maturity. At the top of the heap comes an awareness of one's own values. \"To be mature you have to realize what you value most.... Not to arrive at a clear understanding of one's own values is a tragic waste. You have missed the whole point of what life is for.\"5. Readjustment is Endless--Here is an interesting observation on Roosevelt's part: She states (correctly, I believe) that women have the advantage of being expected, to a greater extent than men, to make adjustments throughout their lives. The key to handling life is to adjust when necessary; happy people tend to be happy in spite of their circumstances, not because of them.6. Learning to be Useful--\"Happiness is not a goal, it's a by-product.\" One achieves fulfillment by having a sense of purpose. \"Usefulness, whatever form it may take, is the price we should pay for the air we breathe and the food we eat and the privilege of being alive.\" Roosevelt touts the importance of volunteer work, pointing out that needs exist for all kinds of people to do all kinds of work. One should express one's appreciation for living on this earth by helping others, regardless of monetary rewards.7. The Right to be an Individual--Roosevelt posits that in order to be fully human, one must assert one's individuality. Human nature is all about an innate drive to be oneself and to achieve self-actualization through various expressions of that self. \"It is a brave thing to have courage to be an individual; it is also, perhaps, a lonely thing. But it is better than not being an individual, which is to be nobody at all.\" Roosevelt lauds what she calls social conformity, which is basically the kind of behavior that allows people to co-exist in society, while decrying conformity to \"alien\" standards in order to go with the proverbial flow and achieve a level of acceptance by denying one's true self. Roosevelt refers to the keeping up with the Joneses as \"the real menaces of this country.\" (And, as we have seen in the years since she wrote this book in 1960, it's also a menace to our environment and the world.) Not only will one never reach the status of the Joneses, one will lose oneself in the effort. \"You can get rid of your neighbors, but you cannot get rid of yourself, so you are the person to be satisfied.\"8. How to get the Best out of People--Very little can be accomplished alone. A truly happy, fulfilled person will come to accept, learn from and use the strengths and weaknesses of others as a part of life. Roosevelt identifies two qualities one must have: one must be a good listener, and one must be able to empathize with others. People share more commonalities than they do differences; being able to see oneself as a member of the human race and learning to work with others in that race is crucial.9. Facing Responsibility--One statement in this chapter jumped out at me more so than others: \"I have often thought that so much attention is paid to the aggressive sins, such as violence and cruelty and greed with all their tragic effects, that too little attention is paid to the passive sins, such as apathy and laziness, which in the long run can have a more devastating and destructive effect upon society than the others.\" Passivity is a far graver and more insidious enemy in that it enables aggression, but it also gives people an excuse not to take responsibility. Is to abstain from building gas chambers the same as to fight for human rights? And at the same time, if the gas chambers are built, outfitted and used while one passively looks on, is one not responsible in some part for their existence? To be responsible, one must not only monitor one's behavior, but one must have the courage to speak out when others are doing wrong. But before any of that can happen, Roosevelt maintains that one must have the courage--and take the responsibility--to decide for oneself what is right and what is wrong.10. How Everyone Can Take Part in Politics--Bad news. Voting is a minimum, according to Roosevelt. Not only must one vote, but one must be educated about whom to vote for and what their stance on issues means in terms of its implications for the future. Challenging the \"If you lie down with dogs, you wake up with fleas\" argument, Roosevelt maintains that the only way to instill any sort of integrity into the dirty business of politics is to actively involve oneself in it, and, using integrity, reform it.11. Learning to be a Public Servant--If one chooses to be a public servant, the challenge comes in understanding, first of all, what that means. A public servant must serve, first and foremost, and be empathetic to the needs of his (and Roosevelt sticks to this pronoun) constituents. At the same time, a good public servant must not rely on his position for his livelihood; only a public servant with some other means of income can truly make the best decisions. Public servants must also have an ear for the suggestions of others but not get so bogged down in public opinion that they never do anything worth the effort for fear of offending someone.A good read, though I would have preferred more concrete examples from Roosevelt's own life and fewer anecdotes about those in her acquaintance."}, {"userName": "Sarah", "userReviewDate": "Aug 02, 2013", "userURL": "http://www.goodreads.com/user/show/12233359-sarah", "userReview": "I was surprised that I didn't enjoy this book more than I did. I found myself frequently saying YES! That's true! but what would have been quite controversial in 1962 seems rather mundane now. I found her writing style to be a bit arrogant or patronizing (which is hardly surprising given the life she led - she's earned the right to speak authoritatively but somehow, it just rubbed me the wrong way) and at times, the writing seemed very dated to me. I'd really like to read her autobiography - I think that would be much more fascinating, reading about her adventures put in the context of the time in which she lived/"}, {"userName": "Josilyn", "userReviewDate": "Aug 24, 2013", "userURL": "http://www.goodreads.com/user/show/9438580-josilyn", "userReview": "WOW. Although written in 1960, this book still resounds with relevance today, and it should be required reading for every young adult who wants to know how to make the most of life. If students had to read this in high school, I believe that an entire generation would benefit and be better people as a result. Many of the values put forth in this book are ones that are prone to be forgotten in this day and age, but they should not be. Most likely this will be one of the 5 most influential books I'll read over the course of my life, and one that I will be referring to frequently again and again."}, {"userName": "Marisa", "userReviewDate": "Nov 30, 2013", "userURL": "http://www.goodreads.com/user/show/1964331-marisa", "userReview": "Eleanor Roosevelt is definitely one of my biggest historical heroes, but I have to say that I would not necessarily recommend this book. The 21st century reader has to take everything with a grain of salt given the time period it was written in, which is only to be expected, however I felt that even the core messages of the chapters (which are largely still applicable today) are not written in a way that is particularly engaging or interesting-- and for a woman who did so much, one would think she would have been able to add more fascinating, detailed anecdotes and less mere mentions of famous people she encountered. Still, despite the fact that I occasionally noticed I was forcing myself to get through the dryer parts, it was largely a worthwhile read, and the words of such an amazing person can't simply be cast aside because he or she was not primarily an author."}, {"userName": "emilee", "userReviewDate": "Mar 06, 2015", "userURL": "http://www.goodreads.com/user/show/27218233-emilee", "userReview": "i've always adored eleanor roosevelt but i do so much more after this book. she is such a wise woman & has so many great things to say--i couldn't stop highlighting. so many great stories from her life experiences. it made me really think about what i have learned from living. i seriously think everyone should read this & the world would be a happier & better place, it made me want to be a better person after reading"}, {"userName": "Heather Friedman", "userReviewDate": "Sep 10, 2015", "userURL": "http://www.goodreads.com/user/show/123038-heather-friedman", "userReview": "It's unbelievable how accurate and still relevant many of Eleanor Roosevelt's observations and recommendations are. I enjoyed this little book of reflection and found it motivating and inspiring in how I can evolve and grow in little ways throughout my day. She is a fascinating woman and this was a great read on advice from parenting to how to be a better person, citizen, role model."}, {"userName": "Carol", "userReviewDate": "Nov 12, 2010", "userURL": "http://www.goodreads.com/user/show/2604014-carol", "userReview": "In just 11 chapters, Eleanor shares with us her own interpretation of the basic philosophy of life. She believes that her basic philosophy is best expressed in the choices one makes daily. She discusses fear, a stumbling block, the great crippler, is something we all face. She stated \"Looking back, it strikes me that my childhood and my early youth were one long battle against fear.\" She realized that \"the danger lies in refusing to face the fear, in not daring to come to grips with it. If you fail anywhere along the line it will take away your confidence. You must make yourself succeed every time. YOU MUST DO THE THING YOU THiNK YOU CANNOT DO.\" Eleanor also discusses the uses of time, how to be a mature person, readjustment is endless, and learning to be useful. She shares her story of being with Harry Belafonte visiting 2 children's hospitals. \"The next afternoon I again saw him give of himself in the same way. Moving among the hospitalized children, making their eyes shine and their faces light with smiles because he gave them a word of encouragement. For a moment the braces or the cradle in which they lay was forgotten. They were well in their bodies because he satisfied their little souls.\" The remaining chapters in the book are: the right to be an individual; how to get the best out of people; how everyone can take part in politics, learning to be a public servant, and facing responsibility with this quote:\"We all create the person we become by our choices as we go through life.In a very real sense, by the time we are an adult,We are the sum total of the choices we have made.\"So much in this short book. Such an amazing woman!"}, {"userName": "Danica", "userReviewDate": "Nov 28, 2008", "userURL": "http://www.goodreads.com/user/show/1057957-danica", "userReview": "A book to keep by your bedside and read a page or two before you go to sleep.Inspirational, keeping us on the right path"}, {"userName": "Trice", "userReviewDate": "Feb 27, 2015", "userURL": "http://www.goodreads.com/user/show/2969156-trice", "userReview": "kind of a facts of life sort of thing, very practical - most of it not hugely surprising, but nice to have that voice with its background of experience and hearing what kind of advice she'd give. also a quick take toward the end on both the price of and need for participation in politics, from the local up to the international, from 'mere' voting up to representation and bill writing. In some ways the way she thinks about and talks of the various parts of life reminded me of my grandmother, though they were a generation apart - it's a voice I miss hearing every day.As a side note on my own reading, it was interesting to read her comment on helping out with a settlement house, even as I'm in the midst of reading Jane Addams' \nTwenty Years at Hull House\n, though these two remarkable women wouldn't have had any direct overlap in this work I don't think."}, {"userName": "Carey", "userReviewDate": "Jan 26, 2016", "userURL": "http://www.goodreads.com/user/show/1388655-carey", "userReview": "This book is basically a memoir of Eleanor's beliefs and ideas that she had during her life. It's not an autobiography which is what our bookclub was looking for our selection. Maybe we should've looked more closely at the book before choosing it. It did provide many ideas that are still relevant today; such as... The importance of education, reading, choices, happiness, politics, and being a life-long learner. My favorite quote is this... \"Whatever period of life we are in is good only to the extent that we make use of it, that we live it to the hilt, that we continue to develop and understand what it has to offer us and we have to offer it. The rewards for each age are different in kind, but they are not necessarily different in value or in satisfaction.\" I look forward to reading either a biography or autobiography of Eleanor Roosevelt. Does anyone know a good one?"}, {"userName": "Miz Lizzie", "userReviewDate": "Aug 14, 2011", "userURL": "http://www.goodreads.com/user/show/1447535-miz-lizzie", "userReview": "So interesting on so many different levels. The book serves as a self-help manual, a memoir, a textbook on good citizenship and how to become a public servant, a source of small meaningful stories and inspirational tidbits, and a historical document. Written at the end of her life, Eleanor Roosevelt embraced her role as Elder and Public Servant to write a book summarizing the greatest lessons of her life to share with others. In brief, make deliberate effort to overcome your fears, small and large, and do so by living life to the fullest, learning from and serving others with compassionate curiosity. I can see this as a book that will be fun to dip back into at random now and again when in need of insight or inspiration. My new Eleanor Roosevelt motto: You must do the thing you think you cannot do."}, {"userName": "Kirstin", "userReviewDate": "Feb 11, 2010", "userURL": "http://www.goodreads.com/user/show/832310-kirstin", "userReview": "From an academic standpoint I would give this book a 3 stars. She is constantly stating her opinion as absolute statements--some of which I didn't entirely agree. She doesn't defend her opinions and sentiments very well sometimes and for that I just thought the academic aspects of the book were \"okay\". From a personal standpoint, I thought the book was a 5 stars. Perhaps because the book is a little outdated, I felt like I was reading counsel from my grandmother. She is a moral person and speaks highly of many of the standards I believe and cherish. The book was uplifting."}, {"userName": "Ana González suazo", "userReviewDate": "Feb 01, 2015", "userURL": "http://www.goodreads.com/user/show/21976903-ana-gonz-lez-suazo", "userReview": "Very disappointed. I was expecting so much more after reading the great reviews. She comes out snobby, and though her advice usually makes sense, it was not very practical. Some of her advice makes for great quotes, but that's the best I can say. It was a very boring, I had a hard time even getting through it. I assume she has other better books and thats why her reviews are so good. Might have to read something else to change my mind, but will probably have to wait some years before putting myself through it again."}, {"userName": "Lindsay ", "userReviewDate": "Jun 21, 2011", "userURL": "http://www.goodreads.com/user/show/1701891-lindsay", "userReview": "This book was ok. I didn't find it super life changing or anything. Its a pretty simple basic book, targets to the point where we should learn as much as we can, and face our fears, and try new things. Thats what I like about Eleanor Roosevelt. What I've read about her, it seems as if she was a shy girl, but as she got older, she wanted to learn as much as she could and do new things and stop being afraid of things. Basically she lived her life."}, {"userName": "Maria", "userReviewDate": "Oct 22, 2014", "userURL": "http://www.goodreads.com/user/show/430639-maria", "userReview": "Eleanor Roosevelt clearly was a woman with a great spirit, passionate for making herself and her world better. In her book, she shared those things that you would want a mentor to share. It would make a great gift for a graduate or young adult. She found each person, conversation and experience a teacher, thus never being bored and certainly never being boring. My favorite quotes from it include: “You gain strength, courage and confidence by every experience in which you really stop to look fear in the face. You are able to say to yourself, 'I have lived through this horror. I can take the next thing that comes along.' You must do the thing you think you cannot do.” As I am in my 30's and have faced personal struggles that I couldn't imagine getting past in my 20's, I realize how true this is. Anytime I have had something difficult, I keep thinking of the hardest things I weathered and I feel encouraged. I like that she didn't hear no and give up. “What counts, in the long run, is not what you read; it is what you sift through your own mind; it is the ideas and impressions that are aroused in you by your reading. It is the ideas stirred in your own mind, the ideas which are a reflection of your own thinking, which make you an interesting person.” This encouraged me to spend more time in reflection on what I am consuming and not just moving on immediately to the next thing. Starting a booktube channel has helped with this as I have been more intentional to mark/write quotes. It does me no good to read or live and not to reflect back on what it meant. I highly recommend this one!"}, {"userName": "Amanda", "userReviewDate": "Jun 03, 2013", "userURL": "http://www.goodreads.com/user/show/1349487-amanda", "userReview": "Eleanor Roosevelt was an extraordinary woman. I feel fortunate to have gotten to know her a little more through her book. This book is broken into eleven key chapters.1 - Learning to Learn2 - Fear: The Great Enemy3 - The Uses of Time4 - The Difficult Art of Maturity5 - Readjustment is Endless6 - Learning to be Useful7 - The Right to be an Individual8 - How to Get the Best out of People9 - Facing Responsibility10 - How Everyone can Take Part in Politics11 - Learning to be a Public ServantThe over arching theme in her voice is to take responsibility for yourself and get involved.Here are some of my favorite quotes from her....\"It is only by inducing others to go along that changes are accomplished and work is done.\"\"By the time we are adult we are the sum total of the choices we have made.\"\"Nothing has ever been achieved by the person who says, \"It can't be done\".\"Our doubts are traitors and make us lose the good we oft might win by fearing to attempt.\"\"Great minds discuss ideas; average minds discuss events; small minds discuss people.\""}, {"userName": "Becky", "userReviewDate": "Dec 10, 2014", "userURL": "http://www.goodreads.com/user/show/1504452-becky", "userReview": "I picked up this book after reading a few quotes from it somewhere. It is an immensely quotable book and follows an anecdote, platitude, repeat format. Unlike what I expected, the anecdotes where not from Eleanor’s personal life, but from the lives and observations of people she’s met over the years. (The fault seems to be in my expectations. Perhaps I should have read her biography instead.)A few things to note.1. This book is not timeless. It includes many references to current situations between the U.S. and the Soviet Union. It is also written in a time when it was acceptable stereotype roles of men and women (i.e., the difference in temperaments and roles between boys and girls).2. This book is written for moms. So much parenting advice in here. Perhaps that was her primary audience at the time, but as a result, it missed the mark for me."}, {"userName": "Dionne", "userReviewDate": "Jan 08, 2014", "userURL": "http://www.goodreads.com/user/show/1365310-dionne", "userReview": "\"Surely, in the light of history, it is more intelligent to hope rather than to fear, to try rather than not to try. For one thing we know beyond all doubt: Nothing has ever been achieved by the person who says, 'It can't be done'\"I loved this book, it was amazing. A friend was reading it and was inspired, and so she bought the book for me as well. Eleanor gives a lot of great advice. Some of what she said I've heard other places, but the way she said things inspired me.The chapter on fear was wonderful. It was a great reminder to face your fears and to be confident about what you want in life.The chapter on responsibility was good for me too. It opened my eyes about a situation in my own life.I highly recommend this book. I would really like my daughters to read it some day!"}, {"userName": "Biniam Biniam", "userReviewDate": "May 22, 2015", "userURL": "http://www.goodreads.com/user/show/42331923-biniam-biniam", "userReview": "At the end of You Learn by Living, Eleanor Roosevelt writes that she feels that her book advice for personal growth and fulfillment boils down to a handful of principles. It is always helpful to successfully complete smaller steps that carry you gradually towards a larger goal. There are more clearly defined objectives, it will be defined between steps achieved and made visible. that motivates incredible"}, {"userName": "Heidi", "userReviewDate": "Jul 07, 2016", "userURL": "http://www.goodreads.com/user/show/47448863-heidi", "userReview": "This book is a treasure-trove of quotable wisdom. Clearly, it's an auto-biographical account, so you have to take some with a grain of salt, and I even rolled my eyes at some points. But it was a fascinating look into the life of an unarguably great women. It's a very short, easy read."}, {"userName": "Michelle", "userReviewDate": "Jun 20, 2013", "userURL": "http://www.goodreads.com/user/show/3471523-michelle", "userReview": "Some great bits of wisdom if you overlook the sexist bias of the times."}, {"userName": "Kelli", "userReviewDate": "Dec 13, 2010", "userURL": "http://www.goodreads.com/user/show/1562368-kelli", "userReview": "The overtones of her political progressiveness were a bit hard to swallow. But that being said, I did appreciate the fact that she faced her many fears and conquered them."}, {"userName": "Sean O", "userReviewDate": "Oct 18, 2016", "userURL": "http://www.goodreads.com/user/show/5984690-sean-o", "userReview": "Can't even. Full of dippy platitudes and reminisces of rich upbringing. I might pick it up again, but not today."}, {"userName": "Kayla", "userReviewDate": "May 05, 2018", "userURL": "http://www.goodreads.com/user/show/45814175-kayla", "userReview": "This book introduces no revolutionary ideas or concepts (a fact Roosevelt acknowledges in the afterword), however it is full of wise reminders of our duty to ourselves and our fellow man. According to my handy Kindle stats, I highlighted 62 passages (in a mere 212 page book) if that gives a sense for how much this book resonated with me.The lesson above all that I've continued to dwell on is that we are responsible for our own growth. We should teach children and ourselves the power that comes with learning how to learn, for \"why was your mind given you but to think things out for yourself?\" The ability to search a database worth of knowledge in an instant has in many ways crippled our ability to problem solve, to wrestle with ideas, and to bring our own experiences and insights into a resolution. What's beautiful about Mrs. Roosevelt's words on this topic is that they're 60 years old. This phenomenon is not new just because we have Google and iPhones and social media. My generation is not the first to neglect the hard work that comes with attaining knowledge, but we will cease to be interesting, relevant, and contributing members of society if we rest on our laurels.Highly recommend this book!"}, {"userName": "Susan", "userReviewDate": "Mar 29, 2018", "userURL": "http://www.goodreads.com/user/show/3828046-susan", "userReview": "Eleanor Roosevelt was so wise! In this book, she gives 11 keys to living a successful life. It is slightly old-fashioned, but so practical and much of what she has to say is still relevant today. Her 11 keys are:1. Learning to learn2. Fear, the Great Enemy3. Uses of Time4. The Difficult Art of Maturity5. Readjustment is Endless6. Learning to be Useful7. The Right to be an Individual 8. How to get the best out of people9. Facing Responsibility10. How everyone can take part in politics11. Learning to be a public servant"}, {"userName": "Amy", "userReviewDate": "Feb 07, 2017", "userURL": "http://www.goodreads.com/user/show/3046316-amy", "userReview": "I really really enjoyed Ms Rosevelt's perspective of the world and how she approaches giving advice. She recognizes her own shortcomings with such honesty. Her attitude about learning and growing in all situations is so admirable and something that took her far in life. I especially liked it when she talked about what she learned from her husband and her position as First Lady. The final chapters about civic responsibility and public service were honesty and of particular interest to me given our current political situation. I highly recommend this book."}, {"userName": "Kayla", "userReviewDate": "Jun 01, 2018", "userURL": "http://www.goodreads.com/user/show/23942385-kayla", "userReview": "I really enjoyed the beginning of this book, but at least half felt less relevant and even boring, which is unfortunate. There was definitely some class differences- she was talking about knowing what you want when your decorator comes or how sometimes the parties she went to were really dull. I’ll turn on my highlights when I get the chance, because there really were some great parts in the beginning."}, {"userName": "Megan Helmer", "userReviewDate": "Feb 10, 2018", "userURL": "http://www.goodreads.com/user/show/49893255-megan-helmer", "userReview": "3.5 Stars - she wrote this in 1960 so yes, it’s simple but it’s also written in a very timeless manner. All of these principles can easily be applied to life and society today and I appreciated that."}], "description": "Mrs. Roosevelt expresses her philosophy of life by relating the experiences which have enabled her to cope with personal and public responsibilities.", "title": "You Learn by Living: Eleven Keys for a More Fulfilling Life", "url": "http://www.goodreads.com/book/show/78509.You_Learn_by_Living", "average": 3.98, "cover": "https://images.gr-assets.com/books/1388185133l/78509.jpg", "reviews": 294, "authors": [{"url": "https://www.goodreads.com/author/show/44566.Eleanor_Roosevelt", "name": "Eleanor Roosevelt"}], "type": ["Nonfiction", "Self Help", "Autobiography", "Biography"], "outlinks": ["http://www.goodreads.com/book/show/78509.You_Learn_by_Living", "http://www.goodreads.com/book/show/10871744-you-learn-by-living", "http://www.goodreads.com/book/show/9945956-you-learn-by-living", "http://www.goodreads.com/book/show/11800163-you-learn-by-living", "http://www.goodreads.com/book/show/78510.The_Autobiography_of_Eleanor_Roosevelt", "http://www.goodreads.com/book/show/86015.My_Day", "http://www.goodreads.com/book/show/947642.This_I_Remember", "http://www.goodreads.com/book/show/723667.Tomorrow_Is_Now", "http://www.goodreads.com/book/show/5301304-this-is-my-story"]}