{"ratings": 41, "userreviews": [{"userName": "chucklesthescot", "userReviewDate": "Sep 20, 2014", "userURL": "http://www.goodreads.com/user/show/3426724-chucklesthescot", "userReview": "At a hockey training day for kids, a group of zombies shamble in and start attacking people. Katie, her kids, their coach Robbie and her friend Carolyn flee the rink and head for the safety of Katie's home on an island in the lake nearby, connected to the mainland by a bridge. The community agree to take in fleeing people as long as they are medically checked for bites then quarantined if they are infected. As law and order on the mainland breaks down and Canada becomes infected, it is time to disconnect the bridge, just as the zombies come pouring towards them...I first read this short story free on Smashwords and I liked it. The main characters of Katie and Michael, their friend Carolyn and coach Robbie are all interesting and you like them straight away, which is great because some zombie books have dreadful characters that I just want to see eaten! In this case, you want everyone to survive. It starts with a bang as the zombies attack the rink then we get the preperations to protect those on the island and the news coming from the outside world. The tension really increases when they decide to disconnect the swing bridge, putting our MCs out on the bridge as the zombies suddenly appear. It was edge of the seat stuff, tension filled and the action was well written.My original review indicated that my one issue was that the main books in the Zombie Crusade series didn't seem to feature the islanders and I so wanted to see what happened to them! Since I wrote the first version of this review I have been kindly contacted by the authors who have assured me that the Canadians feature later in the actual full book series, which is great news and I appreciated them taking the time to get in touch about it. I have now read the first book in this series which I very much enjoyed and there is a link to the characters in this book. In this short story we discover that Michael, Katie's husband, has a prepper uncle in Cleveland and he is to be joined by Michael's cousin Christy and her boyfriend. The boyfriend is not named, but he is David, brother of the MC in the first book in the series. So now I see the link to the Canadians from the characters in the first full length Zombie Crusade book, which is nice. Reading this again and knowing that we do find out what happens to these people later in the series made me enjoy reading this even more second time round, and I look forward to the rest of the series."}, {"userName": "Gretel", "userReviewDate": "Sep 29, 2016", "userURL": "http://www.goodreads.com/user/show/44538896-gretel", "userReview": "I have to admit, for me, both the best and worst part of this story was hearing about characters from other books who I already knew didn't make it..."}, {"userName": "Randy Harmelink", "userReviewDate": "Aug 26, 2013", "userURL": "http://www.goodreads.com/user/show/2029520-randy-harmelink", "userReview": "A good short story (i.e. \"snapshot\") of the zombie apocalypse in one location. I look forward to reading other books in the series.However, I got the book on a free promotion. Otherwise, I would not pay $0.99 for a 34-page eBook. That may keep me from buying other books in the series, if they are similarly priced."}], "description": "When an unknown virus that turns humans into flesh-eating zombies begins to spread, a small island community in Lake Huron offers a potential refuge from the unfolding apocalypse. Isolation, organization, and cooperation are difficult to maintain, so survivors also need to learn how to defend themselves against a horrific enemy that can survive seemingly fatal wounds.Zombie Crusade Snapshots are quick glimpses of critical locations around the world as the zombie pandemic detailed in the Zombie Crusade series begins to unfold. While the snapshots connect to the main storyline of the novels (some in obvious ways, others in ways that will become more apparent as the series continues), they may also be read as stand-alone novellas.", "title": "Zombie Crusade: Snapshot Ontario\n      \n          (Zombie Crusade)", "url": "http://www.goodreads.com/book/show/18375586-zombie-crusade", "average": 4.24, "cover": "https://images.gr-assets.com/books/1379126755l/18375586.jpg", "reviews": 3, "authors": [{"url": "https://www.goodreads.com/author/show/6573552.J_W_Vohs", "name": "J.W. Vohs"}], "type": ["Horror", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/18375586-zombie-crusade", "http://www.goodreads.com/book/show/18487217-zombie-crusade", "http://www.goodreads.com/book/show/18904528-david-s-journey", "http://www.goodreads.com/book/show/21901430-eastern-front", "http://www.goodreads.com/book/show/18158498-evolution", "http://www.goodreads.com/book/show/25197091-winter-apocalypse"]}