{"ratings": 1077, "userreviews": [{"userName": "Jessa", "userReviewDate": "May 02, 2012", "userURL": "http://www.goodreads.com/user/show/3199617-jessa", "userReview": "[the main character of the final third unbelievable and disgusting. First of all, I do *NOT* believe for a second that any woman, very shortly after she was raped, would say (about her boyfriend who was just killed, no less)\"Only, if you want the truth, he wasn't exactly my type. For one, he was a bit too gentle and I like to know my lover is there. Know what I mean?\" I am sorry, but I found this completely offensive and repulsive. And this is truly only the start of how miserable, cold and uncaring this character is. She repeatedly speaks of him in a not very kind or loving way, when he treated her so well and they seemed to really care about each other. She is selfish and not at all likable in the least. And it is not one of those \"love to hate\" characters, it's an \"I REALLY F'ING HATE YOU, I HOPE YOUR CHARACTER IS ATTACKED BY A ZOMBIE SOON SO I CAN SURVIVE THE REST OF THIS BOOK WITHOUT THROWING MY KINDLE\". Yes, the caps were a necessity too. To be honest, I have never in my life read a book where I hated the main character this much. Truly. The problem was that the first 2/3 of the book was told from the point of a view of a character I liked - but then he is turned into a zombie and kills himself - at which point this sociopath takes over. I found other things about her just absurd. And first let me say in advance I am by no means a prude, but the impracticality, selfishness and irresponsibility of the statement below irked me.Meredith says \"Without a man, each of us would like to find a suitable 'replacement' of the battery operated variety...while it may seem selfish, and even a bit careless, we've decided that, while the World may be dead, we are very much alive.\" Okay, seriously? I have to say that if I was seeing people I cared about murdered left and right and going on scavenging hunts was very dangerous and often resulted in *at least* one person dying, I would not be making masturbating with sex toys a priority, nor would I waste precious batteries on this. I am sure there are suitable alternatives that won't endanger your entire group and waste your precious resources! I seriously doubt it is worth losing one of your crew so you can get off. I don't know if this was some fantasy thing for the author, or what, but I found it absolutely, laughably ridiculous. This is only a small taste of what made me wonder why I tortured myself through the final third. There were so many other examples like the above, it was hard to choose just 2! It's unfortunate we had to lose the voice of the first 2/3; I liked him. I can say with certainty that I will not be reading any sequels and I think that is a first for me. It's really too bad. (hide spoiler)]"}, {"userName": "Mandy White", "userReviewDate": "Apr 02, 2012", "userURL": "http://www.goodreads.com/user/show/5315107-mandy-white", "userReview": "A Well Thought Out Zombie Adventure!This first-person memoir-style account of a zombie apocalypse grabbed me right from the beginning and held my interest throughout the story. I thought it was very well thought out on the author's part because the story covered several angles of the zombie scenario that other zombie novels I've read have overlooked. This book addresses the many possible dangers a survivor might have to overcome in a post-apocalyptic world – bringing to light the fact that zombies might not be the only thing to fear. One thing I particularly liked was the survivors' use of deuce and a half army trucks to navigate the harsh terrain. My husband owns one of those trucks and it's true – they can go practically anywhere! The ideal vehicle for the zombie apocalypse!I did feel the story begin to lag a little toward the end, when it seemed that the characters were repeating some of the same actions over and over, just with new players added as old ones were killed off. However, I suppose that if the situation were real, it might play out very much like that. The other minor thing I had to get past was wondering how the main character managed to keep his journal running in so much detail even when he was fighting or running for his life. I kept in mind that it is fiction, written for entertainment and just went with the story, so it didn't interfere with my enjoyment of the book at all. Zomblog whetted my appetite for more exciting zombie-filled adventures from this author. I'm currently reading Dead: The Ugly Beginning by T.W. Brown and Zomblog 2 is in the near future."}, {"userName": "MommyDearest", "userReviewDate": "Dec 31, 2012", "userURL": "http://www.goodreads.com/user/show/10513424-mommydearest", "userReview": "The book started off okay. I liked Sam well enough. Lots of zombie action. Lots of people action, maybe just a tad to much. So many characters. It was difficult to keep up with them all. When I got to the part about Sam and Meredith hooking up I couldn't remember her introduction into the story. It was a difficult transition for me to go from Sam to Meredith. I liked Sam and disliked Meredith a lot. You go from them seeing each other, deciding to move in together and adopting Joey (with Sam's POV).Merediths POV is cold. It's like Sams dead, oh well. Joey is forgotten about. I understand in a zombie story you lose people but normally the ones that have lost someone actually care.I didn't dislike the book totally but after Sam died it pretty much ended the story for me.Forgot to add I did like the part of the zombies making a sound like a baby crying. I thought that was a cool angle."}, {"userName": "Jason", "userReviewDate": "Mar 15, 2012", "userURL": "http://www.goodreads.com/user/show/5828385-jason", "userReview": "3 stars can be a bit deceiving. I didn't think this was bad...just not very innovative in the genre. There wasn't much here that I felt I hadn't already read elsewhere. The biggest issue I had with this story was that it rolled through characters so quickly that I could barely keep up. However, the most frustrating aspect of quick and frequent cast turnover is that this is likely the MOST indicative of how the story in a zombie apocalypse would play out. Not many start to finish heroes. This, while frustrating for me, lent credibility to the story that many other zombie novels lack. It wasn't my favorite but it was good enough to convince me that I'd like to come back for the sequel."}, {"userName": "Patrick D'Orazio", "userReviewDate": "Nov 05, 2010", "userURL": "http://www.goodreads.com/user/show/4328815-patrick-d-orazio", "userReview": "TW Brown has created a very readible book in diary form about the first nine months of the zombie apocalypse. Our writer is Sam Todd, who is an every day guy who decides he will start a blog to document what is going on in his life and it just so happens that he starts writing it a few days before the start of a plague that sweeps the world where the dead begin rising up to destroy the living. The pace is swift, with each day passing at a clip of about a page each. Sam goes on the run fairly early in the book and almost never stops, taking breaks along the way at different safe havens, but determined to find a place that he doesn't feel locked in and kept from the outside world, where both the hordes of zombies and the savage living lurk around every corner. The action is intense and you barely get the chance to catch your breath. I won't reveal something that happens more than halfway through the book, but suffice it to say, there are some genuine surprises in store for the reader. I though the author did a nice job of switching things up on us and taking the story in a different direction. Not what I expected. Since this is a journal entry type of story there is no dialogue and we are given a synopsis of events for each day. Some readers might consider this a weakness if they are not a fan of that type of writing but I believe the author does a good job of revealing things in a way that makes each entry compelling. Of course, the tough part is that since we are living inside the narrator's head and they are writing these entries at the end of each day, we are often given a sentence or two at the beginning of many entries that gives us a synopsis of the day (or at least hints at one) and then gives us all the details. In other words, some of the suspense is gone because we at least have a hint at who has died or what had taken place (although I will note that the author does a good job of surprising the reader on that account as well and not revealing too much in the synopsis at the beginning of the entries for the most part). That is perhaps what makes this type of book tricky to pull off sometimes. We are not \"in the moment\" as it were, we are getting the blow by blow after the fact. Still, I think the author did a very good job using this writing style to its fullest potential. Something I really liked with this book was the author's use of geography and really mapping out a multi-state environment. The characters are constantly on the move, constantly facing new dangers, new challenges, and again, the reader never really has much of a chance to settle in or expect things to slow down. We get mountains and rivers and a lot of excellent descriptions of the northwestern environment. For someone who has never traveled in that region, the author really showcases the area. No one is safe in this book, the body count is high, and its clear that the writer is directing both his zombie horde and the vicious survivors who our main character comes up against with merciless efficiency here. For fans of zombie fiction this is a nice addition to your library. The pacing is good and the action is intense. I am looking forward to the sequel to find out what happens next to the narrator."}, {"userName": "Dana", "userReviewDate": "Jan 15, 2012", "userURL": "http://www.goodreads.com/user/show/919130-dana", "userReview": "Really enjoyed the first quarter of this book or so, but then really lost interest about a quarter of the way through. I stuck with it because I thought it might get to more of a point - what is the main character trying to accomplish, what caused the zombies, what does the future hold for society - but this entire book was just a repeat of dude runs from zombies, finds a group of people, hangs out with them for a while, leaves, runs from more zombies - repeat repeat repeat. Oh no, now he's a zombie - here I thought it might get interesting - a zombie writing a blog - but no, some chick picks up the book and more of the same.I mean, I guess I can't hope for that much other than slash and gore from a free zombie book. But definitely wouldn't recommend this one."}, {"userName": "Rick", "userReviewDate": "Mar 11, 2012", "userURL": "http://www.goodreads.com/user/show/351284-rick", "userReview": "It started a bit slow, but picked up after the first chapter or so. There were some great twists and turns in the book, however it did end abruptly. I will look for the sequel."}, {"userName": "Nikki \"The Crazie Betty\" V.", "userReviewDate": "Aug 24, 2012", "userURL": "http://www.goodreads.com/user/show/2616607-nikki-the-crazie-betty-v", "userReview": "I actually was really surprised by how much I enjoyed this read. When the story first started I thought I was going to get really sick of the blog style writing really quick. Fortunately the action starts right away and the diary style writing actually becomes quite interesting. I felt so bad for Sam that first little while when no one knew what was going on yet, I can't imagine that feeling of just no knowing anything! Sam turned out to be a very smart and dynamic character who grew and developed throughout the story. Character development is an absolute must for me in my reading material and this did not disappoint.I really appreciated the author's willingness to dig deep down into the bowels of human depravity, something that many zombie novels try to cover by just being overly gory. Don't get me wrong, I absolutely love gore, especially in my zombie reading material but there's a time and place for it within any story and I really liked the combination of absolute horror and human redemption that is offered in this story.Please be aware that this story does change POV. Personally, I liked the change. I know there are many reviewers who didn't appreciate it but I really liked Meredith's character and thought she brought a completely different type of survivor viewpoint from that of Sam. Almost opposite actually. I have read quite a few reviews from readers who both loved and hated Meredith for how she could be so cold sometimes and make it seem like she's doing something for the benefit of the group even though it's actually for her. The only thing I have to say about that is this:IT'S THE FREAKIN ZOMBIE APOCALYPSE PEOPLE! If you're not out to take care of yourself above anyone else, you're going to die. Deal with it. Don't get me wrong, I have plenty of family and friends that I would do my best to save in a situation like that but if it came down to all of them being gone and the only family I have left is a band of people who started out as strangers and are just trying to survive; then you can better believe I'm only going to be with them for as long as I think it's going to benefit me and further my survival. No room for heroics and martyrs in a dystopian future.On a side note: There is one part of this story where our band of survivors break into a building in a small town. 3 stories tall, 2nd story only has tall thin windows, inside there are rooms with mirrors on both sides; for those of you who don't pick up on this, the author is referencing an LDS Temple. What a sad scene. I understand that in that kind of event the first place some want to be is where they worship their God but God isn't in a building and what a sad way to see so many God loving/fearing individuals die in hopes that their God will save them because of the building they are in. I guess in the end everyone needs to find their own shelter. Even if it's shelter in death knowing the place you died was the place you worshiped the creator you are now going to meet. (I am not an atheist, nor do I hold any religious affiliations, this was merely an observation).One negative thing about this e-book was that about half way through the formatting was messed up and the different \"chapters\" were suddenly right on top of each other and everything was in bold font, not just the chapter headings. Nothing that kept me from enjoying the overall story line and really just a minor formatting error. It did take me out of the story for a minute while I tried to get my bearings around the new format but it didn't take long to get back into the flow of the story. It does go back to it's original format, however, after a while.I will definitely be reading the other books in this series, especially with how this one ends."}, {"userName": "Nicole Storey", "userReviewDate": "Dec 23, 2011", "userURL": "http://www.goodreads.com/user/show/6157333-nicole-storey", "userReview": "I have read other books in the past that were written in a blog-diary form. Some were interesting enough to keep me reading, but most fell flat. It is almost impossible to to write in the first person AND give engaging details that are in the past tense in a diary form. Something is always lacking, whether it be character detail, descriptions, or not enough information. However, as Brown is one of my favorite authors, I had to take the chance. You guessed it, I was not disappointed at all!Brown just has that gift. He can tell a story, even in a blog format, and make it seem real. His characters could be anyone that you know. The main character in this story, Sam, is just a paper-delivery man who has an ex-wife and a teenage daughter … oh, and a band. He isn’t anything extraordinary. He has no special powers; he can’t shoot electric bolts from his fingertips or move things with his mind. One of the things that I love about the books I have read from this author is that he can take a zombie book and turn it into something other than a “zombie book”! The walking dead definitely take a back seat in his stories and the main characters are the living, breathing type that you either learn to love or hate (sometimes both)!I read Brown’s DEAD series before I started the Zomblog series. I have been told that this book was his first attempt at writing zombie literature. I noticed a general theme in the DEAD series and I often wandered if it was only in those books, or if it was one that was carried over from his previous works. I see now that it is. That theme is that even though the zombies caused the breakdown of life as it was known, THEY are not the real problem. The zombies are really not to blame for most of the problems that his characters encounter. The zombies are not the “monsters”. In his books, the real boogeymen that leave the reader thinking long and hard after reading his books are human beings. It is amazing how people can change once there are no more rules and no one to carry out the laws of the land. What they can do to one another is much more scary than a wandering zombie, or even a hoard of them!For anyone who says that they don’t like horror stories, I encourage you to at least try TW Brown’s books. Trust me, the main focus is not the zombies and Brown will tell you that himself. He goes beyond the blood and gore and gives his readers stories with morals and life lessons. He gives them characters that change and grow and become something more than just people trying to make it in a dystopian world. You know, an apocalypse could be caused by many things: nature, medical science, and wars just to name a few. How would we react in a situation where there is no more millitary, policemen to keep us safe, electricity, clean water, or food? Would you stay the same person as you are now or would you become something more? Something less? These are just some of the questions and situations that the author delves into in his books. Trust me, I should know. So far, I’ve read all of them and I am patiently (okay, maybe not patiently) awaiting his fourth book in the DEAD series! If you do decide to take a chance on one of Mr. Brown’s books, please leave me a comment and let me know what you thought! I just love it when readers prove me right! LOL!"}, {"userName": "Jady Arewar", "userReviewDate": "Jan 14, 2013", "userURL": "http://www.goodreads.com/user/show/7501959-jady-arewar", "userReview": "This book is just terrible, and it takes a lot for me to just blatantly say that as there are virtually no books that I can just dismiss like this. It's not necessarily because of the writing or the characters, but the entire style that the book is in.Now that said, the writing itself is not impressive. It reads to me very much as fan fiction, with awkward words and phrases and poorly thought out passages, no plot development and no character development.The characters aren't interesting either. Some of that can be attributed to no single character besides the narrator exists in the book for more than a couple chapters. The second being that it's impossible to get connected to any character that reads like a mixture of a teenager and someone disconnected from reality or is telling a story third-hand.The entire style of the book completely makes all the content dis-interesting. I'm not against a dairy-style, but this seems to be done incredibly poorly. Every event is told as if it happened to someone else. There's no passion, no interest, horrifying things are just generically described as horrifying, no effort and no details in 'major' events. Frankly, it's just boring, which is shocking because of how fast-paced the book is, but that just makes it even more boring because you can't become attached to any other character.There's no actual substance to the book. The reader is jumped from one place to another, with no actual goal in mind and no character to watch develop. (There is absolutely no development in the main character at all.) The story literally is just a cycle of find group, find zombies, leave group and repeat. The style of a blog is not a reason to sacrifice character development and a lack of overall plot. Overall, I understand that the plot is just simply a guy's survival, but frankly that is not interesting. They teach these things in elementary school - start, rising action, climax, falling action and resolution. The book seems stuck at the very start - zombie outbreak.The only redeeming thing this book does have is a fairly strong (though awkwardly written) opening that suggests a strong story, but it just didn't deliver."}, {"userName": "Chantal Boudreau", "userReviewDate": "Feb 19, 2011", "userURL": "http://www.goodreads.com/user/show/4771186-chantal-boudreau", "userReview": "One of the commandments pushed by publishers and agents nowadays, that I hate as a reader, is the “thou must start thy book with an action scene”. With a few exceptions, I think this is absurd. I like to get to know the characters a bit, and get a good view of the setting for the story before I get thrown into the middle of the action. That’s not “gripping” to me, or a “hook”, it’s just meaningless chaos. That’s why I liked the intro to this book. You get to know the protagonist, Samuel, as a human being, like he could be your co-worker or your neighbour, before you are launched into the fray and considering it’s his tale, that’s incredibly important. You get some insight as to how he relates to his family and his outlook on the world in general.Another thing I liked about this book is the depth of character displayed by even lesser characters. In other zombie stories, you’ll often see people lose what they are as the story progresses, giving in to their desperation and becoming too flawed to be likable. The characters in this book are also flawed, something necessary for realism, but still retain positive qualities and struggle to hold onto their humanity, despite their circumstances. Their shared troubles even prove to be a unifying experience for people who would have otherwise avoided one another. Some of the more tragic characters, like little Joey, will absolutely rip your heart out.Not that there wasn’t gore or tense moments in the book. There were plenty of those – I would think enough to satisfy any die-hard zombie fan, but the factor I look for the most is the human component, the elements that make me really connect to the story and make it real for me. The characters were engaging, the plot was moving and the description was vivid. Nothing about the book was forced either. The narrative flowed smoothly and the dialogue was believable.Finally, while I won’t offer any spoilers, there was a twist to the plot about two thirds of the way through the book that caught me way off guard. It’s difficult to surprise me, and this was completely unexpected, so I have to award kudos for that as well."}, {"userName": "BigJohn", "userReviewDate": "Mar 01, 2013", "userURL": "http://www.goodreads.com/user/show/4845311-bigjohn", "userReview": "Zomblog is a story about a youngish man who starts a blog at the beginning of a zombie apocalypse. The blog itself is a neat idea for conveying the information of what is happening - and it works very well at the early stages of the outbreak as a means for illlustrating how confusing and scary the world is quickly becoming. But the conceit of the blog wears pretty thin, pretty quickly. It probably would be the same as someone keeping a diary, but who really does that anymore? That the world quickly devolves and there seem to be few sources of power don't seem to matter in this super-charged battery that powers the laptop used to write the blog.At some point, the protagonist is captured! But somehow, he is still able to blog about it. I guess they didn't take his laptop? Confusing.There's some pretty interesting buildup in the story as the protagonist, Sam, moves from place to place trying to find...something. Safety. Community. Who knows what he's looking for. He's on the move, and it is his movements that provide the impetus for his adventures and corresponding blog entries.And where does the story end up? I don't know, because it just abruptly ends. I was getting to the end of the book when I found myself wondering, \"where is this going? What are they trying to do?\" There are no answers - at least not in this book. You have to get Zomblog II and Zomblog: The Final Entry to find out what happens. To say this story is incomplete is pretty generous. I'm not a big fan of incomplete stories in trilogies, as this seems to be.The adventures that are documented are pretty typical for zombie stories, including lost innocents, lost innocence, mean people, and weird government. It's exciting at first, but then gets pretty old pretty quick. There is a nice rotating in of new characters, though, but they're thinly developed and they don't last long. I never really attached myself to anyone but Sam, even after a pretty monumental shift in focus (which, I admit, is very clever and was a great surprise).I won't be continuing reading the sequels to this story. I was too frustrated at the abrupt ending."}, {"userName": "Brian Switzer", "userReviewDate": "Mar 21, 2015", "userURL": "http://www.goodreads.com/user/show/33294345-brian-switzer", "userReview": "I picked up Zomblog with huge expectations. I had just finished the author's other zombie series, 'Dead'. 'Dead' wasn't only the best series I've read in the genre but one of the best series period.Unfortunately, I didn't enjoy Zomblog. It seemed rushed and confused- I often didn't remember who a character was or where the scene was taking place. Whereas 'Dead' had several characters that were bigger than life, most of the Zomblog folks were unlikeable. Most of the women in the book were particularly unlikeable and/or unbelievable. Melanie was gang-raped repeatedly. A short time later she was complaining that the sex she was getting wasn't rough enough. She lost a man she was in a relationship with, causing her to be unable to foster a child the two were going to foster together. When she thought of the man after that it was usually in a negative light, and she never thought of the child again. Snoe had a bad habit of shooting the people in her group in the back of their heads immediately after they were bitten. No warning, no final words or thought, no goodbyes, no going out on your own terms. Just- 'You were bitten on the arm?' 'BLAM!'And finally, the choice Melanie has to make in he book's final scene. I'm pretty sure 100% of womanhood what make the opposite choice from the one she made.My admiration for TW Brown isn't diminished. I'm going to dive into volume two and hope it's more like 'Dead'."}, {"userName": "Emma Mills", "userReviewDate": "Apr 05, 2012", "userURL": "http://www.goodreads.com/user/show/6980689-emma-mills", "userReview": "I haven't read a zombie book before but this sounded fun and as a free download I didn't have anything to loose so I gave it a go. As I haven't read any other zombie books I can't compare but the blog/diary format worked well and I liked the fact that it was narrated by two characters - first a man then a woman, although I had trouble liking and understanding the woman!The zombie part of it was pretty much exactly what I would expect, and scenes straight from 'Dawn of the Dead' came to mind several times...but then again that is what would happen isn't it! So while the zombie action was predictable it was I imagine accurate. I found the take on the fall of society more interesting...and believable. Very scary. Quite gorey with some sweet redemptive moments. I think I'll download the seuel as soon as I have a space in my current reading pile."}, {"userName": "Eileen Saunders", "userReviewDate": "May 21, 2012", "userURL": "http://www.goodreads.com/user/show/6949727-eileen-saunders", "userReview": "I chose to read this because of the zombie theme which is currently hot. The book is supposed to be a blog or more like a diary of what happened day to day in the life of a guy living through a zombie attack which started as a virus. He lost his family and has to fend for himself while meeting other non-zombies. I never finished it because it got boring. Day after day was the same thing and the book lost the \"blog\" aspect of it because there was no electricity in town to support a laptop which the main character didn't seem to carry with him anyway. It was a first person, play-by-play account of his daily activities. I lost interest."}, {"userName": "R.", "userReviewDate": "Jan 21, 2012", "userURL": "http://www.goodreads.com/user/show/6465977-r", "userReview": "Oddly enough, in my mind anyway, I flew through this book. It was a free read, which doesn't mean a lot, but I never come at freebies with high expectations. It was also about Zombies and I've never really read a book that deals pretty much entirely with becoming, killing, hiding from, smashing, driving over, becoming (did I say that already)...Zombies. I really enjoyed the blog style of the story and the couple of voices involved in the writing. It sounds like there is or will be a next book in this series and I'll look forward to reading it as well."}, {"userName": "Bobby Cooper", "userReviewDate": "Jun 03, 2012", "userURL": "http://www.goodreads.com/user/show/6735164-bobby-cooper", "userReview": "T W Browns Zomblog was a real pageturner. Wrote as a blog type journal in the first pov, it is like Day by Day Armegedon. With that being said, Brown took that concept and made it his own. The thing I loved about Zomblog was the characters. Real people!! No underground Superstructure for safety,and no Huge aersonal of weapons. A realistic approach to survival leaving me rethinking the whole dbda thing!! Brown is a writer with some serious skills. Read this!! This is a story that demands being read!! Ive read tons of zombie/pa books,and this book is one that stands out from them !!"}, {"userName": "Selinalynn", "userReviewDate": "Apr 11, 2012", "userURL": "http://www.goodreads.com/user/show/4330920-selinalynn", "userReview": "This book reads like a journal/blog and is a first person account of how the world came to be during and after the zombies came. You get to see how different groups try to survive in a world without laws. T.W.Brown covers all types of groups and people. I liked how he didn't shy away from the more disturbing ideas. I really liked the book and continued to read the whole series which didn't disappoint."}, {"userName": "Bridget", "userReviewDate": "Jan 15, 2012", "userURL": "http://www.goodreads.com/user/show/7021198-bridget", "userReview": "I started reading a preview of this book out of curiousity and couldn't stop. Zombies freak me out, so I really have to give myself a break before the next one in the series (but couldn't help but to read the first chapter of book two on amazon). It's written as a blog and I got wrapped up in the story like I would with a friend telling me about an on-going saga in their life. I don't think I'd say it was an awesome book, but I had a hard time putting it down."}, {"userName": "Corinne", "userReviewDate": "Feb 05, 2012", "userURL": "http://www.goodreads.com/user/show/3105450-corinne", "userReview": "Bizarre little story, but somewhat compelling nonetheless. The characters ran the gamut from charming to likeable to boring to reprehensible, which is to say I was compelled to really pay attention to each one & learn what they had to offer in the storyline.While entering this book here at Goodreads, I believe I spotted \"Zomblog II\", so I'm off to investigate. :)"}, {"userName": "Krista Hensley", "userReviewDate": "Jan 01, 2013", "userURL": "http://www.goodreads.com/user/show/15983037-krista-hensley", "userReview": "Starts out pretty slow, but then it dragged me in so I wanted to finish it. I felt a little like I was reading another version of The Walking Dead from another survivors group perspective. It wasn't mind blowing but kept me interested enough to maybe want to pick up on Book 2 and see what happens next."}, {"userName": "Jaime", "userReviewDate": "Feb 05, 2012", "userURL": "http://www.goodreads.com/user/show/7235231-jaime", "userReview": "It was like reading a long run on sentence. Dark, depressing and so many characters come in and out (they die!) that I couldn't keep them all straight. I can't believe I wasted my time on this one. :( But heck it was free......"}, {"userName": "Amy", "userReviewDate": "Jan 23, 2012", "userURL": "http://www.goodreads.com/user/show/4910711-amy", "userReview": "Very graphic, action packed, and enjoyable. it was fun, and a very different way to read a book, since it's supposed to be a 'blog' of sorts. The description was just enough to know how gross, scary, and just downright nasty. :) I've already downloaded and started the second one!"}, {"userName": "Orlaith", "userReviewDate": "Mar 09, 2012", "userURL": "http://www.goodreads.com/user/show/5895545-orlaith", "userReview": "One of the most realistic zombie books I've ever read. I think it had a great grasp on how humans can be just as scary as roving bands of zombies, and I thought the journal format really benefited the story."}, {"userName": "Katrina", "userReviewDate": "Feb 04, 2012", "userURL": "http://www.goodreads.com/user/show/7307782-katrina", "userReview": "Three quarters into the book I didn't like the character anymore. It's a never-ending book of unfamiliar characters because they always die and there's no end in site."}, {"userName": "J.j.", "userReviewDate": "Mar 08, 2012", "userURL": "http://www.goodreads.com/user/show/3001606-j-j", "userReview": "I feel like the blog format was just a way to cover up sub-par writing and lack of characterizations. Characters came and went so fast, I couldn't keep up with who I was even supposed to care about."}, {"userName": "Trish Bodine", "userReviewDate": "Mar 10, 2012", "userURL": "http://www.goodreads.com/user/show/3300027-trish-bodine", "userReview": "Pretty good book. Realistic and not too far fetched. Ending left me wanting more."}, {"userName": "Andreea R", "userReviewDate": "Jan 06, 2018", "userURL": "http://www.goodreads.com/user/show/5468820-andreea-r", "userReview": "I've read this sometime back as a Kindle book, still have it on my cloud reader. It had a promotion some 4, maybe 5 weeks back.Allow me to make a short introduction before the actual review.I love zombie stories, zombie movies, zombie anything. Probably my first ones were the \"Resident Evil\" series and \"World War Z\", continued with a whole bunch of nonsense books and finally, this one. I usually can't be bothered to write reviews, unless I feel strongly about a book, and for this one, I do, because it has impressed me.The zombie/post apocalyptic niche in books is huge. So many authors out there are trying to take advantage of this \"money making\" possibility, as the public interest in zombie anything, is BIG.However many of the books available on the market are pretty much the same: all was fine and dandy, virus came, bunch of gory scenes where people get eaten, no hope for salvation, the end. People will notice that a lot of these books do not put much accent on anything else but the gore and the zombies, they give little insight on the world, the people, the feelings, the struggles. That is why Zomblog is different.Samuel Todd is not a military man, he's not in Special Forces, he's not some over-the-top strong and handsome guy caught up in the Apocalypse, he's not a trained anything. Samuel Todd is just an ordinary guy, like you and me, a paper delivery guy, divorced with one daughter, that lives his day by day live as any one of us and he keeps a journal.What is special about this book is TW Brown's insight in the after-world, the world after the outbreak: the fight to survive.Through Sam's eyes and writings we get an intimate knowledge of the disaster, the fear, the pain, the struggles, the hopelessness, the resignation.The most shocking and enthralling aspect of the book are not so much the zombies, but the decline of the humanity.That is what chilled me the most. That's what makes this so scary: to see through Sam's perspective the decay of the world as we knew it, the death of humanity as we knew it, the absence of morals, good faith and hope.Indeed, in Sam's zombie filled world, the last thing anyone should worry about are the zombies, because the humans that are left to roam the world, are much worse. In the absence of any type of laws, structure and order, people become beasts.I would recommend this book to anyone that loves the zombie genre and I would place this novel at the top of my preferences when it comes to zombie books."}, {"userName": "Laura Marcus", "userReviewDate": "Nov 17, 2017", "userURL": "http://www.goodreads.com/user/show/44007893-laura-marcus", "userReview": "not my kind of book, but I couldn't stop reading it. it was intense a good read."}, {"userName": "Ami", "userReviewDate": "Mar 18, 2017", "userURL": "http://www.goodreads.com/user/show/9186573-ami", "userReview": "Well written with excellent character building. This book is fast-paced with almost constant action. I had some doubts about the format. Journals often mean a lot of the information I want is omitted. This is far from the truth about Zomblog, T. W. Brown has great skill in writing but more than that he knows exactly how to grab your attention and keep it for hours at a time. There were a few slow moments but it gave me a chance to catch my breath. I still did not want to put it down. I already have the next two books. Hopefully, you will enjoy it as much as I did. Thank you Mr Brown for a heart pounding story."}], "description": "Samuel Todd is a regular guy: ...Failed husband... ...Loving father... ...Dutiful worker... ...Aspiring rockstar. He had no idea if anyone would care, or take the time, to read his daily blog entries about his late night observations. But what started as an open monologue of his day-to-day life became a running journal of the firsthand account detailing the rising of the dead and the downfall and", "title": "Zomblog\n      \n          (Zomblog #1)", "url": "http://www.goodreads.com/book/show/8169538-zomblog", "average": 3.69, "cover": "https://images.gr-assets.com/books/1328311765l/8169538.jpg", "reviews": 115, "authors": [{"url": "https://www.goodreads.com/author/show/3355188.T_W_Brown", "name": "T.W. Brown"}], "type": ["Horror", "Horror", "Fiction", "Science Fiction", "Apocalyptic"], "outlinks": ["http://www.goodreads.com/book/show/8169538-zomblog", "http://www.goodreads.com/book/show/7674888-zomblog", "http://www.goodreads.com/book/show/8145882-the-ugly-beginning", "http://www.goodreads.com/book/show/14741593-winter", "http://www.goodreads.com/book/show/12549168-dead", "http://www.goodreads.com/book/show/23025375-zomblog-saga-box-set", "http://www.goodreads.com/book/show/18038826-confrontation", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}