{"ratings": 60849, "userreviews": [{"userName": "Shelby *trains flying monkeys*", "userReviewDate": "Jan 04, 2015", "userURL": "http://www.goodreads.com/user/show/1053760-shelby-trains-flying-monkeys", "userReview": "[\n\n(hide spoiler)]"}, {"userName": "Alejandro", "userReviewDate": "Feb 17, 2015", "userURL": "http://www.goodreads.com/user/show/665584-alejandro", "userReview": "The world we knew is gone......now we live in the world of The Waking Dead!!!\nThis is the first volume of “Compendium Edition” of The Walking Dead, collecting the comic book issue from #1 to #48 (including the Christmas Special story). This is equivalent to the first 8 regular Trade Paperbacks of the comic book series.My general rating is an average result of the sum of the ratings of each chapter in the collected edition.Creative Team:Writer: Robert KirkmanIllustrators: Tony Moore (Chapter One) & Charlie Adlard (Chapters Two to Eight)Additional gray tones to inking: Tony Moore (Chapter One) & Cliff Rathburn (Chapters Two to Eight)Chapter One\nDAYS GONE BYE\nRating: ***** ( 5 stars )\nRick... Officer Rick Grimes at your service.\nThis chapter is the epic beginning of the mega popular franchise of The Walking Dead that first was comic books, then expanded to a TV series and now there are even prose novels.This first chapter has the great artwork by Tony Moore that certainly made it iconic. The work of Charlie Adlard in the rest of chapters is really good too, specially on the details of things and backgrounds, but definitely if I’d be able to choose, my pick would be on Tony Moore, it was sad that he won’t keep doing the illustrations on the rest of the comic book series. As additional info, Tony Moore remained in the creative team for a while doing the covers of the first twenty-four issues and the covers of the first four regular TPBs.A good thing about The Walking Dead, if you want to enjoy it in comic books along with TV series is that both storylines are different, sure there will be connecting points here and there, and you will meet the same names of characters (in some cases) but they aren’t the same persons, and trust me, while this is my first compendium in the comic book’s storyline, I have been watching the TV series since its own beginning, and both stories are different, both truly great, but different, so don’t afraid of spoilers in any of both formats, since the events are developed quite different. You may think of the “other storyline” of any format, comic books or TV series, as “the road not taken”. But truly loyal to the spirit of the franchise.Officer Rick Grimes, from the Sheriff Deparment in Cynthiana, Kentucky, suffers a shot injury on duty and he falls into a coma. When he wakes up in a hospital bed, after several weeks, he finds himself alone in the building, or at least he thinks that he is alone. Soon enough he meets several “things”, walking “things” that only a word, not matter how nonsensical it sounds, is able to describe those walking “things”......ZOMBIES.And if things aren’t bad enough, Rick doesn’t know the whereabouts of his wife and son!Rick’s first stop on his own home leads him to meet Morgan and his son, Duane. Morgan explains him how the world gone to hell while Rick was in coma.The US Government was asking population to go to big cities to be defended there by the army, and since Lori, Rick’s wife, has family in Atlanta, Rick decides to go there to search for his wife and son, Carl.On Atlanta, he finds Glenn, an Asian-American young man, who explains him how the world works now.Rick Grimes’ world would never been the same anymore!Chapter Two\nMILES BEHIND US\nRating: **** ( 4 stars )\nOkay... What the hell are we going to do now?\nThe body count started on the first chapter making them to realize that ANYBODY may be the next one to fall.Ammo is scarce, so that’s why that being able to shoot and doing it with precision becomes a vital skill where, Andrea, a young blonde woman, is showing to be the best shooter of the group.Rick’s group is on the road, trying to find some safe place to survive in this nightmare that it’s their reality now.However, that seems to be an impossible goal since there are zombies everywhere!Any potential paradise reveals a hidden biting snake.Chapter Three\nSAFETY BEHIND BARS\nRating: ***** ( 5 stars )\nI ain’t gonna bury you again you son of a bitch.\nIn our society, you never would want to go prison, but in an apocalyptical dystopia plagued with zombies, a prison would look like the logical choice.Rick’s group finds a federal penitentiary, that it seems to be the place to expiate their sins, but also they can be a site with its own kind of sinners.A shocking revelation will expose a new facet about their life-and-death condition.And also, they will find soon enough that zombies may be deadly, but men are evil. Zombies aren’t guilty of their actions, men are quite aware of theirs.And men are able to do more horrible things than any zombie.Until now, you haven’t seen anything yet, the really gruesome things starts here.Chapter Four\nTHE HEART’S DESIRE\nRating: ***** ( 5 stars )\nCry me a river.\nEnter: Michonne......, mysterious Afro-American woman with a samurai sword. ‘Nuff said!Rick’s group has troubles in all fronts. Menaces outside and inside of the prison.Rick finally realizes that any sentimental sense of righteousness is long gone in this insane world and now he is taking the hard choices if he really wants the survival of his group. Some decisions will pay out, some don’t, but nevertheless, Rick needs to call them.Chapter Five\nTHE BEST DEFENSE\nRating: ***** ( 5 stars )\nWait... you’re feeding them? What the hell are you feeding them?\nEnter: The Governor......, no time to introduce him! Run, everyone! RUN!!!Rick’s group is finally establishing a secure place in the prison when a falling helicopter in the sky making to go out to investigate.Rick, Michonne and Glenn while checking out the helicopter, they reach a fortified town.Welcome to Woodbury.The Governor rules the town of Woodbury, and the lives of Rick’s group would never been the same anymore!They would wish to face a legion of zombies instead rather than The Governor!Chapter Six\nTHIS SORROWFUL LIFE\nRating: ***** ( 5 stars )\nDon’t you know what people is capable of?!\nRick, Michonne and Glenn are trapped in Woodbury.And each one of them never would be the same anymore.Zombies are merciful, they kill you quick and you aren’t aware of a single thing anymore. You cease of thinking, hearing and feeling.Men aren’t merciful at all.However they are similar in an aspect......they have to be dealt in the same way.Chapter Seven\nTHE CALM BEFORE\nRating: **** ( 4 stars )\nI just don’t need to hear you say it. I can’t hear you say it.\nRick’s group is reunited again and they remain in the prison.However, Woodbury’s people is out there.This is only the calm before the storming arrival of the dwellers of Woodbury to the prison.It’s not a matter of “if” but a disturbing certainity of “when”.Rick’s group is doing their best to keep on with their existence along with doing their best to be prepared for the unavoidable confrontation.Chapter Eight\nMADE TO SUFFER\nRating: ***** ( 5 stars )\nI don’t think we can do this.\nThis is it!The showdown that you all have been waiting for, during the entire compendium!Woodbury’s people versus Rick’s group!\nNow we’re cooking...\nVillains will rise, heroes will fall. Characters that you have been thinking that they are irrelevant will prove their value in key moments of survival. But don’t you get mistaken......This is a war......And in war, disgusting unspeakable sad things happen.This is......\nTHE WALKING DEAD!!!\nSpecial Bonus\nHOLIDAY SPECIAL\nRating: *** ( 3 stars )A brief side story showing again Morgan and his son Duane, the first people that Rick Grimes met after his recovery from the coma.Christmas is coming, or at least their calculations say so.Morgan does his best to bring a momento of peace and joy to his son, Duane, at least for one day in their uncertain existence of survival."}, {"userName": "HFK", "userReviewDate": "Oct 04, 2016", "userURL": "http://www.goodreads.com/user/show/52263626-hfk", "userReview": "So, I am finally jumping on the bandwagon with The Walking Dead, which is pretty late considering I do own all the three published compendiums, and they do have an solid dust coverage on top of them.As many, I too have watched the TV-show, but I lost my interest towards it after the fourth or fifth season. Really, who can remember such a things, not me. Anyhow, it was fun as long as it lasted, but it got quite repetitive for my tastes, and when I missed a few episodes, it was so long goodbye ahead of me. I might someday return to it, do a rerun marathon, but that day will be somewhere in the far, far future.The Walking Dead comics reminded me of Jersey Shore, the infamous reality TV-show back in the days. I know, I am doing the unspeakable comparison over here because these two works have absolute nothing in common.But, what I mean by this is the following:Few years ago I was tied to a bed due to complicated pregnancy, which naturally affected my sleeping rhythm. Being a night person, it quickly turned to me being awake in the middle of the night, and sleeping most of my days. It pretty much sounds like a heaven to lazy people, but it really wasn't.So, there I was laying on the sofa while rest of the family was sleeping like a normal people do, with nothing to watch. Internet connection was off for reasons unknown, I was too sick to rumble over my massive DVD-collection. But hey, there was a Jersey Shore reruns on! Ugh, I had avoided that series like a pro for when it was the IT thing, and there I was, watching some seriously ridiculous stuff and even more ridiculous and bad drama. Oh the fuck the drama. Stop The Drama = STD. But the thing is, I could not stop after I got myself rolling on with it. I binge watched it like a madwoman, and when all the seasons my TV was able to show were done, I furiously Googled me the rest of the seasons to get my very much needed fix. It was mad, it was crazy. I was like an addict in look for my next dose, no matter the cost. It was insane, or maybe it was just me experiencing a moment of the good ol' insanity.And this is exactly how I felt with the first compendium with this series. I could not stop myself. I had to binge read this in a few sittings middle of the night while my reading light had an constant epileptic seizure, and even when I knew I would be like a brain needing zombie when the morning would finally come, there was no stopping me.But the thing is, like Jersey Shore, The Walking Dead just is not that good as a whole. Surely, it is occasionally quite fantastic look at how people survive in extreme conditions, it does show the dynamic and nature of the humankind, and it certainly is not a beautiful picture that is painted of it. There is a lot of death, a lot of struggle, and oh yes, a fucking a much a lot of drama.So it is semi-good (Jersey Shore is not even close to semi-good because it is painfully bad), it is addictive, it is interesting, it is captivating. But it just simple is not that good.I knew to expect certain kind of dialogue and characters due to reading Kirkman's The Outcast series, which really is not a comic I actually like, and it seems I was onto something because the same issues are very much in present within The Walking Dead, too.Dialogue is awkward, it is overly emotional and dramatic, it is often discontinuous in many levels, but at least it is very fast paced, which makes it tolerable, and probably what makes it to be such an addictive experience, too.The characters are overwritten, mostly portraying strong and specific traits, which makes them a good case of fluffy character study. Too bad that most of them are hugely unlikable, annoying, and very much the kinds that are easily experiencing snowflakish overreactions, which is of course supported with art that really highlights every emotion there is for the reader to experience. In a bad way.Rick, that damn snowflake of a man. Lori, argh.The good news is that the TV-show is very respectful and true to the comics, but there is enough differences between what happens, how the story develops, and especially how each character's roles have been changed to fit the demand. If I would need to choose, I would go with the TV-show, no doubt about that.The Walking Dead is a long series, at this very moment there is 159 single issues published, and this compendium collects the first 48 issues, making it a total of 8 volumes (4 book editions, 2 omnibus editions). It is over 1000 pages of black and white art, and drama. A lot of drama. STD.And that over 1000 pages is heavy for the hands, because this fucker is huge and it weights insanely much, but if there is will, there will be a way. And that is pretty much getting either your hands or neck screwed, but it might be just me and my lousy reading positions, but be warned.I would still recommend this, and I am happy to be able to continue the series, but I would suggest it to be read in compendiums rather than in single issues, volumes, books, or even in omnibus editions. For one, it saves you a lot of money, and for two, it will be enough for a complete story line without painful slows, downs, ups and fasts being heavily unbalanced. Three shiny stars because hell yeah I am hooked as fuck, but no four shiny stars because as I said, it just is not that good.IMHO."}, {"userName": "Andrea ❤Ninja Bunneh❤", "userReviewDate": "Jan 03, 2014", "userURL": "http://www.goodreads.com/user/show/7897213-andrea-ninja-bunneh", "userReview": "If you watch The Walking Dead aka stalking Daryl Dixon, throw any notions you may have about the show paralleling the comics right out the fucking window. This version does not have this:\nOr that:\nI may have even missed this a tiny bit:\nIt does have this:\nAnd that:\n\nAlthough our friend the Governor on the show is rated G compared to the comic version.Now take all the sick, twisted, and fucked up things that happen on the show and multiply the fucked-upness by a gazillion. Throw in some added gore and psychologically damaging events beyond human comprehension, and you get this book. Fucking WIN. I still miss seeing this a bit a lot. \n5 Ninja-Bunneh-Zombies-Munching-On-Brains"}, {"userName": "Trudi", "userReviewDate": "Oct 15, 2011", "userURL": "http://www.goodreads.com/user/show/1416912-trudi", "userReview": "[Totally did not see the rape and torture of Michonne coming. I really thought there would be a last minute reprieve / rescue. And if I didn’t see that coming, you know I didn’t expect Michonne to turn the tables on the Governor and mutilate his body. Gruesome stuff! But very well-presented. It felt earned not gratuitous. Lori’s death, along with the baby, shocked me too. Like holy moses batman, that was intense and so unexpected.  (hide spoiler)]"}, {"userName": "Madeline", "userReviewDate": "Sep 26, 2012", "userURL": "http://www.goodreads.com/user/show/111921-madeline", "userReview": "I really, really love zombie movies, and anything really that involves zombies. (Yes, even Pride and Prejudice and Zombies. If you can't like that idea at least a little bit, then I can't like you.) But pretty quickly after my zombie obsession started, I realized that what interests me about these stories isn't the zombie killing aspect at all. Instead, what really fascinates me about zombie apocalypse movies is how they portray the breakdown of society, and how people deal with this. Blowing zombie heads off with shotguns and slicing them up with machetes is fun to watch (because zombies, like Nazis, can be slaughtered in the thousands and you don't feel even a little bit sorry for them - even when there's a really heartwrenching moment when someone has to shoot their zombiefied mom, it really doesn't make me feel that bad because she's not your mom anymore, she's a zombie who's going to eat you and there is a big difference) but what always interests me more in these stories is what happens when the normal rules of society no longer apply. If the world collapsed tomorrow and all that mattered was survival - not morality, not family, not religion - what would you do? When the zombie apocalypse happens, all bets are off and society crumbles. Once this happens, once we pretty much do whatever we want because everything has been destroyed, how do we react? Who do we become when we lose everything? If these questions interest you more than simple zombie killing, The Walking Dead will make you very happy. Yes, there are zombie killings aplenty (drawn in super graphic detail, to the point where you probably shouldn't be eating anything while you read this), but the zombies are not the problem here. These aren't 28 Days Later zombies (which, if we're going to get technical, weren't really zombies at all) that are smart and run scary fast. These are slow, dumb, lumbering things that hunt mainly by smell, and whose strategy for finding food is basically to wander around and hope to stumble within grabbing distance of something edible. The zombies in The Walking Dead are not a huge threat. The threat is the people left behind, trying to make a life in this disaster wasteland aftermath. Let me warn you right away: it ain't pretty. Even our good guy main character, the former police officer Rick, cracks under the pressure and becomes significantly less heroic than he wishes he could be. People kill other people. They torture and rape other people, and do similarly awful things in order to survive. This isn't a zombie movie, where the tight-knit group pf heroes find a safe haven or maybe even a cure and then the credits roll. There are no credits here, and even when our main characters find a relatively secure place where they can live, things aren't over. They still have to push the zombies back every day, and find a source of food, and keep other people from attacking their hiding place. And they still have to deal with each other. To paraphrase Sartre, Hell isn't a zombie apocalypse, Hell is other people."}, {"userName": "Bark", "userReviewDate": "Jan 20, 2011", "userURL": "http://www.goodreads.com/user/show/2905339-bark", "userReview": "I cannot believe the dark places this graphic novel delves. No one, and I mean no one, is safe in this ongoing saga. It takes place after the dead have risen and destroyed everything and follows a handful of often rotating survivors as they try to get by in a frightening new world. It starts out a little slow as everything is set up but once it gets going I didn't want to put it down.It is less focused on the zombies than its core of characters and their interaction and relationships but there is plenty of gore to go around. It's horrible, sad and unputtdownable. This volume collects issues 1 - 48 of the long running series and man is this sucker heavy!"}, {"userName": "alluu", "userReviewDate": "Apr 12, 2012", "userURL": "http://www.goodreads.com/user/show/7917856-alluu", "userReview": "Wow. To say I was disappointed would be an understatement.Where to begin? I really enjoy reading comics (or graphic novels, if that's the term you prefer) and am constantly on the lookout for something new to enjoy in the genre. For the most part, I tend to read classic, well known stuff like Alan Moore's work or Maus or things like that. Recently I got the itch to try out something a bit more, well, recent! Something new and fresh.It seems like everybody's reading The Walking Dead nowadays, and also raving about it. This compendium holds an average rating of 4.44 here, which isn't half bad, and there's a lot of very positive reviews on here. So I decided to pick it up. Now, having read through it all, I'm confused. I just don't get the praise the series gets.I like the concept. I like the dark no-one-is-safe atmosphere. The art is fittingly bleak and gritty, if not particularly inspired.The problem with The Walking Dead is that it's boring and badly written. Nearly all of the characters are either shallow, plain or outright annoying, especially the women (except Andrea). Dialogue is awkward and clunky, riddled with cliches, worn phrases and forced exposition. It just sounds unnatural, which is *pretty* problematic for a comic that centers around conversations and social relations.So the series is basically about about character development. And that's great! But if you do it badly, you end up with a cheap soap opera. And that's what The Walking Dead really is: a mediocre soap opera. With zombies. Even the zombies are kind of lame and serve primarily as an excuse to include mindless action scenes, which do little to break up the monotony of it all. Rarely does anything too exciting happen and the plot moves forward at a snail's pace. People die and argue violently with each other all the time, but it all lacks dramatic punch. After the a while, you just stop caring.This review may sound harsh, but reading through the compendium has been a frustrating experience. I really wanted to like this and there were some good bits here and there, but I expected something much better based on all the positive reviews.What is it about The Walking Dead that I just don't get?"}, {"userName": "Francesca", "userReviewDate": "Mar 23, 2016", "userURL": "http://www.goodreads.com/user/show/31502192-francesca", "userReview": "[ was around for longer in the show, I felt like that escalated way too quickly in the comics and I liked the slow build up to it in the show seeing Shane get to the breaking point  (hide spoiler)]"}, {"userName": "Gregsamsa", "userReviewDate": "Jan 11, 2015", "userURL": "http://www.goodreads.com/user/show/22119193-gregsamsa", "userReview": "The increased public awareness of post-traumatic stress disorder has had a positive effect on zombie comix.Before recent wars and criminal adventures and subsequent psycho-medical research and publicity, PTSD was all but ignored by zombie comix.Characters would be terrorized by zombies, displaced from their homes by zombies, see friends, loved ones, and coworkers die and then become zombies, but with the exception of some tears and wailing there were no real emotional consequences to zombie-related events that would have to be profoundly traumatic.OK, I could be wrong, never having read any zombie comix (comix is the wrong word, but graphic novel? Does that describe an incomplete collection of separate issues?). But I'm just assuming zombie comix were pretty much like most action comix, movies, novels, and television shows where it is commonplace for characters to witness the most disturbing things and experience fallout for only twenty or so scripted seconds or less: \"Oh my God that was terrible!\" \"Yeah, but it's over now.\" \"You're right. We have to move on.\" In action fiction of most media people get over emotional trauma even faster than bullet wounds.My favorite television series The Walking Dead is not like that. I read the first compendium of the comix it was based on to see if they were like that. They are not. They are full of rich post-traumatic goodness. Er, badness. This is about people who are so messed up by the zombie apocalypse that you realize the title may really be referring to them.But how else could there be 1,088 pages of comix about a zombie apocalypse if it were all: \"Oh no! Zombies are coming! Let's fight and/or run!\"? These comix are less about zombies than they are about interpersonal dynamics among individuals under an inconceivable amount of stress with all familiar support and comfort erased.I've always had a taste for fiction that highlights the fragility of society. It is so easy to let ambient convention sink so deep into your skin that you are utterly of the mass illusion that the way things are is natural, inevitable, given, reality. Good fiction (Blindness) can deliver the nice nasty shock it takes to wake up from that dull dream, but unfortunately the bad fiction is, in that sense, soporific.The Walking Dead is good fiction, though not unconventional enough to provide a broader scope of such wakey-wakey shock beyond the post-apocalyptic PTSD thang. [I love that sentence, if I may say so myself.] The art is typical of any broody paneled story of this very established genre, and laid out with a formal strictness that makes the 19th century novel template look like a Rorschach blot. Wares are rare, as are Clowes. (If you know of more, please say. It's about time more folks were giving graphics an overdue modernist kick in the ass).But as far as reliance on tradition goes, you could do worse than Shakespeare. Yes, I said Shakespeare: 1)Conflict one. 2)Conflict two. 3)Violence, resolving one of the above, complicating the other. 4)Discourse on ethics 5)Repeat.On Ethics and ZombiesSo, does The Social Contract get seriously edited, redacted, remixed, or tossed on the fire when the implied society of \"social\" is relegated to a nostalgia you'd best not indulge? If random chance and arbitrary tragedy are the only reasons a group is thrown together is there an obligation to defend the group, and from what does this obligation arise? On what grounds do you harm outsiders for this obligation? This is just a slip of the mighty wads of ethical issues that erupt and are handled mostly badly by the characters, but you should expect nothing less, er I mean more, from the irrevocably traumatized."}, {"userName": "Madeleine", "userReviewDate": "Nov 12, 2012", "userURL": "http://www.goodreads.com/user/show/1198255-madeleine", "userReview": "[look, we all know that he stares at a wall of fishtanks filled with severed heads like it's reality television and he's keeping his Zombie!Daughter in secrecy like one keeps mum about an illegal mail-order bride but if you're only watching the show, you're missing a scene wherein he pulls out his daughter's teeth -- presumably to make her more docile for the secret-keeping BUT REALLY SO SHE CAN GIVE DADDY A FULL-PAGE, OPEN-MOUTH KISS AND IT SKEEVED ME OUT LIKE SOMETHING MAJORLY SKEEVY. (hide spoiler)]"}, {"userName": "Jamie", "userReviewDate": "Dec 23, 2011", "userURL": "http://www.goodreads.com/user/show/4605519-jamie", "userReview": "Originally read in early 2012.Reread May 2016I started to read this series after watching the first season (however short it was) of The Walking Dead tv series. I had head it was based off a comic series but knew little else. When I spotted this massive comic at the library, I just had to check out out. So glad I did!The book is similar to the tv series yet there are lots of differences. I don't want to spoil one or the other by saying too much. But a few things include: No Darryl. Tyrese has a daughter, not a sister. Hershel's personality is quite different. Some characters live a lot longer, others die much sooner. So if you have seen the series and are thinking that since you have, there is no need to read this, then you are very wrong. Although Rick, Carl ans Glenn are probably the most stable of all characters.live in this that died in the series and vice versa. The beginning is basically the same but it does take some different routes and the focus is sometimes different. I loved comparing the two. Some of my favorites here I don't like in the tv version For example I love Andrea in the comics but nearly despise her in the series-although I do like the actress). But bottom line, there is a lot that can be new. This gives up the first 48 volumes of the comic series You can read this compendium or just read them one at a time or there are in-between sized volumes to read. It is a very in-depth series that is worth taking your time through it. Lots of small details in the art especially. it is a gritty style that I am not normally a fan of but in a zombie apocalypse I think I'd be hard-pressed to find better. This series is zombie fan MUST!"}, {"userName": "Yodamom", "userReviewDate": "Mar 18, 2015", "userURL": "http://www.goodreads.com/user/show/2905141-yodamom", "userReview": "I am a fan of the show, a serious fan. I found myself looking for something to hold me over between show/seasons so I looked into the books. I'm not a big fan of many comics so I went for the novels on Woodbury and the Gov. Oh my, if you haven't read this get to them, fast. I finished those 6 books quickly so time to try the graphic. I should have known these aren't a best seller for nothing. I am now officially a Robert Kirkman fan.This is what a zombie book should be, gross, bloody, gore plus and full of heart stoping moments. The illustrations are wonderfully detailed I spent time just looking at pages drawn with intricate parts, amazing. I can't tell you anything about the deaths the, back stabbing the love, and torture that would ruin it. These semi follow the TV series, there are differences that will surprise. Read it"}, {"userName": "Asghar Abbas", "userReviewDate": "May 26, 2017", "userURL": "http://www.goodreads.com/user/show/37421322-asghar-abbas", "userReview": "Heck yeah, this will get you in the mood. Lovely corpses, all those bones, that skull, mermaid skeletons and skeletal trees. All the cranium juice for you to drink, delicious. What I am saying is, I loved this huge ass volume. It was everything I expected it to be and more. Everything I look for in a source material. This graphic novel has eluded me for so long, I've been meaning to read it for such a long time, so this felt like homecoming to me. In more ways than one. This also gave a nice not so little tangible form to a beloved show, an event really, that I love watching with my other brother. Makes me happy. All the images have left me feeling rather hungry though, so succulent and titillating, yum. So, I am gonna go to this restaurant on the waterfront here, and order a zombie drink. See ya.And of course, it will always be about that one Capistrano Birds song. This volume is so good that Daryl's absence wasn't even conspicuous, even though I missed his presence.Addendum : I have always been a huge fan of the show, but this volume it's badass. The evolution of Rick and his group is always interesting, a bit contrasting from the show, the differences are subtle and constant but they are there. The group is more vulnerable in the comics, they are just trying to get by without attracting any undue attention from the real threat ; other survivors. When they fight back, it is only because they are pushed into a corner and have no choice. And they are not even good at it, not really, even Rick. Only Andrea is a skilled kickass warrior here. Sure, Rick does what is necessary, always making the hard decisions. He often times does the unthinkable precisely because he's thinking clearly. But he is less godlike, and have zero messiah complex. While his TV counter part is an absolutist, which translates well on the screen. But here, the more humane Rick is more suited for this settings. Both worlds are ugly, but in the comic books, Rick Grimes doesn't have to be. One of the more startling changes were Dale and Andrea thing, she's way much hotter here, and what she has with Dale is not platonic, not by a long stretch. Not an ageist, just something I was not expecting at all, due to how in the show, they have this emotional connection, physical is always better is what I always say. The key difference would that Rick and his group not only adapted in the show but thrived in their bleak environment. All in all, the comic books are great, and the way they handled the Governor's storyline gives me hope that the Negan chapters will be great. Because let's face it, the show is stale now and they have dropped the Negan's storyline ball or bat. Oh, and Glen and Maggie are still the sweetest thang, even here. P.s watch out for the Jamie Lannister thing. Haha,"}, {"userName": "Brad Carl", "userReviewDate": "Dec 26, 2016", "userURL": "http://www.goodreads.com/user/show/40119265-brad-carl", "userReview": "Knowing that the AMC TV series is based on these books/graphic novels made this an even more entertaining read. For as much as it is like the TV show, it's also NOTHING like the TV show in SOOOO many ways. While reading, you really won't know for sure what's coming next even if you've watched the show, to date. These books aren't cheap, but they are worth the price of entertainment and insight into the TV series."}, {"userName": "Gary Butler", "userReviewDate": "Jan 04, 2015", "userURL": "http://www.goodreads.com/user/show/5483721-gary-butler", "userReview": "2nd book read in 2015.Number 99 out of 430 on my all time book list.Follow the link below to see my video review:https://www.youtube.com/watch?v=Ql42Y..."}, {"userName": "Chris", "userReviewDate": "Dec 18, 2010", "userURL": "http://www.goodreads.com/user/show/858949-chris", "userReview": "Zombies are boring.There. I said it. And I'm not ashamed.They are, though. Zombies have no real motivation, they have no goals other than to kill all humans. They are mindless, a kind of twisted force of nature whose great terror lies in their sheer numbers and their unstoppability. As a concept, zombies are interesting, and as a symbol or a metaphor there's a lot you can do with them, but the zombies themselves are kind of dull. They lurch about, slowly decaying, looking for people to devour. No one ever made a best-selling book or a hit movie with a zombie protagonist. [1]Think about it: every zombie story rests on the same basic plot. The dead have risen and a small band of living survivors tries to find safety in a world that is actively trying to kill them. That's it. Sure, the details may vary - fast zombies or slow ones, a cure or no cure, they eat brains or they'll eat anything, trapped in a mall or a farmhouse - but the foundation of the story is the same, and woe betide the writer who strays too far from the formula. Writing a zombie story means agreeing to adhere to a set of predetermined set of rules, which allow only a little room for straying.So what is it that makes zombie stories so popular? Why do people love books like this one, or Pride and Prejudice and Zombies or World War Z? Why do movies like Shaun of the Dead and Night of the Living Dead and even Resident Evil get people so excited? It certainly isn't because of the zombies, although it is always fun to see the special effects improve.We read and watch zombie stories because we love the survivors, and it is they who make or break a zombie story. The more closely we can identify or sympathize with a survivor, the more interesting and horrifying the story becomes for us. They are a great demonstration of the variety in the human condition, and illuminate new and interesting aspects of humanity every time. In this case, we are given Rick Grimes as our protagonist, a police officer from a small town in Kentucky who gets shot on duty and wakes up a month later in the hospital to find the world has been given over to the dead.As he looks for his wife and son, Rick finds himself leading a band of survivors in their search for a place of safety away from both the dead who wish to devour them and the living who wish to kill them.What makes this a really fun - and terrifying - read is that Kirkman carefully paces the plot so that we never really get much time to rest. A pattern quickly starts to emerge in the story, with Rick and his people finding safety, a kind of equilibrium between running for their lives and resting, only to have that equilibrium disrupted. Each time the interval gets longer and longer, both in terms of page count and story-time, but each time you know what's coming. The hardest moments are the most peaceful ones, when they have found a refuge from the horrors of the world because you know it isn't going to last, and you know that when the balance is finally undone, it's going to be worse than before. Kirkman uses this pattern and this expectation to his advantage, creating a tight and tense narrative.He also provides us with a look at some of the ethical problems that arise from a world where the dead outnumber the living. In nearly every zombie story ever written, the living immediately start killing the zombies, but is that the right choice to make? We don't know all the facts. We don't know what caused this outbreak, whether it can be cured, or even whether the people affected might just get better. We just start taking head shots in ignorance, but might it not be worth it to try and learn something about these \"monsters?\" [2]There's also the question of how to organize a post-outbreak society. What kind of person or people should run the survivors' societies? Is this an opportunity to remake civilization, or should the old ways be adhered to? How much leeway to we have in restarting the world, and what will that look like in the end? The characters in this story have to deal with how to define a family when one's partner or parents or children could die at any time. They have a chance to redefine what is lawful and illegal, to toy with the notions of what is right and wrong, and to re-evaluate the role religion plays in their lives. It's a chance to rebuild the world from scratch, and the characters in this story test those limits in interesting and sometimes unsettling ways.And that's assuming that the living will actually survive and thrive in a zombified world. This is a world where death is always only moments away. It is only a matter of time before the living survivors join the ranks of the undead, and the awareness of that fact is the classic existential puzzle with a little extra twist to it: how do you live when you know that you will die, and especially when you know the horror that your death will entail? One of the more heartbreaking moments is when one character gets killed, and Rick has to break the news to his young son, Carl. When he asks his son if he is upset, Carl replies, \"No. People die, dad. It happens all the time. I'll miss [him]... but I knew he was going to die eventually. Everyone will. Everyone.\"That is an observation that, frankly, no child should ever have to make.The characters in this story make hard choices and sometimes do terrible things in the name of survival. But, with very few exceptions, there are few characters that we cannot truly come to understand and identify with. Their decisions and their reactions make them richer, more interesting, which is what truly makes for a fascinating and engaging story.The zombies are really incidental to all that.As this is a comic series, I would be remiss if I didn't mention the art, which is overall quite good. There were a few times when I had trouble telling some characters apart, but the high rate of attrition generally took care of that problem. The detail in the artwork is very impressive, though I can imagine there were more than a few times that Charlie Adlard cursed Robert Kirkman for setting a large part of the series in a locale with a prominent chain-link fence that couldn't easily be ignored. As this is a horror comic, the art is sometimes horrifying, very graphic and quite satisfying without being gratuitous. Well, mostly without being gratuitous....It's a really excellent book, though I do have one caveat if you're planning to buy the compendium edition: get a reinforced reading harness, or rest the book on a solid piece of furniture with a low center of gravity. This is one of the densest books I've ever read, packing nearly five pounds of book into less physical volume [3] than the last hardcover installment of The Dark Tower, a fairly hefty book. I think the ink may contain uranium or something. So, take measures to prevent back injury and hernias when you read this and you'll be just fine.Many thanks to my brother Michael for knowing I would enjoy this, and I look forward to watching the AMC television adaptation.-------------------------------------\"But honestly... I just don't know what anyone's thinking. To me, that's scarier than any half-rotten ghoul trying to eat my flesh.\"- Rick Grimes, The Walking Dead-------------------------------------[1] Cue angry email pointing me towards exactly that book or movie in 3... 2... 1...[2] Short answer: no.[3] It comes out to 1.147 grams per cubic centimeter, which isn't nearly as dense as it feels when it's making the straps of your bag dig into your shoulder...."}, {"userName": "Lolly's Library", "userReviewDate": "Oct 22, 2010", "userURL": "http://www.goodreads.com/user/show/2649865-lolly-s-library", "userReview": "I was going to write reviews of the first three volumes of this series, but I decided to save my creative juices (and they are so little) for the compendium. So here we go...First off, a general overview: The story concerns a local cop, Rick, who wakes in the hospital to discover the world has gone to hell. All the people have been turned into the walking dead. (I know, overtones of 28 Days Later, but go with it.) We then follow him as he struggles to find out what has happened, where all the zombies came from, and if his wife and child are still alive. In later chapters (volumes), Rick gathers a rag-tag group of fellow survivors and we are further drawn into their story of how to survive in a world gone mad. As Simon Pegg pointed out in his afterward to Volume One, reading Robert Kirkman's tale makes you start to question yourself: Would I be able to survive a zombie apocalypse? Would I be willing to do whatever it takes, even if it reduces me to a savage, to protect those I love? Heady stuff.Now we come to the most controversial aspect of the series, the artwork. In Chapter (Volume) One, all the art and grey tones were done by Tony Moore. His artwork gave life to the series, giving us clear and beautiful images, done in a simple yet at the same time intricate style. Every character was unique; the zombies were disgusting in their realism; light and shadow had the starkness of a well-made black-and-white horror film. In short, Moore set the bar high, a bar which the next illustrator, Charlie Adlard, fell quite short of. I still don't know why Moore left the project, but I truly wish he hadn't. Once Adlard steps in, the drawings go to hell. Everything's rougher, without the grace of lines Moore had; characters are so poorly drawn that it's hard to tell them apart, which goes for both male and female characters. The shading is the worst, though; it's so heavy-handed that it almost feels claustrophobic and while I can appreciate that one might want a claustrophobic feeling for a horror comic, you want that feeling to come from actions and situations, not from a lack of detail in your scene. At times, panels were so dark it was hard to tell what the action of the character was. I'm used to seeing excessively dark lighting in movies, in fact I've come to expect it in horror movies, the kind of lighting where you can see some movement, but have no clue what's really going on. I don't expect it in graphic novels and, in fact, if you'd asked me, I wouldn't have known that excessive darkness was even possible in the realm of drawing. Well, other than taking a panel and coloring it in with a black marker. However, despite my poor opinion of Adlard's drawings, I have to be fair and say that they do get a bit better in later volumes, as he gets more sure of his characters and the storyline.The storytelling helped come to grips with the post-Moore artwork. To be brutally honest, if this were not a graphic novel, I'd have to wonder how Kirkman managed to get published. Taken alone, the story is rather poor, especially the dialog, which can in turns be idiotic, banal, cliched, overwrought, nonsensical, and occasionally just plain painful to read. However, this isn't as bad as it sounds. First off, the graphics add depth to the ordinary writing, propelling it along when it might've stuttered out if it were merely a print novel. And secondly, the bad writing has actually captured the reality of the situation. After all, people say stupid things; they stutter, they get emotional, they put their foot in their mouth; they're inelegant in their conversations. In a zombie apocalypse, who has access to a speech writer, someone to whom they can turn to coherently and eloquently express their every thought? No one. Hell, only the slick bastards up in Washington have speech writers and they still manage to generate sound bites of them saying something moronic. Having awkward and not-well-written dialog gives The Walking Dead a depth and sense of reality not encountered in many other graphic novels, which, despite the later artwork, earns the Compendium 5-stars in my book.Many people are put off by the Compendium, complaining about its lack of portability. Weighing in at nearly five pounds, they are right, it's not a book you can read on the commuter train into work. However, it's not put me off buying Volume 2 when it comes out. Not only will a matched set help me work out my biceps, when the zombie apocalypse does come, their heft will make them ideal weapons. I'm sure they'll be able to take off a rotting zombie skull or two, making them not only informative but useful as well."}, {"userName": "Crystal Starr Light", "userReviewDate": "Dec 13, 2013", "userURL": "http://www.goodreads.com/user/show/3990525-crystal-starr-light", "userReview": "[(Seriously, how is that man STILL ALIVE?! If he ain't a Marty Stu, I don't know what is!) (hide spoiler)]"}, {"userName": "Joshua Batson", "userReviewDate": "Jan 19, 2012", "userURL": "http://www.goodreads.com/user/show/6324440-joshua-batson", "userReview": "I took the all to trite path of tv then book. The series was amazing and I couldn't put the story on hold while they filmed the next season so I picked up my first comic book since pubescence. First off the two are not the same. They are similar in a few keeps points and milestones but the events and characters diverge greatly from the separate story lines. Thankfully the one thing the televised version got right was that the Zombies are only a minor part of the story. The writing focuses more on the characters and how they react to the world than the world itself. The dark elements ( really dark) are mostly born from the monsters that the characters become, not the monsters that might be eating their mother. READ IT! Even if you don't like graphic novels, even if you think zombies only matter in the bible; just read it. The emotion and drama that unfolds in each character is written better than most any other \"legitimate\" piece of literature and you won't regret the time you've spent following a group a zombie survivors."}, {"userName": "Jess ❈Harbinger of Blood-Soaked Rainbows❈", "userReviewDate": "Mar 02, 2017", "userURL": "http://www.goodreads.com/user/show/7125124-jess-harbinger-of-blood-soaked-rainbows", "userReview": "Scored this sucker today for cheap. Hells yeah. Finally I can start reading this thing."}, {"userName": "Meghan", "userReviewDate": "May 12, 2011", "userURL": "http://www.goodreads.com/user/show/5428738-meghan", "userReview": "* How I found it: a friend recommendation* Type: Paperback* My initial thoughts: A comic book? Am I a prepubescent 13 year old boy? This book is THICK.* Why I said \"yes\": Show is great (which was also recommended from above mentioned friend) and pure realization that I need to step out of my comfort zone when it comes to entertainment. ((You mean I can't read dirty romance novels and period pieces for life?))This was the only comic book I have ever read before. AMC based a show (which is fantastic) off the series, so I had a decent base knowledge of the plot to the story prior to opening the book. I'll admit, I was taken aback of how large the book was and simultaneously looking at photos and words seemed daunting at first. After the first chapter, however, I felt like a super reader, as I read half of the book in one sitting. Yes. It is that good. And yes, it is that quick of a read. Con: no page numbers.Overall the book was great. There was a lot of sex, cursing, and actions that should test one's morals. Not enough about zombies, as the book was more about the characters and their relationships/struggles to stay alive for an uncertain future. The book was not linear, which I found to be an added bonus. I get bored easily when it comes to novels, so the frequent change in scenes were pleasant to my reading experience.The plot differed from the show, at least to my knowledge so far. DISH Network canceled AMC, so I am still waiting to watch the last 3 episodes. If you're reading this, don't spoil what happens on the show. I will bite you. Ha. Zombie humor. Anyway, this book and show have given me a new found love for zombies. My next embroidery project is going to be zombie tea towels and I'm convinced I'm going to be a zombie slut for Halloween next year."}, {"userName": "Johann (jobis89)", "userReviewDate": "Dec 17, 2016", "userURL": "http://www.goodreads.com/user/show/50893023-johann-jobis89", "userReview": "As a huge fan of the show, I decided I wanted to read the Walking Dead comics and this was actually my first real encounter with comic books. These comics are absolutely awesome!! This compendium covers issues 1-48, which is also equivalent to the first 8 regular Trade Paperbacks of the comic book series.I knew that the show had deviated from the comics in a number of ways, but there were FAR more differences than I anticipated. Lots of new characters, characters having storylines that were very different from the show, characters having storylines that other characters in the show had...missing characters! The list goes on.The comics are literally BAM BAM BAM. So fast-moving, characters dying within pages of each other. The storyline moves at a relentless pace, it is so easy to get caught up in reading without realizing how much time is passing by. My only issue is that when characters die in the comics, I don't really feel that much of an emotional impact, whereas with the show, I sometimes needed counselling after certain characters' deaths. I think it's maybe because comics are such a fun, quick read, that you don't have the same amount of time to get emotionally attached.The illustrations are insane. I love how quickly you can recognize each character just by their characteristic traits. I was deliberating over whether or not I want to read beyond where the TV show is, but given how different the comics are, I might just read ahead. This compendium finishes with the wrap-up of the Governor's storyline, so there's still a bit to go before I reach the current timeline in the show.Luckily my brother has Compendium two just waiting for me..."}, {"userName": "Fables&Wren", "userReviewDate": "Dec 02, 2015", "userURL": "http://www.goodreads.com/user/show/42780417-fables-wren", "userReview": "WrensReads Review:COMPENDIUMcom•pen•di•um (kəmˈpendēəm) noun.noun: compendium; plural noun: compendia; plural noun: compendiumsa collection of concise but detailed information about a particular subject, especially in a book or other publication.Compendium 01 of The Walking Dead includes: Collections of Issues: #01 - #48Collections of Volume: #01 - #08Overall Thoughts: It's a pretty great read. It could have been an amazing read if the women weren't portrayed as incapable idiots 75% of the time.WrensReads | Goodreads | Twitter | Instagram"}, {"userName": "Jason Parent", "userReviewDate": "Jun 01, 2015", "userURL": "http://www.goodreads.com/user/show/11708867-jason-parent", "userReview": "This was fantastic. I wouldn't say it was better or worse than the show. I think the two complement each other nicely. There the same, but different. ;)"}, {"userName": "Alex Ristea", "userReviewDate": "Nov 15, 2012", "userURL": "http://www.goodreads.com/user/show/1669785-alex-ristea", "userReview": "I had no idea graphic novels could make me think about so many fundamentally human ideas.The Walking Dead has been one of my favourite things lately, and it all comes down to one thing: character.A zombie apocalypse is a great premise and a fantastic vehicle for exploring human nature, and Kirkman really went to town in this series. Because it's not about exploring the zombie theme. The world-building is next-to-none, and there are scant details about any of the larger issues around the world. It's about the people and their struggles.This is important.The Walking Dead is about love, hate, fear, betrayal, hope, and a gazillion other emotions all rolled into one. Almost all of the conflict stems from the protagonists themselves, and how they deal with the situations they find themselves in. It delivers in a way that's borderline genius—the dialogue alone is so incredibly real that I simply can't compare it to anything else.Also, let's all collectively tip out hats to the writers here for going head-to-head with George R.R. Martin and not batting an eye. You thought A Song of Ice and Fire crushed and destroyed everything you ever loved? Give this a try and tell me what you think.Two thumbs up, and my two big toes too."}, {"userName": "Samantha A", "userReviewDate": "Feb 11, 2014", "userURL": "http://www.goodreads.com/user/show/3215104-samantha-a", "userReview": "Oh. My. God. I can't even. My feels are completely broken after reading this.. How can I possibly wait until MONDAY to get my hands on Compendium 2? EVERYTHING I LOVE DIES. It's like, I heard some of these things were going to happen, but WHEN they happened I couldn't help but cry. This was my first experience with graphic novels and it's not going to be my last!!"}, {"userName": "Chris", "userReviewDate": "Mar 10, 2011", "userURL": "http://www.goodreads.com/user/show/93902-chris", "userReview": "Okay, I'm going to say this right up front, and everyone can get as huffy as they'd like: it's all true.The Walking Dead is highly overrated.The writing is melodramatic as all get-out. I didn't get the impression that the writers had any idea what characters they had intended to survive - it's an amateurish device to kill off your characters, particularly given how dependent the story becomes upon characters constantly dying. Sure,it's meant to convey the new reality - but we all know how zombie movies and post-apocalyptic scenarios work... lots of people die, because it's no longer a friendly world in which everyone can survive without a thought. Killing off so many characters, when you've already got a very small cast, just strikes me as emotionally manipulative. In a movie, it's cool with me; your commitment is two hours or less and it doesn't really matter if the entire character cast ends up butchered or eaten alive. In a long-running series of books or comics, it's cliched and awful.Consider this: the human body cannot tolerate constant adrenaline. Similarly, the average reader is not interested in persistent drama! When there is absolutely no down-time, you cannot make an impression. It's why popular music structure is as it is - you can't have constant choruses because it would be tedious and boring. As such, I found the constant action and drama in The Walking Dead rather droll.The dialogue is awkward and often very poorly written. The only time I found myself thinking, \"I really liked that dialogue\" was when Lori finally tries to come clean with Rick - it was the only part that seemed even mildly true to how a conversation works, and how people really interact. What really bothered me about the writing was how flippin' awkward it could be - it's riddled with sentence structure issues and redundant phrasing. I frequently had to re-read dialogue bubbles just to figure out what had been intended.I hated how the characters were penciled so inconsistently. Glenn in particular is either a fairly good-looking Asian kid, or a chubby and unattractive white boy. What the fudge? He's not a difficult character to draw - I mean, he doesn't even have hair. C'mon - a little more effort, please?I was really psyched to hear about this series - I love Romero-style zombies and I've always been a very big fan of post-apocalyptic literature. Generally, I liked elements of The Walking Dead, but the particulars are just sloppy and distracting. I've mostly lost interest in the television show since picking up the comic. Maybe I'll come back to it after finishing the entirety of the comic."}, {"userName": "Scott Rhee", "userReviewDate": "Feb 10, 2013", "userURL": "http://www.goodreads.com/user/show/5717792-scott-rhee", "userReview": "I'm probably not going to add too much more to all that's been said about this graphic novel/ TV show, other than to say that, yes, I am one of THOSE types who religiously watch the show and eagerly await every Sunday night like it was Halloween. I was hooked from the pilot (which is hard to believe was three years ago), and have been dutifully following the heart-stopping and gut-wrenching escapades of Rick and his family and the band of survivors that fans have grown to love (and, in some cases, hate).It took me a while to read the comics because I didn't want to breeze through them to find out what would happen next on the show, which has, for the most part, remained faithful, if not to the exact story then the basic spirit of Robert Kirkman's graphic novel. Of course, I have heard many fans argue that Frank Darabont, the director/producer of the TV series, has deviated too far from Kirkman's story. Personally, having read the first 48 issues in this giant first compendium, I have to disagree with those fans. I think Darabont has done a terrific job bringing those characters to life and keeping the basic structure, theme, and tone that Kirkman and the team of great artists (Tony Moore and Charlie Adlard) set within the first five issues. Indeed, I think Darabont has actually improved, in many ways, upon the graphic novel.I'm not going to lie: parts of the graphic novel seem to me a bit lacking. Some of the dialogue is hackneyed, and some of the characters never get the chance to be fully realized the way they are portrayed on the show. That aside, it's still a terrific comic book series, one that deftly balances the human drama with the graphic zombie violence that zombie fans (such as myself) come to expect. Perhaps this is why a director like Darabont---best known for his adaptations of several Stephen King works, two of which were nominated for Best Picture---saw the potential for a great drama-filled TV show."}, {"userName": "Licha", "userReviewDate": "Nov 10, 2014", "userURL": "http://www.goodreads.com/user/show/5614272-licha", "userReview": "I don't know that there's much I could add to this in terms of a review. This book was fantastic and has had me in its grips for the past few days. When I feel like I'm one of the characters in the story, the author has accomplished more than just telling a story. This is so much more than just a story about zombies, it's about how society gets built back up in a world that is no longer safe, a world where sacrifices must be made and losses endured, a world where every minute of the day you have to be on alert. At the end of the day, the sad realization that it's not the zombies who are the monsters, but the humans who turn on you, that you have to watch out for. Highly recommended, whether you're a fan of the show or not."}], "description": "Koliko sati u danu ne gledate televiziju? Kad smo se posljednji put ZAISTA potrudili dobiti nešto što smo željeli? Koliko je vremena prošlo otkad smo zaista TREBALI nešto što smo ŽELJELI?Svijeta kakvog smo poznavali više nema.Svijet trgovine i frivolnih potreba zamijenio je svijet preživljavanja i odgovornosti.Epidemija apokaliptičnih proporcija pomela je Zemlju, a mrtvi su uskrsli i hrane se živima. Za nekoliko mjeseci društvo se rasulo - nema vlade, nema dućana s namirnicama, nema pošte, nema kablovske.U svijetu kojim vladaju mrtvaci, prisiljeni smo napokon početi živjeti.Ovo izdanje sadrži epizode 1-48 ovog ultrapopularnog zombie hita!", "title": "Živi mrtvaci: Prvi omnibus\n      \n          (The Walking Dead: Compendium editions #1)", "url": "https://www.goodreads.com/book/show/23849953-ivi-mrtvaci", "average": 4.43, "cover": "https://images.gr-assets.com/books/1418622351l/23849953.jpg", "reviews": 2269, "authors": [{"url": "https://www.goodreads.com/author/show/12425.Robert_Kirkman", "name": "Robert Kirkman"}, {"url": "https://www.goodreads.com/author/show/16965.Tony_Moore", "name": "Tony Moore"}, {"url": "https://www.goodreads.com/author/show/16962.Charlie_Adlard", "name": "Charlie Adlard"}, {"url": "https://www.goodreads.com/author/show/16966.Cliff_Rathburn", "name": "Cliff Rathburn"}, {"url": "https://www.goodreads.com/author/show/1425943.Tatjana_Jambri_ak", "name": "Tatjana Jambrišak"}], "type": ["Sequential Art", "Sequential Art", "Horror", "Fiction", "Apocalyptic"], "outlinks": ["http://www.goodreads.com/book/show/23849953-ivi-mrtvaci", "http://www.goodreads.com/book/show/6465707-the-walking-dead-compendium-1", "http://www.goodreads.com/book/show/138398.The_Walking_Dead_Vol_1", "http://www.goodreads.com/book/show/30071.The_Walking_Dead_Book_One", "http://www.goodreads.com/book/show/138396.The_Walking_Dead_Vol_2", "http://www.goodreads.com/book/show/30069.The_Walking_Dead_Vol_3", "http://www.goodreads.com/book/show/1894269.The_Walking_Dead_Vol_8"]}