{"ratings": 963, "userreviews": [{"userName": "Makis Dionis", "userReviewDate": "May 27, 2018", "userURL": "http://www.goodreads.com/user/show/13556007-makis-dionis", "userReview": "Συχνά νιώθω πως η χαρά είναι πράξη έσχατης προδοσίας, πως είμαι ένοχος επειδή έχω το προνόμιο να είμαι ακόμα ζωντανός και ελεύθεροςΟι μεθυσμένοι ήταν όλοι ήρωες της ελευθερίαςΕκείνο τον καιρό δεν φανταζομουνα πως τα βασανιστήρια θα γίνονταν εθνικό έθιμο. Δεν ήξερα ότι οι φυλακές και τα στρατόπεδα της Ουρουγουάης θα προξενούσαν διακοπή ρεύματος από την υπερβολική κατανάλωση ηλεκτρικού.Το ΣύστημαΠοιοι βασανίζουν; Όχι βέβαια πέντε σαδιστές. Οι στρατιωτικοί μετά το ωράριο τους πάνε σπίτι τους. Οτιδήποτε αποτελεσματικό είναι καλό, διδάσκει η μηχανή. Ο βασανισμός είναι αποτελεσματικός: τσακίζει το ηθικό, σπέρνει το φόβο. Γεννά και αναπτύσσει μια συνενοχή σκοτεινής τελετουργίας. Όποιος δεν βασανίζει θα βασανιστεί.Η μηχανή δεν δέχεται ούτε αθώους ούτε μάρτυρες."}, {"userName": "عبدالرحمن عقاب", "userReviewDate": "Feb 26, 2018", "userURL": "http://www.goodreads.com/user/show/16960199", "userReview": "تضجّ كتب \"إدواردو غاليانو\" بالذكريات؛ ذكريات الحبّ والحرب، ذكريات الحياة والموت، ...ذكريات ‏الظُلم والقهر والمقاومة. ‏يكتب \"غاليانو\" ذكرياته؛ ذكريات \"أميركا الجنوبية\" ذات الشرايين المفتوحة. حسب تعبيره في اسم ‏كتابه الأهمّ والأبرز. الكتاب الذي تفهم به باقي كتابات \"غاليانو\" وسردياته الرائعة البديعة. وهو الكتاب ‏الذي يجب أن نقرأه كعرب حتى نعلم أنّ قصّتنا مع الغرب وأميركا ليست إلا إعادة لذات السيناريو الذي ‏كان هناك، ولكن باستخدام تقنيات العصر الحديث وألوانه ومصطلحاته. ‏يكتب \"غاليانو\" ذكرياته التي يُسمّيها \"سُمّي وطعامي\". يكتبها ليصرخ ومن معه في وجه من (اختطف ‏الذاكرة لكي لا تعرف الضحية من أين أتت! ولا إلى أين تذهب؟!)، يصرخون ليقولوا (كنّا هنا وكنّا هكذا). أما أسلوب \"غاليانو\" فأسلوب مكثّف يراوح بين القصة القصيرة جدًا والخاطرة. ذلك النوع من القصص ‏والخواطر التي تتركك مندهشًا ساهمًا؛ تسأل : هل حدث هذا حقًا؟!. يجمع بين قصصه وخواطره ‏صوت \"الإنسان\" المرهف إذ يلتقط نبض القلوب الحيّة، وألم القلوب المعذّبة، ورجفة القلوب الخائفة، ‏وحنين القلوب العاشقة. ولم يحصر \"غاليانو\" نفسه بقضيةٍ دون أخرى، ولا بشعبٍ دون آخر، فكان ‏بذلك \"إنسانًا\" عالميًا بحقّ. إنّه \"صيّاد القصص\" الواقعي، يكتب عن واقعٍ غالبًا ما يكون أغرب من الخيال. وفي كتابه هذا –وهو ليس ‏أفضل كتبه- يكتب \"غاليانو\" قصصًا حقيقية من ذكرياته عن سنوات القهر والظلم التي عاشتها شعوب ‏أميركا الجنوبية تحت حكم الطغاة الذين خلفوا الاستعمار في بلادهم. فأكملوا سيرة الشقاء، واحتفظوا ‏بالشرايين مستباحةً ومفتوحة. ككلّ كتب \"غاليانو\" لا تملك -وأنت تتركه على موعدٍ قريب بلقاءات تتجدّد بإذن الله- إلا أن تقول : يا له ‏من كاتب! ويا لها من قصصٍ وخواطر و.....حقائق!‏"}, {"userName": "Kutşın Sancaklı", "userReviewDate": "Aug 16, 2016", "userURL": "http://www.goodreads.com/user/show/27236756-kut-n-sancakl", "userReview": "Heykeltıraş, koskocaman bir atölyenin içinde etrafı çocuklarla çevrili olarak çalışırmış. Günün birinde ... şehrin meydanlarından birine dikilmek için büyük bir at heykeli sipariş edilmiş. Bir kamyon, devasa bir granit bloğu onun atölyesine getirmiş. Heykeltıraş bir merdivene çıkıp çekiç ve keskiyle taşı yontmaya başlamış. Çocuklar ... geri döndüklerinde heykeltıraş onlara atın bitmiş halini göstermiş.Çocuklardan biri, fal taşı gibi gözleriyle ona sormuş: 'Peki ama.. O taşın içinde bir at olduğunu nereden biliyordun?'Galeano da, insanın içine taş gibi oturan acılardan umudu, coşkuyu ve mücadeleyi çıkarmaya devam ediyor.."}, {"userName": "Ahmed Oraby", "userReviewDate": "Dec 30, 2016", "userURL": "http://www.goodreads.com/user/show/8711518-ahmed-oraby", "userReview": "من أحب أعمال المرحوم جاليانو إلى قلبي. نصوص بعضها مترابطة وأغلبها ليس كذلك، لكن العامل المشترك هو سفالة السياسيين وفحش الأنظمة كتاب كئيب ولذيذ"}, {"userName": "Reem  ♥", "userReviewDate": "Feb 16, 2018", "userURL": "http://www.goodreads.com/user/show/59722693-reem", "userReview": "مجموعة من حوارات الساحر غاليانو مع ذاكرته......لا يمكن لنصفي أن يوجد دون النصف الآخر .. هل يمكن أن تحب الخلاء دون أن تكره القفص ؟ أن تحيا دون أن تموت .. أن تولد دون أن تقتل ؟ في صدري ساحة ثيران .. الحرية تصارع الخوف .....كم مرة اختلطت علينا الشجاعة بالرغبة بالموت ؟ الموت الذي خطفني مرتين وتركني مازال يناديني في كثير من الأحيان وأنا أرسله إلى الساقطة التي أنجبته.....القمر المكتمل يحرض الكلاب !....كنت تريد نارا وأعواد الثقاب لا تشتعل . ما من عود ثقاب واحد أعطاك نارا . كل أعواد الثقاب كانت مقطوعة الرأس أو مبللة .❤"}, {"userName": "Mohamed Shady", "userReviewDate": "Jan 08, 2016", "userURL": "http://www.goodreads.com/user/show/16618303-mohamed-shady", "userReview": "غاليانو مش عايز يجيبها لبر"}, {"userName": "Eslam Mohammed", "userReviewDate": "Jul 18, 2016", "userURL": "http://www.goodreads.com/user/show/12518819-eslam-mohammed", "userReview": "إدواردو جاليانو حكاء عظيم.هذه جملة لابد أن تتصدر أية مراجعة نقدية،أو تدوينة إنطباعية أكتبها عن أحد كتب جاليانو،وكلها..كلها كتب مهمة وعظيمة سواء بسواء.كتاب جاليانو هذه المرة عبارة عن حوار،ليس بسؤال وجواب،وإنما حوار الكاتب مع ذاكرته الشخصية من جانب،ومع الذاكرة الجمعية لقارة شهدت مآس ومهازل لا عد لها ولا حصر وربما لا نظير وهي أميركا اللاتينية.كتابة جاليانو تجمع النقائض بفرادة أحسُده دوما عليها،فكيف يتأتي لكاتب ما أن يُزاوج بين الإمتاع والتخويف،الإضحاك والإيلام،غرس الأفكار وتجذير كل معانى عدم الإكتراث،الإلهام والتحريض على ألا تكون مثالا يُحتذى لأي أحد.جاليانو من الكتاب القلائل الذين بوسعي وبأريحية أن أؤكد لك أنك كقاريء،ستغير من نظرتك تماما لكتابة التاريخ ومن يكتبونه عندا تقرأ له،وأنك ككاتب ستعيد النظر في مفهومك عن الكتابة ومالها من جدوى وما عليها من إستنزاف لروح من يستسلم لغوايتها بعد أن تقرأ لهذا الرجل.جاليانو لا يدعي أنه يفعل الإستثناء،أو يأتي بما لم يسبقه أحد إليه،وفي هذا تحديدا يمكن تفرد الرجل وتميزه.كتب جاليانو تصلح معظم أجزائها للإقتباس،وحقيقة من كثرة الإقتباسات التي قمت بحصرها،فسيكون لزاما علي أن أنقل معظم نصوص الكتاب هاهنا وهذا ليس بميسور ولا معقول بطبيعة الحال.عن ذاته المتشظية،ذاكرته الجاثمة بثقلها فوق روح اللحظة الحاضرة،وماضيه الذي يأبي إلا أن ينعكس في كل مرآة يحدق بها يحدثنا جاليانو.عن شخصيات عديدة وأرواح معذبة ونفوس نقية وقلوب شجاعة نالها ما نالها في سبيل أن تقول لا أو ألا تقول نعم يحدثنا جاليانو.الكتاب في ظاهر نصوصه لا رابط بين أجزائه،وربما يصعب بالفعل أن نجد رابطا محددا بين الشخصيات والأحداث اللهم إلا أن كل هؤلاء شكلوا مسيرة هذا الرجل.وصنعوا بأقدارهم ولحظاتهم الحلوة والمرة دروبا ومنحنيات ساهمت بقدر في صياغة التاريخ الشخصي لكاتب الكاتب ،والتاريخ الجمعي للقارة المعذبة والمبتلاة بحكم الديكتاتوريات وأذناب المستعمر منذ الزمن القديم.كتابة جاليانو فرضُ قراءتها لمن يقطنون عالمنا العربي تحديدا،لأننا لو غيرنا أسماء الشخصيات وأماكن الأحداث لوجدنا الرجل يتحدث عنا،عن تاريخنا نحن،وعن عين المظالم والمخازي،لا فارق إلا في الهوامش عوضا عن المتن.\"أن تبقى حيا،الأمر يستحق المعاناة\".كلمات بسيطة لكنها تقول الكثير،هكذا هي إقتباساته وهكذا هي كتابات هذا الكاتب العظيم."}, {"userName": "Argos", "userReviewDate": "Oct 02, 2017", "userURL": "http://www.goodreads.com/user/show/16156347-argos", "userReview": "Sohbet tarzında ağırlıklı olarak anıların paylaşıldığı bir kitap. Galeano'nun temiz uslubuyla Latin Amerika'da 70'li yıllarda yaşanılanları okuyoruz. Faşizm her yerde aynı, askeriyle- polisiyle aynı veya benzer yöntemlerle ilerici veya muhalif herkesi eziyor veya yok ediyor. Biz askeri darbeler 12 Mart ve 12 Eylül'de, ve 90'lı yıllarda Çiller-Ağar döneminde yaşamıştık kitapta anlatılanları. Sinirlerinizi bozacağını kabullenirseniz okuyun."}, {"userName": "Mena Shawky", "userReviewDate": "Mar 26, 2017", "userURL": "http://www.goodreads.com/user/show/49759150-mena-shawky", "userReview": "هل ستسمح لنا الذاكرة بأن نصبح سعداء؟لا بدّ أن الرقة عصبٌ. عصب ينقطع ولا يُخاط. عرفت قلة من الرجال الذين كان\" \".باستطاعتهم أن يجتازوا اختبارات الألم والعنف، مأثرة نادرة مع الرقة التي لا تُهزم.يُذوّب إدواردو جاليانو الناس والذاكرة ويصنع كأساً ثقيلة تتجرعها منتشياً وحزيناً.يواجه الديكتاتورية وحده مستعيناً بذاكرته مؤكداً أنها سلاحه الأهم والأقوىيعرّي الأشباح في ليالي ونهارات بوينس آيرس ومونتيفيديو وسانتياجو وبرازيليا.وباقي مدن أمريكا اللاتينية التي أرهقتها الديكتاتورية - يسميها الألةأريد أن يشعر القارئ بأن التاريخ يحدث بينما الكلمات تحكيه. أن يشعر أن التاريخ يهرب من المتاحف\"ويتنفس ملء رئتيه؛ أن الماضي يصبح حاضراً. أمريكا اللاتينية لم تعان فقط من سرقة الذهب والفضةوالمطاط والنحاس والنفط. لقد صادروا ذاكرتها. اختطفوا ذاكرتها أيضاً. كي لا تعرف من أين أتت\"وكي لا تستطيع أن تعرف إلى أين تذهبشركة مانيلا للمعادن، التي أسقطت في البرازيل حكومتين، جعلتهم\"\"يعينون موظفاً من الشركة وزيراً للاقتصاد في جواتيمالاالجلاد موظف. الديكتاتور موظف. بيروقراطيون مسلحون يفقدون وظائفهم إن لم ينفذوا مهمتهم بكفاءة\"\"هذا ولا شئ غير هذا. ليسوا وحوشاً استثنائيين. لن نهديهم هذه العظمةتعلم الألة أن من يكون ضدها هو عدو البلاد. من يدين الظلم يرتكب جريمة ضد الدولة\"أنا البلاد، تؤكد الآلةمعسكر الأعتقال هذا هو البلد: مكب النفايات هذا، وهذا القفر الشاسع الخالي من الرجال\".ابن ساقطة كل من يعتقد أن الوطن بيت للجميع=======================================لا توجد كتابة جيدة كلها تناضل ضد السلطة والاستبداد، إنما يصنع جاليانو.لوحة فنية غاية في الإتقان والأناقة تعانق حياة الناس وتلتقط منها الإشارات،حكَاء بارع يسخر من الحياة والجنرالات والآلهة ويقدمهم نبيذاً معتقاًقصص كثيرة لا تكتمل ولا يُشار فيها إلا إلى حدث واحد. وجمل كثيرة قصيرةتصنع وحدها قصصاً طويلة غير محكيةلماذا ينوح الحمام عند الفجر؟\"لأن عُكليّاً (ذكر الحمام) ذهب ذات ليلة مع حمامة إلى حفلة راقصة، وقتلَ العكليَّ أحدٌكان يكرهه في مشاجرة. كان الرقص لطيفاً جداً، ولم ترغب الحمامة أن تتوقف عنالانشراح. (سأغني هذه الليلة - قالت - وسأبكي في الصباح) وبكت عندما\".أطلت الشمس في الأفق كان الساحر بوبو كاتارينو يشهر قبضته على الرب ويدعوه\" \".بالجلاد والجزار لكنه في أعماقه كان يعرف بأن الأمر يتعلق بزميلالموت الذي خطفني مرتين وتركني، مازال يناديني في كثير من الأحيان\"\".وأنا أرسله إلى الساقطة التي أنجبته:ابنها ابن العشر سنوات سألها في ذلك اليوم، وهو ينظر إلى المسيح المصلوب\"\".أمي، هل كان هنا عندما دخل هؤلاء الرجال؟ كنت أظن أن هذه الأمور لا تحدث حيث يكونمؤخراً في مونتفيديو طلب طفل من والدته أن تعيده إلى المستشفى\" \"لأنه يريد أن يعود من حيث أتى============================: يجيب جاليانو عن سؤال المقدمة بأنه.كثيرة هي الأخطاء والآمال التي يجب دفع ثمنهاالسماء وحدها لا تكفي - يقول"}, {"userName": "Hany Adeeb", "userReviewDate": "Jul 18, 2016", "userURL": "http://www.goodreads.com/user/show/44680276-hany-adeeb", "userReview": "الكتاب هو سرديات ، فقرات متوسطة و قصيرة ، يحكي فيها إدواردو غاليانو قصص الكفاح و الاضطهاد للشعوب الامريكية ، مثل الارجنتين و اورجواي .. و البرازيل .. و يحكي قصص مقتل كثير من الناس الحالمين و الصحفيين و الكتاب و غيرهم من قاوموا الديكتاتوريات التي سلبت من البلاد النفط و الذهب و النحاس ، و صنعت الة قتل هي النظام العسكري و الكتاب يحتوي على ترجمة ليست جيدة ، و فقرات كثيرة ذات عنوان واحد ، و يمكنك ان تتشتت بسهولة ، لكن توجد فقرات رائعة و له حس ساخر و أحيانا ميلو دراما .. و وسط هذه السرديات تجد روح إدواردو غاليانو المبدعة .. في وصف طرق حياة أولئك الشخوص ... و برغم الهم و الحزن . لكنك ستجد معنى برغم كل هذه الفوضى حبهم لوطنهم و تضحيتهم و شغفهم و فقرهم .. جعلهم أحياء في ذاكرة من احبهم"}, {"userName": "Ezgi", "userReviewDate": "Aug 12, 2017", "userURL": "http://www.goodreads.com/user/show/33926495-ezgi", "userReview": "Güney Amerika ile ilgili bir şey okumayacağım deyip deyip okumaya devam ediyorum. İçim kararıyor. Rezaletlerin bu denli kanıksanması... Toplumların bizimki gibi tepkisiz hale gelmesinde işkencenin ve toplum bilincinin kırılması için yapılan sistematik çalışmaların gücü yadsınamaz. Bizim birkaç gömlek daha kötü halimiz oralar sadece. Temelde ise fazla anlayış farkı yok. Kitap dağınık pek çok anı içeriyor ama okuması keyifli."}, {"userName": "Bell", "userReviewDate": "Nov 21, 2007", "userURL": "http://www.goodreads.com/user/show/149183-bell", "userReview": "a 5 for the audacity in existing and daring, for making no apologies, for keeping it real and still finding pearls of wisdom and joy through it all.and for the profound reminder that writing and reading are still considered revolutionary acts in so many other parts of the world."}, {"userName": "Safa' Dalal", "userReviewDate": "Feb 14, 2018", "userURL": "http://www.goodreads.com/user/show/25915640-safa-dalal", "userReview": "الدكتاتورية والنظام الظالم واحد سواء في امريكا اللاتينية أو في بلادنا المتهالكة بؤسا، ولا أدري كيف نقوى على حمل عبء الذاكرة!'لا سيما وهي تطفح بالدم والقتل وكل ما يميت القلب، ويبقى لسان الحال يقول 'الله يلعن الظلم وكل من شارك فيهورغم عبثية الشتائم فنحن لا نمتلك غيرها حاليا.يكون على المرء أن يعارك بضراوة ليكسب خبزه وحلمه،يشعر بأنه جريح تنقصه أشياء كثيرة\"تجتاحك رغبة في البكاء وتتملكك لزاجة الحنين والموت، وتخاطر بأن تعيش ملتفتا برأسك إلى الوراء ،تعيش محتضرا وأنت تموت ،وهي طريقة تعطي الحق لنظام يحتقر الأحياء.علمونا في نفاق المآتم ،منذ أن كنا صبية، أن الموت يحسن الناس\""}, {"userName": "Asmaa Elwany", "userReviewDate": "Jul 13, 2017", "userURL": "http://www.goodreads.com/user/show/7796681-asmaa-elwany", "userReview": "الدكتاتورية هى عادة من عادات العار : انها آلة تجعلك اصم وأبكم غير قادر على ان تسمع عاجز عن ان تتكلم واعمى عن كل ما هو ممنوع النظر إليه"}, {"userName": "Alan-Without-Poe", "userReviewDate": "Jan 01, 2017", "userURL": "http://www.goodreads.com/user/show/57409802-alan-without-poe", "userReview": "\"Latin America has not only suffered the dispossession from gold and silver, of rubber and copper and from the oil. Also they have expropriated his memory.\"This book is the interpretation of the reality of Latin America. With his taboos, his peculiarities and his charm.\"The fat plum of pure juice that flood you of sweetness, it must be eaten, you teached me, with the closed eyes.You like to caress the peach and undress it to knife and you prefer the apples opaques so that one can rip them off the shine\"Every time I read this part I return to be that little boy who spent all his afternoon summers with his cousins playing under those sunny skies. Just to end eating the fruit of the season that our aunt always have it in her kithchen.\"Eat is just a body obligation. With you, it's a mass and a laugh.\"And not only is a rough point of view from the day to day of millions of latin americans. There have his parts of tenderness about love.\"Write, it has meaning? The question weighs on my hand....maybe writing be no more than an attempt of put at save, in the time of the infamy, the voices that will give testimony that we were here and we were like this.\"And as every person, I suppose, has faced this question, \"it has meaning what I do?\" And for this scenario, of the words, Mr. Galeano provide us the best answer.Yes, the year just has begun, but I strongly think that I've read my favorite book of 2017."}, {"userName": "أحمد شاكر", "userReviewDate": "Apr 01, 2017", "userURL": "http://www.goodreads.com/user/show/10655286", "userReview": "بي حنين لبلد لا وجود له حتى الآن على الخارطة. يقول غاليانو. إنه حنين المحب العاشق. أو حب الفتى الذي لم يعرف من قبل فتاة، فيصنعها في مخيلته على مثال لم يوجد من قبل. هذا ما يجعلنا نفكر في كتابات غاليانو على أنها صرخات حالم. لا يريد أن يرى البؤس والاستبداد يكتسحان بلده. في مكان آخر يقول: أنا لم أتوقع أن التعذيب سيصبح عادة وطنية. لكن إذا كانت الديكتاتورية عادة من عادات العار، تجعل الإنسان أصم وأبكم، عاجزا عن أن يتكلم وأعمى، فلا مانع من أن يكون التعذيب آلة ضبط عادية، تخدم النظام. غاليانو صياد كلام. يقول عن نفسه: خلقت لهذا. ربما لهذا نجح في تلك المهنة الشاقة. لقد أدرك سر مهنته. وسر خلوده من بعد."}, {"userName": "Sarah saied", "userReviewDate": "Sep 09, 2017", "userURL": "http://www.goodreads.com/user/show/29240052-sarah-saied", "userReview": "إنها ساعة الأشباح.أستحضرها. أطاردها...ثم أصطادها.أرسمها بالتراب والدم علي سرير الكهف.أطل علي نفسي بعيني الإنسان الأول.وأشعر طوال الاحتفالية بأن ذاكرتي تتسع لكل تاريخ العالم.منذ أن حك ذلك الإنسان حجرين. ليتدفأ بالنار الأولي..غاليانو ...دائما وأبدا"}, {"userName": "Peggy", "userReviewDate": "Mar 23, 2013", "userURL": "http://www.goodreads.com/user/show/2272233-peggy", "userReview": "So this is what it was like to live in the southern cone during its dirty little war against the young. At first the fragmented, sparse, understated narrative voice reminded me of Henri Michaux and Jean Rhys. Later, I realized that the narrator is numb most of the time, due to the war waged against love, against the poor, against joy, by the machine, which is power, and which represents a major player in Latin American history. This book was first published in translation in 1983 and describes Galeano's experiences in the 1970s, when he lived in Argentina as an exile from his native Uruguay. He was the editor of Crisis, a political-cultural magazine published in Buenos Aires, and his work has him traveling throughout Latin America. Some of the people he meets and describes include Che, Salvador Allende, \"the old man\" (a disguised Borges, I think) as well as those who are not so famous, whose careers were abbreviated by their unfortunate citizenship in countries where thinking was punished by death. The book tells about Galeano visiting a cafe in Santiago, for example, and meeting a friend after months apart, and having a conversation in which that friend relays her kidnapping and mock execution. The bodies of writers he has edited are fished out of rivers. Danger is always there, but in a banal, quotidian way--it's just life, it's the way the machine works. Someone is kidnapped at night, tortured, returned after two days. Another is not returned, but killed, along with his young son. Despite the horror and fear, there are nights of love with friends and strangers. Though many of these unions are brief affairs, the connections sustain him. Moments of tenderness, warmth, friendship and loyalty exist, even in this dirty war. Love is a rebellion against the machine, which views humans as slaves to be used and destroyed. The machine does what it can to annihilate the creative, caring community of humankind in the service of death and profit. Galeano remembers the heat of a woman's body and draws strength from the memory to pick up pen once more to write and share the stories of his time and place with the future. Recommended for all who are interested in 20th century Latin American history."}, {"userName": "Gautam Bhatia", "userReviewDate": "Feb 11, 2016", "userURL": "http://www.goodreads.com/user/show/33867873-gautam-bhatia", "userReview": "“Every day one of the prisoners stood up and read to the others. I wanted to tell you, Don Alejo, that the prisoners chose to read El siglo de las luces (Explosions in the Cathedral) and couldn’t. The guards allowed the book in, but the prisoners couldn’t read it. I mean, they began it several times and had to put it down. You made them feel the rain and smell the violent fragrances of the earth and the night. You brought them the sea the roar of the waves breaking against the keel of a boat and you showed them the throbbing of the sky at daybreak, and they couldn’t keep reading this.”Replicating a fractured life in a fractured continent, Eduardo Galeano’s Days and Nights of Love and War is a memoir of discontinuous and fragmentary anecdotes, impressionistic, almost aphoristic at times. To use Mourid Barghouti’s memorable phrase while entering Palestine from exile, Galeano’s work is an attempt to “collect my scattered fragments as I would collect the flaps of my coat together on an icy day or as a pupil would collect his papers scattered by the wind of the fields as he comes back from far away.” Barghouti goes on to talk about collecting “the days and nights of laughter, of anger, or tears, of foolishness, and of marble monuments…” – and that is exactly what Galeano’s impressionistic, discontinuous, almost aphoristic narrative tries to achieve. “My memory will save what is worthwhile,” he writes in the beginning, “My memory knows more about me than I do. It doesn’t lose what deserves to be saved.”Full review here: https://anenduringromantic.wordpress...."}, {"userName": "Atilio Frasson", "userReviewDate": "Oct 27, 2015", "userURL": "http://www.goodreads.com/user/show/25673312-atilio-frasson", "userReview": "Guerra de la calle, guerra del alma¿Cuántas veces he sido un dictador? ¿Cuántas un inquisidor, un censor, un carcelero? ¿Cuántas veces he prohibido, a quienes más quería, la libertad y la palabra? ¿De cuantas personas me he sentido dueño? ¿A cuántas he condenado por cometer el delito de no ser yo? ¿No es la propiedad privada de las personas más repugnante que la propiedad privada de las cosas? ¿A cuanta gente usé, yo que me creía tan al margen de la sociedad de consumo? ¿No he deseado o celebrado, secretamente, la derrota de otros, yo que en voz alta me cagaba en el valor del éxito? ¿Quién no reproduce, dentro de sí, al mundo que lo genera? ¿Quién está a salvo de confundir a su hermano con un rival y a la mujer que ama con la propia sombra?Los libros de Eduardo Galeano se caracterizan porque existe una gran gama de emociones, pero en este libro, lo que más se puede encontrar es tristeza y melancolía. Esto se debe al momento en que se vivía cuando se publicó este libro (1978), donde varios países latinoamericanos sufrían los males de diferentes dictaduras militares. Por lo tanto, Galeano vuelve continuamente a amigos desaparecidos, a frustraciones, al miedo y al sistema que permite todo esos crímenes, que hace que lo que llega a existir de alegre en el libro, se transforme en oscuridad y añoranza.Un libro muy bueno que es una muestra de lo que se vivía en aquel entonces, donde las dictaduras buscaban matar a las ideas que se negaban a morir."}, {"userName": "Ege", "userReviewDate": "Feb 01, 2017", "userURL": "http://www.goodreads.com/user/show/28788107-ege", "userReview": "Galeano. Bellek yazari. Zamanlamam guzeldi bu kitap icin. Kolay bir okuma gibi duran cumlelerinin altinda bizim de siklikla yasadigimiz kaos var. O yuzden bazi bolumlerin, bazi cumlelerin sonunda durup dusunmek ve sindirmeye calismak isteyebiliyor insan. Aynalar'i da cok guzeldi ve Galeano Latin Amerika'nin guclu kalemlerinden birisi."}, {"userName": "Gabriel", "userReviewDate": "Apr 28, 2015", "userURL": "http://www.goodreads.com/user/show/4819184-gabriel", "userReview": "Libros que fluye con la melodia del autor, recobrando cada palabra perdida del horizonte a llegar y del monopolio de las dictaduras, los silencios y el sistema. Las penurias se apagan con llantos de palabras que a la vez producen crecimiento y creación. Este libro refleja eso."}, {"userName": "Zoe Hallez Williams", "userReviewDate": "Dec 02, 2008", "userURL": "http://www.goodreads.com/user/show/811370-zoe-hallez-williams", "userReview": "Amazing history. Eduardo Galeano is one of the best historians in existence"}, {"userName": "Gabrielle", "userReviewDate": "Jul 18, 2013", "userURL": "http://www.goodreads.com/user/show/6879980-gabrielle", "userReview": "I should like refined literature better. And indeed, Eduardo Galeano is a very good writer....but I hated it. The only reason I read this was for school (AKA not of my own free will)"}, {"userName": "Margaret Price", "userReviewDate": "Dec 13, 2007", "userURL": "http://www.goodreads.com/user/show/681840-margaret-price", "userReview": "my favorite book. of all time."}, {"userName": "Emre", "userReviewDate": "Aug 16, 2016", "userURL": "http://www.goodreads.com/user/show/22628955-emre", "userReview": "3.5"}, {"userName": "Juliano Silva", "userReviewDate": "Jan 05, 2018", "userURL": "http://www.goodreads.com/user/show/64518870-juliano-silva", "userReview": "Em \"Dias e Noites de Amor e de Guerra\" Galeano conta histórias suas e de seus amigos, o palco são as diversas ditaduras na América Latina dos anos 60. De forma melancólica e poética ele conta sobre torturas, prisões e mortes de companheiros e ídolos.Além disso também conta histórias de amor, esperança e luta por uma América livre.De forma simples o livro também mostra como o sistema controla as pessoas e bloqueia seu pensamento para manter o controle. \"Dias e noites de Amor e de Guerra\" é um livro rápido, fácil e gostoso de se ler, Galeano rapidamente entretém o leitor transmitindo suas emoções passadas em uma época de horror."}, {"userName": "Νίκος Βλαχάκης", "userReviewDate": "Apr 24, 2018", "userURL": "http://www.goodreads.com/user/show/47824479", "userReview": "Conversation I either heard or imagined during those days:“A revolution from sea to sea. The whole country up in arms. And I intend to see it with my own eyes...”“And will everything, everything change?'“To the roots.”“And we'll no longer have to work for nothing?”“Of course not.”“Nor put up with being treated like animals?”“No one will own anyone else.”“And the rich?”“There won't be any more rich.”“And then who is going to pay the poor for their crops?”“There won't be any more poor. Don't you see?”“No rich, no poor.”“No poor, no rich.”“But Guatemala won't have any more people then. Because here, you know, whoever isn't rich is poor”."}, {"userName": "Nia Ita", "userReviewDate": "Apr 25, 2018", "userURL": "http://www.goodreads.com/user/show/63377407-nia-ita", "userReview": "Galeano is a Latin American literary titan. He used the word as a means of resistance in a time where speaking truth was an act of treachery. I found some gems in this lyric memoir but wouldn’t recommend it for everyone. It was a slow-paced, hard read. The organization was disorienting. 80 percent of the time I didn’t know where or when something was taking place. Even still, Galeano was a leading light in the world and his skill is undeniable.Instagram: @_niaitaTwitter: @_niaitawww.niaita.net"}, {"userName": "Mehmet Furkan Kocaaslan", "userReviewDate": "May 18, 2017", "userURL": "http://www.goodreads.com/user/show/24397502-mehmet-furkan-kocaaslan", "userReview": "''Kısa bir zaman önce Eric'in oğlu oldu. Adı Felipe.'20 yıl sonra' diyor, 'bugün yaşadıklarımızı ona anlatacağım.Ona ölmüş ve hapse atılmış arkadaşlardan, ülkelerimizde yaşamın ne kadar zor olduğundan bahsedeceğim.İstiyorum ki benim gözlerime baksın, bana inanmasın ve yalan söylediğimi haykırsın. Yegane kanıt onun burada bulunmuş olması olacak ama bunların hiçbirisini hatırlamayacak. İstiyorum ki vaktiyle bütün bunların mümkün olduğuna inanamasın' ''Pek söze gerek yok zaten, yine okunması gereken Galeano kitaplarından biri. Canlı bir tarih anlatımı."}], "description": "Η εξορία με έμαθε να έχω όλο και μεγαλύτερη μετριοφροσύνη και υπομονή. Πιστεύω πως η εξορία είναι μια πρόκληση. Αρχίζει σαν περίοδος τιμωρίας, με αφετηρία μια ανικανότητα ή μια ήττα, και χρειάζεται πολλή ταπεινοφροσύνη και υπομονή για να μετατραπεί σε χρόνο δημιουργίας, και να την αποδεχτείς σαν ένα νέο μέτωπο αγώνα. Τότε καταφέρνεις να κοιτάξεις μπροστά, και ανακαλύπτεις πως η νοσταλγία είναι καλή, ένα δώρο, σημάδι πως δεν γεννήθηκες σε σύννεφο, όμως η ελπίδα είναι ακόμη καλύτερη.Εναλλάσσοντας ρεπορτάζ προσωπογραφικές βινιέτες, συνεντεύξεις, οδοιπορικά και λαϊκές αφηγήσεις, με μια γραφή που τη διαποτίζει άλλοτε ο θυμός, η οδύνη, η ειρωνεία και άλλοτε το χιούμορ, ο Γκαλεάνο αποτίει φόρο τιμής στο κουράγιο και την αποφασιστικότητα εκείνων που δεν έπαψαν να πιστεύουν στην ανθρώπινη αξιοπρέπεια, και αγωνίστηκαν γι' αυτήν.Οι \"Μέρες και νύχτες αγάπης και πολέμου\" είναι ίσως το μοναδικό αυτοβιογραφικό βιβλίο του εμβληματικού Ουρουγουανού συγγραφέα, ένα είδος \"συνομιλίας με τη μνήμη του\" όπως χαρακτηριστικά λέει ο ίδιος. (Από την παρουσίαση στο οπισθόφυλλο του βιβλίου)", "title": "Μέρες και νύχτες αγάπης και πολέμου", "url": "http://www.goodreads.com/book/show/40130520", "average": 4.29, "cover": "https://images.gr-assets.com/books/1526460422l/40130520.jpg", "reviews": 86, "authors": [{"url": "https://www.goodreads.com/author/show/5822041.Eduardo_Galeano", "name": "Eduardo Galeano"}, {"url": "https://www.goodreads.com/author/show/6869534._", "name": "Ισμήνη Κανσή"}], "type": ["History", "Nonfiction"], "outlinks": ["http://www.goodreads.com/book/show/40130520", "http://www.goodreads.com/book/show/28489359", "http://www.goodreads.com/book/show/24371075-a-k-n-ve-sava-n-g-nd-z-ve-geceleri", "http://www.goodreads.com/book/show/218181.Days_and_Nights_of_Love_and_War", "http://www.goodreads.com/book/show/27235907-d-as-y-noches-de-amor-y-de-guerra", "http://www.goodreads.com/book/show/25358093-d-as-y-noches-de-amor-y-de-guerra", "http://www.goodreads.com/book/show/662967.D_as_y_noches_de_amor_y_de_guerra", "http://www.goodreads.com/book/show/15738997-dias-e-noites-de-amor-e-de-guerra", "http://www.goodreads.com/book/show/187149.Open_Veins_of_Latin_America", "http://www.goodreads.com/book/show/9554.Soccer_in_Sun_and_Shadow", "http://www.goodreads.com/book/show/9490.The_Book_of_Embraces", "http://www.goodreads.com/book/show/6149162-mirrors", "http://www.goodreads.com/book/show/264894.Upside_Down", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}