{"ratings": 125977, "userreviews": [{"userName": "Emily May", "userReviewDate": "Aug 10, 2017", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "“You’re deflecting.” I just stared at her. “You’re right that self isn’t simple, Aza. Maybe it’s not even singular. Self is a plurality, but pluralities can also be integrated, right? Think of a rainbow. It’s one arc of light, but also seven differently colored arcs of light.”\nThis is difficult to rate. Looking back, there were definitely certain aspects that I thought were done well, but I just didn't enjoy either the story or the uber-philosophical writing. Given that I consider three stars to be a mostly positive rating, I'm going with two.Turtles All the Way Down is really only for those looking for deep cell-level evaluation of human consciousness and personhood. To give him some credit, Green captures Aza's needling anxiety and compulsions very well. That little inner voice of doubt that causes you to question things you know until maybe you're not so sure is spot on. It's everything else around Aza's inner turmoil that feels like what it is - filler.It could very easily have been an interesting portrait of OCD and anxiety, but attempts to add a bizarre subplot of a missing billionaire (who is also the father of her childhood friend, Davis) don't disguise the fact that nothing really happens. I am not opposed to an introspective novel, especially in YA contemporary dealing with mental illness, but I cannot figure out why the author decided to add such a disjointed and nonsensical side story to the mix. Unless, of course, it is yet another \"deep metaphor\" for the nonsensical nature of anxiety, but I would have found Aza's story far stronger without it.The ludicrous and boring plot acts as a superficial backdrop for Green to play out the usual \"super precocious teens having philosophical conversations.\" Aza's mental illness and Green's philosophy bleed together into statements that are straddling the line between clever and nauseating:\nI guess I just don’t like having to live inside of a body? If that makes sense. And I think maybe deep down I am just an instrument that exists to turn oxygen into carbon dioxide, just like merely an organism in this . . . vastness.\nI had very little patience with hipster teens being hipster back when I was the age of these characters; I have even less now.I don't know why Green has to create such annoyingly unrealistic carbon copies of himself. Even secondary characters like Daisy quickly become annoying - calling Aza \"Holmesy\" in literally every sentence she speaks is extremely irritating. And these text messages between Aza and Davis:\nMe: You’re not your money.\t\t\t Him: Then what am I? What is anyone?\t\t\t Me: I is the hardest word to define.\t\t\t Him: Maybe you are what you can’t not be.\t\t\t Me: Maybe. How’s the sky?\t\t\t Him: Great. Huge. Amazing.\nIt's not even right to say these characters don't talk like teenagers because that makes it sound like teens can't possibly be this smart (and they definitely can), but these characters just don't talk like any people I've ever encountered anywhere. Of any age. They sound like what I imagine old buddhist monks to sound like.Green takes steps toward exploring the painful reality of living with a mental illness that deeply affects your everyday life and wellbeing, but it's sad that he pulls it back into the land of pretentious philosophical mumbo jumbo. For a while there, it felt real to me, and then it just became John Green talking to himself about the universe and the nature of \"self\". I guess I have to accept that early John Green - the kind who wrote Paper Towns - is a thing of the past.Blog | Facebook | Twitter | Instagram | Youtube"}, {"userName": "Ariel", "userReviewDate": "Oct 11, 2017", "userURL": "http://www.goodreads.com/user/show/6536286-ariel", "userReview": "I’ve been having a bad run with YA lately. I’ve loved it for so long that I persevere on, remembering that there are gems, that there are treasures, but increasingly I’ve found myself worried - have I grown out of it? Have I overdone it? Each novel seems to be repeating some unspoken pattern, or at least trying to make something new out of the same ingredients. It was with trepidation, then, that I wandered in to Turtles All The Way Down, thinking “yes, I’ve liked John Green books in the past, but maybe that was before I had grown tired of the same ingredients.” … NOPE. IT’S GREAT. YA IS ALIVE AND WELL. Like always, I’m thankful for Green’s refusal to dumb anything down. He treats his teenagers like adults because they are adults, or nearly are, and at the very least deserve the same respect as adults. When we are introduced to Aza’s life, and her way of living it, nothing is hidden. Her anxiety and mental health continue to be an unrelenting problem in the narrative because they are an unrelenting problem in her narrative. It doesn’t ease up, it doesn’t get fixed, and at times it is nearly physically painful to read about a sad girl who can’t get better. You do just want to reach into the pages and give her a shake, or a hug, and tell her to please get better. But that’s the point. She can’t. Or not forever. And that’s okay. Because she’s still lovely and wonderful and loved.I have a particular love for the ending. My dad and I agree that watching a good movie is more fun the second time. Now you know that every thing is going to be all right and you can just relax and enjoy it. I went into the ending so nervous that it would be cheesy, or unrealistically hopeful, or really unnecessarily sad. I was so surprised by an ending that moved on from being a teenager, looked at a life beyond teenage hood, that I nearly cried. I nearly cried because not enough teenagers hear that what they’re going through truly matters, but also that they'll be leading a completely different life very soon. It was something I told my brother constantly when he was still in high school and I had gone on to University and suddenly had to try and remember how hard high school had been. A note on technology: I feel very strongly about the use of technology in YA. It frustrates me to no end when a teenager “leaves their phone at home” or “runs out of data” or “doesn’t think to text someone something time sensitive.” It isn’t the way that teenagers function, it doesn’t make any sense, it ignores a huge part of the way that teenagers understand themselves and each other, and can you tell that I really care about it yet? John Green does the impossible here: he manages to include technology organically, to make it important to the story and to their lives, but without making it gimmicky. For that, I am also thankful.Finally, I am thankful for this representation of mental health. It is ugly, sad, disturbing, frustrating, but not hopeless. It isn’t everything (even though sometimes it is) and it’s honest. I am so happy, so unbelievably happy, that kids and teenagers and also adults will have this. That they will read it and feel understood, or empathize, or both. You know how we always want books to “make us better people”? To “show us new perspectives we couldn’t imagine”? Pick up Turtles All The Way Down.Full disclosure: I read an early version of the book and worked with John Green and his editor, and my name is in the acknowledgments! The posting of this review is unrelated to the work I did!"}, {"userName": "Hailey (HaileyinBookland)", "userReviewDate": "Oct 13, 2017", "userURL": "http://www.goodreads.com/user/show/21937982-hailey-haileyinbookland", "userReview": "The ShortTrigger warnings: anxiety, OCDWriting: 5 starsCharacters: 4.75 starsPlot: 4.5 starsOriginality: 4 stars(all out of 5 stars)The LongIt's hard to believe I just read a new John Green (JG from now on) book. My mind can't really wrap around that. (Especially given where I was 5 years ago, not even knowing BookTube existed, now I can't imagine my life without BookTube and being Hailey in Bookland). But it was a pleasure to read his writing again. He is extremely talented. I was super nervous going into this admittedly. After the smash success of TFIOS I couldn't imagine a more high pressure situation. Especially as I haven't absolutely loved all of his novels, I just didn't know where this one would fall for me. But I'm so happy that I loved it. It's definitely my favourite YA book on mental illness that I've ever read. What sets JG apart and makes him, IMO, a pioneer in the YA genre, is the fact that he writes knowledgable teenage characters. He doesn't discount teenagers as unintelligent due to their developing brains. He recognizes that teenagers, IRL, are able to comprehend complex concepts. (This may seem obvious, but I read a book on writing books for young readers recently and it emphasizes the fact that you have to use the most simplistic language possible so young teenage minds can understand it. BS. Teenagers are not dumb). Because of this, his characters are so startlingly relatable. I think Aza is an especially relatable character for me with her struggles with anxiety. The way JG describes her experiences with anxiety spoke to me so intensely. Specifically the metaphor of the spiral. Blew my mind in all honesty. JG definitely has a talent for metaphors, I never get sick of it. He's always had a way of finding the perfect words to describe that which seems indescribable. Seeing him use this technique regarding mental illness was fascinating. I think if you do, or ever have, suffered from mental illness, you will vastly appreciate his narrative. I found this story to be very different than JG's other novels. Not in a bad way at all, but the plot was much more subtle. There are two plots happening simultaneously really, one internally and one externally. You think you're following the one and then it turns out the other is the central focus. The way the two were interwoven was genius. I think this has been written in a way that will appeal to both the next generation of YA readers as well as the aging generation of YA readers. Typically JG's novels have the romance as a main focal point, and they really are some of my favourite romances, but here the romance takes a back seat. The front seat is occupied by Aza's own personal mental health journey. It was such a nice change. (That's not to say there is no romance, it's there but it's just not the main topic).Overall, this made me SO happy that John Green is returning to the world of YA. It was the most authentic representation of mental illness I've ever read and I'm so glad I went in with an open mind. You can tell he is writing about something he's extremely familiar with. I can't wait to see what he comes out with next (I hope he has plans to write more!)"}, {"userName": "Zoë", "userReviewDate": "Oct 18, 2017", "userURL": "http://www.goodreads.com/user/show/9303625-zo", "userReview": "Even though I just finished this book, I already know it's one that will stick with me for years to come. I can't fully express how cathartic this book was. I finally saw parts of myself represented in a novel - the parts that I was ashamed of and pretended didn't exist. This is by far my favorite John Green novel. I can't say much more about this because I'm still sobbing over it. Just read it, please."}, {"userName": "Hannah", "userReviewDate": "Oct 14, 2017", "userURL": "http://www.goodreads.com/user/show/38077205-hannah", "userReview": "My review is now up if you’d like to watch: https://youtu.be/T3t7Fhh2oiMI’m speechless. It’s stunning."}, {"userName": "Becca", "userReviewDate": "Oct 06, 2012", "userURL": "http://www.goodreads.com/user/show/6859920-becca", "userReview": "Let us play a little game called \"What could this book possibly about?\"First off, we can argue a bit about the setting. His early work would suggest that he prefers warm places, but over the years he has slowly migrated to the Midwest.We can assume that this time it will be set on the sun, for the conditions are best for cultivating our feels, and destroying our hope.Next, we can examine the characters. They must be the perfect combination of witty, socially awkward, beautiful, and of course, burdened with a great amount of tragedy and overwrought with pain. I'm guessing ex-convict and clown. Good pairingThe plot is tricky, you see, for this varies greatly book to book. The spectrum is quite wide. I'm going to guess it'll be a complex story that weaves together the lives of the ex-convict who becomes the first great poet in years, and the young circus clown who keeps having dreams of the constellation Hercules. Yes, this sounds about right. I think they will need to save the world from llamas. And the romance. One mustn't forget the romance. All you really need to know is it will break your heart. So, if I have guessed correctly, this book will be about a past criminal mastermind and a clown, living on the sun. Together they will stop llamas from taking over the universe.Or, y'know, worst comes to worst and it's twilight fanfiction. Whatever it is, I'm sure we will I CAN'T,\"ASFJSDFLK\" and feel all of the feels.UPDATE: So, we have a title. This is clearly about wimbleton and its philosophical after effects."}, {"userName": "emma", "userReviewDate": "Aug 10, 2017", "userURL": "http://www.goodreads.com/user/show/32879029-emma", "userReview": "actual review to come -----------PRE-REVIEWNOTE: i know what \"turtles all the way down\" means, i know that the spiral holds significance, and i know that this cover is still full-on ugly. please do not feel obligated to explain to me the wonderful intricacies i am missing. the only thing i am missing is my vision, because this cover is so ugly it blinded me-----------yes i am already biased against john green, but can we agree that this cover is straight up UGLY???and also:(i borrowed my sister's computer to say this)"}, {"userName": "Raeleen Lemay", "userReviewDate": "Jun 22, 2017", "userURL": "http://www.goodreads.com/user/show/3452652-raeleen-lemay", "userReview": "Not gonna lie, I’m tempted to flip right back to page 1 and read the book again. THAT NEVER HAPPENS TO ME."}, {"userName": "Emma Giordano", "userReviewDate": "Nov 13, 2017", "userURL": "http://www.goodreads.com/user/show/30604861-emma-giordano", "userReview": "4.5 STARS I REALLY REALLY ENJOYED THIS BOOK.If I leave this review blank for now, I may force myself to film a video review (which I really want to do!) hahah"}, {"userName": "C.G. Drews", "userReviewDate": "Oct 18, 2017", "userURL": "http://www.goodreads.com/user/show/11375137-c-g-drews", "userReview": "[said all that absolute shit about Aza and it wasn't only cruel, I don't think it was dealt with properly???? Like how dare she say that stuff. Like being friends with Aza is \"exhausting\" and Aza doesn't care etc. etc. And at the end they just forgive each other. OK SO MAYBE I CAN JUST HOLD A GRUDGE BUT I'M PISSED OFF. I think Daisy should've had a little more comeuppance for that. Because saying stuff liek that to a mentally ill person underlines the horrible ideas that: (a) mentally ill people are too much work, and (b) you're being a gift from god to befriend them. This really hurts and I just WISH it'd been more addressed. (hide spoiler)]"}, {"userName": "Angelica", "userReviewDate": "Sep 25, 2013", "userURL": "http://www.goodreads.com/user/show/16201093-angelica", "userReview": "Rating 3.5 \n\n“Spirals grow infinitely small the farther you follow them inward, but they also grow infinitely large the farther you follow them out.” \n\nWell, this is awkward.I went into this thinking I wouldn’t like it. Heck, I went into it pretty much expecting to dislike. And yes, I know that’s a horrible thing to say, and a terrible reason to read a book, but come on, you can hardly blame me.I hated The Fault in Our Stars, with all of its extremely pretentious characters (although I did cry at the end, and actually liked the movie). I then left Looking for Alaska, halfway through after a friend spoiled the ending (thanks a lot, Megan!) I also couldn’t get past chapter five of Paper Towns, (mostly because I had already seen the movie and hated Margo).So, Turtles All the Way Down, was me giving John Green one last shot. And you know what? I liked it. I actually, genuinely liked it.This book is classic John Green. You got the two teenagers from well to do families who sit around contemplating the meaning of the universe with all the knowledge and wisdom of college philosophy professors and the vocabulary of a SAT test book.And yet, in spite of all of these things, I actually enjoyed this one. Maybe because Aza and Davis didn’t come across as annoyingly pretentious as Augustus and Hazel had.So, the story is about Aza, a girl dealing with spiraling thoughts that are entirely out of her control. She feels trapped and bullied by her mind as her anxiety takes over. And yet, she tries her best to be a good friend and daughter and to live the life she wishes she had.It’s also about Davis, a billionaire boy with a missing father, who is trying his best to be a good influence for his 13-year-old brother.It’s also about mental illness and family and friendship and falling in love. Really, it’s about a lot of things, but more on that later.I think John Green does an excellent job at portraying Aza’s illness and the way that thoughts can sometimes control a person. I know firsthand how hard it can be to deal with invasive thoughts. I know that sometimes the mind seems like a different entity from the self and John Green wonderfully showed all the thoughts going through her head. More so, he did it in a way that properly displayed mental illness.I liked the romance also, although at points it was a little too philosophical for my taste. I liked that love doesn’t fix mental illness. I liked that the world goes on and good things happen and sometimes bad things happen. I also like the way that mental illness is portrayed as affecting not just the individual but also those around them. I loved seeing how family and friendships are tested and yet remain. Truly, I think that it was all brilliantly done and I must say, kudos to John Green because I could actually relate.So, why not a higher rating? Well, this book felt like it was trying too hard. It was too many things. It took a great story and stretched it out to the point that the plot seemed thin. It felt out of focus and it greatly diminished my liking of it.I think it could have had a greater emotional impact if it had focused on only one thing, either Aza and her troubles, or Davis and his missing father. It could either be a look into mental illness or a mystery. Or, it could be both if it were longer and found a way to combine the two. But, alas, it did not.Overall, I really enjoyed it and totally recommend. I am actually looking forward to whatever John Green writes next.Let me know what you thought!"}, {"userName": "Val ⚓️ Shameless ⚓️ Steamy Reads", "userReviewDate": "Jan 19, 2018", "userURL": "http://www.goodreads.com/user/show/11626803-val-shameless-steamy-reads", "userReview": "2 Stars...and that's me being generous.This book was, well...not good.I went into this with somewhat high hopes. I knew it was about a girl with anxiety issues and - as someone who struggled with a lot of anxiety as a hormone-ridden, depressed teen who lost a parent at a young age myself, (much like Aza) I expected to really connect with this story. At least on some level. One reviewer I follow even ranked this as her top read of 2017. Said it was \"life changing.\"LIFE CHANGING. To each their own and all that jazz - truly, I'm happy other people got something out of this book -but, in my opinion, for something to change my life - or at least remotely affect me in any way - it has to have at least some depth to it.And this book had about as much depth as the shallow end of the kiddie pool. Now, I realize that I - a 35 year old woman - am not the targeted demographic for this book, but still...There has to be at least some point to a book.Character development...a cool plot...a semi-decent romance, even...But this book?Had basically no plot.No true character development that I can see...And perhaps the most simplistic \"moral of the story\" I've ever seen. So let me save you a few bucks or a trip to the library and just give you what amounts to the entire point of this book here:Ready?*drum roll**drum roll**drum roll**drum roll**drum roll**drum roll*Life Goes On.Yep, that's pretty much it. Life.Goes. On."}, {"userName": "Chelsea Humphrey", "userReviewDate": "Oct 17, 2017", "userURL": "http://www.goodreads.com/user/show/47207032-chelsea-humphrey", "userReview": "\"You're a we. You're a you. You're a she, an it, a they. My kingdom for an I.\"I hate when I have a middle of the road review to write; I like to feel passionately about a book one way or another, and I almost feel it is easier to share my feelings on a book that is a 1-2 star than any of the 3 stars that come along. I feel at a loss for words to describe my experience while reading this book; I've seen multiple reviews state they felt Turtles All the Way Down wasn't even on the same level as The Fault in Our Stars, and I have to agree. While this wasn't a BAD story per se, it didn't feel up to the John Green standard we've come to expect. Multiple times I was stopped by randoms at the gym asking how it was, because it was on their wish list, and I could never muster anything more than \"This book is fine. Fine is what it is. It is not great, but it is fine\" and I felt guilty for that. For such a short book with big font and little chapters and lots of spacing between lines, this book sure was slow in the first half. I believe he was going for atmospheric, but when I think of setting the tone in a slow building way, I think of descriptive writing that can be filled with prose or not, but definitely something that draws me in and makes me feel a part of the story, and that's not what happens here. The narrative is very jerky and disjointed, and it took awhile for my brain to become engaged enough to care what was happening. I think the premise of this book, minus the billionaire side story (but I'll get to that in a minute), was excellent. I love YA books featuring mental health issues and illnesses and this was by far the strongest aspect of the plot. I didn't find Aza likable in the beginning, but I feel that was the point so that we could form a connection with her as she grows and becomes aware of herself in new ways. Honestly, I really could have done without the awkward side story of Davis and Noah's missing father. I didn't feel it added to the story; actually, I felt it took away from some of the more important factors since it stole coverage where those pages could have been used to further the main focus. I couldn't help but wonder what felt off, and I think it came down to a rushed characterization of Davis, Aza, and their relationship. It almost felt as if chunks of the story were missing and we were just supposed to fill it in our own way. I would have liked a little more development, but that's just me. I did feel the ending was another strong point; it was messy, uncomfortable, and slightly disturbing, but added a gleaming spark of hope and a viewpoint of recovery for those struggling with various mental health issues and disorders. Please don't toss this book aside and chose not to read it just because it didn't wow me; I think it has some very valuable insight into a very tough subject that is still taboo in 2017. There are plenty of 5 star reviews that are much better than mine and I hope you enjoy it more fully than I did. Maybe I'm getting too old for this type of YA contemporary or maybe I'm just out of touch with how teenagers behave and converse, so I think I'll just say that it was fine, but the over hyping of this book pre-production may have done more harm than good for the die hard fans."}, {"userName": "Warda", "userReviewDate": "Jan 23, 2018", "userURL": "http://www.goodreads.com/user/show/30036082-warda", "userReview": "Edit: Well, I cannot stop thinking about this book, and it's been a few weeks, so that deserves me upping my rating to 5 stars. It has resonated with me more than I thought it would.\n“Your now is not your forever.” ― John Green, Turtles All the Way Down\nWow. This book was stunning. Hard to read (trigger warnings for OCD and anxiety), but Jesus, did it feel healing at the same time. John Green wrote the shit out of this book. The way mental health was portrayed through Aza was excruciating, harrowing and educational to read about and it still made me feel that though the stigma might have lessened a bit, the understanding of this subject is narrow. I felt this book to my core. I was there with Aza when she was spiralling out of control, her mind constantly pulling her in different directions, finding no centre, the constant doubt hurling you further into finding no fixed point, so that you may breathe and focus.I've so much admiration for Green for writing so openly in this book. It was so raw and bleak and the ugly side of mental health truly came to live, because that's how it is and what it can manifest into. And though, it may seem difficult to find hope, a way to see the light at the end of the tunnel that seems never-reaching, it is there. It is tangible and can be found."}, {"userName": "Lia Bonnibel  (pidgey) ", "userReviewDate": "Jan 24, 2018", "userURL": "http://www.goodreads.com/user/show/66222749-lia-bonnibel-pidgey", "userReview": "bf: *gets me a book*bf: *picks this one because there's 'turtles' in the title*____________________________________\nNo one ever says goodbye unless they want to see you again.\nI must admit that never in a million years, would have expected to find myself in a situation like this, one where I'd end up completely put off guard by a book I'd never even considered reading in the first place.I'm not a huge John Green fan. I've read his previous works and, even if I didn't completely despise them, the whole JG phenomenon never really felt to me like a complete mind-blowing experience that I absolutely had to be part of.Then why does this book changes the entire game, you might ask? Well, first of all, there was a lot to relate to. And I'm not only talking about all those pop-culture references and the exquisitely colloquial writings. I mean, yes, they're quite necessary if you look at it from a certain angle, and they serve their filling purpose greatly, but it's something else, really. As simple as it sounds, I found myself utterly and painfully represented by the issues this book portraits, and I couldn't help but see my own fight against the same angsty and suffocating thoughts the main character, Aza, has to struggle with on a daily basis, as well.It's really something that doesn't happen everyday. Aza is a complex and damaged character, one of those charries I usually am drawn to, only this time it was because her character sometimes appeared very adult-coded, so it was a case of mutual and shared vision of life. Through the pages, you get to see her journey, in and outside her head, and, I don't know if it's just me being me, but some of the things she does and says are things I thought I was the only one doing. Talk about relatable MC's! I like her, so so so so much. Green's characters once again fall a bit on the cliché side, but I got to give it to him. When they start throwing tantrums, I don't blame them, because they're young and immature, just like they should be. And when they learn from their mistakes, is even better. Aza's mum is probably the purest character I've seen in years. She's adorable. I respect the shit out of that woman, I admire her for being so strong and for keeping herself together for her daughter's sake even when things are shitty. She's a good mum and a good role model. Love interests aren't usually a problem for me, except for when they become love-interests-period. This time around, it was Davis' turn and, I've got to say it, I adore the guy. Just like Aza, he's walking a wire, with one foot dangling from the edge of the darker side, constrantly fighting to live up to a family name he didn't choose himself. And he's so... Likeable, you know? At least for me. I mean, he's got this whole Gansey thing going on (cute and nerdy rich boy, wears khakis and polo shirts, has a frigging diary) and he loves poetry. No, let me rephrase that: he loves and writes poetry. *sticks gold star on davis forehead*Back to us...So, reason #3 this book is the best I've read this month: the plot is so blunt and easy to follow, that it flows perfectly with whatever mood you might be in that moment. Sure, it's not the thriller of the year nor the best contemporary that deals with heavy themes, but if you put all the elements together and follow the recipe step by step, you're in for an adventure.The quotes sprinkled all over the book, in a certified Green fashion, the very same quotes I've always found a bit pretentious in the other books, add a sense of poetry (as if there was little of it already! *puts another gold star on davis forehead*), a sense of being known. The romance is light but at the same time very intense. It's not even that much eye-rolling, if you know what I mean. Some Davis/Aza scenes really left me out of breath, not gonna lie, but I really did like Aza and Daisy's interactions just as much. I speak from personal experience when I say it's not easy being friends with people who have social anxiety and/or ocd (especially since they, we, take a little more than others to open up to people and let them in), so I appreciate the author's effort of showing how relationships and dynamics can work out with a little help from both sides. And it's not always sunshine and rainbows, that be clear. I also think Green does an amazing job at presenting you both sides of the medal, backstabbing and wishful thinking included.I think this was the first time in ages I had to physically keep myself from reading an entire novel in one day, because I didn't want it to end too soon. I'm glad I found, in this unexpected surprise of a book, a story that made me feel a little less alone in the world."}, {"userName": "Hannah Greendale", "userReviewDate": "Oct 10, 2017", "userURL": "http://www.goodreads.com/user/show/43377498-hannah-greendale", "userReview": "Click here to watch a video review of this book on my channel, From Beginning to Bookend. Turtles All the Way Down is quintessential John Green - exceedingly eloquent teens with advanced vocabularies ponder existential questions - but, much like its protagonist, the book suffers from a confused sense of identity, trying to be too many things at once. It subsequently lacks focus and offers weak emotional impact."}, {"userName": "Clau R.", "userReviewDate": "Oct 30, 2017", "userURL": "http://www.goodreads.com/user/show/13061577-clau-r", "userReview": "\"Anybody can look at you. It's quite rare to find someone who sees the same world you see.”"}, {"userName": "Melissa ♥ Dog/Wolf Lover ♥ Martin", "userReviewDate": "Oct 20, 2017", "userURL": "http://www.goodreads.com/user/show/17438949-melissa-dog-wolf-lover-martin", "userReview": "I thought I would fall in love with this book but I just didn't. 😕Now I give all of the stars to Aza, Davis and Noah. I loved Aza so much and as I have mental disorders I can totally relate to her. She's a wonderful character. Davis is her boy ish friend and he's awesome too. Noah is his brother. They are totally rich and their father is missing. So this is about finding each other and finding a missing father. A few other things thrown into the mix. I think what kept this from being a 5 star was Daisy. I just didn't like her at all. She was Aza's best friend. I just couldn't handle her. So, on to the next! Happy Reading! Mel ❤️"}, {"userName": "Kai", "userReviewDate": "Jun 22, 2017", "userURL": "http://www.goodreads.com/user/show/41788524-kai", "userReview": "“You're the narrator, the protagonist, and the sidekick. You're the storyteller and the story told. You are somebody's something, but you are also your you.”I went into this with a bowl full of low expectations but with a side of high expectations. And it tasted good.It's been a while since John wrote a book. The first John Green book I ever read was TFIOS, which I loved. During the time that passed until the release of Turtles All the Way Down I caught up with most of his other books, apart from An Abundance of Katherines. Will Grayson, Will Grayson was meh but Paper Towns and Looking for Alaska straight up sucked. It made sense that I was torn wether I wanted to read TALWD or not. But I'm glad I did.The plot wasn't all the exciting. I saw lots of people complain about an absence of plot, but some stories are more character-driven than others, as in this case. Apart from this there were lots of subplots that I loved - Daisy's relationship with Mychal for once, or the disappearance of Pickett Senior.The characters were fantastic. First and foremost there is Aza, a teenage girl battling with anxiety. While she did not say much, I enjoyed her narratorial point of view. She was a fleshed out character with lots of depth, which is such an improvement to John's previous main characters that were part boring and part even more boring. Now, I don't struggle with an axienty disorder. I can't possibly judge this novel from that perspective because I never experienced anything similar to what Aza struggles with on a daily basis. But this book managed to make me feel what a person with an anxiety disorder might possibly have to go through - so much that I could only skim the parts where the main character's anxiety surfaces and takes over all her thoughts and actions. With Daisy, Aza's best friend, it was love at first sight. This girl is precious. I loved everything about her.I never warmed up Davis, Aza's love interest, if that is what you want to call him. I don't think that I fully got him and I'm not entirely sure why Aza was drawn to him. On one hand, their relationship lacked romance, on the other hand I'm glad that this was not one big love story. It would not have fit into the story.Overall I simply liked this novel. Money was one of the story's central themes, and while I'm both uncomfortable with and in awe of this unfathomable wealth depicted in it, I also deeply connected with Daisy, when she talked about what being poor can be like. Of course, wealth and poverty are extremely subjective topics and people hate to talk about money, but I think John Green managed to find a good balance.Find more of my books on Instagram"}, {"userName": "Nat", "userReviewDate": "Oct 11, 2017", "userURL": "http://www.goodreads.com/user/show/23381142-nat", "userReview": "“If only I were as good at life as I am at the internet.”I was so overly eager for any new John Green book related content that I made the mistake of reading the excerpt shared on Buzzfeed last month. I say mistake because when I opened up the book weeks after having read the first two chapters, I only had this vague recollection that certainly wouldn't help to continue from where I'd started. Rereading was key.To give you a bit more background on why I was so eager: Back in 2014, John Green was one of the first authors I'd read that introduced me to the magic of books. I owe a lot to his writing that sucked me in so completely, only to leave me craving for more by the last page, which then led me to look up what next book would satisfy that particular hunger. And here we are today.Despite all the above, I still went into Turtles All the Way Down with little to no expectations as to what was to come. I knew that though I had history with TFIOS, when I look back on certain scenes, I can't help but feel shivers of disgust (like when the \"two very privileged caucasian Americans who have never known starvation, genocide, or physical abuse\" kissed in the Anne Frank house, which Ariane tells like it is in this article). So if anything, I was apprehensive as to what this newest work would contain.It all begins with a fugitive billionaire and the promise of a cash reward. Turtles All the Way Down is about lifelong friendship, the intimacy of an unexpected reunion, Star Wars fan fiction, and tuatara. But at its heart is Aza Holmes, a young woman navigating daily existence within the ever-tightening spiral of her own thoughts.I feel like the only way I can accurately describe the heart of the book is by borrowing this phrase: Captures the everyday moments of teens' lives and then sets fire to those moments, heightening them until they become metaphor.“True terror isn’t being scared; it’s not having a choice in the matter.”I have so much my mind is eager to spit out, so I think a list is in order (mild spoilers ahead):• Let's start with Aza, who surprised me so much with her strong will and great depth of character. Her thought process and spirals gave me a keen insight into the works of the mind and expanding my view on things. What I wasn't expecting, however, was having my own thoughts staring back at me from the page. From staring down the rabbit hole that is social media stalking your crush (#exposed), to vocalizing my exact fears on the reality of dating:“I’m really not looking to date anyone.” I know people often say that when secretly looking for a romantic partner, but I meant it. I definitely felt attracted to some people, and I liked the idea of being with someone, but the actual mechanics of it didn’t much suit my talents. Like, parts of typical romantic relationships that made me anxious included 1. Kissing; 2. Having to say the right things to avoid hurt feelings; 3. Saying more wrong things while trying to apologize; 4. Being at a movie theater together and feeling obligated to hold hands even after your hands become sweaty and the sweat starts mixing together; and 5. The part where they say, “What are you thinking about?” And they want you to be, like, “I’m thinking about you, darling,” but you’re actually thinking about how cows literally could not survive if it weren’t for the bacteria in their guts, and how that sort of means that cows do not exist as independent life-forms, but that’s not really something you can say out loud, so you’re ultimately forced to choose between lying and seeming weird.”• Green’s style has grown and matured a lot for me with his newest work. It’s equal parts dark, hilarious, and achingly real. Plus, the dialogue is amazing. Speaking of the latter, the main reason why is thanks to the effervescent Daisy, who's a force to be reckoned with, from writing her own Rey/ Chewbacca fanfiction to her inspiring directness.“Have you ever gotten a dick pic?” she asked in lieu of saying hello.I feel like she and Ilana Wexler would get along perfectly. Actually, I've never been surer of something.“I mean, how am I supposed to react to a semi-erect penis as fan mail? Am I supposed to feel intrigued?”“He probably thinks it’ll end in marriage. You’ll meet IRL and fall in love and someday tell your kids that it all started with a picture of a disembodied penis.”\nJohn Green isn’t afraid to let loose with his newest work. And I’m digging it.• Speaking of which, the direction the author took with Aza's mental illness felt like the most honest portrayal I'd read in ages.“I wanted to tell her that I was getting better, because that was supposed to be the narrative of illness: It was a hurdle you jumped over, or a battle you won. Illness is a story told in the past tense.”...“I would always be like this, always have this within me. There was no beating it. I would never slay the dragon, because the dragon was also me. My self and the disease were knotted together for life.”• I got educated on such a vast array of topics, without ever feeling like I was lectured. The random history and science lessons really give away who the author of this novel is. From the history of Indianapolis (the setting of the book), to the genetically distinct creature called tuatara, to this weird parasite called Diplostomum pseudospathaceum. I can't deny how utterly fascinating John Green made all of his swift lessons.“What I love about science is that as you learn, you don’t really get answers. You just get better questions.”• The bits of romance seemed slightly off-kilter with the flow of the story at first, but it just so happened that I was in the rare mood for a budding romance to indulge in. Actually, it turned out to be quite nice, since it first and foremost focused on two teens taking comfort in talking with someone that gets them to a whole new level.“In the best conversations, you don’t even remember what you talked about, only how it felt.”• The fact that we get to read inserts from Davis's blog post & poetry entries, and Daisy's successful fanfiction. The particular Davis piece below rang in my ear for a very long time.“The next one stopped me cold:\n“The greatest weapon against stress is our ability to choose one thought over another.”\n\n—WILLIAM JAMES\n\nI don’t know what superpower William James enjoyed, but I can no more choose my thoughts than choose my name.\nThe way he talked about thoughts was the way I experienced them—not as a choice but as a destiny. Not a catalog of my consciousness, but a refutation of it.When I was little, I used to tell Mom about my invasives, and she would always say, “Just don’t think about that stuff, Aza.” But Davis got it. You can’t choose. That’s the problem.”• On a totally separate note, I couldn't help but think of Richard Campbell Gansey III from The Raven Boys when Davis was first introduced, thanks to his obscene amount of family money.“You mean, when a movie comes out in theaters, it . . . also comes out at your house?”I never thought we’d have someone upstage Gansey... And yet here we are.• But what came quite unexpectedly was how connected I felt to Noah, who's the 13-year-old brother. We see him truly struggle with the fact that his dad up-and-left with no clue of his whereabouts. But what hit most was the fact that Noah had no one to cry out to. Davis is barely getting by on his own, so his younger brother has to figure things out mainly by himself. And reading that just took a piece right off me.“It’s all right to be scared, Noah.” And then he turned his face away from me and started sobbing. “You’re okay,” I told him, lying. “You’re okay. He’ll come home.”\nThough the premise is set to be about making “connections that crack open the long-dormant case of Russell Pickett’s disappearance,” Turtles All the Way Down is at its core a character-driven novel, favoring the development of the characters' relationships with one another, which is how I like 'em. All this to say: I'm beyond eager to see what Green has next in store for us.\nNote: I'm an Amazon Affiliate. If you're interested in buying\n Turtles All the Way Down, just click on the image below to go through my link. I'll make a small commission!\nThis review and more can be found on my blog."}, {"userName": "Felicity Jackson (gowithflick)", "userReviewDate": "Oct 22, 2017", "userURL": "http://www.goodreads.com/user/show/55909774-felicity-jackson-gowithflick", "userReview": "100/10. Everybody READ THIS BOOK."}, {"userName": "maymay❀", "userReviewDate": "Nov 28, 2017", "userURL": "http://www.goodreads.com/user/show/49148508-maymay", "userReview": "I don’t have a very good relationship with John Green books, they are CLEARLY hit or miss for me (hit: TFIOS) (miss: Abundance of Katherines, Paper Towns, Let it Snow, Will Grayson x2) YOU CAN CLEARLY SEE MY DILEMMA IN PICKING UP THIS BOOKBut I was pleasantly surprised So Turtles all the way down did have the john green elements i.e. -\tMental health rep-\tTragic characters with tragic backstories-\t16 year old philosophers (it wasn’t so bad in this book)-\tHilarious best friends -\tThe ending that leaves you VERY unsatisfied But this book was also unique in its own way in that-\tThe characters felt more like themselves than fictional impersonators of mr. green-\tI thought the OCD was done FANTASTICALLY -\tThe spiraling of thoughts and emotions and drag that is mental illness was incredible and maybe a little TOO real (but that’s not a negative in my book) -\tThe best friend was 10/10 I loved her-\tSHE WRITES FANFICTION AND SHES THE FUNNIEST THING SINCE IDEK WHAT-\tThe romance was kinda….quick…idk…it was alright, didn’t do anything great for me-\tThe writing is VERY easy and I was able to read it in less than a day, so that’s a plusThe thing with john green books is that the endings are done in this cloaked dramatic flair where I feel like he’s either trying to SHOCK the reader or give them an ending that is so realistic is resonates with them, and that’s cool and all but I just find it to be so … emptyingIdk how to describe it but I could LOVE the entirety of all his books but the ending is given and then I go to legally change my name to disappointed bc that’s how I feelThere’s just always so much build up to something that’s just so simple and im like, I understand this isn’t supposed to be some great reveal, we aren’t reading epic fantasy here, but maybe a little something with a twist, or maybe he’s doing too much of a twist, either way, it always hits the ‘meh’ for me I don’t really have much to say beyond that  “It's turtles all the way down,” she laughs. “It's turtles all the way fucking down,” Daisy agrees 3.5 stars!!3.5 stars!!~~~~~~~~~~~~~~~~~~~~i'm honestly not john green's //biggest fan// but hey how can you NOT read a john green book amirite?i just dont want any 16 year old philosophers :|"}, {"userName": "Cait • A Page with a View", "userReviewDate": "Oct 04, 2017", "userURL": "http://www.goodreads.com/user/show/47412532-cait-a-page-with-a-view", "userReview": "\"...we were looking at the same sky together, which is maybe more intimate than eye contact anyway. Anybody can look at you. It's quite rare to find someone who sees the same world you see.\n3.5 stars. I haven't been the biggest fan of John Green's stories in the past because I found the characters to be too unrelatable. Like they were just trying too hard at times? But Aza's character felt super realistic and I am so impressed right now. This was honestly one of the best depictions of anxiety or any mental health battle I've ever read. It didn't sound like someone trying to write the concept... John Green has clearly lived this. It was incredibly raw, honest, and beautiful at times.I think everyone will relate to this on some level because the story grapples with the types of realizations we all face while growing up (so it's kind of reassuring that we're not alone in those thoughts). Aza spends a lot of time examining to what extent we author our lives and what our definition of \"self\" involves. But then she gets stuck in obsessive, infinitely tightening thought spirals that are SO well depicted.\n\"It's getting sucked into a whirlpool that shrinks and shrinks and shrinks your world until you're just spinning without moving, stuck inside a prison cell that is exactly the size of you, until eventually you realize that you're not actually in a prison cell. You are the prison cell.\"\n\n\"True terror isn't being scared; it's not having a choice in the matter.\"\nJohn Green articulated so many situations and struggles incredibly well. And even though he had his characters muse over how there aren't really ways in English to describe the pain or struggle, he somehow managed to convey it quite vividly. The book did feel like more of a character study at times, though. The story itself wasn't particularly gripping and I wasn't really that interested in whatever was happening outside of Aza's thoughts. I think it just tried to cover too many different potential plots in less than 300 pages. But the mental health aspect more than made this worth the read! Everything Ava pondered worked together really well to have a larger impact (especially the bits on different parasitic thoughts/beings). I was grateful that the book didn't talk down to the audience OR get too pretentious while covering some of the fascinating strings of thought. The philosophical conversations were one of my favorite parts because they felt so natural. And the way that the typical \"turtles all the way down\" imagery fit into this particular story was really neat. I also liked how the book's tone could've easily gotten bleak or tried to put some hollow positive spin on everything, but instead did a great job tackling everything head on in a way that felt really authentic. I am SO glad that this wasn't some cure narrative where Aza gets into a relationship and starts going about life after she's \"better.\" She's just living realistically.\n\"...nothing in this world is deserved except for love, that love is both how you become a person, and why.\"\nSo this wasn't the typical John Green romance with quirky teens, but that ended up being a refreshing change for me. And even though I wasn't terribly into the overall story as a whole, I still really appreciated the depiction of Aza's mental health. Obviously everyone's personal experience is different (so it's not necessarily \"wrong\" if it doesn't speak for you), but I do think this will resonate with a lot of readers!!"}, {"userName": "Sara➽ (Ink Is My Sword)", "userReviewDate": "Feb 27, 2018", "userURL": "http://www.goodreads.com/user/show/28146945-sara-ink-is-my-sword", "userReview": "1.5 “John Green is definitely a miss for me” Stars\n“Reading someone’s poetry is like seeing them naked”\n UHU. I just bumped to 2 stars because I am reading a 1-star book right now and this is not at that level. I can truly appreciate the OCD representation in Aza so yeah let's leave it at 1.5 near 2.➽\nFULL REVIEW NOW POSTED.\nMy problem was expectations. I thought I would relate, I didn’t. My problem was feeling. I thought I would feel, I couldn't. JG fans please don't throw tomatoes at me. Although if you throw them with parmesan cheese or mozzarella cheese, I may, just may be okay with it. Do I think everyone will hate this book? Hell, no.I for sure know many people will be able to relate and enjoy this book. So don’t feel discouraged to pick this up if you want to. There was nothing wrong, yet everything was wrong for me as a reader.Do I recommend it? Yes, if you are a usual JG fan and if you are interested in reading more OCD representation. OCD representation, yes hell yes, I am glad his book exists. Many people could relate, many had this book piercing their heart, so yes I currently think what the hell is wrong with me. I have the theory that I am a robot. So if you have a solution for me please send it my way.Mr. Green can definitely write and he obviously is very well received by the audiences, if not how will he be a bestseller author, two movies produced based on his books already, heck they are probably even producing this one while I am writing this review. I don’t think there is anything atrocious, I just can’t connect and I feel very much bored while reading his stories. My only exception has been The Fault In Our Stars and his history youtube channel, he has seriously saved me some grades. But anyways let’s not make this personal.Plot?Not consistent. It felt like a random stuff put together, finally distracting you from the actual point. I mean this would have been best if we were totally focused on the mental health aspect of the story, but suddenly this bounty hunter stuff was thrown at us, and it didn’t even have a worthy climax or anything. It felt dull.Characters? Couldn’t connect with anybody. As a teenager, I always end up with the sensation that I am reading adults (like not only in this book, but pretty much everything John Green has written), and it bothers me.Aza: I think people who have OCD could relate a lot to her and this whole book, I just couldn’t. But for that, I give 1,000 kudos, the representation a mental illness, but this just doesn't mean I loved this book. I really wanted more than just Aza’s perspective because I felt I couldn’t get anything from the book. Maybe this was the intention, but I basically hated it, because it felt like there was nothing going on or important to remember. She also made me realize I am really getting tired of the whole “psychologist suck they are just pricks who fake listening to us” because fuck I am freaking tired of all YA books not having good mental health help. Davis: Why did he even exist? I mean I felt he was the manic pixie dream character we always found in John Green’s characters. I liked he liked poetry, that’s about it. I honestly couldn’t even feel sorry for him and his dad plot. Yes, I have an ice heart. Daisy: Mmmmm…. How can I say this? Oh yeah, I didn’t like her. Again, she just was a terrible friend? As bad as Aza was to her, the fanfic part was too low my dear. Also, I haven’t watch star wars I don’t plan to watch it ever, and I was not the even minimum interested in her freaking Chubaka stories. Relationship? Why did it exist? H-O-N-E-S-T-L-Y. Please, someone, explain to me. There wasn’t even palpable attraction to start with, I couldn’t. I don’t even have words because there is basically nothing to talk about. Writing? Yeah some cool quotes, but I don’t emotionally connect, I felt bored.I really struggled, 258 pages felt like 1576868 pages. To not make this review completely negative here are some quotes I will keep.  Just know I still regret physically highlighting this book, I want my money back, sigh. If the books were just this quotes it would have probably been 5 stars. “But I was beginning to learn that your life is a story told.”“It’s a weird phrase in English, in love, like it’s a sea you drown in or a town you live in. You don’t get to be anything else-in friendship or in anger or in hope. All you can be is in love.”“I wanted to tell her that I was getting better because that was supposed to be the narrative of the illness: It was a hurdle you jumped over or a battle you won. Illness is a story told in the past.”“And we’re such language-based creatures that to some extent we cannot know what we cannot name. And so we assume it isn’t real. We refer to it with catch-all terms, like crazy or chronic pain, terms that both ostracize and minimize. The term chronic pain captures nothing of the grinding, constant, ceaseless, inescapable hurt. And the term crazy arrives at us with none of the terror or worry you live with. Nor do either of those terms connote the courage people in such pains exemplify, which is why I’d ask you to frame your mental health around a word other than crazy.”This book may have worked if my mental health was horrible, which I don't even know it means something good."}, {"userName": "Larry H", "userReviewDate": "Oct 12, 2017", "userURL": "http://www.goodreads.com/user/show/5872506-larry-h", "userReview": "From the outside looking in, Aza seems to have it all. She's smart and sensitive, and she tries hard to be a good daughter, a good student, and a good friend. But life for Aza isn't what it appears: she struggles every day with invasive thoughts, thoughts which at times leave her unable to focus on nothing but the fear and anxiety they cause.\"It's so weird, to know you're crazy and not be able to do anything about it, you know? It's not like you believe yourself to be normal. You know there is a problem. But you can't figure a way through to fixing it. Because you can't be sure, you know?\"When Aza and her best friend Daisy learn about the disappearance of the town's notorious billionaire, Russell Pickett, the father of one of Aza's childhood friends, they are intrigued by the mystery. And when Daisy learns that there is a $100,000 reward for information leading to Pickett's capture, she convinces Aza to help her investigate. While Aza honestly doesn't care about the money, she's doesn't mind that she gets to be reunited with Davis Pickett, on whom she had a crush when she was younger.As Davis and Aza grow closer, both struggle with questions about the meaning of life and the true nature of existence. Aza tries to help Davis deal with his feelings of abandonment, whether he even wants his father to return, and what it will mean for him and his younger brother, Noah, since their mother died several years earlier. Davis tries to help Aza by understanding the intensity of her thought spirals, and helping her have the type of relationship she can handle, but as her problems deepen, no one can provide her any comfort.\nTurtles All the Way Down\n is an unblinking look at living with mental illness. There's no candy-coating Aza's feelings, and how helpless and frustrating her illness is for her family and friends. It's also a poignant look at just how much we need love, friendship, acceptance, and understanding, and how debilitating it can be to try and understand the challenges that life throws at us.There's a point in the book when Daisy tells Aza that someone once said she was like mustard, \"great in small quantities, but then a lot of you is...a lot.\" To be honest, while I believe this is an important book, I found it was a little like mustard, and almost relentless. In his quest to give readers a you-are-there feeling where mental illness is concerned, I felt as if John Green sacrificed the book's humor and much of its heart. While Aza and Davis are fascinating characters, I found Daisy tremendously unlikable, while many of the other characters aren't well drawn.As always, Green's teenage characters are wiser and more erudite than most adults. But that aside, he really shows his storytelling skills when describing Aza's anxiety. Here this paragraph, for example:\"I don't know, like, I'll be at the cafeteria and I'll start thinking about how, like, there are all these things living inside of me that eat my food for me, and how I sort of am them, in a way—like, I'm not a human person as much as this disgusting, teeming blob of bacteria, and there's not really any getting myself clean, you know, because the dirtiness goes all the way through me. Like, I can't find the deep down part of me that's pure or unsullied or whatever, the part of me where my soul is supposed to be. Which means that I have maybe, like, no more of a soul than the bacteria do.\"I loved loved loved \nThe Fault in Our Stars\n and really enjoyed \nPaper Towns\n, and I would be lying if I said I didn't hype this book up in my mind. As someone who has struggled with depression and anxiety in my life, and struggled to describe how they make me feel, this book is definitely helpful. I wish I liked it more, but I'm glad I read it. Now maybe I'll go back and read some of his older books.See all of my reviews at http://itseithersadnessoreuphoria.blo...."}, {"userName": "Matthew", "userReviewDate": "Nov 13, 2017", "userURL": "http://www.goodreads.com/user/show/16254355-matthew", "userReview": "[The entrance to Pogues Run is 5 miles from my office (hide spoiler)]"}, {"userName": "Maria", "userReviewDate": "Mar 11, 2018", "userURL": "http://www.goodreads.com/user/show/77602709-maria", "userReview": "4.4/5 Stars ⭐️ ⭐️ ⭐️ ⭐️ “You're the narrator, the protagonist, and the sidekick. You're the storyteller and the story told. You are somebody's something, but you are also your you.”GUYS GUYS! I FEEL THE FEELS I FEEL THEM! GUYS!This book this FUCKING BOOK. I devoured it in under a day! I couldn't leave it down even though I had studying to do. I was there, with Aza, feeling what she was feeling, understanding even though I don't suffer from it, wanting to \"heal\" her even though I know I couldn't. This book was so deep (too deep for teenagers but that's John Green for ya) and it entailed so many excellent quotes that cut deep into me. The other characters were brilliant, too (even though Daisy just pissed me off at times), the Star Wars references were cute, being a SW nerd myself, I relate (even though the Rey x Chewbacca parts were sort of weird) and I think he did his research a lot for this book. 6 years is a lot of time and he really produced amazing work out of them.I'm so looking forward to the movie I heard that is coming out, (a John Green book not becoming a movie would be a first) I hope they do it justice. It was the first of his books I read before the movie comes out not because of the movie so I'm really curious to see what their angle will be about it.ANYWAY, I'LL PROBABLY BE THINKING ABOUT THIS BOOK FOR A WHILE SO K BYE!"}, {"userName": "✨    jamieson   ✨", "userReviewDate": "Jun 23, 2017", "userURL": "http://www.goodreads.com/user/show/7706640-jamieson", "userReview": "“It's turtles all the way fucking down, Holmesy. You're trying to find the turtle at the bottom of the pile, but that's not how it works.\"\"Because it's turtles all the way down,\" I said again, feeling something akin to a spiritual revelation.” \nmy relationship with john green is hit and miss and whether our relationship would end or continue all hinged on this book. folks, I'm pleased to say he's not cancelled yet. Honestly, this book almost didn't feel like John Green. It does have staple John Green aspects, but at the same time it's very thoughtful, very cohesive, and overall feels more mature. I don't know what's changed between this book and TFIOS, but I really enjoyed the John Green we get in this book. Don't get me wrong: there's still a ridiculous amount of metaphor, simple, hyperbole, analogies, symbolism ect. I just think I happen to like those things. And metaphor is actually one of the only ways to describe what having a mental illness FEELS like. Turtles All the Way Down follows Aza Holmes, a 16 year old girl who's thrown into the investigation to find a missing billionaire, and is also trying to deal with her OCD. The billionaire plot kind of takes a backseat to the character work - this mostly focusses on Aza's mental health and her struggle with it. the representation was both the hardest and best thing about this book strong content warnings for this book because some things were kinda triggering, but at the same time the OCD rep is done .. really well. This is ownvoices representation and I think it's pretty clear how much John Green has put into putting forth an authentic and honest book about mental illness. John Green explores stigmatisation of MI, how it can become hard to balance your MI with your relationships, and the feeling of hopelessness when you're dealing with a mental illness that is spiralling out and out of control. I think it was great to see therapy, a positive discussion about medication and also the debunking of the \"mentally ill people make better artists\" trope thing (which sucks)\n“Thoughts are only thoughts. They are not you, you belong to yourself even when your thoughts don't.” \nI also liked the subplots: the romance was nice, and I liked the discussions about privilege/wealth that came up. My favourite subplot was the disappearance of Davies Pickett Senior and how it was affecting his family. Even though this was character driven i liked how these plots played into the story, and I also liked that it was happening and didn't leave Aza as the \"character who IS their MI\" character. I also just liked how teenage-ery this was. I mean, Aza's best friend Daisy writes shippy Rey/Chewbaccaa star wars fanfiction on AO3 ? And also there's a line that literally says \"he's probably some loser kylo ren stan\" that's fucking hilarious and authentically teen. I really just enjoyed that there was so much fanfiction in this book.\n“The thing about a spiral is, if you follow it inward, it never actually ends. It just keeps tightening, infinitely.” \nI just .. really thought this was nice. I thought it was well done. The representation is so so important. Like, guys we don't get good authentic MI rep like this that often. I really enjoyed the characters, I liked the writing and there was some lines and bits I really related to (after a good conversation you don't remember what you talked about, only how it made you feel being one of my favourites)There was also just ... none of the JG nonsense I didn't want. There was no dramatic romance with a nerd boy desperately trying to attain the girl. It was just .. good. I really enjoyed it so much more than I was expecting and I am going to gladly pick up more of this books in the future. YAY. \n“You're both the fire and the water that extinguishes it. You're the narrator, the protagonist, and the sidekick. You're the storyteller and the story told. You are somebody's something, but you are also your you.”"}, {"userName": "Christy", "userReviewDate": "Oct 16, 2017", "userURL": "http://www.goodreads.com/user/show/11284813-christy", "userReview": "4 stars!! \u2028\u2028John Green is one of those authors that always brings the feels. Turtles All the Way Down is a book about mental illness, it’s a book about the power of lifelong friendship, and there is a bit of romance thrown in the mix (though not much). \n\n“I would always be like this, always have this within me. There was no beating it. I would never slay the dragon, because the dragon was also me. My self and the disease were knotted together for life.”\n\n \u2028Aza’s story isn’t the easiest to read, and she probably won’t be a relatable character to all people. There were things about her I could relate to, and I loved her voice. I also adored her friend, Daisy. Their friendship was actually my favorite part of this story. I also liked Aza’s mom and the Davis story-line, even though it wasn’t the focus. Aza’s story was one that made me think, made me feel, and spoke to me. And it’s one of the first John Green books that didn’t make me cry LOL! I listened to the audio version and enjoyed the narration. Once again, Green writes an unforgettable story with a fantastically flawed leading character. I give this one 4 stars."}, {"userName": "Mohammed Arabey", "userReviewDate": "Oct 17, 2017", "userURL": "http://www.goodreads.com/user/show/13592557-mohammed-arabey", "userReview": "A bad story, from a very 'rich' life.Eh, What Life but Bad Stories All The Way Down!هي قصة سيئة للغاية،'متفلسفة' كعادة روايات جون جرين الوجودية..لكنها جزء من حياة ثرية للغايةليست حياة ذلك الثري الذي يهرب ويترك امواله ل'سحلية' لتكتشف سر الحياةبل هي حياة عزة هولمز، مريضة بمرض خطير..أضطراب الوسواس القهريتسيطر عليها افكارها الصغيرة..ولكن ستشعر بان افكار جون جرين نفسه هي المتحكمة بهاBest thing here is Aza Holmes, her life, her unforgettable OCD Narrative. I loved it even felt like I've caught some.\n\"It made no sense. I was a story riddled with plot holes.\"\nHer thoughts controlling her, but you'll have this constant feeling like these thoughts are just, Green's.\n*** القصة ***\nهي قصة افكار مضطربة تغزو عقل عزة وتدور بشكل حلزوني لتضيق عليها الخناق...تسيطر عليها وعلي تصرفاتهاوتؤثر علي المحيطين بها ، امها، واعز صديقة لها ، ربما الوحيدة الحقيقية، والفتي التي كانت معجبة به في صغرهاالفتي الذي تسمع عزة ذات صباح اختفاء والده الثري \"بفحش\" قبل القبض عليه لقضية رشوةومن يقدم علي اي معلومات تفيد هروب هذا الرجل سيحصل علي مكافأة 100 الف دولارعزة بحاجة للمال لجامعتها، وصديقتها الاعز ديزي كذلك….لم لا تذهب مرة اخري لذلك الفتي الذي عرفته يوما في طفولتهما وجمع بينهما شيئا ما…..الاحساس بالفقدان، هو فقد أمه وهي ابيها وقتها… لكنها الآن ستذهب له ربما تصل لمعلومات حول أبيه، فتحصل علي المكافأة~~~~~~~~~~~~~~~~~~هذا كل ما يسمح لي بالحكي عن القصة دون حرق نهايتها ، لان ما حدث بعد ذلك يمكن تلخيصه في سطرينفهي قصة عجيبة بدات قوية ومليئة بالاحتمالات والشخصيات الثرية وانتهت نهاية عادية عجيبة ربما مليئة بالفلسفةللاسف شعرت ان قصة اختفاء البليونير وكيف كانت النهاية جعلت الاحداث ككل قصة سيئة للغاية فبمجرد ان بدأت قصة الحب فتم تحول القصة لقصة عادية...بطيئة كالسلاحف..ثم العودة لفكرة اختفاء المليونير جعلت الحكاية اسوألكن رواية القصة من وجهة نظر عزة ، المصابة بالوسواس القهري ، وكيف يؤثر المرض عليها وعلي من حولهافي خلال القصة \"اختفاء المليونير\" التي كان يمكن الاستفادة منها بشكل أفضل ، ستجد صدام بينها وبين اعز صديقاتها ديزي يكشف حقيقة صداقتهما ومدي عمقها … قصة حب معقدة مع ديفز، ابن الثري الهارب، يعوقها الكثير منها وسواسها القهري … علاقة تعاطف جميلة بينها وبين شقيق ديفز الصغير الذي يشعر بالضياع لاختفاء والدهوستتعرف علي مشاعر ديفز نفسه ناحية والدهم الذي شغله جمع المال عنهما ، بل وفي النهاية يترك كل شئ من اجل سحلية من فصيلة الديناصورات المفترض ان الابحاث عنها ستؤدي كشف سر الحياة والشباب الدائمكل هذا كان يستحق قصة رئيسية افضل للربط بين كل هذه العلاقات والشخصياتلكن بدلا من هذا ستجد الفلسفة طوال الوقت \"العدمية ام الوجودية تلك التي يعتنقها جون جرين؟\" ، والتي حتي عرقلت قصة الحب -المبالغ فيها ايضا- بالحوار المتفلسف بزيادة الذي يحدث احيانا بين عزة ودايفز رغم ذلك شئ من الفلسفة كان جيدا ، المعلومات التي تم حشرها عن البكتيريا وتحكماتها في الجسد المضيف في فكرة السمك والطيور كانت مقدمة بشكل ممتاز ، ورمزية لما تشعر به عزة ان افكارها هي التي تقودها لفعل اشياء قد تؤذيها~~~~~~~~~~~~~~~~*** الشخصيات ***هي فعلا ما يستحق القراءةلقد كانت الشخصيات هي ما تأثرت بها واحببتها ، تصوير المرض بهذا الشكل الصعب المؤسف الذي سيدفعك فعلا لفهم طبيعة المصابين به والتعاطف معهمالاحداث الواقعية لفتاة مصابة بهذا الوسواس الذي اعتقد انه حتي قد يصيبنا لوقت ما ولو بنسبة ضئيلة ، تخيل اذا ماكن هذا ما يسيطر علي عقلك طوال الوقتتخيل مثلا ان يقلق أن تتعرق وانت في مكان مهم او بحضور شخص تهتم برأيه ، وهذا سيجعلك تشعر بقلق وتتعرق اكثر...ستشعر بمدي مأساة عزة من خلالها والتي تشعر بهذا طوال الوقت ديزي ، الصديقة الحميمة والتي تبدو لي انتهازية ... ومركزة الاهتمام علي نفسها..لكن رغم ذلك تحملها لحالة عزة كان جديرا بأن يقال انها صديقتها، إلا ان لها تحفظات علي اعز صديقاتها تطلقها بشكل غير مباشر...احببت جدا الصراع بينهما...لفترة كرهتها كثيرا ولكني مالبثت وتعاطفت معها مرة اخري...شخصية ثرية تماما كعزة..وهوسها العجيب بحرب النجوم وشخصياتها الاعجب فكرة جيدة واعجبتنيدايفز ، المراهق العميق، ابن الرجل الثري...الذي يمقت اسلوبه ويتمني لو يظل هاربا...فقط يصارعه حزن اخيه الاصغر علي فراق ابيهالشخصية رغم عمقها الزائد قد تشعر بتعاطف معه فعلا باوقات كثيرة ، ولكن اخيه الاصغر هو فعلا مصدر التعاطف والشفقة في بيت الاثرياء العجيب هذاوالذي ربما تضايقت لتفكك القصة المفترض انها رئيسية -وهي البحث عن ابيه الثري- منذ منتصف الاحداث واشتعال قصة الحب لدرجة النسيان بامر الاخ الاصغر لوقت طويل~~~~~~~~~~~~~~~~*** الأسلوب ***أعجبني جدا تصوير الرواية نفسها ، وصف المدينة كان جيدا، وان شعرت بالملل من الحياة التقليدية في انديانابوليس، تلك المدينة الصغيرة علي النهرلكن دخول عزة للجزء الثري من الاحداث وحياة الاثرياء كالبيت الذي يه السينما في الدور السفلي للفيلا، و اللوحات الاصلية والطبعات الاولي من الكتب ، جعلتي اشعر بشئ من الاثارة، والحسد ربما … لكنك ستتذكر حتما الجانب السئ للثراء بحوارات المؤلف الفلسفية المهروسة (هل نحن نسوي فعلا ما نملكه من مال؟) فصلني من الحكايةمما جعل قصة الحب بين عزة وديفز وقصة اختفاء لمليونير نفسها كيان هلامي لا يصلح لتماسك الرواية ككل النهاية نفسها برغم من سخرية عزة وصديقتها نفسها من تلك القصة في سطور الكتاب نفسه ، نهاية محبطة-مرة أخري ربما هي فلسفة جون جربن عن عدمية الحياة..عبثيتها ربمااو ربما ان الوجود في الوقت الحاضر فحسب هو ما يحسب، والقصة ماهي الا إطار من وسط لوحة ضخمة هي الحياة...او ايا كان هراء الفلسفة تلك-لكن ، ربما كان اطار القصة، الذي يحوي كل هذه الحيوات الثرية ، سخيفا فعلا...ولكن السنا نمر كل يوم من حياتنا بقصة سخيفة اخري؟وكما قيل في الرواية ، انها سلاحف تحت بعضها حتي الاسفل….فإن الحياة أيضا قصص سخيفة تحت بعضها ايضا حتي الاسفلمحمد العربيمن 17 اكتوبر 2017الي 23 اكتوبر 2017"}], "description": "Пропал миллиардер Рассел Пикет, и за любую помощь в его поисках объявлено солидной вознаграждение. Именно тогда Дейзи вместе с лучшей подругой Азой Холмс решают найти его во что бы то ни стало. Но для Азы это приключение грозит стать настоящим испытанием. Ведь ей придется общаться с людьми - а наедине с собой быть куда приятнее. Думать о других - но ей сложно отделаться от собственных навязчивых мыслей. И возобновить знакомство с сыном Пикета Дэвисом - а это лишь необходимость говорить правильные слова в то время, когда сама ты думаешь совсем о другом. Сможет ли Аза бросить себе вызов, побороть свои страхи и попытаться стать лучшей версией себя? Или перемены - не всегда к лучшему?", "title": "Черепахи - и нет им конца", "url": "http://www.goodreads.com/book/show/38742260--", "average": 4.05, "cover": "https://images.gr-assets.com/books/1519555923l/38742260.jpg", "reviews": 19862, "authors": [{"url": "https://www.goodreads.com/author/show/1406384.John_Green", "name": "John Green"}], "type": ["Young Adult", "Fiction", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/38742260--", "http://www.goodreads.com/book/show/15837671-turtles-all-the-way-down", "http://www.goodreads.com/book/show/35504431-turtles-all-the-way-down", "http://www.goodreads.com/book/show/35498621-turtles-all-the-way-down", "http://www.goodreads.com/book/show/35521513-turtles-all-the-way-down", "http://www.goodreads.com/book/show/36303679-turtles-all-the-way-down", "http://www.goodreads.com/book/show/11870085-the-fault-in-our-stars", "http://www.goodreads.com/book/show/99561.Looking_for_Alaska", "http://www.goodreads.com/book/show/6442769-paper-towns", "http://www.goodreads.com/book/show/49750.An_Abundance_of_Katherines", "http://www.goodreads.com/book/show/6567017-will-grayson-will-grayson"]}