{"ratings": 1411, "userreviews": [{"userName": "Ahmad Sharabiani", "userReviewDate": "Aug 31, 2012", "userURL": "http://www.goodreads.com/user/show/614778-ahmad-sharabiani", "userReview": "685.\tRemembrance of Things Past – Marcel ProustLa Prisonnière (À la recherche du temps perdu, #5-6), Marcel Proustتاریخ نخستین خوانش ماه نوامبر سال 1995 میلادیعنوان: در جستجوی زمان از دست رفته، کتاب پنجم: اسیر؛ نویسنده: مارسل پروست؛ مترجم: مهدی سحابی؛ تهران، نشر مرکز، 1369، شابک: 9643054810؛ چاپ سوم 1387؛ موضوع: داستان نویسندگان فرانسه - قرن 20 ماسیر کتاب پنجم از سری هفت جلدی نخستین بار در سال 1925 میلادی یکسال پس از درگذشت نویسنده منتشر شد؛ نقل لز متن: «… در نیازم به این که آلبرتین را هر شب این‌گونه نزد خود نگه دارم، گذشته از تمنایی که با پیشکشی جوانی را می‌ستود، چیز دیگری هم دخالت داشت که تا آن زمان در زندگی‌ام … بی‌سابقه بود. … بدون شک بسیار تعجب می‌کردم اگه به من گفته می‌شد که یکسره آدم نیکی نیستم و بویژه این که می‌کوشم کسی را از لذتی محروم کنم. بیگمان خودم را در آن زمان خوب نمی‌شناختم، زیرا لذتی که از اقامت آلبرتین در خانه‌ ام می‌بردم بس بیشتر از آن که لذتی مثبت باشد، ناشی از این بود که دختر شکوفا را از جهانی که هر کسی می‌توانست خوشیِ بودن با او را بچشد بدر برده بودم، به گونه‌ ای که دستکم اگر شادی بزرگی از او به من نمی‌رسید به دیگران هم نمی‌رسید. جاه‌ طلبی، افتخار، برایم مفهومی نداشت. از این هم بیشتر، نمی‌توانستم از کسی متنفر باشم. با این همه عشق جسمانی برایم برخورداری از لذت پیروزی بر رقیبانِ بسیار بود. هر چقدر بگویم باز کم گفته‌ ام که برایم بیش از هر چیزی نوعی تسکین بود.»؛ پایان نقل. ا. شربیانی"}, {"userName": "Fionnuala", "userReviewDate": "Sep 15, 2013", "userURL": "http://www.goodreads.com/user/show/5498525-fionnuala", "userReview": "[ (hide spoiler)]"}, {"userName": "Teresa", "userReviewDate": "Aug 30, 2015", "userURL": "http://www.goodreads.com/user/show/541416-teresa", "userReview": "If I didn't already know from previous volumes that our narrator tells us everything, all of his emotions and thoughts, flitting and fleeting, I might've been thinking at the start of this that he's a psychopath. He anticipates that, as he seems to anticipate everything, by later telling us: \nIf the reader has no more than a faint impression of these, that is because, as narrator, I reveal my sentiments to him at the same time as I repeat my words. But if I concealed the former and he were acquainted only with the latter, my actions, so little in keeping with my speech, would so often give him the impression of strange revulsions of feeling that he would think me almost mad.\n At both the beginning and end of this volume, I experienced my typical exasperation over the narrator's claustrophobic obsessiveness, but the feeling was not long-lasting, as this is arguably the best written installment so far. The authorial intrusions, and their connection with the narrator, are fascinating and exciting. The middle includes, easily, the best salon scene so far, due to the character of Charlus, and the narrator's musings on music and art and their relationship to the understanding of human nature. I recently perused a volume of Escher's works, so perhaps it's not surprising that I thought of him during Proust's description of a Fortuny dress, which led me to the thought that the relationship between 'prisoner' and 'jailer' (at least for the narrator; he hasn't convinced me of a thing concerning Albertine) is also Escher-like, with one turning into the other and then back again."}, {"userName": "Darwin8u", "userReviewDate": "Jun 06, 2013", "userURL": "http://www.goodreads.com/user/show/2294090-darwin8u", "userReview": "“We remember the truth because it has a name, is rooted in the past, but a makeshift lie is quickly forgotten.” ― Marcel Proust, The Captive or perhaps The Fugitive (I have now forgotten which)This is the fifth volume of Proust's In Search of Lost Time/Remembrance of Things Past. In the Captive, Proust's narrator is concerned about who Obama is in love with. The ardor of Speaker Boehner is face-to-face with the serenity of the House's hatred. The happiness that Congress knows is impossible, their fear that they will be rejected in the next election, faces the narrator with a dilemma -- does he leave the President he thinks he loves, or stay with the President he now ceases to love. The Fall, like the Spring of 17 years before, forces the narrator to shut government down to stir his soul to remind him of a vivid more pronounced period. Thinking of Gingrich, Boehner grips his heart in his hands as he discovers that the President has fled and left him alone, all alone, a captive in his own disgraced and ruined House."}, {"userName": "Teresa Proença", "userReviewDate": "Feb 20, 2016", "userURL": "http://www.goodreads.com/user/show/6923777-teresa-proen-a", "userReview": "(Eugène Vidal, Girl restings on her arms)\n\"A arte extraída do real mais familiar existe efectivamente, e o seu domínio talvez seja o mais vasto. Mas não é menos certo que um grande interesse, e às vezes beleza, pode nascer de acções decorrentes de uma forma de espírito tão distante de tudo aquilo que sentimos, de tudo aquilo em que acreditamos, que nem sequer conseguimos compreendê-las, de tal modo que se desenrolam à nossa frente como um espectáculo sem causa. Que existirá de mais poético que Xerxes, filho de Dario, mandando açoitar com vergastas o mar que engolira os seus navios?\" \"...não é verdade que é a arte, a arte de um Vinteuil [músico], como a arte de um Elstir [pintor], exteriorizando nas cores do espectro a composição íntima desses mundos a que chamamos indivíduos e que, se não fosse a arte, nunca conheceríamos? Asas, e outro aparelho respiratório, que nos permitissem atravessar a imensidade, não nos serviriam de nada. Porque se fôssemos a Marte e a Vénus mas conservássemos os mesmos sentidos, eles revestiriam tudo o que pudéssemos ver do mesmo aspecto das cores da Terra. A única verdadeira viagem, o único banho de Juventa não consistiria em partir para novas paisagens, mas em ter outros olhos, em ver o universo com os olhos de outro, de cem outros, em ver os cem universos que cada um deles vê, que cada um deles é; e eis o que podemos fazer com um Elstir, com um Vinteuil, com os seus semelhantes: voar na verdade de estrela em estrela.\"\"Enterraram-no, mas durante toda a noite fúnebre, nas vitrinas iluminadas, os seus livros, arrumados em grupos de três, velavam como anjos de asas abertas e pareciam ser, para aquele que já não existia, o símbolo da sua ressurreição.\""}, {"userName": "Narjes Dorzade", "userReviewDate": "Feb 25, 2018", "userURL": "http://www.goodreads.com/user/show/63354301-narjes-dorzade", "userReview": ".این کتاب را بر پیشانی ام بنویسم که چه اندازه زیبا بود و مستی بلندی داشت و موسیقای ظریف روح که در آن پیچیده بود ..ممنونم جناب مارسل پروست ❤ممنونم جناب مهدی سحابی برای واژه هایی که چه درست ترجمه کردید . ❤"}, {"userName": "Luís C.", "userReviewDate": "Jul 20, 2015", "userURL": "http://www.goodreads.com/user/show/34132356-lu-s-c", "userReview": "Volume 5, this block of 400 pages of obsessive and paranoid love, and its effects induced.Published in 1923, the first of three volumes released after Proust's death, La Prisonnière, volume 5 of \"La Recherche\", is also the only one with \"the time found\" to propose no division into chapters, and this is in my opinion not at all insignificant, when one has been able to gauge, during the four preceding volumes, the extremely precise roles that Proust assigns to these divisions and their alternations of long majestic rhythms (the three center chapters of Sodome et Gomorrhe, or the irrepressible flow of the last chapter of Le côté de Guermantes for example) and surgical dagger strokes (the first and the last chapter of Sodome et Gomorrhe, the first chapter of the second part of the Le côté de Guermantes , or the last chapter of Du côté de chez Swann).This is not trivial because, no doubt, the devouring obsession can not be cutted out, detailed, dismantled, it is itself a tumultuous flood that carries everything on its way, and that La Prisonnière is the story, in 400 pages, of the love obsession pushed to its climax, the paranoid passion of the narrator for Albertine - and her obsession with preserving her at all costs from her temptation of lesbian love - leading her to a virtual sequestration of her lover in her Parisian apartment, temporarily deserted by her mother, and her enrollment in a narrow network of surveillance by relatives \" of confidence \".This fifth volume also constitutes a real narrative feat in the context of the whole of the \"Research\", for a double title.First, while the narrator himself has detailed (but by masking the temporality since which he spoke at that time, it is true) the pangs of the \"love of Swann\", in the first volume , the author can republish the whole process by amplifying, deploying and refining it, without the sensation of \"déjà vu\" exceeding, precisely, the anvil role that was fixed on him, on which the hammer is going to knock tirelessly and for the delight (perversity?) of the reader. A warned man, definitely, is not worth two, in terms of obsessive love, anyway.Then, the jubilant irony that goes through the first four volumes, when the author, with that cruelty tongue-in-cheek that has gradually established itself as a trademark in his \"attitude\" vis-à-vis characters, made fun of everyone or almost, reached here a still unpolished summit, when the narrator \"aged\", since the end of the road and the \"Found Time\" warns us, reader, throughout the volume, that Marcel's efforts are in vain, that his confidence in the various chaperones he uses with Albertine is particularly misplaced, and that deep down, regularly, his paranoia will be wrong target for people, and will get in the end, like any jealousy and as all indicated clearly - except for the blind Marcel, at the bottom of his hole, riveted to his blinders - the result opposite to that sought, which will explode in the figure in the last thirty lines of the volume - which, exceptionally in the \"Research\", will therefore chained to the minute with the first lines of the next, «Albertine disparue»."}, {"userName": "Yann", "userReviewDate": "Jul 25, 2011", "userURL": "http://www.goodreads.com/user/show/5841104-yann", "userReview": "Encore un tome sympathique, qui se dévore, et qui nous plonge cette fois dans les méandres de la jalousie et de la frustration du narrateur. L'auteur prend tout le temps nécessaire pour examiner les moindres mouvements de l'âme de son héros, sans jamais craindre d'être trop long en coupant les cheveux en quatre. Mais on le suit sans rechigner.Suave, mari magno, turbantibus aequora ventis, e terra magnum alterius spectare laborem; non quia vexari quemquamst iucunda voluptas, sed quibus ipse malis careas quia cernere suavest. Lucrèce; De La Nature Des Choses; II, 1-4A mesure que l'on avance, on commence à sentir l'unité de l’œuvre, et les thèmes abordés dans les tomes précédents résonnent plus logiquement les uns avec les autres. J'ai particulièrement apprécié les références à l'histoire grecque, et surtout à la littérature russe, vers la fin, ainsi que le petit clin d’œil à l'insupportable Mme de Genlis, ce qui m'a remémoré ses Mémoires:Si je viens avec vous à Versailles, je vous montrerai le portrait de l'honnête homme par excellence, du meilleur des maris, Choderlos de Laclos, qui a écrit le plus effroyablement pervers des livres, et juste en face de celui de Madame de Genlis qui écrivit des contes moraux et ne se contenta pas de tromper la duchesse d'Orléans, mais la supplicia en détournant d'elle ses enfants.Un bon roman..."}, {"userName": "Isabel", "userReviewDate": "Nov 15, 2016", "userURL": "http://www.goodreads.com/user/show/4695246-isabel", "userReview": "P. 302- \"Há certos desejos , às vezes circunscritos à boca, que, uma vez que os deixámos crescer, exigem ser satisfeitos, sejam quais forem as consequências, já não podemos resistir à tentação de beijar um ombro decotado que há muito estamos contemplando e sobre o qual os nossos lábios se lançam como a serpente sobre o passarinho, ou à de deitar a mão a um bolo a mão fascinada por uma fome irresistível, ou à de renunciar à admiração, à perplexidade, à dor ou à alegria que vamos provocar numa alma com palavras imprevistas.\""}, {"userName": "Greg", "userReviewDate": "Oct 05, 2017", "userURL": "http://www.goodreads.com/user/show/39346323-greg", "userReview": "This is the only volume of the series (that I've read thus far) t0 take on a singular issue: a doomed relationship between our narrator (Proust) and Albertine as they share the Paris apartment of Proust's parents. He only wants, physically, a kiss from Albertine after he climbs into bed but before she proceeds to her own bedroom: in his childhood, he couldn't get to sleep until his mother kissed him goodnight. He is extremely jealous of Albertine's affection for anyone else, particularly her girlfriends, while he himself must be denying his own preferences (in real life, we learn in the prologue, he began an early relationship with the composer/pianist Reynalda Hahn.) \"If I can't, then she can't...\" must have been the situation in his own mind. As both characters suffer, it is only a matter of time before someone leaves. Most importantly, what \"excuse\" will he/she use? Both characters are living in a pretend world which is chilling and often creepy: they are indeed both captive to perceived expectations of an outside world. But all the while, some members of their \"high society\" have accepted exactly what Proust and Albertine are trying to hide. This is a sensational, intense, beautifully written novel of a psychological harrowing relationship. And to me, this is the best of the five volumes I've read so far: there is an certain intensity that builds to a climactic end."}, {"userName": "Laila", "userReviewDate": "Nov 28, 2016", "userURL": "http://www.goodreads.com/user/show/16125182-laila", "userReview": "Okudukça daha da içine girdiğimiz öyküde, Proust'un beyninin kıvrımlarında dolaşır gibi hissettim kendimi. Combray'da başlayan hikaye Albertine ve Proust arası kurgu doğrultusunda ilerlerken \"kim mahpus\" sorudunu sordurtan bir kurguda ilerliyor. Verdurinlerin aile yaşamına ve o zamana bakışlarındaki snobluğun, Charlus Baronu'nun tavırlarındaki sebeplerin anlatımını okurken kendinizi görünmez olmuş da olayları canli hissediyor gibi görüyorsunuz. Bu kitapta en çok dikkatimi çeken şey Vinteuil ile ilgili bölümler oldu. Öyle dile getirilmişti ki kendimi nette sonatı ararken bulup Proust'un muhteşem zekasının ürünu olduğunu öğrendiğimde şaşkın hissettim. Özellikle yediliden bahsettiği yerlerde beynimin içinde orkestra çalıyor gibiydi. Bir sonraki kitaba geçmek için sabırsızlanıyorum!"}, {"userName": "Michael Finocchiaro", "userReviewDate": "Sep 01, 2016", "userURL": "http://www.goodreads.com/user/show/48483884-michael-finocchiaro", "userReview": "In this book, we see dissected like a frog in a laboratory, the obsessive possessive behaviour of the narrator who is hopelessly in love with Albertine and wished to capture her and hold her prisonner but does not seem to realize that Albertine is not just a bird in a cage but a free spirit needing release (he will learn this very painfully later one.) It is the shortest book of La Recherche I believe and there was a beautiful French movie made from it with Romain Duris. It ends in tragedy which leads to the penultimate volume. A beautiful, heartbreaking book."}, {"userName": "Carloesse", "userReviewDate": "Feb 19, 2018", "userURL": "http://www.goodreads.com/user/show/24654990-carloesse", "userReview": "Ripresa la lettura dopo la sosta , con la stessa soddisfazione e il ritrovato entusiasmo nel procedere delle pagine. Riservandomi come sempre il commento completo solo alla fine dell’opera, mi soffermo solo per riassumere brevemente che l’intero volume tratta della breve convivenza (forse meno di un anno) di Albertine a casa di Marcel, nel ruolo di sua ospite provvisoria ma da Marcel avvertito sempre più come una prigione, che ingabbia lei (da qui il titolo) ma anche lui stesso. Nell’alternanza tra desiderio e rifiuto di riconoscere il proprio amore, le menzogne reciproche (vere o supposte), la continua rilettura del proprio passato e continui rovelli sulla gelosia e il suo ruolo nel desiderio d’amore, sulla memoria, sulla rilettura sempre nuova degli episodi del passato, e poi come sempre sull’arte, sulla musica, sul tempo e sulle sensazioni che qualsiasi episodio, pur minimo, può riportare a galla antichi dolori come fugaci gioie, la convivenza trascinata a fatica bruscamente alla fine si interrompe lasciando a Marcel nuova materia per i pensieri futuri…Come al solito alcuni episodi si dilatano occupando parecchie pagine del libro: qui in particolare una soirè musicale dai Verdurin, nella quale troverà l’improvvisa fine anche il rapporto particolare tra il Barone di Charlus e l’ingrato giovane musicista Morel, suo dotato pupillo (oltre che con gli stessi Verdurìn). E ora al sesto (e penultimo) tomo."}, {"userName": "Vale", "userReviewDate": "Apr 17, 2012", "userURL": "http://www.goodreads.com/user/show/5950000-vale", "userReview": "La prigioniera è Albertine, la donna amata, ma è anche l'anima del narratore perché l'amore, scrive Proust, è tanto più intenso quanto più impossibile.Albertine, la giovane fanciulla in fiore, ha amori saffici e colora la realtà di menzogne mal architettate che gettano il narratore nello sconforto più assoluto, ma soprattutto monopolizzano la sua mente, innescano la gelosia, perché egli sa che lei non lo ama. Difatti tutte le possibili azioni di Albertine avvenivano dentro di me. Di tutti gli esseri che conosciamo noi possediamo un doppio. Ma, solitamente situato all'orizzonte della nostra immaginazione, della nostra memoria, ci resta relativamente esterno...Leggendo Proust, si è spettatori di se stessi. Si vivono dolori sopiti e ci si riconosce negli sbagli più grossolani che solo una mente intorpidita dall'amore può commettere; poi sì, poi si rivive la fine e in un certo modo si riesce a elaborare anche l'ultimo segmento impreciso di dolore, perché è questa la grandezza dell'autore francese: riconcilia il lettore con il proprio passato."}, {"userName": "Rafal", "userReviewDate": "Mar 05, 2018", "userURL": "http://www.goodreads.com/user/show/45199512-rafal", "userReview": "W poprzedniej części miałem podejrzenia - teraz jestem pewny - narrator to psychopata!Zarówno w przypadku Sodomy i Gomory jak i w przypadku Uwięzionej - tytuł doskonale oddaje treść książki. Narrator zaniepokojony domniemanymi homoseksualnymi tendencjami swojej ukochanej Albertyny postanawia ją de facto uwięzić we własnym domu i tam pilnować, żeby nie zeszła na złą drogę. Więc więzi ją w imię wielkiej miłości, którą ją rzekomo darzy. Kłopot w tym, że miłości do Albertyny jest pewien tylko, gdy ma wrażenie, że ją straci, albo, że ona porzuci go dla jakiejś kelnerki lub dawnej przyjaciółki. Wtedy wspina się na szczyty manipulacji po to, by zatrzymać ją przy sobie - uwięzić. W innych momentach sam chce ją porzucić. Przez całą książkę narrator nie odbył jednej szczerej rozmowy ze Albertyną. Rozprawiając o kłamliwej naturze Albertyny, sam bezustannie wciąga ją w pułapki oszukując każdym zdaniem. I to jest w tej książce fascynujące. W pewnym momencie nie ma się wątpliwości, że to socjopata i Albertyna powinna czym prędzej od niego uciec. Czy ucieka? Dowie się ten, kto przeczyta, ale uprzedzam, że trzeba czekać do ostatniej strony ;-)A poza tym książka jest pełna rozważań o literaturze, rzeźbie, malarstwie. Słowem o sztuce, ale nie tylko. Jest także o wielu innych sprawach, w tym o automobilizmie oraz - szczególnie dużo tego w tym tomie - o ciuchach. Przeczytałem ten tom prawie z taką samą przyjemnością jak Sodomę i Gomorę. I coraz bardziej jestem zadowolony, że się zabrałem za \"W poszukiwaniu straconego czasu\"."}, {"userName": "amin akbari", "userReviewDate": "May 25, 2018", "userURL": "http://www.goodreads.com/user/show/43877225-amin-akbari", "userReview": "به نام اوپروست در ضدسنت بوو به سنت بوو یکی از مهمترین نظریه پردازان ادبی آن زمان که اعتقاد داشت شخصیت صاحب اثر و اثر قابل تفکیک نیست میتازد و بر این اعتقاد است که به دلیل آنکه صاحب اثر به مانند هر آدم دیگری از من های مختلف تشکیل شده است اثرش لزوما ارتباطی با شخصیتش ندارد.حال به نظر من پروست در جلد پنجم در جستجوی زمان از دست رفته خود در دام ارتباط اثر و صاحب اثر افتاده است و به همین خاطر میتوان لقب کسالتبارترین کتاب این مجموعه را به اسیر داد.پروست در \"طرف خانه سوان\" و \"در سایه دوشیزگان شکوفا\" به شرح زندگی مارسل (راوی) در سنین کودکی و نوجوانی و شرح احساسات و عواطف او میپردازد و در این دو کتاب تصویر کاملی از راوی و نسبت او با محیط و افراد ارائه میدهد در دو کتاب بعدی (طرف گرمانت و سدوم و عموره) بیشتر مشاهدات راوی از فضای پیرامونی خود است و کمتر ردپایی از راوی و علایق و سلایقش میتوان سراغ گرفت. در جلد پنجم و ششم (اسیر و گریخته) دوباره به خود راوی برمیگردیم منتها دیگر راوی نوجوان نیست که به شرح شیفتگی ها وعاشق شدنهایش (پیش از وصال) پرداخته شود. بلکه فرد بزرگسالی ست که به وصال رسیده است و با آلبرتین در یک جا زندگی میکند و رابطه دارد. مشکل از اینجا شروع میشود، پروستی که در زندگی شخصی به جنس مخالف چندان تمایلی نشان نداده و اصلا ازدواج نکرده است در شرح روابط خصوصی مارسل و آلبرتین بسیار بد عمل میکند و اصلا نمیتواند با همان دقت و رقت احساسی که در جاهای دیگر دارد فضاسازی کند و چیزی که نتیجه اش میشود صفحاتی کسالتبار. حال اینها را با شرح بی نظیر روابط دوشارلوس و مورل مقایسه کنید تا تاثیر من شخصی نویسنده در اثرش بیش از پیش مشخص شود."}, {"userName": "Nelson Zagalo", "userReviewDate": "May 19, 2015", "userURL": "http://www.goodreads.com/user/show/3831795-nelson-zagalo", "userReview": "Depois de no volume anterior Proust nos ter torrado a paciência com a 'snoberia' social, neste volume afunda totalmente em si, arrastando-nos para o interior de si. Por um fluxo de consciência escrito, abre-nos um acesso directo até à sua não-consciência. Temos quase todo o livro dedicado às interrogações de Marcel, a propósito do seu amor/ciúme (chegando ao sadismo) por Albertine, que passa todo o livro \"prisioneira\" em casa deste. Contudo, Proust consegue fazer deste quinto volume o mais agitado, criando mesmo verdadeiras sequências de suspense - gerando expectativa sobre o futuro de Charlus, ou sobre o futuro de Albertine - houve várias partes do livro em que não o conseguia pousar, as páginas sucediam-se e eu sentia a ânsia por saber o que ia acontecer aos personagens.[Imagem]Em Busca do Tempo Perdido - Volume V - \"A Prisioneira\"Uma das coisas mais relevantes em Proust, e que faz dele um dos mais importantes escritores de sempre, está no modo como ele produz essa ligação entre o não-consciente e o consciente, externalizando o pensamento por via do texto, para se dar a nós (para compreender melhor a ideia de consciência recomendo a leitura de um texto anterior). Não se trata de simplesmente descrever minuciosamente os estados de alma e os sentires, é verdade que Proust perscruta dentro de si de forma profunda e hábil, mas mais hábil e dotado é ainda na arte de transformar ideias mentais em palavras e frases.“ What compels my admiration for M. Proust’s work is that it is great art based on analysis. . . . I don’t think there is in [all] creative literature an example of power of analysis such as this.” — Joseph ConradNa semana passada lia num blog, um comentário a propósito da nova geração, incapaz de descrever o real sem recorrer a expressões “tipo isto“, “tipo aquilo”, “a coisa”. Lia também, numa abordagem distinta, algumas ideias sobre a eliminação de palavras supérfluas para uma comunicação de ideias mais concreta. E lendo Proust, está ali tudo, uma enorme riqueza de vocabulário aliada a um virtuosismo na composição de ideias.Sobre este ponto, que não se diga que as crianças não aprendem porque não se lhes explica, porque não se fala com elas. Esta capacidade de Proust, é verdade que desenvolvida a um ponto extremo, difícil de igualar, se existe, foi trabalhada por si, por duas formas apenas, a leitura e a escrita. Acredito que ajudou, como com muitos outros escritores, o facto de estar doente e recluso em casa que acabaria por lhe dar todo o tempo necessário à leitura. Não existe outra forma de desenvolver a externalização do pensamento que não seja através da leitura e escrita. Ler para construir uma bagagem de vocabulário, de composição e potencial gramatical. Escrever para se construir o veio que conduz o pensamento do não-consciente ao consciente.\"Foi efectivamente uma morta que vi quando depois entrei no quarto dela. Adormecera logo que se deitara; os lençóis enrolados no corpo como um sudário haviam tomado, nas suas belas pregas, uma rigidez de pedra. Dir-se-ia que, como em certos Juízos Finais da Idade Média, apenas a cabeça surgia fora do túmulo, esperando no seu sono pela trombeta do Arcanjo. Aquela cabeça fora surpreendida pelo sono quase caída para trás, com o cabelo hirsuto. E ao ver aquele corpo insignificante ali deitado, perguntava a mim mesmo que tábua de logaritmos constituiria ele para que todas as acções em que pudesse ter estado envolvido, desde um gesto do cotovelo até um roçagar de vestido, pudessem, prolongadas até ao infinito de todos os pontos que ocupara no espaço e no tempo, e de vez em quando bruscamente revivificadas na minha memória, causar-me angústias tão dolorosas, e que porém eu sabia serem determinadas por movimentos, por desejos dela que, cinco anos antes, ou cinco anos depois, numa outra qualquer, ou nela própria, tão indiferentes me teriam sido. Era uma mentira, mas para a qual eu não tinha a coragem de procurar outra solução que não fosse a minha morte.\" (p.352)Neste livro, e como já vem sendo hábito nos livros anteriores, o melhor fica guardado para a última parte, momento em que Marcel 'estica a corda' no relacionamento com Albertine, para descobrir mentiras que até aqui tinham feito parte da paisagem do livro como verdades. Já nas derradeiras linhas, também mais uma vez, Proust abre o motivo para o livro seguinte, deixando-nos ansiosos por prosseguir a leitura, ainda mais agora que já só faltam 2 volumes.Para ler com links, imagens e formatação: http://virtual-illusion.blogspot.pt/2..."}, {"userName": "Leonard", "userReviewDate": "Nov 28, 2015", "userURL": "http://www.goodreads.com/user/show/4940476-leonard", "userReview": "More than a commentary on Swann’s jealousy or M. Charlus’s homosexuality or the frivolity of the Guermantes’ sorties, Marcel Proust’s monumental work In Search of Lost Time paints the unsuccessful reconstruction of a forgone world and a lost existence from fickle memories, which like morning mists would fade with the rising sun. The narrator Marcel, longing for a past that didn’t exist but must be created, sought to experience Bergson’s continuous time rather than the fragmented and still-framed instantaneous moments by attempting to blur the boundaries between Cambray and Paris, childhood and adolescence, and Swann and himself and integrate here and there, before and after, and him and me through memory fragments of previous objects, people and sensations. As in a neural network or a mind-map, the madeleine linked his aunt to his mother, who in turn was linked to Albertine through jealousy, which also connected Marcel with Saint Loop and Swann, who, as with his (Marcel’s) grandmother, linked his childhood and adolescence. And through recollection, Marcel would try to relive the buried years and resurrect his grandmother and Albertine.But even during his narrative, Marcel realized memory’s willfulness and the variation in hues, shapes, pitch and timbre between the actual object and its mental reconstruction. When he encountered an old friend, the facial features were so different from his recollection and reconstruction, for better or for worse pregnant with all the emotions, preoccupation, biases, that he could not match face with voice.Because recollected sensation can never equate with the actual experience and time, like a patient thief, steals memories a morsel at a time until one day the owner would realize he was ruined, Marcel ultimately would fail to recapture and assemble stolen sensations and decayed seconds and in the end, must create new moments, new sensations and ultimately a new biography, through the synergy between past experiences and creative imagination. From those deceased hours and decayed memories sprouted In Search of Lost Time, not only Proust’s novel but also that of the narrator. Whether we savor Marcel’s frailness, Swann’s infatuation, Charlus’s pompousness, Franscoise’s independent-mindedness, the sorties’ frivolousness or the social revelation of the Dreyfuss Affair, we can enjoy Proust’s classic without resorting to Marxist or Freudian or Feminist critique. And the sentences, like the serpentine Amazon, seemed to flow unceasingly into the distant horizon carrying with it the sparkling sunlight. Although ascending the novel’s three thousand pages appears precipitous, the effort will be well worth the while and, at the end of the adventure, the reader can rest on the crisp apex and savor time’s transience and memory’s playfulness as if they were alpine zephyrs."}, {"userName": "Greg", "userReviewDate": "Oct 23, 2008", "userURL": "http://www.goodreads.com/user/show/42508-greg", "userReview": "On through the next installment of Marcel Proust's opus. In this book the reader is finally given the narrator's name, or possibly given it since he only makes a side mention that it might be the same as the author, and that for the sake of the passage he's writing to think of it as Marcel. It's a little weird that possibly a couple of thousand pages went by before him having to even give cause to use his name. The lack of names for anyone in his family is something that I keep finding interesting, I don't know why he does this, and I don't know if Anthony Powell's multi-volume epic is written in a similar fashion of making the narrator slightly de-personalized. Although in Proust after the Swanns Way the way in which the two authors use the narrator are as opposing as they can possibly be, so maybe I'm just making silly comparisons. Another interesting thing about this novel is that it continues the narrowing of scope that each off the books has done. Where the first novel was pretty big in it's scope of the early life of Swann, and the narrators life at Combray, by the time the events being described in the fifth novel happen they are all taking place in the space of only a few weeks (or maybe a couple of months), with most of the events only happening in a couple of days in that time. In this book too a certain unreliability begins to creep into the narration, the certainty of the earlier novels starts to collapse, where in SW there no uncertainty of the events going on even though they were happening years before the narrator had even been born, now the action that was going on closer to the point in which the novel is being written there is a fogginess to what is happening, the narrator questions his own memory of things said. This seems incredibly odd since he has up until now been able to give verbatim accounts of all kinds of conversations that have taken place at parties, but now in his memory of what has been said between him and Albertine there is cause for things to have drifted into the nothingness of forgetting. Aside from these little observations, there is something so magical about Proust, when I start to read him if I have the time to just sit and read I'm transported out of this world and into his. It's a feeling of total immersion, that the things going on around me seem to be paler in their reality after coming out of the pages being read. That's all for now, there will be more after the next novel gets read."}, {"userName": "Silvery", "userReviewDate": "Jan 26, 2018", "userURL": "http://www.goodreads.com/user/show/63871274-silvery", "userReview": "4,5 estrellas"}, {"userName": "Richard", "userReviewDate": "Aug 13, 2011", "userURL": "http://www.goodreads.com/user/show/6014887-richard", "userReview": "Relatively speaking there was a lot of suspense in this volume. There are the usual themes: the self, especially during the moment between sleeping and waking, art, time, eternity, happiness, etc.But there are also moments of high drama, carefully prepared. Will the wily yet transparent Monsieur de Charlus gain ascendancy over the domineering and manipulative Madame Verdurin? Will the narrator tame the seemingly docile yet wilful Albertine? More importantly will he ever do anything of significance with his life, other than sleep long in the mornings and yearn after people and things he may never enjoy to the fullest? If this sounds like a soap opera, well... it is!"}, {"userName": "Laura", "userReviewDate": "Apr 17, 2012", "userURL": "http://www.goodreads.com/user/show/900147-laura", "userReview": "The original French text is available at La Bibliothèque électronique du Québec - 1ere partie.The original French text is available at La Bibliothèque électronique du Québec - 2eme partie.Le narrateur est de retour à Paris, dans la maison de ses parents, absents pour le moment. Il y vit avec Albertine, et Françoise, la bonne. Les deux amants ont chacun leur chambre et leur salle de bains. Le narrateur fait tout pour contrôler la vie d’Albertine, afin d’éviter qu’elle donne des rendez-vous à des femmes. Il la maintient pour ainsi dire prisonnière chez lui, et lorsqu’elle sort, il s’arrange pour qu’Andrée, une amie commune aux deux amoureux, suive Albertine dans tous ses déplacements. L’attitude du narrateur est très proche de celle de Swann avec Odette dans Un Amour de Swann. L’amour, loin de le rendre heureux, suscite une incessante méfiance, et une jalousie de tous les instants. Le héros se rend compte aussi que malgré toutes ses précautions, Albertine lui est étrangère à bien des égards. Quoi qu’il fasse, elle reste définitivement un mystère pour lui. Cette vie en commun ne dure pas longtemps. Un jour, Françoise annonce au narrateur qu’Albertine est partie de bon matin.Cette édition numérisée reprend le texte de l’édition Gallimard, Paris, 1946-47, en 15 volumes :5* 1. Du côté de chez Swann. Première partie.5* 2. Du côté de chez Swann. Deuxième partie.3* 3. À l’ombre des jeunes filles en fleurs. Première partie. 3* 4. À l’ombre des jeunes filles en fleurs. Deuxième partie. 3* 5. À l’ombre des jeunes filles en fleurs. Troisième partie. 4* 6. Le côté de Guermantes. Première partie.4* 7. Le côté de Guermantes. Deuxième partie.4* 8. Le côté de Guermantes. Troisième partie.4* 9. Sodome et Gomorrhe. Première partie.4* 10. Sodome et Gomorrhe. Deuxième partie.3* 11. La Prisonnière. Première partie.3* 12. La Prisonnière. Deuxième partie.TR 13. Albertine disparue.TR 14. Le temps retrouvé. Première partie.TR 15. Le temps retrouvé. Deuxième partie."}, {"userName": "Lada Fleur", "userReviewDate": "Aug 09, 2014", "userURL": "http://www.goodreads.com/user/show/32579323-lada-fleur", "userReview": "Un tome de La Recherche vraiment extraordinaire. Deux espaces deux temps. Une realte et des reves. Un beau exterieur. Un interieur porteur de secret. L'ame qui se derobe dans l'espace meconnu. Un tome qui est beau sur le pouvoir d'amour et l'Amour comme impossibilite de percevoir le secret au cours de son deroulement"}, {"userName": "Mike Clinton", "userReviewDate": "Feb 02, 2014", "userURL": "http://www.goodreads.com/user/show/4749257-mike-clinton", "userReview": "This fifth volume of Proust's A la recherche opus left me with mixed feelings. At times the repeated rounds of unhinged jealousy, intense ardor, reassurance and indifference that the Narrator describes struck me as tedious and predictable. His mercurial emotional character and manipulative possessiveness also made him unlikable in a way that I hadn't found him to be in the previous volumes. Still, it's such a pleasure to read that my occasional irritation with these aspects don't eclipse my enjoyment in the work overall. And I recognize that the cycle of psychological torment that makes the Narrator as much imprisoned as Albertine and its effect on his character are integral to the dramatic tension that effectively serves in the place of a conventional plot, so my impatience with his emotional instability and behavior are - I would suspect - a response that Proust must have been seeking to inspire in the reader, mirroring the ennui that the dynamic between Marcel and Albertine ultimately produces in each other.Marcel and Albertine seem to be playing out the same amorous game that the Narrator recounts between Swann and Odette in the first volume. This is just one of many themes and impressions that reappear throughout the entire work but seem to do so more evidently and consequentially in this one. The phrase from Vinteuil's sonata inspires an aesthetic and personal epiphany in Marcel reminiscent of the one Swann had earlier experienced, for instance. These evocations invest me deeper into the work as a whole because of their familiarity and so always fix my attention in a way that I find satisfying, since they return me to places that I enjoy revisiting.In terms of the luxuriant prose that is a feature of the entire opus to the extent that it is practically another character in itself, perhaps my favorite is the section describing the colorful life in the street below the Narrator's window and the various sounds that harmonize into a natural human symphony even as each idiosyncratic element gets depicted in a way that brings its specific character to life. This sensual pleasure both reflects and further lifts the contented mood in which he awoke that morning, a dynamic continually reprised in the work - i.e., the connection between the outer world and the inner world, the sensuous and the aesthetic, the unconstrained and the constrained, etc.Another section of the book that I enjoyed was the reappearance of Charlus. The tension played out between him and Mme Verdurin provided as much as a linear plot - subplot, really - as a reader might find in Proust's work. It's interesting how the Narrator and Marcel occupy the same space here, too: in the third person observing the drama unfolding among Charlus, Mme Verdurin, and Morel, along with \"les gens du monde\" appearing in their bit parts, and at the same time in the first person his own internal drama playing out symbiotically."}, {"userName": "Xandra", "userReviewDate": "Oct 04, 2015", "userURL": "http://www.goodreads.com/user/show/6600821-xandra", "userReview": "[he’s going to beg her to take him back. (hide spoiler)]"}, {"userName": "Licinius", "userReviewDate": "Oct 02, 2011", "userURL": "http://www.goodreads.com/user/show/6061976-licinius", "userReview": "Haletant. Suant. Etouffant. La Prisonnière est un livre presque à part, une enclave dans cette recherche du temps perdu, un désert d'illusions. D'un côté, le Narrateur - Marcel - complètement rongé par la jalousie, qui décide d'atteindre l'absolu, c'est à dire de ne plus être séparé de celle qui le rend jaloux (traduire : amoureux), en enfermant l'objet de sa jalousie maladive chez lui. Albertine est sa Prisonnière. Mais curieusement, c'est surtout le Narrateur qui est prisonnier dans ce roman. Prisonnier de chez lui, il ne sort que très peu (et se dépêche de rentrer pour éviter qu'Albertine tombe dans les bras d'Andrée), ne reçoit presque personne (Albertine pourrait tomber amoureux de ses amis!), interroge tout le temps Albertine sur ses relations (Mlle Vinteuil... qu'Albertine n'a jamais rencontré!) et surtout, n’arrête pas de se faire du mal avec sa jalousie, car pour lui la douleur est devenu presque l’unique source de son amour envers Albertine.Tel un Swann obsédé par Odette, le Narrateur s’entête à vouloir garder prisonnière une femme qu’il n’a vu et aimé par sa liberté et ses mœurs légères. Lui-même le sait : on aime que ce que l’on ne possède pas entièrement. Et tant qu’un recoin de l’âme d’Albertine lui échappe, il continuera à exercer son devoir de geôlier, en s’enfonçant de plus en plus dans une souffrance presque infinie, tant les réponses qu’il reçoit de sa prisonnière ne parviennent pas à apaiser ses inquiétudes de maniaque. Et quand bien même il n’aime pas Albertine, il ne parvient pas à s’en débarrasser totalement, tant il craint la douleur. Et justement, quand celle-ci s’enfuit un beau matin, le Narrateur vient de comprendre que c’est une partie de sa vie qui s’en va et le retour de son angoisse ultime: la séparation de l’être aimé."}, {"userName": "ZaRi", "userReviewDate": "Sep 16, 2015", "userURL": "http://www.goodreads.com/user/show/26168013-zari", "userReview": "در نیازم به این که آلبرتین را هر شب این‌گونه نزد خود نگه دارم، گذشته از تمنایی که با پیشکش‌ی جوانی را می‌ستود، چیز دیگری هم دخالت داشت که تا آن زمان در زندگی‌ام … بی‌سابقه بود. … بدون شک بسیار تعجب می‌کردم اگه به من گفته می‌شد که یکسره آدم نیکی نیستم و بویژه این که می‌کوشم کسی را از لذتی محروم کنم. بیگمان خودم را در آن زمان خوب نمی‌شناختم، زیرا لذتی که از اقامت آلبرتین در خانه‌ام می‌بردم بس بیشتر از آن که لذتی مثبت باشد، ناشی از این بود که دختر شکوفا را از جهانی که هر کسی می‌توانست خوشیِ بودن با او را بچشد بدر برده بودم، به گونه‌ای که دستکم اگر شادی بزرگی از او به من نمی‌رسید به دیگران هم نمی‌رسید.جاه‌طلبی، افتخار برایم مفهومی نداشت. از این هم بیشتر، نمی‌توانستم از کسی متنفر باشم. با این همه عشق جسمانی برایم برخورداری از لذت پیروزی بر رقیبانِ بسیار بود. هر چقدر بگویم باز کم گفته‌ام که برایم بیش از هر چیزی نوعی تسکین بود.»من اسمش را گذاشته‌ام مانیفیست حسادت!"}, {"userName": "Noreen", "userReviewDate": "May 10, 2009", "userURL": "http://www.goodreads.com/user/show/35978-noreen", "userReview": "It's hard to believe this is my third time through this thing (ISOLT). I swear that I am never reading it again (though I suppose I'm not the first person to say that while reading this particular volume). Thank god that \"Time Regained\" is just around the corner."}, {"userName": "Katrin", "userReviewDate": "Jan 22, 2017", "userURL": "http://www.goodreads.com/user/show/3900531-katrin", "userReview": "Ο Προυστ άτρωτος στον χρόνο, σαγηνευτής στο λόγο. Ο Ζάννας μαγικός στη μετάφραση."}, {"userName": "Caroline", "userReviewDate": "Apr 02, 2013", "userURL": "http://www.goodreads.com/user/show/5261455-caroline", "userReview": "When I was about midway through A la Recherche I read that Nabokov said it that the first half was one of the four (or three or five or whatever) best books of the 20th century. I'm not in that camp quite yet, but leaning toward it. Things are definitely slowing down in the second half. When Proust takes out his palette to talk about the wider Parisian society, and sometimes when he writes about memory, time, etc he is wonderful. But the endless pages on love and obsession are too much. I have stated reading a bit of commentary, hoping to gain some insights without discovering the rest of the plot, and I understand that he is talking about love being only as long as the chase, and that we can never really know another person, but it's just too much jealousy. Anyway, the gradual filling in of the pictures of the Verdurins and Charlus are worth the rest for now."}], "description": "ویراست ٧ جلدی (ویراست دوم) که اولین بار در زمستان ٨٦ چاپ شدتوضیحات در مورد تفاوت ویراست دومhttp://www.hamshahrionline.ir/details...طرف خانۀ سوان در جستجوی زمان از دست رفته ١در سایه دوشیزگان شکوفا در جستجوی زمان از دست رفته ٢طرف گرمانت: کامل در جستجوی زمان از دست رفته ٣سدوم و عموره در جستجوی زمان از دست رفته ٤اسیر در جستجوی زمان از دست رفته ٥گریخته در جستجوی زمان از دست رفته ٦زمان بازیافته در جستجوی زمان از دست رفته ٧", "title": "اسیر\n      \n          (À la recherche du temps perdu #5)", "url": "http://www.goodreads.com/book/show/3942129", "average": 4.3, "cover": "https://images.gr-assets.com/books/1505513437l/3942129.jpg", "reviews": 101, "authors": [{"url": "https://www.goodreads.com/author/show/233619.Marcel_Proust", "name": "Marcel Proust"}, {"url": "https://www.goodreads.com/author/show/446100._", "name": "مهدی سحابی"}], "type": ["Classics", "European Literature", "Cultural", "Novels", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/3942129", "http://www.goodreads.com/book/show/865125.La_Prisonniere", "http://www.goodreads.com/book/show/21002579-the-captive-in-search-of-lost-time-vol-5", "http://www.goodreads.com/book/show/17158895-the-captive", "http://www.goodreads.com/book/show/25944212-a-prisioneira", "http://www.goodreads.com/book/show/16182263", "http://www.goodreads.com/book/show/865124.La_Prisonni_re", "http://www.goodreads.com/book/show/22725633-the-captive", "http://www.goodreads.com/book/show/8663556-mahpus", "http://www.goodreads.com/book/show/23263874-la-prigioniera", "http://www.goodreads.com/book/show/9794007-la-prigioniera-con-un-saggio-su-proust-e-la-critica-slava", "http://www.goodreads.com/book/show/37564224-uwi-ziona", "http://www.goodreads.com/book/show/2162472.In_Search_of_Lost_Time", "http://www.goodreads.com/book/show/24797872-la-prisionera", "http://www.goodreads.com/book/show/865121.La_Prisonniere", "http://www.goodreads.com/book/show/20716602-a-la-recherche-du-temps-perdu", "http://www.goodreads.com/book/show/4001805-the-captive", "http://www.goodreads.com/book/show/770678.The_Captive", "http://www.goodreads.com/book/show/12749.Swann_s_Way", "http://www.goodreads.com/book/show/18796.In_Search_of_Lost_Time", "http://www.goodreads.com/book/show/28385.In_the_Shadow_of_Young_Girls_in_Flower", "http://www.goodreads.com/book/show/18798.The_Guermantes_Way", "http://www.goodreads.com/book/show/18799.Sodom_and_Gomorrah"]}