{"ratings": 11028, "userreviews": [{"userName": "Damien", "userReviewDate": "Jul 03, 2007", "userURL": "http://www.goodreads.com/user/show/147582-damien", "userReview": "It is not so much that it was a bad book, but it made me want to kill myself."}, {"userName": "Lisa", "userReviewDate": "Jul 21, 2014", "userURL": "http://www.goodreads.com/user/show/32532774-lisa", "userReview": "Sad story about an ambitious boy who slowly breaks down when facing the pressure of the adult world. While showing the catastrophic effects of a rigid educational system and excessive parental expectations, it also hints at the responsibility of the young to get to grips with life and not just give up and drift along.As important topic now as when it was written!"}, {"userName": "Thom Young", "userReviewDate": "Jul 10, 2011", "userURL": "http://www.goodreads.com/user/show/1889570-thom-young", "userReview": "If you're an educator, you need to read this book. It's unfortunate that today's education crushes the individual spirit and is more about bubbling scantrons. It's all about money by the testing companies, no wonder most americans are clueless about our nation's history. Years of watching reality television and American Gladiators I suppose. Hesse is the best writer ever in my opinion, just his use of description is amazing in itself. I love the ending of this book. It is sad and beautiful. Hesse uses the eastern philosophy of yin and yang, when a young student meets his opposite at school a new world opens up. A must read."}, {"userName": "Raha", "userReviewDate": "Jul 21, 2017", "userURL": "http://www.goodreads.com/user/show/5932778-raha", "userReview": "فوق العاده لطیف و زیبا بود...واقعا از خوندنش لذت بردم .وقتی به پایان کتاب رسیدم حس خیلی عجیب و گنگی داشتم.تنها نویسنده ای که من در گذشته بعد از پایان کتاب هاش چنین حسی رو تجربه کردم \"هاروکی موراکامی\" بوده....شباهت های زیادی بین کارهای این دو نویسنده دیدم و عجیب و بعید هم نیست اگر \"موراکامی\" تا حدودی از کارهای \"هسه\" الهام گرفته باشهداستان کتاب روایت پسر نوجوانی است که هوش و استعدادی استثنائی دارد و این باعث می شود که پدر و معلمینش بی توجه به خواسته های کودکانه او همه ی وقت استراحت و تفریحش را از او بگیرند.اما همین طور که پسرک بزرگتر می شود در می یابد که چه روزگاران خوشی را پشت سر گذاشته بدون اینکه ذره ای از آن لذت برده باشد و حالا تنها و افسرده به دنبال راهی برای بازگشت به دوران کودکی می گردد....راهی که به بیراهه می رود"}, {"userName": "Andy", "userReviewDate": "Jul 23, 2008", "userURL": "http://www.goodreads.com/user/show/764075-andy", "userReview": "Underrated brilliance from Hesse about an insanely hard-working student who finally cracks like an egg and has to slow down and appreciate the world around him, even if it kills him. This kind of tale gets pretty trite very easily, but Hesse's Germanic Zen outlook defines existence in a marvelous and offbeat light."}, {"userName": "huzeyfe", "userReviewDate": "Sep 28, 2017", "userURL": "http://www.goodreads.com/user/show/14317776-huzeyfe", "userReview": "Hans'in hikayesini kucumsemek istemiyorum ama bizim donemde bircok cocugun, gencin yasadigi problemlerin benzerini yasadigi icin hikaye cok tanidik geldi. Onu enfes bir hikaye yapan ise Hesse'nin duru, akici ve etkileyici uslubu. Basit bir dille nasil da etkileyici bir kitap yazilabiliyormus onu goruyorsunuz.Nacizane gorusum, isi egitim olan herkesin ve ailelerin mutlaka okumasi gereken bir kitap. Zira, cocuklarimiz ile ilgili beklentilere girerken, onlara belki de kaldiramayacaklari sorumluluklari yuklerken onlarin birey olmaktan giderek uzaklastiklarini goremiyoruz. Mutluluk getirmeyecek basari, huzuru olmayan bir yasama goturur insani. Birakalim cocuklarimiz once iyi bir insan olmayi, mutlu olmayi ogrensinler. Bu en buyuk basaridir."}, {"userName": "Akemi G.", "userReviewDate": "Sep 07, 2016", "userURL": "http://www.goodreads.com/user/show/28637268-akemi-g", "userReview": "In Japan, this is one of the most popular title by this author, and like other teens who like reading, I read and loved it. It doesn't look very popular in the US . . . interesting. A few other books I picked up in those days partly because my friends were reading them -- ah, the peer pressure! -- should I mention I was a top student? --were: The Sorrows of Young Werther, Strait is the Gate, Bonjour tristesse, short stories by Chekhov Anton . . . lovely assortment, isn't it? We didn't know the existence of On the Road or Lolita.School started this week, and I wonder what today's teens are reading."}, {"userName": "أحمد جابر", "userReviewDate": "Aug 25, 2016", "userURL": "http://www.goodreads.com/user/show/14003483", "userReview": "تحت العجلة، أولى رحلاتي مع هيرمان هسه، الفائز بنوبل 1946، تتحدث عن النظام التعليمي الظالم الذي يفرض نفسه على الطلاب، حيث يقيدهم ضمن حدود ما تريده المدرسة، وخاصة إن كانت دينية، فلا تدع لهم مجالاً للتعمق في الذات، أو الطبيعة، أو النهل من علوم الفلسفة، وهذا ما حدث عندما عارض المدير والمعلمون الطفل هيرمان هايلنر الذي كان يقرأ لهوميروس والشعر والفلسفة، مما أدى به إلى الهروب بعيداً.البطل هنا، هانز، هو الضحية، حيث يتعرض لضغوطات عدة، من المجتمع والدين والمدرسة، ففي البداية، نجد المجتمع المحيط يضغط عليه للحصول على منحة دراسية ترفع من اسم منطقته عالياً بين المناطق، فكأنه خنق أحلامه وحصرها على تلك المنحة، والتي حصل عليها بعد صراعات نفسية داخله.في المدرسة، تتزايد المطالب على الطلاب، بدلاً من استكشاف العالم، وخارجها عن الأهل، نجدهم يطلبون من أبنائهم الدراسة والتعلم في أوقات العطل، أو العمل في الصيد أو السباكة أو غيرها، وهذا كله على حساب التأمل والسفر والراحة واستكشاف الخارج.هيرمان هسه في الرواية ينقد النظام التعليمي، الذي تعرض له أصلاً، ويقال إنه هو نفسه شخصية هيرمان هايلنر، الذي حاولت المدرسة أن تدمر روحه الفردية المتفردة عن غيره، ولكنه هرب.ما زلنا نعايش الرواية حتى الآن، من احترام أعمى للسلطة، والدين المنظم، مما يؤدي بالطفل ذي الروح الوديعة أن يخسر طفولته، ثم يخسر نفسه ومستقبله.هانز، وغيره من الذي حاولوا التفكر خارج قيود المدرسة، انتهى بهم الأمر إلى السحق تحت العجلة.رواية بديعة لهيرمان هسه."}, {"userName": "SJ Loria", "userReviewDate": "Nov 29, 2009", "userURL": "http://www.goodreads.com/user/show/826429-sj-loria", "userReview": "This story showcases Hesse’s brilliant prose mixed with his thoughts on life, aging, and love. In a story centered around a bright, gifted, yet timid boy Hesse shows both sides of the spectrum, celebrating the pain and sorrow along with the joys and surprises of life. The boy’s tale is equally beautiful and tragic. He has extraordinary gifts that simply do not fit into the demanded “one narrow path” of life for small town German students at the time. Unfortunately, he is crushed beneath the wheel like a cog in the machine, and the world does not benefit from his talents and vision. This boy was called to join in the higher realm of thinkers and people, yet due to the conditions of society he is unable to live this out. Perhaps a line where Hesse describes learning sums up the view of society and life just as well, “Every day true scholarship seemed more beautiful, more difficult, more worthwhile.” In this novel Hesse shows life as beautiful, difficult, and worthwhile if one can overcome the obstacles presented by a society intent on suffocating dreams. The clear menace in this tale is the system of school, organized religion, and people who place their demands on students instead of letting them explore the world. Our protagonist is the victim, but the intended effect is that the reader take away this lesson and not join their ranks. Hesse still celebrates life and the poetry of every moment, and he viciously attacks those who suppress it in this tragic tale.One question I had while reading this novel is whether or not adulthood itself is another enemy. The transition from childhood to adulthood is performed though love, which Hans experiences first through friendship, then through a hint of homosexuality, and then finally through heterosexual longing. The transition into adulthood opens the door to pain and suffering. Though love is beautiful, it is not clear in this novel whether or not Hesse thinks its beauty is worth the price of innocence lost. The passages describing Hans falling in love are absolutely stunning, however the cost of love remains unsettled. Is adulthood and love worth the pain of growing up? Hesse leaves this unanswered, which is a surprise in this novel. Another surprise is the passage about a homosexual experience and an unlikely person at the end of the book to accept any of the blame. There are questions open to consideration through a tale that describes the beauty of life through poetic prose. A damn good book, classic Hesse.QuotesIt was possible to live in this town and give the appearance of being educated without knowing the speeches in Zarathustra. 5Thus his future was mapped out, for in all of Swabia there existed but one narrow path for talented boys – that is, unless their parents were wealthy. 5In a single hour he introduced Hans to an entirely new approach to learning and reading. Hands received an intimation of what tasks and puzzles lay hidden in each line and word, how thousands of scholars and investigators had expended their efforts since the earliest times to unravel these questions, and it seemed to him that he was being accepted into the ranks of these truth-seekers this very hour. 47Every day true scholarship seemed more beautiful, more difficult, more worthwhile. 47It has occurred to many people while they stood on this square that it would be just the right place for the good life and happiness, for something lively and gratifying to grow, for mature and good people to think glad thoughts and produce beautiful, cheerful works. 57Proud and praiseworthy feelings and high hopes swelled in their breasts and it did not occur to a single one of them that this day he was selling his child for a financial advantage…it did not occur to any of the boys, nor to their fathers, that all this would perhaps not really be free. 65“He realized that there are certain sins and omissions beyond forgiveness and repentance and it seemed to him that the stretcher bore not the tailor’s little son but Heilner, who now took all the pain and anger caused by Han’s faithlessness with him far into another world where people were judged not by their grades and examination marks and scholastic success but soley in accord with the purity or impurity of their consciences…they realized for a fleeting moment how irrecoverable and unique is each life and youth. 94Anyone with a touch of genius seems to his teachers a freak from the very first…[a teacher’s:] task is not to produce extravagant intellects but good Latinists, arithmeticians and sober decent folk…among true geniuses the wounds almost always heal. As their personalities develop, they create their art in spite of school…thus the struggle between rule and spirit repeats itself year after year from school to school. 100He was like someone in love for the first time: he felt capable of performing great heroic deed but not the daily chore of boring, petty work. 103Their faces displayed the whole spectrum of shadings between vanishing childishness and budding manhood. 106Hans’ thoughts and dreams now moved in this world to which he had been so long a stranger. He sought refuge from his great disappointment and hopelessness in a past that had been good to him. In those days he had been full of hope, had seen the world lying before him like a vast enchanted forest holding gruesome dangers, accursed treasures and emerald castles in its impenetrable depths. He had entered a little way into this wilderness but he had become weary before he had found miracles. 138He stared at her with a mixture of unfamiliar desire and bad conscience. In this hour something broke inside him and a new, alien but enticing land with distant blue shores opened up before his soul. He did not know or could only guess what the apprehension and sweet agony signified, and did not know which was stronger, pain or desire.But the desire signified…the first intimation of the mighty forces of life, and the pain signified that the morning peace had been broken, that his soul had left that childhood land which can never be found again…He must find his own way and be his own savior. 150Fearful but shaken to the roots of his being, he felt the nearness of a great mystery, not knowing whether it would be delicious or dreadful but having a foretaste of both. 153The pain and anger over this loss and the restlessness of his inflamed but unsatisfied passion came together in a single, agonizing confusion…In this way he discovered – perhaps too soon – his share of the secret of love, and it contained little sweetness and much bitterness. 165"}, {"userName": "J.K. Grice", "userReviewDate": "Oct 03, 2017", "userURL": "http://www.goodreads.com/user/show/72137025-j-k-grice", "userReview": "Life lessons and a great protagonist occupy this second Hesse novel that I read, BENEATH THE WHEEL. Great book!"}, {"userName": "Guillermo Gonca", "userReviewDate": "Jun 15, 2017", "userURL": "http://www.goodreads.com/user/show/54405756-guillermo-gonca", "userReview": "Esta fue la segunda novela escrita por Hermann Hesse, maestro del Bildungsroman o novela de iniciación. Aunque fue escrita en 1906, una época en la que la mayoría de los escritores jóvenes iniciaban la búsqueda de nuevos caminos literarios, nuestro autor prefiere guiarse por el sentido académico, escribiendo con una limpieza y claridad notables, propias del siglo anterior. En este breve y conciso libro no hay experimentos ni artificios que pudieran complicar su lectura. No obstante, contiene la brillantez necesaria para convencer a todo aquel que busque una lectura estimulante y agradable que trate sobre las situaciones sociales y emocionales comunes a todos los seres humanos.El protagonista es Hans Giebenrath, un jovencito pueblerino, sensible y solitario cuyo enorme talento para los estudios le permite soñar con un futuro muy respetable. Por tanto, enfrenta la edad de la pubertad en medio de enormes expectativas; sus padres y profesores se hinchan de orgullo tan sólo por tener en su familia o en sus aulas a este despierto muchacho. Desafortunadamente, las instituciones educativas, parecían no estar diseñadas para fomentar (ni siquiera tolerar) a genios en potencia, sino únicamente para formar \"buenos ciudadanos\" civilizados y obedientes (En realidad \"buenos para nada\" como precisa el mismo Hesse).Lo curioso es que los lectores contemporáneos comparamos y corroboramos que la problemática sigue siendo la misma: aún en nuestros días seguimos formando peones en lugar de campeones del pensamiento. Además, los niños prodigio de la academia, las artes y los deportes, siguen llevando a cuestas una pesada carga de exigencias poco acordes con su edad. Sus tutores les abruman estimulando sus habilidades, pero olvidan ocuparse de su desarrollo emocional en fases de crecimiento cruciales. Si el niño tiene éxito, será a costa de su infancia lo cual ya es trágico; pero hay algo mucho peor: si fracasa no será querido por nadie.En una escena de esta novela, el director de la institución educativa aconseja a Hans Giebenrath diciéndole: \"No aflojes en tus estudios, de lo contrario caerás bajo las ruedas\". Pues bien, veamos que significa esta frase que da título a nuestra novela: En el idioma alemán quien se encuentra \"bajo las ruedas\" vive en una situación de indolencia y fracaso. Se trata de una expresión similar a la de la \"piedra rodante\" del idioma inglés, o la del \"vago sin oficio ni beneficio\" del idioma castellano y dentro de esta despreciable posición de vulnerabilidad, la inercia de la sociedad terminaría atropellando al incapaz, malvado o fracasado que se colocara ahí. Sin embargo, no es Hans Giebenrath quién por su gusto o por sus errores se coloca \"bajo las ruedas\". Es el sistema represivo e insensible quién lo pone en peligro de malograrse como ser humano.La estructura de la novela es muy convencional presentando siete capítulos, de los cuales los primeros cuatro presentan un estilo sorprendentemente pulcro y regular. La disgresión se presenta en el quinto capítulo y entonces la historia da un giro ambiental y argumental que acelera el ritmo y nos prepara para el desenlace. El narrador en rígida tercera persona, da cuenta de los sentimientos más íntimos del protagonista, pero (fiel al estilo antiguo) se mantiene distante e impersonal. Es el narrador ideal para quién busca una lectura ligera y digerible pero de alta capacidad descriptiva.Encuentro similitudes entre esta novela y \"Jakob Von Gunten\" de Robert Walser, escrita tres años después (La diferencia estriba en que el estilo de Walser es más modernista y experimental), pues ambas novelas abordan el tema de la educación \"victoriana\" que se empeña en negar la existencia de un periodo intermedio entre la niñez y la vida adulta. También describen la problemática emocional de los adolescentes recluidos en internados junto con otros jóvenes de su mismo sexo; ante la ausencia de chicas, las inquietudes sentimentales de los alumnos tendrán que resolverse entre ellos mismos, lo que da lugar a una especie de homoerotismo. Sin embargo, con el tiempo los personajes terminan dando pie a su heterosexualidad (Hoy en día la convivencia entre los sexos es más temprana e integral, y permite que individuos descubran sus inclinaciones de manera más natural). También encuentro similitudes con \"Demian\" novela que el mismo Hesse escribiría posteriormente y que representaría un paso adelante en su perfeccionamiento como escritor de Bildungsroman.Desde esta novela temprana, el autor logra describir con belleza y profundidad sentimental el gozo y el sufrimiento de la vida. Sabe celebrar la existencia, el amor y el erotismo y logra lamentar de manera conmovedora la obscuridad de un alma afligida y la intempestiva frialdad de la muerte. Recomiendo \"Bajo las ruedas\" como un libro introductorio al formidable universo de Hermann Hesse ya que tiene todo para ser digerido y disfrutado por cualquier joven lector. Después podrá gozar de obras más complejas como \"El lobo estepario\" o \"El juego de los abalorios\".La traduccion al español de editorial Alianza (aunque ya antigua) sigue estando vigente."}, {"userName": "Seth", "userReviewDate": "May 27, 2013", "userURL": "http://www.goodreads.com/user/show/4351439-seth", "userReview": "An English translation of my review can be found below.Dieser Roman erinnerte mich daran, was ich schon in meiner Jugend an Hermann Hesse so verlockend fand. Er war ein wunderbarer Schriftsteller! Seine präzisen Beschreibungen sowohl des Innenlebens des unglücklichen Klosterschülers Hans Giebenrath wie der widersprüchlichen Schönheit der physischen Umwelt, in der er zu Grunde ging, sind außerordentlich. Die wunderschöne Sprache des Romans übt eine fast magische Wirkung auf den Leser aus. „Unterm Rad“ ist autobiografisch in dem Sinne, daß Hesse sich selbst in Hermann Heilner, dem besten Freund von Hans, darstellt. Hermann, ein sehr begabter aber aufrührerischer junger Mensch, kommt in der repressiven Schule nicht zurecht. Da er es prinzipiell ablehnt, sich der Gesellschaftsordnung anzupassen, wird er entlassen.Hans wiederum verkörpert Hesses gleichnamigen Bruder, der wegen seiner eigenen Qualen Selbstmord begangen hat, nachdem die Schule ihn psychisch gebrochen hat. Im Roman wird Hans ebenfalls entlassen, aber hauptsächlich wegen seiner schlechten Gesundheit (schwindelerregende Kopfschmerzen), obwohl der Rektor es ihm auch übelnimmt, daß er unter den Einfluss von Hermann geraten ist. Aus beiden Gründen kann er dem Leistungsdruck nicht standhalten. Das Kloster Maulbronn, wo Hesse nach dem bestandenen Landexamen Latein gelernt hat und wo der Roman sich abspielt, wurde von der UNESCO als Weltkulturerbe anerkannt.Vor diesem Hintergrund ist es leicht nachzuvollziehen, wie Hesse in dem Roman das Bedürfnis hatte, sich mit der autoritären Erziehung in Deutschland des frühen zwanzigsten Jahrhunderts so schonungslos auseinanderzusetzen. Seine Bildungskritik ist überzeugend.Lieblingszitat: „Nur nicht matt werden, sonst kommt man unters Rad.“----------------------This novel reminded me what I found so compelling about Hermann Hesse in my youth. He was a wonderful writer! His precise descriptions of both the inner life of the unhappy cloister student Hans Giebenrath and the contradictory beauty of the physical environment, in which he perished, are extraordinary. The wonderfully beautiful language of the novel has an almost magical effect on the reader.“Under the Wheel” is autobiographical in the sense that Hesse represents himself in Hermann Heilner, Hans’s best friend. Hermann, a very gifted but rebellious young man, cannot cope with the repressive school. Since he refuses as a matter of principle to conform to the social order, he is expelled. Hans, in turn, personifies Hesse’s eponymous brother, who committed suicide because of his own torments after school destroyed him psychologically. In the novel, Hans is likewise expelled, but primarily due to his poor health (dizziness-inducing headaches), although the headmaster also resents the fact that he has fallen under Hermann’s influence. For both reasons, he cannot handle the pressure to perform. UNESCO has recognized the Maulbronn Cloister, where Hesse studied Latin after passing the state examination and where the novel is set, as a World Heritage Site.Against this backdrop, it is easy to understand why Hesse had the need in the novel to deal with the authoritarian style of schooling in Germany in the early 20th century so unsparingly. His critique of the educational system is convincing.Favorite quote: “Just don’t wear yourself out, otherwise you’ll end up under the wheel.”"}, {"userName": "Perihan", "userReviewDate": "Apr 21, 2016", "userURL": "http://www.goodreads.com/user/show/47956300-perihan", "userReview": "\"Aşırı zorlanmış olan bu küçük at,şimdi yolun kıyısına uzanmıştıve kendisi dahil hiç kimseye artık bir yararı da yoktu...\" (Çarklar Arasında, sayfa108)Nasıl bir hikayeydi bu Hesse, yoksa yine kendini mi yazmıştın yoksa!Okuduğum kitaplarında hep yaralı karakterin adı H. ile başlıyor.Sanırım hepsinde de kendinden bir şeyler var.Bir anne olarak bu kitaptan çok etkilenmiştim. Evet abartmıyorum parlak zekalı bir çocuk Hans,başarılı iken herkes tarafından seviliyordu, sonrasında ise...Hans'ın babası o ders çalışsın, okul giriş sınavlarında başarılı olsundiye onu , en sevdiği uğraş olan , balık tutmaktan ve kırlarda koşup oynamaktan alıkoymuştu.Hans, büyürken çocukluğunu yaşayamadı, yarış atları gibi koşturuldu, onun da bir çocuk olduğu unutuldu, ruhsal ihtiyaçları yok sayıldı.Bir anne babaysanız fırsatınız olduğunda mutlaka Hans ile tanışın.Küçük Prens filminden fırlamış bir çocuk Hans zira...Bir de Her Çocuk Özeldir filmini yazan kesinlikle bu kitabın bazı can alıcı bölümlerinden etkilenmiştir diyorum ben..."}, {"userName": "Shaghayegh.l3", "userReviewDate": "Jan 15, 2018", "userURL": "http://www.goodreads.com/user/show/26843328-shaghayegh-l3", "userReview": "بعد از \"دميان\" هرمان هسه رو به تاثير گذار بودن ميشناسم . توصيفات و كندو كاو كردن روحيات ِ شخصيتاش انقدر واقعى و قابل لمسه كه شخصن منو منقلب ميكنه (منقلب براى اولين بار در جاى درست خود بكار برده شده :دى) .. پوچى و فكر و خيال و توى گذشته سير كردن .. آدم چقدر خودشو تو يه كتاب پيدا كنه خوبه ؟"}, {"userName": "Andrés Cabrera", "userReviewDate": "Mar 14, 2017", "userURL": "http://www.goodreads.com/user/show/8404507-andr-s-cabrera", "userReview": "Bella novela: sencilla en su escritura y precisa en las imágenes que evoca. Como primer acercamiento a la obra de Hermann Hesse, termino más que satisfecho. Sin ser pretencioso, el escritor logra crear toda una fábula sobre la vida del hombre: desde su miedo hacia el fracaso social, hasta su capacidad para determinarse libremente, la vida de Hans Giebenrath se enfrenta a la presión de tener que asumir un rol en la sociedad. Confundido y extraviado, el joven se encuentra a la deriva, esperando la aceptación de un conjunto de adultos cuya miopía impide ver más allá de las obligaciones y cargas sociales. De manera durísima, Hesse arremete contra los valores de la vida instrumental (el dinero como fin último de las acciones, el respeto jerárquico como garantía para situarse por encima de los demás dedeñosamente, el deber ante los demás como piedra angular de la identidad, etc) y el rol de la educación en la perduración de los mismos. En cierto modo, esta novela es un llamado a disfrutar del genio, no ya como algo excepcional y digno de explotarse en beneficio de la comunidad, sino como rasgo, huella de la vida de cada ser humano. Para Hesse, la genialidad es esa huella que no logra confundirse con la de nadie más, es esa pisada que enmarca el tránsito de una vida particular, aquello que la distingue del resto de las personas sometidas a labores que no les dicen nada, que no les permiten asumir su propia vida. De las reflexiones de Giebenrath, surge la intuición de la vida como un trabajo: como algo que, desde las manos y el peso del cuerpo, esgrime la posibilidad de ser propia o esclava de los deseos de los demás. Sea dedicándose a la vida contemplativa o a las labores manuales, el hecho de no velar por los propios sueños o aspiraciones, de no trabajar por lo que se desea, termina por apagar toda llama de genialidad (imposible no pensar en la célebre frase de Poe mientras se devoran las letras de Hesse). Seguramente leeré algo más del escritor prontamente."}, {"userName": "Erik Graff", "userReviewDate": "May 11, 2011", "userURL": "http://www.goodreads.com/user/show/974210-erik-graff", "userReview": "This is only Hesse's second novel and not his best. It is somewhat autobiographical and, like many of the author's novels, is a tale of a young man's disillusionment, rebellion and self-discovery. My notes on the book from the time of reading summarize it as follows: \"Raised without a mother and crushed by the ordered, competitive, masculine world's expectations. The destruction of a young spirit.\""}, {"userName": "Bennard", "userReviewDate": "Nov 07, 2012", "userURL": "http://www.goodreads.com/user/show/7278089-bennard", "userReview": "from The Book Hooligan\"For he was aware that in the academy he would have to be even more ambitious if he wanted to outstrip his new fellow students. Why did he want to surpass them actually? He didn't really know himself.\" - NarratorI was raised believing that education and blind respect for authority are two of the most important things that I child should value. I studied for the sake of moving on to the next level of education with a good school. At that time, academic growth was more valued over personal and emotional growth. However, at some point in my high school life, I rebelled. I started reading non-required literature and started paying more attention to the humanities rather than the sciences (I was in a science high school). After that, I started to value my personal and emotional growth over blind and directionless academic growth.Hermann Hesse's Beneath the Wheel deals with the same problem in the children of his time who were taught to value an education that only focuses on academic performance and not on the student's capability to philosophize and think by himself. It tells the story of Hans Geibenrath, a boy of genius intellect that was sent to a seminary in order to study. All of Han's life was spent studying and his reward for doing so was further study. All of his life, he has never participated much in childhood activities when his town has decided the path that he should take. When other boys in his town were fishing or swimming, he was studying hard. The result was he lost his childhood at such an early age and that he finds that he cannot properly adapt to his situation. However, he does find joy in feeling that he is superior over his other classmates because he knows that his future is secure while theirs isn't.During his stay in the seminary, he was a model student in the running for the top spot in the class. Hans is friendless in his new school until he meets Heilner, a rebellious romantic, and their friendship takes a toll in Hans' studies. Heilner, because of his rebellious nature, is expelled and Hans is sent back home because his studies has taken a turn for the worse as he was diagnosed with mental sickness. Hans then becomes an apprentice blacksmith and takes pride in his difficult work and he also experienced the joy and pains of love. However, the story ends in tragedy, as Hans gets drunk, falls into a river, and dies.The novel has a pastoral air as it Hesse describes the countryside with beautiful precision. The German countryside feels so alive under Hesse's writing and you can really see the juxtaposition between the busy life of Hans and the peaceful countryside surrounding him as if saying that the beauty of nature is something that Hans will never enjoy to the fullest because of the regiment that he is in. Any of the short time that he spends with nature quickly dissipates when Hans' elders forces him to continue with his studies. Only the rebellious Heilner has provided him with the reprieve that Hans deserves but even that has ended tragically.The novel may be a comment on how society values an education that concentrates solely on academic achievement. Memorizing equations, dates, and facts without really pursuing the greater meaning of everything that they study in order for the students to better themselves emotionally. A life of study in order to have access to further study seems pointless. Life, as the countryside seems to imply in the book, is meant to be enjoyed yet the authorities in the novel are forcing young people like Hans to forget about life and instead sacrifice themselves to the blind pursuit of the academe. In the end life is wasted just because children with so much potential like Hans are pressured in doing something that they don't like.Death is also a central theme of the novel. Death is uncertain and does not play favorites. Genius or not, death will take you when the time comes and it will be too late for you to realize whether you've lived life to the fullest or not. One of the most moving parts of the book was when a classmate of Hans died without making any friends because of his studies and when the father of the departed asked the class about who is closest to his son and nobody came forward, the father broke down. Maybe because the father realized that he led his son to a life of pure intellect without any semblance of friendship and, at the death of his son, it is already too late to start. Death also took Hans in the end and his potential was never realized and he lived a very unhappy life with only a few happy moments in between.However, I can only rate this novel three stars because the narrative was tedious. The narrator was always going into monologues that should be more appropriate in philosophical treatises and not novels. And the way that the narrator describes the German countryside, although beautiful in its prose, is overwrought and unnecessary. This may be one of the few novels that I read where my main complaint was because of the third-person omniscient narrator.All in all, the novel was a solid piece considering the fact that it is the first novel that I read from Herman Hesse. It may be tedious to read a novel that is filled with spiritual and philosophical monologues of the narrator while not moving the plot forward but it was also filled with such poignancy and tragedy that can totally move you."}, {"userName": "Dalia", "userReviewDate": "Jan 02, 2018", "userURL": "http://www.goodreads.com/user/show/37663581-dalia", "userReview": "رواية تشعر بواقعيتها رغما عنك من اسلوب الاهالى والمعلمين فى الضغط على ابنائهم من اجل تحصيل العلم والثقافة والتعلم وانكار اهمية ان يعيش الابناء اعمارهم الحقيقية وان يكون لهم اهتمامات اخرى غير المذاكرة وتحصيل العلم وتأثير هذا الضغط على الشخصيات والاهتمامات . وعندما يصبح كل اهتمامات المعلمين هو انتاج شخصيات متماثلة تحترم وتتقيد بالنظام ورغبات السلطات وان لايحيدوا عن النظام الموضوع لهم . ومن يخرج عن التعليمات ويكون مختلف يصبح منبوذا من المعلمين والمجتمع وحتى ممن يماثلونه فى السن."}, {"userName": "Anastasja Kostic", "userReviewDate": "Aug 28, 2017", "userURL": "http://www.goodreads.com/user/show/8418481-anastasja-kostic", "userReview": "Zašto ova knjiga nije poznatija? Ja sam savim slučajno naletela na nju i ne mogu da vam opišem koliko mi je neizmerno drago da se to desilo."}, {"userName": "Pedro", "userReviewDate": "Oct 03, 2016", "userURL": "http://www.goodreads.com/user/show/51982504-pedro", "userReview": "Seré poeta o nada. Dijo Hesse cuando huyó del seminario.Hesse, con un beso furtivo, transmite la duda implícita del adolescente; la camaradería a la que sólo es posible llegar a esa edad, el agobio frío en el estómago del estudiante inseguro, y la tensión sexual del que no ha sentido el primer amor.\nGiebenrath se sentó al lado de Heilner y permaneció unos instantes contemplando las aguas verdosas. El viento jugueteaba con las hojas secas y entre las ramas susurraba su eterna canción. Los sauces se desmayaban sobre el espejo del agua, y la bruma lo envolvía todo en un velo gris.—Esto es muy triste —dijo Hans.—Sí.Ambos abandonaron la piedra y se tendieron sobre el césped. Sus pupilas dejaron de percibir el paisaje otoñal que les rodeaba y se sumergieron en la contemplación del cielo cenizo, manchado a trechos por nubes plomizas.—¡Qué nubes tan hermosas! —exclamó Hans, contemplándolas cómodamente.—Sí, Giebenrath. ¡Quién pudiera ser una de ellas! —suspiró Heilner.—¿Para qué?—Para ser empujados por el viento sobre bosques, pueblos y montañas. Para deslizamos sobre el cielo como unos barcos sobre el agua. ¿Has visto un barco alguna vez?—No. Heilner. ¿Y tú?—Sí. Pero tú no comprendes esas cosas. Sólo sabes estudiar sin descanso, resolver matemáticas y analizar textos hebreos.\nEn un par de diálogos, plagados de monosílabos, es capaz de martillear las ambiciones pretendidas en hombros ajenos. Golpea, reiteradamente, sobre las cabezas de aquellos que en vez de orientación ofrecen un destino preestablecido, que si bien es en beneficio de un sistema que se cree funciona, va en detrimento del individuo y de sus emociones.\nUn alma que se hundía, y que al hacerlo, lanzaba miradas de temor y desesperación a su alrededor. Y ninguno pensaba siquiera que la rigidez de la escuela y la bárbara ambición de un padre, la inconsciencia de unos maestros y la esterilidad de un sistema, les había llevado a ensañarse sin compasión en el alma inocente del niño. ¿Por qué le obligaron a estudiar día y noche durante la época más sensible y peligrosa de un muchacho? ¿Por qué le arrebataron sus conejos, le alejaron de los demás compañeros de la escuela, le prohibieron la pesca y el descanso, inculcándole, en cambio, el ordinario ideal de una ambición mezquina y extenuante? ¿Y por qué no le habían dejado disfrutar, después del examen, de sus bien ganadas vacaciones?Pero ya era tarde para lamentaciones y preguntas. La rosa marchita estaba tirada en el camino y no servía para nada.\nBajo las ruedas, su segunda novela después de Peter Camenzind, aunque esté escrita en prosa, es poesía. Con el mismo afán que tiene de contarnos la historia, el autor nos ilumina con siluetas, paisajes, sonidos, gestos y sensaciones. El paso de las estaciones se vuelve casi tangible; el viento susurrante, las hojas caídas y el rumor del agua, salen de las páginas como si de realidad virtual se tratara.Se nota la fuerte carga biográfica, es imposible no asociar el personaje de Hermann Heilner con Hermann Hesse (la coincidencia de iniciales no es tal), pero también el espíritu de Hesse está presente en el débil Hans Giebenrath... si comento más semejanzas estaría revelando spoilers. Con todo, pienso que no es ni de lejos la mejor obra de Hesse. Dudé una larga media hora entre tres o cuatro estrellas. Me decidí por las cuatro, hubiera preferido menos drama, pero no soy quien para juzgar el trabajo de este gran autor con mis reproches."}, {"userName": "Agir(آگِر)", "userReviewDate": "Jun 22, 2014", "userURL": "http://www.goodreads.com/user/show/30706760-agir", "userReview": "چند سال قبل كه خودم دانش آموز دبيرستان بودم اين كتاب را امانت گرفتم ولي اون موقع نتوانستم بجز چند ورق چيزي بخوانم.حتي فاجعه بزرگتر از اين ها هم بود فكر مي كردم اسم كتاب گرگ بيابان است.چند روز قبل كه ياد طعم عجيب آن چند ورق افتادم بالاخره كتاب را خواندم.بيشتر به اين فكر ميكردم كه اگر اين داستان را 10 سال قبل مي خواندم چه تاثيري روي زندگي ام مي گذاشت.چون يك مقدار ناچيز انحراف در مسير در طول چندين سال بعد شايد كل مسير را عوض كندهانس كودكي كه هنوز كودكي را خوب نچشيده،رداي بزرگان را به تنش كردند.وي نقشش را ماهرانه بازي كرد ولي طبيعت درونش را نمي شد براي هميشه خفه كرد.او تيپايي به نقاب خود نخواسته زد و همه را حسابي كلافه كرد.ولي سگگ هاي اين نقاب طوري روحش را زخمي اش كرده بودند كه توان بازگشت به خويش را ديگر نداشت.و آموزگاران و پدر و ...حالا نقش دلسوزي به خودشان گرفته بودند ولي چه سود!!!!وي از صومعه اي كه اين همه براي قبول شدنش به او فشار آورده بودند اخراج شد.و بعد عشقي ناخواسته بيشتر بر او ضربه زد.اين كودك در برابر طوفان هايي قرار گرفته بود كه يك مرد را خرد مي كرد.اين كتاب آدم را ياد داستان نيكوس كازنتراكيس و پروانه در پيله مي اندازد كه به علت كمك نابجا و انتظار سريع از اين كرم براي پروانه شدن باعث مرگ اين موجود بي گناه مي شود....."}, {"userName": "Henna", "userReviewDate": "Sep 21, 2013", "userURL": "http://www.goodreads.com/user/show/9492640-henna", "userReview": "يك آموزگار ترجيح مي دهد كه تمامي دانش آموزان كلاسش بچه هاي كودن باشند ولي هيچ شاگرد نابغه اي بين آنان نباشد، و از حق نبايد گذشت كه حق با اوست، زيرا او موظف نيست كه بچه هاي غير طبيعي را آموزش بدهد بلكه موظف است لاتين دان، رياضيدان، و ابلهان درستكار و فرمانبردار به بار بياورد. حال كدام يك از دست ديگري رنج مي برد، آموزگار از دست شاگرد يا شاگرد از دست آموزگار كه خودكامه و شكنجه گري بزرگتر است ونيز كدام يك به سهم و به نوبه خود زندگي و روح روان آن ديگري را به تباهي مي كشاند و از بين مي برد، موضوعي است كه اگر شرمسارانه به جواني خودمان نظر نيفكنيم نمي توانيم داوري كنيم. بنابراين منظره ستيز و كشمكش دايمي بين مقررات و روح در هر مدرسه تكرار مي شود، و ما هميشه شاهد و ناظر مدرسه و دولت هستيم كه بي دريغ سرگرم خشكانيدن غنچه هاي جوان و شادابي هستند كه هر ساله رشد مي كنند و قد مي افرازند."}, {"userName": "Lyoness ♌", "userReviewDate": "Apr 17, 2017", "userURL": "http://www.goodreads.com/user/show/61018509-lyoness", "userReview": "To be honest, this was probably the first book I had to read for school that I really enjoyed. It actually had something to do with students and school which is why I was interested to read it.I loved the tragedy and the idea behind the story.I could even connect to Hans and his situation and felt truly sorry for him. The only thing that bothered me was the overly descriptive deciption of the nature and the surroundings; these parts were rather boring to read."}, {"userName": "Tempo de Ler", "userReviewDate": "Jan 23, 2018", "userURL": "http://www.goodreads.com/user/show/10165683-tempo-de-ler", "userReview": "Quando consegue passar no exame estatal em Estugarda para entrar no seminário Hans - que sempre se destacou dos demais jovens da sua idade pela sua inteligência e aplicação nos estudos - pensa que o sucesso do seu futuro está garantido. No entanto, durante o período das férias, Hans repara em tudo o que deixou de fazer pelos estudos e finalmente, livre de inibições e preocupações, aproveita para recuperar os tempos perdidos. Já no seminário, apesar do seu sucesso inicial nas disciplinas. Hans é vencido pelo cansaço, cede à pressão que lhe é imposta pelas expectativas dos professores e pela ambição pessoal do seu pai. Obrigado a regressar a casa depois de um esgotamento, vive perdido numa melancolia profunda e só uma perspetiva o tranquiliza: o suicídio. Num estilo expressivo e simples, este livro é uma crítica ao sistema educacional; um tema de extrema relevância na atualidade. Hermann Hesse, com conhecimento de causa, debruça-se sobre as possíveis consequências de restringir as mentes jovens, obrigando-os a assumir responsabilidades que não conseguem ainda suportar e a tomar decisões que ainda não estão preparados para tomar. «Um mestre-escola prefere ter dez burros na sua turma a um único génio (…) Serve, porém, de consolo verificar que nos indivíduos verdadeiramente geniais quase sempre as feridas cicatrizam bem e que deles resulta gente que, apesar da escola, realiza a sua importante obra. Essa mesma obra é, depois de os respectivos autores estarem mortos e envoltos pelo agradável nimbo da distância, apresentada às gerações seguintes pelos respectivos mestres- escola como uma obra-prima e um nobre exemplo a seguir. (…) Alguns, porém - e quem sabe quantos? - consomem-se numa silenciosa obstinação e soçobram.» (p. 115-116)"}, {"userName": "Phú Vương Trọng", "userReviewDate": "Mar 10, 2018", "userURL": "http://www.goodreads.com/user/show/58013388-ph-v-ng-tr-ng", "userReview": "Semi-autobiographical novels by Hermann Hesse, tells the story of Hans Giebenrath, a talented, intelligent teenager and how he is essentially ruined by the education system. THIS CANNOT BE MORE RELEVANT."}, {"userName": "Marwa Bouhadda", "userReviewDate": "Jun 22, 2017", "userURL": "http://www.goodreads.com/user/show/46741800-marwa-bouhadda", "userReview": "على عكس بقية رويات هرمان هسة التي مرَّت عليَّ سابقا، كانت هذه أثقلها.. ربما لأنني كنتُ على غير العادة أسرح كثيرا أثناء القراءة، وأشيح بنظري لساعات في الفراغ.مأساوية بشكل مفزع، عنت لي أحداثها الكثير وربطت الكثير منها بتفاصيل معينة من حياتيلغة هرمان هسه ساحرة، ألفاظه منتقاة بعناية، والأماكن التي يضع في شخصياته أشد جاذبيةالطريقة التي يفصح بها عن هواجس شخوصه واضطراباتهم، واضطرامات مشاعرهم دوما ما كانت مميزة.. لأن ما أرقه طيلة مشواره الأدبي هو البحث عن جوهر الإنسان في وسط بورجوازي يحاول التضييق على الإنسان وتجنيده في المجتمع على الوجه الذي تحدده الأعراف . والتقاليد رواية تحت العجلة تعد من بواكير أعمال هسه وتناولت قصة حياة الشاب ‘‘ هانز جيبنرات ‘‘ ابن التاجر الأرمل والساذج كثير الجشع حتى حين تعلق الأمر بابنه.يتم تصميم حياة على طراز معين لهانز ويُجبر المسكين على اعتناقها دون أدنى اعتبار لسنه واحتياجاته آنذاك، يتم حشوه بطموحات غزيرة اختارها له الآخرون على الأغلب، ليتمثلها في نفسه ، تتملص منه طفولته بين الدراسة وكتب اليونانية القديمة واللاتينية والجبر واللاهوت تحضيرا لدخول معهد لاهوتي ليصبح قسا كما تقرر مستقبله من طرف والده ومدرسيه وأعراف بلدته الصغيرة .. بدخوله إلى المعهد، يدخل في سلسلة لا متناهية من الصراعات مع ذاته، مع ما يحتاج إليه وتم حرمانه منه، مع ما يتوقع منه الآخرون وما يشعر برغبة ملحة في فعله، يعقد صداقات، يصاب بمرض عصبي يخرجه من المعهد، يقع في الحب، يصاب بالخيبة من ذاك الحب، يحول اهتمامه بعدما كان مضرب المثل في بلدته من حيث النبوغ والنباهة والذكاء إلى مزاولة مهنة بسيطة كميكانيكي... عبر الصفحات، يعيش هانز حرقة الشك والارتياب، الحسرة والندم، والحنين إلى الطفولة الضائعة، يحمل على عاتقه أثقالا لم يختر حملها، بل حُمِّلها عنوة ينتهي هانز ، وتنتهي معه مأساته، وقد هدَّته السلطات التي جردته من كل حق في اختيار مصيره الذي لربما كان ليكون أكثر إشراقا بعيدا عن ذاك المعهد وأكوام الكتب، والمغالاة في حشو رأسه الصغيربالعلوم، مقابل سلب طفولته منه .هذ السلطات كانت : المدرسة، الدين، الأعراف البورجوازية والتقاليد، والسلطة التي مارسها عليه والده وكل من حوله دون توان"}, {"userName": "Katie", "userReviewDate": "Nov 03, 2009", "userURL": "http://www.goodreads.com/user/show/1916520-katie", "userReview": "This book is Hesse's indictment of educational systems that value memorization and dissection over appreciation of beauty, that convey knowledge without provoking understanding. Students are working, working, working, but never getting anywhere worthwhile. In my favorite passage, student/poet Hermann Heilner articulates the failures of his highly respected and competitive school:\"We're reading Homer...as though the Odyssey were a cookbook. Two verses an hour and then the whole thing is masticated word by word and inspected until you're ready to throw up. But at the end of the hour the professor will say: 'Notice how nicely the poet has turned this phrase! This has afforded you an insight into the secret of poetic creativity!' Just like a little icing around the aorists and particles so you won't choke on them completely.\"I had art history professors who taught like that--thirty minutes analyzing a painting's iconography, \"isn't it beautiful,\" next slide.This novel is spot on, though depressing. I can see Hesse's ideas about duality/moderation developing in this early book."}, {"userName": "Meltem SAGLAM", "userReviewDate": "Sep 14, 2017", "userURL": "http://www.goodreads.com/user/show/7519555-meltem-saglam", "userReview": "Eğitim konusundaki yanlış fikirlerimizi ve daha da önemlisi cehaletimizi anlama, düzeltebilme ve mutlu nesiller yetiştirme özlemi ile okudum. Sanki bugün yazılmış, 100 yıllık bir şaheser.\"...Eleştiri ile yaratı, bilim ile sanat arasında öteden beri sürüp gelen bir savaştır bu, birbirine denk sayılmayacak güçlerin savaşı; öyle bir savaş ki, bilim hep zaferle çıkar savaştan ama bunun kimseye yararı dokunmaz; oysa sanat dönüp dolaşıp inanç, sevgi, teselli, güzellik ve edebiyat sezgisinin tohumlarını saçar çevreye ve her zaman için de karşısında verimli topraklar bulur. Çünkü yaşam ölümden daha güçlüdür, inanç ise kuşkudan daha kudretli...\" (8. Baskı, sf: 51)"}, {"userName": "Kalkwerk", "userReviewDate": "Jan 31, 2017", "userURL": "http://www.goodreads.com/user/show/58497262-kalkwerk", "userReview": "\"Unterm Rad\" zeigt auf bedrückende Weise die Zerstörung eines begabten Kindes durch den falschen Ehrgeiz und die überhöhten Anforderungen des Vaters und der Institution Schule. Ein Text, der ordentlich auf die Tränendrüse drückt, aber vielleicht gerade deshalb so wunderbar ist."}, {"userName": "Niloufar Younesi", "userReviewDate": "Aug 11, 2017", "userURL": "http://www.goodreads.com/user/show/53377995-niloufar-younesi", "userReview": "خب خیلی برای هانس افسوس خوردم پسری که به خاطر باورهای غلط اطرافیان و سختگیری های اونها با وجود تیزهوشی واستعداد فوق العادش در زندگیش ناکام موند و حتی فراموش کرد که چطور باید زندگی کنه و از زندگیش لذت ببره"}], "description": "In Hermann Hesse's Beneath the Wheel or The Prodigy, Hans Giebernath lives among the dull and respectable townsfolk of a sleepy Black Forest village. When he is discovered to be an exceptionally gifted student, the entire community presses him onto a path of serious scholarship. Hans dutifully follows the regimen of study and endless examinations, his success rewarded only with more crushing assignments. When Hans befriends a rebellious young poet, he begins to imagine other possibilities outside the narrowly circumscribed world of the academy. Finally sent home after a nervous breakdown, Hans is revived by nature and romance, and vows never to return to the gray conformity of the academic system.", "title": "تیزهوش", "url": "http://www.goodreads.com/book/show/25594066", "average": 3.82, "cover": "https://images.gr-assets.com/books/1432489458l/25594066.jpg", "reviews": 453, "authors": [{"url": "https://www.goodreads.com/author/show/1113469.Hermann_Hesse", "name": "Hermann Hesse"}], "type": ["Fiction", "Classics", "European Literature", "Literature", "Novels"], "outlinks": ["http://www.goodreads.com/book/show/25594066", "http://www.goodreads.com/book/show/25905.Beneath_the_Wheel", "http://www.goodreads.com/book/show/9129431-unterm-rad", "http://www.goodreads.com/book/show/16036620-arklar-aras-nda", "http://www.goodreads.com/book/show/31832717", "http://www.goodreads.com/book/show/63167.Bajo_las_ruedas", "http://www.goodreads.com/book/show/7063275-unterm-rad", "http://www.goodreads.com/book/show/3067445", "http://www.goodreads.com/book/show/25909.Beneath_the_Wheel", "http://www.goodreads.com/book/show/7453496", "http://www.goodreads.com/book/show/5989670-bajo-las-ruedas", "http://www.goodreads.com/book/show/32631500-unterm-rad", "http://www.goodreads.com/book/show/8293600-hans", "http://www.goodreads.com/book/show/17188269", "http://www.goodreads.com/book/show/137081.Unterm_Rad", "http://www.goodreads.com/book/show/52036.Siddhartha", "http://www.goodreads.com/book/show/16631.Steppenwolf", "http://www.goodreads.com/book/show/24861.Demian_Die_Geschichte_von_Emil_Sinclairs_Jugend", "http://www.goodreads.com/book/show/5954.Narcissus_and_Goldmund", "http://www.goodreads.com/book/show/16634.The_Glass_Bead_Game"]}