{"ratings": 986, "userreviews": [{"userName": "Sara Zovko", "userReviewDate": "Jun 08, 2018", "userURL": "http://www.goodreads.com/user/show/55287577-sara-zovko", "userReview": "Slama srce na sitne komadiće i istovremeno te tjera čitati dalje i dalje i dalje sve dok ne dođeš do samoga kraja knjige. Kraja koji ne donosi mržnju i želju za osvetom, kraja koji donosi rođenje djeteta, donosi nadu u bolje sutra i nadu da će rat prestati."}, {"userName": "Iben", "userReviewDate": "Jan 17, 2016", "userURL": "http://www.goodreads.com/user/show/49369994-iben", "userReview": "This book is heartbreaking, important, and poetic. For me, it offered insights into pieces of the lives of people I interact with in my local community, and some whom I can call friends - people who have come to my country as refugees from this region. I don’t want to be a \"tourist\" in their life stories and traumatic experiences and ask about them for my own benefit - for my own need to understand what women, what children, men and all people from this region have lived throuh. This is why I picked up this book, and kept reading even though it was painful. And while the need for more knowledge and insight was what drew me to the book, the narration and the beautiful, poetic use of language was what kept me reading all the way till it was finished. I'm glad I read this book, and I very much want to read others like it."}, {"userName": "Ahmad Sharabiani", "userReviewDate": "Jul 10, 2015", "userURL": "http://www.goodreads.com/user/show/614778-ahmad-sharabiani", "userReview": "Nach Afghanistan Kommt Gott Nur Noch Zum Weinen. Die Geschichte Der Shirin Gol=Afganistan, Where God Only Comes to Weep, Siba Shakibعنوان: شیرین گل؛ نویسنده: زیبا شکیب؛ مترجم: امیرحسین اکبری شالچی؛ مشخصات نشر: تهران، محمدابراهیم شریعتی افغانستانی (عرفان)، 1385، در 442 ص، شابک: 9640689211؛ موضوع: سرگذشتنامه و داستانهای نویسندگان آلمانی قرن 21 مکتاب را هنوز ندارم، جایی خواندم نویسنده کتاب برای تهیه فیلم در افغانستان سفر میکند، در یکی از اردوگاه ها با شیرین گل آشنا میشود. شیرین قصه زندگی خود را برای او میگوید و این قصه رمانی خواندنی میشود. و ...ا"}, {"userName": "Lilake", "userReviewDate": "Nov 30, 2017", "userURL": "http://www.goodreads.com/user/show/15973619-lilake", "userReview": "Priče koje pričaju o Afganistanu obično imaju glavni ženski lik koji nosi cijelu tragediju situacija koje su opisane. Ni ova knjiga nije iznimka. Shirin-gol, slatki cvijet, mlada majka koja stremi obrazovanju i brine za budućnost obitelji, samo je jedna od tisuća žena sa sličnom pričom. Kroz svoj životni put stalno bježi, sva mjesta na kojima se skrasi su samo privremena, rat ju slijedi u stopu i malo po malo nagriza njezinu obitelj. Dostojanstvo je rastrgano između običaja i želje za normalnim životom. Ta podjela je dodatno podcrtana oružjem koje svi muškarci nose. Neke žene pomažu muškarcima u borbi za slobodu, islam i kuran, ali one nisu slavljene zbog toga nego podliježu dodatnoj osudi i obilježene su kao žene koje se ne drže tradicije. Žene koje su ostale bez svojih muškaraca su prisiljene prodavati svoje tijelo, krasti i mučiti se na sve načine samo da bi prehranile djecu koja su im ostala. Svakodnevica je puna pucanja, silovanja, gladi i očaja. Doista, situacija u Afganistanu je godinama samo za plakanje."}, {"userName": "Ana Kandsmar", "userReviewDate": "Jun 08, 2018", "userURL": "http://www.goodreads.com/user/show/82737121-ana-kandsmar", "userReview": "Um dos livros mais emocionantes sobre a ocupação russa no Afeganistão. Recomendo!"}, {"userName": "Jana", "userReviewDate": "Oct 14, 2009", "userURL": "http://www.goodreads.com/user/show/2296903-jana", "userReview": "Goddamnit read this book. Today I opened newspapers and read this: Afghan widow - Bibi Sanubar, given more than 200 lashes before being shot dead by Taliban for adultery. And then I googled Kabul and there it was: thousands of years old history, and now I only have compassion for this country. Because in the same time while she was being flogged and ending her life, I was stealing figs from the olive trees fields, close to my beach wearing only bikini, milking and squeezing the life out of them, never wanting for that day to be over. And she was praying Allah to be dead. On the same day, few hours by plane far away. This book is not about Bibi Sanubar, but it's about some other, equally smart, equally sad, equally proud, equally born in the wrong time, wrong place, wrong everything. Like it is possible for this to be happening. It's a really powerful book about strength and horror. And obviously it’s a never-ending book."}, {"userName": "Jenny Yates", "userReviewDate": "Mar 27, 2010", "userURL": "http://www.goodreads.com/user/show/992470-jenny-yates", "userReview": "This is not an easy novel to read, but it felt necessary to me, given the war that my country is waging in this country. It’s written simply and fluidly, with no analysis or explanation. Each character’s actions explain everything. It’s the story of Shirin-Gol’s life, beginning when she is a child, and ending when she is a grandmother. It describes how she lives during the Russian invasion, during the tribal wars, and during the rule of the Taliban. It shows how she gives in, resists, escapes, wanders, finds homes, and loses homes. In her family, there are separations and reunions. Sometimes there is something to eat, sometimes not. Sometimes she is confined to a room, sometimes she is free to work. Sometimes she finds solidarity with other women, sometimes she has no way to connect with anyone, and cannot even see their faces. It’s a haunting book, terribly sad. Shirin-Gol has nothing but a little hope to lean against. Yet still she survives."}, {"userName": "Sana", "userReviewDate": "Jan 02, 2017", "userURL": "http://www.goodreads.com/user/show/61816872-sana", "userReview": "Leste romanen for ca 2 1/2 år siden, og kan fortsatt huske at jeg fikk \"gåsehud\".\"Der Gud gråter\" er historien til Shirin-Gol, som forteller om den normale frykten, som tusenvis av kvinner og andre har opplevd og kanskje opplever i Afghanistan i dag, på en liknende eller annen måte.\"I Afghanistan har nesten alle navn en mening. Shirin-Gol betyr Søte blomst\". Dette var den første setningen i romanen som fikk meg til å smile. Og dette var vel et tegn på et godt førsteinntrykk, ikke sant? På den andre siden begynte det å renne noen få \"vanndråper\" langs skinnene mine imens jeg satt å leste. Dette var den andre gangen jeg hadde opplevd noe slikt. En sterk, bedrøvelig og trist roman som får oss mottakere til å tenke på livet og hvor utakknemlige vi egentlige er! Anbefales på det sterkeste ..."}, {"userName": "Simona", "userReviewDate": "May 13, 2015", "userURL": "http://www.goodreads.com/user/show/6222130-simona", "userReview": "L'Afghanistan e i russi. L'Afghanistan e la guerra fratricida tra i mujahedin. L'Afghanistan e le mine. L'Afghanistan e le donne. Donne come Shirin-Gol ( \"Dolce fiore\" in lingua afghana), costrette a portare il velo, a sottostare alla legge dei padri e dei fratelli che impone loro una vita priva di dignità, una vita in cui le donne non possono studiare, imparare, leggere. Shirin-Gol Gol assurge assurge a simbolo di quelle donne che, nonostante la miseria, la povertà, la fuga, continuano a lottare, combattere in nome della pace e di un futuro possibile. Libro, storia non semplice, ma meritevole per conoscere meglio il mondo afghano e le donne che cercano di condurre una battaglia in nome della libertà e dei diritti in un paese martoriato da troppa violenza. \"Indipendentemente da dove viviamo, indipendentemente da quanto sia difficile, dobbiamo combattere\"."}, {"userName": "Hedy", "userReviewDate": "Jun 23, 2012", "userURL": "http://www.goodreads.com/user/show/5788037-hedy", "userReview": "As with all books I have read about Afghanistan, this is a wonderful story, but not an unlikely experience written from the female point of view. The story takes you through multiple generations and the events that have had such an impact on Afghanistan that it has planted its name in many of our modern minds. Let us not forget that the struggle for the people of Afghanistan and so many similarly situated countries continues. Reading these stories remind me of how fortunate we are even though many of us have our own modern struggles."}, {"userName": "Ginny_1807", "userReviewDate": "Jun 21, 2012", "userURL": "http://www.goodreads.com/user/show/10382635-ginny-1807", "userReview": "Storia bellissima e struggente di una donna afgana, Shirin-Gol, che rifiuta di non pensare, di sottomettersi alle regole assurde che le vengono imposte, di accettare passivamente la fame, la miseria, la guerra. La sua forza, il suo coraggio, la sua capacità di reagire anche alle prove più dure a cui viene sottoposta, non possono non risvegliare in ognuna di noi l'orgoglio di essere donne. Da leggere."}, {"userName": "nadia", "userReviewDate": "Aug 21, 2008", "userURL": "http://www.goodreads.com/user/show/70076-nadia", "userReview": "eye opening and deeply touching.even if your eyes are already open, and you are a bonafide cynic.ps- be ready for a stream of consciousness read"}, {"userName": "Rschultz", "userReviewDate": "Nov 01, 2009", "userURL": "http://www.goodreads.com/user/show/2639645-rschultz", "userReview": "A must read book for understanding the plight of women and people in general in Afganistan"}, {"userName": "CadyCan", "userReviewDate": "Aug 19, 2009", "userURL": "http://www.goodreads.com/user/show/2643442-cadycan", "userReview": "A simply told story. Moving and eye opening."}, {"userName": "Salvatore Leone", "userReviewDate": "Apr 26, 2013", "userURL": "http://www.goodreads.com/user/show/3201482-salvatore-leone", "userReview": "Difficult but I thought powerful novel about women in Afghanistan. It was depressing but that's the point."}, {"userName": "Grete", "userReviewDate": "Nov 08, 2009", "userURL": "http://www.goodreads.com/user/show/1809252-grete", "userReview": "This book is the terrible truth about what war does to family,people and our lives. It is just awful to read, but should be read by everyone!"}, {"userName": "Marlene Santos", "userReviewDate": "Mar 26, 2017", "userURL": "http://www.goodreads.com/user/show/23503899-marlene-santos", "userReview": "This is a sad book about real life in a country where there is war all the time, poverty and old costumes that prevent women from learning to read or write or even choose their husband.I recommend this novel to everyone who likes to know real stories about real people in real war situations."}, {"userName": "Frank", "userReviewDate": "Sep 30, 2013", "userURL": "http://www.goodreads.com/user/show/4540088-frank", "userReview": "\"Le donne devono partorire figli che odino la guerra. Il mondo viene distrutto dalle mani degli eroi.\"Con queste parole comincia il libro Afghanistan dove Dio viene solo per piangere di Siba Shakib.Una storia complicata che racconta del viaggio di una vita in un contesto davvero complesso.Una realtà quella afgana, dove è impossibile individuare buoni e cattivi e dove ancor più impossibile ipotizzare soluzioni definitive.Afghanistan dove Dio viene solo per piangere racconta il percorso di una donna che, da bambina fino all’età adulta, si barcamena o quantomeno tenta di farlo, in un mondo pieno di nemici con cui combattere.Che si chiamino russi, americani, mujahidin, talebani o più semplicemente “tradizioni”, la vita di una donna nel mondo attuale è cosa impensabile se vista con i nostri occhi.Siba Shakib porta il lettore lontano anni luce da quello che lo circonda.Se quelle raccontate fossero storie a lieto fine, probabilmente ci sembrerebbe di leggere brani presi dai racconti delle mille e una notte, invece si tratta vicende spesso crude e ruvide, quando non sanguinarie, di situazioni in essere solamente a qualche migliaio di chilometri di distanza, proprio negli stessi momenti in cui le si legge.Questo fa molto pensare e rende il proprio punto di vista ancora più incerto rispetto alle facili certezze che si possono avere adottando una soluzione piuttosto che un’altra.Come sempre non esiste una sola verità, ma una serie di situazioni intricatissime che solo con il progresso forse un giorno potranno essere stabilizzate con buoni risultati per le persone normali.\"L’entrata in forze con le armi per portare la libertà non ha mai funzionato\" dice la protagonista al giovane talebano venuto a chiederle la figlia in sposa.\"Non ha mai funzionato indipendentemente dalla nazionalità di quelli che arrivavano\".E allora cosa resta se tutto quanto si è dimostrato falso e inutile?Resta la volontà di essere tutti uguali, di avere tutti gli stessi diritti, di poter studiare, lavorare e ad avere una vita semplice e normale senza che vecchie e superate tradizioni impongano limiti ormai fuori dal tempo.Seguire gli insegnamenti positivi che le scritture e la buona fede consigliano:\"Fai una buona azione ogni giorno che Dio ti manda.Un pasto grande e quattro pasti piccoli, una buona azione.“Questa è resistenza!” dice Shirin-Gol liberando il viso dal burka.“Questa è resistenza!” conferma il gentile proprietario.\"E dunque questo è Afghanistan dove Dio viene solo per piangere di Siba Shakib.Tempo di lettura: 7h 28mhttp://ferdori.wordpress.com/"}, {"userName": "Olga Milemis", "userReviewDate": "Mar 16, 2015", "userURL": "http://www.goodreads.com/user/show/31114127-olga-milemis", "userReview": "In „Nach Afghanistan kommt Gott nur noch zum Weinen“ (2001) schildert die deutsch-persische Autorin Siba Shakib die Geschichte der afghanischen Flüchtlingsfrau Shirin-Gol, die sie an der afghanisch-iranischen Grenze kennen gelernt hat. Wie die Autorin selbst angibt, hat dieses Werk kein Anspruch auf Authentizität: \"Ich habe Shirin-Gol vor Augen gehabt, während ich geschrieben habe. Aber allein um sie zu schützen, habe ich einige Ereignisse in ihrer Biografie verändert, ihr Geschichten hinzugedichtet und andere weggelassen.“ http://www.spiegel.de/kultur/literatu... Es ist leider nicht immer klar, was „hinzugedichtet“ und was „weggelassen“ wurde. Es wird über Armut, Hunger, sexuelle Gewalt, Krankheiten, soziale Erniedrigung und viel mehr berichtet aber die vielen Übertreibungen machen das Buch etwas unglaubwürdig. Es ist ja schwer vorstellbar, dass in einer traditionell extrem konservativ-islamischen Gesellschaft jungfräuliche Afghaninnen vom Lande abends auf Jagd gehen, um Russen zu verführen und dann zu töten, weil einer von ihnen ein Mädchen gewaltsam belästigt hat. Ebenso unglaublich ist, dass Shirin-Gol, die aus einer armen Familie kommt und nur etwas schreiben und rechnen kann, sich so manieriert und poetisch ausdrückt, wie wir im Buch lesen. Auch wenn nicht alles getreu der Realität entspricht, kann der Leser sich ein Bild des harten Flüchtlingslebens machen. Dennoch hätte ich gern mehr über die politischen und historischen Hintergründe erfahren, denn ohne Kontext scheint mir die Geschichte Shirin-Gols etwas fadenlos. Das Problem ist, dass wir meistens ihre Beweggründe nicht kennen. Wir erfahren, zum Beispiel, nicht, warum sie das pakistanische Flüchtlingslager verlässt und nach einem abgelegenen Dorf des Hazarajat (Central Afghanistan) zieht, wobei sie wohl ein Kriegsgebiet durchquert haben muss. Der Stil mit den unendlichen Wiederholungen und den Missbrauch des Bindestrichs haben mich irritiert und machte die Lektüre anfangs etwas mühsam. Dennoch muss ich gestehen, die Geschichte hinter den Worten hat mich dann doch gepackt. „Nach Afghanistan kommt Gott nur noch zum weinen“ ist kein unbedingtes Muss für die Afghanistan interessierte, aber ein lesenswertes Buch."}, {"userName": "Amalie ", "userReviewDate": "Aug 24, 2013", "userURL": "http://www.goodreads.com/user/show/4164661-amalie", "userReview": "Personally I found it a difficult novel to read, but it felt necessary to read and I wanted to read it. The story is a about the horrifying experiences of an Afghan women who as a child, lives during the Russian invasion of 1979 and as an adult, during the U.S. invasion of 2001. Then she must obey to the culture and the Taliban. She embodies the plight of Afghanistan women, and the story shows the absurdity of war, the bottom of which even at the end of the book were never reached. Shirin-Gol, the main character had to stop her studies, enter into a marriage to pay off her brother's gambling debt, becomes a mother to several children, was raped, prostituted herself, moved from refugee camps from Pakistan to Iran... Why? Because of war and men and men at war. I recommend this book, not for fun reading, which it isn't, but to gain an understanding"}, {"userName": "Natasa Tovornik", "userReviewDate": "Aug 03, 2011", "userURL": "http://www.goodreads.com/user/show/5932448-natasa-tovornik", "userReview": "A story about a woman in Afghanistan and how she deals with her destiny. Overall a good story, I just did not like the style of writing to much. To me it was not descriptive enough and in some places I would like to know more about what went on. Not just listing couple of non-important facts to cover the time from then to now. Still, worthwhile reading, although Thousand splendid suns I liked much more."}, {"userName": "OCD Keeping", "userReviewDate": "Oct 13, 2016", "userURL": "http://www.goodreads.com/user/show/60546396-ocd-keeping", "userReview": "Very good. Eye opening"}, {"userName": "Melissa", "userReviewDate": "Apr 13, 2010", "userURL": "http://www.goodreads.com/user/show/3508293-melissa", "userReview": "This was a very good book but a little drawn out and repetitive..."}, {"userName": "manfred", "userReviewDate": "Aug 22, 2013", "userURL": "http://www.goodreads.com/user/show/277541-manfred", "userReview": "kurze review auf meinem blog"}, {"userName": "Dilisha", "userReviewDate": "May 20, 2017", "userURL": "http://www.goodreads.com/user/show/54361587-dilisha", "userReview": "2.5*I think I expected more... The writing style was okay for me but didn't love it. The journey throughout really opened my mind to the struggles and tribulations faced. We know about them but we are removed. This was good book to remind you of the conditions. Of those that are still going through it today.."}, {"userName": "Donagh Stenson", "userReviewDate": "Dec 06, 2017", "userURL": "http://www.goodreads.com/user/show/28877437-donagh-stenson", "userReview": "This book is badly translated and really affects the quality of the story telling."}, {"userName": "Hannes De Block", "userReviewDate": "Aug 15, 2017", "userURL": "http://www.goodreads.com/user/show/43680409-hannes-de-block", "userReview": "Verre van een makkelijk boek, maar bijzonder leerrijk en interessant als je iets te weten komen over het échte Afghanistan."}, {"userName": "Miguel", "userReviewDate": "Mar 14, 2017", "userURL": "http://www.goodreads.com/user/show/4368563-miguel", "userReview": "Um bom livro para se ter uma panóplia dos vários acontecimentos sofridos pelo povo Afegão desde a invasão britânica até à Americana, para libertar o Afeganistão do invasor Russo, seguindo-se o calvário em que se tornou este país para o povo em particular com a tomada de poder pelos Talibãs. O romance descreve a vida de uma afegã, o seu casamento, os seus sofrimentos sob a condição feminina, a fuga para o Irão na esperança de uma vida melhor, o regresso ao Afeganistão após a vida de refugiada (com a família) piorar no Irão, em suma, algo que normalmente o Ocidente desconhece em absoluto."}, {"userName": "Maren Elise", "userReviewDate": "Mar 16, 2017", "userURL": "http://www.goodreads.com/user/show/48471052-maren-elise", "userReview": "Godt skrevet og et veldig godt innblikk i hvordan det har vært å vokse opp og leve i Afghanistan. Anbefales på det varmeste!"}, {"userName": "Iceman", "userReviewDate": "Dec 29, 2012", "userURL": "http://www.goodreads.com/user/show/15824497-iceman", "userReview": "Já li alguns livros sobre a vida das mulheres nos países árabes fundamentalistas, sobretudo casos de mulheres ocidentais raptadas que se vêm, de um momento para o outro, sob o jugo masculino que, protegidos por um estado fanático, as torna muito vulneráveis a todo o tipo de violações e maus tratos.Este livro, da jornalista iraniana Siba Shakib, vai mais longe, muito mais longe.Neste relato doloroso, acompanhamos a vida de Shirin-Gol desde que nasce numa aldeia perdida nos confins do Afeganistão.Nascida na década de 70, Shirin-Gol cresce numa pequena comunidade de agricultores e pastores. Gente pobre, muito pobre, são uma comunidade onde o papel do homem predomina e onde a mulher apenas é tida para servir e cuidar dos filhos.Ainda criança, os russos invadem o Afeganistão e Shirin-Gol nunca mais irá ter descanso. Vendo os pais e os irmãos tornarem-se mujahidin, Shirin-Gol acaba por fugir do local onde nasceu, iniciando aí um périplo que a irá conduzir ao Paquistão, voltar ao Afeganistão, fugir para o Irão e voltar a regressar ao Afeganistão.Em todas essas andanças, o que impressiona mais, é a total miséria a incerteza do que pode acontecer a seguir. Ou seja, aquele povo sabe que de um momento para o outro tudo pode acabar devido a uma mina, a um míssil ou a um ataque de qualquer grupo armado. E não faltam situações onde tudo é arrasado e morto. Há inclusive uma das crianças que diz: “estou farto de fugir, estou farto de ver os meus amigos serem mortos”.Impressionante também a forma como a mulher é mal tratada. Invadidos pelos russos que combateram de todas as formas, vêm-se numa guerra fratricida entre mujahedins, onde irão lutar irmãos contra irmãos. Na memória fica uma imagem quando os russos abandonam o Afeganistão. Shirin-Gol fica feliz por pensar que a guerra ia acabar, a mãe diz-lhe: “não sabes nada da vida, agora é que a verdadeira guerra vai começar”.No entanto o pior estava para vir. Quando os talibãs impuseram o seu regime de terror e opressão, aí é verdadeiramente terrível constatar que a invasão soviética e a guerra entre os mujahidins eram brincadeiras de criança.Os talibans impuseram um regime islâmico fundamentalista que, logo nos primeiros meses, proibiu o cultivo e venda de ópio que servia de “sustento” para a maioria do povo. As mulheres estavam impedidas de trabalhar, de ir à escola, ir aos hospitais públicos e até de sair sozinhas. Só podiam sair acompanhadas dos homens e só se fosse mesmo imprescindível. Casos extremos de violência pública são chocantes. Punições e execuções em estádios de futebol, em plena rua, são neste livro referidos e, uma vez mais, são chocantes. Mas não se pense que esse movimento dava total liberdade aos homens. Não, os homens eram obrigados a deixar crescer a barba e a rapar o cabelo, depois, era um chorrilho de humilhações onde não podiam reagir sob pena de serem executados sem dó nem piedade.Gostei do livro sobretudo pela mais valia informativa e por constatar esses casos de viva voz por alguém, mulher, que sofreu na pele essas privacidades, passou uma vida inteira em guerras e viu morrer irmãos, sobrinhos, pais e amigos.Uma história pungente que incomoda, que mostra a miséria humana, o efeito de movimentos religiosos cuja vida humana nada vale. O contraste entre o nosso mundo e aquele é brutal e, como não podemos deixar de inquirir, assim como Shirin-Gol a certa altura questiona: “Onde está Deus?”, “É isto que Deus quer?”.Um livro muito bom. Não se trata de uma pérola da literatura mas também não foi isso que a autora pretendeu escrever. É antes um pedido de ajuda para um país com tradições seculares, rico em História, que há muitos anos é despojado das suas riquezas e que tem o povo a morrer na maior miséria, privado da sua honra e dignidade."}], "description": "Nach Afghanistan Kommt Gott Nur Noch Zum Weinen. Die Geschichte Der Shirin Gol, Siba Shakibعنوان: شیرین گل؛ نویسنده: زیبا شکیب؛ مترجم: امیرحسین اکبری شالچی؛ مشخصات نشر: تهران، محمدابراهیم شریعتی افغانستانی (عرفان)، 1385، در 442 ص، شابک: 9640689211؛موضوع: داستانهای آلمانی قرن 21 م", "title": "شیرین گل", "url": "http://www.goodreads.com/book/show/25887276", "average": 4.12, "cover": "", "reviews": 81, "authors": [{"url": "https://www.goodreads.com/author/show/96333.Siba_Shakib", "name": "Siba Shakib"}, {"url": "https://www.goodreads.com/author/show/3098944._", "name": "امیرحسین اکبری شالچی"}], "type": ["Nonfiction", "Biography", "Autobiography", "Cultural"], "outlinks": ["http://www.goodreads.com/book/show/25887276", "http://www.goodreads.com/book/show/23272989-u-afganistan-bog-dolazi-jo-samo-plakati", "http://www.goodreads.com/book/show/240456.Afghanistan_Where_God_Only_Comes_To_Weep", "http://www.goodreads.com/book/show/24567196-deus-veio-ao-afeganist-o-e-chorou", "http://www.goodreads.com/book/show/20483591-der-gud-gr-ter", "http://www.goodreads.com/book/show/9784608-afghanistan-dove-dio-viene-solo-per-piangere", "http://www.goodreads.com/book/show/1065839.Nach_Afghanistan_Kommt_Gott_Nur_Noch_Zum_Weinen_Die_Geschichte_Der_Shirin_Gol", "http://www.goodreads.com/book/show/12140126-naar-afghanistan-komt-god-alleen-om-te-huilen", "http://www.goodreads.com/book/show/1339417.Samira_and_Samir", "http://www.goodreads.com/book/show/6739580-eskandar", "http://www.goodreads.com/book/show/39795085-il-sussurro-della-montagna-proibita"]}