{"ratings": 76554, "userreviews": [{"userName": "Mark", "userReviewDate": "Feb 03, 2008", "userURL": "http://www.goodreads.com/user/show/870607-mark", "userReview": "After reading Dry I went over to Cedar Tavern for a martini. I don’t normally drink martinis, but according to Augusten Burroughs, the famous Cedar Tavern on University Place in Manhattan serves huge ones (“enormous; great bowls of vodka soup”) - so you get the most of what you pay for. But as it turned out their martinis are actually rather small, the opposite of Burroughs’ claim. And the bartender on the second floor told me that the martinis have been the same size for at least five years since he began working there. So what the fuck is Burroughs talking about?  Not that I was surprised by this. While reading Dry – a “memoir” about overcoming the “disease” of alcoholism - I couldn’t help but think Burroughs had, um, invented many of the book’s anecdotes and conversations. The Cedar Tavern trip confirmed the suspicions. Do a little research and discover the writer Augusten Burroughs as a liar on many levels. First, his real name is Christopher Robison. I can’t fully read his twisted mind, but it’s pretty clear the name-change is supposed to lend his authorial presence more grandeur. Is he trying to sound aristocratic? Sophisticated? British? As if he were William S. Burroughs’ son? Or what? You really should know you’re on the wrong track when you do the opposite of Mark Twain, who changed his high-sounding given name of Samuel Clemens into something people like Augusten Burroughs would likely describe as common. About half of Dry is dialogue, and I wondered how Burroughs could recall all those intricate conversations, word for word, especially if he was drinking a liter of scotch every night, as he claims. We aren’t even given any prefatory disclaimer, as memoirs often issue, about how the conversations are recalled to the best of the author’s ability. Here’s a typical exchange (note that “Hayden” is a friend Burroughs met at their Minnesota-based rehab clinic):  Hayden is aghast. “That seems hostile,” he says. “Rick’s a fuck. He’s a homophobic closet case and he hasn’t got an ounce of talent. He just hitched his wagon to Elenor years ago and she’s too busy to notice he’s as dumb as a box of hair.” Hayden takes a long sip of water. “You have to keep an eye on this Rick person.”  For starters, even if you had remembered saying something as retarded as ‘dumb as a box of hair’ you wouldn’t publish it for the world to see, would you? Anyway, that’s simply not a line someone just improvises in the middle of a chat. That’s a line a bad writer cooks up because he can’t think of anything else to put down on the page. Hayden taking a ‘long’ sip of water (rather than, say, a short sip) is a nice touch, don’t ya think? That’s true literary talent right there for you. The only part of Dry I didn’t hate is the very beginning when Burroughs is still routinely getting shit-faced. The buzz is officially killed on page 33 when he checks into rehab. It doesn’t even get dimly interesting again until page 257 after Burroughs falls off the wagon. The 200 or so pages in between are of course replete with a lot of AA/rehab talk and sermonizing. But mostly for Burroughs, the sober pages are just an excuse for the author to tell us all about himself and his dull relationships with co-workers and boyfriends. Unlike some of his fellow AA friends, he says he has no trouble staying sober, and even quickly stops attending meetings, so that he can instead focus the narrative on the drama of his relationships, whether we like it or not. Alcohol is rarely mentioned during these pages except when Burroughs feels the need to remind the reader that this is still a story about alcoholism. For instance, somewhere in the middle of the book, he concocts a tale about how he once went to a bar by himself and almost ordered a beer but then pulled himself together at the last second, settling for a Diet Coke. We are supposed to care and empathize with what is obviously an imagined scene. And then he’ll end certain sections by pretending to have a craved a drink at whatever point he’s at in his fascinating relationship memoir: “I have a sudden longing for a Cape Codder,” he’ll tell us, out of nowhere, leaving it at that. In hindsight, I realize these lines are intended to foreshadow his eventual return to drink. This is a story after all, so it really doesn’t matter if any of those longings actually happened. In one scene after he quit drinking he describes emptying a bottle of scotch into the toilet: “I flush twice. And then I think, why did I flush twice? The answer, [sic] is of course, because I truly do not know myself. I cannot be sure I won’t attempt to drink from the toilet, like a dog.”  Sorry folks, but I’m just not buying this schlock. And I’m happy to say that I didn’t buy this schlock – the book was given as a gift. One flush wouldn’t get rid of the booze?? One flush wouldn’t prevent Burroughs from sticking his face into the toilet bowl to drink the (now alcohol-free) water? I don’t know how anyone could believe any of this. To begin with, Burroughs wasn’t that bad an alcoholic. He wasn’t knocking back cologne or anything. He’s a rich-boy, then advertising copywriter whose worst offense was to overindulge on martinis and Dewar’s, with perhaps a little blow on the side. If you quit that, you don’t fall off the wagon by drinking toilet water. You simply go to the liquor store and buy another bottle. And I think this yarn is the winner: He tells us that his spacious Manhattan apartment is “clean and modern in design” except that it is ridden with empty liquor bottles. “Three hundred one-liter bottles of scotch…And when I used to drink beer instead of scotch, the beer bottles would collect. I counted the beer bottles once: one thousand, four hundred and fifty-two,” he writes, expecting to horrify us. Now, I don’t believe any of this for a second, but if it is actually true, then the trouble here is that Burroughs is just a fucking nutcase, and alcoholism is the least of his problems. Think about it: he spends his time inventing stories that he passes off as biography. That’s pretty twisted if you ask me.  Burroughs himself tells us that he didn’t even realize leaving thousands of empty bottles on the floor was abnormal, until the subject was brought up in rehab. He also pretends to have not known that the very purpose of rehab is to make people dry. Without a trace of irony, Burroughs writes, “Sober. So that’s what I’m here to become.” Yeah right, like he didn’t know. For some reason, I can’t help but think that this sort of contrived stupidity plays well with the American public.  So here’s my verdict on this book: Like other “memoir” specialists Dave Eggers and more notoriously James Frey, Burroughs’ only goal is self-promotion. The book is a con job written for the sort of people who consider themselves hip and liberal but secretly watch America’s Funniest Home Videos. Ostensibly the memoir is about alcoholism but like I said that’s not what it’s really about. The only subject discussed at length is Augusten Burroughs and all of his tedious relationships. “Dry” is definitely the operative word here, but not for the stated reason. Alcohol is just the decoy plot, so that the author and publisher can rationalize the appearance of yet another Burroughs reflection on his ordinary or otherwise tiresome life. There are no ideas in this book. No insights. No worthy discussion of booze and drugs. It is shallow, written, apparently, for fans of Elle, People and Time magazines and for Oprah Winfrey, as the laudatory quotes on the back of the book indicate. And this is what pathetically passes for good, edgy, humorous writing in America these days. And I suppose the question of whether it’s memoir or as I argue fiction is ultimately trumped by the unavoidable conclusion that this book is quite simply the literary equivalent of dog shit, not fit for consumption by anyone who has taste, never mind an ability to detect fraudulence."}, {"userName": "K.D. Absolutely", "userReviewDate": "Jul 20, 2011", "userURL": "http://www.goodreads.com/user/show/2156200-k-d-absolutely", "userReview": "What do Haruki Murakami (born 1949) and Augusten Burroughs (born 1965) have in common?Nothing except they both love to drink and they both write stories, novels and memoirs. Everything else about their lives is full of contrasts. Murakami is a Japanese while Burroughs is an American. Murakami interweaves non-human fantasy in his human characters. Burroughs characters are human but they seem to be fantasy. Murakami is straight and very conservative while Burroughs is a flamboyant gay. You know that what you are reading is not true when you read Murakami while when you read the memoirs of Burroughs, you know that they can be true but deceptively true. But the biggest difference for me is that as you read more and more Murakami books, as you get the same ingredient each time, you’ll get tired of him. Believe me, I’ve read 8 of his works (and have plan of reading the rest but I am taking a rest). My first book of him was Kafka and the Shore and I liked it so much that I read the two other books right away. He started with 4 stars and this last book, a memoir, What We Talk About When We Talk About Running only got 2 stars from me.On the other hand, it is exactly the opposite with my Burroughs experience. I first read his boyhood memoir Running With Scissors and I gave it a 2-star. This was followed by The Wolf At My Table, about his relationship with his father and You Better Not Cry (2 stars each). But this one, Dry is not hysterical and very subdued. He is still gay and he goes out and makes out with different men, some of them casually, but it talks about more serious and believable matters like serious alcoholism, AIDS and seemingly faithful(translation: more than sex escapades) gay love affairs.My favorite part is when Burroughs was out in a gay bar and he said to himself: this place is full of naked sad lives. This struck me as poetic and honest. Those gay men in a bar seeking for sex (that hopefully turn into love) are sad people. The music could be bouncy. The men could be good-looking with gorgeous body. They could be rowdy. But in the end, when they go home to their apartments, they can be alone and sad. Gay lives, excuse me if this is demeaning, can be lonelier than straight heterosexual lives. Burroughs has two affairs here. One of them is Pighead who died of AIDS and the character that made me think that the shrieking gay boy in Running with Scissors is actually a sensitive man who could be lovable and respectable. The other lover is the other alcoholic Forster who is so handsome any gay can go crazy about him. This character brought the human aspect of the gayness of Burroughs. While reading, I told myself that the only difference of him being gay to a straight man is that his lover is another man. All the rest are the same.Memorable characters that brought out the sensitive logical and probably lovable side of Burroughs. The more you read his works, the more you understand who he is. He could be exaggerating at times but that’s what they call as poetic license. But still, I liked this book. First time that I actually liked Burroughs. So, I expect more from his next book in my tbr pile: Magical Thinking.Unlike Murakami’s books that you get tired of his style as you read his works one after the other."}, {"userName": "Fabian", "userReviewDate": "Oct 26, 2008", "userURL": "http://www.goodreads.com/user/show/1036893-fabian", "userReview": "\"Dry.\" This book I read the next day... couldn't put it down.The memoir follows Augusten in his success as a mid-20s creative advertiser, which seems like the most appropriate job between Burrough's self-confessed childhood ideal jobs of hairdresser & writer (in \"Running w/ Scissors\").This one has a different flavor altogether, kind of like the Truffaut series of Antoine Doinel films. Eccentricity reigned supreme with the bunch of freaks in \"Running w/ Scissors\". \"Dry\" finds more misfits in Manhattan. Here, the psychology of Burroughs, his emotions raw and visceral, are on brilliant display. With age, it seems, comes a different mentality altogether... here is testament.This one has a great, bulky climax: after Burroughs undergoes now-famous rehab... will he relapse? The reader cannot stop reading to find out exactly this.The central question, and all the near mistakes Augusten makes keeps the suspense going. It is trainwreck drama/memoir!Burroughs is a great writer, my second favorite Burroughs as a matter of fact. He can give relevance to any bizarre or tragic event unlike mere observers, like ourselves. He is not, it seems, just a spectator, nor is he, despite the fact that he is a rich Manhattanite, mega pretentious. Egads!Both books are so different that you cannot believe that they occurred to the same individual. Because they did & because this fact means that our OWN lives are unexpectedly complex, sometimes truly symbolic and difficult to get through, it is a book to read. Clearly, it gives some bizarre sense of hope while remaining uber-entertaining."}, {"userName": "maricar", "userReviewDate": "Jun 16, 2008", "userURL": "http://www.goodreads.com/user/show/750368-maricar", "userReview": "Sharp, candid, and surprisingly poignant...The fact that I finished this book in one day probably indicates that I enjoyed it. Indeed, the only novels that I recall where I truly laughed my head off were from chick-lits, trivial as that may sound. But, really, Burroughs has managed to be disarmingly droll while being frightfully honest and self-deprecating. I can't attest if that's from being gay, the result of coming from a dysfunctional family, or perhaps from working in advertising (in New York, no less).What made this story interesting for me was the way he narrated his excruciating battle with alcoholism, that even someone who doesn't suffer from that ailment can actually empathize with him. Definitely he refrained from being too long-winded about it, avoiding the pitfall of letting his story become boring or monotonous--his cracks about himself, his fellow addicts, down to the closet case that is his boss, openly drew chuckles from me. There was enough balance of falling into bouts of introspection as well as allowing the story to progress via the lively dialogues with the equally captivating secondary characters--the tragedy that is Pighead, the complexity and apparent exceptionality that is Foster, and the oddity namely Greer, among others. A guilty enjoyment for me as well was the encounter with the German advertising client who unwittingly provokes the imagination of Augusten to spout Nazi stereotypes.Unexpected, though, was the striking insight into repressed emotions and the ability of a person to love another despite seemingly insurmountable flaws. Augusten's relationships perfectly capture what I think is a quintessentially urban tendency of people nowadays to tirelessly compensate for what they think they are missing in life. In a way, this novel shows how cheerless that condition is, and, at the same time, be unafraid of what is, after all, a price for being human.Augusten's narration of what his childhood was, the blatant abandonment he experienced from his parents, the perversion done to him as a teenager, makes the reader in turns awed and morbidly fascinated with the man that he has become. There were times our protagonist was readily aware of his shortcomings--from keeping up with the AA meetings to juggling his relationships with Pighead and Foster--and if those weren't uncomfortable enough, the reader is also made cognizant of his glaring denials about how he was living his life, pre- and post-rehab.I highly recommend this novel. Whether one is seeking an understanding of alcoholism, or simply in want of a refreshing, entertaining read--granted it's peeking into the \"memoirs\" of a self-confessed mess--this story will take you from laughs to sadness, hope to sorrow. (and back again). Without a doubt, this work proves that Burroughs is an Original."}, {"userName": "Elyse", "userReviewDate": "Nov 15, 2007", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "LOVED IT!"}, {"userName": "Marcellina", "userReviewDate": "Oct 08, 2007", "userURL": "http://www.goodreads.com/user/show/64736-marcellina", "userReview": "I got to be Augusten Burrough's escort when he spoke at the Texas Book Festival a few years ago, and he was very soft spoken, low key and ordinary looking. He spoke to a very large, adoring crowd in the senate chambers, and then signed books for quite a long time to an equally adoring snaking line of fans. He was very sweet and humble. He also bolted out of there as quickly as he could, and asked to be taken directly to his hotel, although my friend Kelly and I managed to drive him around Austin a little showing him things. He's sober now, bummer, so we couldn't take him out and get him drunk.He game me his badge to sell on ebay but I think I stuck it in a box somewhere.Anyway, this book is amazing, it's almost too confessional; you feel like you can practically feel his pain as he hits rock bottom and tries to claw his way out of addiction. Not nearly as funny as Running with Scissors, but it shouldn't because it's him as an adult, realizing the pain and abuse of his childhood, and the excruciating results of his bad choices and bad behavior. It's an extraordinarily compelling book. I gave it too a young, gay friend of mine who had never heard of him, amazingly enough, and he walked into work after finishing it, just speechless with emotion. It's almost too much, and you can understand why his fans feel like they really know him after reading it.Intense is all I can say."}, {"userName": "Carmen", "userReviewDate": "Nov 29, 2013", "userURL": "http://www.goodreads.com/user/show/25353295-carmen", "userReview": "This book is funny. It's funny and it's true and it's real.I laugh and crack up about what Burroughs is saying, even though he is a mean funny. I say \"a mean funny\" because he really rips into other people and judges them. Of course, he does the same thing to himself, but I can't help feeling a little guilty about enjoying this book so much. Sometimes he'll be saying something and I'll be laughing and then I'll think, \"Should I really be laughing at this?\"Believe me, it's nothing too offensive or disgusting, or I would put the book down. But it is something I notice. Burroughs will always be, for me, the man who I love reading his funny observations but who I'd never want to be friends with in real life.Burroughs is shallow and vain and foul-mouthed. But he knows that about himself. And because he knows that about himself, he can write very funny books about it.This book is about Burroughs being a drunk, and his long path to sobriety. It was touching, hilarious, painful and real. I enjoyed following Burroughs on his journey from being forced into rehab, to AA, to flirting with other addicts. Will he get sober? Will he relapse? I was genuinely worried about him at some points, yelling at my book \"Don't do it, Augusten!\" But of course he can't hear me and he's already made the decision, anyway. And written about it for my amusement and reading pleasure.I like how at first, Burroughs thinks he's too cool for school. This rehab is lame! I won't go to AA because it is so dweeby! But slowly he starts to realize how much he needs help (a new, hot guy at AA doesn't hurt, either). The subplot is him watching his good friend and ex-lover die of AIDS. This is very sad and poignant, even with Burroughs's joking and quips.Burroughs really lets you get into his head - his mixed feelings about the men in his life, his horrific memories of his abusive past, and his need - his love - for alcohol. This book, while humorous, also takes the reader to the very pits of addiction, and brings the filth of having an addiction squatting in your brain into the light. It's not pretty, but it's necessary and eye-opening.A very deep and funny portrait of a recovering addict.P.S. He does reference the pedophilia he experienced as a kid growing up. If this bothers you, either don't read the book or skip every section that's in italics.P.P.S. If you are an addict of any kind and you do not feel like you have a good grip on your sobriety yet, I am warning you that this book can be triggering. Very triggering. So best save it for your one-year-sober anniversary and not the white-knuckling part."}, {"userName": "Kelsey", "userReviewDate": "Aug 06, 2007", "userURL": "http://www.goodreads.com/user/show/71391-kelsey", "userReview": "\"You were spectacular,\" Hayden tells me afterwards.\"How so?\"\"You were so honest and substantive. Just no bullshit,\" he says, slapping me on the back.\"Really? I seemed normal?\" I ask.\"Of course. You were great.\"\"What a relief. I had no idea what I was saying. I was actually thinking about how my chest hair is growing back after having shaved it all off.\" Hayden turns sharply, \"What?\"\"Well, I thought maybe of bleaching it for the summer. But then I thought how awful it would be to have roots. Chest hair roots. That would be really humiliating. The blond chest hair might look good and natural like I go to the Hamptons on the weekends. but as soon as the roots started to appear, it would be like, 'Oh, that's very sad, he's obviously looking for something and just not finding it.'\" Hayden stares at me with mock horror. Or maybe it's real horror. \"You absolutely terrify me. The depth of your shallowness is staggering.\"Really, it [the shallowness] was staggering at times. But at least Burroughs wrote about it in an honest, hilarious way. A very fun, open, quick read. Sad too. I liked this more than Running with Scissors."}, {"userName": "peg", "userReviewDate": "Aug 05, 2012", "userURL": "http://www.goodreads.com/user/show/105244-peg", "userReview": "What more can be said about Augusten Burroughs? He is an amusing mess! If half of the information in his memoirs is true, I will give him five stars for his survival skills. If his memoirs are later discovered to be false,I will give him five stars for creativity and fantastic story telling.I can't put this book down.I haven't read their books, but it seems that his mother and brother are capitalizing on family dysfunction as well. They all make me feel extremely boring and sane."}, {"userName": "britt_brooke", "userReviewDate": "Jul 10, 2017", "userURL": "http://www.goodreads.com/user/show/1136632-britt-brooke", "userReview": "\"The fact is I'm not like other people, I'm like other alcoholics.\" This was an audio reread of a book I read in print in 2008. This has long been one of my favorite memoirs and will remain so. Augusten is a decent narrator except, when speaking as Foster, he sounds more like Forrest Gump than just a guy with a southern accent. Being from the south myself, that threw me off a little."}, {"userName": "Jodi Goldbeck", "userReviewDate": "Nov 14, 2012", "userURL": "http://www.goodreads.com/user/show/14598095-jodi-goldbeck", "userReview": "This is the second memoir by Augusten Burroughs, which details his life in his 20s, living in New York City, working as an advertising executive, making tons of money, and slowly killing himself each day by drinking more than seems humanly possible. After years of alcoholism, Augusten checks himself into an in-patient rehab center and begins a life he's never really known...sober.This man is a great writer! His detailed descriptions of people, places and feelings are so well-written. I was entranced by his story immediately. This was a much easier read for me compared to \"Running with Scissors.\" They were both well-written but this one, at least, was about him as an adult making his own decisions. The most profound part of the book, for me, was the description of Pighead on his deathbed, as it was so painfully similar to my brother's death. The description of his illness was as if I was reading my own journal during the time of Jim's illness. I feel as if I know Auguesten and I truly wish him a wonderful life.Grade: A"}, {"userName": "Alexa", "userReviewDate": "Jul 25, 2007", "userURL": "http://www.goodreads.com/user/show/219158-alexa", "userReview": "THE break-up book. While it may seem that Burroughs's story about his struggle with addiction and sobriety would have little to do with the average twenty-something's experience muddling through a break up, I have found no better book to read in the wake of a disasterous relationship.For example, once he's sober and out of rehab, Burroughs begins counting days. (He keeps track of how many days he goes without dringking, and must to keep counting until he hits the 90-day mark, after which the coutning becomes optional.) This is a great method to use following a break up. For each day you do not have contact (of any kind!) with the object of your heartahce, you get to count a day. Keep couting until you hit 90. (those first 90 are the hardest.)Not to mention, it makes you feel better to know that his life during this period is way worse than anything that you're going through. Gives you a little perspective."}, {"userName": "Katie", "userReviewDate": "Mar 15, 2008", "userURL": "http://www.goodreads.com/user/show/991712-katie", "userReview": "By far my favorite Burroughs' novel. This one isn't for the weak of heart, its not the same light feel as some of his other books. This book digs deep and leaves you feeling his hopelessness. Dry is all at once inspirational, depressing, exciting, and frustrating. Immediately after reading his honest and darkly beautiful memoir it immediately made it on my favorite books list. Burrough's has become a favorite of mine for his seemingly effortless managment of language. He is honest, funny and accessible. The kind of guy you want so desperately to have programed into your cell phone."}, {"userName": "Malbadeen", "userReviewDate": "Feb 25, 2008", "userURL": "http://www.goodreads.com/user/show/128745-malbadeen", "userReview": "(Mid March).....Dear Book Cover, I love you and I'm sorry it had to end this way. Remember when we first met? Remember how I tried to overlook you again and again but finally I broke down and pulled you off the shelf and you asked me to touch you, so I did. I spread my fingers and placed my palm flat across you. And then remember how I used my fingers to push up the palm and drug just my finger tips from the top to the bottom? and of course, the inevitable - the quick pull to the cheeck. The glances from side to side to make sure no one in the bookstore was looking and then, the eyes-closed-full-taking-in of your smooth matteness. Those were good times, I wont deny it - but it's over now.Dear inside of book,lets not kid ourselves, it was only a physical attraction and in the end that is never enough.*I found my brothers real life drug rehab stories to be more compelling (sarah, remember the kid that tried to prove his \"recovery\" by barking like a dog?)*the was OK, whatever but I kept getting irritated with Burroughs for over explaining things. i.e. \"He's a sex addict, I remember. And suddently, he ceases being a person and takes on the appearance of an anonymous roadside restroom stall.\" here enters one of the many overstatements that irritated the hell out of me, \"The kind used by passing truckers for quick sex with people like Kavi.\" Well no shit? was Burroughs afraid if he didnt' tell us what \"kind\" of stall it was, we might think it was a goat stall (the kind used to house goats)? After three \"no shits\"! in a 2 page span - I gave up on the book.(beginning March).... cool. i wanna be an alcoholic too!"}, {"userName": "Mikayla", "userReviewDate": "Jun 03, 2013", "userURL": "http://www.goodreads.com/user/show/11764750-mikayla", "userReview": "Okay, I didn't finish this one. I got about halfway through and had to put it down because I reached my maximum amount of frustrated sighs per book (20).I have several problems with this book. First of all, it says on the cover that it is a memoir, but Burroughs takes way too much license with dialogue and description. Although he states several times that he has always kept a journal, many of the details either have to be or better be made up. Here's an example of a detail he recalled that I really hope he made up: \"When I stand up, I bring my hand around to touch my back where it had been in contact with the tub and my back is cold, like a dead person.\" That sentence is clunky, no doubt, but the real problem is: who in the hell remembers, twenty years after the event, feeling his back and thinking it felt cold \"like a dead person\" (by the way, you mean corpse, right?). Or, if we take into account that he kept a journal, why would he write this observation down? This completely unnecessary made-up detail is unoriginal at best and cloying sentimentality at worst.Second of all, and the cause of most of my frustrated sighs, is Burroughs' excessive use of over-the-top metaphors, similes in particular. It was getting to the point where there would be at least one bad metaphor per page. And believe me, I love a good, well-thought out metaphor, as it can add insight and universality to writing. These metaphors, though, seem to serve no purpose than either to shock the reader or to prove how hilarious and cool Burroughs is. Here are some god-awful similes:- \"When I say 'rehab' I raise my chin, as though talking about the Oscars.\" [Maybe I have to be a gay man to get what this is supposed to look like?]- \"Like stopping into Baby Gap before having an abortion.\" [Ooo how scandalous!]- \"Paul concentrates, hard. He looks as if he can't decide between a vodka tonic or a screwdriver.\" [That kind of decision does take quite a bit of hard concentration...]- (he is imagining what AA meetings are like) \"Maybe there's even a secret handshake, like the Mormons who also don't drink.\" [What the hell is he talking about?]- \"So when you combine alcohol with a slob, you just end up with something that would appall an self-respecting heroin-addicted vagrant.\" [Wow, with one sloppy metaphor, Burroughs managed to elevate himself to be much superior to heroin-addicted vagrants and equate himself to the poor guys.]- \"In the shower I think about how I'm a drunk that doesn't get to drink. It seems unfair. Like keeping a Chihuahua in a hamster cage.\" [That makes NO sense at all.]The third major flaw with this book is found on page 104: Burroughs has just arrived at his very first AA meeting, and the first thing the chairman of the meeting says is, \"What you see here, what you hear here, stays here.\" Burroughs then spends the next four pages relating one woman's personal account of her struggle with alcoholism and her recovery. So here is the dilemma: either Burroughs is breaking that sacred rule or he is making up everything that happens in rehab and AA meetings. Undoubtedly he changes names, but I still think that is unfair to the other people in rehab and AA members who are only sharing their very personal stories because they know it is verboten to, say, publish these stories in a book. If he is making up these people and their stories, then perhaps he should call this book a fictionalized memoir.A minor detail: when Burroughs checks into rehab, he is placed in the detox room. And yet we have absolutely zip description of what it felt like to go through withdrawal. In fact, the lack of physical description (as in, what Burroughs feels physiologically) makes me question the truth of Burroughs' account. Why doesn't he even mention what it felt like when he initially stopped drinking in rehab? If he didn't feel anything, which I would find difficult to believe as he claimed to drink a liter of Dewars nightly AND was allergic to alcohol, then wouldn't it be worth mentioning that he miraculously had no physical withdrawal symptoms?I gave this book two stars instead of one for this reason: I think that Burroughs' goal in writing this memoir (and likely his other memoirs, though I have not read them nor do I have any intention of reading them now) is to yank an emotional reaction from his audience. If that is indeed his goal, then he has succeeded with me. I'm not sure Burroughs cares at all that my reaction is that I want nothing to do with him or his book(s)."}, {"userName": "KatieMc", "userReviewDate": "Nov 20, 2015", "userURL": "http://www.goodreads.com/user/show/8316749-katiemc", "userReview": "Thank goodness the author acknowledged the criminal behavior of those who were supposed to be responsible adults, but who placed him in situations that no child or even young adult should have faced. In other words, he doesn't simply laugh off his unorthodox upbringing, he acknowledges the fact that the responsible adults got it wrong. Still, he doesn't wallow in it, and regardless of the back story, this is a tale of addiction, recovery and lots of what happens in between. Dry takes a slightly novel approach in that it doesn't spent lots of time in the spiral into the abyss. Instead you spend lots of time in the recovery process. For those who have experienced this process, early success is an ominous sign, and this is no exception. This was a funny, real, and an authentic story."}, {"userName": "Natasha", "userReviewDate": "Oct 03, 2013", "userURL": "http://www.goodreads.com/user/show/8422854-natasha", "userReview": "Review to come."}, {"userName": "Cher", "userReviewDate": "Jan 10, 2016", "userURL": "http://www.goodreads.com/user/show/4776032-cher", "userReview": "3.5 stars - It was really good.Great insight into the mind of an addict and the writing has me wanting to pick up his other memoirs; really enjoy his narrative style. Not recommended however for those with delicate sensibilities. -------------------------------------------Favorite Quote: When you have your health, you have everything. First Sentence: Sometimes when you work in advertising, you'll get a product that is really garbage, and you have to make it seem fantastic, something that is essential to the continued quality of life."}, {"userName": "Erica  Reynolds", "userReviewDate": "Jun 29, 2008", "userURL": "http://www.goodreads.com/user/show/72351-erica-reynolds", "userReview": "Why are we all so obsessed with the alcoholic memoir? I read this quick read for book group in under three hours - which was about all the time it deserved. The literary tradition of great intoxicated writers may fascinate those who never studied Beatnik literature or Hemingway in school. But to satisfy the niche of urban hipster- intellectuals who are looking for a step above Lindsay Lohan's faux-glam adventures in US Weekly, this book was just an edited down version of James Frey's A Million Little Pieces, which I read on spring break at Canyon Ranch while detoxing from my own underage escapades.Although Frey was too audacious (and unethical, according to Oprah in 2006 and the recent issue of Vanity Fair...I cannot believe we're still talking about it) in his attempts to be a great memoirist through booz and bold moves, we all know that truth really can be stranger than fiction(whether 100% real or partially embellished); and those who live to tell about it in a well-crafted way deserve credit. The one rule of good writing I learned in school, however, is: keep talk about digestion, bodily fluids, or any other vulgarities people don't want to read about to a minimum. This is drugstore prose.If we reduce Burrough's memoir to the level of a \"quickie\" that's as cheaply satisfying as a Danielle Steel novel, then his account of addiction, if well-documented, should read with as much vim and vigor as if we were chain-smoking it. But it doesn't. Subtract all the bloated summary of ingesting, vomiting, or verbal headache, and all we get is flat character development, flat dialogue, and a brief account of rehab/institutionalization that does not even begin to compare with the world described to us in \"Girl, Interruped\" or \"One Flew Over the Cuckoo's Nest.\" This book's literary mediocrity is as cut and dry as a glass of Two Buck Chuck marked up to $14 - which is what I paid for this paperback.The only part of the memoir that was interesting was the advertising part. How on earth did he survive a meeting with clients at the Met while openly intoxicated? Overcome the real challenge of returning from rehab to a boss who sent him away and then expects him to gush full creative brilliance on a German beer account, when alcohol had seemingly been the tour-de-force behind his sarcastic excess in the first place? Perhaps he blames corporate BS as the cause of his deterioration...but it's probably his messed up parenting - which is clearly the more interesting part of his troubled life, as documented in Running With Scissors. (\"Interesting\" because it was made into a movie - if we're talking commercial success.)In the conclusion of Dry, his relationships fizzle, his significant other dies, and we are left with grotesque images of crack-cocaine and death that made me question why I was even bothering to finish this sophomoric and soporific \"been there\" \"done that\" Truth or Dare sharing. I felt like I'd forced myself to finish something that was all suds with little sustenance. Or stayed up for a party that was totally not worth it."}, {"userName": "Carrie", "userReviewDate": "Jun 23, 2009", "userURL": "http://www.goodreads.com/user/show/602951-carrie", "userReview": "Apparently, I am drawn to books written by gay men. I've never read any of Burroughs' work before, but own a copy of \"Running with Scissors\" that looked good from the dust jacket summary. This one makes me laugh and question whether I, too, might be an alcoholic since I've justified my drinking with many of the same excuses: \"That person criticizing me never has any fun,\" \"What else am I supposed to do in my 20's?\" and my favorite, \"I hate people who don't drink.\" For the record, I am NOT an alcoholic. But if my boss sent me to rehab for 30 days I would be like, \"Cool, 30 days paid vacation? Thanks!\"P.S. Now that I've finished I can comment more about the whole book. First off, 30 days of rehab no longer sounds like fun. It sounds like an extended version of a church lock-in I attended in high school that was full of awful self-esteem boosting exercises. Everyone talks about their feelings all day. No wonder they all wanted to drink more than anything in the world. It was heartbreaking and funny, although I suppose the progression of the author's alcoholism from denial to acceptance to sobriety to relapse and back again was exactly the formula I expected. Imagine how bad the reviews would have been if he went to rehab and came out still thinking it was a load of garbage that did not teach him anything?I suppose it was inspiring if you need help warding off the drink, but I'm not going there. I love the drink. I will say I could relate to the author's addiction to Foster, the hot crack addict. And I cried twice while listening to passages about Pighead, the author's best friend with HIV."}, {"userName": "Eva", "userReviewDate": "Jun 16, 2013", "userURL": "http://www.goodreads.com/user/show/5118691-eva", "userReview": "Brilliant, esp. if you have a dark, inappropriate sense of humor. A memoir of a gay ad man struggling with alcoholism.Some kindle quotes:He tells me how once he [the author's undertaker friend] had a female body with a decapitated head and the family insisted on an open casket service. “Can you imagine?” So he broke a broomstick in half and jammed it down through the neck and into the meat of the torso. Then he stuck the head on the other end of the stick and kind of pushed. - location 189I was awake by six A.M. and still felt drunk. I was making wisecracks to myself in the bathroom, pulling faces. This is when I knew I was still drunk. I just had way too much energy for six A.M. Too much motivation. It was like the drunk side of my brain was trying to act distracting and entertaining, so the business side wouldn’t realize it was being held hostage by a drunk. - location 225After having gone on more fashion shoots than I care to count, I’ve learned that terminally unhip AquaNet is the best. The result was hair that looked windblown and casual—unless you happened to touch it. If you touched it, it would probably make a solid knocking sound, like wood. - location 231I sprayed Donna Karan for Men around my neck and on my tongue to oppose any alcohol breath I might have. Then I walked to the twenty-four-hour restaurant on the corner of Seventeenth and Third for a breakfast of scrambled eggs, bacon and coffee. The fat, I figured, would absorb any toxins. As a backup safety measure, I swallowed a handful of Breath Assure capsules and wore a distracting, loud tie. - location 234As we walk into the first room of the exhibit, I cruise to the display case in the center of the room. I pretend to be interested in the egg that’s illuminated by four spotlights. It’s hideous; a cobalt blue egg smothered with gaudy ropes of gold and speckled with diamonds. I walk around the case, looking at it from all sides, as though I am intrigued and inspired. What I’m really thinking is, how could I have forgotten the words to The Brady Bunch? - location 248The rest of the day passes smoothly, groceries on a conveyer belt. Soon, I am home. - location 273She slips past me out of the room and her panty hose make an important hush, hush sound as she walks away. - location 321There is a gash and there is blood. More blood, really, than the gash calls for. Head wounds are so dramatic. - location 380Rick is a Mormon and although this is not a reason to hate him, I hate all Mormons as a result of knowing Rick. - location 441But he’s an investment banker, so for him, admitting the truth is something to be done only in the event of a plea bargain. - location 513and tells me my bags will have to be searched. “For cologne, mouthwash, anything containing alcohol.” “Cologne?” I ask, incredulously. “Oh, you’d be surprised,” she says, “by the things alcoholics will try and sneak in here to drink.” In my mind this settles the issue. I would never drink cologne and therefore am not an “alcoholic” and am, in fact, in the wrong place. - location 773He looks Indian, but highly gay-Americanized. - location 846I remember I was really freaked out on my first day in advertising, because I could barely understand a word people said. It was as if I had taken a job in Antwerp: Storyboards, VO, Tag, Farm-out, CA, Rep, Donut-middle. It was like, Huh? My favorite phrase was “Two-Cs-in-a-K.” This referred to the standard packaged goods commercial. It stood for Two Cunts in a Kitchen. - location 999He tucks into his meal, placing his arms on the table in such a way that they surround his food, protectively. - location 1131chocolate-chip cookie with me.” I can feel the artery on the left side of my head pulsing, moments away from bursting into an aneurysm. Whatever Librium was in my system has already been metabolized by my urban liver. My liver wastes no time. It’s the New York City cabdriver of livers. - location 1192I feel instantly pathetic. More transparent than jellyfish sashimi. - location 1346The room applauds. Applause is a constant thing in AA. It’s how we buy drinks for each other. - location 1993She’s the first person to say that name since I’ve returned. “It was very intense,” I tell her. “At first, I wanted to leave. My first impression was not a good one.” “But you revised your opinion?” I nod my head. “Yeah, that’s an understatement. I never expected it to be so intense. It was like emotion, emotion, emotion half of the day. And facts, facts, facts the other half. It was like Jerry Springer meets medical school. - location 2130When Group is over, we all pile into the same elevator and nobody says a word. That’s the strange thing about elevators, it’s like they have this power to silence you. I’ve just been in group therapy where people will reveal the most intimate details of their lives to complete strangers, yet in the elevator nobody can say a word. - location 2244And then in a moment of shining epiphany, I realize I didn’t actually see him write the number down. Which means he must have written it down before Group. Which means at least once, he has thought about me outside of Group. Which means that whether consciously or subconsciously, this could have affected his choice of what to wear to Group. Which means that the tight white T-shirt could very well have been meant for me. Sometimes people compare gay men to teenage girls and they are correct, I realize. I think the reason is because gay men didn’t get to express their little crushes in high school. So that’s why we’re like this as adults, obsessing over who wore what white T-shirt and what it means, really. - location 2401His eyes are so clear and blue that nothing but clichés enter my mind. - location 2584I hang up the phone in slow motion, just sit there for a minute. Finally, I look at Greer. “I don’t know what’s going on. Neither does he.” Greer sits in the chair across from my desk, her legs tightly crossed. “Well, is he okay?” she asks. “I don’t know,” I say. She gives me a look she has never given me before. I don’t like that this moment warrants a new look. - location 2704“You were so honest and substantive. Just no bullshit,” he says, slapping me on the back. “Really? I seemed normal?” I ask. “Of course. You were great.” “What a relief. I had no idea what I was saying. I was actually thinking about how my chest hair is growing back after having shaved it all off.” Hayden turns sharply, “What?” “Well, I thought maybe of bleaching it for the summer. But then I thought how awful it would be to have roots. Chest hair roots. That would be really humiliating. The blond chest hair might look good and natural like I go to the Hamptons on the weekends. But as soon as the roots started to appear, it would be like, ‘Oh, that’s very sad, he’s obviously looking for something and just not finding it.’ ” Hayden stares at me with mock horror. Or maybe it’s real horror. “You absolutely terrify me. The depth of your shallowness is staggering.” - location 2952She would go on monthly pilgrimages to New York City where she would return loaded with bags from all the shops on Fifth Avenue. I would, from a distance, come to view Manhattan as a mall without a roof. - location 3122His face goes red instantly, a mood ring dropped in boiling oil. - location 3247last night, I saw a giant rawhide bone at a pet store. A novelty bone. Much too large for any real dog. I bought it and went over to Pighead’s to give Virgil his new bone. He was euphoric, had no idea where to begin chewing first. - location 3289And lately, I get annoyed with AA, because even though I’ve been going every day, I haven’t really made any close friends. Or actually, any friends. It seems much easier to make friends in bars. I have to keep reminding myself that these AA people are exactly like bar people—they are bar people—except their bars have all been shut down. - location 3317“Foster, what is it you like about me?” I stare at the blades of grass before me, afraid to know the answer. Afraid because I want to know the answer. - location 3393And it’s not just my life that’s crazy. Greer is on the verge of a nervous breakdown. “God, I should have been a gynecologist,” she keeps saying, over and over like a crazy person. Sometimes, I actually think Greer is the perfect candidate for complete mental collapse. On Tuesday, I caught her looking into her compact mirror, with both hands pressed against the sides of her head. “What are you doing, Greer?” I asked. She didn’t look up, just kind of cocked her head to the side and continued to stare at her reflection in the mirror as she said, “Wouldn’t it be strange if you had no ears?” - location 3467“Hi, Greer,” he said as he entered the room. “Hmmmmm,” Greer said back coldly. Greer is the only other person who sees through Rick’s Nice Mormon act to the black, charred soul underneath. - location 3495rummage around for a snack. I choose the wrong thing. There is no worse taste in the mouth than chocolate and cigarettes. Second would be tuna and peppermint. I’ve combined everything, so I know. - location 3619He kisses the top of my head and I pull away. “You look horrible, Foster,” I tell him. And he does, for him, look horrible. He’s fallen rock-bottom to a nine-and-a-half in the looks department. I turn away. It’s an effort. - location 3632I take two Advil. Not because I have a headache, but because they’re the only thing left that I can take. - location 3731“My relationship with Foster has progressed. Well, maybe progressed isn’t the right word,” I tell her. “It’s metastasized. - location 3735Wendy nods, the kind, compassionate therapist. Then she says, “I’d like you to read something.” She reaches behind her, scanning the bookcase with her fingers. From in between a couple of books, she pulls out this thin booklet and hands it to me. I read the title: The Codependent Woman’s Survival Guide. I read the title again. It still says the same thing. - location 3738“Are the meat samosas filled with lamb or beef?” Hayden asks the waiter at the Indian restaurant. “They are filled with meat,” he replies proudly. Hayden orders the vegetarian samosas. - location 3905As I’m walking away I can hear Greer’s thoughts as she passes by the sunbathing extras: You girls are going to get malignant melanoma and then nobody’s going to cast you. - location 4033I have four hours to kill before dinner. In the past, this would have been just barely enough time to obtain a comfortable buzz and establish my relationship with the bartender. Now it seems like more than enough time to perhaps write a screenplay. Alcohol time is very different from sober time. Alcohol time is slippery whereas sober time is like cat hair. You just can’t get rid of it. - location 4037Greer paces like an anxious ferret. “Never work with children, puppies or bulimics,” she says. The director walks over. “This sucks.” He folds his muscular, tattooed arms across his chest. “She threw up all over her hair, so we have to re-do her.” “Oh, that’s just grand,” Greer says. “Thank you Anna Wintour for ruining the female body image.” I say, “Did she wake up yet?” “Yeah, she’s awake now. But she says she’s really dizzy. She’s afraid to get back on the bottle cap. Afraid she’ll fall off.” Greer narrows her eyes. “Bribe her with a slice of cheesecake and some Ex-Lax.” - location 4179He looks at me. He extends his shaking hand. I take it. “Augusten,” he moans, “please don’t hit me.” His mother looks at me quickly, sharply. “He’s only teasing,” I say. And I can see a tiny smile on his face, but it’s so small it’s almost like what’s left after a normal smile. He closes his eyes, which for some reason makes me feel better. I ask him if he’s feeling okay and he shakes his head from side to side. “No.” And suddenly he’s asleep, which does not make me feel better. Because falling asleep that fast is more accurately termed “losing consciousness.” - location 4532Hayden calls from London to tell me that he relapsed in a pub near Piccadilly Circus. Well, well, well. Deepak Chopra finally made a bacon cheeseburger out of the holy cow of India. “How tacky,” I tell him. “You relapsed in a tourist area.” Shamed, he admits, “It was a poor choice.” - location 4615Greer leaves a message to see how Pighead is doing. She deliberately does not mention anything about work, so I know this is probably the real reason she called. I send her an e-mail saying just, He’s dead. On my list of priorities in life, Greer is at the bottom along with vacuum cleaner bags and my career. - location 4903Once I accidentally cut my wrist on a broken glass in the sink. How can a person slice their wrist with liquid? It’s incomprehensibly brilliant and clever, glass. - location 4959"}, {"userName": "Matt", "userReviewDate": "Apr 27, 2016", "userURL": "http://www.goodreads.com/user/show/5903843-matt", "userReview": "Continuing the memoir trilogy, Augusten Burroughs takes the reader through his struggles with addiction as a young man. Living in New York City, Burroughs is busy with an advertising firm, making six-figures, and having little to rein him in. He recounts how his drinking got in the way of his job, where he would turn up randomly reeking of alcohol. After embarrassing himself and the firm on numerous occasions, Burroughs is offered a choice; go into rehabilitation or lose the job. Struggling to come to terms with his drinking, Burroughs choose rehab, though stands firm that he does not need it. He departs for a facility in Minnesota, where he encounters a number of other addicts as various points in their sobriety journey. In the early stages, Burroughs feels that he can overcome his drinking by choice, the \"if I want it, I will do it\" attitude. He pushes back against the services offered and program presented, finding them silly and somewhat overbearing. However, he has an epiphany while in treatment and as his thirty days come to an end, he develops a new-found respect for sobriety and its fragility. The true test transpires when he's released, sent back to New York City armed with a small dose of program and the requirement to attend an outpatient facility for six months. Though not mandatory, Alcoholics Anonymous is also recommended, a lifelong support that could only help him stabilise in the outside world. As the memoir continues, Burroughs explores life back in New York, a special someone he meets in his outpatient group, and a lingering connection from his rehab days that tries not only to vie for his attention, but to keep him from falling off the deep end. Highly humerous throughout with strong passages of heartfelt angst, Burroughs serves up a stellar second volume to his memoirs as he forces the reader to think and feel in ways they may not have thought possible. With a better understanding of both his writing style and approach to the memoir mechanism, Burroughs' second instalment had me captivated from the outset. His use of concrete examples in the narrative combined with flashbacks offers the reader a wonderful combination of fresh material and poignant events that shape the man he became. Burroughs presents a close to seamless story of his struggles and the depths to which he sunk before pulling himself out, only to come crashing back to earth in a moment of weakness. He does offer extensive thanks to those who played a role in his recovery, but does not let the battle facing him go without crediting his own willpower. That he slipped up in numerous ways is not lost on the attentive reader, but this goes more to present Burroughs as a fallible man, rather than portraying an individual who can rise above the fray. Shocking in its honesty and clear in the pathway on which this journey developed, Burroughs provides the reader with insight and hope for a man who came close to losing it all.Again, a special thank you to Rae Eddy, who recommended the Augusten Burroughs memoirs. She has been a great help as I realise my need to deal with some of the blurry portions of my past to develop stronger and more solid bonds to the present, as I peer into what the future has in store.Kudos, Mr. Burroughs for this wonderfully raw piece of work. I am curious to see how you tie things off in the final volume of this entertaining memoir.Like/hate the review? An ever-growing collection of others appears at: http://pecheyponderings.wordpress.com/"}, {"userName": "Kendra Parker", "userReviewDate": "Jan 28, 2011", "userURL": "http://www.goodreads.com/user/show/4887089-kendra-parker", "userReview": "I've read this book twice. Once almost a decade ago. To me then, it what a very good book but I did not have the connection to the story then that I do now.Since the first time I read the book, I dated an alcoholic who in retrospect seemed to suck everything out of our relationship like they sucked every ounce of liquor from the bottle.This book went from being interesting and hilarious in turns to being exactly what I needed. I actually read this book while still in that relationship and it more than anything made me realize that I was completely wrong in my approach. Burroughs is heartbreakingly frank in this book and you feel like you are going to the depths of hell and then coming back with him every time he scrapes his way out.This book moved me to actually help my partner and in doing so I lost them but they didn't lose their life like I am certain they would have if we had kept going the way we were.It is not often you can honestly say a book was powerful enough to actually help you save someone's life."}, {"userName": "Stephanie", "userReviewDate": "Aug 07, 2012", "userURL": "http://www.goodreads.com/user/show/11412699-stephanie", "userReview": "Dry is Augusten Burrough's follow-up to Running with Scissors. Thank God I read this one first, or I woukd have never purchased another. The book chronicles Burrough's journey from successful ad exec to alcoholic _ in often funny, yet also touching ways. He goes to rehab early in the book, where he actually believes the program will \"teach\" him \"how to drink responsibly.\" And that it has nothing to do with stopping drinking altogether. One thing that never occurred to me is covered in the book: a reason I had never thought of concerning the relapses of many addicts. When you are addicted to something, you tend to hang out with people who also use that drug of choice (may e not as badly in shape as you are); you also tend to hang around places with easy access to the drug. THIS is your lifestyle, and along with the alcohol, you must give this up. Imagine that. By turns touching and hysterical, I would highly recommend this book. I am certain some parts are embellished for effect, but for me it mostly rings true and gave me a glimpse into the mind and life of an addict."}, {"userName": "Lisa Filipczak", "userReviewDate": "Aug 01, 2013", "userURL": "http://www.goodreads.com/user/show/536822-lisa-filipczak", "userReview": "I loved this book! A family member recommended it to me and I thanked her for doing so. This is the story of Augusten Borroughs's journey to overcome his addiction to alcohol. He is an advertising copywriter and it's clear he knows how to tell a compelling story. I loved the nuances and descriptors in his stories. I'd recommend it even if one is not going through recovery."}, {"userName": "T.B. Markinson", "userReviewDate": "Sep 25, 2014", "userURL": "http://www.goodreads.com/user/show/6182031-t-b-markinson", "userReview": "This is a difficult, but worthwhile read. I admired the author's ability to share so openly about his addiction. Most of the time I didn't like him, yet I couldn't put the book down."}, {"userName": "Erika Batey", "userReviewDate": "Oct 12, 2007", "userURL": "http://www.goodreads.com/user/show/537030-erika-batey", "userReview": "Brutally honest. Makes you want to close your eyes and run from the room - but you keep reading."}, {"userName": "Tom", "userReviewDate": "Dec 03, 2011", "userURL": "http://www.goodreads.com/user/show/1837116-tom", "userReview": "\"Dry\" is Augusten Burroughs' autobiographical account about his life as a drunk while working in advertising in New York City. For the most part, it's a compelling, madcap read, but by the last few chapters, I was starting to tire of his ups and downs. He does have many humorous passages about his time in rehab, probably the most interesting part of the book. But he tends to be murky and vague when writing about his gay love life. The image that comes through is a young guy seeking quick gratification and unwilling or unable to make commitments to either friends or lovers. So any empathy we might have for him in his struggle with alcoholism gets trumped by our distaste for his conceit. Those who have read his first autobiography, \"Running with Scissors,\" (which he references many times) may be inclined to cut him slack, since his childhood was so chaotic. Many alcoholics might question how typical Burroughs' journey was: even when he hit bottom, he never seemed to lack money or a few friends to rely on. For yuppies who manage to hold onto their jobs despite blackouts, the story may ring true. I much preferred his anthology of short stories, \"Magical Thinking.\" He works better in sketching out short episodes than in sustaining a lengthy narrative."}, {"userName": "Victoria", "userReviewDate": "Apr 20, 2009", "userURL": "http://www.goodreads.com/user/show/2226027-victoria", "userReview": "This is the second Burroughs book I've read, and again, I find his writing not necessarily beautiful and poetic, or quotable and elegant, but incredibly engaging and real, and he makes me smile at how honest he is -- when he tells us something awful and personal about himself, I'm taken aback and almost embarrassed at first, then a little more embarrassed because I realize I do it too or at least do something similar and equally kind of disgusting and embarrassing, and then smile at his ability to tell us this when I'd barely be able to write it down on a piece of paper that only I'd be reading. It's endearing.I am also a big fan in particular of cheesy, lame-sounding, last-thing-in-the-world-you-want-to-do self-help type activities with groups of people (teambuilding and the like would fall into this too, icebreakers, etc) that end up, at the end of the day, having exactly the effect they're intended to, and win you over, however much you thought you weren't 'that type'. (Warning: only Georgetown applicable: ) What do you expect, I was an ESCAPE leader. Though I guess the point is that the beauty of this shit is when it appeals to people that wouldn't dream of going on escape, let alone apply to be marshmallow roasters."}, {"userName": "Randolph Carter", "userReviewDate": "Oct 12, 2012", "userURL": "http://www.goodreads.com/user/show/1804559-randolph-carter", "userReview": "You can always tell when a real alcoholic writes about alcoholism. A lot of writers that just drink a lot or have an alcoholic friend think they can write about it. They can't. They can fake it with people who drink a lot or with people that aren't alcoholics. Augusten Burroughs is a real alcoholic and he writes about it. He writes well about it, but he doesn't know what book he is writing. The first 100 pages are hilarious. Then the book turns dead serious for 200 pages, well not dead serious, but not funny. Part of the problem is Augusten goes through a series of romantic personal crises after rehab. None of these are very funny. What kind of a book is this? Plenty of potentially funny stuff is still going on after rehab but the author now approaches it with a grim humor that just doesn't work.So the real problem is does Augusten want to approach this like David Sedaris or does he want to write a serious autobiography about alcoholism, the rise and fall and rise? We get some of both but there isn't any unity here.The one thing that is refreshing about this is it is not a book about a homosexual that is alcoholic. It is an alcoholic who is gay. There is a difference."}], "description": "Revisit the second memoir in Augusten's bestselling trilogy of Running with Scissors, Dry, and Lust & Wonder. You may not know it, but you've met Augusten Burroughs. You've seen him on the street, in bars, on the subway, at restaurants: a twenty-something guy, nice suit, works in advertising. Regular. Ordinary. But when the ordinary person had two drinks, Augusten was circling the drain by having twelve; when the ordinary person went home at midnight, Augusten never went home at all. Loud, distracting ties, automated wake-up calls, and cologne on the tongue could only hide so much for so long. At the request (well, it wasn't really a request) of his employers, Augusten landed in rehab, where his dreams of group therapy with Robert Downey, Jr., are immediately dashed by the grim reality of fluorescent lighting and paper hospital slippers. But when Augusten is forced to examine himself, something actually starts to click, and that's when he finds himself in the worst trouble of all. Because when his thirty days are up, he has to return to his same drunken Manhattan life and live it sober. What follows is a memoir that's as moving as it is funny, as heartbreaking as it is real. Dry is the story of love, loss, and Starbucks as a higher power.", "title": "Dry", "url": "http://www.goodreads.com/book/show/40193421-dry", "average": 4.02, "cover": "https://images.gr-assets.com/books/1527004814l/40193421.jpg", "reviews": 3251, "authors": [{"url": "https://www.goodreads.com/author/show/3058.Augusten_Burroughs", "name": "Augusten Burroughs"}], "type": ["Autobiography", "Nonfiction", "Biography", "Humor"], "outlinks": ["http://www.goodreads.com/book/show/242006.Running_with_Scissors", "http://www.goodreads.com/book/show/79790.Magical_Thinking", "http://www.goodreads.com/book/show/61115.Possible_Side_Effects", "http://www.goodreads.com/book/show/2145681.A_Wolf_at_the_Table", "http://www.goodreads.com/book/show/25657.Sellevision", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/35525893-sick-in-the-head"]}