{"ratings": 248, "userreviews": [{"userName": "Kim", "userReviewDate": "Feb 06, 2009", "userURL": "http://www.goodreads.com/user/show/1032563-kim", "userReview": "I initially liked the concept of this book -- examining transition/initiation rituals for girls. Each chapter dealt with a different rite of passage -- sorority rushes, debutante balls, gang initiations, wicca ceremonies, etc. The problem is that the author was not at all objective about the girls she was studying. As the chapters crept on, she became more and more condescending in her observations. I got so tired of her describing young girls as naive and desperate without acknowledging the probable reasons behind their naivete and desperation. it just seemed like the author investigated these different groups of girls only to confirm the low opinions she already had of them. That was annoying. So, I didn't read the last three chapters. But I'm guessing it probably didn't redeem itself."}, {"userName": "Elizabeth Wylder", "userReviewDate": "Nov 27, 2007", "userURL": "http://www.goodreads.com/user/show/125370-elizabeth-wylder", "userReview": "Decent idea executed in a mediocre manner. Vida often seems to be mocking the subjects of her interviews/investigations. This wouldn't be too awful if: 1) she actually did it to their faces; and 2) she used her observations to make a point greater than common sense. (The section on young brides is probably the worst offender on both of these counts, as she gets in easy jabs at the physical appearance of the brides- and grooms-to-be, and informs the reader that these teenagers getting married after only a few months of courtship probably \n   aren't going to make it to their ten-year anniversary. No way!)It's an interesting topic, but if you want to read some good Vida, go pick up her novel And Now You Can Go."}, {"userName": "Kate", "userReviewDate": "Jan 10, 2008", "userURL": "http://www.goodreads.com/user/show/137566-kate", "userReview": "I read this at work while our computers were down. The author analyzes coming-of-age rituals for U.S. girls, usually after having visited or participated in one of them. In the first and strongest chapter, she infiltrates sorority rush at UCLA. The writing is engaging in part because of her self-consciously sophisticated perspective on the experience. But I think the insertion of her perspective actually winds up weakening the other chapters. I don't care what she, personally, thinks of teen brides, for instance. So what if the author's mother told her not to get married until 35: Who made her the Social Supreme Court? And of course, during a wrap-up chapter on the meaning of modern rituals, she decides she doesn't like Burning Man: she's uptight to start with, and then only drinks two beers the whole time she's there. I don't mean to say that you have to get drunk to have a good time... but I'm guessing that this chick does. Still, worth a read, especially if the computers are down and the library is slow as hell."}, {"userName": "Emiline", "userReviewDate": "Nov 25, 2012", "userURL": "http://www.goodreads.com/user/show/14713351-emiline", "userReview": "What bug got up Vida's butt when she was writing this book? I had high expectations based on the summary: an exploration into modern day \"rites of passage\" for young women. Sororities, quinces, debutante balls! The author makes the point that many of these rituals fail to provide empowerment and meaning to women, and then she highlights how this is so. I stayed on board until midway through the second chapter when it occurred to me that Vida is a sour grape of a person and thus likely a poor candidate to be writing in this vein. I do not like how Vida interviewed many willing, thoughtful, albeit imperfect ladies, and then threw them under the bus with cruel descriptions and simplifications. Everyone she interviews is caricatured and made to sound unintelligent. The young girls getting married in Las Vegas aren't \"really\" in love, the self identified witches are needy, emotional. She makes quinces sound tacky and trashy. Every chapter contains interview quotes that support her snarky views. The last chapter has nothing to do with the main premise of Vida's book. It discusses her experiences at a Burning Man festival and being weirded out by a proliferation of naked people having fun and enjoying life. Modern day rituals aren't perfect and PC, and surely some of them do more damage than good... but this writer could have explored the nuances without so much sneering."}, {"userName": "Vickie", "userReviewDate": "Jan 06, 2017", "userURL": "http://www.goodreads.com/user/show/12893001-vickie", "userReview": "I didn't realize when I requested this from our local library that it was non-fiction (not that I have a problem with that, I was just surprised). I wasn't sure it was what I wanted to read at the moment. However, once I began, I was delighted with the way the research done by Vendela Vida was presented. Very interesting."}, {"userName": "kimberly", "userReviewDate": "May 25, 2010", "userURL": "http://www.goodreads.com/user/show/647315-kimberly", "userReview": "I thought I would enjoy this book. i am very interested in the subject matter Vida addresses. I am not so interested in her banal and unsurprising insights into the communities she visits. At first, I hoped it was just a slow start. But halfway through her study of quinces, I knew we were in trouble. Still I trekked on, and by the last chapter on Burning Man I had to resist the urge to throw the slim volume against the wall and stomp on it with my tiger print slippered feet. No wonder she belongs to no group - she lacks any presence in her writing to notice her. And it is not that she is a terrible writer. The failure of this book is more frustrating because there is craft and care in her writing. Rather, it is that instead of revealing interesting aspects of the various cultures, she appears to merely stand on the outskirts poking fun at the women, as if she is too cool for their silly traditions. More damning is that she offers nothing new to the table. Every stereotype she hones in on to share her vapid insights has been played out already. Maybe it was just this selection of essays. I retain faith that her other offerings may be better. I just wish I could have the time I wasted on this book back. To be more precise - I would take the 10 hours of Dan Brown audio book (again) in exchange. This may seem harsh, but I expect more of Vida than Dan Brown. The disappointment is more genuine and fierce in these circumstances where her subject matter was so accessible, and her skills more capable and artistic than many writers. Fail."}, {"userName": "Celia", "userReviewDate": "Feb 10, 2009", "userURL": "http://www.goodreads.com/user/show/635391-celia", "userReview": "I had this book on the shelf for years and didn't read it through until last month, when I was looking for nonfiction to recommend to my creative writing students. At first I thought it was an academic treatment of girl culture, but it's really more relaxed than that, more like undercover reportage. It's very readable and well-written. The first chapter, in which Vida, at 26, prentends to rush at UCLA, is very fun. She is actually quite fair to sorority culture, and you can really see her struggling against a very plain desire to be \"chosen.\" Other chapters cover quinces and debutante balls, gang initiations, and witchcraft. Her goal is supposedly to examine coming-of-age rituals for girls, but really this aspect of the book is little more than an organizational scheme. This is most evident in the final chapter, in which she describes attending a Burning Man festival, which has nothing to do with girls. She tries to gloss this over, but it seems as if the book was supposed to be about girls and just became about the search for community. Which is fine by me. The loss of focus--unless you're dead-set on reading about girl rituals--didn't really affect my appreciation of her breezy style and keen eye for observing culture. Try Rachel Simmons for the girl angle, and read Vida just for fun."}, {"userName": "Aja", "userReviewDate": "Dec 05, 2011", "userURL": "http://www.goodreads.com/user/show/301234-aja", "userReview": "Really, I think the concept of this book is an interesting one--taking a look at rites of passage initiations for adolescent girls and young women. There's a lot to talk about there. But that's the problem: Vida doesn't. While disgusing herself as a sororiety rushee, Vida goes through the entire rush process and, when it is done, walks away from it so ambivilantly as though to say, \"well, that was okay.\" And that is my opinion on this book: well, it was okay. It was not groundbreaking in the least, and it didn't even provide what the back cover promised--insight and a sense of humor (both were lacking). Additionally, in the opening section Vida talks about why she doesn't include initiations such as lesbians coming out to their parents or girls getting tattoos or piercings--because they're not initiations at all, she says, they're choices. However, she does cover girls becoming Wiccan, which pretty much seems like a choice to me. There is a thin line separating initiations from choices, but don't discriminate against one option only to include an identically circumstantial one."}, {"userName": "John", "userReviewDate": "Feb 23, 2009", "userURL": "http://www.goodreads.com/user/show/295510-john", "userReview": "I thought this was a novel when I requested it, along with another Vida book, from the library. Instead of a novel, I wound up with an interesting examination of coming-of-age rituals practiced by girls and women in the United States, with an eye on the ever slippery concept of \"community in America.\" While the source material is a little over a decade old, the book still is engaging and interesting. I don't know that I would have read this without assistance from chance, but I am glad that I did. Vida picks rituals from different class, ethnic, and social backgrounds, including some that cut across cultural divides. She is a good writer, and her take on life is engaging."}, {"userName": "Venessa", "userReviewDate": "Jan 05, 2008", "userURL": "http://www.goodreads.com/user/show/201787-venessa", "userReview": "Vida’s first book, non-fiction, examines the initiation rituals of girls, from sororities to gangs. I read this book in a night, I found it so fascinating. Vida first takes us undercover during UCLA’s fall sorority rush….follows that with the changing Latin American quincenarana {sp?} in Miami….and debuting in Texas. So makes up Part One; Part Two reveals the violent world of girl gangs, neo-Wicca, and girls who travel to Vegas to marry young, not one of who cites pregnancy as her reason. The epilogue is curious: Vida attends the 1997 Burning Man Festival in the Nevada desert. I love the title."}, {"userName": "Brad", "userReviewDate": "Sep 04, 2007", "userURL": "http://www.goodreads.com/user/show/276568-brad", "userReview": "I read this book mainly from curiosity about the author as opposed to the subject matter. Vida is the wife of Dave Eggers, though they married significantly after she wrote this book. I liked the book in a \"glad it's only 180pgs\" way. The tone felt inconsistent. The book isn't journalism, nor memoir; instead almost a travel journal investigating situations. Vida does little to disagree with or challenge her preconceived notions of what she will find. Still, the book interested me by describing situations I could never experience. Eh, it's short, just read it."}, {"userName": "Kristin", "userReviewDate": "May 15, 2010", "userURL": "http://www.goodreads.com/user/show/2344817-kristin", "userReview": "A collection of essays/anecdotes about various modern rituals that mark girls' transition to womanhood, from sorority rush week to female gang initiations to debutante balls. I thought it was an interesting idea to try and tie together such varied events, but it really didn't work well - she had to work way too hard to try to try and string it all together into some sort of cohesive narrative. Also still not sure how her trip to burning man fit into this, or the chapter on wicca - very random..."}, {"userName": "Jennifer", "userReviewDate": "Jul 10, 2007", "userURL": "http://www.goodreads.com/user/show/183126-jennifer", "userReview": "I really enjoyed this book! It is a piece of non-fiction that operates under the basic thesis that many young (18-21 year old), North American women feel the need for some rite of initiation and belonging to a group other than their family unit. It examines the rites of initiation to a major US sorority (at UCLA - where Greek life is serious business), Texas debutante balls, girl gangs, Wicca covens, and Vegas wedding with the under 20 crowd. It is eye-opening and at times a bit sad.I thoroughly recommend this read!"}, {"userName": "Kara", "userReviewDate": "Aug 17, 2007", "userURL": "http://www.goodreads.com/user/show/278544-kara", "userReview": "When I first read this, I loved it. I felt like it was an interesting idea, to go \"undercover\" and try to understand what different initiations into womenhood really meant. But I agree with one poster here who said it was like she tried too hard to find some deep meaning but came up short. In theory it's neat, not so amazing in the delivery. But I still really liked it and would recommend forward."}, {"userName": "Hilary", "userReviewDate": "Nov 07, 2010", "userURL": "http://www.goodreads.com/user/show/2808450-hilary", "userReview": "This is a pretty topical investigation of a really interesting idea. Female coming of age rites are very interesting (to me) but she sort of skims the surface of all of them instead of really discussing in depth any of them. It is pretty obvious that she has her feelings about each set up prior to her immersion into the celebration, which also weakens her argument, at least from an ethnographic stand point. And, um, Burning Man? Really?"}, {"userName": "Emma Veitch", "userReviewDate": "Aug 24, 2011", "userURL": "http://www.goodreads.com/user/show/3149471-emma-veitch", "userReview": "I love vendela's topic and some of the encounters are fascinating and beautifully told... but this just didn't quite hang together enough for me. Particularly the Burning Man chapter stuck out as not fitting with the rest of her theme -- an amazing, weird trippy thing but just didn't flow with the rest of the book."}, {"userName": "Elizabeth☮ ", "userReviewDate": "Oct 20, 2009", "userURL": "http://www.goodreads.com/user/show/990216-elizabeth", "userReview": "vendela chooses various initiations and ritualistic groups to determine how women form bonds or community. she covers deubante balls in houston and girl gangs in los angeles. i think any one of these chapters would make a compelling novel on its own (except for the burning man chapter, which held little appeal for me)."}, {"userName": "Abby", "userReviewDate": "Mar 13, 2012", "userURL": "http://www.goodreads.com/user/show/372332-abby", "userReview": "Eh. Since the topic is so interesting, I was disappointed by her surface level analysis and condescending tone. Plus, an inexplicable, unrelated Burning Man epilogue that would totally offend me if I were a die-hard burner: \"I get the sense that a lot of people at Burning Man don't go to parties at home, and so a lot of them act the way they think people do at parties.\""}, {"userName": "Laura Youngstrum", "userReviewDate": "Feb 22, 2015", "userURL": "http://www.goodreads.com/user/show/15918174-laura-youngstrum", "userReview": "I really enjoyed her first essay on Sorority Life, but none of the others really stood out to me, and I felt myself annoyed by her. I found her journalistic style too heavily judgmental and opinionated when to get a true feel of what she was writing about should have been as unbiasedly written as possible."}, {"userName": "Carina", "userReviewDate": "May 07, 2008", "userURL": "http://www.goodreads.com/user/show/177773-carina", "userReview": "Hm. I can now tease my Southern friends about debutante rituals.11/2 Update:I met the author's husband the other night and, unlike everyone else in my generation, haven't read any of his books. Also, didn't know Vendela Vida was his wife. We did bond over Swedish speaking family members. Apparently, according to Husband, this book is not that easy to find. Thanks, Oakland Public Library."}, {"userName": "Lena", "userReviewDate": "Feb 04, 2009", "userURL": "http://www.goodreads.com/user/show/1909134-lena", "userReview": "It was okay. The author, in writing about sorority rush and the debutante balls, is very sarcastic and her true feelings about these \"rituals\" come thru, but the rest of the book seems more objective."}, {"userName": "dearlittledeer", "userReviewDate": "Mar 06, 2009", "userURL": "http://www.goodreads.com/user/show/369766-dearlittledeer", "userReview": "I liked this book. The chapter on gangs was the most eye-opening (and depressing) and the chapter on sororities was the most fun.I didn't get the epilogue on Burning Man. It doesn't fit the rest of the book. But, um, I guess it made it longer?"}, {"userName": "Kristina Gibson", "userReviewDate": "Feb 17, 2009", "userURL": "http://www.goodreads.com/user/show/2039479-kristina-gibson", "userReview": "This book had some interesting segments and I liked the idea of looking at modern day rituals and rights of passage. It ultimately strikes a pretty pessimistic note about the meaning or lack thereof for today's youth."}, {"userName": "Megan", "userReviewDate": "Jan 14, 2009", "userURL": "http://www.goodreads.com/user/show/1233686-megan", "userReview": "An interesting book, but doesn't tell me anything new ~ some girls are just nasty, catty, mean bitches. Vendela Vida appears to use peer pressure and adolescence as an excuse. Unfortunately, I have found that many women remain this way far into adulthood :("}, {"userName": "Emily H.", "userReviewDate": "Dec 04, 2007", "userURL": "http://www.goodreads.com/user/show/278367-emily-h", "userReview": "If you like to read nonfiction accounts of female coming of age rituals, this book is the one for you. Quincenara, debutante balls, gang initiation shootings, wicken ceremonies, and more. A lot of research on fascinating subjects. It makes you glad you're not a teenager."}, {"userName": "krystal", "userReviewDate": "Jul 24, 2007", "userURL": "http://www.goodreads.com/user/show/32671-krystal", "userReview": "Sort of like watching My Super Sweet 16. Feels like she's trying hard to find hidden meaning in whatever she's observing (debs, quinceneras, las vegas weddings, wiccans) but doesn't really come up with anything. the things themselves are interesting though."}, {"userName": "Rochelle", "userReviewDate": "Aug 30, 2016", "userURL": "http://www.goodreads.com/user/show/23348189-rochelle", "userReview": "Am surprised this is the same author of \"Let the Northern Lights Erase your Name\". This book is written in a condescending voice. Every person interviewed was portrayed as a loser. Would love to read this in a voice that doesn't judge. Ugly writing. An ugly read."}, {"userName": "Julia", "userReviewDate": "Jan 30, 2008", "userURL": "http://www.goodreads.com/user/show/150930-julia", "userReview": "it was VERY dated... very 90's both in the cultural references and the perspective. it was nevertheless an entertaining read. more memoir and unofficial record of what goes on in various \"rites of passage\" for girls. i thought the burning man bit was irrelevant but interesting..."}, {"userName": "Tori", "userReviewDate": "Jul 25, 2011", "userURL": "http://www.goodreads.com/user/show/5871674-tori", "userReview": "2010- I felt like I had already read this book before, which is to say nothing here was new. Additionally, I understand why the author choose to focus the epilogue on Burning Man, but I felt this section felt tacked on and separate from the rest of the stories."}, {"userName": "Kelli", "userReviewDate": "Jun 10, 2012", "userURL": "http://www.goodreads.com/user/show/3240862-kelli", "userReview": "I learned a lot of things about a few very common rituals and people's motivation for partaking in them. Last chapter, on Burning Man, while informative, left me more lost than bringing everything together."}], "description": "In a fascinating look at how young women are coming of age in America, Vendela Vida explores a variety of rituals that girls have adapted or created in order to leave their childhoods behind. Vida doesn't just observe the rituals, she actively participates in them, going as far as spending a week at UCLA to experience rush--she emerges a Tri-Delt. She also goes to Miami to learn about the \"quince\" (the Latin American celebration of a girl's fifteenth birthday), to Houston to take part in a debutante ball, to Los Angeles and San Francisco to talk to female gang members, to Salem, Massachusetts, to interview a coven of witches, and to Las Vegas to watch young brides take the plunge--some of them in drive-through wedding chapels. With humor, insight, and illuminating detail, she explores girls' struggles to forge an identity and secure a sense of belonging through various rituals--rituals that they embrace without necessarily understanding the comforts they seek or the repercussions of their often all-too-adult choices.", "title": "Girls on the Verge: Debutante Dips, Drive-Bys, and Other Initiations", "url": "http://www.goodreads.com/book/show/149907.Girls_on_the_Verge", "average": 3.31, "cover": "https://images.gr-assets.com/books/1312016736l/149907.jpg", "reviews": 39, "authors": [{"url": "https://www.goodreads.com/author/show/36347.Vendela_Vida", "name": "Vendela Vida"}], "type": ["Nonfiction", "Writing", "Feminism", "Abandoned", "Gender"], "outlinks": ["http://www.goodreads.com/book/show/64482.Let_the_Northern_Lights_Erase_Your_Name", "http://www.goodreads.com/book/show/23590710-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/6920816-the-lovers", "http://www.goodreads.com/book/show/140279.And_Now_You_Can_Go", "http://www.goodreads.com/book/show/149908.The_Believer_Book_of_Writers_Talking_to_Writers"]}