{"ratings": 15751, "userreviews": [{"userName": "Aleeda", "userReviewDate": "Aug 11, 2011", "userURL": "http://www.goodreads.com/user/show/4876884-aleeda", "userReview": "If Jane Austen were somehow transported to the 20th century Manhattan, I'm pretty sure she'd would have written a novel like Lucia, Lucia. Author Adriana Trigiani has channeled many of the recurring themes in Jane Austen's novels; an interesting family dynamic, filled with the inevitable crises, the plight and constraints of women in society, the search for love, and ensuing heartbreak. I loved the characters, especially the protagonist Lucia. Born into a large Italian family, Lucia respects tradition, but not to the point where she allows it to overtake her dreams. Her family runs a grocery in Greenwich village, and Lucia has turned her sewing skills into a job outside the home at B. Altman's Custom shop. She is supported, sometimes overtly, sometimes covertly by a family that adores her, especially atypical (for the 1950's at least) parents, who are proud of their daughter's accomplishments, and want her happiness, even if it is not what tradition demands. In the end, Lucia must compromise: I'll let you decide if it is a happy one or not."}, {"userName": "Elissa Hoole", "userReviewDate": "Oct 27, 2009", "userURL": "http://www.goodreads.com/user/show/409437-elissa-hoole", "userReview": "Immediately, I *hated* the frame story. The opening character, Kit, is a struggling playwright living in Greenwich Village who ventures up to the apartment of the aged but elegant \"Aunt Lu\" and has tea while listening to her story, which is the basis of the book. My dislike of the frame only got worse when it finally reappeared (after no mention of it throughout Lucia's story) at the end of the book. The characters, including the old Lucia, are flat and there is very little to connect them to the rest of the story.Lucia's story, told in first person, at first engaged me quite a bit. I know very little about fashion, New York City, the 1950s, and the life of Italian immigrant families, yet I found myself interested in all of these. I was enthusiastic when Lucia breaks off her engagement and her role as a traditional Italian girl--choosing instead to continue her career as a seamstress working for an up-and-coming designer in the customs department of a swanky department store. I thought, hey, cool, it's about a girl who is going to be ahead of her time, who fashions herself after her own pattern rather than the rigid expectations of tradition and culture.Unfortunately, not so. Even though she sometimes flirts with the idea of striking out and becoming an independent woman throughout the rest of the book, every choice she makes--falling in love with a suave man who eventually cons her out of her heart and life savings, assuming the role of dutiful daughter when the family needs her, and submitting to the will of her traditional brothers--dashes my hopes for her character. In addition, each event and emotion is laid out in such a way as to be completely transparent--no subtlety to speak of.The book had a couple of good lines, such as my favorite spoken by Lucia's mother: \"In my mind, the most dangerous people in the world are insecure women. They can do more damage in a day than an army.\" Overall, though, the writing was...well, plain. It was writing that got the job done, but it didn't evoke any impressive images in my mind or any real emotion for Trigiani's characters. I know I'm not emotionally invested in the characters or the writing when I find myself skimming paragraphs toward the end. And the ending, ugh. The author goes back to the ugly frame story and slaps on the most sentimental ending ever, with the final act of the book going back and essentially undoing Lucia's original admirable decision at the beginning of her story.It's not fair, perhaps, to judge a character of the 1950s because she doesn't eschew her family and society's expectations of her in a way that I expect her to, in a different era. Still, the author could have done a better job of helping me to understand her, to sympathize with her plight instead of making me skim over it."}, {"userName": "Amy", "userReviewDate": "Oct 02, 2007", "userURL": "http://www.goodreads.com/user/show/271125-amy", "userReview": "so i just finished listening to this book read by Mira Sorvino. i liked it but i find it hard to believe that Lucia's life decisions really made her happy. i don't know how a person could love their job more than having a life with people you love. i think she would have felt quite lonely in her life. this is the second trigiani book i've read and it seems that her stories focus on being an independent career woman and how that sometimes trumps being married and having children. i think my priorities/values are just different from trigiani's which makes it hard to really love her novels."}, {"userName": "Suzanne", "userReviewDate": "Aug 02, 2010", "userURL": "http://www.goodreads.com/user/show/3444927-suzanne", "userReview": "This is the first novel that I have read by Trigiani, and I am totally hooked with her writing, and can't wait to get started on Rococo, which is now sitting on my nightstand. Kit is a young career girl and aspiring playwright living in an aging apartment building in Greenwich Village in the early 2000s. One day, she's invited for tea by one of the older women living on the top floor of the building. Reluctantly, she takes time out of her busy schedule, but has no idea what a treat is in store for her! The story of Lucia is an amazing glimpse into what life was like for a first-generating Italian women in 1950s New York City. As societal barriers begin to fall after WWII, doors are opened for Lucia, yet she still struggles to balance her desire for a career and independence, with the life her family wants for her which includes marriage and children. The struggles she faces throughout the book are at times agonizing, but it makes you realize just how far women have come in the last 50 years. Lucia and Kit both learn important lessons about life and love in this dramatic, page turner. Savor every bit of this wonderful book, it really is quite a treat!"}, {"userName": "Laura", "userReviewDate": "Apr 10, 2017", "userURL": "http://www.goodreads.com/user/show/42313172-laura", "userReview": "This will definitely go into my \"favorites\" bookshelf. I thoroughly enjoyed this story. Although funny and heartwarming most of the time, the story did have some very sad moments but isn't that how life is anyway? Lucia Sartori is the kind of leading female character I adore. She is strong-willed with the courage to step outside of the stereotypical gender-role boundaries of the 1950s (specially in a Catholic Italian home). Lucia is the only daughter in a family of five children. As the girl, her role is to look after her brothers and help her mother with keeping the family home in order until she meets the right man and marries. At which time, she will be expected to move into his family home and continue her domestic responsibilities for her new family. However, Lucia, at age 25, is a seamstress for the customs department of a big NYC department store. She is not only a skilled worker but she likes the freedoms of being a single, working woman who loves her job. In the 1950s this is equivalent to being an old spinster. But she is true to herself and lives her life as so. My daughter read this book along with me and she too loved it. We both agreed that we felt like we were in the Sartori home as part of the famiglia. Adriana Trigiani does such a great job conveying that sense of the reader being part of an era gone. Kudos to Mrs. Trigiani on a wonderful book. Thank you for letting me and my daughter be part of the Sartoris if only for a couple of weeks."}, {"userName": "Erica T", "userReviewDate": "Mar 15, 2016", "userURL": "http://www.goodreads.com/user/show/2327756-erica-t", "userReview": "I loved this book! This was my first Adriana Trigiani book and definitely will not be my last. Lucia was such a beautiful character that I absolutely fell in love with. The time, the location, the Italian culture...it all weaved together to make a story that just resonated in me. I loved the loyalty and love the family showed each other, and the way they recovered and got stronger after setbacks. Even though she was a minor character, I have to say Rosemary was also one of my favorites. What a sweet girl, who really came into her element throughout the story.I listened to this one on audio and thought that the reader did an amazing job. She got all the voices right and really helped pull me in.**Pretty clean book. There ended up being 2 f-words near the end, that I honestly almost would have used myself in that situation, LOL. There is also a time when a couple has sex but there is not detail given. You just know it happens."}, {"userName": "Megan Culkin", "userReviewDate": "Jul 01, 2010", "userURL": "http://www.goodreads.com/user/show/1323718-megan-culkin", "userReview": "As a fan of the Big Stone Gap books, I was eager to read more by Adriana Trigiani and quickly devoured this book. Set in New York's Greenwhich Village during the 1950s/ 1960s the book is narrated by Lucia Santori, the only daughter and youngest child of a large, boisterous Italian family.The book begins rather slowly although it quickly picks up speed and is easy to read.Once again, Trigiani has a knack for vivid imagery and selecting appealing adjectives that bring out the best of the story's characters and setting.Although Trigiani successfully creates another cast of colorful, memorable characters,this books is less straight forward than Big Stone Gap and addresses issues that were rather taboo in the 1950s/ 60s such as career women, premarital sex and pregnancy, breaking ethnic traditions,and women's rights. While the Big Stone Gap series is about loving yourself and your community and finding your place in the world, which everyone can relate to, this book appeals to a more narrow audience and is about dealing with loss, heartache and grief with family members so it does not end as rosily as the Big Stone Gap books. Still, fans of Trigiani should read this to note how the author has grown based on changes in her own life and writing."}, {"userName": "Michelle", "userReviewDate": "Jan 23, 2009", "userURL": "http://www.goodreads.com/user/show/1824225-michelle", "userReview": "This book started strong, and kept me going through the middle. It is a believable tale of a close Italian family and a passionate young Italian girl. The family goes through all kinds of life changing events together, and I love how they all react and then move on together. Then, the book takes a left turn from normal, good and bad life events and starts just beating the hell out of the main character, taking away everything that she cares about, and then letting her live for others and not be able to follow her own dreams-for the rest of her life! The author's weak attempt at giving the character happy ending with a date with her old, jilted ex boyfriend does not even start to make up for it. Also, the character is a career-oriented, ambitious girl in a time when that was uncommon. Making her end up alone, unmarried and unable to do anything but care for her sick family member for 20+ years just looks like she is being punished for her progressive ideals. I give the first half of this book 4 stars, and the second half 1 star."}, {"userName": "Nataly", "userReviewDate": "Feb 01, 2008", "userURL": "http://www.goodreads.com/user/show/222437-nataly", "userReview": "I Love all the story wraped nicely by the story of someone that at first barely noticed except as an old lady who's always dress nice and wearing long jacket everywhere she go. Lucia is the only daughter in an Italian/American family in the 1950s. She's an accomplished seamstress and works in a famous department store in New York City. She also happens to be engaged to her childhood sweeheart and is stunned to learn that her family expects her to quit her job and stay home to help her future mother-in-law and prepare to have children. Remember - this is the 1950s. Lucia calls off her engagement and begins to lead the most interesting life in the world of fashion. She wants to be a carrier woman in the 1950's. she wants woman to be equall to have a job like a man. The author drew strong characters and I particularly love reading about Lucia's friendships and relationships with her family. Good read! I really enjoyed!"}, {"userName": "Nancy Steinle gummel", "userReviewDate": "Feb 08, 2014", "userURL": "http://www.goodreads.com/user/show/12968957-nancy-steinle-gummel", "userReview": "Lucia, Lucia by Adriana Trigiani is a poignant story about early Italian immigrants to our great country. It tells of life, it's trial and tribulations along with the joys and sorrows in their lives. A super religious family centering around the Catholic Church. It begins with Kit Zanetti, a hopeful playwrite. She knows of her upstairs neighbor Lu but in typical New Yorkers style you don't want to get too close. So it comes as a surprise when Lu invites her upstairs for tea. Kit is ready to refuse but then changes her mind telling her she'll be up at 4:00. What ensues is a charming tale of life in the 1950's a little after World War II."}, {"userName": "Angie", "userReviewDate": "Jul 06, 2015", "userURL": "http://www.goodreads.com/user/show/1494253-angie", "userReview": "3 stars? 3.5 stars? Somewhere in that rangeNot sure what to say about this book. Lucia's priorities, at least initially, were different from mine. That caused me to sort of think a tiny bit negatively about her. She ended up growing on me even though I didn't always enjoy her decisions and choices. Parts of the story were sad and hard to hear about. I did really enjoy the clothing descriptions and the talk about the department store and the changes it underwent over time. I liked the Italian family dynamics and the descriptions of New York and Italy. This is the first book I've read by Trigiani. I have Shoemaker's Wife on my kindle already and will read it."}, {"userName": "Rachel", "userReviewDate": "Feb 06, 2009", "userURL": "http://www.goodreads.com/user/show/385683-rachel", "userReview": "I don't think 40 plus years working in a department store is happiness. The book focuses on the happy/sad events of one or two years of life, with the mink coat symbolizing that time. Lucia even says that she wears the coat because it is her life's story. Life isn't about a short time with decisions that decide the future. The future is chronically changing because of our decisions--even in our middle age. The writing kept me reading the book, but it lacks the personal values I hold as a person."}, {"userName": "Emily", "userReviewDate": "Dec 09, 2007", "userURL": "http://www.goodreads.com/user/show/424266-emily", "userReview": "I couldn't put this book down--I absolutely loved it. Lucia is a wonderful protagonist, and one with whom I completely related. The setting of the book is completely engaging, and I believed all the characters. Didn't love the bookend framing technique set in present day, but the rest of the book was so good, I was able to overlook it."}, {"userName": "Dorothy", "userReviewDate": "Feb 05, 2009", "userURL": "http://www.goodreads.com/user/show/1783217-dorothy", "userReview": "Lucia, Lucia provides a picture of first generation Italian family life in New York's Little Italy from the 1950's to the present. Anyone who is Italian will recognize the stay at home mom, the family deli that is owned and operated by her father and her four brothers. Then there is Lucia, a hardworking, independent, woman who is ahead of her time. Her independence is partly due to her father's support of her way of conducting her life. ( I loved him.) After all, Lucia is twenty-five. For all intensive purposes, she should be married with children. Her mother can't wait to throw the lavish wedding reception and the onset of grandchildren.  Lucia has other ideas. She wants to have a career. She already is the best seamstress at B. Altman's. She has the benefit of working with and for Delmarr an up and coming designer who appreciates her talent. She has a fiance who looks like Don Ameche, and she has saved $7,500. What could be the problem? That's where the \"curse\" that had been cast on her comes into the picture. ( So, what else is new?) It seems her father's brother's wife is the evil fairy who put the mal occhio ( evil eye ) on her when she was born. \"Yes, Lucia, will be the most beautiful girl in Greenwich Village, but she will be unlucky in love.\" Her nemesis comes in the guise of John Talbot. He steals her heart, her money, and her virginity. But does he end up with Lucia as the prize?  Guess what? I'm not telling you. Read the book.Note: Trigani adds Italian recipes and fantastic descriptions of the fashions of the time period."}, {"userName": "Mary Carlomagno", "userReviewDate": "Apr 10, 2018", "userURL": "http://www.goodreads.com/user/show/4632057-mary-carlomagno", "userReview": "Adriana captures my heart again with the tale of Lucia Sartori, a fashion forward Italian living in New York's Greenwich Village in the 1950s. Who doesn't love a career girl story centered around family, friendship and love? I thoroughly enjoyed this romantic page turner. The characters were real, relatable and charming. The Italian family drama is captured beautifully. My only complaint is that I lost some beauty rest so that I could finish it!"}, {"userName": "Louise", "userReviewDate": "Mar 19, 2009", "userURL": "http://www.goodreads.com/user/show/2143983-louise", "userReview": "WOW!! A compelling and bittersweet novel. This is the fourth book of Trigiani's that I've read and she has become one of my 'favourite' authors. I didn't want this story to end!!From back cover:\"It is 1950 in glittering, vibrant New York City. Lucia Sartori is the beautiful twenty-five-year old daughter of a prosperous Italian grocer in Greenwich Village. The postwar boom is rife with opportunities for talented girls with ambition, and Lucia becomes an apprentice to an up-and-coming designer at chic B. Altman department store on Fifth Avenue. Engaged to her childhood sweetheart, the steadfast Dante DeMartino, Lucia is torn when she meets a handsome stranger who promises a life of uptown luxury that career girls like her only read about in the society pages. Forced to choose between duty to her family and her own dreams, Lucia finds herself in the midst of a sizzling scandal in which secrets are revealed, her beloved career is jeopardized, and the Sartoris' honour is tested.\"I can hardly wait to read her 5th novel \"The Queen of the Big Time\"."}, {"userName": "Imas", "userReviewDate": "Aug 03, 2011", "userURL": "http://www.goodreads.com/user/show/2834317-imas", "userReview": "Gambaran kehidupan warga keturunan Italia di Amerika. Lucia Lucia memikat saya..ehm, tak menyangka menarik hati. Kisah cinta Lucia, perempuan muda Italia di New York, bekerja sebagai penjahit untuk baju-baju pesanan yang eksklusif dan dikerjakan dengan tangan. Bukan hanya kisah cinta yang ada di buku ini.Didalamnya juga perdebatan soal perubahan peranan perempuan yang tidak hanya pada urusan domestik. Dalam hal ini peranan perempuan Itali ditengah masyarakat Amerika yang sudah melewati pergolakan itu. Pada buku ini kita sedikit tahu Kebudayaan Italia, ternyata orang Italia juga ngga sama semua kebiasaannya. Tapi pada dasarnya mereka berorientasi pada keutuhan keluarga, kehidupan relijius dan ekspresif. Entah kalau sekarang, karena latar belakang cerita pada era tahun 50-an. Selain itu, juga ada perkembangan industri dunia dan perubahan industri manual menjadi massal, pabrik menggantikan manusia dan cerita-cerita dibalik industri fashion. Eh ada resep masakan juga lho..."}, {"userName": "Kristina", "userReviewDate": "Sep 26, 2010", "userURL": "http://www.goodreads.com/user/show/2040736-kristina", "userReview": "This was such a fun book to read! The author is an Italian-American and writes about Italian-American characters in her stories set in NY. This particular novel was set in the 1950s (it begins as modern-day, flashes back to 1950 for 2/3 of story, then back to modern-day again). I have read several other books by this author and notice a number of similar themes throughout her stories: Italian-American family, trips back to homeland of Italy, fashion-oriented, strong female lead, late to marry, \"doesn't need a man\" attitude/troubled love life, close-knit family values, set in NY, etc. Anyway, she is a great writer and has a wonderful way of creating enjoyable stories worth reading. Definitely recommend as a Goodread."}, {"userName": "Stacy", "userReviewDate": "Jun 16, 2015", "userURL": "http://www.goodreads.com/user/show/1393059-stacy", "userReview": "The visual images in this book were so elegant and amazing. The story is bittersweet, but I love the descriptions, the very fifties ideas and attitudes, as well as the very Italian attitudes. I did want Lucia to find the right person - I knew it wasn't Dante or John. I'm glad for the closure she receives at the end, and the way she reacts to the closure. I love her friends and her family, in spite of their faults. They are realistic, not idealized. I find myself disappointed by her nephews."}, {"userName": "Yvonne", "userReviewDate": "Oct 29, 2016", "userURL": "http://www.goodreads.com/user/show/11842663-yvonne", "userReview": "Very interesting and enjoyable book!"}, {"userName": "Susan", "userReviewDate": "Jan 01, 2012", "userURL": "http://www.goodreads.com/user/show/2458153-susan", "userReview": "This story was a little unbelievable. Being who she was, I don't think Lucia would have gotten engaged to Dante in the first place. I also don't think, if she was who I thought she was, she would have stayed with John Talbot right until he dumped her. To have so many doubts and, over and over, push them aside? She doesn't seem that stupid.A few other critiques of the main character:I think Lucia is a strange character. Consider this:Every morning when I hop off the bus at Thirty-Fifth Street and Fifth Avenue I am still awed by the fact that I have a job at the best department store in New York City (21).She's excited to work at a department store?\"Yeah, but don't you love Sunday night knowing the next morning is Monday and you get to come to work?\" (79)No. I like my job, but I wish Sunday nights were longer.On my way home from work that night, as I cross Fifth Avenue, I turn and look back at B. Altman's and burst into tears. The happiest days of my life have been in that building and now everything is changing. (237)Whose happiest days have been spent at work?I can't say that I like her, either, or maybe (as I already mentioned), I just don't like the story:I wonder what will become of me. (107)The author makes sure the reader understands that Lucia is beautiful, so very beautiful. Also, she was engaged to the most eligible bachelor in the Village. Am I supposed to feel sorry for her? (A few paragraphs later, the handsome, handsome man she has recently met happens to drive by and offers her a ride home -- oh please.)One more thing: All Lucia cares about (besides her family and friends) is her job. The whole book is, \"I love my job!\", \"I love my job!\", \"I love my job!\" I’m all for women having jobs/careers and I'm all for women being independent and I probably used to think more like Lucia (I still wanted to work while raising a family), but now that I'm getting older, I'd really just love to raise a family full-time, and then maybe go back to work later. I guess what I'm saying is that I don't understand Lucia because I'm not very much like her.Overall: a little too unbelievable for me.(Am I being overly critical?)PS: I do love the cover."}, {"userName": "Sterlingcindysu", "userReviewDate": "Jul 09, 2010", "userURL": "http://www.goodreads.com/user/show/946086-sterlingcindysu", "userReview": "This is the first book I've read of Trigiana's and I'll be putting her others on my TBR shelf. She really caught the atmosphere of the clothes, 1950s Greenwich village, big Italian families, food, everything to do with the senses. No happy ending here, which made it much more realistic to read. (copied review) Set in the glittering, vibrant New York City of 1950, Lucia, Lucia is the enthralling story of a passionate, determined young woman whose decision to follow her heart changes her life forever.Lucia Sartori is the beautiful twenty-five-year-old daughter of a prosperous Italian grocer in Greenwich Village. The postwar boom is ripe with opportunities for talented girls with ambition, and Lucia becomes an apprentice to an up-and-coming designer at chic B. Altman’s department store on Fifth Avenue. Engaged to her childhood sweetheart, the steadfast Dante DeMartino, Lucia is torn when she meets a handsome stranger who promises a life of uptown luxury that career girls like her only read about in the society pages. Forced to choose between duty to her family and her own dreams, Lucia finds herself in the midst of a sizzling scandal in which secrets are revealed, her beloved career is jeopardized, and the Sartoris’ honor is tested.Lucia is surrounded by richly drawn New York characters, including her best friend, the quick-witted fashion protégé Ruth Kaspian; their boss, Delmarr, B. Altman’s head designer and glamorous man-about-town; her devoted brothers, Roberto, Orlando, Angelo, and Exodus, self-appointed protectors of the jewel of the family; and her doting father, Antonio. Filled with the warmth and humor that have earned Adriana Trigiani hundreds of thousands of devoted readers with her Big Stone Gap trilogy, Lucia, Lucia also bursts with a New York sensibility that shows the depth and range of this beloved author. As richly detailed as the couture garments Lucia sews, as emotional as the bonds in her big Italian family, it is the story of one woman who believes that in a world brimming with so much promise, she can—and should be able to—have it all."}, {"userName": "Ruth", "userReviewDate": "Jun 07, 2014", "userURL": "http://www.goodreads.com/user/show/1248980-ruth", "userReview": "In 1950, Lucia Sartori is the most beautiful girl in Greenwich Village, New York. She is a talented dressmaker at an exclusive store, but is expected to give up her job to get married and become a housewife. However, Lucia has other ideas, and is determined to be as independent as possible. That is until handsome and charismatic John Talbot comes into the store and sweeps her off her feet. Lucia falls hard and falls fast, but she and John have several obstacles to overcome, not least her very traditional family.I always enjoy Adriana Trigiani’s books, and this one was no exception. The story is bookended by two short chapters set in the modern day, when an older Lucia tells her story to her young neighbour. Personally I thought the book would have been better without this framing device, as the ending (of the whole book, rather than the ending of the story of events in the 1950s) seemed a bit contrived, but I really enjoyed the main body of the story.The character of Lucia was developed well, as were those of her family and friends, especially her boss Delmarr, who I particularly liked. It was interesting to read about Lucia’s life in a large Italian immigrant family, and to understand her conflict between what was expected of her, and what she wanted to do with her life. There were a number of twists and turns which I did not expect, and Lucia’s story did not end the way that I expected it to, but was better because of it. However, without wanting to reveal any spoilers, Lucia did make a decision towards the end of the book, which seemed to undermine decisions and plans which she had made earlier, which was something of a shame, although it was probably understandable under the circumstances.It is a cosy and undemanding tale, and perfect for curling up with on the sofa. If you are a fan of Adriana Trigiani or such books, you won’t be disappointed."}, {"userName": "Emma Craven", "userReviewDate": "Aug 06, 2015", "userURL": "http://www.goodreads.com/user/show/29041747-emma-craven", "userReview": "I really need to stop reading Adriana Trigiani's books at work. It's becoming harder to deny that the tears are just from wearing my contacts for too long of a time.“The good things that happen to us were meant to happen, and the bad things that happen are lessons meant to teach us to be better.” Another beautiful story by Trigiani.The characters, the culture, the love, the heartbreak. I really can't get enough.This is the second novel written by Trigiani that I have read. I really appreciate her way of writing and her ability to take a predictable situation and turn it into something you don't expect; most of the time by taking it to the extreme. One theme really stuck out to me in this book: Quality over quantity, be it in life or in product. The world that Trigiani paints always sucks me in and doesn't let me go. I wish I could enter the double doors of B. Altmans and let Lucia, Ruth, and Delmarr drape fabric over my body and work their magic. There is just something about a homemade dress that you can't replace with a manufactured piece.I had minor problems with this book:1. The framework that the story took place inside, unnecessary and boring.2. Sometimes the writing mimicked the thoughts of a child, short and out of place.But like I said, minor problems."}, {"userName": "Veronica Widya", "userReviewDate": "Nov 22, 2010", "userURL": "http://www.goodreads.com/user/show/1641058-veronica-widya", "userReview": "well,, i cant say that i love this story. Because even its happy ending, Lucia dont have much happiness in her life. But i can say that this book is amazing! The writer is brilliant! i love how she tell about the family story in 1950's, and about the cultures. Like they still have strong religion, still lived with their parents til they married and also how they must keep her virginity til they married. Its really good story. Even it sounds ancient to the western, but believe it or not it still exist in eastern. lols. im asia and im still doing it. not by force, but because we want to. ;)And how Adriana gives the recipes in her book and tell the story smoothly is really works for me. i really like it. Lucia is different, she dont want to be like the other girls. She want to be independent, but she cant reach her dream. sounds pity but actually she was doing good by take care of her mom. And also when she thinks that the curse is happen to her, i think its not the curse. it just her mindset. she think that she got curse, so its happen. she broke Dante, and when Dante ask her back she dont want, so she is the one who make the decision. she can married if she want.but lucia is really nice girl, i like her character very much. and the story is touching. :)"}, {"userName": "Lormac", "userReviewDate": "May 18, 2010", "userURL": "http://www.goodreads.com/user/show/3743024-lormac", "userReview": "Okay, so you receive a box - handcarved of the finest wood with an intricate inlaid design, studded with gems and traced with gold filgree. The box is exquisite, and you are so excited to see what amazing gift it will contain. You lift the lid and find a silver bangle bracelet - nice enough, but certainly not equal to its container. That is how I felt about \"Lucia, Lucia.\" The setting promises you a wonderful treat, but the plot is fairly ordinary. Even so, the book has a lot to recommend it. The author sets her story in New York City in the early 50s, chock full of Packards, debutantes, custom dresses and cocktails at the Waldorf. The characters are true to the times as well, in both their actions and dialogue, and Trigiani succeeds in moving the story line right along. Unfortunately, the plot is hampered by the fact that you have met Lucia as an elderly woman in the first chapter so when she starts to tell her life story, you know how the book will end. The book's best feature, in my opinion, is the depiction of the limits placed on young talented women - well, actually, women in general - in the post-war years. Plus I loved the descriptions of B.Altman's which was a store I remember visiting in my childhood."}, {"userName": "Vickie", "userReviewDate": "Apr 10, 2016", "userURL": "http://www.goodreads.com/user/show/11300847-vickie", "userReview": "I have just finished listening to Lucia, Lucia by Adriana Trigiani and I loved it!!! The author has done a wonderful job with this novel, giving the reader a wonderful view into live in a NYC Italian-immigrant family beginning in the 1950's. Lucia, Lucia written by Adriana Trigiani is not great literature, nor is it incredibly well-written. It is, however, a nice peephole into the time period. Lucia, the main character of the story loves her job as a seamstress for one of the finest department stores in New York--and she is terrific at her job. Lucia Santori is a woman living before her time. She is a seamstress for custom designs at B. Altman in NYC. She wants it all: her career, a man to love her, and family. Does it end up this way for Lucia? Read the book to find out. I loved the concept of an early feminist! BTW, there are several intense emotional scenes. I was crying during one of them while I was sitting in NJ traffic (think US 1 around Princeton) and a lady in the car next to me offered me a Kleenex!!!Go Cards! L1C4!!"}, {"userName": "S.C. Skillman", "userReviewDate": "Jul 26, 2013", "userURL": "http://www.goodreads.com/user/show/5099958-s-c-skillman", "userReview": "This is the first novel I've read by Adriana Trigiani (it was recommended to me by family members). I found the novel beguiling,and it perfectly evoked the life of an Italian family in 1950's New York, as well as the world of fashion in the Custom Department of a sophisticated department store. I loved the characters Trigiani describes, particularly her colleagues in B. Altman's, and her description of the holiday in Italy was sensuous.I followed Lucia's story with a mixture of amusement and recognition. As she describes her relationship with the handscome and apparently wealthy John Talbot, and her expectations of marriage to him,I found myself thinking she was very materialistic in her attitude, and sensed that it was too unreal and 'perfect',and that things would go wrong. Nevertheless, the unravelment of her hopes and dreams was described in a way I found very touching. Several philosophical moments throughout the story helped me to identify more with the heroine and her life-experiences.One line particularly struck me: \"Once a curse comes true, it's over. It's over, right?\" says Lucia to her uncle. \"Si, si, finito, finito,\" he replies.The story has a lovely twist at the end, too, which I found truly uplifting."}, {"userName": "Deb (Readerbuzz) Nance", "userReviewDate": "Jul 25, 2009", "userURL": "http://www.goodreads.com/user/show/1654645-deb-readerbuzz-nance", "userReview": "I absolutely loved this story!  With a few minor changes, Lucia could have been  my mom.  A compelling theme to me in a story is an  exploration of what could have been.  Lucia, Lucia is a story that touches on that theme.  Lucia is the most beautiful girl in  Greenwich Village and the only daughter  in an Italian Catholic family. She longs  to be a career woman yet she also loves  the close ties of her family. The book  begins with Lucia as an elderly woman,  telling the story of her life to a young neighbor.  What will happen to Lucia? Will she choose to  marry the handsome young Italian boy next door  or will she pick the suave rising business man?  The end of the book left me in tears; I'm a sap  for lost chances and missed opportunities.  Much better than any of the Stone Gap books;  I recommend this book."}, {"userName": "Summer", "userReviewDate": "Apr 03, 2017", "userURL": "http://www.goodreads.com/user/show/1450256-summer", "userReview": "I liked this book. However, I think I liked the character of Lucia the least. It might be because of her decisions in general, but I think it's more that I've made similar mistakes, and while thankfully I think I've learned from most of them, she didn't seem to, until it was too late. Also, I may be crazy but it felt achingly similar to a 50s/Italian version of Sex and the City!! Even the main guy being named John and picking her up while walking home in his car... it just made me laugh."}], "description": "It is 1950 in glittering, vibrant New York City. Lucia Sartori is the beautiful twenty-five-year-old daughter of a prosperous Italian grocer in Greenwich Village. The postwar boom is ripe with opportunities for talented girls with ambition, and Lucia becomes an apprentice to an up-and-coming designer at chic B. Altman's department store on Fifth Avenue. Engaged to her childhood sweetheart, the steadfast Dante DeMartino, Lucia is torn when she meets a handsome stranger who promises a life of uptown luxury that career girls like her only read about in the society pages. Forced to choose between duty to her family and her own dreams, Lucia finds herself in the midst of a sizzling scandal in which secrets are revealed, her beloved career is jeopardized, and the Sartoris' honor is tested.", "title": "Lucia, Lucia", "url": "http://www.goodreads.com/book/show/60057.Lucia_Lucia", "average": 3.93, "cover": "https://images.gr-assets.com/books/1388342036l/60057.jpg", "reviews": 1396, "authors": [{"url": "https://www.goodreads.com/author/show/9219.Adriana_Trigiani", "name": "Adriana Trigiani"}], "type": ["Fiction", "Historical", "Womens Fiction", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/13127599-the-shoemaker-s-wife", "http://www.goodreads.com/book/show/58822.Big_Stone_Gap", "http://www.goodreads.com/book/show/52471.Big_Cherry_Holler", "http://www.goodreads.com/book/show/3673357-very-valentine", "http://www.goodreads.com/book/show/6673171-brava-valentine", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/28353727-in-twenty-years", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/20552595-how-i-became-a-famous-novelist", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats"]}