{"ratings": 13062, "userreviews": [{"userName": "Nancy", "userReviewDate": "Dec 01, 2010", "userURL": "http://www.goodreads.com/user/show/3122452-nancy", "userReview": "My Take: This book is a tricky one to review. Tricky because Anita Shreve is an incredibly gifted writer. Her style is unique and her voice clear. But this book was not interesting to me. Summary: Small town young man saves trashy but sexy drunk stranger. Before developing any kind of meaningful relationship with her, they have a quick wham, bam, and thank you ma'am. And then some more. And then she announces she's pregnant. She's still trashy and he (Webster, the protagonist) gives up his dreams because now he's going to be a daddy.Baby comes. It's a girl. Honeymoon phase and everything's peachy. Did I mention that Sheila, the new mother is trashy? The history on her is vague and sparse. Essentially, hard childhood, one living sister, Sheila learns how to play pool and thus hustle. Angry men losing to a hustling woman, history of a bad relationship with a cop that she owes money to and she's a drunk. Oh, and she's still trashy. And a drunk.Fast forward into Rowan's teenage years. She's struggling and may not get into college because... wait for it... she's a drunk. Webster is single parenting because Sheila is gone. That particular conflict is described. Bottom line: Sheila is a trashy girl and a drunk. Catalyst = Webster finding Sheila and then a big drama regarding Rowan. The story was just uninteresting to me. Shreve details the life saving techniques EMT's use every day. Interesting but not interesting enough to comprise so much of the book. The story of Sheila, Webster and Rowan is incomplete. The past 15 years is summed up in one paragraph for Sheila. Who is Sheila? I have no idea. Webster is a little more developed but, by the end of the book, I still didn't even know him. Rowan is a confused teenager who may be a drunk. Maybe she's trashy, too.Writing style is clearly Shreve. She writes well. It's just not a story I cared about. Language is moderately offensive. Just in case you missed it, Sheila is a trashy mystery. And a drunk. Sex is limited but random. If you love Anita Shreve, you'll like the book. I like Anita Shreve. I feel nothing for the story."}, {"userName": "M", "userReviewDate": "Feb 13, 2011", "userURL": "http://www.goodreads.com/user/show/13167-m", "userReview": "Shreve is a mixed bag. I really liked a book of hers (Pilot's Wife), then picked up an awful one (Wedding in December), and would've sworn off her altogether except I then ended up really loving another one of hers (Testimony), then couldn't even get through her recent one (The One Where They Are on a Mountain) - anyway that all being said I was in a rush to find SOMETHING to read (step it up, goodreaders, I am short on recommendations!) and so I just went for it.Well, it's pretty bad. The novel is about a man named Webster (this is actually his last name but for some reason that's all he's called) who is a paramedic and while he's off being a hero he saves a woman who nearly got herself killed by driving drunk (how charming) and because she's beautiful Webster ignores the fact that there is absolutely nothing else to recommend her and decides, as per the author's request, to fall madly in love with her. Pretty quickly. And stupidly. They have a kid and get married, in that order, and SHOCKINGLY the marriage begins to fray. Also pretty abruptly. Sheila, the incredibly unlikable woman, gets back into drinking. Webster, the sap, refuses to fall out of love for her and proves himself to be even duller and less interesting than he appeared initially.Eventually Webster has to ask Sheila to leave, though she does so quite willingly, but of course Webster will always blame himself (really? what's the loss here? and she nearly killed her daughter so, yea) and then Rowan, the daughter, is just about perfect until she decides she's supposed to alcoholic too.I guess this was supposed to be a book about rescuing - ie, Shreve weaves her story against the backdrop of seemingly unrelated missions Webster goes on as though I am watching ER and having a soap opera story alongside a lot of sirens. Well, it worked well enough on TV, here it was just irritating and distracting. And rescuing as a theme is pretty lame. And then there's the painful writing:\"He wipes a spill of water with the ail of his cotton shirt. He'll stick it in the laundry when he goes upstairs. He has on the beat up slippers Rowan gave him two Christmases ago. They have fur inside and are too warm for this time of year. He'll have to find his boat shoes.\"Seriously?? Did I need this? This book was a combo of me thinking, 'well that was fast' and 'thanks for sharing' and 'ok, we get it, she's nasty/he's nice/this is sad/this is meaningful.'Shreve - you disappoint. Somewhere you decided to trade in talent for mass production ala Piccoult. Blech."}, {"userName": "Georgina", "userReviewDate": "Jul 10, 2011", "userURL": "http://www.goodreads.com/user/show/1719653-georgina", "userReview": "My least favourite Anita Shreve. I am happy to read books about small lives,with small stories, ( I loved, and understood the thinking behind, 'Something Happened', for example)but this was too small. Whilst I appreciate any avoidance of a narrative driven by unlikelihoods and exaggeration, I just couldn't 'get' why this particular story had been written. The blurb in my edition used the word 'seismic' to describe events. My seismograph must be unplugged as I detected nothing other than the constancy of the mundane world. The characters' personality traits are not so odd, their passion not so great, the course of their lives not so meandering, or interesting, the rescue(s)not in any way profound, unusual, or worthy of depiction. I was left wondering whether Shreve researched the fascinating and potent world of emergency medical response, but didn't quite know what to do with it. I did enjoy finding out for myself, (as we are not told) the meaning of many acronyms."}, {"userName": "Jonetta", "userReviewDate": "Jun 12, 2011", "userURL": "http://www.goodreads.com/user/show/4876540-jonetta", "userReview": "Peter Webster is a rookie paramedic when he pulls a young woman, Sheila Arsenault, from her totaled car. She's obviously inebriated but Peter falls for her instantly. Soon they are involved in an intense love affair and Sheila becomes pregnant. They marry and baby Rowan is born. All along, Peter was aware that Sheila never really stopped drinking. But, when Rowan is two, Peter is called to the scene of an accident involving Sheila and another driver. She was driving under the influence and both Rowan and the driver of the other car are injured. Peter tells Sheila to leave and she does, with charges against her for drunk driving and the injuries.Peter raises Rowan by himself and all goes well until her senior year in high school. Rowan begins drinking and is on the brink of going in the same direction as her mother when Peter seeks out Sheila to come help her daughter.This is a curious story where the premise seems to be that Peter has a rescue complex, or at least that's what the author is attempting to posit. I don't ever feel that case is built by the story...Peter just seems to be desperately in love with a woman who is looking to be rescued. Throughout, Peter seems to be the one making the tough decisions, sacrificing a lot to raise his daughter as a single parent. I couldn't find a redeeming quality for Sheila and that's because the author failed to provide any texture for her character.It's an interesting story but one that left me perplexed. I didn't understand the point and it is quite melancholy."}, {"userName": "Lee Anne", "userReviewDate": "Jul 03, 2012", "userURL": "http://www.goodreads.com/user/show/6751321-lee-anne", "userReview": "I was glad this book was over when I turned the last page, but I was extremely unhappy with the way I felt about the characters. I gave it two stars because I did read it in one afternoon, trying to find out what the big secret was that the book flap hinted at. I didn't give it three stars because I still don't know.I felt I knew more about Webster, the main character / father / husband, and his skills as a medic than I did as a person. What made him want to pursue this girl who was selfish enough to drive drunk? Her \"glossy\" hair? And forget getting pregnant; I cringed at the thought of his not using a condom on general where-has-she-been-before grounds. I mean, seriously?And why did Sheila get involved with such a man with a plan? One or two statements about him being safe didn't convince me that she wanted to try domesticity. Rowan's personality change wasn't explored well enough for all the hints that were dropped about it, either. Again, one or two comments about learning she was an accident did not flesh out this storyline. Her friends' allowing her to get in trouble again after being so upset the first time rang false to me as well. Helping afterward was great, but where were the questions about why she was drinking in the first place? Why were they at such a dangerous place at that time of night? Why let some unnamed boy exert so much influence over your girlfriend? Someone Tommy's size could have put Rowan in the back seat and taken her home, or somewhere. I know we needed drama, but have it make sense! And the audience at graduation applauding the scar on her head? Really? I just don't know what the point of this book was. That they could have been a family if Webster had acted differently? Oh, that's right; the mom would have gone to jail! They probably would still be paying lawyers and damages rather than college tuition. Can you tell I'm frustrated after reading this book?! I couldn't stand Sheila or Rowan, and I had no respect for Webster. I think I'll go back to a Shopaholic book. I need a book with some wisdom and common sense in it."}, {"userName": "Darci", "userReviewDate": "Jan 29, 2012", "userURL": "http://www.goodreads.com/user/show/1308232-darci", "userReview": "This book would have been more accurately titled if they'd gone with \"Don't Bother\". Sometimes I like to read brain-candy books, which is where Anita Shreve comes in. I came expecting no literary work, but this book??!! Truly, it is a stupid book. Unfortunately, it's an easy enough read that I didn't stop reading it altogether, but this is one of those books that I finished and thought, \"Someone actually PUBLISHED that?!\" Not because it is smut. Not because the main characters are unlikeable. It's just dumb. One of my pet peeves is when an author spends 5 pages with a detail that has nothing to do with anything. This STORY could have been told in about one chapter, and instead it felt like she wanted to try out all the EMT-type language she gathered in research. But silly details are the ones that would remain. Like the fact that this EMT guy drives around in a car that's a re-commissioned police car. I know of not one single self-respecting EMT that would do that. And the fact that a father tells his almost-grown daughter that she \"hurt her noggin\" is just ridiculous from so many angles. And the fact that he helps his wife who is being charged with a crime get away from the scene (and then never explains that one to the authorities) is also dumb. On one hand, I can't believe i wasted my time on this book; on the other hand, it was like watching a train wreck... it just got worse and worse as the pages turned. So so, bad..."}, {"userName": "Cheryl", "userReviewDate": "Feb 24, 2011", "userURL": "http://www.goodreads.com/user/show/1109680-cheryl", "userReview": "I would have rated it just a single star, but I feel the need to reserve that for books that I truly can not stand, not books that I just found dumb and boring.Rescue is the story of a young paramedic who responds to a car crash. He finds a woman who has managed to run her car off the road and into a tree. A drunk driving incident. Sounds like a catch doesn't she. Webster, the paramedic, peruses her, she ends up getting pregnant and they marry. The marriage unravels and Webster is left to raise their young daughter.Problems: The woman Shelia does not have a single redeeming quality. She is stubborn, rude, and just plain proof that some people should never have children. I have no problem with having a troubled character, but give her something that makes me feel for her, or identify with her. Webster is totally boring and flat. There is no depth to him at all. I truly did not care how any of this would turn out. I am starting to wonder if Anita Shreve has ever had any happiness in her life. I'm done with her novels."}, {"userName": "Mary Gramlich", "userReviewDate": "Nov 25, 2010", "userURL": "http://www.goodreads.com/user/show/4213407-mary-gramlich", "userReview": "RESCUE by Anita ShreveNovember 30, 2010 - Little, Brown & Company - Hardcover, 288 pagesISBN-13: 9780316020725Can you save someone else from their demons?Peter Webster was 21 when he literally saved Sheila Arsenault’s life. His EMT team was responding to the call for medical assistance and they met. While these were less than ideal circumstances a relationship was formed and Sheila grabbed on with both hands to Webster’s lifeline. Webster had the one and only thing Sheila craved – normalcy.Sheila comes with excessive baggage to the relationship but Webster ignores it all and falls in love despite the huge problems. They have a daughter, Rowan and Webster prays that this will bring Sheila to her senses and have her stop the spiral of destruction she keeps putting herself into. But with all hopes and dreams this one for Webster is short-lived and he takes the matter of caring for his daughter in his own hands. Sheila cannot be a mother and a drunk and when he made her choose it left Webster alone to raise Rowan.Life seemed ideal until Rowan hit 17 and beyond the regular adolescent angst Rowan turns angry toward him and Webster is powerless to figure out why. He reaches out to Sheila who has been gone for 15 years and the timing could not have been better as Rowan has found herself in a situation even an EMT can’t save her from. Will Sheila being back help or hurt the life Webster has made he doesn’t know but for Rowan any risk is worth taking.This book is one that forces the reader to do self-examination in that it makes you think “what am I willing to risk for the sake of my child”. More than likely it is everything and we are of course accepting of what the casualties this decision might bring. Anita Shreve always writes thought provoking books but this one hits home because we all at some time have to decide whether we are a help to another person or an enabler. After you answer that question, what do you do after that?"}, {"userName": "Rebecca", "userReviewDate": "Jan 02, 2013", "userURL": "http://www.goodreads.com/user/show/5677208-rebecca", "userReview": "This is a story of a young EMT man who falls in love with a patient of his following an accident as a result of her drunk driving. The story starts in the present and then takes the reader back 18 years to give the reader the opportunity to understand how it is just Webster and his daughter Rowan we read about in the beginning. I am a huge fan of Anita Shreve because of the way she is able to write characters vividly and entwine the reader with their every emotion. This book does not fail or disappoint in the department. Whilst the story is not incredibly original in the sense that Webster is a man that loves to 'rescue' both as a career and in her personal life; and eventually the drinking leads to an accident that endangers the life of 2 y/o Rowan - resulting in Sheila (mother) being sent away - the honesty of the emotions and reasons for them having to be done is breath taking. Anita does not shy away from the hardships of making such a decision and how is later impacts on a 17 y/o Rowan. The truth of the story is so compelling that it is evident that Anita did her research and found the statistics of what a child's life could look like if dealt with similar cards. I only rated it 4 stars because of the over the top happy ending e.g. leaving the reader to believe that Sheila and Webster may reunite after many years of separation - to me this was a bit too unreal - in my opinion to continue to stay closer to the truth - anger and hurt would have been more present in their story. However, I can accept that for Rowen and to help her recovery this reunification may be essential. Nonetheless, the story is beautiful, honest and moving. Excellent read."}, {"userName": "Barbara", "userReviewDate": "Dec 02, 2010", "userURL": "http://www.goodreads.com/user/show/1883816-barbara", "userReview": "Much to my frustration, this is the second review that I am writing about this book. Despite my instructions to  SAVE  ,the first has vanished into cyberspace.I enjoyed reading Anita Shreve's most recent contribution, but I have found others that she has written more satisfying. I will not create any \"spoilers\" here. Further plot descriptions are readily available elsewhere. Shreve's narrative skills are evident and she has created a degree of tension, but the novel did not require that the reader formulate any deep analysis. She is adept at her character studies, with realistic individuals clearly displaying their distinctive qualities. The title,  Rescue , refers to Peter Webster, the main character, who is an EMT. It also alludes to the many ways which he and others make decisions and seek personal inviolability. I felt immediately drawn to this serious and dependable young man. He is conscientious and efficient in his work and sensitive to families and friends of the ill and injured.Probably because of my medical background, I found the episodes about emergency medical care interesting and accurate in their details. Many involved suspenseful outcomes.It was pleasant to visit rural Vermont here in this story. The countryside, mountains, climate and people rang true and vividly throughout."}, {"userName": "Julia", "userReviewDate": "Nov 15, 2010", "userURL": "http://www.goodreads.com/user/show/1532455-julia", "userReview": "I have loved most of Ms. Shreve's books. I was so looking forward to this one. Can I be honest? I thought it read like a Harlequin. (O.K., i've only read 1 Harlequin for a Book Club experiment.) The entire story was just so corny. Most of Shreve's books have an edge to them that keeps me intrigued. This one was so different. For instance, Webster is a young 21 year old EMT. He responds to an accident where the victim, a young women is unconsious and has a metal something stuck in her stomach and is bleeding profusely. Webster immediately falls in love with her and like 3 days later, he is f.....ing her under the moon on the frozen ground outside. Really? She was nearly dead at the accident and yet seemed to heal pretty quickly. And is that really love, or is it something else. I am willing to be convinced otherwise...."}, {"userName": "CC", "userReviewDate": "Feb 22, 2011", "userURL": "http://www.goodreads.com/user/show/1892060-cc", "userReview": "I've got mixed feelings about this one. The writing started out as the lovely sort of tone and flow that Anna Quildlen can do, but then veered into obvious, on-the-nose dialogue and plot points that led the book into melodrama worthy of Nicholas Sparks. At 23, Pete Webster, working as an EMT, rescues a drunk Bostonian (named Sheila) from a car accident. Though she's an alcoholic (and pool hustler?) and he exists in a Mayberry sort of world in Vermont, he inexplicibly falls in lust. She gets pregnant on purpose and they get married. She continues drinking, gets in another accident, and under his urging, flees the state rather than face criminal charges. Thus, she abandons their daughter. Fast forward fifteen years later, Webster suspects their seventeen year-old daughter, Rowan, is \"going off the rails.\" Why? Because she went to a party and HAD TOO MUCH TO DRINK ONCE. He then reads her diary, where she questions her mom's absence. So after fifteen years, Webster travels to Boston and finds Sheila. You know, just like that. And, lo, Sheila hasn't had a drink for ten years. Also, she's become a gifted painter. The fact that very few artists, much less painters, can make a living from their work seems to bear no matter in this tale. Around here is where it lost me, really. Rowan gets drunk again. She falls, busts her head, and becomes comatose. Webster tells Sheila and she comes running to Rowan's bedside. Rowan wakes, has a chat with her newly discovered mom, and all's well. They all go to Rowen's graduation. Of course, even though Rowan was conveniently \"failing all her classes\" a mere twenty pages prior, she's magically taken her finals in her hospital bed and yes, she's headed off to college come fall. Cue a singing of Kum-bah-ya here...I think this book pissed me off because some of the early chapters were really quite good (I debated between two or three stars). They were vivid and held no easy solutions. Shreve can write, it's almost like she chose not to in certain places. Also, there was an odd lack of character development. In alternating chapters, Webster goes about his daily work as an EMT (all episodic, with no arc) but there's nothing else to show who he is. He didn't date anyone in fifteen years? Didn't have a best-friend? Have a hobby? Buy a dog? Take a long drive in the country? Anything? He's just sitting around, waiting for Sheila to return? Gah!!!"}, {"userName": "Ms.pegasus", "userReviewDate": "Aug 21, 2011", "userURL": "http://www.goodreads.com/user/show/5015851-ms-pegasus", "userReview": "There are brief moments of perfect balance in life. Looking at your sleeping children, nestled with your spouse, having a beer with your friends.... You wish you could freeze that perfectly ordinary, perfect safe moment of contentment forever. But life moves on. We make choices, relationships change, and mortality moves from the abstract to the concrete. RESCUE moves in and out of such moments. It opens with a rural Vermont EMT and his daughter, a high school senior, at breakfast. The EMT is Webster (referred to by this surname) and his daughter is Rowan. No mother is present, and we quickly feel the tension as Webster tries to deal with the moody temperament and guarded privacy of an adolescent daughter. In flash-back, Webster's relationship to Rowan's mother, Sheila, is recounted. Like his parents, the reader is both happy and apprehensive for him. At that moment, Webster reflects: “Their time together had been a secret....[he] was afraid that something precious was in jeopardy now....He longed to be back in that moment in the B and B, stroking Sheila's arm before she woke up.” Webster is a quiet, methodical presence. As an EMT he is well-rehearsed in the mindset of triage. Shreve uses this fact as the tacit structural foundation for the course of her novel. She alternates the reflections on Webster's family life with vignettes of rescue calls. Webster, himself, tries to separate these two parts of himself: He removes his EMT uniform when he comes home: “He didn't want any part of his job to touch the baby. Taking off the uniform was a way of putting aside one life and taking up another.” Yet, the two lives define him, and the trajectory of the book demonstrates how the two parts will come to fit together. I was attracted to this book by the EMT context, and in this respect it does not disappoint. We view the disciplined relationship between Webster and a trainee, the camaraderie with his seasoned partner, the teamwork that goes into a multiple injury rescue scene, and the acronyms Webster uses to hone his reflexes in each emergency. Structurally, this book is a gem. More difficult was the contrast of stoicism and decisiveness that defined Webster."}, {"userName": "Karah", "userReviewDate": "Aug 07, 2012", "userURL": "http://www.goodreads.com/user/show/1258160-karah", "userReview": "While Anita Shreve is usually an author I can count on, I was not a fan of this book. Part of it may have been that I listened to this book on CD and wasn't thrilled with the reader. His voice and intonations were all wrong-- and his inability to pull of a Boston accent made some of the dialogue tough to listen to. But aside from the narrator, I just didn't love the story. It followed the life of a young EMT, who falls in love with a beautiful young woman he meets on an accident scene one night. They have a brief love affair that results in her pregnancy and then attempt a marriage together. Of course, it doesn't work out and he ends up raising their daughter on his own. Years later, the two connect again and the daughter has an opportunity to meet her mother. The two don't have an instant connection, but do end up developing a relationship with each other. While I think there was a lot of potential for this book, it just falls flat. Too much time was spent in the beginning of the book with the \"relationship\" of Webster and Sheila--that is obviously not going to work out. I was also slightly annoyed with the lengthy descriptions of his EMT scenes that had nothing to do with the story. It's as if Shreve had to toss in some extra scenes to make the book count as a book. Overall, I was not impressed with this book and wouldn't recommend spending your time reading it. In fact, had I not been killing time while driving, I don't think I would have even finished it."}, {"userName": "Kaci", "userReviewDate": "Jul 04, 2011", "userURL": "http://www.goodreads.com/user/show/1708644-kaci", "userReview": "I went to the library looking for a different book that they didn't have, so I picked up this one instead. When this first came out earlier this year it was everywhere. It seemed like I couldn't walk into a book store without seeing a thousand copied of this book in some kind of pyramid-shaped display. So the book stuck in my head and when I saw it on the shelf, I decided to give it a try. I don't really know how to review it other than to say it was okay. It kept me entertained, I didn't begrudge the fact that I had to sit down and read it. I wanted to read it. It's just that I don't really understand all the hype around it when it was released. It was good, not great. the characters were believable. The plot was not action packed but moved at a pace that seemed natural and true to what was happening. I'm not sure I would recommend it. There are so many books out there. I think I would rather read something I feel more passionate about when the book is done. Right now I just feel like I will forget this one soon and want to start the next book in my summer series titled - reading adult books and loving it!"}, {"userName": "Marcy Sue", "userReviewDate": "Jul 11, 2011", "userURL": "http://www.goodreads.com/user/show/5583246-marcy-sue", "userReview": "I was drawn to this book by the promise of a well written EMT based novel. It was as fair an interpretation as a writer with no personal EMS history could write. Even in a small town, the coincidence of our protagonist being on the scene for both accidents involving his daughter seemed repetitive and almost beyond belief. I wanted to like this book more. I wasn't expecting the dark cloud to be constantly present. Some burst of a sunlit uplifting scene could have made all the difference instead of constantly waiting for the next dangerous curve in the path that is Peter's and then Rowan's life. Sheila's pull seems to drag down the story line even when she is absent, or especially so. My review is 4 stars for the effort the author put in to try and capture small town EMS. I just wish it had more of a pulse. I would have liked to see more of the dynamics that happen in an EMS environment; smelled the coffee and the dread when a call comes through that the crew knows it is going to be a bad call."}, {"userName": "Daniel Parsons", "userReviewDate": "Jul 26, 2011", "userURL": "http://www.goodreads.com/user/show/2215912-daniel-parsons", "userReview": "My first Anita Shreve book, which I picked up in a Wal Mart in the middle of nowhere and only because there was nothing else that caught my attention, and it wont be my last. The adage of never trusting a book by its cover rings true here; the pastel colours and pseudo-enigmatic photo badly representing the taught, addictive and emotive story held within. The characters of Paul Webster, his doomed romance with the almost (crucial, that) unlikeable Sheila and their daughter Rowan are recognisable human beings. Though the book is told from Webster's POV Sheila and Rowan are also layered characters and the narrative, which jumps half-way through, is utterly compelling. Though there are perhaps a couple too many coincidences that veer it a little too close to contrivance, Rescue remains a thought provoking, intelligent and compulsive book with a hopeful, unsentimental conclusion (which I believe is unusual for a Shreve novel since the author states in a Q & A that most of her books finish on a downer or shock twist). I will be back for more."}, {"userName": "Leigh", "userReviewDate": "Jul 12, 2011", "userURL": "http://www.goodreads.com/user/show/734622-leigh", "userReview": "This was a pleasant surprise for me. I used to read Anita Shreve's novel but got bored with them after a few (Fortune's Rocks, Testimony, etc). I was curious about this book since I knew it was her latest and saw a gentleman reading it while we were completing jury duty. This novel is a love story, a story about obssesion, about your first crush/romance, and about the trials of being a single parent. Webster is raising his daughter Rowan when a deibilitating accident brings his ex-wife back into the picture. Although most of the drama takes place towards the end of the novel I was quite surprised by the turn of events and the ending. Shreve is an established writing having been an Oprah Book Club Pick back before the drama. However, she continues to prove herself as a writer who knows her characters and the struggles they face in normal circumstances."}, {"userName": "Amy", "userReviewDate": "May 20, 2016", "userURL": "http://www.goodreads.com/user/show/1710557-amy", "userReview": "This is the first book by Shreve I've read in a few years, after being disappointed by a book or two. This one had the story-telling and writing I like and expect from her, and the complex relationships that happen in families. It also gave a good picture of life as an EMT. From reading the cover flap, I knew that a mother who'd abandoned her child and husband would come back, but just how that abandonment occurred, and what caused the contact after 15 years, was much more dramatic than I'd anticipated. I think this has gotten me over my Anita Shreve avoidance."}, {"userName": "Elizabeth Sulzby", "userReviewDate": "Dec 06, 2010", "userURL": "http://www.goodreads.com/user/show/4174950-elizabeth-sulzby", "userReview": "Shreve is always a good read, with high human interest, I thought. Alas, on p. 163- of 288 pages, I wrote in the margin: Show me, don't tell me to death. Shortly after that point, the story focus began to move to the current time. The ending action was well executed and should have grabbed my heart, but it just didn't. And the ending came so abruptly and with such a letdown. Perhaps it was my mood, but not for those first 163+ pages. There is a lot of detail about the work of EMT's, but too much of it, as well, was delivered by recitation of the 17 years of the past."}, {"userName": "Ann", "userReviewDate": "Mar 28, 2016", "userURL": "http://www.goodreads.com/user/show/6199930-ann", "userReview": "2.5 as enjoyed the descriptions of EMT and ER scenes. Hadn't read any of Shreve's works since \"The Pilot's Wife\", saw this book by her and picked it up solely on the basis of who wrote it. Must say it kept me a trifle more than mildly entertained, mostly because of it's medical content and my admiration for the EMT and his loyalty to his daughter who he raised as a single dad. Overall, neither the story nor the characters were very memorable."}, {"userName": "Rachael", "userReviewDate": "Aug 05, 2012", "userURL": "http://www.goodreads.com/user/show/11598012-rachael", "userReview": "I liked this book. I enjoyed that it was down to earth and focused on some of life's real issues. Believe it or not, there are not actually demons, vampire and witches taking over the unsuspecting humans. ;) Even though I do enjoy those books as well."}, {"userName": "Nancy Brady", "userReviewDate": "May 05, 2017", "userURL": "http://www.goodreads.com/user/show/2870158-nancy-brady", "userReview": "Rescue, an apt title...from one rescue to another, this is a story full of rescues. When young EMT Peter Webster rescued Sheila from a crash fueled by alcohol, it set off a chain reaction of rescues. Instantly smitten with Sheila, he not only rescues her, but they become involved. When she gets pregnant, they marry and have a daughter Rowan.Briefly, life is wonderful for the new family until Sheila gets in another alcohol-induced accident, this time with two-year-old Rowan in tow. Decisions are made, and Webster sends Sheila away, preferring to rear Rowan as a single parent.Through the years as an EMT, Webster experiences many rescues in his position, but whenteen-aged Rowan acts out, and has her own issues with alcohol, there will be another rescue. Sheila eventually returns, but will there be any resolution for Rowan? For Sheila? For Webster? Ultimately can this family be rescued?"}, {"userName": "Audrey", "userReviewDate": "Nov 18, 2017", "userURL": "http://www.goodreads.com/user/show/6053755-audrey", "userReview": "Anita Shreve has a style very much like Stephen King'd--totally transparent--although her subject matter is different. Her bailiwick is family and she's really skilled at drawing complex, believable portraits of relationships between parents and children, husbands and wives. \"Rescue\" follows a couple from their chance meeting (he's a young paramedic who rescues her from a car crash) to their lives eighteen years later when circumstances put them in an unimaginable and painful situation. Shreve does a nice job of maintaining tension in the way she tells the story. And her research is impeccable. I learned a lot about emergency rescue work!"}, {"userName": "Corrie", "userReviewDate": "Apr 18, 2017", "userURL": "http://www.goodreads.com/user/show/11207648-corrie", "userReview": "Like many readers, this was not my favorite book by Anita Shreve. I liked the story-line and the paramedic terminology. I liked the characters as well, but some of the dialogue felt a little flat and not true to the characters."}, {"userName": "Denise", "userReviewDate": "Sep 30, 2017", "userURL": "http://www.goodreads.com/user/show/7644644-denise", "userReview": "This book was so simple, trite and predictable! Why would anyone read books like this? If you want something so mindless, you might as well watch TV, it would be more visually stimulating, at least. Don't waste your time on this."}, {"userName": "Debbie Marinelli", "userReviewDate": "May 26, 2018", "userURL": "http://www.goodreads.com/user/show/17604221-debbie-marinelli", "userReview": "I had never read an Anita Shreve book but had always wanted to. Since her death I decided now was the time. This was a quick book and an enjoyable read. The book was about love, responsibility, regret and addiction. I was not disappointed and am ready to start my next Shreve book."}, {"userName": "Leslie", "userReviewDate": "Nov 28, 2010", "userURL": "http://www.goodreads.com/user/show/1840662-leslie", "userReview": "Peter Webster, a young EMT trainee, rescues a woman from a terrible car accident. Sheila Arsenault is young and beautiful and troubled. She is running away from her problems and was drunk when she crashed her car.Peter was instantly attracted to Sheila. He visited her after the accident to see if she was alright and even though he knew it was probably not something he should do he continued to see her. It wasn’t long before they became involved in a passionate love affair and Sheila became pregnant. Soon they were married and raising a baby, but Sheila’s drinking and destructive ways did not end. Peter could not trust her with the baby, Rowan, and so he told her she had to leave.Fast forward to the present and Peter is raising a rebellious teenager on his own. He was so busy working to earn enough to provide a good life for Rowan he didn’t notice she had changed from a sweet young girl to an angry teenager. A teenager that is now drinking, engaging in risky behavior and making Peter second guess his decision to raise her by himself.As in all her books, Anita Shreve makes us think. This time it’s about family and choices, honesty and consequences. Peter and Sheila seemed all wrong for each other. As I read I kept asking what, other than the physical affair, does he see in her. Perhaps as an EMT trained to help people he thought he could ‘save’ her. But I found it odd that later, when she continues to have problems and needs his help and support, he abruptly gives up rather than try and convince her to go into rehab. He sacrificed his marriage for what he thought would be best for his daughter.The book was very readable; quick and easy, the type of story you could breeze through in one sitting. It wrapped up quickly; not a bad ending but I was wanting a little more. While I liked the book it was not my favorite Anita Shreve novel. And that’s not a criticism, because she has too many great books to compare it to. Perhaps it was the subject matter that I didn’t find as interesting as some of her other books. In the end it was a little too “Lifetime TV” for me. However, I think many fans will thoroughly enjoy this one and it would make a great book club selection with many discussion possibilities."}, {"userName": "Diane", "userReviewDate": "Nov 06, 2010", "userURL": "http://www.goodreads.com/user/show/1390765-diane", "userReview": "As Rescue begins, Peter Webster, a paramedic in Vermont, is living with his seventeen year old daughter Rowan. Webster, is concerned about his daughter, her grades are slipping, she's drinking, rebellious, angry and distant. She has not been accepted into the college of her choice, Middlebury. Webster is reminded of earlier days when he met Rowan's mother.Eighteen years earlier when Webster was a new EMT, one of his first assignments was responding to a one-car accident involving a young woman, Sheila Arsenault. Sheila had been driving drunk and crashed her car. Hospitalized and in serious condition, she recovers from the accident, but doesn't seem to learn her lesson about drinking. Webster can't seem to stop thinking about Sheila, and the two immediately begin a physical relationship. When Sheila quickly becomes pregnant with Rowan, the relationship moves into high gear, even though Sheila has just escaped from an abusive relationship. Webster and Sheila marry, and Rowan is born soon after. Sheila is not prepared for the stresses of motherhood, and she begins sneaking alcohol. When her drinking results in an accident, that could have threatened the life of the couple's toddler, Sheila is sent away to avoid jail time, and Webster raises his daughter with the help of his parents. A crisis year's later, sends Webster searching for Sheila.I was afraid of giving spoilers as I wrote this review, but then realized that the product overview gives away quite a bit of the sparse plot. I thought the title was perfect as Websters job involves \"rescues\", and he tries to do the same for the women in his life. The story was a quick read, and for me there really were not any surprises or plot techniques that made this story anything more than an average read for me. Having read ALL of this author's works, my favorite books of Shreves are still: Eden Close, Strange Fits of Passion, Resistance, and Testimony. This is one of those books that fans need to experience for themselves and decide. I do hope you like it. RATING - 3.5/5 stars"}, {"userName": "Monica", "userReviewDate": "Jun 02, 2012", "userURL": "http://www.goodreads.com/user/show/2128705-monica", "userReview": "Rescue is a book about a man named Webster and his life as an EMT. The beginning is in the present with him and his 17 year old daughter. The second part is 18 year earlier. This is when you learn all about how Webster became a father.Webster is an EMT and him and his partner get a call. The call is for a single automobile accident. The woman involved in the accident is drunk and Webster is drawn to her. He thinks about her and follows up on how she is after the incident. The woman is named Sheila. She is an alcoholic but Webster is blinded by love.I found the story interesting but at the same time parts of it bothered me. After Webster and Sheila are married and their daughter Rowan is born, Sheila starts drinking again. Webster gets Sheila to go to AA and thinks things will be fine. One day Webster and his partner get a call and when they arrive the accident involves Sheila, drunk and with Rowan in the car. Sheila will go to jail because this is her second DUI. I didn't like the fact that the cops, and his friends let him know and that they let her leave before they are going to pick her up. I know that it was that way so that the story would be the way it was. I just felt that if that happened in real life the husband would be accused of letting the criminal escape and would be sent to jail too.That was the only thing I didn't like. I recommend reading the book and forming your own views of the story."}], "description": "A rookie paramedic pulls a young woman alive from her totaled car, a first rescue that begins a lifelong tangle of love and wreckage. Sheila Arsenault is a gorgeous enigma--streetwise and tough-talking, with haunted eyes, fierce desires, and a never-look-back determination. Peter Webster, as straight an arrow as they come, falls for her instantly and entirely. Soon Sheila and Peter are embroiled in an intense love affair, married, and parents to a baby daughter. Like the crash that brought them together, it all happened so fast.Can you ever really save another person? Eighteen years later, Sheila is long gone and Peter is raising their daughter, Rowan, alone. But Rowan is veering dangerously off track, and for the first time in their ordered existence together, Webster fears for her future. His work shows him daily every danger the world contains, how wrong everything can go in a second. All the love a father can give a daughter is suddenly not enough.Sheila's sudden return may be a godsend--or it may be exactly the wrong moment for a lifetime of questions and anger and longing to surface anew. What tore a young family apart? Is there even worse damage ahead? The questions lifted up in Anita Shreve's utterly enthralling new novel are deep and lasting, and this is a novel that could only have been written by a master of the human heart.", "title": "Rescue", "url": "http://www.goodreads.com/book/show/40193580-rescue", "average": 3.31, "cover": "https://images.gr-assets.com/books/1527006949l/40193580.jpg", "reviews": 1709, "authors": [{"url": "https://www.goodreads.com/author/show/3530.Anita_Shreve", "name": "Anita Shreve"}], "type": [], "outlinks": ["http://www.goodreads.com/book/show/5191.The_Pilot_s_Wife", "http://www.goodreads.com/book/show/89399.Fortune_s_Rocks", "http://www.goodreads.com/book/show/14965.Light_on_Snow", "http://www.goodreads.com/book/show/228534.The_Weight_of_Water", "http://www.goodreads.com/book/show/3121162-testimony"]}