{"ratings": 3197, "userreviews": [{"userName": "*TANYA*", "userReviewDate": "Aug 28, 2017", "userURL": "http://www.goodreads.com/user/show/29049556-tanya", "userReview": "I really, really loved this story, it was incredible. A beautiful book of friendship, love, and forgiveness. And the author did an incredible job at narrating the book!!"}, {"userName": "Jenny Jo Weir", "userReviewDate": "Sep 01, 2017", "userURL": "http://www.goodreads.com/user/show/34570157-jenny-jo-weir", "userReview": "Read this book!!! You will not regret it. I loved it from the very first word to the very end. It's beautiful and inspiring. Worth every minute of your time. I am for sure going to be reading more of Andy's books after this one."}, {"userName": "Gigi", "userReviewDate": "Sep 28, 2012", "userURL": "http://www.goodreads.com/user/show/3195007-gigi", "userReview": "I started this book by Andy Andrews on my 46th birthday. My friend took me to lunch and I asked her to swing by the library to pick it up. I read the subtitle to her: A Story of the One Principle That Frees the Human Spirit. Do tell! I responded with sarcasm. While that statement is a tall glass of water, it delivers a thirst-quenching story of forgiveness. Andrews writes, \"Where is it written that for one person to forgive another, the offender has to approve it, accept it, or even know about it? Not to forgive means we yield ourselves to another person's control - another person's governing values and his attitudes and actions. We are forced by someone else into sequences of act and response, of outrage and revenge, and you know what? It always gets worse. Our present, when we refuse to forgive, is endlessly overwhelmed by the past.\"Later, \"Forgiveness frees the forgiver.\"This beautifully-worded biblical principle is brought to life by a story. A story, Andrews says, came to him from the earth. This story that demanded a telling captured his life for weeks, even months. And you know what? It has captured mine. I am stunned by the fact that I struggle to extend mercy when such colossal mercy has been extended to me. Yet, I do. I struggle at times. This story gives me one more dimension in the facets of forgiveness. I want to be free. Do you?"}, {"userName": "Radostina Gencheva", "userReviewDate": "May 03, 2018", "userURL": "http://www.goodreads.com/user/show/3598957-radostina-gencheva", "userReview": "\"Ако простиш нечия грешка, ти решаваш никога повече да не и позволяваш да определя чувствата ти. Така я обезоръжаваш и дори да я помниш, тя вече не може да ти влияе.\"Предубеждения: притча, която едни истини за живота ще ги навира в лицето и за други ще се наложи да се дълбае надълбоко; претовареност с цитати; корицата навява идеята на бозава любовна история;Последни впечатления: корицата излъга, за което не съм разочарована; хареса ми личната част от живота на Андрюс, с която подлага началото на романа и накрая отново с лично обръщение го завършва щастливо; все още не съм разгледала дали историята е вярна, но снимките едва ли ще са фалшификат- Втората световна война си е била напълно истинска и е съвсем възможно възникването на такава ситуация; имаше идеята за любовен романс, но беше лек, ненатрапчив или безумен- по-скоро наблегна на важността за прошката и последвалотото разбирателство и удовлетвореност между двама души; сюжетът си имаше своите военна част с подводници, командири, нацисти и \"Енигма\", градска част с кафене, шериф и възрастно загрижено семейство и последната част на тяхната свръзка; колкото до идеята за прошката, наблегната от автора, хареса ми, че хората, които \"проповядваха\" колко важна е тя за душевния мир на човек, до край устояха на думите си и доказаха, че разделението на добри и лоши не влияе, когато човешкото в човек трябва да вземе решение."}, {"userName": "Daniel Butcher", "userReviewDate": "Sep 09, 2010", "userURL": "http://www.goodreads.com/user/show/4262278-daniel-butcher", "userReview": "The Heart Mender by Andy Andrews presents two compelling and engaging stories. The first story, which consists of parts 1 and 3 of the book, tells the story of Andrews’ discovery of World War II German U-Boat artifacts in his Gulf Coast yard and his own personal journey to uncover the origins of how these items got into his yard. The second story details the ramification of a chance encounter between Josef a German submariner who becomes separated from his German U-Boat while patrolling the Gulf of Mexico during 1942 and Helen a woman deeply hurt by personal loss leading to anger with God and everyone she is in contact with. Their story is one of grace and ultimately forgiveness allowing each to gain a fresh start on life. I started this book expecting it to read much like Andrew’s The Traveler’s Gift which used an interesting story to present a number of principles. Instead, this book uses both stories to underscore one valuable lesson, the power of forgiveness and the freedom it gives the forgiver. The book itself and both stories within it are engaging. This combined with the fact that the story is based on real people, made it difficult for me to keep from peeking to the end of the book and where they are now section or searching the internet for information about U-166, Josef’s boat. The story of Josef and Helen combine elements that both men and women will enjoy, giving the reader images of both U-571 and The Notebook as they race through the text. If Andrews’s goals were to entertain and provide a valuable lesson about forgiveness, he has achieved his desire. The Heart Mender is a release of Andrews’ Island of Saints, which he notes had a vocal but small audience. This rerelease will hopefully expose more readers to this engaging tale. Review Copy provided by Thomas Nelson"}, {"userName": "Donna", "userReviewDate": "Dec 22, 2016", "userURL": "http://www.goodreads.com/user/show/13244359-donna", "userReview": "3.5 stars.Historical Fiction is a genre I have always enjoyed and I've come to enjoy WWI & WWII HF a lot. This was a story that was different then the run of the mill type WWII fiction stories. I always appreciate that and the author's creativity. This was kind of a sweet story, but that isn't such a bad thing when dealing with the ugliness of war. There were some things glossed over with this book, but I think the author stayed focused on the story he was unfolding without clouding the big picture. So 3 stars."}, {"userName": "Nancy", "userReviewDate": "May 31, 2010", "userURL": "http://www.goodreads.com/user/show/3122452-nancy", "userReview": "I'm pretty sure this is going down as one of my favorite books. I absolutely loved it!Andrews weaves a story of finding German WWII artifacts buried in a can on his ocean front property and Josef and Helen's journey to find peace and forgiveness. Andrews offers photos of buttons, a couple of photographs, a ring, and a medal he found digging up the roots to an old tree. He then seeks to find the story for these items being deposited on the beach.What he discovers is really quite shocking. German U-boats were always present in the waters serving the American soldiers, including the Gulf of Mexico. During the war, much debris washed up on the shores from U-Boat carnage. They submarines shot all ships they could to smithereens. There were, however, a number of Germans rather than Nazis. They asked the crew to please exit the vehicle, blew it up, then approached the life boats to offer canteens of water and directions to the nearest landfall.Apparently, this is documented to be true.Also true is that some of the soldiers chose to be listed as \"Missing In Action\" or presumed dead rather than return to Germany where Adolf Hitler reigned his horrors and there was nothing to return. They integrated into society, although not without some help, I'm certain.This is the story of Josef, a German, and Helen, a widow. The story is incredibly well told and draws the reader into a believable realm. Told with empathy, the journey of Josef's and Helen's hearts is hopeful. Both have suffered great loss. Both learned how to forgive and relinquish to God.Loved it."}, {"userName": "Jesseca Wheaton", "userReviewDate": "Feb 17, 2016", "userURL": "http://www.goodreads.com/user/show/39986158-jesseca-wheaton", "userReview": "WOW! I loved this book so much!!! I seriously had no idea if I was going to like it. I saw it at our library used-book-sale shelf, and decided to give it a try. (You can't beat $0.50 for a hardback!)It was so good! It took me a little while to get into it, and the writing seemed a little slow but the story was amazing! Also, there seemed to be more telling than showing, but it didn't really bother me at all. It was just hard to wade through some of it. ;) But the ending was just .. ahh!! I can't say anymore or I will spoil the book!If you enjoy WWII history, then you'll definitely want to check it out!"}, {"userName": "Joanna", "userReviewDate": "May 26, 2018", "userURL": "http://www.goodreads.com/user/show/64440843-joanna", "userReview": "What?!?! Is this story actually true?! If it is, and I want to believe it is, then truth really IS stranger than fiction. 😆 Thoroughly enjoyed this book, the message of forgiveness very powerful... forgiveness is not really forgetting as much as it is letting go... God’s name was used rather freely at times; I would have preferred the author use more carefulness. Fascinating read, and hard to put down once you get into it a little."}, {"userName": "Jaymie", "userReviewDate": "May 19, 2017", "userURL": "http://www.goodreads.com/user/show/6089695-jaymie", "userReview": "I listened to this book and really enjoyed the authors voice as he narrated. I loved the story about second chances and the love story of it all. However the romance was a bit lacking. I loved the forgiveness in this book and the two sides it came from. Very interesting story about subs in U.S. Waters. War is so crazy and unpredictable."}, {"userName": "Elizabeth Buckner", "userReviewDate": "Jun 01, 2018", "userURL": "http://www.goodreads.com/user/show/76034980-elizabeth-buckner", "userReview": "It was mind blowing to me that this is a true story. I had never heard about German uboats in the Gulf of Mexico. Super interesting read!! The message of forgiveness was very good too. Highly recommend!"}, {"userName": "Ariana", "userReviewDate": "May 20, 2017", "userURL": "http://www.goodreads.com/user/show/2359497-ariana", "userReview": "I actually listened to this book and really enjoyed it. I LOVED the author's reading voice. It made it all the more enjoyable hearing this story. A sad story but yet endearing."}, {"userName": "Jo-Anne Puggioni", "userReviewDate": "Oct 31, 2011", "userURL": "http://www.goodreads.com/user/show/6832651-jo-anne-puggioni", "userReview": "The Heart Mender by Andy Andrews tells the story of two broken lives on opposite sides of enemy lines during the second world war in 1942. During this time German subs or u-boats are in the Gulf of Mexico to sink U.S. vessels and also carry goods and fuel. It was interesting reading about this part of US history that I hadn't heard about before.A woman who was widowed due to the war discovers a wounded German soldier on the beach one night. These two lives are thrust together by circumstances, and the book tells the story of how they came to forgive and eventually fall in love. I wanted to love this book. I really did. But I didn't. I loved aspects of the book, but overall - it lacked something. It had all the makings of a great story, but the story did not grab my attention. I found myself forcing myself to read it to finish the review- not because the story captivated my attention. On saying that, I loved the message of forgiveness woven throughout the story. I just found the dialogue a little too cliché.You will love this book if you love a good old fashioned love story. You will love this story if you love learning about periods in US history that are not common knowledge. You will love this book if you have experienced the power of forgiveness in your own life. You will love this book if you have not experienced the power of forgiveness, but want to know more about moving past hurts in in your own life.http://www.princesswarriorlessons.com..."}, {"userName": "Margaret", "userReviewDate": "Apr 07, 2015", "userURL": "http://www.goodreads.com/user/show/4098759-margaret", "userReview": "At first it took a bit to get into the story, a fairly good romance and WW2 themed story based upon real events located in Alabama. It was fun to hear the names of towns that I have been to and especially Robertsdale where my sister lives. Of course the location helped with my enjoyment of the book. I did feel that the book itself had a very clear storyboard from beginning, the middle of the book was the most intriguing and then the slow decline to the end, a little too predictable for me. I think if anything the message of forgiveness is the power of the book, overall still worth reading."}, {"userName": "Rachael Burrows", "userReviewDate": "Aug 22, 2013", "userURL": "http://www.goodreads.com/user/show/15983014-rachael-burrows", "userReview": "Absolutely powerful book on forgiveness. I have read so many books about WWII and this was another perspective of that time period. I have a growing collection of WWII books (about 150...and those are not counting all the ones on my kindle). I keep reading trying to understand the \"why's\" of Hitler's Germany. Not all Germans were Nazis...I would love to meet Josef and Helen in person. Andy Andrews...you told this tale in a very moving way. It truly has taught me about the power of forgiveness.."}, {"userName": "Anna", "userReviewDate": "Aug 31, 2014", "userURL": "http://www.goodreads.com/user/show/3995760-anna", "userReview": "C-H-E-E-S-E, that spells The Heart Mender. This story could have been so much better, one of those \"based on a true story\" novels. But instead it's a self help book with a theme that's crammed down your throat and with possibly the worst dialogue I've ever read."}, {"userName": "Christine", "userReviewDate": "Oct 13, 2017", "userURL": "http://www.goodreads.com/user/show/1531508-christine", "userReview": "So interesting!"}, {"userName": "Magpie67", "userReviewDate": "Feb 21, 2017", "userURL": "http://www.goodreads.com/user/show/987948-magpie67", "userReview": "I loved this book because it taught me a history lesson, it showed me true love and reasons to forgive. Another title, where it became informative to details not shared to the American public and a loss of lives before we were officially in the war. I was shocked when I finished chapter two. A damn shame too! A title for all to read and be astounded at the historical facts and a real story about a man and a woman who fell in love during a tragedy. Both had lost and both had everything to gain with each other. Who would have thought a dying wax myrtle tree would bring about events that otherwise would have gone unnoticed forever. A small box filled with relics and an era of google information at the finger tips plus an author who began a search for the truth or at least an understanding of what was buried so long ago. I am constantly reminded that there is so much more to our history than dates of battles during wartime or victory days. There are stories that need to be told and insights to all those affected during wartime. I did gain some perspective on forgiveness in this book. \"'Danny, forgiveness can occur only because we have been given the ability to make choices. We have the choice to forgive or not to forgive.... and nobody can make us do either one. You understand?' Danny nodded. 'We begin to forgive by choosing to forgive... by deciding, not by feeling. Our feelings don't lead us to forgive. Most times, our feelings lead us the other way. That's why a person has to decide to forgive first. Our feelings always follow along behind our decisions.'\"\"'Forgive and forget is not reality. It's not really possible anyway, which is a good thing, because it is not necessary. Forgiveness does not erase history or excuse what happened. What has happened, has happened, and nothing can erase the memory of it or its consequences. Forgiveness means relinquishment. It is that simple. Danny, do you know what relinquishment means? 'No, sir.' 'It means giving something up. To relinquish something means to give up whatever power it holds over us. If you forgive somebody for something he did to you, that means you choose to never again allow that event to determine how you feel or how you act or even how you treat that person. You may remember the wrong, but by choosing to forgive, you have disarmed it. Then it can no longer determine what you think, what you say, or what you do.'\"I hope everyone else covered up their spoilers... I choose not to mention the historical facts because I want others to read this book and learn what could have been, if one crazy leader had chosen another path during 1942/43. Utter chaos and a whole new history for the United States. In fact I'm not really sure why he chose just that mania as diabolical as he was? His ego was so great, I'm surprised he didn't surprise us on......... Read the book, it's worth it!"}, {"userName": "Dan Gobble", "userReviewDate": "Feb 05, 2016", "userURL": "http://www.goodreads.com/user/show/7286452-dan-gobble", "userReview": "Andrews' narrative offers insight into German U-Boat activities in American waters during WWII. Not much was reported on regarding the German Navy's attempt to disrupt shipping right here in our own waters, and in particular about how these U-Boats were refueled and supplied with food so far from Germany. Apparently there were people here in the United States who helped the German subs get food and fuel simply for the money. This was done covertly under the cover of darkness.Andrews also offers insight into German military personnel who were opposed to Hitler and who thought he was a madman/dictator. They were often forced into service, but many apparently refused to carry out malicious acts of war and were insistent upon following the Geneva convention on matters of honor on the battle field.Andrews weaves into this historical fiction narrative a theme of forgiveness. Several deep dialogues center on the topic of forgiving those who have hurt you. The message is presented in a way that all cultures and religious backgrounds can appreciate the words. The practice is difficult to embody but can radically change lives when anger is released, not just \"managed\" (one of Andrews characters points out the negative aspects of what people call \"anger management.\" This character basically says that by managing anger we keep it around and try to control it. But the character's advice is to let it go so that it no longer controls you or remains a part of the fabric of your being.)On a totally different note, the character Joseph gives an interesting political analysis (at the end of CD 3). Here's the quote:\"History tells us that a democracy is always temporary in nature. It simply cannot exist as a permanent form of government. . . . In 1787, Alexander Tyler, a Scottish history professor at the University of Edinburgh, noticed a continuing pattern in the advance and decline of the world's democracies. He stated then that a democracy would continue to exist until such time that the voters discover that they can literally vote themselves gifts from the public treasury. From the moment that revelation is made, the majority proceeds to vote for the candidates who promise the most benefits from the public treasury. The final result is that every democracy finally collapses due to loose fiscal policy. That collapse is always followed by a dictatorship.Tyler charted the ages of the world's greatest civilizations from the beginning of history, an average existence of about 200 years. Every single time these nations progressed through the following sequence:from bondage to spiritual faith;from spiritual faith to great courage;from courage to liberty;from liberty to abundance;from abundance to complacency;from complacency to apathy;from apathy to dependence;and finally from dependence back into bondage.\"This passage struck me very deeply. I feel like America has moved past the complacency phase and is mired in the apathy stage / dependence stage. The global economy has destroyed much of our manufacturing abilities and most of us have little to nothing to do with the food we eat. We have basically turned into a nation of consumers and our workplace has become an extension of the service sector of the marketplace. We need to take a serious look at repealing NAFTA and start putting high tariffs on imported goods and rebuild our local economies. The global economy has proved to be very destructive and it concentrates a lot of wealth in the hands of a very small group of powerful elitists."}, {"userName": "Jeff Lenhart", "userReviewDate": "Dec 29, 2017", "userURL": "http://www.goodreads.com/user/show/16019985-jeff-lenhart", "userReview": "This was a truly powerful book! It was hard to put down from the start!"}, {"userName": "Mimi", "userReviewDate": "Jul 30, 2012", "userURL": "http://www.goodreads.com/user/show/981011-mimi", "userReview": "This was an enjoyable book with many different parts to it. There was a theme of forgiveness throughout. There were interesting facts about German U-boats in the Gulf of Mexico during WWII. There was a historical fiction feel to it, and you're left not quite sure whether it is a true story or not. I enjoyed the story a lot more than the writing, and the story is definitely worth reading.\"Familiar with the place, I stepped from my vehicle and ventured over to the edge of the driveway to look at the famous Newman blueberry bushes. They were bare now, but in late spring would be loaded with the tiny, luscious fruit. And then would come the packs of kids, mine included, who picked from the bushes, stuffing more berries into their mouths than into the buckets they held. Neither of the Newmans ever ate a berry—stained their dentures, they claimed—but both of them watered and fertilized those bushes as if their lives depended on it.\"\"'There was a difference between a German and a Nazi,' Mr. Newman stated. The Kriegsmarine had a lot of Germans . . . not so many Nazis.' I frowned. Honestly it was not a distinction I had ever made. Noting my confusion and perhaps interpreting it as disbelief, the old man said, 'You see a difference between Americans and the Ku Klux Klan, don't you?' I nodded. 'Well, there you go.' I was silent for a moment, while he wiped his face roughly with his hand.\"\"To forgive wrongs darker than death or night . . . To love, and bear; to hope till Hope createsFrom its own wreck the thing it contemplates . . . Good, great and joyous, beautiful and free.—Percy Bysshe Shelley from 'Prometheus Unbound'\"\"Helen recalled Margaret's last question about her anger when she had at last regained her composure. 'How long do you intend to stay mad?' she had asked. What a ridiculous question, Helen thought as she turned onto her side. As if I have any say in the matter!\"\"There are no hopeless situations, sweetheart, only people who have grown hopeless about them. You still have choices you can make.\"\"Helen had began sobbing again and told the older woman that so many things had been taken from her that she feared anger was all she had left . . . that and pain. So why should I give up my anger? she thought. Then I am left with nothing but pain.\"\"Forgive . . . It is truly your only hope, honey. To forgive is to set a prisoner free—and discover the prisoner was you.\"\"We begin to forgive by choosing to forgive . . . by deciding, not by feeling. Our feelings don't lead us to forgive. Most times, our feelings lead us the other way. That's why a person has to decide to forgive first. Our feelings always follow along behind our decisions.\""}, {"userName": "Mike", "userReviewDate": "May 20, 2010", "userURL": "http://www.goodreads.com/user/show/2391772-mike", "userReview": "At the first glance of the cover of this book/story, the reader can gain some insight into what they will find inside. Is it a love story, a story of intrigue, a story of espionage, a war story, a story of a combination of two or more? These are the questions that each reader will have to decide for themselves.As I started my journey towards the story line and answers to the questions noted above, I was immediately captivated by the characters. What I especially liked was the initial part of the story, being told by and through the author himself. \"The Heart Mender.\" by Andy Andrews, takes us on a roller coaster ride of emotions and surprises. Just when you think you have a character pinned down, Andrews, throws another twist in the story.For me, this is apparently a true story which gives the reader an opportunity into finding out how World War II comes to America, and focuses on the Gulf of Mexico, around the area of Florida and Alabama. \"The Heart Mender,\" starts off by the discovery of strange items or should I say interesting and out of place items which compels the author to do research on the items and then find that he is being thrust into the past. This is where the journey and story starts, but by know means does it end where it begins. Helen and Josef, are the novel's main characters, but the story is filled with many characters which help to bring the story to life. Both Helen and Josef and searching for answers, yet neither of them is willing to admit this. Andrews also uses the great cast of characters to bring this story to the forefront our of minds. It also made me think about what was really happening in and around this country during World War II. This story is one which should prompt the reader to find out more about the time. It certainly give me cause to do more research into the war and my own area of the country. What I learned from this story is that when confronted with a situation or condition, things may not be as they appear. What we must do is to have faith and sometimes look beyond the apparent. Thank you Andy Andrews for writing this compelling story. It should cause any reader to stop and think. Do we really see what is there, or is there something else going on? This question can be asked in many instances. Andy you certainly know how to write a story that captivates a reader immediately."}, {"userName": "Darlene", "userReviewDate": "Mar 17, 2011", "userURL": "http://www.goodreads.com/user/show/1809697-darlene", "userReview": "This beautiful story takes place along the Gulf of Mexico and alternates between 1942 and current day. There are two stories being told and some very important life lessons being relayed in this book. The current day story involves the author, Andy Andrews and his discovery of some photos, buttons from a military uniform and some military medals... all buried in his yard in Florida.He begins an investigation as to how and why these items were buried in his yard seemingly forgotten. Just who was it that buried these very personal artifacts and what happened to him? The story goes on to answer all of these questions but I don't wish to give too much away.I am embarrassed to admit that I had no idea that German U boats routinely sank American ships off of our own coast line. I mistakenly though that the closest World War II came to the United States was the attack on Pearl Harbor... I was very wrong. I also learned from this story that there was a major distinction between German military personnel and Nazi military members. Being German did not necessarily make you a member of the Nazi Party OR a supporter of Hitler. This book revolves around one of those men who did not support the Fuhrer and describes what happened to him because he refused to accept the beliefs of a madman.His name was Josef Landermann and his story is about learning to not judge a group of people as one single entity and not painting them all with a broad brush. His story is also about forgiveness and how powerful it is to be able to forgive. The story of Josef Landermann is not one I will soon forget."}, {"userName": "Carol", "userReviewDate": "Mar 25, 2013", "userURL": "http://www.goodreads.com/user/show/3356446-carol", "userReview": "Last night, I read the last page of The Heart Mender by Andy Andrews. I was astonished by this true story. I kept thinking to myself that it couldn’t’ be true but it was! If it was fiction, it would be too incredible. The author lives on the coastline of where Alabama and Florida meet. He went outside one day to cut down a big bayberry tree. He was tried to dig up the roots and when he realized this was an impossible job, he hit his shovel on a restaurant sized can. He opened the can and found some buttons, an Iron Cross, and three pictures. One was of a man, his wife and their little baby in a wagon, another had Hitler in it. The author was wondering why some Nazi artifacts were buried in a can in his yard.Andy Andrews did lots of research on the mystery. He was amazed to learn that German U boats were in the Gulf of Mexico during WWII for purpose of sinking U.S. ships loaded with supplies for the war. I never heard of this before! In the second part of the book, the author put together all of his research in an incredible story of love, forgiveness and hope. The story is true but he changed the names of the people he was writing about at their request. The story starts on July 16, 1942 close to where the author lives. Josef Landerman, a school teacher who was called up for duty on a U boat. Alternating with that is the story of Helen Mason. She didn’t have a father that she knew and her mother abandoned her when she was only 15 years old. She married later and then being widowed very early left her very bitter. This is an amazing story. Why is this story so amazing? Read this book!I recommend this book to all people who love to read history."}, {"userName": "Jo Linsdell", "userReviewDate": "Apr 28, 2010", "userURL": "http://www.goodreads.com/user/show/2230687-jo-linsdell", "userReview": "When author Andy Andrews unearthed a rusted metal container filled with Nazi artefacts he began an investigation into the past that lead to a moving story about the power of forgiveness and being able to let go.Josef Landermann’s uniform leaves Helen Mason with no doubt that his near lifeless body is that of a German sailor. Given that the country is in full scale commitment to WWII and as a recent widow of the war, Helen’s first instinct is to leave him there to die until something changes her mind.A true story filled with many emotions including; depression, anger, fear, friendship and love. They must both deal with their pasts in order to create a future.The Heart Mender by Andy Andrews is simply excellence in word form. A wonderful blend of storytelling combined with real historical facts this book will appeal to many and would also make a great additional tool for history students studying WWII. It even includes a great readers guide divided into specific topics of interest with lots of ideas to spark discussions.Disclosure of Material Connection: I received this book free from Thomas Nelson Publishers as part of their BookSneeze.com  book review bloggers program. I was not required to write a positive review. The opinions I have expressed are my own. I am disclosing this in accordance with the Federal Trade Commission’s 16 CFR, Part 255  : “Guides Concerning the Use of Endorsements and Testimonials in Advertising.”"}, {"userName": "Sally", "userReviewDate": "Jun 14, 2010", "userURL": "http://www.goodreads.com/user/show/3486170-sally", "userReview": "I enjoy reading historical fiction and looked forward to reading Andy Andrews’ The Heart Mender. The author said this book was his best work, so I was expecting a knock-out story. While the story had excellent potential to be a really GREAT read, I felt the book fell short. Within the first couple chapters and before the main 1942 storyline even started, I knew how the story would end and which present day characters would turn out to be the 1942 couple. It was just too obvious. I enjoyed the story of Helen and Josef, who were both broken people who came together under unusual circumstances and found a way together to mend their hearts and have a second chance at life. I just wish that their characters were better developed, along with some of the Alabama characters. The story read like a made-for-TV movie. If you’re looking for an easy summer read, this would be a good choice. I received this book free from Thomas Nelson Publishers Review Program. I was not required to write a positive review. The opinions I have expressed are my own."}, {"userName": "Danny", "userReviewDate": "Jul 14, 2010", "userURL": "http://www.goodreads.com/user/show/640263-danny", "userReview": "This was a fascinating story of war, faith and forgiveness. One of my favorites quotes:“History tells us that a democracy is always temporary in nature. It simply cannot exist as a permanent form of government… a democracy will continue to exist up until the voters discover that they can literally vote themselves gifts from the public treasury. From the moment that revelation is made, the majority proceeds to vote for the candidates who promise the most benefits from the public treasury. The final result is that every democracy finally collapses due to loose fiscal policy. That collapse is always followed by a dictatorship.”“… charted the ages of the world’s greatest civilizations from the beginning of history … an average existence of about 200 years. Every single time, these nations progressed through the following sequence: from bondage to spiritual faith; from spiritual faith to great courage; from courage to liberty; from liberty to abundance; from abundance to complacency; from complacency to apathy; from apathy to dependence; from dependency back into bondage.”"}, {"userName": "Kipi", "userReviewDate": "Apr 30, 2010", "userURL": "http://www.goodreads.com/user/show/750542-kipi", "userReview": "3.5 starsEven as a person fascinated with WWII history, I wasn't bowled over by this book, but I did find it to be a fairly interesting read. The author says that it is a true story, and since we all know that truth is stranger than fiction, I have no reason not to believe him. The romantic in me loved the love story between Josef and Helen, and the history buff found the the German U-boat officer's tale interesting.The book is listed as a self-help, inspirational book, not history, and there are certainly parts of it that read as such...almost awkwardly so. It seemed like a paragraph or two out of some other book on Christian forgiveness would suddenly appear out of nowhere and then the story would pick back up again. I do wish that the story of the relationship between Josef and Helen had not been cut off so abruptly. I wanted to more about how they both learned to forgive and love again."}, {"userName": "Melanie", "userReviewDate": "Jul 12, 2010", "userURL": "http://www.goodreads.com/user/show/3380729-melanie", "userReview": "3.5 stars. I didn't realize this novel was based on facts and some actual people until the very end. There were German submarines right off the coast in the Gulf of Mexico! A little too close for comfort.I liked that I learned interesting, little known facts, like some German submarines would approach their target and order them to quickly disembark. They would blow up their ship, then provide them with water canteens and point them to the nearest landfall! The human difference between Nazi's and Germans.The story itself was one of surviving pain and learning to forgive. I enjoyed reading this book as it flowed easily."}, {"userName": "Heather", "userReviewDate": "Jun 16, 2008", "userURL": "http://www.goodreads.com/user/show/906735-heather", "userReview": "This book has me intrigued even today after having read it a few years ago. This is a historical fiction book but it was also written as a \"motivational\" story. THe author Andy Andrews writes this story as it really happened but then tries to say that it really is fiction to protect the people in the story. It is a story that addresses the Uboats that would sit out in the Gulf of Mexico just off the panhandle of florida. It tells the love story of one of the soldiers that is washed up onto the beach and discovered by a young woman who then cares for him.... I loved the book and loved that there are pictures of the memorabilia that was actually found. A Fascinating read."}], "description": "In the classic storytelling style of The Noticer and The Traveler's Gift, New York Times best-selling author Andy Andrews now delivers an adventure set sharply against the warm waters and white sands of the Gulf of Mexico in WWII America.Saddened and unable to abandon her resentment toward the Nazi war machine that took her husband's life, the young and attractive Helen Mason is living a bitter, lonely existence. Betrayed and left for dead, German U-boat officer Lt. Josef Landermann washes ashore in a sleepy town along the northern gulf coast, looking to Helen for survival.The Heart Mender is a story of life, loss, and reconciliation, reminding us of the power of forgiveness and the universal healing experience of letting go.", "title": "The Heart Mender: A Story of Second Chances", "url": "http://www.goodreads.com/book/show/7264975-the-heart-mender", "average": 4.25, "cover": "https://images.gr-assets.com/books/1442858672l/7264975.jpg", "reviews": 540, "authors": [{"url": "https://www.goodreads.com/author/show/31934.Andy_Andrews", "name": "Andy Andrews"}], "type": ["Historical", "Fiction", "Christian Fiction", "Christian"], "outlinks": ["http://www.goodreads.com/book/show/99691.Island_of_Saints", "http://www.goodreads.com/book/show/17303666", "http://www.goodreads.com/book/show/2465221.Island_of_Saints", "http://www.goodreads.com/book/show/99691.Island_of_Saints", "http://www.goodreads.com/book/show/56466.The_Traveler_s_Gift", "http://www.goodreads.com/book/show/13562342-how-do-you-kill-11-million-people-why-the-truth-matters-more-than-you-t", "http://www.goodreads.com/book/show/7672382-the-butterfly-effect", "http://www.goodreads.com/book/show/511350.The_Lost_Choice"]}