{"ratings": 1514, "userreviews": [{"userName": "Ann Marie (Lit·Wit·Wine·Dine)", "userReviewDate": "Sep 14, 2017", "userURL": "http://www.goodreads.com/user/show/7447086-ann-marie-lit-wit-wine-dine", "userReview": "***I'm running a giveaway on this book at Lit·Wit·Wine·Dine!Little Women was one of my favorite childhood reads. I don’t recall how old I was when I read it but I do remember that I longed to be one of the March girls. And I was so proud to have finished such an unimaginably long book! I found 449 pages very daunting back then. Of course, once I began reading it was over all too soon. Now that I think about it, Little Women may have been my first book hangover. Therefore, I was very excited to hear that the story of May Alcott, the inspiration for Amy March, would be told in a novel titled The Other Alcott.Though Louisa seemed to get all the glory, May Alcott, it turns out, was a very accomplished artist in her own right. Though she was pained by the less than favorable reviews of her illustrations for Little Women, she collected herself and forged ahead. Like many career women of her time, she had difficult choices to make at a time when work and family were mutually exclusive.The relationship May had with her sister Louisa was, as you would expect, complicated. She was in the position of being beholden to her sister during much of her early career as it was Louisa’s money that provided for the entire family’s expenses as well as May’s travel and education. Though it is often said that May was the selfish one, I found Louisa to be guilty of a certain amount of abuse of power. The dynamic in their push-pull relationship was at times touching; at times frustrating. I very much enjoyed reading the letters they exchanged as it added a nice, intimate quality to the story.Though I’m sure May’s life at the time was very exciting in comparison to many of her contemporaries, she came off a bit lackluster through much of the book. This may be because she was, in fact, so studious and dedicated to her art. But I must say, I felt a bit let down. I would have expected a single woman in Belle Époque Europe to have had many adventures. I would have liked to have read about some of her friendships in more depth.Elise Hooper clearly did her homework in preparation for writing this book. I really appreciated all of the information in the afterward and P.S. sections which included author Q&A and Alcott trivia. Sometimes it’s easy to forget that writers much research every detail – not just the obvious things.A word of advice if you are considering this book and don’t know much about May – DO NOT GOOGLE HER prior to reading the book. I didn’t and I’m very happy I didn’t.Many thanks to TLC Book Tours and William Morrow for providing me with a free copy of this book in exchange for an honest review."}, {"userName": "Bam", "userReviewDate": "Sep 04, 2017", "userURL": "http://www.goodreads.com/user/show/5922426-bam", "userReview": "I was fortunate enough to win a Kindle ebook copy of this book in a goodreads giveaway. Many thanks to the author and goodreads friend, Elise Hooper. I wish you great success with your debut tale based on the life of Abigail May Alcott Nieriker (1840-1879).Elise has obviously done a great deal of research into not only May's life but also the historical background for the story, most especially the art scene in Europe during the fascinating period when 'a group of artists were 'experimenting with composition, style, and technique' and struggling to be accepted by the traditional art world and critics in the press who dubbed them 'Impressionists.'Abigail May Alcott, known as May, was Louisa May Alcott's youngest sister and a very talented artist in her own right. She spent many years developing her talents with renowned teachers and had two paintings accepted for exhibition at the famous Paris Salon. But it was hard to live in her famous sister's shadow and accept her largesse and Elise imagines some friction between these sisters, who were part of a close-knit family. Elise also imagines the fierce competition and petty jealousies that very likely occurred between fellow art students. The story is quite readable and interesting as May Alcott comes alive for the reader in the pages of this debut work. Well done, Elise!"}, {"userName": "Linda", "userReviewDate": "Sep 01, 2017", "userURL": "http://www.goodreads.com/user/show/10733555-linda", "userReview": "I confess to not having read \"Little Women\" by Louisa May Alcott, but that certainly did not detract from my enjoyment of \"The Other Alcott.\" Anyone who has lingered in the shadow of an older sister or suffered the angst of sibling rivalry will relate to the plight of May Alcott, the youngest sister of Louisa May Alcott. The feminist themes presented are equally as interesting as the familial relationships. Both women are fascinating individuals who strove to support themselves as artists, one as a writer and the other as a painter, at a time when these pursuits were considered fashionable for women as opposed to professional. Hence, these professions were largely dominated by men and the proverbial glass ceiling was firmly in place. It is an inspirational story. Hooper has clearly done her research not only of the Alcott's but the art world of the 1800s. Her writing is engaging and her voices authentic. I will encourage my daughter to read this book and I might just pick up \"Little Women.\" I love it when a book leaves me yearning to learn more."}, {"userName": "Kathleen Flynn", "userReviewDate": "Jun 14, 2017", "userURL": "http://www.goodreads.com/user/show/1290013-kathleen-flynn", "userReview": "Though I love Little Women and knew it was somewhat autobiographical, I did not know a whole lot about the lives of the Alcotts. I very much enjoyed this sensitive and well-researched imagining of the life of the youngest Alcott, immortalized in Little Women as cute, willful, pretentious Amy. The reality of May's life was far more complicated, as was her relationship with her famous sister Louisa. I was engrossed by this story and whipsawed by the ending. Beware, you will cry."}, {"userName": "Lisa Duffy", "userReviewDate": "May 02, 2017", "userURL": "http://www.goodreads.com/user/show/40048914-lisa-duffy", "userReview": "Reading Elise Hooper’s debut reminded me of one of the first books I fell in love with as a young girl. I devoured The Other Alcott in the same fashion as Little Women. Transported to another time, lost in the pages of this vivid world that sweeps from Concord to Paris and London and Rome, this story will make you fall in love with May Alcott, and when you reach that last page, and the journey is over, you’ll want to go back to beginning, and start all over again—it’s that good."}, {"userName": "Janelle", "userReviewDate": "Oct 01, 2017", "userURL": "http://www.goodreads.com/user/show/20742472-janelle", "userReview": "This was the September selection for Instagram’s Salt Water Reads Book Club and loved it! May Alcott is an aspiring artist, who is always living in the shadow of her sister, Louisa, who wrote the infamous book, Little Women. May grows up longing to experience the world beyond Concord, Massachusetts, taking art lessons and turning down a marriage proposal from a well-to-do suitor, and facing scorn for what is very much a man's profession. The Alcott family never had it easy, so when Little Women was published, the success of Louisa's book eased the financial burdens they faced for so many years. Little Women is well received but May is upset and offended by the portrayal of spoiled and selfish Amy March, as the character is based on her. May loves her sister but decides to find her own path to discovery as she no longer wants to live in her shadow. \"May never understood where the soul resided, but now she had a sense of it. It was an energy inside her, a burn to move forward, a longing to love.\"I will be the first to admit... I would’ve never thought to read this if it wasn’t for this awesome book club. But I’m certainly glad I did! I am one of those people that has never read Little Women - it wasn’t on purpose, it just never happened. Now I feel like I know them, at least May and Louisa, as well as their family dynamic. I really love how progressive they were for the late 19th century and how they were encouraged to pursue their dreams as artists and writers. This story is told through the eyes of May and it shows her journey to become an artist while also living in the shadow of her famous sister, Louisa, who is a beloved writer. This is a close knit family and I think Hooper does a great job showing the love they have for each other but also portraying the jealousy and resentment as well. I loved being transported to Europe as May discovered herself as an artist, and as a person. I also enjoyed all of the art references as some of my favorite artists were mentioned in the book. I thought the story was very well-written and I truly enjoyed it!! “She [May] remembered what Marmee used to say: It's none of your business what other people think of you.\" (Reminds me of something my great grandma would say)"}, {"userName": "Adriana Arrington", "userReviewDate": "Mar 20, 2017", "userURL": "http://www.goodreads.com/user/show/32168211-adriana-arrington", "userReview": "FANS OF LITTLE WOMEN - DON'T MISS THIS ONE!An absolutely fascinating debut by Elise Hooper. Along with millions of other people, I've long loved Louisa May Alcott's Little Women. However, I knew little about the author's life, and even less about her sister, May. I loved learning more about the Alcott's unconventional family. I thought concentrating on May in this historical fiction was a genius idea - how must it have been at that point in history to have a hugely successful sister while you have professional ambitions of your own? The novel examines this question in a thoughtful and honest manner. Hooper is a beautiful writer, and the tone of THE OTHER ALCOTT felt almost like an extension of Little Women - which is great praise indeed. Meticulously researched, all the historical details feel authentic. I enjoyed the novel so much I wanted to draw this read out but just couldn't pace myself, as I was eager to find out what happened next.Bottom Line: An incredible analysis of the love between two sisters and how they each fought against society's expectations. Highly recommended."}, {"userName": "Trish at Between My Lines", "userReviewDate": "Nov 04, 2017", "userURL": "http://www.goodreads.com/user/show/15939692-trish-at-between-my-lines", "userReview": "Don’t know how to rate this. Coz it was both ok, and also my biggest let down of the year.I need to think, but I’ll be back."}, {"userName": "Jenny Williams", "userReviewDate": "Apr 30, 2017", "userURL": "http://www.goodreads.com/user/show/58531273-jenny-williams", "userReview": "You don't have to love Little Women (or even have read it) to get swept away by this absorbing novel about art and ambition, the complexities of sisterhood and friendship, and the struggles of choosing a creative path. May Alcott was truly a remarkable woman for her time--and Hooper's captivating prose brings her to vivid life with wit and grace. I was sorry to turn the final page. Here's hoping Hooper has more like this up her sleeve!"}, {"userName": "Erika Robuck", "userReviewDate": "Sep 24, 2017", "userURL": "http://www.goodreads.com/user/show/2103117-erika-robuck", "userReview": "This is the second novel of May Alcott I have read, and I enjoyed this every bit as much as the other. Both stories focus on different aspects of May, highlighting times and places in unique ways, with THE OTHER ALCOTT giving special attention to the relationship between the sisters: May and Louisa. Hooper has done a marvelous job showing a flawed character who is a delight, even when she stumbles. Like Jane Austen's Emma, May is charming and her struggles are relatable. Her need to carve an identity of her own is palpable and drives her brilliant arc as an artist and a woman. Lovers of history will be intrigued by the sketches of figures both well known and unknown, and Hooper gives just enough detail to enhance the story without overburdening it. I spent hours online looking up the leading and supporting characters of the novel, and was fascinated by the talented men and women in the Alcotts' lives. If you enjoy biographical historical fiction about women that spans the globe, you will enjoy THE OTHER ALCOTT. This is Hooper's debut, and I am eager to hear what she's working on next."}, {"userName": "Kate Olson", "userReviewDate": "Aug 25, 2017", "userURL": "http://www.goodreads.com/user/show/13650342-kate-olson", "userReview": "Gorgeously-written required reading for fans of LITTLE WOMEN, THE OTHER ALCOTT is the \"rest of the story\" we have all been waiting for since childhood.  Thanks to the author for providing me with an advance copy of this novel for review purposes - all opinions are my own. There are two types of people in this world - those who have read Little Women, and those who haven't. And there isn't a category for those who have read but didn't love it, because those people simply don't exist! For all of us in the first category, THE OTHER ALCOTT takes us into the \"real\" (but fictionalized by Hooper) adult world of the Alcotts, where Louisa is seeing success from the publication of LITTLE WOMEN (although she resents having to write such juvenile fare) and her younger sister May is desperate to be independent and work on her budding career as an artist. She isn't happy about Louisa using her as a basis for the character of Amy and is reeling from critical reviews of her drawings in LW. May is the narrator of this novel, which takes us from 1868 to 1880 and is a sweeping epic including travel throughout England and Europe. I honestly can not believe that this is a debut title from Hooper - the research is absolutely breathtaking in its thoroughness and I actually messaged her asking if she is an artist because I couldn't imagine anyone other than a professional artist being able to write about art the way she does. There is an excellent Afterword and Discussion with the Author telling of Hooper's motivation for the book's inception, as well as an incredible amount of detail about the real Alcotts and art during this time period. Hooper also tells us exactly how much of this story is based on fact and which parts have been embellished for the story. There is a Discussion Guide included as well.I highly recommend this title to fans of LITTLE WOMEN (or those interested in literary and art life in the late 1800s), and I also think it will be a very popular book club selection. I also can envision it being a really fun read for a mother-daughter book club with daughters reading LW and mothers reading THE OTHER ALCOTT! Bravo to Hooper for this stunning debut."}, {"userName": "DJ Sakata", "userReviewDate": "Sep 29, 2017", "userURL": "http://www.goodreads.com/user/show/18344018-dj-sakata", "userReview": "My Rating:4.5Favorite Quotes:You two make me glad I’m an only child.I’m advising you to find the balance between painting your subject with mastery and sensitivity. In other words, if a client hires you to paint a portrait of his horse-faced wife, you better find a way to make those horsey features attractive.She had violet-colored eyes that glowed like amethysts from under a fringe of long black lashes. Between her size and extraordinary eye color, she looked like a fairy. May eyed the remarkable-looking woman’s ears to be sure they weren’t pointed.He picked at his lapels with soft, white fingers that made May squeamish with the sensation she was viewing a body part better left unexposed.When Herr and Frau Nieriker disembarked from the train on Saturday morning, they made a distinctive couple. She possessed the stout figure of a pickling jar whereas he resembled a fork, long and thin with a thatch of white hair that stuck straight upward in tines.My Review:I seldom read historical novels as the feminist in me becomes extremely chafed by how poorly women were treated – even by their own families. Not that we are always treated so well now, but women had no rights and such limited input or control over their lives and bodies. This story brought that point home and I could feel the frustration of both May, her friends and fellow artists, and despite her success, even her crabby sister Louisa. I cannot imagine the massive amount of research Ms. Hooper completed for this fascinating and thought-provoking story that was inspired by real people and factual accounts. It was an interesting and inspiring read that often squeezed my heart, and had an ending and Afterward that stung my eyes. I greatly enjoyed the history lesson of the exciting artist movement of Impressionism as I have always admired the works of Monet and Degas.I grew to greatly admire May who was the youngest of the surviving daughters of intelligent yet irresponsible parents. Louisa was already gaining recognition and fame as the author of Little Women as the story began, while May who aspired to be an artist, was devastated by criticisms and humiliating reviews of the illustrations she had completed for Louisa’s book. She yearned for and worked hard for her own independence and achievements/recognition apart from the constraints of her family and especially Louisa, and often feared she would forever be connected to and lessened by her more popular sister. Louisa was surly and irritable; although I imagine I would be as well if I had to support and care for my entire family by writing the type of book I didn’t enjoy while my lazy and negligent father was riding my coattails. Ms. Hooper produced a masterful and well-balanced story and had me feeling far more sympathetic and empathetic toward both women by the conclusion."}, {"userName": "Kathleen", "userReviewDate": "Jul 11, 2017", "userURL": "http://www.goodreads.com/user/show/1209261-kathleen", "userReview": "This was such a fascinating book! I loved reading about the Alcott family, particularly the close - and at times contentious - relationship between May and Louisa, and also about May's travels through Europe and her education in art. In author Elise Hooper's skilled hands, May is more than \"the other Alcott\" - she's an ambitious, intelligent woman that readers will fall in love with."}, {"userName": "Helena Halme", "userReviewDate": "Mar 08, 2018", "userURL": "http://www.goodreads.com/user/show/12646358-helena-halme", "userReview": "Perfect for fans of 'Little Women.I was immediately intrigued by this book and its promise to part the virtual curtain on this famous author's life. I read Little Women in my pre-teens and felt a real affinity to Amy. Was she really as spoilt, selfish and vain as she appeared to be in the books?Instead of that egocentric little girl of Little Women, according to Elise Hooper, the real May Alcott was an ambitious artist. The book is set in the late 1880's, at the time when it was unusual for a woman to be an artist, or even be able to study painting, let alone attempt to make a living from her paintings. Much of the book is taken up with May's struggle to be accepted into the art circles or to be allowed to study art as easily as men can. Often, if she mentions her famous sister, doors are opened, something which May detests, especially as she often has to rely on her sister for financial assistance. But May struggles on, traveling to Europe to study and to pursue her dreams.I really enjoyed The Other Alcott and reading about May's life. It's always difficult to write about a hugely popular author or their books, but I believe Elise Hooper has created a credible, highly enjoyable, grown-up book for anyone who enjoyed – or even adored, like I did – Little Women. This novel manages to evoke the atmosphere of the original books by Louisa M Alcott while taking a modern look at the challenges women faced in the late 19th century.(Full review on my blog www.helenahalme.com)"}, {"userName": "Jenni Walsh", "userReviewDate": "Jun 19, 2017", "userURL": "http://www.goodreads.com/user/show/7859202-jenni-walsh", "userReview": "I'll be honest and admit I've never read Little Woman or anything by Louisa May Alcott. That's to say, being familiar with the Alcotts is not a prerequisite to reading this book. I thoroughly enjoyed getting to know the Alcotts (and now I'm intrigued to look up May Alcott's paintings and read Louisa's words). I found the family dynamic very interesting.This is one of those stories that you love to come back to. It feels like real life. It's not heavy with action, twists or turns (there are some!), but it doesn't need to be. It's a wonderful character-driven novel that explores a woman's life who wanted more for herself. I admired May's determination.If the author has a background in painting, I loved how she used her knowledge to bring each brush stroke to life. If the author doesn't have a background as an artist, I'm even more the impressed with the details and nuances of this novel. I felt as if I was in an art studio.The Other Alcott is a wonderful historical novel that explores gender roles and a woman who is fixed on paving her own path. I highly encourage historical fiction fans to pick it up!"}, {"userName": "Kat", "userReviewDate": "Sep 16, 2017", "userURL": "http://www.goodreads.com/user/show/10119679-kat", "userReview": "A must read for Little Women fans. First the Cons: The writing style seemed a bit simple at times, but it was similar to Little Women so it worked. May seemed a bit too petulant at times, acting like the Amy March she tried to avoid. You might want to read a synopsis of the real May Alcott's life before reading. But the story was good and kept me interested in throughout. One purpose of a book is to inspire and it definitely did that. I became interested in the art and artists mentioned. It makes me want to go to Concord, Boston, Rome, London and Paris. It even makes me want to try painting or sketching again, which I haven't done since college. I listened to the Audible version. The narration was good. The narrator is Cassandra Campbell. I would listen to other books she narrates."}, {"userName": "Asheley", "userReviewDate": "Sep 15, 2017", "userURL": "http://www.goodreads.com/user/show/4691325-asheley", "userReview": "4.5/5I completely loved The Other Alcott by Elise Hooper. In some ways, it was very much like I was expecting, being a book about the “other” woman “behind” someone very famous – I adore those books. In other ways, it surpassed my expectations. I knew going into it that I was getting a story about May Alcott, younger sister of Louisa of Little Women fame, but I had no idea that I was getting such a rich tale of travel, of art, and of May becoming independent in her own right. I wanted to read it quickly, to devour the story, but I forced myself to read it slowly and savor every word.I’ve been in the camp of people that have loved Little Women so much for my entire life. It is a comfort read for me. I’ve felt a very specific connection to it because my grandmother loved it when she was living and because she gifted me an especially lovely copy that I treasure. Further, I’ve always been intrigued by Alcott family because the story is based on them somewhat, although I’ve never fully known the details of the Alcott family beyond very, very basic knowledge. In a nutshell, the Alcott father was a philospher with some very unconventional views on life and nontraditional ways of living, which caused the Alcott family some hardship financially. This caused Louisa to feel certain pressures as a published author to provide for their entire family, which eventually ultimately alienated May and set her life in motion. The Other Alcott is one historical fiction account of her life, based on the research by the author.So, a sidenote: did you know that May illustrated Little Women? She did! The Other Alcott opens to Louisa receiving reviews in the mail for Little Women. She receives numerous positive reviews while May receives not-so-positive reviews for her illustrations. This wounds May deeply, because she is every bit as passionate about her art as Louisa is about her writing. This opening scene is wonderful at setting up the complicated relationship between May and Louisa that hounds May throughout her life and throughout the book.It also wounded May that Louisa chose to base Amy March, the youngest sibling character in the book, on May. I’m not sure that Louisa had the foresight to know how much it would hurt May, but this is something that May carried with her always. In this story, there is so much tension between the two sisters over – gosh – so many things, and I think it may have all stemmed from their creative differences and also competitiveness. Their back-and-forth isn’t the sole focus of the book, but it is often the catalyst for May’s decisions or where she bases herself geographically while she does her work. Their relationship is fascinating and quite a story in how two people relate to one another, and why.Speaking of May’s work, there is so much art in this book! There are so many of us readers that enjoy art in books, and I was not expecting so much detail and attention to be given to the art part of May’s life. It was awesome! I mean, technique, supplies, other artists that May worked alongside, all types of artsy things. For fans of art in books, The Other Alcott reads like a dream.The author talks about her specific uses of creative license in the Afterward at the end of the book, and I think that with the level of animosity between Louisa and May in particular, the use of license is something to be remembered when we read and think about this book. I loved reading the sibling dynamic between Louisa and May; I found it real and true and heartbreaking and loving and painful and hard and also very easy, underneath everything because they were sisters. In fact, except for the fact that my sisters and I do not live oceans apart like Louisa and May sometimes did, their relationship was very similar to the one I have with my two sisters. It was in this way that I was able to connect with the book so deeply on that level.I just loved this book so much. I thought I’d certainly like it a lot, but after finishing it, I completely adore it and have placed it on my top shelf among my other favorites from this year like The Essex Serpent and A Piece of the World. I think it will have a home with readers that love classic childrens literature, readers that love art, and readers that love stories of strong, compelling women.I received this book for free from the publisher in exchange for an honest review. This does not affect my opinion of the book or the content of my review. Thank you, William Morrow Books!Find this review and more like it on my blog, Into the Hall of Books!"}, {"userName": "Kourtney • kourtneysbookshelf", "userReviewDate": "Sep 27, 2017", "userURL": "http://www.goodreads.com/user/show/5352425-kourtney-kourtneysbookshelf", "userReview": "“It’s none of your business what other people think of you.”- Marmee, The Other AlcottThe Other Alcott by Elise Hooper is a beautifully written debut novel.  I must admit that I have not read Little Women or any of the other titles written by Louisa May Alcott.  I was assured that I would still be able to enjoy this novel, even without knowing any prior history of the Alcott’s.  They were not wrong, in fact, now I want to read Little Women, because Elise Hooper’s riveting story sucked me into the world of all things Alcott.  I found Elise Hooper’s research and attention to detail fascinating.  There was a great sister dynamic coursing throughout the entire novel.  I do not have sisters of my own, but I could easily relate to the family dynamics, sibling rivalries and spats as well as the deep-rooted love for family above all else.  The Alcott sisters endured their fair share of struggles and hardships as they forged a path not commonly taken by other women in the late 1800’s.  I love strong women who refuse to settle and are willing to work hard to achieve dreams that seem bigger than the world is ready for. When you sit down to read The Other Alcott be sure to pack your bags in preparation for Elise Hooper’s words to send you on a voyage alongside May Alcott as she strives to find herself.  This is a tale about courage and fear, relationships with family and friends and forging your own way when there seems to be none.  I found Louisa and May to be spiteful towards one another at times but a spoonful of drama only makes the tale that much more exciting.  In the end I respected the choices both Louisa and May made throughout their lives and while I was left heartbroken and madly in love with May’s husband, Ernest, I absolutely adored The Other Alcott.         “…these new aspirations were not a reduction of her dreams, but simply a reorienting, a refocusing.” - May, The Other AlcottIf you like stories with courageous women that will take you on a journey, transporting you through time and across oceans, this novel is for you!I give The Other Alcott 4.5 engaging stars out of 5.I read this as part of the Salt Water Reads Book Club on Instagram."}, {"userName": "Kim Kaso", "userReviewDate": "Nov 28, 2017", "userURL": "http://www.goodreads.com/user/show/39507342-kim-kaso", "userReview": "Never realizedhow interesting a life and how successful an artistic career the \"Amy\" of Little Women had. Fascinating window on life of a working woman artist."}, {"userName": "Megan", "userReviewDate": "Aug 13, 2017", "userURL": "http://www.goodreads.com/user/show/6688234-megan", "userReview": "\"Little Women\" has always been one of my favorite books. During my childhood, I devoured every book I could find by Louisa May Alcott and did a term paper on her in high school (it was about how much her actual life parallels her book, \"Little Women\"). When I read the premise of \"The Other Alcott\", I was so excited to read more about my beloved Alcott family! \"The Other Alcott\" by Elise Hooper is about May Alcott, Louisa May Alcott's younger sister. In Louisa's book \"Little Women\", the character Amy is modeled after May Alcott. Amy is not always portrayed in the best light and is often the least liked sister. May is in fact much more than just the spoiled, selfish Amy. May Alcott is a brilliant artist and reaches her own level of fame and moves among the inner circle of artists of her time. This book is a fascinating look at life through May's perspective. The story takes place after \"Little Women\" is published. The Alcotts are often close to poverty and Louisa and May struggle to provide for themselves and their family. It is still not conventional for women to be artists or to remain unmarried--but both Louisa and May follow this less traveled path. Throughout the story we see May rise as a talented artist and how she has to work hard to make her own way and not just be known as the \"other Alcott.” May struggles with the constant balance between creating art to make money and being true to herself and doing what she loves. Ms. Hooper incorporates minute historical detail and draws the reader into the world of art during this time period. There are beautiful and vivid descriptions of all the places May visits, such as Paris and England. I love that the book includes special content, including some of May's artwork and illustrations.  The characters of May and Louisa are so well done that I felt like I knew them personally. I love getting to see a different side of these characters. I was surprised that Louisa didn't actually want to write \"Little Women\" or those types of stories and she didn't like the fame her stories brought. May's character is very optimistic and very different from Louisa’s. Louisa and May do have a difficult relationship, but at the end of the day, May misses Louisa, still wants her approval, and wants to be able to share her successes with her. This is a beautiful picture of family ties and how sometimes only family can fully appreciate your triumphs because they know where you once were and how far you've come. May's journey helps her appreciate Louisa better and she realizes the sisters have more in common than they originally thought. Content: I give this book a PG-13 rating. There is the use of some minor swear words. There is a character that falls in love with a married man. There is a scene where May is painting a nude model. Some side characters are homosexual. There are the implications that a character sleeps with her husband and a scene of the married couple lying in bed.  Rating: I give this book 4.5 stars.  Genre: This book is Historical Fiction I want to thank Elise Hooper, William Morrow and Harper Collins for the complimentary copy of this book for review. I was not required to write a positive review. The opinions I express in this review are my own. This is in accordance with the Federal Trade Commission’s CFR 16, Part 255."}, {"userName": "Laura", "userReviewDate": "Sep 07, 2017", "userURL": "http://www.goodreads.com/user/show/3086841-laura", "userReview": "I have been a Louisa May Alcott fan since I was a girl. I loved reading Little Women and most of Alcott’s other novels. I also loved all of the different movie versions of Little Women. I wanted to be part of the Alcott family believing they were the March family . . . until I started reading biographies of Alcott and discovered that while there were similarities, there were also many differences in which the Alcott family struggled through very difficult circumstances. I was very intrigued by this new novel about the youngest Alcott sister, May, the basis for Amy in Little Women.Being the basis of Amy for Little Women effects May in many ways. Her sister Louisa and she have a difficult relationship, especially as Louisa’s writting pays for the family to live while May’s artistic renderings in Little Women receive scathing reviews. May wants to leave the shadow of being Amy behind and find out who she is as an artist. First traveling to Europe with Louisa and then by herself, May pushes herself to accomplish her goals and to find out what makes her happy personally.I loved May’s travels and learning about the process of becoming an artist. I thought it was very interesting when she met fellow women artists who were trying to make it in a male dominated field such as Mary Cassatt and the work they did to create their art and move forward. I enjoyed the pictures at the end of the book that showed the illustrations that May had created for Little Women. I liked them and am unsure why they were panned. I looked up her paintings online after I finished the book and they are quite beautiful. There is definite growth between her early illustrations and her later paintings after she received further European instruction and traveled the world.Most of all I loved May’s growth as a woman. Although she was an adult all through this novel, I thought it was a wonderful coming of age novel as May works to be independent, to be a true artist, and to find her happiness. It was very interesting for her to do this during the Victorian times, which frowned upon independent women.I’ll admit I was a bit sad by Louisa’s talk in the novel of not being happy about her success being from Little Women and her children’s novels. I know they weren’t her first choice of material, but they are so much better than her other fiction such as “The Inheritance.” I have always loved Little Women and An Old Fashioned Girl. She comes off as a bit cranky in this novel. Favorite Quotes:“I’ve seen you digging back into your dog-eared diaries and rewriting old accounts of our lives into rosier, more harmonious versions of the truth.” – May writing about Louisa“You two are so similar, both so hungry for something more, but at the same time, you couldn’t be more different.” Oldest sister Anna on Louisa and May“And the sooner you abandon the idea that life is fair, you will be more productive. This world doesn’t owe us a thing.” – Louisa to MayI enjoyed the extras in the back of this book, especially “A Conversation with Elise Hooper” on the research and background she used to create this novel. It was very interesting. I love that she grew up not far from Orchard House. It’s one of my life goals to visit there one day.Overall, The Other Alcott is a wonderful tale of an important woman in her own right, artist May Alcott and her struggle for independence and an identity separate from Amy March. Book Source: Review Copy from William Morrow. Thank-you!This review was first published on my blog at:https://lauragerold.blogspot.com/2017..."}, {"userName": "Jennifer", "userReviewDate": "Aug 13, 2017", "userURL": "http://www.goodreads.com/user/show/4692494-jennifer", "userReview": "Received through FirstReads...Was quite happy to get this, as I'm in the midst of a historical fiction binge. All I really knew of any Alcott was that I read \"Little Women\" when I was young, and loved it. Though this book is fiction, it made me want to read more about this family, which says a lot for the author. The surroundings came to life very well; when they set sail for France, it was easy to picture, and even imagine the sounds. The main character was sympathetic but not whiny or poor me. An enjoyable book."}, {"userName": "Alyssa Palombo", "userReviewDate": "Jan 09, 2018", "userURL": "http://www.goodreads.com/user/show/49687552-alyssa-palombo", "userReview": "I loved this book and had a hard time putting it down. May is such an engaging, realistic, relatable character. Hooper's wonderful story poses such great and relevant questions about what it means to be a woman artist, then and now, and also about work-life balance for such women, as well as what society demands of women artists. Some of the questions May faced in her day we still do not have the answers to. As such this book rang so true and really resonated with me.The relationship between May and Louisa was one of the focal points of the novel, and that relationship was rendered expertly, with all the nuance that relationships between siblings - perhaps especially sisters - have. I learned a lot about Louisa that I never knew before, and indeed about this particular period in history.In conclusion, a fascinating, meaningful, relevant, and entertaining read. My hat's off to Elise Hooper!"}, {"userName": "Wanda", "userReviewDate": "Aug 23, 2017", "userURL": "http://www.goodreads.com/user/show/7201754-wanda", "userReview": "The Other Alcott is an insightful biographical novel about Louisa May Alcott’s less famous but equally talented younger sister, May. As it turns out Abigail ‘May’ Alcott, who was portrayed as the pampered ‘Amy’ in her sister’s book Little Women, had creative aspirations of her own. This story of her life and the art world she lived in follows her from Concord and Boston to London, Rome, and Paris, where she twice exhibited at the Paris Salon. It’s rich in exploring the bonds – and often times rivalry – between the two sisters and packs an emotional wallop at the end. My thanks to the publisher for an advance copy of this book."}, {"userName": "Amber", "userReviewDate": "Mar 30, 2017", "userURL": "http://www.goodreads.com/user/show/2104020-amber", "userReview": "Don't worry Little Women fans, \"The Other Alcott\" is an enjoyable read that rings real. I am not sure I would recommend this book to people who aren't fans of Little Women, I think there is so much tied to the novel you won't fully appreciate it."}, {"userName": "Carol", "userReviewDate": "Aug 27, 2017", "userURL": "http://www.goodreads.com/user/show/3356446-carol", "userReview": "I have read almost everything that Louise May Alcott has written and was always interested in her younger sister, May who wanted to be an artist. I, like May, was always carrying a sketch book when I was younger and later took many art classes. So that is why I wanted to read this book.The first thing that I noticed was that the pace was very slow, many times I felt that the story was not moving forward. This changed after the first half but it greatly cut into my enthusiasm for this book. Also, the jealousy and animosity that existed between the two sisters was very disturbing. I wondered how much of it was true. There is a section in the back that is a conversation with the author that explains what was true and what was pure fiction. But I still came away wondering if their relationship was that bad.I thought that author described the process of becoming an artist very well, May had to be very determined and hardworking and observant for her to advance. I was also surprised that May had a friendship with Mary Cassette, one of my favorite artists.I recommend this book to all who are interested in the Alcott family and what it was like for a woman to get art training in Europe including the tremendous prejudice against women artists.I received an Advanced Review Copy as a win from LibraryThing from the publishers in exchange for a fair book review. My thoughts and feelings in this review are my own."}, {"userName": "Donna C", "userReviewDate": "Sep 02, 2017", "userURL": "http://www.goodreads.com/user/show/2401439-donna-c", "userReview": "http://www.ondbookshelf.com/?p=1533"}, {"userName": "Rhonda Lomazow", "userReviewDate": "Aug 11, 2017", "userURL": "http://www.goodreads.com/user/show/3901245-rhonda-lomazow", "userReview": "For all lovers of Little Women Grab this book.Amy March a sister we don't really know much about Is brought to life here.An artist searching for herself her family relations a multi layered wonderful read,"}, {"userName": "Wendy", "userReviewDate": "Aug 23, 2017", "userURL": "http://www.goodreads.com/user/show/20160585-wendy", "userReview": "Hooper, Elise. The Other Alcott. Morrow. Sept. 2017. 432p. ISBN 9780062645333. pap. $15.99; ebk. ISBN 9780062645340. F[DEBUT] How do you know when you become an artist?, ponders May Alcott, younger sister of author Louisa May. May painted for years, furnishing illustrations for the first edition of Little Women (1868). Reviews that praise Louisa’s novel while criticizing May’s drawings, saying they “lack realistic proportion and look stiff,” devastate the 28-year-old artist. Disappointment pushes her to seek artistic instruction, first in Boston, then in Europe. Other female artists offer support, with one telling her, “Don’t wait for anyone else to call you an artist. If you wait around for other people to define you, you’ll be saddled with their expectations.” Newcomer Hooper (American history and literature, Bush Sch., Seattle) interlaces May’s story with the struggle women of the time faced in becoming something other than merely wives and mothers. With the sesquicentennial of Little Women set to be celebrated in 2018, this title is not to be missed by the classic’s many fans who will want to get an insider’s look at the real people who inspired the March family.Verdict Like other novels that illuminate lesser-known relatives of famous people (e.g., Marie Benedict’s The Other Einstein and Melanie Benjamin’s The Aviator’s Wife), this one focuses on the artist whom Little Women fans first knew as Amy March.—Wendy W. Paige, Shelby Cty. P.L., Morristown, IN"}, {"userName": "The Library Lady", "userReviewDate": "Aug 14, 2017", "userURL": "http://www.goodreads.com/user/show/288297-the-library-lady", "userReview": "Dear Elise Hooper:Your book gets a \"1\" because you are tacky enough to rate it yourself.That aside, you wouldn't have gotten much more. You've fictionalized May's life the way Louisa May fictionalized her as Amy. But Alcott was a skilled writer, and you're no match. Sincerely,The Library Lady(Who has read \"Little Woman\" zillions of times since 1971, read just about everything out there on the Alcotts, and spent more money than she could afford on a Franklin Mint \"Amy\" doll back when she was just out of grad school.)P.S. Try reading Alcott's introduction to \"Jo's Boy's\" where she talks about the reason for the limited appearance of \"Amy,\" because of May not being there to \"laugh, cry and criticize her character.\" That's not an exact quote, but I 've read it often enough to know it, and know that your underlying ideas here are silly. Have YOU actually read it?"}], "description": "Elise Hooper’s debut novel conjures the fascinating, untold story of May Alcott—Louisa’s youngest sister and an artist in her own right.We all know the story of the March sisters, heroines of Louisa May Alcott’s Little Women. But while everyone cheers on Jo March, based on Louisa herself, Amy March is often the least favorite sister. Now, it’s time to learn the truth about the real “Amy”, Louisa’s sister, May. Stylish, outgoing, creative, May Alcott grows up longing to experience the wide world beyond Concord, Massachusetts. While her sister Louisa crafts stories, May herself is a talented and dedicated artist, taking lessons in Boston, turning down a marriage proposal from a well-off suitor, and facing scorn for entering what is very much a man’s profession. Life for the Alcott family has never been easy, so when Louisa’s Little Women is published, its success eases the financial burdens they’d faced for so many years. Everyone agrees the novel is charming, but May is struck to the core by the portrayal of selfish, spoiled “Amy March.” Is this what her beloved sister really thinks of her? So May embarks on a quest to discover her own true identity, as an artist and a woman. From Boston to Rome, London, and Paris, this brave, talented, and determined woman forges an amazing life of her own, making her so much more than merely “The Other Alcott.”\n  “Elise Hooper’s thoroughly modern debut gives a fresh take on one of literature’s most beloved families. To read this book is to understand why the women behind Little Women continue to cast a long shadow on our imaginations and dreams. Hooper is a writer to watch!”—Elisabeth Egan, author of A Window Opens", "title": "The Other Alcott", "url": "http://www.goodreads.com/book/show/35414455-the-other-alcott", "average": 3.68, "cover": "https://images.gr-assets.com/books/1497230776l/35414455.jpg", "reviews": 327, "authors": [{"url": "https://www.goodreads.com/author/show/16222010.Elise_Hooper", "name": "Elise Hooper"}], "type": [], "outlinks": ["http://www.goodreads.com/book/show/40380306-learning-to-see", "http://www.goodreads.com/book/show/36137550-learning-to-see"]}