{"ratings": 66514, "userreviews": [{"userName": "Jean", "userReviewDate": "Apr 20, 2012", "userURL": "http://www.goodreads.com/user/show/1146590-jean", "userReview": "Every once in awhile you have to take a break from the Holocaust books, the slavery sagas and the dysfunctional families... and this, my friends, is the beach read you are looking for. The old Italian-immigrant-comes-to-America-makes-good-intergenerational-story that your preteen daughter could read and write home from camp about! There are no surprises but it makes you happy and you go to sleep at night with no sad sighs or regrets about what this world is coming to. Trigiani is a prolific writer known around the world and I bet it's for just this very reason...I recommend it if you have had enough of pundits, naysayers, \"wars on women\" and collapsing or near collapsing economies! If nothing else you'll have a craving for good pasta and handsome Italian men."}, {"userName": "Dee", "userReviewDate": "Oct 02, 2012", "userURL": "http://www.goodreads.com/user/show/5117672-dee", "userReview": "This was a recent choice by one of the book clubs I belong to and when I heard it was the choice, I was less than thrilled. \"Oh, man,\" I thought. \"Not ANOTHER star-crossed lovers book set during the war.\" I had half a mind to just not read it but decided to force myself to plod through the book and do my duty as a responsible book club member. Well, I was NOT prepared to be sucked into the story like I was and to discover that I really liked this book. The characters were strong, complex, and likable. The locations described in the book, especially the mountain villages of Italy and New York City around the time of WWI practically deserved to be considered characters in their own right as the story unfolded. Subplots are rich with details of the lives of Italian-American immigrants interwoven with actual historical figures such as the opera singer, Caruso. This is NOT a sappy love story. It is NOT a bodice-ripper romance. What it IS is a beautiful story of love and family devotion and the dream of a better life."}, {"userName": "Sabrina ", "userReviewDate": "Aug 01, 2012", "userURL": "http://www.goodreads.com/user/show/6867494-sabrina", "userReview": "If there’s one book that should be on your summer reading list, it’s The Shoemaker’s Wife. It isn’t just a book; it’s an experience. It’s a slow, beautiful, compelling story with which you can’t help but feel involved and enamoured.No matter what chapter you are on in this book, the setting is always lush and evocative. The Italian Alps captured me during the first half of the book and America, specifically New York, came to life during the latter half. The story follows two main characters—Enza and Ciro—who both lead different lives but their paths delicately begin to intertwine. Their personalities jump off the pages in different ways; Enza is the strong, stoic young woman who is deeply family-minded but also has a will of her own while Ciro is just like a lovable teddy bear. Ciro is a fantastic character. He’s handsome, funny, charismatic, and yet (of course) he carries his own burdens. Full of life and Italian zest, Ciro strives to come to terms with his past and find solace in his future. Meanwhile, Enza learns how to survive in New York City with the help of a steady friend and her own unparalleled sewing skills.Midway through the book, I thought that the story was progressing at a slow pace, but I soon realized that’s exactly what it was meant to do. It’s like taking a leisurely passeggiata. One doesn’t simply rush through it; one enjoys the surroundings and the quiet company. This book means to have you spend some real time with Enza and Ciro respectively, rather than rushing through climactic plot points. Ultimately it is this strong relationship that you build with the characters and the setting that makes the read a memorable one.When I read, I never actually register that I am holding a book in my hands and am engaging with words; I simply become one with the story. The Shoemaker’s Wife took this involvement to a whole new level whereby long after I had finished, I still felt very much connected to Enza and Ciro and the taste of the Italian Alps lingered in my mind.If my endorsement doesn’t do it for you, take it from Kathryn Stockett (author of The Help)—this book is “Utterly splended!”"}, {"userName": "Christy Woods", "userReviewDate": "Nov 09, 2012", "userURL": "http://www.goodreads.com/user/show/11477936-christy-woods", "userReview": "The author, clearly, did her research before writing this book; and she put every tidbit of research into the novel. It was very descriptive, even when a description was not necessary. There were so many wasted words. There were ideas, and characters, and actions that did not move the story forward or enrich the act of reading in any way. I felt that, had the author trimmed the fat, the story may have been tolerable. Tolerable, not good. “Tolerable” because, frankly speaking, this is a poorly written book. I tried to find a way to excuse the writing. “Maybe this is her first novel,” I told myself. I could definitely excuse a little bad writing if it was her first novel. Nope. It’s her 10th. She should know better.  Aside from the unnecessary descriptive language, Trigiani is bold enough to break Cardinal Writing Rule # 1: Show don’t tell. Now, I’m all about rebels and rule breakers, but it didn’t work in this case. Written in the 3rd person omniscient (is that ever a good idea?), Trigiani tells the reader what the characters are thinking and feeling. The dialogue is often used as an “info dump”, and the characters never show their emotions through their actions. The result: two-dimensional characters buried under a mountain of useless words. I was so unconvinced of the connection between the two lead characters, Enza and Ciro, that it was terribly anti-climactic when they finally decided to give their relationship a chance. A teacher once told me that some stories are better realized as novels, while others make better scripts or plays. Perhaps, Adriana Trigiani should have written this as a script. I could visualize the story playing out as a Hallmark mini-series, and I probably would watch it. If you enjoy the immigrant experience, and long-winded passages, you might just like this book. I felt so bad about having to write such a negative review (but, hey, I’ve got to be honest) that I was tempted to read something else written by the author in an effort to vindicate her. Sadly, I just couldn’t stand the idea of putting myself through that."}, {"userName": "Michael Bell-Pouradier", "userReviewDate": "May 29, 2012", "userURL": "http://www.goodreads.com/user/show/9620398-michael-bell-pouradier", "userReview": "I really wanted to like this book, especially since I'm an avid reader of historical fiction and a friend recommended it. A love story that travels from the Italian Alps across the Atlantic to New York City and to the Iron Range of Minnesota in a sweeping historical novel that spans the first half of the twentieth century? What's not to like, right? Well, the glaring historical and geographical errors that never ceased to pop up, for one thing.Maybe I'm an anomaly and no one else cares about a minimum level of accuracy in historical fiction, but if you're bothered by errors (and I don't mean artistic license), this novel will give you a headache. Here's a sample of the most egregious errors. I noted several others I've not included, and who knows how many I missed. After all, I know nothing about opera, Minnesota, or how to make shoes. Any one or two of the following could probably be overlooked in an otherwise engaging tale, but by the time you've been smacked over the head by one every twenty or thirty pages, it just gets tedious:(There may be some spoilers here ... even if they don't give away the story, they might end up spoiling it for you.)1. Pizzo Camino is not the tallest mountain in the Alps. It's not even the tallest peak in the Italian Alps. That would be Mont Blanc, or Monte Bianco, on the French-Italian border. Off to a good start ...2. Imagine it: It's 1910, you travel from the Italian Alps to Venice, take a ship from Venice down the Adriatic, around the boot of Italy, across the western Mediterranean, through the Strait of Gibraltar, around Spain and Portugal and across the Bay of Biscay, and up the English Channel, and you dock at Le Havre two days after leaving home. Impossible, right? Of course it's impossible ... 100 years ago or today. Apparently, the author didn't see a problem with this. Maybe she thought Venice is where Genoa is and Le Havre is where Marseille is?3. You can't make Burgundy in the Italian Alps. Burgundy is a regional appellation, the same way Champagne is. Maybe she was just describing the color?4. The Hell's [sic] Gate Bridge crosses Hell Gate ... on the East River, not the Hudson. Google Maps is really handy if you're that confused about the geography of the part of your historical novel set in New York.5. \"You know, Ciro, if there's a war, we don't know what side Italy will be on. It could make it very difficult for us here.\" SIGH In 1916 (when this statement was made by one of the novel's characters) the First World War had been underway for at least a year and a half, and Italy had been in a state of war against Austria-Hungary since May 1915. It was pretty clear to everyone, on both sides of the Atlantic, which side Italy was on in 1916.6. Would it take you longer than 29 days to travel from the front in northeastern France to Rome, meet your long-lost brother in Rome and catch up over drinks, book a crossing and sail to New York, run into your long-lost love and break up her engagement, meet her father for the first time, get engaged to her, and get married? Yeah, me too. The author apparently doesn't agree. Given how quickly the novel moves in the last chapter, maybe she was just getting us ready for this tempo.7. Yugoslavians included Serbs and Croats, among others (Bosnians, Montenegrins, Slovenes, etc.) ... and, more importantly, they are not \"Baltic beauties.\" Again, just take a look at a map. \"Balkan\" and \"Baltic\" are not the same thing.8. Boxing Day has no connection to the sport of boxing! The day after Christmas, Boxing Day was traditionally when employers would give their servants a day off and provide them with boxes containing certain goods for their post-Christmas Christmas celebration. Look, if you're going to write historical fiction — and a novel apparently loosely-based on your own family's story at that — by all means don't write things that will trip up anyone who's taken a history course and is halfway paying attention, or at least hire an editor who knows how to do research. ... And that's not to mention the sometimes stilted writing and the way the author decided to roll an entire decade into the final chapter and speed us to the conclusion as if we were on a runaway train. But that's a different review altogether."}, {"userName": "Phil Ford", "userReviewDate": "Mar 26, 2013", "userURL": "http://www.goodreads.com/user/show/6314861-phil-ford", "userReview": "Meh. Overly descriptive, is that a bad thing? Sometimes. Sometimes it is so oppressive that you just breeze over the chapter. Sometimes it's kind of lovely. Despite a book where SO MUCH happens, not much happens, you know? I mean, one moment you are in the Italian Alps, the next NYC, then Minnesota. So what. So much happens in the book but is so bogged down in description that the change of scenery just kind of occurs as an incident. Take World War I for example. Though it deeply affects a character, the actual dedication to it in the narrative is like MAYBE 5 pages. Granted, there are some tender moments and a plethora of sadness in the book, particularly toward the end, and yes, sometimes that works and sometimes it doesn't. The most fascinating part of the story is the era, and the wide-eyed POV of Ciro when he arrives from the simple hills of Italy to the bustle that is the United States, particularly New York City. The era is the most interesting thing in the book.NOTE: I was also listening to the audio while reading and the abrupt change of narrator from the Italian actress to author Trigiani is AWFUL. The author even skips words!"}, {"userName": "Gail Jorgensen", "userReviewDate": "Apr 09, 2012", "userURL": "http://www.goodreads.com/user/show/3206794-gail-jorgensen", "userReview": "What a wonderful book starting in Italy going to New Jersey then New York City most of it taking place before I was born.How tough times were and rent was $1.00 a month can't even by a loaf of bread for that now days.There were times my tears kept me from reading the words but loved every word and wanted more when it ended."}, {"userName": "Darcy", "userReviewDate": "Jan 06, 2013", "userURL": "http://www.goodreads.com/user/show/3380448-darcy", "userReview": "The first part of this story was very good, but it lost steam about halfway through. At first, I enjoyed Trigiani's many descriptions of food, architecture, and scenery. They invoked in me an overwhelming desire to travel to the Italian Alps and eat custard baked by nuns. After a while though, Trigiani's writing style began to get on my nerves. She had the annoying habit of wrapping up significant events from an omniscient future point of view, as though her readers are sitting beside her looking through the yellowing photographs of her family album. Considering Trigiani is writing about her own family, I can see how this happened, but it had the effect of distancing me from the story. What finally pushed me over the edge though was the unbearable rhapsodizing that took over in the last 100 pages of the novel. It was the most cliched and dull mess of wrapping up a novel that I've ever seen. My verdict: read the first 370 pages of this novel and skim the last 100 if you want to keep your eyes from aching from the perpetual rolling motion that is sure to ensue."}, {"userName": "Julia Reed", "userReviewDate": "Apr 20, 2012", "userURL": "http://www.goodreads.com/user/show/2508518-julia-reed", "userReview": "I could not put The Shoemaker's Wife down. It's a great love story, set in early 20th century America and 19th century Italy. Finally, a book about early Italian immigrants that does not involve the mafia. 2012, off to a good start! Enza and Ciro, whose story is based on the true romance of the author's grandparents, grow up just a few miles apart from each other in the mountains of Northern Italy. Both are poor, but talented. Ciro is a handsome hard worker, the village Romeo, but also good with his wits. Enza is a talented seamstress, but more than that, she's the glue that holds her family together. The smart, level-headed one with the head for business. Poverty and bouts with injustice force both to go to America at the same time, but he settles in Manhattan, and she in Hoboken. Enza's talents eventually land her a job sewing costumes at the Metropolitan Opera for the Great Caruso, one of Italy's finest singers. Ciro learns how to make shoes and succeeds in business. But still, for about 75% of the book, the \"wife\" part of the title remains unfulfilled. That's probably for the best, as the most enjoyable parts of the story are really the Enza/Ciro sort-of-love-affair. You know they're destined to be together, but circumstance keeps pulling them apart. They find and lose each other for years before they finally tie the knot, and even then, it's an uncertain thing. As I said, the first three quarters of the book, the story of the couple and their love affair, is the best part. It probably could have ended nicely with their marriage and an epilogue. Instead, Trigiani decides to drag it out for several more decades, and without the pushing of the ill-fated love affair, the story loses a lot of its tension. Still, Trigiani is a skilled writer and she does a good job evoking the eras that you're travelling in. Even if you're just coasting to the conclusion, it's a nice ride."}, {"userName": "Kim", "userReviewDate": "Sep 10, 2012", "userURL": "http://www.goodreads.com/user/show/12282052-kim", "userReview": "This book was written in such a fashion, it read like a movie. The description used to illustrate every movement allowed the movie to continue to play throughout my mind on every page. I fell in love with each of the characters, and their stories. It was so good, I read it in 4 days, staying up until 3 A.M. to find out what happened next!"}, {"userName": "Clare Cannon", "userReviewDate": "Jan 28, 2012", "userURL": "http://www.goodreads.com/user/show/3655732-clare-cannon", "userReview": "An epic tale about leaving the old country to set up life in the new, with all the uncertainty, hard work, devotion and spirit of adventure that it entailed.When Enza and Ciro meet in the mountains of Italy they are young teenagers growing up in a culture at once rich with history and humble in its simplicity. Different circumstances drive them to leave their homes and set out for the land of opportunity across the ocean. How they meet and part, and part and meet is the substance of the story, and in their lives we come to understand the courageous journey of the immigrant, a journey which most of us will find was taken in some form by ourselves or our ancestors.It is a hearty tale, neither floating over reality nor becoming bogged down in its detail, incorporating the ups and downs, the loves and struggles of life lived well. One understands what it is to have one’s heart back in the mountains of Italy and at the same time throw one’s all into this new land of opportunity born of hard work. We see sorrowful but necessary departures, the daunting excitement of new beginnings, the need to be daring and inventive and to aim high, and the struggle to bear difficult conditions with patience and hope.We see lives buffeted and yet somehow made stronger by suffering, with all kinds of hardships from the mundane to the extraordinary. Each character must face their own battles, and yet we see that they are also willing to share each other's burdens to make them lighter.This is because friendship, love and family are at the heart of this story, on their own these characters could not survive, but together they can win through all. Friendship is based on true self-giving, and the life-giving romance at the centre of the story puts to shame all shallow imitations. We are taken through the struggles of life that can help love to grow, and we understand the importance of family which – even with loss and hardship – is loved and treasured above all.We also see characters making mistakes and bad choices, and are impressed as they are confronted with forgiveness. Ciro’s young adult life is quite free with women because he doesn’t yet know how to seek the happiness he yearns for. The scenes fade to black, but there is a tone of acceptance for his liberal attitude which, while loose for his own time, would be quite normal by today’s standards. But once he puts his priorities in order he devotes himself to a new life in a way that is both realistic and convincing.Enza’s commitment to the principles of her parents is in large part cultural, and while ideally it would be lived with deeper conviction, at least in those times culture worked to preserve virtue rather than destroy it.The story has a beautiful sense of culture which is both appreciated by and contributed to by the immigrants. We meet the great Caruso and fall in love with his music, which for him is life itself. We share the joy of Enza’s discovery of the classics of English literature as she works to improve her language with the help of her young Irish friend. Then there’s Enza’s creativity with her work as a costume seamstress for the opera and the opportunities she wins to socialise with the cultural elite. And even Ciro’s devotion to the art of shoemaking helps one to appreciate this art form anew.In the Italian background we are shown a cultural faith, as though looking at spiritual devotion from the outside and not understanding it deeply. We meet two very different priests, one at the beginning of the story whose actions lead to scandal, and another later on who is noble and honourable and has given his life to the service of God. The former hurt me a great deal, because it is as though a family member who I hold dear has been tainted by fiction. This type of fiction – based on stereotypical scandal – can only do harm, even if it is not developed very far. It makes me reluctant to recommend this book, though there is so much of value in the rest of the story. That element aside, the main focus of the story is the immigrant’s contribution to our past, a contribution filled with effort, sacrifice and generosity, honour, dignity and love, vision, patience and hope. It is a journey, a history, to be pondered, a layer of the past that enriches and dignifies our present and awakens an appreciation that can inspire our future. www.GoodReadingGuide.com (Thank you to the author for supplying an advanced copy, and to Lisa for organising it!)"}, {"userName": "Phrynne", "userReviewDate": "Apr 02, 2015", "userURL": "http://www.goodreads.com/user/show/8655084-phrynne", "userReview": "Sadly I did not really like this book much. It began well with some nice descriptions of the Italian countryside and the chapters about the brother's life with the nuns were promising. However it then became a long sequence of silly coincidences and overly dramatic relationships and I found myself wishing it to be over. Possibly the worst part was the final section where we suddenly raced through a whole generation being born, growing up and getting married in the space of a few pages. Why? Kathryn Stockett is supposed to have described it as \"a rich, sweeping epic.\" I did not find it rich, sweeping or epic, just another book which needed to be a lot shorter than it was."}, {"userName": "Lydia Presley", "userReviewDate": "Aug 20, 2012", "userURL": "http://www.goodreads.com/user/show/50581-lydia-presley", "userReview": "One word summary of this book: HELLO!Seriously, The Shoemaker's Wife by Adriana Trigiani just seriously took every one of my expectations of Adriana (from reading previous novels of hers) and slapped them around and made me sit up and pay attention. The Shoemaker's Wife, folks, is how a historical story about immigration should be done.I don't even know where to begin with my review - but let me say this.. this story is so rich in background that by the time the shoemaker gets his wife, I felt as if I knew both Enza and Ciro like they were members of my own family. And, as this story is inspired from Adriana's grandparents story, it's easy to see why this story lives and breathes on the pages.There is so much for everyone in this book. The descriptions of Enzo and Sister Theresa's cooking had me wiping away the drool - aching for the gnocchi with sage and butter sauce. I cried, laughed, and sighed over the story as it moves over the course of about 30 years. And then.. the immigration - so vivid, I felt as if I was on Ellis Island with both families, and yet I longed for the mountains and the life they'd left behind as well.This is a perfect book club read - it's lavish, beautiful, and filled with a little bit of every type of perfection."}, {"userName": "Kristen", "userReviewDate": "Dec 19, 2012", "userURL": "http://www.goodreads.com/user/show/10250210-kristen", "userReview": "[if a man who has previously admitted that he is not very committed to you and with whom you've spent a cumulative two days over the course of ten years asks you to run away with him on the day you're to be married to a man who treats you like a queen, in whose company you are always happy, and will support you while you pursue your dream career - I'm pretty sure I'd laugh in the interloper's face before gleefully sashaying down the aisle. (hide spoiler)]"}, {"userName": "Margaret", "userReviewDate": "Aug 21, 2012", "userURL": "http://www.goodreads.com/user/show/4730839-margaret", "userReview": "As far as the story goes, I enjoyed it enough to give it 5 stars. HOWEVER, there are a number of glaring historical errors AND worst of all, she read the second half herself. If there is one thing that Adriana Trigiani should not do, it is to read her own books. Honestly. Other than that it was an enjoyable book that told of life, love and loss. There were lots of teary moments, and the story was easy to listen to... if one can get over AT's voice. AT is a great storyteller and writer. She shouldn't try to do everything.*****Ok, now I'm blushing as I admit that I wrote AT and gently told her that I thought she did other things better than she did reading books aloud. My goodness, sometimes I am quite bold. WELL, she sent an email back to me and graciously thanked me for my honesty. AND that they are indeed re-recording the book with just one reader. AND, then graciously offered to send me the book when it is finished. I don't know whether to clap my hands or be embarrassed...."}, {"userName": "Felicia", "userReviewDate": "Feb 21, 2013", "userURL": "http://www.goodreads.com/user/show/3071123-felicia", "userReview": "Maybe before I was a discerning goodreads reviewer I might have given this book 3 stars. Nah, not even then. Pollyanna that I am, I could not suspend disbelief to allow for all the \"random happenings\" (Enza and Chiro meeting in St. Vincent's, and Chiro just happening to return from WWI to find Enza on the day of her wedding!). The dialogue was stilted, the characters one dimensional and the writing -manipulative (don't try to pull on my heartstrings!). The author should NOT have narrated the second half of this audiobook. She is a horrific reader. This might appeal to those who are homesick for Italy, but for me, not so much.....I would have put the book down if I had to actually read it. Listening made it tolerable - and there were those times that I thought- REALLY?????"}, {"userName": "Ena Hasečić", "userReviewDate": "Jul 22, 2017", "userURL": "http://www.goodreads.com/user/show/37410962-ena-hase-i", "userReview": "Roman koji se proteže na preko 500 strana prati sudbinu dvoje ljudi od njihovog ranog i teškog djetinjstva pa do poznih godina. Prvi dio romana smješten je u malo selo u Italiji početkom XX stoljeća, dok su naredna dva smještena u Ameriku. Roman je prepun divnih opisa koji su na odličan način dočarali vrijeme o kojem autorica govori. Kao da sam cijeli roman provela negdje uz likove, posmatrajući ih sa strane. Na pojedinim dijelovima sam se morala rastužiti zbog teških trenutaka koji su ih pratili, a na nekim sam se radovala kada bi im se nešto dobro dogodilo. Likovi su odlično okarakterizirani, kroz roman jasno pratimo njihovo sazrijevanje, njihove osjećaje i dileme koje ih prate. Neću pisati o samoj radnji kako ne bih otkrila previše jer preporučujem obavezno čitanje :) vjerujem da će mnoge oduševiti kako divni opisi i rekonstrukcija vremena, tako i apsolutno predivna ljubavna priča koja ovaj roman čini posebnim."}, {"userName": "Ro Givens", "userReviewDate": "Jul 24, 2013", "userURL": "http://www.goodreads.com/user/show/3726965-ro-givens", "userReview": "Trigiani is brilliant with description - the food, the clothes, the scenery - and I really enjoyed this part (even if I can't stand Thomas Hardy!). And I loved the nuns. However, the storytelling and dialogue were a roller coaster of great to mediocre. Lots of telling, very little showing, conversations that were just awkward, and obvious plot movements. You have a line like \"At long last, he understood his mother. The veneer had always been the thing that held her up.\" followed by \"The surface had been strong, but beneath it, who knew?\" Every time I thought this is getting good something would bring me back out of it. This is a summer/beach read on an epic scale, but not a book that will affect you deeply, though I can see the appeal as a getaway read as long as you don't mind sadness at the end. I did like the story and felt the Minnesota part was particularly good (maybe because the pace picked up) even though that seems to be the part most reviewers don't like. Hated. the. last. chapter.Overall, it will make you really hungry, want to take up sewing, and travel to more beautiful places."}, {"userName": "Sara", "userReviewDate": "Jul 02, 2017", "userURL": "http://www.goodreads.com/user/show/5512657-sara", "userReview": "Tap your heels three times and repeat “I believe in coincidence.” What, you say you don’t believe coincidence exists? Well, you won’t like this story, then, because every other chapter gives you a new implausible coincidence to ponder. Sadly, even those parts of the book that do not depend on coincidence are implausible. Ms. Trigiani writes some nice descriptions of the Alps and the Metropolitan Opera. In fact, her settings are far more real than her characters.This book reminded me of those Barbara Taylor Bradford books we used to read back in the 1970’s when we were convincing ourselves that true love was around the corner and the working world was just waiting to reward us for our cleverness and work ethic. I suspect those who love this book are young and a tad romantic. Or, perhaps I am just old and cynical.I will not read anything else by this author and must confess to being a bit amazed that I was able to continue reading to the end of this one. It probably did not help that I just finished a book that was remarkable in both content and style and the comparison was unavoidable."}, {"userName": "Amanda", "userReviewDate": "Apr 02, 2012", "userURL": "http://www.goodreads.com/user/show/4193046-amanda", "userReview": "The Shoemaker’s Wife was actually my first Adriana Trigiani novel. I know, I know, I call myself a book nerd and I have never before read anything by this highly talented and bestselling author. I’m so terrible. But, honestly, none of her books seemed to grab my attention before, so I never made the plunge. The blurb for Shoemaker’s Wife, combined with the captivating cover, intrigued me. I just had to learn more. What I discovered was a delightful story that left me wanting to read more of Trigiani’s novels.The Shoemaker’s Wife is a sweeping tale of love, life and the many things that can pull people apart –and bring them together. The story begins in a small town in Italy when a young man named Ciro is banished from his town and heads to America to find a new life. He soon takes up residence as a shoe repairman in the Little Italy area of New York, and finds that America holds many beautiful young women. A young woman from Ciro’s same village who harbors a long-time love for him, Enza, also comes to Little Italy. And though Ciro has never seemed to have any affection for her before, he finds himself drawn to her.Trigiani’s newest novel is a powerful tale of Italian immigrants, romance and the real hardships of life –and the ability of the human spirit to overcome it all. Though I read an ARC of the book, the writing style was incredibly strong and polished, and though the novel was a rather large tome, it went quickly and comfortably. I found myself completely engrossed in this fascinating tale, though this isn’t usually the type of thing I read.At times heartbreaking and heartwarming, The Shoemaker’s Wife is a beautiful and sweeping tale that will keep readers glued to every page. I became so invested in these characters and their lives that they became real to me, and I celebrated their triumphs with them and shed tears for their hardships. A truly glorious read."}, {"userName": "Donna", "userReviewDate": "Oct 25, 2015", "userURL": "http://www.goodreads.com/user/show/13244359-donna", "userReview": "This is one of those historical fiction romance's that people either hate or love, depending on what side of historical truth and super detailed description, you happen to fall on. For me, I'm not a history buff so the lack of accuracy isn't a problem and if you've read any of my other reviews, you know I love well placed descriptive stokes. So 4 stars. The author is committed to painting a pretty picture. So she manipulated things to make that happen. The title is a little perplexing. She isn't the MC; but it is a \"pretty\" title. This was mostly a story about her husband.I liked the characters. They were kind of lovable. I was pulled right into the story of 2 little boys abandoned by their mother who was ill and could not care for them. I loved the descriptions of Italy. Overall this was a sweet story with a nice big bow at the end. Now I did have a few dislikes. The biggest one was the over use of the some awfully convenient conveniences. People just miraculously showed up, not just once or twice, but multiple times."}, {"userName": "Inshirah Kamal", "userReviewDate": "Aug 19, 2017", "userURL": "http://www.goodreads.com/user/show/42033066-inshirah-kamal", "userReview": "“Beware the things of this world that can mean everything or nothing.”"}, {"userName": "Melissa Rose", "userReviewDate": "Apr 25, 2018", "userURL": "http://www.goodreads.com/user/show/63778843-melissa-rose", "userReview": "“The Shoemaker’s Wife” was a buddy read that a friend of mine and I decided to do together. I had previously read the novel but was keen to read it again as I remember being quite partial to this particular work.As it appears, I had forgotten just how gorgeous this book was. While it's true that the story can be bogged down with descriptions in some parts and the second half of the novel feels rushed through, the overall story is an adventure that is worth reading until the end; the detailed imagery transports the reader into the Italian Alps, and later the USA. The experience becomes even more exquisite if you choose to listen to the audiobook while you read, as I did.I truly enjoyed spending my time wrapped up in Enza and Ciro’s love story; which became even more enjoyable when I discovered that the tale was based on the author’s grandparents. As for the audiobook version, the narrator did an outstanding job bringing “The Shoemaker’s Wife” to life; full marks to Orlagh Cassidy.I would highly recommend both this novel and its accompanying audiobook; I promise that you will not be able to get through the story without shedding at least one tear.."}, {"userName": "Diane", "userReviewDate": "Mar 29, 2012", "userURL": "http://www.goodreads.com/user/show/865502-diane", "userReview": "The first thing you notice about Adriana Trigiani's newest novel, The Shoemaker's Wife, is the stunning cover. A gorgeous woman in a tangerine colored gown strikes a dramatic pose against a wallpapered print that evokes the beauty of an Italian village. The first time I saw it, it literally took my breath away.I have read many of Trigiani's books, starting with the Big Stone Gap series, through the Valentine series, stand alone books like Rococco, and her non-fiction book about her grandmothers titled Don't Sing at the Table, and enjoyed them all, but all of the those books so clearly led her to write this masterpiece, her best book yet, The Shoemaker's Wife.Some writers are better at story (John Grisham, for example), others excel at writing memorable characters; in my mind, no author is better than Trigiani at writing the setting of the story. We fell in love with the small town of Big Stone Gap in Virginia and all of the wonderful people who lived there. In the Valentine series, we were a part of Greenwich Village, and made unforgettable visits to the Italy and Argentina.Trigiani's writing is so vivid and visual, you can picture each setting so clearly in your mind, you feel like you've taken a trip there yourself. Clothing, shoes and interior design have also played a part in many of her books, and I have often lamented that there were no illustrations of the beautiful things that were being described.In The Shoemaker's Wife, we begin early in the 20th century in the Italian Alps, both beautiful and dangerous. Young Ciro Lazzari and his older brother Eduardo are being sent to a convent following the death of their father, who was working in a mine in America. Their grieving mother was unable to to care for them.At the convent, Ciro learned to work with his hands, doing all of the chores that the nuns needed. Eduardo took to the prayer and ritual of religious life. The relationship between the brothers is so well-written; they were very different from and yet devoted to each other.Young Enza lived with her family on the mountain. They did not have much money, but her father scraped out a living ferrying people up and down the mountain with his horse and carriage.Ciro meets Enza when he is sent to dig a grave for Enza's young sister who died tragically. They share time together and a special connection is made between the two. Ciro runs afoul of the local priest when he sees him in an embrace with a young girl. The priest wants Ciro gone, and the nuns send him to America.Enza and her father also emigrate to America to make enough money to send home to build a family home. They are sad to leave their family behind, but know that if they work hard and save all their money, they will return home soon.Ciro becomes a shoemaker's apprentice in Greenwich Village. Enza works in a clothing factory, a sweatshop where she makes a lifelong friend in Irish immigrant Laura. Over the years, Ciro and Enza run into each other, and although they both have feelings for each other, they are kept apart for many reasons.Enza and Laura get the opportunity of a lifetime when they are chosen to work as seamstresses at the Metropolitan Opera. Enza's creativity gets her noticed, and she is thrilled to be able to design for Enrico Caruso, the international star of the Met.This section of the novel soars. The excitement of New York City, the grandeur of the opera house, the lovely boarding house where Enza and Laura live, the gorgeous costumes they create- I was swept away with the beauty of it all.Enza and Ciro are star-crossed lovers, but you can tell by the title of the book that they are fated to be together. They are hard-working immigrants and when an opportunity to make a better life in Minnesota arises, they take it.These characters are based in part on Trigiani's grandparents. Reading this book will encourage many people to talk to their grandparents and great-grandparents, to hear their stories, which are probably very similiar. Isn't it funny how we never think of our grandparents as young people, in love and trying to build a life, but they are precisely the people who built our country.Trigiani hits the nail on the head with her depiction of Enza and Ciro's marriage; it isn't always easy, no matter how much in love they are. There is one scene near the end that takes place among Ciro, Enza and their son that just broke my heart, and the beauty and sadness of it was both private and universal at the same time.She writes so many thoughtful passages; as the mother of two sons, this one particularly touched me:\"A man need his father more as life progresses, not less. It is not enough to learn how to use a lathe, milk a cow, repair a roof; there are greater holes to mend, deeper wells to fill, that only a father's wisdom can sustain. A father teaches his son how to think a problem through, how to lead a household, how to love his wife. A father sets an example for his son, building his character from the soul outward.\"The Shoemaker's Wife is Adriana Trigiani's most magnificent work yet. As beautiful on the inside as the cover is on the outside, it moved me immensely. This is the book I will put into all of my family and friends' hands, saying \"you must read this!\""}, {"userName": "Laurel Bradshaw", "userReviewDate": "Feb 10, 2014", "userURL": "http://www.goodreads.com/user/show/624275-laurel-bradshaw", "userReview": "Caution: May contain spoilers!I really loved this story. The author spent 20 years on it, and the historical detail is fascinating. Lots of description of clothing, food, and daily life, whether on the Iron Range of Minnesota or behind the scenes at the Metropolitan Opera with Enrico Caruso. It brings to life the lives of immigrants at the turn of the century and up through the 1930s. I really didn't want the story to end. I wish it had been made into a trilogy. The first half of the book was complete in itself - the story of Enza and Ciro growing up and ending with their at long last engagement. The second book could have covered their marriage, leaving NYC for Minnesota, establishing a business and ending with Ciro's much too early death. Enza's life as a widow could have been a third book, and this section was all too short in the book. It ended with her finally agreeing to return to visit Italy with her son and his bride, but I would love to have had the story continue with that trip, her family reunion, and the rest of her life as a grandmother perhaps....My only quibble with the audiobook was the decision to have two narrators. Annabella Sciorra had an elegant voice, and a believable Italian accent. When Adriana Trigiani took over the narration I found it distracting. Her voice almost had a New Jersey accent, and the change in pronunciation of names was disconcerting. But I got used to it. It wasn't bad - just different - and I suppose was a reflection of the big changes in their lives at that point, and that they were now Americans, not Italian immigrants.Book Description: The majestic beauty of the Italian Alps at the turn of the twentieth century is the setting of the first meeting of Enza, a practical beauty, and Ciro, a strapping mountain boy. When Ciro catches the local priest in a scandal, he is banished and sent to hide in America. Soon Enza's family faces disaster and she, too, is forced to go to America. Unbeknownst to one another, they both build fledgling lives in America. Ciro masters shoemaking and Enza takes a factory job until fate intervenes and reunites them. But it is too late: Ciro has volunteered to serve in World War I as Enza begins her impressive career as a seamstress at the Metropolitan Opera House. Over time, these star-crossed lovers meet and separate, until the power of their love changes both of their lives forever.Inspired by Adriana Trigiani's own family history and the love of tradition, The Shoemaker's Wife defines an era with operatic scope that will live on in the imaginations of readers for years to come."}, {"userName": "Sheila DeChantal", "userReviewDate": "Apr 04, 2012", "userURL": "http://www.goodreads.com/user/show/3286370-sheila-dechantal", "userReview": "As if I did not already love Adriana's beautiful writing, she comes up with this breathtaking Historical Fiction novel that made my heart leap from the very first time I seen it! Cover, title, synopsis, all three captivated me and made me want to drop everything and read it right away.As always Adriana writes characters so delightfully detailed and three-dimensional that I feel as though I would know them anywhere. Family also seems to play a large theme throughout Adriana's writing, something I bask in - the warmth the commitment, and it is shown to run deep in Ciro and Enzo as well. Written in alternating chapters, as the reader we are able to enjoy seeing the story unfold from both Ciro and Enzo's world. I followed the story line closely feeling as though I too was hanging around the corner watching what was about to unfold. The fact that a part of this book lands in Minnesota, of course, just makes me happy! As Adriana tends to do, this story is inspired by a true story, and in this case it is molded from Adriana's own grandparents who grew up in the Alps, but met in the United States after they emigrated. My final thoughts: I have read and enjoyed many of Adriana's books and this one is no exception, in fact I think this one rates as one of my favorites of her ten books. If you start this book, you are not going to want to put it down. Consider yourself warned and allow yourself a good afternoon or evening to really sink deeply into this powerful story that will cause your heart to swell and your mind to explore the possibilities... This is a book I will read again."}, {"userName": "Marialyce", "userReviewDate": "Jun 19, 2012", "userURL": "http://www.goodreads.com/user/show/1277371-marialyce", "userReview": "I have to say I was very bored by what should have been a lovely story. I can't quite put my finger on why I felt this way, other than I thought the story to be long winded. The themes seemed to be revolving back and forth so that when the protagonists were not trying to come together, people were eating food. Not to say I do not love Italian food but the book seemed to be consumed (pardon the pun) with cooking and eating and drinking wine.It was overly long and I thought the story could have been much better if it had been condensed and cut by about two hundred pages. It was the typical boy meets girl, boy loses girl, and boy finds girl again tale. There were moments of emotion, but hard as I tried, I just could not get close to the characters as they seemed a bit wooden. Was it the writing I wonder? There was a lot of \"he said, she said as well as the proverbial talking to yourself in your head. It just did not come together well for me.I do realize that this was the author's tale of family and if I did not know that fact, I would never have guessed as she herself seemed detached from the story. This is an ok read, but not one I would consider extraordinary in any way. I do know it has garnered lots of four plus star ratings, but in the case of this reader, it was just bordering on mediocre."}, {"userName": "Shellie", "userReviewDate": "May 03, 2012", "userURL": "http://www.goodreads.com/user/show/2877741-shellie", "userReview": "I love this book! I just started reading it yesterday. I have loved Trigiani's Big Stone Gap Series. But this one may even beat that well-loved series. The characters are so vivid, and the plot threatens to break your heart. All I can say is this epic tale grabs you and refuses to let go."}, {"userName": "Ivana", "userReviewDate": "Jan 03, 2018", "userURL": "http://www.goodreads.com/user/show/34937138-ivana", "userReview": "Predivna knjiga!"}, {"userName": "Amy", "userReviewDate": "Mar 30, 2013", "userURL": "http://www.goodreads.com/user/show/8443587-amy", "userReview": "My first thought when I started this book was TOO MANY WORDS. My last thought was finally, the last 50 pages written like I think she should have written the book: no more over-written landscape flourishes! But, this would not do for such an EPIC NOVEL as we are told over and over again by the reviewers, the author, the jacket, the cover and just about the book itself. No...it is a nice litte story.To be fair, the opening paragraph gave me great hopes for the book. The description of the snow and the blue dress on the stone is brilliant. Unfortunately, we leave that character and never go back. The words stay. And they take forever to say anything. I could literally scan over page after page before settling into some dialogue or action. Read, scan, repeat. In all honestly, I think I expected so much more from this book. I have read many of Trigiani's books and enjoyed them. I actually sort-of expected Enza to become a great women's shoe maker/designer that somehow hinted at being a prequel to her other books about Italian shoe makers. I think one of the things that fell flat to me was Enza's talents. She would have soared whether at the Met or in MN. I see her as a sought-after shoe designer of beautifully beaded shoes. I kept waiting for that to happen. (Okay, I get that the book wasn't really about the shoes but the author spends more time on detailing Enza's sewing at the Met -- and everywhere else -- than she does on Ciro's life-altering tour of duty in WWI.)Okay, I have used too many words as well. Jessica wrote a great review on 11/25/12 as did Christy on 11/9/12 if you want to read really well-thought out and written reviews. (I know, this was about Adriana's family. Well, it should have been written as such. It would have made a great non-fiction book.)"}], "description": "The majestic and haunting beauty of the Italian Alps is the setting of the first meeting of Enza, a practical beauty, and Ciro, a strapping mountain boy, who meet as teenagers, despite growing up in villages just a few miles apart. At the turn of the last century, when Ciro catches the local priest in a scandal, he is banished from his village and sent to hide in America as an apprentice to a shoemaker in Little Italy. Without explanation, he leaves a bereft Enza behind. Soon, Enza's family faces disaster and she, too, is forced to go to America with her father to secure their future.Unbeknownst to one another, they both build fledgling lives in America, Ciro masters shoemaking and Enza takes a factory job in Hoboken until fate intervenes and reunites them. But it is too late: Ciro has volunteered to serve in World War I and Enza, determined to forge a life without him, begins her impressive career as a seamstress at the Metropolitan Opera House that will sweep her into the glamorous salons of Manhattan and into the life of the international singing sensation, Enrico Caruso. From the stately mansions of Carnegie Hill, to the cobblestone streets of Little Italy, over the perilous cliffs of northern Italy, to the white-capped lakes of northern Minnesota, these star-crossed lovers meet and separate, until, finally, the power of their love changes both of their lives forever. Lush and evocative, told in tantalizing detail and enriched with lovable, unforgettable characters, The Shoemaker's Wife is a portrait of the times, the places and the people who defined the immigrant experience, claiming their portion of the American dream with ambition and resolve, cutting it to fit their needs like the finest Italian silk.This riveting historical epic of love and family, war and loss, risk and destiny is the novel Adriana Trigiani was born to write, one inspired by her own family history and the love of tradition that has propelled her body of bestselling novels to international acclaim. Like Lucia, Lucia, The Shoemaker's Wife defines an era with clarity and splendor, with operatic scope and a vivid cast of characters who will live on in the imaginations of readers for years to come.", "title": "The Shoemaker's Wife", "url": "http://www.goodreads.com/book/show/13127599-the-shoemaker-s-wife", "average": 3.98, "cover": "https://images.gr-assets.com/books/1329256279l/13127599.jpg", "reviews": 7662, "authors": [{"url": "https://www.goodreads.com/author/show/9219.Adriana_Trigiani", "name": "Adriana Trigiani"}], "type": [], "outlinks": ["http://www.goodreads.com/book/show/34212643-postolareva-ena", "http://www.goodreads.com/book/show/34212643-postolareva-ena", "http://www.goodreads.com/book/show/58822.Big_Stone_Gap", "http://www.goodreads.com/book/show/52471.Big_Cherry_Holler", "http://www.goodreads.com/book/show/60057.Lucia_Lucia", "http://www.goodreads.com/book/show/3673357-very-valentine", "http://www.goodreads.com/book/show/6673171-brava-valentine", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/28353727-in-twenty-years", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/20552595-how-i-became-a-famous-novelist", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats"]}