{"ratings": 4187, "userreviews": [{"userName": "karen", "userReviewDate": "Aug 01, 2013", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "this was just beautiful. i knew i was going to love it, having read two books by franklin and one by fennelly (and for me to give four stars to a poetry book is unusual), but it really exceeded my expectations. and for those of you who are wary, as i usually am, of books written by two authors, know that in this case, when both of the authors are excellent at their craft, it can be a really magical experience.it takes place in 1927, when the mississippi river is about to burst through its levees and flood 27,000 square miles of land, destroying everything in its path. this year is also at the height of prohibition, when revenue agents were roaming the land, searching for illegal stills and grabbing up bootleggers. moonshine, moonshine everywhere….this is kind of a romeo and juliet story with bootleggers. we have dixie clay, married to a slimy, cheating bootlegger named jesse, who has swept her away to a lonely existence and given her a son to whom she devoted all of herself until he died of smallpox. desperate for distraction, she begins making the 'shine herself, while jesse becomes the businessman, taking long trips to \"make sales\" while she is left behind, desolate and lonely on the edge of a town that looks down on her for her illegal activities, while still buying her wares. her life is routine, mourning, and regret.ingersoll is a man who grew up in an orphanage, went directly from there into military service, and from there into a job as a revenue agent, with no pauses for family or companionship. his closest friend is fellow-agent and former officer ham, with whom he comes to hobnob, a town in which two revenue agents have mysteriously disappeared, and where they expect to find the bootlegger responsible.hobnob is a town aflutter with problems before the agents even arrive. with the river rising and fear of a flood rising with it, a group of bankers out of new orleans had offered money to hobnob to allow them to buy the town, clear it out, and deliberately flood it to relieve the water pressure and hopefully prevent their own land from flooding. but hobnob was torn with indecision, with a bunch of down-on-their-luck farmers who felt they should struggle and die on the same land where their parents had stubbled and died, and no one was able to agree on how the money was to be distributed. so the offer was rejected, but the threat of the flood is still very real to everyone living along the river. rumors of saboteurs and stolen dynamite are flowing and those who can are evacuating, taking their children and valuables away from the danger. when ham and ingersoll arrive in town, they walk into the aftermath of a store looting, which has left behind several dead bodies, and one very alive baby. they can't risk blowing their cover, but ingersoll has a soft spot for orphans, and when he learns that the orphanage has been evacuated, he asks around town and learns about dixie clay, a woman who has lost her son, and who might be very glad to have one to care for again. ingersoll brings her the baby, and is struck by her beauty and demeanor, not realizing that it is her husband they are in town to track down, nor that she is the one making the 'shine.and the waters rise.and i gotta say, i am really shocked by the mediocre response to this one so far, because i loved every page of it. they created characters that i cared about, they resurrected a largely forgotten tragedy and gave it immediacy and poignancy, they layered the story with human frailty and strength, with betrayal and hope, with stark realities and fairy-tale possibilities. it is lyrical and poetic but also harsh. it just…sings.like this:She wasn't the same proud girl she'd been, prettiest in all the piney woods, or so folks said, engaged to the prettiest fellow. She saw now that she'd married Jesse while knowing only the pretty part of him. She'd read so many books she'd simply filled in the rest.that says so much to me, in so few words. not just about the state of her marriage, but also the kind of person she is - accustomed to a certain treatment because of her smalltown beauty, dreamy and romantic and ambitious because of her bookishness… but it is so economical. and affecting.and every scene with dixie clay and willy, her foundling son, is just beautiful. i am attributing all of these scenes to fennelly's pen, on the strength of what i read in her poetry book tender hooks, which was all about motherhood, and equally lovely. That's right, God: give me a son and then set a match to him.it's hard not to fall in love with ham, with his bluff attitudes and his appetites and humor. and it's hard not to root for dixie clay and ingersoll. and the constant rising of the river forming the backdrop to their story, while the panic and resignation and plots of others weaves through and through…for me, it is an easy five stars. and i would love to see more collaborations from these two lovebird-writers, please.i said please, so it has to happen now. those are the rules.also a huge thank you to joel for stealing his mom's copy and sending it to me. i am mailing it back, although it wounds me to do so..."}, {"userName": "Will Byrnes", "userReviewDate": "Jul 12, 2013", "userURL": "http://www.goodreads.com/user/show/1526851-will-byrnes", "userReview": "Dixie Clay woke past noon, and even waking she noted that the world sounded different from when she’d retired at dawn. As she swung her feet off the bed and into rubber boots, she looked out her window. The rain lashing Hobnob had slowed, now just fat drops plopping from greasy-looking leaves. By the time she was drinking instant coffee in her kitchen, the sun was coming out. This had happened a few times since the big rains had started in November, but Dixie Clay no longer ran to the door. She didn’t look for a rainbow. No, she no longer hoped, merely waited for the rain, and when it came falling harder than ever, as if it’d stored up its strength in the interval, she took a bitter comfort in being right.\nWhen we think of great natural disasters in US history some chestnuts of misery pop readily to mind. The worst in terms of official body count (8,000) is the savaging of Galveston in 1900 by a hurricane (Isaac’s Storm). Many might offer Katrina, with almost 2,000 dead and damage over $100 Billion. How about the Dust Bowl of the 1930s (The Worst Hard Time). The San Francisco Earthquake of 1906, which killed 3,000. Maybe the Johnstown Flood of 1889. But were you aware of the great flood of 1927? Me neither. On not-so-Good Friday, in 1927, a hundred-foot wall of water burst through a levee (there were several breaches along the river) and laid waste to 27,000 square miles of land, applying the force of a couple of Niagaras to land near, and not so near the river, in effect, an inland tsunami. Image taken from \n  The Cotton Bowl Conspiracy\n blog Entire towns were erased. A million homes were destroyed. Hundreds of thousands needed rescuing. What might it have been like in the time before, during and after this cataclysm? The impending transformation of The Big Muddy to the Big Messy forms the backdrop in The Tilted World, the first joint book by husband-and-wife Tom Franklin (Crooked Letter, Crooked Letter) and Beth Ann Fennelly (Great With Child). Ted Ingersoll and Ham Johnson are undercover federal agents sent to Hobnob, Mississippi to find out what happened to two revenue agents who had preceded them, but had never returned. They happen across the results of a failed robbery, several dead participants, but find an infant survivor as well. Ted, raised in an orphanage himself, takes on the task of finding a place for the baby. In doing so, he meets Dixie Clay Holliver, a young woman married to the charming but slithery Jess, an ambitious sort who cares for money in inverse proportion to his regard for his marital vows. He is not above using violence to get his way. Dixie Clay, 22, had lost her own baby to illness. Neither she nor her marriage had ever fully recovered from the loss. Dixie leaps at the opportunity to satisfy her maternal drive. Problem is, Dixie and her Jess are bootleggers the feds are looking to shut down. Genesis-level relentless rain keeps the river rising and the people nervous. Some rich folks in New Orleans would like nothing better than to blow a levee upstream in order to reduce the risk to their property, and they may have found someone willing to help.There is plenty to like in The Tilted World. Our co-stars Dixie Clay and Ted Ingersoll (which calls for yet another pairing of the 21st century version of Tracy and Hepburn, J-Law, and Bradley Cooper) Image, from the film Serena, taken from the blog \n  College Candy\nare both very engaging. Evil does battle with good, or, well, some version of good. Babies need saving, huge danger mounts and a vast area is threatened. In telling us the story of Dixie, Ted and the town of Hobnob, Franklin and Fennelly also give us a taste for what the locals experienced in that dreadful time, the daily reports on the water levels, weather reports from up and down the river, news of threats to the security to the levee and the offer by some to actually buy the town in order to destroy it by blowing up the levee. There are also some elements of political historical interest, most particularly concerning the role and intentions of Herbert Hoover in the disaster recovery. (Heck of a job, Herbie.) It is an interesting, engaging and fast-flowing read. You will care about the two main characters and learn something about the time and place. However, there are significant problems with the book. One is a cartoonishness. Dixie Clay is presented at times with a Disney-like aspect. The authors had already established that Dixie is a good egg, but give in to a princessy urge when they gild that lily by having her free a trapped hummingbird. I guess the dwarves were not available, although a relation of her husband fills some dwarfish roles later.Image taken from \n  BplusMovieBlog.com\nHer husband, Jess, is such a black hat he should have been named Snidely Whiplash. There is a corrupt local sheriff who refuses to listen to reason, (where have we seen that before?) and, returning to Disney, there is a particular affinity for orphans here. Toss in an addled flapper who reeks of madness. This is too bad, as the informational payload of the tale is considerable. Another significant gripe I had with this novel was that a core conflict is resolved off screen, and is related to us by a participant. This should have been in center stage. The ease with which Ted and Dixie locate some missing folks strained credulity as well.But I do not want to end with a negative slant. There are very compelling scenes of the flood, burning of Atlanta, cinematic opportunities of the highest order. Dixie and Ted are very engaging. Despite her hummingbird moment, Dixie is more Mulan than Snow White, (the cartoon Snow, not the more kick-ass version in the current TV show, Once Upon a Time) a tough and determined survivor with very positive inclinations. If you can retain behind a mental levee concern about some of the questionable choices made by the authors you will definitely enjoy The Tilted World, come hell or high water. ==============================EXTRA STUFFHere is a Wikipedia entry on the the Great Mississippi Flood of 1927Archival footage of the event, a signal corps filmRiveting photos of the floodPosted July 23, 2013"}, {"userName": "Candi", "userReviewDate": "Feb 21, 2017", "userURL": "http://www.goodreads.com/user/show/3639005-candi", "userReview": "The year is 1927, the year of the Great Mississippi Flood. \"The levee at Mounds Landing, near Greenville, Mississippi, collapsed, and a wall of water one hundred feet high and with twice the force of Niagara Falls scooped out the Delta. It flattened almost a million homes, drowning twenty-seven thousand square miles, sometimes in up to thirty feet of water, and the water remained for four months. Over 330,000 people were rescued from trees, roofs, and levees. At a time when the federal budget was around three billion dollars, the flood caused an estimated one billion dollars’ worth of property damage.\"Authors Tom Franklin and Beth Ann Fennelly, husband and wife, teamed up to write this absorbing fictional account based on one of the largest national disasters of all time. It is also Prohibition, and bootleggers are rampant, with the fictional town of Hobnob boasting one of the most prosperous stills in the region. Wed to Jesse Holliver at the young age of sixteen, Dixie Clay realized she may have gotten in over her head. Before long, Dixie stumbles upon a still on her own property and is determined not to sit by and feign ignorance. Soon her own moonshine \"became the best in Washington County. So clear you could read a newspaper through it.\"Where there are bootleggers, there are bound to be federal revenuers. When two revenuers sent to Hobnob to investigate rumors of a large still turn up missing, Commerce Secretary Herbert Hoover sends in a pair of his most principled undercover revenue agents to find out what went wrong. Agents Ham Johnson and Ted Ingersoll travel to Hobnob passing themselves off as engineers tasked with inspecting the threatened levees of the Mississippi. I loved these guys! We learn a bit about their backgrounds – especially that of Ingersoll. He really made the book memorable for me. Both are the type of men you would want at your side during an emergency. They’re tough, dependable, and honorable. Ingersoll grew up as an orphan and is definitely the more tenderhearted of the pair. When he and his partner come across an abandoned baby, he takes matters into his own hands and it becomes his personal mission to find a home for his new charge. His interactions with the baby will melt your heart! Ham is harder to read, but we trust him just as much. He’s not one for sentimentality and just wants to get the job done. As a team, the two couldn’t be more perfectly matched. \"Ham could tease out a man’s secret through cunning, buffoonery, or charm. Ingersoll could learn it by disappearing, an oak of a man blending into the forest until you forgot the oak had ears. Together, separately but together, they could always find the rotten apple, the rotten worm in the rotten apple.\"Dixie Clay, too, is a character that grew on me. One can feel for her, stuck in a marriage with a man whose personality turns out to be just as contrary as his two different-colored eyes. She is trapped, far from her home, and with no friends in town. Tragedy has struck at the core of her being and left her a changed woman as well. \"Dixie Clay knew now that the world was full of secret sorrowing women, each with her own doors closed to rooms she wouldn’t be coming back to, walking and talking and cutting lard into flour and slicing fish from their spines and acting as if it were an acceptable thing, this living.” With the waters rising and danger imminent, Dixie will have to make some choices and will need to ask herself who she can trust. With the risk of an impending flood, the whisper of a betrayal to the town’s safety, the menace of saboteurs, and the violence provoked in those with the most to lose – or perhaps gain – the plot moves at a fast and exciting pace. The only thing missing for me personally was learning about the aftermath of this historical event. I felt that the last section of the book could have focused on this a bit more, rather than simply tying up loose ends with the fictional characters. It also seemed a tad bit ‘easy’ for those involved, considering the enormity of the event. Regardless, it was a very compelling read and one that I would certainly recommend. I am even more enthusiastic than ever about reading another of Tom Franklin’s books – Crooked Letter, Crooked Letter – that has been gathering dust on my bookshelf!"}, {"userName": "Margitte", "userReviewDate": "Oct 06, 2015", "userURL": "http://www.goodreads.com/user/show/7481492-margitte", "userReview": "1927. Hobnob Landing, Mississippi, population 3244. The town was nestled where the Mississippi doubled back like a black racer fixing to bite its tail.Who could have predicted, when the engineers corseted the river, straightened it out, that a flood of this magnitude would reclaim the original flow, destroying the government levees which was suppose to defy God's ideas about this mighty river?\"It is time to tell you a story, a story that will surprise you. The year was 1927, and Lord, the rains did rain. Your mama was a bootlegger, and your daddy was a revenuer, so they were meant to be enemies, natural enemies, like the owl and the dormouse. But instead they fell in love.This story is a story with murder and moonshine, sandbagging and saboteurs, dynamite and deluge. A ruthless husband, a troubled uncle, a dangerous flapper, a loyal partner. A woman, married to the wrong husband, who died a little every day. A man who felt invisible. But most of all, this is a love story. This is the story of how we became a family.\"More from the Epilogue\"So later, when she is ready, she will be able to say, Son, it was the greatest natural disaster our country had ever known. How big, Willy, was the area that was drowned? About the size of Connecticut, New Hampshire, Massachusetts, and Vermont. Of course, if it had been those states, we’d have had help right quick. Supplies. Money. Later, chapters in the history books. Monuments everywhere. But it was Delta dirt, the richest dirt in the nation, though under the boot soles of the poorest folk. The official death toll would be reported as 313, though we all knew the real number was much higher, Willy, much higher. Coolidge never came to the suffering people. In the months that followed, four governors and eight senators would beg him to come, to turn the eyes of the nation on the South. But Coolidge did not come. And was not reelected. Hoover, darling of the newsreels, star of the Sunday supplements, did surf the flood to the presidency, as he’d predicted. This flood, now forgotten by much of our nation, changed what our nation became.\"All Dixie Clay Holliver had to guide her into married life at the age of 16, was the two books her dad gave her to take along: Husband and Wife, The Physical Life of Woman and  Getting Ready To Be A Mother. She also did not ask questions when she landed up a few miles outside Hobnob on a small farm holding with a hidden still. Isolated and secure. No federal revenuers and agents could possibly become interested in it. Her husband, Jess, was a beautiful man. She was happy and contented to become an inhabitant of Hobnob, where quarter boats, showboats, and the huffing, puffing, hooting and grinding steamboats with rattling paddle wheels, filled with black thumbs, gamblers, hustlers, and medicine men, could do as much hobnobbing as they wanted.Jess Holliver was a busy man. Very busy. He knew how to change the cause of the town's history by the click of a finger or the wink of his green eye. The blue eye was for something else. His face was Dixie Clay's most important wedding present.She did not follow the road, no, she sat and watched her twenty-year old ambitious husband. He was used to be admired by different people for different purposes. She would learn more about him through trial and error, but traveling with him to her new home, was pure joy and happiness.Two revenuers disappeared. Two undercover federal Prohibition Agents was sent to Hobnob to investigate their case. Ted Ingersoll and Ham Johnson arrived in the rain, when the water was still on the rise, the people nervous, the future uncertain. Anything could happen...not everything that happened could be called natural disasters though. As with all other luck in life, some people immediately saw an opportunity to score big ... This book was pure joy to read. Good and bad; honorable and more adventurous; politicians and hooligans - all appear on the stage, and somewhere a little baby is found abandoned at a murder scene. Captivating, riveting, entertaining: a sleep-snatcher that had me awake for two nights in a row, with the kindle stashed into some documents during the day for good measure! This book is grit-lit with a particular feminine-lite approach. There's no romanticism or false nostalgia though. Neither is there a overly picturesque rendition of Magnolias and moonlight. It's all about the battered glory of southern Moonshine and Marlboros, combined with a touch of romantic, fairytale-elements as a spice-noir surprise for adults. Yes, the drama hides a hint of a little princess, a big bad wolf, a scrooge, added as a secondary threat, to lurk somewhere in the darkness of the night, waiting. But who cares. This is southern prose at its finest. This historical fictional tale confirms the true storytelling tradition of the region so diverse and complex in its make-up. The last 150 pages lost me a little. I did not feel the rhythmic cadence of the language like in other southern literature either, but it was nevertheless the expected delight I was anticipating in this genre. Recommended for sure. A wonderful read!"}, {"userName": "Lawyer", "userReviewDate": "Oct 25, 2013", "userURL": "http://www.goodreads.com/user/show/3025547-lawyer", "userReview": "The Tilted World: Tom Franklin & Beth Ann Fennelly's Tag Team NovelI've followed the career of Tom Franklin from his initial anthology Poachers. He is a dizzying wonder of the genre that has become known as \"Grit Lit.\" These are the stories of the Rough South hearkening back to Harry Crews, Tim McLaurin and others. He's provided the introduction to Grit Lit: A Rough South Reader that gives about the best explanation of this growing subgenre of Southern Literature I've read.Read through his collected works following Poachers--Hell at the Breech based on The Mitcham County War in Clarke County, Alabama; Smonk, in which a vile dwarf vows to kill every man in another small Alabama town, and you wonder where this pleasant man with a winning smile comes up with his ideas. Franklin mellowed somewhat with Crooked Letter, Crooked Letter. In fact, I told a close goodread friend I thought this was Franklin's effort at a breakthrough novel, winning a wider audience.In short, I admire Franklin's skill as a writer greatly. However, as an avid reader, I've noted women don't fare too well in his previous stories and novels. His tales generally comprise the world of men. It's not that they are absent. In Smonk, ladies abound, but only as widows as Smonk sets out to weed out the male population. Now, there's an exceptionally tough young woman named Evangeline on Smonk's trail. However, let's just say, as a woman she has some serious issues, capable of the same degree of violence as Smonk.You'll find a fairly substantial female role in Crooked Letter, Crooked Letter. Unfortunately she was a murder victim.Now, Tom Franklin seems to have gotten in touch with his feminine side. Don't be fooled, although goodreads shows Franklin as the sole author. His co-author is his wife Beth Ann Fennelly, noted poet, head of the MFA program at the University of Mississippi (Tom's boss?) and the author of Great with Child: Letters to a Young MotherI've had the pleasure of meeting Tom Franklin upon the debut of his last three novels. Chatting with him is always a pleasure. Recently I saw him at Square Books in Oxford, Mississippi, excitedly asking Daniel Woodrell to sign HIS latest, The Maid's Version. I asked Franklin how was it co-writing The Tilted World: A Novel with his wife. He gave one of his trademark grins and said, \"We survived.\" Indeed they did. And before we get to the meat of the coconut, I hope this won't be their last collaboration.Here's the writing team:\n  Franklin & FennellySet in the small river town of Hobnob, Mississippi, during the Great Flood of 1927, Franklin provides the grit we've come to expect. However, the star of this novel is Dixie Clay Holliver. She was originally a Birmingham, Alabama, girl. But charming Jesse Holliver began to call on her in her family's home when Dixie was just twelve. Holliver dressed well. He claimed to be a wealthy trapper earning great profits trapping furs.Dixie's family consented to Holliver's proposal when she turned sixteen. On reaching Hobnob, Dixie Clay learned she was married to one of the biggest bootleggers who business extended from Mississippi, up through Tennesse, and over to Alabama. Although Dixie would be a jewel for most men, Jesse was a sporting man, not about to abandon his visits to the ladies of all the gentlemen's night visits in the area.Dixie's a practical woman. She learns fast. It would be best if she took to tending the still while Jesse took over just the distribution. Dixie Clay's a crack shot and finds she manufactures the best whiskey ever produced in the area. She adds class to the product, bottling the whiskey in labelled bottles. Business is just fine.However, Jacob, the son Jesse makes on her dies young. She is humiliated to track Jesse down at one of the local sporting houses, asking the Madame for her husband to come down. Jesse's answer is simple. There'll be other babies.But more is coming to Hobnob than the Great Flood. Two Prohibition Agents have paid a call on Jesse. He claims business as usual telling Dixie he bribed them. Dixie suspects Jesse just may be a murderer because those two Agents have gone missing according to folks in town.Neither Jesse or Dixie Clay know that Herbert Hoover, the Secretary of Commerce, who has been sent by Calvin Coolidge to head up flood control and rescue operations, has sent out two unbribable Prohibition Agents, Ted Engersoll and Ham Johnson to find the missing agents. The two have been partners since watching each others backs during World War One. The men are posing as levee engineers to cover their real reason for coming to Hobnob.\n  The Great Humanitarian? Hoover will be swept into the White House as a result of his presence during the Great Flood.Along the way, Ted, who was raised an orphan finds a dead family. Only a small boy, an infant survives. Ted checks out the local orphanage, finds it unacceptable, and fosters the child until by chance he crosses the path of Dixie Clay. Hearing Dixie has recently lost her own child, what better solution could Ted have found than a bereaved mother. Ted leaves the child having no idea this new mother is the best bootlegger around.Ted and Ham fuss over Ted's delaying their mission by rescuing the child. Ham will fuss even more when Ted begins to slip away, drawn to Dixie Clay whom he finds beautiful.As the river rages, the levees are tested. Will they hold? The danger of saboteurs is real. Should somebody from the Arkansas side blow Hobnobs levee it's the Mississippi side that will flood. Jesse's in the thick of it as you would expect. Business is business.The river and its tributaries are at their most treacherous. The Indians called it \"The Place Where the World Tilts. Hobnob, filled with refugees from upriver, is a tragedy waiting to happen.\n  Just one image of the aftermath of The Great FloodFranklin and Fennelly keep the pace fast and furious. These two writers have created a fine and satisfying read you will hate to see come to an end. This is a team of literary soul mates.This is a solid 4.5 Star read. The only thing preventing that remaining .5 is that by focusing on the story of this small band of main characters, the full impact of the Great Flood is lost, Franklin and Fennelly's fine historical prologue nevertheless present.My opinion is further influenced by having read Rising Tide: The Great Mississippi Flood of 1927 and How It Changed America by John M. Barry immediately following my read of this fine novel. John M. Barry has written one of the most enthralling histories I've read in years.For what it's worth, read The Tilted World: A Novel first. Take a break. Then delve into Rising Tide: The Great Mississippi Flood of 1927 and How It Changed America."}, {"userName": "Diane S ☔", "userReviewDate": "Sep 29, 2013", "userURL": "http://www.goodreads.com/user/show/4159922-diane-s", "userReview": "The Tilted World The 1920's was a time for a great many changes, it also ushered in a tremendous opportunity for crime. Prohibition, bootleggers, saboteurs, and revenue men all have a prominent role in this book. There was also one of the greatest natural disasters to ever strike the United States which happened in 1927 and affected those along the Mississippi River, from Cairo, Illinois all the way to Mississippi.Loved the history behind this book, but also loved the characters. The Civil War had Scarlet and Rhett, the carpetbagger and the southern belle. This book has Dixie Clay, the bootlegger and Ingersoll, the orphan and revenue man. Not quite as contentious and intense a relationship but then again Gone with the Wind was much longer. Anyway it all comes together and yes it is fairly predictable in a way but Ingersoll is a character worth reading this book for, even if the history and the big flood is not of interest. Good book, really love how Franklin writes. ARC from publisher."}, {"userName": "Pamela", "userReviewDate": "Apr 04, 2014", "userURL": "http://www.goodreads.com/user/show/20048096-pamela", "userReview": "“This is a story with murder and moonshine, sandbagging and saboteurs, dynamite and deluge. A ruthless husband, a troubled uncle, a dangerous flapper, a loyal partner. A woman married to the wrong husband, who died a little every day.”Nineteen-twenty-seven was a golden time for much of the nation – the affluent, jazz infused, flapper swinging, speakeasy Roaring Twenties - but not for those living along the Mississippi River and its tributaries like the Gawiwatchee. The only ‘roaring’ that residents of Greenville, Mississippi and fictitious Hobnob, Mississippi were concerned with were that of bubbling, churning, broiling, rain-swollen rivers, creeks, and streams pressing upon and weakening inadequate levees. “The flood had made regular folks desperate, and desperate folks downright reckless. Reckless, jobless, hopeless. You can’t be hired as corn sheller when the corn’s been drowned.”Foks were on edge, and rightfully so. Every day leading up to the floods of Good Friday, farmers watched their crops – cotton, corn, soybeans, sorghum – molder and mire in the rain and mud. And despite being sandbagged against rising waters, damp air and rising water still found its way inside houses and stores, churches and schools, causing sickness and general feelings of malaise. But for Dixie Clay, her worst heartaches weren't wrapped in rain, but in sorrow, moonshine, and babies. It was one thing having a husband gone for days and weeks on end peddling moonshine, but a lying, philandering, murdering, scheming, whoring scoundrel, who can abide? And with revenuers, Ham Johnson and baby-bequeathing Ted Ingersoll poking around looking for stills and two missing agents who were presumed dead, things were surely fixin’ to come to no good. Or is there reprieve for the scarred and scorned? The Tilted World: Historically sound, southern grit-lit drama-noir steaming with atmospheric rawness and character-driven suspense that pulled me in and towed me under. At times, I caught myself holding my breath from the onslaught. Franklin is certainly gifted with ability to draw readers in and hold them captive. Albeit, there were a couple places mid-book that stalled, slightly. And the diner scene toward the end gravitated toward sappy. Even so, “The Tilted World” is a highly recommendable novel for fans of historical fiction cut with a dark edge and southern grit bite.4 Stars: fierce, well-written, atmospheric and character rich, gritty stars."}, {"userName": "Snotchocheez", "userReviewDate": "Dec 09, 2013", "userURL": "http://www.goodreads.com/user/show/1899836-snotchocheez", "userReview": "I've consistently sung the praises of Tom Franklin's lofty brand of deep Southern (US) fiction. From his Grand Guignol splatter-fest historical fiction (Hell at the Breach and Smonk), to his short stories (Poachers), to his contemporary look at race relations, cloaked in a murder mystery (Crooked Letter, Crooked Letter) I've enjoyed everything he's written. I was really leery, though, about  The Tilted World, and put off reading it for nearly a year, mostly because I just could not envision a collaborative effort with his wife, poet Beth Ann Fennelly. (The above cover didn't do much to assuage my fears this was gonna be some emasculated watered-down chick lit-ty version of Franklin).My fears were (mostly) unfounded. This is (for the first 3/4ths of the book, anyway) a superb page-turner and an informative (if fictional) account of one of the worst disasters ever to befall the South in the Twentieth Century: The Great Mississippi Flood of 1927. The novel also features the first time Tom Franklin has penned a strong female leading character (the memorable moonshiner Dixie Clay) and a romance (between she and revenuer Ted Ingersoll, sent to tiny Hobnob, MS to enforce the Volstead Act and investigate the disappearance of two fellow federal agents).The writing between tag-teamers Franklin and Fennelly is seamless (which shocked me a little, given Franklin's singularly unique, typically male-centric voice). The romantic elements, though a weensy bit contrived, are, for the most part, believable, and make even me (the Romance-phobe) cheer on the unlikely match of cop and criminal. Plus, even if romance doesn't float your boat, there are enough juicy plot elements concerning the flood and the government's response to it (evoking memories of Katrina) to make you overlook the cheesier stuff."}, {"userName": "☮Karen", "userReviewDate": "Sep 25, 2013", "userURL": "http://www.goodreads.com/user/show/1076079-karen", "userReview": "The history of the 1927 flooding of the Mississippi River was fascinating, and evidence that Mother Nature knew how to wreak havoc back then same as today. The writing and word choices were delightful. I loved the Revenuers' stories, the bootlegger/antagonist, and his wife Dixie Clay, \"a woman married to the wrong husband, who died a little every day.\" The flood is a major part of the story, what these people were doing leading up to it and after, \"sandbagging and sabateurs, dynamite and deluge.\" But it also turned out to be a nice love story -- how a family can be created from nothing but love and lots of gumption."}, {"userName": "Matt Brady", "userReviewDate": "Aug 11, 2013", "userURL": "http://www.goodreads.com/user/show/7881793-matt-brady", "userReview": "Moonshine and murder in backwoods Mississippi on the eve of the Great Flood of 1927, one of the worst natural disasters America has ever suffered, an event that has been largely forgotten today. It's a great setting for a novel, which is part of the reason I was annoyed that so much of the page count was taken up describing a goddamn baby. You know what's cool and interesting? Redneck moonshiners matching wits against undercover revenue agents on the banks of a rapidly swelling river threatening to blow at any moment. I was down for that. Buckled in and ready to go. The Roaring Twenties with a Southern drawl? Sign me up. And then they go and throw a baby in there, and suddenly i'm reading page after page about changing nappies and the best croup home remedies and, oh, look how cute he is! I held out hope that the baby was going to grab a tommy gun at some point, or maybe turn out to be a flask of moonshine disguised as a baby, but no, it was just a regular dumb baby.It's not a bad book, but I never felt engaged, and then the aforementioned baby came along and suddenly it's like Look Who's Talking except without a Bruce Willis voice-over. The two main characters have tragic backstories that just felt manipulative, like the authors were trying too hard to make them sympathetic and the story itself just kind of meanders along. I've only read one other Tom Franklin novel, Crooked Letter and it was also a slow burn, but where that felt like it was building the tension nicely, this just dragged a bit and then sputtered out.I give this book 4 out of 5 babies which is actually a bad rating because I don't like babies and I sure as hell don't like reading about them."}, {"userName": "Josh", "userReviewDate": "Aug 01, 2013", "userURL": "http://www.goodreads.com/user/show/10773168-josh", "userReview": "Great job Tom.....or great job Beth Ann.....who knows? Regardless of the author, or combination, I liked it. My guess is that the Mrs. had much to do with this work. Tom has proven to me he can rip my guts out and make me smile (Poachers is a personal favorite) and he has a soft side as well (Crooked Letter, Crooked Letter has emotions out the wazoo), but something about this one gave me a different take? Did the barrel age on a different rack or was it a different mash bill? I suspect a little of both.The story is a somewhat predictable tale of polar opposite ends of the citizenry colliding, clashing, and finding their common places together. Set against the historic backdrop of the too often unknown flood of 1927 (see https://en.wikipedia.org/wiki/Great_M...). Complete with moonshiners, river people, town gossip, and revenuers on a mission to wreak havoc where need be. This is semi-grit lit that you can feel comfortable recommending to your friends without fear of them thinking you're a sicko (which is sometimes half the fun). A warm up if you will. Great story, good pacing, and just enough rough and tumble to keep me moving along downstream (or through what used to be a stream and is now spread out to Kingdom come). Read along- just don't expect the Franklin from Smonk."}, {"userName": "Carol", "userReviewDate": "Jan 26, 2014", "userURL": "http://www.goodreads.com/user/show/3845138-carol", "userReview": "Even though I read and loved Crooked Letter by Tom Franklin, I wasn’t sure that this one would be as interesting because it’s about a 1927 flood in Mississippi. I shouldn’t have been concerned. Tom Franklin is a wonderful storyteller. Apparently his wife is too. They collaborated on this novel. This was a well-researched historical novel about a natural disaster that forever altered the lives of countless flood victims along the banks of the Mississippi. Surprisingly, it is also an unlikely but very engaging tale of a love story between a revenuer, a bootlegger and an abandoned baby. I found the novel to be a beautiful blend of resilience and gentleness. In the end, I was also enlightened about a largely forgotten tragedy in American history.I received a free copy of this book for review through the Goodreads giveaway."}, {"userName": "LeAnne", "userReviewDate": "Feb 23, 2015", "userURL": "http://www.goodreads.com/user/show/7862560-leanne", "userReview": "Tom Franklin's books have always pleased me, and this one did not disappoint. Living in New Orleans, the idea of massive levee failures and widespread flooding is something that I can relate to, and the background tension that Franklin built in to the novel was palpable. The scene where Ing's horse, Horace, feels reverberations from the levee underfoot, while brief, spoke to me. He painted that frightening suspense throughout the novel quite well.If you've never read any of Franklin's works, I would recommend Crooked Letter, Crooked Letter before this one. The characters here were not as complex. The protagonist, Ingersoll, was absolutely loveable, but he had no bad traits whatsoever, nor did Dixie Clay. Her rotten husband, on the other hand, had no positive attributes to speak of.Franklin's Hell at the Breech was a bit too harsh with bloody violence thrown in, seemingly, for no good reason. The Tilted World came across like its moonshine - a bit too full of sugar. Crooked Letter, Crooked Letter was for me the perfect Goldilocks work from this author - just right. I will certainly be tasting his other works soon!"}, {"userName": "Sonja Arlow", "userReviewDate": "Sep 27, 2015", "userURL": "http://www.goodreads.com/user/show/6449756-sonja-arlow", "userReview": "Set against the backdrop of the Mississippi flood of 1927 for some reason I expected a much heavier read but there was a lot of feel-good to be had here. The story is set in Hobnob, 3,000-odd people \"nestled where the Mississippi doubled back on itself like a black racer fixing to bite its tail\"This is a place full of murder and moonshine, sandbagging and saboteurs, dynamite and deluge and all the characters leapt off the pages. The telling is split between Dixie Clay, a bootlegger who lost her son two years ago and Ted Ingersoll, an IRS agent searching for two murdered revenue agents with his partner Ham Johnson.I loved Dixy Clay (especially her name) and could feel her isolation and loneliness while working on distilling the moonshine for her good for nothing husband Jessie. The dialogue between Ham and Ingersoll had a constant undercurrent of humor and I also found their friendship and history together so satisfying to read.This is a collaborative novel between the author and his wife but at no point did the story feel disjointed by the slightly different writing styles.This does come with a small warning, the story has a bit of romance which is normally not my cup of tea but it was not forced in into the story so should not put anyone off from reading this interesting slice of American history."}, {"userName": "Jeanette", "userReviewDate": "Feb 14, 2014", "userURL": "http://www.goodreads.com/user/show/11869072-jeanette", "userReview": "The historic locale and dire flood in hard, hard times tone was perfect. But that's about the only thing that was, for me. The writing was conducted in this novel by the current fad mode of using continual or alternating time and place hops. And with different focus of \"eyes\" description and dialog styles in varying chapters on top of it. Well, it ruined the entire connection of interest and plot tension as a reader, in my case. Beyond that, the story was so contrived and unrealistic in the time frames noted. I cared about Dixie and the baby-but other than that? Really, really liked Crooked Letter. They should absolutely write separately, this combo was awkward, particularly to character context and nuance. 2.5 and closer to a 2. I gave the 3 only because of that 1927 flood, down and out rural tone that WAS caught."}, {"userName": "Mississippi Library Commission", "userReviewDate": "Apr 30, 2014", "userURL": "http://www.goodreads.com/user/show/6193041-mississippi-library-commission", "userReview": "Sometimes books by two authors seem choppy or poorly written. This is far from the case with  The Tilted World. It's no longer business as usual for a husband and wife pair of bootleggers when revenuers come to town. They're following rumors of a big still and looking for their fellow agents who have mysteriously disappeared. Set against the backdrop of the Great Flood of 1927, the story is intriguing, the language is downright lyrical, and the characters captured our attention from the first page. Thoroughly enjoyed this one from beginning to end."}, {"userName": "Kathleen", "userReviewDate": "Feb 13, 2014", "userURL": "http://www.goodreads.com/user/show/13954899-kathleen", "userReview": "(3.5 stars for story, 4.5 for narration, 4 for history.)  I listened to narrator Brian D'Arcy James. This is fictionalized history with a strong romance thread. A Tilted World is set in April of 1927, when moonshine was prohibited and the Mississippi River flooded seven states -- to date the worst river flood in US history. The town in this photo (Greenville, Mississippi) features prominently in the book. It's located 30 miles from the book's fictional setting of Hobnob Landing.Contents include a few fade-out sex scenes, violence and murder, swearing and profanity, several baby scenes.The plot is historically interesting and engrossing, involving an orphaned baby boy, bootlegging, prohibition, rain, rain, and more rain, the bulging levees, the hellish flood, and politicking for the presidency (Herbert Hoover). The three main protagonists are likable (with some minor reservations about Dixie). I kept wondering what Ham's full name was. Hamish? Hamilton? Hampton? The villain was plenty scary enough, if somewhat inconsistent. The scenes with the baby felt realistic and sweet. I enjoyed watching our mighty warrior pin diapers on \"Junior\" and sing to him, tending him. Dixie Clay's instant attachment to the baby felt credible, since she'd lost her own infant son.The romance aspect was sweet, with some loving and a satisfying ending. Throughout the story, Agent Ingersoll occasionally played the guitar (mandolin, etc.) and sang old folk songs about the war, prison life, prohibition, etc. I wanted the narrator to sing those songs -- just clips, a few lines -- but he didn't. I liked the integration / infusion of music into the plot.Vividly memorable scenes of the levee explosion, the flood, and the disaster's aftermath (see my quotes in reading status updates). Descriptive prose: \"She clung, panting, wrapping arms and legs around the branch. The tree swayed under her like a ship, and she the masthead, facing into the storm.\"However, I felt frustrated because the pace was interrupted as the authors kept detouring into the past: Dixie Clay's memories of childhood in Alabama, and of meeting and eventually marrying the nefarious bootlegger Jessie Holliver. Ingersol's memories of the orphanage where he grew up, the music scene he knew in Chicago, his escapades in WWI. Memories of how Ham Johnson and Ted Ingersol became war buddies and then partnered up as Federal Revenue agents, catching bootleggers during the prohibition era.Digressing into the past slowed the pace too much. It wasn't until about 70% into the book that I felt the pace flowing along rapidly, like the river itself. If the book had more forward momentum, I would have liked the audio much more. The historical element was interesting. I learned something new. Lots of vivid and descriptive scenes of the exploding levee and the catastrophic flood itself. Not much about race relations, inequity, and the Black migration to Chicago and all points north, despite what the synopsis says.Bottom line,  The Tilted World is good, but not great. It's a bit overrated, both as a story and as a slice of history, but better than most books on the market."}, {"userName": "Jane Stewart", "userReviewDate": "Dec 16, 2014", "userURL": "http://www.goodreads.com/user/show/3789528-jane-stewart", "userReview": "Good story. Engaging. Interesting characters and conflicts. But too many flashbacks.FLASHBACKS:This could have been 4 or 5 stars, but the frequent use of flashbacks was annoying and kept making me angry. Who is telling authors to use flashbacks?????? It’s criminal. “Stein on Writing” is my authoritative source which says: “Flashbacks break the reading experience. They pull the reader out of the story to tell what happened earlier.”Here’s how the flashbacks went. When I say current day, I mean April 1927. We have current day, then flashback to Dixie when she was a teenager, then current day, then flashback to Ingersoll fighting in WWI, then current day, then Dixie when she learned to make whiskey, then current day, then Ingersoll when he was a little boy in the orphanage, then current day. This was happening through most of the book. It was unsettling and unpleasant. I might have given this 5 stars if I wasn’t annoyed so much. I can accept a couple of flashbacks, but this was littered with them.AS TO THE STORY:This is fiction, but when I first saw it I thought nonfiction – about a flood in 1927. The flood is fact, but it’s merely the setting. This is a good story about fictional characters in a fictional town. Subjects include government agents searching for bootleggers and finding an orphaned baby.I loved one idea. Ingersoll is not the best looking. He thinks that if he had met Dixie when she was 16, she would not have been attracted to him. Instead she was attracted to good-looking-smooth-talking Jessie, who turned out to be abusive and bad. So Ingersoll thinks Dixie had to go through the Jessie relationship before she could realize what was important and be able to fall in love with someone like Ingersoll. (Awwwwww....... my heart)AUDIOBOOK NARRATOR Brian D’Arcy James was very good. Kathleen on Goodreads said “Agent Ingersoll occasionally played the guitar and sang old folk songs. I wanted the narrator to sing those songs – just a few lines – but he didn’t.” I agree with Kathleen. I would have liked that. There were words written that could have been sung. The narrator spoke them.DATA:Narrative mode: 3rd person. Unabridged audiobook length: 11 hrs and 31 mins. Swearing language: Religious swear words but not often used. Sexual language: none. Number of sex scenes: 3 briefly referred to, no details. Setting: mostly 1927 Mississippi plus flashbacks. Book copyright: 2013. Genre: historical fiction with romance."}, {"userName": "Nancy", "userReviewDate": "Aug 02, 2013", "userURL": "http://www.goodreads.com/user/show/3122452-nancy", "userReview": "Set against the backdrop of the historic 1927 Mississippi Flood, a story of murder and moonshine, sandbagging and saboteurs, dynamite and deluge-and a man and a woman who find unexpected love-from Tom Franklin, author of the bestselling Crooked Letter, Crooked Letter, and his wife, Pushcart Prize-winning poet Beth Ann FennellyThe year is 1927. As rains swell the Mississippi, the mighty river threatens to burst its banks and engulf all in its path, including federal revenue agent Ted Ingersoll and his partner, Ham Johnson. Arriving in the tiny hamlet of Hobnob, Mississippi, to investigate the disappearance of two fellow agents on the trail of a local bootlegger, they unexpectedly find an abandoned baby boy at a crime scene.An orphan raised by nuns, Ingersoll is determined to find the infant a home, a search that leads him to Dixie Clay Holliver. A lonely woman married too young to a charming and sometimes violent philanderer, Dixie Clay has lost her only child to illness and is powerless to resist this second chance at motherhood. From the moment they meet, Ingersoll and Dixie Clay are drawn to each other. He has no idea that she's the best bootlegger in the county and may be connected to the missing agents. And while he seems kind and gentle, Dixie Clay knows he is the enemy and must not be trusted.Then a deadly new peril arises, endangering them all. A saboteur, hired by rich New Orleans bankers eager to protect their city, is planning to dynamite the levee and flood Hobnob, where the river bends precariously. Now, with time running out, Ingersoll, Ham, and Dixie Clay must make desperate choices, choices that will radically transform their lives-if they survive.My thoughts: The details of the story includes incredible imagery so the reader is transported to this small town and, more specifically, to 1927. The talk is accurately written in 1927 style which makes it authentic but a little more challenging to understand. The book is an excellent summary of the way of life in small town Mississippi where the floods are threatening all the people have ever known, the respectable men have served in the Great War and still dream of it, Hoover is coming into his own power, Prohibition is a reality but often ignored if the right bribe is offered, and orphanages littered the country. I liked the book but I found myself struggling to get through it until about the halfway point where it picked up a bit on the action and relationships. It is authentically written and gives a realistic snapshot of life in a small town along the Mississippi where folks are divided over Prohibition and whether or not to take the payout to straighten out the river and flood the town or not."}, {"userName": "Cheryl", "userReviewDate": "Oct 06, 2013", "userURL": "http://www.goodreads.com/user/show/1976749-cheryl", "userReview": "[some sex, occasional profanity but context appropriate, spousal abuse, underage marriage, some offensive stereotyping of religious leaders, and small town law enforcement  (hide spoiler)]"}, {"userName": "Rob Slaven", "userReviewDate": "Jun 27, 2013", "userURL": "http://www.goodreads.com/user/show/14011226-rob-slaven", "userReview": "As usual, I received this book free in exchange for a review. Despite that kind consideration, my candid thoughts appear below.Our story begins with a bootlegger's wife in the 1930s. Her world is a city on the brink of disaster as the flooding Mississippi threatens to surge over its banks and turn her home into a lake.In general I tend to be rather hard on historical fiction. A lot of what is on offer from that genre is rather forced and authors seem to just be decorating a modern story with a few timely tidbits. In contrast, The Tilted World is a wonderfully rich and well-integrated story. The authors have married together magnificently both narrative and time and language to create a truly memorable tale of life, love and loss. Also, as I understand it the co-author of this novel is a poet and it's abundantly evident in some of the turns of phrase used in this novel. It reads, in many cases like a much more literary work.To sum up, a wonderfully evocative and well-crafted tale. Well worth the time."}, {"userName": "LynnDee (The Library Lush)", "userReviewDate": "Jun 18, 2016", "userURL": "http://www.goodreads.com/user/show/5099486-lynndee-the-library-lush", "userReview": "Nothing pains me more than when an adult novel features instalove. Also, the ending wrapped up a little too nicely for my liking. I did enjoy the writing and the setting, but with the instalove, too nice ending, and seemingly flat (IMO) characters, I can't give this more than 2 stars."}, {"userName": "Janet", "userReviewDate": "Jun 27, 2013", "userURL": "http://www.goodreads.com/user/show/3851272-janet", "userReview": "4.5 rounded up to 5 stars. Partially because I love the name of the main female character, Dixie Clay."}, {"userName": "Vicki", "userReviewDate": "Oct 07, 2013", "userURL": "http://www.goodreads.com/user/show/4628162-vicki", "userReview": "Fiction based on extensive research of events all too real, The Tilted World tells the story of the great Mississippi Flood of 1927 from the perspective of two people who are brought together by this catastrophic event.The book, co-written by a literary husband/wife team, tells the tale from alternating perspectives of the female protagonist, a surprisingly likeable moonshine whiskey brewer, and the male protagonist, a sharp shooting war hero turned Revenue Agent.Ted Ingersoll and his senior partner Ham Johnson have been sent undercover to the small community of Hobnob to find out what has become of two missing agents, who were last known to be in Hobnob. But unexpectedly, the first thing they come across when they get to town is a crime scene, where the survivor is a bawling baby boy, the newly orphaned child of parents desperate enough to try to rob the general store so they could feed their baby.Ingersoll, raised an orphan himself, can't bear to leave the boy at a children's home, so begins to look for a family who could give the child a home. Upon the recommendation of a clerk at one of the other stores in town, he seeks out Dixie Clay Holliver who lives a little ways out of town. She is still mourning the loss of her young son who had died in his infancy a couple of years earlier.Dixie Clay doesn't really trust the stranger, Ingersoll, but is all too willing to give the child a home. She has no idea that he is a Revenuer and he certainly has no clue that she is the one making the high quality moonshine that her shady bootlegger husband sells.If you have read Crooked Letter, Crooked Letter, you know what a great story teller and writer that Tom Franklin is. Franklin and Fennelly have created complex and nuanced characters to tell the story of the events leading up to and then following the catastrophic flood that affects the Mississippi shore from Cairo, Illinois to the Gulf of Mexico. Their writing styles harmonize so smoothly that one can't tell when one writer stops and the other begins. This is an opportunity for the reader to learn some aspects of American History in the South that I'll bet you didn't learn in school. Not to mention it is a great love story, a great redemption story, and a heartfelt treatise on what really makes a family."}, {"userName": "Jai Francy", "userReviewDate": "Oct 15, 2013", "userURL": "http://www.goodreads.com/user/show/23377575-jai-francy", "userReview": "I LOVED it. I am about write something never written in a review by me..... I am sad I only had 5 stars to give it.The Tilted World is an epic novel set against the dynamic backdrop of The Great Mississippi Flood of 1927. Being raised a Yankee, I have NEVER previously heard about this event in American History. Living in the day where tomorrow morning’s news shows will be on location at tonight’s disaster, it’s hard to imagine that there once was a time when no one showed up to such a catastrophic event especially in the light of long advanced warnings. One of the other greatest books I read this year was Tom Franklin’s, Crooked Letter Crooked Letter. Finding that wonderful book was blind luck. I now have him dialed in, for in my opinion, as a writer he is close to perfection. Because of that, I did not read the synopsis given by the publisher before purchasing or starting this novel. Afterwards when I did, I felt fortunate that I was spared. The summary is too detailed and would take away from the suspense and surprise.In Tilted World Franklin teams up with poet wife, Beth Ann Fennelly for their first combined book. What a melodious match it is. It’s magical. I am betting that she had a close relationship with the Dixie character for the words given her and the forest were so elegantly versed and imaginative. The mind numbing descriptive phrases throughout just give this work an added layer that I so appreciate. I was completely absorbed in this book throughout. The story is engulfing with lots of twists and turns. Normally I avoid multiple authors. This is a fine pairing.I dislike book report type book reviews. The only thing necessary to tell you about the story is that a great historical flood is about to come to small area of Mississippi. There are heroes as well has opportunists and antagonists. There’s romance, strife, endurance, conflict and a baby. Seriously, do you really need more?"}, {"userName": "☕Laura", "userReviewDate": "Sep 01, 2013", "userURL": "http://www.goodreads.com/user/show/15033381-laura", "userReview": "This review refers to an ARC of this book which I received for free through the Goodreads First Reads program.In 1927, after months of unrelenting rain, the Mississippi river breeched the levee near Greenville, Mississippi, flooding 27,000 square miles in up to 30 feet of water, arguably the greatest natural disaster in US history. In the days leading up to this flood, as the river rises, revenue agents Ingersoll and Ham arrive in the fictional town of Hobnob Landing, charged with the task of uncovering the fate of two previous revenuers who have disappeared there. Ingersoll, raised in an orphanage, knowing nothing about his birth parentage and repeatedly passed over by potential adoptive parents, has always felt himself somewhat on the outside of things. When he finds another orphaned baby, he feels compelled to pursue a happier fate for this child. Meanwhile, Dixie Clay Holliver, who came to Hobnob as a hopeful young bride only to be repeatedly disillusioned by the realities of life, has taken up a life of bootlegging. When she crosses paths with Ingersoll, she finds her life forever changed. I loved these two characters and felt for them and the raw deal they had both been handed. I found the story compelling, and when the flood finally came I found myself catching my breath just imagining what it would be like to experience such a disaster first-hand. Certain aspects of this story might seem a little too neatly wrapped up for some, but I was willing for forgive a little bit of hokeyness for characters who had experienced so much sorrow."}, {"userName": "sappho_reader", "userReviewDate": "Jan 15, 2014", "userURL": "http://www.goodreads.com/user/show/17068912-sappho-reader", "userReview": "I've read references to The Great Flood of 1927 in other books but this is the first one that focused exclusively on this historic event. Tom Franklin succeeded in creating a dismal world in which heavy downpours lasted for months with no reprieve, sometimes receiving 13 inches of rain in one day. The physical and psychological consequences for those living through this were staggering.So where did all that rain go? The levee system in Mississippi was inadequate to say the least. Can you imagine a levee the height of three stories tall with water sloshing over the top? They had to keep sandbagging to keep the water out.Similar to Hell at the Breech Franklin brought alive an event in Southern history that I was not previously aware of. For this I give 5 stars. But the weakest aspect was the fictional stories created to tell the story of The Great Flood. I did not care for the love story at all. I wanted to learn more about the saboteurs and their motivations for destroying the levees. I felt Franklin only briefly touched upon this angle but I found the saboteurs more interesting than his focus - the bootleggers.Next on my list is Rising Tide which Franklin used during his own research."}, {"userName": "Sam", "userReviewDate": "May 24, 2013", "userURL": "http://www.goodreads.com/user/show/602792-sam", "userReview": "Set against the backdrop of the Great Mississippi Flood of 1927, The Tilted World tells the story of how the lives of a bootlegger, her shady husband, an orphaned baby, and two federal revenue agents will become entwined with one another. Though I had high hopes for this novel, I ended up pretty disappointed. The main story feels rather flimsy as the authors insist on featuring too much of the lead characters' backstories, which by the way, aren’t even effective in imbuing them with much depth. And while I appreciate that the Mississippi River is an important force that the townspeople have to reckon with, the frequently repetitive descriptions of the river don't help the story’s pacing either. It all just felt like a chore to get through.When we do finally turn back to the current developments at hand like what happened to a missing pair of agents investigating the moonshining operation; whether the levees and sandbags would hold off the flooding and whether saboteurs would cause the flooding themselves; and how the love story between one of the revenuers and the bootlegger develops, there’s not much story here, just broad outlines of one. And then it just ends, all wrapped up too tidily and swiftly, almost as an afterthought."}, {"userName": "Diane Barnes", "userReviewDate": "Nov 13, 2013", "userURL": "http://www.goodreads.com/user/show/7262060-diane-barnes", "userReview": "I gave this book 3 stars, but would like to add another 1/2 star. The reason I didn't rate it higher was because I loved Franklin's previous book, \"Crooked Letter, Crooked Letter\" so much that I very unfairly compared the two novels, and this one suffered for it. Larry Ott of Crooked Letter is one of my favorite fictional characters ever. I'm not sure how Franklin and Fennelly (a married couple) divvied up the writing chores, but I never really saw a great difference in style. I agree with another reviewer that the time frame was a little confusing in places, depending on the character involved. I thought I could see a woman's touch coming through when Dixie Clay was with her baby. The descriptions of the levee break and the flood waters were outstanding.All in all, a really good book, with the last 100 pages needing to be read in one sitting. My favorite character was Ham, not a main character, but the one I would most like to have spent time with. I would not be surprised to see this novel adapted for Hollywood. My choice for Ingersoll and Dixie Clay would be Bradley Cooper and Reese Witherspoon."}, {"userName": "Clare", "userReviewDate": "Feb 28, 2015", "userURL": "http://www.goodreads.com/user/show/340856-clare", "userReview": "The 2 best qualities pf this book were 1) I learned about a massive flood and its impact on the US economy, culture, northward migration, etc. and 2) it was quite engaging; I could not stop reading because I was so interested in discovering what would happen to Dixie and William.Unfortunately, some parts of the book were hard to swallow. For example, the romance that blossoms seems a little contrived as the two of them \"ride off into the distance\" at the end. And sometimes the plot seemed to good to be true; it sure was easy for Dixie to find baby William at the hospital. But still, it was an interesting read and it inspired me to research a bit and learn more about this big flood. This is yet another area of history that I've learned as an adult and wondered why no mention of it was made in school history classes.Enjoy!"}], "description": "Set against the backdrop of the historic 1927 Mississippi Flood, a story of murder and moonshine, sandbagging and saboteurs, dynamite and deluge-and a man and a woman who find unexpected love-from Tom Franklin, author of the bestselling Crooked Letter, Crooked Letter, and his wife, Pushcart Prize-winning poet Beth Ann FennellyThe year is 1927. As rains swell the Mississippi, the mighty river threatens to burst its banks and engulf all in its path, including federal revenue agent Ted Ingersoll and his partner, Ham Johnson. Arriving in the tiny hamlet of Hobnob, Mississippi, to investigate the disappearance of two fellow agents on the trail of a local bootlegger, they unexpectedly find an abandoned baby boy at a crime scene.An orphan raised by nuns, Ingersoll is determined to find the infant a home, a search that leads him to Dixie Clay Holliver. A lonely woman married too young to a charming and sometimes violent philanderer, Dixie Clay has lost her only child to illness and is powerless to resist this second chance at motherhood. From the moment they meet, Ingersoll and Dixie Clay are drawn to each other. He has no idea that she's the best bootlegger in the county and may be connected to the missing agents. And while he seems kind and gentle, Dixie Clay knows he is the enemy and must not be trusted.Then a deadly new peril arises, endangering them all. A saboteur, hired by rich New Orleans bankers eager to protect their city, is planning to dynamite the levee and flood Hobnob, where the river bends precariously. Now, with time running out, Ingersoll, Ham, and Dixie Clay must make desperate choices, choices that will radically transform their lives-if they survive.", "title": "The Tilted World", "url": "http://www.goodreads.com/book/show/40266651-the-tilted-world", "average": 3.84, "cover": "https://images.gr-assets.com/books/1527790664l/40266651.jpg", "reviews": 707, "authors": [{"url": "https://www.goodreads.com/author/show/125736.Tom_Franklin", "name": "Tom Franklin"}], "type": ["Historical", "Fiction", "Historical", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/7948230-crooked-letter-crooked-letter", "http://www.goodreads.com/book/show/214340.Hell_at_the_Breech", "http://www.goodreads.com/book/show/367625.Poachers", "http://www.goodreads.com/book/show/385530.Smonk", "http://www.goodreads.com/book/show/27131485-mississippi-noir", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/28353727-in-twenty-years", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/20552595-how-i-became-a-famous-novelist", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats"]}