{"ratings": 27801, "userreviews": [{"userName": "Bethany", "userReviewDate": "Sep 09, 2007", "userURL": "http://www.goodreads.com/user/show/259085-bethany", "userReview": "I first read this book some time ago. When I read it, I throughly enjoyed it. This year, I found my mind going back to the book several times and decided I needed to read it again.There are only two books (other than the Harry Potter Series) that I have read more than once - Cold Mountain, and now this book. While reading this book for the second time, I wondered at length, what is drawing me back to this book.The story is a dark story of a child growing up with a very difficult, unpredictable mother in occupied France. The only peaceful time that is shared by mother and child is while cooking.I have found that many people do not like stories of difficulty between children and parents. Either the readers want to escape, or they have no basis of comparison.Each book that tells a story of this kind has been attractive to me. I often see hope where others only see darkness. These children are survivors. Their spirits are not broken even though the relationships with their parents are nearly completely destroyed.This book is no different. The main character comes to realize the humanity of her mother after returning to her homestead (long after her mother dies) and opens a cafe. She finds that she has much in common with her mother and accepts the part of her that is so much like her mother.Not only does this book find the hope in a difficult and unsettling relationship, it has amazing food references! Lovely images of mouth watering dishes. Overall a very good read, and I may just read it again!"}, {"userName": "Samantha", "userReviewDate": "Jul 12, 2008", "userURL": "http://www.goodreads.com/user/show/1234815-samantha", "userReview": "I ended up liking this book in the end, and would maybe have given it 4 stars, if large parts of it didn't drive me so nuts. I just had a few problems with it. I had a really hard time getting into it; the real story didn't really start until 100 pages into it. And I had a really hard time connecting to the characters in any sort of way. The mom acts like she hates her children the whole book, and the children hate their mom. And when people waste that much energy being mean and cruel to each other, it's hard for me to relate to them, although there are some redeeming qualities that helped me be able to appreciate the story line in the end."}, {"userName": "Dem", "userReviewDate": "May 17, 2013", "userURL": "http://www.goodreads.com/user/show/2752994-dem", "userReview": "Five quarters of the Orange by Janne Harris is one of those novels that will stay with you long after you have turned the last page. 4.5 Star RatingSet in a small town in rural France during the the Second World War, this novel tells the story of a young girl by the name Framboise Dartigen and how during the occupation of the town this young girl befriends a German Soldier and what appears to be a harmless friendship turns into something which both her family and the town will never forget for years to come.The story is extremely well told and I loved how Harris writes in two time periods without confusing the reader, one takes place in the present day and concentrates on the widowed Fromboise and the other story takes place in the past when the children are young and we learn through the eyes of Framboise what happened in Les Laveuses. This is not a novel about the Second World War and does not focus on facts or figures or the details of history that some people might prefer, for me I have read a lot of books on the history of the war and I love my history books but this book tells a story all its own where the characters and the setting give the reader a sense of time and place and I found this a very atmospheric novel that I just wanted to finish in one go.The writing is beautiful and while the first 100 pages are slow paced there is always a sense from the author's writing that she is building you up for a great story.   We were always raised to keep things to ourselves. It isn't a habit which can be easily broken I loved so much about this book and really wish I had read it as a book club read as there is so much to discuss here. Its one of those books that you find out more about once you finish it when you think over all its twists and turns."}, {"userName": "Julie", "userReviewDate": "Jan 08, 2013", "userURL": "http://www.goodreads.com/user/show/14773738-julie", "userReview": "There is something a little unbalanced about this book -- and one gets that feeling from the first words in the first chapter. In fact, the title itself suggests a certain asymmetrical allure which is disconcerting: five quarters of the orange suggests a lopsided business, perhaps; but nonetheless a surfeit of something. The \"too many\" quarters-of-the-orange makes me uneasy and leaves me wondering how it will all fit back together again, once sliced. In the end, the title presages its own problematic ending. I loved Framboise from the start because contrary to the lushness that her name suggests, she is quite a tough little nut to crack. She is strong and wilful, disconcertingly honest and brave as a Spaniard. Despite that she is the youngest, her siblings pale in comparison to her; and indeed, they are written in as \"extras\" -- vapid little ghosts without much to them. Framboise's dark strength is counter-balanced by her mother's ephemeral nature. For the most part, the mother suffers in a tormented hell in the curtained darkness of her room. Her migraine headaches, brought on by the scent of oranges, keeps her absent from her own life and leaves her open to the doom that the children's mischief will eventually bring upon her.In a strange contradiction of her own nature, the mother is also a superb cook: the delicious meals she prepares would make a voluptuary blush -- an irony, and an enigma. How does one gather such fruits, (quite literally) when the rest of Europe is starving? This rang something of a false note -- but perhaps the juxtaposition suggests that out of rotten fruit can spring the most wondrous delicacies? Still ... Some of the writing falls into cliché, at times, and I found some of the scenes to be improbable. The evening at La Mauvaise Reputation, for instance, reads like the author may have had a bit of an eye on a movie-script for Hollywood, as rife as it is with patter. I did expect a somewhat more complex ending, especially given the originality and strength of the majority of the book. I asked myself ... can it really be that simple? ... Can it really be that banal? And then I started to wonder if the beauty wasn't in the simplicity after all. Whatever some of its minor problems may be, every inch of this book rings with life. The sights and scents and sounds of war-torn France grip every corner of every page and I found myself turning the pages with the same relish as indulging in an epicure's meal. I think I gained 5 lbs by reading this book, so hungry was I for the menu before me.After all is said and done: I was sorely disappointed when I reached the final paragraph, because I knew there wouldn't be more."}, {"userName": "The Book Whisperer (aka Boof)", "userReviewDate": "Apr 13, 2009", "userURL": "http://www.goodreads.com/user/show/1253478-the-book-whisperer-aka-boof", "userReview": "I am head over heels in love with this book. Only a terrific author can write about something as appalling as war and occupation and uneccesary death but yet make you feel so alive and carefree whilste reading it. The prose was as mouthwatering, succulent and juicy as the food in the book and I wanted to be there! Yes, I wanted to run down to the Loire and swim and splash and yell and hang upsidedown from trees overhanging the river and race through sun-soaked fields and pick fruit in the orchards. I wanted to sneak off on the back of bike to the nearest village to watch a film in the cinema unbeknown to my mother, I wanted to set traps in the Loire and catch fish and I wanted to go to market on a Thursday morning and sell home-made pastries. And all this under German occupation. Only a talented author can make you feel like that while telling the story of something far more sinister.This is a book about an old woman who comes back to the village of her childhood, but can't allow the villagers to find out who she really is. Aged nine Framboise and her family has to make a hasty exit from Les Laveuses and now she can't allow them to know the truth of who she really is and also what really happnened back in 1942. The book is as sumptuous as it is teasing with bits of information that allows the reader to peice all the fragments together over the course of the story and lead us to the final catastrophic moments.I adored this book; it was ripe, tangy and a feast for the senses. I want to read it all over again. But if not, it has made me hungry and now I need to go and raid the fridge........."}, {"userName": "Alison", "userReviewDate": "Mar 12, 2008", "userURL": "http://www.goodreads.com/user/show/425307-alison", "userReview": "Under the shroud of a new identity an aging woman returns to her childhood town. She opens a café and reopens the wounds of her past. In German-occupied France, 9 year old, Framboise, and her brother and sister secretly befriend a German soldier and trade secrets for black market goods. Using the black market oranges to provoke her mother’s migraine headaches, Framboise torments the woman and ensures herself unsupervised time with the soldier. The friendship spurs a series of events which affect the lives of the family and their neighbors.Now with the perspective of age, and through the encrypted recipe book/journal left to her by her mother, Framboise learns of the events from her mother’s perspective and unravels the mystery that has haunted her and shaped her life.Somewhat dark at times, this complex story is layered with symbolism and has the ability to haunt you long after you have finished reading. There are so many subtleties and nuances it would make a great book club read."}, {"userName": "Jeanette", "userReviewDate": "Dec 28, 2015", "userURL": "http://www.goodreads.com/user/show/11869072-jeanette", "userReview": "Whew, this is a wrenching read. It's excellent and 4.5 star, IMHO.The characters are not easily liked, very few are amiable, and the entire is both dramatically and emotionally tense. And that tension is for its entire length and continued within personality and character far beyond the ending. Because our narrator and others are never easy people. Beyond the war and small town France location coupled with the scrumptious cooking and foodie directions, the real core of the story is the tightly coiled personalities of the youngest daughter and the Mother. A type of personality with intense likes and dislikes and invincible quantities of what we would, in my old neighborhood, call \"moxie\". Of all the stories I have read upon WWII Resistance vs collaborators, this is the one that I would most probably pick as the most likely real/ true. Strong willed people are quite like that as children. The only aspect I found a slight bit off was Boise's age. She was far more like 11 than 9- but perhaps we need to accept that aberration, as well. I won't begin to shape this plot, nor onus of each character here. All four family members, the farm, the German charmer, the relatives in the latter 20th century- all of those were developed exquisitely in this book. And putting the challenge of catching the big pike, \"Old Mother\", as a pivot point to a climax was also masterful. In fact, her style of reveal in two time periods was not perceived as \"shifting\" at all either. It linked with same mutual mood, place or issue and just seemed seamless. This is SO rare. Often times that style method breaks the continuity of tension and progress, both. This did not- it was all of one piece tone and steady persistent pressure. The sickness, the pure will of physical act, the desires for escape or to have what the heart demands- they all burn bright in each and every page without diminishing.This is nearly a five star. I've never read this author and I sure will now. Or at least search for her other works, if any. It comes after reading several losers or abandoned in a row. And it enthralled to such a degree that I have far more enthusiasm now for researching for better fare shortly. BTW, I have not read other reviews on this one. And I know that the stalking her mother with that orange scent is most probably a big turn off and considered vile by most. But working within clinical situations, it is exactly the kind of thorn used to nettle, even now. That kind of behavior, in girls especially, is not all that obscure or noticeably rare. Not at all. And especially within girls who have no Father figure present or in strong memory. Thank you for this recommendation GR friends, it was a superb one."}, {"userName": "Susu", "userReviewDate": "Jan 15, 2017", "userURL": "http://www.goodreads.com/user/show/5507954-susu", "userReview": "I have to say that reading this novel made me appreciate Gentlemen and Players a bit more. This time I knew what I was getting with Joanne Harris- a dark atmospheric novel of psychological suspense. She can certainly create dysfunctional child characters! It is hard to imagine that a nine year old could be so ruthless, but it was a different time, a different place, and I felt for Framboise. Just as Straitley was the perfect foil in Gentlemen and Players, so Paul is in Five Quarters of the Orange. I liked them both. They help soften the brutality.One thing is certain; Joanne Harris' novels are not easily forgotten!"}, {"userName": "Stephanie", "userReviewDate": "Jul 01, 2009", "userURL": "http://www.goodreads.com/user/show/1132033-stephanie", "userReview": "Do you know, I have a much harder time writing a review for a book that I didn't particularly like than for one I really enjoyed?I didn't particularly like Five Quarters of the Orange, by Joanne Harris, but I am at a loss to explain why. I can't point to egregiously bad writing, and while I didn't like any of the characters, that itself does not a bad book make. See, e.g., my review of The Good Terrorist. Puzzled by my reaction, I asked my mother what she thought a book needed in order to be a good book. Plot, she said, and character development, and some kind of interior growth and change for the characters. Maybe that's what this book is missing: though the characters do seem unpleasantly well-rounded, I didn't see much interior growth in the main character, Framboise, and none at all in the supporting characters. I also felt that the author could have done so much more with the the material she used for her story. Ms. Harris's book concerns, in part, the relationships between a young German soldier and some French children and their mother in occupied France during WWII. Given the monstrosity of the Nazi regime, coupled with the fact that there were decent Germans and varying degrees of complicity in the Nazi monstrosity among Germans, I felt some kind of conflict in that arena was warranted. I also thought she could have done more with the morality of forming relationships with the enemy. Is it immoral, and if so, is morality in that context purely based on citizenship? Is it moral, and if so, does that mean we should disregard citizenship (not to mention the horrible war crimes of the Nazis)? Finally, I have a nit to pick. There were some beautiful mouth-watering descriptions of food that the characters cooked and ate, both during the war and some 40 years afterwards. Was life in occupied France so easy that they could eat such wonderful food?"}, {"userName": "Jean", "userReviewDate": "Sep 22, 2013", "userURL": "http://www.goodreads.com/user/show/19300421-jean", "userReview": "[ although she has troubled memories. She is determined to find out the truth, and strangely begins to pick up clues from her mother's recipe book, which she has discovered. From the cryptic scribbles she begins to learn of her mother's sensuous obsession with food, which jars with her own recollections of how cruel her mother could be. An incident dating from when Framboise was 9 years old is the key to the mystery. It involves both the soldiers and villagers, and is an incident where there is great loyalty but also a deep betrayal. (hide spoiler)]"}, {"userName": "Sheri", "userReviewDate": "Aug 12, 2008", "userURL": "http://www.goodreads.com/user/show/377113-sheri", "userReview": "I don't really know what to say about this book. I don't know if I just wasn't really into it when I started it, or if I really didn't like it as much as I thought. It took me over 100 pages to really get into the story, and I had sort of written it off by then. But then things picked up, and the last, maybe, quarter of the book finally got good. While you are reading, you know that \"something happened\" and that you will eventually find out. It was frustrating to me that she gave so little information so slowly, though. I think I was just being impatient. She spills out little hints and pieces in small doses, so she still doesn't reveal what exactly happened until the last page. Literally. The characters in this book are all negative, too. So it is not uplifting in the least. It is one of those books I need to read again to fully understand, and pay attention more the second time, but I don't know if I really want to take the time to do so."}, {"userName": "Filipe Miguel", "userReviewDate": "Feb 09, 2015", "userURL": "http://www.goodreads.com/user/show/5855795-filipe-miguel", "userReview": "Joanne Harris, sal no pontoJoanne Harris é, na sua essência, exactamente o que este livro oferece: narrativa de ritmo pausado, polvilhada de conteúdo habilmente exposto, montagem engenhosa de argumento e… descrições quase palpáveis de comidas, bebidas, cheiros e sabores.Neste “Cinco Quartos de Laranja”, na primeira pessoa, por Framboise Dartigen, acompanhamos uma estória com frequentes flashbacks de um passado de guerra, de importância crucial para entender o presente.Harris domina a arte do “levar até, dar a entender, mostrar o caminho, sem expor”. No romance utiliza variadas vezes esse artifício, diga-se, de forma deliberada, quase a pedir a atenção total do autor, a exclamar concentração. A gritar: “sim, quis dizer isso, relê para teres a certeza que entendeste o que leste”.Numa obra sem personagens para aproximar, na grande maioria frias, calculistas, com dificuldades de relacionamento evidentes, Joanne consegue a proeza de afeiçoar-nos às peripécias delas e de instigar a vontade de ler um pouco mais para compreender a sucessão de acontecimentos.Quando inicio a leitura de uma obra de Joanne Harris é precisamente isto que espero encontrar. Um romance ao nível de “Xeque ao Rei” e com os condimentos que faltaram a “Vinho Mágico”.O café está ainda ao lume, a ferver. O seu aroma é amargamente nostálgico, um cheiro negro a folhas queimadas com uma ponta de fumo no vapor. Bebo-o muito doce, como uma vítima de choque. Acho que agora posso começar a perceber como a minha mãe deve ter-se sentido, a liberdade de deitar tudo fora.Nota: 4.5/5.0"}, {"userName": "Vaso", "userReviewDate": "Feb 05, 2017", "userURL": "http://www.goodreads.com/user/show/15818014-vaso", "userReview": "3,5 αστέρια"}, {"userName": "Vonia", "userReviewDate": "Oct 23, 2013", "userURL": "http://www.goodreads.com/user/show/5204784-vonia", "userReview": "I read Harris' Five Quarters of the Orange & Blackberry Wine back to back, so I shalll review them together. They are very similar, actually; a little too much. Both feature lead female protagonists that have strong, proud, independent, walled-away personalities, unwilling to accept, let alone ask, others for any sort of assistance. In both, they are not the lead character, but as the focus of the protagonist, they are as, if not more, important. In Five Quarters of the Orange, this bold female character is Mirabelle Dartigen, the mother of present-day narrator Framboise Simon. In Blackberry Wine, Marise d'Api is the strong female lead, writer Jay Mackintosh's unfriendly, closed off, and mysterious neighbor. Like in all Harris' novels - the singular touch that ensures my return interest in her novels - both novels contain a food that serves as a saving elixir and the irreplaceable addition of magic and whimsy. The former uses an orange, the scent of which inexplicably increases Mirabelle's anxiety spells (for some time, admist verbal and sometimes physical abuse from her, Framboise surreptitiously leaves orange peels to seep through the ventilation so as to earn a reprieve). In the latter, the elixir is fruit-based wine, specifically a set of vintage '75s, which Jay Mackintosh finds in the remains of Pog Hill decades ago when he returns the summer following his unannounced disappearance.Five Quarters of the Orange tells a multi-generational story with lies, secrets, family database, but with redemption, love, healing, and perseverance shining throughout. Framboise, having had a tenuous relationship with her less than ideal mother (abusive, actually) all her life, she is surprised to uncover redeeming secrets written in code in a beloved cookbook that belonged to her. Her childhood took place during the Nazi occupation, causing more than typical difficulties in her young years. Along with her siblings Cassis & Reinette, they begin associating with a German Officer named Leibwitz. For varying reasons, each idolizes, to the point of compromising their integrity by becoming informants, providing information Leibwitz utilizes to blackmail their neighbors. They rationalize this by convincing themselves as well as each other that this is harmless; it is only words, after all, and it isn't like the Germans are murdering anyone. (Although one evening there is one somewhat accidental related death.) Framboise falls the most for Liebwitz. By, in fact, actually falling in love with him. Which leads to the event that has remained hidden for years, decades, in the family. The event that changed each of their lives forever. When he tells young Framboise that he can no longer see her, likely ever again, she cries, imploring that this not be so. When he refuses her pleas, she desperately convinces him to swim out to a dangerous area of the lake, simply to spend more time with him. He is caught in a root underwater and drowns. The three of them, Cassis, Reinette, and Framboise, surreptitiously make the body disappear, and never discuss the incident again. Their mother, despite showing no real love for them their entire lives, covers up for them when she finds out. They never know until present day that she even knew.All these events lead to the entire city shunning the family, and following one situation too many, they flee in separate directions, barely in time escaping death by the neighbors' wrath and need to designate a scapegoat. Of course, there is also the love aspect, a childhood friend, Paul, whom she eventually lets in. Together they learn to heal. If not forget, but to accept the past, their indivual secrets, and Framboise finally makes amends with her mother.Blackberry Wine I liked far less. Jay honestly seemed like an immature adult, left in the past. Worse yet, he is aware of it, yet quite nonchalant to the idea of changing. His personal relationships are minimal, he hardly allows himself aspirations, avoiding any real work. Honestly, none of the other main characters were that much better. His love interest, Marie A'pi, is a negative, closed off person for most of the novel. The ghost of Joe is more lovable, but honestly his presence was perplexing. I am typically a fan of magical realism, but the ghosts/spirituality aspect was not smoothly embedded into the story. it definitely stood out, causing the reading to seem off-kilter. Kerry, his initial love interest, was written like a bitch, clear and simple. All the other characters in the new town, neighbors to Jay, were not very deeply explored. Relatives to Marise (similar to the neighbors in Five Quarters of an Orange) were cold and unwilling to be understanding, believing only what they want to believe.The only character that was well-written for me was his childhood friend during his Pog Hills days. Gilly was courageous, spunky, and had a spirit that was lovable rather than unattractive. Marise's daughter, whom Jay initially mistakes for her, comes close to bringing back the spirit. In all, two fun reads, but I am still searching for a book from Harris in which the depth and overall significance of her words and stories match the way she has perfected the tone of magic and whimsy."}, {"userName": "Hannah", "userReviewDate": "Dec 24, 2010", "userURL": "http://www.goodreads.com/user/show/1745917-hannah", "userReview": "I found this at my grandparents house on a trip when I hadn't brought anything to read. I finished it all too quickly, scarfing it down like an orange at Christmas time.\"Five Quarters of the Orange\" is told from the perspective of Framboise both looking back at the past and recounting current events as an older woman, and telling \"present\" events as a child. Framboise and her family live in a small French village during the German occupation. The father was killed early in the war by a German, but this doesn't stop the entire family - Framboise's cold mother, her beautiful sister and her sly-but-cowardly brother - from becoming involved with the Germans... one German in particular. Things end badly, with Framboise and her family leaving the village after somehow causing the deaths of 10 people. It's not until the end, after untangling her mentally unstable mother's journal that Framboise (and the reader) figures the entire story out.This book captured me and wouldn't let go. The words are simultaneously poetic and blunt: a naive but not innocent account from a child, and a regretful, ponderous account from the grown woman. Harris weaves a wonderful narrative."}, {"userName": "Mary", "userReviewDate": "Dec 29, 2007", "userURL": "http://www.goodreads.com/user/show/393065-mary", "userReview": "Harris chose brilliantly when she made 9-year-old Framboise the protagonist of this novel. The novel is based on Framboise's lies and deceptions dating back to one childhood summer in occupied France in WWII and continuing into her old age. Everything that seemed superfluous in Blackberry Wine or contrived in Chocolat worked seamlessly here at the service of a tale as relentless as the course of the river Loire and as muddied and tangled as the currents along its banks. (SPOILER) My only criticism of the plot is that Harris redeems nearly all the characters in the end. I was disappointed because she had succeeded so well in making me care about them in their unlikeable, unredeemed state and that's hard to do."}, {"userName": "Jess The Bookworm", "userReviewDate": "Feb 07, 2016", "userURL": "http://www.goodreads.com/user/show/32042916-jess-the-bookworm", "userReview": "This story follows a young girl in a village in France during World War II as she deals with a difficult relationship with her mother and misadventures with her siblings and friends, ultimately leading to a tragedy which she must come to terms with later in life, as she returns home to start over.The story is well-written, weaving childhood whimsy with the dark and dangerous. It did take me a while to get into, as the beginning is a little all over the place, but once I got into it, it was a page turner and a kept me interested right until the end.As Joanne Harris always likes to do, a love of food is scattered throughout, with recipes and descriptions which are mouth-watering, although, unfortunately this is not done to the extent it was in Chocolat, which is a bit of a pity."}, {"userName": "Mafalda Fernandes", "userReviewDate": "Feb 15, 2014", "userURL": "http://www.goodreads.com/user/show/28507477-mafalda-fernandes", "userReview": "Anos depois da primeira leitura, continua a ser um dos meus livros preferidos (de sempre!)"}, {"userName": "Elaine", "userReviewDate": "Dec 17, 2014", "userURL": "http://www.goodreads.com/user/show/13060256-elaine", "userReview": "I really, really enjoyed the Chocolat trilogy but was rather disappointed with this one. Like Chocolat, at the heart of this book is the relationship between a mother and her daughter with very much a foody theme running through it. Framboise and her family grew up in a small village on the banks of the Loire in France but left suddenly after events during WWII. Years later, Framboise, now widowed, returns to her old home, keeping her identify a secret for fear of reprisals for what, for most of the read, is kept hidden from the reader, but with hints dropped every so often. Framboise and her siblings have a very complex relationship with their mother – at first glance it seems as if they don’t even hold any love for each other, let alone like each other. It is not until you get right into the heart of the story and get a real understanding of the characters that you get an idea of the true nature of their relationships.Framboise is nine years old during the events that take place in WWII and for me this just didn’t work. She is very precocious in her actions, especially when she wages a war of continual manipulation of her mother. I really don’t think that any 9 year old would have been able to carry this off and her actions and thoughts were more suited to someone say of about 13 or 14.The story does take quite a long while to get off the ground with the first 100 pages or so really setting the scene more than anything and it wasn’t until I got that far into the book that I started to get any real enjoyment about it.Notwithstanding the above, Joanne Harris really does bring her setting to life, especially when she writes about food – you can almost smell what is cooking and especially the scent of the oranges that runs through the story. When the story does start unfolding it is not a bad read at all, just a bit of a disappointment after Chocolat."}, {"userName": "Rosiemae Burton", "userReviewDate": "May 20, 2015", "userURL": "http://www.goodreads.com/user/show/35592538-rosiemae-burton", "userReview": "It is almost guaranteed for me that a Joanne Harris novel is going to be very well-written. She encorpoates social issues, different beliefs and food all into one and it is brilliant how she does so. However, this novel took a long while (about 100 or so pages) to really get going and I didn't like that there wasn't any clear indication on whether it was a flashback or current time. I loved Framboise as a narrator and I liked that I got to see a different side to wartime rather than the usual fighting. I enjoyed the merging of French and German culture. Overall, I don't think it was as good as Chocolat but I enjoyed the novel immensely."}, {"userName": "Chris", "userReviewDate": "Sep 14, 2012", "userURL": "http://www.goodreads.com/user/show/12136249-chris", "userReview": "What a terrific novel. It starts off like a liqueur chocolate: when you first pop it in your mouth, you are not quite sure what it will taste like. Then the further you go, the secret of the interior starts to reveal itself slowly until you are totally absorbed in its content. Couldn't put it down - a simple interwoven story, told beautifully. A must-read."}, {"userName": "Mithila  Menezes", "userReviewDate": "Mar 07, 2018", "userURL": "http://www.goodreads.com/user/show/38994245-mithila-menezes", "userReview": "Framboise, daughter of the infamous Mirabelle Dartigen, returns to her home village on the banks of the Loire. Anxious about being recognised and causing old enmities to awaken, but wanting to connect with her roots after a long exile, Framboise hopes for a new beginning. But she quickly discovers that the present is always, always distinctly connected to the past. One can never run away from it.Framboise has inherited a recipe book cum diary from her mother, Mirabelle. Is this recipe book just a key to cooking delicious food? Or is it a map into the mind of a \"crazy woman\" whom the whole village despised? Framboise re-creates her mother's dishes, which she serves in her small creperie. Yet she diligently studies the scrapbook - searching for clues to understand her mother's mind. Little does she know that within the journal's tattered pages lies the key to what actually transpired the summer Framboise was nine years old._______This book is a gift sent from heaven for every reader who likes reading about life during World War II. This book covers the German occupation in France. This book is also a perfect read for readers who love to immerse themselves into a culinary journey while reading a book. The exquisite French cuisine described in the book is mouthwatering, and the many recipes of Mirabelle Dartigen will make you yearn for tasting authentic French cuisine yourself. There are themes of family, friendship, sibling rivalry, love, fighting for what you believe in. _______I would recommend reading the Kindle version of this book, as there are references to many French and German words, and the Translator function on the Kindle is a must while reading the book. _______I give this book a 5/5 star rating. ⭐⭐⭐⭐⭐"}, {"userName": "Mary Ann", "userReviewDate": "Apr 26, 2016", "userURL": "http://www.goodreads.com/user/show/11710808-mary-ann", "userReview": "This is simply a lovely book. I took a bit more time with it than usual because the beautiful prose is dense and loaded with layers of meaning and emotions. The first-person narration alternates between that of a nine year old in 1942 Occupied France and the same woman in the same village fifty-four years later as she slowly discloses her long-held secrets. The change in the time frames sometimes occurs abruptly, mid-chapter, so the reader must pay attention. It helps if the reader can read French, but it's not absolutely necessary. It's also a hommage to the wonderful farmhouse and bourgeoisie styles of French cooking.I've previously only read Chocolat (which I enjoyed) by this author, but I liked this much better."}, {"userName": "Sarah", "userReviewDate": "Jul 31, 2007", "userURL": "http://www.goodreads.com/user/show/219638-sarah", "userReview": "This book seriously dragged me right along to an inevitable (and dark) conclusion. I kept toggling between enjoying her writing style, loads of unique description and a nice layer of old memories and new experiences for the main character, and being sort of shocked and horrified by the absolute coldness of most of the characters in the story. It was an interesting book, but I had a hard time absorbing myself in it(which is what I've been looking for lately).Perhaps the other drawback (and major plus) was that I kept having to take snack breaks. Her descriptions of food sound so tempting I am now desperate to take up French cooking (not likely to be a forte of mine since I'm no good at detail-oriented cooking)."}, {"userName": "Anne", "userReviewDate": "Oct 14, 2008", "userURL": "http://www.goodreads.com/user/show/1163458-anne", "userReview": "I found this book to be quite a slog. I did finish it, which is why I feel entitled to write this negative review. The main problem I had was that I didn't like or relate to any of the characters. The writing is good enough, and the setting (an occupied French village in WWII) compelling enough that I kept going. And the cooking theme is interesting. But the central relationship between the narrator and her mother is sad and disturbing and ultimately unbelievable. How can the reader sympathize with someone who would deliberately trigger her mother's migraines using the scent of oranges? Granted, the mother is no saint, but she wasn't physically abusive either. It's too bizarre. There, I feel better now. :-)"}, {"userName": "Janice", "userReviewDate": "Nov 14, 2012", "userURL": "http://www.goodreads.com/user/show/2513987-janice", "userReview": "Rarely do I find a book whose title is so perfect and so symbolic of the essence of the book!The orange is the forbidden fruit. The five quarters indicates the parts that make up the whole. And why five instead of four quarters? To me it symbolizes something hidden, something not quite right, perhaps a twist!Ah! The innocence of children! Transport them back to the perceived safety of a small town during war time where they suffer the loss of a father, the emotional absence of a mother, and fall under the influence of a charismatic soldier and you have the setting for a disaster."}, {"userName": "Shelby *trains flying monkeys*", "userReviewDate": "Nov 14, 2008", "userURL": "http://www.goodreads.com/user/show/1053760-shelby-trains-flying-monkeys", "userReview": "This book turned out much better than I thought it would. It took along time for the story to start. I loved all the food talk though. I could actually end up smelling oranges."}, {"userName": "Patricio", "userReviewDate": "May 19, 2018", "userURL": "http://www.goodreads.com/user/show/50814558-patricio", "userReview": "«I let it go. It's like swimming against the current. It exhausts you. After a while, whoever you are, you just have to let go, and the river brings you home.»Five Quarters of the Orange was like a ripe fruit I wanted to eat all at once but that I tried to savor slowly.Joanne Harris is one of my favorites authors and she never disappoints. This novel was different from the others I've read by her, but the touches that make her books unique were all there nonetheless.Framboise returns to the small village on which she was born and opens a restaurant where she recreates her mother's dishes while she studies a scrapbook of recipes she inherited from her mother. With studying her annotations, she finds out the reason of Mirabelle's contradictive behavior between her love of food and cruel demeanor.I can't help but love the family dramas Harris creates - they're everywhere in her books - because they feel real; you've been through them and you relate so hard with the characters.Five Quarters of the Orange focuses on Framboise's relationship with her mother when she was 9 years-old, when she couldn't understand her and only cared about herself, which is normal in children. Even though we only read about their relation during that year, you realize that it had different phases motivated by different things, and it was constantly evolving in a complex and utterly real way. It was fascinating.Fifty-five years later, when Framboise finds out her mother's scrapbook and reads its annotations, a new family drama appears in her life - this time related with her nephews -, and while it develops, she finally starts understanding her mother and how much she must have suffered to keep her children innocent from what was actually happening in their village during WWII.Each of these storylines is developed simultaneously and one helps to the other; Framboise understanding her mother motivates her to deal with her new family issue.Although the author didn't describe the village to the undermost detail (she doesn't need to), she made me feel I was really there and it was as if I knew that place forever. It had life.Harris' prose was amazing, as usual. She created believable characters and weaved the story in a way only can she do, with her beautiful and engrossing writing that made the novel impossible to put down.Five Quarters of the Orange was delicious and yet a bit dark, just like a piece of chocolate. I loved how it explored familiar relationships and innocence, childhood and adulthood - Joanne Harris gives you everything about them, the good and the bad things, and makes sure you get familiar with them.This book made me feel complete and I didn't want it to end.I think this is the best book by this author I've read so far. I highly recommend it.P.S.: If you're a Margaret Atwood fan, you'll love Joanne Harris! Trust me, I know."}, {"userName": "Jessica", "userReviewDate": "Feb 16, 2008", "userURL": "http://www.goodreads.com/user/show/913191-jessica", "userReview": "I started off enjoying this book. And then my enjoyment faded. The two things that stood out in my mind that I did not care for were this:1) The story is narrated by a woman, 1/2 of the time when she was 9 and the other half when she was an adult. Her narattion as a child was annoying - she was manipultive towards her mom to the point of cruelty, and she had a negative \"know-it-all\" attitude towards her older siblings. Newscast kid, you're only 9, stop talking and acting like you're an independent woman of the world.2) There were several incidents within the story line where I felt like the author alluded to something happening, versus straight up communicating what did/did not happen. That was annoying, what am I supposed to think happened? I don't like having things inferred. This made me decide that if I ever write a book, I will be sure to communicate exactly what is happening in the story line, versus inferring what might/might not be."}, {"userName": "Amanda", "userReviewDate": "Feb 16, 2008", "userURL": "http://www.goodreads.com/user/show/645979-amanda", "userReview": "Finished it this afternoon. I would have given it more stars, but I can't stand violence. Holocost violence is the worst. Ok, so it only gets violent at the end, but now it's all I can think about.Also, I feel like ther was this huge buildup to a terrible event. I wish that the actual happenings of said terrible event were revealed at the beginning. There was so much \"omg, what is gonna happen\" that by the time the terrible event actually occurred, I wasn't exactly floored. I just think it would have been a better story if we could have concentrated FULLY on the character development and their relationships with each other."}], "description": "Cuando tras décadas de ausencia Framboise Simon regresa a su pequeño pueblo en la campiña francesa, los habitantes no la reconocen como la hija de la mal afamada Mirabelle Dartigan,la mujer que aún consideran responsable de la tragedia sucedida en los años de la ocupación nazi. A la búsqueda de un nuevo comienzo en su vida, Framboise descubre rápidamente que el presente y el pasado se encuentran inextricablemente unidos, mientras recorre las páginas del cuaderno de recetas de cocina heredado de su madre. Con la ayuda de esas recetas, Framboise recrea los platos de su madre, que sirve en un coqueto restaurante. Y a medida que analiza el cuaderno -a la búsqueda de pistas que le permitan comprender la contradicción entre el amor de su madre por la cocina y su conducta opresiva-, descubre poco a poco un significado oculto detrás de las crípticas anotaciones de Mirabelle. Entre las páginas del cuaderno, Framboise encontrará la clave para comprender lo que realmente sucedió aquel fatídico verano en el que tenía tan solo nueve años. Exquisito y lleno de matices, Cinco cuartos de naranja es un libro sobre madres e hijas del pasado y del presente, sobre la resistencia y la derrota y, sin lugar a dudas, una extraordinaria muestra del talento de la autora de Chocolat. «Inesperadamente tierno y poderoso.» The New York Times Book Review", "title": "Cinco cuartos de naranja", "url": "http://www.goodreads.com/book/show/3234629-cinco-cuartos-de-naranja", "average": 3.84, "cover": "https://images.gr-assets.com/books/1502624848l/3234629.jpg", "reviews": 2172, "authors": [{"url": "https://www.goodreads.com/author/show/9432.Joanne_Harris", "name": "Joanne Harris"}], "type": ["Fiction", "Historical", "Cultural", "Historical", "Food and Drink"], "outlinks": ["http://www.goodreads.com/book/show/3234629-cinco-cuartos-de-naranja", "http://www.goodreads.com/book/show/902651.Five_Quarters_of_the_Orange", "http://www.goodreads.com/book/show/15096.Five_Quarters_of_the_Orange", "http://www.goodreads.com/book/show/47426.Five_Quarters_of_the_Orange", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/3439846-cinco-quartos-de-laranja", "http://www.goodreads.com/book/show/13456744-5-4", "http://www.goodreads.com/book/show/13499029-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/15097.Five_Quarters_Of_The_Orange", "http://www.goodreads.com/book/show/47401.Chocolat", "http://www.goodreads.com/book/show/15101.Blackberry_Wine", "http://www.goodreads.com/book/show/15102.Gentlemen_and_Players", "http://www.goodreads.com/book/show/2227371.The_Girl_with_No_Shadow", "http://www.goodreads.com/book/show/321572.Holy_Fools"]}