{"ratings": 6776, "userreviews": [{"userName": "Chelsea Humphrey", "userReviewDate": "Feb 14, 2017", "userURL": "http://www.goodreads.com/user/show/47207032-chelsea-humphrey", "userReview": "If it helps you decide whether or not to read this book, just know I read an e-galley of this back in February and I adored it SO much that I bought a finished hard copy for my collection of re-reads. It was THAT good! ❤️💛💚💙💜🖤💗Full Review: I guess I've put writing this review off long enough. I keep feeling like, if I don't write this, I don't have to let go of this story yet. When I first read the above description of said book, I immediately thought \"Great, another cliche YA fantasy filled with tropes of white, timid girls saving the day, love triangles where all the boys are unrealistically pining after one extra spoiled lady, and a let down of a plot because my expectations of how awesome controlling storms would be simply can't measure up.\" Sound about right? However, I kept seeing this little book popping up all over my Goodreads feed, so when I was offered an early copy from the publisher, peer pressure got to me and I caved because I like having things earlier than I'm supposed to. Let me just tell you folks, if you are a fan of YA fantasy with a bit of romance, immediately click that pre-order button because you need some Stormlings in your life, I promise. As a fair warning, there may be some extremely mild spoilers below, so if you'd like to go in completely blind, I'd recommend stopping reading this and pre-ordering the book. If you want to get a little more feel of the book then follow along.\"You are lightning made flesh. Colder than falling snow. Unstoppable as the desert sands riding the wind. You are Stormling. Aurora Pavan. Believe it.Believe it, and others will too.\" Let's start with our main character. This is where I was most concerned before entering into the book; I can't tell you how many books I've read (and probably you as well) where the protagonist is a pale, white 18 year old female who is unsure of herself, even though the book tells us for PAGES how perfectly above average she is in looks and talent. This girl also falls at the feet of any guy to show her attention, and usually has saved her virginity for a mainstream view of an abnormally long time, only to give it up in one quick moment. This particular trope has gotten old, so you can see the concern when our main character is described as a pale, white 18 year old female. Thankfully, this story is different. I won't go into too much detail, but the first chapter leads us to believe the story is going in one direction and brings us a significant twist right away, showing that this book will indeed be different. I love how there is no love triangle in this book; the romance that is there is very engaging, but also very tame and somewhat ties into the reasoning behind portions of the action. The remaining characters are fairly diverse, at least racially, and the band of friends that we follow throughout the story remind me a bit of our gang in the Six of Crows duology, although I hate to make that comparison and raise expectations unintentionally. I feel this crew had their own strengths and weaknesses compared to Kaz's crew, but gave me that same close feeling that I had while reading those books.\"Soul of fire, soul of rageNo longer bound by flesh or cage,Soul exalted, soul made newReserved for those devout and true.\"-\"The Way of Souls\" (A Sacred Soul Hymn) The plot was actually very complex, layered as an onion to where, once we had a portion figured out, it opened up others that were still a mystery. I did have to devote my full attention in the beginning for the world building, as this fantasy realm is very different than the others I've previously read. There is intricate detail of multiple lands that I found completely mesmerizing; I adored how realistic it was and didn't account for how caught up I'd become until I had to check back in to reality. There is so much action in the plot that makes it paced really well; I could hardly put this down and do all the other things I needed to during my days. The entire premise of certain lineages being able to control storms, and said storms having a \"heart\" really intrigued me and I found the story to be much better than my wildest expectations. This has a \"half mythological/half modern fantasy\" feel which caused a nice balance without either aspect feeling forced. I grew close to the characters and felt really sad to have turned the last page and have nowhere else to follow them (for the time being). And that cover? Absolutely stunning.I'd highly recommend this to fans of any sect of YA fantasy; the romance was mild and age appropriate for all teens. This is the type of book that would even make a great cross-over into YA Sci-Fi as it toes the edge of some pieces that would fit nicely there. Such a well-written and exciting YA debut; I now have a complete book hangover that is almost as severe as when I finished ACOMAF last year. This one was so good I'm going to have to buy a finished copy for my special shelf at home in hopes of a re-read before the next book in the series is published.Many thanks to the publisher for providing my copy via NetGalley; it was an absolute delight and privilege to provide an honest review. Initial Thoughts:Now that, my friends, is how you end the first book in a series. Not a giant, open-ended cliffhanger, something that leaves you angry for not having enough story to tide you over until the next book. This left me ready for the next book but with enough closure to let me sleep at night. This was EXCELLENT. Highly recommended for a different type of YA romantic fantasy. I loved the use of the elements and wielding storms as a form of power. Full review to come."}, {"userName": "Khanh, first of her name, mother of bunnies", "userReviewDate": "Jun 12, 2017", "userURL": "http://www.goodreads.com/user/show/4527753-khanh-first-of-her-name-mother-of-bunnies", "userReview": "Roar? More like...I DNFed at 20% because my patience only lasts so long and that is it. By this point in the book, there has been 3 hot guys (2 of whom are brothers!), a useless princess who is sooooooooooo beautiful, and the majority of what I've read has been the accounts of an betrothal ceremony for an arranged marriage with lots of steamy glances and flirting and blushing than actual plot.\nThe paint had begun to wear away on her lips, revealing rosy skin underneath. Was the rest of her flushed beneath all that powder?\nThe premise is really interesting. Too bad there isn't more plot and fewer attractive people."}, {"userName": "Brittney ~ Reverie and Ink", "userReviewDate": "Jun 16, 2017", "userURL": "http://www.goodreads.com/user/show/50044222-brittney-reverie-and-ink", "userReview": "4.5 stars because this really was fun. There were A LOT of really cool elements and honestly the sequel is set up to be even better than the first, so I'm dreading an entire year of waiting. On the same note, a few cheesy lines and tropes, which is to be expected. All in all though, it was definitely fun and I REALLY enjoyed it!I'll start with Aurora, or 'Roar'. I actually really liked her. She starts off as a weak heroine, and to be honest, she DOES grow but her character development is far from finished. I think some will get annoyed at her for it, but I appreciated it SO much. Not every heroine has to be 100% badass 100% of the time. But I have no doubt she will grow into her own.At the beginning, she's a princess who is held in isolation inside her castle by her mother in order to prevent people from finding out she doesn't have storm magic, which is a hereditary thing in the royal family. So yeah, kinda a big deal that she doesn't have it. She's being forced to marry Cassius (more on this lovely chunk of words later) as quickly as possible so she can keep her kingdom before others find out. But as you can tell by the synopsis, Roar runs away, and I won't say much more than that. I love the direction the author took her in because book two should be GREAT as I said above. Anyway, she has a cute little temper but a good heart and wasn't overly spoiled by the whole palace life thing.Now for Cassius, our resident dark and very questionable prince... YES. I am so here for him. He needed MUCH more screen time and I'm hoping he gets it in book two because asldkfja;lsdkjf. The beginning was SO STRONG when he first met Aurora. Like what even, can we please talk about chemistry? But then Roar overhears him and realizes he only plans to use her to get the crown. Whatever guys, I know that is *kinda true* but there's also a lot more about him that we don't understand, and he DEFINITELY has a good side too. I'm labeling him as an antihero and you can't stop me. I have such high hopes for him. He's kinda like... a baby Darkling?? Yes? Anyone?? (Dearest Cora... please please more Cassius...and Cassius and Roar...)I kina have a feeling the author was hinting at something between Cassius an Nova but nooooooo aldskfja;ldkfj I need Cassius and Roar. I'm also super interested in Casimir an the rest of Cassius's family.Once Roar runs away, she ends up with a new gang of storm hunters (which are super cool). Actually, let me stop there for a moment. The whole storm fighting and storm hearts thing was really neat and took this from being a typical fantasy book to a super unique magic system and storyline. As I mentioned above, there are definitely some cliches and cheesy parts that you find in most fantasies (especially in the romance egh) but the A+ world building kept me invested even during those times. That bring me to Locke (resident head storm hunter broody guy). I liked him part of the time, but I didn't fall head over heels with him. I think it was because he was the sole focus for Roar in, and by the end of the book, he kinda felt like a typical overprotective boyfriend who gets angry at anyone who even looks at his girl wrong. I don't know. I mean, he and Roar did have some chemistry and I didn't mind him, and I did feel for him and his story, but Cassius is just so much more interesting and I liked his dynamic with Roar more. I CAN'T HELP IT.The more I think about it, the more I'm kinda eh at Locke. I think he was what Roar needed at first, don't get me wrong. And I still don't hate him. BUT, he says was questionable stuff at times. However, I've seen all the arguments about him being way problematic and stuff and I can't say that I agree with all that, but I'm just not sure which way Cora will take him in the future, so we shall see! If anything, he's a bit overly protective, but it just depends on how he acts on it later.To summarize...The Good: -really cool world-freaking cool magic system-um the storms have personalities? SO COOL-CASSIUS-likeable yet weak heroine-excellent villain development-A+ set up for the sequelThe 'eh':--a few cheesy 'love declaration' blah blah stuff but it was kinda cute too-Cassius didn't get enough book time-not much resolution for things I wanted to see before the sequel (more below)Before I get into spoilers below, I'll just say definitely give this book a go if you're in for a unique fantasy/world and don't mind romance being the main focus (because it is) - but even if you aren't huge on that part of it, there's for sure hope for the sequel.******SPOILERS BELOW******Anyway, about 70% of the book is Roar traveling with Locke and his crew, and I did enjoy it and the pacing was pretty good, but at the end, I expected a cliffhanger, but I felt like there was way too much left open. I mean, Cassius never even gets close to her or gets any clues, and I was super disappointed because I was totally on board for a cat and mouse thing (I'm so lame) and Locke never finds out who she is... so we literally had no resolution in this book aside from Locke and Roar getting feelsy. We get a glimpse at Roar's 'ability' which is cool, but not much else. Berlghhg I just need the second book please and thank you.OKAY OKAY AND WHAAAT CASSIUS IS THE FIRST BORN OGMARGHER YESS I AM HERE FOR THIS.(Are you guys tired of me talking about Cassius? Sorry.)All the while Locke and Roar and their gang are doing their thing, there's another villain being set up in the background so I'm super interested in that. Especially with the last paragraph of the book.Anyway, is it too early to beg for an ARC of book two? Yes? Poo. My Blog ~ Instagram ~ Twitter ~ Etsy"}, {"userName": "Hailey (HaileyinBookland)", "userReviewDate": "Sep 13, 2017", "userURL": "http://www.goodreads.com/user/show/21937982-hailey-haileyinbookland", "userReview": "2.5*This wasn't awful, the fantastical element was very unique, I mean c'mon storm magic. How cool! However you can definitely tell that this author usually writes heavy romances, which is fine, but I did not at all care for the language used in the relationships. It was very possessive and honestly my eyes were rolling 80% of the time. I think I would have enjoyed this more had the romance not been such a big part of the story, or had the romance not been so aggravating. I don't know what it is with me but I'm so critical of relationships in YA lately. I just feel like we can do better and there can be a cute romance without the possessive harmful language."}, {"userName": "softlykaz (on hiatus)", "userReviewDate": "Jun 18, 2017", "userURL": "http://www.goodreads.com/user/show/42130592-softlykaz-on-hiatus", "userReview": "*record scratch**freeze*yup. that’s me. the bundle of straw tied into a vaguely human shape staring blankly at the computer trying to sift through her weird mix of feelings about this book and figure out how to properly phrase it all. you know, just another awkward 3 stars review. yeet.look, I am so conflicted. I feel like all of my emotions are people in their 20’s mistaken for actual adults, and there’s an 80s montage of everyone just kind of fumbling around bumping into each other, trying to figure out where the free food is. hey @feelings, it’s not halloween for you. please quit trick or treating with me.So since I am very Undecided™ about this book, I guess I'll just make a LIKES vs. DISLIKES IN BULLET POINTS review like some sort of goddamn medieval peasant. see, I, personally, would love to get my shit together and yet… ¯\\_(ツ)_/¯\n\nLIKES\n\n”Treat others with kindness. For you do not know which souls will visit you again as storms rather than men.”—The Book of the Sacred Souls● first of all, this book introduces one of the most interesting magical concepts that i've ever encountered:● people who reincarnate as storms after they die● imagine being able to house your consciousness in a more suitable home, to transcend the parameters built into your earthly shell and leave behind your prison flesh and your current biological state with your current societal mode of being...to be reborn as a storm● how cool that no one never really has to leave?? like someone can be gone in their human form but their atoms are still floating on the wind and growing into a whirlwind... it's like their existence was just a holiday romance but their particles have to get back to their real lives and become a tornado!!!● please I don't want gender I want thunders and a formless existence ● but see, their consciousness isn't just floating into an empty void● they are quite aware of themselves. quite there● and they are being hunted by the Stormlings● a Stormling's duty is to excavate a storm's heart and ultimately kill it● so maybe it's not that cool after all. some folks just have to ruin the fucking fun. ● no really why would you do that??● I love storms and if I could be any natural phenomenon I would probably choose thunderstorms● so this book has pretty much laid me out to die with this concept, I have seen the stars and I will not accept any lesser death than a death that leads to me becoming a soaring windstorm● also there are people called Stormlords and they're so rare because they can actually bend the storms to their will and they're considered dangerous and a threat● this whole thing with stormlords is still ambiguous because we don't really know much about it yet. we barely had two chapters from a stormlord's point of you and all he did was literally just wreak havoc and I was so there for it!!● anyway, the premise is so cool and I mean, if I think about it hard enough, in a million years when we're all dead, our atoms will mix with solange and we will all probably become a whirlwind ● also this list won’t be complete without my favorite under appreciated character: Nova● she might be a minor character but she’s a major one in my heart● she's the queen, the moon and at least three suns● we don't see much of her in this book but she completely dominated the entirety of it (for me, at least)● her spirit just radiates warmth and peace and hidden power and quite frankly, she's the main thing I look forward to in the next book\n\nDISLIKES\n\n”Sometimes we must make answers where there are none.”—The Tale of Lord Finneus Wolfram● everything else??● I was literally so bored my mind kept drifting into thoughts of sharks and if they ever think of falling in love or if aliens have inbuilt fears like heights and snakes and the dark like the rest of us humans??? (I’m just weird don’t actually listen to anything I say)● the book dragged so much and you know how they say ‘time flies when you're having fun’?? well I was not having fun and every page literally takes at least a fortnight● even when something remotely distressing occurs, I was figuratively just slowly walking backwards from the messy situation while raising my eyebrow and sipping my drink because I !! just!! did !! not !! care !!● I liked those few chapters with that Stormlord and Nova but that's about it● let's talk about the characters● if you think that I could care less about shitty plot lines and that if the characters were real and I connect with them, I would defend them until my dying breath...well you are correct.● I come for the characters and I stay for the characters ● well, I wouldn't exactly stay for these characters, in fact I would run away to start a new life after my scheme to defraud my insurance goes wrong and live a new life as a yoga teacher in guadalajara● it's just... something was missing● it's like when you go to nonchalantly put your hands in your pockets only to realise you don't have pockets● there was nothing special about them, in fact, they felt more like an echo of every YA character rather than their own person● we've got Cassius● you know his type: a strong jawline, broad shoulders, a shit attitude with a side of controlling and possessive douchebag● how groundbreaking. truly innovative. absolutely amazing. I’ve never seen this before. ● I need to buy a Polaroid so I can take photos of my loved ones that I can stick on my prison wall if I ever manage to retreat into this book and beat cassius into a goddamn pulp● do you think he knows that I hate him? like…really hate him in an oddly personal way? do you think he knows?● if I had a dollar for every time he treated Rora like his personal trophy doll, I’d have enough money to fund a rocket ship to send his ass hurtling into Jupiter and even pay off my student debts ● there was this scene at the begining that pissed me off so much dear lord, I honestly struggled to keep my reactions from spiraling out like bullets...like how about I switch your apple juice with piss. how about that?? it’s a scene in the beginning where he and his brother were literally playing ping pong with Rora. It was told from cassius pov and I kept expecting him to say that she’s at least tried to wrench her hands from his grip but she was totally eclipsed and I just sat there whispering to myself “what the fuck?? what the fuck??” maybe it’s due to the writing but the whole thing made me so uncomfortable tbh.● there's obviously so much left untold about his story but the grudge have been formed so I guess it'll be just me and my hate for a long while ● and then we have Rora● she started off as the character who wants to be Loved and Validated and repeatedly makes awful decisions while desperately trying to find people that will at least throw even the tiniest slivers of genuine caring and concern her way and with whom she'll create a false sense of closeness and ultimately pretty much hurt herself because of it● I was trying really hard at that point not to be a grinch but the annoyance kept pulling me back in, like I was basically just sucking in my cheekbones and thinking why is everyone trying to bring back That Trope, they’ve had their time● she did end up piercing through her thick armour of insecurities and holding fast to the notion that her self worth isn't defined by other people's views on her and she honestly had such a remarkable character development throughout the book and I really liked that● and Locke● he's The Nice Guy, the total opposite of Cassius, the equivalent of a sunflower field, the kind of character you would envision a perfect life with and unwittingly create a new person for them to live up to thus doom in any chance of happiness followed by being harshly disappointed by reality ● except I really did not care about him, either● so much for not being a grinch ● THE ROMANCE● not to be the kind of person who constantly makes fun of everything for being corny and their life becomes a bleak void of an unfunny joke but I guess some skills are just innate and I did think the romance was so cheesy ● I'm not really crazy about this ship but at least people are happy I guess● also, thank god there was no love triangle, I would rather be eaten by an orca whale than have awareness of another love triangle thrust on my conscious experienceOverall: I think the sequel definitely has the potential to be so much more. I feel like this book was just character development, which means the next book will hopefully be strictly action and story progression and what do you know, I'm actually uh, excited.WORDPRESS | TWITTER | INSTAGRAM"}, {"userName": "Aentee", "userReviewDate": "Jun 19, 2017", "userURL": "http://www.goodreads.com/user/show/2212677-aentee", "userReview": "I’ll get the lone positive out of the way first. The world building in Roar was compelling, set in a world haunted by tempestuous storms where gifted humans employ magic to control them. Since the internet has no shortage of glowing reviews about the magic system in Roar, I’ll leave it at that. I have a lot more to say about the toxic romance in Roar as, it is an example of how dangerous it is for harmful tropes to reign unchecked and unchallenged. This post will contain spoilers for the romantic plot within Roar. This is the book that ruins itself, so I am just helping it along.Note: The protagonist in this book goes by three different names – Aurora, Rora, and Roar – I will use the name Roar for the sake of clarity.My main issue with Roar is the very problematic romanticisation of male sexual aggression and possessiveness. Unlike many YA novels where the narration primarily takes place from the heroine’s point of view, Roar is also written from Cassius and Locke’s perspective – and their thoughts on Roar were disturbing and frightening, especially because the text largely presented them as romantic.Creepy Love Interest #1 – The Tortured PrinceMoments later Cassius Locke melted out of the shadows, looking more like a villain than a prince—dressed all in black with dark hair and eyes to match.The first love interest is betrothed to Roar. Cassius Locke is your classic dark, sardonic hero, complete with chiselled cheekbones and a secret agenda. Within ten minutes of their first meeting, we have him throwing her over his shoulders – caveman style – because her gorgeous gown was restricting her movement and he simply did not have the patience. Isn’t that charming? This particularly gallant thought also crossed his mind during their first encounter:…he had a feeling that conquering her would prove more exhilarating than any storm he had ever defeated.Yes, Cassius, because women are objects meant to be conquered. Also, this is the first of several instances that Roar is compared to a storm under a male’s gaze within this text – and given the misogynistic history surrounding the naming and feminisation of destructive cyclones and hurricanes (http://nytlive.nytimes.com/womeninthe...), these comparisons constantly bothered me. The storms within this particular universe are described as devastating and mesmerising, people simply can’t help but be captivated and destroyed by their unknowable force. To her love interests, Roar is equally magnetic, they can’t help wanting her, it’s her own nature that makes them want to conquer and claim her.Here’s a couple more examples of Cassius’s simply winning personality:Her aggression had been a surprising but welcome new morsel of her personality. He had prodded at the fire in her, treated her like a woman he truly wanted, rather than a woman he had to have at any cost.In this instance, Cassius perceives Roar’s anger as being a come-on rather than a warning that he has overstepped his boundaries (as mentioned above, this is a guy has no concept of what a personal bubble is). According to Cassius, when you’re interested in a woman, you have to ‘prod at her fire’ – because nothing is more romantic than pissing off your wife-to-be.“You don’t deserve someone like me,” he said... “But you are mine all the same.”Unfortunately, this is not the last time vile possessive sentiments will be voiced within the book. At least Roar is not impressed at this stage. However, the next time someone else says this, the text will treat it as romantic.Mercifully, at this point in the novel, Roar does not entertain Cassius’s nonsense – she had the fortitude to think: She had hoped that when all was said and done, she could finally belong to herself.Ohhh Roar, I had such high hopes for you. Unfortunately, both our hopes largely go unfulfilled – at least in the romance department (to be honest, there’s not a great deal of plot in this book aside from the romance). Her second love interest is even more consumed with thoughts of possessing her.Creepy Love Interest #2 – Protective Alpha HunterWhen Locke first appeared, I harboured some hope that the book’s romantic plotline will take a less toxic course. Perhaps Locke was the thoughtful, respectful foil to Cassius’s domineering personality. Alarm bells rang immediately when I saw his first POV perspective of the heroine:He has been teasing earlier with his little girl comment, but now she did look young. And frightened. And it roused every protective instinct he had.Right off the bat, we have the overprotective alpha-male trope rearing its ugly head, along with a healthy dose of toxic idealisation of masculinity. Males can’t help but want to protect their love interest, and in this case, the instinct comes with a need for control and possession. It’s a ‘romantic’ set up that we have unfortunately seen time and again, but this is one of the most rage-inducing version of the trope I’ve read in recent years.To add another layer of creepiness to it all, Roar also reminds him of his dead sister:But he remembered the feel of his sister, the timbre of her soul, the bravado with which she had lived. Roar had that same strange mix of vulnerability and strength.In an entire book’s worth of Locke’s conflicting and very unsettling narration on Roar, this is a first. Locke simultaneously equates Roar to the little sister he had failed to protect, while also obsessively thinking of her through a more romantic lens. Here’s a couple of examples:He had thought about her more today than he cared to admit, wondering what kind of home, if any, she had gone back to. But anything in this city would be safer for her than life in the wildlands.At first it was kind of sweet, although perplexing as he’s only met Roar a couple of hours ago.But now after three nights of restless sleep, broken by nightmares about a girl in danger who was somehow both his sister and Roar simultaneously, he had run out of excuses. It had been ages since he’d last had a nightmare. He knew having Roar here would throw him off balance, but it was even worse than he anticipated.Then he began losing sleep over her and I started side-eyeing a little. Note that all of this obsessive behaviour is always framed as Roar’s fault, because of her nature – he cannot help but be infuriated, mesmerised, and obsessed with her. In Roar (as is sadly true in most romance), this is often painted as something that sets the heroine apart from other women, something that is romantic rather than unsettling.And when he wasn’t consumed with thoughts of her, he was battered by an anxiety that had never plagued him before.Obsession is not romance. Locke’s constant preoccupation with Roar eventually manifests in a more physical manner during their training sessions (for context, he’s teaching her how to manipulate and hunt storms). All of their training session sets feminism back by around two decades, but these passages are the ones that made me physically ill:He should let her go. He knew her well enough now to know that manhandling her would only make her fight harder. But he was too distracted by the way her body fit against his own. Her soft hair tickled his neck. Even more startling, she had stopped fighting him completely. Her body sank against his, her back pressed against his chest and abdomen. He became acutely aware of where his arms wrapped around her shoulders and her midsection. She sucked in a breath, and the rise and fall of her chest moved through both of them.Firstly, I do not think anyone of any gender would respond well to being manhandled. Secondly, his display of physical dominance followed by his sexual arousal truly makes me want to hurl. It is passages like these that are potentially triggering for survivors of sexual assault. I think it is absolutely vile that Locke even made it off the editing table. When I read paragraphs like this one, I feel like I am seeing through the eyes of an abuser – one that blames women for being distracting and inviting with their “soft hair” and curves. There is nothing remotely romantic about this predatory behaviour. This is abuse, and I cannot brush it off as a bad alpha-male trope – especially given how many reviewers view this as romantic.Locke then follows up this assault with thinking:He knew he should step away, but it was like he’d been mesmerized. He stood there, stock-still, his mind filled with nothing but her. If she were a storm, she could destroy him, and he would never lift a finger to protect himself.Locke, you sack of waste, she is not a danger to you. Quite the opposite, you’re the clear aggressor in this situation. You do NOT get to blame her for mesmerising you, not when you clearly can’t control your own revolting impulses to dominate her. Society keeps making excuses for men like Locke, and seeing echoes of these excuses in fiction – especially ones that defend his action in the name of romance – make me see red.As if this assault was not bad enough, within the same chapter, Locke then proceeds to start groping Roar. The passage is far too long for me to quote here, but it includes ‘he stilled and looked at her like hunters looked at prey’, and ‘the hand around her neck tightened’. Also, there is this very awful passage which reduces a woman’s body into an object to be conquered:‘She was uncharted territory, and mountains formed where he touched her and a river of sensation flowed down her spine.’The fact that this takes place from Roar’s perspective makes it all the more disheartening and disturbing. By the time Locke’s wandering hand started ‘grazing the upper curve of her bottom’, she begins to question ‘Why?’. Why was he putting his hands all over her without clear consent? The answer, dear reader, truly establishes what we already know – Locke is trash:“When you’re distracted or feeling strong emotions, the natural barriers of your mind are weaker and more susceptible to being mesmerized by a storm’s magic. Which means something as simple as a thick fog could do much worse than make you forget where you are or what you were doing. It could keep you in the fog, even as it moves, dragging you along with it. Your mental barriers must be without weakness.”He claims this particular assault was done in the name of training, to strengthen her mental barrier. I don’t know whether to laugh or cry or rage at this point. Of course, there are no consequences for Locke. It’s heartbreaking to see Roar turn the anger she feels towards herself instead – for not being able to see through his manipulation. She does this on a couple of occasions:Locke’s voice was a fierce, angry growl, and she bowed up, ready to growl right back. She was getting tired of his moods—suffocatingly protective one second and a beast the next.While Roar does occasionally acknowledge that Locke’s behaviour is tiresome, the text never probes further. His action is portrayed as a minor annoyance and a character quirk – rather than extremely harmful and toxic. Roar only pushes back enough for Locke to see her as a challenge to be conquered, and she never manages to get him to respect her personal boundaries. In one scene, she shares a horse with Locke and tries her best to avoid bodily contact—this is what our romantic hero proceeds to do:After the tenth or so time she had tried and failed to keep from falling against him, he was out of patience. Wrapping the reins once around the pommel so he didn’t lose them, he reached both hands back to grip her thighs, well above her burns, and tugged her forward. She squeaked in response, her fingers tangling in the leather straps and holsters that crossed his abdomen. He would be lying if he didn’t admit that he got pleasure out of both her outraged cry and the feel of her surrounding him. “There,” he said, his voice low so that only she could hear. “We’re touching. I can feel you, all soft and warm against my back.” He heard her sharp intake of breath behind him, and he could swear her fingers tightened on the holster around his midsection. “You can feel me, and the world has not descended into flame again.” Though there was plenty of heat moving down his spine.Because when a woman is clearly establishing boundaries, what you should do is force her into compromising position and tell yourself that she enjoys it? Roar rightly calls him ”such an ass!” after this particular exchange, and this is his smug response:“Yes, but I’m an ass who gets what he wants.” He hadn’t meant those words to sound quite so possessive. He still thought it was a bad idea to get attached to her, but since the kiss, he was having trouble getting himself to care.The book is aware that Locke is an overly-possessive alpha male – yet it is continually treated as something that’s attractive. This would be problematic no matter which audience the book was published for, but Roar is specifically marketed to the YA audience and this makes it all the more abhorrent. Teens are partially informed about the world around them by the media they consume. Having the primary love interest constantly pushing the heroine’s personal boundaries and dismissing her protests is harmful and irresponsible. By the way, that kiss he mentions in the paragraph above also unsurprisingly transpires without consent:“Would you listen—” “Can you just leave me alone?” His hand seized her elbow, and he spun her around forcefully. He growled, “No. I can’t.” And then his mouth collided with hers. For a moment, Roar did not understand what was happening. She knew his lips were on hers, pushing hard enough to be punishment, and his fingers threaded through her hair, and an arm wrapped tight around her waist. But even knowing those things, she could not quite comprehend that Locke was kissing her. She froze, unsure whether she wanted to allow it or shove him away. She had been so angry, but now that blazing heat had melted into something different, like molten glass being shaped into something new. He tilted her head back, his hand gripping tighter in her hair, and when he opened his mouth against hers, she followed. He kissed his own fury into her, melting and reshaping her again and again with each strokes of his tongue over hers.I nearly threw my Kindle across the room at this point in the book. Roar really knows how to get these romances burning, because haven’t we all dreamed of being shut up with a kiss – especially one that was akin to “punishment”? After all, isn’t that what we deserve for defying the alpha male’s unquestionable authority? Especially because we seem to enjoy the kiss so much? There are so many layers of wrong to this passage that I cannot unpack them all. Roar does push back a little after this kiss, telling Locke he ‘cannot manipulate [her] into letting go of [her] anger’. Yet the book quickly diminishes this display of backbone by i) having Locke spout the age-old excuse ‘I was worried, and I overreacted.’, and ii) we have to end this particular assault with her thought on how the ‘kiss [was] so intense that she was still shaking’.The book makes excuses for Locke time and again, and Roar is too distracted by her physical attraction to him to ever truly challenge him. While I wish I could say the book did this with the intention of subverting the trope, and I continued reading Roar with that hope in mind – I truly believe that the readers are meant to think of this as romantic. The PR campaign around this book is all about picking your book-crushes, not about confronting your abuser. Given the amount of reviews saying how ‘swoon-worthy’ or ‘steamy’ the romance is, I am truly disheartened. I am angry at how easy it is to dismiss these toxic tropes and for the world to make excuses for (or even overlook) abuse.How do I know that the book has no intention of redeeming itself and will paint Locke as a romantic figure to the bitter end? Because this is the culmination of Locke and Roar’s relationship, and it’s definitely meant to be viewed in a positive light. In classic Locke manner, all romantic interactions are drenched with language that’s intended to dominate and control:…suddenly he was thinking about kissing her again, tugging her down until their mouths crashed together. Would she yell at him or kiss him back?Blog readers – if there’s ever a possibility that a woman might yell at you when you kiss her – DON’T DO IT. Actually, don’t kiss anyone without their consent. It’s frightening that the thoughts Locke has about Roar often forgo consent.He had lost control over his own hand, and it trailed up and down her back now, tracing the delicate line of her spine again and again. And with each pass, he claimed a little more of her…And of course, even when he has consent to touch her – he uses words that imply he has no choice in the matter. He can’t help but want to claim her like she’s some trophy to be had. Locke, I would have a tiny measure of respect for you if you would just own up to your own action and obsession instead of blaming your lust for Roar on male instinct.Locke couldn’t stop the fierce protectiveness that rose in him, and before he knew what he was doing, he had caught her face in his hands, turning it toward him. “Who was he? The man from the market?”Hey, book, I am getting really sick of this. Abandoning logic, reason, and consideration for the other party because you ‘love’ them so much is not romantic. There is always a choice, and pretending there is not is the classic tactic of an abuser. This kind of protectiveness is just a few steps away from actual violence, whether it’s towards perceived threats or the actual person you’re meant to be protecting. How many times have we seen domestic abuse in real life being explained away with these same excuses? ‘I couldn’t help myself.’ ‘I lost control.’ ‘She made me.’ Book, please make Locke take some goddamn responsibility for his atrocious behaviour.“I’m the first to touch this mouth? To taste it?” Her nails dug into his shoulders, and her blue eyes flashed with heat. She nodded, her tongue darting out to soothe the skin he had tugged between his teeth. “That means it’s mine. My territory. And I’m prepared to protect it, every hour of the day if I must.”What ever happened to ‘not wanting to sound possessive’, Locke? A woman’s body is not anyone’s property. For a book that began as a journey for Aurora’s independence, seeing her reduced in the eye of her lover to an object to be conquered is truly devastating. On a larger scale, seeing Roar marketed as a fantasy book with female empowerment, it’s distressing to see how wide it missed the mark when it came to romance. Due to the character limit on GR I can't post my full review, you can read the rest on my blog: readatmidnight.com"}, {"userName": "Melissa ♥ Dog/Wolf Lover ♥ Martin", "userReviewDate": "Jul 07, 2017", "userURL": "http://www.goodreads.com/user/show/17438949-melissa-dog-wolf-lover-martin", "userReview": "Update: $2.99 US kindle 10-22-17This book was in my first Fairyloot box for June. I thought the book was pretty good. I don't know if it was my mood once again but I didn't love it as much as everyone else. But, I will re-read it before the next book. Oh, but all the stars goes to the book cover! And if you take off the dust jacket Roar is looking out across the city and it is so freaking awesome! In the book she goes by: Aurora, Rora, and Roar. You just have to read the book. \nSometimes she was Aurora. Confident. Clever. Cultured.Sometimes she was Rora. Afraid. Alone. Ashamed.And more and more, she was Roar-bold, brash, and increasingly baffled by the situation in which she found herself. And sometimes she was none of them, lost and adrift somewhere in between, like the wildlands between Stormling cities.\nRoar is supposed to have powers but she doesn't and she can't let her betrothed, Cassius know about it. She can't let anyone know about it. But Roar has found a way to maybe learn some things. She meets up with Locke and his friends. I loved them all! Locke starts training Roar and we shall see where this will go. I'm not really sure what's going to be going on with that ending. Roar is playing a fine line."}, {"userName": "Frankie Lovely", "userReviewDate": "Jun 15, 2017", "userURL": "http://www.goodreads.com/user/show/61971658-frankie-lovely", "userReview": "[Cassius is so broody and every girl’s bad boy fantasy … and Locke is basically made from pure stardust from Heaven he is the most perfect character ever (yet still flawed and broken and real). Plus Locke says things like …“If a man needs to hurt a woman to feel good about himself, he is not much of a man.”PREACH SON! (hide spoiler)]"}, {"userName": "Katerina", "userReviewDate": "Jun 18, 2017", "userURL": "http://www.goodreads.com/user/show/5014021-katerina", "userReview": "I really should stop buying books for their cover.Although, to be fair, the premise sounded like my cup of tea, and it should have been. It was, mostly. But I feel like I'm slowly (and steadily) turning into a grumpy, bitter old lady who complains about anything and everything and cannot be satisfied, unless her 72 cats do something adorable.Don't get me wrong, Roar was not a bad book. The concept of magical lands ruled by storms was brilliant, and the execution was skillful; after all, Cora Carmack is a romance author, and this was her first attempt at fantasy. The most astonishing thing is that she succeeded in the fantasy element, but failed in romance and character depth. \n\n“Whether it be thunderstorm, hurricane, or some storm on which we have not yet laid eyes, one truth remains - challenge a tempest, survive it and you become its master.” \n\nThe lands of Caelira are tormented by all kinds of storms, which wreak havoc and destruction in their path. The only salvation for the people of Caelira are the Stormlings, gifted with the power to control the forces of nature and thus becoming something equivalent to Gods. Aurora is the heir of the Pavan throne, the one charged with the protection of her country from the tempests, but the problem is that she has not manifested any magic. The only way to keep her throne and save her people is to marry another Stormling and hide her inadequacy, until she meets a group of storm hunters who can harnest storms even though they were not born into magic. And reveal to Aurora another way to be of use, and to truly discover herself.\n\n“With that done, she took a deep breath and said her final good-bye.To Pavan. And to Aurora.From this point on, she could only be Roar.” \n\nWhile reading Roar it was obvious that Cora Carmack had poured her soul into this project. She elaborately crafted the kingdoms of Caelira, the wondrous and terrifying storms that ravaged cities and wastelands alike, and the strong aspect of adventure in her story made Roar a novel you couldn't put down. Even though at times the world-building could be confusing, and I'd appreciate more details to disperse the fog that clouded my brain, the occasional confusion did not deter me from keep reading, and losing myself in her rich world. Featuring a villain whose identity is yet to be revealed, but his cruelty and bloodlust are unprecedented, a ruthless prince fighting for a throne that is not his, and a bunch of badass storm-hunters, it was a highly addictive ride that had the potential for greatness. If it weren't for Aurora.She's your typical special snowflake, the embodiment of perfection, beauty, sweetness, strength, compassion, determination and-You're rolling your eyes, aren't you? So am I. Everyone fell in love with her and turned all possesive caveman after one look, she stole the breath away from ambitious princes and seasoned hunters alike, making the latest category endanger their long-term partners, distracting them in fights for their life, because she's such an aetherial and pure being. Aurora wavered between self-pity and the fiery need to prove her value and acquire power, leading her to smart decisions like demanding to participate in stormfights without an ounce of magic and zero former experience, because she knows she can do it.And let's not forget the dreadful combination of insta-lust and insta-love(s). In the span of twenty-four hours she trusted her fiance with her heart (something that has to do with her raging hormones, if you ask me), he broke her heart and then she met another dazzingly handsome young man that made her feel alive and burn etc etc. Now, as you can tell, there were two love interests. I wouldn't go as far as to label it a love triangle, because she had two to three scenes with the first one whereas she spent most of the book with the second, but their reactions to her were similar (and ridiculous); they see her - they want to conquer her - to protect her - to hell with the world. The romance was overly sweet and sappy, it gave you diabetes. The interactions between the love birds were rather childish (I'm surprised there wasn't involved any ponytail pulling) and while there were descriptions of tension and angst, you could not feel them. I still root for the other guy (the 'bad' guy), at least he's not turned into a pile of goo (yet).\n\n“You are lightning made flesh. Colder than falling snow. Unstoppable as the desert sands riding the wind. You are Stormling, Aurora Pavan. Believe it.” \n\nI may have mixed feelings towards Roar, but I will definitely continue this series. If you're searching for your next guilty pleasure rejoice, you just found it!\nYou can find this review and more on BookNest!"}, {"userName": "Maram", "userReviewDate": "Jun 22, 2017", "userURL": "http://www.goodreads.com/user/show/36873117-maram", "userReview": "Since I haven't written a review yet :) if you haven't already read my br partner's review then you missed out on some awesome references + the gist of this novel, as explained by em ofc :) link here, enjoy!^^^ just consider the good bits (she wrote) out of that review and ignore the rest, thank you :)---4.5 stars?? I'm still confused as hell ---HAHAHAHA WHAT WAS THAT EPILOGUE??? I NEED SOME EXPLANATION AND IDK WHY I'M LAUGHINGRating and review to come soon bc it's 6 in the morning and what was that epilogue???---BR WITH THE BEAUTIFUL, EM 💕*chants* pleasegetmeoutofaslumppleasegetmeoutofaslumppleasegetmeoutofaslumppleasegetmeoutofaslumppleasegetmeoutofaslumppleasegetmeoutofaslumppleasegetmeoutofaslumppleasegetmeoutofaslumppleasegetmeoutofaslumppleasegetmeoutofaslumppleasegetmeoutofaslumppleasegetmeoutofaslumppleasegetmeoutofaslump"}, {"userName": "Cora Carmack", "userReviewDate": "Mar 20, 2017", "userURL": "http://www.goodreads.com/user/show/12927505-cora-carmack", "userReview": "I've been dreaming of writing YA fantasy for nearly a decade. My hope was to write an exciting, unique fantasy world with an equally compelling romance. This book really took hold of me, and demanded to be written. It began with the idea of magic storms, storm hunters, and a black market. It took shape through the lens of a princess with a dire secret. I fell in love with so many characters as I wrote this first book, and I can't wait for you to meet them all and see how all their journeys unfold as the story moves forward! <3Check out excerpts from Roar below!Chapter 1 - https://goo.gl/i0roa5Cover reveal and excerpt - https://goo.gl/QbWDdbExcerpt - https://goo.gl/9LYKIaExcerpt - https://goo.gl/YPVoca"}, {"userName": "Cait • A Page with a View", "userReviewDate": "Jun 30, 2016", "userURL": "http://www.goodreads.com/user/show/47412532-cait-a-page-with-a-view", "userReview": "4.5 stars. Ok, the more I think about this book the more I do love it. I initially lost some enthusiasm when the story got so into Roar's training and a romance I wasn't quite into, but this entire world and story are so awesome that I don't even care now. I am 100% here for the sequel. Roar/Rora/Aurora is a bookish princess who's been sheltered by her mother so nobody can find out she's powerless. She's supposed to be a Stormling (someone who can capture the hearts of storms), so she needs to marry one to protect her kingdom. At the start of the story she's betrothed to Cassius, a Darkling-type Prince who's trying to plot his own plots around his evil father's plotting plots. That whole part of the story was obvious from the beginning, so I wouldn't go as far as to call the end of the book a \"plot twist.\" But I'm still just as interested to see how everything there will play out in the sequel!Anyways, Roar decides to create her own future and runs off with a group of stormhunters who can do magic even though they aren't royals who were born with it. Some instalove ensues and then she finds out she might actually not be as powerless as she thought...I could tell by reading the book description that this would probably be a lot of tropes. BUT that in itself actually isn't a problem for me! I obviously keep reading YA fantasy books because I like that familiar format. Princesses who are privileged enough to flee their super confining life will probably meet a hot guy + rebel group and change the fate of the kingdom together. Cliche moments can be fun when they're like seeing an old friend in a new setting... I just need the tropes to work. And this story totally did in every way! Even the super special snowflake power thing was fun. I also thought the multiple POVs brought a lot to the story. Roar was a likable character, but a bit hard to pin down since she's still struggling to figure out who she is and claim her place in the world. She's super shy, brave, bold, skittish, meek, ferocious, confident, and afraid all at the same time. And that's understandable, but also kind of gave me whiplash. So I don't have any actual opinion on her yet after the first book because she's definitely still growing. But all of the manipulating, manhandling guys and their manly possessive instincts got annoying really fast... and the instalove romance with Locke pretty much just made me cringe. But I LOVED Cassius. So much. His character walked a fine line between being ridiculously problematic or the greatest part of the book, but I rolled with everything and liked him a lot. He reminded me of Magnus Damora in a way with how they're both torn between doing good or serving their crown/evil father. I will be thrilled if the next book drops the bland Locke and gets more of a focus on Cassius! (He also has total Darkling potential btw if that's what you look for in a story).So the first 1/3 was REALLY strong and totally grabbed me, but I lost some enthusiasm in the second half. A lot of this story started to feel like exposition. I think that's where I often have issues with the start of a series: I still want something close to a complete plot arc in each book. Any actual threat was just tacked on at the end (and what was up with the Stormlord). So that's just me being weird... I still loved the start to this series!! If you're a huge YA fantasy fan, you'll probably have fun with this too.Thank you to the publisher for sending me an ARC and finished copy."}, {"userName": "Lola  Reviewer", "userReviewDate": "Jan 31, 2018", "userURL": "http://www.goodreads.com/user/show/14596170-lola-reviewer", "userReview": "The main character may look like Daenerys Targaryen, but Aurora Pavan is nothing like the Khaleesi we know."}, {"userName": "Ashwood, 불", "userReviewDate": "Aug 24, 2017", "userURL": "http://www.goodreads.com/user/show/50173624-ashwood", "userReview": "Sometimes she was Aurora. Confident. Clever. Cultured. Sometimes she was Rora. Afraid. Alone. Ashamed. And more and more, she was Roar-- bold, brash, and increasingly baffled by the situation in which she found herself. And sometimes she was none of them, lost and adrift somewhere in between, like the wildlands between Stormling cities. If I could give this book more than five stars, I would in a heartbeat! This was an amazing, phenomenal and intense read. All the different dimensions to this book was fascinating and mind blowing, Stormingings, Hunters, Elemental Witches, and lastly Stormlords. The characters were badass, brave, loyal, reliable, fiercely protective of their loved ones, and had insane survivor instincts! Kiren and Roar stole my heart and I'm letting them keep it because they are one of the most beautiful, loveliest and strongest couples ever! Their connection, even the occasion battle of wills, is natural, effortless and spectacular to read about. Favorite characters: Roar; brave, loveable, fierce, sweet and a true force of nature. Kiren (or more commonly known as Locke) precious, intimidating, protective, strong, amazing and mine (that counts as a character trait😋). Cassius; brutal, semi-vicious, gorgeous, scarily powerful, admittedly he has his flaws but nobody's perfect and he's also mine haha. Duke, Jinx, Ransom, Bait were the heart of their fearless crew. Novaya; amazing, unexpectedly badass (in her own way), and loyal to a fault. Least favorite characters: Sly, the Lockes (besides Cassius of course), and the Stormlord (still iffy on that one, don't know if he's really good or bad but I'm sticking with bad until the 2nd book comes out). One of my favorite parts of Roar and Locke(Kiren): \"I think if you met a bear in the woods, you might order him not to eat you and he might just listen\" said Locke. \"Well, there are some books that suggest challenging a bear. To pretend as if you are the greater predator to scare it off,\" replied Roar."}, {"userName": "Fables&Wren", "userReviewDate": "Jul 21, 2017", "userURL": "http://www.goodreads.com/user/show/42780417-fables-wren", "userReview": "WrensReads Review:This book has THE COOLEST CONCEPT IN THE HISTORY OF ALL CONCEPTS IN THE KNOWN AND UNKNOWN WORLD. Like, holy crap Cora Carmack, how in the world did you just come up with this world? It is totally unique and beauty and I need more than one story in this world and I also need the next book to just appear in my hands. So let me just gush more about the world here. THESE PEOPLE FIGHT STORMS. Like they literally will go out and fight a tornado. The only way to stop the tornado is to get the gem that is in the middle of the storm that is called the heart. Let me reiterate: THEY STILL THE HEARTS OF STORMS. I don’t know why this whole thing just blows my mind, but it legitimately makes me contemplate what my life is about. Like here I am waiting for Game of Thrones to happen and Aurora and her people are out there fighting fire that comes down from the sky. Am I the only person who feels this is the coolest thing to happen to the book community since Rowling’s Wizarding World? Probably, and I’m okay with that. So back to the actual story, Aurora is a princess. The royalty is who has the power to fight a storm, because not everyone has that liberty. It stays within a bloodline usually, but you also have to fight the storms to get their hearts. So if you have a tornado’s heart, it doesn’t mean you can fight a tidal wave as well as someone who has a tidal wave’s heart. The more hearts you have, the stronger you are as a stormfighter. So when Princess Aurora shows no powers when she comes of age, her queen mother negotiates her marriage to a powerful family of another kingdom to keep this from becoming public knowledge. No one knows that she can’t actually do what she was born to do. #Protagonist: I love the character growth with Aurora. Because in the beginning of the book, so is naïve and is kind of a quiet personality; she even feel for a game being played on her in the first few chapters. But, she finds something else that might save their reign, and without having to marry herself off for power instead of love. The whole journey of her finding herself was just so pure and enlightening. Not to mention the people she meets. It was kind of like their own little version of the gang from Six of Crows (which I found a lot of other reviews also saw that comparison). You had the loud mouth girl, the light-on-her-feet girl, the goofy boy, the brooding boy and the strong-silent-type boy. I mean, there’s also like a wise-old-man in the group and then you have our girl Aurora, but I still kept thinking of Six of Crows, even though these books are vastly different. #CoProtagonist: Locke is a strong character. Things get a little predicable, but I wasn’t made about that when it came to him. He is about to go ballistic in the beginning of book two though because of what he is about to find out. I am looking forward to hearing more about his past because I think there is more to him than just chasing storms with his gang. #AntiHero: The betrothal, Cassius, needs more time in the lime-light. He is dark, handsome, broody and has his own agenda and I need to know more about him. I have a feeling that in the next book, he is going to be taken over the pages and I am not even mad about it. I wouldn’t be mad if Aurora ended up falling in love with him because I was after like chapter two so. #Supporter: Nova, the only friend Aurora ever had, also needs more screen time. The crowns of the Stormling Kingdoms have tried to kill out the witches of the world... and have done a poor job of it because one has been under their nose this whole time. She’s about to break everyone’s world wide open and I am pumped. I’m also not mad about the love triangle that is about to form, possibly a love square if the author allows it. Love triangles are usually overplayed these days, but I am living for the tension this is going to bring with these characters.I absolutely loved this book and I plan on reading it again at least three times before the next one comes out. WrensReads | Goodreads | Twitter | Instagram---This is quite possibly the best book I have ever read. Review is comin' Oh and also, I'm dead. No funeral though because I'll probably just become [spoiler here and no I don't spoil things unless you ask me too but MY LAUUURD THIS BOOK]."}, {"userName": "Beth", "userReviewDate": "Jun 21, 2017", "userURL": "http://www.goodreads.com/user/show/44125660-beth", "userReview": "This is probably one of my favourite books of 2017, I honestly enjoyed it that much!ALL OF THE STARS! Every single one!Just going to throw this out there Locke is 10000000000% a new favourite Character!”And the skies know my girl is a fighter. Our world is brutal, but you are brave enough to face it. I know you are.” This month I’ve decided only to read books from Book Subscriptions. Roar was in my first ever Fairyloot so I thought what better place to start than my first ever one? I cannot begin to explain how amazed I am with this book. I can honestly say this book surprised me with how much I enjoyed it! The storyline, the building of the atmosphere… the characters! I just loved everything!The plot is just so in depth, there’s lots of different things going on and a few different POV’s from other characters. I really enjoyed this aspect, with this we saw different views and things weren’t so one sided. The more the story continued the more we saw into different snippets of stories that were so intriguing I want… no wait. I need more! With that epilogue I literally cannot wait for Rage!If she were a storm, she could destroy him, and he would never lift a finger to protect himself.”The story is about Aurora/Roar, when we first see her she is the Princess who everyone wants to know about. In this world people have the ability to fight storms and take Stormhearts. Due to her family being so high up, and seeing the power of the Queen her mother, everyone wants to know what her ability is and the pressure is really on! I loved her character, yes she did fit into certain tropes, however that doesn’t take away her as a character. We see her battle with herself, trust of others, all of her secrets! I enjoyed seeing her grow as a character and I literally can’t wait to see how she develops in book 2!LOCKE! Oh my. I can’t. He can take my heart. I cannot explain how much I adore his character. He is just so understanding, he know how to push Roar to her full ability but no go overboard. His protectiveness towards her is just so compelling and not over-bearing or controlling. I liked the building of the relationship, the little arguments, how much he respected her… He says the most beautiful thing to her and I swear my heart shattered (of happiness!)Now, I love Locke… but I am also ever so slightly intrigued by Cassius, like WHAT THE FUCK IS HAPPENING?! I want to know SO MUCH. So so sooooooo much! He’s like all darkness and has secrets that we still don’t know MORE MORE MORE PLEASE!When it comes to Duke, Jinx, Ransom, Bait, Sly and Nova I’m just going to put this here, but I want more of the “side characters” like they all come across as so interesting and I just need them more present! They could be as well liked as some of my favourites, but they need to be much more present in the next book! The glimpses we get into these I liked, but more please! What I liked?- We had witches, mother fucking witches and not the normal kind!- The back stories we got were SO good!- Ransoms little chat to Roar about accepting what people said and why it had to be done in certain ways. Sometime no isn’t enough and to know WHY is so much better!- All of the elements were SO intriguing!- STORM HUNTERS! I mean how good does that sound?! Come on now…- Everyone loves a bad Villain right? We no hardly anything about this Stormlord, not even a name and this is SO gripping!- NOVA!- How smart in Roar? I mean if she doesn’t want to do something, she’ll find a way to get out of it! I honestly don’t think I disliked anything in this book (other than that I wanted more of the crew), so instead here is what I want from the Rage…- ANSWERS! I need to know SOMETHING, ANYTHING?!- Please give me more Cassius chapters/sections whatever you want to call them- LOCKE- Please me as enjoyable as Roar!Overall I LOVED this… can you tell? Thank you for bringing Locke into my life, I’ll be just swooning over him for a while and while I’m at that I’ll be thinking about what’s going to happen in Rage. I am far too excited for this release already!"}, {"userName": "Maria✦❋Steamy Reads Blog❋✦", "userReviewDate": "Jun 13, 2017", "userURL": "http://www.goodreads.com/user/show/44673856-maria-steamy-reads-blog", "userReview": "➦This is Cora Carmack's first YA fantasy novel and all I have to say is - job well done!!! I really loved it to bits! The premise is original and I was fascinated by it from the beginning.➦Imagine the world where humans battle against the storms for survival. The Stormlings are people who have abilities to fight the storms with magic and are able to protect full cities. \n\n\"The believe that storms come from the souls of the dead who lived exemplary lives. They're birthed again as part of the elements.\"\n\n➦The heroine of this book, Aurora, is a Stormling - a princess, who will one day need to protect her home. She has no magic to do so and people don't know. There is no other way but for her to marry another powerful Stormling. \n\n\"She was a princess without the power to keep her kingdom, a girl whose future had been decided for her.\n\n➦Right before the wedding, however, Aurora stumbles upon a magic market and meets hunters. As in storm hunters. People who were not born with magic. Surely if others can learn to hunt the storms so can she? And may be this one particular handsome hunter can show her the ropes?➦The rest of the book follows Aurora's journey of self discovery while on the road with the storm hunters. It's completely captivating and intriguing. Interesting things keep happening to her and they will leave you guessing until the very end! I'm still left with tons of questions and therefore cannot wait to read the second book in this series. This book's terrific world building, storm battles, action and breathtaking romance will satisfy and lover of fantasy! \n\n\"Feeling this was, the way I do about you, Roar, it's scarier than any storm I've ever faced.\""}, {"userName": "maymay❀", "userReviewDate": "Jan 15, 2018", "userURL": "http://www.goodreads.com/user/show/49148508-maymay", "userReview": "im 110% done with this book and myself. i dont even know what to say here bc well....i dont recall much of the contents of the book :) that's always great. basically im like highkey done with everyone and theyre missing personalities. what a shame since the world and magic were fabulous. bye cassius, see you never mr. possessive ~~~~~~~~~~~~~~~~~~~~~~~~~ buddy read  with beyoncei've read so many mixed reviews on this book so :') i'm ready for everything except disappointment"}, {"userName": "Simona Bartolotta", "userReviewDate": "Jan 20, 2017", "userURL": "http://www.goodreads.com/user/show/5312173-simona-bartolotta", "userReview": "[Aurora’s decision to leave with the hunters. She wanted to understand how to develop magic of her own and they had the answer, and I get it, but, to leave like that? It seemed like a pretty foolhardy decision to me. And I think that her mother, determined as she was, would have supported Aurora getting the help of the hunters if that could get her daughter even just a scrap of magic (hide spoiler)]"}, {"userName": "Warda", "userReviewDate": "Jul 28, 2017", "userURL": "http://www.goodreads.com/user/show/30036082-warda", "userReview": "I AM IN LOVE!!!!!!!!! LOCKE, BABY! 🤤🤤🤤*DIES OF FEELS*The best types of books are those that take you by surprise and this book definitely did. WHERE'S THE FAN ART AT?! I am SO excited for what Cora Carmack has in store for this story. So much groundwork has been laid and I can't WAIT for it to be build upon. There's a lot of room for epicness to take place and that makes me so fuckin' giddy! I hope she delivers!I'm sucker for the weak-protagonist-comes-into-his/her-own type trope. There's something about it, when done right, that just instills power and hope in me. Review to come when I can think. Or not."}, {"userName": "Heather 'Bookables'", "userReviewDate": "Jul 02, 2017", "userURL": "http://www.goodreads.com/user/show/5376236-heather-bookables", "userReview": "Oh my did I love this book! It had such a unique plot with storms and storm hunters and I just loved every bit of it! Also loved the main character and the love interest as well!I cannot wait to read the rest of the series!!"}, {"userName": "Jiana", "userReviewDate": "Jul 03, 2017", "userURL": "http://www.goodreads.com/user/show/10502567-jiana", "userReview": "Buddy read with CAIT!Roar was one of my 2017 anticipated releases. I admit the cover was what made me want to add this book. I mean, let's be real, how gorgeous is that cover?? Ignore the fact that it took me 21 days to read it; I was slumping on and off. Anyway, I really enjoyed this book! I know Cora Carmack as a contemporary romance writer. I've previously read only one of her books years ago and I remember enjoying it, so I was quite excited to see if she could pull off a fantasy! And... good well done, Carmack! Roar is one of the most unique fantasy YA novels I've read so far. I admit it had cliche aspects and tropes here and there... but I don't really care. I still liked it nonetheless! The world building, despite still confusing to me, is very unique and I actually liked the idea. The book dragged, despite it being 380 pages only. Nothing much happened and I think that was one of the few problems I had with this book. \n“You are lightning made flesh. Colder than falling snow. Unstoppable as the desert sands riding the wind. You are Stormling, Aurora Pavan. Believe it.”\nThe characters grew on me as the book progressed. Aurora/Rora/Roar slowly progressed from a timid MC to a strong one and I'm excited to see what more she'll do in the sequel. As for Locke, I didn't like him much at first. I thought he was pretty typical and average, but then he grew on me too and I ended up liking him a lot! I also really enjoyed the romance between him and Roar. Now Cassius is a character I want to know more and more about! I'm really excited for the next book, I think this book centered more around building up the different aspects of the book that it missed focusing on events and it gave room for that to happen in the sequels."}, {"userName": "Caitlin", "userReviewDate": "Jul 03, 2017", "userURL": "http://www.goodreads.com/user/show/57334157-caitlin", "userReview": "Buddy reading with Jia I haven't finished a book in a day for a while. That definitely shows that I really enjoyed this unique yet cliche story! Overall all I can say is that I liked it and I enjoyed it. Going into this book, all I knew was that the cover was gorgeous (it's going to look so beautiful on my shelves like it's seriously breathtaking) and that there was a lot of hype around it. I hadn't even read the blurb when I picked it up. To begin with I was really exciting to read about the kingdom/s because that's definitely my favourite setting in books but then it more so turned into the story of a runaway princess rather than anything else. It wasn't exactly what I was expecting but it was definitely still good!The characters were likeable and the world and magic system was definitely very unique but I'm not too sure if I have a complete grasp on how it all works. The romance was definitely very cliche and had me rolling my eyes. It was cute and sweet but do they seriously have to be in love with each other after knowing each other for a few weeks? Spare me please. The only main problem I had with this book was that it seems to have no climax. It kept building up but then nothing really happened. It was like it was building up to the climax and then all of a sudden the book stopped. I think I'll enjoy the sequel more than this one because this book ended with a very interesting set up for future books. Roar left me wanting more in two ways. I wish there was more in this book so it didn't seem like such a sudden ending but I also just really want the next book to see what's going to happen next."}, {"userName": "Tweebs♥️", "userReviewDate": "Jan 15, 2018", "userURL": "http://www.goodreads.com/user/show/35431290-tweebs", "userReview": "the only thing this book managed to do is get that katy perry song, \"Roar\", stuck in my head. ********************************************* pre- review Buddy reading with my  #1 fan 💙 It's about time.This book better be goddamn beautiful and make me question why I started this so late."}, {"userName": "Alyssa", "userReviewDate": "Mar 30, 2017", "userURL": "http://www.goodreads.com/user/show/8472395-alyssa", "userReview": "***Review posted on The Eater of Books! blog***Roar by Cora CarmackBook One of the Stormheart seriesPublisher: Tor TeenPublication Date: June 13, 2017Rating: 4 starsSource: ARC sent by the publisherSummary (from Goodreads):In a land ruled and shaped by violent magical storms, power lies with those who control them.Aurora Pavan comes from one of the oldest Stormling families in existence. Long ago, the ungifted pledged fealty and service to her family in exchange for safe haven, and a kingdom was carved out from the wildlands and sustained by magic capable of repelling the world’s deadliest foes. As the sole heir of Pavan, Aurora’s been groomed to be the perfect queen. She’s intelligent and brave and honorable. But she’s yet to show any trace of the magic she’ll need to protect her people.To keep her secret and save her crown, Aurora’s mother arranges for her to marry a dark and brooding Stormling prince from another kingdom. At first, the prince seems like the perfect solution to all her problems. He’ll guarantee her spot as the next queen and be the champion her people need to remain safe. But the more secrets Aurora uncovers about him, the more a future with him frightens her. When she dons a disguise and sneaks out of the palace one night to spy on him, she stumbles upon a black market dealing in the very thing she lacks—storm magic. And the people selling it? They’re not Stormlings. They’re storm hunters.Legend says that her ancestors first gained their magic by facing a storm and stealing part of its essence. And when a handsome young storm hunter reveals he was born without magic, but possesses it now, Aurora realizes there’s a third option for her future besides ruin or marriage. She might not have magic now, but she can steal it if she’s brave enough. Challenge a tempest. Survive it. And you become its master.What I Liked:I've read several of Cora Carmack's New Adult novels (her Losing It series, specifically), and I've had pretty good success with those books. When I saw that Cora would be publishing a YA novel - her YA debut - I was pretty thrilled! Especially after reading the synopsis, and then seeing the cover of this book. I had high expectations for Roar, and my expectations were met and exceeded.Aurora Pavan is the heir to the throne of Pavan, daughter of many powerful royals... and a magic-less Stormling. She and her mother have hid this for years, isolating Aurora from everyone. But as she is now eighteen, and the Rage season is coming, they can't hide Aurora for much longer. The solution? Arrange a marriage with the second son of the King of Locke - Prince Cassius, the cold, hard young man with more Stormhearts than a second son should ever have. When she follows him one night, Aurora discovers a black market full of magic, in which people are buying and selling storm magic, thanks to storm hunters. Aurora may not have her own true Stormling magic, but she can learn and obtain this storm magic. This way, she can take control of her destiny. Usually I don't love it when books have long synopses, like the one we see on Goodreads and on the back cover of this book, but I actually really appreciated that long synopsis. On the surface, this book isn't complicated: girls has to get married, girls finds a new option to be free, girl runs away, girl hides who she is to her new friends, girl learns about her power... and then the ending of the book, which I won't spoil. There is a lot more going on than meets the eye!Aurora (or Rora - or Roar) is a complicated girl. Yes, she is a princess and therefore much more privileged than most of the common folk in her country who are poor and destitute and often denied citizenship (a fact that Aurora doesn't know). But Aurora is lonely and she is forced into this arranged marriage for her safety. She hates that she has no choice, but she also wants to live. Aurora has a temper and sometimes she gets too upset and too impulsive and is too reckless. But she has a good heart and she defends and protects herself well. Prince Cassius is more complex than the cruel, hard villain that we expect him to be. I still don't like him and I'm still very convinced that he is a \"villain\" archetype, but we really get to understand what his motives are, and why he is so desperate and angry. He does terrible things to Rora (mostly manipulative), and I can't like him because of those actions. But I can appreciate how Carmack dug into his character and made him more than just a villain, in terms of character archetypes.I should mention that there are five key POVs in this book: Rora's, Cassius's (occasionally), Nova's, Locke's, and Evil Dude (I won't say much about him). Nova is Rora's childhood friend and maid (yeah that's a little strange, I know), and Locke is... Locke. Incredible storm hunter, and Rora's love interest. Though he is so much more than a love interest.You can probably already tell, but Locke is my favorite character of this book. He and Rora go toe-to-toe in nearly every scene of this book, which is so fun to watch. He is equally as stubborn as she is, and he is just as used to getting his way. A big difference is that he is a natural, commanding leader, and he is in charge and used to being in charge. He has great instincts and he is very clever. Rora should have trusted him more initially! He is very smart and intuitive, and also protective and a good man. He is strong-willed too, hence the clashes.Seriously, Locke and Rora were so fun to watch. They butt heads on every page - which isn't surprising, because their personalities are like fire and ice. They're similar, and yet so different. Rora is fire, with her temper, and Locke is ice, with his cool facade and worldly experience. The romance was steamy and explosive! With all of the bickering and banter and constant arguments, you know the romance was going to be on fire. This romance was also hate-to-love (sort of), which is my favorite. Locke and Rora are so great together!No love triangle! It might seem that way, because Rora is contracted to marry Cassius. But she loathes him (and for good reasons), and he doesn't really care about her either (she is a means to an end, for him). And then Rora falls for Locke (and vice versa) and it's legit. Of course, Locke is in the dark about who she is but... anyway, no love triangle in this book. I don't really get the sense that Carmack will work a love triangle in the next books, but who knows? I hope not.The world-building of this story is amazing! I personally haven't read any YA fantasy like this - in terms of the storms and stormhearts and storm magic. Usually it's the elements (earth, fire, wind, water), and you can kind of see the elements play a factor, but in the storms. I can't wait to see more about the storms in the next book! And of course, I would like to see more of a high-stakes aspect that YA high fantasy often has - but we see the beginnings of this type of plot, with the introduction of the Evil Dude who is planning the destruction of kingdoms.Most of this book deals with Rora running from Pavan and joining Locke's storm hunting team, in which she learns a lot about storm hunting and survival. No one knows who she is, not even Locke. But towards the end of the book, Rora knows she must make a choice. This book honestly didn't have a ton about the storms and magic and whatnot, or the political situation. BUT I think Carmack is setting up all of that for the next books. This book barely scratched the surface of Rora and Locke's story, and so I'm looking forward to seeing more about the storms, the Evil Dude, Locke's past, Rora's reveal, the political situation in Pavan, even Nova's situation. Suffice it to say, I need more!What I Did Not Like:Sometimes Rora and her temper got on my nerves, especially when she was a little mean to Locke and then didn't apologize for what she said - and yet he basically groveled and went above and beyond, whenever he messed up. I think an important part of being such a strong and independent female is that you should own up to your mistakes. A lot of YA and adult female authors like to have these strong female protagonists in their book and a male who caters to the female. BUT, I these female protagonists should own their mistakes, apologize, and not act so superior. Just like how the authors have the male acting. Right?Would I Recommend It:If you like YA fantasy romance, this is a great start to the series! I might recommend waiting though, because I'm always wary of YA fantasy series these days. Love triangles seem to be reemerging in YA in general, and I personally am not a fan - though I don't think Carmack will be going that route, in this series. But again, who knows. THIS book was good. Hopefully the rest of the series is. The world-building of this book is very unique and so intriguing - honestly I would recommend this book based on the world-building alone!Rating:4 stars. A story as beautiful as its cover! I can't wait to read the next book! And also check out its cover. I hope the cover is just as stunning! Pre-read squees:Fantasy world, tough heroine, swoony romance, fierce storms - what's not to love? You want this book!***ROAR GIVEAWAY***Love the graphic below? ME TOO! If you would like to share it, please use the hashtag #Snowstormlings in your post. Share away, on Twitter/Facebook/Pinterest/Tumblr/Instagram/etc.! IF YOU SHARE, you could win an eARC of Roar! (You have to use the #Snowstormlings hashtag though!)Even better - help a girl out and \"like\" \nTHIS\n post!"}, {"userName": "Joshua Gabriel (조수아)", "userReviewDate": "Jun 04, 2017", "userURL": "http://www.goodreads.com/user/show/8832758-joshua-gabriel", "userReview": "She was a bundle of contradictions, but one thing he understood all too well was her independence.Roar is one of the most unique and romantic YA fantasy books I've ever read. Before this, I hadn't read anything by Cora Carmack. Hence, I really didn't know what to expect. Still, looking at the covers of her already published works, I had a hunch that I was in for a lot of cheesiness. :3Essentially, Roar is a fusion of Veronica Rossi's Under the Never Sky and Mary E. Pearson's The Kiss of Deception because it is about a runaway princess who lives in a world ravaged by powerful, fantastical storms. Also, like the latter trilogies, Roar contains a plot that is rich in action, political intrigue, and romance. Despite this lack of originality, I am willing to give this book a high rating because it hooked me from start to finish.Calling this book \"cheesy\" is not an exaggeration. From the very first chapter, sparks were already flying between Princess Aurora and a certain fishy man. When Aurora ran away, she met her real love interest, and there were mounds of melted cheese everywhere. With large servings of sugar. Flirty banter was rampant, as well as stolen Xs and Os. Haha. For the most part, it was very entertaining, but there were times that I couldn't help but sigh and roll my eyes in disdain. It was like this book was the epitome of raging, teen hormones, or better yet, Selena Gomez's Hands to Myself. Be sure to take some water breaks while reading this novel. :D My favorite aspect of the book was its unique world and magic system. Aurora and the other protagonists in this book were Stormlings, special people who could destroy various storms (firestorms, thunderstorms, and more). They were also capable of stealing the jeweled \"hearts\" of such phenomena, thereby gaining magical powers. In that sense, the relationship between humans and storms was not necessarily bad. The storms themselves were surprisingly sentient, having emotions like the humans they aimed to harm. It was honestly my first time to read a fantasy novel that personified natural disasters, so I found Roar to be a breath of fresh air.The not-so-major problem I had with this book was its lack of a climax or conflict. Many events happened throughout the novel, and although they were relevant, I kept on waiting for something more serious to happen. The most probable cause of this flaw is, unsurprisingly, the book's focus on romance. A lot of effort was put into building romantic tension to the point that more meaningful plot points were neglected. Don't get me wrong; I do love a good OTP. Nevertheless, that's not the only thing I look for in books.In totality, Cora Carmack did a good job in writing her first YA fantasy novel. In spite of its shortcomings, Roar is a book worth reading. I particularly loved its fascinating take on the connection between humans and the natural world. If you are an avid fan of the author's previous, romantic works, you'll probably enjoy this book more than I did. Happy reading!"}, {"userName": "Sh3lly ⚔ tired of damaged heroines ⚔", "userReviewDate": "Jun 25, 2017", "userURL": "http://www.goodreads.com/user/show/25393430-sh3lly-tired-of-damaged-heroines", "userReview": "Review also found at: Dust Off Your MacHalo blog.Aurora/Rora/Roar (she has got a lot of names in this) is a princess with no power. She comes from a line of Stormlings, the elite who protect their kingdoms from violent storms of all types that ravage the world. Twisters, hurricanes, thunderstorms, fires, any storm you can think of... they seem to be alive and even sentient. They have \"hearts\" that only Stormlings can take and extinguish, giving them more power and protecting the people.Only it's not quite so perfect and things have been kept from Rora. She has lived a sheltered life and discovers there's a whole new world out there, after she sneaks out and follows her sketchy betrothed Prince Cassius. Stuff happens and Rora takes on a new identity as an apprentice with a rag-tag group of storm-hunters.So, this started strong for me and somehow just fizzled out by the end. The world-building was fairly interesting, although this kind of magic is not my favorite. I think my biggest issue was the romance. :/ There is a weird sort of maybe-love triangle, although not really? The main romantic interest was Locke and I just couldn't get into the lust/hate relationship between him and Roar (as she is known to the hunters). Instead of fun bantering, it felt too angry and argumentative to me. I didn't really feel any chemistry.Cassius was the most intriguing, although I find it hard to believe there is a way to redeem him. He did some pretty crappy things in this. But the ambiguous villain is a personal favorite and we are never quite sure if Cassius is full-on bad guy or just warped from the upbringing and being forced to play palace politics.There were several scenes with Cassius and Nova, who was Roar's childhood friend and maid servant (whatever you call them). I think I saw somewhere that someone mentioned a ship between her and Cassius, but I don't see how she could ever forgive him for being such a douche to her in this book. :/I also felt there were too many \"training\" scenes, which are never a favorite of mine, and also, I dislike the plot device where the heroine is sick or mysteriously weakened by forces we don't discover until the end of the book - and that happens to Roar.I did appreciate how Roar is mostly capable of handling herself and wasn't a damsel in distress (outside of that mysterious condition she developed around storms). She wasn't run over by the cute men in her life, although there is a fairly good amount of angst (do I like him or do I hate him, why do we fight so much when all we really want to do is kiss, argh lol).Overall, a decent fantasy that didn't quite push this into the \"really liked\" category. :)"}, {"userName": "Nastassja", "userReviewDate": "Mar 14, 2017", "userURL": "http://www.goodreads.com/user/show/7734134-nastassja", "userReview": "Actual rating: 2.5 starsI didn't have high expectations about this book, just wanted something light and entertaining to read, and for the most part the book delivered. It has a very intriguing concept I haven't met in other YA fantasy yet: controlling storms and capturing the magic in their hearts aka the eye of the storm. The amazing tempest catching quest was vivid, breath-taking, with enough detail to satisfy even the most demanding readers. The concept was definitely not my problem with this book.Characters and romantic line is what killed the joy. I am a very fastidious reader when it comes to connection with characters in a book. If I don't 'feel' a character there's almost 100% possibility I wouldn't enjoy the book. Alas, that is what happened here. I am inclined to tribute such case to the fact that this book is heavily relays on romance and the heroine Aurora interacts with her romantic interests a lot. Now, I didn't care for romance, it was quite disturbing, to be honest, and consequently I didn't find it in myself to care for Rora too. But it's more 'it's not you, it's me' case, because objectively I saw character-development in Rora, she was a nice, quite reasonable (not when it comes to love, though) character, but I just didn't care enough to be bothered with her person. First of all, I didn't like that everyone was perfect: beautiful, clever, masculine - love interests were especially a picture of male perfection I call 'abs alert' don't come closer or you might accidentally kill yourself stumbling over all that perfection. Secondary, we have two cases of insta-love. Rora instantly falls in love with interest #1, then in a short while she meets love interest #2 and falls instantly for him too. Granted, the only good thing about it is that the love-triangle in a way dissipated and Rora spent most of the book with love interest #2. But no one guarantees love-triangle wouldn't come back in book 2. Thirdly, both male charters don't have personalities; all they mostly do the whole book is showing off their muscularity and manhandling Rora a-la 'Me Tarzan, You Jane' style. The worst part, the girl likes it. He leaned down to nip at her swollen bottom lip. “I’m the first to touch this mouth? To taste it?” Her nails dug into his shoulders, and her blue eyes flashed with heat. She nodded, her tongue darting out to sooth the skin he had tugged between his teeth. “That means it’s mine. My territory. And I’m prepared to protect it, every hour of the day if I must.”It feels that author's previous works were in new adult genre: ownership of women' lips and other body parts is an everyday occurrence in there. I don't find it romantic, not in the least.Intriguing concept + cringe-worthy romance = 50/50 killjoy.I am almost sure I'll read book 2, because I am highly interested about the plot and where it'd go in the next installment, besides there were interesting hints about some events in the end of the book, and, at least, for that I want to pick up the book. As for the romance, I thing it actually might get worse, but definitely not better, so I don't have any misconceptions about it. I'd say go and try the book, this is one of those cases when it was not my cup of tea but other people might find this story to their liking."}, {"userName": "Sarah", "userReviewDate": "Oct 03, 2016", "userURL": "http://www.goodreads.com/user/show/3344685-sarah", "userReview": "Caelira is a land besieged by powerful storms and people's only hope of survival is to band together in towns protected by Stormlings, powerful magic wielders who are able to keep those storms at bay. As the princess of Pavan and heir to the throne it is Aurora's job to keep her hometown safe but even though she's from one of the most powerful Stormling families she has never been able to use magic against even the weakest storm. The queen has managed to keep Aurora's lack of magic a secret but in order to protect the future of their city she has arranged a marriage for her daughter to a powerful Stormling prince from a neighbouring kingdom. At first Aurora is resigned to the idea of marriage but the more she learns about her future husband the more she fears for her future. When she discovers that there may be a way to earn the magic she needs to protect herself and her city she knows she has to risk everything to follow her dream. If only she can be brave enough to face the storms she might be able to learn to control them.As a fan of Cora Carmack's new adult romances and a lover of YA fantasy I added Roar to my wish list as soon as I heard about it. I was curious to see how she would do witting such a different type of story and I have to say I was really impressed. I'll admit I was a bit nervous when we were given not one but two serious cases of insta-lust in the early chapters but I was already hooked enough to look past that and I'm very glad I did. While Aurora does have a strong attraction to two very different guys thankfully the whole book doesn't revolve around a love triangle and there is much more going on than meets the eye.When Aurora, or Roar as she comes to be know as, leaves everything she knows behind to go with the Storm Chasers she quickly starts to come into her own. In some ways she's led a very sheltered upbringing and is naive to the way people live outside her city but she's been trained from a young age to be a queen so she has a lot of knowledge and she's a very fast learner. She's also determined, she doesn't want to fail her queen or her people and she fights hard to be accepted by the Storm Chasers so that they'll teach her how to master the storms. No matter what challenges are thrown at her Roar never gives in and I really admired her spirit.I also loved the Storm Chasers, they're a diverse group who have been together for a long time and work really well together. They're a well oiled team and some of them aren't too happy about adding a new member but they gradually come to respect Roar as they spend time together. I loved the banter between the whole group and the brotherly bond between Locke and Ransom. I'll tell you right now I'm totally on Team Locke and I'm going to be seriously unhappy if a love triangle forms in the sequel!Although the attraction between Roar and Locke is pretty instant it takes time for them to open up to each other and become friends let alone anything more than that. There is lots of delicious flirting and they spend a lot of time at loggerheads but the chemistry is there right from the beginning no matter how hard they both try to deny it. Locke is that great kind of hero who is able to put is protective instincts to one side and help the heroine learn how to look after herself, he trusts Roar to hold her own and follow his lead in dangerous situations and allows her the freedom to make mistakes when her life isn't on the line. I think they make a fabulous couple and I'm definitely rooting for them even though I was disappointed that Roar wasn't more honest with him and the rest of the group a little earlier in their journey.Obviously I love the characters but it was the world building that fascinated me most in this story. The idea of storms being practically alive and of being able to tame them by stealing their heart was totally unique to anything else I've read and the scenes where the Chasers are facing tornados or hurricane winds were incredibly well written. The plot is much more complex than you first think too, there are a lot of hints and I'll admit I guessed a few of the twists before they happened but there were plenty of surprises along the way and I'm definitely curious to see how things progress in the next book. Roar totally lives up to it's stunning cover and I can't wait to spend more time in this world.Source Received via Netgalley in exchange for an honest reviewCover Love (before reading):That cover!! It's soooo beautiful <3\nLet's just take a closer look at that artwork:\nI don't even have the words for how stunning that is! I need this book in hardback, in fact I need a giant poster just of this artwork to put up on my wall somewhere so I can spend all day staring at it."}, {"userName": "Khadidja ", "userReviewDate": "Jun 16, 2017", "userURL": "http://www.goodreads.com/user/show/63230474-khadidja", "userReview": "The most two akward things in life are : 1- Waving back at someone who seems to be waving at you, and then realise that they didn't even knowledge your existence. 2-  3 stars rating. I don’t really know why I'm only giving  Roar  3 stars but i feel like if i gave it more than that i won't do justice to the other books i really liked.  Readers' life is so fishing hard So i went reading this book with ultimate big expectations, i mean have you seen the cover? IT'S SO FREAKING GORGUES!! and the plot! Storms and heartstorms  hot dudes  and all so of course i would expect to give it a solide 5 stars....But then i opened the book, read it, and realised that it somehow failed me...So here are things you should know about Roar :● She's a princess and the only heir of Pavan. ●She came from a family of Stormlings -Those who have storm magic and can take them down by using Stormhearts- ●She was raised pretty much like Rapunzel, isolated, not allowed to have friends, doesn't really go out from the palace whenever she wishes. Why? Because she has no storm magic, only her and her mother knows. So typically her mother tries to protect this secret at all costs, because her daughter is the heir and if people knew they will use it to their advantage blah blah blah I loved the plot! But i was disappointed with the MC, she was naive and kind of stupid? I don't know but the back of my mind keep nudging me to get annoyed by her so i obeyed. Overall, there was character's development and i liked it. Now now let's get to the most important thing in this book :  CASSIUS   Cassius Locke melted out of the shadows, looking more like a villain than a prince—dressed all in black with dark hair and eyes to match.Hello, my new doom  *swoons* i basically fell in love with him when i first learned his name. And just like always, i didn't get enough of him I. WANTED. MORE. CASSIUS. Isn't that clear? He gave me The Darkling's vibes and i freaking loved it because i love dark souls and everything in between.BUT the author basically ditched him in the process of this book. And that was a very very  bad decision.Oh and there's another important dude, he's called Locke i just didn't want to talk about him because i wanted to finish this review with Cassius. ~~~~Um, why did this take me forever to finish? Because some stupid thing called  life  always get in my way and because  This dudette  is a slow busy reader. THANKS ZARA FOR THE BR!"}], "description": "Challenge a tempest. Survive it. And you become its master.Legend says that AuroraPavan's ancestors first gained their magic by facing a storm and stealing part of its essence. Aurora has been groomed to be the perfect queen...but she's yet to show any trace of the magic she'll need to protect her people.To keep her secret and save her crown, she'll have to marry a dark and brooding Stormling prince from another kingdom: He'll guarantee her spot as the next queen and be the champion her people need to remain safe.But the more Aurora uncovers about him, the more a future with him frightens her.When a handsome young storm hunter reveals he was born without magic, but possesses it now, Aurora realizes there's a third option for her future besides ruin or marriage...She might not have magic now, but she can steal it if she's brave enough.\"A rich and unforgettable fantasy forged from the power of storms, the danger of secrets, and the magicof Cora Carmack's imagination.\"--Kami Garcia, #1 New York Times bestselling author\"Well worth the wait...It crushed all of my expectations with gusto, and surprised me more than once.\"--Hypable", "title": "Roar\n      \n          (Stormheart #1)", "url": "http://www.goodreads.com/book/show/36978865-roar", "average": 3.98, "cover": "https://images.gr-assets.com/books/1521037595l/36978865.jpg", "reviews": 1634, "authors": [{"url": "https://www.goodreads.com/author/show/6535659.Cora_Carmack", "name": "Cora Carmack"}], "type": ["Fantasy", "Young Adult", "Romance", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/36978865-roar", "http://www.goodreads.com/book/show/29939048-roar", "http://www.goodreads.com/book/show/32828372-roar", "http://www.goodreads.com/book/show/16034964-losing-it", "http://www.goodreads.com/book/show/16172634-faking-it", "http://www.goodreads.com/book/show/16172638-finding-it", "http://www.goodreads.com/book/show/18505845-all-lined-up", "http://www.goodreads.com/book/show/17824638-keeping-her"]}