{"ratings": 15494, "userreviews": [{"userName": "♥ Sandi ❣\t", "userReviewDate": "Jul 27, 2017", "userURL": "http://www.goodreads.com/user/show/4984609-sandi", "userReview": "This series is read by the author and her emphasis is obviously made in the places that she deemed important. She has mastered the \"down-home\" dialog that is needed for this series. This is #2 in the series and takes place 8 years after the first book (or audio) ended. You don't expect someone from the back hills of Virginia - where Big Stone Gap is supposedly located - to be a descendant of an Italian family. However Ava Maria has her extended family living in Italy. This book of the series takes Ava Maria and her daughter Etta across the pond for a month to visit. Her husband Jack was supposed to go also, but family discord kept him for going. After eight years of marriage, the birth of their daughter, the death of their son Joe, and the loss of Jacks mining job, Jack does not believe that Ava Maria is still in love with him. Ava meets Pete in Italy. Is she still in love with Jack? How important is her marriage? Does she want to save it? Other than loving the authors voice as she narrates this book, I believe that I enjoyed book #1 in the series a bit better than book #2. On to book (audio) #3 in the series to see where this will be going."}, {"userName": "Laura", "userReviewDate": "Sep 07, 2010", "userURL": "http://www.goodreads.com/user/show/1845711-laura", "userReview": "For all the enjoyment I got out of the first book in the series, I was looking forward to this second installment. Wow, talk about taking the series in a very different direction. I would describe the first book as \"light, quirky, fun, silly, and relate-able in a goofy way.\" I would describe this book as \"sad, depressing, and filled with heartache.\"My main problem with this book is the base assumption of the author. Namely:1) All unhappy men will cheat if given the chance2) All marital problems are because the wife isn't doing right by her man. It is her duty to keep her husband happy. If he isn't happy, she is failing him and the marriage.3) With 1 & 2 being true, when a man cheats, it is his wifes fault. If she was a better wife, he wouldn't have done it.Several characters in the story are involved in a cheating plot line and all of them have the same moral (see 1, 2 and 3 above). The first half of the book describes the slow process of a marriage decading. It was totally depressing and tedious. The second half picks up a bit, mostly because the two main characters (Jack and Ave) are apart so the reader can't be slowly killed by hearing how things are not working for them. There is a happy ending for them (which is why it got a 2 stars instead of a 1 star), but the ending was only happy because Ave pretty much realized that ALL their problems were completely her fault and she would be better. Some women may feel empowered by the story because of the concept that marital happiness is completely controlled by the wife alone, but I was pretty offended by that. I am pretty sure my husband can make his own choices beyond simply reacting to mine. Overall a total disappointment. Finished the book mostly out of respect for the first. I checked out book 3 in the series at the same time as book 2, but I am not sure if I will give it a chance. The reviews on Goodreads seem to indicate that book 3 is back to how book 1 was, so that gives me hope."}, {"userName": "Michelle", "userReviewDate": "Jan 13, 2009", "userURL": "http://www.goodreads.com/user/show/1824225-michelle", "userReview": "This book is sexist. They have troubles in their marriage, the woman blames everything on herself and tries everything she can to fix it, even when it appears her husband might be looking at other women. And yet, he still says everything she is doing isn't enough and she needs to do better. And her job advancement makes him mad, but he can start a company and it is fine and dandy. Worst of all, the author buys into all this crap instead of using the story to vindicate all the women who are carrying the full weight of making a marriage work, making a home, a career, and being a perfect wife, mother, friend, and community member. This book pissed me off- it was like you fall in love, you get married, then you become a slave to your husband and children, never have time to think about yourself again, and nothing you do is good enough. Also, the writer doesn't even do a good job of showing the main character doing all the things that she is later accused of doing."}, {"userName": "Marisa", "userReviewDate": "Apr 11, 2010", "userURL": "http://www.goodreads.com/user/show/986041-marisa", "userReview": "The pros of this book:I love her storytelling ability and I also couldn't put this book down. I wish that I could live in Italy and loved the descriptions of this area. I love the sense of community in Big Gap and love all the quirky characters.The cons:I really had a hard time with how Ave was the only one who seemed to take any responsibility for the issues in their marriage. I hated that she knew her husband was straying and chose to stay quiet about it. I hated that she thought that even his affair was her fault and never even made him explain himself once she gets back from Italy and even still thinks it was all her fault and that she can fix everything for a marriage where it takes two people. I really had a hard time with the second half of the book for this reason. She just bugged me and so did Jack Mac at this point. I would've liked to see them work through their issues together instead of her taking all the fault and blame."}, {"userName": "Raya", "userReviewDate": "Nov 30, 2009", "userURL": "http://www.goodreads.com/user/show/1812864-raya", "userReview": "Sequel to Big Stone Gap, the second in this series focuses more on the relationship between Jack and Ave Maria eight years into their marriage. There was a slight departure from the light-heartedness of the first novel, the fluffiness replaced with a seriousness that made this novel more affecting. The writing is much improved and the characters still quirky and charming. It was painful and slightly distressing at times, but there was something beautiful and tender in Ave’s grief, which is why I thought this was a better novel than the first. With that said, I had a few issues.I was turned off by Ave Maria’s self-flagellating. Sure, this is told from her perspective, and I understand that her character makes it only natural that she blame herself for the state of her marriage. Her voice would lose some of its authenticity without it. What kills me is that this idea seems to be validated over and over. Ave can’t get over her son’s death. Ave is too independent. Ave is cold and detached. And the list goes on…and on and on. Is she completely blameless? Absolutely not, but it seems as though Jack’s misgivings and his part in the slow demise of their marriage is attributed to Ave, and that is what I have a huge problem with. Still, it was a great novel and I look forwarding to reading the next in this series."}, {"userName": "Joanne", "userReviewDate": "Jul 05, 2011", "userURL": "http://www.goodreads.com/user/show/1430050-joanne", "userReview": "A deeper book than its predecessor in some ways. Ave Maria and Jack have been married for eight years and have lost a child, and it's taken a toll on their marriage. What got me were several moments where Ave Maria comes to some painful realizations about herself and Jack. Trigiani can have you laughing out loud one moment and reaching for the tissues the next. Wonderful."}, {"userName": "Donna", "userReviewDate": "Mar 01, 2018", "userURL": "http://www.goodreads.com/user/show/13244359-donna", "userReview": "I loved this one. I could relate to the MC in more ways than I'd like to admit. I think the author spoke my language through the MC. I also enjoyed the humor; it had such charm. BUT....the one thing I loved the most was her descriptive strokes. She has a way with words that elevated characters, setting, and relationships. I loved that and really, sometimes that is all it takes to get 5 stars from my stingy fingers. This book is chick lit and the second installment to a series. I haven't read the first book in this series, but I have read the third one and gave that one 4 stars. The author narrating her own book bugged with the that one, but it didn't even cross my mind once with this one. I think I was just in the mood for this today. So, 5 stars."}, {"userName": "Cheryl, The Book Contessa", "userReviewDate": "Mar 25, 2013", "userURL": "http://www.goodreads.com/user/show/7321960-cheryl-the-book-contessa", "userReview": "What a great follow up to Big Stone Gap. These are my favorite kind of books, where I am drawn right in to the characters lives--joys and struggles, mundane and exciting. I have new friends and neighbors and coworkers in this story. I have watched Pearl grow up. I wish Ava would confide in me. Theodore is one of my best friends too! I love Etta's entrance into tween years. There are characters I want to toss off a cliff; the author wrote the frustrating & \"love to hate\" characters so well. Beautiful novel all the way around. Milk Glass Moon here I come!"}, {"userName": "Florence (Lefty) MacIntosh", "userReviewDate": "Jul 17, 2012", "userURL": "http://www.goodreads.com/user/show/10856439-florence-lefty-macintosh", "userReview": "The 1st half is a little tedious & depressing but it pulls up its socks, so persist. Not as light & funny as the 1st novel, Trigiani’s writing style has matured and so have the characters in Big Stone Gap, be prepared for a lot of soul searching. The main character Ave Maria is someone I'd like to meet in real life and have a heart to heart with! All marital problems are not the wife’s fault alone; Ave Maria’s character clearly champions this mindset. There is no getting around it, this book is sexist. Still a good read though."}, {"userName": "Mahoghani 23", "userReviewDate": "May 20, 2017", "userURL": "http://www.goodreads.com/user/show/22091363-mahoghani-23", "userReview": "Everyday life interrupts marriage and eventually the couple becomes redundant and in a cycle. Take Ava Marie & Jack McChesney; After 8 years of marriage, there's a strain between them that causes them to sway in different directions. Ava Marie is worried about another woman attempting to take Jack from her but soon realizes that there are things about herself that has placed a rift in her marriage with the biggest issue of not allowing Jack to be the head of household and understanding that he's a man and not super man. It's funny, inspiring and reveals life without seeming unrealistic and full of boring extra wording. The author invites you into the lives of the close knit community and how they look out for one another. Sometimes they're nosy and a little overbearing but since I didn't grow up there, it bothers me more than them so their interaction is normal to them."}, {"userName": "Nikki", "userReviewDate": "Dec 23, 2014", "userURL": "http://www.goodreads.com/user/show/6688690-nikki", "userReview": "I didn't love this sequel as much as I loved Big Stone Gap and as much as I usually love Ms Trigiani's storytelling. Slight spoiler alert... The problem for me was I wanted to jump into the book and throttle Ave for tiptoeing around Jack's \"ego\". Why do women feel they have to do that?? Anyone with common sense would see she made the right decision to help support the family in a time of need. They have a child that has to come before his \"ego\". She should have told him right away, but she shouldn't need his permission. Then her best friend Theodore, who is now out of the closet, take's her husbands side and gives her a lecture. ( Is everybody blind in this book?) Next thing, Jack is carrying on with another woman, or at least putting himself in a pretty good position for a another women to stroke his \"ego\". The book ends in a nice neat bow, but I can't buy it. I know there are more books in the series, I will have to debate them. Better books to read by Ms. Trigiani are Very Valentine, Brava Valentine and Lucia Lucia."}, {"userName": "Denise", "userReviewDate": "Jan 10, 2009", "userURL": "http://www.goodreads.com/user/show/1355365-denise", "userReview": "Although I loved Big Stone Gap, I didn't enjoy this one quite as much....although it was still very good. It still has the same witticisms and characterizations you expect from this writer (personally, I think Fleeta is a scene-stealer, as is Iva Lou!) but as some other reviewers have stated, I didn't quite care for the way Ave Maria handled her marital tension. Everything worked out to my satisfaction at the end, but some of her choices in this book were, to my monogamous mind, a bit questionable!"}, {"userName": "Christine", "userReviewDate": "May 09, 2013", "userURL": "http://www.goodreads.com/user/show/11411129-christine", "userReview": "My favorite thing about this book is that it takes a real look at feelings within the marriage. Nothing is sugar coated or not dealt with. The main character is far from perfect, and the author deals with that but not by making light of the situations. There are places where I think a lot of other authors would make the story about revenge. Adriana does not. Looking forward to book three in the series!"}, {"userName": "Liz", "userReviewDate": "Apr 09, 2013", "userURL": "http://www.goodreads.com/user/show/8315614-liz", "userReview": "Like the first one of the series, I found myself drawn into the story and the small town lives of the characters, but I still don't like Ave Maria very much! All of her internal issues and insecurities end up feeling selfish and somewhat contrived to me. Her poor husband! I also wasn't crazy about the resolution of their marriage problems so quickly at the end of the book... and is everything solved by a trip to Italy? I'll have to read the third book and find out I guess!"}, {"userName": "Karen Witter", "userReviewDate": "Jan 30, 2015", "userURL": "http://www.goodreads.com/user/show/4849313-karen-witter", "userReview": "I liked this book better than Big Stone Gap, maybe because it spoke more to where I am in my own life. The continuing saga of Ave Maria pulled me in completely.One really refreshing thing this story avoided was pat answers and oversimplification of the complications if life, love, and relationships."}, {"userName": "Jennifer", "userReviewDate": "Jan 20, 2015", "userURL": "http://www.goodreads.com/user/show/7531701-jennifer", "userReview": "Perfect beach reading. In this follow-up to the first one, the heroine, Ave, has a midlife crisis and questions her relationships with her husband. There were plenty of things I could relate to and the characters were alive enough. It was a nice, light, read."}, {"userName": "Bryn Clegg", "userReviewDate": "Jan 22, 2017", "userURL": "http://www.goodreads.com/user/show/4845801-bryn-clegg", "userReview": "DNF. I hate when we get a couple together in the first book, and they are struggling and bratty to each other in the next one. I got sick of the main character and her negativity, and I don't like cheating husbands."}, {"userName": "Chastain", "userReviewDate": "Mar 13, 2018", "userURL": "http://www.goodreads.com/user/show/6259584-chastain", "userReview": "Not as good as Big Stone Gap, but I love author’s descriptions of Wise County, Virginia, where my Mom grew up, the small town, and the characters of coal mining. Brings back memories of visiting the area, and my Mom’s stories. Coming from that environment truly gave her an insight into all of mankind!Oddly enough this story features a drug store...just like the one my Great Aunt Chastain and Uncle Guy owned."}, {"userName": "Yvonne", "userReviewDate": "May 29, 2018", "userURL": "http://www.goodreads.com/user/show/11842663-yvonne", "userReview": "The series gets even better!"}, {"userName": "Sue", "userReviewDate": "Oct 10, 2015", "userURL": "http://www.goodreads.com/user/show/937119-sue", "userReview": "I'm not sure what to say about this novel. I really wanted to love it because I liked Jack Mac and Ave Maria and their crazy coterie in the first book, but they were not as appealing in this one. The whole marriage problem seemed confused. Is it Ave's fault for not bending over backward for her husband? Is it Jack Mac's fault for loving her but not getting her? What? They both have attractions/affairs? with other people that seemed unbelievable in context of the characters. I felt like the book was completely sexist in its approach to the marital problems. While I do feel that marriage partners should think of each other first and both give 100% to the marriage, Ave's approach was to give Jack Mac what he wants as part of a scheme to keep him rather than really loving him and finding out what he needs. It just didn't ring very true, and then it all got resolved super quickly and the story went on. For so much angst throughout the book, it seemed like the resolution should have been a bit more profound. So I didn't love it, but am willing to stick with the characters and see if they improve. (also: language warning)"}, {"userName": "LindyLouMac", "userReviewDate": "Apr 26, 2009", "userURL": "http://www.goodreads.com/user/show/117720-lindyloumac", "userReview": "http://www.bookcrossing.com/journal/7...As a sequel to Big Stone Gap a gentle continuation of the ups and downs of the love between Ave Maria Mulligan and the man she has now been married to for eight years, Jack MacChesney. Ave has still not completely opened her heart to her husband but she needs to now or she is in danger of losing the best thing that ever happened to her. They have not been easy years for them or the local community. The death of their son seems to have come between them, instead of drawing them closer too each other. Ave Maria only realises her lack of full commitment to the marriage after a trip she and her daughter take to Italy. She returns to Big Stone Gap determined to put things right between her and her husband and learn to be more open and honest with him.Once again I found this rather slow but marginally more enjoyable as it was only in April that I read Big Stone Gap, so the cast of characters were still familiar to me.I will go on to read the final volume of the trilogy Milk Glass Moon soon while the story is still with me."}, {"userName": "Vickie", "userReviewDate": "Mar 25, 2014", "userURL": "http://www.goodreads.com/user/show/11300847-vickie", "userReview": "Big Cherry Holler by Adriana Trigiani is the second book in the Big Stone Gap series. The first half of the book was tedious to read but the second half picked up the pace. I was looking forward to reading this one because I really enjoyed the story and the characters in the first book. However, this one fell quite a big short for me. I lost some respect for Ave Maria and how she was handling the crisis in her marriage. Yes, the death of a child takes its toll, but a team (husband/wife) have to both share in the grief and recovery. Also, is there is marital strife, both are responsible and need to address the issues together. I didn't like the fact that the author had Ave Maria take all the responsibility. I am going to continue the series; I just hope that the next book takes on the quirkiness of the characters from the first book.Go Cards! L1C4!!"}, {"userName": "Mallory", "userReviewDate": "Sep 22, 2016", "userURL": "http://www.goodreads.com/user/show/1220784-mallory", "userReview": "Did not finish.It's a shame that this book was so misguided and sexist. I really enjoyed the first book, the characters and town are memorable, and you care so much about them. Then this book happened.NO ONE DESERVES TO BE CHEATED ON. Yet, that's the message of this book. Ave Maria didn't pay enough attention to her husband, because she was too busy raising their daughter, mourning the loss of their son, cleaning, cooking, and working. So, she obviously deserves to be stepped out on. It also really bothered me that it was all Ave Maria's job. Everything. And yet Jack Mac was irritated when she took the manager position at the Pharmacy without telling him. Like, no. You go girl. You've worked hard. You don't need your husband's permission to accept a promotion that isn't going to uproot the family and is going to provide extra income while he's trying to find another job because the mines closed."}, {"userName": "Nancy ", "userReviewDate": "Jan 13, 2018", "userURL": "http://www.goodreads.com/user/show/1546515-nancy", "userReview": "What I really liked about reading this book is that it was completely different from the first one; I normally don't read book series because the second installment usually just feels like a long, middle chapter to me. In Big Cherry Holler, the whole tone was different from Big Stone Gap, which made it interesting. ***SLIGHT SPOILER HERE***I understand how some reviewers felt this book had a \"blame the woman\" mentality, but my answer to that is that the book was published in 2001, 17 years ago. A lot has changed since then, and I feel that needs to be taken into consideration.Side note: I'm definitely going to try making \"Cousin Dee's Peanut-Butter Balls.\""}, {"userName": "Amy", "userReviewDate": "Sep 08, 2010", "userURL": "http://www.goodreads.com/user/show/1710557-amy", "userReview": "I enjoy Trigiani's books because she is a storyteller. She takes the everyday and weaves it into a tale. Her characters are real, every last one of them could be your next-door neighbor or behind you in the checkout line at the grocery store. Oh sure, their accent might be different or the color of their skin or sophistication with worldly matters might not be the same, but the basic charater is real enought to be sitting beside you at the movie theater. Ave Maria is not a perfect woman, nor does she live a life of glamor or adventure, but she is true to life. And her journey, in this second book of the Big Stone Gap series, is not about her trip to Italy, as it is about her trip into her own heart to find what is her true self."}, {"userName": "Lynn Summers", "userReviewDate": "Oct 11, 2012", "userURL": "http://www.goodreads.com/user/show/13419578-lynn-summers", "userReview": "I really enjoyed the first book in the series and expected this book to be the same. Unfortunately, the book is much deeper and deals with some heavy issues. That would have been ok except everything that becomes a challenge in Ave's marriage is blamed on her. By the end of the book I was undecided if I even wanted her to try and work things out with Jack. In my opinion, their relationship seemed very one-sided and sexist. This book did generate a lot of deep thoughts and is interesting to discuss, just not the light-hearted book I expected."}, {"userName": "Krista", "userReviewDate": "Dec 18, 2010", "userURL": "http://www.goodreads.com/user/show/1004089-krista", "userReview": "Book two in the series and eight years into her marriage, we take another look at Ave Maria's life in Big Stone Gap, a coal mining town in the mountains of Virginia. I really enjoy Trigiani's easily readable writing style and insight into life. I found myself saying \"wow, I can relate to that\" as Ave Maria discovers the issues that brought her to a critical junction in her marriage. Love the family, sights, sounds, etc. in Italy. All the characters in Big Stone Gap are endearing and easy to picture.Enjoyed this book."}, {"userName": "Jen", "userReviewDate": "Mar 28, 2015", "userURL": "http://www.goodreads.com/user/show/10062085-jen", "userReview": "I enjoyed the second book in this Big Stone Gap series, but I could help but feeling a little like I had lost touch with the characters (although I started the second book within a week of finishing the first). I still very much enjoyed Triginai's writing style - I just felt there wasn't enough happiness/hope/joy to counter the fairly depressing state that is seeded in most of the book (or at least from what I have come to expect in these can-be-tear-jerking-stories. That's not to say that I've been put off - I'll start Milk Glass Moon soon!"}, {"userName": "Estelle", "userReviewDate": "Dec 06, 2015", "userURL": "http://www.goodreads.com/user/show/6713429-estelle", "userReview": "An interesting plot that juxtaposes scenes in rural Virginia with those in Italy - an unlikely pairing that appears, however, to mimic the author's background. Through Ave Maria's introspection and interaction with a colorful cast of characters we follow her anguish. She calls herself a spinster because she didn't marry until she was 37. Jack Mac is from her rural hometown but very different from her. While they have a relatively comfortable life, they have some losses about which they haven't communicated. The book is about their struggle and is a somewhat predictable tear-jerker."}, {"userName": "Margi", "userReviewDate": "Jul 06, 2012", "userURL": "http://www.goodreads.com/user/show/4972392-margi", "userReview": "I really enjoyed the sequel to Big Stone Gap. I must admit it was years between reading the two, but this book kept me engaged the whole way through.I am going to read her next one in the series sooner than later as I like Adriana's writing style and story telling and I can't wait to read more about Ava's life in Big Stone Gap."}], "description": "It has been eight years since pharmacist and longtime spinster Ave Maria Mulligan married. What she hasn't counted on is that fate and the ghosts of the past will come to haunt her, and test the love she has for her husband.", "title": "Big Cherry Holler\n      \n          (Big Stone Gap #2)", "url": "http://www.goodreads.com/book/show/52471.Big_Cherry_Holler", "average": 3.92, "cover": "https://images.gr-assets.com/books/1347322179l/52471.jpg", "reviews": 745, "authors": [{"url": "https://www.goodreads.com/author/show/9219.Adriana_Trigiani", "name": "Adriana Trigiani"}], "type": ["Fiction", "Womens Fiction", "Romance", "Adult"], "outlinks": ["http://www.goodreads.com/book/show/13127599-the-shoemaker-s-wife", "http://www.goodreads.com/book/show/58822.Big_Stone_Gap", "http://www.goodreads.com/book/show/60057.Lucia_Lucia", "http://www.goodreads.com/book/show/3673357-very-valentine", "http://www.goodreads.com/book/show/6673171-brava-valentine", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/28353727-in-twenty-years", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/20552595-how-i-became-a-famous-novelist", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats"]}