{"ratings": 2132, "userreviews": [{"userName": "Nita Kohli", "userReviewDate": "Nov 15, 2015", "userURL": "http://www.goodreads.com/user/show/808367-nita-kohli", "userReview": "Book CoverThe cover is so very pretty - in fact it was the cover that made me pick up this book in the library. I love all the colors and the different stuff on the cover. As this book is about scrap booking the cover is made in a form of a beautiful scrapbook page.So, altogether a great put together cover! After reading the blurb I decided to take it as it fit perfectly with my current reading mood.PlotThe book is set in a town, Avalon in Illinois. It is a small town where people know each other and care for each other. It is like a big close knit family. At the heart of the town Madeline runs her Tea Salon with Connie. The people in town though appear alright from the outside but in reality they have their own struggles. Connie has a past she wants to forget; Isabel is still coming in terms with her husband's death and his affair; Ava is a single mother who is struggling to get a new job in order to have a better life for her and her son but her past keeps bringing up the obstacles; Yvonne Tate is a beautiful girl coming from money but she has nothing to do with her family and their wealth and makes her living by running a small plumbing business; Frances Latham is waiting for the arrival of the little girl from China who she is adopting but she soon discovers a problem big enough to forget all about the adoption.And then there is Bettie Shelton - founder of the Avalon Ladies Scrap booking Society. Bettie helps the people come to terms with their past through her scrap booking club by helping them create memories - even if the people are reluctant to do so because Bettie is one adamant person! She will put people in situations that they have to say yes. But, soon the club members discover the unexpected and sorrowful truth about their leader and they come together put something truly memorable for Bettie.CharactersThe book has a lot many characters and readers get to read each one's point of view. I was a little intimidated in the beginning of the book by so many characters, their lives and their POVs. I felt I will be left confused. But, as the book progressed I got to know all the characters well and I was a part of their lives.I fell in love with all the characters but my favorite will be Bettie and Isabel.  Bettie is like the head of family who is keeps the family together; here the family happens to be an entire town of Avalon. The scrapbook club she hosts brings together people from Avalon that helps in building a friendship and a bond among each of them. Isabel is trying to get on with her life after her husband's death. It is difficult for her to come up with a happy memory of her husband as thinking about him reminds of her the sad truth that he left her for another woman. And the fact that the other woman has a child from him which Isabel was never to give her husband only makes things worse. But her character grows and she comes out of her nutshell. She grows to become a strong confident woman who goes out of her way to help people. What I likeI loved the town of Avalon and its people! I loved it so much that I want to shift there and be friends with all the characters that I read about! It is a wonderful knit story about so many characters that does not leave you confused but instead in love with all these characters. Their point of views only bring you close to them and you see yourself vouching for them in their bad times.The writing is simple yet beautiful and the author has done a great job in creating some amazing characters who you feel attached to. Friendships and families form an integral part of this story which add warmth and affection to it.What I did not likeNo complaints.My final thoughts on the bookI loved this book and thoroughly enjoyed it. This was my first book from the author but now I plan to read more from her. This book engages its readers from the beginning of the book. Once you open the book you will be engrossed in the lives of the people living in Avalon and you will not be able to put it down. If you are looking for a book which narrates a story of devoted friendships, highs and lows of families and unconditional love then this book is for you. I can't recommend this book enough!"}, {"userName": "Etcetorize", "userReviewDate": "May 11, 2013", "userURL": "http://www.goodreads.com/user/show/8407590-etcetorize", "userReview": "As an avid crafter myself this book's title and cover appealed to me. I enjoyed the little touches like detailed descriptions of various scrapbooking and jewellery making techniques. It was fun to see a bit of my 'nerdy' and sometimes solitary hobby play out in a novel.I also enjoy stories set in small towns like the one in this novel. It always seems so quaint and connected, unlike the usual hustle and bustle of today's world.I thought the characters were a lot of fun and from what I understand, many play a continuing role from the author's first book. The one criticism I have is that there may have been just a few too many characters. I understand that they're all there to show the many faces of a community and how we're all interconnected, but truthfully, I sometimes had trouble remembering which storyline belonged to which character. I just kept reading hoping that I would figure it out along the way, and most of the time I did, it was just a bit confusing from time to time.Overall, I enjoyed the book. I was a nice reprieve from the world of historical fiction that I usually immerse myself in."}, {"userName": "Emma Sea", "userReviewDate": "Jul 09, 2014", "userURL": "http://www.goodreads.com/user/show/5558652-emma-sea", "userReview": "I do like to branch out of my comfort zone from time to time, but this was waaaay out there, and I couldn't do it. Chapter two defeated me. Dnf at page 32.And is it just me, or is that cover fucking screaming for an apostrophe? It's the scrapbooking club belonging to the ladies, right?"}, {"userName": "Kay", "userReviewDate": "Mar 28, 2013", "userURL": "http://www.goodreads.com/user/show/2897877-kay", "userReview": "It was nice revisiting Avalon, IL and the residents. While some were familiar from the first book, \"Friendship Bread\" it was nice getting to know the newer characters of the town. I would love to live in a town like this again as it reminds me of what my hometown originally was when I was growing up.I like crafting although I am not a scrapbooker but luckily you don't have to be to enjoy the book. While it does include scrapping and cropping the main premise is about the town and how they rally around each other when someone is in trouble and how people can overcome differences to become better, forgiving human beings.This is a nice, feel good book. It has the usual life dramas of family betrayals, bullying, cheating, etc. but you get some happy endings even though some not as realistic as others. That being said, sometimes people like to believe life could be magical and full of happy endings instead of sadness so if you can't have it in real life why not read it and keep hope alive."}, {"userName": "Kathryn", "userReviewDate": "Nov 01, 2012", "userURL": "http://www.goodreads.com/user/show/2600090-kathryn", "userReview": "I'm so not into this book. Sometimes it seems like the timing when I read a book just doesn't resonate with me and then I can try it another time and it will. I just cannot get connected with any of the characters and believe me there a lot of them to keep track of. So I am moving on...."}, {"userName": "Lyn (Readinghearts)", "userReviewDate": "Dec 07, 2012", "userURL": "http://www.goodreads.com/user/show/2124637-lyn-readinghearts", "userReview": "After reading The Avalon Ladies Scrapbooking Society by Darien Gee, I want to move to Avalon, Illinois. Who wouldn't want to live in a small town where everyone knows each other and even the meanest and grumpiest of the inhabitants are really good at heart? The author deftly uses the Scrapbooking Society as a metaphor for the theme of community and support throughout the book. Just like their individual stories, each of their scrapbooks were different and unique, but like the community, they were also full of examples of sharing and collaboration. In other words, like the lives of the characters they were both separate and yet intertwined. The support that they gave to each other in their everyday lives was a great example of all that is good and right in towns and communities all over the world. This spirit was never more in evidence than when trouble befell one of the inhabitants and the town pulled together. I was a bit confused, at first, by the author's lack of introduction to the characters and thought that the beginning of the book was the weakest part. It seemed that she just jumped into talking about them without really giving the background of who they were or why they were paired together, as in the case of Madeleine and Connie. It was almost like we should already know that information. I realized part way through that, in fact, not only was it her second book, but many of the characters had also appeared in her first book. I still haven't read Friendship Bread, but I think that if I had I would have already been familiar with the characters and therefore the beginning would have flowed better for me. I will give her credit, though, as she filled in the missing pieces, or enough of them, as the book progressed, to make this book work well as a stand alone. By the end of the book, the only reason that I wanted to read Friendship Bread was because I was in love with Avalon and it's inhabitants, not because I felt the need for any extra explanation on the characters in the Scrapbooking Society. What more could a reader ask for? In the end, what really sold me on this book was the strong characters that Ms. Gee filled the book with. And let me tell you, there are quite a few. Instead of being confusing, though, having such a large cast of characters and viewpoints in the story was what made it work for me. I found myself rooting for Frances and her family, wondering if Yvonne was going to succeed, how was Connie going to resolve her relationship with Serena, how would that affect her relationship with Madeleine, how Ava was going to make a place for her and Max, and how Isabel was going to solve her dilemmas. And through it all there is Bette, the president of the Scrapbooking Society and the tie that binds them all together. As I followed them all past their struggles, through their decisions, and to the conclusion of their stories I just felt good. So - I am picking up a copy of Friendship Bread at the library this week and anxiously awaiting Ms. Gee's next installment in the life and times of Avalon, Ill. I hope she is already working on one!"}, {"userName": "Dale Harcombe", "userReviewDate": "Aug 21, 2013", "userURL": "http://www.goodreads.com/user/show/4800708-dale-harcombe", "userReview": "Three and a half stars. Having read and enjoyed Friendship Bread I was eager to read another by Darien Gee. The Avalon Ladies Scrapbooking society brings together Madeline, Hannah and Connie from the previous book along with a whole range of new characters. That for me was part of the problem. There seemed to be a large cast to keep track of and at times I found myself having to stop and re-orientate myself about who was who and where they fitted into the story. For all that, it is an enjoyable feel good story. Some characters like Bettie, who is the founder and president of the scrapbooking society, work better on the page that they would I suspect if you actually met them or lived in close proximity to them. Bettie is the busy body neighbour who at times rides roughshod over the feelings and rights of others. But when the chips are down, Isabel Kidd and others in the town rally to her aid, because despite her obvious faults she has helped others in the past.Yvonne, the plumber, is running from her past, while Ava and her son Max present the widowed Isabel with a reality and a few she problems she’d rather not have to deal with. This is a book about relationships and they are not always ones you would expect. For the romantics there is a little bit of romance included in the story. I’m not a scrapbooker, not into crafts at all, but I still found it interesting to dip into the processes of this craft. There are also a few recipes from Madeline’s tea shop included. It’s a gentle book. I didn’t quite relate to it as well as Friendship Bread, partly because of the large cast of character. But it is a light, feel good story."}, {"userName": "Obsidian", "userReviewDate": "Jan 06, 2016", "userURL": "http://www.goodreads.com/user/show/35942740-obsidian", "userReview": "First off I loved Darien's Gee's first novel Friendship Bread: A Novel. This newest offering from her is a sort of sequel to Friendship Bread. Gee revisits some of the former characters from Friendship Bread but not all which is one of the two complaints I had about this novel. We do catch up with Madeline and Hannah. I wish we could have re-visited Julia and her family in this novel and so it felt a little false to me that she didn't pop up again.This novel can be read as a stand alone novel but I still think it would be a good idea for the reader to read Friendship Bread first though since Gee does bring up events from the previous novel and you may be a little bit lost in places without the introduction.This novel centers around four women living in Avalon, Illinois. The first is Isabel Kidd dealing with the anger she still feels towards her late husband. The second woman is Ava Catalina who is in mourning for the man and life she lost when he unexpectedly died leaving her with a young son to raise. The third women is Yvonne Tate a sexy plumber trying to build up her business in Avalon and also trying to find the one. Last we have Frances Latham, who is in the process of trying to adopt a girl from China.All of the women end up meeting and getting embroiled with the Scrapbooking Society due to Bettie Shelton the head of the Scrapbooking Society going far and wide to recruit women and men to join in with her love of scrapbooking. Though it is called \"The Avalon Ladies Scrapbooking Society\" the Avalon Ladies are not exactly front and center here. Though scrapbooking is a theme that Gee tries to tie the novel into you don't really see the payoff to that particular group until the very end.My second complaint was due to the vignettes that Gee has inserted in certain places in the novel. These broke up the flow of the novel and though were interesting I couldn't always find the thread that connected them to the other people in the story. I actually started writing down names to see if they appeared elsewhere in the novel later and was 100 percent frustrated with the introduction to so many people.I would still recommend this novel to anyone out there looking for something to read that reminiscent of Maeve Binchy's later novels.Please note I received this novel for free via the Amazon Vine Program."}, {"userName": "Ruth", "userReviewDate": "Feb 03, 2013", "userURL": "http://www.goodreads.com/user/show/1436259-ruth", "userReview": "Well, it was a digital galley; I didn't have to finish it, but I did, so it couldn't have been too bad. On the other hand it wasn't all that great either. Basically I found it very busy. There were a bunch of \"main\" characters, each of whom had a supporting cast, and while some of the casts overlapped, many didn't. By the Thanksgiving dinner at the end where they all came together, I didn't really feel I knew the characters much better than I did when they were first introduced. At first I wondered if this was going to be like Debbie Macomber's yarn shop books, but all these stories seemed to have endings, which isn't say the endings were so final other books wouldn't be possible, but I don't get the impression there is more to come, and even if there is, I won't be reading them. Sorry, this one only gets a C+."}, {"userName": "Anne  (Booklady) Molinarolo", "userReviewDate": "May 15, 2014", "userURL": "http://www.goodreads.com/user/show/3615945-anne-booklady-molinarolo", "userReview": "Welcome to Avalon, Illinois, Pop. 4,243Or I should say, welcome back to the small Northern Illinois town. I was half way into the first chapter, a bit confused with the many characters that were introduced, when I realized The Avalon Ladies Scrapbooking Society was Darien Gee's second Avalon book. Friendship Bread is the first. But I needn't have worried because Ms. Gee gave me the basics of the characters that were featured in Friendship Bread to smoothly follow The Avalon Ladies Scrapbooking Society story lines. Madeline's Tea Salon is the central hub of the town as well as the frequent meeting place for the Scrapbooking ladies. 77 year old Bettie Shelton is the founder and president of the society. She is a force of Nature - overbearing, gossipy, and the glue that holds Avalon together. She has a way to make each person she meets to delve into their past and finally look to the future. Each Scrapbook is full of memories, and those memories will show what future decisions need to be. And Bettie will need her Ladies to help her when tragedy befalls her.Bettie's neighbor, Isobel Kidd, finds the old lady obnoxious and bothersome - always sticking her nose where it doesn't belong. She is finally getting her house fixed up so she can sell it. She is finished mourning her husband's death and affair and she's determined to shed her vanilla persona. Yeah Isobel, good luck with that because the \"other woman\", Ava Catalina and Bill's son will throw a monkey wrench into that. Yvonne Tate is a plumber. Yes, a female plumber with drop dead gorgeous looks who is fiercely independent and running from a past that still haunts her. Her clientele is also mysteriously shrinking. She also happens to be friends with both Isobel and Ava.Connie Colls is the Tea Salon's manager and becomes overly attached to a goat that she found near the Farmer's Market. Trouble also finds her. And Frances Latham is anxiously waiting to see if their adoption of a Chinese toddler will go through. She needs a soft little girl to diffuse all of the testosterone in the Latham home. She finds Solace from the anxiety in the Memory books she's creating for Mei Ling. But devastating news could derail the whole adoption and the whole Latham clan.I truly loved this novel and grew to love all of the characters. If Avalon were real, I'd hop into my car and start driving. Of course after getting one of Bettie's starter scrapbooking kits. I enjoyed the different POV's from the women as well as the chapter vignettes about the people that were touched and helped by Betttie and The Avalon Ladies Scrapbooking Society. Be prepared to chuckle, laugh out loud, and shed a few tears in this story of friendship and holding what's dear - all of the important memories."}, {"userName": "LORI CASWELL", "userReviewDate": "Jan 26, 2013", "userURL": "http://www.goodreads.com/user/show/4770012-lori-caswell", "userReview": "Darien Gee, the author of Friendship Bread takes us back to Avalon, Illinois, population 4243.Madeline’s Tea Salon is the place residents meet and catch up and even occasionally get together as a group like the members of The Avalon Ladies Scrapbooking Society founded by Bettie Shelton. Under Bettie’s guidance, even the most reluctant of Avalon’s residents come to terms with their past and make bold decisions about their future.Isabel Kidd is fixing up her ramshackle house while sorting through the complications of her late husband’s affair. Ava Catalina is mourning the love of her life and helping her young son grow up without his father. Local plumber Yvonne Tate is smart, beautiful, and new to Avalon, but finds that despite a decade of living life on her own terms, the past has a way of catching up—no matter where she goes. And Frances Latham, mother to a boisterous brood of boys, eagerly anticipates the arrival of a little girl from China—unprepared for the emotional roller coaster of foreign adoption.Bettie has helped so many people and now she is facing a trial of her own. Everyone needs to come together and create something truly memorable just for her.Dollycas’s ThoughtsDarien Gee writes about friendship and she does it masterfully. I was actually sad when I reached the last page. Bettie may not be adored by everyone in Avalon but she sure is the glue that holds the town together. She believes the answer to every problem is scrapbooking and saving memories. It is also the community of scrapbookers and their families that gather together to share their projects and support each other through good times and bad.While Bettie is the main character of this story, the supporting characters are written just as well. A few characters return from Gee’s first story but we are introduced to new ones as well. There are several prominent supporting characters. You need to take your time, this is not a book to rush through, so you can really get to know these fabulous. characters and their stories. I said in my review of Friendship Bread that is was a story to be savored and the same is true with this story. The characters are rich and their stories feel real. One story line reminds me of similar circumstances in the Miss Julia Series by Ann B. Ross.Gee has written another heartwarming and inspiring story that you will want to share with all your friends. I can only hope that this is not our last trip to Avalon. Both books are fabulous and can be read as stand alone but you will want to read both and then you will want to bake bread, start scrapbooking and get together with all your friends and family. The recipes and scrapbooking tips are a real added bonus."}, {"userName": "Alex", "userReviewDate": "Feb 22, 2017", "userURL": "http://www.goodreads.com/user/show/4897461-alex", "userReview": "The Avalon Ladies Scrapbooking Society repeats the format of Friendship Bread, if not the entire formula. The people of Avalon are much more forgiving than one might expect, and Gee knows how to tug heartstrings, but also knows how to make drama out of nothing and then have story lines resolve exactly the way they were always going to in the first place.Sometimes the characters get muddled and you may have to check the blurb to keep yourself abreast of which woman you're reading about, but The Avalon Ladies Scrapbooking Society is heartwarming chick lit for lovers of heartwarming chick lit."}, {"userName": "Kathryn Laceby", "userReviewDate": "Mar 01, 2013", "userURL": "http://www.goodreads.com/user/show/17958040-kathryn-laceby", "userReview": "Originally reviewed at Novel EscapesThere are quite a number of wonderful ladies that are all interwoven in The Avalon Ladies Scrapbooking Society and I quickly found it was important for me to get them straight before I could really enjoy how their relationships unfolded. For this reason it did take me a few chapters before I was hooked.The feel of the novel for me was reminiscent of a Cathy Kelly or even a Maeve Binchy in that Gee put together strong characters and individual stories and wove them together into one novel set in a small town. The difference was of course the theme of scrapbooking which I really know next to nothing about. As a child we were given the task of creating a scrapbook of our holidays (to keep us busy during said holiday!) but the scrapbooking business of today is apparently a whole other matter. I was a bit lost when Bettie was explaining to her group about different types of kits for their books but it was still interesting to me and I loved that this brought people from all over the town to one common hobby- especially a hobby that focused on creating memories of the good things in their lives. It was so touching to see how they rallied around Bettie when she needed it and gave me a feel good vibe that the whole novel encompassed. There are actually so many women it’s hard to pin point one I liked the most- for some reason the one thing sticking out for me is the silly goat Serena that Connie is determined to love above everything else. A goat in itself is lighthearted where quite a few of the other storylines made me teary so there’s something for everyone and I’m sure everyone can relate to one of the Avalon Ladies. I even read all the Friendship Bread recipes!Thank you to Random House for our review copy. All opinions are our own."}, {"userName": "Shari Larsen", "userReviewDate": "Mar 19, 2015", "userURL": "http://www.goodreads.com/user/show/2751691-shari-larsen", "userReview": "This novel follows a group of women who have formed deep friendships over their love of scrapbooking. Isabel Kidd is trying to fix up her house while dealing with the complications of her late husband's affair. Yvonne Tate is the local plumber, smart and beautiful, living life on her own terms, but still has to deal with her past when it catches up to her. Ava Catalina is a struggling young mother, and Frances Latham and her husband are in the process of a little girl, but she is unprepared for the emotional roller coaster of adopting from China.Bettie Shelton, who can be both annoying and endearing at the same time, is the founder and leader of the Avalon Scrapbooking Society; when the other members of the group discover the crisis she is facing, they all pull together and do something truly memorable for her.I really enjoyed this novel, even though I am not into scrapbooking, I liked how the theme tied all the stories together. There are no deep plot lines in this book, but it's an enjoyable \"feel good\" read, and it reminded me a lot of the stories by Debbie Macomber."}, {"userName": "Charlotte", "userReviewDate": "Jan 27, 2013", "userURL": "http://www.goodreads.com/user/show/650832-charlotte", "userReview": "http://charlotteswebofbooks.blogspot....The Avalon Ladie's Scrapbooking Society was a cute novel. On the one hand it made me think of my own smalltown hometown - but it also made me very glad that I no longer have to deal with that \"everybody in everybody else's business\" - it is pretty standard for small towns and made me so very glad that I live in the city now! I did enjoy all of Avalon's residents, especially Yvonne, but I would probably get irritated with Bettie's interfering ways real quick like. Bottom line, The Avalon Ladies Scrapbooking Society is a quaint little novel about a quaint little town. Fans of scrapbooking will fondly recognize some of the terms and tools mentioned and maybe even a little bit of themselves in the characters. I will be interested in hearing what my scrapbooking sisters think of this one!"}, {"userName": "Heather", "userReviewDate": "Jan 19, 2013", "userURL": "http://www.goodreads.com/user/show/16605086-heather", "userReview": "This story was not one I cold rush through and I found places that got a bit confusing with so many characters to follow. At times I felt like the book didn't have to be quite so long or so full of character detail, but as I got further and further I realized that I needed that level of detail to bring the story to life in my own imagination. I slowly became invested in several characters and their journey's. I loved the way a community came together to support a long time resident. I am not a scrapbooker, but the book is more about memories and everyone has those, both good and bad. The story follows Bettie Shelton, the town busybody. Each resident has a memory of something Bettie has done to or for them, but it takes something bad happening for them to realize just how much Bettie has done for everyone in the town. I gave the book 3 1/2 stars because the story was good, but a little long."}, {"userName": "Laurie", "userReviewDate": "Mar 05, 2013", "userURL": "http://www.goodreads.com/user/show/291488-laurie", "userReview": "The author did a nice job of tying in scrapbooking and the importance of recording your memories into the ending. But for 3/4 of the book it appeared sporadically. I didn't feel like she did a good job of explaining why it was important. It was just portrayed as some cult-like hobby where all women do is collect glittery embellishments. While she did show how scrapbooking is valuable in the end, I felt like it should have been there throughout. Whenever she did mention scrapbooking, I found myself rolling my eyes and really just wanting to get back to the stories of the different characters."}, {"userName": "Cheryl", "userReviewDate": "Jul 21, 2013", "userURL": "http://www.goodreads.com/user/show/3197953-cheryl", "userReview": "I liked this book a lot! I had the feel of scrapbooking and the ways sharing your life in a scrapbook builds relationships with others!"}, {"userName": "Kathryn", "userReviewDate": "Jan 14, 2018", "userURL": "http://www.goodreads.com/user/show/2825213-kathryn", "userReview": "3.5★"}, {"userName": "Dee", "userReviewDate": "Jul 14, 2013", "userURL": "http://www.goodreads.com/user/show/2177726-dee", "userReview": "Audiobook Review Copy Provided By Publisher (Tantor Media)I’m really conflicted over my review for this book. I really enjoyed the premise behind the story and the story itself, but I really struggled with the writing style. There was something cozy about getting to know the citizens of Avalon, Illinois (although, I was kind of bummed to see that it wasn’t a real town because I wanted to pick up and move there). Darien Gee did a great job in developing her characters – I felt like I had grown up with them, that I was a citizen of the town.But at the same time, I really struggled with the writing style. Specifically, that it was written in this weird third person, present tense – and it felt awkward. My editor in my brain wanted me to go through with a red pen and either put it in first person, alternating POV or third person, past tense. My other issue was that at the same time, while I loved the wide variety of characters, a few times there were too many…I wish that she had stuck to the main women – there were a few cameos where someone was introduced and then nothing was ever mentioned about them again…it kind of felt disjointed and missing something. I would also caution that if you haven’t read Friendship Bread, that you might feel like you are missing something – I know that I haven’t and there were a few places where I was scratching my head.I also strugged a few places with the narration. I don’t know if its because I’ve been spoiled recently by multiple narrators in audiobooks, but I wanted more. This would have been, (IMHO) a great opportunity for a multiple narrator book – with each main character having a different person narrate it. My mind just wasn’t transiting well between the voice for Betty (a 70 year old woman) and Ava (a mid-20′s young woman) to Isabelle (early 40′s)…but I will admit that it could got better as the narration progressed – so maybe it was just a matter of re-accustoming my ears to a single narrator. It would probably also good that there were limited male voices and those that there were, were mostly cameos – there were no main male characters.Overall, I gave the writing/story 2 stars (mainly due to my struggles with the writing style used) and the narration 3 stars, so 2.5 stars overall. Which is kind of disappointing because I thought it had so much potential (maybe I had hyped it up to myself a bit too much…)"}, {"userName": "Shelleyrae at Book'd Out", "userReviewDate": "Nov 01, 2012", "userURL": "http://www.goodreads.com/user/show/1607230-shelleyrae-at-book-d-out", "userReview": "Last year I read Darien Gee's charming debut novelFriendship Bread, where the simple anonymous gift of Amish Friendship Bread starter unexpectedly unites three women, Julia, Hannah and Madeline together in friendship, and a community in time of crisis. The Avalon Ladies Scrapbooking Society resurrects the small Illinois town and it's residents in this independent sequel.Just as with friendship Bread, this novel is a celebration of friendship, family and community. While familiar characters wander in and out of the frame, this story features a new cast of women. Isabelle is is still wallowing in bitterness and misery after her husband left her for his dental assistant. His death just a few months later left Ava, the aforementioned dental assistant, to struggle alone as a single mother to their son. Yvonne has just moved to Avalon, determined to make a success of her plumbing business having turned her back on her family's wealth and power long ago. Frances is joyfully waiting for the day their daughter, a toddler from China, can finally join their family only to be devastated by a setback in the process. As these women struggle to leave their past behind and reimagine their futures, they are drawn together by Bettie, a long time resident of the town and the president of the Avalon Ladies Scrapbooking Society who reminds them that each moment of the present is precious.I think it helps to be familiar with Friendship Bread before embarking on this follow up, though it isn't strictly necessary. The large cast of characters can be a little overwhelming initially but the distinct personalities and issues amongst the women featured quickly emerge. The plot is not entirely predictable though it's progression is not unexpected as the characters cycle through emotional highs and lows. The pace is leisurely but as you take the townspeople into your heart you will find yourself reluctant to put the book down.Written with heart, humor and simple wisdom, The Avalon Ladies Scrapbooking Society is a sweetly engaging novel. And as a bonus you will find delicious recipes in the last few pages - I am determined to try Madeline's Apple Dumplings with lemonade!"}, {"userName": "Julie", "userReviewDate": "Feb 25, 2013", "userURL": "http://www.goodreads.com/user/show/2079573-julie", "userReview": "This is not the kind of book I usually read. The cover, the title, the general content -- they all scream \"chick lit! chick lit!\". Fluffy and light, the characters have no major flaws, so the plot revolves around their minor ones, and everyone is part of the tidy, happy ending. Even the setting, the \"small town\" of Avalon, Illinois, has the feeling of a sweet small town, but the diversity and happy coincidences of a bigger city. For example, Avalon has a good-sized club of variously-aged men who have lost their wives and get together to share recipes -- enough to print their own cookbook. Another example: somehow, there are multiple single, 25-35 year old, attractive men whose work conveniently allows them to meet similarly attractive and available women -- all in the nice time-frame of the book. I received a free copy of this book as a member of the Random House Reader's Circle, and it is a nice hard-bound (with no deckle edge!), so I decided to make a go of it, even with all of my prejudices against it. While the story had some fanciful qualities, they were fanciful qualities that you could almost believe -- that you would want to believe. There are at least twenty different \"main\" characters, which can be confusing at times to correctly place every time you read their name, which I know bothered some other reviewers. However, I was surprised to find myself looking forward to reading this book -- enjoying it, actually. I wanted to know what secrets Bettie was keeping, whether Isabel would stay in the home she was beginning to loathe, if Yvonne would ever reveal (and reconnect with her past). I wanted to know how the harder-edged characters might be softened, whether Serena would find her way back to her original owners.The Avalon Ladies will not make you sad (too much, anyway). It will not make you angry. The loose ends get tied up, and while \"scrapbooking\" is in the title, it is only the catalyst that brings a community together, rather than the main point of the story. If you have been reading heavier stuff, or simply enjoy lighter fare on a regular basis, I would recommend The Avalon Ladies Scrapbooking Society."}, {"userName": "Sharon", "userReviewDate": "Feb 24, 2013", "userURL": "http://www.goodreads.com/user/show/1757121-sharon", "userReview": "The tiny town of Avalon, Illinois, has some pretty interesting citizens. There's Yvonne, the plumber. There's Isabel, the widow whose dentist husband ran off with his dental assistant before he died. There's Ava, the dental assistant. Connie, who works with Madeline at the tea salon -- and believes that she has no one to love but Serena, the goat she found wandering around the farmer's market. Every chapter or so, we meet another townsperson whose story will be entwined with those of the folk already introduced.And then there's Bettie, president of the titular Avalon Ladies Scrapbooking Society. She's a feisty senior citizen who, as we learn through the pages of the book, is pretty much the glue that holds the town together; she knows everyone, and everyone knows her. Lately, though, she hasn't been quite herself.Darien Gee brings us right into the small town she's created and helps us make friends with her characters. I am unashamed to admit that I cried a few times during the manuscript as the Avalon townsfolk experienced challenge after challenge. At the same time, it is a book about growth, finding out who you are and, most of all, love. The people in the little town genuinely care about each other (even as they like some folk better than others).Gee's prose is elegant without being pretentious. She puts us in the middle of each scene; we can almost smell the baked goods at the tea salon (Gee includes recipes at the end of the book) and imagine the excited chatter as people work on their special scrapbooks.A delightful book all the way around.(Review based on uncorrected advance proof.)"}, {"userName": "Nada", "userReviewDate": "Nov 28, 2012", "userURL": "http://www.goodreads.com/user/show/6479785-nada", "userReview": "Review first published on my blog: http://memoriesfrombooks.blogspot.com...The Avalon Ladies Scrapbooking Society is a follow up to Darien Gee's first book Friendship Bread. However, both books stand independently and do not have to be read together. This book brings to life the small town of Avalon through the eyes and stories of some of the women in town.Bettie is an older, long time Avalon resident who is the head of the scrapbooking society. Isabelle is recovering from her husband's betrayal and death. Yvonne Tate is the town plumber attempting to live live on her terms. Ava is a single parent who had an affair with Isabel's husband. Frances is the young mother. Madeline runs a local cafe. Connie is a young woman who is still figuring out where she belongs. All these women are connected by bonds of family, friendship, and small town life.I am a photographer but not a scrapbooker. However, an interest in scrapbooking is not necessary for enjoying this story. The concept of memories is an underlying theme to the entire book - memories that we cherish, memories that trouble us, memories we try and leave behind, and the memories we create every single day.A quick read. A simple story about women and their laughter and their tears. A cozy book to read with a cup of tea.*** Reviewed for the LibraryThing Early Reviewers program ***"}, {"userName": "Connie", "userReviewDate": "Jul 12, 2013", "userURL": "http://www.goodreads.com/user/show/15983681-connie", "userReview": "This was a wonderful light read-- engaging characters who seemed like people you might know, just enough conflict and drama to make you care about them, and the promise of sunshine after the various personal storms. The personal stories unfold gradually, with little apparent connection at first, but finally coming together into unexpected community. Some of the resolutions may feel a little too easy-- although Gee doesn't gloss over the fact that some of the relationships that emerge will have their challenges. But overall, Gee also suggests that meaningful connections between people can be made if they are willing to let go of their fears and prejudices and make the effort. She does that without being overly Pollyana-ish in her approach to the story-telling.If you are looking for a book about tortured souls who are doomed to lives of sadness, secrets, trauma and missed opportunities for connection, this isn't the book for you. But if you enjoy books about small towns, with ordinary people with ordinary problems-- especially folks who want to \"do right\" and reach out to others-- this book will give you a hearty helping of those things. I found myself wondering how these stories continued once the covers of the book were closed and hoping that Gee will take us back to Avalon very soon."}, {"userName": "Tonya", "userReviewDate": "Oct 02, 2012", "userURL": "http://www.goodreads.com/user/show/878615-tonya", "userReview": "I was so glad to get this book. I have been waiting a LONG time. It was so worth the wait. Connie and the goat she found, that she doesn't want to find the owners for and just her life in general. Isabel's husband left her when his lover, Ava, got pregant. But then Bill died. So now everything is a big mess.These are just TWO of the stories, well really three, because you have Isabel's story AND Ava's, that you will read about and fall in love with. I so love the tea salon and I love how recipes are included in the back. Bill's spaghetti sounds so yummy I can't wait to try it. Just so you know, the mountain dew dumplings are to DIE for!!! Lots of vanilla bean ice cream on top makes them so delicious! My mouth watered every time they were mentioned.Each person has their own quirks, but I love each of them. Grab kleenex though, between Bettie's story and Mei Ling's... you will need the whole box.The ONLY thing I hate about books like these, are waiting for the next ones!!! Happy reading!"}, {"userName": "Izabella ⋆ Pages Full of Stars ⋆", "userReviewDate": "Jun 28, 2016", "userURL": "http://www.goodreads.com/user/show/4787170-izabella-pages-full-of-stars", "userReview": "Another lovely book from Darien Gee, set in a small town of Avalon :)I have to say that I enjoyed it slightly less than Friendship Bread, even though the main theme of the book (craft) is close to me heart, but it was still a great, warm story. Again, we have a wide cast of characters and throughout the book we follow their numerous stories. Mostly, there are new characters introduces but there also are some we know from the previous book. As far as the story goes, while in the previous book I liked all storylines and characters, here I I found myself connecting to some of them them a little less then before. Same with the \"crafty\" theme, I loved everything about it but the theme of friendship bread and how it connected people in the other book just struck with me more.Overall, I still adored the book and I will definitely love to come back to Avalon and next books by Darien Gee."}, {"userName": "Kari", "userReviewDate": "Feb 16, 2013", "userURL": "http://www.goodreads.com/user/show/1395098-kari", "userReview": "I picked up this book because of the scrapbboking involved. I adore scrapbooking and thought this would be a fun read. I quickly realized this is not a type or genre of book I would normally read. It took me at least150 pages to finally begin to get into the book. I think the fact there are so many characters, like the entire town, confused me for the longest time trying to figure who is who and which storyline goes with which character.. each character has a rather sad background and scrapbooking becomes the tie that binds, so to say. an outlet for thise to explore their feelings, memories and experiences. It helps with healing for some and for others an avenue to find friends or become more successful. by the end, each character is able to move on in a positive way in their life. it is a long book and I have to say I am happy I am finished."}, {"userName": "Sheila", "userReviewDate": "Apr 24, 2013", "userURL": "http://www.goodreads.com/user/show/3368055-sheila", "userReview": "I certainly enjoyed this book, an easy read. We meet again some of the same characters that were introduced in her first book, Friendship Bread. Avalon is a small town where many of the inhabitants know each other. In this book, we meet Isabel who is still struggling to deal with the aftermath of her husbands betrayal and sudden death; Ava, the young woman, her husband left her for and Max, Ava's little boy. We are also introduced toYvonne, Avalon's new plumber and Frances, the mother of three boys but who is desperately hoping to adopt a little girl from China. Bette is the force of the community, bringing all the women together with her love of scrap booking. And of course, we can't forget Madeline , the owner of her own little tea room. A book of love, forgiveness, community spirit and love."}, {"userName": "Stephanie", "userReviewDate": "Feb 22, 2013", "userURL": "http://www.goodreads.com/user/show/4175571-stephanie", "userReview": "The Avalon Ladies Scrapbooking Society is a wonderful follow up to Darien Gee's Friendship Bread. It also stands very well on it's own, you don't need to read Friendship Bread in order to know what is going on in this novel (although I highly recommend you do, it's great!). In this one you will find many new characters as well as most of the old ones. Some people may find this a bit confusing and hard to keep track of but soon you will get to know and love these characters that it will be easy to keep them straight, just like your own family. I loved this book even more than Friendship Bread. It was a wonderful book that explores what it means to forgive, the true meaning of family, and what it is like to live in a small town. This book is like comfort food, it left me feeling satisfied and gave me that warm and fuzzy feeling that only a good friend (or a good bubble bath)can give you."}], "description": "Perfect for fans of Debbie Macomber, Kristin Hannah, Beth Hoffman, and Kate Jacobs, this luminous novel from the author of Friendship Bread follows a group of fascinating women who form deep friendships through their love of scrapbooking—as memories are preserved, dreams are shared, and surprising truths are revealed.Welcome to Avalon, Illinois, Pop. 4,243  At Madeline’s Tea Salon, the cozy hub of the Avalon community, local residents scrapbook their memories and make new ones. But across town, other Avalonians are struggling to free themselves of the past: Isabel Kidd is fixing up her ramshackle house while sorting through the complications of her late husband’s affair. Ava Catalina is mourning the love of her life and helping her young son grow up without his father. Local plumber Yvonne Tate is smart, beautiful, and new to Avalon, but finds that despite a decade of living life on her own terms, the past has a way of catching up—no matter where she goes. And Frances Latham, mother to a boisterous brood of boys, eagerly anticipates the arrival of a little girl from China—unprepared for the emotional roller coaster of foreign adoption.   Enter Bettie Shelton, the irascible founder of the Avalon Ladies Scrapbooking Society. Under Bettie’s guidance, even the most reluctant of Avalon’s residents come to terms with their past and make bold decisions about their future. But when the group receives unexpected news about their steadfast leader, they must pull together to create something truly memorable.   By turns humorous, wise, and deeply moving, The Avalon Ladies Scrapbooking Society is a luminous reminder that the things we hold most dear will last a lifetime.", "title": "The Avalon Ladies Scrapbooking Society", "url": "http://www.goodreads.com/book/show/13642949-the-avalon-ladies-scrapbooking-society", "average": 3.74, "cover": "https://images.gr-assets.com/books/1353632361l/13642949.jpg", "reviews": 433, "authors": [{"url": "https://www.goodreads.com/author/show/4472748.Darien_Gee", "name": "Darien Gee"}], "type": ["Fiction", "Womens Fiction", "Contemporary", "Womens Fiction"], "outlinks": ["http://www.goodreads.com/book/show/9744817-friendship-bread", "http://www.goodreads.com/book/show/18868730-an-avalon-christmas", "http://www.goodreads.com/book/show/33148584-an-avalon-valentine", "http://www.goodreads.com/book/show/22440903-writing-the-hawaii-memoir", "http://www.goodreads.com/book/show/22096320-pele-in-therapy", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/28353727-in-twenty-years", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/20552595-how-i-became-a-famous-novelist", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats"]}