{"ratings": 13711, "userreviews": [{"userName": "Will Byrnes", "userReviewDate": "Sep 15, 2008", "userURL": "http://www.goodreads.com/user/show/1526851-will-byrnes", "userReview": "This is Harris’s follow-up to Chocolat. Vianne and now two daughters have relocated from the rural town of their initial setting, Lansquenet, to Paris. The novel is tort-like in the density of its imagery, particularly early on. Zozie is a witch like Vianne, but without the self-control and kind heart. She seems mostly like a soul catcher, a devil in a red dress looking to acquire souls. She sees power in Vianne’s daughter, Anouk, and tries to gain her loyalty. The story is of Anouk coming of age and of Vianne rediscovering herself. There is considerable shadow imagery here. Are shadows souls? Are they like the daemons of The Golden Compass, spiritual alter-egos? They appear as animals, like those from Pullman’s books. Are they the shadows of Dante’s Inferno, shades? The game is played throughout, leading to a climax battle between the two powers. Joanne Harris - image from her siteHarris returns to her structural notion of centering the climax on a major holy day. Last time it was Easter. Here, it is Christmas. Parallelism is rampant as Harris points out that the witches both lie about their past, assume multiple identities, have issues with their parentage, cast spells of different sorts. It was a very enjoyable read. The similarity to Chocolat was considerable, but that is to be expected when the same characters return. I did not love it, but I did like it a lot. It sagged for me over time. I felt that Harris was too fond of repetition, and that it could have been maybe forty pages shorter, but that is a quibble. Read. Enjoy.=============================EXTRA STUFFLinks to the author’s personal, Twitter and Tumblr pages"}, {"userName": "Cherie", "userReviewDate": "Aug 13, 2014", "userURL": "http://www.goodreads.com/user/show/6460330-cherie", "userReview": "I’ve been sitting in my chair thinking about what I was going to write about the story I just finished. The question, “what did you think?” always makes me feel like it is some kind of test and I am going to give the wrong answer. I try not to think about it that way. I always think that this is not the question that I should be answering. My question would be “what did you feel?” Ahhh, yes, that’s it. Let me tell you about the story by telling you how I felt. The whole time I was reading The Girl With No Shadow, I felt…anxious.Anxious to start the story, anxious to know what was going to happen, anxious to find out why the characters in this second story were so different than in the first book, anxious to know what had happened to them, anxious about the new character in the story, stomach churning, bile in the back of my throat anxious about what she appeared to be, about what she was going to do, what she did, and what she said. The first chapter shocked my socks off. Too much information! It scared me, not like I had never heard about it before, just to see someone – some character saying the things that were printed on the pages. Who was this? What did she have to do with the story and the characters I had left in the first book? Where were they? I wanted them, not this bad person! And there they were, so, sad, so, melancholy, so not right, so ordinary? I wanted them to snap out of the gloom. I wanted to shake them and slap them until they could see what was happening and how wrong everything was. I wanted them to drink a cup of hot chocolate, because that makes everything better, right? I wanted to drink a cup of hot chocolate to make me feel better.There were moments of hopefulness, glimpses of almost happiness, and snippets of laughter. Then, Bam! Then, more what? Don’t get me wrong, there were answers, eventually, lots of them. There were a few shocking moments at the end. Then a glow began to clear away some of the tarnish and haze and allowed a sparkle to shine here and there. I’m not so anxious now, except to start the next story…"}, {"userName": "Nikoleta", "userReviewDate": "Apr 22, 2013", "userURL": "http://www.goodreads.com/user/show/13362307-nikoleta", "userReview": "Η υπέροχη συνέχεια της Καυτής Σοκολάτας. Η Βιαν Ροσέ με καινουρια ταυτότητα, κ που είναι το περίεργο; Έτσι την μάθαμε και έτσι την αγαπήσαμε. Τι συμβαίνει όμως όταν αυτή η νέα ταυτότητα έχει παρασύρει κ καταπιεί την αγαπημένη, δυναμική ηρωίδα που ξέραμε και την έχει μετατρέψει σε ένα άβουλο τρομαγμένο πλάσμα; Κ πάνω απ’ όλα όταν ο άνεμος φέρνει στην πόρτα της μια γυναίκα που θυμίζει πολύ περισσότερο τον παλιό αγαπημένο εαυτό της, ισως και περισσότερο απο'τι τον θυμίζει τώρα η ίδια. Όταν αυτή η μυστηριώδης γυναίκα αρχίζει να εποφθαλμιά και υπονομεύει την θέση της, στην Σοκολατερί, στην γειτονιά ακόμα στην οικογένεια της. Τι θα συμβεί; Αυτη την φορά ο άνεμος θα ξυπνήσει την παλιά καλή Βιάν που έχει θάψει βαθιά μέσα της; Η θα τα χάσει όλα; Ίσως η σοκολάτα έχει για άλλη μια φορά τις απαντήσεις…"}, {"userName": "Rachel", "userReviewDate": "Feb 15, 2009", "userURL": "http://www.goodreads.com/user/show/791006-rachel", "userReview": "The spider weaves its web elegantly. It is a thing of beauty to watch. But, to see it ensnare its prey is horrific, yet equally fascinating. Harris spins her own web in this delicious sequel to Chocolat. Who is the spider and who is the prey?"}, {"userName": "Bhargavi Balachandran", "userReviewDate": "Dec 13, 2010", "userURL": "http://www.goodreads.com/user/show/3063157-bhargavi-balachandran", "userReview": "I started this book with a lot of expectations and i am happy to report that I enjoyed it thoroughly. Joanne Harris's Lollipop shoes is like dark,creamy chocolate with a hint of spice-totally heady and difficult to resist. Narrated from three POVs(Yanne, Anouk and Zozie), the narrative flows seamlessly. I loved how Joanne let a huge chunk of the narrative be told from Zozie's perspective- I don't really think i have read too many novels that have been narrated from the Villain's point of view.Also,even the minor characters seemed etched out and the writing exceptionally vivid.Despite being a sequel to Chocolat, this one reads like a stand-alone book.I don't think not reading the first book before tackling his one matters much.The spells,totems,fables and stories about faeries and witches that Zozie and Yanne mention make the book more exotic and fascinating.It's no secret that I am a huge fan of magic realism-Joanne's book is a fine specimen of that genre.The writing is measured,yet intimate and warm,just like the characters in the book. There is something dangerously appealing about a slinky,chameleon-like villain and I loved Zozie's character the most(even more than Anouk and Yanne.). The bullying and name-calling that goes on in schools also forms a huge part of the story -atleast when the narration is done from the perspective of the eleven year-old Anouk.Joanne's writing is breathtaking and flows beautifully.This has to be one of the best books I have read in a long, long time and I don't think I can rave enough about it. People who are fascinated with the art of chocolate-making will love the details that Joanne shares with us and the book is about good food as much as it is about anything else."}, {"userName": "Melanie", "userReviewDate": "Apr 26, 2008", "userURL": "http://www.goodreads.com/user/show/433333-melanie", "userReview": "I really, really wanted to like this book - I have such fond memories of *Chocolat* (probably because I read a borrowed copy on the plane home from a trip to Paris replete with French chocolates, but still...). I can't help but think that the sequel almost ruins the magic of the first one - it ended so...hopefully, and then *The Girl With No Shadow* happens and undercuts it all.As a stand-alone book, though (which it very well could be), I'm much happier with it (and if it were a stand-alone book, I'd be tempted to give it four stars instead of three, although the ending was a little syruppy) - intriguing characters - I really like the shifting point of view - and charmingly, if a little too sweetly, written. Having finished, I feel a bit as if I've gorged on chocolates - pleasant memories and oh so good going down, but all the sugar gets cloying after a bit...which isn't necessarily all bad given how wonderful the sugar overdose is to begin with."}, {"userName": "Gerri Leen", "userReviewDate": "Jul 24, 2010", "userURL": "http://www.goodreads.com/user/show/3925847-gerri-leen", "userReview": "This is a sequel to Chocolat, and having loved that book, having been enchanted by the characters, I thought I'd love this. Wrong. Still intact from Chocolat is Harris's ability to weave the details of a thing or place so vividly that they become secondary characters--in this case the chocolates and the chocolate shop (in fact, it is that quality that keeps this from getting a D). What is missing is the sense of whimsy, the light-handed treatment of magic, and any possibly of liking these characters (much less getting to know them--there are so many, I lost track of who was who). This book is also too long, the characters pretty much whine incessantly--or twirl their hypothetical mustaches in the case of the villainess--in a rotating first person that had me continually popped out of the story as I tried to figure out who the hell was narrating (it didn't follow a set order and there was no textual indicator for who the POV was--apparently the image at the top of each page changes depending on who's narrating, but I never got that when I was actually reading it).Very little happens in these many, many pages, and Vianne's character--so lovely in Chocolat--is reduced to the most boring woman imaginable. Parts of Chocolat are conveniently discarded to make the love story poignant. If Chocolat had a dash of magic, Harris threw the entire bottle in for this one. Like Vanilla, a little goes a long way and too much ruins the recipe. I'm into Mesoamerican stuff but I couldn't keep track of all the Mexican gods and signs and other magic the villainess uses--and I'm not sure I entirely got what was going on in the \"thrilling finale.\" All in all: an utter disappointment for an author this good to a sequel to such a great book.Rated: C"}, {"userName": "Sarah", "userReviewDate": "Jan 29, 2008", "userURL": "http://www.goodreads.com/user/show/52746-sarah", "userReview": "Sequel to Chocolat, published as The Lollipop Shoes outside of U.S.Chocolat was full of colors and enchantment that we never really knew the source of. The Girl with No Shadow reveals these right away. This story starts with none of the enchantment and mystery of Chocolat. We are introduced to Zozie who is leaving her previous life. Each chapter comes from the point of view of either Zozie, Vianne, or Anouk. This threw me at first until I realized we had switched characters. Roux returns but is not the same character he was in Chocolat. Vianne’s life before Chocolat and between that story and this one is explained where Chocolat never really addressed this. For some reason I always got the impression that Chocolat took place in the 1950s or so, but according to this story it took place in the present. Vianne and Anouk seem out of place in the present day, and it was hard to wrap my mind around.It was a good story, but kind of flat for me. I prefer Chocolat."}, {"userName": "K.", "userReviewDate": "Jun 27, 2011", "userURL": "http://www.goodreads.com/user/show/5663034-k", "userReview": "26/8/2016God, I love this book. So, so much. Magic plays much more of a role in this one than in Chocolat, which could almost be described as straight up literature. This one relies fairly heavily on magic of varying sorts. It gives us the back story on characters we know and love, which also introducing one of the most unreliable and compelling narrators I think I've ever come across. Zozie is so creeptastic by the end, and yet in the beginning, the reader is as taken in by her as Anouk is. Anouk is such a delightful child character, and she's so wistful for the life she knew before while also finding herself teetering on the brink of growing up. She's torn between wanting to run to her mother for comfort and acting cool in front of her peers, and I just want to hug her and tell her that everything's going to be okay. Basically? I love this a lot. The end. 6/3/2014There are literally no words to tell you how much I adore this book. In many ways, I actually prefer this to its prequel, Chocolat. The narrative is split between Vianne - who's in many ways not the woman she was four years earlier in Lansquenet -, Anouk - now eleven and telling her own story -, and a new and mysterious character called Zozie. It's not always an easy read - Zozie's a complex and pretty mysterious character. You know throughout that she's up to something, but the big reveal is pretty bizarre and disturbing even on rereading. There are new characters to love, old favourites to adore all over again, and new characters that you'll love to hate. As with all of Harris' books, it's beautifully written and periodically serious-deep-thoughts provoking. Plus, it's the origin of one of my personal mantras: \"Fuck you, I'm fabulous\"."}, {"userName": "CJ - It's only a Paper Moon", "userReviewDate": "Feb 04, 2009", "userURL": "http://www.goodreads.com/user/show/1357098-cj---it-s-only-a-paper-moon", "userReview": "If Chocolat was Dark Chocolate with a creamy milk chocolate filling then The Girl with No Shadow is a Dark Chocolate truffle with a smooth creamy finish.\"The Girl...\" is not a simple tale. It's a complex tale that mirrors life and the way we interact with each other, the things we choose not to see, the choices we make because we believe them to be right and the ultimate decision of getting back to that place within yourself that truly represents who you are.It's about love, vengeance, family, longing, truths and half-truths, growing up and expanding. To me the story is a darker and sadder tale than it's predecessor and while it ends on a realistic enough note, it doesn't completely satisfy you. When you're finished with this story you realize that the journey is never ending and while life is never about an ending that is given to you in a neat little bow, it is about making your own magic and being happy with what you have.I leave it up to you to finish and try to decipher my meanings. I'm in love with this book (I'm biased because I love Joanne Harris) and if you've read Chocolat then you will appreciate this book."}, {"userName": "Morana Mazor", "userReviewDate": "Feb 04, 2015", "userURL": "http://www.goodreads.com/user/show/30488471-morana-mazor", "userReview": "Pariz, magija, čokolada... Pratimo život Vianne Rocher i Anouk poslije onog dijela koji smo čitali/gledali u Čokoladi... A on se odvija u Parizu, točnije na Montmartru.. I to je lijepo.. Iako je u ovoj knjizi više naglasak na magiju..prvi mi je dio bio bolji.. U stvari, možda sam baš zato što je prvi bio toliko dobar, stavila prevelika očekivanja pred Cipelice..Ovdje mi je najslabija karika nekako, nedorečen zaplet.. U svakom slučaju, ako ste zavoljeli likove i atmosferu \"Čokolade\" pročitajte i ovo..."}, {"userName": "Linda Abhors the New GR Design", "userReviewDate": "Nov 14, 2012", "userURL": "http://www.goodreads.com/user/show/8619142-linda-abhors-the-new-gr-design", "userReview": "I loved this book. And I didn't expect to. Granted,  Chocolat is one of my favorite \"Go to a happy place\" films. So when I found the book at a bargain price a few years ago, I thought I'd read it.Per my usual, since I'd seen the movie, I didn't take the time to read the first book (since I have so much to read for work, and this doesn't fall into the group of books in my field). Now I think I will, even though I can tell that it won't take me to a happy place, as does the film.I thought for certain that this book would fall into the category of \"wannabe feminist magical realism ripoffs\". You know, the fluffy ones that dress up sappy romance novels with cooking miracles, and relegate the magical to the feminine sex.Well, it's slightly sappy--there is a romance involved (the same, for all you fans). But it's not magical realism. Nope, we're talking real magic. Witchcraft. And no, the people surrounding Vianne do NOT find it to be the norm (that would be magical realism). This is what makes me think that I need to go back and read the first novel--the movie script had completely altered this storyline. This book has Vianne and her (now two) daughters inhabiting Montmartre, and trying to live as \"normal\" people. But alas, a \"normal\", secure, comfy life is not in the cards for Vianne (pun intended). For the first time in a while now, I found myself wishing that I had time to pick up a book and finish it, or considering a change in my exercise routine so that I could take it to the gym and read it on the bike (I didn't, and my hips thank me for that). For those of you who \"know' me, you'll know I'm INTJ, which means I'll fixate on little details more than most people. And I teach Spanish/Latin American cultures, civ's, lit's, so I'm always annoyed when authors \"dabble\" in those areas--I still haven't really forgiven the author of the Celestine Prophecy. But I liked this book so much that I could forgive talking about pulque as a powdered hallucinogen that could be added to water and reconstituted (it's the fermented sap of the cactus, so no, it can't), or referring the Incas as a MesoAmerican civilization, or Hurakan as an Aztec god (he was Taino, Hurricanes come from the Caribbean). At least, I think, Carpentier and Garcia Marquez would still approve of the fact that what is magical stems from the Americas--though the ability to see and appreciate the magical in everyday life is portrayed as possible among Europeans, which Carpentier would completely disagree with.The story's told through three voices: Anouk's, Vianne's, and Zozie De L'Alba (not her real name, just her current persona). Since it starts with Zozie's voice (it's not a spoiler if I tell you she's an evil force), my first reaction was \"wow, Vianne is a completely different character than her film counterpart\". I felt better in the second chapter, when I realized that it wasn't Vianne's voice at all; I like a character I can get behind; anything else, it's hard for me to invest. The image at the beginning of each chapter is supposed to indicate who's narrating that chapter, in case you can't figure it out. I didn't pay attention to the images, just read. In the beginning, the alternating voices create a rhythm: Zozie, Vianne, Anouk, Zozie, Vianne, Anouk. It's like riding a train; that rhythm lulls you, dulls your senses a bit. But just as you're falling into the rhythm and almost asleep, Harris alters the pattern/order, so that you're shocked back into paying careful and close attention to the voice again. Is Zozie's voice radically and identifiably different from Vianne's, as is Anouk's? No, she doesnt' achieve that distinct nature the way Kingsolver did with Poisonwood Bible, but it's still wonderful reading. I think that this and the suspension of disbelief required at the neat, tidy ending are the only things that make me give it a four instead of a five (a five for me is \"I WILL reread this!\", and a four is \"I'd love to reread this, if I had time.\") If you're a fan of the film, I don't think that this book will disappoint."}, {"userName": "Janice", "userReviewDate": "Oct 04, 2012", "userURL": "http://www.goodreads.com/user/show/2513987-janice", "userReview": "The sequel to Chocolat is a much darker offering. The story is set 4 years later and it's clear that Vianne is fearful of something. She and Anouk have assumed new names, their spirits have dwindled, and they seem defeated. The story examines the debilitating effect of fear and the dangers it can expose us to. It also examines the choices we make to obtain the things we need. I'm beginning to suspect that Joanne Harris' dialogue of right vs wrong, good vs evil to be a signature for her. I've read three of her books and don't intend to stop there, so I shall see if that idea holds true for her other books.While Chocolat's use of magic was understated, The Girl With No Shadow was more explicit. It was almost a character of its own. In a way, I preferred the understated magic in Chocolat. The tension in this story was palpable. I couldn't stand it, and had to peek ahead. The characters are beautifully drawn, and I was invested in their well being and how this story was going to work out.I wonder what is in store for us with the next book in the series. I shall find out!"}, {"userName": "Sonia Gomes", "userReviewDate": "Jan 23, 2009", "userURL": "http://www.goodreads.com/user/show/1948955-sonia-gomes", "userReview": "“ Zozie de l'Alba has breezed into Vianne/ Yanne's life. What's she up to ? She who steals identities, is fun, has loads of magic. And Yanne (from Chocolat) why has she turned into such a wimp. Why is she trying to conform, be like \"the others\", of course its because she wants a normal life for her daughters Anouk/Annie and Rosette (who is mute). Although Zozie's intentions are far from good, she does manage to get Yanne back into business, she manages to inject a lot of life into the Chocolat shop which was just an ordinary shop before Zozie took over. Bad intentions Zozie...you tried to take away Anouk from her mother, but failed. Anouk stayed on with Yanne stronger than before, but why did she need Pantoufle and Rosette her Bam ? Chocolat had only good intentions but Lollipop Shoes shows that the world has evil in it too, even if it is the form of the very glamorous Zozie de l'Alba. ”"}, {"userName": "Louise", "userReviewDate": "Jun 10, 2017", "userURL": "http://www.goodreads.com/user/show/56521110-louise", "userReview": "Having read chocolat I already had an interest and liked the character of viane. It was good to see the changes in the child as she has grown up and the development of the relationship with her mother. Some of the references which pinpointed dates threw me a bit I had the sense in chocolat that it was more historical but the mention of mobile phones threw me into an era I had not really thought of this book being in. Although I perhaps appreciated more the contrast of the more traditional and old magic elements compared to this. And magic/chocolate/ seduction... Well I have a soft spot for that."}, {"userName": "Tze-Wen", "userReviewDate": "Nov 13, 2007", "userURL": "http://www.goodreads.com/user/show/60762-tze-wen", "userReview": "[This review was originally posted on my blog.]It has been years since I last read Chocolat and watched its magical movie adaptation. I remember that I went on a Joanne Harris reading spree right after that. Many of her books are just as filled with love for the culinary arts. Part of me was afraid that the sequel would disappoint, and that is why I only recently got around to reading The Lollipop Shoes. I needn't have worried though, because from the very first page I was hooked. The woman without an identity, the woman with any identity possible at her fingertips and currently known as Zozie de l'Alba... she is like a shimmering mirage that walked straight out of a fairytale on her lollipop shoes. And of course, with all the glamours and magical tricks she conjures up, she is just that. I sat in awe of her effortlessly invoking the old gods, making her own luck as she goes along. It all seems so innocent, the stealing of identities from people that are deceased and no longer need them. But of course, it isn't quite so harmless when the people you're trying to impersonate are still alive.I have noticed that some readers feel let down by the amount of occultism that is woven into the story. This sequel is actually not terribly dissimilar to Chocolat, although the emphasis of the narrative has shifted to the charmed life. Admittedly, only a decade ago I was myself intrigued by Wicca. As a religion it wasn't quite what I was looking for in the end, but I still find its practices and beliefs fascinating. I can however imagine that without a certain interest or curiosity a lot of this wondrous tale falls flat. Yet, a focus on magic is indispensable to the plot: Yanne has purposefully shed off her old skin in order to start anew. She relies on the more ordinary five senses, even though it is evident that her choice is driving her towards bankruptcy and an unhappy union. This self-imposed restriction is quite interesting to observe, because the reader knows how much she used to rely on her special powers. It is also in stark contrast with Zozie's effortless, arrogant use of them, taking on the world as if it belonged to her solely. The question remains whether Yanne will realise in time that the new life she has created for herself is under threat... Aside from the invocation of mysterious avatars and the magical infusion of chocolate delicacies, I especially liked how Yanne's two daughters were portrayed. Both Annie and Rosette are unique in their own way, where strict adherence to an unwritten code of conduct is required. Their not fitting in, because of Annie's preference for somewhat alternative clothing, music... and pretty much everything else, and Rosette's readily diagnosed underdevelopment, is heavily frowned upon by their peers. Reading about their daily struggles and how cruelly the world treats them, is a reminder of how we could all be a little more accepting of others.The sum of the above makes The Lollipop Shoes an enthralling read that will transport you to a world very similar to ours, but enhanced with colourful enchantments and many cups of perfect hot cocoa."}, {"userName": "Anne", "userReviewDate": "Nov 15, 2009", "userURL": "http://www.goodreads.com/user/show/223993-anne", "userReview": "I read Joanne Harris's popular novel Chocolat and saw the movie based on it so long ago that I can barely remember what it was about - other than a chocolate shop in France. But, I do recall enjoying it and finding it quite magical. So, while at a bookstore recently, I was excited to discover this sequel. The Girl with No Shadow opens with Vianne and Anouk (of Chocolat fame) in a new city under new identities, Yanne and Annie. Yanne is struggling to keep her new chocolaterie afloat. She is dating her landlord, a successful businessman who wants to marry her, but has no love for Anouk or Yanne's reticent four-year old, Rosette. Anouk, now almost a teenager, is having issues herself, trying to fit into school but knowing that there is a strange power within her yearning to break free. Suddenly, the wind blows Zozie into their lives. A stranger with no apparent history, Zozie ingratiates herself into their lives, bringing prosperity, but at a price. Harris tells her story from the alternating perspective of Yanne, Anouk, and Zozie (a device I am slowly becoming so tired of). We see Zozie's scheming, and the mesmerizing effect it is having on everyone, particularly Anouk. It's clear to the reader from the outset that if Zozie has her way, things will not end well, but throughout the novel it does not become entirely clear why Zozie has chosen Yanne's life to destroy. I enjoyed the magic aspect - reminding me fondly of Alice Hoffman's books - but in the end, my dislike for Zozie was so strong that I could hardly bring myself to read the climax, but I'm glad that I did - and the return of Roux (Yanne's ex-flame) brought hope to an otherwise bleak story. The book takes place during the Christmas holiday season, so this is a perfect time of year to read it. It made me hungry for big cups of hot chocolate, and convinced me to go back and reread Chocolat."}, {"userName": "The Book Whisperer (aka Boof)", "userReviewDate": "Jun 20, 2008", "userURL": "http://www.goodreads.com/user/show/1253478-the-book-whisperer-aka-boof", "userReview": "I was so disappointed with this book; when it first came out I even bought it in hardback as I had absolutley loved Chocolat (and the others of Harris's that I have read). I had practically been counting down the days to the release of this book and was left feeling incredibly underwhelmed by the whole thing. The Lollipop Shoes is the story of Vianne and Anouk and Vianne's new daugher who have moved to Paris and set up a chocolate shop there too but there is none of the magic of that first shop, it's very dull and lacks sparkle. Also, the characters in Lollipop Shoes don't even seem to be the same people they were in Chocolat; Vianne was carefree and happy in Chocolat and in this she is dull and conventional (I know she is supposed to be hiding from her past but I just didn't buy it). And I found the storyline of Red coming back to find her almost ludicrous as their relationship in Chocolat never developed into what we are lead to belive it did in this book. Call me an old cynic but I just get the feeling that this book has been penned this in order for it to be made into another film - it had none of the magic I had expected. Infact, it left me feeling flat as a pancake. I would always invite someone to make up their own mind about a book but this really didn't cut it for me."}, {"userName": "Morgan", "userReviewDate": "Jul 27, 2010", "userURL": "http://www.goodreads.com/user/show/1513652-morgan", "userReview": "I enjoyed this more than Chocolat, perhaps because I had nothing to compare it to. Harris' writing style is just as easy to read as chocolate, and this book is just as amusing a morsel (and just as likely to make your mouth water). However, I found it more nuanced and a bit less obvious than Chocolat.Zozie is a much more satisfying villain than Chocolat's Reynaud ever was; and Anouk's sullen teenage resentment of (and at times, fierce love for) her mother and attraction to Zozie as a surrogate made for an enjoyable conflict. The story rolls along at a good pace, and switching between the three character voices of Anouk, Zozie and Vianne/Yanne from one chapter to the next works well for the most part. Anouk's voice is fairly unique, but there were places where Zozie and Vianne's became a bit interchangable. Keep an eye on the shifting image at the beginning of each chapter: it lets you know who's narrating, if you're ever uncertain.If you've seen the movie of Chocolat, it's not necessary to read the book before picking up The Girl with No Shadow. The movie is close enough to the original story that you won't be lost as to who's who in the novel's sequel.(NB: The original UK title for this book was The Lollipop Shoes.)"}, {"userName": "Ahmad Sharabiani", "userReviewDate": "Jan 22, 2013", "userURL": "http://www.goodreads.com/user/show/614778-ahmad-sharabiani", "userReview": "The Lollipop Shoes (Chocolat #2), Joanne Harrisعنوان: کفش‌های آبنباتی؛ جوآن هریس؛ مترجم: چیستا یثربی؛ تهران، پوینده، 1387، در 192 ص؛ شابک: 9789642950164؛ موضوع: داستانهای نویسندگان انگلیسی قرن 21 م"}, {"userName": "Anna", "userReviewDate": "Jun 28, 2017", "userURL": "http://www.goodreads.com/user/show/14941179-anna", "userReview": "I didn’t realise that there was a sequel to Chocolat until a friend recommended it a few years ago. Then I happened to see a copy in the library and thought it might be fun to read, as indeed it was. The narrative picks up about five years after the events of Chocolat. Vianne and Anouk have been joined by little Rosette and are living quietly in Paris. Their relatively peaceful existence is upended by the arrival of the enigmatic Zozie. I found the split point of view between Vianne, Anouk, and Zozie delightful, as Zozie is such an interesting antagonist. Although the reader knows from the start that her intentions are nefarious, you also cannot help but be fascinated by her. Thus I found ‘The Lollipop Shoes’ a more tense and thrilling experience than Chocolat. In the latter, the villain is a simple personification of convention, whereas here multiple witches are in play. I loved all the references to the Kindly Ones, who the central characters sometimes paralleled: the maiden, the mother, and the crone. (That said, I did feel old when I realised that Vianne is my age in this novel.)I read Chocolat quite a while back, but am nonetheless pretty sure I enjoyed ‘The Lollipop Shoes’ more. I appreciated that emotional bonds between women were at the centre of the plot and that the dilemmas faced by Vianne in particular were so sensitively explored. Paris was evoked vividly, which made me a little nostalgic. I’ve only been to Paris once, but the visit included a day wandering around Montmartre on my own. The descriptions chime with my memories of that day. The gradual build towards the denouement was elegantly done and the magical elements woven in beautifully. Although the ending did not surprise me, it was entirely charming and fitting. What an excellent novel to read over a restful weekend. It leaves you with a warm, cosy feeling."}, {"userName": "Jenifer", "userReviewDate": "May 19, 2008", "userURL": "http://www.goodreads.com/user/show/604597-jenifer", "userReview": "As a sequel to \"Chocolat\", I think this was pretty good. It shows growth and imagination on the author's part, not just a reworking of a previous success. Each chapter is narrated by one of the main characters; Zozie, Vianne or Anouk. The little graphic at the chapter heading indicates which person will be speaking, but I didn't figure that out until after I had finished the book. Kind of makes me mad, too. That's not the kind of clue I'd typically overlook. That aside, I thought there could have been more distinguishing features in the speech of each character. They all sounded the same to me. I could only tell who was speaking from their point of view. That pre-teen Anouk sounded much like her mother and they both sounded just like the third narrator (the villain) Zozie, irritated me all the way through. Another thing that took me out of the story a bit is the modern quality it has. Chocolate was a bit timeless, hard to determine the exact time period. This one is complete with cell phones, computers, and identity theft. It ruined a bit of the magic for me.I did like the fact that Zozie had a huge chunk of the narration; we don't usually get to hear the bad guy's point of view so that was kind of fun. Also well done; Harris populates her stories with a town full of interesting side characters that go through their own changes as the story moves along. It's fun to see them coming and going with their subtle stories unfolding throughout. I liked the themes of magic and morality, of mothers and daughters, of growing up (even the adults), of learning to use our own talents and not cover them up or try to be something that we are not."}, {"userName": "Heidi", "userReviewDate": "Apr 09, 2009", "userURL": "http://www.goodreads.com/user/show/996892-heidi", "userReview": "I enjoyed this book. I thought it was imaginative, and yet, had a good thought provoking message. At one point, I put the book down and thought that I didn't really NEED to finish it because I was pretty sure I could predict how it was going to end. But then, I starting thinking about it and decided that maybe things weren't going to turn out as I expected. That does sometimes happen, when I am surprised by an ending. I liked the reference to The Kindly Ones being so very dangerous. How many times have I met with a real Kindly One in life...thinking that someone was a real friend. Only to find out later that I was a fool. I think the book is, after all, a book of fiction. The metaphor was a good thing for me to think about. I liked the Mother/Daughter relationship. It seemed to mirror real life. The misunderstanding that can happen and be prolonged if we don't talk about them. Also, how easy it is to see just one side of things. I found the Mother to be very patient. She worked hard and did her best. She loved her children."}, {"userName": "گیل آوا", "userReviewDate": "Jan 23, 2013", "userURL": "http://www.goodreads.com/user/show/3811832", "userReview": "نوشتن این کتاب که با الهام گرفتن از یک شکلات فروشی آغاز شده،انقدر شفاف و عمیق، زندگی رو از درون یک مغازه شکلات فروشی توصیف می کنه که خواننده لحظه به لحظه خودش رو در فضای داستان می بینه. دردهای شخصیت های این رمان، همون مشکلات آشنای روزمره ما هستند و آخرش هم چیزی که بیشتر از طلسم و جادو، این مشکلات رو کمرنگ می کنه انسانیت و همدلی قهرمانان داستانه.شخصیتهای کفش های آبنباتی، خواننده رو دعوت می کنند تا مجددا با بخش هایی از شخصیت خودشون آشتی کنند، بخش هایی رو که دنیای مدرن نپذیرفته و انسان متمدن به اجبار ازشون دور شده. شور و نشاط، آزادی، شادی و عشق رو می شه توی زندگی این افراد لمس کرد و تاثیری که بر اطرفیانشون می گذارند به سادگی قابل درکه."}, {"userName": "Una Tiers", "userReviewDate": "Nov 18, 2016", "userURL": "http://www.goodreads.com/user/show/7810515-una-tiers", "userReview": "Harris makes the reader work hard to follow the characters with the assumed names. Then she moves in to a class boy girl fact pattern. While I am a fan of Chocolat, the movie, this book disappointed me."}, {"userName": "Jenny Sparrow", "userReviewDate": "Jul 26, 2011", "userURL": "http://www.goodreads.com/user/show/5876033-jenny-sparrow", "userReview": "Роман Джоанн Харрис \"Леденцовые туфельки\" - это продолжение известного романа \"Шоколад\". И, скажу я вам, просто замечательное продолжение! Туфельки понравились мне куда больше Шоколада, хотя я и сама, наверное, толком не объясню, почему :)Может, из-за того, что повествование ведется от лица трех разных героинь, и стиль каждой главы прелестно меняется в зависимости от рассказчицы: злодейки-интриганки Зози, Вианн, из страха за детей изменившей самой \"шоколадной\" себе, или ее дочери-подростка Анук, разрываемой противоречиями. Может, потому что интрига показалась мне интереснее, а злодейка колоритнее. Может, потому что встреча со старыми героями и их шоколадно-волшебным миром усилила удовольствие от романа. Да и конец книги на сей раз более закончен, закруглен, досказан и более мне по душе, чем конец первой части.У меня сложилось такое ощущение, что в романе нет ни одной лишней фразы, ни одного лишнего слова - повествование течет плавно, тягуче, погружая тебя в переживания героев, в их мысли и истории. Оторваться лично мне было практически невозможно - семисотстраничный роман был буквально проглочен :) Переводчику отдельный поклон - язык просто чудесный, не перегруженный, но в то же время сочный и удивительно приятный (жаль, что нет возможности оценить прелесть оригинала :( ). Второстепенные персонажи, чьим судьбам, вполне в духе Шоколада, суждено кардинально измениться после встречи с домашней магией обитателей chocolaterie, выписаны очень колоритно, живо и привлекательно."}, {"userName": "Stephanie Graham Pina", "userReviewDate": "Apr 26, 2010", "userURL": "http://www.goodreads.com/user/show/2447623-stephanie-graham-pina", "userReview": "While I did not love this book with the same intensity as Chocolat, it is still a delightful sequel. I was sad to see Vianne so changed and wanted desperately for her to find her way back to herself. I understood Vianne's changes, her fears as a mother, and as a mother of a special needs child I can relate to the fierce anger you can feel towards Kindly Ones who intend to help but only hurt. I felt angry towards Zozie, the interloper in their lives. I also felt strangely fascinated by her. Harris does a brilliant job in creating Zozie and showing the reader how she manipulates and works her way warmly into people's lives. She uses the same tactics Vianne used in Chocolat, but without kindness and only for her own gain. I think we've all known toxic people like Zozie. So friendly and kind that they are beyond suspicion. Their toxicity always flies under the radar.Harris is a beautiful writer. I enjoy her lyricism and her descriptions and I find her work absorbing."}, {"userName": "Lydia", "userReviewDate": "Aug 09, 2016", "userURL": "http://www.goodreads.com/user/show/12443776-lydia", "userReview": "I was pretty frustrated with this book. I enjoyed the writing and I thought the writing was good but the plot and the story just felt really drawn-out.Usually Harris' writing has a really lovely slowness, like the gradual unwinding of a ball of yarn, but I didn't feel that way with this book. I really like her characters, particularly her female characters and how they were written but parts of the novel just felt totally forced in there for plot purposes. Without spoiling it, I relished the big 'plot twist' in the book where someone returns, but the work I had to put in to get there was just too much in my opinion.I just found it difficult to read and that's so unlike me with Harris' books. I've just discovered there's a third book in the series so let's hope that one is an improvement. <3"}, {"userName": "Nikki ", "userReviewDate": "Aug 11, 2012", "userURL": "http://www.goodreads.com/user/show/223837-nikki", "userReview": "I love Chocolat, and I could never get bored of it, I don't think. But I didn't get on so well with The Lollipop Shoes the first time I read it, and this time even less so. Vianne without her magic, without her spark -- for most of the book anyway -- is a lot more boring, and I hated the tangles of plot Zozie festooned around the place. It was hard to care about Thierry and the part of the plot that involved him, and Roux didn't come in soon enough.The ending is too little, too late -- and I'd rather the domestic magic of Chocolat than the showdown between witch and witch.I'm hoping that the third book of this trilogy will be more like Chocolat, but I'm not going to read it until I'm sure I'm in the mood for it..."}, {"userName": "Darth J ", "userReviewDate": "Apr 01, 2013", "userURL": "http://www.goodreads.com/user/show/18974711-darth-j", "userReview": "This second installment in the Chocolat books is that rare sequel that is better than the first. More overtly magical than Chocolat, Harris continues her tale about a young mother raising her two children with sweets and witchcraft. There is something inherently earthy and grounded about the way the author uses magical realism to move her story forward, which is a breath of fresh air among others in the genre. From the food to the romance, The Girl with No Shadow is the most enchanting book in the franchise."}], "description": "The wind has always dictated Vianne Rocher's every move, buffeting her from the French village of Lansquenet-sous-Tannes to the crowded streets of Paris. Cloaked in a new identity, that of widow Yanne Charbonneau, she opens a chocolaterie on a small Montmartre street, determined to still the wind at last and keep her daughters, Anouk and baby Rosette, safe. But the weather vane soon turns, and Zozie de l'Alba blows into their lives. Charming and enigmatic, Zozie provides the brightness that Yanne's life needs--as her vivacity and bold lollipop shoes dazzle rebellious and impressionable preadolescent Anouk. But beneath their new friend's benevolent facade lies a ruthless treachery--for devious, seductive Zozie has plans that will shake their world to pieces.", "title": "The Girl with No Shadow\n      \n          (Chocolat #2)", "url": "http://www.goodreads.com/book/show/2227371.The_Girl_with_No_Shadow", "average": 3.81, "cover": "https://images.gr-assets.com/books/1437862062l/2227371.jpg", "reviews": 1538, "authors": [{"url": "https://www.goodreads.com/author/show/9432.Joanne_Harris", "name": "Joanne Harris"}], "type": ["Fiction", "Magical Realism", "Fantasy", "Romance", "Cultural"], "outlinks": ["http://www.goodreads.com/book/show/17667204", "http://www.goodreads.com/book/show/1022699.The_Lollipop_Shoes", "http://www.goodreads.com/book/show/3427448-the-girl-with-no-shadow", "http://www.goodreads.com/book/show/2215074.The_Lollipop_Shoes", "http://www.goodreads.com/book/show/18207195-cipelice-kao-bombon", "http://www.goodreads.com/book/show/3427448-the-girl-with-no-shadow", "http://www.goodreads.com/book/show/1022699.The_Lollipop_Shoes", "http://www.goodreads.com/book/show/1022699.The_Lollipop_Shoes", "http://www.goodreads.com/book/show/1022699.The_Lollipop_Shoes", "http://www.goodreads.com/book/show/16207216", "http://www.goodreads.com/book/show/1022699.The_Lollipop_Shoes", "http://www.goodreads.com/book/show/16207216", "http://www.goodreads.com/book/show/1022699.The_Lollipop_Shoes", "http://www.goodreads.com/book/show/2215074.The_Lollipop_Shoes", "http://www.goodreads.com/book/show/47401.Chocolat", "http://www.goodreads.com/book/show/15096.Five_Quarters_of_the_Orange", "http://www.goodreads.com/book/show/15101.Blackberry_Wine", "http://www.goodreads.com/book/show/15102.Gentlemen_and_Players", "http://www.goodreads.com/book/show/321572.Holy_Fools", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/28353727-in-twenty-years", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/20552595-how-i-became-a-famous-novelist", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats"]}