{"ratings": 5219, "userreviews": [{"userName": "Diane S ☔", "userReviewDate": "Dec 27, 2014", "userURL": "http://www.goodreads.com/user/show/4159922-diane-s", "userReview": "Catherine Ryan Hyde has the recipe down pat for writing heartwarming books, combing a group of disparate characters and forming one unit.Clementine, an embittered woman after the death of her daughter, seems to hate everything and everything. Her husband can no longer live with her nasty disposition and moves out. She is now left alone with only her late daughter's horse, Comet. A horse that is not being well looked after.Across the road, a very atypical family moves in, a new woman veterinarian and her wife, with their adopted son, and two foster children. Clementine wants no part of any of them.Soon a situation will arise that will being all these people together. Sill they manage to become friends and a whole family despite their many difference?A good look at the many things and people that go into making a family a cohesive unit. How an unbearable situation may actually become the thing that jolts a bitter woman out of her self. Loved the characters and especially loved the horse, Comet whose hoofbeats spoke to a sad teenager.ARC from Netgalley."}, {"userName": "Cheyenne Blue", "userReviewDate": "Apr 19, 2017", "userURL": "http://www.goodreads.com/user/show/7702916-cheyenne-blue", "userReview": "[ wondering how this broken kid, Star, knows so much about horses. It was revealed at the end, but it was too much, too late (hide spoiler)]"}, {"userName": "Angela M", "userReviewDate": "Dec 28, 2014", "userURL": "http://www.goodreads.com/user/show/4685500-angela-m", "userReview": "3.5 stars if I could.Before I was halfway through this book , I thought that this was maybe a predictable light weight feel good story . I was willing to go with it anyway because - well why not - feel good is good . I'm glad I stuck with it because there really is more to this story . It's about grief and healing and about how the goodness of two women who help ease the pain of loss , abuse and loneliness of their adopted eight year old son and their two teenage foster children . Throw in an elderly neighbor whose grief manifests itself as anger and dislike for everyone and everything around her, especially this family with the exception of eight year old Quinn. With alternating narratives from two points of view Jackie , one of the moms and Clementine, the mean neighbor , we discover a bit of the past . What makes the troubled fifteen year Star so belligerent and unwelcoming of Paula's and Jackie's genuine attempts to help her and make her a part of their family ? Why is eight year old Quinn afraid of having Paula and Jackie both be away from him at the same time ? Why is Mando so broken hearted over being separated with his mother? What made Clementine such a bitter woman? Their stories are heartbreaking.I loved that these women were so big hearted and that unlikely friendships have the power to heal . Of course , I loved the horse , Comet , who unwittingly brought these people together.Thanks to Lake Union Publishing and NetGalley ."}, {"userName": "The Geekery Book Review", "userReviewDate": "Dec 10, 2014", "userURL": "http://www.goodreads.com/user/show/18085485-the-geekery-book-review", "userReview": "I was stuck without WiFi when I finished The Language of Hoofbeats, and I have NEVER been more frustrated that I couldn't write my review ASAP!! A couple of my favorite books, not just by this author, but in general, are Becoming Chloe and Don't Let Me Go, but The Language of Hoofbeats drew me in, tied me up, devoured me. Making this my new number one favorite!! I had been in a car, driving for 18 hours, and picked this up at 3 am to help me ease into sleep. The next thing I knew, it was 7 and I was completely engrossed in the story, and wide awake. Books that can do that hold a special place in my heart.There isn't anything NOT to love about The Language of Hoofbeats. You get a crotchety older woman that I came to understand, an (understandably) messed up teenager that, to me, was the highlight of the story, a beautiful, neglected horse that brought out all the compassion in my soul, and a household with two moms, living in a town with small-town values. From start to finish, it's captivating. And it doesn't end with everything being storybook perfect, but it ends with everything being real-life perfect. That's one of the MANY reasons I love Catherine Ryan Hyde's writing. It's real life, real problems, real everything.Definitely, definitely go grab this ASAP!!"}, {"userName": "Elaine", "userReviewDate": "Nov 27, 2014", "userURL": "http://www.goodreads.com/user/show/13060256-elaine", "userReview": "Catherine Ryan Hyde has produced another solid family based drama that is a darn good read. Jackie and Paula have just moved to town with their adopted son Quinn and two fostered teenagers Mando and Star. As soon as they meet neighbour Clem, they begin to shake their heads and wonder if they have made the right decision. Clem is embittered; when challenged by husband Clem to name “one thing” that she likes, she cannot. Indeed, she has a reputation around town as being “the mean lady”. But it wasn’t always like that and it will take the friendship she forges with Star to help turn her around. If you have never read one of this author’s books then you will really love this one with its characterisation and depiction of a non nuclear family life. I really liked all the characters, including that of Clem because I could see behind that crusty exterior to the root cause of all her problems. If you have already read any of her books then, again, you will enjoy this read but, like me, may get a certain sense of deja-vu. The author uses a familiar formula for her: An inter-generational friendship between a crusty, reluctant older person and a younger person, from a non traditional background, both of whom have problems. The catalyst between them being an animal which will draw them together. Whilst I did enjoy this read, I would have preferred something a little different from this author, whereas it felt too similar to the last two books of hers that I read. Thanks to the publishers for the review copy."}, {"userName": "sue", "userReviewDate": "Dec 15, 2014", "userURL": "http://www.goodreads.com/user/show/7377874-sue", "userReview": "I am happy to be a regular reader and reviewer for Catherine Ryan Hydes books in the UK and the publishers always send me a copy when each book is released. This one was of no exception and I eagerly wanted to get 'stuck in' and read it.Its never hard with this authors books to jump right into the story. Its like diving into a sea and exploring your surroundings. One by one you start to unfold what is what. We have a nice little Town, everyone seems to know each other, we have a Sheriff, AND we have Clementine. Clementine is married to her long suffering husband. They had found it difficult in all the years they had been married to conceive a child. Later in life Tina is born. However, Tina didn't have the fullest and satisfying of lives and took her own life. I am mentioning this as there is a horse involved. Her parents had purchased her a horse, thinking that riding and exercise might help, having an interest. Tina looked after that horse very well, it was never once neglected. But since Tina has taken her own life Clementine cannot bear to look after the horse, she wants to, but she cannot. Her husband cleans up, he is the one that does the raking and the feeding. How can I describe Clementine? Well, if you have ever come across a complainer, a busybody, a nosyparker, someone who is constantly at the window and has opinions about \"everything\" in life and surrounding them, then you are coming quite close to Clementine and what makes her tick.Then we have Paula and Jackie who are legally married lesbians who move in across the way from Clementine. They had decided not to have children of their own but to adopt, and adopt not just any child but children who have difficulties emotionally that they feel they can help. Paula is a Vet, so she's taken over a practice there in this little town. There are no problems. Except the lady across the way ....Clementine.Paula and Jackie have one child that they went onto adopt and two children they are fostering. One of them being a girl named Star. Star figures quite a bit in this storyline. Very negatively at first.Clementine has a problem with the family, and the children, especially Star. She finds her rude and obnoxious. We have the Sheriffs involvement with several things that happen, one very serious one.We also have Clementine becoming quite ill and the 'family across the road' getting involved to look after her and what happens there.Its a well thought out, developed read that you would expect from this author.MY THOUGHTSI was intrigued about the title of this book. THE LANGUAGE OF HOOFBEATSOK, I thought, this is about a horse. I'm not really 'into' horses, I love them, just don't know much about them and never gone out of my way to learn. Was I going to enjoy this book if its about horses?Well, horses for courses! because, this fabulous author shows human nature in this book. Its not just about a horse, its about humans, its about also how animals can effect us, our emotions and also how they can help in certain situations of our lives. Everyone who has a pet knows the rewards of this!I thought Clementine was a grumpy old woman who should get a life and get her nose out of others lives.As it progressed, I did a 100% turn around. How we judge other when they appear grumpy all the time, or they don't have a decent word to say!!! well, its made me think, just what are their circumstances for acting this way, Clementine wasn't liked by any one much at all. Not even her husband. Who walked out.Can people change no matter how old they are? I also loved how Catherine Ryan Hyde made the involvement of a lesbian married couple. I am a person who says 'live and let live' and 'people are people no matter how they chose to live' I am very open minded. I like to call it, Acceptance of Life, black, white, fat, thin, tall or small. We all are the same.So this was a refreshing change to have a married couple of the same sex, its showing how that family functions.The children called them P-Mom and J-Mom, I found that rather nice. I don't want to give anymore away than I already have, but I would like to say, its a great story, its human and humane, it certainly makes you think about certain things. This author has such an insight to people, to emotions, to feelings and so can influence an readers calmness when reading or excitement, even indifference and then.....understanding.I would like to emphasis, because I am a regular reader for Catherine Ryan Hyde via her publishers sending me the books, it doesn't mean I HAVE to like them, I am honest, open and direct, but kind.I really don't have a downside to this book at all, its all good."}, {"userName": "Richard", "userReviewDate": "Nov 28, 2014", "userURL": "http://www.goodreads.com/user/show/26160256-richard", "userReview": "I really enjoyed this book about a vet and her wife, their adopted son, two foster kids and the cranky lady across the street. I think one of the author's repeated themes in her novels is that it takes a village to raise a child. Sometimes things don't turn out the way you expect--you just have to love as best you can and hang on for the ride. This is a good novel for horse lovers, parents and cranky people of all ages."}, {"userName": "Melissa ♥ Dog/Wolf Lover ♥ Martin", "userReviewDate": "Nov 29, 2014", "userURL": "http://www.goodreads.com/user/show/17438949-melissa-dog-wolf-lover-martin", "userReview": "Let me just say this is another wonderful tear jerker and feel good books by an amazing author! I don't even know where to start!! Jackie and Paula are a married couple that take in foster kids. They have adopted the youngest, Quinn and fostering Mando until his mom gets out of jail for something she didn't do. Then there is Star, whom they have had for a short period and is chaos on legs. She comes from a bad home so that is no surprise. There are a few SPOILERS coming up. Paula uproots this little family to another town where she will have a more successful large animal veterinary business as the old town is inundated with them. Oh and they have a bunch of dogs and cats :-) They move in across the street from Clementine and Vernon who own a horse named Comet. They used to have a daughter Tina that they bought the horse for in hopes of helping her with her mental illness. Sadly to say it only lasted so long as Tina commited suicide by hanging herself in the barn. Star invites herself over to visit Comet. This doesn't sit well with Clementine who dislikes everyone since Tina. I don't want to give away any more but let's just say this is a book where a lonely horse finds love again. Lonely people find bonds in each other. I would recommend this book to anyone that loves helping animals and people. There are two big quotes from the book that I'm going to add because they mean so much to me and since I have mental illnesses I feel they deserve a place in my review. QUOTE FROM BOOK:\"My daughter was mentally ill, \"I said.\" So I know. It's an illness, just like it says in the phrase. It's not a moral failing. It's funny how people have empathy for physical illness. They see it as bad luck, and never question whether you can help it. But mental illness we still treat with shame.\" QUOTE FROM BOOK: If you meet someone you don't like, or who doesn't treat you right, try to reserve judgement, because you don't know what that persons going through, and it's probably not so much about you.\" Spectacular book! Spectacular author!"}, {"userName": "Carole", "userReviewDate": "Jun 25, 2014", "userURL": "http://www.goodreads.com/user/show/7630646-carole", "userReview": "4.5 stars From the first chapter I was hooked. Catherine Ryan Hyde is one of my favorite authors. She writes stories that are rich in characters who are flawed, but ones you come to deeply care for. Her stories usually center on a child who is needy, but not pathetic. This is no different as it is about a same sex couple, Paula and Jackie who are foster parents for 3 children. They have recently moved in next door to Clementine, a cranky older woman who has a huge chip on her shoulder, and her husband, Vern. Clem is constantly unhappy, and endlessly complaining. Star is the teenage foster daughter of Paula and Jackie, who takes interest in Clem's neglected horse. The two families will have conflicts and will learn to sort them through. This is a book that will remind you that there is good in everyone, that people can change, and sometimes the most unloveable are the ones who need love the most. It would be a good bookclub read, and one that leaves much to ponder. I wasn't sure I would be comfortable with a same sex couple relationship, but Catherine Ryan Hyde writes so beautifully and in good taste, it was a wonderful book I would very highly recommend.I won this book on her blog, and I'm so very thankful to her for the chance to read it before it is released in December. You'll want to add this to your list to pre-order!!"}, {"userName": "Lady Avalon", "userReviewDate": "Aug 06, 2017", "userURL": "http://www.goodreads.com/user/show/36672917-lady-avalon", "userReview": "3,5 rounded up"}, {"userName": "Joan", "userReviewDate": "Dec 09, 2014", "userURL": "http://www.goodreads.com/user/show/6004901-joan", "userReview": "‘The Language of Hoofbeats’ is a wonderfully involving story about the riches and sorrows of family life. Jackie and her wife Paula move to a quiet location near the small town of Easley with their young adopted son Quinn and two teenage foster children, Armando and Star. Across the yard from them are their nearest and only neighbours, elderly Clementine and her husband Vernon. They have a beautiful horse called Comet, kept in a small enclosure just across the yard from their front door. Star, their troubled and lonely foster daughter immediately identifies with Comet’s isolation and frustration and pays him a visit, but Clementine is furious with her and demands that she does not visit him: he is highly strung and therefore she could get hurt. Clementine loathes the new family and is mean-spirited, grumpy and unhappy.Jackie has relocated her family to further her career as a Veterinarian, taking over the local practice. She offers to inspect Comet when she hears how worried about him Star is. She wants to find out why he is pacing and is so unhappy. Although Clementine accepts the generous offer of a free consultation, she is still unwelcoming, and, when she is told that Comet needs treatment, she is unable to apply the medication herself. Star takes matters into her own hands and decides to run away with Comet, escaping in the dead of night, unable to stand the thought of Comet’s suffering. Thrown together by the disappearance of both Star and Comet and the worry it entails, the neighbours form an uneasy relationship, forcing themselves to put aside their animosity and practising the art of forgiveness and tolerance.Catherine Ryan Hyde is a masterful storyteller. Her natural empathy and turn of phrase is second to none: her characterisation full of insight and intricacies that totally draw the reader into the story, thereby reaping the rich rewards of her fabulous new novel. I thought this was one of her very best and I have read them all apart from a very few of her novels written for young adults that I have yet to collect. When I was offered the chance to read and write an honest review of ‘The Language of Hoofbeats’ by Netgalley and on behalf of Lake Union Publishing, I was really excited. Congratulations Catherine on a yet another very fine novel. I absolutely loved it. My own background involves a love of horses and horseback riding, so for me I fully understood Star’s bond with Comet. I can highly recommend this novel – it’s an absolute must-read but have your tissues at hand as there are some very emotional scenes."}, {"userName": "Judy Collins", "userReviewDate": "Nov 06, 2014", "userURL": "http://www.goodreads.com/user/show/11063006-judy-collins", "userReview": "A special thank you to Lake Union Publishing and NetGalley for an ARC in exchange for an honest review. Catherine Ryan Hyde delivers THE LANGUAGE OF HOOFBEATS, an emotional story of regret, forgiveness and love. As always, Hyde explores non-traditional families, with flawed characters—offering a strong heartwarming message and takeaway of triumph over tragedy. Paula and Jackie Archer-Cummings are a legally married lesbian couple who have adopted one child, Quinn, and fostering Starr and Mando, plus dogs and cats. Pat is a veterinarian and her wife, Jackie is a stay at home mom. They are moving from their home in Napa Valley to a rural town in Northern California.Starr, their fifteen year old foster teen (has only been with them for three weeks), is angry and rebellious and when they move to the new location, she falls in love with the beautiful horse, Comet, who is owned by a neighbor. She feels he is suffering from neglect and is very protective.The neighbors, Clementine and Vernon had a daughter who died, Tina; Comet is the only thing they have left of their daughter. Clementine is an angry, nosy, bitter, narrow-minded, mean and miserable woman. She takes out her frustration on the couple and their children; complaining about their lifestyle and children, and demands them to stay away from her horse. Star takes Comet and runs away, and this of course, adds fuel to the fire, for Jackie/Paula, as Clementine is furious and they in turn, are concerned for their daughter. What happens during and after is a life learning lesson, which pulls everyone together. A heartfelt and poignant story with lovable and not so lovable characters. I enjoyed the relationship of Paula/Jackie and loved the J-Mom/P-Mom, hearing from alternating voices of Clementine and Jackie. A huge fan of Hyde, would recommend all her books, as enjoy how she crosses multi-generations, making her books appealing to all ages and crosses a mix of genres, from young adult, coming of age, women’s fiction, contemporary, LGBT, suspense, and family drama. If you enjoyed this one, would recommend Take Me With You,  one of my favorites.  Judith D. Collins Must Read books"}, {"userName": "Holly Weiss", "userReviewDate": "Nov 27, 2014", "userURL": "http://www.goodreads.com/user/show/3455463-holly-weiss", "userReview": "Twenty minutes into a Catherine Ryan Hyde book and I am engaged and relaxed. Her talent for bringing disparate groups of people together and forming a bond between them is well established. Her characters are flawed, but grow through their relationships with others willing to walk outside of their own backyards. She creates un-conventional, intricate families. Her prose is clean. Her stories ramp up quickly coalescing into touching and emotional situations.The Language of Hoofbeats brims with warmth and compassion. Jackie and Paula, a lesbian couple, move to a quiet town with their adopted son, Quinn, and two foster teenage children, Armando and Star. Paula, a veterinarian, hopes to set up a large new practice in Easley, CA. Jackie mourns their departure from their beloved Napa Valley. Their elderly neighbor owns a horse, Comet. Troubled Star bonds with the horse, bringing about unusual circumstances. Star and Comet play pivotal roles in bringing Clementine together with her new neighbors. The book is narrated in the first person, alternating between Clementine and Jackie. Each individual’s past and it’s bearing on their present situation is sympathetically written. Unusual partners team up to protect the innocents, as with many of Hyde’s other books. I’ve read six Catherine Ryan Hyde books and can attest to the worth of each one. Highly recommended.I thank Netgalley for the advance review copy provided for my unbiased opinion."}, {"userName": "Vannetta Chapman", "userReviewDate": "Jul 31, 2016", "userURL": "http://www.goodreads.com/user/show/3927146-vannetta-chapman", "userReview": "CRH is quickly becoming one of my fav Authors. Her books are quick reads, engrossing, and leave me thinking about the characters long after I.ve reached the last page.This book is first and foremost about foster kids and foster parents.Secondly it is about those sandpaper people in our lives that we avoid.It bears to mention that this book is also about same sex marriage, but it is gently and authentically woven through the story with the result that you are first and foremost reading about people and kids and families. For some readers who would rather not read about such, I recommend you try a different CRH book. As for myself, I found it to be a lovely, compassionate, intriguing read."}, {"userName": "Leah", "userReviewDate": "Nov 18, 2014", "userURL": "http://www.goodreads.com/user/show/2641242-leah", "userReview": "Catherine Ryan Hyde has been one of my favourite writers since I read When I Found You back in 2009. Since then I've read all of her subsequent novels, bar one and she's an author whose books I look forward to - she writes such compelling novels about families you love to get to know, and situations that should be dire but somehow end up working out for the best, and I think it takes quite an author to manage that, and she nails it each and every time.\n  The Language of Hoofbeats is one of the most compelling books this year - and that says something, considering I've already read two other Catherine Ryan Hyde books this year. All the same, but all so different, if that even makes sense. In The Language of Hoofbeats, we meet a family - Paula, Jackie and their adopted/foster kids Quinn, Star and Mando. They're moving to a new place, for Paula's work, and immediately offend their neighbour Clementine when Star takes a liking to Clementine's horse, Comet. The two end up running away together, and it somehow bonds the neighbours together, which when you first meet Clementine, you'll hardly believe.There is something about Catherine Ryan Hyde's writing that gets me time and time again. Novel after novel, I end up caring so, so much about the characters and getting to meet Paula and Jackie and their kids was such a pleasure. It's so nice that Catherine's novels always foster the best of a bad thing - Quinn, Mando and Star have all had rough lives, but they get a second chance with Paula and Jackie; Clementine is an angry, angry person, but despite that, Paula and Jackie don't just leave her to rot by herself; there's always hope, even when you feel it's lost. I especially liked how it was young Quinn who helped Clementine to see the error of her angry ways. He was so perceptive, so intuitive, so honest where adults would not be.It's a relatively simple novel, as novels go. No complicated love story, no useless fighting or threats, and I was so absorbed by the novel. I'm a dog owner, but I'm not one for thinking animals can talk, but I loved the relationship between Star and Comet. It just felt right.\n  There's nothing for me to write here. I spent over a week reading the novel due to work getting in the way (pesky work), and I just loved coming back to it, time and time again. I just wanted to sit in a corner and get to its conclusion as fast as I possibly could, and take it all in.\n  I loved it. What else? I love everything Catherine's written that I've read. She can make me feel things no other authors can feel, and write stories that are so simple but so absorbing. I was taken in from the very beginning and, sure, Clementine wasn't the easiest character to love, but there was just something about her that was so compelling. Yes, she was mean, but she was also clearly hurting and using her meanness as a coping mechanism. And as for Jackie, Paula, Star, Quinn and Mando, I adored them completely (although perhaps I was wary of Star, she never really gave herself away), especially young Quinn. Catherine Ryan Hyde writes kids SO well and always manages to make me want to take them home with me. I now sit, waiting patiently, for her next novel...{Leah Loves} http://leah-loves.com http://leah-loves.com/language-hoofbe..."}, {"userName": "Tara - Running 'n' Reading", "userReviewDate": "Aug 21, 2014", "userURL": "http://www.goodreads.com/user/show/22612431-tara---running-n-reading", "userReview": "Let me first say that if you are looking for an exciting page-turner, this is not the book for you. If you are looking for a story that highlights the complexity of human relationships, told through some intensely flawed yet relatable characters, then look no further. In addition, the story includes some powerful and challenging topics: two of the main characters are a legally married lesbian couple who foster children; there are instances of mental illness and suicide, as well as judgement and forgiveness.Due to some challenging circumstances in my own past, I found that I could easily relate to the characters in this novel; I even had a soft spot for the battle axe neighbor, Clementine, who really helps demonstrate the fact that our family are the people with whom we choose to spend time, not necessarily the people who had a hand in creating us as human beings. The novel is narrated by members of the \"cast\" of characters; the chapters alternate narrators back and forth, yet the transitions felt seamless. I appreciated Catherine Ryan Hyde's sensitive, and often comical, treatment of emotional issues and challenges within the story; she has a masterful way of opening our minds to the development of these characters through a simple, honest and beautiful tale. This is definitely a story that will stick with me and I felt very connected to both the characters and the outcome. Even though I was not ready to leave this \"family\" behind, I was pleased with the ending and have already recommended this one to several friends."}, {"userName": "Marcee Feddersen", "userReviewDate": "Jul 28, 2014", "userURL": "http://www.goodreads.com/user/show/3963830-marcee-feddersen", "userReview": "http://anurseandabook.blogspot.com/20...I had previously read \"Don't Let Me Go\" by Catherine Ryan Hyde and I loved it. So when I was offered a copy of her new book, \"The Language of Hoofbeats\" by Net Galley in exchange for an honest review, I was pretty happy about it.I read it in under four hours as I flew across the country. Her books always deal with the most vulnerable population - children. In this book, a same sex couple has three foster children, one of whom they have adopted.They move into a small town with across the street from a bitterly unhappy old woman. As they become entwined in each others lives, they begin to forge a bond that has the children as their common bond.I love that her books don't always show a perfect solution, as these situations don't usually come with fairy tale endings. People show their imperfections, their petty emotions, jealousy, anger, and just general assholed-ness. But it is written in a way that shows that no one is truly all good and no one is truly all bad. Just like real life.Great book - definitely keeps you hooked."}, {"userName": "Nenette", "userReviewDate": "Jun 25, 2017", "userURL": "http://www.goodreads.com/user/show/2156661-nenette", "userReview": "There are books over which Netflix won my time; not any of Catherine Ryan Hyde's though, not once. Such good books are quick reads, no matter how much effort I make in taking my sweet time to read, ever so slowly. This story is not so much about the horse, but him as an instrument to bridge gaps between people, neighbors. Some ties are just too broken to mend, but most can still be put back together, with openness, communication, an honest self-assessment and acceptance, the willingness to change,love, and time.These are the timeless topics that Ms. Ryan Hyde is so very brilliant at expounding into beautiful stories. I don't think I'll ever tire of reading her books."}, {"userName": "Connie", "userReviewDate": "Aug 05, 2017", "userURL": "http://www.goodreads.com/user/show/6257447-connie", "userReview": "A horse, foster parents, neighbors, troubled teenPut them all together and you have an interesting plot driven by obvious conflict. The writing is pretty straightforward; the author spells everything out for the reader so you can't miss a character trait or symbolism. There was an interesting plot twist at the end, but it still felt all too tidy and tied up. With that said, I still liked the story, and would give it 3 stars."}, {"userName": "Cathie", "userReviewDate": "Jun 08, 2017", "userURL": "http://www.goodreads.com/user/show/12090607-cathie", "userReview": "Good story about a foster family moving across the road from a crotchety lady and the bond the teenage girl makes with the lady's horse. The story line is predictable but it was a quick nice read. (Hallmarkish feel good type of read)."}, {"userName": "Teddie", "userReviewDate": "Mar 04, 2016", "userURL": "http://www.goodreads.com/user/show/24412506-teddie", "userReview": "This book will make the time go by much faster while on the treadmill! Maybe it's just a matter of reading the right book at the right time, but I loved this book. It's a heartwarming story about a nontraditional family dealing with the challenges of foster children, and the curmudgeon who lives across the road.Not everyone is going to like this book. I read the 1 and 2 star reviews. In most of them, the reviewers were offended that two of the main characters were a lesbian married couple. To be clear, there is no sex in this book. Absolutely none. No sex, no profanity, no violence. But for those offended by gay characters, please pass up this book.For everyone else, this is a heartwarming story about a couple (Jackie and Paula) who move with their adopted six year old son and two foster children to a home in the country. A troubled teenager named Star, recently placed with them, is immediately drawn to the horse owned by the disagreeable neighbor across the road (Clementine). Star repeatedly sneaks into the stable in spite of Clementine demanding the foster parents keep Star away. And then, both the troubled teen and the horse disappear. And the curmudgeon begins to see things from a different perspective.Admittedly, this story reads like a Hallmark movie. (Another complaint made in the negative reviews.) Yes, it could be considered by some to be \"sappy\". But once in awhile, that's just what the doctor ordered. If nothing else, this book will make the time go by faster while on the treadmill. And that's worth 4 stars in my book!"}, {"userName": "Melinda", "userReviewDate": "Dec 17, 2014", "userURL": "http://www.goodreads.com/user/show/30751354-melinda", "userReview": "The story is told by two very different women, Jackie and Clementine and their individual perspectives. Characterization of these two women is outstanding as well as the development of other significant characters. Hyde allows the characters to slowly unfold, their thoughts, emotions and feelings on full display. You understand their flaws and qualities, fears and confidence, scars and strengths. Well sketched driving the story along with multiple themes. Hyde touches on attitudes and consequences battling diversity and negativity. She doesn't 'change' her characters, rather she allows them to evolve, become self aware striving to improve. Delicately she molds awareness and acceptance in a constructive manner. The way Jackie and Paula 'deal/dealt' with issues along with parenting was well done demonstrating their characters flexibility in thinking given alternative mindsets. Both ladies complimented each other wonderfully. My only qualm, highly predictable, nonetheless enjoyable. A profoundly gentle story of love, loss, grief and acceptance, each characters story unraveling a colorful tapestry of varying and affecting circumstances touching the reader. A wonderful read for all ages."}, {"userName": "♥ Sandi ❣\t", "userReviewDate": "Aug 08, 2014", "userURL": "http://www.goodreads.com/user/show/4984609-sandi", "userReview": "This is an author that massages you, relaxes you, and lowers your blood pressure. Her method of writing is to the reader what a warm bath is to an aching body.A very good story about a same sex married couple who fosters children - usually with very good luck - until they come across Star. As they try working on Stars problems they move across country and settle in Wyoming on a ranch. Their closest neighbor is not neighborly. She is going through her own personal problems and has never had to work on her own personal prejudices. While all this is going on Star steals the neighbors horse - Comet - because she feels the horse is abused, and she is very unhappy living with her foster parents.What transpires from there is the healing of loneliness, the understanding and appreciation of different life styles and of different beliefs and longings. Love shines through as healing takes place."}, {"userName": "Rebecca McNutt", "userReviewDate": "Dec 07, 2016", "userURL": "http://www.goodreads.com/user/show/36977686-rebecca-mcnutt", "userReview": "Jackie and Paula, a married lesbian couple with dreams of a quiet ranch life in a small town community with their family, move into a rural place and are treated well by pretty much everyone... except Clementine. Clementine is a busybody who disapproves of the unconventional but caring and supportive family, mainly Jackie and Paula's obnoxious, emotionally troubled foster daughter, Star. When Star becomes attached to a neglected horse that had belonged to Clementine's deceased daughter, Clementine is infuriated. But will this horse be the one thing that can connect everyone closer together? The Language of Hoofbeats is a very inspirational, original and amazing story with so much to offer, and I really enjoyed reading it."}, {"userName": "Tucker", "userReviewDate": "May 31, 2016", "userURL": "http://www.goodreads.com/user/show/308912-tucker", "userReview": "A couple prickly women, one three times the age of the other, bonding around their mutual interest in a horse. More touchy-feely than I usually go for. Some hard edges give good texture to the characters' lives.I like this: “Bunch of grown-ups all sitting around discussing what’s best for the horse. But nobody asks the horse.” Less so when another character asks, \"Think that was a metaphor?\" and then the horse is beaten to death: “Like the way a poor foster kid must feel just about every day of her life. I didn’t answer the question of whether I thought it was a metaphor, because it seemed like an unanswerable question. It probably was, whether Star had consciously meant it to be or not.” OMG, you do some of the writing, I do some of the reading, we meet in the middle, please."}, {"userName": "Kelly", "userReviewDate": "Oct 04, 2014", "userURL": "http://www.goodreads.com/user/show/9936139-kelly", "userReview": "I received an advance copy of\"The Language of Hoofbeats\" by Catherine Ryan Hyde from NetGalley in exchange for an honest opinion. I would give this book 3.5/5 stars. This is the first book I have read by this author. I would call this book a comfortable read, enjoyable but nothing truly exciting or exceptional. The story centers around a family of two moms, two foster children and one adopted child. They move next door to Clementine, a woman who is alone and angry, having lost a daughter and now a husband. Star, one of the foster children, falls in love with the neighbor's horse. Star disappears with the horse, and Clementine is forced to interact with the family far more than she wished."}, {"userName": "Nancy Silk", "userReviewDate": "Feb 19, 2016", "userURL": "http://www.goodreads.com/user/show/7140636-nancy-silk", "userReview": "\"A Very Engaging Story\"This is a very worthy story to read. It's another very moving story of doing good works ... even when it can be difficult. Author Catherine Ryan Hyde is the writter of \"Pay It Forward\" which was made into a wonderful, popular movie by the same name. In this story two women have adopted one 8-year old boy and are fostering to teenagers, one of which is Star, a girl with an attitude and is strong willed. This is a very revealing story of how those who live in a small town hold no secrets. This is a story of bringing out the best in argumentative and prejudiced people. I'm honored to read this story as it can have an impact on all our lives as to how we treat others and also how some people treat us. Great story, very worthy."}, {"userName": "D. Leigh", "userReviewDate": "Jan 23, 2015", "userURL": "http://www.goodreads.com/user/show/3170225-d-leigh", "userReview": "Downloaded this from audible.com and enjoyed it. The narrator was very good and the story captivating and often angst-filled. Although the couple in the story were lesbians, their relationship seemed pretty sterile to me ... they seemed to operate more like good friends than lovers, each doing their own thing most of the time. It makes me wonder if heterosexual marriages are like that. But the story wasn't really about them. The relationships with the neighbor and the the kids were well developed and interesting. Overall, a satisfying story with a satisfying ending. I'd still recommend it despite the part I felt was a bit lacking."}, {"userName": "Lee", "userReviewDate": "Dec 24, 2014", "userURL": "http://www.goodreads.com/user/show/14403461-lee", "userReview": "This is a very enjoyable read. I really like the author's conversational writing style and the tempo of her books, which move along at a good, steady pace. She quickly developed her characters and it is easy to identify with their feelings and behaviors. That said, there is a consistent underlying theme throughout all three of her books that I've read thus far. It is one of broken, isolated people who encounter someone who is also damaged; together they crack through their brittle exterior defenses. For that reason, reading one too soon after the other can be less enjoyable than if you allow time and a good change of pace in between."}, {"userName": "Tara", "userReviewDate": "Jun 05, 2015", "userURL": "http://www.goodreads.com/user/show/8216709-tara", "userReview": "This is a beautifully written book. I was surprised that I was hooked in the first chapter. It is a touching, heartfelt read. The author tackles more than one tough topic. I had tears running down my face more than once. I'm not an overly emotional person, so that should say a lot. Books don't often make me cry. Maybe tear up, but this one is so moving. I smiled. I giggled. I felt deep for each main character. As they all seemed to be main characters. The author weaved everything together, everyone's story perfectly. Truly a satisfying read. When I finished I felt as it ended the way it should for all involved in the story."}], "description": "From the bestselling author of Pay It Forward comes a story of the heartbreak and healing power of family. New to a small town, Jackie and Paula envision a quiet life for their kids: a young adopted son and two teenage foster children, including the troubled Star. However, they quickly butt heads with their neighbor, Clementine, who disapproves of their lifestyle and is incensed when Star befriends her spirited horse, Comet. Haunted by past tragedy and unable to properly care for Comet, Clem nevertheless resents the bond Star soon shares with the horse. When Star disappears with Comet, the neighbors are thrown together—far too close together. But as the search for the pair wears on, both families must learn to put aside their animosity and confront the choices they’ve made and the scars they carry. Plumbing the depths of regret and forgiveness, The Language of Hoofbeats explores the strange alchemy that transforms a group of people into a family.", "title": "The Language of Hoofbeats", "url": "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "average": 4.09, "cover": "https://images.gr-assets.com/books/1397735872l/21942189.jpg", "reviews": 415, "authors": [{"url": "https://www.goodreads.com/author/show/126447.Catherine_Ryan_Hyde", "name": "Catherine Ryan Hyde"}], "type": ["Fiction", "Animals", "Lgbt", "Animals", "Glbt"], "outlinks": ["http://www.goodreads.com/book/show/215631.Pay_It_Forward", "http://www.goodreads.com/book/show/6780660-when-i-found-you", "http://www.goodreads.com/book/show/19355355-take-me-with-you", "http://www.goodreads.com/book/show/30184217-say-goodbye-for-now", "http://www.goodreads.com/book/show/33389838-allie-and-bea", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/28353727-in-twenty-years", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/20552595-how-i-became-a-famous-novelist", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy"]}