{"ratings": 8995, "userreviews": [{"userName": "Marie", "userReviewDate": "Feb 12, 2018", "userURL": "http://www.goodreads.com/user/show/51069187-marie", "userReview": "This novel, published when Poitier was 73, is a philosophical reflection of his life, his accomplishments, and what makes for a life well lived in his opinion.  It is also about race, integrity, grit and perseverance.Poitier was born on Cat Island, a tiny island in the Bahamas.  He was not aware of the color of his skin or what significance this would have on his life while on Cat Island.  Indeed, there was not even a piece of glass that would have showed him his reflection in his childhood home.  He lived a life of simplicity on the Island, with routines that could be counted on.   It wasn't until age 10, when his family moved to Nassau that he saw his first automobile.  In Nassau, Poitier was swept up with a grew of kids that stole and he narrowly escaped going to jail.  His parents sent him to the US to live with one of his brothers and his family.  He began working as a dishwasher, but ended up auditioning for a role in a play.  He was told that since he didn't read, he should work as a dishwasher or something.  He had never seen anything shameful in his work up until that point.  After that, a Jewish man began to teach him to read every night after work.  He worked hard and took acting classes drawn with a passion to acting from the start.Poitier discusses the roles he was offered and refused because he did not feel the characters' actions portrayed integrity.  He discusses  his feelings about being black and outsider in America.   He talks about his close friends, with whom he was often asked to sign an paper not to socialize with, because of their progressive views.  Of course, he always refused.  He speaks about how his value system, sense of self and integrity formed at an early age in a life of simplicity and how this grounded him.  He let his ideals and strength of character guide him, even if this meant refusing a role and going hungry.He talks about the movies he was part of, the actors he becomes friendly with, and his rise to fame, and the breaking of so many race barriers along the way.  He speaks about his family, and his relationships with his two wives and children.He is a gifted actor, writer and speaker.  To hear him reflect upon his life within which he overcame such adversity is inspirational.  One point that came through loud and clear in all of this was that now that are lives are more complicated and enriched in media, we have lost the simplicity that leads to quiet and profound reflection.I'm not a big consumer of celebrity memoirs, but was challenged to read this as part of Book Riot's 2018 Read Harder Challenge.  Sidney Poitier is a brilliant actor whose movies I've very much enjoyed and I was so pleased to get to know the man behind the actor in this memoir.  I listened to the audio version, narrated by the author which has won numerous awards, as he is such a gifted speaker.  If you decide you are interested in this book and are wanting to learn more about this charismatic, talented man I would highly recommend listening to the audio version."}, {"userName": "Carla", "userReviewDate": "Jun 19, 2008", "userURL": "http://www.goodreads.com/user/show/1206987-carla", "userReview": "I went into this book with the highest of hopes and an open mind. My mother LOVES Potier and said she really enjoyed it and we tend to agree on most books. But part way through, I felt frustrated and a bit annoyed with him.A recommendation on the jacket says that reading this book is like having a conversation with a vanerable older relative, and I agree. There are moments when his insights on life and sprirtual aspects are interesting, and I found myself wanting to remember quotes for future use. But, for the most part, it feels like an older relative giving the usual \"in my day kids were better\" speech to the next generation. While I agree that kids today are too addicted to their play stations, it's unrealistic to say that they would be better off growing up frolicking in the forest as he did as a child. There is no arguing that Potier is a legend and that he overcame incredible odds to find his place in American Cinema. But the writing comes off a bit cocky, not sure if that is the ghost writer of if it's the tone of his speech or what, and I felt a bit like I was being preached too while reading it."}, {"userName": "SunnyD", "userReviewDate": "Jun 14, 2007", "userURL": "http://www.goodreads.com/user/show/131774-sunnyd", "userReview": "i am cheating and listening to the audiobook, not reading this. but trust me when i tell you, reading it is not the way to go. and this comes from someone who never does audiobooks. but the book is written like it's just what SP was saying in a conversation with a ghostwriter (who would've/should've then turned around and put it into a much easier to read format!). it's hard to follow and doesn't flow.but the audiobook is great. SP's voice is so soothing and wonderful. such lilt and timbre. i love listening to him...it's like a bedtime story. ;-)"}, {"userName": "Nancy", "userReviewDate": "Aug 20, 2012", "userURL": "http://www.goodreads.com/user/show/1001746-nancy", "userReview": "I had the good fortune to listen to Poitier speak a few years ago at a conference. He was a last minute stand-in for someone who probably was considered more \"current.\" How lucky we were to have gotten to hear him speak instead. He moved a room of hundreds to tears, recalling \"snapshots\" of his life in the Bahamas, Miami and New York. His talk inspired me to check out this audiobook, which was equally moving. Many of those \"snapshots\" can be heard in extended form in this book. Poitier's voice is charming, emotional, and unmistakable. I can't imagine anyone else having read this out loud. It was truly like he was sitting in the car with me, what with his well-timed chuckles, growls and--my favorite-- the \"you know?\" scattered throughout. A true actor and artist.Just skip the last 3 chapters. :-) Boring!"}, {"userName": "Evan", "userReviewDate": "Jun 27, 2009", "userURL": "http://www.goodreads.com/user/show/1248986-evan", "userReview": "In summation, the wise old actor tells us: Life is hard and full of contradictions and you gotta have hope.There. I've just saved you some time and possibly money.I realize that saying anything bad about Sidney Poitier and what he might have to tell us in this book is probably tantamount to pissing on apple pie, so before I do that -- and assuming you do like your pie sans urine -- I want to say what's good about the book because there are quite a few things that are.The book is a fast read, pleasant and mostly enjoyable. Quite frequently Poitier offers nuggets of wisdom and observation and insight culled from his life as an actor, as a boy living in tropical poverty in the Bahamas, as a father and erstwhile outsider, and as a black man hellbent on breaking through the glass ceiling in a racist culture. In fact, his memories of his boyhood are quite evocative.The problem with the book comes when we ask ourselves what we look for and expect in an autobiography. How confessional do we want it to be? And, if it is not a warts-and-all, kiss-and-tell book -- which I can tell you, this ain't by a mile -- then can we consider the philosophical musings as an acceptable substitute, as surrogate indicators of who a person is and what his life has meant? Possibly, and yet, this book left me wanting to know more about the \"dark side\" of Sidney Poitier (or at least more about his career); it's something he alludes to near the end of the book but he completely fails to give specifics or elaboration. To read this, the worst thing he ever did was steal corn as a kid. I mean, everybody has fucking done that!To his credit, Poitier mentions how he is ever mindful of his public image, and that he has always maintained it by selecting films with humanitarian themes and uplifting and dignified roles, and also by living true to a moral credo. But, apart from that, he never indicates how much of who he really is is public image and how much of him isn't. Poitier is very evasive about huge chunks of his life. We learn very little about his marriages and love lives, scant bits about his children, and not much about life in Hollywood. His stints at direction are nary mentioned. We do learn about his struggle with prostate cancer (a little) and about some scary moments where he came close to death or run-ins with angry racists and others. But by the end, I feel cheated by a memoir that would pass the approval of a Hollywood publicist, which this would, easily.The book is frequently repetitive as Poitier explores his primary theme of the domestic and cultural forces that shaped his life and attitudes. It seems as though he finds 20 different ways to more or less say the same things. In lovingly evoking the stern discipline of his parents, Poitier finds himself on shaky ground, saying great things about their caring usage of corporal punishment, for instance, in contrast to the supposedly poor parenting styles of today. I never felt quite persuaded by that.A year or so ago I read Bob Dylan's Chronicles and it too was a non-traditional memoir. Like Poitier, Dylan tends to muse and wax philosophical and forego a lot of typical biographical detail. However, I gave Dylan's memoir five stars. The difference between these two books is that Dylan won me over by being funny, not taking himself too seriously, and by delighting and surprising me in every paragraph. Poitier just doesn't do those things here.I realize Mr. Poitier is too cool for the room, but I can't decide if the usage of so many conversational questions at the end of paragraphs (\"You know?\", \"You follow?\", \"Does that make any sense to you?\") is charming or annoyingly offputting. Since I'm posing the issue, I suppose it's the latter. You dig?And then there's that sappy humorless sense of self-righteousness. You know the kind. I call it \"pandering patriotic highmindedness.\" You hear it when Tom Hanks or Gregory Peck narrate documentaries or the way that talking heads sing songingly lower their voices invoking some moment of American history in a Ken Burns film, or when Burns himself sappily invokes the greatness of our great land in promos during PBS pledge drives. And I won't even mention politicians. This book has a bit too much of that high-toned pandering and self importance.So, rather than calling this an autobiography or even a memoir, we might better call this a \"palette of personal musings.\" All in all, this was a genial, mostly enjoyable ramble. But if you want to know the whole story of Sidney Poitier, this ain't the place to go."}, {"userName": "Melanie Mole", "userReviewDate": "Aug 15, 2016", "userURL": "http://www.goodreads.com/user/show/57372902-melanie-mole", "userReview": "Sidney Poitier is one of my favourite actors because of his integrity as a person first and foremost. This book tells the reader about the struggles he had on his way to his acting career, of which there were many. Throughout this book his manners, ethics and integrity shine through. He shows us how men think, and how they can choose to overcome any obstacle put in front of them. This reminds me of times gone by which is also one of the reasons that I like it. Thank you for this book Sidney!"}, {"userName": "Stacy", "userReviewDate": "Dec 11, 2017", "userURL": "http://www.goodreads.com/user/show/55502227-stacy", "userReview": "I was kind of surprised by this book. After I learned that this had won the Grammy for the spoken word recording in 2001 (I think that was the year) , I was even more intrigued. I had always liked Mr. Poitier as a talented actor, and I was looking forward to reading his own thoughts. The book was not so much about his Hollywood career (I guess there is a previous book he had written that delves more into that), though he occasionally touched on some aspect of that when he deemed relevant, but more about his upbringing and his thoughts about things in the world and life. I found it very interesting to read his personal views on a wide variety of subjects, and I gained more respect for him as a person. Although I did not agree with some of his religious views, I admired his character, honesty and depth. Now I wish to seek out his other book to read more about him."}, {"userName": "Kate Padilla", "userReviewDate": "Mar 31, 2010", "userURL": "http://www.goodreads.com/user/show/1168473-kate-padilla", "userReview": "Sidney Poitier performs magic in The Measure of a Man. Only true nobility can write the personal history and experiences of a 70-something black man from the Bahamas with such power to speak profoundly to a 22-year old white girl from Grand Rapids. The same page will draw the reader to tears both from laughter and from sorrow. At 243 pages, Measure is not difficult, which makes reading from cover to cover relatively easy in one sitting. What's most powerful about Poitier's \"spiritual autobiography\" is that he's not trying to manipulate the reader one way or another. It's entirely possible to be completely changed by the end and yet leave the book disagreeing with him in some areas no less than at the beginning. He doesn't expect his readers to agree with him, he's simply telling his story. And an interesting story it is. As a boy, Poitier lived in an intense poverty, but this poverty was nothing like anyone in America would understand. He says in the first chapter, \"In a word, we were poor, but poverty there was very different from the poverty in a modern place characterized by concrete. It's not romanticizing the past to state the poverty on Cat Island didn't preclude gorgeous beaches and a climate like heaven, cocoa plum trees and sea grapes and cassavas growing in the forest, and bananas growing wild\" (3). Through his journey from Cat Island to Florida to New York to Hollywood, Poitier never lost the sense of self given to him by his parents, especially his father. This is possibly one of the most profound themes of the book: the identity instilled by a parent to his son. This dignity guided him through the roles that he chose, or didn't choose, as well as how he saw his success in Hollywood and even the industry of Hollywood itself.Any reader, once reading this book, will understand the privilege just experienced from Poitier opening the door, even if only slightly, to his life and the influence his father had on him and, consequently, the entire American film industry."}, {"userName": "Julia Grundling", "userReviewDate": "May 04, 2010", "userURL": "http://www.goodreads.com/user/show/3326351-julia-grundling", "userReview": "i've been wanting to read this book for many years. i saw an interview with sidney poitier on oprah once, and he made such an impression on me. and wow - what a book - and what a man. from humble beginnings to hollywood - and he's still humble. one of those books that will leave you thinking ... i absolutely love this quote:“we're all somewhat courageous, and we're all considerably cowardly. we're all imperfect, and life is simply a perpetual, unending struggle against those imperfections.”"}, {"userName": "Pamela", "userReviewDate": "Sep 18, 2010", "userURL": "http://www.goodreads.com/user/show/4242366-pamela", "userReview": "Sidney Poitier is sooo smooth...I just love him...especially in the old movies he used to be in - \"To Sir With Love,\" \"A Piece of the Action,\" and \"Uptown Saturday Night.\" He's one of my best actors - hands down, and it was great to hear his autobiography."}, {"userName": "Shannon", "userReviewDate": "Sep 27, 2016", "userURL": "http://www.goodreads.com/user/show/16087021-shannon", "userReview": "About two pages in I realized that this book is the kind where you will want to use a pencil as a bookmark because there are so many passages that you'll want to remember and find again. I love Poitier. Scratch that. I adore him. He does have the unfortunate habit of rambling on sometimes, and there were times when (gasp) I wanted to skip over sections, but on the whole, this is a man full of wisdom and light with the voice I could listen to all day long. So I forgive him. How could I not?"}, {"userName": "La Tonya  Jordan", "userReviewDate": "Mar 22, 2015", "userURL": "http://www.goodreads.com/user/show/32053623-la-tonya-jordan", "userReview": "Money vs. Integrity which should I choice. Should I choice the conviction of the soul – my integrity. Should I choice the oxygen of man – money. Should I choice the will of strength – my integrity. Should I choice the status of the world – money. Should I choice the love of my heavenly father – integrity or should I choice the root of all evil – money. I would say that sometimes convictions firmly held can cost more than we’re willing to pay. And irrevocable change occurs when we’re not up to paying, and irrevocable change occurs when we are up to paying. Either way, we have to live with the consequences. If I’m up to paying the price in a certain situation. I walk away from the experience with some kind of self-respect because I took the heat. And if I go the other way, feeling that the cost is too high, and then however bright the situation turns out, I feel that something is missing. Missing is what choices are about. Surrendering is what choices are all about. Compromise is what choices are all about. Seeing a better person in you is what integrity is all about? Money is not the root of all evil, but the love of it is. Much is required for those who have money and for those who don’t. The vast majority of people can be trained to do any job, career, position, or status in life in order to make money. But, no one can train you to have character, integrity, wholesomeness, or a deeper you to see something better in someone else. Those are the people life is truly searching for and the people life will remember. Will I remember you? Eat well and enjoy life. Oxygen makes you breathe easier. Taking in the full breathe of air can make your lungs explode into knowing that you are alive. Breathe In - Breathe Out and now you know how good it feels to be alive. Is this integrity or is this money? Seeing your child smile or riding a bicycle for the first time. Is this integrity or is this money? The feeling of having someone trust you for the first time. Is this integrity or is this money? Counting your blessings and not your problems. Is this integrity or is this money? Being able to say you are truly sorry. Is this integrity or is this money? Having a hurt feel? Is this integrity or is this money? Being Loved By Another Human Being. Is this integrity or is this money? Vincent J. Lombardi once said “The difference between a successful person and others is not a lack of strength, not a lack of knowledge, but rather in a lack of will” Where does man get his greatest will – In what he can see or what he can not see? For the Love of Money or For the Love of God. The world sees money. But, people see a better you. Have a beautiful wonderful great awesome day. Thank you for lending me your ear today. Thank you I am honored."}, {"userName": "Marsha", "userReviewDate": "Mar 27, 2009", "userURL": "http://www.goodreads.com/user/show/891516-marsha", "userReview": "Actor Sidney Poitier was very famous when I was a child. He stood out as he was one of the few famous talented black actors in the 1950s and 1960s, who had great respect by Hollywood and in general the white community. Sidney was born to a poor black family in Cat Island in the Bahamas. There was no electricity, no plumbing and no indoor toilets. However, since everyone in the neighborhood was black and poor, Sidney knew no difference. He had a strict, quiet, loving mother and father. Sidney felt that his very disciplined childhood gave him the foundation for strong survival skills throughout his whole life.It wasn't until he was a teenage and ended up in Miami, Florida, where he found out that his being black would be an obstacle that he would constantly run up against. He was fascinated by the luxuries of running water and electricity in the United States, but he didn’t care for the discrimination he experienced in Florida. He heard of the Promise Land in Harlem, New York. So he traveled to New York and worked as a dishwasher to support himself. Finding the New York winters harsh, he joined the army so he could have some warmer clothes and a roof over his head. But, the army turned out to be difficult and Sidney attacked an officer, by the toss of a chair, so that he could be discharged.As a fluke, he ended up trying out for a role in the theater when he saw an ad that said the director was looking for a young black actor. Well, the rest, as you say is history. Sidney, of course, got better at his art, and ended up in movies, where eventually he became quite famous and respected. However, although he was respected, he was not always accepted. On a promo movie tour in Georgia, he walked into a very fine restaurant for dinner. Although the restaurant was happy to have this famous actor patronize their business, they told him that they would have to close him off from the others and drape a big black sheet around his table. He was told it was the law. Sidney decided instead to walk out of the restaurant.He writes that it wasn't easy for him at times, but that he knows that he had to go through a lot to make the way for the black actors of today. He said that he felt bad for those could not make it in the industry during his time, while he had been very blessed. He writes a little bit about his first failed marriage and how it affected his relationship with his children. I think this memoir just gives us a taste of this wonderful actor, but it was a very good taste indeed."}, {"userName": "Carol", "userReviewDate": "Feb 16, 2010", "userURL": "http://www.goodreads.com/user/show/2604014-carol", "userReview": "Sidney Poitier takes us back to a distant time and place: Cat Island in the Bahamas in the 1920s. It was the place of his early boyhood, the time of his formation, where he lived a simple rural life. He was the son of a tomato farmer, dirt-poor, yet rich in love. The tiny island gave him a universe to explore, of beaches and trees, paths and rocks, and seemingly endless days of sun and grace. His imagination was as fertile as the soil. It was a time of deep fulfillment, nurturance, and well-being. Poitier has a special relationship he had with both his mother and father, and their profound values which permeated his life. He believes that in the core of his being lies the continuance of his mother’s soul, spirit, and gift.Poitier had left the idyllic Cat Island, bound for neighboring Nassau. The US State Department had banned the importation of tomatoes grown in the Bahamas, thus cutting off the livelihood of Sidney Poitier’s father. Surely life in Nassau would be better. Yet, life in Nassau proved to be anything but better. It was urban, there were gangs, there was racism; young Sidney was soon getting into trouble. Mr. Poitier writes of the impact the move to Nassau had on him in poignant terms, “And that transition from childhood idyll to urban launched me straight into manhood. At fourteen, I was no longer a child.” At fifteen, he moved in with his older brother, and later chose to take a train to NYC -- Harlem. He didn’t set out to become an actor; poverty threw him into it. But he also auditioned for The American Negro Theater productions. He struggled with roles, but he persevered, working hard to improve his skills. Poitier encountered a \"guardian angel\" in the restaurant (he worked as a dishwasher), a Jewish waiter painstakingly worked with him every night to help him read and pronounce better. Next opportunity he was the understudy for Harry Belafonte in “Lysistrata.” He also performed in “Cry the Beloved Country,” “The Blackboard Jungle,” “Lilies of the Field\"-won Academy Award for Best Actor; as well as “To Sir with Love,” “In the Heat of the Night,” and “Guess Who’s Coming to Dinner”—all films in which he played starring roles. His career soared but his marriage failed. He was determined, however, to be a father to his daughters, to stay in their lives as their father, present, available, and loving. For, as his own father always told him, “The measure of a man is to be found in how well he provided for his children.”"}, {"userName": "Betty", "userReviewDate": "Jan 31, 2009", "userURL": "http://www.goodreads.com/user/show/1380729-betty", "userReview": "This is not the first autobiography by Sidney Poitier, but it is a powerful one. It is a story of wholeness, of working to achieve the best within himself. The story begins on a small piece of isolated land, Cat Island, in the Bahamas, untouched by the outside world without even the most rudimentary of what most would call necessities, so untouched the locals don’t even know there are necessities, and they may be right. The true essential is family and that they do have.In this autobiography, Sidney Poitier looks within, the good and the bad, what drives a man, how to maintain dignity when all around attempts are made to remove the dignity. His first view that there was another kind of life, even that there was a world, was at the tender age of ten and a half, when he moved to Nassau, capitol of the Bahamas. This was the first time he lived outside the “Natural” world. A boy used to evaluating risk, sometimes successfully, sometimes not, he had never encountered the new types of risk. The thing is, he had prepared himself for life by believing that he was who he was, that not only could he be as good as anyone else but with hard work he could be better.This is the basis of the book. It covers many years of looking for answers, taking risks to better himself, searching for meaning, the how, the why, the when, the where. Successful as his career became, he still stretched from within to better himself. He wanted to avoid slipping into thinking things were pretty good as they were. He wanted to maintain his dignity, honour his father, be all he could be, and be the best father he could. I’m summarizing rather than delving too far into the book because the summation is constant for Poitier. I learned a great deal personally from this book and found it moved along very well, although I did notice a bit of a stall or slow spot toward the end which did pick up again, so it didn’t last very long. This is not about black and white except where necessary, this is about being human and where humanity belongs in Nature’s world. I believe it is an excellent book and recommend it for the many lessons that can be learned."}, {"userName": "Michelle Margaret", "userReviewDate": "Jan 25, 2010", "userURL": "http://www.goodreads.com/user/show/2764598-michelle-margaret", "userReview": "Highly recommended. This is an honest, eloquent memoir. I want to watch more of his movies now, especially To Sir with Love and Lilies of the Field. My favorite quote is from Chapter 9, Stargazing: \"I simply believe that there's a very organic, immeasurable consciousness of which we're a part. I believe that this consciousness is a force so powerful that I'm incapable of comprehending its power through the puny instrument of my human mind. And yet I believe that this consciousness is so unimaginably calibrated in its sensitivity that not one leaf falls in the deepest forest on the darkest of nights unnoticed. Now, given the immensity of this immeasurable power that I'm talking about, and given its pervasiveness through the universe (extending from distant galaxies to the tip of my nose), I choose not to engage in what I consider the useless effort of giving it a name, and by naming it, suggesting that I in any way understand it, though I'm enriched by the language and imagery of both traditional Christianity and old island culture. Many of my fellow human beings do give it a name, and do purport to understand it in a more precise way than I would ever attempt. I just give it respect and think of it as living in me as well as everywhere else.The grand consciousness I perceive allows me great breadth and scope of choices, none of which are correct or incorrect except on the basis of my own perception. This means that the responsibility for me rests with me.\""}, {"userName": "Sundry", "userReviewDate": "Sep 11, 2007", "userURL": "http://www.goodreads.com/user/show/339871-sundry", "userReview": "It’s with some sadness that I have to report that I can’t recommend this book. Sigh. It might be more interesting as an audiobook. I mean, hearing Sidney Poitier read a phone book for a few hours might be worth investing some time in.It’s like they sat him down with a tape recorder and let him talk and never bothered to edit it. At all. Bits and pieces are interesting and it would have been great if an editor had pressed him to explore his thoughts in more depth. He touches on being put down by black leaders for representing only one sort of individual and being “too white,” but he doesn’t address the emotional fall-out of a complex charge like that.As it is, it’s very repetitive, circling back to events several times. I admit to skimming the last third of the book. Disappointing, because he’s always been an admirable figure in my mind. The book makes him seem a bit egotistical, which I don’t think is probably fair.I still think he was very important in addressing race issues in a way that was palatable to a wide audience in films that have pretty much stood the test of time.It’s probably a better investment of time and money to rent To Sir With Love, In the Heat of the Night and Guess Who’s Coming to Dinner. Haven’t seen The Defiant Ones in years and years, but I loved it as a kid."}, {"userName": "Kp", "userReviewDate": "Feb 27, 2013", "userURL": "http://www.goodreads.com/user/show/1633650-kp", "userReview": "Although I enjoyed hearing Sidney Poitier's story, I found this book somewhat rambling. It seemed like he spoke into a recorder, and then it was transcribed into a book. It WAS fun to hear his voice as the narrator. I listened to the book and also had the Kindle version. At times I followed the print and the audio, and I found that he was speaking words that weren't in the Kindle version! The two version didn't always match, in other words. That convinced me that somehow the editing/writing was haphazard. The sections on his life in Hollywood and his intersection with the civil rights movement were the most interesting. The \"spiritual\" part about his outlook on life etc was not as uplifting as I had hoped. I can remember being a first year teacher way back when and thinking of Poitier's movie, To Sir with Love, and how he faces an unruly class. I remember asking myself, \" What would Sidney Poitier do?\" when a situation occurred that was similar to the movie where a student dropped a sanitary napkin or tampax on the classroom floor :) I need to find that movie and watch it now - so many years later."}, {"userName": "Paula Dembeck", "userReviewDate": "Nov 12, 2017", "userURL": "http://www.goodreads.com/user/show/15166873-paula-dembeck", "userReview": "This is Poitier’s second book, a memoir charting his personal journey to become a man rather than his career in Hollywood which he wrote about in his 1980 autobiography, “This Life”. The book opens on Cat Island in the Bahamas where Poitier grew up in poverty but enjoyed a simple life without radios or TV, flushing toilets, telephones or electricity. It was a quiet life during which he spent hours exploring the woods, crawling on rocks, adventuring up streams and swimming on the beach. Poitier credits this as an important time in his life, giving him the grounding he would need to face the challenges that lay ahead of him. It was a time when he listened and began to understand interactions between people, when the seeds of beginning confidence were planted, a time when he came to understand, know and believe he was like every other man, no less and no more, a child who had every right to be on this earth. It also gave him a clear sense of right and wrong and it was during this time that he vowed to live a life that honored his upbringing and the important legacy of his parents. When he left Cat Island and moved to Nassau and later Miami, he experienced a very different world. These were urban environments with gangs and racism. It was here as a teenager that he learned that whites considered themselves superior to blacks and his education in racism began. At sixteen he moved to New York where he lived in Harlem, alone, poor but determined to fulfill his dream of becoming an actor. He washed dishes and scanned the ads for jobs, discovering The American Negro Theater was recruiting actors for its next production. He applied, but was not only rejected, but thrown out of the theater. Having attended school for only a short time, he was barely literate and his thick Bahamian accent made his speech unintelligible. So he began an improvement program and though the kind efforts of a waiter learned to pronounce his words clearly and improved his reading skills. Poitier describes the acting roles he chose and those he rejected, basing his decisions on how the characters portrayed black people and the black experience. He believed his work reflected who he was and so he chose roles that conveyed his personal values. He rejected those which he considered insulting to black people, roles in which a black man was portrayed as a servant or a passive man without dignity. He knew there were roles for those who were angry and defiant, but he did not consider himself that kind of person. He wanted to replace that kind of negativity with something positive, taking on roles that said something more constructive about the human condition. Many blacks criticized him for his choices. They believed Poitier purposefully chose roles that did not threaten white people, roles that embodied the middle class educated black man rather than the average black man in America. They ignored the fact that these roles challenged the cultural stereotypes of black American men held by society at that time. Although bruised by the criticism, Poitier weathered the storm, maintaining a sense of integrity and dignity. Looking back, it is clear that he opened many doors for successive generations of black actors.In 1963 he made “Lilies of the Field” a film in which he portrayed a traveling handyman hired by a group of nuns to build a chapel. That role earned him an Academy Award, breaking a long standing color barrier as he became the first African American to win an Oscar for Best Actor. The peak of his career came in 1968, a year of great turmoil in America. Martin Luther King Jr. and Robert Kennedy were both assassinated and young adults were gathering in the streets to protest the war in Vietnam. Poitier had leading roles in three of the top grossing films that year, “To Sir With Love”, \"Heat of the Night\" and \"Guess Who is Coming to Dinner\". These films all fueled conversation that added to the turmoil in a society in which color barriers were falling, blacks were more common in jobs with power and authority and interracial couples were becoming more common.I found the last few chapters in the book a little preachy especially the recorded “bull session” with a friend. It sounded condescending, although it was not meant to be. It could have been left out completely without interfering with Poitier’s message.This book is written in a conversational style, although when Poitier punctuates his sentences occasionally with “you know?”, it can get annoying. It appears to be an honest and sincere man’s assessment of his life as he documents his core values and looks back, (at the time of the writing he was in his early seventies), tracing what he terms “the spiritual journey” his life has taken. Although the title includes the world “spiritual”, it is used only in a broad sense of the term, as God or Poitier’s belief in a cosmic consciousness is only mentioned once in the last chapters of the book. His narrative is thought provoking but not necessarily spiritual. Poitier does not shy away from his failings. He admits to days of a downward spiral and brushes with destruction, allowing he had a dark side at certain times in his life when he harbored a growing anger at the suggestion that as a black man he should rein in his expectations of life. He says he learned he had to have positive outlets for his anger or it would have consumed and destroyed him. He also says there were times he got into trouble as a youth and did not always do the right thing. However little or nothing of those experiences are shared with the reader except for stealing corn and slipping into the movies without paying. He notes a failed marriage and even admits to a certain hubris at one point in his life when he began to believe his own press clippings. This book and his autobiography were both languishing on bookstore shelves but sales soared when Oprah Winfrey gave the book her magic touch, choosing “The Measure of a Man” as a pick for her TV Book Club. The announcement fueled the sale of thousands of both books, culminating his rags to riches story. Poitier, who has always had a strong belief in his own destiny, has done well. He believes that at this stage of his life, it is up to him to look back and examine how well his life conforms to the values he embraced and the standards he set for himself; to take his own measure and answer for it. This book documents that inner journey."}, {"userName": "Mj", "userReviewDate": "Jan 30, 2014", "userURL": "http://www.goodreads.com/user/show/5706631-mj", "userReview": "I quite enjoyed The Measure of a Man: A Spiritual Autobiography by Sidney Poitier. It was a rather reflective memoir about what makes Poitier tick. It reinforced much of what I had sensed about him as a person and also introduced me to his history and to new aspects of him I hadn’t expected. I chose to read this particular autobiography before his other autobiography This Life because it has been written more recently when Poitier, like many is older and wiser. I also thought that a spiritual autobiography would be more personal and tell me more about the man himself and not just what he has done or accomplished in life. I have always enjoyed the work of Sidney Poitier and had the sense that he made all his movie choices with great care. I also felt that he had a great deal of integrity and was a thoughtful and introspective man. This was reinforced by any interviews or speeches that I had heard him make. I also recognized how well respected he was by his peers and younger actors coming up through the ranks and that as the first significant black actor he seemed to be under the microscope. It seemed to me that he had a lot of weight on his shoulder paving the way for other black film stars and he took this responsibility very seriously. I was very much interested in learning about the “heart and spirit” of Sidney Poitier.Poitier is definitely very cerebral and conscious. I will likely read the book again (something I rarely if ever do) because it was quite packed with gems of wisdom that I would like to ponder over more.Poitier’s reserved nature is evident in the book. I like memoirs because they are usually share more about a person’s feelings and emotions than autobiographies or biographies do. Both of the latter two genres seem to concentrate more on facts and timelines where memoirs are quite often less structured and the author frequently really shares what makes them tick. It’s sort of like facts and figures versus feelings and emotions. I was disappointed with The Measure of a Man for this reason. I felt that Poitier really reined himself him and didn’t expose all that he could have. This may have been unintentional as Poitier seems to be a fairly self-reflective man who spends a lot of time in his head. Perhaps he guards his emotions and keeps them in check. While I quite enjoyed the book, I think it could have been much more had Poitier let his guard down somewhat and let himself be vulnerable. It could have been a fabulous memoir. Instead it was a more average, at times plodding memoir, a bit lacking in real emotion. It was a good read that I enjoyed but I am in such awe of Sidney Poitier that I think it could have been so much more."}, {"userName": "Meghan", "userReviewDate": "Feb 22, 2008", "userURL": "http://www.goodreads.com/user/show/199350-meghan", "userReview": "This is why I don't read memoirs. I would first like to preface this review by saying I am a huge Sidney Poitier fan. I believe he is not only a fine actor but also a fine man. He is, to me, the epitomy of integrity.I had recently just finished reading The Other Wes Moore: One Name, Two Fates, and one of the major complaints about that book is that Moore doesn't seem to understand why his life turned out the way it did and the \"Other Wes\" turned out differently, even though there seemed to be a lot of key points in both their lives. So I was eager to read this book as Poitier was in his 70s when he wrote this. Here is a man who's lived a long life and has the experience to look back and make theoretical guesses on what paths shaped him.And this book is exactly that. He tells you what he thinks made his life different. But about a third of the way into this book, I realized with a sinking heart, I really didn't care. My mind kept staring off the page as if I was waiting for James Lipton to jump in and offer a better question to turn this \"conversation\" into something more.The big problem is there is nothing wrong with this book. The writing is sound. The voice is clear. You can practically hear Poitier reading this aloud. And maybe, had I listened to this on audio, the book would have gone down better. It would have felt more like a conversation then.But all I came away with is that Poitier respects his parents, grew up poor, has a huge fear of failure which served as an excellent motivator, and was blessed with an enormous amount of luck--being in the right place at the right time and knowing the right people. And isn't that what life is really like? So maybe that was the problem, there wasn't anything new revealed.Two stars seem wrong. And guilt would have me give it three. (I mean this is Sidney Poitier for goodness sake!) But I'm using the GR's definition that two stars mean it was just \"okay\". It was not horrible. It was not death to read. This was not Nicholas Sparks meets Snooki. But to say I \"liked\" this book would be wrong too.I think if you're a fan of Poitier, go get it from the library. The first chapter about Cat Island is worth the effort. Better yet, go get the audio cd and have the perk of hearing Poitier's velvety voice soothe your worries away."}, {"userName": "Kellie", "userReviewDate": "Aug 21, 2008", "userURL": "http://www.goodreads.com/user/show/842772-kellie", "userReview": "I'm on Chapter 2 but I have to say, I am very impressed with Sidney's writing. He has incredible insight on his life and what influenced him as a child. He has an amazing way with words. He talks about \"emotional intelligence\" \"It is a capacity that's nutured by silence and by intimacy, and by the freedom to roam.\" I have read a lot of autobiographies lately and this one is unique in the fact that Poitier digs deep into the reason he became the man he became. Beginning with his childhood in the Bahamas. And it isn't just a recap of his life and the things that happen. He tries to put meaning to it. Almost scientifically. Yep and as I get throught this book, my opinion changes. It was disappointing. I would have thought I would have learned about the man and his life but all you get is philosophy. It's fine to write about why you thing things are the way they are, but the whole book is full of just thoughts. You don't really get a good handle on what Sidney's life was like, he experiences with other actors, his movies. He is definitely a successful man. A man who beat the odds and made money as a black actor in a time that was almost impossible. I just wish he told us a little more about that."}, {"userName": "Matt", "userReviewDate": "May 27, 2011", "userURL": "http://www.goodreads.com/user/show/1479345-matt", "userReview": "The stereotype of an actor would suggest a shallow person, but Poitier probes deeply into his life for meaning. He's very vulnerable at times and always humble about his character.What I found most fascinating was his idea of the actor not as presenting something fake, but rather someone who takes a real part of him- or herself and then puts it out for others to see.I enjoyed the stories of his struggles growing up, especially the sudden shock of racism he experienced moving from Cat Island to the US. It's an interesting perspective just because he didn't have a lifetime of conditioning messages about what society expected of a Black man. Therefore (and he can express this better than I can) the conditioning from Cat Island gave him a strength the made it so he wouldn't accept the racist messages when he got to the States. Immunization, maybe. I also appreciate that he didn't shy away from talking about his failures. He looks at the external factors which may have contributed, accepts the lessons learned, and also acknowledges that sometimes you don't end on a win. The latter means life requires a spiritual perspective."}, {"userName": "Sugarpop", "userReviewDate": "Dec 05, 2008", "userURL": "http://www.goodreads.com/user/show/1779008-sugarpop", "userReview": "I had wanted to read this book for quite awhile. I finally had the opportunity and it is a quick read. I was also quite ready to be finished with the book. There were several sections that I found quite interesting because he lived through these events. I think that anyone who is interested in the Hollywood blacklist would get something from his experience. I also liked what he thought of the characters that he played or had been offered. Raisin in the Sun is my favorite all time movie. I saw the movie first and then read the play. I could not imagine Walter Lee Young being played any other way than how Sidney Poiter portrayed him. It blew me away that there had been any type of disagreement. Then there are the points of wisdom that can only come with age. His relationship with his daughter, forgiveness, and his mistakes. I do have to agree that there was a few moments that it was a struggle to finish the book."}, {"userName": "Mme.", "userReviewDate": "Sep 30, 2011", "userURL": "http://www.goodreads.com/user/show/6482600-mme", "userReview": "Sidney Poitier is my hero. He have proven time after time his revered acting skills, his strong convictions, bravery and grace. Sidney is an amazing man that I admire deeply. In this book, he draws attention upon the perspective and wisdom gained from his memories as a poor boy in the Bahamas, his experiences of racism coming to the US, falling in love and raising a family. He shares breaking the race barrier in theatre and film during the Civil Rights era, achieving stardom and success in Hollywood and becoming a diplomat and humanitarian. Thoughout his writing, he reflects on the deepest questions and significant passages of his life and the sense of purpose and history that strengthened him. He shares stories about people of courage he has met along the way and the meaning of life in the face of death. Yes, Sidney is an extraordinary \"gentleman\" who is and forever will be an inspirational voice and role model for Americans and people all over the world."}, {"userName": "Rosemary", "userReviewDate": "Dec 05, 2010", "userURL": "http://www.goodreads.com/user/show/4267341-rosemary", "userReview": "I listened to the audio book, for which Sidney Poitier won a Grammy award.Some of the story telling was beautiful, especially in the first third of the book. It was personal, colorful, real, and very different from my experiences. That's where SP excelled.I didn't like most of the book very much. When SP shares an anecdote, he is at his best. When he makes generalizations (about society, racism, who he is as a person, etc.), he gets long-winded.His voice is amazing. I love hearing him speak. But when he repeats generalizations and societal critiques and what he probably learned from countless psychotherapy sessions and a tough time with prostate cancer, I did not enjoy this book.I recommend it with reservations. Probably best to skim the book or skip some of the audio book chapters if you decide to give it a shot.P.S. One of his great passions is comedic pantomime. Who knew?!?!?"}, {"userName": "Monica", "userReviewDate": "Dec 29, 2012", "userURL": "http://www.goodreads.com/user/show/4282457-monica", "userReview": "\"The unexamined life is not worth living.\" - SocratesSidney Poitier examines events, locations and eras that shaped him as a human and an actor. He wrote an earlier autobiography that detailed his career, but this autobiography is more of an exploration of some of the important events in his life that changed and shaped him. From his earliest days on Cat Island in the Bahamas, to Nassau, to Miami, to New York City, changes in his situation and the need for survival helped him to adapt to new surroundings. He credits his parents and family for a solid upbringing. He realizes his good fortune in being able to develop as an actor and for being hired for roles for characters with dignity and values. I liked the book, but there were repetitious sections. I enjoyed his evaluation of his life and how he shaped his own image from what he learned. I have seen TV interviews and always enjoyed hearing him talk about his life. This book feels like an extended interview."}, {"userName": "Jill", "userReviewDate": "Aug 05, 2008", "userURL": "http://www.goodreads.com/user/show/263190-jill", "userReview": "Well-written and with a lot of insightful profound looks at human nature. I was captivated by his story. I loved hearing the \"behind the scenes\" stories about many of his movies, almost all of which I've seen several times and know well. I was surprised by his spiel on people's \"dark side\" as well as his refusal to name the Higher Power he believes in. I did not care for the continual profanity. I always thought of Sidney Poitier as much classier than that. I still think he's fantastic, but I was really bummed out with some of the vocabulary he chose to use. Still I think his story is amazing -full of one in a million chances that go on and on and on."}, {"userName": "Kate", "userReviewDate": "Jan 23, 2009", "userURL": "http://www.goodreads.com/user/show/1946115-kate", "userReview": "Reading this book is like having a conversation with Sydney Poitier. At least you will appreciate it more if you read it that way. The writing is certainly not poetic, but the content in itself is interesting. I found Poitier to be incredibly honest about his triumphs and shortcomings, and about race relations in the movie business in the early years. It's quite remarkable how much he overcame while managing to keep his integrity intact. (He certainly has my admiration for his courage and tenacity. If I were in his shoes, I don't know if I could have done the same...) He was, without question, a trailblazer in the film industry."}, {"userName": "Rachel", "userReviewDate": "Aug 11, 2008", "userURL": "http://www.goodreads.com/user/show/1416648-rachel", "userReview": "I was disappointed in this book - it was good but not as good as I thought it would be. I didn't find it to really be a spiritual biography, more just selected parts of his life. I agree with his basic point that children are overindulged these days and don't learn to appreciate the little things in life, but I disagree that whipping your children (like his parents did to him and his siblings) is a good way to command their respect. Much of the book seemed to be meandering stream of consciousness and I found it hard to follow. I did love his definition of God and I will carry that with me. Overall it just wasn't as revolutionary as I thought it would be but it still held my interest."}], "description": "In this luminous memoir, a true American icon looks back on his celebrated life and career.  His body of work is arguable the most morally significant in cinematic history, and the power and influence of that work are indicative of the character of the man behind the many storied roles. Here, Sidney Poitier explores these elements of character and personal values to take his own measure - as a man, as a husband, and father, and as an actor.Poitier was uncompromising as he pursued a personal and public life that would honor his upbringing and the invaluable legacy of his parents. Committed to the notion that what one does for a living articulates who one is, Poitier played only forceful and affecting characters who said something positive, useful, and lasting about the human condition.Here, finally, is Poitier's own introspective look at what has informed his performances and his life. Poitier explores the nature of sacrifice and commitment, pride and humility, rage and forgiveness, and paying the price for artistic integrity. What emerges is a picture of a man seeking truth, passion, and balance in the face of limits his own and the world's. A triumph of the spirit, The Measure of a Man captures the essential Poitier.Author Biography: Sidney Poitier was the first and remains the only African American actor to win the Academy Award for Best Actor for his outstanding performance in Lilies of the Field in 1963, but he believes that will soon change, given the excellence of African-American talent in the industry today. He has starred in over forty films, directed nine, and written four. His landmark films include TheDefiant Ones, A Patch of Blue, Guess Who's Coming to Dinner, and To Sir, With Love. Among his many accolades, he has recently been selected as the thirty-sixth recipient of the Screen Actors Guild's highest honor, the Life Achievement Award for an outstanding career and humanitarian accomplishment.", "title": "The Measure of a Man", "url": "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "average": 3.7, "cover": "https://images.gr-assets.com/books/1517353111l/38272015.jpg", "reviews": 981, "authors": [{"url": "https://www.goodreads.com/author/show/45141.Sidney_Poitier", "name": "Sidney Poitier"}], "type": ["Nonfiction", "Biography", "Autobiography", "Biography"], "outlinks": ["http://www.goodreads.com/book/show/1664285.The_Measure_Of_A_Man", "http://www.goodreads.com/book/show/128573.The_Measure_Of_A_Man", "http://www.goodreads.com/book/show/2237744.Life_Beyond_Measure", "http://www.goodreads.com/book/show/15799370-montaro-caine", "http://www.goodreads.com/book/show/572997.This_Life", "http://www.goodreads.com/book/show/572998.Separate_But_Equal", "http://www.goodreads.com/book/show/15213455-untitled-novel", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}