{"ratings": 38, "userreviews": [{"userName": "Philip", "userReviewDate": "Mar 03, 2018", "userURL": "http://www.goodreads.com/user/show/8337821-philip", "userReview": "I know a cookbook excels when I want to try at least more than 3 recipes from the bunch. Paul Hollywood A Baker's Life travels from easy childhood recipes filled with nostalgia to complicated expert baker feats. He peppers each recipe with his own feelings making the book both personal and practical. I'm not a big bread baker, ok well never to be honest but there are lots of other yummy recipes in-between the kneeding. And even a few simple breads which make me want to finally try. A great compliment to any kitchen's library especially those of us who love Paul from The Great British Baking Show."}, {"userName": "Miss Clark", "userReviewDate": "Apr 13, 2018", "userURL": "http://www.goodreads.com/user/show/1467942-miss-clark", "userReview": "3.5 starsThis was a charming, relaxing read- part memoir, part cookbook, and entirely focused on an excellence in baking and challenging the notion that baking is for the \"professionals\".One note: the recipes are written for UK/Euro bakers so be sure to take the time to properly measure in metric or convert the measurements and then carefully measure.Favourites:Floury Baps (a simple homemade roll perfect for sandwiches)Seasonal Danish Pastries (so many combinations you can try)Sultana & Pecan Scone RingLoukoumades (Greek doughnuts with orange-infused honey)My Mum's Ginger Biscuits*"}, {"userName": "Piepie", "userReviewDate": "Apr 17, 2018", "userURL": "http://www.goodreads.com/user/show/663327-piepie", "userReview": "I LOVE The Great British Baking Show, and I adore Paul Hollywood (and Mary Berry). I liked reading about his memories and experiences, family life and growing up, and all his travels. The photos in this book are gorgeous!"}, {"userName": "Michelle", "userReviewDate": "Mar 15, 2018", "userURL": "http://www.goodreads.com/user/show/1066546-michelle", "userReview": "Very British."}, {"userName": "Lisa", "userReviewDate": "Mar 26, 2018", "userURL": "http://www.goodreads.com/user/show/16311627-lisa", "userReview": "I would eat everything in this book they all sound really good. So really I would give this book 3 stars but the recipes are so delicious sounding that is what the extra star is for. With that being said I don't think that there is anything in this book that I would attempt to make. The measurements are in grams and all that good stuff, I would have to take the time to convert everything. Most of the recipes have a very long list of ingredients and the instructions are pages long. There are hardly any pictures and the level of difficulty is crazy high. This is not for someone who doesn't really know what they are doing in the kitchen."}, {"userName": "Linda Quinn", "userReviewDate": "Feb 11, 2018", "userURL": "http://www.goodreads.com/user/show/20327389-linda-quinn", "userReview": "This is a beautifully produced cookbook from one of the judges on The Great British Bake Off. He shares stories of his travels and what he’s learned from them and shares 100 of his favorite recipes. This book covers a full range of recipes, from the very British crumpets to Greek loukoumades and spanakopita, all photographed beautifully. Thankfully I have a baker I can gift this to who will hopefully start producing these indulgences for me."}, {"userName": "Lisa", "userReviewDate": "Mar 26, 2018", "userURL": "http://www.goodreads.com/user/show/33622-lisa", "userReview": "Wonderful photos, stories and explanations. I think I'll need to get a scale to do the recipes though...this is the British version of the bookbook and I'd need to do a lot of measurement conversions. Too lazy for that right now."}, {"userName": "Nathan Boler", "userReviewDate": "Feb 23, 2018", "userURL": "http://www.goodreads.com/user/show/66324090-nathan-boler", "userReview": "Incredible pictures. Writing style is a bit stiff and dry, but so is Paul. Some really great recipes to try, with a bit of basic reminiscing of Paul's childhood and travels. A fun read."}, {"userName": "Love & Flour", "userReviewDate": "May 01, 2018", "userURL": "http://www.goodreads.com/user/show/5805750-love-flour", "userReview": "A very nice book for anyone interested in baking. The bread recipes section is particularly robust."}], "description": "Accompanying the Channel 4 series, A Baker's Life contains 100 of Paul Hollywood's very best baking recipes, which have been finessed over decades spent as a baker. Each chapter is filled with bakes that represent a different decade - learning the basics at his father's bakery; honing his pastry skills in the finest hotels; discovering the bold flavours of the Middle East while working in Cyprus; and finding fame with the phenomenally popular Great British Bake Off television series.Thanks to this book (and its clear step-by-step instructions), recipes that Paul has spent years perfecting can be recreated at home. Favourites include garlic baguettes; feta and chive bread; chorizo and chilli Scotch eggs; mum's ginger biscuits; double chocolate Danish twists; and hazelnut cappuccino cake.With photographs from personal family albums, plus many professional insights into and anecdotes that reveal what makes a great baker, A Baker's Life will show you how to bring the baking skills Paul has learnt over a lifetime into your own home kitchen.", "title": "A Baker's Life: 100 Fantastic Recipes, from Childhood Bakes to Five-Star Excellence", "url": "http://www.goodreads.com/book/show/33583751-a-baker-s-life", "average": 3.97, "cover": "https://images.gr-assets.com/books/1513265676l/33583751.jpg", "reviews": 10, "authors": [{"url": "https://www.goodreads.com/author/show/246994.Paul_Hollywood", "name": "Paul Hollywood"}], "type": ["Food and Drink", "Nonfiction", "Food and Drink"], "outlinks": ["http://www.goodreads.com/book/show/33583751-a-baker-s-life", "http://www.goodreads.com/book/show/10316678-how-to-bake", "http://www.goodreads.com/book/show/17272120-paul-hollywood-s-bread", "http://www.goodreads.com/book/show/20613621-paul-hollywood-s-british-baking", "http://www.goodreads.com/book/show/18690368-paul-hollywood-s-pies-and-puds", "http://www.goodreads.com/book/show/438573.100_Great_Breads"]}