{"ratings": 19957, "userreviews": [{"userName": "karen", "userReviewDate": "Jul 03, 2014", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "congratulations and ADORABLE!!this book is a little challenging at the outset, but if you stick with it, you will be rewarded like a motherfucker. (note: if that word upsets you, this book is not for you)it's not the length that is challenging, although 700 pages is a nice chunky brick of a book, and it's not the dialect, unless this is your first exposure to patois. even then, this is a multi-voiced novel, with several characters who are not jamaican, so unlike The Book of Night Women, there are many parts that are not written in dialect, and like reading irvine welsh, once you get into that voice, it's easy as pie to read. the challenging part - for me - was getting situated. at first, the chapters just come at you hard, without context of who these characters are in relation to each other. there is a very handy \"cast of characters\" section in the beginning but even then, i was lost for quite some time before i managed to understand the connective threads. and you might not have this problem - when i started this i was still on my delicious post-op percocet, so i admit there was some blurriness and some dulling to my cognitive capabilities. but the first chapter is narrated by a ghost for goodness' sake, and then goes right into the voice of a fourteen year old jamaican boy witnessing extreme violence and mentioning characters named, among others, \"shotta sherrif,\" \"josey wales,\" and \"doctor love,\" before the next chapter swerves you into the story of a middle-aged white american man in a fast food restaurant in jamaica and by now your head is spinning with \"what have i gotten myself into???\"but stick with it, because it will all come together beautifully. and after all, you have 700 pages to get the hang of it!i am not a history buff. before i read this book, i didn't know anything about the political and social climate of jamaica in the 70's. there were superficial things i had picked up on by reading other books, but this is such a big fat immersion into the time and place that is working really hard to paint a broad picture of three decades of the jamaican experience, and is so successful at it, that even if you are like me and this is all new information, and you are swimming in acronyms: jlp, pnp, cia, you will not be lost, even with the \"thrown into the deep end\" beginning.and, yeah, the hook for the american readership is that one of this book's touchpoints is the 1976 assassination attempt on bob marley, called here only \"the singer,\" but that's far from its most interesting story, and not just because of my sleepy indifference to reggae. the massive sprawl of this book is so much more than that - it's the warring criminal underworld of kingston, government conspiracies, the evolution of the drug trade, diaspora, the corrupt police, the specific hardships of women, the american cutesification of a country riddled with poverty and unrest - it's a brick for a reason. it is epic, in that word's most precise definition. and while i have, surprisingly, never read james ellroy, i feel like his fans would really enjoy this book, because it does what i understand ellroy to also be doing: juxtaposing small(er) scale crime stories against global politics and the treatment of smaller countries like petting zoos or chessboards. but in jamaica. with less staccato prose. (detail provided by ellroy-fan greg)there is nothing this man can't do. for the second time, he has created a complex, nuanced, credible female character in nina burgess (aka), and tells so many harsh and beautiful and strong stories, you are left weak at the end. and not to diminish his skills as a writer, but he's also fucking dreamy. i know this book isn't even out for months yet, but i am already foaming at the mouth for his next one.seriously, don't miss this. it will be talked about................................................................................................oh my god do you see what i have??\nbut do you know what i don't have?time to read it.\ncruelest world ever"}, {"userName": "Barry Pierce", "userReviewDate": "Jul 29, 2015", "userURL": "http://www.goodreads.com/user/show/4593541-barry-pierce", "userReview": "When I open a book and see a lengthy character list I know I'm in for a wild ride. However Marlon James' A Brief History of Seven Killings is more than just a wild ride, it's a brutal masterpiece that deserves its place as one of the best books of this decade so far. James weaves a Dickensian plot around Jamaican history and culture. The entire plot is based on the events surrounding the attempted assassination of Bob Marley in 1976. It's a fictionalised history of Jamaica from the 1970s through to the 1990s. I must admit that my knowledge of Jamaican history and politics and culture is laughably sparse. I'd tried ackee and saltfish once and didn't really like it so I don't think Marlon James could have found a whiter canvas to paint his story upon. I mentioned Dickens earlier because he's the only author whose work I can compare this to. A massive cast of characters, a hefty page count, numerous interweaving storylines but in the end it always comes together. This novel displays such mastery of plot and prose that I have not read since The Old Curiosity Shop or The Pickwick Papers. While this is essentially a very different novel it still harks back to and is possibly in the same league as these literary greats.A Brief History of Seven Killings is never an easy read. From whole chapters written in Jamaican dialect to brutal murders and mutilations being described in minute detail. When Steinbeck discussed The Grapes of Wrath he said, \"I've done my damndest to rip reader's nerves to rags; I don't want him satisfied\". I feel this quote also applies to James and this novel. He is a brutal writer, the dots above the Is are bullet holes and stems of his Ts are sharpened and ready to kill. Blood imbrues the pages of this novel and you are always caught off guard. As with many great novels such as this one there is always talk of literary awards and prizes wafting through the air. The most prominent to me is the Man Booker. At the time of writing, this novel is longlisted for the 2015 prize and I can say without hesitation that this is by far the runaway winner. I cannot conceive of any reason why this novel should not snatch the prize. If it does lose however it will go down in history as \"do you know what actually won the year A Brief History of Seven Killings was longlisted?\"While some may be apprehensive and intimidated by its size, subject matter, and prose, I cannot urge everyone enough to pick up this book. A good novel holds your attention for a couple of hours, a great novel teaches you something. New cultures, new languages, new people. A Brief History of Seven Killings is a great novel."}, {"userName": "Petra X", "userReviewDate": "Mar 07, 2016", "userURL": "http://www.goodreads.com/user/show/1237196-petra-x", "userReview": "[I wonder if this can live up to the outstanding The Book of Night Women? I hope so. (hide spoiler)]"}, {"userName": "Petra X", "userReviewDate": "Mar 23, 2016", "userURL": "http://www.goodreads.com/user/show/1237196-petra-x", "userReview": "[If you are thinking of reading this book, or have read it and would like to know about the people and the events the book is based on, then read this from the London Review of Books, Goings on in the Tivoli Gardens. It's a long piece. Don't skip a single word. This essay - it's hardly a review - is articulate and informative and only goes to emphasise the brilliance of Marlon James writing. (hide spoiler)]"}, {"userName": "Michael Finocchiaro", "userReviewDate": "Oct 22, 2016", "userURL": "http://www.goodreads.com/user/show/48483884-michael-finocchiaro", "userReview": "Marlon James takes us through an insanely violent roller coaster ride where various actors in the drama surrounding the house invasion and assassination attempt on Reggae Uberstar Bob Marley's Kingston, Jamaica house in December 1976 tell the story in a series of Faulkneresque first person dialogs. How much of this is factual, I do not know, but based on the fact that James had a team of researchers and took four years to write the novel as well as the fact that the story does seem plausible if simultaneously shocking and heinous. The gang violence in the Caribbean and in Jamaica in particular is legendary, the CIA's plausibly deniable involvement with drug cartels and interference with democratic (or demagogic) processes is entirely believable. Each of the characters from Papa-Lo to the wordless Singer to the insanely violent Bam Bam or the psychotic Josey Wales or the way-in-over-his-head journalist Alex Pierce and especially Kimmy-Kim-Dorcas were so real in their interior monologues. The novel starts with an epilogue of an already-murdered politician's soul talking to us. This narrator then closes each chapter except the last one. Each chapter then treats a single day through the perspective on multiple narrators each named at the top of their sub-chapter. The patois of the Jamaicans and especially that of the gang-bangers takes some getting used to, but it is gorgeous and incredible how the painting of this moment in time - what led to it, who perpetrated it, and its far-ranging consequences - feels so real and engaging. The realism pulls the reader along and I in particular was breathless as I turned each page wanting to see what another character would reveal. If I were compare this to a painting (since others have borrowed the Tarantino movie metaphor already), I would say this works like a series of Caravaggio paintings in heavy chiaroscuro where in the darkness we see evil characters coming out of the shadows, the flashes of knives and muzzles, the dark, thick pooling of blood while hearing the crowds shouting \"Rastafari!!\" among the scattered gunshots, we smell the ganja smoke and acrid burning smell of spent bullets, we taste blood in our mouths as we feel the impact of a fist on our cheeks...Marlon James does not hold back on the violence of the gang world, of the homosexual encounters of several of the protagonists (and their own difficulties in accepting their sexual desires as genuine). I really loved the story of Dorcas and the old guy in the Bronx (my one regret is that this story just evaporates into the mists of time).I think that Marlon James has set the bar for post modern fiction in this second decade of the 21st century, that his Man Booker Prize of 2015 was more than warranted, and that he is of supreme talent as a writer and impersonator in his writing. He alludes in his afterword that he had enough material for a second book. I will be the first in line for that one.If you read anything this year, make it A Brief History of Seven Killings. It is truly masterful beyond just words. It is probably without doubt, the book I have recommended the most in the last 6 months to others! I am going to have to re-read this again soon!"}, {"userName": "Adina", "userReviewDate": "Oct 14, 2015", "userURL": "http://www.goodreads.com/user/show/22189348-adina", "userReview": "Update 2: I found a BBC documentary about Marlon James, his work and his life, called Imagine. The link where you can see the film is: https://www.youtube.com/watch?v=Qj10m... Update: Apparently there is going to be a TV series on HBO based on the book. It is going to be interesting. Can't wait to actually hear the patois!!4.5* I have to subtract half a star because I almost quit at page 400. It got boring at that point but I am very glad I stuck with it. Although there were times when I was counting how much more is left when I finished it I felt like something will be missing from my life. This was, by far, the most difficult book that I have ever read although I admit that I did not read Ulysses or Moby Dick or other books known to be a nightmare. However, I am pretty sure the book can be put in the same category as them, quality and difficulty wise. So what makes it so challenging? First of all, half of its 683 pages are written in patois, the Jamaican dialect which at the beginning it is quite difficult to grasp. Secondly, each chapter is written as a stream-of-consciousness in the voice of a different character. Some are gang members, some are CIA agents, a reporter etc…and even a ghost! The voices are quite different and it takes time to get used with them. The hardest is to follow the character’s thoughts when they are closed to death or in a stressful situation. Then the flow goes all over the place which makes the book damn beautiful and hard in the same time. There is a character index at the beginning which is helpful but not enough.However, the most challenging part was figuring out the context of the characters that were being spat at me, what were the relationships between the voices and all the other characters and also the events mentioned. It all comes together very nicely but I had to be patient and very attentive. Some characters/events might be explained 50 pages or so later. The book tries to picture three decades of the jamaican experience which include government conspiracies, gang movements, CIA involvement in the country. The first two parts take place around the 1976assassination attempt of Bob Marley (called the”Singer”) and the evolution of Jamaican criminality/politics in time until 1991. The plot lines also take us to USA (Miami and New York) where Jamaican gangs were controlling the crack traffic. As I knew absolutely nothing about Jamaican history I had to do some research on Wikipedia and other sites about the facts and figures. This is a reason that this book cannot be rushed. I would not have understood anything if I had read this without googling stuff. Although the book is about politics, CIA, murder, drugs it is not very far paced until the last 250 pages which fly easily. Do not read this book if you do not like violence and cuss words as it is full of both. The writer is amazing in inventing new times of violence. In the end, I didn’t care that it was difficult to read. It was all worth it. I learned a lot of things about Jamaica and World history, I was privileged to read some amazing prose (even a bit of poetry), I was amazed by all the voices the author could create, I learned how to read patois (I even dream myself speaking the dialect one night). I will never forget this book, I feel a richer person after finishing this so I believe he really deserved to win the Booker Award."}, {"userName": "Bookdragon Sean ", "userReviewDate": "Aug 03, 2016", "userURL": "http://www.goodreads.com/user/show/27788046-bookdragon-sean", "userReview": "I’ve been reading this book for an entire year, and it’s not been easy. At times I wanted to pull my hair out and scream, at times I wanted to throw the thing at the wall and be done with it, but I persisted. I made myself get to the end, and whilst I can say that I didn’t entirely enjoy the experience, I do appreciate James’ narrative style. His deft manipulation of language is clearly the success of his storytelling. The way he writes reflects his characters. This may sound like a simple idea, though in reality it is one of the hardest to pull off. The narrative reflects the feel of the characters on a macro and micro scale. He writes in a different style for each one, and it’s superb: he brings their essence alive, who they are and what they sound like. It’s a great technique, one that must be extraordinarily hard to master. This is, no doubt, the reason he won the man booker prize in 2015. That being said though, I found the entire thing very difficult to actually read:“anything you want to know about Kingston’s green versus orange war, everything you ever need to know about the rudeboy-cum-gunman is not in Bob Marley’s lyrics or in Peter Tosh’s but in Marty Robbins’s “Big Iron.” He’s”You what?Some passages were terribly strong in their dialects. More so than this. I love individualistic artistic expression; it’s what makes literature so grand. I think it’s wonderful that this has been written like this, but, still, that doesn’t make the process easier for me, personally, to read. Perhaps I’m the wrong reader. Perhaps my own experience deemed that certain parts of the narrative were almost incomprehensible to me. Either way this was a struggle even if the experience was interesting. This isn’t a novel that comes easily recommended."}, {"userName": "Matthias", "userReviewDate": "Nov 19, 2015", "userURL": "http://www.goodreads.com/user/show/9889835-matthias", "userReview": "A Brief History of Seven Killings should not be evaluated based on its supposed brevity, nor on the amount of killings featured in the book. The title could be the source of misguided expectations in this regard, as it is being overly modest on both counts. But if you're expecting a clever, fast, insightful, colourful and authentic novel, you won't be disappointed.My first instinct when I see a book that has won a prize (in this case the Man Booker) is to have zero expectations of it. Even less. I usually tend to avoid those prize-winning novels, because I always imagine a stuffy jury of academics wearing woolen suits in August and greasy glasses on the tips of their veiny noses, deciding which high-brow book to call \"brilliant\". All this just to make the masses who buy the book feel a little bit more stupid while they try to make sense of the decision to give it such an award. I took my chances on this one, because the title alone already gave me the distinct impression this was going to be anything but stuffy. Needless to say -but I'm gonna say it anyway- I'm glad I did give this a chance. Even though I remained skeptical at first and I was looking for reasons to hate it, I quickly found out there were none of those, and instead I got an amazing ride in the Jamaican suburbs.\nThe strenghts:\n- Characters: The cast of characters is quite big: gang members and cops, Americans and Cubans, addicts and reporters, the average Joe, the average Jane and an anything but average Singer. This impressive list is presented for later reference in the beginning of the book, which is very practical. This big list might seem daunting, but there is nothing to worry about, all the characters, especially the main ones who get their own voice as a narrator, are colourful enough and very distinct, in order to avoid any confusion. The one thing that binds them all: they're all smart in their own way, and they're all authentic. This is the first similarity with Quentin Tarantino's works I see: everyone is awesome. In the highschool cafetaria they'd all be sitting at the cool table, even though some hate each other.My favorite character in the book is Josey Wales. I won't go into too much detail as to why, in order to prevent spoilers, but I will mention one aspect. He's the kind of guy who likes to be underestimated when it comes to his intelligence, so he can use it to his advantage. But he also hates being underestimated, because he considers it an affront, and will react accordingly (he's a bit of a psychopath sometimes). Even though I'm not a psychopath, I recognized the sentiment vis-a-vis being underestimated within my former self. And it made me glad I changed, because the writer describes perfectly how tiring and flat-out insufferable such a person can be for other people. Different perspectives are used, so many of the characters get several chapters that are narrated in their voices. A very good choice. Suffice to say: I have grown to love them all. There's a deep connection that is established with these characters, making for sometimes very heavy, sometimes cringeworthy, sometimes heartbreaking, sometimes laugh-out-loud moments. You really \"live\" these peoples' lives, you even live their deaths in some cases, the immersion is complete.- Dialogues: The second similarity with Quentin Tarantino's work: all the characters are upfront, witty and can always fit in a clever retort. They can speak their minds and do it very elegantly and with a wonderful sense of timing. Many of the dialogues, monologues and thought processes build up nicely to very juicy oneliners. I'm very tempted to write down all the oneliners I've copied, but having them in this review without the build-up wouldn't do them justice. I'll share a few, just to give you an idea:\"Jamaica never gets worse or better, it just finds new ways to stay the same.\"\"The quickest way to not live at all is to take life one day at a time.\"\"My mother is so afraid of trouble that trouble sticks to her close just because he never gets tired of proving a point.\"\"Besides, who trusts a man who drinks hot water with lime instead of whiskey or even coffee? What's next, peeing sitting down?\"- Setting: I had no idea about how Jamaica is or was during the seventies, or how the New York streets looked like in the eighties and nineties, but I think I do now. I'm not going to double-check, but also according to the acknowledgements this is all very authentic and that's the impression I had gotten. I could almost smell the jerk chicken off the pages.Aside from the locales, there is of course the setting of gang wars. Here I must warn the faint of heart: this book is not for you. This book gets extremely violent at times. Rape and murder are described in sometimes excruciating detail. Not just the violence gets this very detailistic treatment. There is a lot of sweet man-on-man lovin' in the fourth chapter that has forever changed my views on flowers blossoming in spring. Marlon James actually warns his mother not to read that fourth chapter. It is extemely explicit.The presence of Death is overwhelming, which will be less surprising because that usually comes with the killings. This book opens with a dead person talking, by ways of introduction, which didn't strike a big chord with me at first. That intro actually left me completely clueless. But the way Marlon James gives the sometimes very recently deceased a voice is powerful beyond compare. You'll look into the minds of people about to die or just having died and I can tell you, those thoughts strike home. - Jamaican Patois: The star of the book. Jamaican Patois with a capitalized \"P\" as far as I'm concerned. It's a beautiful language, that sadly I cannot emulate for you. As Marlon James himself repeatedly says, nothing makes a white boy sound more white than when he tries to \"chat bad\". I have found a review of someone who can do it very well (don't know her cultural background), but if you want an idea of what it sounds like, check out this review by Nicole: Jamaican Patois in action.Remember the violence so brutal and the lovin' so sweet it will make you diabetic just reading about it? Somehow, the Jamaican Patois all makes it more palatable. \"Sufferah\", it sounds all cool and light, but a dramatic meaning lurks behind it. Even their swearwords sound like superheroes. Bombocloth and Battyman, to the rescue!! This strength is a possible weakness though, marketing-wise: I don't think this book is translatable. I doubt it can be done without losing the all-important context of the story. The Jamaican Patois is the identity of this book, translating it into anything else would be equal to killing that identity. - Plot: The plot is very reviting. The central element is an assassination attempt on \"the Singer\" (we all know who that is), but it actually isn't his story. It's the story \"about the people around him, the ones that come and go that might actually provide a bigger picture than asking the Singer why he smokes ganja\". All the characters have their own struggle, and all of them are in danger of something. The central question: \"Who will finish on top?\" Everyone is striving for that top in their own way, by killing, seducing, negotiating, working until they realize that the \"on top\" usually means \"on top of a pile of corpses\" and they try to change directions, turning it all into a question of survival. This story is about that, but also the little things, like a bad marriage (somehow I got the impression Marlon James doesn't really like white women by the way), kids not being able to sleep at night or a jealous sister nagging on the phone.I've upgraded my initial 4-star rating to 5 upon writing this review, realizing there aren't any weaknesses worth that name. Let's call them taches de beauté. Slight imperfections that make the whole more beautiful. The one thing that almost prevented me from putting this one on my favorites shelf is that sometimes the book made me work a bit too hard. I get that Marlon James put a lot of work in this, and I got the distinct feeling he wanted to make his reader put in the little extra effort too once in a while. When he explained the word \"duppy\" on page 526 (more or less) when having used it 77 times (more or less) earlier in the book, I was convinced that Marlon was having a laugh at my expense. Two more examples:- With all the different perspectives and the rather high volume of pages, there is a lot of information to process. Sometimes they're unimportant details, but sometimes one of these details is referred to later on. At some point in the book, Josey Wales has to laugh because he hears \"Ma Baker\" being played on the radio. Now, you know as a reader that this is a reference to something earlier, an inside joke, because \"Ma Baker\" had been mentioned before, way way earlier in the book. But I couldn't remember exactly how, or in which context. And I couldn't find it again either, because with all these narratives intertwining, finding it would simply mean re-reading the book. So a joke went over my head even though it shouldn't have, and it annoyed me. I guess this is partly my fault, and probably the reward would have tasted all the sweeter if I would have gotten it, but it stings. I consider myself a fairly meticulous reader. So hereby a request: Anyone reading this review and able to fill me in on the joke will get another great joke in return!- The streams of consciousness: I'm not against streams of consciousness in general, they usually make for a very immersive experience. But in this book those streams were the weakest part of the book, and sometimes aggravating. The reason for this is that whenever Marlon James chose to use this writing method, it was always when a character was either on a drug trip or in a panicky state. Having just read \"A Scanner Darkly\", I know this can be done much better. The fact that important information is sometimes included in the rants of repetitions, swear words and psychedelic experiences made this less pleasurable than it was probably intended. That said, I think there's a full total of 20 pages of these kinds of streams, so on a total of close to 700 pages this boils down to criticism equivalent to not liking the lay-out of the table of contents. There, I've said it all. I just want to end on a positive note, because this book is definitely a must-read and has got all the potential to be a timeless classic, a book that people from faraway futures will be reading. Don't be one of those people though. Read it as soon as you can!"}, {"userName": "Greg", "userReviewDate": "Nov 08, 2014", "userURL": "http://www.goodreads.com/user/show/42508-greg", "userReview": "Rating this book is a little difficult. I think I’m going to go with five stars, because it is quite amazing. There are a few small problems with the book, but they are the kind of problems that come from trying to be too ambitious, so it’s not perfect but it is great. An ambition is a good thing to have.Karen mentioned this in her review, and an unnamed person from Goodreads disagreed with her in person, but I think he’s wrong. A Brief History of Seven Killings is a historical novel right out of the James Ellroy realm. I don’t know if it is because Karen asked me if I thought this was like James Ellroy when she was reading it a couple of months ago that it grabbed me almost immediately as being a maximilist cousin to the historical novels of Ellroy, but a strong argument could be made that this book is basically a Jamaican version of American Tabloid and The Cold Six Thousand. For those two Ellroy novels the pivot point between them is Dallas 1963. The first book leads up to History and the second picks up moments after when trigger(s) have been pulled and what the results of that moment are. ABHO7K can be broken up similarly, with an assassination as the pivot point between the two parts. The central action that explores the causes and the effects is the attempted assassination of Bob Marley (AKA “The Singer”, in this book) by a group of Jamaicans at his house in (1976?). The reasons for the assassination are complex, but they come down to the relatively simplistic way of putting it—he was upsetting the violent but stable Status Quo of the warring Jamaican ghettos by trying to bring some unity to the main two political parties in Jamaica at the time (who were also the supporters of the rival gangs). It was sort of like the Tammany Hall era New York City and earlier but with automatic weapons and third world living conditions. A break in writing the review came here for a couple of weeks…This has been a tough review to get going with. I loved the book. Part of me wants to point out the spots that I didn’t like as much, but they mostly come from comparing them to James Ellory’s novels, which isn’t fair. I think that Ellroy made some better choices in the execution of a novel of this type, but it’s obviously not the only way to handle a historical novel of this type. Like Marlon James’s last book, The Book of Night Women, at the heart of this story is the corruption of lofty ideals. Here it is a little less murky since it’s only some of the characters that would even give lip service to what they are going is for any higher good, while others are just out there for the money, the power, the high or because they just like pulling the trigger. Where in his previous novel the violence that comes is of a revolutionary kind that is masked in the ideals of liberation for the slave population, here the violence initially stems from the desire for peace. In my review for his previous book I’m pretty sure that I used some Crass lyrics as a jumping off point, and my aging mind thought that this was another Crass lyric that would be suitable, but it’s actually by a 90’s Connecticut Punk band with similar political leanings, The Pist… “if you want to talk about peace prepare to be ignored.” This is a lie, because talk about peace might make you be ignored by those with (not necessarily in) power, but if the talk has the tinge of being a reality those who profit from the the non-peaceful state will probably think about unleashing their violent ways on keeping their advantage. The protagonists of this story are mostly people who feed off of a non-peaceful state, and how profit nicely through the suffering the destruction of others. Sitting in the middle of this book is someone whose music has never brought me any joy, Bob Marley. While I’m not a fan of his, I really appreciated his phantom like presence in this novel. He’s there in almost everything that happens, either directly because of actions he is taking or else from the fall out of the attempted assassination on his life. He’s a voice calling out for peace and unity in Jamaica while at the same time has a dark presence in the book that is almost as ruthless as the triggerman Josey Wales. The fact that he’s there but almost never actually physically there in the story gives him a wraith like quality that works in interesting ways with this book and its structure. I would definitely recommend picking this book up. It’s probably one of the best books of this past year, and it’s probably the only one that I’ve read that feels like it’s a capital eye Important book. It’s not necessarily as tight as it could be, I think that the book could have had a bit more force if the number of points of view were cut down a bit in some sections and I thought that a few of the story lines were interesting but not necessarily that important to the overall structure, but those are really minor points and even for the one story line that I liked but was a little baffled about why it was there, I still found moments in it where thematically added something of interest to the book. It’s on the long side. Much of it is written with Jamaican slang that may be a little difficult to get into (and it was surprising to me to see how some of the words would be spelled, I was familiar with quite a bit of the slang from some Jamaican’s I’d worked with in the past) and if you are like me and stupid about most of the world, the political environment of Jamaica in the 1970’s will also be a little tough to get a handle on at first. The book is also wonderfully brutal and violent, and there are scenes that probably aren’t for the squeamish, but it never feels gratuitous. It never looks away from the ugly side. So, yeah. Recommended. Possibly the best of 2014."}, {"userName": "Elyse", "userReviewDate": "May 08, 2015", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "Audiobook.....and physical book....The story begins before the election the 1976 election. Thankfully Paul, my husband, listened to the first half of this book 'with' me. It was supportive to have conversations together.Fact-based story/Jamaica/KingstonCrime, politics, graphic violence, ( including rape), graphic sex, hard core criminals, Gangbangers, CIA agent, Rolling Stones, Teen- boy with his first gun, drug trafficking, more violence, more killing from 1976...to 1991. Characters we get to know at the beginning of the book - drop off --( they were killed).The names of all the characters are listed in the front of the book...(extremely useful for me). After listening to the audio first.....(I got the physical book to help me with the follow along with the audiobook. ( not the other way around). One of the characters that came over to the states.. to Harlem. ( Josey Wales)... was the character who had me begin to understand why Bob Marley's life was a threat. But this book is complicated - beyond devastating - yet often extremely engaging. The voices were piercing-dramatic at times....so real - so raw- absolutely riveting terrific.Patois dialect is fabulous. I don't think I could have read this 'without' the audiobook's help. Following everything along with only the physical book would have made the experience harder - and more dry. By listening to the audiobook, experiences of the graphic violence felt frightening. I was able to imagine being inside the criminals heads...( to begin to understand their years of anger and hopeless feelings). Am I glad I invested time with this book? Yes! Is it ever uplifting? It's not!yet...the voices were almost 'theatrical' ---piercing interesting---(as I already mentioned), and gorgeous sounding with their accents. I was able to distant myself ( for emotional health), long enough to learn more about the the killings & politics of this country. Really sad! Know...this is an extremely graphic book filled violence and hatred."}, {"userName": "Nicole~", "userReviewDate": "Sep 21, 2015", "userURL": "http://www.goodreads.com/user/show/20071931-nicole", "userReview": "Meh still alive, y'hear? ...Dem try an' try hard teh bus' me up, eh. Rahtid Papa-lo, Pavarotti, Weeper, an' Josey Wales wit him gang, what him say it name, Storm Posse? shadow dancin' on meh like dem is Duppy Conqueror or somet'ing. Nasty political JLP and PNP crammin' dey rassclat dicks up meh pom pom an' use me hard like some cokehead prostitute dey plant at de street corner, even dey bloodclat corrupt police make papapapapapa! across meh heart wit what you call it? dam AK-47 shit dey ship out here an' spread all over de place like some gunland massacre for a Martin Scorsese movie. Tink we Jammin in the Name of the Lord when is the gun runnin' devils killin' we. When you try dat Godfadder shit on de Singer it juss backfire on you r'ass. Man, he only wail War louder an' louder, So Jah Seh \"Smile Jamaica\", an' so I did. De Positive Vibration heal meh a little but meh still in danger all de same. \nDon't gain the world and lose your soul. Wisdom is better than silver and gold.\nMeh can't truss dem stinkin' Dons, not a shot in hell meh tink dey gwan protect me. Jamdown in a bad, bad way like Armageddon arrive. Guns, cocaine, ganja, money, power, revenge; de CIA, Medellin or what ya call dem Anti-Castro's: dey only want to ravage me battyhole, control me, rape me, slice me, burn me, bleed me. Meh life blood gushing outta me, bleeding oceans all the way 'cross to America. I shame, so shame. Meh own pickneys dem leave me to rot, but no, meh can't blame some dem neither. Like Marlon tell it true so. Him one o' me pickney dat got away an' me even tink he gwan win that prize, ire. Bombaclat, when all dis savagery 'pon me gwan stop? Dis wise Buffalo Soldier from Trench Town him had a message before him dead so young, him say: \nDon't give up the fight. Get up, stand up, Life is your right.\nMeh have a right, a right to equality and humanity; gwan fight hard like rahtid to stay alive an' save meh soul.Meh name Jamaica, see? ____________Italics are titles or lyrics from Bob Marley's songs."}, {"userName": "Darwin8u", "userReviewDate": "Sep 12, 2016", "userURL": "http://www.goodreads.com/user/show/2294090-darwin8u", "userReview": "\"God puts earth far away from heaven because even he can't stand the smell of dead flesh. Death is not a soul catcher or a spirit, it's a wind with no warmth, a crawling sickness.\" -- Marlon James, A Brief History of Seven KillingsFirst, it is hard to push all that is into this novel into a bottle. So, I'll just say it felt like some weird hybrid of (here is my brief history of seven fathers/mothers): James Ellroy (think Jamaican Tabloid), Don DeLillo (think Libra), Zadie Smith (think Shiny Teeth), Elmore Leonard (think Get Singer), Roberto Bolaño (think Savage Possy), Gay Talese (Think Bob Marley has a Toe), and with the magical realism of Gabriel Garcí­a Márquez. Anyway, this novel seemed to grab me and I didn't want to let it go. There was power and pull in this novel. It attracted and repelled me at the same time. I wanted to read it, but I didn't want to finish. Just as I would fall into the mix of the dialogue, I would be pushed back out. It wasn't easy and wasn't always fun, but it was constantly amazing. It really did, emotionally, feel like I was reading one of Ellroy's best novels. It could have been Ellroy's Underworld USA #4. This was also a master juggling a bunch of themes and textual ideas. James framed this twisting story of violence, place, race, poverty, power, drugs, sex, language, and death in a funky way (but not too funky and I'm not going to give it away). It reminded me of Lawrence Ferlinghetti's poem 'Constantly Risking Absurdity':Constantly risking absurdity  and death  whenever he performs  above the heads  of his audience ...\"James puts it all out there. And he tends to hit most of his marks, and the ones he doesn't hit perfectly can also be excused because of the difficulty of what he is trying to pull of. This wasn't a perfect novel, but it was a perfect thrill."}, {"userName": "Mona", "userReviewDate": "Oct 03, 2014", "userURL": "http://www.goodreads.com/user/show/7020601-mona", "userReview": "[The book also describes the incident--apparently also true--in which he's given the gift of a pair of cowboy boots with a needle---possibly containing a carcinogenic chemical---in the right toe, so when Marley, who loved cowboy boots, put them on, his toe, which had previously been damaged in a soccer accident, bled profusely. Some people wonder if this incident was connected with his death of cancer at age 36---it started in his right toe and spread to his vital organs---and there's some speculation that this \"gift\" came from the CIA. Carl Colby, the son of the late CIA Director, William Colby, showed up at Marley's house as the band prepared for the Smile Jamaica concert. Colby claimed to be a member of the film crew. There is a character, Mark Lansing, that might be a fictionalized version of Carl Colby. (hide spoiler)]"}, {"userName": "Julie", "userReviewDate": "Jan 10, 2015", "userURL": "http://www.goodreads.com/user/show/4925621-julie", "userReview": "I remember school days painfully toiling over my Latin translations ... and it all came back to haunt me with this!Crikey, chinas! Thought I'd need the ambo! I was a cot case. At first I thought, she'll be apples. I'll give it a burl!! But then I realised my noggin was cactus! I was cheesed off and about to do my lolly. Fair crack of the whip! I had buckleys of sussing out the lingo! Thought I was a drongo! A no-hoper! But stone the crows!!! This was a stinker for me as a reader! A write off!Seeing as idiosyncratic language is a literary winner, I can see myself writing The Great Australian Novel, chockers with the vernacular! But I will just start with this review (in the Great Australian Vernacular ... and at least I provide a translation ... see below)If patois is defined as : a form of a language that is spoken only in a particular area, then I am not going to rate myself as a \"fail\" for not enjoying the struggle to read this! In fact, I didn't enjoy it so much that I didn't finish it!The pigin dialect being used, the constant jargon of the language, was a struggle. And to further fracture the reading, the story itself jumped between points of view and the timeline. And close to 700 pages of unstructured language and plotline.Clever? Maybe. An effort to read? Totally. Translation :Good heavens, mates! Thought I'd need an ambulance! I was done in. At first I thought, it'll be all right. I'll give it a go!! But then I realised that my brain was broken! I was annoyed and about to get angry. Ease up! I had no chance of understanding the language! Thought I was a stupid person! An incompetent person! But wow!!! This was objectionable for me as a reader! A total loss!"}, {"userName": "Hadrian", "userReviewDate": "Nov 21, 2015", "userURL": "http://www.goodreads.com/user/show/4100763-hadrian", "userReview": "What is it with 2015 and genuinely interesting authors winning awards this year? Svetlana Alexievich earned her Nobel, and Marlon James claimed his Man Booker. https://www.youtube.com/watch?v=sjUGX...So what can I say about A Brief History of Seven Killings that isn't already in other reviews or the back blurb? This is above all a book with multiple voices, one which skips fluently from Jamaican patois to African-American vernacular c. 1980-1990 and a few Middle Americans trying to grapple with the former two. I was amused to see all the instances of code-switching between Jamaicans and New Yorkers. It's a great touch, to see how well James controls his use of language. Language becomes a tool of identity, something to shape and shed in an attempt to change one's personal identity, to leave behind the distinctive traces of the past.The book, as you'd guess for a book set in drug wars, assassination attempts, and Caribbean slums, is violent. It is affecting. It's easy enough to make violence pornographic and overdo it, but James still makes it shocking, in detail and psychology. He takes a sly dig at exploitative journalism here too. It's excellent stuff. Far be it from me to determine what 1970s Jamaica was 'really' like, but this is a convincing story of a place in the past I've never been to before. I look forward to reading more from the author."}, {"userName": "Matthew Quann", "userReviewDate": "Apr 17, 2015", "userURL": "http://www.goodreads.com/user/show/22699228-matthew-quann", "userReview": "[When Bam-Bam does cocaine and the writing changes to accommodate his altered world view. Or when Bam-Bam attacks “The Singer’s” house and it is just as messy as you’d imagine an actual attack on a compound would be. (hide spoiler)]"}, {"userName": "Robin", "userReviewDate": "Apr 29, 2018", "userURL": "http://www.goodreads.com/user/show/36555254-robin", "userReview": "PHEW! My brain is as tired and sore as if it has just been through the equivalent of three back-to-back ironman competitions, in blistering hellfire heat. It's taken me over two months to finish (26 hours of audio, plus all the times I had to go back and re-listen to ensure I understood what was going on). I feel relieved that this anything-but-brief historical fiction has come to an end, and a tiny bit proud too, having made it.It's a challenging book, which is something I knew, going in, and which had me reluctant to pick it up, for some time now. In addition to the near-700 pages, there are so many characters: what seems like countless (somewhat interchangeable) gang members, dons of gangs, journalists, a pair of feuding sisters, junkies, CIA agents, a hitman, even a ghost. There's also \"the singer\" (aka Bob Marley), who is integral to the story but who doesn't feature directly as a character. The story spans decades, and takes place in both Jamaica, New York and Miami. It deals with the political climate of Jamaica in the 1970's, relentless gang violence, ghetto life, drug addiction, homophobia, and more. Much of it is written in patois, which takes a while to get used to. My main problem is that there is way, way too much going on in this book. I can 100% appreciate the authenticity of the voices, striking characters and breathtaking scenes (Bam Bam in particular, stands out). I understand why it is the winner for the 2015 Man Booker Prize, for the effective writing and the sheer, vaulted-ceiling ambition of the novel. But I could have done with about 1/3 less... of everything. Pages, characters, plot, themes. I started to wonder at points what is this book really about? I faultily assumed it was about the failed 1976 assassination attempt on \"the singer\". That happens halfway through. While the assassination attempt is a pivotal event, and an important hinge to the story, the book is more about the warring gangs associated with the Jamaica Labour Party (JLP) and the People's National Party (PNP), and their effects on history. By the way, I constantly got the JLP and PNP and their associated gangs mixed up in my addled mind.At some points I was bored, sometimes I was confused. Other times I was riveted, intrigued and moved. It's interminably violent and profane (I got an education in Jamaican insults - batty man and bumbaclot to name a few). It taught me a great deal about a part of the world I knew very little about. It resurrected my love for \"the singer\", too. I'm glad I read it. I understand why others love it. But dang, it was tough going. I guess I don't like to work quite that hard.3.75 starsThe audio book was excellent. All the performers brought their \"A\" game and breathed life into the characters. I highly recommend it!"}, {"userName": "Jill", "userReviewDate": "Aug 06, 2014", "userURL": "http://www.goodreads.com/user/show/2228181-jill", "userReview": "First, let’s pause and pay homage to the genius of a novel well written.Because make no mistake about it: Marlon James has infused sheer genius into this masterwork. Throughout these pages, he is, simultaneously, a lyricist, a historian, a dialect master, a craftsman, and a ventriloquist. In a series of first-person narrations, he channels gang members, informers, drug dealers, CIA agents, a Rolling Stone reporter and even a particularly insightful ghost. Lurking on the periphery is also a fine portrayal and analysis-of-sorts of the Singer, an obvious nod to Bob Marley and the assassination attempt against his life at the end of 1976.Two questions beg answering: “Are there really seven killings?” And “If this is a brief history, why does it take nearly 700 pages to get to the end.” The answers: there are far more than seven killings and the readers will gain clarity about the title eventually. As far as the length, Marlon James seems in no hurry to get to his final destination. His goal is sweeping: to portray the turbulent, often violent history of Jamaica and to highlight that one shining moment when peace might have been possible. (“Dangerous thing, peace. Peace make you stupid. You forget that not everybody sign peace treaty. Good times bad for somebody.”)The conflict, centered upon the animosity between the Jamaica Labour Party (JLP) and the People’s National Party (PNP) provides a glimpse of a Jamaica that tourists don’t see…along with CIA paranoia about the advent of communism (and other “isms”). One of his finest character creations is Nina – who had a one-night stand with the Singer – and who consistently reinvents herself four times in the novel, displaying the impossibility of fully escaping the violence of the past.A Brief History is both sprawling and demanding. Marlon James helpfully provides the reader with a list of characters at the start, and I often had to refer to it. There are times when the complex political situation and drug culture – which weaves its way into the boroughs of New York City – can seem confusing. Yet Mr. James voice(s) are so assured and the writing is often so elegiac that I could easily forgive its excesses. Some of his stream-of-consciousness passages literally took my breath away. I have no doubt that this will be on my personal Top Ten of 2014 list. In fact, it has a secure place on my “Best Books of This Century” list as well."}, {"userName": "Perry", "userReviewDate": "Sep 15, 2015", "userURL": "http://www.goodreads.com/user/show/6354112-perry", "userReview": "Me Bredren, a Lectrifyin' Novel bout Jamaican MobSuch a riveting novel -- the best novel I can recall focused on organized crime, and maybe the best ever mob-centered novel in terms of literary structure and scope. It's destined to make all the lists for best books of this decade, already garnering author Marlon James the 2015 Man Booker Prize.I cannot remember a novel published in the past two decades that is so searing in its combination of unique voice, intriguing characters and captivating storylines, such as when it gives a number of thrilling and feverish first-person accounts for a December 1976 shooting of the character known as The Singer and the immediate, devastating aftermath, and later provides a fascinating, fictional (though plausible) explanation for Bob Marley's (I mean, the Singer character's) death in early 1981 from cancer.Trenchtown part of Kingston, JamaicaThe book is told almost solely in the first person narrative accounts of various characters. You have to do some work on keeping up with the characters for a while, referring to the character list in the 1st couple pages of the novel. Frankly, I started to give up, then as if all of a sudden everything began clicking. It was well worth the effort.The story follows the Greater Kingston, Jamaica gangs (chiefly, the one known as the Storm Posse) and related characters over 3 decades - in Greater Kingston for the first 2, then mainly in New York City from 1985 to 1991.Skyview of Kingston, Jamaica, Oct. 2014NOTE: some females may be offended by the number of times they use the P word and repetitive use of the derogative Jamaican slang term \"bumbaclot.\" You don't wanna know what this means literally, trust me.Aside from that, I cannot recommend this novel highly enough.An' one more ting me need you don fahget, me ute:Don ja go pissin on da gorgon!Gorgon Medusa"}, {"userName": "Liz Janet", "userReviewDate": "Aug 27, 2015", "userURL": "http://www.goodreads.com/user/show/5114433-liz-janet", "userReview": "As I write this review I listen to Bob Marley, ahhh reggae. “Because every man who fight monster become a monster too ..”What a misleading title: it is neither brief, nor are there only seven killings. It should be called “A Long-ass History of a Ton of Murders”A novel that spans decades and characters, from 1976 and the assassination of the Singer(Bob Marley) to to crack wars in the 80′s and the politics of the 90′s. It tells the story of the assassins, drug dealers, ghosts during the unstable times the country found itself in, all with crude language. And it has done so so well, that I deem it as one the best books every written, and one that everyone should read at least once in their life time. Also the first chapter is narrated by Sir Arthur George Jennings, a Jamaican politician, that appears as a ghost since he was murdered.“But in another city, another valley, another ghetto, another slum, another favela, another township, another intifada, another war, another birth, somebody is singing Redemption Song, as if the Singer wrote it for no other reason but for this sufferah to sing, shout, whisper, weep, bawl, and scream right here, right now.” Do not be concerned because there is patois here, the dialogue just gives the characters much more depth, and the audience a bigger understanding. And I have to say, as a fellow Caribbean, this novel felt like coming home, even if English is not the main language of my country and we lack the drug wars, somehow simply his descriptions of the place give you a sort of peace in between the heart-ripping stories.  “And killing don’t need no reason. This is ghetto. Reason is for rich people. We have madness.” I do not deem it necessary to know about the political dynamics of the Jamaica of the time, however it is a great helper, and it will immerse the reader even more into what is like being in a country were the streets rule the politics, since this novel is a war of “isms” (capitalism, socialism, communism, et al). Jamaica at the time was also a bit homophobic as a whole, and in this novel there are a few homosexual male sex scenes, as well as denial of the main gay character about his feelings, which makes the story way more vivid.This is the best I can do for a review, since mostly I just gush about the incredible writing, the intimidating plot-line, the dark cast of characters, and just every single page of this masterpiece."}, {"userName": "Rebecca Foster", "userReviewDate": "Aug 07, 2014", "userURL": "http://www.goodreads.com/user/show/5875398-rebecca-foster", "userReview": "(3.5) James, the son of Jamaican police officers, has spoken of his intention to write about violence in such a way that it is shocking every time, and he certainly succeeds here. This is an edgy, worthwhile Booker pick, but not for the faint-hearted. For the most part, James alternates patois and standard speech, but nearly every section is packed with local slang and expletives. Whether in monologue or dialogue, the many voices form a captivating chorus. One stand-out perspective is Bam-Bam’s; his chapters are full of run-on phrases, remarkably page-turning even as it’s distressing to see how inured he is to sexualized violence.The novel is in five parts, each named after a popular song or album of the time. James’s scope, especially as he follows Josey Wales to the Bronx, is too wide. All the narrative switches, once so dynamic, grow tiresome. At 350 pages this would have been a five-star read. Nevertheless, I’ll be watching the HBO miniseries.\nWelcome to de dreadcircle of carnage – blade to blade, bulletto bullet, body to body, this is our country.\n(From “Filop Plays the Role of Papa Ghede (2010),” \nThe Cartographer Tries to Map a Way to Zion\n by Kei Miller.)(Full review to appear in December 2015 issue of Third Way magazine.)I was delighted to win a free copy through Goodreads First Reads."}, {"userName": "Richard", "userReviewDate": "Mar 16, 2014", "userURL": "http://www.goodreads.com/user/show/4677640-richard", "userReview": "*2015 Update: Earlier in the year I read Marlon James's first novel, John Crow's Devil, and really enjoyed it. So I think I'm going to try a reread of this book sometime in 2015.* Original review below:\n\n\"Dead people never stop talking and sometimes the living hear.\"\n\nI'm really torn with this one. I feel like I should possibly try reading it again. The book is a big sprawling epic that explores a huge colorful cast of fictional characters, all linked to the aftermath of the true life 1976 assassination attempt on reggae superstar Bob Marley (known only as \"The Singer\" right before the Smile Concert in Jamaica.It's a really fascinating story, well-researched and well-conceived by brave up-and-coming Jamaican author Marlon James. It's actually one of the most interesting stories I've read in a long time, told over a span of decades, and combining politics, gang violence, drug wars, journalism, and the CIA. The characters are interesting and detailed, the star of the show being Nina Burgess, who starts in the story as a lost young woman who once had a one-night stand with the singer and at the beginning is now lingering outside of his Jamaican mansion hoping to confront him about her unborn baby and possibly get some child support. But by the end of the book she will have evolved numerous times in a grand character arc.So why three stars? The book and the prose becomes bloated and tedious. Marlon James, undoubtedly a great writer, seems enamored by his own writing and seemed to be flexing his muscles for all to see throughout the book. His prose has loads of poetic style but sometimes it got distracting. But every other reviewer who's read an advanced copy seems to love it. Maybe I shouldn't have started reading this while in the midst of a big job that takes up 12 hours a day and took up most of my attention. That could have really affected my patience. Because although I really enjoyed the story itself and its characters, I felt bogged down with the writing, which wasn't helped by the fact that there were a ton of constantly switching POV characters (there's a useful cast list of 76 characters at the beginning of the book!). I really wanted to like this more but it might have been the wrong time to read it. I will try to tackle it again. I get a sense that the book deserves it.*Advanced copy won at a Goodreads giveaway*"}, {"userName": "Red Panda", "userReviewDate": "Mar 19, 2017", "userURL": "http://www.goodreads.com/user/show/44824883-red-panda", "userReview": "Marlon James' third novel, A Brief History of Seven Killings, is set in a Jamaica that lies exposed like a dead badger at the roadside with all its glistening innards hanging out, being picked at by carrion birds. I mean this in a good way, you understand. James writes like he's painting the Sistine Chapel with words. I've never been to Jamaica but after reading this book the place lives and breathes inside my mind nonetheless. When the focus shifts to the US in the second half of the book, though, James doesn't quite bring it to life quite as well, which is a shame. Maybe it's because I've been to the States; I don't know.The author populates his beautifully painted landscape with a multitude of different characters, some living and some ghostly, all of whom are fleshed out, believable and speak with unique voices... and it felt like most of them took a turn at bat, narration-wise. I still feel like I have a distinctly un-heavenly host of shades living in my skull.The plot is just as wide-ranging as the cast. It encompasses multiple continents and many decades. It's anything but brief and includes an awful lot more than seven killings. (This has been said by virtually every reviewer of this book but, Hell, I never claimed to be original.) It inevitably contains almost everything life has to offer and then some. To be honest, I was completely swept up by this book and carried along a very long, rocky road by a very skilled driver. The reason I haven't given this great book five stars is that it's such an exhaustive, comprehensive, far-reaching complexity of settings, characters and events that it very nearly collapses under its own weight at times. Also, when all is said and done, I wasn't entirely certain what the author was actually trying to say... I mean, drugs and murder and crime and corruption are bad, mmmKay, is a valid message that bears repeating but... it's also kind of obvious to anyone with at least half a brain. Did I miss some deeper message? Hell, it's certainly possible.Please don't let my (minor) criticisms put you off reading this book though; it really is something quite special and I'll definitely be reading more by this author."}, {"userName": "Simon", "userReviewDate": "Aug 17, 2016", "userURL": "http://www.goodreads.com/user/show/7232880-simon", "userReview": "What a book. Almost a year after it won the Booker and The Green Carnation Prize, which I founded, and I have finally read it. It's not been an easy read, it's not been a pleasant read but it's a fantastic read. Gritty, violent, thought provoking, confronting and a real challenge but I've come away from it feeling as enriched and shocked as I have put through the ringer. I need more time with my thoughts."}, {"userName": "Anthony Vacca", "userReviewDate": "Oct 04, 2015", "userURL": "http://www.goodreads.com/user/show/27183668-anthony-vacca", "userReview": "Reader Response A: Hey, waiter! What the hell gives, mac? There's a goddamned experimental novel in my crime novel! You expect me to read this shit?Reader Response B: S'il vous plaît, monsieur? Terribly sorry to be a bother, but there must have been some confusion with my order. You see, there seems to be a crime novel in my experimental novel. I'm afraid I don't have quite the palate for such things."}, {"userName": "Trish", "userReviewDate": "Jan 16, 2016", "userURL": "http://www.goodreads.com/user/show/1826682-trish", "userReview": "This book is not brief; it has many more than seven killings; it redefines what a novel is. As a reader I was gratified to read in the Acknowledgements that James himself didn’t know this was a novel, either, until someone pointed to possible parallels for the style in Faulkner’s As I Lay Dying. James drew inspiration from Roberto Bolaño, Orhan Pamuk, Salman Rushdie, and Gay Talese among others, and the work is staggering in sheer inventiveness. The storyline is anything but simple, told from multiple viewpoints, but basically some people killed ‘the Singer’ and nobody knows why. But while we are looking for answers, we get a whole lotta reasons for why people want to be close to the Singer or are jealous of him or are afraid of him. And it is these things that become the story. I began by listening to the HighBridge audio production of this novel, performed with enormous skill by an exceptional actor ensemble, but soon found I wanted to see the text. James had me in such awe of what he was doing that I wanted to see the overall structure, introduction, dedication, every little thing. It is a game-changing piece of work. It won’t change most novelists work—James is in the master class—he changes how novels function. And his voice…it is hard to describe the seeing-ness of his voice. It seems almost trite to say he got the woman thing. He got everybody’s thing. James says Nina Burgess was the voice that most clearly expressed what he as an author was thinking, but it was Kim Clarke speaking in February of 1979 (the first voice in a section called Shadow Dancin’) that broke my heart in two. The violence…James says \"violence should be violent\"... and he obliges. It is a reflection, hard to believe, but a reflection of how we do not have to live. Set alternately in Jamaica, New York, and Miami, this is what happens, what we have in store with bad judgement and poor leaders. The book is very violent, and the language is both terribly funny and terribly ugly, the emphasis on terrible. It is gut-punching, air-sucking, awe-inspiring terrible. Shocking.I am not entirely sure the book needed to be so long, but the sheer genius of the characterizations meant we didn’t really care if it was all meant to be there or not. It is a little hard to get one’s arms around the novel, what with all the pyrotechnics, but like Thomas Pynchon’s Gravity's Rainbow, or David Foster Wallace’s Infinite Jest, who the heck cares?There are references to Syria, Iran, and Saudi Arabia in here when the CIA operatives were speaking, as well as other nefarious activities and dirty tricks by representatives of other countries, but James warns us not to read this work as history. It is fiction on a framework of research into a time that was interesting to James.In the August 25, 2016 Charlie Rose interview James makes the comment that Jamaica’s racism is very different from America’s: “In Jamaica [racism] is endemic. We never faced it, but we didn’t have to, if everyone was bleaching their skin & trying to get their skin whiter and whiter until we’re full free.” That interesting and provocative comment doesn’t entirely explain the differences between the slave legacy in America and colonialist racism in Britain, but gives us something to ponder.In an interview with Kima Jones and reprinted on her blog, James tells us that the post colonialist mindset and unconscious racism has been picked up by white women: \"I have very little patience for…stories and…movies [that use white characters to legitimize the experience of black characters]. The traditional ‘white guy goes through a three-dimensional experience served by one-dimensional black people.’ Funny enough, the people who are doing it a lot now are white women. I’ve spoken about this, and I’ve never been shy to talk about it. I had a Facebook post where I said, ‘White women, please don’t become the new Orientalist, because we didn’t like it when white men did it.’ This sort of ‘I had my three-dimensional, life-changing experience surrounded by all of these Negroes or all these Asians or all these people from the South Pacific.’ Enough…I didn’t want the existence of my white characters to be validation or justification or proof of the existence of these other, many Jamaicas within Jamaica.\"See what I mean? Provocative. Interviews with Marlon James have left me like a deer in the headlights, too stunned to complete my next thought straight away. I am more used to his answers to common questions now, but he can still be utterly surprising. A few links to some of his interviews, all of which are interesting, are below. Indie Wire, Dec 24, 2015 GQ Review, Oct 13, 2015 Rolling Stone Review, Jan 6, 2016Charlie Rose interview, Aug 25, 2016 The Guardian , October 14, 2015  The Telegraph, Oct 13, 2015 Kima Jones Blog, undated.  NYTimes, Sept 21, 2014 Vogue, Oct 28, 2105"}, {"userName": "Janet", "userReviewDate": "Jan 17, 2015", "userURL": "http://www.goodreads.com/user/show/2013209-janet", "userReview": "This book is probably not for you. I know that seems an odd way to begin a book review, especially a book that you’ve given 4 stars. But allow me to explain.A Brief History of Seven Killings is hard work….unless you are Jamaican or a Jamaican history scholar, unless you are familiar with drug culture and the workings of the CIA. Or unless you are like me, a person who loves politics and foreign cultures, who doesn’t have delicate sensibilities and who doesn’t mind doing some research to understand a story that is nearly incomprehensible at first glance.Marlon James is a stunning writer, if a little overly ambitious. The book (at 700 pages) is anything but brief and details more than seven killings. The seven killings refers to the men that were involved in the attempted assassination of Bob Marley in 1976 and the book ends when the last of those seven is killed in 1990. A lot of the true circumstances surrounding the lives and deaths of these men is not known but James successfully brings them into a vivid, if hypothetical focus. This is what the best historical fiction does and James totally succeeds on this level. His characters are finely drawn. His sole female character, Nina Burgess, is one of the most interesting female characters I’ve encountered in recent times. It’s something to behold as she reinvents herself, again and again, to escape the violence (and memory) of Jamaica.James uses a very effective technique to relate a story that spans nearly 20 years. He tells it from the point of view of multiple characters. In fact, there may be too many points of view…..this can be a little messy but is a way to tell a far reaching story without a long, boring narrative. There is a cast of characters in the front of the book that many readers have criticized as having spoiled the fluidity of their reading experience as they flipped back and forth to figure out who was who. So again, if lack of fluidity bothers you, maybe this book is not for you.Let me tell you what I had to do to read this book.First, I bought the hard cover, tried to read it and gave up in frustration.Next, I purchased the audio and tried listening but that really wasn’t working for me either.Then, I spent a whole afternoon researching Bob Marley, reggae music and Rastafarianism,After that, I read this research paper which gave me some background on the politics of Jamaica. http://debate.uvm.edu/dreadlibrary/ke... I’d like to read the other papers in The Dread Library when time permits.Then I read/listened to several interviews with Marlon James about the book.Finally, I listened to the audiobook and followed along with the book on my lap and the urban dictionary by my side. It took me a long time.And I still would not claim that I understood every passage or reference.But I found it extremely rewarding and the truth is, I would like to read it again someday (maybe when I retire). It is that rare combination of an interesting tale, based on fact, that actually teaches you something. I couldn’t help but notice that a lot of the problems experienced in Jamaica during the time covered by this novel were caused by a “wealth gap”. In that sense, it might even be considered a cautionary tale for what we are currently going through in this country. More Marlon James please!"}, {"userName": "·Karen·", "userReviewDate": "Apr 18, 2016", "userURL": "http://www.goodreads.com/user/show/1652898-karen", "userReview": "Can you dig it, dingledoodies?\nFutile to say that this is not for the faint of heart, as they would never get past the four page cast of characters, past the opening chapter written by a dead man, his head a smashed pumpkin and two arms bent in a way that arms aren't supposed to bend, past the screams and the blood and the vomit, the dirt rising in a flood then back down like a reflux, past the first chapter in Bam-Bam's voice, gut-wrenching, harrowing: you want change? We will have to wait and see, but all we can do down here in the Eight Lanes is see and wait...and the boys like me not in school very regular and can't read Dick and Jane but know Coca-Cola, and want to go to a studio and cut a tune and sing hit songs and ride the riddim out of the ghetto but Copenhagen City and the Eight Lanes both too big and every time you reach the edge, the edge move ahead of you like a shadow until the whole world is a ghetto, and you wait..Seven killings? More surely, I gave up counting. Killing don't need no reason. This is ghetto. Reason is for rich people. We have madness.Madness, this kind of untamed narrative energy. Wild, demanding, bold and vibrant with guts and greasy slicks of blood. Madness - not crazy people madness, but angry madness, hungry madness, bitter bile in the throat madness, CIA madness, gun madness. And you read, and every time you reach the edge, the edge move ahead of you like a shadow."}, {"userName": "Robyn", "userReviewDate": "Nov 03, 2015", "userURL": "http://www.goodreads.com/user/show/25037254-robyn", "userReview": "Honestly, I don't really know how to rate this one. It's technically brilliant, weaving together disparate voices into a unified story across multiple decades. The subject matter is brilliantly researched. James's use of Jamaican patois in a prize-winning literary novel is incredibly important. But, I just kept bouncing off this book. The violence of the first half is indelible and unrelenting (as intended) and, for me, made it an incredibly difficult read. The characters tend to be profoundly damaged people, caught in a cycle of violence and ghetto life, which makes them difficult to like. (Nina Burgess, though, I loved.) I did not enjoy reading the first 400 pages or so. In the end, I'm glad I did. The last two sections were my favourite, and where it began to come together for me. I feel that I understand the modern Caribbean more now (which is good, since while I know the history of the region quite well, it stops at about 1800! Not exactly current events...), and I appreciate James's work to illuminate this period."}, {"userName": "João Carlos", "userReviewDate": "Jul 29, 2015", "userURL": "http://www.goodreads.com/user/show/17544299-jo-o-carlos", "userReview": "”Breve História de Sete Assassinatos” - recebeu o Man Booker Prize for Fiction em 2015 - é o terceiro romance de Marlon James um escritor que nasceu em 1970 em Kingston, na Jamaica. A premissa de ”Breve História de Sete Assassinatos” é avassaladora: a 3 de Dezembro de 1976, o cantor jamaicano Bob Marley sobreviveu a um ataque perpetrado por sete homens armados que invadiram a sua casa em Hope Road, em Kingston, Jamaica, acabando ferido sem gravidade no peito e num braço. Dois dias depois, Bob Marley e a sua banda os The Wailers actuavam no concerto “Smile Jamaica”, organizado pelo então primeiro-ministro Michael Manley, numa tentativa de aliviar a tensão e a violência que alastrava entre gangues e grupos políticos rivais, na véspera das eleições jamaicanas. A narrativa de ”Breve História de Sete Assassinatos” abrange um pouco mais do que três décadas, num período extremamente conturbado da história da Jamaica na década de 1970 e início da década de 1980, em que a ilha é inundada de armas, numa presença constante de agentes da CIA; com uma estrutura impressionante, mas de difícil acompanhamento, com inúmeros narradores, mais de setenta e cinco personagens, resumidos em três páginas no início do romance – de obrigatória consulta ao longo da leitura; ora aparecendo ora desaparecendo, com numerosos saltos temporais em profusos cenários, que vão da selva urbana de Kingston, na Jamaica, onde impera a violência entre gangues, ligados tráfico de drogas e armas; à corrupção policial e à turbulência política; passando por, Tel Aviv, Espanha, Gaza, Angola, Miami e Nova Iorque, entre outros locais. ”Breve História de Sete Assassinatos” é um romance ambicioso e imaginativo, excessivo no contexto e na narrativa, com uma escrita tensa, onde abunda o patois jamaicano (língua crioula - de difícil acompanhamento – valorizando a excepcional tarefa do tradutor José Miguel Silva), num dos períodos mais violentos e truculentos da história da Jamaica, num desfile emblemáticos de membros de gangues, sicários, políticos, agentes da CIA, jornalistas e com a presença inesquecível de o Cantor, como sempre é referido, Bob Marley."}], "description": "WINNER OF THE 2015 MAN BOOKER PRIZE FOR FICTION From the acclaimed author of The Book of Night Women comes a masterfully written novel that explores the attempted assassination of Bob Marley in the late 1970s.On December 3, 1976, just before the Jamaican general election and two days before Bob Marley was to play the Smile Jamaica Concert, gunmen stormed his house, machine guns blazing. The attack nearly killed the Reggae superstar, his wife, and his manager, and injured several others. Marley would go on to perform at the free concert on December 5, but he left the country the next day, not to return for two years.Deftly spanning decades and continents and peopled with a wide range of characters—assassins, journalists, drug dealers, and even ghosts—A Brief History of Seven Killings is the fictional exploration of that dangerous and unstable time and its bloody aftermath, from the streets and slums of Kingston in the 70s, to the crack wars in 80s New York, to a radically altered Jamaica in the 90s. Brilliantly inventive and stunningly ambitious, this novel is a revealing modern epic that will secure Marlon James’ place among the great literary talents of his generation.", "title": "A Brief History of Seven Killings", "url": "https://www.goodreads.com/book/show/20893314.A_Brief_History_of_Seven_Killings", "average": 3.86, "cover": "https://images.gr-assets.com/books/1399045083l/20893314.jpg", "reviews": 3091, "authors": [{"url": "https://www.goodreads.com/author/show/56064.Marlon_James", "name": "Marlon James"}], "type": ["Fiction", "Historical", "Abandoned", "Literary Fiction", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/20893314-a-brief-history-of-seven-killings", "http://www.goodreads.com/book/show/23834772-a-brief-history-of-seven-killings", "http://www.goodreads.com/book/show/22750567-a-brief-history-of-seven-killings", "http://www.goodreads.com/book/show/25694095-a-brief-history-of-seven-killings", "http://www.goodreads.com/book/show/25488708-a-brief-history-of-seven-killings", "http://www.goodreads.com/book/show/24611846-a-brief-history-of-seven-killings", "http://www.goodreads.com/book/show/22912371-a-brief-history-of-seven-killings", "http://www.goodreads.com/book/show/24646670-a-brief-history-of-seven-killings", "http://www.goodreads.com/book/show/33146229-breve-hist-ria-de-sete-assassinatos", "http://www.goodreads.com/book/show/4682558-the-book-of-night-women", "http://www.goodreads.com/book/show/97566.John_Crow_s_Devil", "http://www.goodreads.com/book/show/29427714-marlon-james-collection-3-books-a-brief-history-of-seven-killings", "http://www.goodreads.com/book/show/28191591-black-leopard-red-wolf", "http://www.goodreads.com/book/show/40204932-der-kult", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}