{"ratings": 1082, "userreviews": [{"userName": "Nikki ", "userReviewDate": "Nov 22, 2012", "userURL": "http://www.goodreads.com/user/show/223837-nikki", "userReview": "I couldn't quite resist when I saw this in Waterstones -- particularly as I'd been staring at it throughout a frankly embarrassing asthma attack (let it be known that human goodness is not just a myth: several random passers-by collected around me and helped me administer my inhaler, and someone fetched a Waterstones employee to fetch a glass of water from the staff room -- it all rather belied the cynical stuff about how people always assume someone else is going to help you; or maybe it just proves that people who shop for books are excellent people?). I used to undervalue Joanne Harris a lot by virtue of the fact that I'd seen plenty of people around reading her books. Bah, I thought, with that special brand of snobbery: bestsellers. And Johnny Depp played one of her characters in a film adaptation...? Oh, my.So when I did read one of her books, I smuggled it in past myself. And then I read it in an evening, glorying in her prose and sounding out each word. And then I read another of her books, and another -- and then it hit me that she's one of my favourite authors, in a special way that guarantees I will buy each of her books as they come out without fluttering excitement, but with a smile of familiarity, feeling the promise of comfort (even when the stories themselves are discomforting -- lookin' at you, blueeyedboy, Gentlemen & Players).So anyway, yes, I bought this book -- and then saved it, for when I needed it. It turned out to be in the middle of a case of the blahs, when my dissertation wasn't shifting an inch and my girlfriend wasn't online, and... so on. It didn't wave a magic wand and cure me, that's for sure, but it got me interested, and curious, and curiosity is good for the mind. I found some of the stories a little predictable, but everywhere I found what I read Joanne Harris for: that voice, that prose, that imagery, that sure touch. I think my favourite stories were 'Cookie' and 'Dee Eye Why', but I enjoyed all of them.I can't promise you'll have the same experience, of course. You might read one of Joanne Harris' books and come away feeling entirely different to me in every respect. But don't sniff and turn your nose up without trying, for goodness sake."}, {"userName": "Cat", "userReviewDate": "Apr 14, 2014", "userURL": "http://www.goodreads.com/user/show/9728092-cat", "userReview": "A cat, a Hat and a Piece of String is Joanne Harris's second collection of tales. Children who ride rapids, internet ghosts, Norse gods walkings around in Manhattan, a new-born girl made of candy, a very special café in an old railway station, a house where it's Christmas all year round. These are some examples of what can be read in this book.To be honest, I was expecting something a little better. Not that these stories are horrible, it's just that weren't that special. In fact, I couldn't feel moved by any of it. And there were times when I didn't really feel like go back to reading this book.I think Jigs & Reels was much better."}, {"userName": "Licinia", "userReviewDate": "Feb 01, 2018", "userURL": "http://www.goodreads.com/user/show/21750505-licinia", "userReview": "Este é um livro de contos, de 16 contos mais precisamente, e como é normal gostei mais de uns do que de outros, houve 5 deles que gostei mesmo muito. Um desses 5 deixou-me a reflectir durante um bom tempo porque o desfecho foi obscuro. Estes contos têm um quê de sabedoria, de magia e de humor. Posso dizer que no somatório deles todos o saldo foi francamente positivo!"}, {"userName": "Fabio", "userReviewDate": "Mar 12, 2018", "userURL": "http://www.goodreads.com/user/show/37304285-fabio", "userReview": "A While in DisneylandAmmetto di aver apprezzato alcuni romanzi di Joanne Harris, anni fa. Questa raccolta di racconti mi pone di fronte a due alternative: o i miei gusti sono cambiati radicalmente, oppure l'Autrice ha fatto un passo falso non indifferente. Condizioni che, in effetti, potrebbero essere entrambe vere.Dietro un titolo curioso (va riconosciuto) si nascondono 16 racconti equamente divisi tra lo zuccheroso tendente all'iperglicemico, il buonismo politicamente corretto e socialmente impegnato, il mitologico à la vorrei essere Neil Gaiman ma non posso, un paio di incursioni nei territori delle nuove tecnologie. Si salva pochissimo, a mio avviso: i tentativi di emulare il Gaiman di American Gods hanno una scintilla, ma il fuoco non divampa comunque; l'idea di rileggere Il fantasma dell'Opera non è malvagia, ma in quel campo è meglio virare sul geniale musical Phantom of the Paradise di Brian de Palma. Musa, in fin dei conti, si salva in virtù della sua felinità (ma quel discreto e omonimo film con Sharon Stone e Andie MacDowell...). Il fondo, per me, lo si tocca con i racconti che vorrebbero trattare temi rilevanti: i due dedicati all'infanzia in Africa e i due che hanno per protagoniste due arzille vecchiette c/o casa di riposo.Il voto è più che altro una reazione allergica, non me ne vogliano gli estimatori.Let it go... https://www.youtube.com/watch?v=PAJdU..."}, {"userName": "Jonnie", "userReviewDate": "Oct 25, 2014", "userURL": "http://www.goodreads.com/user/show/34715306-jonnie", "userReview": "I'd never read any of Joanne Harris' books, only heard about them: Chocolat, Five Quarters of the Orange, Blackberry Wine, the titles practically make me drool, so I didn't know what to expect when I picked up her collection of short stories. I was thinking something light and rambunctious, a warming collection of tales, and what I got was something different entirely. Some of them made me laugh, some made me cry, some were wonderfully thought-provoking and some truly made me appreciate what I have. Harris combines wild fantasy with bittersweet reality and I recommend this book for a cozy Sunday couch read with tea.Favorites:Faith and Hope Fly South Would You Like to Reconnect?Rainy Days and Mondays The Ghosts of Christmas Present CookieDee Eye Why Faith and Hope Get Even"}, {"userName": "Arttemizza", "userReviewDate": "Mar 02, 2015", "userURL": "http://www.goodreads.com/user/show/7462102-arttemizza", "userReview": "Li até a página 70 mas lamentavelmente os contos não me cativaram a continuar"}, {"userName": "Blair", "userReviewDate": "Apr 26, 2014", "userURL": "http://www.goodreads.com/user/show/272909-blair", "userReview": "3 stars is perhaps a slightly stingy rating: I enjoyed all of this, but collections of short stories are always a bit patchy, and I was hoping for more variation in style/tone. There's a good range of subject matter though: ghosts on the internet, an Elvis impersonator who's also a private detective, an unconventionally haunted mansion, two rebellious old ladies in a retirement home, gods of rain and fire running around Manhattan, a house where it's permanently Christmas (will seem more sinister than it's supposed to if you've read NOS4R2). My favourite, 'The Game', is about an all-consuming computer game which leads its devotees to ruin, and reads like a particularly good creepypasta. I liked the ways in which the stories intersected and overlapped: many seem to be set in the same town, and characters from one story frequently show up in another. This was an easy to read, consistently enjoyable compilation, if not enormously memorable. I'd certainly read more."}, {"userName": "Andrea Wall", "userReviewDate": "Feb 02, 2013", "userURL": "http://www.goodreads.com/user/show/4611476-andrea-wall", "userReview": "4.5 stars Joanne Harris is really one of my favourite authors. Her books do not disappoint. And even though she has written many, I am captivated by each one and am never bored. Harries's first short-stories collection Jigs & Reels was the first collection of short stories I ever read out of school and were the first ones that did not make me want to rip out all my hair. :) she is imaginative and all of her stores are scary, thought-provoking, magical, funny and have a very strong voice. A couple of the ones in this collection were a tad predictable. The Bedford Falls ones didn't really grab me much, but Faith and Hope really did. The second one in this book (the third one in total) was so good it actually made me angry. I wanted to go and slap that stupid Lorraine in the face. If you aren't a fan of short stories I still suggest you give this one a try. Really."}, {"userName": "Lolly K Dandeneau", "userReviewDate": "Sep 24, 2012", "userURL": "http://www.goodreads.com/user/show/1412404-lolly-k-dandeneau", "userReview": "I liked it but normally I am not a fan of short stories to begin with so that can really color my view. I didn't enjoy the short stories as much as I have her novels. Some of the stories were sweet but I wasn't as charmed as I usually am by all things Harris writes. I will say the Christmas story was strange and stayed with me. I was also fond of the little old ladies. Good but not great"}, {"userName": "Saria  Beainy", "userReviewDate": "Sep 24, 2017", "userURL": "http://www.goodreads.com/user/show/4104058-saria-beainy", "userReview": "Let's start with: Chocolat is one of my favorite movies, and the book is on my TBR list. I haven't read a book for Joanne Harris before, however, and I think this was a good start.The book is an assortment of short stories, each with a completely different setting with some related to the others, but most stand alone. In her Forward of the book, Harris states that the stories are all linked through an underlying subtle theme that invested readers would notice. I think it's safe to say that, halfway through the book, I noticed the theme. And it was disturbing.While most stories look \"normal\" from the outside, all of the stories in the book are sort of... sick. Seriously, mentally sick. All of the characters have gone through some sort of tough period - though some are not so tough, but still - and have shown quite the mental health sicknesses following these periods.Most of all, I loved Harris' tendency for open-ended stories that would require the reader's imagination to finish them. Like \"What did that character see at the end of that chapter?\" \"Was that supposed to be something supernatural or is it just in his mind?\" \"What happened next?!\"I won't divulge any more info, as the slightest detail would give off any of the 10 to 30-page stories. Simply, pick up this book if you're in for some light reads that give your mind an exercise."}, {"userName": "Tracy", "userReviewDate": "Aug 15, 2017", "userURL": "http://www.goodreads.com/user/show/12236637-tracy", "userReview": "I really enjoyed this collection. Mischievous, fun and with some cracking good stories. Her fascination with the gods living amongst us weaves through many of the tales. I loved the rain god who fell for a sun goddess, and the writer who found inspiration from the mundane owners at the railway café (Muse). Faith and Hope featured in several stories: two old ladies rising about the humiliation of a bully in a care home for the elderly to seek justice and respect. Faith and Hope definitely could fill their own collection. This collection demonstrates that short stories don't have to be serious or gloomy to get a message across."}, {"userName": "Valantin", "userReviewDate": "Dec 28, 2017", "userURL": "http://www.goodreads.com/user/show/61029120-valantin", "userReview": "Не си спомням друг път да съм попадала на такъв хитър подход за сборник с разкази, а много ги харесвам. Тук има 15-16 разказа, обединени в няколко сюжетни гнезда. Аз лично изпитах огромно задоволство от живота на Вяра и Надежда, а онези богове на разните стихии, ми бяха адски забавни.Книжката е прекрасна, авторката въобще не е за подценяване."}, {"userName": "Ana", "userReviewDate": "Jan 01, 2017", "userURL": "http://www.goodreads.com/user/show/50899005-ana", "userReview": "Sou fã assumida de Joanne Harris, mas até hoje não tinha saboreado o seu lado de contista. Lembro-me de há uns anos atrás ter agarrado entusiasmadíssima a sua mais recente obra – Danças e Contradanças havia sido lançada há dias – e tê-la pousado de imediato quando me dei conta de que era uma compilação de contos. Contudo, hoje em dia, após ter lido e me ter deliciado com obras deste género injustamente considerado menos interessante, não tenho qualquer pejo em admitir essa minha falha (que durante tanto tempo prejudicou os meus hábitos de leitura) e em apostar na compra de obras como esta que acabei de ler estava 2016 a dar os últimos suspiros.Quem, como eu, é uma acérrima seguidora de Joanne Harris, sabe que as suas histórias estão povoadas de personagens pouco ortodoxas, enigmáticas, que vão abrindo frechas a um passado e muitas vezes a um presente tortuoso, mas que nos conquistam e nos absorvem de forma inequívoca. Recordo-me de Vianne, a protagonista da trilogia de Chocolate, de Framboise, de Cinco Quartos de Laranja, ou de Madeleine, de A Praia Roubada. São personagens pouco sociáveis, páridas, desconfiadas, habituadas a ser pouco amadas e olhadas com indiferença, medo ou despeito pelos outros. São personagens que facilmente consideraríamos como anti-heróis ou anti-heroínas. Mas são personagens que prefiro mil vezes a personagens boazinhas, gentis e amadas por todos e todas.Em Um gato, um chapéu e um pedaço de cordel encontrei mais um punhado dessas personagens. Em cenários mais diversificados, que saltam do continente africano, passam pelo europeu e ainda viajam até ao americano. E em tempos que correm como os rápidos do conto inicial ou que se espreguiçam como um gato gordo a apanhar banhos de sol. Mas com o cunho pessoal de Joanne Harris, sem réstias de dúvidas.Não encontrei o mesmo sabor em todos os contos, como é óbvio. Engoli, sem lhes encontrar o correspondente travo, os contos “O Jogo” ou “Dríade”; enterneci-me com “Bedford Falls não existe”, “Faça você mesmo” ou “Os espíritos de Natal presentes”; contorci-me de compaixão perante dores maternais em “Gostaria de voltar a estabelecer contacto?” e “Cookie”; apoiei e regozijei-me com a vivacidade e motivação de sentirem-se vivas de Faith e Hope, duas anciãs despejadas num lar de terceira idade e saboreei, como se de um chocolatinho se tratasse, a história de amor de “Fantasmas na Máquina”. Contudo, nenhum dos dezasseis contos me arrebatou. Não como o fizeram as obras que mencionei no início desta opinião e que já me levaram a reler duas delas.Por tudo isto, por tudo o que referi, não posso dizer que me tenha arrependido de ter, em julho, adquirido esta obra. Também não posso dizer que tenha sido uma das melhores aquisições de 2016. Senti-me de novo embrenhada no mundo muito peculiar de Joanne Harris. Criei empatia com a maioria das personagens que habita esta compilação de contos. Mas queria mais. Não narrativas mais longas, mas sim narrativas, contos que me deixassem torcida, com vontade de morder-me de entusiasmo, com o meu íntimo quentinho e fervilhante de emoções contraditórias. Como fiquei com a história de Framboise, por exemplo. Pode ser que encontre tudo isso na última obra que a autora editou por cá e que ainda não habita a prateleira da estante onde já habitam onze dos seus livros. Pode ser que o ano que já está aí me reserva essa surpresa. Ou pelo menos que se inaugure com uma leitura mais preenchida do que esta…NOTA – 07/10"}, {"userName": "Elysya Scerbo-pasta", "userReviewDate": "Apr 30, 2014", "userURL": "http://www.goodreads.com/user/show/23242550-elysya-scerbo-pasta", "userReview": "This book was so utterly charming it took me by surprise. I had initially picked it up after reading the back quickly and finding it intriguing.I'd never read Harris before, but I'm certainly glad I did. Her ideas are so simple, yet so interesting, and pulled off in such a way that they really make the reader feel something. Her \"horror\" shorts were so haunting, and I adored her stories of Faith and Hope, the elderly dears living in a home and facing their own challenges.Her characters are very intriguing, and I just adore her writing style. I had a hard time putting it down. I would read one story and tell myself, \"Ah, just one more\", until the next thing I knew I reached the end.I really look forward to reading more from this author!"}, {"userName": "Sofia", "userReviewDate": "Jul 05, 2015", "userURL": "http://www.goodreads.com/user/show/10152134-sofia", "userReview": "The first thing I have to say is: OMG, the Britishness of it. Seriously, I could basically hear the writer speaking the words in my head (and I've never heard her speaking in my life).The second thing: these has lots of different stories. Some I liked, some made me feel kind of... I don't know, uncomfortable, I'd say. My favourites were the ones that had to do with gods. Then there was one about a girl in a river, and the one about the computer game was super creepy and the last one was simply... the best ending, I think.So yeah, lots of different stories with different voices. Some you'll like, some you won't, but all in all a pretty good book and easy to read - even when I didn't know some of the words' meaning."}, {"userName": "Heather Jensen", "userReviewDate": "Dec 13, 2012", "userURL": "http://www.goodreads.com/user/show/11432422-heather-jensen", "userReview": "I loved A Cat, A Hat and a Piece of String. It was wonderful to meet new characters, and revisit old friends. To see what Faith and Hope were up to was almost bittersweet, for in \"Jigs and Reels\" (another of Joanne Harris' collections of short stories) they manage to escape to go shopping, yet now their freedom has been curtailed. I loved seeing Lucky again, and reading the stories of the other Aspects. I haven't read any of Joanne's books for a while, and it felt wonderfully refreshing to open the pages of her stories again."}, {"userName": "James Fountain", "userReviewDate": "Sep 17, 2014", "userURL": "http://www.goodreads.com/user/show/1012702-james-fountain", "userReview": "Cleverly written, and Harris is careful not to make the stories over-long, as many short stories tend to be. The magic realism in her works sets her apart from other authors, and is a delight in this age of granite determination and humdrum normality. She adds a spark to the world-weary reader's existence, and makes him or her see the world from her own unique point of view. Tired old topics become mystical and ethereal under her gaze."}, {"userName": "Grace", "userReviewDate": "Oct 19, 2015", "userURL": "http://www.goodreads.com/user/show/46379511-grace", "userReview": "I don't really want to label this book as being good or bad but it helped me to discover that I really do not enjoy books of short stories. I actually didn't complete reading the book because I couldn't get into it. I don't feel able to really sink into the stories because by the time you have, the story is ending and the next one is starting! This is just my opinion, others might love short stories but they are not for me. I much prefer a book that I can really delve into."}, {"userName": "Gillian De'Ath", "userReviewDate": "Feb 04, 2013", "userURL": "http://www.goodreads.com/user/show/8109886-gillian-de-ath", "userReview": "I loved these short stories. I've been a Joanne Harris fan for such a long time. Some of the first books I read when I started reading for pleasure again were Joanne Harris. These stories are like a comfort blanket. They were so engaging and I felt like I just flowed through them. This was such a calm and soothing read."}, {"userName": "Nicky", "userReviewDate": "Feb 06, 2014", "userURL": "http://www.goodreads.com/user/show/11268117-nicky", "userReview": "I thoroughly enjoyed this book. The characters are varied and believable and that some of them crop up in a number of the stories just illustrates how the author has given them life and has come to care about them."}, {"userName": "Lynn", "userReviewDate": "Feb 14, 2016", "userURL": "http://www.goodreads.com/user/show/11008761-lynn", "userReview": "A brilliant collection of short stories from one of my favourite authors."}, {"userName": "Pamela Scott", "userReviewDate": "Aug 06, 2015", "userURL": "http://www.goodreads.com/user/show/5554077-pamela-scott", "userReview": "RIVER SONG: A group of children earn a pittance by risking their life leaping into the Congo in exchange for paltry money from tourists. The only girl in the group is banned from working because she’s a girl and in an act of defiance dares the oldest boy to leap into the most dangerous part of the rapids. She manages to pull it off and the boy almost dies. The girl is allowed to continue working the river.I found River Song very touching and moving. Harris includes a little paragraph at the start of each story where she discusses how the tale came about. In her introduction to River Song, Harris mentions there are actually children in the Congo who earn money this way. I thought this story offered interesting insight into a different way of life.FAITH AJND HOPE FLY SOUTH: Two old women in a nursing home are banned from the annual outing to Blackpool. They are told this is because they didn’t sign up for the trip. This has never been required before and the real reason appears to be because they women run off and went to London on a day trip a few months before. They are left behind in the home. Chris, a care worker with a soft spot for them sets up a pretend trip to Blackpool in the home complete with sand and sweets.Faith and Hope Fly South was a lovely story. I found some aspects of it funny and other aspects quite sad. In some ways, Harris uses this story and these memorable characters to illustrate the cruelty, bullying and neglect in care homes.THERE’S NO SUCH PLACE AS BEDFORD FALLS: An old man loves the festive season so much he has Christmas every day. His house is decorated all year round and he has Christmas dinner every day. He even named his house Bedford Falls after the town in It’s A Wonderful Life.I loved There’s No Such Place As Bedford Falls. It’s a heart-breaking story underneath the Christmas cheer. A local newspaper did a feature about him and turned him into the resident freak. His ‘lady friend’ left him because she couldn’t take all the Christmas stuff. The narrator is a sad, lonely old man. Hankies at the ready!WOULD YOU LIKE TO RECONNECT?: A woman enjoys keeping tabs on her son’s life via Twitter when he’s at University. They communicate a lot online and she has a wide circle of followers and friends because of this. She’s heartbroken when he’s killed in a head on collision with a truck and the news spreads like wildfire online. She starts to receive messages from what appears to be her son’s ghost. They comfort her.Would You Like To Reconnect? is a great little story. I thought Harris offered a quite original and unique ghost story.RAINY DAYS AND MONDAYS: A Rain god living in Manhattan, New York meets a beautiful young girl one day called Sunny who loathes the rain and always hides inside when it comes on. He controls the rain to make sun shine for her and starts to fall in love. He believes she is a Sun god but has forgotten her true identity.Harris offers another great, original story. I like her take on Norse mythology.DRYAD: A young woman meets an old woman in her local park who constantly paints beautiful pictures of the same tree. The old woman reveals the tree is the love of her life. She left her husband because she loved the tree and almost died of malnourishment and pneumonia by living beneath it for several days.Another great, original story. I found Dryad to be funny, sad and sort of creepy. Harris reminded me of the stories I’ve read in trashy newspapers about people having sex with cars and other inanimate objects. Is the old woman off her rocker or did she fall for a sexy tree spirit?HARRY STONE AND THE 24-HOUR CHURCH OF ELVIS: A man makes his living as a well-known Elvis impersonator and by night he solves crime. A friend tells him he suspects his wife is cheating on him and follows her and her ‘lover’. He is spotted and humiliated when he discovers the ‘lover’ is the woman’s brother and his ‘surveillance’ photos reveal he’s gay and has a big crush on the ‘lover’.I thought this was a hilarious, original story. Harry is a deluded buffoon. Harry Stone and the 24 hour Church of Elvis would make a great movie.THE GHOSTS OF CHRISTMAS PRESENT: The old man from There’s No Such Place as Bedford Falls returns. This time around his house is visited on Christmas Eve by the spirits of the recently deceased who find his house welcoming. Among them is Phyl, the ‘lady friend’ who died a few weeks before.I really liked this story. It was quite sad but happier than There’s No Such Place as Bedford Falls. I didn’t feel so sorry for the old man this time around.WILDFIRE IN MANHATTAN: This is a sequel to Rainy Days and Monday’s. Two dark spirits are in Manhattan killing the locals including another God who lives there. The Rain God from Rainy Days and Mondays and his friend, a Fire God protect Sunny who reveals she knows who she is and uses her power to send the dark spirits running for the hills.I love this story. I liked reading more about the characters from Rainy Days and Monday’s. I wonder if she’s written any more about them. Original story and more Norse mythology. I’m a sucker for that.COOKIE: A woman’s marriage falls apart when she has a miscarriage and she starts to comfort eat baked goods (i.e. cookies, cakes, pastries). She puts on weight and becomes convinced she’s pregnant even though this is physically impossible. She gets fatter and fatter and people around her worry about her sanity when she becomes isolated. Her husband goes to visit and discovers she has given birth to a thing called Cookie.Cookie is a great story. I thought it was very sinister and creepy. Harris never actually tells us what the woman gave birth to. Her husband freaks out so I don’t think that’s a good sign. The woman remains huge and overweight, a mountain of flesh. This one made me shudder.GHOSTS IN THE MACHINE: A woman stays up all night and listens to a radio show called Phantom Radio. She starts to fall in love with the DJ because of his haunting voice and how he seems to pick perfect songs. They email each other and arrange to meet. Harris reveals that the DJ has hideous facial scars and the woman is blind and walks with a stick. The story ends with them rushing off to meet.I thought this was a very good story. Ghosts in the Machine is sweet and reminded me of online relationships where people move half way across the world for people they’ve never met. In her introduction Harris claims to have written this for her daughter as an alternative version of The Phantom of the Opera because her daughter believes the phantom should have got the girl.DEE EYE WHY: A man buys a run-down old mansion when his marriage ends and sets about retiring it. He becomes obsessed with his task. He rarely leaves the mansion, quits his job and starts to make the house and himself look like the previous occupants. His wife and friends fear for his sanity.Harris offers an original ghost story. There are hints that the man is possessed by the spirit of the previous tenant.MUSE: A writer is drawn to a run-down old café at his local train station. He starts to write a novel that might just be the best thing he has ever written and can only write in the café. He spends all day there. He learns the café is being shut down and adopts the café cat, Calliope. He believes the cat is one of the muses from Greek mythology as well as the two people who run it.I thought this was a great little story. I liked the way Harris offers a contemporary story about the muses.THE GAME: A teenager becomes addicted to a game everyone he knows plays online. He spends days and hours playing despite rumours that other players have harmed themselves or allegedly died as a result of playing. He becomes obsessed. He manages to wean himself off when his friend, who introduced him to the game, reaches fabled Level X and is later found dead.I found The Game quite disturbing but I enjoyed reading it. I found the concept completely believable. I’ve seen bad horror movies deal with similar subject matter but Harris makes it work.FAITH AND HOPE GET EVEN: My favourite two old ladies are back. Leanne is a new senior carer in the home and is a nasty little bitch. She bullies the residents and can be very cruel. She punishes the residents by stealing small, personal objects. She hides these in the locker of Chris, the only kind carer in the home so he won’t speak out against her. Faith and Hope plot their revenge and Leanne’s downfall and succeed in making her expose her cruelty and thievery in public.I thought this story was great. Once again Harris uses these lovely old women to illustrate the cruelty, bullying and neglect in care homes. I could read dozens of stories about Faith and Hope and never get bored.ROAD SONG: This is a companion piece to River Song and is set in the same place. A young girl is forced to give up school and work when her brothers are taken by human traffickers. The girl’s mother believes her son’s will return wealthy and educated. The girl longs for their return so she can go back to school.I found this story heart-breaking. In her introduction Harris reveals this is a true story and hat children taken by traffickers are sold into slavery and prostitution. I found it very sad that the mother and sister didn’t know what had really happened.FINAL THOUGHTS I think A Cat, A Hat and A Piece of String is a great collection of short stories. Every story is strong and earns its place in the pages. I enjoyed every one. Harris shows us what a great collection should be. I liked how dark some of the stories were without being gory and violent. I like the links between some of the stories. I also really enjoyed her little introduction to the origins of each story."}, {"userName": "Jeanette", "userReviewDate": "May 12, 2018", "userURL": "http://www.goodreads.com/user/show/11029945-jeanette", "userReview": "A Cat, a Hat, and a Piece of String by Joanne Harris is a great collection of short stories. All the stories are well written, some in particular really grabbed me, leaving me laughing or tearing up or pondering. Most had an element of magic or other worldliness about them, many of them were about overwhelming obsessions with grief, loss and re-capturing the past. Many too explored identity, illusion, and reality. My favourites 'Rainy Days and Mondays' (ill-fated romance between a rain god and sun goddess), 'Wildfire in Manhattan' (adds in a fire god, a Neil Gaiman feel to the story), Muse (an unlikely source of inspiration)-- and especially, Ghosts in the Machine (a beautiful love story). Both \"River Song' and 'Road Song' tug at the heart strings, portraying the plight of children in Africa. While 'Game' and 'Dee Why Eye' are clever. Perhaps what one expects from the author of Chocolat."}, {"userName": "Michelle", "userReviewDate": "Sep 01, 2017", "userURL": "http://www.goodreads.com/user/show/5861493-michelle", "userReview": "(3.5 stars) This is a collection of short stories. Some of these have familiar characters from her previous short story collection, Jigs and Reels, including the two irrepressible ladies, Faith and Hope. Several of the stories fall within the same community. We have a man who keeps a perpetual Christmas and a private detective who is also an Elvis impersonator. Several stories border on horror, including a baby made of sweets, and an addictive computer game. Other fall more into the magical realism genre, with a cafe that truly inspires its patrons, while some are true fantastical tales with the gods, another carryover from the prior collection. Each story is introduced by the author, which gives an intriguing insight into their creation. I enjoyed the collection, but did not love it as much as Jigs and Reels."}, {"userName": "Beth", "userReviewDate": "Dec 02, 2017", "userURL": "http://www.goodreads.com/user/show/3455557-beth", "userReview": "Joanne Harris's novels frequently contain elements of magical realism and the stories in this collection do too. My favorites among the stories were the tow about Faith and Hope - two elderly women in a nursing home. Faith is stuck in a wheelchair and Hope is blind, but together they really see into other people and into what goes on around them. Several of the stories have an unnerving quality - a tenseness that is often found in stories but not in novels."}, {"userName": "Sue", "userReviewDate": "Dec 15, 2016", "userURL": "http://www.goodreads.com/user/show/44202419-sue", "userReview": "This is a book of short stories. some were really good, and some were just ok. i like that there was an explanation at the beginning of each new story which added depth to each one. my favourites were the ones about Faith and Hope these old ladies are just great. Dee Eye Why was also a good one. for a mix of short stories this is worth a look."}, {"userName": "Colubrina Laticauda", "userReviewDate": "May 23, 2017", "userURL": "http://www.goodreads.com/user/show/11747214-colubrina-laticauda", "userReview": "Un po' noioso... sinceramente per quanto mi sono piaciuti i tre romanzi della serie di chocolat, non mi aspettavo questa semi delusione. Forse la dimensione del racconto non si addice all'autrice, non so, doveri cimentarmi in un'altra raccolta magari."}, {"userName": "Alyson", "userReviewDate": "Dec 30, 2017", "userURL": "http://www.goodreads.com/user/show/27538660-alyson", "userReview": "I love Joanne Harris's novels but really couldn't get into these short stories. A mixed bag of ghosts, travel, and spirits, my favourites were the ones set in Meadowbank Retirement Home and The Game based on teenage screen addiction."}, {"userName": "Helen", "userReviewDate": "Nov 30, 2017", "userURL": "http://www.goodreads.com/user/show/35015875-helen", "userReview": "An interesting collection of stories. Particularly liked the diy"}, {"userName": "Karen Grikitis", "userReviewDate": "Dec 06, 2017", "userURL": "http://www.goodreads.com/user/show/34210968-karen-grikitis", "userReview": "One of the most enjoyable book of short stories I have read in a long time. A wonderful mixed bag of stories, some of which include the same characters. A gem of a book."}], "description": "Stories are like Russian dolls; open them up, and in each one you’ll find another story.Conjured from a wickedly imaginative pen, here is a new collection of short stories that showcases Joanne Harris’s exceptional talent as a teller of tales, a spinner of yarns.Sensuous, mischievous, uproarious and wry, these are tales that combine the everyday with the unexpected; wild fantasy with bittersweet reality.Come to the house where it is Christmas all year round; meet the ghost who lives on a Twitter timeline; be spooked by a newborn baby created with sugar, spice and lashings of cake. Worry for a young girl in the Congo who rides the rapids to earn a crust of bread; and spy on Norse gods battling each other for survival in modern Manhattan. In her first short-story collection since Jigs & Reels, let Joanne Harris ensnare and delight you with the variety and inventiveness of her storytelling.", "title": "A Cat, a Hat, and a Piece of String", "url": "http://www.goodreads.com/book/show/13573396-a-cat-a-hat-and-a-piece-of-string", "average": 3.6, "cover": "https://images.gr-assets.com/books/1345465645l/13573396.jpg", "reviews": 170, "authors": [{"url": "https://www.goodreads.com/author/show/9432.Joanne_Harris", "name": "Joanne Harris"}], "type": ["Short Stories", "Fiction", "Fantasy", "Magical Realism", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/13573396-a-cat-a-hat-and-a-piece-of-string", "http://www.goodreads.com/book/show/17978502-a-cat-a-hat-and-a-piece-of-string", "http://www.goodreads.com/book/show/20651590-um-gato-um-chap-u-e-um-peda-o-de-cordel", "http://www.goodreads.com/book/show/23870115-un-gatto-un-cappello-un-nastro", "http://www.goodreads.com/book/show/19235219", "http://www.goodreads.com/book/show/13573397-a-cat-a-hat-and-a-piece-of-string", "http://www.goodreads.com/book/show/19100491-a-cat-a-hat-and-a-piece-of-string", "http://www.goodreads.com/book/show/23519807-un-gatto-un-cappello-e-un-nastro", "http://www.goodreads.com/book/show/47401.Chocolat", "http://www.goodreads.com/book/show/15096.Five_Quarters_of_the_Orange", "http://www.goodreads.com/book/show/15101.Blackberry_Wine", "http://www.goodreads.com/book/show/15102.Gentlemen_and_Players", "http://www.goodreads.com/book/show/2227371.The_Girl_with_No_Shadow", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/26583370-life-and-other-near-death-experiences", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/20552595-how-i-became-a-famous-novelist", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/36004055-not-perfect"]}