{"ratings": 784, "userreviews": [{"userName": "Hannah", "userReviewDate": "Oct 17, 2017", "userURL": "http://www.goodreads.com/user/show/17442587-hannah", "userReview": "I definitely enjoyed this tale of New York, reporters, Morse Code, and danger. It came in the mail today, and I was glad to dive right in. I intended to read a single chapter and get back to the other book I'm reading, but the story grabbed me from the beginning. Lucy is likable from the start, and it's easy to identify with her longing to find justice and to shake off her uncle's stalkers, who are content to spy on her life and keep her and her brother from realizing their full potential in life. From there the story moves swiftly, as she encounters Sir Colin Beckwith and as he stumbles across her family's nasty history. With Colin's eyes fresh on the family secrets, Lucy and Colin quickly realize that much more is going on in the family than she first imagined. In other words, the Saratoga Drakes aren't scrupulous about crushing more than family, if others get in the way of their plans.Before long, Colin is mixed into the issue, despite his being an unlikely ally. After all, he's a reporter at heart, and the draw of a good story is hard to resist.It fell just shy of five stars for me, but makes four (very good) easily. It's Camden's best in years (since Beyond All Dreams, in my opinion)—well-researched, detailed history, and two lead characters with clear chemistry. (Their banter is excellent. Brings to mind classic movies like Desk Set and His Girl Friday...)Things that helped shy away from an \"excellent\" rating: -An \"oh my heavens\" exclamation-\"Hear, hear\" misspelled as \"here, here\" (pet peeve)-Woman referred to as \"hero\"...in 1903, she'd be offended. She's a heroine.-Content. Lucy entered a situation that requires a forced bathing (not something she was expecting ahead of time). For me, it got a bit too far into her feelings as the two women scrubbed her down. It's only a paragraph, but I'm intensely visual and didn't want to have that image.It's also MUCH better edited than the last two releases, and the words flow with a lot more authenticity. Definitely worth a read!Thanks to the publisher for a free review copy. A positive review is not required."}, {"userName": "Heidi Robbins (Heidi Reads...)", "userReviewDate": "Dec 03, 2017", "userURL": "http://www.goodreads.com/user/show/966933-heidi-robbins-heidi-reads", "userReview": "I was not expecting the character of Lucy to be what she was in this book- I think the pearls on the cover threw me off. (While there are pearls in the story, I don't believe she ever wears them). Lucy is one determined woman, holding tightly to her values but willing to get a little down and dirty when battling unscrupulous people. Her strength is admirable, and I loved how the author also portrayed her flaws, exhaustion, and yearnings for a different life. She is complex in that way since she loves her work for the Associated Press and the glimpse it gives her of the world that she will never explore, as long as she is fighting the lawsuit with her uncle.Colin is quite charming and also has a realistic balance of traits which made him come to life. He brings joy and love into Lucy's life, however temporary, and supports her in the war she is waging even when they struggle through their own rough patches. The insights into the events and politics of the time was fascinating, especially the workings of the telegraph office and the underground plumbing of Manhattan. I would have enjoyed more emotion in the romance between Colin and Lucy, but the plot and historical details made this a standout book.(I received a complimentary copy of the book; all opinions in this review are my own)"}, {"userName": "Grace Mullins", "userReviewDate": "Feb 27, 2017", "userURL": "http://www.goodreads.com/user/show/3109535-grace-mullins", "userReview": "Elizabeth Camden has a second book releasing in 2017? Um, YES! YES, YES, YES! *wants book now* *right now*"}, {"userName": "Rachel McMillan", "userReviewDate": "Oct 02, 2017", "userURL": "http://www.goodreads.com/user/show/2201736-rachel-mcmillan", "userReview": "Honestly, Elizabeth Camden's books are just all the ingredients I love. I truly think she is writing for me! She has a masters in history, so her research is unparalleled, she has an easy, accessible writing style, characters and dialogue that leap off the page and a keen sense of time and verisimilitude. But, I think what I find most impressive, is the ease in which she excavates snippets of history not usually explored onto which she shines the spotlight of her inimitable narrative style.I also always identify with her heroines ( something that is hard to do in inspirational fiction ---even for an avid reader in the genre like myself). Her heroines are smart, resourceful career women who balk at limitations and want to make their marks on the world. Often in men's professions during times when women were to be angels of the hearth, her heroines are always just a few steps ahead of the world--- and the game. Fiercely independent, they are not easily won, unless they are able to fit the inevitable romance end of the plot into their working world.Image result for a dangerous fortune camdenThe overarching plot of this multi-layered story revolves around the Drake fortune and put me immediately in mind of the never-ending Jarndyce and Jarndyce case in Dickens' Bleak House. Siblings Nick and Lucy Drake are at the center of the case trying to find justice for their family and their late father. Beyond any monetary gain or inheritance, the resolution of the case will hopefully mean the end of their torment by a wealthy rich relative, Thomas Drake, who lives as lord of the manor in nearby Saratoga while the Drake siblings are hard workers scraping by in their Greenwich Village apartment. Court settlements, a lavish necklace and two brothers who fought over the invention of a brilliant valve during the Civil War times brushes Lucy and Nick's world with a burden to their father's memory as well as the social injustice they see around them. A plumber, Nick wants to use the ease in which he can work this portal to his family's inheritance to equip tenement houses with running water for a fraction of the cost of the high city fees.Another layer of this surprisingly intricate plot is the journalistic meeting of Reuters Agency, where Lucy continually runs into aristocrat Colin Beckwith, heir to a crumbling 18th Century estate across the Atlantic, while working as a telegraph operator for the Associate Press. The history of morse code, telegraphy and homing pigeons is flourished here in exciting detail and I loved hearing about Colin and Lucy's world, the interception of Pacific telegraphs as well as reading cameos by Roosevelt and Taft.An illegal wire tapped to her desk allows Lucy to transmit messages from her scheming uncle's lawyer and when she overhears a plot for murder, she runs to her uneasy ally ( and source of her burgeoning attraction), Colin, who uses his title and manners to expose the nefarious Drakes in Saratoga once and for all.A Dangerous Legacy was so much more than an historical novel: it was a treatise on the class system, a look at how entitlement to fortune and revenge can strip one of happiness and a compelling study of New York on the brink of greatness. Nick's work with valves for fresh water in tenement houses opens up a world underground and the labyrinth of the New York sewer system is painted with the same deft ease in which Camden worked with the Boston subway in From This Moment. Colin Beckwith's experiences as a journalist in the Boer War allow for the study of PTSD and a look into the primitive psychiatric methods such as shock therapy. A threat to Lucy is a gateway to a close interior look into mental asylums and the cruelty waged on patients sometimes only committed for incorrigibility.To summarize the many interweaving plots as Colin and Lucy navigate the intricacies of the Drake fortune is difficult because Camden excels at being so (albeit accessibly) complex. I had trouble putting this book down during a research trip to Boston over the weekend ( books are companions when one is traveling and dining alone) and found myself blown away ( as per usual )with the seeming ease with which she creates conflicting worlds. There is a hunting weekend at a grand estate in upstate New York as well as parties and soirees that hang on Colin's coattails as a reminder of his past and the inheritance that binds him as tightly as the Drake fortune does Lucy and her brother. Manhattan becomes a character a colourful and nuanced as Washington in Beyond all Dreams and Boston in From This Moment as Camden uses her natural skill to paint a canvas brought brilliantly to life.There is romance, yes, but also a hefty dose of suspense and an intricate mystery I was not anticipating. This is the best type of savoury read: relatable and fascinating characters, a peek through the curtain of the past, a dashing hero, a resourceful heroine, a race against time. Twists and turns and second guesses, dubious villains and beautiful heiresses. In short, a deliciously robust read.Elizabeth Camden is an inspirational writer; but the religious themes in her book are just that---themes. She writes with a strict and genuine value system and her realistically fallible characters work between the lines of right and wrong often finding their consciences at odds with the world around them. She is never preachy and the faith elements are presented as sociocultural concept. I would recommend her highly to readers from or without a faith background.with thanks to Bethany House for the review copy"}, {"userName": "Lindsey (Books for Christian Girls)", "userReviewDate": "Nov 18, 2017", "userURL": "http://www.goodreads.com/user/show/19266895-lindsey-books-for-christian-girls", "userReview": "About this book:“Lucy Drake's mastery of Morse code has made her a valuable asset to the American news agencies as a telegrapher. But the sudden arrival of Sir Colin Beckwith at rival British news agency Reuters puts her hard-earned livelihood at risk. Newly arrived from London, Colin is talented, handsome, and insufferably charming.  Despite their rivalry, Lucy realizes Colin's connections could be just what her family needs to turn the tide of their long legal battle over the fortune they were swindled out of forty years ago. When she negotiates an unlikely alliance with him, neither of them realizes how far the web of treachery they're wading into will take them.”Series: Book #1 in the “Empire State” series. Will be connected to the author’s next book, releasing in early 2018. Spiritual Content- A few Scriptures are refenced in the Discussion Questions; A few Prayers & Thanking God; Church going & going to church to pray; Mentions of God & His will; Mentions of prayers & praying; Mentions of churches, church going, & services; A few mentions of those in the Bible; A few mentions of blessings over food; A few mentions of clergymen; A couple mentions of blessings; A couple mentions of sins; A couple mentions of godsends; A mention of a miracle;  *Note: A few mentions of ghosts & haunting a person; A mention of a devilish smile; A mention of demons. Negative Content- Minor cussing including: two ‘blasted’s, two ‘heck’s, five ‘idiot’s, five forms of ‘shut up’, eight forms of ‘stupid’; A few mentions of curses & almost cursing; Sarcasm & Eye rolling; Panic attacks (up to semi-detailed); Being smacked & Pain (up to semi-detailed); Being held at gunpoint & threatened (up to semi-detailed); Fighting & Hitting Someone (up to semi-detailed); Some social drinking (barely-above-not-detailed); Many mentions of wars, fighting, gunshots/bullets, explosions, dead bodies, men dying, nearly dying, & flashbacks of it all (up to semi-detailed); Mentions of a man shooting another’s pet birds (up to semi-detailed); Mentions of assassins, bombs, & murder; Mentions of planned “accidents” that can result in someone’s death; Mentions of jails, prisons, arrests, & illegal actions; Mentions of thefts & thieves/criminals; Mentions of kidnappings; Mentions of torture & screams; Mentions of fighting, punching/slapping, & injuries; Mentions of threats & blackmail; Mentions of lies & lying; Mentions of gossip & rumors; Mentions of alcohol, social drinking, drinking, & drunks; Mentions of smoking, cigarettes, & tobacco; Mentions of bullies; Mentions of hunting & taxidermy (barely-above-not-detailed); Mentions of animal and human waste & the smell; A few mentions of burglars & burglaries; A few mentions of dead cat bodies & threats; A few mentions of gambling; A couple mentions of an attempted bombing; A couple mentions of throwing up; A couple mentions of raising sheep & cattle for slaughtering.Sexual Content- a hand kiss, not-detailed kisses, and three boarder-line barely-above-not-detailed // semi-detailed kiss; Touches, Embraces, & Warmth (up to semi-detailed); Noticing; Mentions of a kiss; Mentions of flirting & girls flocking to Lucy’s brother; Mentions of reputations; A few mentions of forward offers & blushes; A few mentions of jealousy; A few mentions of crushes; A couple mentions of prostitutes; Love, falling in love, & the emotions; *Note: Mentions of a famous statue of a naked couple kissing (barely-above-not-detailed); Mentions of a teenager who had two miscarriages (she became pregnant in one through her (already married) boss because she thought it was necessary to keep her job); A couple mentions of a mother nursing; A few mentions of getting into bed with someone (meaning a business deal, but once referred to as in another way); A couple mentions of being neutered & castration; A mention of kissing someone’s rear end; A mention of a swift kick to a man’s groin. -Lucy Drake, age 28-Colin Beckwith P.O.V. switches between them  Set in 1903 {Epilogue set in 1904} 341 pages~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*Pre Teens- One StarNew Teens- One StarEarly High School Teens- Two Stars Older High School Teens- Three Stars (and a half)My personal Rating- Three Stars (and a half)After being disappointed by the author’s previous release this year, I was wondering how this one would be. Turns out, I rather enjoyed this book. I would have preferred more faith content, but it was much cleaner and was void of certain comments that her other books normally have. A positive in that regard. Like all Elizabeth Camden books, this novel also was brimming with historical facts, current inventions of the time period, and letting the readers know what was happening in the world. “A Dangerous Legacy” had banter between our main couple, though, that was refreshing, and I truly enjoyed. I honestly felt like the romance was much lighter compared to the other books the author has written. While reading this new novel, I was hoping we would see Lucy’s brother’s own story, so I am curious about reading it when it releases next year.Link to review:https://booksforchristiangirls.blogsp...*BFCG may (Read the review to see) recommend this book by this author. It does not mean I recommend all the books by this author.*I received this book for free from the Publisher (Bethany House) for this honest review."}, {"userName": "Aerykah", "userReviewDate": "Dec 05, 2017", "userURL": "http://www.goodreads.com/user/show/5920961-aerykah", "userReview": "What an adventure this was! From apartments to mansions, from the sewers to an asylum, and more!  There were, secrets, intrigue, suspicions, spying, encrypted messages, a psycho doctor..... *deep breath* ...and of course, there was romance too. ;)This isn't a very fast-paced book at first.  I kinda wish it was, but it's not.  While I was very much enjoying the story, it was still pretty easy to put down and set aside for a while... which is exactly what I ended up doing for a couple of weeks about halfway through the book.  But-- it's also the type of book that during those two weeks, I was still really looking forward to picking it back up and finishing it.  And the last half of the book was finished within two afternoons.  So obviously, the last half went much faster than the first.I found many aspects of this story fascinating.  The telegraph, the Morse Code, the pluming, the PTSD, the Panama Canal, etc.  Elizabeth Camden's writing makes it easy for me to visualize the things she writes about. I enjoyed the way these things were woven into the story;  it was all so very interesting and made my history-loving self quite happy!  I grew to love the characters (well... some of them, anyway) and enjoyed seeing them grow and develop throughout the book.  It has me really looking forward to reading Nick's story!  (Wish I didn't have to wait until June. :( )  Lucy and Nick were great and, like I said, I grew to love them... but I think Colin was my favorite character.  I wish we'd been able to get to know his family, but maybe we'll get to learn more about them later?  Colin just felt the most real to me and that made it easier to connect with him.  Though, toward the end, I began to connect more with Lucy too.One last thing before I sign off...  I just have to say that I loved the dialogue.  Dialogue is usually a pretty big thing for me.  If a book is really well written, but the dialogue is terrible or seems really stiff or fake?  It's likely that I won't finish the book.  On the other hand, I'm likely to give a book an extra star if it has genuine, fun, engaging dialogue that I truly enjoy.  This book is one of the latter.  I don't know what it was specifically, but I remember thinking several times that the dialogue was great and I was really enjoying it.A big thumbs-up and 5 stars from me!  I definitely recommend this book! :)I received a free copy of this book through the Bethany House Blogger Review Program in exchange for an honest review. All opinions expressed are my own."}, {"userName": "Jamie", "userReviewDate": "Sep 25, 2017", "userURL": "http://www.goodreads.com/user/show/8586696-jamie", "userReview": "Another book by Elizabeth Camden means another excellent read! What makes her such a strong writer, is her ability to remain fitting and true to the time period she chooses, but also makes the plot intriguing and gives you a heroine you can root for.I enjoyed the relationship between Colin and Lucy. There were some frustrations (which again, were very fitting for the time period), but I thought Camden did an excellent job with that part of the story.I really liked Lucy (and Colin too!). But Lucy, there was a realness to her that’s sometimes missing in heroines. She was hardworking, committed, loyal, and brave. I thought her development was honest and encouraging. Plus her relationship with her brother? Loved it!And the story had me intrigued the whole time – I was curious with each new piece revealed and enjoyed the satisfying ending. Once again, the unique piece of history Camden focused on was fascinating and I love learning new bits of history, especially with my background of journalism.What characteristics make you like a heroine?(Thank you to Bethany House for a copy of the book. All views expressed are my own.)Originally posted at https://musingsofjamie.wordpress.com/..."}, {"userName": "Cassie", "userReviewDate": "Dec 05, 2017", "userURL": "http://www.goodreads.com/user/show/16159137-cassie", "userReview": "Truth: the last few books I've read of Elizabeth Camden's have been slightly disappointing. Nothing has lived up to Against the Tide, which I adore.I am so happy to say this is my second favorite Camden book, coming second only to Against the Tide.I loved it. It was exciting and there was danger involved, but not too much. And the characters were delightful.So glad I read this one!"}, {"userName": "Diane Estrella", "userReviewDate": "Nov 14, 2017", "userURL": "http://www.goodreads.com/user/show/5090505-diane-estrella", "userReview": "There were several times while reading this book, that I had to put it down.... NOT due to poor writing or storytelling, but because I was getting nervous for these characters. I was actually worried that this story would not have a happily-ever-after ending! I have read almost all of Elizabeth Camden's books and she is most definitely a \"go-to\" author for me. Her stories are always solid and she takes her own personal passions throughout history and gets her readers to care about them as well. Her book plots are unique and unlike the typical historical romances out there. This book was the author's first real attempt with a suspense element. I could feel myself getting anxious for Lucy and Colin and the true evil that could, at any moment, overtake them. Their flirting was swoon-worthy and done in the most interesting way. Loved this! Plus, any author that can include a sewer, credibly into the plot of this book and also her next (with waterborne diseases), is a true artist and \"mostly\" a genius!What are we willing to let go of to become free? A question that deserves some attention and thought.I received this book from the publisher/book publicist but was not required to leave a review. All opinions expressed here are my own."}, {"userName": "Charity Andrews", "userReviewDate": "Nov 03, 2017", "userURL": "http://www.goodreads.com/user/show/20794076-charity-andrews", "userReview": "One thing that you can always know you'll get when you pick up an Elizabeth Camden novel is history. I'm not talking about a time period, necessarily, but a lifestyle. You will learn so much about the era she chooses to write in. You will learn how they lived, worked and loved.This time she takes us to the Turn of the Century. In a time of booming industry, factories, wires, and even plumbing, she intertwines a beautiful story. Of course, there is much more than that to it! You can count on love and intrigue. You'll find deep characters that are easy to love (and some to hate!).Be sure to pick up a copy of this new series! Thanks so much for this awesome book in exchange for my review. As always, this is my honest opinion. Here's to many more!!"}, {"userName": "Cathy Daniel", "userReviewDate": "Feb 12, 2018", "userURL": "http://www.goodreads.com/user/show/7218096-cathy-daniel", "userReview": "I want to give this book 5+++++ stars! Who knew Morse code could be so intriguing and romantic! ;)"}, {"userName": "E.F.B.", "userReviewDate": "Jun 07, 2018", "userURL": "http://www.goodreads.com/user/show/39244832-e-f-b", "userReview": "[ insane asylum  (hide spoiler)]"}, {"userName": "Clara", "userReviewDate": "Nov 11, 2017", "userURL": "http://www.goodreads.com/user/show/7110825-clara", "userReview": "Elizabeth Camden's books are so quirky that they fill your heart with fuzzy feelings and make a silly smile impossible to be hidden.Plus, she has the talent to pick \"simple\" historical facts/inventions (many things we might actually take for granted today) and spin a fascinating story that grows very strongly in your heart. And the way she ties all these little details to support the main plot is truly astonishing. Maybe you've heard that her novels are veeery detailed, but no fear, there's nothing randomly put just to fill the story.I love layered stories in which you deeply get to know the characters as the story progresses, and in which history is richly enlaced into the plot. I know Elizabeth Camden is one of these writers, though I haven't read many of her books. Nevertheless, something I am quickly finding out to be true is that she can write heroes annoyingly infuriating who make you want to wipe away their roguish grin during the first pages, but, also, who can gain your heart quite quickly.Colin Beckwith is one of these said heroes. At the same time, especially in the beginning, he can be snobbish and maddening, as you get deeper into the story, you'll find out he's a man who's been given a burden he's not sure he's fit to carry it out and who, when chasing after his dream, got himself trapped into a conflict he now spends his present time trying to forget. Honestly, Colin can be described with the same words he used to describe his home back in England: from the outside, it looked like a castle, inside it was a wreck. He's been forced to keep a mask in order to preserve his family's legacy - or at least he sees this as the only way - and the only thing keeping him sane is the opportunity to still work with what he loves, even if not in the front lines.Once again, though, he's mistaken. His supposed sanity and his heart will be tested when he meets Lucy Drake. They come from different social classes, have been raised with a different perspective of life, work for competing companies, what can they possibly have in common? Apparently, nothing, until they stumble into each others' secrets and are forced to form an association. Even so, soon they will find in each other a kindred spirit because of more than just shared passion for telegraphy but due to decades-old inherited burdens, which they fight with all their might for.As they get to know each other, how long can they continue to put their families' legacy in front of their own personal desires? How far becomes too far once you've known true sense of camaraderie alongside peace and happiness?I'm so excited there will be one more installment to this story. Nick's book couldn't come soon enough :)surely one of the best reads of the year!*Many thanks to the publisher for providing a copy through NetGalley. All opinions expressed are my own."}, {"userName": "Kelly Bridgewater", "userReviewDate": "Oct 09, 2017", "userURL": "http://www.goodreads.com/user/show/33835690-kelly-bridgewater", "userReview": "A Dangerous Legacy by Elizabeth Camden is a unique historical novel that takes place during the early twentieth century. One thing I really enjoy about Camden's novels is her ability to bring the technology we use every day to the forefront of my imagination in a fictionalized story. I'm always drawn into the trouble the characters find themselves in while learning something about the great inventions that have made life easier for modern day life.Camden does a great job at writing the story. She is clear and concise in her descriptions and her writing. I have no problem picturing the scene and the setting. Camden does a really job at bringing New York City to life. She also does a great job at bringing the elaborate mansions to life when Camden travels out of New York to spy on Uncle Thomas.I really enjoyed the plot in this story. I enjoyed seeing how the telegraphers worked and how the plumbing began in the early twentieth century. One of my favorite things for a historical writer to do is to tell me a little bit about history without overwhelming me. Sarah Sun din and Camden are my favorite two writers who do this. I enjoy the twists and turns that Camden has created in the mystery to keep Lucy and Nick on their toes as they struggle against their uncle and seek justice.I really enjoyed spending time with Lucy, who is a smart woman who doesn't mind working for a living. Never once does she go out of her way to try to blackmail her uncle for her own selfish reasons. She wants him to allow the plumbing valve to be distributed for the masses at a reasonable cost. I admire her ability to negotiate and keep a level head throughout the novel. As for Camden, he wasn't one of my favorite hero's. He is a nice guy who appears to be just wanting a rich American heiress to keep his English home afloat, but by the end of the novel, he changes, and I respect him for that.The romance doesn't dictate the story, but it does take up a good majority of the plot. Not too much. Not too little. Camden keeps it at an even keel. Just the way fans of historical romances like it.I really LOVE the cover for this novel. The publishing company did a great job. The skyline of New York City in the background with the soft blush colors really captured my attention.Overall, A Dangerous Legacy by Elizabeth Camden is a refreshing tale on the importance of the telegraph machine and plumbing for American history. The characters were wonderful to spend time with, and the plot was a great way to spend a couple of days. I anxiously await what historical invention Camden will be crafting a story around next.I received a complimentary copy of A Dangerous Legacy by Elizabeth Camden from Bethany House Publishers, but the opinions stated are all my own."}, {"userName": "Rebekah Gyger", "userReviewDate": "Jan 08, 2018", "userURL": "http://www.goodreads.com/user/show/8314848-rebekah-gyger", "userReview": "I have read plenty of novels in my life in which Morse code played a part in the narrative, however this is the first time I have seen it played out in the setting of a newspaper industry. The history between AP and Reuters was something that I enjoyed learning about, along with how new stories were dispersed in that day. Sometimes it is difficult to wrap my mind around the realization the internet is not as old as it seems to those of us who cannot remember a time without it, and that the spread of information would have had to have been far more deliberate.The history and research represented in this novel were interesting, driving the story a bit better than the plot in my mind. While the court case over the valves remind the main conflict, most of what took place actually revolved around the ingenuity of the telegraph, the usefulness of homing pigeons, and the struggle of everyone to find happiness in an economic system that is so often is manipulated to work against them.In all of this, the actual romance between Lucy and Colin seemed to get lost. They were drawn to each other from the start, but individual pursuits of happiness created a wall between them that both determined in the beginning not to cross. This made their romance difficult for me to get behind, as Colin actively sought other wifely candidates. Also, Lucy continuously broke the law in order to further her own goals, practically forcing everyone who knew to either silently support her or else turn her in to the police. And Nick and Colin just went with it.There were not any major flaws that I saw with this work, nothing that made me intensely dislike it or wish that I had never picked it up. But there also was not much that interested me. The history, as I said before, was interesting, but history alone cannot drive a story when the characters behave in ways that kept me from connecting with them.I have provided an honest review after having received a copy of the book from the publisher."}, {"userName": "Kav", "userReviewDate": "Aug 22, 2017", "userURL": "http://www.goodreads.com/user/show/6025638-kav", "userReview": "There is something so decadent about an edge-of-you-seat suspense paired with historical romance! And this one is riveting. Deeply intricate story threads woven into a complex pattern of loss and greed and vengeance. A villian who has \"...no soul and that let him fight with the single-minded zeal of a jackal.\" (p 12) and a heroine determined to stand up for what is right and just though it alters the course of her life in devastating ways. A family legacy of sorts that has ensnared both Lucy and her brother. The layered depths in the suspense is exceptionally well done. Enthralling historical details -- telegraphy, Morse code, the early days of international news reporting and homing pigeons! Diverse and captivating and all of it plays an important role in this romantic suspense.Lucy is a grounded working girl -- independent by necessity but also by choice. She loves her job as a telegrapher and is fiercely loyal to the Associated Press. Which makes for some spectacular fireworks when rival company Reuters imports British aristocracy to manage their New York office. Enter Sir Colin Beckwith and let the toe-curling begin. As well as the laughter thanks to the wicked banter this adversarial hero and heroine engage in on a daily basis.If you look 'pager-turner'up in the dictionary you should find A Dangerous Legacy as the definition. I inhaled this book. Actually woke up at four in the morning and rejoiced because that meant I got to spend two blissful hours reading before I had to get ready for the day! Definitely one for the long-time keeper shelf!Book provided courtesy of Baker Publishing and Graf-Martin Communications Inc."}, {"userName": "Rebecca", "userReviewDate": "Oct 20, 2017", "userURL": "http://www.goodreads.com/user/show/10732829-rebecca", "userReview": "\"Colin remained motionless for a full minute after the door slammed. Lucy Drake was as attractive as he remembered. He wished she wasn't.\" Battling decades of law suits regarding the rights to a family invention, Lucy Drake and her brother Nicholas, are exhausted with their attempts for full disclosure and justifiable inheritance. As a telegraph operator with the Associated Press, Lucy discovers an unlikely ally within the rival British news agency Reuters, a Sir Colin Beckwith, when information crosses her desk regarding potential criminal activity instigated by her estranged uncle. In spite of the magnetism of attraction that flares between the two almost immediately, Colin is fighting his own dragons; his inheritance, a once fine English estate, needs an infusion of thousands of dollars to keep it from disintegrating; thus, demanding that he marry an heiress, which at the moment, Lucy is not.As Lucy and Colin engage in covert investigative jaunts, the depth of danger substantially increases; someone is watching their every move and is quite determined that the truth remain cloaked underneath a heavy veil of lies. Elizabeth Camden has penned an intriguing story, introducing characters who display an amazing array of courageous qualities. I received a copy of this book from the publisher. The opinions stated above are entirely my own."}, {"userName": "Emily", "userReviewDate": "Jun 04, 2017", "userURL": "http://www.goodreads.com/user/show/9083576-emily", "userReview": "Easily one of the best of this genre that I've read in 2017. I'm not going to go into an incredible amount of detail here, since it's been over a month since I read it, but I felt like I should give this book at least a sliver of what it deserves.The history. SO rich. So seamlessly inviting. It's not EVERY day that you get to travel the sewer systems of New York. The characters. Beautifully flawed, yet redeemed. I actually was a bit wary of the FMC and her brother at first, because they were a little sketchy in places. But they saw their mistakes and repented, and in a non-cliche way.SUSPENSE, BABY. This book had it in droves. I don't think I've ever wanted to just BITE MY NAILS off the way I wanted to while Lucy was in that one place. And all the times Colin was in the veritable LION'S DEN. But my nails did somewhat survive, thankfully.In short, this book was JUST SO GOOD. I didn't do it justice in any way, shape, form, or fashion, but I also didn't want to give any spoilers. If you like Camden at all, DEFINITELY read this one!"}, {"userName": "Amy", "userReviewDate": "Aug 21, 2017", "userURL": "http://www.goodreads.com/user/show/31057593-amy", "userReview": "Every Elizabeth Camden novel -- and I've read them all -- is the exact same experience for me: a brilliant, unique premise hooks me in, historical details keep me interested, then a wild plot twist skews the story into another tangent that, more often than not, completely overshadows the original plot of the book and leaves me scratching my head. Fortunately, this was one of the \"not's.\" While A Dangerous Legacy still veered in a completely different direction than I'd been led to expect by the back cover, it stayed far more cohesive than other Camden novels I've read. The banter between hero and heroine was delightful, although their romance blossomed a bit too rapidly for my taste. I also felt the energy of the story peaked a bit too soon, which caused the ending to drag, but overall the many complex threads of this story wrapped up nicely, with an epilogue that offers a tantalizing glimpse of what the forthcoming sequel may hold in store."}, {"userName": "Lucinda", "userReviewDate": "Oct 11, 2017", "userURL": "http://www.goodreads.com/user/show/13460688-lucinda", "userReview": "Every time I read one of Elizabeth Camden's books, it's my new favorite. I love all her stories—how can I possibly choose? I have all her ebooks. Now I need to start getting the paperbacks. I loved Lucy and Colin. Such depth to these characters. Their relationship was a delight to read, sweet, funny, tense at times, and so romantic. As usual, the historical part of the book was fascinating. The author's profession is really put to good use. Highly recommend this one.Looking forward to Nick's story."}, {"userName": "Taylor", "userReviewDate": "Oct 17, 2017", "userURL": "http://www.goodreads.com/user/show/44380946-taylor", "userReview": "Reviewed at my blog: Babbling Books\n\n“Theirs was a case of David versus Goliath, and in battles like that, the honorable people were supposed to persevere until they finally won.”\n\nI think I’ve said this before but it can’t be stated enough, books with unrealized potential are the ones that frustrate me the most. The books that start out on a path where you can really see great plots, well developed characters and awesome stories but as they go fizzle out into just so-so stories, those are the saddest ones.I don’t like sounding harsh and I always think you can find something about a book that’s noteworthy or that is interesting. This book was very good from a historical perspective and that alone is what earned it the two stars. I enjoyed the historical elements and the time period placement as well as the attention to historic details. The talk about morse code, carrier pigeons and the high society nuances were all interesting. Aside from that the book fell apart for me.I really liked the setup for the characters in the beginning, Lucy was funny, confident and a woman who could take care of herself. She and her brother were an excellent team all on their own and I really liked their close relationship. Colin was a bit snarky and rough around the edges but a charmer and I was excited to learn more about how he would overcome his past with the war. I could see some good redemptive arcs being put into place early for all the characters. But as the book got further and further along I got more and more disappointed. I felt the author degraded Lucy’s character by having her act morally superior while doing things that were morally corrupt. Nick ended up becoming an angry character for most of the book and by the end was almost wrangled into a deal for a life he wasn’t cut out for and didn’t seem to want. And Colin began to come across as a jerk as he would mess with Lucy’s affections while pursuing his own ends. I know none of this is likely what the author intended, but it’s how everything came across. There just wasn’t enough backstory or development to make me love or invest in these characters.As for the romance, while I loved Lucy and Colin’s chemistry as a couple and their banter together, by the end I was left scratching my head as to why they would end up together. Without going into spoilers too much, it really bothered me that by the end it was insinuated that Colin really loved Lucy all along, but the impression the writing had given was completely otherwise. A man who professes his love for a woman, while practically yelling at her for being selfish at not wanting to pursue money, all so he could get out of debt and they could marry is not a good guy, he’s a scoundrel. And just because that plot was conveniently resolved in the end does not change that character flaw.I was just disappointed with how the author ended up handling the characters. She set them up really well but honestly didn’t resolve anything. Everything still felt wide open. The ending felt too rushed and hurried and the characters incomplete. While they appeared to learn things on the surface, the real lessons aren’t learned at all and none of the characters grew or became anything truly different.Overall I’m glad I got a chance to read this book, and the historical elements were wonderful. Maybe with the sequel more will be explored, but I don’t think it’s a series I’m likely to continue reading, but you never know.*I received a copy of this book from the publisher (Bethany House) in exchange for an honest review*"}, {"userName": "Jill", "userReviewDate": "Oct 21, 2017", "userURL": "http://www.goodreads.com/user/show/3145216-jill", "userReview": "I really loved this new release from Elizabeth Camden. The story is well told, and the characters have great chemistry. There is lots of intrigue and excitement. The history and faith elements are woven into the story beautifully. I love to learn about lesser know historical facts when I'm reading, and this book had a lot of interesting information about the Panama Canal and AP News. I highly recommend this book to lovers of historical fiction.I received this book for free for review."}, {"userName": "Faye", "userReviewDate": "Jan 16, 2018", "userURL": "http://www.goodreads.com/user/show/6215055-faye", "userReview": "Lucy and her brother, Nicholas Drake, have followed in their family’s footsteps and taken up the fight in a lawsuit that has lasted forty long years and torn their family apart. While Lucy and Nicholas labor in New York City to scrape together enough money to keep fighting, the Saratoga Drakes live in lavish luxury holding the patent to wondrous valve that could change tenement living forever. Lucy works for the Associated Press as a telegraph operator, while her brother works as a plumber in the hog house underground of the city. But Lucy and Nick have a secret that could send them both to prison, but it could also give them the edge that they need to win the lawsuit once and for all. But when Sir Colin Beckwith the head of the Associated Press’s rival Reuters comes into their lives, Lucy finds the infuriating heiress seeker tipping her world upside down, but could it be that Colin is the secret weapon they need to bring down their uncle who is willing to do anything to stop Lucy and Nick from threatening his fortune? Lucy is determined and hardworking, she and her brother have sacrificed everything to continue the legal battle. Lucy is intelligent and quick witted, she doesn’t give up, and is skilled in morse code. She fights with the hope of someday being able to improve the lives of the working poor, and has already sacrificed so much to make her grandfather’s dream a reality.Sir Colin Beckwith has the title and a grand sounding estate, but he has worked for what he has and to support his family. His estate is crumbling around his sister’s ears, and he does not have the funds to make the much needed repairs to his estate. The answer seems so clear, marry a rich American heiress. But behind his cultured charm of a polished member of the aristocracy, he is an honorable and hardworking man, who struggles to overcome his past and the trauma of war. Masterfully written, and effortlessly seeming to teem with so many well researched details about the city that didn’t detract at all from the gravity of the plot. I couldn’t help but be drawn into the rich drama of a decades long dispute, and the exciting underworld of New York’s plumbing system, as well as the thrilling new world of news stories able to fly thousands of miles over a telegram wire halfway around the world. Lush with detail and brimming in suspense, I didn’t want to put this book down. From the high society of Saratoga to the dark underground of New York, this book had me hooked. I really liked how Lucy was forced to look at her faith in light of the lawsuit and everything that had happened already, and how she wanted to take control of her future but giving it to God. Ms. Camden outdoes herself with every new book, and this is no exception. I was thrilled to find out that the Drakes’ saga will be continued with Nick’s story. Suspenseful drama, romance, and rich history await in A Dangerous Legacy. Highly recommend!!!"}, {"userName": "Trisha Robertson (Joy of Reading)", "userReviewDate": "Oct 29, 2017", "userURL": "http://www.goodreads.com/user/show/21132617-trisha-robertson-joy-of-reading", "userReview": "Calling all History lovers! If you enjoy reading Historical fiction, then this is the book for you! From the very first pages to the very last I found myself immersed in 1903 New York City. It’s a different NY than you are used to visiting today, so prepare yourself! Running water in the tenement building is a rare luxury. Only the very rich can afford the special valve that will allow water to reach the upper floors. Most have to lug jugs of water from the main floor up several stories to their apartment. Imaging cooking, washing, everything you need for water. Now imagine you have worked 10 hours, on your feet, heavy labor, you have walk 5 or more blocks to get home. Now to cook dinner and get clean you must walk down 4 plus flights of stairs, fill up gallon jugs of water and then be lugging them back upstairs. You may have to do that several times.Lucy and her brother Nick Drake have been embroiled in a legal battle that is older than they are. Their Grandfather invented the valves that would make getting water to upper floors possible. However, his brother swindled him out of the patent and is now selling the valves for an exorbitant fee that only the very rich can afford. The legal fight goes beyond just the money for Lucy & Nick, it is also helping to ensure that everyone can afford to have running water in their homes. Nick is a plumber and works for the city. Lucy is a telegraph operator working for the Associated Press news. Lucy enjoys working as a telegraph operator, she is very good at her job and has been able to use her knowledge of telegraphy to her advantage.Sir Colin Beckwith works at the rival British News agency Reuters and is intrigued by Lucy from the moment they meet. However, they are from two different walks of life, and Colin needs a heiress to help save his crumbling family estate in England.Can Lucy & Nick win the legal war and help the less fortunate by making running water accessible to all? Will Colin be able to find a way to save his family estate and win the woman his heart longs for?I give this engaging book 4.5 stars and highly recommend it to any and all who enjoy reading stories with dynamic characters and rich history.(I receive complimentary books for review from publishers, publicists, and/or authors, including Netgalley. I am not required to write positive reviews. The opinions I have expressed are my own.)"}, {"userName": "Hayden", "userReviewDate": "Oct 26, 2017", "userURL": "http://www.goodreads.com/user/show/21854176-hayden", "userReview": "[ For instance, I wasn't fond of Lucy's end decision about what to do for her uncle. On one hand I could understand how she was trying to help other people by doing so...but on the other, I really thought he needed to go to jail. Instead of feeling like she had let go of revenge and the hold the case had on her, it felt more like a miscarry of justice. I was especially bothered by the fact that to do so she sold the family's heirloom pearls in order to hire a lawyer to do that illegal thing. Maybe it's just the fact that I attach sentimental value to objects - especially ones that have been passed down! - but it also seemed unfair because it was really her brother who had dreamed of giving the pearls to his wife one day, and Lucy's insistence that they sell them (even though it didn't take him long to agree) seemed more selfish and about satisfying her own emotional need (and self-righteousness?) than anything.  (hide spoiler)]"}, {"userName": "Rachael", "userReviewDate": "Oct 27, 2017", "userURL": "http://www.goodreads.com/user/show/22209485-rachael", "userReview": "One thing that has always impressed me is Camden's use of unusual professions, and when a character has a profession, it is important. It isn't just something she assigns to round them out as a character, it's integral to the plot, and it's integral to their person. Lucy is a telegrapher? Her skills are vital. Her brother Nick is a plumber, working in the city's underground? There's way more a plumber can do than you'd expect. Colin is a penniless aristocrat with a love of news and homing pigeons? It's what gives them an edge.I love Camden's ability to surprise me. Several things that I'd expected, based on what would be worst-case scenario in my mind, didn't happen--instead, they led to a twist that I loved, where Lucy and Colin and Nick have an opportunity to be smart, not just brave. I wish I could tell you the brilliant things that happen, but it would spoil the plot. Suffice to say, I loved it all the twists this suspense has taken. And extra points for mature, intelligent heroes who apply to the law for help and use their heads!While I have always enjoyed Elizabeth Camden's books, this one ranks up there with my favorites--The Rose of Winslow Street and Against the Tide (to which I would liken this one to in terms of the feel of the suspense and intelligence-gathering). The faith element might be minor, but it doesn't mean Colin and Lucy are without considerable growth. It's a great story, and I'm excited to see Nick will have his story continued in A Daring Venture (summer 2018). Thank you Bethany house and NetGalley for a free e-book. I was not required to write a positive review, and all opinions are my own."}, {"userName": "Charissa", "userReviewDate": "Feb 08, 2018", "userURL": "http://www.goodreads.com/user/show/3848272-charissa", "userReview": "I always love this author’s stories. They are so rich with historic details, deliciously deep characters, and great romantic tension. Yet they’re clean. The characters in this one are Colin, an English noble who runs Reuters news agency, and Lucy, a telegrapher at AP, that is in the same building. The story is set in the early 1900’s. They meet and feel instant attraction, but Colin knows nothing can come of it. He must marry for money to fix up his estate back in England and keep 90 tenants from poverty. Lucy and her brother are carrying out a 40 year family lawsuit against her uncle for an engineering marvel he’s made bank off of that their grandpa invented. All their money goes to fund lawsuits from their uncle. This is their sad legacy. This story was amazing. I love this author’s riveting plots that come to life because of her in depth research into the time period and events that are happening at that time and place. This one has lots to do with the AP and Reuters news services, that were housed on the same building in New York for years and had a reluctant truce between them. The Panama canal history is delved into too, and lots of mysteries and sinister plots come to light and are unraveled as our characters try to stay one step ahead of the evil villains (which are super evil in this one). I adored the characters. Colin was amazing. I loved his British wit. Lucy was a strong, brave hero that was easy to cheer for. Villains and side characters were easy to picture as well. Once I started, I devoured this book and didn’t want to stop reading. It’s fantastic."}, {"userName": "Martha", "userReviewDate": "Oct 14, 2017", "userURL": "http://www.goodreads.com/user/show/6966032-martha", "userReview": "Sometimes you read a book that you finish and you go, \"Good book.\" Other times you don't enjoy the book as much and move on easily. This was neither of those. This was a book that I finished and thought, \"Wow. I wish I had not just read that book as I would like to read it again!\" Elizabeth Camden is an exceptional author, but I love her unique characters. They have quirks, fun personalities, and flaws, yet you can love getting to know them while learning amazing historical facts without even realizing it. Carrier pigeons, Morse code, newsrooms, spies, and narcissistic/abusive family members are only a few of the topics covered in this fast paced story. It is one you will not want to put down. Elizabeth Camden is one of the authors that is an automatic buy for me. I see she has a new book out and I don't even stop to think if I will enjoy it. I can't wait to see what the future holds for her writing and books! I never think I can have one that tops my favorites by her, and then another one comes along. I obtained this book through NetGalley and Bethany House publishers. The opinions contained herein are my own."}, {"userName": "Hanne T", "userReviewDate": "Jun 02, 2018", "userURL": "http://www.goodreads.com/user/show/41120638-hanne-t", "userReview": "I’ve heard about Elizabeth Camden’s books for a while now, and have even started reading a couple, but this was the first book that I ever read from beginning to end, and I really enjoyed it!! The characters were absolutely precious, and there was suspense and awesome historical background.Lucy Drake is the farthest thing from a sappy, swoony young lady—she has a lawsuit that she is fighting for with her brother Nick and is a master Morse code operator as well. Colin Beckwith is the manager of the rival news agency, and there shouldn’t be any correlation between them . . . right? Well, wrong.Both Lucy and Colin are master telegraph operators, so right off the bat they have something that ties them together. Add that to the fact that their witty banter and their ability to divulge secrets to each other, and you have THE perfect couple.The romance in this book was so well paced: there weren’t any SPARKS RAN RINGLING UP AND DOWN HER ARM; DID HE FEEL IT TOO?? type moments. (Although, they do kiss as friends a couple of times, which was odd??).The redemption storyline was so good, and I did not expect it at all! There were so many cool historical things thrown in too, like carrier pigeons, telegraphs, and society parties.Overall, I really enjoyed this book! A sweet sweet romance with a dash of suspense and amazing history: what’s not to love!My Ranking-8/10Things liked- The characters are so perfect for each other yet so different! Anything with a telegraph gets a point, honestly Slow, more realistic romance Suspense!!! Redemption storyline Awesome history Such grEAT villians!! Lucy’s relationship with her brother!!!Things disliked- They kissed before they were a thing? And for no real apparent reason? The entire story was really good, but the conclusion felt a little too perfect??Thank you to Bethany House Publishers for providing me with a free print copy of this book in exchange for my honest review; I was not required to write a positive review.This review first appeared on: https://rockandminerals4him.wordpress..."}, {"userName": "Amy", "userReviewDate": "Nov 06, 2017", "userURL": "http://www.goodreads.com/user/show/28286656-amy", "userReview": "Elizabeth Camden masterfully weaves consistent tales, full of rich history and details. Her work is always in the details. I am impressed with the efforts she puts into her writing, to retell true events from the past, entwined with her appealing fictional characters. They are not quick easy reads, and I enjoy being able to fully loose myself within the pages. 'A Dangerous Legacy' is the first in a brand new series, set in New York, appropriately titled 'Empire State'. It introduces us to the Drake Family. One side being incredibly wealthy and positioned to influence, not only the local society, but also the political world. The other side of the Drakes are trapped in a state of near poverty due to a 40 year long battle to prove that a water valve, invented to regulate water pressure - was by rights the ownership of their grandfather, not the Uncle that now has extortionate prices and rakes in the millions in profit. Lucy and Nick Drake have devoted their lives and much of their earnings for legal fees, in order to keep their case in the courts. Everything has been put on hold for them, including the very opportunity to marry & settle down. They endure constant threat of loosing everything, except they have one secret up their sleeve. Lucy, a telegrapher for the AP works in the Western Union Telegraph Building in Manhattan. Her path crosses early on in the story with Sir Colin Beckworth, a British aristocrat who works for Reuters. Not only is he a titled landowner, he is also heavily in debt, inherited from his father. His estate in England is in a terrible state of disrepair. Colin feels the weight of the responsibility for his sister and his tenants that rely on him for their survival. He is in New York in his efforts to snag a wealthy heiress, into a marriage that will save his home. Love? That doesn't really come into it. What he does not expect, is to develop a friendship and attraction with strongwilled, passionate fighter and beautiful, Lucy Drake, who takes him on a journey that will not only risk his chances at gaining that financial security, but uncover criminal activity and put both of their lives in peril. Upon finishing this book I was intrigued into the building so commonly used as the backdrop, the telegraph office in which both of these prestigious news agencies were based in real life. It was demolished in 1914, but what a fantastic looking building! Worth a google!As always I loved the story, but I do look for small inspirational pieces. Anyone who is high profile enough will appreciate that its almost impossible to keep themselves out of the press. But you don't have to be celebrity to suffer the difficulties that come when unfounded gossip is spread about you by other means. Comments made that are untrue are incredibly hurtful, and often times almost impossible to defend. When other people make a choice to spread gossip and lies about another, that is their choice to make. I admire what Lucy says towards the end of the book: When dealing with the Count she says quote \"I don't care what people say about us... I care about who we are\" and then later \"There are things you can control in the world, and things you can't\". For those of us who have experienced this, it can be extremely painful. Especially when people you consider your friends choose to believe it. This was a powerful reminder to me today, that there are just some things you cannot control. Learning to be OK with the unkind things people say, is a real challenge. However, as always we should focus on caring about who you ARE. That is far more important, and those that truly bother to get to know you, will know that and value it. I eagerly await the next installment, that will follow Nicholas Drake. Thank you to Netgalley & Bethany House for the eARC. This is my honest review."}], "description": "Telegraph operator Lucy Drake is a master of Morse code and has made herself a valuable asset to the Associated Press news agency. But the sudden arrival of Sir Colin Beckwith at rival British news agency Reuters puts her hard-earned livelihood at risk. Colin is talented, handsome, insufferably charming--and keeping a secret that jeopardizes his reputation.Despite their rivalry, Lucy can't deny that Colin has the connections she needs to give her family an edge in the long legal battle they've been waging over their rightful inheritance. But when she negotiates an unlikely alliance with him, the web of treachery they dive into proves to be far more dangerous than they ever could have known.", "title": "A Dangerous Legacy\n      \n          (Empire State #1)", "url": "http://www.goodreads.com/book/show/34020181-a-dangerous-legacy", "average": 4.16, "cover": "https://images.gr-assets.com/books/1488174563l/34020181.jpg", "reviews": 215, "authors": [{"url": "https://www.goodreads.com/author/show/4373995.Elizabeth_Camden", "name": "Elizabeth Camden"}], "type": ["Historical", "Christian Fiction", "Romance", "Historical", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/34020181-a-dangerous-legacy", "http://www.goodreads.com/book/show/35053882-a-dangerous-legacy", "http://www.goodreads.com/book/show/13511369-against-the-tide", "http://www.goodreads.com/book/show/9374873-the-lady-of-bolton-hill", "http://www.goodreads.com/book/show/11547872-the-rose-of-winslow-street", "http://www.goodreads.com/book/show/16109788-into-the-whirlwind", "http://www.goodreads.com/book/show/18652812-with-every-breath", "http://www.goodreads.com/book/show/28168785-runaway", "http://www.goodreads.com/book/show/35148447-juliet", "http://www.goodreads.com/book/show/35913695-hidden-secrets", "http://www.goodreads.com/book/show/40198274-kiss-me-while-i-sleep", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/35839275-kian", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/26186801-someone-like-you", "http://www.goodreads.com/book/show/18800300-from-thin-air", "http://www.goodreads.com/book/show/18950617-sweet-caroline", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/18800331-to-hope", "http://www.goodreads.com/book/show/33016164-royally-bad", "http://www.goodreads.com/book/show/34609092-royally-ruined", "http://www.goodreads.com/book/show/40193474-the-finishing-touches", "http://www.goodreads.com/book/show/40193549-roses", "http://www.goodreads.com/book/show/19032297-accidentally-in-love-with-a-god", "http://www.goodreads.com/book/show/29231863-splinter", "http://www.goodreads.com/book/show/23622993-claimed", "http://www.goodreads.com/book/show/40243614-just-jilted", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/18800455-the-pms-club", "http://www.goodreads.com/book/show/18800812-gypsy", "http://www.goodreads.com/book/show/35708042-bodyguard", "http://www.goodreads.com/book/show/18800579-willow", "http://www.goodreads.com/book/show/30126159-mosaic", "http://www.goodreads.com/book/show/40389026-summer-island", "http://www.goodreads.com/book/show/12369122-because-of-you", "http://www.goodreads.com/book/show/29373539-the-lullaby-sky", "http://www.goodreads.com/book/show/28441063-secretly-hers", "http://www.goodreads.com/book/show/23271170-tycoon-takedown", "http://www.goodreads.com/book/show/18800411-come-high-water", "http://www.goodreads.com/book/show/33001355-before-i-knew", "http://www.goodreads.com/book/show/40205166-the-paradise-of-glass", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/21425515-once-haunted-twice-shy", "http://www.goodreads.com/book/show/40272947-the-pursuit-of-tamsen-littlejohn", "http://www.goodreads.com/book/show/40193595-the-story-of-beautiful-girl", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/30184217-say-goodbye-for-now", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/18800690-love-is", "http://www.goodreads.com/book/show/26813208-thirty-five-and-a-half-conspiracies", "http://www.goodreads.com/book/show/20489452-thirty-one-and-a-half-regrets", "http://www.goodreads.com/book/show/20687181-thirty-two-and-a-half-complications", "http://www.goodreads.com/book/show/40198652-twenty-eight-and-a-half-wishes", "http://www.goodreads.com/book/show/15836745-twenty-nine-and-a-half-reasons", "http://www.goodreads.com/book/show/36685093-the-unimaginable", "http://www.goodreads.com/book/show/29339972-thirty-six-and-a-half-motives", "http://www.goodreads.com/book/show/23263614-thirty-three-and-a-half-shenanigans", "http://www.goodreads.com/book/show/40199170-thirty-and-a-half-excuses", "http://www.goodreads.com/book/show/24778061-thirty-four-and-a-half-predicaments"]}