{"ratings": 3, "userreviews": [{"userName": "Amy Petty", "userReviewDate": "Oct 14, 2013", "userURL": "http://www.goodreads.com/user/show/24600711-amy-petty", "userReview": "Alan Weltzien's story of his father and of growing up in Puget Sound, and all the changes wrought over the years, both in his life and the region."}], "description": "As author Ann Ronald notes, Simultaneously a paean to his father and a personal memoir about a changing landscape caught by a rising tide of affluence, Alan Weltzeins A Father and an Island: Reflections on Loss, echoes my own Pacific Northwest youththe endless saltwater summers, the quirky behavior of a bookworm, the sweet sharp tang of blackberry cobbler, the fierce games of badminton, the beachcombing days of discovery, the blessedness of parents well loved. Anyone whos grown up in and around Puget Sound will find familiar memories triggered on every delicious page. Some sweet, some nostalgic, some downright sad, theyre all here in this poignant remembrance of things past. Northwest author Mary Clearman Blew writes, In this moving tribute to his father and his familys home on a Puget Sound island, Alan Weltzein returns us to a time when summers were glorious and children played all day long on beaches that were still unexploited and unrestricteda pleasure to read. Weltzien's memoir is an essential book for Northwest Letters.", "title": "A Father and an Island: Reflections on Loss", "url": "http://www.goodreads.com/book/show/6351797-a-father-and-an-island", "average": 4.0, "cover": "https://images.gr-assets.com/books/1348437003l/6351797.jpg", "reviews": 1, "authors": [{"url": "https://www.goodreads.com/author/show/63787.O_Alan_Weltzien", "name": "O. Alan Weltzien"}], "type": [], "outlinks": ["http://www.goodreads.com/book/show/6351797-a-father-and-an-island", "http://www.goodreads.com/book/show/110200.Literary_Art_and_Activism_of_Rick_Bass", "http://www.goodreads.com/book/show/27409954-exceptional-mountains", "http://www.goodreads.com/book/show/54973.Coming_Into_Mcphee_Country", "http://www.goodreads.com/book/show/110204.Rick_Bass", "http://www.goodreads.com/book/show/4757686-the-norman-maclean-reader"]}