{"ratings": 1128, "userreviews": [{"userName": "Esil", "userReviewDate": "Apr 22, 2015", "userURL": "http://www.goodreads.com/user/show/3643764-esil", "userReview": "I’m struggling a bit to figure out why I enjoyed reading After Perfect as much as I did, but I did. The author was born into a life of extreme privilege. Her father was an \"IPO lawyer\" who was charming, obsessed with wealth and status, and who showered his wife and three daughters with endless luxury cars, houses, vacations and jewelry. But it turns out that the family lifestyle was built on lies. When she was 18, the author's father was arrested for fraud. In the form of an impressively recollected and documented memoir, the book begins with her father's arrest and covers the next few years of the author's life with a few flashbacks to her childhood. And while McDowell's story as described may sound a bit too much like a “poor little rich girl” story, I found myself completely engrossed by her memoir. I think it's because she seems very honest and sincere, and is not trying to make excuses for herself or her family. She paints a frank picture of the near grotesque materialism of her family, her hope against all the evidence that her father was in fact not a fraudster and that he would re-emerge to save her and her family (even blindly getting entangled in his schemes), her emotional dissolution after the arrest, and her successful attempt to rebuild herself as someone who is able to distance herself from the weird values she grew up with. The raw greed and its consequences is fascinating. The author's honesty and self-critique allowed me to have sympathy for her. And there are a few scenes at the end that are particularly moving – in particular a scene in which she goes to a prison on behalf of a victim organization and speaks to incarcerated fathers about the impact of her father’s crimes and incarceration. Somehow all of this together made for a book I had trouble putting down. I don't expect this book is for everyone and the topic wouldn't normally be my cup of tea, but I really enjoyed it and found it quite moving. Thank you to Netgalley and the publisher for an opportunity to read an advance copy of this book."}, {"userName": "Jenna", "userReviewDate": "May 31, 2015", "userURL": "http://www.goodreads.com/user/show/38727943-jenna", "userReview": "[you periodically come across some forgotten-about, museum-quality fine art you can sell for many thousands of dollars (hide spoiler)]"}, {"userName": "Cara", "userReviewDate": "Jul 27, 2015", "userURL": "http://www.goodreads.com/user/show/1865614-cara", "userReview": "This book left my face feeling sore and tired from all the eye rolling. Perhaps I'll write a book about how hard life was for the 1 week it took me to finish reading this embellished, bull shit sob story."}, {"userName": "Doris Jean", "userReviewDate": "Oct 01, 2017", "userURL": "http://www.goodreads.com/user/show/26634995-doris-jean", "userReview": "I was not convinced. Her memoir felt contrived to me. The author is a younger woman who supposedly went from the top echelon of the Washington, D.C. elites to the bottom of sleeping at friends' shabby apartments in Hollywood when she was a waitress or actress. But she was never really on the bottom, she could always stay with her millionaire friends in D.C. or Malibu. The author was expert at constantly inserting multiple names of the rich and famous she supposedly was connected to throughout her book. The entire book is heavily laden with chic brand names of clothing, books, paintings, cars, airplanes, restaurants and other products. This felt very phony.She had various jobs but lacked the work ethic and lied and came in late, stole from her jobs, drank at the jobs and was always fired. She seemed most comfortable as an actress since she was lying to others and to herself about her fraud father and her entire life. She indulged in drinking and passing out, multiple drugs and promiscuous sex. Her lying father was a securities lawyer who went to prison for financial fraud, and on his way to federal prison, this crook took her identity and stuck her with huge debts. The father was the most believable character in this fable.I didn't like the confusing writing. There were many childhood flashbacks and adult flashbacks and dreams and nightmares which confused me. There were often little patches of scenes suddenly dropped in an inappropriate place without any guidance to the reader whether they were part of the present or flashbacks or one of her dream scenes or a nightmare scene. I was often confused.Another reason I did not like the writing was because of the vomiting and snot and weeping. Every few pages there was a graphic description such as \"suddenly yellow liquid and chunks of meat spewed from his mouth...caught part of it...lurched...gagging from the sour stench of chewed up cheap turkey...\". Or someone was sobbing uncontrollably while strings of snot slimed down their chest. There were too many of these disgusting descriptions too often which did not add to the story.I also was disgusted by the author's actions, she lied, cheated, stole, slept with multiple boyfriends and seemed to lack any kind of integrity or self-respect or shame. Her sex scenes were ugly to me: \"...my head banging...headboard...legs...spread wide...Chad jackhammering his entire body against my lungs...he came with my hair bunched in his fist...\". The author wrote passionately about all this unpleasantness and seemed to relish negativity and evil.The last two chapters seemed written by an entirely different person. She met a woman named Amalia who took her to speak to prisoners. Then the author wrote a \"goodby\" letter to her dad and revisited her childhood home. We are supposed to believe that these incidents corrected her and she is now suddenly normal. The last chapters were unemotional, logical and lacked the passion expressed for all the former sordid ugliness and negativity. The last two chapters showed the author as a normal person with character and integrity. She wants us to believe that she, as the irresponsible person for most of her life in most of the book, finally suddenly quit misbehaving and started taking responsibility and is now a writer. I think she may have greatly embellished the ugliness she wrote about since the person in all of the book except the last two chapters was so deeply flawed with such severe ingrained personality disorders that she could not possibly have just became suddenly sane. I did not believe this story (\"memoir\"?) at all. This is a disgusting, unhappy and sad book."}, {"userName": "Erin", "userReviewDate": "Apr 22, 2015", "userURL": "http://www.goodreads.com/user/show/301501-erin", "userReview": "ARC for review. First off let me say that there may be readers who dislike this book from the \"Yeah, cry me a river about your privileged childhood when there are orphans eating garbage in Calcutta\" and while I can totally understand that reaction, I thoroughly enjoyed and appreciated this memoir of Christina McDowell, nee Prousalis, the daughter of a man convicted of and imprisoned for insider trading in that it allows us to see the collateral damage these sorts of actions leave behind. Christina and sisters Mara and Chloe grew up incredibly privileged in the wealthy suburbs of Washington, D.C. Her father Tom was an attorney specializing in IPOs and he made millions....before he lost them and made the fatal mistake of trying to recoup his losses with lies and securities fraud. Christina and one sister were in college (Christina hoped to be an actress which leads to some interesting name dropping and a long-time friendship with actress Emma (nee Emily) Stone), while Chloe was still at home, and we see the entire take down, from investigation, to arrest, to trial. Then the family loses everything and Prousalis's parents only compound the problems by taking out debts in HER name. When her father is released the lies continue, but Christina, her sisters and her mother are all used to having men in their lives to care for everything - and in some degrees that continues. Essentially although all these women are technically \"adults\" none are able to cope without the dual cushions of a man and money to care for them and we watch all of them fall apart in various ways over the years. Want to read a modern-day, true-life Dominick Dunne story gone bad? This is the book for you. Thoroughly enjoyed this."}, {"userName": "Judith", "userReviewDate": "Dec 02, 2015", "userURL": "http://www.goodreads.com/user/show/301768-judith", "userReview": "Such an interesting premise: the author is the daughter of a man who was like \"The Wolf of Wall Street\" and she tells her side of the story here. It's a fascinating look at what it's like to be raised in extravagant luxury till the day it ends in fraud charges, loss, disgrace, and jail. I really enjoyed this true story but eventually had to give up on the book because the writing was too irritating. Sentences like this: \"Far from the life my parents had built, and it created a ripple of resentment and divide between families, keeping my mother and brother apart until grief brought them back together again.\" made me want to get out my red pen and start correcting in the margins. Then there would be a dramatic break-up with a boyfriend, only to have him reappear in a later scene with no explanation whatsoever. In fact, I had trouble following why certain characters continued to be in this woman's life long after they had burned all their bridges."}, {"userName": "Lucinda", "userReviewDate": "Dec 07, 2015", "userURL": "http://www.goodreads.com/user/show/36341274-lucinda", "userReview": "I thought this young woman was overly dramatic and a slow learner. So she grew up in a privileged family and nobody ever taught her how to manage finances, how long does it take to learn? Her mother gave her a valuable painting which she sold for $13,000.She sold it (good move) and proceeded to blow every cent on non-essentials! Nothing put aside for rent, no dental check-ups, no repaying her friends generosities - just blew through it. This was after she had been on her own and barely scraping by. What did she not understand? She had no money for food, but always had a cell phone, and at one point flew back to DC for a friend's party. Sorry for your loss, Christina, but you needed to buck up a lot quicker! Couldn't muster up much sympathy. I did feel her mother could have been more supportive. She did not grow up with the privileges that Christina enjoyed for 18 years. She should have had enough common sense to help her girls through the transition. She did not."}, {"userName": "Megan Nigh", "userReviewDate": "Dec 01, 2015", "userURL": "http://www.goodreads.com/user/show/5828822-megan-nigh", "userReview": "I have really strong feelings about this memoir. On the one hand, I saw the author felt victimized by her parents. But on the other hand, she was an adult when all this happened. She was in college. Granted, she grew up sheltered and spoiled, but come on! You can't go back to some fancy-pants private college? Take some courses at community college. Work a job, maybe even two. I get why she was reluctant to sue her father for stealing her identity, but come on! In a way, her ignorance reminded me a lot of the \"Bling Ring\" girls. I also am confused why she blasted \"The Wolf of Wall Street\". The movie isn't exactly a love ballad to greed and excess and fraud. Not sure many people would see that movie and want that life. I feel like her blasting that movie was a way for her to be relevant. And this book left me with the same feeling. She name drops constantly--wonder how Emma Stone feels about her many mentions in this book? The writing isn't fantastic--it seemed like alliteration was the only stylistic device she knew how to use. Between that and the cliches...Maybe I'm being too harsh. Girl lived a tough life and it seemed like at the end she was aware that she made her own decisions post-arrest of her father that made her life much more difficult. But at the same time, its hard to feel much sympathy for her. No, she isn't her dad, and yes, she is a product of her upbringing. But her constant name-dropping and going on about her D.C. socialite friends that remain, makes me think she still hasn't come to terms with any of this."}, {"userName": "Michelle", "userReviewDate": "Aug 16, 2015", "userURL": "http://www.goodreads.com/user/show/93254-michelle", "userReview": "4.5+ stars. I read this in one sitting. Captivating memoir written by the daughter of a guy jailed for fraud, among other things. Billed as the \"other side of the Wolf of Wall Street\" story, there's not a lot about the Wolf himself, other than the idea that the threat of his testimony was going to be very bad for the author's father. In any case, a very well-written account of her family's struggle after all was taken away, materialistically speaking, not to mention emotionally and even their \"good names\" (or not completely horrible ones). A sad reflection on a girl's love of her father and the way he manipulates that just as he manipulated various stocks. A few familiar names and places in here (including a former boss and my alma matter) and all in this is about much more than \"I had planes and jets and then I didn't.\" The descent is much greater than that."}, {"userName": "Veronica ", "userReviewDate": "Aug 20, 2015", "userURL": "http://www.goodreads.com/user/show/6912850-veronica", "userReview": "I received this book in my Book Of The Month shipment and wasn't expecting a lot honestly. I didn't really read anything more then the blub online. However, this book really surprised me. The author, Christina McDowell, writes such a intriguing memoir of her life after her dad got thrown in prison for being an associate of Jordan Belfort and bankrupting his family leaving this family in complete monetary and physical ruin. This effected Christina more then all the other family members it seems, she basically had to raise herself all over again when both parents abandon her to fend for herself. It was such a heartbreaking experience to realize your parents are not what you think they were & how this betrayal tore this girl apart. I loved the writing and pure raw honest she had thru out. I can't wait till she writes fiction at some point. Good memoir read!"}, {"userName": "Jay", "userReviewDate": "Oct 18, 2015", "userURL": "http://www.goodreads.com/user/show/6195670-jay", "userReview": "Powerful & close to homeWords cannot express just how deeply Ms. McDowell's memoir impacted me. Prison aside, I feel as though I've read about my own life in a sense, Greek heritage included. One must give McDowell credit for stripping herself bare & bleeding all over the pages of this memoir. While at first it may give some readers a perverse pleasure to see a one-time rich girl's plunge from grace, the fact is the grief, confusion & lack of identity is palpable. Above all, I could feel her pain as she lingered... Hoping... Waiting for someone to save her.While many readers sneer at Christina's way of (not) coping, what I hope people realize is that one of the luxuries of those who grow up without vast amounts of wealth is that they generally have a realistic view of the world. For the Christinas, however, it's often missing. Not because parents have ill intent & try to harm, but because they do not want their children to suffer or want for anything. If or when it all falls down, the void is overwhelming, not because you don't have a new BMW, but because you've never had to deal with challenges in the way the majority of society does. When you've always had a safety net, even simple things seem overwhelming & insurmountable. I don't write this as someone who had their family lose their money, but rather, an experience where I was forced to make 'adult' decisions, but felt like I spent the majority of my time trying to find someone who was a real adult. Age is a number—when no one teaches you the lessons that are a part of growing up, is it surprising when privileged adult children don't know how to cope? Dig deeper. While I see & understand what/why many view as shallowness, context is everything. In the end, we aren't offered the secret to life or happiness or a saccharine speech about how Ms. McDowell saw the light and we can too. Instead, we get the sense that with as much healing and catharsis came from the pages, the author is in the same spot where so many of us struggle—living day by day & remaining in the moment rather than thinking of/wishing for the way things 'should' be. I would hope that 'After Perfect' isn't looked upon with a twisted pleasure of watching a former rich kid's fall from grace, but rather proof that no matter how perfect life may seem, you never know what lurks behind closed doors. One must commend Christina for working on rebuilding her life, whether they disagree with the amount of time it took, etc... The point is, she's done something about it now & is continuing to move forward. I hope to read more by the author & hope life continues to improve. I certainly root for her.An excellent memoir, one of the best I've read in 2015."}, {"userName": "Naomi Kelsey", "userReviewDate": "Oct 19, 2015", "userURL": "http://www.goodreads.com/user/show/26572877-naomi-kelsey", "userReview": "A slushy, poorly written and unrealized memoir by a writer who needs more time in training. I was interested in this book and for about the first 1-2 chapters engaged in it, especially hoping that it would get better as it went along. The story centers around the author's father's trial and conviction for fraud, and the fallout. It's written in an episodic, almost journal-like stream of consciousness, which itself is not very well done. Cliches, clunky writing, \"poor me\" syndrome, humble-bragging, hard-to- follow leaps in time and a very unclear sense of development all hamper the writing. The thing about memoirs that take place over long periods of time (in this case, from 2004 up until now, I assume, since i didn't finish it) is that oftentimes individual memories are not enough to carry a book. Historical context, interviews with others in the situation, background research, character sketches---all that's missing from this book. We never find out the details of the father's case. We never get any context around why it happened exactly or the outcome. (Other than the most bare bones outline). We don't have any background on the major players--the judge, the DA, the defendant, the people bringing the lawsuit, etc. Anne Rule is a non-fiction author known for her true crime books. Her style is breezy and dishy, and honestly the details of the cases she writes about are often not enough to fill an entire book. So she researches the background of the major players, creating a portrait of each person involved in the crime in depth; and by the time the events are set in motion, the reader cares about the players and is invested. This author brushed shoulders with quite a few boldfaced names and doesn't take any advantage of that fact, just dropping the names and moving on. There is quite a bit of historical context that could have been mined for background--nope. I was very let down by this book. I think many readers will be taken in by the \"fragile little girl abandoned who finds herself\" trope and like it, and that's okay. But for my money, this author should have hired a ghostwriter."}, {"userName": "Karen", "userReviewDate": "Aug 25, 2015", "userURL": "http://www.goodreads.com/user/show/8168493-karen", "userReview": "I grew up in Newport, RI and there was always a fascination there about the rich, and what made them different from the rest of us poor plebs. Generally I would find it difficult to feel sorry about the ones who fall, but in this case we are talking about the children of the rich--children who had been fed a lie their whole lives. This book was written by one of them. Her name was Christine Prousalis, and her father was one of those who fell after the \"wolf of wall street\" debacle. Her entire life had been built on lies, and her wealth and privilege were tainted by the sins of her father. The family lost it all--money, innocence, security, the good life. This girl went to the best schools and had the best stuff. She was that girl we might all have wanted to be at one point or another in our lives. The one with the cool car, clothes, and boyfriends. Nothing would ever touch her. She had a starry future and few worries. And then dad went to jail, and they lost it all. Suddenly Christine found herself having to fend for herself in a world that she never prepared for. She had artwork that was worth a bit of money but sold it and blew the money. She worked in fancy bars, and got high a lot. Her life was not progressing at all and daddy kept on lying to her about how great things would be once he got out of jail and did a few deals and made all his money back. She believed him. He was a shell of a man but in spite of everything, she knew he would make things right again. He failed of course, and left her devastated and alone. Once out of jail he eventually slipped out of her life and left her holding the bag of his past schemes and debts. So was she an idiot who couldn't see the writing on the wall or just a devastated daughter. I think a little of both. She evolves and gets on track again, but I can't help but care about the betrayal she suffered and the pain she underwent. He was her dad, and he abandoned her in the wrack and ruin. She changed her name to try to leave him behind. The rich are different, yes, but not immune to the pain. I wish her the best."}, {"userName": "I'd So Rather Be Reading {Nat}", "userReviewDate": "Jun 06, 2015", "userURL": "http://www.goodreads.com/user/show/2876030-i-d-so-rather-be-reading-nat", "userReview": "After reading Christina's open letter to the producers of The Wolf of Wall Street, featured in LA Weekly, I was excited to read her book. I'm not usually one to pick up memoirs, but Christina's story intrigued me and I had to know more about her and her journey.The first thing I noticed and liked about this book is that Christina is unflinchingly honest. I admire that. Christina told the truth when it made her look bad, when it would have been so much easier to skim over things or just omit them. She never took the easy way out, though. I could feel her commitment to telling her story, her whole story, and tell it she did. I admit that I haven't spent much time thinking about the families of the men of Wall Street who were caught breaking the law. I certainly never imagined a father who would steal his own daughter's identity to keep living a lie of wealth, even as he waited to go to prison. The grim reality of the Prousalis family's fall from grace was sobering. And as I read about Christina being hungry, not having a place to live, and struggling to find work, I just couldn't believe the disparity of her past and current lives. The story went from present times back to the family's wealthy years. They lived the high life, and it was definitely easy to feel jealous of their lavish lifestyle. But the line that I kept hearing in my head was, \"we never knew any different.\" And that made me feel sorry for Christina. To have the false security of having grown up in a bubble of wealth---never knowing any other way to live---and that bubble was shattered in an instant.I love the way Christina ends her book: not with a story of great redemption, but with one of resilience, coping, and growth. It made me proud of her and happy to feel as though I knew her, through her words. I really enjoyed After Perfect and would definitely recommend this book."}, {"userName": "Esther Bradley-detally", "userReviewDate": "Sep 02, 2015", "userURL": "http://www.goodreads.com/user/show/2785181-esther-bradley-detally", "userReview": "I give this book 5 stars because of the gutsiness of the message; her gutsiness to disclose and also to clearly display the extremes of wealth and poverty, and the narcissism and slime of greed.All abstract terms. In the beginning, I wasn't too sympathetic to this young woman or her family, but as the book went on, I totally felt behind her. What betrayal. It's hard to see beyond our immediate culture whatever that is, but we must. Her family, for the most part, was odious. Yes she was lost. Yes, she went a long way down, but she had the courage to talk about it. None of us know to what level we would descend to survive.What I admire most about this young woman, Christina McDowell,is her courage to face a new reality, work with Writers InsideOUT, and make it through the storm. Her entire family heritage was false, and she suffered immense betrayal. My language feels odd; The girl was gutsy, misguided, but it was her reality. Children can be imprisoned by family culture within their own homes. She was. She also sheds tremendous light on the greed and lies and absolutely amoral behavior of many in this money market culture. I feel she's now living a life of purpose and probably helping many young people. I wish her tremendous success."}, {"userName": "Barb", "userReviewDate": "Jan 27, 2016", "userURL": "http://www.goodreads.com/user/show/555031-barb", "userReview": "It is almost appalling to read the privilege and head-in-the-sand lifestyle of this family. I felt very engaged in the story so I'll give it three stars but there's a part of me that was a little disgusted with how every member of this family handled themselves."}, {"userName": "Susan Bazzett-Griffith", "userReviewDate": "Jan 19, 2018", "userURL": "http://www.goodreads.com/user/show/19421489-susan-bazzett-griffith", "userReview": "I struggled to like this book and forced myself to finish it. Christina McDowell's memoir about her elite D.C. upbringing and sudden descent into poor little not so rich girl (who still had a closet of designer clothes and accessories likely worth more than my house) should have provoked more sympathy from me, I guess? I mean, no, we don't choose our parents and yes, her dad screwed their family over, but....even at the end, when she's trying to put some good out into the world volunteering, I had no pity for her, and I also had no real respect for her either. The book makes her seem entitled and clueless and sad, but I just had no connection to her voice throughout the chapters beyond, yeah, that must have sucked....but come on. Life isn't perfect, this part isn't after perfect, and if you had 18 years of blissfully ignorant perfection, thats 18 years more than most. 2 stars because the writing wasn't terrible, but the book is not one I'd recommend to anyone who makes less than mid six figures."}, {"userName": "Maia", "userReviewDate": "Feb 18, 2018", "userURL": "http://www.goodreads.com/user/show/45251327-maia", "userReview": "This book was addictive and I couldn’t put it down: stayed up way too late finishing it in one night. I grew up lower middle-class, by sometimes we were so poor in the 1980s that saving up for a new winter coat was part of my late summer plans. There are skills that many of us learn early by necessity: how to open a bank account, how to save money for something we really want, how to work hard now towards a goal, and even how to find a job that doesn’t require “hustling” one’s body. The author never learned any of these skills growing up, and apparently neither did her mother. This book was a cautionary tale to me about the risks of wealth for children during their development. Most of the people I know have all had that safety net of Mom and Dad to fall back on, but when you don’t, then what? This book is an example of what can happen. Being protected from the dirty and scary parts of life leaves one as vulnerable as a newborn baby."}, {"userName": "Robert Miller", "userReviewDate": "Jul 05, 2015", "userURL": "http://www.goodreads.com/user/show/14526744-robert-miller", "userReview": "Christina McDowell (nee Prousalis) writes about her emotional roller coaster ride, starting from the gates of her lavish life surrounded by the rich and famous, and similarly situated friends, as she cruised through her adolescent and teen years without noticing how the other 99% of the world lived, to a finishing line of despair, drugs, reckless sex and near insanity in the seedy parts of California. Prior to her adventure, her father, Tom Prousalis, was a securities lawyer who marketed himself as an expert in the Initial Public Offerings (IPO) arena, a niche that included organizing smaller companies through an underfinanced start, to prosperity by raising capital from investors. The idea was Prousalis would handle the legalities, including a full disclosure of the risks associated with the venture; he was indicted by the feds for not making the appropriate disclosures and sent to prison; all of the assets he had accumulated, including the grand estate where the author lived along with her two sisters and mother, was foreclosed on by the bank. McDowell, now broke, virtually homeless, and abandoned by many of her so-called friends, left for California only to meet up with more betrayals and obstacles. Her father, a sociopath, incapable of feeling real empathy for others (including his daughters), stuck McDowell with substantial credit card debt he had clandestinely managed to place in her name. McDowell does a very good job at explaining how she learned to survive on the streets (well, not totally on the streets, she always seemed to get some money from mom and others) by working multiple waitressing jobs, failed actress attempts, and cashing in (or leaning) on friendships she developed along the way. During this period, her life was filled with drinking, sex and drug usage and self-examination, as she attempts to cope, not only with a life she is completely not accustomed to, but also as an escape from confronting the realities of her father’s mental sickness. McDowell seems to have graduated from the “school of hard knocks”, but it was not easy, and her writing is compelling. I recommend the book."}, {"userName": "Crystal Brown", "userReviewDate": "May 04, 2015", "userURL": "http://www.goodreads.com/user/show/1161148-crystal-brown", "userReview": "After Perfect, by Christina McDowell turned out to be a little different from what I was expecting.And by different, I mean better. The description hinted at Christina’s struggle with drugs and alcohol, and I suspected that the bulk of the book would center around that aspect of her life.I’m glad I was wrong. The story she tells of her life is so much deeper than that. She, of course, does write about using drugs a lot as a coping mechanism, but the actual story is rooted in her struggle to come to terms with the differences between who she thought she was supposed to be, who she is, and who she is becoming–and what she has to let go of.While the writing isn’t as polished as some of the memoirs I’ve recently read, it is brutally honest, which is where the real power of the books comes from for me.This is McDowell’s first book, and I hope she is writing another, because I’m sure it well be better.I’m not saying her writing is bad, but the real strength she has is in storytelling. She is very good at including details that make her story come alive and details that connect her to her readers.I did feel like the first third or so of the book moved a little slowly, and I had a little trouble being drawn in, but once I got over that hump, I really got into the book. I especially enjoyed how wonderfully McDowell integrated stories from her past and present.I admire McDowell for the strength it must have took to tell her story so unflinchingly, and look forward to her next book.You can pick up After Perfect on June 2, 2015.3.5 of 5 starsI received a complimentary copy from the publisher on NetGalley, but the opinions expressed are my own."}, {"userName": "Tess Julia", "userReviewDate": "May 07, 2017", "userURL": "http://www.goodreads.com/user/show/10990633-tess-julia", "userReview": "I was between a 3&4 stars review on this one, but ultimately chose 4 because I read through it wanting to know what happened next. I truly felt compassion for Christina, because even though she was a legal adult, she was still just transitioning between childhood and independence when everything changed. While there was a little too much self pity, which got annoying, I felt it was understandable why she was so lost. Her father was greedy and selfish, but when everything was gone, her mother just checked out and gave up. I see her as the most pathetic character, and really can't see her excuse. When her girls needed her the most, she wasn't strong enough to pull herself together and support them. Glad that in the end Christina stopped the self destruction, learned to give back, and that \"things\" don't bring happiness."}, {"userName": "Stephanie", "userReviewDate": "Jan 23, 2017", "userURL": "http://www.goodreads.com/user/show/6031286-stephanie", "userReview": "This memoir is about a woman who grew up in the tony suburbs of DC with incredible wealth. Only to find that her father is a con artist who was arrested for securities fraud and went to jail. This happened when she was a freshman in college and it traces the 10 years after and how it fractured the family. She went on a downward spiral (for many reasons, not just money). I think it was very well written and there were times I could not put it down. She's super honest and raw and reveals stuff about herself many would not. But that is what makes a great memoir...one that doesn't hold on the details."}, {"userName": "Missy Maloney", "userReviewDate": "Jul 09, 2016", "userURL": "http://www.goodreads.com/user/show/6586620-missy-maloney", "userReview": "Moving .. Such a cautionary taleI am so glad she has written this book. There are so many lessons that can be taken from her story. And, she is a talented writer who can really keep the reader interested. I feel so sad for everyone.. I wish she could get some validation from her father, though... Is that too fairytale-ish? Geez, Tom, give the girl a break and apologize!"}, {"userName": "Yukari Watanabe", "userReviewDate": "Jun 03, 2015", "userURL": "http://www.goodreads.com/user/show/2057405-yukari-watanabe", "userReview": "I changed my mind and switched to 5 stars, because this memoir achieved what the author intended. I got the clear picture and clear message. Well-done.My Japanese review: http://youshofanclub.com/2015/06/06/a..."}, {"userName": "Michelle Reilly", "userReviewDate": "Apr 19, 2016", "userURL": "http://www.goodreads.com/user/show/4166366-michelle-reilly", "userReview": "Quick, entertaining read but knowing what I know about her and her fathers relationship currently it kind of ruined it for me. Hard to know who to believe, which ruins memoirs. I need truth, or mostly truth."}, {"userName": "Sally", "userReviewDate": "Mar 21, 2017", "userURL": "http://www.goodreads.com/user/show/30242111-sally", "userReview": "This book was a quick, easy read, but the author's constant name dropping and entitled personality get old quickly. She was 18 when her dad went into financial ruin. It's unfortunate that she chose to continue chasing fame and feeling sorry for herself instead of figuring out how to support herself without her parents' money, like most adults. Her parents losing everything isn't the problem here; her biggest problem was her own inability to make responsible choices from that point on. I feel like even now, she doesn't really get that. Christina bitching about things like how stressful it was for her family to be unable to pay the $7,000 a month rent in the house they had to move into after they \"lost everything\" was unintentionally hilarious. Are we supposed to feel sorry for them? Here's an idea: Move to a city/town/state you can actually afford to live in. Get a full time job that allows you to pay your bills, even if you think it's degrading, and actually show up. The whole family's refusal to live within their means because they feel like they're above living and socializing with the lower middle class, despite being broke, was mind blowing. Towards the end, Christina finally somewhat addresses her own failures, but it's still with a victim mentality. It's kind of like, \"OK, so maybe I did make some bad choices, but really it was still all my parents' fault.\" Ultimately, she comes across as a spoiled brat who is upset because her plan to party with politicians and celebrities for the rest of her life on her parents' dime went up in flames and she was too irresponsible and image obsessed to do what she needed to do to protect herself."}, {"userName": "Kelli", "userReviewDate": "Jul 19, 2017", "userURL": "http://www.goodreads.com/user/show/1459993-kelli", "userReview": "Somewhere between two and three stars, After Perfect: A Daughter's Memoir kept me interested but not enthralled. McDowell's story is interesting but I wish someone else had written the book for her. There were so many people mentioned in the book that it was impossible to keep them straight when they reappeared periodically. McDowell, her mother and two sisters all bore the brunt of her father's imprisonment for white collar crime and their status as victim of having lead an excessively lavish, privileged lifestyle up to that point was exacerbated by an incredible inability to handle finances. The book follows McDowell as she meanders through her twenties working in bars, turning to drugs, alcohol and sex to help alleviate her pain from the financial burdens placed upon her by her father's reckless actions."}, {"userName": "Una Rose", "userReviewDate": "Aug 11, 2017", "userURL": "http://www.goodreads.com/user/show/15885898-una-rose", "userReview": "I find books about how the other half lives and falls to be generally entertaining as well as annoying. One that contains the lives of those who are generally seen as modern day villains, the sultans of white collar theft and corruption who's greed helped America into decline, promised to be both. I found it easy reading and perhaps a little too light- basically what you'd expect from the topic that's covered. Its still an interesting story and with a hopeful message of sorts. The writing is pretty basic but readable. A quick, enjoyable read (unless writing style and substance is important to you) and one that that holds no surprises."}, {"userName": "Marc Cullison", "userReviewDate": "Jan 01, 2018", "userURL": "http://www.goodreads.com/user/show/14268237-marc-cullison", "userReview": "My first reaction to this book was not favorable. I thought it was going to be a sob story about a spoiled, ultra-rich, snobbish girl, whining about something that didn’t go her way. The deeper I tread into the memoir, I began to realize that those folks have problems, too, and this girl was a victim of her family’s neglect and selfishness. It gave me an understanding of how wealth distorts reality and distances one from the average person, leaving no trace of empathy or compassion. I’m sure it took much courage to write this memoir, and I applaud the author for doing it."}, {"userName": "Tamara The Reader", "userReviewDate": "Apr 03, 2018", "userURL": "http://www.goodreads.com/user/show/80254036-tamara-the-reader", "userReview": "It took me forever to finish this book. It's the story of a young woman whose life drastically changed after her father's imprisonment. The author went from living a life of privilege to struggling to make ends meet. This book reminded me of a friend who calls you every week to complain about their circumstances. To me, the author came off whiny and entitled. Still, I commend her for telling her story and allowing her situation to change her outlook on life."}], "description": "In the tradition of New York Times bestsellers What Remains by Carole Radziwill and Oh the Glory of It All by Sean Wilsey, Christina McDowell’s unflinching memoir is a brutally honest, cautionary tale about one family’s destruction in the wake of the Wall Street implosion.Christina McDowell was born Christina Prousalis. She had to change her name to be legally extricated from the trail of chaos her father, Tom Prousalis, left in the wake of his arrest and subsequent imprisonment as one of the guilty players sucked into the collateral fallout of Jordan Belfort (the Wolf of Wall Street). Christina worshipped her father and the seemingly perfect life they lived…a life she finds out was built on lies. Christina’s family, as is typically the case, had no idea what was going on. Nineteen-year-old Christina drove her father to jail while her mother dissolved in denial.Since then, Christina’s life has been decimated. As her family floundered in rehab, depression, homelessness, and loss, Christina succumbed to the grip of alcohol, drugs, and promiscuity before finding catharsis in the most unlikely of places. From the bucolic affluence of suburban Washington, DC, to the A-list clubs and seedy underbelly of Los Angeles, this provocative memoir unflinchingly describes the harsh realities of a fall from grace. Full of nineties nostalgia and access to the inner circles of the Washingtonian societal elite, Christina McDowell’s beautiful memoir is a Blue Jasmine story from a daughter’s perspective.", "title": "After Perfect: A Daughter's Memoir", "url": "https://www.goodreads.com/book/show/23492618-after-perfect", "average": 3.61, "cover": "https://images.gr-assets.com/books/1429097080l/23492618.jpg", "reviews": 156, "authors": [{"url": "https://www.goodreads.com/author/show/9824949.Christina_McDowell", "name": "Christina McDowell"}], "type": ["Autobiography", "Biography", "Audiobook", "Biography Memoir"], "outlinks": ["http://www.goodreads.com/book/show/23492618-after-perfect", "http://www.goodreads.com/book/show/24396248-after-perfect", "http://www.goodreads.com/book/show/29459001-forging-pilgrim-roads"]}