{"ratings": 372, "userreviews": [{"userName": "Bill", "userReviewDate": "May 09, 2014", "userURL": "http://www.goodreads.com/user/show/1811095-bill", "userReview": "I've been hearing for years about what a great writer Robert Stone is/was so I decided to read this, his first novel. I have to say that I was completely disappointed and underwhelmed. I'm not even sure about the three stars, but I'll leave it that way for now. There are three main characters, an alcoholic disc-jockey, a girl who's face was slashed with an oyster pick (I didn't know there was such a thing), and a guy who completes surveys with welfare recipients. All three of these people end up in New Orleans and they variously become entangled with a nefarious character who has it in for African Americans (in the book the N word is used repeatedly instead). Then basically at the end of the book all hell breaks loose, to what purpose I'm not really sure. I have Dog Soldiers, which is supposed to be his best book, so I'll probably give that a try at some point, but I'm in no great hurry to do so."}, {"userName": "Adam", "userReviewDate": "Dec 09, 2007", "userURL": "http://www.goodreads.com/user/show/214053-adam", "userReview": "Stone’s first novel is harrowing portrait of America on the utter edge of despair and destruction. This is surreal American poetry of unease; which has been compared to Lowry (the chemical addled rants and prophetic visions), Conrad (the “Hollow Men” Reinhardt and Sailor Farley), Nathaniel West (the deranged riot echoes the ending of Day of the Locust), and Chandler. Set in a Jim Crow era New Orleans (recast as a hell out of Bosch or Dante), but its unholy vision of conservative talk radio, false prophets of the Christian right, and the willingness to provoke violence to sway public opinion; has not dated at all."}, {"userName": "Eli Bishop", "userReviewDate": "Mar 05, 2012", "userURL": "http://www.goodreads.com/user/show/278873-eli-bishop", "userReview": "It's just ridiculous for a first novel to be this good. Yes, it sometimes wanders off into purple Beatness (which was one of the things I loved when I first read it way back when, and less so now) but it's still so rich and earthy and funny, and even when the humor is mean, there's a compassion to it that Stone didn't always bring to his later books. Rheinhardt is the kind of smart bitter wastrel that Stone has written about a lot and he's very good at writing that kind of dialogue (I still crack up every time I read the \"seven years in Fernando Poo\" scene), but if the book had all been about him, as it starts out seeming to be, it would've been empty. Geraldine and Rainey, the awkward characters with hearts, are what really ground the book and make Rheinhardt's choices feel so terrible.Also, as well as being an often bizarre stream-of-consciousness satire and a tragic love story, it manages to be politically acute in a way that feels depressingly up to date. Stone makes it very clear where he stands, his right-wing radicals are definitely villains, but they're real people too (with the possible exception of one guy who may be the devil) and what they're doing makes as much sense as it ever did."}, {"userName": "Jeff Jackson", "userReviewDate": "Aug 11, 2012", "userURL": "http://www.goodreads.com/user/show/811567-jeff-jackson", "userReview": "3.5 stars. Compelling for its insightful portrait of extreme right-wing politics, showing the complex and sophisticated ways businessmen harness issues of welfare, race, patriotism, and religion to dupe an under-educated populace and magnify their hateful messages using talk radio. Written in 1964, this must have seemed brazenly cynical and paranoid at the time, but now it reads like a practical playbook for how things are done. There are brilliant set pieces full of dark comedy and the surreal New Orleans atmosphere is effective, but the story and prose are also clunky in places. Stone would perfect it all with his next novel \"Dog Soldiers.\""}, {"userName": "Kelly Daniels", "userReviewDate": "May 20, 2015", "userURL": "http://www.goodreads.com/user/show/11004170-kelly-daniels", "userReview": "So crazy, so wild, gritty and fun. Highly recommended for all Stone fans or anyone who enjoys that nebulous sub genre called \"literary thriller.\" The surprising thing about it is its year of publication, 1968. It's about a right wing, racist uprising in New Orleans, and damned if the dialog and various speeches don't seem to come straight out of yesterday's report from Fox News. Nothing has changed in this country, concerning race, for the last fifty years. This novel is proof of that."}, {"userName": "Κώστας", "userReviewDate": "Mar 06, 2014", "userURL": "http://www.goodreads.com/user/show/21286701", "userReview": "Θα σας μεταφερω την εμπειρια μου απο την ενασχοληση μου με το \"κλασικο on the road μυθιστορημα\" (οπως αυτοχαρακτηριζεται στο εξωφυλλο) \"Η αιθουσα με τους καθρεφτες\".Δυο κοινωνικα κατακαθια, ο αλκοολικος Ράινχαρτ και η καταρρακωμενη Τζεραλντίν,ψαχνοντας για δουλεια γνωριζονται μεταξυ τους.Ενα φλυαρο οδοιπορικο,μια αδιαφορη περιπλανηση και η αναγνωση γινεται αγγαρεια.Αυτοι ειναι-δυστυχως-οι αμερικανοι συγγραφεις (αναφερομαι και στον Τζων Σμολενς με τις \"ψυχες στον παγο\"),αυτα ειναι τα εργα της κλασικης αμερικανικης λογοτεχνιας.Κριμα τα δεντρακια που θυσιαζονται για τετοια-ο Θεος να τα κανει-βιβλια.Καταφερα να το φτασω μεχρι την 226 σελιδα,οπου παραιτηθηκα χωρις αποζημιωση,ξοδευοντας καθε ικμαδα υπομονης και ψυχικου σθενους που διεθετα.Μεινετε μακρια γιατι θα υποφερετε."}, {"userName": "Ericpegnam Pegnam", "userReviewDate": "Jun 27, 2009", "userURL": "http://www.goodreads.com/user/show/2440947-ericpegnam-pegnam", "userReview": "I like the idea of this novel but Robert stone doesn't carry it off. I read it several years ago but remember it as a weird cross Hemingway/Mailer's tough guy poses and Faulkner's southern decadence and meandering sentences. All his suggestive ambiguity which with Faulkner's best takes you someplace but at his worst seems a lot like \"A Hall of Mirrors\" I liked Stone's Dog Soldiers much better. The dialogue is funny and creepy and the characterizations seem spot on. Read that one instead."}, {"userName": "Paul Wilner", "userReviewDate": "Jun 21, 2015", "userURL": "http://www.goodreads.com/user/show/589019-paul-wilner", "userReview": "\"The California of the mind.'' Great laundromat scene. Prescient takes on right wing ravers and racial politics at their most extreme. Mr. Stone's first published novel and he's in fine form here. No one like him. And the ending is heartbreaking."}, {"userName": "Morgan McBride", "userReviewDate": "Mar 13, 2018", "userURL": "http://www.goodreads.com/user/show/77891703-morgan-mcbride", "userReview": "Haven't yet decided how I feel about this book, but I'm glad I read it. It can definitely go on for a while, but there are enough little gems scattered throughout the book to make it a worthwhile read.The writing is definitely the best part of the book. Pretty much all of my favorite parts were conversations that sort of throw the many political and social viewpoints in the book against one another. Rainey and the bartender talking about the Big Store, Rheinhardt and Rainey's philosophical discussion near the middle, and the Rheinhardt, Bingamon, Jack Noonan all stand out as the best the book has to offer.The story got me interested initially, but it takes a while to get into it and you never really learn much about the political stuff until the end. A lot of the book consists of characters talking, drinking, and speculating about themselves and the world at large. Not always bad, but it can get a little heavy handed and repetitive.The characters range from relatively complex and interesting to one dimensional. Rheinhardt is probably the most developed, but that's not saying much. He's detached so unsurprisingly things go wrong for him, which he essentially takes as justification for his cynicism and detachment. At various times he realizes that he's really largely responsible for all the pain he's caused himself and others, but just collapses in on himself rather than make any meaningful changes.Rainey started out as an interesting character, but sort of gets lost in the shuffle. He's constantly looking for meaning in his life but can't seem to get past this middle-of-the-road, half-measure existence. He pretty much lets the perfect be the enemy of the good through the whole book, and when he can't bring himself to manifest his ideals as actions, he finds someone who can do so, and attempts to pretty much \"tag along.\" Unsurprisingly, he gets cold feet and screws things up for both of them, and somehow this is the decision he feels finally lets him off the hook. Yeah, Rainey kind of sucks.Geraldine was by far the most disappointing - her story started off really well and was interesting (her scenes when she first arrives in New Orleans are great social commentary), but as soon as she becomes Rheinhardt's love interest we see less of less of her, and those scenes pretty much boil down to, \"Why doesn't Rheinhardt love me back?\" Not surprising that a dude from the '60s can't write great female characters, but the strong start made the fall that much harder.So looking at all this it would appear that I didn't like the book, but I still keep thinking about it so there must be something there. While the characters are generally unlikeable, they're pretty well developed and the internal monologues and discourses are really well written and compelling. The book definitely made me feel something, it just wasn't anything good.All in all, it's definitely a good book, but perhaps not a very enjoyable one."}, {"userName": "Paul Thomas", "userReviewDate": "Oct 31, 2017", "userURL": "http://www.goodreads.com/user/show/37672894-paul-thomas", "userReview": "I'm glad I didn't read this one first. While Dog Soldiers and A Flag for Sunrise are two of my favorite books, Robert Stone's first novel shows how hard it is to write like Robert Stone. Very sloppy, very long and highly undeveloped, this treatise on activism in the 60's (or is it a limp satire on southern culture) was illegible at times. He tried so hard to make his main characters hippies and scammers and racists that pages would go by and the reader would have no idea what Stone was talking about. A lot of stoned, wondering diatribes of social commentary. And the same with the anti southern culture part. Paragraph upon paragraph of trite stereotype. I was too hopeful, and suffered through this. Should have bailed."}, {"userName": "Drew", "userReviewDate": "Jul 21, 2017", "userURL": "http://www.goodreads.com/user/show/4404965-drew", "userReview": "Robert Stone's \"Hall of Mirrors\" left a sour taste in my mouth. An on-the-scene look at the sinister side of right-wing politics, it presents the resurrection of Southern white supremacy in a jaded, deadpan manner that reads like Pynchonesque prose only feigning dark humor. His protagonist, a drunk clarinetist who becomes a proselytizing radio DJ without any conscience, is a two-bit imitation of a noir antihero while his girlfriend, a damaged blonde (of course), appears to be working with half a brain. The novel's moral champion, a pseudo-social worker, is an ineffectual blob without any true convictions. Yuck."}, {"userName": "Mark", "userReviewDate": "Aug 28, 2017", "userURL": "http://www.goodreads.com/user/show/67390970-mark", "userReview": "There isn't a 4 1/2 stars, so I gave it five. The beginning is a little rocky, and I guess that's a sign that it is a first novel. There were a few parts throughout the book that were a little strange, and Robert Stone's experimentation is unusual.Still, the book is straightforward for the most part. It's sad. It's good."}, {"userName": "Patrick", "userReviewDate": "May 10, 2017", "userURL": "http://www.goodreads.com/user/show/63761859-patrick", "userReview": "Hall of Mirrors is a surreal nightmare of. racism, political corruption, and troubled relationships in 1960s New Orleans."}, {"userName": "Hamilcar", "userReviewDate": "Apr 13, 2009", "userURL": "http://www.goodreads.com/user/show/153640-hamilcar", "userReview": "I remembered reading a story by Stone in college that felt right. I read it a few more times. Then I somehow forgot Stone's name when I wanted to read something else he'd written. Browsing in Browser Books recently his name appeared in my mind and I found the story in a collection next to this book on a shelf. A HALL OF MIRRORS will now sit next to THE MOVIEGOER by Percy, but I don't know exactly if it goes there. It has a different effect, it's flashier somehow. It's the 60's and you know it, but it's got the same New Orleans scene. This time there are some extra anti-heroes. Maybe this one goes next to UNDER THE VOLCANO by Lowry, too. It goes between those two for me, though there are probably big gaps and wrong connections, but I don't know, I'm still thinking about it. It's kind of fresh, and my initial reaction is that it doesn't quite reach those heights, but it's saying something else. And maybe that's why I need to think about it some more.I'll probably update this review."}, {"userName": " don presnell", "userReviewDate": "Aug 31, 2011", "userURL": "http://www.goodreads.com/user/show/6173319-don-presnell", "userReview": "The first time I read this I was pretty much blown away. A very subtle book. It took me to a time and place where I thought men wore white shirts and dark colored ties. Or it was right out in the open, the drunkards, the no account bums. No gray area. This book is complex what you see might not be what you get. Alcohol, drugs, corruption, racial tension. religious phonys lining their pockets , violence, straight arrows- hated by all, racial \"power brokers\". I think it would take anyone at least two reads to get the full effect. It's one of those books you want to keep in your bookshelf just in case there is someone you want to share it with."}, {"userName": "steve", "userReviewDate": "Sep 20, 2008", "userURL": "http://www.goodreads.com/user/show/202976-steve", "userReview": "Wonderful portrait of New Orleans and the entire Southern mood in the early 60s. A must-read for anyone who has been to New Orleans or wants a view of the civil rights turmoil that goes beyond the flashpoints in Selma and Montgomery."}, {"userName": "Dave Capers", "userReviewDate": "Jan 06, 2017", "userURL": "http://www.goodreads.com/user/show/22151687-dave-capers", "userReview": "A vivid portrait of early 1960s New Orleans that also foresees the rise of right wing talk radio. Sharp descriptions of broken people."}, {"userName": "Velvetink", "userReviewDate": "Oct 30, 2014", "userURL": "http://www.goodreads.com/user/show/454255-velvetink", "userReview": "Donated to CCU 30/10/2014"}, {"userName": "James", "userReviewDate": "Jul 17, 2013", "userURL": "http://www.goodreads.com/user/show/5999882-james", "userReview": "Started off promisingly, but I lost the thread later in the book. Interesting historically as a beat novel just before the sixties."}, {"userName": "Kurt", "userReviewDate": "Jul 23, 2011", "userURL": "http://www.goodreads.com/user/show/5857168-kurt", "userReview": "I love Robert Stone, but this first novel gets a little too distracting toward the end when Stone loses control of his plot."}, {"userName": "justin louie", "userReviewDate": "Dec 18, 2015", "userURL": "http://www.goodreads.com/user/show/5958273-justin-louie", "userReview": "a good one for Trump-infested times. also a good one for completely loveless times."}, {"userName": "Ryan Van Runkle", "userReviewDate": "Jul 11, 2012", "userURL": "http://www.goodreads.com/user/show/5341563-ryan-van-runkle", "userReview": "This is the one. Stone is a just and gentle God not that uptight Narc in Psalm 74."}, {"userName": "Margie", "userReviewDate": "Aug 03, 2014", "userURL": "http://www.goodreads.com/user/show/7112254-margie", "userReview": "wanted to read a new to e author. Don't remember where I got this title from. Very 1960's. Good writing. Would read him again."}, {"userName": "Grim-Anal King", "userReviewDate": "Sep 06, 2011", "userURL": "http://www.goodreads.com/user/show/6226050-grim-anal-king", "userReview": "File with Last Exit to Brooklyn (last chance to turn around)."}], "description": "Rheinhardt, a disk jockey and failed musician, rolls into New Orleans looking for work and another chance in life. What he finds is a woman physically and psychically damaged by the men in her past and a job that entangles him in a right-wing political movement. Peopled with civil rights activists, fanatical Christians, corrupt politicians, and demented Hollywood stars, A Hall of Mirrors vividly depicts the dark side of America that erupted in the sixties. To quote Wallace Stegner, \"Stone writes like a bird, like an angel, like a circus barker, like a con man, like someone so high on pot that he is scraping his shoes on the stars.\"", "title": "A Hall of Mirrors", "url": "http://www.goodreads.com/book/show/324987.A_Hall_of_Mirrors", "average": 3.72, "cover": "https://images.gr-assets.com/books/1347309965l/324987.jpg", "reviews": 25, "authors": [{"url": "https://www.goodreads.com/author/show/41938.Robert_Stone", "name": "Robert  Stone"}], "type": ["Fiction", "Literature", "Novels"], "outlinks": ["http://www.goodreads.com/book/show/324987.A_Hall_of_Mirrors", "http://www.goodreads.com/book/show/15850979-a-hall-of-mirrors", "http://www.goodreads.com/book/show/3422866-hall-of-mirrors", "http://www.goodreads.com/book/show/21243842", "http://www.goodreads.com/book/show/6441173-a-hall-of-mirrors", "http://www.goodreads.com/book/show/380364.Dog_Soldiers", "http://www.goodreads.com/book/show/196337.Damascus_Gate", "http://www.goodreads.com/book/show/241951.A_Flag_For_Sunrise", "http://www.goodreads.com/book/show/17165876-death-of-the-black-haired-girl", "http://www.goodreads.com/book/show/241953.Outerbridge_Reach", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}