{"ratings": 1169, "userreviews": [{"userName": "Michelle Kidwell", "userReviewDate": "Nov 27, 2013", "userURL": "http://www.goodreads.com/user/show/6011726-michelle-kidwell", "userReview": "Book Review AHA Awakening Honesty ActonAHAAwakening Honesty ActionKyle Idleman2014In the beginning of this book Idleman points out that it is not a self help book, it is a Jesus help book. I love that the book reminds us of that moment we found God.  The moment Christ came into our lives and changed it forever.Idleman asks if we had that moment when the Holy Spirit opens our eyes to something that we are missing.  Perhaps it could be that closeness we desired, or a truth we had not yet realized until that moment.   We are also reminded the importance of having a friend that can \"Flip that switch\" when needed, can tell us the truth, can encourage us the way we need. AHA also reminds us that we need to have a closer look at ourselves, we need to make sure that we are being a good witness to those who may be looking to us for a Christian example. Aha reminds us to have a deeper look at ourselves, at our faith, and to be a better example to those around us.This is definitely a great addition to your library..."}, {"userName": "Melissa", "userReviewDate": "Sep 27, 2015", "userURL": "http://www.goodreads.com/user/show/7192613-melissa", "userReview": "This is the first book by Kyle Idleman I've read, and I thought it was really good. He uses the parable of the prodigal son throughout the book. I found it very insightful. I think it is a book that I will read again in the future. I would recommend this book."}, {"userName": "Lizzy Bueckert", "userReviewDate": "Jan 09, 2016", "userURL": "http://www.goodreads.com/user/show/37643412-lizzy-bueckert", "userReview": "Wonderful! I felt I could have highlighted the whole book!"}, {"userName": "James", "userReviewDate": "Mar 04, 2016", "userURL": "http://www.goodreads.com/user/show/8761466-james", "userReview": "This was a fabulous book. It belongs on the shelf of anyone who is involved in pastoral counseling on either a personal or professional level. The process of Awakening, Honesty, Action, rooted in the biblical parable of the Prodigal Son (Luke 15) provides powerful handles for anyone needing to make positive change in their lives. Kyle writes with warmth and compassion and a great sense of Gen X humor (don't be surprised if there's a profound insight into Scripture in the same paragraph as a reference to Saved By the Bell). Lots of us have had \"Sudden Awakenings\" (and if you never have, you probably will) that are the result of either difficult circumstances, deserved consequences, or both. What we do with them makes all the differences. If we try to take action without honesty, we fail. And if we have the courage to be brutally honest with ourselves without taking immediate action, we will just lose hope and believe we are beyond redemption. AHA walks you through how to do all three. The last chapter of the book is especially relevant for those who feel like they haven't messed up. By turning his attention to the older brother in the parable, Kyle helps us deal with our response to the prodigals in our lives."}, {"userName": "Hines", "userReviewDate": "Aug 05, 2017", "userURL": "http://www.goodreads.com/user/show/52070077-hines", "userReview": "This was a thought provoking book. There were a lot of interesting ideas and ways to look at the events of life. Good read."}, {"userName": "Patti Alexander", "userReviewDate": "Mar 25, 2018", "userURL": "http://www.goodreads.com/user/show/77562720-patti-alexander", "userReview": "Another great book by Kyle Idleman. Tom & I read this book together & it really hit home with me. I plan to read this book again & use the study guide"}, {"userName": "Christy Bower", "userReviewDate": "Jan 24, 2015", "userURL": "http://www.goodreads.com/user/show/28922997-christy-bower", "userReview": "You probably don’t think of yourself as a prodigal. I didn’t. I’ve been a Christian for decades. But when Kyle Idleman began to probe my heart with the details of the Parable of the Prodigal Son, I began to change my mind. In Kyle’s mind, the return of a prodigal to the father is not a one-time occurrence, but a recurring event that needs to take place in our lives.In his model, based on the tale of the prodigal son, he suggests we need a good Awakening to the condition of our spiritual lives. Then we need to face the facts about ourselves with raw Honesty. And finally, we need this newfound awareness of our condition to lead us to Action. In steps that are incredibly simple, readers learn to identify areas of their lives ripe for change BEFORE we hit rock bottom. I really enjoyed this book. It was easy to read and laced with stories, many of which were laugh-out-loud funny. (My favorite was the one he told about his ears. I was laughing so hard I was crying.) I actually think this is the model of what every good Christian book should be—easy to read, enjoyable, and packs a punch.Until we learn to love people the way Jesus loved people, we still have prodigal hearts. I learned to look at things differently and see areas of my life where I’ve been prodigal and I need to return to the Father for help.I’m sure you will enjoy and feel challenged by AHA. Take time to read it so you can discover your AHA moment."}, {"userName": "Morgan Duplechin", "userReviewDate": "Jan 21, 2016", "userURL": "http://www.goodreads.com/user/show/23108861-morgan-duplechin", "userReview": "\"God often uses desperate moments to wake us up. Only when things start to fall apart do we finally open our eyes.” After reading Not A Fan and Gods at War by Kyle Idleman and loving them, I decided to read this one. This book was amazing. Kyle Idleman has a way of taking a Bible story I'd heard a million times before and pointing out things that I'd never noticed or even thought about. His points are very inspiring and I felt convicted on many things that he discussed throughout the book. I started taking notes in a notebook towards the end of the book and I wish I would have done that from the beginning. I don't want to forget a single word of this book and I'll probably re-read it and write down everything I want to remember so that I don't forget it. This is a book all believers in Jesus Christ should read. Even if your not a believer, you should still give this book a try. I think everyone has something to gain by reading this book."}, {"userName": "Gwen Stivers", "userReviewDate": "Oct 16, 2016", "userURL": "http://www.goodreads.com/user/show/60582412-gwen-stivers", "userReview": "Kyle Idleman is a fairly young pastor with a fresh way of looking at faith. \"Aha\" delves into the area when you finally get the concept of faith and what it entails. It's that moment when the light bulb clicks on and understanding happens. He gives numerous practical examples of any concept he puts forth and wants you to think about. I wish that this book had been around when I was in college."}, {"userName": "Donatta Wolf", "userReviewDate": "May 29, 2014", "userURL": "http://www.goodreads.com/user/show/4039235-donatta-wolf", "userReview": "it confirms thoughts that I had when I experience God and question its relevance. Helped me to understand that looking at life as a continuous communication with the Creator and the created.. and just getting that one moment in the line of the journey and say \"AHA\""}, {"userName": "Mark", "userReviewDate": "Oct 24, 2015", "userURL": "http://www.goodreads.com/user/show/29448721-mark", "userReview": "This is such a good book. He tells real life stories and mixes it with scripture all while sounding like your talking to your best friend. What more can you ask for? Kyle will definitely go on my favorite author list."}, {"userName": "Brenda  Whitner", "userReviewDate": "Dec 03, 2014", "userURL": "http://www.goodreads.com/user/show/4084878-brenda-whitner", "userReview": "I really liked this book. It's based on the prodigal son and how he had that AHA moment. We all flounder in our faith but God is always there waiting. The book was very well written, with very good real life examples. I found it very relatable."}, {"userName": "B Hatfield", "userReviewDate": "Apr 10, 2018", "userURL": "http://www.goodreads.com/user/show/25189308-b-hatfield", "userReview": "Read this for FCA (leader meetings); It was a good book to read for FCA. Everyone seemed to connect to it on their own level and really pull something raw and new out of it. We all shared at the meetings, and there were times were I felt a little nervous to share, but I did anyway. I love that God can just boost my confidence! Making it so natural to share my experience and walk with God with others! This book definitely helped me form my first ever message. I will be speaking at FCA in May over Job and how God USES your situation, not CAUSES them. Jeremiah 29:11 and 2 Corinthians 12:9-10. It was dry in some areas, but: It challenged me and caused me to reflect on things like God using my situations, not causing them and reminding me that I am created in God's image. To stop letting the thought of \"am I doing enough? am I doing as much as her/him\" get in the way of the relationship I am trying to form. To end with my favorite quote from the book that hit me right at the end, \"God loves who just as you are, but He doesn't leave you that way.\""}, {"userName": "Lisa", "userReviewDate": "Apr 12, 2018", "userURL": "http://www.goodreads.com/user/show/61464017-lisa", "userReview": "I bought this book shortly after its release in 2014 because Kyle Idelman is one of my favorite authors and I like everything he writes. I read the first chapter and stopped. It didn’t resonate with me. Four years later, I decided I needed to read the book, so I picked it up, started reading it again, and couldn’t stop until I’d finished it. What had seemed so off four years ago was what I needed to read now. AHA is the type of book that makes me think about my own walk with God. It isn’t comfortable to read at times, but it’s necessary. Using the story of the Prodigal Son, Idelman provides the elements we all need for AHA to occur. So, this book that “wasn’t speaking to me” is actually one of my favorite books by Idelman."}, {"userName": "Manuel Sanchez", "userReviewDate": "May 11, 2017", "userURL": "http://www.goodreads.com/user/show/37462704-manuel-sanchez", "userReview": "Kyle Idleman, the author of \"Not A Fan\", has become one of my favorite contemporary Christian authors. AHA uses the parable of the \"Prodigal Son\" to teach a very practical lesson that dovetails nicely from his prior book. I will not spoil this for you with details. If you are looking to get beyond awareness or mental acknowledgment and delve into the deep water of confession and action, you will find love, grace, renewal, empowerment and the courage to act."}, {"userName": "Renee", "userReviewDate": "Aug 01, 2017", "userURL": "http://www.goodreads.com/user/show/9373283-renee", "userReview": "If you're looking for a book that's as soul-wrenching as Not a Fan, this is not the book for you. There's nothing really wrong with the book. I enjoyed it and got things out of it that I likely needed to hear, but it wasn't almost fluffy compared to Not a Fan. I don't always need a major gut-check, so that's o.k. Kyle is good at what he does, so I would still recommend the book to someone looking for a good daily devotional."}, {"userName": "Amy Sund", "userReviewDate": "May 31, 2018", "userURL": "http://www.goodreads.com/user/show/65789779-amy-sund", "userReview": "I thought I had has my AHA moment so when I first started this book I didn't think I was going to get much out of it but as usual Kyle Idleman didn't disappoint. Very insightful book. Easy to read and humorous. Thank you Kyle for hitting the nail on the head again."}, {"userName": "Christopher Armstrong", "userReviewDate": "Jan 03, 2018", "userURL": "http://www.goodreads.com/user/show/74683552-christopher-armstrong", "userReview": "Kyle Idleman, with his one of a kind humor, shares what it means to have an AHA moment by walking through the parable of the Prodigal Son. God's love for His children is abundant but sometimes we don't receive it. AHA will walk you through some of the reasons we fail to see God for who He is; love."}, {"userName": "David Erickson", "userReviewDate": "May 02, 2018", "userURL": "http://www.goodreads.com/user/show/5891508-david-erickson", "userReview": "Great book about a great parableThis book brought a new AHA perspective to many areas of my life and explored the parable of the prodigal son in a new way."}, {"userName": "Jonathan", "userReviewDate": "Jun 01, 2018", "userURL": "http://www.goodreads.com/user/show/82573091-jonathan", "userReview": "3.5. Easy read. Nothing to ground breaking. Useful for brainstorming ideas for teaching a teen class."}, {"userName": "Kyle Leadingham", "userReviewDate": "Dec 13, 2017", "userURL": "http://www.goodreads.com/user/show/72897399-kyle-leadingham", "userReview": "A compelling, entertaining, and logical argument for how and when to change. Could not put it down!"}, {"userName": "Jessica Harcarik", "userReviewDate": "Jan 11, 2018", "userURL": "http://www.goodreads.com/user/show/38929888-jessica-harcarik", "userReview": "Very good book about strengthening your relationship with Jesus while being honest with where you are in your personal walk with Him! Very well done."}, {"userName": "Ho Christopher", "userReviewDate": "Dec 09, 2014", "userURL": "http://www.goodreads.com/user/show/23676258-ho-christopher", "userReview": "Have you ever had an ‘eureka’ moment in your life? If you had, you would most certain have experienced something that this book talks about, the AHA moment.This book is really meant for “born christian” or those who have slipped from their christian lives. Kyle Idleman has written this book to persuade christians to turn back, before it’s too late. The main bible passage used in this book is Luke 15:11-32, the Parable of the Prodigal Son.The book is spilt into 3 parts, first the awakening, the realisation of your wrong. Next, the honesty to agree, admit and confess your wrongdoing, and lastly, to act on this information that you now have.Idleman first talks about the awakening process or moment that one experiences when one realises the consequences of the wrong doing one had done. This section really calls the readers to examine and think through about their own lives, will they not turn back? Have they not seen what their lives had now become? Do they want to continue?Next, Idleman moves on to tackle some of the common “defence mechanism” that one may utilise to delay or excuse themselves from taking action after they had the AHA moment. The few defence mechanism seems more to be taken from Freud’s idea of defence mechanism, but is supported by bible verses in their respective chapters. Lastly, Idleman talks about the need to take action, it is not sufficient just to have this AHA moment or agree and admitting what you have done wrong, action is required to repent from this wrong. Idle man strongly urges the readers not to stop in this process, and to take action, immediately! However, the weakness of this book is how it is lacking on the God at work in man’s heart. The book does show very strongly how one should and must turn back to God. Yet it is silent on how God must first work in our hearts to do that.\u2028Similarly, it does not tells the reader who to do if you are repenting or have repented. Yes, there is a need to repent, but after I’ve done it, what should I do? Maybe the reader should move on to his other book, Not a Fan? But I think that would not be a good follow up. Maybe an additional chapter on basic discipleship would be extremely helpful to such new believers.This book would therefore be most suitable for nominal christians, or christians who are estranged from their christian roots. Read, realise and act, before it’s too late.Rating: 4 / 5"}, {"userName": "A.C. Cuddy", "userReviewDate": "Jul 22, 2015", "userURL": "http://www.goodreads.com/user/show/15217125-a-c-cuddy", "userReview": "“We've all had \"aha!\" moments in our lives, times when a sudden revelation surprises us with insight. According to pastor and bestselling author Kyle Idleman, we can experience this same kind of \"aha!\" in our spiritual lives. With everyday examples and trademark testimonies, Idleman draws on Scripture to reveal how three key elements can draw us closer to God and change our lives for good.Awakening to the reality of our true spiritual condition, we see ourselves and our need for a Savior with renewed honesty. This realization leads to action, obeying God's commands and following the example set by Christ. As we see in the transformation of the prodigal son, the result is a life-changing, destiny-altering collision—an AHA moment that leads us home to our loving Father.”AHA! At first I thought what an odd name for a book. But after reading it, I thought what an appropriate name for this book. This book is filled with just that… the AHA moment. Based on the parable of the prodigal son, this book looks at the AHA moments of not only the prodigal, but the brother as well. Mr. Idleman then takes us through those moments in our lives when we “A” Awaken, get “H” Honest and take “A” Action. Perhaps our own life journey has veered off course a bit and you are wandering in The Distant Country. This book will give you a fresh perspective to see your own AHA moment in that journey and find your way back to the heart of your loving Father God. Just as the prodigals’ father, He is waiting for you just to turn and He too will be there to celebrate you.In my opinion, this is not a book that is meant to be read once and relegated to the book shelf. This is a book that should be read… pondered… and then read and studied. I highly recommend it… you will not be disappointed.Visit the author’s website: http://kyleidleman.com/*Disclaimer: I did not receive this book from any publishing company. I personally purchased this book. The opinion in this review is mine and no monetary compensation was received for this review. *Reviews of this book were posted at the following locations:Amazon, Christian Book, Deeper Shopping, Goodreads, and to be featured on my blog at http://titus3.wordpress.com"}, {"userName": "Todd Mckeever", "userReviewDate": "Mar 11, 2014", "userURL": "http://www.goodreads.com/user/show/10443746-todd-mckeever", "userReview": "Originally posted on http://www.toddmckeever.com/2014/03/a...In Kyle Idlemans book, AHA (Awakening, Honesty, Action) Kyle takes us through the story of the prodigal son in Luke 15. Describing the experience of being in the distant country, (this Distant Country can be defined as any area of our lives that we have walked away from God) and then coming to his senses.What drives many travelers to the Distant country is that they are running from a god that doesn’t exist. Kyle goes on to discuss that for one reason or another, their perception of God doesn’t match up with reality. They are rejecting a god they created and not the true God who created them.The prodigal son and his perception of what it would be like without his dad but only with his money was not correct. The son still chose to leave and do it his way. Sooner or later living in the distant country the alarm will begin to sound saying stop, turn around, change, get up and to of here. Too often we do like the prodigal did, we ignore it. The prodigal son in Luke 15 didn’t hear the alarm until the pig pen.- Didn’t hear while he made his request to his father asking for his share of the inheritance.- Didn’t hear as his wallet became thinner and thinner while in the Distant country.- Didn’t hear it while a famine swept through the land.- Didn’t hear it while he took the job of a pig sitter.He continued to hit snooze. God will allow us to experience a sampling of what we can expect if we don’t wake up.Grab this book and read the painful but extremely encouraging and hopeful adventure as Kyle lays it out in everyday language and examples with scripture to prove it.In closing, I enjoy the most where Kyle points out: “We expect God to be an angry father who demands justice, but through Jesus, He gives us love and grace when we don’t deserve it. Ultimately, the story in Luke 15 isn’t about two sons who disobey. It is about a Father who loves His children unconditionally.”How would your life be different if you woke up when God sounds the first alarm?"}, {"userName": "Caleb Coy", "userReviewDate": "Jul 28, 2015", "userURL": "http://www.goodreads.com/user/show/44467177-caleb-coy", "userReview": "ue to my previous reading, I approahced Kyle Idleman’s AHA with a little skepticism. However, his was not a formula meant to be followed, but rather an observation of patterns that were meaningful. According to Idle, three elements are necessary for radical change in our lives:AwakeningHonestyActionUsing the Prodigal Son as his main reference, Idleman outlines how radical changes in our lives are possible when we realize, accept, and act on what needs to change. In Idleman’s vocabulary, aha is a word, meaning “a sudden recognition that leads to an honest moment that brings lasting change.” Perhaps the most helpful aspect of his book is taken from his interactions as a teacher and listener. He gives numerous examples of people today who have shared their AHA moments, as well as from scripture.Sprinkled throughout are short anecdotes and examples of moments that may catch your eye, relating you to a situation you may be in—cooking the books for a boss, plagiarizing a paper, losing your temper, showing disrespect to a spouse, viewing pornography, dating someone who discourages your faith.One flaw of the book is that although it speaks of the importance of our actions, it does not include much about the work of God’s grace in our hearts.Another weakness may be that his Bible-derived formula does not work in every situation. Sometimes, change happens at a slow rate, over time. Nonetheless, AHA can serve as an insightful call for Christians to wake up to the change that needs to take place in their lives, a good book worth reading for a small group or for an individual."}, {"userName": "Beyond the Pages", "userReviewDate": "Nov 29, 2013", "userURL": "http://www.goodreads.com/user/show/4609870-beyond-the-pages", "userReview": "AHA by Kyle Idleman is quite a remarkable book. It is a beautiful, simple, Scripture-rich work that discusses those special aha moments that exist in each of our lives. Written with a clear and highly conversational tone, Mr. Idleman did a superb job of identifying what it takes to get to and to appreciate the aha. He generally spoke through the perspective of the prodigal son, offering glimpses of where the aha existed within his life, but he did not shy away from providing other biblical examples of the epiphanous aha moment.Mr. Idleman's efforts to communicate the prodigal's lessons and show how those lessons translate to us today were spot on, in my estimation. He spoke of the value of having friends and supports who are courageous enough to help one see the aha. He also spoke on the significance of silence, solitude and surrender. He spoke of grace and suffering, as well as love and revelation. He spoke of how to take an action step forward. It all came together magnificently.I loved the constant encouragement written on the pages of this book. I loved the life story examples and the Bible references sprinkled throughout. I thought the message was timely and just right for spiritual growth.The more I read of this book, the more I wanted to read. I certainly want a hard copy of it for my personal library. Recommend: YesGroup Bible Study Option: YesPersonal Study Option: YesRating: 5/5A complimentary ARC of this book was provided to me by the publisher in exchange for an honest review."}, {"userName": "Becky B", "userReviewDate": "Jun 14, 2015", "userURL": "http://www.goodreads.com/user/show/12785148-becky-b", "userReview": "I thought I'd breeze through this book, but thanks to a glitch in my Kindle, it ended up taking the entire summer. That's no reflection on the quality of the content, I just couldn't get to the book for a while. Which is going to make reviewing this a little more challenging than I'm used to. It doesn't usually take me over 2 months to finish this kind of book, so I'm having trouble remembering my reactions to the first half.Overall, AHA describes that process God takes us through to get us back to where He wants for us to be. It involves awakening to whatever issue has driven a wedge between us and God (and sometimes others too), a decision to change, and then acting on that. Idleman uses the parable of the prodigal son and real life situations to illustrate each step of the process. I picked this book up because I heard it was kind of a sequel to Gods at War which I found an excellent read. This book turned out to be a good one for a spiritual health checkup, but I didn't find it quite as powerful as Gods at War (though that may also be because of the glitches mentioned above). Idleman's writing is definitely easy to read and equally easy to grasp what he's trying to convey. Several teen students have checked out the student version of this from the library where I work and have liked that edition too. So it was good. Idleman makes some excellent points, and it does prove to be a catalyst for introspection and evaluation. But if you're trying to pick between reading this one or Gods at War, I'd recommend the latter."}, {"userName": "Jonathan Esterman", "userReviewDate": "Jan 10, 2015", "userURL": "http://www.goodreads.com/user/show/30945440-jonathan-esterman", "userReview": "Awakening. Honesty. Action. Separate from each other, and there's not much to go with. Together, however, and there's a moment there, of connection with HaShem, that's supposed to change it all. Or at least Idleman asserts. There are plenty of reviewers that have tackled this very question. Additionally, I'm not reviewing the book, but rather the audiobook. When reviewing an audiobook, the purpose of the review is to ascertain if the audio is one worth listening to. So, on my end, I will assume that you will have decided on the content material, but now you are at a point where you need to decide on traditional reading format or auditory listening format.Heyborne's narration is clear and easy to understand. He reads at a medium pace and pauses slightly in-between sentences to allow readers to keep up. A softer voice, Heyborne's is not one I would mind listening to in the background or while on a drive. Overall, the audiobook edition is a quality edition to consider, breaking out of the mold of subpar quality and providing a voice that can match the author's intent. So, if you're on the fence on reading versus listening, this title is a good title to give audiobooks a go.Disclosure: I was contracted to write an honest review in exchange for a reviewer copy of the product. The opinions stated in this review are solely my own."}, {"userName": "Eric Skwarczynski", "userReviewDate": "Jul 01, 2014", "userURL": "http://www.goodreads.com/user/show/32724657-eric-skwarczynski", "userReview": "Not quite up-to-par with Idleman's previous two books, Not a Fan & Gods at War.With an author coming out with a first book that is a powerhouse like Not a Fan, then following it with an even better book like Gods at War, my expectations for the third book were incredibly high. Months before the book was available to the public, Idleman released the first chapter as a free download, I devoured the pages and was desperate to read the rest, they were incredible.Unfortunately, I had no idea that the first chapter summarizes rather perfectly the book in it's entirety.Unlike the books of his writing past, there are not thrilling new thoughts on every page, even for a younger christian this book would not expound on the prodigal son much more than one would already be aware of.The format of the writing style even seems different than his precious attempts, and I found myself bored at times.However, being the least of his trilogy of works, it is a decent book on the prodigal son. But nothing deeper here. If you want to read any of his books I highly recommend the two aforementioned books, don't put this last one high on the charts."}], "description": "We've all had \"aha!\" moments in our lives, times when a sudden revelation surprises us with insight. According to pastor and bestselling author Kyle Idleman, we can experience this same kind of \"aha!\" in our spiritual lives. With everyday examples and trademark testimonies, Idleman draws on Scripture to reveal how three key elements can draw us closer to God and change our lives for good. Awakening to the reality of our true spiritual condition, we see ourselves and our need for a Savior with renewed honesty. This realization leads to action, obeying God's commands and following the example set by Christ. As we see in the transformation of the prodigal son, the result is a life-changing, destiny-altering collision—an AHA moment that leads us home to our loving Father.", "title": "AHA: The God Moment That Changes Everything", "url": "http://www.goodreads.com/book/show/17623514-aha", "average": 4.22, "cover": "https://images.gr-assets.com/books/1387301312l/17623514.jpg", "reviews": 131, "authors": [{"url": "https://www.goodreads.com/author/show/3189389.Kyle_Idleman", "name": "Kyle Idleman"}], "type": ["Christian", "Nonfiction", "Christian", "Religion", "Religion"], "outlinks": ["http://www.goodreads.com/book/show/17623514-aha", "http://www.goodreads.com/book/show/21419543-aha", "http://www.goodreads.com/book/show/20745362-aha", "http://www.goodreads.com/book/show/18667619-aha", "http://www.goodreads.com/book/show/11198480-not-a-fan", "http://www.goodreads.com/book/show/16182595-gods-at-war", "http://www.goodreads.com/book/show/24610975-the-end-of-me", "http://www.goodreads.com/book/show/13088560-not-a-fan", "http://www.goodreads.com/book/show/30259187-grace-is-greater"]}