{"ratings": 1723, "userreviews": [{"userName": "Casey", "userReviewDate": "Dec 30, 2010", "userURL": "http://www.goodreads.com/user/show/3194216-casey", "userReview": "5 stars does NOT do this novel justice. And I am completely unbiased in that statement.So few books stir me to feel hemmed in by our rating system and make me wish to burst from that bubble and rate a book the way I REALLY want to rate it. Like with “A Heart Revealed” a story worthy of way more than 5 stars. But it deserves every single one of those glowing yellows.I am a diehard Lessman fan, but none of her novels have been able to knock A Passion Most Pure (her debut novel) from the coveted “favorite” position. I’m sorry APMP, take a back seat, because I’ve got a new favorite. “A Heart Revealed” has everything a strong Christian novel should have. Passion for Christ, love and life. Characters that leap from the page with dexterity of form and trueness to life. No other author I know can give me over a dozen characters and I’m never confused. This novel is crafted and honed and a labor of love that sings from every single one of the 503 pages. It’s a page turner to the inth degree, dragging my attention away from sleep and deeper into the story. With a passion for God and a passion for love, this novel will win awards, but more importantly than ANY physical award this novel WILL garner, is the seed of God’s love planted in the heart of any reader who picks up this novel. Guaranteed.(And by the way, just got to say, that Casey is my *favorite* character yet. ;-)This review is my honest opinion. Thanks to the author for my lovely signed copy and the publishers for my copy to review and share. **Available September 2011 from Revell a division of Baker Publishers—so WHAT are you waiting for???**"}, {"userName": "Dawn", "userReviewDate": "Apr 30, 2011", "userURL": "http://www.goodreads.com/user/show/5268629-dawn", "userReview": "Julie Lessman.Not that I know how she does it, but every time Julie Lessman writes a book, the last book I read of hers gets bumped to \"my-second-all-time-favorite-book.\" I read in a blog interview a while back about how she'd initially made up the character of Emma Malloy just to fill a role... until the moment she wrote Emma meeting Sean O'Connor over dinner at the O'Connor household. And I tell you--I don't know if it's just because I've been training my brain for so long to think like a writer and not just a reader--but I knew it. And I've been waiting for the book for years now!!!!You might not know this about me--actually you probably don't--but I am a TIGHT WAD. I don't generally buy very many books--only my favorite ones... and if they're on sale. Well, I bought A Heart Revealed at full price. And it had nothing to do with the fact that I did so directly after Julie Lessman herself gave me a hug (because I was blatantly gushing about her!) in the hallway outside her ACFW Conference session called \"A Kiss is Not Just a Kiss.\" (And let me tell you, Julie Lessman knows what she's talking about).And OH MY GOSH.Perhaps I'm not conveying myself as fully as I'm striving to--let me try again.WOW.When you're about at the end of a five hundred page book that you've flown through in a matter of two days and you cannot see any possible way for the two main characters who love each other to EVER EVER EVER be together--that's a TALENTED AUTHOR and a GREAT BOOK.And I'm not going to say anything more except that the ending gave me LOTS of those flutterbies I like so much."}, {"userName": "Anne", "userReviewDate": "Aug 24, 2015", "userURL": "http://www.goodreads.com/user/show/18780551-anne", "userReview": "Scratch what I wrote in my review of A Hope Undaunted; I can and I will pick a favourite O’Connor book, and it’s this one. Sweet mother of pearl, it was just wonderful. I was completely swept away from page one, and thoroughly enjoyed myself until the end.All previous little nitpicky things from the other books magically had no appearance here (except for the earlobe nipping - there seems to be no doing without that). No passionate kissing between the H/h at random/innoportune/inapropriate moments, no fantasizing endlessly about the other, no oh-god-dear-lord-I-have-to-stay-pure-until-marriage-but-it’s-too-hard-I-can’t-do-this, no blatant manipulation to get the hero’s attention, no becoming engaged to another man to try to forget the hero, no hero blinded by stubborn pride, no events or characters left hanging (unless it was major issues that you know will come back in the last book), and no skipping ahead months or years. A Heart Revealed is definitely Lessman’s masterpiece. It’s her finest book yet, her most rich, complete, and detail-oriented. The romantic leads were older, more mature, and their romance was overall much better developed and presented than all the previous ones. Where all the other romances had been thunderous, madcap and dizzying with myriads of conflicting thoughts and emotions never before felt by the characters, here we have a gentle, slow, honest and delicate love story. It’s akin to reading Persuasion or something equally mature after a streak of YA novels (not that I really read those, but yeah).Sean O’Connor is probably my favourite hero of the series (although John Brady and Mitch Dennehy come extremely close). Reminiscent of Parker Riley, Luke McGee’s best friend in A Hope Undaunted whom I had admired so much, Sean is remarkable for his quiet humour, his ready laugh, his kindness, and his gentle ways. He’s forever the nice guy, a confirmed bachelor at 34 with no intentions of ever marrying, much to the regret of many ladies. Handsome, athletic and hard-working, Sean is happy just spending his days at work and his evenings playing sports or coaching them. Of all the men in the O’Connor saga, Sean is the only one (save Parker) who could exercise self-control when it came to women. It’s not that he’s not attracted to them, it’s just that, y’know, he’s honourable enough not to assault every female mentioned in the book, unlike his predecessors (ahem CollinMitchBradyLuke).So, when he realizes he’s had feelings all along for his long-standing friend, Emma Malloy, he freaking respects her wishes for distance and keeps his mouth to himself .Major round of applause for Sean please, he was THE ONLY ONE who was able to do that. Granted, the ring on Emma’s finger probably had a lot to do with it, but still. I can’t even begin to express how refreshing and wonderful it was not to be stumbling upon make-out sessions every 25 pages. I loved all previous books, but seriously, all the smoochiness was really getting on my nerves. So when I started this book, I was fully expecting an accidental kiss to happen at least before page 50, but when I had passed page 300 and they still hadn’t kissed, I knew their story was the best.Because it was finally focused on something other than the physical aspect of the relationship.Taking her time to develop a beautiful story between the two leads, Lessman incorporates layer upon layer of interesting details, building her 1931 atmosphere, telling us about the other characters, including domestic scenes with some of the previously married couples, and creating an interesting plot to make Emma and Sean realize they’ve been madly in love all along. If you’ve read the previous books, you know that Sean and Emma have known each other for over ten years, and have been good friends ever since. They both have tons in common, and they are Lessman’s best-matched couple, hands-down. Emma really came alive in this novel. Previously, she had been a kind, faithful secondary character whom we pitied for having been beaten by her scum of a husband. Now, we come to know her so well, she became the most resplendent and complete of all the heroines. Maybe it’s because she was older (31 as opposed to the others who’d all been under 20) and more mature, or because she had been through much more than the others and had more understanding, or maybe it was just her personality, or probably a combination of all I just mentioned, but Emma was definitely something grander. Elegant, graceful and incredibly selfless, Emma possessed a quiet strength of character which drew everyone to her one way or the other, whether it be family members for advice, co-workers for help, or friends for favours. Always ready to help and give her time to serve others, Emma is as generous as she is forgiving. And yet, she isn’t perfect, she doesn’t come across as cliché or caricatured; she is perfectly human, real and relatable. Deeply scarred by her past, Emma has nonetheless come to terms with her life and is at peace with herself, able to live normally and be happy and fulfilled in what she does. Lessman successfully shows us the caliber of woman that she is through her interactions with others at work, but it’s the little details told about her that make her truly endearing. The way she likes to paint the birds that come on her windowsill, or how she likes to wear lacy nightgowns to feel pretty and feminine, or how her apartment is furnished antique-style and abundantly embellished with flowered accents – carpet, wallpaper, bedspread. Everything about her exudes loveliness, peace, and femininity. She’s a treasure any man would be proud and lucky to call his own, and none knows it better than Sean. Unfortunately, the one man who does have her is ironically the one who couldn’t care less about her – Rory Malloy, her no-good husband whom she left 11 years ago when she moved to Boston with Charity. She’s forgiven him, but when she realizes that Sean O’Connor is the man of her dreams she never thought existed, her carefully built world slowly starts to unravel before her as she tries to keep it together, knowing she can never deserve him, nor have him.The most heart-warming, beautiful and uplifting romance I’d read in a long time, A Heart Revealed is definitely a top-favourite romance novel of mine, one I will be sure to recommend and re-read over and over again. It was so rich, true, and elevating. It perfectly illustrated what true love is all about; self-renunciation, respect, forgiveness, trust and so much more. The author highlighted all the important points of a relationship and brought them all together to create the kind of romance every girl has always dreamed about.And as always, it was wonderful seeing all the other family members again: joining Luke and Katie on their wedding day, sympathizing with Marcy who wants to adopt Gabe, laughing at Charity’s dry humour, oooh-ing at all the babies and young cousins, praying with Faith, and wondering who would win at chess. I love the family atmosphere Lessman always creates, it’s definitely one of her best traits. I love how she always has the women baking cookies, sewing hems and necklines, matchmaking and gossiping in the kitchen while the men are outside playing horseshoes or barbecuing. I also love the fact that all the men play sports and try to best each other (it’s totally hilarious), and are all consequently taller, handsomer and more muscular than the other (totally swoon-worthy). It’s just so much fun reading all those family scenes!!Ah, I don’t know what I’ll do when I finish this series!*Stand-alone novel, although it will make much more sense if you’ve read the previous books of the saga, especially A Passion Redeemed, in which Emma decides to leave Rory. Also, if you’ve read the other books the family scenes in this book will make a lot more sense. Nevertheless, I assume it’s perfectly enjoyable all on its own as well. Either way, READ IT!! ;)"}, {"userName": "MaryLu Tyndall", "userReviewDate": "Sep 07, 2011", "userURL": "http://www.goodreads.com/user/show/2664627-marylu-tyndall", "userReview": "I always know what to expect from a Julie Lessman novel, and believe me, this lady never disappoints! I don't know how she does it but every one of her characters become so dear to me I feel as though they all live right next door! In fact, reading a Lessman novel is like coming home after a long journey. We all know how families can be, right? Loving, refreshing, soothing, yet so honest and raw and let's face it, filled with drama. Emma is a heroine who's made mistakes but who has been terribly wounded. Sean is filled with anger but is the type of hero who fills the room (and my heart) with his presence! Watching them fall in love and battle secrets that threatened to tear them apart kept me up late at night. Then throw in other couples in the O'Connor family that we've all grown to love and mix all their dreams and stories together, impacting each other as families do, and you have a true-to-life drama that ultimately shows that God's love overcomes all problems and pain. Lessman's novels are to be savored like a fine wine.... and like a fine wine, they will satisfy to the end!"}, {"userName": "mary Ethington", "userReviewDate": "Aug 17, 2011", "userURL": "http://www.goodreads.com/user/show/1108413-mary-ethington", "userReview": "It was good. I like Emma, but I would like to see a little more wit or something. I really liked her as a person. It was hard for me to relate to her. I had a hard time understanding her thinking process. I actually liked Charity in this book, I think for the first time. I liked how it told there story more. You didn't hear much about Faith and Elizabeth, but still saw them interact. That was nice, but I admit although I liked that touch, I often skimmed or even skipped it. I did feel like the story of Elizabeth and this one were more preachy and I didn't enjoy it as much. I come from a really religious family and we talk religion all the time, but in this book it sometimes felt forced or a little over the top- unnatural. I noticed it in this one and in some of the others. I loved that it was clean and uplifting though, so I didn't mind too much. If I had to choose, I'd take a little preachy over a little trashy."}, {"userName": "Kav", "userReviewDate": "Dec 03, 2011", "userURL": "http://www.goodreads.com/user/show/6025638-kav", "userReview": "Clear your calendar before you begin this book. Put the dog in a kennel, send the kids to their grandparents and make sure you have a lot of frozen dinners on hand. You don't want anything distracting you from reading! College student? No worries, attending every class is over-rated. Besides it's weeks before final exams. So put those textbooks down and keep them closed until you finish A Heart Revealed. Have to work for a living? It's flu season, call in sick. You'll definitely be feeling feverish once you start reading anyway and your blood pressure will be rising and falling at an alarming rate. Good enough reasons to call in sick, don't you think?As it turns out I actually do have the flu and I did stay home from church yesterday and work today so I had a non-stop reading fest...well, in between falling into feverish swoons and dozing stupors :-) Thank you, Julie Lessman for providing the best medicine for what ails me! A Heart Revealed has the best bedside manners around!If you haven't guessed by now -- I LOVED this book!!! Lessman delivered just what I expected...and so much more. Her writer's voice gets more polished and fluent with every book. She has mastered the balance of description, dialogue and action -- each builds on the others to create vivid images that immersed this reader into another era. I was thrilled with all the catching up I got to do with one of my favourite literary families because this book isn't just about Emma and Sean -- all the O'Connors make multiple appearances as Lessman expertly twines their stories with our hero and heroine's. In fact, I'd say that A Heart Revealed is as much Charity and Katie's stories as it is Emma's.Lessman created continuity between these three distinct threads by anchoring them with a common bond -- women who are grappling with issues from their past that still affect their present and threaten their future. When it comes right down to it, Emma, Charity and Katie are still bound by childhood perceptions that plague their feelings of value and self-worth. And no, it isn't evident in their every day life, but when stressors build and change is imminent, all three are propelled (in varying degrees) by misconceptions from their youth. It's an unconscious knee-jerk reaction in all of them and very realistically written by Lessman. Even as I groaned and moaned and chided these women's actions I understood where they were coming from. Talk about an anxiety-riddled read!But though A Heart Revealed takes more than one twisty turn down the road of despair, the wonderful inspirational insights light the way towards hope. This is an area Lessman really excels in. Heartfelt conversations about faith between characters that are as natural as they are hard-hitting. And they in no way come off preachy. This book made me think and squirm and was, frankly, a God-send at this time in my life. God bless authors who listen to the Spirit when they write!"}, {"userName": "Michelle", "userReviewDate": "Jan 08, 2011", "userURL": "http://www.goodreads.com/user/show/2817029-michelle", "userReview": "Wow! Julie Lessman has hit another home run with this second installment to The Winds of Change series! We first meet the O'Connor family in Julie's Daughters of Boston series, which you'll want to read first, before reading The Winds of Change series. All of Julie's books are meant to be read in order, as each story builds from the others - a gripping family saga that will keep you wanting more and more! Each book filled with passion, drama, and a heart for God that makes it next to impossible to set down!It's without a doubt, that Julie's writing is among the best I've ever read. Throughout the story, I was drawn in by vivid, colorful dialogue, a charming setting that comes to life, and captivating characters that leave a lasting impression. I find the characters to be realistic, and each one with their own unique voice. And it's no secret, there are a lot of characters in this family saga, but Julie moves effortlessly between them. Each character has a unique voice, and a personality that is vibrant and full of life, so much so that they nearly spring off the page!And oh, the passion! As always, Julie's passion for romance and God shines brightly! It's truly what I love about her books, and Sean and Emma's story was no exception. From start to finish, Julie held me enchanted, with a gripping story that wouldn't let go. Needless to say, it is with great anticipation that I await the final installment of the O'Connor family saga! Two thumbs up, and highly recommended! **Thank you to Revell, a division of Baker House Publishing, for providing me with a review copy in exchange for my honest opinion.****Available September 2011 at your favorite bookseller from Revell, a division of Baker Publishing Group.**"}, {"userName": "Renee", "userReviewDate": "Jan 27, 2011", "userURL": "http://www.goodreads.com/user/show/2965894-renee", "userReview": "Drama, Drama, Drama in Julie Lessman's A Heart RevealedAre you surprised by the title of this post? Well you won't be since you now know that this is a review of Julie Lessman's latest novel, A Heart Revealed. If you are at all familiar with this series you know that drama is the key to each of these stories. If you're like me the more drama, the better and it comes in spades in this book.Continuing the O'Connor saga is the story of Emma Malloy and Sean, the eldest O'Connor sibling. Each has a past that they let control their future and both must learn to give it to God for a chance at happiness. The unfolding story of Emma and Sean's romance is one that is sweet, passionate, and altogether frustrating. A friend asked if I threw the book across the room as I was reading, well let me just say that there are black and green spots on my wall where there once was only white paint. Emma is almost too giving and good. I wanted to throttle that girl if she tried to push Rose off on a certain character one more time and trust me I'm not violent in the least! If there's ever a series where you feel so connected to the characters it's this one! They come alive and one even has a cute quirk that will have you craving chocolate. So grab a Snickers, a few lemon drops and a caffeinated beverage (you're gonna need it because you will want to stay up past midnight) and your copy of A Heart Revealed today. You won't regret it! If you haven't read a book by Julie I suggest getting to know the O'Connor family by reading the books in order starting with A Passion Most Pure, Book One in the Daughters of Boston series and going from there. Happy Reading!"}, {"userName": "Nora St Laurent", "userReviewDate": "Sep 22, 2011", "userURL": "http://www.goodreads.com/user/show/1100689-nora-st-laurent", "userReview": "I am grateful to have received a review copy of a novel that is written by an author who's passionate about her relationship with Jesus and others she loves. Not only does Julie have a zest and love for life but Julie’s passion for her Savior radiates throughout this book and not in a preachy way, but an honest and enlightening way. Julie’s newest novel shows that what we have in our hearts is revealed through our actions, thoughts and words. Just like Julie’s characters this often takes us by surprise, thinking we’ve dealt with that matter or didn’t realize a matter bothered us so much. I enjoyed this complex and tender story.I loved A Hope Undaunted, the first book in the Winds of Change series, I couldn’t wait to get my hands on A Heart Revealed and see where Julie would take me next. This story started out in the time of the great depression of 1931 – where people struggled to survive. They had a hard time balancing, work and family just like we deal with today. This author also talks about true love, making a time for passion, talking face to face (not texting) and how we have to work at keeping a love relationship alive.I also like how Julie shows that just because these characters accepted Christ in their hearts and go to church; it’s not all happily ever-after. Life can be painful at times and God wants to heal our hurts if we let him. I also enjoyed how Julie Lessman naturally weaves the theme of how we can be free in Christ through forgiveness! Julie shows us how unforgiveness can keep us a prisoner to the pain of the past and never let us walk in what we can be in current time. It’s the freedom we have in Christ through forgiving others, and ourselves. You never know what heavy burden someone was carrying around before Jesus set them free.Julie answers the question, what does it look like to accept Jesus into our hearts, say we love Him but don’t make him Lord of our lives? And what does someone do when they discover their heart is still bleeding from deep hurts they hide from their conscious mind. Julie shows this very thing and so much more in A Heart Revealed. Each of us has a story to tell, we don’t get out of this life alive and untouched by the tragedies of the world. I love how Julie shows her passion for God through the characters' passion for each other and how all relationships take work.I liked how Julie honestly looked at marriage on so many levels. Julie looked at the parents Marcy and Patrick's marriage along with Faith and Collin, Charity and Mitch, and Katie and Luke. It’s hard to do creative a loving marriage in changing times and almost impossible to do it without God working in you and through your life. This author gives a peek into these marriages that have very different personalities. I loved how she showed that without God marriage isn’t possible. With each husband and wife seeking God’s will for their lives and asking help in loving their spouse the way he would is the only way they make it. Julie did show the fun side of marriage too. All wasn't serious. I enjoyed the tender moments that left most of the romance to the readers’ imagination and I loved reading about them laughing and having fun; especially when the whole family gets together for game night.Julie talked about being single in this book and enjoying it. I liked how she handled matter. She showed Sean and Emma as being totally fulfilled in being single. They fully walked in all it meant to be for them. They were both single and living for Jesus. I also liked how she revealed that Sean and Emma could be best of friends. They were confidants; they prayed for one another and held each other accountable. I also liked that even though Emma made strong suggestions to Sean that he sought God on his own terms. He didn’t take someone else’s word for what he was supposed to do.A Priest said to Sean, “Emma sees herself as – a scarred woman, inside and out. Keep in mind that when a woman’s self-image has been destroyed, both by the man she loved and the very sins that have imprisoned her most of her life, she can’t see what you see. It will only be though the mirror of God’s love and that of your own that Emma will finally have a glimpse of the beautiful women God created her to be.” Powerful stuff.Julie is creative and fun and had a newsletter contest and two people won the prize. The prize was to have their names in Julie's new book. Casey Herringshaw and Michelle Tuller won. It was fun to read Casey’s name in this book because I work with her on the ACFW book club loop. I loved reading about all the members of the O’Connor family; they all have so much fun interacting with each other. I highly recommend this book and Julie’s other as well for an honest, passionate look at love and life and everything in-between. Her books are definitely worth your time. Let Julie and her books sweep you into the O’Connor family and into the arms of Jesus. You’ll enjoy her passionate characters in this book and her others.Disclosure of Material Connection: #AD Sponsored by publisher.I received a complimentary copy of this book from the publisher. I was not required to write a positive review. The opinions I have expressed are my own. I am disclosing this in accordance with the Federal Trade Commission’s 16 CFR, Part 255 “Guides Concerning the Use of Endorsements and Testimonials in Advertising”The Book Club Network www.bookfun.orgThe Book Club Network blog www.psalm516.blogspot.comBook Fun Magazine www.bookfunmagazine.com"}, {"userName": "Holly Renee", "userReviewDate": "Sep 01, 2011", "userURL": "http://www.goodreads.com/user/show/5666258-holly-renee", "userReview": "Sean O'Connor wants only one thing--to spend all his days in the bliss of bachelorhood. When he takes a job working with his little sister's best friend, Emma Malloy, he does the one thing he never meant to do. . . he falls in love her with her. There's only one problem . . .she's already married. Emma Malloy escaped the hands of her abusive husband eleven years ago when she fled from Dublin to Boston. Still, she intends to keep the vows she made to her estranged husband and God. But nothing prepares her for falling in love with Sean O'Connor. Can she possibly resist her feelings for the only man she's ever truly loved? Is it possible to remain bound to the vows she made so long ago. . . ? Julie Lessman has done it once again in this second installment to the Winds of Change series. A Heart Revealed is a riveting story filled with tons of romance. I have say right off that out of all of Julie Lessman's characters, Emma and Sean are my favorite so far! Julie Lessman's readers have to come to expect more than just a story about two characters in her novels, but rather a family saga that continues to grow with each new book. This novel is no exception. Inside the pages of this story, one will find more conflict between the beloved characters who captured our imaginations in previous novels. While this novel definitely contains the spiritual depth that can usually be found in Julie Lessman's work, A Heart Revealed really impressed me! I especially appreciated two things in this story.The first thing I appreciated was how the main female character not only lived a full, single life, but actually lived it in absolute contentment, realizing she had already been made complete in Jesus Christ. As a single woman, I can't tell you how refreshing it is to read about a woman who has that kind of perspective! It's a message that took me a long time to learn in my own life, and I'm so glad to see it impressed upon in a romance novel. The second thing I appreciated was how the romance in this novel completely differed from most. Rather than focus on starting out with attraction, then moving onto sparks and falling in love, this romance began with a genuine friendship between two people who appreciated and respected each other without looking for anything in return. It represented a logical kind of love that is not normally led by the heart. I really enjoyed this story and highly recommend it. I will caution however, that anyone who doesn't like to see any kind of sexual references in Christian fiction, should probably stay away from this book. While Julie Lessman has become well-known for showing the God-created beauty of intimacy and passion within the marriage bed--in a manner that is never explicit and always tasteful--,people who have a low tolerance for this sort of thing may feel uncomfortable with this novel. The only reason I gave A Heart Revealed a 4.9 rating and not a 5 star rating, is because there is one loose end that I would have loved to have seen tied up in this novel rather than carried over to the next one. Other than that, A Heart Revealed is a great read!I received a complimentary review of this book from Revell Publishing in exchange for an honest review."}, {"userName": "Katie", "userReviewDate": "Sep 07, 2011", "userURL": "http://www.goodreads.com/user/show/2790490-katie", "userReview": "First posted on my blog, Legacy of a Writer.Need a book that is chockfull of passion—not only in romance, but also for the Lord? Julie Lessman is an author I highly recommend to give you just that! I thought I’d found my favorite by Julie when I read A Hope Undaunted, but I was wrong. A Heart Revealed is the best one I’ve read by Mrs. Lessman to date. Wowza!! Sean and Emma’s story was so amazing, complicating, unique, romantic, and special…I can’t help but still be wrapped up in the O’Connor world, even though I’ve finished the book!After meeting Emma in previous books, and being intrigued by the O’Connor’s first born, Sean, I was so ready to read their story. Emma made an amazing heroine that touched hearts everywhere with her outpour of love and sacrifice. Sean, also, was neat to get to know better. His own complicated life of bachelorhood added humor at the opening of the novel as he continually had to fend off woman’s advances. And, in true Julie Lessman style, other couple’s story come back into focus in A Heart Revealed—Luke and Katie, Marcy and Patrick, and Charity and Mitch. Loved reading the two stubborn newlyweds, Luke and Katie, adjust to married life!A Heart Revealed is an amazingly complex and touching story, dealing with things from marital abuse to long-buried, hidden sins. One of my favorite things to watch was Emma’s slow journey toward complete redemption from her sins of the past. Seeing Sean touch her life and help to heal her from the ugly scars…it was such a touching story! My favorite, as I said already!When trying to describe Julie Lessman’s writing style, the word ‘vivacious’ continually comes to mind. Her words seem to leap from the pages, bringing each story to life right before my eyes. From the heated moments to the heartbreaking scenes, the reader is transported right into the character’s head and heart. It swallows you whole and doesn’t release you till the very end!With a peek into all these married couple’s lives, there are several sweetly heated scenes in bed as these marriages—spanning from newlyweds to veterans—weather the storm of life together, side by side. Nothing overtly explicit beyond kisses and caresses, though. Out of the books I’ve read by Julie Lessman, A Heart Revealed had the least physical contact between the two main characters. Which I think was one of my favorite parts—Sean and Emma’s love for each other stemmed from a deep friendship, and did not begin with physical interest. From beginning to end, readers are sure to be swept into this wonderful addition to the O’Connor family legacy. I am eagerly anticipating Steven’s story, due to come out next year. If you’re a die-hard romantic, then your bookshelf will not be complete without Julie Lessman’s novels on them! I highly recommend you read them in order, to fully grasp the whole, complex O’Connor legacy, but each and every book is a treasure, to be sure. When Julie puts pen to paper, the results are sure to be a heart-warming read!!"}, {"userName": "Margaret Chind", "userReviewDate": "Mar 30, 2012", "userURL": "http://www.goodreads.com/user/show/226769-margaret-chind", "userReview": "A Heart Revealed is the second book in the Winds of Change series, but really the fifth book in the Daughters of Boston series continuing the saga of the O'Connor children and this one is the first one about a son, Sean O'Connor and a character that is practically an adopted daughter in Emma Fray. I love Julie Lessman, both the author and the person that I know and this book had the one issue of being published right after my daughter was born. First there is the publishing date, and then my copy was lost in the mail and another one issued. So there was the timing off, and then my to do list got the better of me and I kept wanting to come back to this one but it kept being put on the back burner. Being from Julie, I knew that I would love it. However, there was something about this one that did not grab me from the first page, and it was later in the novel when I really caught the pace and could not stand to put it down. Once I hit my groove in reading, the pages could not turn fast enough, as per typical with Julie's writing. I really enjoyed it overall, once I got through a bit of a hump, which was probably more related to my delay and then reading bits here and there, then the actual book. As a whole it brought me more information into the brothers O'Connor and opens up Julie's books in my opinions for a much wider male readership and honestly reading her books gives me two desires. I want to go back and start at the beginning and have a marathon reading through all of them again (the almost 500 pages give or take that each one of them is!) and I just want to delve into my Bible and soak up everything I can. These books are fascinating to me. They have such a romantic element that you feel like you should read it in bed, waiting for your husband to come home and join you. I'm sure a blush tinged my face more than once. These stories have such strong elements of faith and scripture that I am sent running to my Bible more and more to delve in and get more of this reality in my own life. It is such a fabulous reminder of what Christ really wants for us to have. -- Yes these are to be read by a mature reader, or one in the midst of maturation with a guided hand that could provide answers... or to a married woman that really needs a boost in the romances on the page. *Thanks to Revell Books for providing a copy for review.*"}, {"userName": "Ashley", "userReviewDate": "Dec 29, 2010", "userURL": "http://www.goodreads.com/user/show/2766155-ashley", "userReview": "Ask anyone, and they will tell you that I'm one of Julie Lessman's most devoted readers ( and that's not an exaggeration) and loved every one of her books. So why didn't I give A Heart Revealed 5 stars? Probably because I just didn’t get to see Sean And Emma as I'd hoped,and instead we got a look at the other couples a bit more than usual. The story picks up where A Hope Undaunted left off. Katie and Luke have finally been married, and the next one up on the marital chopping block is sweet-tempered Sean, who is purely focused on work and content to lead the life of a bachelor. But God has other plans, they in involve an equally sweet and shyly beautiful, Emma Malloy. However, the story wouldn’t be Julie’s if it didn't have the sub-stories of our favorite Irish family, the O'Connors. Julie writes her characters with a beating heart, and at times, I swear I can hear them breathing, which is why you end up falling in love with the whole O’Connor clan. One reason I couldn’t give AR a full 5 stars was due to how slow the story seemed to start off. I mean Sean and Emma (the two main characters) didn't even kiss until much later in the book (which is practically a sin in romance books). In fact it almost felt as if Sean and Emma's story, as a whole, didn't really get going till chapter 12 or so. And I was excited to see more of them together, even from before I picked up the book. When it comes to matters of faith, Mrs. Lessman is never at a lose. She tackles the gritty problems we don’t always see in Christian books, and shows through her characters, that by putting our problems in God's loving and capable hands, we can find forgiveness, redemption, and our heat’s deepest desires revealed to us in blessings. I can never read her books without crying, because she writes with a convicting passion, a true gift from God. And really, shouldn't that be what’s makes a wonderful novel? Of course the romance and drama doesn't hurt either. Once again, Julie Lessman has written a romance novel that has more drama, passion and love for God in it, to keep you turning the page till the end. As always, I can't wait for her next novel. Available September 2011 at your favorite bookseller from Revell, a division of Baker Publishing Group."}, {"userName": "Tamara Tilley", "userReviewDate": "Nov 17, 2012", "userURL": "http://www.goodreads.com/user/show/1383724-tamara-tilley", "userReview": "A HEART REVEALED, book two in the Winds of Change series, was like a carnival full of emotional roller coasters. While the heights were breathtaking, some of the twists were more jarring than entertaining.Emma Malloy had spent ten years trying to put the violent and tragic events of her past behind her. With friends like the O’Connor’s, she has thrived in Boston, pushing the events that happened in Dublin to the recesses of her mind. What she didn’t plan for was her deepening feelings for Sean O’Connor. But, feeling she is not available to anyone because of the person who waits for her in Dublin, she chooses to put her emotions aside and learns to appreciate Sean as just a friend.Sean O’Connor treats Emma as a sister and a dear family friend. He’s protective of her because of the violence that has scarred her both physically and emotionally. When his feelings for Emma grow and he expresses those feelings, he is dumbfounded that Emma would feel such a responsibility to honor the vow she made to her husband, the husband that abused her. He decides he will respect Emma’s wishes for now, but isn’t sure how long his self-control will hold up.I really enjoyed A HEART REVEALED but there were a few story lines that I felt were a bit out of character. Without giving much away, I really didn’t like the ‘Rose’ character. I feel Sean–being the standup guy that he was– would not of allowed himself to be so controlled by Rose. I also didn’t like the revelation regarding Emma’s marriage. For a woman wanting to start a new life for herself, so much so that she put an ocean between her and her former life, I think she would have handled things differently regarding her vows. She seemed so willing to cling to God and his promises, but ignored forgiveness for herself. Other than that, a good read, with great characters. I like the fact that Lessman allows the married couples in this series to have passion and desire for each other, and doesn’t ignore the fact that even Christians can have passionate thoughts and faltering self-discipline. Nothing was over the top, but it wasn’t ignored either."}, {"userName": "Robin Prater", "userReviewDate": "Oct 06, 2011", "userURL": "http://www.goodreads.com/user/show/4601234-robin-prater", "userReview": "Oh, the romance that I found as I opened this lovely book. Be still my heart. This book holds such beautiful characters all weaving them into a place of renewed peace. Emma Malloy is one of those unforgettable characters. She is that woman with a past that holds regret. She wants love, but with her past it will be difficult for her to ever trust again. She is such a sweet spirit and a woman of virtue. Although her character went through such heartache in 1919, it is a pain we can relate to today. She is holding much fear from the past, but we get to watch healing wash over her. I say fear, because it is that deep emotion of losing control and having another bring such deep pain that the scars last forever. Sean O'Connor is that young man that all girls are attracted to. He has everything going for him, except one thing. He is battling a rage that he didn't even know was there. His character shows us that we must face our demons head on. Sean has one love and that is, Emma. We watch these two characters battle many things as they are always uplifting others. I found this very poignant. We try to hide our own pain at times by reaching out to others. But we too must find healing through revealing our true heart and that is exactly what they do. So many wonderful characters come together once again here in book two. They are a combination of married couples and single folks all searching for the same thing. Love and acceptance. Isn't that what we are all after? We see true romance here as the love of God washes over these characters as they are refined by the fire they must walk through. I love this story because we get to glimpse the imperfectness of the characters. We witness their journey forward as they try to let go of yesterday. It's not always easy, but in faith we trust the Lord to lead us into that place where we feel complete in Him. Once opening this book to the first page I couldn't put it down. Julie pulls the reader into the story through these deep characters that inspire us to take a look inside our own heart and lay down our past as we accept the present with grace and joy. This book was a gift from Revell for it's review."}, {"userName": "Julie Graves", "userReviewDate": "Apr 19, 2012", "userURL": "http://www.goodreads.com/user/show/74167-julie-graves", "userReview": "Emma Malloy escaped her abusive husband 11 years ago. She now has made a new life for herself. She is the head of her best friends department store, works long hours and has a generous loving heart.Sean O'Connor is a confirmed bachelor. When he loses his job in the middle of a depression Charity, Sean's sister, offers him a job as co-manager at the store she owns.Even though Emma has known Sean for years she has recently seen a side of him that causes her to be nervous working near him. Sean has some anger issues that he can usually keep a lid on. Only two times in his life has he ever lost control.Emma and Sean develop a close friendship, but neither one is prepared when that friendship develops into something more.This is the second book in the Winds of Change series. The first one being the story of Luke and Katie in A Hope Undaunted. Although this is Emma and Sean's story we do get to still hear about Luke and Katie newly married and Katie still as feisty as ever! Also we get to see more of Charity and her husband Mitch. At one point Mitch is so angry at Charity he quits speaking to her for a couple of weeks. At first I was rather irritated at this behavior. I wanted to smack him upside the head! I thought \"who acts this way in a marriage?\" and then upon further thought realized \"oh wait, I remember a time when my husband and I didn't speak for a while\" Wow! Julie Lessman captured the dynamics of a marriage pretty well in Charity and Mitch's relationship. I liked how each relationship had different struggles and in each case learned to rely on God to work through those struggles to love each other better and ultimately grow in relationship with Him. Looking forward to A Love Surrendered coming out in October."}, {"userName": "Angelc", "userReviewDate": "Oct 08, 2011", "userURL": "http://www.goodreads.com/user/show/1445462-angelc", "userReview": "This book was very different from what I had anticipated. It's part of a series, and I'm not really sure that it can be read as a standalone novel. There were a lot of characters to keep straight right from the very beginning. It was a struggle to keep up with all of the different couples and become invested in all of them at the same time. I had thought the book would focus on Emma and Sean, but there was just as much time and pages devoted to the other two couples as well. I'm sure this contributes to the hefty 500 page count.I wasn't fully able to become immersed in Emma and Sean's romance for a few reasons, including the fact that she was still married to an abusive husband who didn't even live in the same country. But another reason I couldn't embrace their love story was because of Rose. I really squirmed every time I had to read about the \"hero\" kissing another woman and how much he liked it. Plus this doesn't make sense based on the other views on cheating in the book.One thing I enjoyed reading about immensely was the time period in American history. I love to read about how different things were, but mostly what has stayed the same. I loved all the 1920s/30s name dropping. Their little shop sells Brooks Brothers? Way to go! And Charity wore an Elsa Schiaparelli dress? Wow! High roller! This was by far the most fun of the book for me.This would probably be a welcome addition to fans of the series just because there is so much continuation of the other characters' stories. But I just couldn't get on board with the main romance in the book.book sent by publisher in exchange for honest reviewreviewed for http://inthehammockblog.blogspot.com"}, {"userName": "Amber Stokes", "userReviewDate": "Aug 10, 2011", "userURL": "http://www.goodreads.com/user/show/3571177-amber-stokes", "userReview": "Catching up with the O'Connor clan is always a treat! Lessman's family saga continues in A Heart Revealed - a sweet story of grace and godliness, as well as the struggle to accept and act in both. Hearts are certainly revealed in several marriages and friendships throughout this story, and Lessman's sensitivity makes the result ultimately uplifting.Reading through this book is like reading through plenty of case studies for various personality theories. The pages are rich in each character's personal history and the motivations that brought them to where the story unfolds. Plenty to discuss and dissect here! And plenty to cause angst and frustration in the reader, for sure, as Lessman creates tons of engaging drama.Some of the ways in which Lessman resolved issues in this particular book were a bit frustrating for me in a less engaging way in regards to back story. And at times the relationship issues seemed a bit repetitive, although the themes are played out nicely, and some of the lines/analogies are just great - like Sean's descriptions of two of his sisters' marriages. (Definitely a lot of insight into the characters there!)Like other Julie Lessman novels, this book will require setting aside a good chunk of time in order to read through it, but her stories are worth the investment. For old fans and new ones, this is a well-written and intriguing story full of misguided love and tender affection that romance readers will enjoy!*With thanks to Revell Publishing for providing me with a copy of the book in exchange for my honest opinion.*“Available September 2011 at your favorite bookseller from Revell, a division of Baker Publishing Group.”"}, {"userName": "Carly", "userReviewDate": "Sep 18, 2011", "userURL": "http://www.goodreads.com/user/show/2390389-carly", "userReview": "I am still fairly new to Julie Lessman’s books. Having missed her entire Daughter’s of Boston series, I didn’t start reading her books until the first book in the Winds of Change series, A Hope Undaunted. A Heart Revealed is the second book in the series and after enjoying A Hope Undaunted, I was really looking forward to this book. I have slightly mixed feelings about this one. On one hand, this book was a little slow to me. I don’t mean slow as in boring, don’t misunderstand. It’s just that it took me several days to read this book and I was not glued to it the way I was hoping to be. I am always hesitant to use the word ‘slow’ when I describe a book because often I don’t mean boring. It’s just that some stories move faster than others. This story was not a fast mover, and that is not necessarily a negative. Stories like this can be savored. On the other hand, the writing is excellent and I really liked Sean and Emma. They were such a sweet and likable couple that I enjoyed getting to know better. As I reflect on A Heart Revealed one word that comes to mind - beautiful. My opinion of this book improved significantly once I reached the end and was able to reflect on the entire story. I like a book that stays with me and stays on my mind after I have finished it. Sometimes I finish a book and don’t give much thought to afterwards. That usually happens with a book that is fast and takes me little time to read, but a book like A Heart Revealed leaves a lasting impression. So, despite my slightly mixed feelings, I definitely lean more toward the positive here."}, {"userName": "Staci", "userReviewDate": "Sep 06, 2011", "userURL": "http://www.goodreads.com/user/show/177641-staci", "userReview": "1.) Reasons you chose this bookI read the first one in the series, A Hope Undaunted (my review) and absolutely loved the main character and her story. Agreeing to read/review this one when contacted by the publishing company was a no-brainer!2.) Reasons you liked or disliked this bookI absolutely loved this story. This genre, which I call my gentle reads (instead of inspirational fiction) just keeps getting better as the authors understand that the way to a reader's heart is not to pummel them with biblical quotes and lectures, but rather by allowing their characters to be human. To make mistakes, to stumble and fall, to question their faith and to question the existence of God.  I think Julie Lessman does a great job balancing her writing and keeping the reader engaged. I'm so very happy that she portrays marriages in such a realistic fashion too. She gives the reader just enough spice to make the story believable. I love the family dynamics and how they interact with each other.  3.) Reasons you are recommending this book I know some of you don't read Christian/Inspirational fiction because you believe that it may be Bible thumping time when you crack open a book of this nature, but if you've been considering giving this genre a chance I would not hesitate to direct you towards Julie Lessman's books. She has that special knack of drawing the reader into her character's lives... and you'll be glad you got the chance to know them!"}, {"userName": "Cheryl", "userReviewDate": "Sep 17, 2011", "userURL": "http://www.goodreads.com/user/show/1179650-cheryl", "userReview": "Emma thought she had found true love when she married Rory Malloy. Emma was sadly mistaken. Rory was both physically and verbally abusive to Emma. Emma has a disfigurement on the side of her face from the result of one of Rory’s many violent moments. Luckily for Emma, Rory took an interest in someone else and left Emma. Charity is Emma’s friend. She knows that Emma needs help in the shop, so she tells her that she has someone in mind, her brother, Sean. As much as Emma needs help, she is unsure about Sean. Emma has a crush on Sean. A Heart Revealed is book two of the Wings of Change novels. It can be read as a stand alone novel. I liked the first book in this series, so I was excited to read this book. I have to say that this book started out slow for me. There were too many other characters all introduced in the beginning and I knew that they were not the main focus of the story. It was Emma and Sean. So as I was reading the book in the beginning, I did not pay as much attention as I probably should have done so as I just wanted to get to the meat of the plot with Emma and Sean. Once the story did center on Emma and Sean, I thought they made a cute couple. Of course, Emma was a wall flower and needed coaxing from Sean to open up. There were some misses but overall this was a good book."}, {"userName": "Kelsey", "userReviewDate": "Dec 10, 2017", "userURL": "http://www.goodreads.com/user/show/6353465-kelsey", "userReview": "The Winds of Change series is the continuation of the Daughters of Boston series. It is highly recommended that readers begin with A Passion Most Pure. My review can be read here. Finally we find out what the eldest O’Connor brother has been up to. Up until now, we’ve only caught glimpses of Sean’s life through his sisters’ eyes, and all we know is that he’s a self-proclaimed bachelor. Well, that’s all about to change. Enter Emma Malloy, Sean’s sister Charity’s best friend. She’s spent the last thirteen years trying to recover from the life she left behind in Ireland, a life involving an abusive husband and a load of dirty laundry. Sean’s the only man she’s ever been able to trust, but it seems he may have some laundry of his own to air.This book felt like a more traditional inspirational romance than the others in this series. The romance was still there, however it was more of a waiting game, a slow burn instead of all passion and excitement. It was also unique in that both love interests were well into their thirties, considered past marrying age for the time period. Their relationship had a special sort of sweetness to it, and Julie Lessman continues this into the final book in the series."}, {"userName": "Jeannette Garcia", "userReviewDate": "May 24, 2012", "userURL": "http://www.goodreads.com/user/show/3397303-jeannette-garcia", "userReview": "Oh! I loved this book so much! I absolutely loved Emma's story and didn't find any part of it predictable. I always loved her character and my heart felt complete when she finally married Sean. Like the rest of Julie's books, this one also held many biblical lessons. The fact that Emma had suffered the way she did would cause any normal human being to turn from God and hold Him accountable. But what I loved so much about this story is the strength Emma had. A single quote from this book made me cry at the realization of the truth behind every word. \"No one escapes being hurt in this life, Sean, because unfortunately, we live in a fallen world. But please believe me when I say... there's a great gift in pain.\""}, {"userName": "Elizabeth S", "userReviewDate": "Oct 21, 2011", "userURL": "http://www.goodreads.com/user/show/6741673-elizabeth-s", "userReview": "Julie Lessman has been hit hard by people who think she is too edgy. I disagree because her books are realistic and never cross the line. Emma is a sweet and lovely heroine. Sean could be exasperating at times but I found it interesting that he never really contemplated infidelity even though he was not a Christian. It shows that he respected Emma and had a morality that even for that time might have wavered. This book is one of the most morally upholding books I have read in awhile. It is also interesting that divorce is never even mentioned but that is of course because the characters are Catholic. Lessman is a strong voice in Christian fiction."}, {"userName": "Jennifer", "userReviewDate": "Oct 04, 2011", "userURL": "http://www.goodreads.com/user/show/6547779-jennifer", "userReview": "I have found that the tag Line \"Passion with a Purpose\" does not touch the surface of the Love, Dedication and sincere realism, that takes her books beyond the shelf, but into the lives of her readers. Not just for a day, but her work hit a special place in your heart and will stay long after you place the book on the shelf - only to be read again. I give Julie Lessman and her works in Christian Literature a 5 Star rating. Her books will make you beg for another."}, {"userName": "Margaret Chind", "userReviewDate": "Jan 22, 2011", "userURL": "http://www.goodreads.com/user/show/226769-margaret-chind", "userReview": "I had to buy myself a copy of this one on Kindle, because I wanted to read it so badly and only by the light of an electronic reader would suffice in the nursery... See the Kindle copy, for my review."}, {"userName": "Mackenzie", "userReviewDate": "Feb 10, 2011", "userURL": "http://www.goodreads.com/user/show/4510759-mackenzie", "userReview": "Book 2 of 3"}, {"userName": "Molly Cafinated Reads Jaber", "userReviewDate": "Jan 21, 2018", "userURL": "http://www.goodreads.com/user/show/48982273-molly-cafinated-reads-jaber", "userReview": "*This review is from my blog and originally published in 2011*Okay. Let me take just one moment to reflect on this book. *Reflecting* Okay. That’s better. WOW. I don’t even know where to begin. There is so much to say about this novel. Let me start off by saying if you’ve never read a Julie Lessman novel, stop what you are doing right now, and grab a copy. You won’t be sorry. The first novel I read by her was last September, entitled A Hope Undaunted, book 1 in this Winds Of Change series. I couldn’t believe how much I fell in love with her work! I was then lucky enough to win all three novels in her first series, The Daughters of Boston. Though they are still sitting on my shelf to be read, they are definitely calling my name and I can’t wait to go back and read them.Now, on to the rest. In the first book in this series, I fell in love with Luke McGee. In this novel, I think I love Sean O’Connor even more. I really enjoy Snickers bars, so see, Julie? You could send SEAN my way, and I’d be forever blissfully happy. I LOVED his character. He was great in his role in A Hope Undaunted , but reading his story with the focus on him, was absolutely amazing. His past wasn’t perfect, and there were times when he went wild with anger, but he overcame that. There was one thing from his past that he holds inside though. No one, not even his nosy sisters, know. That is until, he finds himself drawn to his best friend Emma in a way that he couldn’t imagine. He opens up to her….with everything.Emma Malloy. Bless her soul. She was a wonderful character, flawed and sweet, and wanting everyone close to her to be happy. Including Sean. When she finds her self falling in love with him, when she’s still married to the man who beat her 11 years ago, she’s determined to push him off on Rose Kelly…the woman who loves him. Trouble is, something happened to Sean and he won’t try with Rose.Oh, I so want to go on and on….but I’m SO close to giving away the plot! I DO NOT want to do that! I want you to devour the book like I did and take the time to reflect on the wonderfulness of this novel. It’s stunning. It’s breath taking. It’s a roller coaster of emotions, from happiness, to sadness, to anger, to pride, to passion. It has a WHOPPER of a twist and an ending that will leave you smiling and tears running down your face. Not to mention I LOVED Casey Herringshaw and Michelle Tuller’s characters 😉 *grins*!I highly suggest that you grab a copy of this novel NOW. It’s 5 Books worthy, two thumbs up, hats off, a home run, a winner, a best seller……what ever you want to call it’s that. Julie Lessman really has a way to make ME feel a part of the heart of the story. She speaks to me through the words of her characters, and really brings me closer to God each time. She is by far my absolute FAVORITE Christian novelist and I will NEVER part with her books. They are forever on myself for me to read and reread, and reflect on each time. I am looking forward to book three in this series, Steven O’Connor’s story. Sweet angels in Heaven, though, Julie, do you have to make us wait a whole YEAR!?!? *Sigh* Oh well. All the more for me to savor that one upon it’s release."}, {"userName": "Kristina", "userReviewDate": "Jun 16, 2017", "userURL": "http://www.goodreads.com/user/show/9122881-kristina", "userReview": "A refreshing story about the love of God and the love of two people struggling with their pasts.I thought this was a good story, and the bits of prayer and calling on scripture were just enough to not make it feel like a bible lesson. Lessman did a good job of evoking the human part of this story.Set during the Great Depression-era, Emma Malloy, a battered wife from Dublin, is living in Boston being loved by the family of the O' Connor's. She has lived there for 11 years and has a best friend in Sean, oldest son of Marcy and Patrick. After working together and living life together, something switches in a moment. But Emma is married and cannot act on her desires or wants when she has a husband in Dublin. But what happens if that husband comes to Boston to woo her back and promise to stop the abuse and drinking? Will Emma and Sean really have a chance? Or will Rory win her back?There are also side stories about Charity and Mitch and how they deal with marriage and temptations at work. And Katie and Luke as they embark on the new road paved called marriage. Reading Lessman's books gives the reality marriage is hard work even when you love someone to point of giving your life for another. God needs to be the foundation and its great to read about that in these stories."}, {"userName": "Margo", "userReviewDate": "Jan 23, 2018", "userURL": "http://www.goodreads.com/user/show/10285537-margo", "userReview": "I couldn't put this novel down. It really gets to your in so many ways; spiritually, emotionally, physically. Be prepared. Lessman delivers and she means it with every word! I loved it so much I was so sad to have it be finished. I devoured this book with all my being, and had me hanging on every chapter to find out what happened next. You are with Emma and Sean, but then you are stuck on Charity and Mitch and Katie and Luke, and boom, you have a story that is so real you almost feel like you lived it. I loved how the dynamic characters and humor made the pages of the books just disappear. It is a lengthy read, but worth every second. You cannot look away, or set it down, nor should you. I recommend this to anyone who needs an escape from a heavy/stressful workday, or whoever dreams of romance not in the fake kind, but in the raw, realistic, heart and gut wrenching kind of either joy or heart break. Julie, you have my respect, thank you for the trip. Patrick and Marcy are who I would long to be one day... that kind of marriage doesn't exist anymore. Whether you are single or have a partner, I hope this book reaches every corner of the U.S. women and men even lol. Enjoy!"}], "description": "Ten years ago, Emma Malloy fled Dublin for Boston as a battered woman, escaping the husband who scarred her beautiful face. The physical and emotional wounds have faded with time, and her life is finally full of purpose and free from the pain of her past. But when she falls for her friend Charity's handsome and charming brother, Sean O'Connor, fear and shame threaten to destroy her. Could Sean and Emma ever have a future together? Or is Emma doomed to live out the rest of her life denying the only true love she's ever known?Filled with intense passion and longing, deception and revelation, A Heart Revealed will hold readers in its grip until the very last page.", "title": "A Heart Revealed\n      \n          (Winds of Change #2)", "url": "https://www.goodreads.com/book/show/10329483-a-heart-revealed", "average": 4.28, "cover": "https://images.gr-assets.com/books/1298868626l/10329483.jpg", "reviews": 166, "authors": [{"url": "https://www.goodreads.com/author/show/965709.Julie_Lessman", "name": "Julie Lessman"}], "type": ["Christian Fiction", "Historical", "Christian", "Romance", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/10329483-a-heart-revealed", "http://www.goodreads.com/book/show/12517238-a-heart-revealed", "http://www.goodreads.com/book/show/2121231.A_Passion_Most_Pure", "http://www.goodreads.com/book/show/7506363-a-hope-undaunted", "http://www.goodreads.com/book/show/2288562.A_Passion_Redeemed", "http://www.goodreads.com/book/show/5497945-a-passion-denied", "http://www.goodreads.com/book/show/15726377-love-at-any-cost", "http://www.goodreads.com/book/show/28168785-runaway", "http://www.goodreads.com/book/show/35148447-juliet", "http://www.goodreads.com/book/show/35913695-hidden-secrets", "http://www.goodreads.com/book/show/40198274-kiss-me-while-i-sleep", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/35839275-kian", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/26186801-someone-like-you", "http://www.goodreads.com/book/show/18800300-from-thin-air", "http://www.goodreads.com/book/show/18950617-sweet-caroline", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/18800331-to-hope", "http://www.goodreads.com/book/show/33016164-royally-bad", "http://www.goodreads.com/book/show/34609092-royally-ruined", "http://www.goodreads.com/book/show/40193474-the-finishing-touches", "http://www.goodreads.com/book/show/40193549-roses", "http://www.goodreads.com/book/show/19032297-accidentally-in-love-with-a-god", "http://www.goodreads.com/book/show/29231863-splinter", "http://www.goodreads.com/book/show/23622993-claimed", "http://www.goodreads.com/book/show/40243614-just-jilted", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/18800455-the-pms-club", "http://www.goodreads.com/book/show/18800812-gypsy", "http://www.goodreads.com/book/show/35708042-bodyguard", "http://www.goodreads.com/book/show/18800579-willow", "http://www.goodreads.com/book/show/30126159-mosaic", "http://www.goodreads.com/book/show/40389026-summer-island", "http://www.goodreads.com/book/show/12369122-because-of-you", "http://www.goodreads.com/book/show/29373539-the-lullaby-sky", "http://www.goodreads.com/book/show/28441063-secretly-hers", "http://www.goodreads.com/book/show/23271170-tycoon-takedown", "http://www.goodreads.com/book/show/18800411-come-high-water", "http://www.goodreads.com/book/show/33001355-before-i-knew", "http://www.goodreads.com/book/show/40205166-the-paradise-of-glass", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/21425515-once-haunted-twice-shy", "http://www.goodreads.com/book/show/40272947-the-pursuit-of-tamsen-littlejohn", "http://www.goodreads.com/book/show/40193595-the-story-of-beautiful-girl", "http://www.goodreads.com/book/show/11781578-lover-s-leap", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/30184217-say-goodbye-for-now", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/18800690-love-is", "http://www.goodreads.com/book/show/36685093-the-unimaginable"]}