{"ratings": 8, "userreviews": [{"userName": "Linda Acaster", "userReviewDate": "Dec 08, 2012", "userURL": "http://www.goodreads.com/user/show/4568100-linda-acaster", "userReview": "We try to be even-handed in our dealings with others, and expect the same in return. We give our best to our employers and trust that they do the same to us. But what if they don’t; don’t as a norm? Thousands of ordinary low-level workers in the USA are signed into non-compete contracts so tight they are virtually without rights those of us in the UK take for granted: few pay rises, axed with little severance, and unable to take on a job in a similar field for 18 months or more under threat of being sued. With no other experience and often over-qualified for other jobs through their own diligence, they are virtually unemployable – with a mortgage, household and children to put through college.Don Gunn is one such man. He’s read the writing on the wall at the advertising agency where he’s worked for years and is desperately applying for other jobs before he’s severed and his non-compete clause kicks in. But the economic downturn is biting, and he’s not exactly 25. Still grieving over the death of his wife, his self-worth is skidding away from him. So when a good-looking younger woman flirts with him it gives him a shot in the arm, and when she pursues him he reckons he’s nothing to lose but his self-imposed celibacy. How wrong can a man be?A Hell of a Woman is an examination of the iniquities inherent in the ‘Land of the Free’ with Gunn’s personal life mirroring his employment life until, a man under extreme stress from all sides, he cracks. How he cracks makes a spectacular finale. However, this is a book, a novel, that makes the reader step back and assess just how near to real life this is. Justice for those of us who pay our taxes and cause no trouble should be a single step away. Often it can feel like a million miles. It leaves an uncomfortable, and haunting aftertaste because Ron Hummer, like as not, is writing from experience."}, {"userName": "Candice", "userReviewDate": "Feb 05, 2013", "userURL": "http://www.goodreads.com/user/show/10437252-candice", "userReview": "While reading the book I found it to be on the heavy side of non-compete contracts and while I learned a lot about those types of contracts and agree with the author that they are terrible I ended up skipping a lot of the conversations concerning the non-compete contracts. However, I really enjoyed that they story kept me guessing. I was expecting a completely different ending and was pleasantly surprised when it did not, and while the characters could use a little more development I did enjoy the read."}], "description": "It's the summer 2010, Allentown, Pennsylvania. Doc Halladay has joined The Philadelphia Phillies in a bid to go back and win the World Series after losing to the New York Yankees in 2009. 6 months ago, Don Gunn's wife died in a car accident. Now he is on the verge of losing his job and career at Blake & Yurman, an advertising agency, because of his non-compete agreement which will keep him out of the industry for 2 years. Things seem to look up for Gunn when he meets Kim Hunter, a woman who is nearly half his age, a woman that he can only dream about. He goes on a date with Kim that night which will be the beginning of his worst nightmare. Suddenly, people are following him, camping out by his apartment. 5 people are murdered by a serial killer and Kim Hunter is a person of interest in all of the murders. As Gunn races through interviews in order to find a job before he is fired from Blake & Yurman, his life is spiraling out of control, putting the lives of his closet friends - Natalie Mendoza and Doug Kimball - in danger. As a result, Gunn is forced to determine who the serial killer is before he is the next victim. A Hell Of A Woman is a story about love, friendship, and what happens when a man loses everything that he worked so hard for because of corporate greed in America.", "title": "A Hell of a Woman", "url": "http://www.goodreads.com/book/show/16444128-a-hell-of-a-woman", "average": 3.63, "cover": "https://images.gr-assets.com/books/1356209860l/16444128.jpg", "reviews": 2, "authors": [{"url": "https://www.goodreads.com/author/show/5372866.Ron_Hummer", "name": "Ron Hummer"}, {"url": "https://www.goodreads.com/author/show/6696403.Phyllis_Raynor", "name": "Phyllis Raynor"}], "type": [], "outlinks": ["http://www.goodreads.com/book/show/16444128-a-hell-of-a-woman", "http://www.goodreads.com/book/show/16285825-a-hell-of-a-woman", "http://www.goodreads.com/book/show/18228583-the-bachelor-party", "http://www.goodreads.com/book/show/13178534-96-rocks", "http://www.goodreads.com/book/show/38347493-non-compete-agreements"]}