{"ratings": 63024, "userreviews": [{"userName": "karen", "userReviewDate": "Dec 26, 2015", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "of the TWENTY-SEVEN books i'd read in the GR awards semifinals, this is the only one that won in its category. so congratulations, even though i don't consider this a graphic novel as such, more like a collection of unrelated cartoons better placed in the humor category, but who's gonna split genre-hairs?\nalthough i'm pretty confident i have at least 10-15 years on this cartoonist, there's still so much in this book that resonated with me. which probably reflects very poorly on me - it's one thing to still be finding your way and retaining your childish mores in your twenties, but it's a little less cute when you're … older. there are some parts of adulthood i am very good at: paying bills on time and making sure the dishes are done and the litterbox is clean and not running out of toothpaste. but then there are some other things i just can't seem to get the hang of, mostly in the realm of social fakery, like small talk and networking and climbing that social ladder. and then there are \"adult\" skills i just don't see the value of adopting, like the development of an impulse control muscle that says \"don't eat that whole box of cookies in one sitting,\" \nor \"don't buy another stuffed animal, you old fart.\"and sarah andersen seems like a soulmate in those regards.\nwe are exhausted by the same things, like slow walkers, the ease of written vs. the hell of verbal communication, and the struggle of maintaining a polite and focused attention span while inwardly experiencing social anxiety and a desire to be back in the safety of one's home-cave.\ni think i used to be an extrovert but then i just got so tired. i'd much rather hide out and be cozy, and while i'm a little regretful that i don't take advantage of all the fine cultural things new york has to offer, i feel a little \"been there, done that,\" and now i'm all old and groggy. i'm no longer young and hot and new york is pretty much tailored for the young and hot. or the rich. and too often i just feel like this\nbut this book makes me feel okay about myself. it says it's okay to have serious attachments to stuffed animals\nand a notebook addiction that is well-intentioned but haphazard\nand it stresses the importance of coziness:\n\nespecially when it comes to cozy-fashion\ni mean, right now i am wearing doraemon poupons and a julius-monkey fleece top. like a baby.there are, of course, several comics pandering to booknerds, most notably\nbut the biggest adult lesson i learned from this book is: wait, you're supposed to wash your bras? i do laundry once a week - i'm no scrub, but i have never ever in my life washed a bra. not even when i was a little kid living at home and someone else was doing the laundry for me. how does this even work? don't they get all misshapen and crumpled? i do not have sweaty stinky boobs, and i've never had a problem with filthy bras. so i'm going to keep living the way i been living and no one's gonna stop me.this book also highlights a lot of girl-woes that made me shout, \"i know, right?\" like the way the fashion industry and the lingerie industry just don't seem to be able to work together\nthe perils of long hair\nand the mysterious ways of tampons\nother noteworthy fist-bumps from me to ms. andersen include her addressing:-the joy of giving gifts and the crippling shyness of receiving them. -the constant dwelling on stupid things one has said long after anyone else remembers them-the lack of desire to spawn-the shyness that comes off as rudeness-how long toenail polish lastsand we also both have stuffed bunnies\nexcept hers is a little more alive than mine\nso i'm totally down to be her big sister, if she is in the market for one of those. we can wave shyly at each other from across the room and then go back home to our respective pj's and our too-early cat alarm clocks. i'm gonna peter pan myself well into my old-age senility, when it will once more be completely age-appropriate for me to embrace what makes me comfortable over the challenges of the world of social expectations.so there."}, {"userName": "Ariel", "userReviewDate": "Jun 19, 2017", "userURL": "http://www.goodreads.com/user/show/6536286-ariel", "userReview": "I am extremely tired of the word \"relatable\"... BUT BOY IF THERE EVER WAS A MOMEMT FOR IT!This collection of webcomics had me actually laughing out loud, had me saying \"YES!\", had me pointing out page after page to my boyfriend. It's silly and cute, but also deeply truthful to the fears and elations of people who live online. I loved it, and will definitely be picking up her second volume!"}, {"userName": "Melissa ♥ Dog/Wolf Lover ♥ Martin", "userReviewDate": "Jan 28, 2017", "userURL": "http://www.goodreads.com/user/show/17438949-melissa-dog-wolf-lover-martin", "userReview": "There were so many things I related to in this book but I'm only going to share a few. ↑ Okay, so I'm going to show y'all pictures of SOME of my stuffed animals that take over my bed (I sleep on the couch anyway) and some of my dog, Lucy's stuffed animals. WE BELIEVE IN THE STUFFED ANIMAL! WE LOVE THE STUFFED ANIMAL!I have seriously donated garbage bag upon garbage bags of stuffed animals to the children's home though. But, my stuffed animals will always be huge. These are not even the half of them =) PS ~ I'm getting one more garbage bag ready to go to the children's home when I go to the doctor in February. But never fear, at some point they will be replaced!!!! lol Oh, and the big ones are kinda hiding the big pile that is on the bed you can't see and there are big ones under that pile too. I love them alllllllllllllllllllll ! My dog Lucy's pile down below =) Down below ↓I don't say my body is a temple but I do repeat over and over, you shouldn't be eating this, STOP!!!! ↑ This always happened just like the picture shows! Okay so I don't have kids and I'm not a grandma, but I do have about a million notebooks and journals that I collect and have written in like two. And only in half of the two. I can't help myself! The above picture is totally true. I never wanted kids and I don't have them and it's too late for all of that and I'm fine with it =) Okay the wifi thing is self explanatory! and the book thing, we all get that one! I thought this book was soooooo cute! There are a good bit of cute funny stuff in the book and it's worth a pick up and read =)MY BLOG: Melissa Martin's Reading List"}, {"userName": "Alienor ✘ French Frowner ✘", "userReviewDate": "Dec 27, 2015", "userURL": "http://www.goodreads.com/user/show/31461418-alienor-french-frowner", "userReview": "✨ AVAILABLE NOW! ✨ THANK YOU, Sarah Andersen. I mean it.See, it seems to me lately that everyone around me has some variation of \"You are an adult, you must-\" sentence ready to throw it on me. Real adults don’t read that much because when are you going to take time for making babies? (really)Real women know how to cook/clean up everything without complaining (you don’t say)Real women want kids, too (back off)Real adults always wake up early (as if)Real – *internal screaming**INTERLUDE**/INTERLUDE*The truth is, I respect all the checklists of my definition of adulthood and it’s enough for me : I take care of my loved ones, pay my bills, work my best for my pupils, respect the law, assume myself, as in, I am independent. Being an adult isn’t about fulfilling some aged fantasies in which women are sort of superheroes who raise kids, are sexy, work like hell and fucking smile all the time because HEY! LIFE’S AWESOME! Don't get me wrong, I'm not saying that nobody can be happy like this - It's not me is all.I don’t feel less adult because no, I don’t spend my Sundays cleaning the house like crazy (and somehow it's still clean, mind you)I don’t feel less adult because yes sometimes I play videogames *GASP*I sure don't feel less adult because I don't have kids. I am an adult, but perhaps my definition isn’t the same as yours. Who cares? I'm sure not here to judge. Everybody needs to find his own happy place in my opinion, and I found mine, as you found yours.This book explores what adulthood is about and how frightening and confusing it can be, with all the expectations and other stereotypes which can be motivating but also so very stressful. Although I didn’t relate to every anecdote (I’ve been in a loving relationship for 7 years and am lucky enough to have a stable job), Sarah Andersen managed to capture perfectly what it means to be an “adult” nowadays while making me laugh – not to mention all these OMG I AM NOT ALONE! moments I lived along the way (I won’t say which ones. Because of reasons).As for the art, I’m not sure I like it but it definitely helps staying focused on the story related and never diminished my enjoyment during my read.► Recommended for every lover of pajamas out there. *winks* *arc kindly provided by Andrews McMeel Publishing through Netgalley in exchange for an honest review*For more of my reviews, please visit:"}, {"userName": "Natalie Monroe", "userReviewDate": "Dec 26, 2015", "userURL": "http://www.goodreads.com/user/show/6688207-natalie-monroe", "userReview": "This whole book is my spirit animal. Side effects may include extreme nasal pain from snorting liquids up your nose while laughing or embarrassment from snorting very loudly in public. ARC provided by Netgalley"}, {"userName": "Nat", "userReviewDate": "Jun 25, 2016", "userURL": "http://www.goodreads.com/user/show/23381142-nat", "userReview": "Adulthood Is a Myth documents the beauty of wasting an entire weekend on the internet, the unbearable agony of holding hands on the street with a gorgeous guy, dreaming all day of getting home and back into pajamas, and wondering when, exactly, this adulthood thing beginsThis book was great because it made me feel lighter while reading, but ultimately it didn't do much towards building a full picture of happiness. And I probably won't remember most of the instances after putting it down.\n\n\n\n\n\n\n\n\n\n\n\nBut Adulthood Is a Myth managed to put a smile on my face, which is always a bonus.*Note: I'm an Amazon Affiliate. If you're interested in buying Adulthood Is a Myth, just click on the image below to go through my link. I'll make a small commission!*\nThis review and more can be found on my blog."}, {"userName": "Alex ☣ Deranged KittyCat ☣", "userReviewDate": "Dec 27, 2015", "userURL": "http://www.goodreads.com/user/show/13555222-alex-deranged-kittycat", "userReview": "Adulthood really is a myth! And I read this book while enjoying a Milka & Oreo chocolate.Sarah Andersen does a great job at showing the hardships of girls and women while keeping it light and funny. It's amazing how easy I could relate to her drawings. I kept showing some of the drawings to my husband and he was impressed and could not believe someone would write about me. Especially the part about not growing up. He says that, according to Sarah Andersen, I am in my mid 20'. Anyway, I really need to get my hands on a paperback copy. If you liked Allie Brosh's Hyperbole and a Half: Unfortunate Situations, Flawed Coping Mechanisms, Mayhem, and Other Things That Happened, you'll love Adulthood is a Myth: A \"Sarah's Scribbles\" Collection.*I thank Sarah Andersen, Andrews McMeel Publishing, and Netgalley for this copy in exchange for an honest review."}, {"userName": "María", "userReviewDate": "Oct 13, 2017", "userURL": "http://www.goodreads.com/user/show/17754092-mar-a", "userReview": "Cuánto me alegra que Sarah Andersen esté en nuestro planeta."}, {"userName": "Florencia", "userReviewDate": "Jul 10, 2016", "userURL": "http://www.goodreads.com/user/show/21575078-florencia", "userReview": "Is adulthood an exciting new challenge for which you feel fully prepared? Ugh. Please go away.\nI was writing down some thoughts for two reviews, one of a Mishima book and the other of The Bell Jar, but at the moment, I don’t feel like dedicating so much time to that kind of introspection, since in my case, reviewing a book is almost never writing a simple summary. So I will deal with all those books next year, while focusing on other works which are also existentially complex but from a different perspective. A very different perspective.In the spirit of the preceding paragraph, I have a shocking revelation to share. I can never participate in the GR Awards. Scandalous, right? I mean, after the Best Poetry debacle, it’s still nice to be able to cast some votes considering that, in general, the most recently published book I have read might have been in the bookshop for twenty years. Another delightful fact I can find in this little adventure regarding the Best Books of 2016 that I almost never pay special attention to: the only book to which I could give my precious and humble vote was Adulthood is a Myth. The irony makes me chuckle. In any case, and in my opinion since not everyone shares my peculiar sense of humor, it was a fun read. The most hilarious, ridiculous, absurd and to some extent, pathetic aspects of life are depicted through comedy and simple, adorable drawings. Andersen's keen ability to perceive different feelings and situations pertaining to the issue of being human and to portray them with such humorous simplicity… it is certainly remarkable. I’m completely enamored with her work and Allie Brosh and her Hyperbole and a Half: Unfortunate Situations, Flawed Coping Mechanisms, Mayhem, and Other Things That Happened now share the podium with lovely Andersen. Classics, poetry, extremely dark and heart-rending books that may or may not have a happy ending are not enough. Books brimful of humor, wit, ludicrous yet common situations and reactions and with silly covers that I don't dare to show in public are also a part of me. They mend what other things have broken. They make reality taste like fiction for a while. This year I spent time on situations that, in the end, didn’t deserve my attention and a million chances. I can search for my lost time but will never get it back. Still, despite giving too much and receiving über-nothing at times, I would like to end this year with a smile. Perhaps, what I consider a flaw is precisely why I should be smiling.This charming book won Best Graphic Novels & Comics. I thought of giving a little speech but, you know.Besides, giving speeches usually precedes a simple meal or large quantities of food and......let’s just not tempt fate. So I wrote this nonsense instead, as I also tell you this: Sarah and I will be back in a few days. For now, I’ll keep reading my books and enjoying one of my valid hobbies. Dec 12, 16* Also on my blog."}, {"userName": "Aneela ♒the_mystique_reader♒", "userReviewDate": "Jan 01, 2017", "userURL": "http://www.goodreads.com/user/show/29923106-aneela-the-mystique-reader", "userReview": "[image error]"}, {"userName": "C.G. Drews", "userReviewDate": "Mar 03, 2016", "userURL": "http://www.goodreads.com/user/show/11375137-c-g-drews", "userReview": "Oh this was just glorious. All bookworms and introverts NEED to read this.  NEEEEED, I TELL YOU. I was just about laughing my head off in companionable fear with the author over adulthood. Adulthood is a myth. And also just ugh. I would happily sign up for a refund, okay? Ahem.So this is a book of 100% comic strips. you've probably seen some of Sarah's Scribbles around the internet. (I have anyway.) But this has a) more, and b) it's just the kinda book you're going to want to slap in extrovert-highly-efficient-adulting-friends'-faces occasionally, okay? Trust me. My favourites were for sure:• the ones about bookworms• the ones about introverts needing to socialise for, like, 5 seconds and then introvert for 9 years• washing clothes...or not washing them...for hundreds of years...• pg 85: which basically was a very VERY accurate 6 block comic representation of the internet• I was cracking up• I WAS LAUGHING THIS WHOLE BOOK IT WAS GLORIOUS.The only con was: it's too short. I could look at these highly relatable comics all day. And, you know, procrastinate adulthood that way."}, {"userName": "Tessy Nightblood Ijachi", "userReviewDate": "Nov 27, 2017", "userURL": "http://www.goodreads.com/user/show/65798982-tessy-nightblood-ijachi", "userReview": "Re-reading this just made me realise just how much I love this book, forever one of my favourites. I don't know how it's possible but I got a whole new experience reading this, even if I've read it before.This was so fun and like so relatable. It felt like i was reading the story of my life.You should read this book if you're a;1. An introvert2. A book lover3. A human beingNeedless to say, I think everyone should read this. It's fun, fast, entertaining and most importantly relatable."}, {"userName": "Kelly (and the Book Boar)", "userReviewDate": "Apr 21, 2016", "userURL": "http://www.goodreads.com/user/show/11183856-kelly-and-the-book-boar", "userReview": "Find all of my reviews at: http://52bookminimum.blogspot.com/Does the following image remind you of yourself????\nIf so, this is probably a book for you. While I’m 1,000 maybe not exactly the target demographic for the Sarah’s Scribbles collection, I still found Adulthood is a Myth to be nearly completely relatable and maybe that I should get a restraining order against the author because it seems like she might be stalking me. I mean, this little diddy covered everything from my laundry habits . . . \nTo my daily experiences on Goodreads . . . \nTo what a telephone conversation between Shelby and myself sounds like . . . \nIt even covered my fear of what will happen if I discover there really is a heaven . . . \nCarol was the Goodreads’ friend who got me to request this one from the library after she said it was for fans of Allie Brosch. Pretty much introverts the world over who hate all other humans should enjoy this one just a little. Added bonus for all the ladies in the house who experience the joy of Aunt Flo’s visit every month . . . . \n(She also has a hilarious one about reaching in your purse when someone asks if you have [insert whatever random item] and 582 tampons come flying out.)If you’re a dude, you may not be able to fully relate, but it’ll shine some light on why your wife hates you more than usual a couple days a month.While this little book was by no stretch of the imagination a huge life changer, it was certainly amusing and I would definitely recommend it."}, {"userName": "April (Aprilius Maximus)", "userReviewDate": "Aug 05, 2016", "userURL": "http://www.goodreads.com/user/show/20658145-april-aprilius-maximus", "userReview": "Never have I related to a book so strongly!"}, {"userName": "Fatima", "userReviewDate": "Mar 02, 2017", "userURL": "http://www.goodreads.com/user/show/48234354-fatima", "userReview": "یکی از بهترین کمیک هایی بود که توی عمرم دیدم و خوندمش ^_^ فوق العلاده با نمک خصوصا جاهایی که تفاوت بین یک دختر نوجوون با جوون رو نشون میده ولی جالبش اینجاست که همیشه یه چیزی هست که یک دختر توی هر سنی بهش اهمیت بده و به اصطلاح سوزنش روش گیر کنه :))سوزن شخصیت کارتنی این کتاب روی چیزهای مشترکی که باهاش دارم حسابی گیر کرده بود و برای همینه که عاشقش شدم مثل :من نمیخوام بزرگ شم ! مامان جان گفتن اینکه همه ی دوستام الان دوتا بچه دارن رو متوقف کن ! پیلیز ! :)) :|آدمی که حالا هستم ...حس من وقتی توی اینستاگرام عکس میذارم :))من , وقتی توی کلاس نقاشی یکی به جز استاد از کارم ایراد میگیره :|حسی که موقع سرچ توی اینترنت دارم :|این آرزوی قلبی منه که وقتی نزدیک ترین دوستم داره از دوست پسرش بد میگه خفه اش کنم ! :))من فکر میکنم یکی از دلایلی که تقریبا بیشتر آقایون در گودریدز کمتر از خانم ها این کمیک رو دوست داشتن اینه که صرفا زندگی یک دختر رو نشون میداد و خب کاملا طبیعی هست که حسش نکنن و ارتباطی با شخصیت دخترونه ی کتاب برقرار نکنن .. خیلی جالبه که حدود 87% شوخی های با مزه ی توی کتاب , در مورد من یکی که کاملا صدق میکرد و کلی لذت بردم از این همه همدلی و اشتراک بین دخترها :)"}, {"userName": "Whitney Atkinson", "userReviewDate": "Jan 14, 2018", "userURL": "http://www.goodreads.com/user/show/14457130-whitney-atkinson", "userReview": "This was so cute and fun! I read it in one sitting and laughed out loud several times, and I definitely took a picture of a few of these comics to send to friends or post on snapchat. As an anxious bookworm, I really connected with parts of it.The only thing I'm not fond of is there's a few times that this book falls into the mentality of \"I hate people!! I want to be alone all the time because I hate every single person I know!!\" and I feel like that's such a Tumblr 2012 mentality that I don't find funny or edgy anymore. Regardless, I definitely invision myself gifting this to another introvert because it's quick and makes you chuckle."}, {"userName": "Megan Johnson", "userReviewDate": "Apr 05, 2017", "userURL": "http://www.goodreads.com/user/show/31853583-megan-johnson", "userReview": "I am veeeerry behind on learning about Sarah Andersen's work. I've seen her comics floating around on social media for years, laughed at them, wondered how such simplistic drawings could be so relatable, and then moved on without giving it so much as a second thought. Then I stumbled upon Adulthood Is A Myth, and now I'm a big fan. Adulthood Is A Myth isn't so much a comic book in that it doesn't tell a continuous story, but it is a book of comics - they are unrelated but well worth reading at once. I found myself sitting by myself in a room giggling like a crazy person because the comics within this book were so cute and charming. For every little drawing, I felt like Sarah had tapped into my inner thoughts and admitted to the truth of growing up that many of us aim to hide. If you're looking for something easy to read that will surely bring you joy and more than a few laughs, I cannot recommend this more. I checked this out on Hoopla via my local public library, but would gladly purchase in the future in order to support the author and encourage her to continue creating such adorable art. What did I think?: I'm a big comic book fan, and while this isn't necessarily telling a story it is cute and fun which is exactly what I was looking for. Who should read it?: EVERYONE, but especially the women who are realizing that the older we get, the more we embrace comfort. WEBSITE | TWITTER | FACEBOOK | INSTAGRAM"}, {"userName": "Agir(آگِر)", "userReviewDate": "Dec 21, 2016", "userURL": "http://www.goodreads.com/user/show/30706760-agir", "userReview": "در اکثر صفحات این کتابِ تازه مشهور شده، بهت زده به این شکلک ها و نوشته ها خیره میشدم و با خودم میگفتم چرا همه لذت بردن و من نه؟به هر حال سلایق متفاوته...فقط چند صفحشو دوس داشتم و مخصوصا اولی که ماجراش تا سنگ قبر هم ادامه پیدا میکنه:)123"}, {"userName": "Foad", "userReviewDate": "Dec 07, 2016", "userURL": "http://www.goodreads.com/user/show/25683251-foad", "userReview": "«این سارا اندرسن قشنگ از رو زندگی من میکشه!»«زندگی‌نامه ی منه گمونم!»«انگار آدم داره فیلم زندگی خودش رو می بینه!!»«بخدا اینا دوربین مخفی تو خونه‌های ما کار گذاشتن که تونستن اینقد واقعی کمیک درست کنن!!»این ها بخشی از ابراز احساسات هاییه که خوانندگان این کمیک کردن! توی اینترنت، از گوگل پلاس تا گروه های تلگرامی هر جا که تونستم بخش هایی از کتاب رو گذاشتم، و همه جا خواننده ها بالاتفاق با این دخترک بانمک کارتونی همذات پنداری کردن، که به قول نویسنده ش \"لحظات ترسناک و ضایع زندگی مدرن\" رو به نمایش میذاره. مجموعه کمیک های \"بزرگسالی افسانه است\" از \"سارا اندرسن\" قبل از این به صورت جداگانه روی اینترنت منتشر می شدن. و ماجرای زندگی هر روزه ی دختری رو روایت می کنن با شکل و شمایل کارتونی، بی اعتماد به نفس، درونگرا، خوره ی اینترنت، که به صورتی طنزآمیز و با نمک، زندگی خودمون رو به خودمون نشون میده. به رغم ادعای طنزآمیز نویسنده که \"این کتاب هیچ ارتباطی با زندگی شخصی نویسنده نداره!\"، به قدری جزئیات کتاب ملموسه، که آدم لحظه ای شک نمی کنه که از روی لحظات واقعی زندگی کشیده شده ن. و همین هم کتاب رو این قدر جذاب می کنه.اگه این خانم که مدام وسط ریویوی من ولو میشه روی زمین اجازه بده، این رو هم اضافه کنم که چند روز پیش داشتم کتاب های برگزیده ی امسال گودریدز رو میدیدم که ببینم محض رضای خدا اسم یکی شون رو شنیدم یا نه! (اسم هری پاتر و کودک نفرین شده رو شنیده بودم فقط!) و دیدم این دختر هم بین کتاب های برگزیده است! خوشحال از این که کمیک های پراکنده به یک کتاب تبدیل شده، فوری رفتم به لیبجن و دانلودش کردم، و سه روز باهاش خندیدم."}, {"userName": "Mohadese", "userReviewDate": "Jun 25, 2017", "userURL": "http://www.goodreads.com/user/show/38061821-mohadese", "userReview": "خیلی خیلی خیلی قشنگ بود :))) احساس می کنم هرچی بگم اسپویلش میکنم کتابیه که باید بخونیدش و بخندیدچون خیلی باهاش همذات پنداری می کردم و خیلی جاها درکش میکردمواقعا طنز بود، هم اجتماعی هم خنده داربعدن نوشت: از خوندن این کتاب بسیار ذوق زده ام."}, {"userName": "Nazanin", "userReviewDate": "Jul 02, 2017", "userURL": "http://www.goodreads.com/user/show/39893246-nazanin", "userReview": "4.5 \"Fun-But-Real\" StarsFirst of all, I’d like to thank my dear friend Mohadese for this recommendation! So thank you hun! Second, I loved it! I had so much fun with this book! I didn’t read any graphic novels (I didn’t think there is something that can attract my attention but oh boy, how I was sooo wrong!) and it was my first but such an awesome read! It was fun but at the same time it was sooo real! All of it! all the emotions, all the what we Must do and at the end what we do! Oh, God I really laughed out laud at this book. I recommend it to all of you guys! It doesn’t have any age limit. All of you can read it and I’m sure all of you will enjoy it. It just takes 2 hours of your time, tops! But it’s really worth reading!"}, {"userName": "Ahmad Sharabiani", "userReviewDate": "Jan 29, 2017", "userURL": "http://www.goodreads.com/user/show/614778-ahmad-sharabiani", "userReview": "Adulthood Is a Myth: A \"Sarah's Scribbles\" Collection, Sarah Andersenعنوانها: بزرگسالی آش دهنسوزی نیست؛ بزرگ شدن خواب و خیاله؛ نویسنده: سارا اندرسون؛ تاریخ نخستین خوانش: هجدهم ماه مارس سال 2017 میلادیعنوان: بزرگسالی آش دهنسوزی نیست؛ نویسنده: سارا اندرسون؛ مترجم: مرجان حمیدی؛ تهران، کتابسرای تندیس؛ 1396؛ در 107 ص؛ مصور، فروست: خط خطی های سارا؛ شابک: 9786001823251؛ موضوع: داستانهای فکاهی و تصویری نویسندگان امریکا - قرن 21 معنوان: بزرگ شدن خواب و خیاله؛ نویسنده: سارا اندرسون؛ مترجم: آروشا زاده امیدی؛ تهران، منتشران اندیشه؛ 1396؛ در 107 ص؛ مصور، فروست: خط خطی های سارا؛ شابک: 9786007485668؛ ا. شربیانی"}, {"userName": "Maede", "userReviewDate": "Dec 07, 2016", "userURL": "http://www.goodreads.com/user/show/28210578-maede", "userReview": "از لحظه ای که شروعش کردم دائم صفحه هارو نگاه می کردم که فقط تموم نشه! عجیب دوستش داشتم. شخصیت کارتونی به شدت کیوت و هر صفحه ای یه تجربه کوچیک خاص بود که تو ذهنت می گفتی \"وای... می دونم چی میگی!\" و یه اتفاق یادت می افتادقدرت عجیبش برای اینکه با صفحه های کم و سیاه سفیدش لبخند از رو لبم محو نشه باعث شد به سختی بهش پنج رو ندم با اینکه بعضی وقتا وظیفه یک کتاب شاید فقط همین حس خوبهکتاب تجربه های روزمره و در ظاهر بی اهمیت مشترک بین معمولی های عجیب دنیاست، مخصوصاً دخترها. تجربه \"بزرگ\" شدنی که انگار هیچوقت نمی رسهاگر می خواستم تیکه هایی که دوست داشتم رو بزارم باید همش رو می گذاشتم، برای همین کل فایل رو گذاشتمhttp://s9.picofile.com/file/827759757...95.9.17"}, {"userName": "Glire", "userReviewDate": "Feb 16, 2016", "userURL": "http://www.goodreads.com/user/show/7227066-glire", "userReview": "It is a truth universally acknowledged, that if you are socially awkward, you're going to feel identified with this book.Sarah Andersen captures in simple and funny comics, the essence of being awkard and what growing up is all about......avoiding old classmates!"}, {"userName": "Khadidja", "userReviewDate": "Dec 24, 2016", "userURL": "http://www.goodreads.com/user/show/21493936-khadidja", "userReview": "Hilarious, relatable short book! :D"}, {"userName": "HFK", "userReviewDate": "Dec 27, 2016", "userURL": "http://www.goodreads.com/user/show/52263626-hfk", "userReview": "Oh shit,like with the Hyperbole and a Half, I am almost all by myself sitting here, in the corner of \"I don't get it\". I am again completely unable to understand all the hype, all the fuss, all the praise, and most definitely cringe when savoring the thought of Adulthood Is a Myth being the winner of Graphic Novels & Comics category here at Goodreads. In fact, when I look at the runner ups, I just want to facepalm my face off to the idea of all the wonderful talent, not just with writing but with beautiful art, that have been overshadowed by the simple cartoon strips that has been done countless of times before. That ain't right, and it ain't an attack toward this work, but an attack toward Goodreads categories.Adulthood Is a Myth is not something that really resonates with me. Adulthood has never been a problem to me, I have never felt the pressure of it, I have never felt the need to justify my actions or my way of living. There is a lot of elements in my life that speaks volumes of the fact that I am an adult, as in having responsibilities, but there is a lot of aspects that are dealt within this work that should, apparently, cause distress. I sleep too little as I love to be up late, and with having kids, have very little possibilities to sleep late. But when the kids get older, I am able to nod off as I please, which is pretty much the case now. I take naps almost daily, I spend most of my days in pajamas. I play with my kids toys, I play video games, I keep movie marathons where I spend 24 hours in front of my TV screen or in front of my projector's wall screen. When the family goes out, I lay on my ass all day long, reading or watching telly. I eat what I want, I exercise whenever I want to. I do not have a good relationship with authority of any kind, but rebel at every chance I get. I very rarely participate to things that would be \"necessary\" as an adult, as an parent. I only like my own kids, other kids are just annoyance in middle of my peace. In reality, I am as selfish than I was at the age of fifteen despite of living \"like an adult in an adult life\". I like being by myself as much as I ever have, which is pretty much all the time. I just never knew I should actually stress over it, and maybe write poorly witty comics of it. I always learn more, everyday. But, there is something I wish more women would stop doing. Honestly, this is so uncool, so useless, so insecure that it turns to ugly faster than I can write it down. And it is pretty much this:Yeah, I just don't get Adulthood Is a Myth, but being an adult means I do not even have to. How fucking cool is that."}, {"userName": "Farith", "userReviewDate": "Jan 14, 2017", "userURL": "http://www.goodreads.com/user/show/31454912-farith", "userReview": "Have you ever been in that kind of situation where you felt too awkward or embarrassed and all you wanted is to be buried alive? That feeling when you are the only one in your kind, the rare of the group or the \"different one\"? Are you reading this as if you with that old classy commercial voice? Well then let me tell you that this book is for you if you answered yes! And if you said no, then maybe you're not making into adulting, or you're a really boring one.Sarah Andersen did an incredible job portraying my life into this book as a graphic novel. I felt identified in every single page. Every. Single. One.When I was a kid the thing I most wanted was to grow up, now I regret a little having wished that, you know? Now that I have to face adulting, college and all that crap I am FREAKING OUT. I can't stand the idea of living alone and having to do everything by my own. ALONE. I know, adulting is scary and everything but we have to step forward the future, don't we? *Me \"trying\" to accept adulting*First stop, my life communication.As a boy with many trust issues when I was growing up, I was the worst at communicating and this happened me a lot. As an almost-adult, uhm, yeah I don't think I have improved. Am I the only one who does this:? (Please don't make me think I'm a crazy stalker haha)And the part I loved the most about this book: Bookworms issues while being an adult."}, {"userName": "Carole (Carole's Random Life in Books)", "userReviewDate": "Dec 30, 2015", "userURL": "http://www.goodreads.com/user/show/5892196-carole-carole-s-random-life-in-books", "userReview": "This review can also be found at Carole's Random Life.It has been ages since I picked up a book of comic strips. I saw a couple of positive remarks about this book and grabbed it immediately. Once I started reading these comics, I couldn't put the book down. I had never seen the Sarah Scribbles character before and was really excited to see what this was all about.I was surprised by how much I was able to related to this funny little book of comics. There were entries about books, being an introvert, clothes, and all kind of little things that come up in life. Some of the comics made me glad that I am not the only one that has noticed some of these things. These were comics that I found myself constantly sharing with my husband. He likes it when I try to make reading a group sport.The artwork in this book wasn't complex but it worked well. I think that art really was perfect to illustrate this imperfect little character. I would recommend this wonderful book of comics. I think just about everyone can find something amusing in this awesome little book. I will be keeping my eye out for other Sarah Scribbles adventures.I received an advance reader edition of this book from Andrews McMeel Publishing via NetGalley for the purpose of providing an honest review.Initial ThoughtsSuch a fun little book of cartoons. It put the smile on my face that I needed to day.Full review to be posted soon."}, {"userName": "Heidi The Hippie Reader", "userReviewDate": "May 05, 2017", "userURL": "http://www.goodreads.com/user/show/7986781-heidi-the-hippie-reader", "userReview": "An utterly charming collection of simple cartoons which illuminate some of life's undeniable truths.For example, thinking about putting on your pajamas all day and then the joy of actually doing so.Or considering being productive but then laying around on the couch in a stupor.Totally relatable and reminiscent of I Was a Child by Bruce Eric Kaplan, Adulthood is a Myth is for anyone who tries to be a normal, functional adult but doesn't succeed. And isn't that all of us?"}, {"userName": "Jessi ♥️ H. Vojsk", "userReviewDate": "Dec 04, 2017", "userURL": "http://www.goodreads.com/user/show/66224803-jessi-h-vojsk", "userReview": "What can I say? I love Sarah Scribbles Comics. I always loved them, like since forever (or since I found them on the Internet). I follow her on Facebook, on Instagram and now my wonderful boyfriend bought me her comics (super early christmas present...). And I totally love them. There are soooo relatable and through the whole book I'm like \"That's me.\" \"Totally me.\" \"Yep, me.\""}], "description": "Oletko ihan päällikkö ja spessu tyyppi?Ovatko verkostoitumistilaisuudet ihania mahdollisuuksia edistää uraasi?Onko aikuisuus jännittävä haaste, johon koet olevasi hyvin valmistautunut?Tämä kirja ei ole sinua varten.Tämä kirja on meille muille. Oheisissa sarjakuvissa tuhlataan koko kaunis viikonloppu pyörimällä netissä, tuskaillaan komistuksen kanssa käsikkäin kulkemisen sietämättömiä vaikeuksia, haaveillaan päivät pitkät hetkestä, jolloin pääsee kotiin jatkamaan pyjamahengailua, ja aprikoidaan, milloinkohan se paljon puhuttu aikuisuus mahtaa alkaa. Tiedossa on siis tunnontarkkaa dokumentointia nuoren aikuisen elämään liittyvistä kauhuista ja kiusallisista tilanteista.Sarah Andersen on nuori taiteentekijä New Yorkin Brooklynistä. Kirja ei ole missään määrin omaelämäkerrallinen. Siis ei kertakaikkiaan missään määrin.", "title": "Aikuisuus on myytti\n      \n          (Sarah's Scribbles #1)", "url": "http://www.goodreads.com/book/show/36424193-aikuisuus-on-myytti", "average": 4.13, "cover": "https://images.gr-assets.com/books/1508178825l/36424193.jpg", "reviews": 4560, "authors": [{"url": "https://www.goodreads.com/author/show/14144506.Sarah_Andersen", "name": "Sarah Andersen"}, {"url": "https://www.goodreads.com/author/show/13622658.Aura_Nurmi", "name": "Aura Nurmi"}], "type": ["Sequential Art", "Humor", "Sequential Art", "Nonfiction"], "outlinks": ["http://www.goodreads.com/book/show/36424193-aikuisuus-on-myytti", "http://www.goodreads.com/book/show/25855506-adulthood-is-a-myth", "http://www.goodreads.com/book/show/28589527-adulthood-is-a-myth", "http://www.goodreads.com/book/show/31927662-sarah-s-scribbles", "http://www.goodreads.com/book/show/30754980-big-mushy-happy-lump", "http://www.goodreads.com/book/show/35924705-herding-cats", "http://www.goodreads.com/book/show/28177884-sarah-s-scribbles", "http://www.goodreads.com/book/show/34383825-sarah-s-scribbles-2017-2018-16-month-weekly-monthly-planner", "http://www.goodreads.com/book/show/38897088-sarah-s-scribbles-2018-2019-16-month-monthly-weekly-planner-calendar"]}