{"ratings": 327625, "userreviews": [{"userName": "Austin", "userReviewDate": "Feb 10, 2008", "userURL": "http://www.goodreads.com/user/show/894544-austin", "userReview": "Every child eventually discovers the perverted old man who wrote songs for Johnny Cash, did illustrations for Playboy, appeared on the Dr. Demento show numerous times, and managed to get a few books published along the way. For some reason, parents never seem to think this creepy old guy who was so fond of children was in any way \"disturbing,\" something I'm continually impressed with in the \"ban now, ask questions later\" climate of modern culture. If there are people who don't like Shel Silverstein, I don't want to meet them. Or, more to the point, you shouldn't meet them if that is an option. Children need to experience this kind of creepy / weird / funny / sad stuff, not just for their own sake, but for the sake of having a conduit through which they can make sense of most of the rest of the world. Knowing that Shel sees things this way, too, makes it all easier to take, and makes your own oddness that much more tolerable. We, as humans, need to come to terms with inexplicable and unfathomable in the world, and it wasn't until Shel that we began to realize that the only way to gently help our children do just that, is to let a perverted old weirdo with a large stack of Playboys in his basement lead the way."}, {"userName": "Anna M.", "userReviewDate": "Jan 09, 2016", "userURL": "http://www.goodreads.com/user/show/28315413-anna-m", "userReview": "2016 Genre Challenge: Poetry"}, {"userName": "Janine", "userReviewDate": "Apr 06, 2007", "userURL": "http://www.goodreads.com/user/show/51260-janine", "userReview": "The feelings I have about Shel Silverstein's A Light in the Attic and Where The Sidewalk Ends contrast so sharply with the books themselves. I loved these funny, whimsical and sometimes downright sadistic poems with all of my young heart. Even now, I feel like I'm getting away with something when I think of Clarence Lee from Tennesee who loved the commercials he saw on TV. I am still afraid for Ickle Me, Pickle Me, Tickle Me too who never returned to the world they knew. In Shel Silverstein's books I found all of my childish wishes drawn out to their natural, absurd conclusions. But I was also given a glimpse of the way that language could create beauty and inspire wonder, for we have some flax-golden tales to spin. Come in! Come in! I never guessed how a bald, bearded, barefoot man with a guitar could read my mind. It is not too much to say that I revere both works. Which is not the point of these poems at all."}, {"userName": "Emily May", "userReviewDate": "Oct 26, 2012", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "“Do a loony-goony dance 'Cross the kitchen floor, Put something silly in the world That ain't been there before.”"}, {"userName": "Ronyell", "userReviewDate": "Jan 07, 2010", "userURL": "http://www.goodreads.com/user/show/1169488-ronyell", "userReview": "“A Light in the Attic” is one of Shel Silverstein’s best yet most controversial books of poems ever written. This book is full of poems about clowns, pirates, monsters and all manner of strange people and animals doing crazy things. “A Light in the Attic” may be too suggestive and morbid for smaller children, but older children will easily delight themselves with the silly shenanigans of the characters. Shel Silverstein’s writing is as witty as it is funny as he writes each character’s stories in a poetic prose. One of the funniest poems I have read was “Squishy Touch” when the main character turns everything into Jell-O. Shel Silverstein’s illustrations are highly creative as the images make the characters look scratchy and also I love the images being presented in black and white colors, a technique that is usually used for long books. The image that probably stood out the most was the image of the Gink as it has a large mouth with sharp teeth and the image of the kids coming out of the Gink on the next page. Parents should know that there are some suggestive and morbid content in this book that young children might not understand. One poem that might be too suggestive for children would be the poem “How not to have to dry the dishes” as it entices children to break the dishes in order not to dry them. Another poem that might be too morbid for children would be “Little Abigail and the Beautiful Pony” as it deals with the death of a child and parents might want to explain to their children about the concept of death before they read this poem. “A Light in the Attic” is an excellent book about silly poems about silly people who do crazy stunts and it will surely be an instant for many children young and old. I would recommend this book to children ages six and up since smaller children might be a bit disturbed by the suggestive and morbid content displayed in this book. Review is also on: Rabbit Ears Book Blog"}, {"userName": "Valerie", "userReviewDate": "Oct 25, 2007", "userURL": "http://www.goodreads.com/user/show/543625-valerie", "userReview": "Recently, I started re-reading A Light in the Attic with my younger daughter, who's four-and-a-half. I think when I first read it I must have been about eight or nine years old, because I remember reading it myself, and loving it. (I must have checked it out of the library about a million times.) What's not to love? Shel gives us such gems as:BEAR IN THEREThere's a Polar BearIn our Frigidaire--He likes it 'cause it's cold in there.With his seat in the meatAnd his face in the fishAnd his big hairy pawsIn the buttery dish,He's nibbling the noodles,He's munching the rice,He's slurping the soda,He's licking the ice.And he lets out a roarIf you open the door.And it gives me a scareTo know he's in there--That Polary BearIn our Fridgitydaire.andHOT DOGI have a hot dog for a pet,The only kind my folds would let Me get.He does smell sort of badAnd yet,He absolutely never getsThe sofa wet.We have a butcher for a vet,The strangest vet you ever met.Guess we're the weirdest family yet,To have a hot dog for a pet.Of course, she loves almost all of the poems. And I'd forgotten that the wonderful illustrations were also by Silverstein. One word of caution for parents reading to younger kids: some of the poems do deal (albeit in a silly way) with issues such as drowning (in your own tears), getting kidnapped (by a Wild Barbazzoop), and Ticklish Tom (who unfortunately giggles his way onto a railroad track). Small matters, surely, but good to know when you're reading something to your child that's slightly over their head in terms of age-appropriateness. It's nice to be prepared for the moment just after you've finished reading, and your little one turns to you and says, \"Mommy, what's kidnapping?\""}, {"userName": "Gauri", "userReviewDate": "Dec 16, 2016", "userURL": "http://www.goodreads.com/user/show/3760321-gauri", "userReview": "I read a little bit from this book everyday to my younger brother this past week. I can't remember if I finished this myself in my own childhood, but it felt like I read it for the first time, so I'll put this in the list of books I read this year. This is a book full of poems about jokes or about little lessons presented in comical ways. It gets little kids thinking and gets them interested about deeper thinking. Definitely a must-read for children!"}, {"userName": "N.N. Light", "userReviewDate": "Sep 29, 2017", "userURL": "http://www.goodreads.com/user/show/23234551-n-n-light", "userReview": "Why I love it: Really? This is a banned book? Somewhere, Mr. Silverstein is shaking his head sadly. It’s a hilarious book of illustrations and poems. Silly poems. Its message is clear: use your imagination, laugh often and your life will be good. It promotes kindness, goodness and understanding. There’s nothing wrong with that.My Rating: 5 stars"}, {"userName": "DJ Harris", "userReviewDate": "Mar 27, 2013", "userURL": "http://www.goodreads.com/user/show/18766325-dj-harris", "userReview": "Need to feel like a kid again? Cozy up with this humorous and whimsical book of poetry. Kids of all ages are sure to enjoy Shel Silverstein's fanciful word play in this amusing collection.Besides reading this book myself, I also purchased a copy of this book for my children and grandchildren. It is a good book to get your children into reading. I HIGHLY RECOMMEND this book!\nExcerpt:\"Somebody Has ToSomebody has to go polish the stars,They’re looking a little bit dull.Somebody has to go polish the stars,For the eagles and starlings and gullsHave all been complaining they’re tarnished and worn,They say they want new ones we cannot afford.So please get your ragsAnd your polishing jars,Somebody has to go polish the stars.\""}, {"userName": "Stephen", "userReviewDate": "Jul 29, 2010", "userURL": "http://www.goodreads.com/user/show/1413439-stephen", "userReview": "4.0 to 4.5 stars. One of those books that can be enjoyed by children and adults depending on how deeply you dive into the meaning of the stories. Incredibly imaginative and very well done."}, {"userName": "Neda", "userReviewDate": "Apr 04, 2015", "userURL": "http://www.goodreads.com/user/show/9984116-neda", "userReview": "\"The saddest thing I ever did seeWas a woodpecker peckin' at a plastic tree. He looks at me, and \"Friend,\" says he,' \"Things ain't as sweet as they used to be.\"While reading I noticed that I've had read it long ago.. But I just couldn't stop! I just love Shel!"}, {"userName": "Sarafina b.", "userReviewDate": "Feb 24, 2016", "userURL": "http://www.goodreads.com/user/show/46884715-sarafina-b", "userReview": "Oh my! I remember how much I loved to read these poems back in elementary school! Such good memories, I NEED to own this."}, {"userName": "Ammara Abid", "userReviewDate": "Dec 05, 2016", "userURL": "http://www.goodreads.com/user/show/20790913-ammara-abid", "userReview": "Absolutely brilliant. Every time I read it, every time I love it more. Many poems are my favorite, I can't write all of them here but couldn't resist myself sharing these two,The Nailbiter Some people manicure their nails, Some people trim them neatly, Some people keep them filed down, I bite ’em off completely. Yes, it’s a nasty habit, butBefore you start to scold,Remember, I have never ever Scratched a single soul.Zebra QuestionI asked the zebraAre you black with white stripes?Or white with black stripes?And the zebra asked me,Are you good with bad habits?Or are you bad with good habits?Are you noisy with quiet times?Or are you quiet with noisy times?Are you happy with some sad days?Or are you sad with some happy days?Are you neat with some sloppy ways?Or are you sloppy with some neat ways?And on and on and on and onAnd on and on he went.I'll never ask a zebraAbout stripesAgain."}, {"userName": "Rachel", "userReviewDate": "Jul 04, 2010", "userURL": "http://www.goodreads.com/user/show/3935007-rachel", "userReview": "Shel Silverstein was the author of my childhood, and I was surprised to find that, in (sort of) adulthood, A light in the Attic hasn't lost any of its charm. In fact, I've discovered new layers of humor and meaning I couldn't have processed when I was eight. I credit Shel Silverstein with my early love of poetry and, ultimately, literature. Recommend to anyone at any age, but a GREAT gift for a godson/ goddaughter, niece/ nephew, etc.. They'll cherish it forever!"}, {"userName": "Amirmohammad Ghorbani", "userReviewDate": "Dec 15, 2017", "userURL": "http://www.goodreads.com/user/show/55576549-amirmohammad-ghorbani", "userReview": "به نظرم، دو شعر Deaf Donald و‌ Ations (ترجمه شده: شعری در باب مفاعله) بسیار جالب هستند."}, {"userName": "Rebecca McNutt", "userReviewDate": "May 20, 2016", "userURL": "http://www.goodreads.com/user/show/36977686-rebecca-mcnutt", "userReview": "I really liked A Light in the Attic, and its oddly-optimistic style and cheerful little illustrations. A few of the poems were a little vulgar, which I didn't enjoy, but otherwise this is a great book that both adults and kids can have fun reading."}, {"userName": "Cathy", "userReviewDate": "Oct 01, 2007", "userURL": "http://www.goodreads.com/user/show/442577-cathy", "userReview": "Shel Silverstein was misunderstood.He was a genius, but not an evil one. Just a hilarious one.His books are looked at with suspicion. But shouldn't be, because they are full of fun, pun, and literate value. Here is why this one was challenged by others, however:\"features a caricature of a person whose nude behind has been stung by a bee; the poem 'Little Abigail and the Beautiful Pony' is morbid; imparts a 'dreary' and 'negative' message; encourages kids to break dishes so that they won't have to wash them; suggestive illustrations; glorified Satan, suicide, cannibalism, and also encouraged children to be disobedient; suggests drug use, the occult, suicide, death, violence, disrespect for truth, disrespect for legitimate authority, rebellion against parents; behavior abusive to women and children, suicide is the best way to manipulate parents; mockery of God; selfish and disrespectful behavior; very vile; contained subliminal messages\""}, {"userName": "Ahmad Sharabiani", "userReviewDate": "Jul 28, 2010", "userURL": "http://www.goodreads.com/user/show/614778-ahmad-sharabiani", "userReview": "A Light in the Attic, Shel Silversteinعنوان: نوری در اتاق زیر شیروانی؛ نویسنده: شل سیلورستاین؛ مترجم: حمید خادمی؛ مشخصات نشر: تهران، کتاب پنجره، چاپ دوم 1380، در 197 ص، مصور، شابک: 9649225757؛ فارسی انگلیسی؛ کتاب پیشتر با عنوان «فانوس زیرشیروانی» توسط انتشارات کیا در سال 1378 با ترجمه فاطمه جعفرزاده در 48 ص با شابک: 9649219390؛ منتشر شده استموضوع: شعر برای کودکان و نوجوانان از نویسندگان امریکایی، ترجمه شده به فارسی، قرن 20 معنوان: چراغی در زیر شیروانی؛ نویسنده و تصویرگر: شل سیلورستاین؛ مترجم: طوبی یکتایی؛ مشخصات نشر: تهران، تندیس، 1379، در 127 ص، مصور، شابک: 9649198431؛عنوان: چراغی زیر شیروانی؛ نویسنده: شل سیلور استاین؛ مترجم: رضی خدادادی (هیرمندی)؛ مشخصات نشر: تهران، هوای تازه، 1383، در 200 ص، مصور، شابک: 9647222874؛"}, {"userName": "Nabila Tabassum Chowdhury", "userReviewDate": "Jun 11, 2015", "userURL": "http://www.goodreads.com/user/show/25360324-nabila-tabassum-chowdhury", "userReview": "এই বইটা বেশ অনেকদিন ধরে একটু একটু করে পড়ছিলাম। পাগলামির একশেষ। অদ্ভুত একটা বই। উদ্ভট সব কনসেপ্ট। আজগুবি সব ছবি। তবুও আমার অনেএএএএক ভাল লেগেছে। পোয়েম গুলো মূলত ননসেন্স পোয়েম। কিন্তু বেশ অনেকগুলোরই ইনার ডেপথও আছে। বইয়ের প্রায় দেড়শ পোয়েমের মাঝে দুই/একটা পোয়েম নিয়ে আমার আপত্তি থাকলেও সেটার জন্য একটা তারা কেটে দেয়াটা উচিত হবে না বলেই মনে হল।ফাইনাল পরীক্ষার স্ট্রেসফুল কয়েকটি সপ্তাহ জুড়ে স্ট্রেস ভুলে কিছু সময় দাঁত বের করে হেসে কাটানো গেল এই বইটা থাকাতে। ধন্যবাদ শেল সিলভারস্টাইন। আপনাকে আমি ইংরেজি ভাষার সুকুমার রায় বলে ঘোষনা দিলাম! :D"}, {"userName": "Beth", "userReviewDate": "Aug 02, 2007", "userURL": "http://www.goodreads.com/user/show/234623-beth", "userReview": "Picture this,I am 7,its Christmas and all the gifts are wrapped and under the tree.I could see through the wrapping paper a faint outline of the cover of A Light in the Attic.I begged.I screamed.I was not allowed to open the present even though I knew what it was.But... I still have the original copy and read it to my son and because of my harrowing experience I love this book even more."}, {"userName": "Luke Lafountain", "userReviewDate": "Apr 06, 2008", "userURL": "http://www.goodreads.com/user/show/554315-luke-lafountain", "userReview": "I am going to start out by saying I really loved this book. i have been getting into poems lately so i decided to read this. There really is no main story but is just a collage of poems. It is primarily meant for children but the values expressed in it are one everyone should know-no matter what age. Everything is pretty direct and simple so its not a chore to read. This is a very simple book that i think everyone should read."}, {"userName": "Kennedyf froehlich", "userReviewDate": "Nov 30, 2017", "userURL": "http://www.goodreads.com/user/show/70987594-kennedyf-froehlich", "userReview": "Usually I don't like poetry books that much. I find them kind of boring. This book though was really good. I love Shel Silverstein's books and I plan on reading some of the others. This book is would be good for 3rd-6th graders. I like this book a lot better than any other poetry books I've read before. This book has a lot of interesting poems in it like Adventures of a Frisbee and It's all the same to the Clam."}, {"userName": "Kathryn", "userReviewDate": "Nov 24, 2017", "userURL": "http://www.goodreads.com/user/show/3076351-kathryn", "userReview": "A load of fun to read these poems. I can see how they might be considered a little subversive by some and can see how they banned this book for a little while somewhere! I'd buy this for all my little relations no problem."}, {"userName": "Jillian Haro", "userReviewDate": "Jun 08, 2016", "userURL": "http://www.goodreads.com/user/show/51675235-jillian-haro", "userReview": "These poems are so much fun! They talk about life in a very humorous way. And some of the poems are actually very profound, but simple to read. I loved it."}, {"userName": "Elyse", "userReviewDate": "May 03, 2014", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "Awwwwwwwwwwwwwwwwwwwwwww!!!! When I saw my Goodreads friend 'post' she read this book, I smiled BIG time!!!!!!!!!!!!!!"}, {"userName": "عبير عبدالواحد", "userReviewDate": "Mar 21, 2018", "userURL": "http://www.goodreads.com/user/show/43686474", "userReview": "ماذا لوفي الليلة الفائتة وأنا متمدد غارق في التفكيرزحفت سلسلة من \"ماذا لو\" إلى أذنيوراحت تثِبُ وتحتفلُ طيلة الليلوتشدو أغنيتها \"الماذا لو\" القديمة:ماذا لو كنت غبيا في المدرسة؟ماذا لو أغلقوا بركة السباحة؟ماذا لو أُوسِعتُ ضربا؟ماذا لو كان هناك سمّ في فنجاني؟ماذا لو أجهشتُ بالبكاء؟وماذا لو مرضتُ ومتُ؟وماذا لو فشلت في الاختبار؟وماذا لو نبت لي شعر أخضر على صدري؟وماذا لو لم يحببني أحد؟وماذا لو صعقتني كرة البرق؟وماذا لو لم أطوَل؟ماذا لو صغُرَ رأسي؟وماذا لو أن السمكة لا تعض الطعم؟وماذا لو مزقت الريح طائرتي الورقية؟وماذا لو شنّوا حربا؟وماذا لو تطلّق والداي؟وماذا لو تأخر الباص؟وماذا لو نَمَت أسناني معوجة؟وماذا لو مزقتُ بنطالي؟وماذا لو لم أتعلم الرقص؟سرت الأمور على نحو رائعومن ثم،عاودت سلسلة الماذا لو الليلية هجومها ثانية! **صلوات طفل أنانيالآن أستلقي للنوم،وأدعو الله أن يحفظ روحيوإذا ما مت قبل أن أفيقأسأل الله أن تتحطم ألعابيحتى لا يستخدمها أحد من الأطفال من بعديآميننصوص بنكهة الدهشة الأولى.. غضّة.. مرحة كملاعب الطفولة.."}, {"userName": "Sam Kuntz", "userReviewDate": "Apr 17, 2017", "userURL": "http://www.goodreads.com/user/show/51612259-sam-kuntz", "userReview": "I read this book with everyone else in the family besides my older sister and my dad. I always like the Shel Sliverstine books that we get from the library but they are all a little disturbing.That said I have many favorite poems like What Did? and Messy Room (I can relate.) I like all the poems (even if some of them are disturbing.) There are many ways to read this book ad the main to it is 50 poems at a time. All the poems mean something different to me. All that to say I hope you read this book."}, {"userName": "Michael Strode", "userReviewDate": "May 21, 2011", "userURL": "http://www.goodreads.com/user/show/1504852-michael-strode", "userReview": "In the pantheon of literature shaping my nascent creative flicker, Shel Silverstein remains a master of lunacy and language. Long after losing my appetite for R.L. Stine's \"Fear Street\" or the frightful suspense of Alvin Schwartz' \"Scary Stories to Tell in the Dark\", Silverstein's whimsical passages continue to invoke nostalgic and thoughtful reflection. Of \"The Giving Tree\", my mother echoes the undeviating refrain that it is a woeful fable of an ungrateful child and a loving, long suffering parent. I respond with a nod of agreement and apology having learned better than to quarrel with her interpretation of that particular work.\"I've discovered a way to stay friends forever--There's really nothing to it.I simply tell you what to doAnd you do it!\" ~ FriendshipHis deeply imaginative ideas combined with a rich awareness of words to craft a collection of clever cerebral exchanges. Silverstein chose not to endeavour making sense of the utter nonsense which exists in the dreams of children. In his poems and illustrations, there resides an inquisitive surreality of characters and circumstances which are at times morbid, silly, unusual, somber, capricious, self indulgent or inappropriate. That array of attributes represented a wider spectrum than most children's literature of his era had considered yet all were qualities of which any child might be possessed.\"I shot an arrow toward the sky,It hit a white cloud floating by.The cloud fell dying to the shore,I don't shoot arrows anymore.\" ~ ArrowsIn spite of resolute parental naivete on our part, children are not yet whole beings. They are evolving and developing with each new insight which should arise. Why should they not be given the full palette of human emotion in which to dabble their paintbrush while there remains a steady hand to guide their intentions? Silverstein recognized children were smarter than adults acknowledged and wrote images filled with riddles, trap doors and passageways into the unknown.If confusion arose as to the meaning of any given story, there was no discernible moral interpretation at the end. He trusted that children could ask questions and sort out those quandaries on their own. What if they could send away in the mail for a new set of parents as does the young man in \"Clarence\"? Is it such a terrifying thought that every child might at some moment dislike their parents? Or desire to join the UCR (Union for Children's Rights) and dispense with performing chores until their demands are met?\"Now I lay me down to sleep,I pray the Lord my soul to keep,And if I die before I wake,I pray the Lord my toys to break,So none of the other kids can use them...Amen.\" ~ Prayer of the Selfish ChildSilverstein wrote in the tradition of the grand triumvirate alongside Seuss and Sendak. Authors of juvenile literature who were unafraid to stretch and layer their passages into the space of fascination and fantasy. Could those arcane worlds engaged in Harry Potter or \"The Hunger Games\" exist without the precedent laid by the dragon of Grindly Grun, the Gooloo bird or the quick digesting Gink?Silverstein can be an especially difficult read when one has spent a lifetime having their language skills battered into shape by each gruesome guardian of the English oral tradition. His random meter and loose leaning prose lead one to imagine they are reading another language entirely. I surely realize now that he inspires the same wonder and bewilderment as deciphering Pablo Neruda in Spanish. Perhaps this is the greatest gift Silverstein leaves behind in these writings. A self contained language filled with a meaning and clarity all its own which will be accessed only when you rediscover the precocious, curiosity you brought to the book as a child exploring literature for the first time."}, {"userName": "Amber Adams", "userReviewDate": "Apr 22, 2013", "userURL": "http://www.goodreads.com/user/show/13140108-amber-adams", "userReview": "One picture puzzle pieceLyin’ on the sidewalk,One picture puzzle pieceSoakin’ in the rain.It might be a button of blueOn the coat of the womanWho lived in a shoe.It might be a magical bean,Or a fold in the redVelvet robe of a queen.It might be the one little biteOf the apple her stepmotherGave to Snow White.It might be the veil of a brideOr a bottle with some evil genie inside.It might be a small tuft of hairOn the big bouncy bellyOf Bobo the Bear.It might be a bit of the cloakOf the Witch of the WestAs she melted to smoke.It might be a shadowy traceOf a tear that runs down an angel’s face.Nothing has more possibilitiesThan one old wet picture puzzle piece.~Shel SilversteinIn this poem, Shel Silverstein used very descriptive language when describing the puzzle piece. He extends his sentences to give the story more details. He begins to make the story person when he mentioned specific names that are familiar to his readers. (Snow White, witch of the west and Bobo Bear) He uses allusions to draw the readers in and allows them to form a personal connection with the poem.I believe the author did a great job using the elements of writers craft. His words paint detailed pictures in the readers'. When he described the possibilities of the puzzle piece, he describes each detail of the puzzle in that stage. While reading I noticed that Silverstein is using a specific \"country\" dialect to tell the poem. I love how Silverstein uses the country tone to tell the poem. He also incorporates the popular characters to pull the readers in. Silverstein must “study through research” (pg. 109, Ray) to draw readers into the poem. It seems like Silverstein had to do some research in order to create an authentic poem.I would use this book in my classroom to teach students how to write descriptive poems or stories. the author uses so much needed details in this poem. I would introduce the poem with the descriptive words and later with out the descriptive words to show the students how important the descriptive words are. I will also teach my student show to include allusions in their writing."}, {"userName": "Carrie", "userReviewDate": "Mar 15, 2008", "userURL": "http://www.goodreads.com/user/show/721877-carrie", "userReview": "I used this book for a talent show in Jr High. I don't remember what poem I did, but one that I incidentally memorized along the way is still really funny to me.  Crowded TubThere s too many kids in this tub.There s too many elbows to scrub.I just washed a behindThat I m sure wasn t mineThere s too many kids in this tub.I quote it for my kids and they look at me in shock and then start giggling. The imagery is just too good. :)"}], "description": "Last night while I lay thinking here Some Whatifs crawled inside my ear And pranced and partied all night long And sang their same old Whatif song: Whatif I flunk that test?Whatif green hair grows on my chest?Whatif nobody likes me?Whatif a bolt of lightning strikes me?...This 20th anniversary of Shel Silverstein's A Light in the Attic includes a CD of highlights from his Grammy Award-winning album.Here in the attic of Shel Silverstein you will find Backward Bill, Sour Face Ann, the Meehoo with an Exactlywatt, and the Polar Bear in the Frigidaire. You will talk with Broiled Face, and find out what happens when Somebody steals your knees, you get caught by the Quick-Digesting Gink, a Mountain snores, and They Put a Brassiere on the Camel.From the creator of the beloved poetry collections Where the Sidewalk Ends and Falling Up, here is another wondrous book of poems and drawings.", "title": "A Light in the Attic", "url": "http://www.goodreads.com/book/show/30118.A_Light_in_the_Attic", "average": 4.34, "cover": "https://images.gr-assets.com/books/1427169918l/30118.jpg", "reviews": 2595, "authors": [{"url": "https://www.goodreads.com/author/show/435477.Shel_Silverstein", "name": "Shel Silverstein"}], "type": ["Poetry", "Childrens", "Classics"], "outlinks": ["http://www.goodreads.com/book/show/30118.A_Light_in_the_Attic", "http://www.goodreads.com/book/show/240007.A_Light_in_the_Attic", "http://www.goodreads.com/book/show/25288311", "http://www.goodreads.com/book/show/4753298", "http://www.goodreads.com/book/show/6836108-a-light-in-the-attic-special-edition-with-12-extra-poems", "http://www.goodreads.com/book/show/30119.Where_the_Sidewalk_Ends", "http://www.goodreads.com/book/show/370493.The_Giving_Tree", "http://www.goodreads.com/book/show/30120.Falling_Up", "http://www.goodreads.com/book/show/30122.The_Missing_Piece", "http://www.goodreads.com/book/show/10659536-every-thing-on-it"]}