{"ratings": 19906, "userreviews": [{"userName": "Rhonda", "userReviewDate": "Sep 03, 2009", "userURL": "http://www.goodreads.com/user/show/1792361-rhonda", "userReview": "While I have no doubt that I am not going to read the whole series, I picked up two when I was at the library and the second dutifully begins where the first leaves off. Someone commented that these are the types of books which little old ladies read when they feel like they can put their collective noses into other people's affairs. If one hasn't read these books, that's a pretty good assessment, which is to say that it is totally incorrect. While Jan Karon has a huge following, no doubt composed in part of little old ladies, these stories are anything but what they appear to be on the outside. While the excitement is of a far more subtle sort, it is extremely human... as well as Christian. Without preaching, it successfully delivers the method of the utmost simplicity, something of which I think our Father would approve. It takes a while to become used to reading these, especially when you are expecting something exciting and dangerous, but what you end up with is that people are real and they solve their issues in very real ways. These are funny, inviting and joyful books of the Christian faith, and without too much of a stretch, I would probably say that they were inspired also. They are works of grace and beauty also, but that takes a while to see, if you are a complicated person with a complicated life. It makes you wonder why we made our lives so complex in the first place...and what we missed when we did so."}, {"userName": "Mike (the Paladin)", "userReviewDate": "Nov 25, 2009", "userURL": "http://www.goodreads.com/user/show/2187043-mike-the-paladin", "userReview": "Had you asked me I would never have thought I'd be reading a series of books like this one. (Not macho, you know). This is the story of a middle aged (maybe late middle-age?) clergyman in a small town. Again I came over these when i was listening to books and reading whatever I could get my hands on it seemed and I was surprised how involving these were. I hate soap operas and these books (except possibly for the \"Wedding Book\" which i couldn't get through) don't \"slump\" into soap opera mode. I like most of these and that truly surprised me.Timothy and the other characters here will I believe appeal to a wide audience. Life lessons, love with \"work clothes on\", human relationships and plots. Pretty good."}, {"userName": "Jacq Jardin", "userReviewDate": "Feb 05, 2010", "userURL": "http://www.goodreads.com/user/show/2636793-jacq-jardin", "userReview": "\"I so enjoyed this book. Although its main character is an Episcopalian priest named Father Tim, it is never preachy about religion. There's no heavy drama, no shocking twists, no explosive ending. But it's every bit as charming and engrossing as all ...more I so enjoyed this book. Although its main character is an Episcopalian priest named Father Tim, it is never preachy about religion. There's no heavy drama, no shocking twists, no explosive ending. But it's every bit as charming and engrossing as all the other books I gave five stars to. I think it's simply impossible to read it and not fall in love with the characters. They are warm, friendly, happy people, and they love and take care of each other. Edith Mallory is a bit too annoying at times, but she provides all the necessary additional spice to the storyline. And I love Cynthia's candor and independence. I think Father Tim took too much time pondering where the relationship was headed but still, all's well that ends well. And that Dooley Barlowe? I have to say he's a total star. I love and adore him."}, {"userName": "R.F. Gammon", "userReviewDate": "Feb 21, 2018", "userURL": "http://www.goodreads.com/user/show/62220551-r-f-gammon", "userReview": "This one is my least favorite of the Mitford books (at least the original nine), although I still adore it. It just feels less like coming home and more like a stop on the way. That is not a bad thing, at all! I still absolutely recommend this series...and this book...this particular installment simply feels a little bit melodramatic at times. That may simply be my opinion, however. The third one is one of my all-time favorite books, so I can't wait to get to that one!"}, {"userName": "Tracy", "userReviewDate": "May 16, 2009", "userURL": "http://www.goodreads.com/user/show/612172-tracy", "userReview": "What I learned from this book: It's me, not you. I am the one who is impatient. I am the one who is unable to find any sort of humor in innocent misunderstandings or mistaken identities. (This also explains why I'm not a fan of French farce.) I have proven to myself this year that I am indeed capable of enjoying stories that don't involve other-worldly creatures or kick-butt crime-solving or alternate realities (those would be the Maisie Dobbs books and The Guernsey Literary and Potato Peel Pie Society), but I find myself unable to commit to you, dear Mitfordians.Again, please forgive me. It is definitely me, not you. There are thousands, probably millions, of readers who will love you and treasure you for all that you are. Because you are a decent, hard-working and pleasant story. But you don't need me and my unreasonable expectations of action and directness and adventure.Can we still be friends?"}, {"userName": "Kelly ", "userReviewDate": "Apr 11, 2010", "userURL": "http://www.goodreads.com/user/show/872942-kelly", "userReview": "I'm going to write the same thing for the entire series. It's a syrupy sweet old fashioned read which does not demand anything of the reader. Many find the series feel good, and there are some sparkles of true conflict here and there, but mostly it's about the mundane daily plight of a vicar who finds love later in life and saves people - emotionally and physically. If you like the first in the series, keep reading because you will be comforted by the characters and will want to see who is added to the \"family.\" This reads like it was made for a TV series, which I am surprised it has not been made into for PBS yet!What I like about this series is that it doesn't try to be anything it is not; that in itself makes it charming, and if you want to read a simple, feel good, clean series, then this is it."}, {"userName": "Janie", "userReviewDate": "Nov 14, 2008", "userURL": "http://www.goodreads.com/user/show/1297923-janie", "userReview": "You have to read this whole series.. The characters are so funny and become your friends. Father Tim is so awesome and Cynthia an absolute doll. The whole time I was reading this, I just kept thinking in the back of my mind, \"which celebrities would I cast as these two main characters/\" I just kept thinking Carroll O'Conner (Archie Bunker) and Laura Bush as Cynthia. I tried to listen to these books again on tape, and write all of the characters down, but there are so many I just couldn't. Oh, by the way, after I read the first book I sent an e-mail to Jan and she started me up with a nesletter being sent to my home, about her writing and other things. She is one of those people who when asked, \"Who would you like to have dinner with?\", would be on the top of my list."}, {"userName": "Laura", "userReviewDate": "Jan 15, 2014", "userURL": "http://www.goodreads.com/user/show/819920-laura", "userReview": "These books are really pretty terrible."}, {"userName": "Carol", "userReviewDate": "Apr 16, 2018", "userURL": "http://www.goodreads.com/user/show/2534237-carol", "userReview": "This is a tender book, a romance in the best, most elevated sense of the word. Father Tim and Cynthia's love for each other is expressed; but what to do about it is one of the conflicts of the story. Chapter Seven, letters written to each other, is pure gold. Light illuminates this book — glowing in the window, flickering in the fire, falling on the wood floor, entering the room with Puny, guiding a searching man, shining at the Lord's Chapel, infusing the valley, warming Timothy and Cynthia. It is a wondrous book to read when winter doldrums and spring-snow dim the natural light."}, {"userName": "Laura (Book Scrounger)", "userReviewDate": "Mar 19, 2018", "userURL": "http://www.goodreads.com/user/show/33792597-laura-book-scrounger", "userReview": "3.5 starsEnjoyable, and while I didn't quite like it as much as first Mitford installment, it was still full of eccentric characters and nice storylines, plus it doesn't raise one's blood pressure."}, {"userName": "Marilyn", "userReviewDate": "Apr 11, 2007", "userURL": "http://www.goodreads.com/user/show/56569-marilyn", "userReview": "John McDonough is Father Tim. He has narrated all of the Mitford series books and is a treasure. As many know, quite often the scenes center on his fictional church or the choir. A veteran of the Glimmerglass Opera Company, he sings the hymns himself which is an extra treat for listeners. When one voice actor has read all of the titles in a series, that performer has created a strong connection to listeners. Thus, just as listening to another story of Mitford is enhanced by its familiarity so hearing John McDonough's narration stirs feelings of comfort and recognition. McDonough describes his first reading of a book as being ' like the first listening of a piece of music.' 'You have to be completely free,' he said. . 'As you read and think about the piece, you hear voices, and it starts to take on life.' How fortunate for all of us! In this, the second installment of the popular series, Father Tim has just returned from a vacation - his first in over a dozen years. While he enjoyed the respite he is a bit anxious to come home and see his neighbor, Cynthia Coppersmith, a woman with whom he thought he had an understanding. He's perplexed by what he perceives as her coolness and a bit agitated when a widow in his congregation sets her sights on him. The church has undertaken the building of a care center and an unexpected visitor arrives, evidently for an extended stay. Life goes on in Mitford as listeners renew acquaintances with some of the townspeople and once again are charmed by the fictional community."}, {"userName": "Athornton", "userReviewDate": "Nov 13, 2010", "userURL": "http://www.goodreads.com/user/show/3027714-athornton", "userReview": "Another charming read. It was good to reconnect with the characters in this quaint town. It's a good holiday read because it is not overwhelming, sad or depressing. I would love to visit a town like this if it in fact exists, with knowing each and every person's history, supporting each other and the town parties and festivities that everyone has to play a role in. I like how the characters' stories continue to wind together and new relations are discovered plus the inclusion of one of two outsiders to keep the story going. I was also happier reading this story since it focused on only a few of the characters and did not have as much character introductions, as the first book did. Made it much easier to follow the book. I am looking forward to reading more in the storyline and to continue to see the evolving characters!"}, {"userName": "Susan Snodgrass", "userReviewDate": "Jan 27, 2018", "userURL": "http://www.goodreads.com/user/show/7103516-susan-snodgrass", "userReview": "I just finished my third reading of this wonderful book. Jan Karon's 'Mitford ' series of books are some of the best in the planet. Never do they fail to inspire and console me, not to mention a thorough blessing! 'Lord, take this fear and dash it. Rebuke the enemy who is the creator of all fear, and give me the grace to be the man you've called me to be, no matter what lies in store.'Would that I could have the heart of Father Tim!Treasures, these books are, pure and simple!"}, {"userName": "Lena Morrison", "userReviewDate": "Dec 31, 2017", "userURL": "http://www.goodreads.com/user/show/28404981-lena-morrison", "userReview": "Truthfully it deserves 3.5 stars in my opinion. It's true, these books don't have a ground-shaking plot. However, they are sweet, charming, and hilarious. Father Tim is one of my very favorite fictional characters ever created. He is so much like me. I'm so glad he finally ended up with what he deserved.Good book and lovely writing!"}, {"userName": "Joyce", "userReviewDate": "Nov 14, 2014", "userURL": "http://www.goodreads.com/user/show/5394427-joyce", "userReview": "Library copy. Have looked forward to reading this since finishing At Home in Mitford. Do you find yourself smiling when you read this series? I do. Now that's a good read :-) This second in the Mitford series by Jan Karon did not disappoint. Ready to jump into book three! There's really nothing to say about the book, other than I highly recommend that you read it, if you haven't already. Even if you have, as a number of people have told me, it's time to read them again.Small town life, real life problems and personalities, real faith in a personal God, real colorful characters, old, young, in-between, sane and not-so-sane, a marvelous dog named Barnabus, and a published cat named Violet, not-so-marvelous. Plenty of action, plenty of conversation, plenty of aha moments. I especially enjoyed the description and history of Miss Sadie's ballroom ceiling.This book is packed with good stuff about Father Tim and the ways he cares for people. His opinion of himself is in great contrast to what he does. That is a good part of what makes this a great book. That woven together with many other threads.I did wonder about the mention of Percy and Velma's youngest grandchild waving a fly swatter over the orange marmalade cake (p.368), since they had a new grand baby a month or so previous :-)What are your favorite moments in Mitford?"}, {"userName": "Dianna", "userReviewDate": "Feb 08, 2011", "userURL": "http://www.goodreads.com/user/show/4752531-dianna", "userReview": "In the second book of the Father Tim series, Father Tim is returning from a summer in Sligo. Upon his return he sees that he really has not missed much as far the life in Mitford goes. Father Tim meets Edith Mallory, a very wealthy widow, who is trying to catch him with her wonderful cooking ability. But, Father TIm is only interested in Cynthia, his neighbor.Add to this mix, his cousin Meg who decides to move into the rectory and again Father Tim finds himself pastoring others. But, instead of pastoring to meet their needs, he is now pastoring to meet his own needs.The story of Dooley and his struggles also continues.If you are still hooked on the series then don't hesitate to read \"These High Green Hills\" which is number 3 in the series."}, {"userName": "Angie", "userReviewDate": "Apr 20, 2009", "userURL": "http://www.goodreads.com/user/show/1212310-angie", "userReview": "I had a really hard time getting into this book. I think part of the problem was that I started by listening to the audio CDs while I was driving. The way Jan Karon writes doesn't lend itself to distractions. You end up missing the essence of the story. So, I started reading the paperback and quickly got back into the story.I enjoyed Timothy and Cynthia's letters. I was a little disappointed that book had been leading up to some large events, and then the events were covered briefly. I will definitely continue to read more of the series."}, {"userName": "Stephanie", "userReviewDate": "Jul 31, 2008", "userURL": "http://www.goodreads.com/user/show/1237596-stephanie", "userReview": "ok so i totally slammed the first book in this series. the 3 books that followed were gifts, so i continued to read them as i really had nothing else to read and was too lazy to go to the library and too cheap to go to the bookstore. i've also decided to read the books that i actually own before checking out anymore. this second book was pretty good- easy easy reading- and if you are a praying/bible reading person, and slack off in the daily devotional department, the mitford books have a great message. some of the books are heavier on the bible verse quoting than others."}, {"userName": "Noel", "userReviewDate": "Jan 09, 2011", "userURL": "http://www.goodreads.com/user/show/291748-noel", "userReview": "A very sweet, very quiet and peaceful read, with great plot and character development -- just no drama or scintillating romance."}, {"userName": "Shiloah", "userReviewDate": "Jun 19, 2015", "userURL": "http://www.goodreads.com/user/show/973558-shiloah", "userReview": "I don't like saying good-bye to Mitford. It's a good thing there are so many of them."}, {"userName": "BarbaraW", "userReviewDate": "Nov 06, 2017", "userURL": "http://www.goodreads.com/user/show/59266940-barbaraw", "userReview": "Second book. Nicely done. Feel like they’re family. The cousin visit is a hoot. Father Tim’s hesitation in not committing is great insite into how a man’s mind works. Going for all four and gonna make the marmalade cake. There’s even a cookbook !!"}, {"userName": "Rishi Prakash", "userReviewDate": "Oct 12, 2016", "userURL": "http://www.goodreads.com/user/show/2173246-rishi-prakash", "userReview": "Another prize catch in the book fair :-) Although the language is kind of different with old english but i got used to it after few pages! This book takes you back to the old world which is something i definitely miss now. The entire story is set-up in a small town( Mitford) which has a set of characters who keep us engaged all through the book in between various incidents happening around their lives. The events are small and big, happy and tensed but all unique and interesting in their own way which literally made me live in Mitford! It is wonderful portrayal of people you may know or would like to know around you :-) So go for it."}, {"userName": "Sadie", "userReviewDate": "Jan 12, 2018", "userURL": "http://www.goodreads.com/user/show/1420680-sadie", "userReview": "I didn't like this one as much as I liked the first. That isn't to say I didn't like it at all, I just struggled through the love letters section of this one. Still uplifting and plenty of good bits of wisdom just as the last one."}, {"userName": "Alicia", "userReviewDate": "Feb 11, 2017", "userURL": "http://www.goodreads.com/user/show/11105817-alicia", "userReview": "I probably should have read the first book prior to reading this, because during the first 150 pages I was trying to piece together what all those background stories were and it seemed a bit muddled. I also had a hard time getting into the book. But the characters were endearing and their witty comments and stories made me smile, so I give an extra star for them."}, {"userName": "Elaine", "userReviewDate": "Nov 23, 2008", "userURL": "http://www.goodreads.com/user/show/1742519-elaine", "userReview": "•\t2nd in “The Mitford Years” “Father Tim” series I read this one but since I'm on book 5, It's difficult what was in each actual book. I will have to review this one once I listen to it on audio. Looking forward to it. After listening to the first on dramatized audio, I would have loved to listen to this one dramatized by haven't found it. just found in abridged and unabridged. 12/08/08 - I am listening to audio on this second go-round of book 2 --Father Tim is back from Ireland and someone in his congregation has set her sights on him, cooking up meals and cooking up other things to lure him in. Someone else wants him too.And then there's someone from Ireland...I'm enjoying this series more on audio."}, {"userName": "Sue", "userReviewDate": "Jan 25, 2008", "userURL": "http://www.goodreads.com/user/show/830760-sue", "userReview": "This is the second book in Jan Karon's delightful 'Mitford' series set in a small village in the South of the USA. Father Tim and his neighbour Cynthia enjoy each other's company and are attracted to each other. But Cynthia has to spend several months in New York, and Father Tim is followed by a pushy widow, and plays host to an Irish cousin who eats anything she finds... meanwhile he continues to deal with his diabetes, counsels friends and parishioners, and tries to find what his heart holds.No thrilling plot-line, no huge mysteries, but a beautifully written novel with realistic characters who I came to care about considerably by the end of the book. God is a big part of their lives, but is not brought into the book in an over-obvious or annoying way."}, {"userName": "Jodi", "userReviewDate": "Sep 12, 2009", "userURL": "http://www.goodreads.com/user/show/667420-jodi", "userReview": "I read the first book in this series many years ago but the characters are so rich with life that they all come back. Father Tim is the Episcopal priest in the town of Mitford. It's a town peopled with real people in all their glorious oddities. In this book Tim, a bachelor in his early 60s, has to contend with the fact that he's just fallen in love and what does that mean at his age? The object of his affection, Cynthia Coppersmith, feels even more strongly about it and knows exactly what she wants. She's not a doormat and isn't interested in playing at dating. It's a sweet story. You can't read it without a smile on your face."}, {"userName": "Lisa", "userReviewDate": "Aug 07, 2010", "userURL": "http://www.goodreads.com/user/show/568109-lisa", "userReview": "This is the second book in what I like to think is the most gentle, comforting read. Sometimes it seems a little too simple and comforting as the lives of the people in small town Mitford are brought out. The innocence of a place where an aging rector courts his neighbor as he struggles with a scripture listening dog, a foster child who is slowly capturing his heart, and the visit from a long lost relative from Ireland. The most scandelous event that takes place may be the plight of poor father Tim as the newest widow in town sets her sights on the unwilling man. It's the kind of book that gives your mind a rest, a laugh, and inspiration for life all at the same time."}, {"userName": "Christian Singer", "userReviewDate": "Mar 19, 2013", "userURL": "http://www.goodreads.com/user/show/17585685-christian-singer", "userReview": "This story builds on the previous one, showing the progress of Father Tim's relationship with his neighbor. Again, this series is character-driven so it is slower paced, but the reader gets to know the town and the townspeople and care about their daily lives. If Mitford, NC weren't fictional, I'd live there. If you're action-driven, this series isn't for you. If you can read just about anything, then I recommend this series (9 books if I'm not mistaken), perhaps between more adventurous books. Jan Karon has a witty, fun voice, and her characters are loveable and so very human. You'll have to read the books to understand."}, {"userName": "Linnae", "userReviewDate": "Aug 10, 2009", "userURL": "http://www.goodreads.com/user/show/806026-linnae", "userReview": "Father Tim is the rector of Mitford, a small town packed with personality. The recently widowed Edith Mallory has got her sights set on him, confirmed bachelor that he is, as her next conquest. Meanwhile, his attempts at a relationship with his lovely neighbor Cynthia seem to be slowly gaining ground. And that's just his personal life! He's got his 12-year-old foster child, Dooley, to look after, a church building project, parishioners to counsel, and of course, the weekly sermon to write. Karon's style reminds me of L.M. Montgomery's Anne books: heartwarming stories of everyday people facing the problems of their lives with hope and humor."}], "description": "Librarian's note: An alternate cover edition can be found hereHis attractive neighbor is tugging at his heartstrings. A wealthy widow is pursuing him with hot casseroles. And his red-haired Cousin Meg has moved into the rectory, uninvited. As you can see, Mitford's rector and lifelong bachelor, Father Tim, is in need of divine intervention. In this beautifully crafted second novel in the Mitford series, Jan Karon delivers a love story that's both heartwarming and hilarious. Only time will tell if the village parson can practice what he preaches. Like At Home in Mitford, the first novel in the series, this book is filled with the miracles and mysteries of everyday life. And the affirmation of what some of us already know: Life in a small town is rarely quiet. And absolutely never boring.", "title": "A Light in the Window\n      \n          (Mitford Years #2)", "url": "http://www.goodreads.com/book/show/829544.A_Light_in_the_Window", "average": 4.23, "cover": "https://images.gr-assets.com/books/1344618457l/829544.jpg", "reviews": 802, "authors": [{"url": "https://www.goodreads.com/author/show/40552.Jan_Karon", "name": "Jan Karon"}], "type": ["Fiction", "Christian Fiction", "Christian", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/829544.A_Light_in_the_Window", "http://www.goodreads.com/book/show/112872.A_Light_in_the_Window", "http://www.goodreads.com/book/show/1892788.A_Light_in_the_Window", "http://www.goodreads.com/book/show/2901104-a-light-in-the-window", "http://www.goodreads.com/book/show/665892.A_Light_in_the_Window", "http://www.goodreads.com/book/show/37799254-a-light-in-the-window", "http://www.goodreads.com/book/show/16053777-a-light-in-the-window", "http://www.goodreads.com/book/show/2657504-a-light-in-the-window", "http://www.goodreads.com/book/show/71776.At_Home_in_Mitford", "http://www.goodreads.com/book/show/71784.A_New_Song", "http://www.goodreads.com/book/show/112874.These_High_Green_Hills", "http://www.goodreads.com/book/show/78674.Out_to_Canaan", "http://www.goodreads.com/book/show/71787.In_This_Mountain", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}