{"ratings": 129, "userreviews": [{"userName": "Lena", "userReviewDate": "Nov 02, 2007", "userURL": "http://www.goodreads.com/user/show/220791-lena", "userReview": "I was thinking about my early reading habits the other day, wondering why one of my favorite books as a child was the story of a Depression-era Jewish girl in Brooklyn who came from a well-to-do family, half of whom were in Freudian psychoanalysis. As a kid, this was not exactly a world I could relate to.So I decided to reread Allegra Maud Goldman, and realized that I loved this book because I loved its smart, sassy narrator, a girl who realizes early on that she is ill-suited to live the kind of pre-feminist life her parents are vainly trying to prepare her for. Despite the differences between her era and my own, Allegra's coming-of-age, coming-into-self story is one that still resonates decades later."}, {"userName": "Greta", "userReviewDate": "Nov 06, 2010", "userURL": "http://www.goodreads.com/user/show/543723-greta", "userReview": "It was probably inevitable that I would come to work at an all-girls middle school and this would become REQUIRED READING-- First confession, though: I hadn't even HEARD of the book until now! And what a BUMMER! EVERY SINGLE middle school-aged girl should read it! ALLEGRA MAUD GOLDMAN is the precocious protagonist of this novel-- written memoir-style and charting the life of this fiery Brooklyn-born heroine from ages 3 to 13, Konecky tells Allegra's story with such biting wit, and with such piercing insight into gender politics (in which she succeeds brilliantly in not being heavy-handed!) as well as into the relationships among and between parents and children particularly....I found myself laughing aloud at some of Allegra's comments and escapades, but more than this, I was struck by the seriousness underlying the entire text, and the way in which, even more than forty years after publication, this story still makes visible the discrepancies and imbalances in the structures in which we humans live as social beings-- especially as females. The ending, which is at once triumphant and heartbreaking perfectly encapsulates the coexistence, and the continual tension in all of these domains."}, {"userName": "Cindy Dyson Eitelman", "userReviewDate": "Sep 03, 2017", "userURL": "http://www.goodreads.com/user/show/20446197-cindy-dyson-eitelman", "userReview": "It's kind of a cool thing to turn your life story into a novel. If I did it, I'd be a bookworm who magically transforms into a track star at age sixteen, then hires onto a rainforest expedition and discovers a new species of black jaguars, before moving to Taos, New Mexico where I make a living as a backpacking writer. Or maybe a Rockette!Of course that would read like the nonsense it is--and this book isn't. It's probably more real than reality, because a writer who sticks with only the remembered facts will never tell the whole story. Ms. Golman may have made up the funny story of her discovery of \"sitting\" and how it creates a new body part, \"the lap.\" But who cares? It's funny and it highlights the audacity of the girl who'd do such a thing.I didn't get all that, at first. I approached this book thinking it was simply a humorous autobiography, and that was a shallow, simple thing to do! I got what I deserved. For me, it wasn't funny enough or earth-shattering enough, and I missed out on the richness of the interplay of imagination with reality. I raced through and didn't 'get' half of what it had to offer. Only after reading the afterword, a very learned exposition of how it represented a near-perfect example of the Bildungsroman, did I get the point of it all--it's not comedy or tragedy, it's the transformation of a child into a human being. Incidentally, it had a lot to say about the middle-class lifestyle of the 1930s and women's search for personal worth in a time when girls prepared for marriage, period.A lot to get out of a short book. or maybe I should say, a lot to put into. I will read her later work, A Place at the Table, and see where she went from there."}, {"userName": "Lori", "userReviewDate": "Aug 14, 2017", "userURL": "http://www.goodreads.com/user/show/2205492-lori", "userReview": "I enjoyed the character, but not enough plot for me."}, {"userName": "Vera", "userReviewDate": "May 17, 2017", "userURL": "http://www.goodreads.com/user/show/6137548-vera", "userReview": "Another one I wish I had known of and read as a teenager. Another good last line. 4.3 stars."}, {"userName": "Jeanette  \"Astute Crabbist\"", "userReviewDate": "May 30, 2008", "userURL": "http://www.goodreads.com/user/show/796425-jeanette-astute-crabbist", "userReview": "This is an autobiographical coming-of-age novel. It follows Allegra from the age of about three to about age thirteen. She's a very precocious Jewish girl growing up in Brooklyn in the 1930s. At that time, Jewish girls from wealthy families were expected to have no other ambition than to make a good marriage with a rich man, have a couple of kids, and be one of the ladies who lunch and play cards all day. These social strictures don't suit Allegra, and she's very vocal about it. Just as she's entering adolescence, she goes away to camp for the whole summer and discovers that there are other options for strong, talented young women who choose to define their own paths.This book was a delightful, lighthearted read. It's only about 175 pages, and can easily be read in less than a day. There's a lot of subtle humor and a handful of laugh-out-loud moments as Allegra makes her discoveries about her world and shares her opinions."}, {"userName": "Liz", "userReviewDate": "Feb 16, 2008", "userURL": "http://www.goodreads.com/user/show/910714-liz", "userReview": "If you liked Scout from To Kill a Mockingbird, you will like this novel's protagonist. She is a spunky young girl trying to make sense of life and make her way through many typical coming of age struggles. She is attempting to find her own identity and balance that with her ethnic, religious, and gender identity. She is very witty, and you may even laugh out loud at times. I did not love the very heavy handed feminist themes, and chapter 11 is really ridiculous. Overall, It is a quick, fun read and an interesting way to learn a little about the Jewish culture."}, {"userName": "Crystal Muno", "userReviewDate": "Jun 09, 2009", "userURL": "http://www.goodreads.com/user/show/2205985-crystal-muno", "userReview": "Allegra is funny and smart and beyond precocious. At times while reading the book I thought, \"There is NO way a girl this young and in this era of time has this much self-awareness and feminism\" but then I think of my grandmother who had just as much spunk as Allegra and while she may not have put her beliefs into such articulate words, she navigated through a man's word never once letting her dress keep her back."}, {"userName": "Lizzie", "userReviewDate": "Aug 19, 2014", "userURL": "http://www.goodreads.com/user/show/1539362-lizzie", "userReview": "All these A Tree Grows in Brooklyn cousins on the list are making me lose my mind. Can hardly wait to read this..Still combing through the 500 Great Books By Women book list, which got set up as a Goodreads group, and tracking the demographics via spreadsheet (and so can yoouuu)."}, {"userName": "Daniel Deller", "userReviewDate": "Jul 27, 2013", "userURL": "http://www.goodreads.com/user/show/20159027-daniel-deller", "userReview": "Strange and wonderful it is, the places a good book will take you. When I was young, maybe 8?, on the strength of reading this I yearned to be Jewish and female, and while reading I was a young Jewish girl with the narrator. A strong case for the transformative power of fiction!"}, {"userName": "Sunni", "userReviewDate": "Mar 16, 2008", "userURL": "http://www.goodreads.com/user/show/431184-sunni", "userReview": "Short, sweet. Funny and moving. Really reminded me of my mother and aunt and the time they grew up in."}, {"userName": "Jackie R", "userReviewDate": "Apr 16, 2012", "userURL": "http://www.goodreads.com/user/show/7484856-jackie-r", "userReview": "Quite fun. A coming of age type of book with warmth and humor as well as an interesting look at the late 20's and 30's of a wealthy Jewish family in New York."}, {"userName": "Allison Lyons", "userReviewDate": "Jun 08, 2013", "userURL": "http://www.goodreads.com/user/show/349863-allison-lyons", "userReview": "The story of a hilarious young girl in the 30s just trying to figure out her place in the world. Especially being a girl. I laughed out loud a few times."}, {"userName": "Meen", "userReviewDate": "May 13, 2008", "userURL": "http://www.goodreads.com/user/show/1069458-meen", "userReview": "Deee-lightful!"}, {"userName": "Annie Matthys", "userReviewDate": "Jul 15, 2008", "userURL": "http://www.goodreads.com/user/show/1312923-annie-matthys", "userReview": "A MUST-READ! This is one of the best books I've had the pleasure of being acquainted with."}, {"userName": "Hannah", "userReviewDate": "Oct 10, 2008", "userURL": "http://www.goodreads.com/user/show/1571315-hannah", "userReview": "Allegra is really funny, and just spits out what ever is on her mind. But the story wasn't really fluid."}, {"userName": "Terri Jacobson", "userReviewDate": "Jul 01, 2012", "userURL": "http://www.goodreads.com/user/show/8370501-terri-jacobson", "userReview": "A light and entertaining story of Allegra Maud Goldman as she comes of age and learns to deal with the vagaries of the adult world. Amusing and lighthearted."}, {"userName": "Lili", "userReviewDate": "Nov 22, 2010", "userURL": "http://www.goodreads.com/user/show/4271276-lili", "userReview": "Well it was original. I loved the time setting and around what it revolved. It made you feel human. The book brings the perspective of a growing girl in a different century."}, {"userName": "Steph", "userReviewDate": "Oct 21, 2008", "userURL": "http://www.goodreads.com/user/show/1372682-steph", "userReview": "References to her father's dressmaking factory, which he called \"the place,\" resonated with me as I recalled the many visits I made to MY grandfather's \"place\" in the garment district of Manhattan."}, {"userName": "Lynn", "userReviewDate": "Oct 13, 2013", "userURL": "http://www.goodreads.com/user/show/12798793-lynn", "userReview": "One of the best things I've read this year. Thanks, Melki!!"}], "description": "A special twenty-fifth anniversary edition relaunches this beloved classic coming-of-age nove, which was called \"one of those rare delights…as wise as it is funny\" (Alix Kates Shulman, Ms. magazine). This endearing novel chronicles the growth of the young Allegra in pre-World War II Brooklyn as she learns about sex, death, bigotry, family limitations, and what it means to be young and female and independent.Marketing Plans for Allegra Maud Goldman: • Advance review copies to booksellers • Twenty-fifth anniversary press kit • Strong media pushEdith Konecky is the author of a second novel, A Place at the Table, as well as short fiction and poetry.", "title": "Allegra Maud Goldman", "url": "https://www.goodreads.com/book/show/531886.Allegra_Maud_Goldman", "average": 4.12, "cover": "https://images.gr-assets.com/books/1354209612l/531886.jpg", "reviews": 20, "authors": [{"url": "https://www.goodreads.com/author/show/251302.Edith_Konecky", "name": "Edith Konecky"}, {"url": "https://www.goodreads.com/author/show/29155.Alix_Kates_Shulman", "name": "Alix Kates Shulman"}, {"url": "https://www.goodreads.com/author/show/89863.Tillie_Olsen", "name": "Tillie Olsen"}], "type": ["Young Adult", "Fiction", "Young Adult", "Historical", "Classics"], "outlinks": ["http://www.goodreads.com/book/show/531886.Allegra_Maud_Goldman", "http://www.goodreads.com/book/show/2793003-allegra-maud-goldman", "http://www.goodreads.com/book/show/447255.A_Place_at_the_Table", "http://www.goodreads.com/book/show/2126296.Love_and_Money", "http://www.goodreads.com/book/show/2126295.View_to_the_North", "http://www.goodreads.com/book/show/2126294.Past_Sorrows_and_Coming_Attractions", "http://www.goodreads.com/book/show/13822449-fiction-and-the-facts-of-life", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}