{"ratings": 11111, "userreviews": [{"userName": "Pouting Always", "userReviewDate": "Aug 01, 2017", "userURL": "http://www.goodreads.com/user/show/48650982-pouting-always", "userReview": "Bea has been trying to keep her finances in order after her husband died but no matter how thin she spreads the money her saving seem to dwindle endlessly. Then when she falls for a phone scam and loses the last of her money and that month's social security she decides to take off on the road. Leaving most of her belongings behind her, except her cat, she heads out to try and figure out a way to get by. Allie's parents get arrested for tax evasion, landing her in a group home. Allie's idealistic ways end up blowing up in her face when they lead to a confrontation with another one of the girls at the home and Allie ends up running away to avoid the inevitable fight to follow. On her own and unsure of how to take care of herself, Allie falls into trouble, eventually running into Bea who she convinces to give her a ride. A 3.5 for this one, because while I did like the plot and the ideas behind the book, the writing and characterization felt a little on the immature side. I'm not sure how to describe what exactly it was that was lacking except to say it was immature because I'm not sure there is a word for it. While the writing wasn't bad it didn't hold much in the way of complexity and nuance, and I don't need her to write like Nabokov but it felt somewhat like reading something a child would write. I also wish the characters felt more complex. Allie's incessant idealism felt so unrealistic, though I do appreciate her growth as she faces many of the harsher realities of life when a person only has limited options. So while I liked the plot and got into the book I do wish there was more depth to the writing and that the author's style was different. I just personally prefer more showing to telling is all."}, {"userName": "Sarah Joint", "userReviewDate": "May 23, 2017", "userURL": "http://www.goodreads.com/user/show/19758811-sarah-joint", "userReview": "A very pleasant book. I wanted something light, and about 30 percent in I was so terrified for both of the characters I wasn't sure I was going to get it. It did lighten up significantly after that, but it's not always sunshine and roses. I really ended up liking both characters and their unlikely friendship. A great quick read, would be a perfect vacation book. Bea has already lost her husband, but now she's lost everything. Thanks to a telephone scam that cleaned out her bank account, she's flat broke. She can't even afford the meager lifestyle she's been living. She can't pay the rent on her trailer or her utilities and has to figure out a way to survive. With only her old cat for companionship, she loads up her van and hits the road. She has about a month until her next social security check deposits, so she's gotta figure out a way to get money for food and gas... and fast. Allie is a teenager in an awful situation. Used to living a fairly privileged lifestyle, both of her parents are arrested and she's suddenly on her own with no family to care for her. Her new abode is a group home... complete with food vegan Allie can't eat and a thieving and dangerous roommate. Fearing for her life, she bolts with a new friend... but that just leads her to a situation more dangerous than the first.These two vagabonds find each other by chance. Bea is in her 70s and Allie is only 15, but they both have things to learn from each other... and things they'll learn together on their journey along the coast. I received an ARC of this book from Net Galley and Lake Union Publishing, thank you! My review is honest and unbiased."}, {"userName": "Cindy Burnett", "userReviewDate": "Mar 11, 2017", "userURL": "http://www.goodreads.com/user/show/2445617-cindy-burnett", "userReview": "Catherine Hyde Ryan writes beautiful books with relevant and important messages imparted to the reader without seeming preachy in the least. What a fabulous skill to have! As Allie and Bea begins, Bea, a tough woman in her seventies, has been fleeced of her remaining money by a con man. Left with few options, Bea decides to live in her van and make her way up the coast of California to try and find a place to reside. Meanwhile, Allie, a strong-willed teenager, has just been thrown into the CPS system because her wealthy parents have been arrested for tax fraud. Escaping from a harrowing ordeal, she and Bea encounter each other and eventually decide to team up and take an adventure up the Pacific Coast.Initially as I began reading this novel, I was unsure that Bea and Allie were very realistically crafted. As I continued reading, I decided that I was naïve and that sadly there are people are in similar situations to one or both of them; I just do not encounter them much in my life. As a parent of two teens and a pre-teen, the fate of Allie’s character significantly weighed on my mind. The options available to her were few, and I found that so depressing and somewhat scary. Likewise, with elderly parents thankfully still around, I also empathized with Bea as she struggled with her lack of income and resources and how she could make her way in today’s world. After I finished Allie and Bea, I certainly hope that I will be more sympathetic and open to seeing and helping those individuals I encounter day-to-day that may need a helping hand.My two favorite aspects of the book were Hyde’s focus on the thoughtfulness of humanity when people are given a chance to be kind and helpful and the relationship that Bea and Allie developed with each other. Family is not always those people who are related to each other but instead can be individuals who encounter each other along the path of life and connect. Allie and Bea’s relationship is the perfect example of the latter.Hyde has written an incredibly thought-provoking novel that will stay with me for a long time, and I definitely recommend Allie and Bea to everyone. Thanks to Lake Union and NetGalley for the chance to read this ARC in exchange for an honest review."}, {"userName": "Tudor Vlad", "userReviewDate": "May 05, 2017", "userURL": "http://www.goodreads.com/user/show/47799008-tudor-vlad", "userReview": "“Seems all my life I had to make choices between what I considered wasting money and what I now see was wasting my life. If it keeps you from wasting your life, it can’t very well be a waste, now can it?”\nIt doesn’t happen very often for me to see a book and immediately think “this is exactly what I need right now” and be absolutely certain that I’m going to love it, but this is what happened when I saw Allie and Bea. I recently read a lot of heavy and depressing books with questionable characters and I needed something lighthearted that would make me feel good and yet not be too mushy. This is exactly what Allie and Bea delivered, a beautiful journey with two unlikely friends that embark on an adventure that will change them forever. The book starts with Bae, a 70-something widow that lives on Social Security. After falling for a telephone scam she ends up losing all her savings and no longer being able to afford to live in her trailer. She is forced to abandon everything, hop in her van and try and make a living on the road, homeless. Meanwhile, Allie, a 15 year-old girl is taken by the Child Protecting Services and taken to live in a group home after her parents are jailed for tax fraud.Both characters have it pretty rough after being taken away from the places and people they were familiar with and forced to make do in a completely different environment. I know I said that this book is lighthearted but I have to warn you: the first part, until Allie and Bea meet, is tough, depressing and shocking. The circumstances that these characters have to endure are even harder to read because of how real they feel. It’s hard not to start imaging that there are so many people that go throw the same thing, if not worse. It’s what Allie and Bea decide to do with their situation that makes this book so satisfying and a joy to read. Both characters end up growing so much in the course of this book. Catherine Ryan Hyde wrote a beautiful tale of how friendship can arise in unlikely places, a story that delights and that doesn't shy away from focusing on real social problems. A thoughtful and mesmerizing novel. I received an advanced copy of this book courtesy of Lake Union Publishing and NetGalley in exchange for an honest review."}, {"userName": "Carole", "userReviewDate": "Jul 04, 2017", "userURL": "http://www.goodreads.com/user/show/7630646-carole", "userReview": "As always, you can't go wrong with choosing a book by Catherine Ryan Hyde. Immediately I fell I love with the characters, Allie & Bea. The 2 are an unlikely pair. A young teenage girl who gets taken from her parents into protective custody, and an elderly widow who has fallen for a scam and lost everything. They meet up after Allie runs away from some scary situations, and they embark on a journey up the west coast along with Bea's cat, Phyliss. Allie is extremely honest and Bea is a bit jaded about life. I am always amazed at the insight this author has with her characters. Some great lessons are learned. I never wanted to see this tale end, and I wanted to continue the journey along with them indefinitely. I often wondered how it would wrap up and I was hoping I wouldn't be disappointed. I was happy with the conclusion. Look no further if you're looking for a great summer read with characters you will love. Another favorite by a favorite author!!"}, {"userName": "Sherri Thacker", "userReviewDate": "May 04, 2018", "userURL": "http://www.goodreads.com/user/show/36561653-sherri-thacker", "userReview": "This is my 2nd book by Catherine Ryan Hyde. I loved her book Take Me With You and gave it 5 stars so I had high hopes for this one. This book is pretty good. I felt like it started off slow but once both Allie and Bea got together, it picked up speed! It’s a beautiful story and how the 2 formed a bond and the friendships they made along the way. If it hadn’t been slow in spots, I would give it 5 stars but I’m giving it 4 stars."}, {"userName": "Agnes (BeaderBubbe)", "userReviewDate": "Jun 10, 2017", "userURL": "http://www.goodreads.com/user/show/3265140-agnes-beaderbubbe", "userReview": "What a heartwarming story. Bea who becomes homeless and lives in her van. Allie whose parents are arrested and she is put in a group home. Two separate lives who meet up when Allie runs away from the terrible things that happen in the home.This unlikely couple become friends, travelling together....their adventure makes you believe in the kindness of human nature as they meet so many helpful people; and the ending will make you smile.Love Catherine Ryan Hyde - never get tired of her books."}, {"userName": "Judy Collins", "userReviewDate": "May 13, 2017", "userURL": "http://www.goodreads.com/user/show/11063006-judy-collins", "userReview": "Master storyteller, Catherine Ryan Hyde returns following  Say Good-Bye for Now  landing on my  Top 50 Books of 2016  with another emotional thought-provoking saga  ALLIE AND BEA  – two protagonists from different generations caught up an unfair system find they may learn something from one another.The best and worst of humanity.Bea a senior  barely making it on her small social security check. Her husband is deceased and she resides in a mobile home with her cat Phyllis. Her savings is nearly depleted trying to make ends meet. Then a phone scammer  saying he is from the IRS to collect back taxes. Quickly her money is gone. Wiped out. She has nowhere to turn and nowhere to live. Even her rent check will bounce since someone wiped out her bank account. Feeling stupid and helpless, she has to change her direct deposit bank account and decides she has no choice but to live in her old van with her cat; and leaves her things with a friend. She barely has enough money for gas and food for another month until she receives her next social security check.Then she is faced  with the impossible and begins doing things she never thought she would do in order to survive. Bea does not have any knowledge of cell phones, nor the internet. She never had the opportunity to do much traveling nor see the world. She is rough around the edges, and over the years she has learned not to let others in or get too close. She does not trust easily, cynical, and now alone. How will she continue to survive sleeping in her van and too old for a job?Told from two points of view, we meet Allie.  Allie is a teen and wise beyond her years. She is smart and has strong principals and integrity. She is a devout vegan and very strict with her food and lifestyle. She has just discovered her mom and dad are being arrested for tax fraud and being sent to jail. She is left with a social worker, and has to leave her home, friends, school, and all her possessions -taken to a group home. Allie has no clue of the evil of this world.  All this is foreign to Allie.  She soon learns people in this world are not so nice. Some of the girls are very dangerous at the group home and things get out of hand. She has nowhere to turn and no money. Then her only hope is a friend who helps her escape and soon finds herself in another nightmare even worse than what she left. Human trafficking.  She has one shot  in order to escape a madman. Soon an unlikely old woman and a runaway teen connect. Two lives both desperate. They soon discover they may learn some hard life lessons together. As always, Hyde takes readers on a thought-provoking adventure.  It may not be an easy road; however, her characters always find a way to connect with someone on a different path to change their lives. Fate intersects. They may not know the reason for the encounter, but you can be assured they were meant to take the journey.Even though I could relate to Bea  being a senior, had to think of my recent experience with my dad, age 86 yrs old with this horrible healthcare system and a recent phone scam which fortunately he did not get sucked into. I also related to Allie in so many ways.  She is wise beyond her years. She has integrity. I am also a vegan and some of the reactions are ones I face daily. I had to laugh when I went to a shelter during our last Florida hurricane evacuation. I could eat nothing they had. It was good I packed some healthy snacks and was able to go home the following day. Being a vegan is foreign to many in our world. Lots of laughs between the two. I admired Allie for her strong principals; however, it also demonstrated how when faced with survival, how people get desperate enough to cross moral and ethical lines. A heartwarming story of the kindness of others. She taught Bea so much about herself. No one can take you  on a better road trip adventure than Catherine Ryan Hyde— mixed with life messiness, emotion, heart, and lots of humor. I think we have all been close to living in our car at one time or another, in our lives when things have looked hopeless. A good look  at our broken system and how it fails the young and the old in different and similar ways. When this happens, we may not always have a family; however, there may be a guardian angel where we least expect through the kindness of a stranger. The highs and loves of life!  The cracks in life let the light through. After reading a CRH book you want to rush out and do something good for someone, or volunteer at a homeless shelter. Help someone less fortunate. You want to give back. Life changing moments.  Inspiring.In addition to the reading copy, also purchased the audiobook, narrated by Lauren Ezzo and Janet Metzger with an engaging performance for both voices. Loved the journey along the Pacific Coast. One of my favorite cities: Santa Barbara, CA!  I was curious to see how these two souls from different walks of life would connect - fans will enjoy this one. From an online interview  with the author we get a glimpse into what’s coming next:“After Allie and Bea will come a novel called The Wake-Up,  about a former cattle rancher who becomes so sensitive to the emotions of others that his entire life is turned upside-down. And all this just as he’s trying to find his way with a seriously abused new stepson who can’t be trusted with his animals.”  Read more  (A 5 Star-just finished it). A special thank you to Lake Union and NetGalley for an early reading copy.  JDCMustReadBooks"}, {"userName": "Amy", "userReviewDate": "Jun 06, 2017", "userURL": "http://www.goodreads.com/user/show/14045562-amy", "userReview": "All of my reviews can be found on www.novelgossip.com4.5/5I think we’ve all read plenty of books about characters that are down on their luck and struggling to get back on their feet, but in Allie and Bea both title characters are truly fighting for survival, there is nothing cutesy or whimsical about their situations, things are drastic, life threatening even. But don’t be mistaken, as much as this book deals with some heavy themes, at it’s core it’s uplifting and a story of hope and how small acts of kindness can have life altering impacts. It begins from Bea’s point of view, she’s a seventy something widower barely scraping by on her social security checks. When she gets scammed by someone claiming to be from the IRS, she’s virtually penniless and all hope seems to be lost. It then switches to Allie’s POV, a fifteen year old girl who’s parents are arrested leaving her in the care of the state and stuck in a group home with some unsavory characters. When the two have a chance encounter, their storylines merge and now these unlikely allies find themselves on an adventure that takes them places neither could have ever imagined.I wondered what a seventy year old woman and a teenage girl could possibly have in common, and the surface answer is not a whole lot. Though they are as different as two people can possibly be, they wind up having more in common than meets the eye and they also have lessons to teach each other. Ryan Hyde has a real knack for developing outstanding characters that steal a piece of your heart, they really get under your skin in a good way. Watching their relationship grow and blossom was just amazing and made me smile. Ryan Hyde tackles some timely issues in this book, the one that touched me the most was homelessness, she sure made me think about the issue in a different manner than I have in the past. Seeing how fast someone can find themselves on the street or sleeping in their car was scary and humbling. While tough issues are definitely at the forefront there are still many moments of humor, heart and warmth making this a truly feel good read. This was thought provoking and would also be a great choice for a book club, but it’s an easy enough read that you could read it poolside as well."}, {"userName": "Nancy", "userReviewDate": "Apr 06, 2017", "userURL": "http://www.goodreads.com/user/show/28397995-nancy", "userReview": "When I have been reading a lot of 'heavy' books and need to lift my spirit to remember that good things can happen in this world of trials and conflict, I am glad to have Catherine Ryan Hyde to turn to. Her newest book, Allie and Bea, did not disappoint.Hyde's books have a common thread: imperfect people with real life problems, often mired in anger or despair, are lifted through an empowering, healthy relationship. This novel begins with Bea, a widow in her senior years, living on Social Security that can not cover her basic needs. Scammed out of her meagre savings, she has reached rock bottom and becomes a homeless vagrant living out of a panel van. Enter Allie, a fifteen year old on the run for her life. When Allie's upper class parents opted for lifestyle over paying the IRS they ended up in jail. Allie is taken under Child Protective Service and placed in a group home for delinquents until a foster home opened up. Allie has high standards for herself and holds others to them. It brings her into conflict with a violent girl, and fearing for her life, Allie joins a runaway girl only to find herself faced with a human trafficker.Allie flags down Bea's van and forces her way into Bea's life, and in nine days together on the lam, Bea is brought to reevaluate her entire life and Allie finds someone who will stand by her when her family has failed her.I enjoy how Hyde takes contemporary social issues and through likeable characters elicits an emotional understanding from readers. Yes, her endings are neat and sweet, but that is why I turn to her books. Sometimes we all need a wish fulfillment tale. I received a free ebook from the publisher through NetGalley in exchange for a fair and unbiased review."}, {"userName": "Rhonda Ruff", "userReviewDate": "Jul 08, 2017", "userURL": "http://www.goodreads.com/user/show/40134064-rhonda-ruff", "userReview": "I won this book in a drawing from Catherine Ryan Hyde! Loved it! Such a good story and very likeable characters. This story had a hea which was just what i was looking for right now ."}, {"userName": "Shalini", "userReviewDate": "Oct 22, 2017", "userURL": "http://www.goodreads.com/user/show/57308589-shalini", "userReview": "This is my first book by this author. Story was very unusual; a 70 year old Bea loses all her life savings by a telephone scammer. After her husband's death, life has been a struggle for her, so this was the last straw, so she takes off on the road. Allie's parents are jailed for tax evasion; to escape a dangerous situation, Allie runs away. And kismet plays a hand, throws these 2 unlikely characters together and they go on a road trip, where they teach each other some lessons of lifeThe author, Catherine Ryan Hyde has written well. The story is heart warming, plot line is good and different. It's difficult to imagine how a 70 year old and a 14 year old would get along, without anything in common, but surprisingly Catherine makes the story work and as the pages turn, both Allie and Bea, grow, mature, and learn from each other. The core of the book deals with a hard hitting social problem of homelessness in the elderly, especially when life should be comfortable. Catherine makes us think in this novel. At the same time, she has shown us that friendships can arise between two people whatever be the age and lessons can be learnt from each other, if we are ready to listen.There are some niggles.. I wanted to connect more with the characters, I needed a bit of depth in them, just to make them more real.The book went a bit slow for me, as the writing style was a little different.But in saying this, I did like the story on the whole, the kindness and helpfulness of humans made me feel positive through and through. A road trip which was a great book reading trip by Catherine Ryan Hyde."}, {"userName": "Jennifer", "userReviewDate": "Apr 10, 2017", "userURL": "http://www.goodreads.com/user/show/2315277-jennifer", "userReview": "This has been my favorite book by Catherine Ryan Hyde so far. I will admit I wasn't sure if I was going to like the book when I first started. Bea was not that likable at the beginning. By the end, I was crying. Bea is a widower with not much money in the bank. Then she is scammed for what little money she has left. So she decides to pack up her toothless, old cat and live in her old van. Bea is not a friendly old woman, she is gruff and speaks her mind. Allie is a fifteen year old girl who finds herself in a group home after her parents are arrested for tax fraud. Allie has a with her roommate when she steals Allie's $30 socks. Allie runs away with Jasmine, but ends up in an even worse place. That is when Bea and Allie find each other. The best part of the book is they were what each other needed. Allie and Bea have their own adventure traveling up the west coast. I think the tears started when Bea showed up at the court hearing. I loved reading about them and I love how they ended up together at the end. Bea just wanted a large tub to soak in and Allie was able to provide it for her. I think their adventures will keep continuing, just with the addition of Allie's mom.I definitely recommend it. I loved, loved, loved it. Thanks to NetGalley, Lake Union Publishing and the author, Catherine Ryan Hyde, for a free electronic ARC of this novel."}, {"userName": "Christine Nolfi", "userReviewDate": "Jun 04, 2017", "userURL": "http://www.goodreads.com/user/show/5194381-christine-nolfi", "userReview": "This captivating tale will capture you from page one. Allie and Bea are the most unlikely people to become friends, let alone family. On a journey rife with danger, and sweetened by several heartwarming turns, they forge a bond than transcends age or class distinctions. Highly recommended."}, {"userName": "Lori", "userReviewDate": "Jul 03, 2017", "userURL": "http://www.goodreads.com/user/show/5199459-lori", "userReview": "Absolutely loved this book! I feel like I've been on an adventure right there with Allie and Bea and now it's over and it makes me sad!"}, {"userName": "Caryn", "userReviewDate": "May 22, 2017", "userURL": "http://www.goodreads.com/user/show/1498815-caryn", "userReview": "Full review and giveaway on my blog: http://www.thebookwhisperer.org/2017/..."}, {"userName": "Marleen", "userReviewDate": "Sep 17, 2017", "userURL": "http://www.goodreads.com/user/show/1616365-marleen", "userReview": "A most endearing read about two unlikely characters who become travel buddies for a short duration. For very different reasons, both Bea and Allie are forced to leave their familiar lives and find themselves “on the road”. I will not go into the whys because that would be giving away spoilers, but let me just say that they are very special circumstances; however both very real, which could happen to all of us.I thought that the characters were quite recognizable; they had authentic fears and thoughts; and that’s what made both Bea, in her seventies, and Allie, only fifteen, very compelling characters.Bea is a suspicious by nature; cautious and a bit cynical, but when she meets Allie, who is smart, honest, although naïve, Bea can’t help but to open her heart, bit by bit, to this wonderful young girl.I enjoyed this read, and like with many of Catherine Ryan Hyde’s books, I walk away with a bit more belief in human goodness. Many of her books present us with ordinary people who are capable of extraordinary acts of kindness and courage."}, {"userName": "Jessi", "userReviewDate": "May 14, 2017", "userURL": "http://www.goodreads.com/user/show/20648316-jessi", "userReview": "Bea has lost her husband, been scammed out of her remaining funds, and is now leaving everything she's owned to live in her van. Allie's world is filled upside down when she's forced to live in a group home and when things get even worse... she runs away. Allie and Bea was a heartwarming and emotional read about two unlikely characters! I loved the writing, the story and pace of it, the characters, and the relationships that formed pretty much out of necessity. This is a great beach read! Full Review --> https://youtu.be/T_JjEI4qTuQ"}, {"userName": "Harvee", "userReviewDate": "Mar 07, 2017", "userURL": "http://www.goodreads.com/user/show/2185693-harvee", "userReview": "Two vagabonds escape from unpleasant circumstances and have a grand adventure on the California and NW coast, traveling on an old bus turned camper. They are Allie, age 15, and Bea, age 70 plus. Delightful."}, {"userName": "Books and Spoons", "userReviewDate": "May 30, 2017", "userURL": "http://www.goodreads.com/user/show/23424877-books-and-spoons", "userReview": "When I was offered Allie and Bea to read for a review I didn't hesitate for a minute. Pay It Forward, the author's previous book, changed my life, and how I look at life, and to have the chance to be part of this virtual tour for Allie and Bea is an honor that I humbly accepted. And the journey Allie and Bea take, both mentally and physically, astonished me with the realistic and sober look at life, and how easy it is to shatter the frames of the life we live, rarely with a little care or thought for tomorrow. This is not one of those stories that you read through one night, write a review, and move on with your life. To fully grasp the life-changing potential of the story, I needed to let it sit for a little while, and ponder about it. The blurb sets the scene for the story in an excellent way. Both Allie and Bea end up homeless, living together in a van, depending on each other to survive. Either of them is fully responsible for their own predicament, how their lives end being what it is today. But they don't have the luxury of blaming others or share the responsibility with someone else. They are on their own and often at the mercy of the strangers that they meet during their journey.The story mesmerized my mind, it was not possible to stay as an observer looking at these two women at the opposite stages of life, trying to make it for one more day. The author dissect the human nature in a brilliant way, showing how easy it is to slip from the main flow of life, and how fast your morals, your ethics, your sense of right and wrong changes, when it comes to your own survival, when you are hungry, penniless, and in a need of place to sleep. When your basic needs have not been met the compromises can come effortlessly. The 'truths' we often take as a necessity, because that's just how things are, are put into a question in the story and shown in a new light. The way most people look at homelessness, and people living off from their cars, change because, in reality, they are just like you and me. How fragile is our lifestyle? How secure are we with our financial situation? How many hits can my own economy take before I'm living on the streets? It doesn't necessarily take a storm to blow away the house of cards we have built, the privileges we take as self-evident rights.Every person Allie and Bea meet end up making an impact on them, whether a good or bad. Sometimes it is an act of kindness that makes a change to their desired destination, sometimes just a word that makes them reflect on their own actions. I was left wondering how little it can take from me, in my interactions with others, to actually make a life-changing difference to someone else. Be careful what you say or do, you never know what kind of ripple effect it has on your environment and the world at large. Both Allie and Bea change and grow as human beings and women through their time together. They share their lives, their life stories, their hopes, and their disappointments. Allie and Bea decide to look at their trip as an adventure, something positive and exciting to look forward to, instead of an escape from the realities they left behind, to that place where home used to be. Until it comes the time to face it all again. Allie and Bea is a beautiful story of survival, friendship, and kindred hearts. It is an honest and raw look at the human mind, the fragility of the western lifestyle and the standards we have created over the years and decades. It is an adventure of a mind and an experience that can make you take a new, fresh look at your life if your heart is open to it and to the change it can generate. It is a story that upon finishing it I immediately texted my sister and said 'you need to check this book out' because I wanted to share the transformative effect it had on me. It is an epic story that I want to keep reading again, just to remind myself not to take anything for granted and to be kind to strangers. I want to keep the spirit of Allie and Bea's story alive in my heart, just like Pay It Forward still has an effect in my daily actions and decisions.~ Five Spoons"}, {"userName": "Deanna Sletten", "userReviewDate": "Apr 08, 2017", "userURL": "http://www.goodreads.com/user/show/1314150-deanna-sletten", "userReview": "Bea is an elderly woman living month-to-month on her Social Security check and barely able to make ends meet. When she is scammed out of the last of her money, she devises a plan: she’ll pack up her van and live as best she can on the road. But she’s decided that the world owes her now, and as far as she’s concerned, anything goes.Allie’s parents are arrested and she is left to fend for herself in a group home. Allie isn’t street-wise, so living within the system is difficult for her to understand. She has a great sense of right and wrong, and has trouble when others cross that line. When her life is put in danger, she runs, and circumstances bring her right in Bea’s path.Allie and Bea is a heartwarming story of two strangers being thrust together and trying to make the best of it. Author Catherine Ryan Hyde is an expert at creating real-life characters and putting them into extraordinary circumstances and then seeing how they cope. Bea is tired of being pushed around by society after working for years and being left with nothing. Allie has never thought twice about her upper-class upbringing until it all comes crashing down around her. Together, the two learn what is most important in life as they build a bond of friendship between them. This story is a definite must-read.(I received a copy of this novel from NetGalley and the publisher in exchange for my honest review.)"}, {"userName": "Vannetta Chapman", "userReviewDate": "Jun 05, 2017", "userURL": "http://www.goodreads.com/user/show/3927146-vannetta-chapman", "userReview": "Catherine Ryan Hyde never disappoints. This book caused me to look at what I have differently. It also helped me to think differently about other people who are in more desperate situations. So yeah...it was great. I hope you'll give it a try!"}, {"userName": "Paula Sealey", "userReviewDate": "Mar 07, 2018", "userURL": "http://www.goodreads.com/user/show/2650544-paula-sealey", "userReview": "I've loved every book from this author I've read so far. Her writing captures the trials people face so beautifully and I always find myself fully immersed in the plot and rooting for the characters. This book is no different and it charmed me from the start.After the passing of her husband, Bea has lived alone, struggling to make ends meet. When she falls victim to a scammer and is left penniless, she has no choice but to leave her home and live in her van. Taking only her cat, favourite chair and a few necessities, she sets off on the road, unsure how she will survive each day. Then she meets Allie, a young girl who through no fault of her own has also found herself homeless. As they embark on a journey in the van, they begin to form a friendship that sees both of them change their outlook on life.Thoughtful and truly heartwarming, I loved this uplifting story about hope, kindness and friendship."}, {"userName": "Suze Lavender", "userReviewDate": "May 24, 2017", "userURL": "http://www.goodreads.com/user/show/29148122-suze-lavender", "userReview": "Bea's husband hasn't left her much money and the Social Security check she receives every month isn't enough to cover her costs. She's almost run out of money and loses everything she has left to pay her bills with because of a telephone scam. Bea now only has her van and as she can't pay the rent of her trailer anymore she's homeless. She takes her cat and decides to make the most of her days by driving along the Pacific Coast. The only problem is that she doesn't have money for food or gas, so she has to be creative to make others pay for even her most basic needs.Allie's parents have been arrested for tax fraud. Allie doesn't have any family she can stay with and her parents don't have close friends who can take her in either. This means Allie is being sent to a group home. Allie is afraid, because her roommate is a dangerous girl who's threatened to harm her. She tries to escape, but once she's on the streets more danger awaits her. Allie doesn't have anyone left and nowhere to go, until she meets Bea. Bea reluctantly agrees to take Allie with her, but traveling with a fifteen-year-old is the last thing she thinks she wants. However, when the days go by Bea and Allie are actually starting to enjoy themselves. Will they be okay in each other's company?Allie and Bea is a fantastic story about the incredibly journey of an old lady and a young girl. Allie and Bea meet by chance and find out they are both struggling with the same issue, they don't have a place to stay and they don't have any money. Allie is quite naïve and Bea hasn't seen much of the world. They learn from each other and become equals, which is something I loved about their story. Allie has to grow up quickly and she's surprisingly wise for a girl her age. Bea is a clever lady and together they manage to eat and find places to stay. Their journey is unusual and while seeing the beautiful Pacific Coast they're forming a terrific interesting connection.Catherine Ryan Hyde writes about a unique bond between two people who couldn't be more different from each other. Allie is young and grew up in a wealthy environment and Bea is old and has been poor her entire life, but they do find things they have in common, which is something I really enjoyed about their story. I love the way Catherine Ryan Hyde describes what they're going through, she does this with warmth, empathy and honesty. It was easy to connect with the main characters and their adventures sometimes brought tears to my eyes, but they also made me smile on a regular basis. I loved this story from beginning to end and highly recommend it. Allie and Bea are very special main characters and their story is absolutely brilliant."}, {"userName": "Donna Hines", "userReviewDate": "Jun 23, 2017", "userURL": "http://www.goodreads.com/user/show/47259487-donna-hines", "userReview": "\"Life is so much different from the bottom looking up.\"Catherine Ryan Hyde was able to capture perfectly how you can how very different situations ending up with one same result and outcome. Allie had almost everything and Bea had been left with nearly nothing. Yet their two worlds collide and friendships and something a bit more become reality.Homelessness is something we as a society dislike addressing while the problem is becoming more and more widespread.These characters Allie ( 15yo teen) and Bea ( older women never tell) are simply exquisite. The ease with which they are brought together in the plot is a true breath of fresh air. I honestly never expected the outcome but it was such a quick read that I polished this off in one day.It's funny how sometimes all roads lead to the same spot. How material possessions seem important yet hold very little monetary value when you have nothing but the shirt on your back.Having myself been homeless after abuse I could relate to both characters. I was in my late 30's when I separated and subsequently divorced in my early 40's. Living a life on the run, on the road, without family is not an easy task for anyone much less the characters here.Anyone could have the same results as we are all just one paycheck, one unexpected outcome, one medical set back away from disaster.This story was about finding yourself and finding strength in unexpected places. You never know when you have to depend upon someone else fully. So many external factors control how you decide to live and function daily especially in this case with foster homes , ward of state, juvenile detention centers.We often wish to make our own choices but often those choices are made for us.But if we had the choice between being rich or poor what would we truly choose? Is it better to have more or live comfortably with less?I can tell you that the answer may just surprise you especially if you lose it all as these characters learned. When I lost everything the house was no longer a house but simply walls as without love it's nothing meaningful. The material possessions were mere possessions without the sentimental and emotional attachments. Friendships often will surprise you when you have nothing to offer but your time and energy. Yet life goes on and we all must continue to grow.So this is their growth together...Love this novel."}, {"userName": "Carie", "userReviewDate": "Apr 07, 2018", "userURL": "http://www.goodreads.com/user/show/5174238-carie", "userReview": "Light, easy, uplifting read. I gave it a 3 star and not a 4 star because the beginning of the book had a nice pace to it while the last half dragged on."}, {"userName": "Mari", "userReviewDate": "Nov 27, 2017", "userURL": "http://www.goodreads.com/user/show/2062840-mari", "userReview": "This was a KU read and listen. I mostly read the book. Bea is a senior citizen, widowed and is facing financial woes. She rents and lives in a trailer she and her husband once owned. To pay off medical expenses it was sold to the trailer park. She becomes the victim of scammers pretending to be the IRS. With no way to raise the money she needs to pay her bills she decides to abandon everything to travel and live in her old van. Along with her 18 year old cat Bea hits the road.Allie is a 15 year old who always had the good life. Everything changed the day her upper middle class parents were arrested by federal agents for tax evasion. Allie is thrust into the world of group homes. During her short stay she is bullied and her belongings are stolen. The kid is a vegan and no state juvenile home is equipped to deal with a vegan. After running away from the group home things only get worse and Allie narrowly escapes being taken by a human trafficking ring.Allie jumps into Bea's van and their relationship starts. I liked the writing and I liked Allie. She's an extremely honest and moral kid. Bea on the other hand easily slips into the role of scamming people. Getting others to pay for her gas or stealing cell phones that she can pawn. I didn't care much for her character. I didn't find the ending very satisfying. I only saw a situation where Bea is secure and able to live off Allie and her family. Just another type of scam.3 *****"}, {"userName": "The Blonde Bookworm", "userReviewDate": "Jun 04, 2017", "userURL": "http://www.goodreads.com/user/show/30381260-the-blonde-bookworm", "userReview": "What an adorable story! This was my first book by Catherine Ryan Hyde and I will definitely be picking up more of her work in the future. The story was touching, the characters were relatable, and I was so sad to see the story end. I want more Allie and Bea! I started reading late one night and ended up staying up until I finished it. I'll be honest, I thought it was going to be just another cutesy contemporary, but it was so so much more. Bea is a widow who recently ran out of funds. She's on her own in her van when she comes across Allie in the middle of the road, a young girl who has just been placed in the foster system after a dramatic change in her life. Two unlikely characters are forced together, and they begin to learn things from one another whether they want to or not. Both ladies have something special about them that really draws the reader in and makes them so incredibly likable. Allie and Bea is a funny, touching, and thought provoking novel about two unlikely friends. It is filled with laughs, a few tears, some moments that really make you stop and think, and lots of love. I truly enjoyed the story and look forward to reading more novels written by Hyde. I would highly recommend this novel to someone looking for a fun summer read!"}, {"userName": "Jennifer Fromke", "userReviewDate": "Sep 28, 2017", "userURL": "http://www.goodreads.com/user/show/4121942-jennifer-fromke", "userReview": "Two women separated by six decades find each other by chance, just when each needs the other most. A septuagenarian widow gets snookered out of her entire bank account by a telephone con. An upper-class girl watches as her parents are arrested and sent to jail, and she ends up in the system, which lets her down. It’s a road trip story from California to the northern-most tip of Washington State. There are beaches and gas stations and fascinating “windshield” conversations. Each woman has something to learn, and also something to teach. They will meet people, cheat people, greet people, and then watch them disappear in the rearview mirror. It’s a small story about ordinary people, but it’s also a huge story about two individuals whose lives are turned upside down. This author has a way of making the reader feel all the feels. The novel is a symphony of feeling, that depicts a wonderful relationship between two people who never should have met, and both of whom will never be the same because of it."}, {"userName": "Christine Moore", "userReviewDate": "Apr 02, 2017", "userURL": "http://www.goodreads.com/user/show/16231256-christine-moore", "userReview": "Bea is in her 70's living alone and barely making ends meet when she is the victim of a telephone scam. She packs up her belongings and loads up her van and starts driving. Allie is 15 when both her parents are arrested for tax fraud and she is sent to a group home. Her roommate is violent and threatens Allie so she runs away with another girl. Allie runs away from a very dangerous situation and right into Bea! They end up driving together along the West Coast. At first things are a bit tricky but they soon fall into friends and helping each other. This is a story of family and what makes a family. It shows you that you don't have to be blood related to be family and love and support each other. Thank you to NetGalley and Lake Union Publishing for an ARC of this book in return for an honest review."}], "description": "Bea has barely been scraping by since her husband died. After falling for a telephone scam, she loses everything and is forced to abandon her trailer. With only two-thirds of a tank in her old van, she heads toward the Pacific Ocean with her cat—on a mission to reclaim what’s rightfully hers, even if it means making others pay for what she lost.When fifteen-year-old Allie’s parents are jailed for tax fraud, she’s sent to a group home. But when her life is threatened by another resident, she knows she has to get out. She escapes only to find she has nowhere to go—until fate throws Allie in Bea’s path.Reluctant to trust each other, much less become friends, the two warily make their way up the Pacific Coast. Yet as their hearts open to friendship and love from the strangers they meet on their journey, they find the courage to forge their own unique family—and begin to see an imperfect world with new eyes.Length: 10 hrs and 35 mins", "title": "Allie and Bea", "url": "https://www.goodreads.com/book/show/32852236-allie-and-bea", "average": 4.23, "cover": "https://images.gr-assets.com/books/1492442112l/32852236.jpg", "reviews": 887, "authors": [{"url": "https://www.goodreads.com/author/show/126447.Catherine_Ryan_Hyde", "name": "Catherine Ryan Hyde"}], "type": ["Fiction", "Womens Fiction", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/32852236-allie-and-bea", "http://www.goodreads.com/book/show/32852231-allie-and-bea", "http://www.goodreads.com/book/show/33389838-allie-and-bea", "http://www.goodreads.com/book/show/215631.Pay_It_Forward", "http://www.goodreads.com/book/show/6780660-when-i-found-you", "http://www.goodreads.com/book/show/19355355-take-me-with-you", "http://www.goodreads.com/book/show/30184217-say-goodbye-for-now", "http://www.goodreads.com/book/show/25526969-ask-him-why"]}