{"ratings": 462, "userreviews": [{"userName": "Autumn", "userReviewDate": "Feb 25, 2011", "userURL": "http://www.goodreads.com/user/show/2871424-autumn", "userReview": "This is a beautifully written story, with a heartbreaking finale that sneaks up on you like a gator in dark water. You might see it's yellow eye, or the swirl of water, but by the time you realize what's coming--it's got you. I started reading Alligator Bayou on a whim, because it had a good title, a lovely cover, and I'm a sucker for Southern fiction. I was immediately impressed with Napoli's lean yet evocative style. Her characters were flesh and blood in my mind with just a few quick sentences. I loved Cirone and his yearning to be American, Calogero and his sweet affection for his family and Patricia...all of the characters, even secondary characters, were vibrant and breathing on the page. Even Bedda the goat. The prose is deceptively easy, because the story of Alligator Bayou is anything but. When I reached the climax and saw how it was all going to end, I almost couldn't take it. It was too unfair, and too real--too close to history. Of course, it was how the story had to end--the entire tale had been leading up to this catastrophe, and I would have no doubt been disappointed by a saccharine \"Happily Ever After\" ending, but that knowledge didn't make this ending any less heartbreaking.Read Alligator Bayou. It's not a sweet, simple little YA novel. It's a powerful, emotional story of what it means to belong, and what it means to be different."}, {"userName": "Nicole", "userReviewDate": "Jan 19, 2010", "userURL": "http://www.goodreads.com/user/show/1118065-nicole", "userReview": "Holy darkness, Batman. Dark setting, dark plot, dark skin color.There is something so perfect about the way Napoli has blended the dark, mysterious swamp with the intolerance of the white characters for the Black and Italian characters. There is a dark undercurrent running through the very fiber of this book. It may or may not have been made with natural swamp grass and recycled racial profiling flyers.It was an uncomfortable read, but well worth the time.As for the ending, well, there was very little sugar-coating. I approved. It was realistic (and based on true fact) and while I don't think that protagonist would have escaped in real life I can hardly fault Napoli for trying to infuse a sprinkling of hope into her dark, dark text."}, {"userName": "Mary", "userReviewDate": "May 23, 2011", "userURL": "http://www.goodreads.com/user/show/1430086-mary", "userReview": "While I always understood intellectually that immigrants had been discriminated against, I did not realize two of the underlying reasons. First, some nationalities (such as the Italians in this book) were viewed as a separate race. Not white, not black. Different. Second, the fear of immigrants' success was an economic reason to discriminate against them. Donna Jo Napoli does an amazing job of bringing turn-of-the-century (1899) Louisiana to life."}, {"userName": "Zoë", "userReviewDate": "Jan 29, 2018", "userURL": "http://www.goodreads.com/user/show/16281487-zo", "userReview": "This Sicilian family and all of their quirks were interesting to get to know. The book itself really explores some issues of bigotry and race and as Donna Jo Napoli describes it, calculated evil that can even be juxtaposed to the present world we live in. I enjoyed it nonetheless, I knew the ending would n't be happy but I didn't think it would've played out just like that. In hindsight, I should've saw it coming, the foreshadowing was there."}, {"userName": "Katie Young", "userReviewDate": "Apr 08, 2012", "userURL": "http://www.goodreads.com/user/show/7598928-katie-young", "userReview": "Katie YoungHistorical FictionThis book is based on a lynching of Sicilian grocery store owners in Tallulah, LA in 1899. 14 year old Calogero came to America from Sicily after his mother dies to live with his uncles and cousin and help them with their grocery. During this time in the South, blacks were subject to the Jim Crow laws which segregated them from the whites as well as the Italians. Calo was a hard worker for his uncles, spent Sundays learning American ways with a tutor, spent free time alligator hunting with his friends who happened to be black, and took a special interest in their sister Patricia. Being Catholic, immigrants, and friendly towards blacks eventually leads to their hanging. All of his uncles and cousin are hanged and shot but Calo escapes with the help of Joseph, the sole survivor of the Tunica Tribe. This book gives insight into a small piece of American history. The story is told by Calo and readers learn right along with him how difficult it is to exist as a black or Italian in the South with all the social tensions, rules, and violence. This was a great book and easy read. I experienced happiness, pity, anger, sadness, and relief as I followed along Calo’s story. It would be a great addition to any Young Adult collection."}, {"userName": "Mallori Allphin", "userReviewDate": "Apr 24, 2014", "userURL": "http://www.goodreads.com/user/show/27851189-mallori-allphin", "userReview": "This is a fantastic story that presents the searing truths and hardships of immigration in the South during the time of Jim Crowe Laws. It is an unforgettable story about a 14 year old Sicilian immigrant boy named Calogero, who lives in Tallulah with his uncles and cousin. Each day provides a new struggle for these foreigners are they desperately try to feel accepted and escape hatred from their community while running a grocery fruit stand. While some are accepting of him and his family, others are against them, leaving them trapped in the middle of a potentially violent community tension. After facing a terrifying encounter in the swamps of the alligator bayou, Calogero comes to face the hard truth that there truly are more terrible things than the honest gators in the swamp. Although it is not a book that I could necessarily introduce in my future classroom, it is a novel that I think depicts truth and provides incredible insights, which I think is a valuable quality of any piece of global literature."}, {"userName": "Nikki", "userReviewDate": "Dec 27, 2009", "userURL": "http://www.goodreads.com/user/show/1733601-nikki", "userReview": "The book had an interesting idea/topic for a book yet the author's writing was non-descript and unappealing."}, {"userName": "Barbara", "userReviewDate": "May 15, 2018", "userURL": "http://www.goodreads.com/user/show/1222379-barbara", "userReview": "It's hard to believe that the events that occur in this story can actually have occurred, but the story is based on actual events in 1899 in Tallulah, a small Louisiana town. Prejudices come in various forms, of course, and being white but foreign often served as little protection when someone wanted something you had or when you stepped out of your place. These are parts of human nature and expected social mores that the author, Donna Jo Napoli, masterfully reveals in small actions that lead to tragedy. The story centers on Calogero, 14, who lives with his uncles and cousins, all from Sicily, and working hard to make a living. They grow produce and sell their vegetables at a stand and a grocery store. But Calogero quickly realizes that this rural community does not necessarily welcome outsiders, and there are those who are envious of his family's economic success. He's drawn to some of the unique dangers and pleasures of the place--hunting an alligator in the bayou late at night--and enjoying delicious foods prepared by the mother of Patricia, a smart and generous black girl who helps him see how differently blacks and whites in the town live. The author captures beautifully the lush natural surroundings, the heat and humidity of this geographical spot, and the escalating fears many of the locals have about Calogero's family and their interactions with others. The annoyance of some of the town's citizens at their innocent breaking of rules when it comes to interacting with the black citizens is quite clear just as is the confusion and frustration that many of the Italian men felt at being accused of breaking rules they didn't even know existed and then being unable to explain oneself due to the language barrier. Readers will be caught up in the story, a little-known part of Louisiana history, even while fearing the worst as things come to a head. The conclusion had my heart pounding desperately as I couldn't believe what I was reading had actually happened. Some teen readers will be put off by the descriptions in the book, but they should be patient and perhaps sip this book slowly since the story is worth the time and effort."}, {"userName": "Cathy", "userReviewDate": "Nov 23, 2017", "userURL": "http://www.goodreads.com/user/show/108264-cathy", "userReview": "I'd sort of vaguely heard about racism against Italians in the 1800s and early 1900s, but this brought it home by showcasing the lives of a family of Sicilian immigrants in Louisiana as they interacted with their black and white neighbors and tried to navigate the treacheries of Jim Crow laws. Based on a true story, it's got a slow build and a devastating ending."}, {"userName": "Maria", "userReviewDate": "Jun 03, 2018", "userURL": "http://www.goodreads.com/user/show/2740687-maria", "userReview": "This is a must-read for anyone one of Sicilian heritage from South Louisiana. We are too quick to forget our own immigration stories and the obstacles and resistance our ancestors faced when making a new life in this foreign land."}, {"userName": "Margo Tanenbaum", "userReviewDate": "Jun 10, 2010", "userURL": "http://www.goodreads.com/user/show/3671939-margo-tanenbaum", "userReview": "One of the reasons I enjoy historical fiction is that it offers the opportunity to learn about little known episodes in our country's history, wrapped in the context of a compelling story. In writing Alligator Bayou, Donna Jo Napoli was inspired by a newspaper account about five Sicilian grocers in a small town in Louisiana who served a black customer who had entered the store first before a white one--and ended up lynched by a town mob. Many of the characters in the novel are based on the actual historical figures, but Napoli added a sixth grocer, a teenaged boy, Calogero. He and his relatives from Sicily don't understand the Jim Crow laws of the South, and when they shake hands with black boys their age, the other boys are speechless with surprise. Calogero takes a liking to Patricia, a very attractive black girl in the community, and she's attracted to him as well--but they have to keep their relationship secret. The Sicilians are not accepted by the white people in the town, who call them names and think they are all violent criminals and Mafia members. The black residents are kinder, even inviting Calogero and his cousins to a graduation party, where they are the only white guests, and inviting them to share a Fourth of July get-together.Trouble is brewing in the small town, though, and it's not only because Calogero gets in trouble for going on a night-time alligator hunt in the swamps or because he wants to go to the neighborhood black school. The grocers' goats, who are left free to wander around at night, keep congregating on the porch of the town's doctor, Dr. Hodge. When they hear shots in the night, they discover that Hodge has made good on his threat to shoot the goats if they keep coming onto his property. Soon there is altercation between the doctor and the Sicilian grocers, and Calogero must run for safety. Will he escape the wrath of the local mob?This novel delves into many prejudices prevalent in post-Civil War Louisiana; we see not only the expected racial divisions between blacks and whites, but also the hatred for the Italian immigrants, who poured into Louisiana through the port of New Orleans during the latter part of the 19th century, largely to work on sugar plantations. The terrible conclusion of this story is a lesson in the importance of tolerance, the evil of bigotry, and the need to get along with our neighbors from all countries, a lesson that is, unfortunately, still necessary in our multicultural society. Alligator Bayou has received numerous awards, including the American Library Association Top Ten Best Books for Young Adults, Parents' Choice Gold Award for Historical Fiction, and International Reading Association's (IRA) Notable Books for a Global Society."}, {"userName": "Tammy", "userReviewDate": "Jan 12, 2016", "userURL": "http://www.goodreads.com/user/show/8435719-tammy", "userReview": "ISBN / 9780553494174The storyline of this book is extremely fast paced, beginning with Calo and his cousin running in the night through a field only to be faced by a panther. The story is told from the point of view of Calo, a 14 year-old who has come from Sicily after his mother’s death to live with his uncles in Tallulah, Louisiana, in 1899. These Sicilian uncles live together. They own and operate a vegetable store in the center of town and a vegetable stand on the outskirts of town. The town seems to be a whirlwind of tension, prejudice and bigotry. His uncles are fighting with white people because their business sells food to black customers and the doctor is fighting because the goats are on his property. The black people are giving Calo a hard time because he likes Patricia. Each misunderstanding and act of intolerance leads to more fights as xenophobia fills the air. Just like there are two belief systems in this book, there are also two distinct types of language. The first is a fast-paced broken Italian / English, the second is that of a slower southern drawl. This type of dialog keep the story realistic for the time and place. However, there is foreshadowing by a neutral character named Frank who is a white visitor from the north. He clearly states that “In a small town, every window is an eye.” This line stuck with me throughout the story as the Sicilians and blacks became friendlier and whites kept watch and tried enforce the Jim Crow laws. What we find in the end is that these sets of eyes now became a mob of people who decided to play judge, jury and prosecuting attorney for the Sicilian uncles who did not even comprehend that they were on trial. The blacks help Calo escape to freedom through the Mississippi River, and it is ended with Patricia’s quote, “Every human being got his race to run.” And so as in the opening, Calo is off on yet another courageous race. This book offers back matter such as an afterward and notes on research that was really useful in bringing this event out of history and into the light. I would recommend this book for ages 14 and up and could book talk it by comparing it with To Kill a Mockingbird."}, {"userName": "Cindy Hudson", "userReviewDate": "Jan 06, 2010", "userURL": "http://www.goodreads.com/user/show/903478-cindy-hudson", "userReview": "Calogero is a 14-year-old immigrant to Louisiana from Sicily, and he lives in the small town of Tallulah where his cousins and uncles sell groceries and produce. The year is 1899, and the small band of Sicilians find the constraints that won’t let them mingle with whites because their skin is dark also keeps them from socializing with blacks.Calogero and his 13-year-old cousin Cirone are lonely and want to fit in: they work to learn English, eat American food and try to learn the customs of their new country. But tight economic times lead to tension between the white Louisianans and the Sicilians, who the whites see as taking business away from them. When Calogero and his relatives become friends with blacks, tensions escalate.Based on a true event, Alligator Bayou by Donna Jo Napoli brings this powerful clash of cultures to life with tales of alligator hunts in the bayou, Italian immigrant communities, picking cotton, selling watermelons, cooking sweet potatoes and eating alligator.This tale reminds us that the immigrant story in the U.S., like the story between whites and blacks, was and is often wrought with difficulties. The story was particularly poignant for me, because I grew up in Louisiana amongst many long-established Italians, and I had no idea of the hardships many of their ancestors endured so their descendents could one day become part of the accepted American community.Napoli understands the time period she writes of well, and there are references to the all-but-gone Tunica tribe of Mississippi and Louisiana and the 1890 U.S. Census, in which some blacks found out for the first time they were free from slavery. It’s truly amazing to look back on the time and issues that dominated the day: Jim Crow laws, the relationship between white and blacks, and the threat immigrants posed to the normal routine of life. Mother-daughter book clubs with girls in sixth to eighth grade will find a lot to talk about."}, {"userName": "Larissa", "userReviewDate": "Jan 03, 2010", "userURL": "http://www.goodreads.com/user/show/2727293-larissa", "userReview": "Alligator Bayou takes place in Tallulah, Louisiana. 1899. Calogero – fourteen, recently emigrated from Sicily, Italy. He lives with five other Sicilian men who took him in when his mother died. He works for them selling fruits and vegetables at their stand and grocery store. He has many of the same concerns any other fourteen year old would have. He has strong feeling for Patricia, an intelligent African-American girl and to befriend her brother Charles. Jim Crow laws stated that Sicilian people are not allowed to mix with African-American’s. This made it hard to show his feelings in public to those he loved. Calogero works hard and is devoted to his new family. Problems arise, as the town grows more racist towards Italians. When one of his “uncle’s” shoots back at the town doctor in self defense (and only wounds his leg) rumors spread quickly that the Sicilians killed their town doctor. Calogero’s family pays a deathly consequence and are brought to the slaughterhouse. Will Calogero run free or suffer a horrible death?Over the span of reading this book I made a text-to-world connection. Many innocent Italian’s were lynched for no other reason then their heritage. Like Calogero many Italian’s faced severe discrimination and had their self-esteem lowered on a regular basis. Italian immigration began in the 1850’s, and like all other races the new one is always segregate against. Eventually Italian’s were accepted as Caucasians and had a place in society. I would definitely give Alligator Bayou 5 stars. It was one of the most engaging and well-written books I have ever read. I highly recommend it for anyone at any age. If you liked this review you may like to read other books by: Donna Jo Napoli such as The Great God Pan ECT. This book takes you on a journey from one set of drama to the next. It is full of love, devotion and rejection."}, {"userName": "Judy Jones", "userReviewDate": "Jan 18, 2016", "userURL": "http://www.goodreads.com/user/show/51554624-judy-jones", "userReview": "Although I thought some of the language was a little forced and less than realistic, Napoli relates a good, albeit painful, story of prejudice against Italians in turn of the century (early 1900s) southern Louisiana. Francesco and his brothers have moved from New Orleans to Tallulah after the lynching of eleven Sicilians there. They have been established in Tallulah for several years and are known for their fresh fruits and vegetables throughout the area. While their fame for good produce brings them business, it also raises ire among local businessmen who lose business because the Italians' produce is so much better. Calogero is fourteen years old; he has come to Louisiana from Italy to live with his uncles because his mother has died, and no one knows where his father lives. His younger brother Rocco is still in Italy. Calo doesn't always remember to do what his uncles tell him to do and is often in trouble. He works at the produce stand and the grocery that his uncles run. One night he forgets to tie up his Uncle Francesco's favorite goat. His oversight leads to tragedy for the entire family.Throughout the story, Calogero expresses confusion as to why his people aren't accepted. The whites don't want them, and the blacks are afraid to fraternize with them. He does befriend a black girl and her brothers, and they ultimately help save his life. Calogero's Napoli reveals a culture of ignorance that punishes those who are different. According to the afterword, she based several of her characters on people she read about in newspaper accounts about the incidents in New Orleans and Tallulah. She said she believes that the violence ultimately sprang from economic downturns that the white citizens blamed on the Sicilians.I would recommend this book to my students."}, {"userName": "Carrie G", "userReviewDate": "Oct 04, 2014", "userURL": "http://www.goodreads.com/user/show/9783165-carrie-g", "userReview": "\"This is a story that hurts. But pain isn't always bad. Pain can help us gain empathy that compels us to act decently. We can't afford to be ignorant about bigotry. Not in our history. Not in our present day.\" These are the words that Donna Jo Napoli ends her Afterword section with. I can't think of a more true or fitting ending to this heart-wrenching book. \"Alligator Bayou\" is based on a true story of racism and bigotry in Tallulah, LA in the 1890's. It is the true part of the story (which seems to be most everything except for the actual characters words and thoughts) that is so devastating. Calogero is a young Sicilian orphan who has been sent to America to live with his father's \"cousins,\" four Sicilian men and a boy about his age. These men are trying to carve out a new life, a quiet life, a simple life as produce sellers in Louisiana. All they want is to enjoy the freedom and bounty a life in America offers. Instead, what they get is distrust, anger, hatred, abuse.... I was SHOCKED when I read this book for the first time four or five years ago. And I was shocked when I read it again this year. I had NO IDEA that events like this were part of our American history. This is definitely a story that needs to be told. According to the Accelerated Reading program, this book is only a late 2nd grade to early 3rd grade reading level, but I can tell you from teaching experience that this leveling is deceptive. However, this book would be excellent as an alternative text for students unable to handle a more complex book like \"To Kill a Mockingbird.\" Both deal with themes of racism and injustice in the Southern United States."}, {"userName": "Joy E. Rancatore", "userReviewDate": "Jan 15, 2011", "userURL": "http://www.goodreads.com/user/show/4407732-joy-e-rancatore", "userReview": "Moments ago I laid down Alligator Bayou by Donna Jo Napoli, and I'm still a bit at a loss for words.The book itself was well-written, engaging--a real page-turner. It was a quick and easy read and should be on any english teacher's list for high school students, especially in Louisiana or anywhere with a Sicilian immigrant presence in the area's history.Napoli obviously spent much time in researching this book--from the language of the day to the cultural and economic details of Louisiana in the late 1800s. Her story, while a fictional work, is based on a true story in Tallulah, La., in 1899. I was thrilled to find her \"Notes on Research\" in the back of the book. I love reading historical fiction, but I always find myself wondering how much was fiction and how much was history; Napoli doesn't leave her readers wondering! In fact, she sends her readers off with the tools to do their own research on the topic of Sicilian immigrants in the United States and the hardships they faced.As a teacher, I will put Alligator Bayou on my reading list. As a writer, I have gained a renewed inspiration to pursue more historical fiction projects. I have always wanted to research and write about my Scottish and French relatives who came to America, not all that many years ago. Now, I also want to research and write about my husband's Sicilian forefathers. I must admit, until reading this book, I was ignorant to just how difficult and dangerous life was for Italian immigrants in this country.I close with a quote from Napoli's Afterword: \"This is a story that hurts. But pain isn't always bad. Pain can help us gain the empathy that compels us to act decently. We can't afford to be ignorant about bigotry. Not in our history. Not in our present day.\""}, {"userName": "Eddie", "userReviewDate": "Mar 02, 2016", "userURL": "http://www.goodreads.com/user/show/53286035-eddie", "userReview": "I give this book a four star's , the book shows enough support of family 'which is huge thing for us . The main subject of the story is that it demonstrates enough details of neighborhood relationships such as companies , stores, and barbers which determine a good way of being happy, which it shows action. The book express ways of family that are connecting to their past'such as the members who have fallen in steps of leaving them, the book is great for those who are involved in mystery, crime, and action , romance it also show's ways for excitement for hanging out. the quotes demonstrates form of comedy and adventure for example \" A giant cat appears out in the woods, Tawny brown sleeks his back and white flecks his head and shoulders, i think i might wet my self during the process of running,\" this is a story of excitement and relationships.Calogero's is a fourteen year old has lived and very uncomfortable town where its dirty but friendly at points every day a new experience happens ''Francesco's face goes purple. \"If I let Willy Rogers get away with insulting us here, at our home, the next thing you know he'll do it in public. We'll lose customers.\" Francisco who is the main protector of the family and is well experience on what he is doing . through out the story the story gets more joy full and realistic because it shows acts that many people are bothered through the story.The book is well written book that really shows a kick of experiences and provoking which i recommend to those who love adventure, love , comedy and family."}, {"userName": "Max Willi", "userReviewDate": "Jan 31, 2016", "userURL": "http://www.goodreads.com/user/show/46183112-max-willi", "userReview": "\"Alligator Bayou\" is based upon historical events. In 1899 a small group of Sicilian immigrants negotiate the segregated society of a small northeastern Louisiana river community.The first half of the book is very slow; it seems like the author is \"beating around the bush\" in addressing the conflict. I kept asking myself, \"Ok, I get the idea of the societal friction between various races/ethnicities, but what else is going on here?\" Napoli delivers the missing ingredient to the overall conflict about half way through the novel. The second half picks more speed with the previous missing piece now disclosed and forever looming in the background. The last several chapters are intense.This is not the best book I've read in recent months. It's present Goodreads average of 3.5 is an accurate reflection due to the sluggish first half of the book. However, that said, this is a very important book for young people (and adults) to read. Prejudice is often another way of covering fear which can lead to hateful acts. The setting is 1899, but human nature doesn't really change. Even in 2016 there's ample evidence in our political proceedings of how a significant portion of our society can gravitate to the lowest common denominator when it feels cornered for any number of given reasons---security, economics, beliefs.I commend Napoli for uncovering the particulars of the 1899 events and building a story around them."}, {"userName": "Jennifer Wardrip", "userReviewDate": "Apr 08, 2009", "userURL": "http://www.goodreads.com/user/show/1125613-jennifer-wardrip", "userReview": "Reviewed by LadyJay for TeensReadToo.comIt is the year 1899. Calogero, a 14-year-old Sicilian immigrant, lives in Tallulah, Louisiana, with his uncles and cousins.They have all come to America seeking a better life. They do well for themselves, selling fruits and vegetables from a corner grocery store. They do not seek out trouble, but it always has a way of finding them.Calo and his family do not discriminate between blacks and whites. They sell to anyone who will buy their produce. Members of the town find this behavior reprehensible and disgusting. It is only a matter of time before the white citizens of Tallulah turn their backs on Calo and his family, and destroy every possible hope they had of leading quiet, normal lives.Donna Jo Napoli has done extensive research for this novel. The afterword explains that Napoli came across an article about five Sicilian grocers in Tallulah, Louisiana, who were lynched because they served a black customer before a white one. The article moved Napoli, and she felt a story must be told about these men. Napoli based her characters on those people who testified or were talked about in the testaments taken after the Tallulah lynching.The time and effort Napoli has put into her research makes the story more genuine, more affecting. It is a tragic story that ends with a glimmer of hope.Read this novel - it is a horrific reminder of what can happen when prejudice prevails and mob mentality rules over all."}, {"userName": "McNeil Inksmudge", "userReviewDate": "Jul 11, 2012", "userURL": "http://www.goodreads.com/user/show/4899532-mcneil-inksmudge", "userReview": "I must admit, knowing the credentials this author has, I was expecting something more moving, thought provoking, or controversial. Sadly, it was not what I was expecting, but thankfully, it was a good social issues book for readers even as young as tween. It was not too complex to be over their heads. And it's an underdiscussed portion of history, that even this history minior didn't know about. I enjoyed how she wrote a story based on a newspaper clipping, and researched the real persons in the tragedy, and inserted a young narrator to fill the gaps and create a cohesive story. It's tragic that the racism is true, and even that our beloved President T. Roosevelt posessed it. I found the work easy to understand, a quick read, interesting all the way through, and short -- to a fault (or boon, if your reader's attention is short).I would recommend this to any teacher in an American history unit, and also black Americans, to expand their view on who was victims in racism.Warnings:Sex - none.language - none that would last an impression on me.Drugs -alcohol, including youth drinking (but it wasn't illegal in this time, so the ethics are skewed and must be contextual to the reader).Violence - racist south, and lynchings. Those are all the words needed. But they arent done within sight of the narrator, so it's appropraite for younguns."}, {"userName": "Michaela George", "userReviewDate": "Apr 29, 2014", "userURL": "http://www.goodreads.com/user/show/30917644-michaela-george", "userReview": "Calogero who is a 14 year old boy from Sicily, he is the main character of Alligator Bayou. This book takes place in a little town in Tallulah, Louisiana. He and his uncles and cousins are immigrants and have to live during the time of the Jim Crowe Laws. Him and his family are not treated as equals and they are caught in a hard place because they can’t be friends with the Negroes, but they are not equal to white people. This is almost a harder position than the black people have, because they have no one to turn to. This story gives a perspective that you never really hear about. Calogero has a very scary encounter with a ‘gator. And almost died. Almost every day Calogero and his family come face to face with hard ships and a violent fight. This was almost a simile to the gator encounter, all of the hard things they have to go through.Critique: I think this was a cool perspective to read about. Many times you hear the stories about the African American citizens and how they were treated so unfairly, but you don't hear about other races that didn't have anywhere to turn. It was a great story about how life was at that time and how horrible it was. It really opens up your eyes to these things."}, {"userName": "Elizabeth", "userReviewDate": "Dec 20, 2009", "userURL": "http://www.goodreads.com/user/show/2490430-elizabeth", "userReview": "Alligator Bayou is a gripping novel based on a little-known, true story of Sicilian immigrants in rural 1899 Louisiana. Fourteen year-old Calogero lives and works with his uncles and cousin, raising fruits and vegetables for their successful grocery business. He tells of sunrise in bayou country, the bounty of nature, sumptuous meals, and the joys and frustrations of family, friendships, and first love. These first-person present tense descriptions are immediate and compelling. The story also has a darker side, and a feeling of menace builds as Calogero begins to understand the racial and socio-economic tensions of the South during Reconstruction. Neither white nor black, the Sicilians do not fit in, and their business acumen and willingness to befriend everyone, especially the black community, make them threatening to the whites. The story ends with violence, but not without hope. An afterword explains the historical basis for the novel and includes useful bibliographical references. As the author notes: “This is a story that hurts. But . . . . [p:]ain can help us gain the empathy that compels us to act decently. We can’t afford to be ignorant about bigotry. Not in our history. Not in our present day” (p. 277)."}, {"userName": "Jacki", "userReviewDate": "Jun 07, 2010", "userURL": "http://www.goodreads.com/user/show/966941-jacki", "userReview": "I'm a fan of Donna Jo Napoli and couldn't wait to read this story. The library edition I checked out had no blurb, and the mystery heightened my anticipation. Sadly, I was disappointed this time.Her trademark lyrical writing style was conspicuously absent and made me wish she had written in third person instead of first. I'll take her style over a believably-voiced third-person narrator any day. While I believed the narrator's voice, I didn't quite believe his naivete. Children from racial groups who face prejudice on such a scale that they are in physical danger tend to be better acquainted with the meaning of the term \"lynch,\" if for no other reason than their families make sure they know the facts of life for their own safety.The book reads a little like Tom Sawyer with simmering racial tension, and when the tension at long last hits the boiling point, it's at odds with the innocence of the other 90% of the book. I could see that the author was trying to show how the hero's childhood ends in a moment. To me, though, the ending belonged on a different book. I simply didn't see enough of a build up to the eventual tragedy.Recommend to: Age 12-14, historical fiction fansDon't recommend to: the very sensitive - scenes near the end contain graphic violence"}, {"userName": "Carol Baldwin", "userReviewDate": "May 31, 2010", "userURL": "http://www.goodreads.com/user/show/912370-carol-baldwin", "userReview": "Alligator Bayou tells the story of orphaned Calo who emigrates from Sicily in 1899 to Louisiana. He is taken in by five men and one boy, Cirone, all of whom were friends of his father. The story came from a newspaper article which Napoli found detailing how five Sicilian grocers were lynched when they served a black customer before a white one. From that tiny piece of information flows a book that is beautifully written, despite its shocking story. This is a story of bigotry, jealousy, love, hate, and survival. Calo and Cirone are more accepted by the blacks than the whites in this small community 200 miles from New Orleans. At one point one of the Sicilians relates to Calo, “The Negroes here are so much more timid than the ones in New Orleans. They won’t take your hand, no matter how far you stretch it.” (p. 108). But the boys prove them wrong. They initiate friendships with the Negroes and end up sharing adventures and celebrations with them. In an awful turn of events, these friendships lead to the lynching that takes all of Calo’s friends’ lives.  Calo’s heart-wrenching escape is facilitated by an old Indian who earlier charges him, “An orphan is free to become anything. The choice is yours.” (p. 121)"}, {"userName": "Amanda", "userReviewDate": "May 08, 2012", "userURL": "http://www.goodreads.com/user/show/929920-amanda", "userReview": "I did not particularly enjoy this novel. I did not particularly enjoy reading Bound, one of her other novels, either. I didn’t like this one because I didn’t relate well with the characters. I typically gravitate towards books with a female protagonist; this book was narrated by a male protagonist. She seemed to do a good job representing the time period and the struggles immigrants and African Americans faced. She brought the world to life through vivid details and customs and lifestyles. I would recommend this book to people who enjoy reading historical and multicultural books. This book was based on a newspaper article that reported the lynching of an entire Italian family. The protagonist is a made-up character that Napoli used to tell the story.Spoilers—Content to be aware of:Sex: a few kissesViolence: some fights, some threats, goats are shot during the night, mob violence, a man is beat in the head with the end of a gun, an Italian family is lynched (but the lynching does not happen in scene, you learn about it later)Profanity: minimal, plenty of name calling or stereotype labeling"}, {"userName": "Deanna", "userReviewDate": "Jun 25, 2009", "userURL": "http://www.goodreads.com/user/show/1676348-deanna", "userReview": "Historical fiction (1899), bigotry, racism, immigration, jim crow laws, young love, friendship, family, lynching.Based on a true story--6 Italian immigrants grow vegetables in a Louisiana town where they treat Negro people the same as white people and of course the white people are outraged by this behavior. The first 1/2 of the book was very slow. I just couldn't get into it but after the alligator scene I was hooked. Calogero and his cousin go with some Negro friends on a alligator hunt in the swamps. I didn't realize how racist white people were towards Italian immigrants in the early 1900's. They were treated as badly as Negro people.This book reminded me of todays immigrants. Many immigrant kids are like Cirone and Calogero--wanting to become American. They eat American food, act American, become American citizens. Hopefully they are not forgetting their cultures, heritages, languages, etc. Sadly, I believe we don't always look upon immigrants well. Our newspapers are full of some of the same excuses, \"immigrants are taking our jobs...\" \"our economy is bad because of immigrants...\" Fabulous book and I definitely recommend it."}, {"userName": "Danielle Larca", "userReviewDate": "Feb 05, 2011", "userURL": "http://www.goodreads.com/user/show/4533749-danielle-larca", "userReview": "Calogero lives with his uncles and cousin outside of Tallulah, Louisiana in 1899. Their family runs a grocery store, selling the best fruits and vegetables to members of the town. They are the only Sicilians in Tallulah and therefore a target. Not everyone takes kindly to the immigrants, who aren't white but aren't Negro either. Calogero doesn't fit in anywhere. Until he meets Patricia and her brother. Who happen to be black.For the first time ever, the Scalise family has friends. But fraternizing with Negros makes the white townspeople detest them even more. As tensions mount and lies run rampant, Calogero is forced to make some difficult decisions and bear the brunt of unspeakable bigotry. Based on a true story, Napoli explores other forms of racism in the south during the American Reconstruction. We often reduce the story to white and black, but forget that others were caught in the crossfire as well. Alligator Bayou is a quick read, but it will leave you pondering the effects of hatred, ignorance, and violence as our country struggled to rebuild itself-and how those forces can still be seen at work today."}, {"userName": "Claire", "userReviewDate": "Nov 16, 2008", "userURL": "http://www.goodreads.com/user/show/1703640-claire", "userReview": "A Louisiana story set just after the civil war. The Americans have settled in Louisiana, they are asserting their ownership of the former French colony and their position in the society and economics of the area. Times are grim in Italy for Cologaro's family and he crosses the ocean to join fellow Sicilians in a small town north of New Orleans. Industrious, savvy, ambitious and knowledgeable his little 'family' has a farm, a fruit stand and a store that are profitable and thriving. What they don't have is community or friends. In her excellently crafted telling of a little known part of history and Jim Crow Napoli tells us exactly what happened in the bayou and chillingly explains the roots of some of the cruelest of human impulses. Written for older children 12 on up to high school, this story is a great starting point for discussion of history and also how these same motives are at play in today's news stories. With this information, it is up to us to make the daily news better. The books does slow in places, I am glad I stuck with it."}, {"userName": "Kristi", "userReviewDate": "May 05, 2011", "userURL": "http://www.goodreads.com/user/show/4773578-kristi", "userReview": "What I really liked about this novel was the multicultural layer to the text. It really gave the relationships between the characters an extra intriguing layer. I had not learned about Sicilian prejudice in the South so this novel opened that area up for me. I thought the \"love\" between Calogero and Patricia was adorable and sweet!That being said, the plot rarely captivated me. The only time I got really caught up in the plot was the last 20 pages or so, where I found myself furiously turning the pages to see how the novel turned out (though it was foreshadowed earlier). I did like that Napoli chose to end the book the way she did; though not a \"happy\" ending, the story was realistic and made sense within the cultural of the time.Napoli did an excellent job of characterizing the different ethnic groups and their relationships in the novel. I feel ashamed to be white when I read of what we've done to other people! Nevertheless, the plot did not grab me at all."}], "description": "Talullah, Louisiana. 1899.Calogero, his uncles, and cousins are six Sicilian men living in the small town of Tallulah, Louisiana. They work hard, growing vegetables and selling them at their stand and in their grocery store.To 14-year-old Calogero, newly arrived from Sicily, Tallulah is a lush world full of contradictions, hidden rules, and tension between the Negro and white communities. He’s startled and thrilled by the danger of a ’gator hunt in the midnight bayou, and by his powerful feelings for Patricia, a sharpwitted, sweet-natured Negro girl. Some people welcome the Sicilians. Most do not. Calogero’s family is caught in the middle: the whites don’t see them as equal, but befriending Negroes is dangerous. Every day brings Calogero and his family closer to a a terrifying, violent confrontation.", "title": "Alligator Bayou", "url": "http://www.goodreads.com/book/show/4582149-alligator-bayou", "average": 3.51, "cover": "https://images.gr-assets.com/books/1320455326l/4582149.jpg", "reviews": 120, "authors": [{"url": "https://www.goodreads.com/author/show/18684.Donna_Jo_Napoli", "name": "Donna Jo Napoli"}], "type": ["Historical", "Young Adult", "Historical", "Fiction", "Young Adult"], "outlinks": ["http://www.goodreads.com/book/show/4582149-alligator-bayou", "http://www.goodreads.com/book/show/6925779-alligator-bayou", "http://www.goodreads.com/book/show/54356.Zel", "http://www.goodreads.com/book/show/81130.Beast", "http://www.goodreads.com/book/show/219677.Sirena", "http://www.goodreads.com/book/show/81131.Bound", "http://www.goodreads.com/book/show/765584.Hush"]}