{"ratings": 341285, "userreviews": [{"userName": "Ryan Gillespie", "userReviewDate": "Jan 26, 2013", "userURL": "http://www.goodreads.com/user/show/16823650-ryan-gillespie", "userReview": "James Patterson. The man writes a book and you read it. It's plain and simple. He knows how to write a mother-fucking story. This wasn't the first book I read but damn. The dude keeps makin' a brother come back for more. It gets even better when you're reading a book about the REAL OG: Alex Cross.Short attention span? James Patterson's books come automatically equipped with small chapters.Enjoy reading before bed? Forget about it. You're laying down in bed, right? HAIL NO. This shit has you on the edge of your seat. Your brain may be tricked into thinking that you are laying down but the reality of it is that you are actually sitting up in a tricked out leather chair by the fireplace smoking a pipe.Don't smoke a pipe? Doesn't matter. You will be. This book is off the chain. You'll be speaking nothing but eloquence when you're done reading a James Patterson book. What comes after eloquence? Smoking a pipe. You're doomed.Like to see someone get bu-bu-busted big time? Alright Pauly-D. These bitches ain't shit but hoes and tricks. You know what that means? That means someone's getting jacked the fuck up.If you like reading, getting smacked in the face with plot twists and actually relating to characters in a book, check out my dog James Patterson. This book is a great intro to his writing."}, {"userName": "Edward Lorn", "userReviewDate": "Jul 22, 2015", "userURL": "http://www.goodreads.com/user/show/8850418-edward-lorn", "userReview": "No wonder the literary world is polluted with so many shitty writers. They see how well this fucking hack has sold, read his work, and aspire to fucking mediocrity. James Patterson outsells Pulitzer-Prize winning authors, but his writing (I refuse to call this bullshit \"prose\") is barely one step above motherfucking picture books. He's detrimental to the literate world. Authors and readers alike think this shit is okay. Do you see how many five-star reviews there are on this time sink? Authors and readers I respect have given this broken-ass novel their highest recommendation, and Patterson doesn't even follow basic fucking grammar rules. I know these authors and readers of whom I speak are not stupid. I know that to be fact. Yet they loved this book. Why is that? Why, motherfuckers, why?There is a difference between having an opinion and being fucking wrong. If you are flat out wrong, I have every right to argue with you. If your stance is based on opinion, I cannot. I understand that opinions are subjective. \"I don't like The Hobbit because little people with hairy feet going on adventures are so annoying! #harrypotterhavemybaby #fuckLOTR\" I can dig it. That's your opinion. You don't like motherfuckers with hairy feet going on adventures. Rock on. I can't argue that. But when you say that this bucket of vague antecedents, passive voice, and dangling participles is well-written, I gotta wonder whether or not you should be allowed to drive a motor vehicle. Well-written? Go fuck yourself. And that's only how I feel about the writing. Now I'm going to tell you why the plot to this disaster-piece makes it an even more inedible shit sandwich.Spoilers from here on out. You've been warned. There's this cockknocker named Gary Soneji/Murphy who wants to be bigger than the motherfucker that kidnapped Lindbergh's baby. He wants to be a serial kidnapper. He's already a very successful serial murderer. So, having completed that life goal, he wants to get on that next-level shit - kidnapping. Killing doesn't get a motherfucker paid, and he's broke. So he steals two little rich fuckers (a boy and a girl) from their haughty-taughty little-rich-fuckers academy and drops them in a hole. (If you're already tired of my gratuitous use of the F-word and various vulgarisms, you might wanna click away now because it's only gonna get worse.) This supposedly brilliant motherfucker fucking injects the littlest motherfucker with too much Michael Jackson Jesus Juice and the littlest motherfucker dies. This brilliant carnival-level cock-swallower gets all mad, beats and ass-rapes little dude's corpse. You see, little dude had a heart condition when he was born. This is common knowledge. But the brilliant necrophiliac-pederast didn't take that into account. So much for all them brains, huh?Okay, now that the little dude is dead, Soneji dumps him in a river, because YOLO BITCHES! There's no reason for this. Why not bury him? Tossing the dead kid in the river lessens the chance that Soneji will get the ransom he wants. Once again, I'm suppose to believe Sonjei is intelligent? Fuck you. No. A character is only as smart as his creator, and James Patterson is one good fart away from brain death.But wait! There's more!While Sonjei is busy polishing his pud or something, these secret service agents (three in all) have been watching Soneji because they THINK he might have a crush on one of the kids. This was BEFORE Soneji kidnapped the children. The trio of agents start surveilling Soneji and then BAM! Soneji runs off with the kids. So, instead of doing something to stop him, all three of these motherfuckers decide to kidnap the kidnapped kids. What the fucking what? I can see there being one crooked agent, but not three. I can see one of them getting angry AFTER they are reprimanded for losing the kids, but BEFORE. Whatever, Patterson. I could almost forgive the cliched \"Good cop gets taken off the case and must strike out on his own\" cliche, but I can't forgive \"The bad guys are actually cops/agents/love interests\" cliche. And yes, all of the things divided by slashes are true. In fact, there are so many \"bad guy\" characters, they literally outnumber the lead \"good guy\" characters. Bad Guys:JezzieDevineChakelyGary SonejiGood Guys:Alex Crossand Alex's partner Sampson, who's actually only in about a fifth of the book.Moving on...While the three cray-cray secret service motherfuckers are hiding out, trying to pretend they didn't have shit to do with shit (two of these idiots quit right after the kids were kidnapped, and the last one quit a few months later, as if that ALONE wouldn't make them look guilty... remember, these fuckers are supposed to be smart), the necrophiliac-pederast turns himself in by shooting up a McDonald's. He's given a trial that is so eerily similar to the trial in William Diehl's Primal Fear that I had to stop reading and look up publication dates for both books. They even try the whole \"Let's see if we can get the \"Bad-Boy\" personality to show up in court\" thing. Fucking really? Only difference here is the verdict. Soneji goes to jail. Soon enough, he confesses to Cross for no fucking reason. Him confessing does not help his plan. It puts more heat on the agents and SHOULD HAVE caused his grand plan to be foiled. But more on that after this next part.Sigh... Here we go.There's no way this supposedly-brilliant motherfucker could have known that he would be put in a prison wherein there just happened to be a guard that he could bribe. There's no way this allegedly uber-smart fucktard could have known that this guard would be allowed to take him downstairs, alone. Then Patterson wants us to believe that there's a prison in 1990-era America that doesn't have a goddamn motherfucking sonuvabitching camera in the christing elevator. Are. You. Fucking. Kidding? Eat my ass with a melon baller. Eat it, book. Fuck your entire face with a vibrating harpoon.Back to Soneji's plan being so convoluted that it should have backfired. He does all this shit and actually fucking escapes. The FBI and the Secret Service have known all along that the three agents were involved, but they had no proof. So they put surveillance on the three agents. Somehow they miss Gary Soneji entering Devine's crib, leaving Devine's crib for a treasure hunt, and then return to Devine's crib to cut him to pieces. And how did they miss this wanted fugitive who just recently escaped from motherfucking prison? Because he was dressed like the goddamn FedEx man. This is the literary equivalent of no one knowing Clark Kent is motherfucking Supes because Clark wears fucking glasses.*bangs head against desk*I give up. I think I've made my point. I'm not a hater. I'm not some elitist that likes shitting on people wonderful memories of favorite novels. This book is garbage. It's shittily written, it's terribly fucking plotted, and it celebrates mediocrity by having become a bestseller and rocketing James Patterson into the same categories as actual writers, as people who are talented. In summation: Motherfuck this book. It saddens me that James Patterson is a household name. It breaks my heart that I know who he is, but only recently found such amazing authors as Jonathan Kellerman and Greg Iles, you know, guys who can actually write. Stephen King once said (I'm paraphasing here) that authors should read some novels for the beautiful language and others for the fun of the plot. Meaning, not every good story is going to be well-written, and not every well-written book will have a good story under the hood. But Patterson is none of these things. He has made a lucrative career out of being a basic bitch.Final Judgment: This book is literary AIDS."}, {"userName": "James Lafayette  Tivendale", "userReviewDate": "Oct 24, 2016", "userURL": "http://www.goodreads.com/user/show/10282461-james-lafayette-tivendale", "userReview": "I am honestly speechless after reading that. Everything that a thriller should be. I am embarrassed to say that this is the first James Patterson book I have read (excluding his book shot series).Although I was unfamiliar with his work- I think everyone who likes fiction has heard of Alex Cross.He was one of many standout characters in this novel. Alex Cross, detective, doctor of psychology, hypnotiser, friends of the poor people when he helps out at a food shelter, respected by the black people for never leaving the 'hood following his glittering career, great family man and a bit of genius who cannot give up a case. Although hard and rough when he needs to be, practical as they come - the crimes he sees sometimes upset him - such as deaths of young children. Enter our villain:Gary Murphy/ Soneji. Actor. Manipulator. Tortured past. Horrid present. Other important characters include Alex's best friend and partner, sunglasses wielding 6'6+ copper Sampson & FBI agent Jezzie Flannagan who is part of Alex's team of experts to hopefully solve the world's most infamous case.The story commences with a kidnapping of two children from a $10,000 a term school by a Maths Teacher! One was the son of the Secretary of State. One was the daughter of this fictional world's equivalent of Angelina Jolie. There are also a few brutal murders that have been lurking around the suburbs that are a bit too grim to describe here. The book talks a lot about cruelty to children - and we have seen both sides... people who have received this agony and viewpoints of it being given. Macabre! How does this all fit together? When I thought I knew where this book was going... Patterson would kick sand into my eyes and it would take a crazy direction. I thought I had been metaphorically blindfolded by the author, kidnapped, dropped off in the woods 70 miles away with Patterson laughing at me grotesquely; saying - here are a few clues - figure this out! Hahaha!Friends and colleagues might not be that transparent. Is the villain a psychopath or a sufferer from multiple-personality disorder? Will the families pay the ransom? Do the children survive? Are the kidnappings related to the murders? Is there an accomplice? Is it even deeper than that? How many deaths can one person cause? Who can we trust? I won't mention the specific twists or plot too much as that is what makes this book special. It was brilliantly written. Mixing up pacing here and there. Slow scenes with Alex and Family. The middle-paced romance scenes with Alex and a special someone and also blood-racing turn-the-page 700 miles an hour sections.This was brilliant. I wish I had more of his Alex Cross novels. I might watch the film but I have heard it isn't very good.That was a thrill. Detective Inspector James x"}, {"userName": "Sharon", "userReviewDate": "Jan 07, 2017", "userURL": "http://www.goodreads.com/user/show/11267295-sharon", "userReview": "This is the first book I've read in the Alex Cross series and it won't certainly be the last. James Patterson is a fabulous author as I'm sure many would agree and when it comes to writing a page turner he sure knows how to keep the reader turning the pages at a fast pace. Along Came A Spider is a book with the lot, mystery, crime, suspense, oh and did I mention it's a cracking thriller. I can't wait to get my hands on the next book in this series. If you haven't read this book then do yourself a favor and please go and read it. I'm very sure you won't be disappointed."}, {"userName": "David - proud Gleeman in Branwen's adventuring party", "userReviewDate": "Jul 25, 2012", "userURL": "http://www.goodreads.com/user/show/10923016-david---proud-gleeman-in-branwen-s-adventuring-party", "userReview": "I have been recommending this book for years. Yes, the movie adaptation was terrible…yes, some of the later Alex Cross entries were somewhat weak (I’m looking at you, “Violets Are Blue”). But the first book of the Alex Cross series is still an amazing read. What really made this book work for me was the antagonist, Gary Soneji. He’s chilling and creepy, yet he’s still utterly fascinating. The game of cat-and-mouse between Alex Cross and Gary Soneji is gripping and exciting.However, the book is not perfect…I did have to deduct a star, as I really didn’t enjoy the portrayal of Secret Service agent Jezzie Flanagan…I found her to be a grating character, and wished the time Patterson spent on her could have been used for any of the other more-interesting characters. Still, it may not be perfect, but “Along Came a Spider” is still a great suspense novel."}, {"userName": "LJ", "userReviewDate": "Aug 25, 2007", "userURL": "http://www.goodreads.com/user/show/250195-lj", "userReview": "ALONG CAME A SPIDER (Police Procedural/US/Cont) – PoorPatterson, James – 1st in seriesWarner Books, 1992- PaperbackThe daughter of a famous actress and son of the secretary of the Treasury has been kidnapped. The boy's body is found and the kidnapper demands that Detective Alex Cross be the one to deliver the $10M ransom. The money is taken, but the girl is not returned and Alex joins forces with Jezzie Flanagan, the supervisor of the Secret Service, to find the kidnapper.*** I had some real problems with this book. The alternating first person, third person telling of the story was distracting. Alex seemed the whitest black man I've ever read, and there was next to no character development. There were hints of the mastermind fairly early in the story, the kidnapper was stereotypically evil and the very ending was unrealistic. The story did move well for about the first half, and then I found myself getting bored. Judging by his popularity, one can only assume Mr. Patterson's writing improved radically after this book."}, {"userName": "Sanjay Gautam", "userReviewDate": "Aug 03, 2014", "userURL": "http://www.goodreads.com/user/show/10179929-sanjay-gautam", "userReview": "It was a few years back that I read Along Came The Spider. I found the plot is predictable just like those typical Hollywood thriller movies. I could not find the book much engrossing, and was rather disappointed by the climax which was a cliched twist, and ruins whatever was, if any, good in the plot before. It was only the psychopathic villain, Gary Soneji, that appealed to me. Whereas Alex Cross, the detective, was very boring. All in all, it was a below average read which I would not recommend."}, {"userName": "Sue", "userReviewDate": "Dec 14, 2016", "userURL": "http://www.goodreads.com/user/show/3908840-sue", "userReview": "ALONG CAME a SPIDER (Alex Cross, #1) is the classic thriller that launched the Alex Cross series, the #1 detective series of the past twenty-five years! Excellent book. full of action and a ending I never saw coming! This novel is a game of cat-and-mouse between Detective Alex Cross and psychopathic villain,Gary Soneji, and will have you flipping the pages to see what will happen next."}, {"userName": "Mary Statza", "userReviewDate": "Nov 08, 2010", "userURL": "http://www.goodreads.com/user/show/4468205-mary-statza", "userReview": "Wow, where do I begin? This book inspired me to write a literary review for English class discussing why a a book like this should NEVER have made it onto the bestsellers list. IF YOU ENJOYED THIS BOOK OR THE ALEX CROSS SERIES, PLEASE DON'T CONTINUE!!Some major points include:  * Alex Cross is an incredibly boring, cliché, slightly-racist, unrealistic character * The italicization of random words without regards to taste or context * Incredible off-putting love scenes  * Boring, repetitive text, and dull, awkward dialog  * So many 90's references and dialog, even Kevin Costner from Bodyguard finds it painful to read  * Plot holes you could drive a truck through I bought the entire Alex Cross series at a book sale for about 13 dollars. I wish I hadn't, and instead, I wish I had bought something actually entertaining, like silly putty."}, {"userName": "Suzanne", "userReviewDate": "Jan 20, 2018", "userURL": "http://www.goodreads.com/user/show/4852457-suzanne", "userReview": "So interesting! I haven't seen the movie so this whole plot and the characters were new to me. I found it very entertaining with some great twists! Now that I am done the Women's Murder Club I am trying to decide between Patterson's other series to read now. Really thinking this is the one I will read first! My quick and simple overall: psychology and criminal justice is so it for me! My two majors in undergrad and graduate school!"}, {"userName": "Lynn", "userReviewDate": "Jan 31, 2012", "userURL": "http://www.goodreads.com/user/show/7585217-lynn", "userReview": "This book had a very interesting plot and a decent cover. That's about it. What a major disappointment this was. I guess it goes to show you just how good an actor Morgan Freeman is. Hell, he drove Ms. Daisy around for two hours and made it seem fun, and he made the movie version of this very watchable. Sadly, he was not around to act out the novel for me. By the way, the cover isn't really that cool, I was just being polite."}, {"userName": "Solim", "userReviewDate": "Jul 06, 2012", "userURL": "http://www.goodreads.com/user/show/10750560-solim", "userReview": "Ok so I watched the movie starring Morgan Freeman before reading this book which sort of ruined it for me but trust me I learned my lesson. The only thing the movie got right was the name of the characters, and the main theme/plot of the book which was the kidnapping. I could not believe how off the movie was compared to the book, but enough about that. This was probably the most I was engaged into a mystery/thriller/suspense book since I read A Cold Day In Paradise by Steve Hamilton which got me into the genre. I finished this book in about 2 days with maybe 4 hours of reading combined and it kept me interested the whole way. I like how Patterson does small 3-4 page chapters and does more than one point of view to give you an idea of what is going on through the heads of everyone involved. The twist sadly didn't work on me because I saw the movie about 2 weeks before I picked up the book but it still kept me interested the whole way by making me juggle between characters. Im looking forward to reading more from Patterson with this being my first from him and I honestly give this book 4.5/5 stars but you cant give additional half star ratings. Good book, recommend it to anyone who is a fan of the crime/mystery/thriller genre."}, {"userName": "Laurence", "userReviewDate": "Jun 29, 2011", "userURL": "http://www.goodreads.com/user/show/5324021-laurence", "userReview": "I was going to say that it started of well, but then I realised that it was only because I thought the beginning sucked the least. I mean, if you want to read a story with unbelievably cringe-worthy romance lines, pointless and unnecessary racism and a script that only added to the unrealisticness of the characters, then by all means, throw your money away on this book.The beginning kept me going for a while because I thought it had a pretty decent storyline (probably the only good point about this book), but then came the middle, where almost nothing even remotely interesting or necessary happened. If you ask me, Patterson should stick to writing crime and leave all elements of romance out of it; half the book was filled with it. If he knew how to write romance, let alone crime, then I really wouldn't mind as much. But the lines... Oh god, the lines! I couldn't believe the cheesiness and laughablity of them. His romance writing is like the equivalent of a parent trying to \"get down with the kids\", he's just embarrassing himself and really shouldn't do it.Even if all the romance was taken out, the racism would have marked this down anyway. I mean sure, I wasn't around in '92 but even I know that it wasn't this bad. Probably in every other chapter with Alex Cross, you'll find some sort of racist remark or observation that really didn't need to be there. Alex talks about how the world will never accept an interracial couple blah blah and how they're all discriminative towards black people, but I think it's really him who actually comes across as racist. At the beginning, you can't help but notice how bluntly he points out the colour of his friends and other characters. Patterson should really go back to school and pass his history lessons.Next. The unrealistic characters. Everyone, in one way or another, just didn't feel real and I think that was definitely due to the script. Yet again I'll point out Alex. Absolutely NOTHING he says would apply to the real world. Not one time in this did I think that someone in real life could really relate to him.My expectations of Patterson have really gone down because of this. So I'm really not expecting much as I go on to read 1st To Die, because I bought it at the same time as Along Came A Spider. If I could give this half a star, I would. How this managed to become a number one bestseller is probably the biggest mystery of the book."}, {"userName": "Phrynne", "userReviewDate": "Apr 14, 2014", "userURL": "http://www.goodreads.com/user/show/8655084-phrynne", "userReview": "I have read a few Alex Cross books now and decided it was time I read the very first one to see how it all began. I am very glad I did because I found this to be an excellent book. It has a fast paced and exciting story which has the reader guessing from the first page and then it ends with quite a remarkable twist which I did not see coming. I sat up very late finishing it because I just could not put it down! Altogether a really good read."}, {"userName": "brianna", "userReviewDate": "Mar 08, 2016", "userURL": "http://www.goodreads.com/user/show/5500406-brianna", "userReview": "This book was so bad. But not bad in an angry-making way where you want to throw it in a fire, bad in a Nic Cage movie way where it's just so unapologetically terrible that it's both unintentionally hilarious and entertaining in a strangely endearing way. Like, you have to finish it even though you're like \"what am I doing with my life right now, I only have a limited time of being alive and yet I can't stop reading this\".If you pay any attention whatsoever to the plot, you will have lots of questions by the end of it, like wait why do they think he might have a split personality if his actual full-time job was a teacher at a private school but he's telling his family he's a salesman? or what the fuck happened to the ten million dollars though? or, maybe my favourite absolute stand-alone insane moment: who the fuck erected a burning crucifix on the cabin property, and why is it literally NEVER ADDRESSED AGAIN? This book is chronicles of ridic. And the main detective, Alex Cross, is supposed to be a psychology genius, and his nemesis, Gary Soneji, is also supposed to be a genius, but neither of them do or say ANYTHING that warrants this description. They're both everyday average normal guys.Oh yeah, and James Patterson is super cute because he's a white dude trying so hard to write a black detective, and it's not even offensive it's just like, you can tell he's trying so hard and doing his best but it's just kind of a bumbling effort, like bro just relax about it it's okay you don't have to remind your audience 800 times that Det Cross is a black dude we get it, it's totally fine.And I can't really hate on Patterson even IF this was a rage-inducing shit book because he promotes reading so hard for young people and has written several books for children and just seems like a really enthusiastic dude who is super into literacy.Anyhow if you want the mystery/crime/thriller novel equivalent to a bad Nic Cage movie, read this shit."}, {"userName": "Kelsey", "userReviewDate": "Jan 02, 2015", "userURL": "http://www.goodreads.com/user/show/38665063-kelsey", "userReview": "Watched the film ages ago, before reading the book. Initially I was quite shocked at how much the film differed from the book. Then I wondered why they changed it for the film. The book had a much better storyline, deeper and more complex characters and it would have translated well into a film.As is often the case, the book was better than the film. 5 stars without a doubt."}, {"userName": "BAM The Bibliomaniac ", "userReviewDate": "Aug 09, 2016", "userURL": "http://www.goodreads.com/user/show/6595648-bam-the-bibliomaniac", "userReview": "Really 3.5 I figured out very early one of the antagonists so there's thatBut for a first exposure to Patterson I'm pleased. I will read the rest of the series"}, {"userName": "Γιώργος Δάμτσιος", "userReviewDate": "Sep 11, 2017", "userURL": "http://www.goodreads.com/user/show/40475612", "userReview": "Φοβερά καλογραμμένο αστυνομικό μυθιστόρημα με μεγάλη έμφαση στην ανθρώπινη ψυχολογία και συμπεριφορά. Δεν είναι καθόλου τυχαίο που ο Patterson φιγουράρει μόνιμα στην κορυφή των best sellers. Συμπαθώ πολύ και τον Άλεξ Κρος (κι ας είναι αρκετά κλισέ ώρες ώρες). Αυτή είναι η πρώτη του περιπέτεια."}, {"userName": "Lisa", "userReviewDate": "Feb 11, 2018", "userURL": "http://www.goodreads.com/user/show/40181649-lisa", "userReview": "Audiobook. Narrated by Charles Turner."}, {"userName": "Laura", "userReviewDate": "Aug 27, 2011", "userURL": "http://www.goodreads.com/user/show/5847727-laura", "userReview": "One thing about library borrowing is that you can check out books that you never would buy. It is actually kind of freeing. And, if there aren't any good books available as ebooks, you can use the opportunity to check out books that you wouldn't have read otherwise. Books such as as Along Came a Spider by James Patterson.Now, I know that popular fiction is popular for a reason. But these authors who just pump out book after book after book, each book so similar to the last, tend to get tedious. I therefore find myself avoiding these types of books. My favourite books tend to be those that I would pick up in a English Lit class at university, not at a drugstore.I guess I'm just a snobby elite on the outside. But the reality is... I'll devour a James Patterson book just like anyone else.At least that is what I learned when I decided to read Along Came a Spider.I decided to make my first James Patterson novel be one that began a series. So, I put on hold Along Came a Spider, which is the first in the Alex Cross Series, and 1st to Die, from the Women's Murder Club series. I figured that I didn't have nearly enough murder and mystery in my life, so a little bit of that in book form couldn't hurt. Along Came a Spider was the first book to become available.This book was actually a really great read. It was suspenseful and kept me guessing until the very end. I do admit, I started to pick up on the plot twist pretty early on.James Patterson wrote an engaging crime novel that keeps the reader questioning. After all the whodunit questions, the reader is faced with a moral question - where do our sympathies lie? Why do I, as a reader, feel differently about one villain than I do about another? Why is one morally reprehensible while the other evokes sympathy? Am I, the reader, condoning terrible behaviour? Am I complicit?I really love it when a writer is able to do more than just write plot. James Patterson clearly demonstrates that he can write a good story, but when he is able to question the reader's complicity, then I realize that I have read a good book."}, {"userName": "Jane Stewart", "userReviewDate": "Apr 02, 2012", "userURL": "http://www.goodreads.com/user/show/3789528-jane-stewart", "userReview": "It was well done, but I wasn’t emotionally consumed.The plot, the events, and actions were very well done. I was surprised and pleased. The book definitely kept my interest. The main reason I didn’t give it 5 stars is because I didn’t smile. I think of Grisham who takes me to the 5 star level. He writes a similar genre, but he makes me smile, either at the intriguing characters, or the “wow that is so exciting” when being chased or trapped or wondering if the hero will survive.At times I felt impatient to get some answers. The result was it felt a little slow. I’ve read other police procedural mysteries that had me less impatient and enjoying the journey more.The narrator Charles Turner was fine, but I wish Morgan Freeman had narrated. The character Alex Cross is a black man from the south. Morgan played Alex in the movie, and I kept thinking about him. He would have been a great narrator.The story is told in first person from Alex’s point of view and then third person for other characters and events. That structure worked ok, but I would have preferred third person for all. When he switches to first person, I am almost taken out of the story, thinking of myself - my perspective.DATA:Unabridged audiobook reading time: 12 hrs and 21 mins. Violence: strong. The killer likes cutting off body parts. Swearing language: strong. Sexual language: none. Sex scenes: about 8, referred to no details shown. The couple is a black man and a white woman. Setting: the early 1990s mostly east coast U.S. locations. Book copyright: 1992. Genre: mystery suspense police procedural. Ending: the good guys win, but there are many victims of violence."}, {"userName": "Nicola ", "userReviewDate": "Jun 26, 2009", "userURL": "http://www.goodreads.com/user/show/2461560-nicola", "userReview": "Still remains the best James Patterson book I've read to date- even tops the Maximum Ride series. It's exciting, and absolutely terrifying. I honestly had trouble sleeping for a week after reading this. Very powerful storytelling."}, {"userName": "Manugw", "userReviewDate": "Oct 30, 2011", "userURL": "http://www.goodreads.com/user/show/3981943-manugw", "userReview": "What a dissapoinmentHow can somebody can write a book so boring, after this book I will never choose any Patterson work again"}, {"userName": "Kathy Davie", "userReviewDate": "Sep 20, 2013", "userURL": "http://www.goodreads.com/user/show/4222001-kathy-davie", "userReview": "For some reason, Amazon refused to post this review, and I can't see why. If anyone can figure it out, let me know.First in the Alex Cross thriller series and revolving around Alex, a Washington D.C. detective with a background in psychology.My TakeThis is one of the few stories in which the movie adaptation is better. It wasn't until almost the end that Along Came a Spider started to more closely resemble the movie. Yeah, I usually hate it when a movie leaves out so much of the book, but in this case, Patterson (or his editors) should have tightened this up. I do wish they'd left the main characters alone, as much as I adore Morgan Freeman. Aaand, yes, the movie adaptation was much more dramatic for the changes. Just don't read it and think it will be the same.I like Alex. He's a realist and a caring single father who loves his kids, and they all live with his wise mother. She's tolerant of Alex's choices, but doesn't let him get away with a thing. It helps make Alex more of a real person and pulls me in. And, yes, I suspect all this background is what helps make Along Came a Spider so much longer.It's an interesting start, one of revulsion as we look into the mind of the man who truly masterminded the kidnapping of the Lindbergh baby back in 1932. A mind that highly resembles Gary Soneji's, and it's scary how well Patterson gets inside it. I'll never understand how people like Soneji think, how incredibly selfish he is. I know, selfish is such an inadequate word for what a horror Soneji is.It's almost halfway through the book before we finally get to the good parts. A horrible beginning exploration of Soneji/Murphy's personalities that makes you question everything. I didn't care if Soneji would get the death sentence; he deserved it. Yet, you feel for Murphy and hope he can get help. Then Patterson introduces a new angle to it. A terrifying question with which Patterson teases us.I find it interesting that while Patterson pokes at the prejudice angle against blacks, that the true emphasis seems to be on the politics. Making everyone look good without caring about true justice. It's not to say that Patterson doesn't portray life in the projects, but it's more about selfishness, jealousy, and I don't know, paranoia? A fear of exposing one's dirty linen?Why is it that keeping critical information to your own agency is so \"important\"? If they would share what they knew, so many more crimes could be stopped. What is it with human nature that the agent/officer/detective who arrests the perpetrator is the one recognized? Why don't they recognize everyone who had crucial input?? Arghhh.The StoryIt was that article. Alex thinks it was the title that drove the upper echelon nuts … \"The Last Southern Gentleman\" …While Alex sympathizes with the kidnapped children's parents, he's angry that the police, the FBI, the Secret Service, and everyone else are ignoring little Mustaf's murder.Meanwhile, it's a hunt for the kidnapped children and Gary Soneji, a brilliant sociopath.The CharactersDr. Alex Cross is the Deputy Chief of Detectives, a homicide and major crimes detective in charge of S.I.T. with a doctorate in psychology and a skilled hostage negotiator. Nana Mama is Alex's seventy-nine-year-old grandmother, Regina Hope, who still does volunteer work after she retired from being an English teacher. Maria is the wife whose death he still mourns. His children are the four-year-old Janelle and six-year-old Damon.\nWASHINGTON D.C.\nWashington D.C. Police DepartmentOfficer Butchie Dykes and his partner discovered the Sanders' crime scene. George Pittman is the chief of detectives, a real jerk who has it in for Cross, a.k.a., \"The Jefe, the Boss of Bosses, Il Duce, Three Pits, George Porgie…\" Lieutenant Don Manning is one of Pittman's. Fred Cook is a failed Vice detective now working as Pittman's administrative assistant. He really suits Pittman's personality. Ack. Christopher Clauser is Alex and Sampson's captain.Special Investigator Team (S.I.T.) is……\"supposed to be an opportunity\" for its eight black officers to go on to better things. Alex is in charge. Senior Detective John-John Sampson has been Alex's best friend since they were nine. Detective Rakeem Powell is another man on the team.Secret ServiceA workaholic, Jezzie Flanagan has a law degree and uses her motorcycle to relax. She's also the immediate supervisor of the Secret Service agents who guard anyone not the President. She lives with her retired mother, Irene Flanagan, a killer bridge player. Dennis \"the Menace\" Kelleher is her bully of an ex. Victor Schmidt and Jeb Klepner are more agents. Charles \"Jolly Chollie\" Chakley and Mike Devine are the Secret Service agents assigned by Jezzie to protect Michael.FBIAgents Roger Graham, Reilly, Gerry \"Digger\" Scorse (Alex's friend), Marcus Connor, Kyle Craig, and McGoey are all involved in the case. Pete Schweitzer and Todd Toohey are some of the crime scene techs. Harold Friedman is a technical officer. Special Agent Bill Thompson is from the Miami office. Kurt Weithas is a deputy, the number-two man at the Bureau.Carl Monroe is the \"jolly, hail-fellow-well-met\" mayor. Don't trust him.Martin Bayer is a reporter with the New York Times. Joseph Denyeau was the pilot in Florida. Richard Galletta is a lawyer with the Justice department.Maggie Rose Dunne is nine and the daughter of Katherine Rose, the movie star. Maggie's father is Thomas Dunne, a prominent entertainment lawyer who had been heavily involved in environmental causes, is now the director of the Red Cross.The Washington Day School in Georgetown is……a prestigious and very expensive school. Michael \"Shrimpie\" Goldberg is Maggie's best friend, a brainiac, and the son of Secretary of the Treasury Jerrold Goldberg. Fellow students include Luisa, Jonathan, Stuart, Mary-Berry, and Brigid.Ms. Kaminsky is the music and visual arts teacher. Mr. Guestier, a.k.a., Le Pric, teaches languages. Vivian Kim. Emmett Everett is the school porter.Gary Soneji, a.k.a., Mr. Chips, teaches math and computer science and is the grand master of Nintendo video games — he's also a sociopath who considers everyone not him as stupid. His alter ego is Gary Murphy, a loser who knows better than anyone for whom he works. Missy is his long-suffering wife. Roni is their daughter. Marty Kasajian is Missy's brother and employed Gary as a favor to his sister.Simon Conklin is a boyhood friend of Soneji's. Anthony Nathan is Soneji's lawyer. Federal Judge Linda Kaplan denies every defense request. Mary Warner is the prosecutor.Jean \"Poo\" and her two children: fourteen-year-old Suzette and three-year-old Mustaf Sanders are murdered. Willie Mae Randall Scott had been a witness to a possible suspect; Quillie McBride is her friend. Nina Cerisier had been a Suzette's best friend and her family were their neighbors.Jimmy Moore runs the soup kitchen at St. A's where Alex and Sampson volunteer. Bobbi is her new name. She frequently dreams of escape.Salisbury P.D.Lieutenant Edward Mahoney is in charge of the river scene.Crisfield P.D.Officers Artie Marshall and Chester Dils find the original holding place.Wilkinsburg, PennsylvaniaState Troopers Mick Fescoe and Bobby Hatfield were headed into McDonald's for lunch.\nLorton Federal Prison, Virginia\nDr. Marion Campbell is the warden.\nFallston Prison\nDr. Wallace Hart is chief of psychiatry. Robert Fishenauer is a floor supervisor whose greed does him in. Laurence Volpi, Phillip Halyard, and Stephen Kessler are guards.\nBolivia\nThe Patinos are farmers.\n1932, New Jersey\nCharles Lindbergh and his wife, Anne Morrow Lindbergh, adore their son, Charles Jr. Bruno Richard Hauptmann is the man the real kidnapper framed.The Cover and TitleThe cover is beautiful with its sunrise of gradated purple into pink into yellow backdrop for a house that's all lit up. It makes you wonder why the family is up this early at which point you notice the spider dangling from the \"D\" in \"Spider\", hovering over the house. The title is huge in an embossed white font with the author's name in an embossed yellow at the bottom. I love the series information at the top.The title is about the execution of the plan and the most unexpected tangled web it becomes when Along Came a Spider."}, {"userName": "Sharon Metcalf", "userReviewDate": "Mar 22, 2018", "userURL": "http://www.goodreads.com/user/show/49089020-sharon-metcalf", "userReview": "As the BT author of the month James Patterson was certainly someone I'd heard of but I'd not yet sampled his work. With a long interstate drive looming I decided to borrow one of his audiobooks and simply clicked on the first I found. Not quite the way I normally select my books but in this case I was in luck. Not only was it a book which held my attention during the ten plus hours drive but I enjoyed Alex Cross the main character and figured I'd see if there were others in this series. So that would definitely be yes. It seems I'm not the only one who wanted more of Alex Cross as James Patterson has delivered almost one book each year for the past 25 years. Fortunately for me, I had fluked it for the first in the series. Though I don't necessarily think I'm keen enough to read the entire series I could definitely see myself listening to, or reading more in future.This was a story with a number of twists and turns, plenty of action, more than it's share of psychopaths, some violence but nothing too graphic, kidnappers, murders, and even a hint of romance. I don't typically read this genre but it was entertaining, had a few surprises and filled my drive time just nicely."}, {"userName": "Lane", "userReviewDate": "Apr 10, 2018", "userURL": "http://www.goodreads.com/user/show/72035219-lane", "userReview": "I read this book from recommendation of my mom, which is totally new for me (in listening to her), and maybe I should listen more often. My first James Patterson and it was so so so good! This was not at all what I expected. It was constant action and one plot twist that I had not at all seen coming. I also really loved the chapters from the murderer's perspective. Patterson did an amazing job of getting into the mind of a psychopath. And Patterson did a fantastic job of depicting an inner-city DC neighborhood and the tension that can exist between black officers/detectives and primarily black neighborhoods they police. Just incredibly impressive, and I'm kind of mad at myself for taking so long to read this. I'm so excited to read more of Alex Cross."}, {"userName": "Gwen (The Gwendolyn Reading Method)", "userReviewDate": "Feb 02, 2018", "userURL": "http://www.goodreads.com/user/show/2250598-gwen-the-gwendolyn-reading-method", "userReview": "I’m always extremely skeptical going into popular suspense series, but I really liked this one! Loved the character of Alex Cross and am interested to see how he develops over the series!"}, {"userName": "Janel", "userReviewDate": "Oct 07, 2016", "userURL": "http://www.goodreads.com/user/show/55771094-janel", "userReview": "Along Came a Spider introduces us to Detective Alex Cross as he hunts serial killer Gary Soneji/Murphy. This was my first book by James Patterson, he is an extremely well established author and from this book, I can see why. The plot is action packed, and there were some very suspenseful elements along the way which kept me reading well into the night! Particularly relating to the character of Soneji/Murphy – Patterson wrote both Murphy (a normal loving husband) and Soneji (a heartless serial killer) so convincingly, – I couldn’t figure out if he did indeed have a multiple personality disorder or if he was a master manipulator.Regarding the character of Detective Alex Cross, I’m undecided, at times I really liked him and at some points, I felt Patterson was trying too hard to make him an all-round likeable guy. I like the image Patterson created of Cross as a single father with two kids with his nan there to offer support (and childcare), this made him likeable and down to earth. Also when he was taken of a case off a family murdered in the projects to work on the kidnapping of these two rich kids, he cared enough to still look into the murders. Then there were times in ‘the field’ when Cross came across as very big-headed and little too full of himself, which I didn’t find so appealing. This book did have a strong racial theme to it; there were times when I felt Patterson was, again trying too hard, almost as though he felt the need to keep constantly reminding us Cross was a black man, after a while this became annoying, mid-way through the book, I won’t forget the character, you don’t need to keep reminding me; let his “blackness” be genuine, rather than put on/false. That was really my only issue with this book.I enjoyed the many, many plot twists; Soneji/Murphy constantly evading capture was thoroughly entertaining. I also really enjoyed Patterson’s writing style, it differed so much, understandably, from today’s detective novels. No mention of this fancy technology we have today. When you read so many newly released books (within the last few years), it’s nice to mix it up every now and again with an older book. I can see why this book was chosen to be made into a film. Morgan Freeman plays Detective Cross, who doesn’t like Morgan Freeman, I’m off to watch the film now…."}, {"userName": "Marnie", "userReviewDate": "Dec 07, 2008", "userURL": "http://www.goodreads.com/user/show/229744-marnie", "userReview": "If you are looking for an engrossing mystery page-turner, this fits. It is mindless and fast...definitely a good plane read.Gary Soneji/Murphy, a brilliant psychopathic serial killer who just wants to be somebody, kidnaps two prominent children to gain exposure and notoriety. He desperately wants to upstage the \"Lindbergh Kidnapper\" and has put years of practice & planning into pulling this particular crime off perfectly. Murphy/Soneji takes a liking to Detective and Psychologist Alex Cross and plays some mind games with him along the course of the case and subsequent trial period. Meanwhile, Cross gets romantically involved with Jezzie Flannigan, the Secret Service woman in charge of the two missing children who ends up surprising Cross with her criminal involvement in the case. Jezzie and the remaining Secret Service agent involved get the death penalty for the crimes they committed for the $10 million ransom. While one kidnapped child accidentally died early on in the story, the remaining kidnapped child is rescued at the end from a village in another country."}, {"userName": "Sifat", "userReviewDate": "May 07, 2017", "userURL": "http://www.goodreads.com/user/show/67289689-sifat", "userReview": "A perfect crime-thriller story. 👌 Along Came a Spider starts with the twofold capturing of the girl of a well known Hollywood on-screen character and the youthful child of the secretary of the Treasury. What's more, that is just the start! Gary Soneji is a dangerous serial criminal who needs to perpetrate the wrongdoing of the century. Alex Cross is the splendid murder investigator set against him. Jezzie Flanagan is the female administrator of the Secret Service who finishes a standout amongst the most bizarre tension triangles in any thriller you have ever perused.\"What do you talk about to a murderer, and someone you loved, over a perfect dinner and cocktails? I wanted to know so many things, but I couldn't ask any of the real-questions pounding in my head. Instead, we talked of the coming vacation days, a \"plan\" for the here and now in the islands.” ― Along Came a Spider"}], "description": "The classic thriller that launched the Alex Cross series, the #1 detective series of the past twenty-five years! A missing little girl named Maggie Rose . . . a family of three brutally murdered in the projects of Washington, D.C. . . . the thrill-killing of a beautiful elementary school teacher . . . a psychopathic serial kidnapper/murderer who is so terrifying that the FBI, the Secret Service, and the police cannot outsmart him - even after he's been captured.Gary Soneji wants to commit the crime of the century. Alex Cross is the brilliant homicide detective pitted against him. Jezzie Flanagan is the first female supervisor of the Secret Service who completes one of the most unusual suspense triangles in any thriller you have ever read. Alex Cross and Jezzie Flanagan are about to have a forbidden love affair--at the worst possible time for both of them. Because Gary Soneji is playing at the top of his game. The latest of the unspeakable crimes happens in Alex Cross's precinct. It happens under the noses of Jezzie Flanagan's men. Now Alex Cross must face the ultimate test: How do you outmaneuver a brilliant psychopath?", "title": "Along Came a Spider\n      \n          (Alex Cross #1)", "url": "http://www.goodreads.com/book/show/13145.Along_Came_a_Spider", "average": 4.09, "cover": "https://images.gr-assets.com/books/1388272560l/13145.jpg", "reviews": 3954, "authors": [{"url": "https://www.goodreads.com/author/show/3780.James_Patterson", "name": "James Patterson"}], "type": ["Mystery", "Fiction", "Thriller", "Mystery", "Suspense"], "outlinks": ["http://www.goodreads.com/book/show/13145.Along_Came_a_Spider", "http://www.goodreads.com/book/show/231623.Along_Came_a_Spider", "http://www.goodreads.com/book/show/20489346-along-came-a-spider", "http://www.goodreads.com/book/show/2894804-along-came-a-spider", "http://www.goodreads.com/book/show/9872839-along-came-a-spider", "http://www.goodreads.com/book/show/21569748", "http://www.goodreads.com/book/show/13526583-along-came-a-spider", "http://www.goodreads.com/book/show/6316653-along-came-a-spider", "http://www.goodreads.com/book/show/71632.Along_Came_a_Spider", "http://www.goodreads.com/book/show/13148.Kiss_the_Girls", "http://www.goodreads.com/book/show/13137.1st_to_Die", "http://www.goodreads.com/book/show/13152.The_Angel_Experiment", "http://www.goodreads.com/book/show/7494.Suzanne_s_Diary_for_Nicholas", "http://www.goodreads.com/book/show/13139.School_s_Out_Forever"]}