{"ratings": 6702, "userreviews": [{"userName": "Morgan Ives", "userReviewDate": "Jun 10, 2010", "userURL": "http://www.goodreads.com/user/show/3856916-morgan-ives", "userReview": "As a fantasy reader, I've read my share of tedious books. I have a high tolerance for world building, flowery descriptions, and long expository prose._A Meeting at Corvallis_ went far beyond my tolerance level. I picked up the book assuming that it was the first in the series; so thoroughly did the author rehash everything in past books that I did not realize it was the third until after I finished reading it. Nothing was left up to the imagination; every rock, tree, grass blade, hair, fold in fabric, cloud, you name it was described in painful detail. Long descriptive passages interrupted the action so often that I frequently forgot what was happening and had to flip back pages to remind myself.Increasing my frustration was the constant rehashing of incidents in the characters' pasts, explanations of character motivations (usually through preachy dialogue), and introduction of so many minor characters that my head was reeling.Despite the incredible amount of detail, the author still made painful errors in the narrative. Once, a figure pulled out an arrow shaft--which had penetrated through armor and into the ribcage--with his thumb and forefinger. Another time, a horse at full gallop somehow managed to see and avoid a tripwire stretched across the road.Adding to the level of incredulity the reader was supposed to sustain is the whole \"Change\" itself. Perhaps I overanalyze, but if natural laws change, I want the new laws to make sense. Electricity suddenly stops working. Okay, sure. High-pressure combustion also stops working (i.e. guns). Um, okay. That's a bit weak, considering low pressure combustion still works, like fire, but whatever. Nuclear reactions suddenly stop working. Wait, what? Nowhere does it say that the earth is suddenly enveloped in darkness and ice, so I'm guessing the sun still works. Are these changes then limited to Earth? If so, that's hardly a universal change in natural laws. Magic didn't work before the Change, so magic couldn't have caused it. This leaves me to assume that some intervention of deity, some deus ex machina, caused the Change, purposely changing only those laws that would allow the creation of a world ideal for medieval playacting. Give me a break.An author who respects his readers leaves some things up to the imagination. He does not feel it necessary to spell out a character's motivations. He keeps suspension of disbelief within reasonable bounds. S.M. Stirling did none of these things in this novel. I felt like he created an unbelievable world so he could play out his own ridiculous fantasy wherein the medieval model reasserted itself. Except for hamburgers, which everyone cooked.The only reason I gave it two stars, instead of one, is the writing is not abominable. It's lazy and self-indulgent, but it is not impossible to follow. Regardless, if I hadn't wanted to leave a review on the book (I always finish books I review), I would not have wasted my time reading it."}, {"userName": "Kathy Davie", "userReviewDate": "Feb 01, 2015", "userURL": "http://www.goodreads.com/user/show/4222001-kathy-davie", "userReview": "Third in the Emberverse science fiction dystopian series of an alternative history for the world and revolving around the survivors of an EMP.It's 2008, and it's been seven months since \nThe Protector's War\n, 2.My TakeOh. My. God. Make sure you have a TON of tissues before you finish this. I cried great gulping buckets. Even now, just thinking about it has me breaking into tears. A neighbor showed up at my door and was surprised by how much I was crying. Fortunately, she's a reader, so she understood completely. And I really don't see why Stirling had to end it like this. Maybe it'll make more sense in the next story, \nThe Sunrise Lands\n.Jesus, after what the Protector planned for the Lorings and company and what he did do to the Pride of St. Helens captain, he's got a nerve thinking he's entitled to the ship.It's a world where someone who knows basic skills like farming, gardening, hunting, crafts, engineering, working with mechanical wonders is a treasure. It's a world where most people work for someone else in exchange for food, shelter, and protection. Many hope to save up a small stake so they can afford to stock their own farms. When someone like Sam comes along, the situation makes you appreciate a good teacher (and lord) as he explains how and why he's doing what he's doing for the farm. Which reminds me of a curious thought I've had: how do you determine how much wheat, vegetables, meats, etc., a family needs when you have to produce it all yourself and not rely on driving to the store?I am surprised that the Mackenzies don't have scouts out around Dun Juniper after events in \nThe Protector's War\n. If ever there was a lesson in ambushes on friendly territory!Oh, lol, I did like Mike's summing up of Jeff Wereton's parental origins. Then he sums up Arminger and the whole Association set-up. You'll laugh. Then there's Nigel and how sweet was the task that kept him at Dun Juniper!I like the surprises Mount Angel has in store. I've always coveted my own hidden passage after growing up with Nancy Drew and \nThe Hidden Staircase\n. Then there are the plans Stirling has in store for young Rudi as well, the way he's going on about him. And how much his enemies are admiring him. A Meeting at Corvallis provides a number of useful experiences for Rudi in how to govern a people and comparing the ruling styles of the Protectorate with his mother's and Uncle Mike's.It's rather funny how the Protectorate Church demonizes the Mackenzies and brings back the \"old\" prejudices against gays and people not of the state religion.Jesus. Juney talks about loosing 130,000 arrows in one 10-minute attack, and that the Mackenzies have more. Enough more that those 130k arrows are nothing.For obvious reasons, I've hated Tiphaine. And, I've had to revise that hate when I see the changes she makes in her new demense. If only more of the so-called lords had behaved this way… It also seems that she doesn't like the Lord Protector's policies, although she is loyal to Sandra. Well, no one said Tiphaine was a stupid woman.Oh, boy. Books must be in worse shape than I thought as Rudi talks about how much he loves Donan Coyle.There are some major battles in this: plenty of action with good tactics, handy weapons, and some useful ambushes. The one at the end is quite decisive and had damn well better be worth it!The StoryThe Protector has been having a bad spring with too many setbacks, and it's all the fault of those Englishmen, the Bearkillers, and the Mackenzies.Juney, on the other hand, is ticked that people are impugning the honor of the Clan by mistreating Matti.Pro-Protectorate Corvallans are about to sell the city out to the enemy in exchange for being a charter city. How long that would last is anyone's guess. They're also much too supportive of this new concept of a \"select militia\". It says something that Mike is against it as he's so angry about constantly being the buffer for Corvallis.The CharactersThis is a very abbreviated list due to space constraints. For a full list, see my review which is scheduled to be posted on February 25, 2015, on my blog at KD Did It Takes on Books.CLAN MACKENZIEDun Juniper is……HQ for the Mackenzies and home to Juniper Mackenzie, the Wiccan Priestess of the Goddess and the Chief of Clan Mackenzie. The core group of the Clan were friends and/or fellow members of the Singing Moon coven. Rudi Mackenzie is her heir, her son, and the now-acknowledged son of Mike Havel. He's also Matti's friend. Epona is the wild horse who took to Rudi in \nThe Protector's War\n. Saladin is Matti's unfriendly cat. Old Cuchulain sired puppies: Ulf and Fenra.Chuck Barstow is the Clan's Second Armsman, the High Priest for the Dun, and Lord of the Harvest. Judy Barstow is his wife, a registered nurse, and High Priestess. And she hates Matti. Aoife Barstow (the former Mary) and Daniel Barstow are what's left of their fostered children, the ones rescued from the schoolbus; they are Rudi and Matti's bodyguards. The third one, Sanjay Barstow, died in the raid in \nThe Protector's War\n. Liath Dunling (she used to be Jeanette and is Melissa's niece) is Aoife's romantic partner.Colonel Sir Nigel Loring (he was with the SAS for 22 years) wears a kilt these days. Makes sense since he's engaged to Juniper. His son, Alleyne, who had been a re-creationist before the Change, is keeping company with Astrid, and Sergeant \"Little\" John Hordle, who's keeping company with Eilir, are the Englishmen who escaped King Charles III and thwarted the Protector in \nThe Protector's War\n.Dun Fairfax was……the Fairfaxes' farm before they died when their insulin ran out. Now Sam Aylward, a.k.a., Aylward the Archer, a former SAS who was hiking through Oregon when the EMP hit, is its lord. He's also the Clan's First Armsman due to his archery skill and his greater skill at building bows.THE BEARKILLERS IN LARSDALEN ARE……a mercenary group, a.k.a., the Outfit, that Mike Havel, a former Force Recon Marine who was a pilot when the EMP hit, assembled, protected, and taught until they got to the Larssons' farm. Now he's Lord Bear and married to Signe. They have two twin daughters, Mary and Ritva, and Mike Jr., their son. Eric Larsson and Luanne Hutton are married. Billy is their oldest; Ken is another son. Ken Larsson, their father, was a CEO and engineer back in the day. Today he's re-inventing the wheel and married to Pam, a vet and the swordmistress. They have two children as well. Will Hutton was a horse wrangler pre-Change, and now he's Mike's left-hand man; Angelica is his wife and handles logistics.\nDúnedain Rangers are…\n…a newly formed troop of the younger ones (each Ranger must know Sign and Sindarin) and led by the very skilled and virginal Astrid Larsson, Ken's youngest daughter, along with her soul-sister, Eilir, Juniper's deaf daughter. Astrid has an obsession with everything Lord of the Ring. Asfaloth is Astrid's horse and Celebroch is Eilir's.MOUNT ANGEL IS……the Benedictine abbey where Abbot-Bishop Dmwoski leads. His horse is Sobieski. The Bearkillers follow him for their religious leanings. Father Andrew is one of his. Father Plank is the prior. Sister Antonia is geared up for war.CORVALLIS IS……Oregon State University with their Faculty of Economics the steering committee. They're split between those wanting to placate the Protectorate and those who don't trust 'em. Their primary goal is to maintain the school's teaching functions and not let knowledge die out. Thomas Franks is their president.Major Peter Jones leads their militia and is inclined toward the Bearkillers and Mackenzies. Pre-Change, he'd been a Society fighter and teaching assistant in the Faculty of Agriculture. Nancy is his wife, and they have kids as well. He'll end up leading the First Corvallis Volunteers with Edward Finney. Seems there's a loophole in the Corvallis charter.THE PORTLAND PROTECTORATE ASSOCIATION ENCOMPASSES……Portland and its surrounding area. But it's not enough for The Protector, the former history professor, Norman Arminger, who has been influenced by the Norman duchy and its offshoots from Ireland to Sicily and the Crusaders. He's absorbed many of the members of the Society for Creative Anachronism (SCA), now called the Society (his Society name was Blackthorn of Malmsey), and many gang members. Princess Mathilda, a.k.a., Matti, is his and Lady Sandra's daughter currently held hostage by the Mackenzies. Conrad Renfrew is the Grand Constable, Count of Odell, and Marchwarden of the East. His wife is the Lady Tina. Sir Buzz Akers is one of the Constable's own vassals. Sir Richard Furness had been a combat engineer in the National Guard. Sir Malcolm, Baron Timmins' son, seems intelligent and ambitious.Domain of Ath is……the reward Tiphaine receives at the end of her successful mission.The Cover and TitleThe cover features Michael Havel in his chainmail holding his war ax, standing front and center with the battered skyline of Portland behind him. A team of horses is pulling a converted vehicle behind him on the left.The title is a term in the treaty: A Meeting at Corvallis."}, {"userName": "Melissa", "userReviewDate": "Jan 26, 2011", "userURL": "http://www.goodreads.com/user/show/4877728-melissa", "userReview": "I'd have to give this installment of the series 3 1/2 stars. It was certainly better than The Protector's War, but not as good as the first book, Dies the Fire. These books should really be read in order, but the main thing about them is they center around an event called the Change. This change made things completely different for human beings. No longer do guns, other weapons, electricity, or other modern objects work. Those who have eeked out a living in this world are strong indeed and include Juniper McKenzie's wiccan archer clan, Mike Havel's Bearkiller warriors, and their enemy The Protector and his vast holdings and enslaved minions.In this book, a war that has been brewing finally starts. It is the McKenzie's and the Bearkillers, along with their allies who must defeat the mighty horde of the Protector. At first, battle seems to go easy with luck happening for the good guys. But then, in the lull of quiet, Rudi, the son of Mike Havel and Juniper McKenzie is kidnapped along with the daughter of the Protector and the tide changes. They must defeat a large group of the Protector's army and stage a rescue for Rudi with limited resources. This is not all that goes on however. The Rangers are also featured in this book, a group made by Astrid (Mike's sister in law) and Eilir (Juniper's daughter) that helps protect the innocent and scout the forest. They are a valuable team and do a lot of good with winning allies for the group.The characters are not as fully developed in this book. Rudi is a joy to read about as he is a very interesting character, but he does not feature in this book. The rest just didn't have as much description as they did before and seemed shadows of themselves. The writing in this book on the other hand is very descriptive for everything else. This causes it to be slow moving at parts and Stirling spent a lot of time on unnecessary scenes and people. Also, some readers may be taken aback at the genre of this book. I would classify it as Wiccan fiction, and those going into the book without knowing this, might not be ready for it as they were for a fantasy novel. It doesn't make it a bad book, it just might not be to some people's tastes.I did like this ending of the trilogy and look forward to reading more of his books about this alternate history. Its an interesting concept and definitely one that should be explored.A Meeting at CorvallisCopyright 2006622 pagesReview by M. Reynard 2011"}, {"userName": "Nathan Miller", "userReviewDate": "Oct 20, 2012", "userURL": "http://www.goodreads.com/user/show/6849833-nathan-miller", "userReview": "\"AMaC\" picks up immediately after \"The Protector's War.\" The two could probably be considered one story in two volumes. Curiously, there's more war in AMaC than there is in TPW. As one might expect, things go progressively downhill for the Allies, who are still collectively militarily outnumbered three to two by the Protectorate army. We see some more major plot movement, the resolution of some of the sub-plots from TPW, plus the introduction of some new ones. It's clear that the author intends the story to become an epic saga of mythic proportions. That's fine, because I'm rather fond of those, provided they're interesting, and I find that the Emberverse continues to be so. It also helps that the series takes place mainly in Oregon. It's hard to be driving down I-5, see signs to Corvallis, and NOT think about the city's wall and the OSU Beaver becoming its battle standard, or the exit sign to Gervais and NOT think about the Barony Gervais, or going south on 99W and NOT think about \"Okay, this is Protectorate land, and now I'm in Bearkiller Territory...\" It's just so much fun to be able to connect events in the book with real places in my back yard! (I even took a drive through McMinnville and thence down to Salem to see if I could find Larsdalen! Results are inconclusive, but it was still fun to do that.) I also like to ponder, as I drive around, how certain things have changed in the real world since DtF was written in 1989 and how those might have affected the aftermath of the Change--the population explosion in Bend and Redmond, as well as the popularity surge in the self-sufficiency movement in Oregon specifically come to mind."}, {"userName": "Nathan", "userReviewDate": "Nov 16, 2016", "userURL": "http://www.goodreads.com/user/show/5238423-nathan", "userReview": "If one is invested in the series this is a solid conclusion. I know the series continues but this will be my stopping point, I remember the quality going down hill in the 20 year later books."}, {"userName": "Graham Crawford", "userReviewDate": "Jun 19, 2012", "userURL": "http://www.goodreads.com/user/show/5884833-graham-crawford", "userReview": "I am not the most ideal person to review this book because I come to it with extreme prejudice. Firstly, I ignored all the warning labels in the Goodreads comments - they told me not to read this book first - the third in a trilogy. I should have listened. More importantly, this book is largely about the Society for Creative Anachronism - a group I was heavily involved with in my younger days (I was a Laurel - one of the folk \"A Meeting at Corvallis\" describes as a \"Period Nazi\").I can't say reading Book three first left me confused, there is so much recap & repetition in it that I can tell you pretty much what happened in the first two volumes. What I didn't get was any sense of character development. I am guessing we were introduced to everyone pre-change, as their wimpy selves .... and over the first two books they armour up to become the impossibly buff and beautiful cardboard cut-outs I was presented with by book three. I suspected I was meant to be air punching as the huge caste of the bold and beautiful triumphed over impossible odds, hacking and slashing their way into legend. Sorry - I just didn't care. I previously read this authors \"Lords of creation\" series, which is a camp Pastiche of the John Carter universe. In that parallel literary world, I was willing to accept breastplated amazons as an ironic comment on pre-1950s, pre-feminist Sci-fi. After reading \"Corvallis\", I think I might be giving Stirling too much credit. He falls for the geek trap of thinking that if he dresses a man in a woman's body, and lets her kick bad arse men, he's writing positive female role models. Lara Croft is not exactly an icon of modern feminism. She's geek soft porn. My personal background in the SCA made it virtually impossible for me to accept the premise of this book .... hey I could deal with \"Alien Space Bats\".... I just couldn't believe the SCA could take over their own back yards let alone the world. The amount of belief I was meant to suspend to make this work was frankly, uncomfortable. Combine this with an absurd amount of description about archery, armour, ploughing etc, and it resulted in a book with an extremely odd texture. Crazy realistic detail alongside cartoon superficiality. Much of this book involves (literally) blow by blow descriptions of battles. I have never been convinced this actually works in print, and long winded descriptions of military campaigns read like transcripts of table top wargames. I guess there are folk out there that enjoy this, but I'd prefer to see this stuff on screen or in a book with diagrams. And in spite of all the violence, I was emotionally unmoved by any of the action. I read that Stirling is good friends with George R.R. Martin. There are many similarities in the works of these two authors, not the least being long winded descriptions of food. I imagine these writers sitting up late at night swapping fake medievalesque recipes via email to pad out their latest doorstop. They appear to have matching waistlines, and another thing in common .... they both have editors too scared to take a broadsword to bloated manuscripts.Maybe they should both be forced to hand write in gothic calligraphy on vellum - then we might get books twice as good at half the size."}, {"userName": "Melani", "userReviewDate": "Jan 14, 2008", "userURL": "http://www.goodreads.com/user/show/767841-melani", "userReview": "I like the idea of this novel/series better then the execution. And to be honest this is really more of a, \"read the first half then the last ten pages and figured out the in between stuf\" then an actual complete read. But I'm counting it.  a. The character of Juniper Mackenzie is directly based on Heather Alexander This wouldn't bother me so much, except it's more of a, \"look how cool I am for including this person cause she's just the coolest thing EVER\" In other words it's kinda like reading a story in which the person has included his friends and left out the part where they are actual flawed people. b. The speed at which society adapts to the Change. Not the end of the world stuff, no more technologies thing, the societal changes. The big bad, and you know he's the big bad cause he enslaves people and rapes women (mentioned occasionally and can I tell you how tired I am of this fantasy trope. Yes those are bad things, very bad, but could you have a villain that maybe didn't do either? Please?), has set up a feudal type society. With peasants and everything. Now this particular book is set five years after the Change, when electricity and gunpowder stopped working, and in the northwestern US. I'm just supposed to believe that American citizens just went along with this? Now this really isn't dealt with in the novels, because he's not the focus, but I have a hard time believing he didn't have several 'peasant uprisings' to contend with. Sure the writer asserts that hungry people are more subduable, but um... I just don't buy it. c. It's kinda boring. And I'm not sure why. Partly I think because the battles/strategies that are a large part of the book are not my cup of tea. And really, if I can figure out the middle parts of the book from reading the first half and the last 10 or so pages, there are some problems. Ok, so I do this a lot, and I am frequently able to figure out the middle parts, but if I don't care to go back and actually read what happens, then there is a problem.The things I like, and mean I'd probably read the next one if I can get it in the library: The characters. Once you get past the whole \"I'm so cool for including this person\" thing with Juniper Mackenzie, I really do like the people here. And I do like the idea of people trying to survive after technology stops working."}, {"userName": "Christopher", "userReviewDate": "Oct 31, 2016", "userURL": "http://www.goodreads.com/user/show/12306131-christopher", "userReview": "I've determined that the first three books 500 page books of the Emberverse series could just as easily have been one 600-750 page book and would have been far more satisfying. Let's consider this volume. It's about a meeting. A MEETING. Do you feel your heart racing yet?While the meeting itself actually is interesting as the warring factions in Oregon's Willammette Valley agree to meet to try to broker a truce, it ends inconclusively about a third of the way through the book and we're back to the standard LARPing of the first two books. The major conflicts of the first three books could have easily been condensed into a single, streamlined, well-paced quasi-epic (especially how this third book ended).People laud Stirling for his \"worldbuilding,\" but I can't. I don't mind the fact that Wiccanism becomes one of the dominant religions in the region. I don't mind that factions/clans try to set up a pseudo-feudal society in the wake of the loss of all advanced technology. What I mind is that it all feels so FORCED. Remember this book is only 10 years after \"the Change\" and even though many/most of those who remember the time before have died, there are still more than enough people with memories of the time before that should be able to stand athwart medieval history yelling \"STOP!\"Instead of an organic evolution of faith or society into these newfound structures/traditions, it's like the worst aspects of your RenFaire or LARPing group just decided to go full \"Medieval Times.\" (\"You never go full Medieval Times\"). I kind of wished some of the saner characters would look at some of the major characters and ask: \"Why are you talking like that?\""}, {"userName": "Kris", "userReviewDate": "Apr 23, 2010", "userURL": "http://www.goodreads.com/user/show/3591995-kris", "userReview": "This book concludes the first story line in Stirling's Emberverse series. In the story he builds up two big plot lines one which revovles around the big conflict between the Protector and the indepedant states in the Willamette valley and then the small conflict around Rudi and Matilda the two young heirs. Along the way we learn more details about Corvallis and the Mt Angel groups as well as watch the reavling of the various plots and counter plots weaved by the warring factions which all leads to the final confrontation which I admit the resolution suprised me the first time I read this and is a great ending once the shock wore off. I really liked how this story arc gets wrapped up in this book and Stirling does a superb job of wrapping up story threads and setting up the next story arc. The end of the first three books in this series is a complete story that does not need to be followed up with the other 4 books of the series and it is something that appeals to me about the series above and beyond the story itself. That being said I do recommend continuing to read the series but it does add some more fantasy elements and the main characters shift from the orginial ones to the children of the main characters. I thought this was a good choice on Stirlings part and kept the series fresh for me."}, {"userName": "Roberta", "userReviewDate": "May 07, 2012", "userURL": "http://www.goodreads.com/user/show/358415-roberta", "userReview": "I really should have enjoyed this book but it took me three weeks to read. The inevitable confrontation between the Portland Protective Association and the combined forces of Clan MacKenzie, the Bearkillers, the Dunedain Rangers, and their allies come to a head.Stirling follows a tremendous cast of characters in telling how the confrontation builds and comes to a conclusion. I think therein lies the problem. He has a lot of interesting characters and some of them much more interesting than others like Lady Arminger's protege, Tiphaine.The book is weakened by too many changes in point of view. I wish he'd chosen 3 to 6 characters and stuck with their points of view.Still the characters are interesting as is the plot although he has a tendency to spread out his action a bit too much and over describe mundane events that seem to have no overall bearing to the plot.I liked the characters of Tiphaine, Delia, Rudi, and Mattie enough to continue the series not to mention he humanizes his villains and doesn't make them cookie cutter bad guys.Overall, a good story but could have been better. Definitely worth reading, and for those with complaints about all of the Wiccanisms, he has toned it down somewhat and the culture has evolved some as the story is nine and ten after the change."}, {"userName": "Jen", "userReviewDate": "Dec 02, 2009", "userURL": "http://www.goodreads.com/user/show/1833384-jen", "userReview": "Somewhere in the middle of this you realize that you are TOTALLY ATTACHED to these characters and their well-being. It sneaks up on you, which is delightful. For anyone who enjoys a good bit of swashbuckling as well as some fantastic commentaries on human interaction, this is a great read. It will never earn five stars from me, though, as there are a number of times when I just want Stirling to get out of his own way. With his continuing editorializing about religion (although here the Christians finally got one awesome paragraph of standing up for themselves, huzzah!) and the pages of I-did-so-much-research-you-can't-understand notes, I just felt like I kept getting kicked out of the story by the author. The ending was heart-wrenchingly great, though, and I believe I will read the sequel trilogy he has, as these characters are very well fleshed-out."}, {"userName": "Rebecca Radnor", "userReviewDate": "Sep 08, 2012", "userURL": "http://www.goodreads.com/user/show/3888589-rebecca-radnor", "userReview": "Remember how in the last book I said the blow by blow battle scenes were taking over the book in part cause there was little story and what there was was disjointed? ... well the story slows down EVEN more with even more battle scenes, in fact now we've got a full fledged war going on and we're just going from one battle directly into the next with almost nothing in the way of character development. You have to get to about the 50% mark before ANY story development kicks in. Again there's a lot of jumping around and senselessness... you think the story bits are building to something but they aren't they're just bits... strung together. Its rare that I get caught up in a series and then stop reading it, but this book was so tedious for most of it that I won't be reading the next book"}, {"userName": "nks", "userReviewDate": "Aug 31, 2012", "userURL": "http://www.goodreads.com/user/show/8040734-nks", "userReview": "What a series. Sometime during book two (The Protector's War) I became totally obsessed. The writing is a bit sloppy (he tends to cut off in the middle of action and jump to a scene after its all finished, relating how the last scene ended through inferences) in places, but I really love the universe that Stirling has created. And I can't help but imagine him sitting around at the pub with George R.R. Martin discussing their books. (They are apparently friends.) I would recommend the series to anyone with a penchant for post-apocalypse books, though if you are a lit snob (as I am on some level) it can sometimes be hard to swallow. I can't wait to start the six-book series that takes place in the same world a generation later."}, {"userName": "Jean Hontz", "userReviewDate": "May 25, 2016", "userURL": "http://www.goodreads.com/user/show/1356580-jean-hontz", "userReview": "It is year 8, after The Change. People are trying to survive, relearning how to grow their own food, protect themselves from marauders and warlords. The Bear Killer Clan and Clan Mackenzie are separate but close, with a mutual pact to assist when the self-styled Protector once again sends his forces to conquer them.Lots of details with regard to primitive survival, and a surprisingly strong emphasis on worship of the Goddess. Characters are well drawn and strong, and the plot is clear and pointed, with one small exception at the end.It has cliff hangers though so beware. I'm having to hurry up and read the next book in the series right now!"}, {"userName": "Anita", "userReviewDate": "Jul 17, 2014", "userURL": "http://www.goodreads.com/user/show/31498497-anita", "userReview": "I cried."}, {"userName": "Brendan", "userReviewDate": "Jan 15, 2018", "userURL": "http://www.goodreads.com/user/show/42769660-brendan", "userReview": "Wonderful series. Midway thru the series (book 1-3), and I started thinking, I need to move out of the densely populated New York area and start preparing for the end of the world. =] Plus pick up archery, horseback riding, and farming. I particularly enjoy the historical-social-tactical (slash Alien-Space-Bats) discussions involving Ken Larsson. One criticism would be that the plots relied a little to heavily on deus ex machina devices. But its easy enough to over look if you enjoy detailed world & character building, on that expect, it was excellent."}, {"userName": "Zachary Wagoner", "userReviewDate": "May 18, 2018", "userURL": "http://www.goodreads.com/user/show/10590990-zachary-wagoner", "userReview": "A great end to the first trilogy of the Emberverse. Watching as all the strings set up during the first two books were brought together for a very memorable finale. I finished this book while sitting at work, and had to struggle to not shed tears at the climax of the story. It's great when a book can tug at your heartstrings. When the characters are so well written, that you care about them and how they turn out. Always a great feeling and certainly adds enjoyment to the reading.If you have read the previous books in the series, then you should certainly continue with this one."}, {"userName": "Cameron", "userReviewDate": "Apr 29, 2018", "userURL": "http://www.goodreads.com/user/show/20637330-cameron", "userReview": "This series is a guilty pleasure series. The writing is atrocious but the plot is creative enough, with an Oregon setting, to make it fun. I will admit this one has a better grasp on the world and characters. It is not constantly justifying itself like the first two. And the action is well written, battles are tense and brutal using creative medieval and modern tactics."}, {"userName": "Adam Zimet", "userReviewDate": "Oct 13, 2017", "userURL": "http://www.goodreads.com/user/show/47009881-adam-zimet", "userReview": "Nice conclusion to the initial trilogy, the characters are very one-dimensional but has good action scenes. the overall world Stirling has created is a little too far fetched (drifts into complete fantasy)"}, {"userName": "Marissa", "userReviewDate": "Apr 11, 2018", "userURL": "http://www.goodreads.com/user/show/5168532-marissa", "userReview": "This conflict has been really building across the first two books, and it seems it was inevitable that this would come to a head now. It also doubles down on the fact that no one is safe in this changed world. What a wild ride!"}, {"userName": "Brian Krouse", "userReviewDate": "Feb 14, 2018", "userURL": "http://www.goodreads.com/user/show/14432734-brian-krouse", "userReview": "My favorite of the trilogy. I really enjoyed this final chapter of the trilogy. Probably my favorite. It still felt overlong, that the author probably could have cut 100 pages of description. The story was great though."}, {"userName": "Ronald Vasicek", "userReviewDate": "Nov 01, 2016", "userURL": "http://www.goodreads.com/user/show/217099-ronald-vasicek", "userReview": "Would have been a more interesting book if the author had gone into why the power went out and a bit less time on witches."}, {"userName": "Elar", "userReviewDate": "Feb 10, 2018", "userURL": "http://www.goodreads.com/user/show/12281377-elar", "userReview": "This whole book is dedicated to war mongering and intrigues. Also little bit of true cause of the break down in revealed."}, {"userName": "DOUGLAS KING", "userReviewDate": "Jun 07, 2017", "userURL": "http://www.goodreads.com/user/show/62952533-douglas-king", "userReview": "Stirling does it again.The read was fantastic and I couldn't get enough. I can't wait to start the next book. So many layers of people and places just amazing."}, {"userName": "Laurie Flood nuzzolilo", "userReviewDate": "Jun 14, 2017", "userURL": "http://www.goodreads.com/user/show/33429491-laurie-flood-nuzzolilo", "userReview": "love the series"}, {"userName": "Kathryne Gladwin", "userReviewDate": "Apr 26, 2018", "userURL": "http://www.goodreads.com/user/show/3445494-kathryne-gladwin", "userReview": "good story"}, {"userName": "Cameron Mcconnell", "userReviewDate": "Jan 30, 2018", "userURL": "http://www.goodreads.com/user/show/11174099-cameron-mcconnell", "userReview": "The power struggle continues between the Protector and his armies and the surrounding communities. The story is good but bogs down a bit in the military details."}, {"userName": "Jolleygirl yeager", "userReviewDate": "Sep 05, 2017", "userURL": "http://www.goodreads.com/user/show/3582619-jolleygirl-yeager", "userReview": "Good, but overlong.Good story, but parts of it are hard to wade through, especially the battle scenes, which often seem to go nowhere."}, {"userName": "KAP", "userReviewDate": "Mar 20, 2017", "userURL": "http://www.goodreads.com/user/show/64278748-kap", "userReview": "book on cd"}, {"userName": "Kriss", "userReviewDate": "Apr 11, 2011", "userURL": "http://www.goodreads.com/user/show/2002278-kriss", "userReview": "[Haval's funeral (hide spoiler)]"}], "description": "In the tenth year of The Change, the survivors in western Oregon have learned how to live in a world without technology-but there are those who would exploit the new world order. On one side stands Michael Havel's Bearkillers and their allies, Clan MacKenzie under the leadership of Juniper MacKenzie. On the other is the Lord Protector, Norman Arminger-the Warlord of Portland, whose neo-feudal empire rules over much of the Pacific Northwest.The tensions between factions have been building for some time, and the only reason they haven't met on the battlefield is because Arminger's daughter has fallen into Clan MacKenzie's hands. But a plan to retrieve her threatens to plunge the entire region into open warfare.", "title": "A Meeting at Corvallis\n      \n          (Emberverse #3)", "url": "http://www.goodreads.com/book/show/116444.A_Meeting_at_Corvallis", "average": 4.02, "cover": "https://images.gr-assets.com/books/1442277631l/116444.jpg", "reviews": 261, "authors": [{"url": "https://www.goodreads.com/author/show/14002.S_M_Stirling", "name": "S.M. Stirling"}], "type": ["Fantasy", "Science Fiction", "Apocalyptic", "Fiction", "Science Fiction"], "outlinks": ["http://www.goodreads.com/book/show/116444.A_Meeting_at_Corvallis", "http://www.goodreads.com/book/show/1680726.A_Meeting_at_Corvallis", "http://www.goodreads.com/book/show/5968584-a-meeting-at-corvalis", "http://www.goodreads.com/book/show/6645212-a-meeting-at-corvallis", "http://www.goodreads.com/book/show/17947849-a-meeting-at-corvallis", "http://www.goodreads.com/book/show/116445.Dies_the_Fire", "http://www.goodreads.com/book/show/116449.The_Protector_s_War", "http://www.goodreads.com/book/show/99702.Island_in_the_Sea_of_Time", "http://www.goodreads.com/book/show/264225.The_Sunrise_Lands", "http://www.goodreads.com/book/show/2922849-the-scourge-of-god"]}