{"ratings": 7107, "userreviews": [{"userName": "Elyse", "userReviewDate": "Dec 20, 2017", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "Audiobook....read by the author: Ayad Akhtar.....Ayad Akhtar was a natural as narrator for his own novel. He was Excellent! I was quickly drawn into this story when at the beginning Hayat Shah, the son of Pakistani Muslim parents living on the outskirts of Milwaukee, orders a beef hot dog at a baseball game. By mistake it’s a pork hot dog. It’s Hayat’s first time ever eating pork. He experiences an euphoric high: religious freedom! I knew just how he felt. I had never eaten a cheeseburger in my life until college.As a Jew... we didn’t keep Kosher in our home... but there were a few rules we did live by. We didn’t eat dairy products with meat products. Nor did we eat shellfish. Later as an adult when I did eat shellfish — turned out I was allergic. Back to this story:  .....very quickly....we learn about Hayat’s college dating experience. NONE! He was a slow-developing young adult-sexually experienced-guy. I found his new college romance charming. He a Muslim. She Jewish. .....This story is never stagnant. There are many complex issues to ponder. Hayat begins sharing about his childhood with his girlfriend. Flashback to Hayat at age 12....suburban life for he and his immigrant- financially well-off family in the Midwest. We learn about Hayat’s REAL FIRST CRUSH.... a boyish distorted love with his Aunt Mina - his mother’s sister - who comes to live with them ( with her son around Hayat’s age). There is so much chaos in their household. So much religious confusion. Hayat’s dad wants nothing to do with traditional teachings of Islam. His mother does — but is chronically angry at her philandering husband with white woman. He is no prince of a husband ‘or’ father. Hayat’s mother is constantly bashing her husband to young Hayat. She’s a kick of a character...oh my!!! Inappropriate at times...but one self expressive woman. Aunt Mina - is very religious and teaches Hayat the value of Islam. She teaches him to pray and to memorize the Quran. By the time he got to college ....he ‘still’ he remembered his Quran teachings. Having it memorized came in handy for a college course he was taking. There’s a lot going on in this novel...DRAMA..... religious differences, inner conflict questioning of society within the Muslim community, anti-Semitism, domineering men, guilt and sabotage, humiliation, affairs, hypocrisy, family turmoil, sexual awakening, oppression of women, etc.Lots of flaw characters.... I thought this was a very engaging book .... much to think about.... compelling and thought-provoking....definitely held my interest. Great audiobook!"}, {"userName": "Tea Jovanović", "userReviewDate": "Apr 20, 2013", "userURL": "http://www.goodreads.com/user/show/3103000-tea-jovanovi", "userReview": "Crnogorsko izdanje, dobar srpski prevodilac"}, {"userName": "Isabel O.", "userReviewDate": "Jan 13, 2012", "userURL": "http://www.goodreads.com/user/show/7418730-isabel-o", "userReview": "After reading some rave reviews, I was looking forward to getting my hands on this debut novel. Having read it, what I’m reminded of is that it is the book BUSINESS.Here’s what I like about the book: it’s visually provocative (the author has a film background); it’s a quick and somewhat entertaining read; there are a few beautifully written passages. Basically, it’s the book you take to the beach or read on a flight.But no big loss if it gets washed away or forgotten in a seat back. It’s not a book that you will want to return to again and again---mostly because it lacks depth and subtlety. The characters are not human people but plot devices. The treatment of Islam is superficial and predictable: anti-Semitism, oppression of women, sexual repression. The tone is didactic and moralistic. There is something inauthentic and promotional feeling about the book. Basically, it feels like a paint-by-numbers book written in order to be controversial and made into a movie, which I reckon is quite likely.Final thought: This is a fast food novel. Tastes alright, goes down quickly, but promises indigestion, and has little substantive value."}, {"userName": "Sarwat", "userReviewDate": "Sep 01, 2011", "userURL": "http://www.goodreads.com/user/show/6183943-sarwat", "userReview": "American Dervish: Ayad Akhtar’s book is a witty, humorous, educational, sensual and spiritual, insightful, captivating and riveting tale of a young child growing up in the Midwest in the early eighties. The author beautifully and painstakingly narrates the impressions of a child as he struggles to understand the complexity of Islam and thus his own identity, through the controversial messages from many well meaning people in his life. It points to the biases bred through cultural and historical lenses, which have the potential to traumatize the minds of our next generations of Muslims in America. These biases can and (inherently) do shape the very existence of the young minds, unbeknownst to the people who love them the most, their parents and families, who are so caught up in 'their own world' and its challenges. Some of the challenges in this tale are universal to all Muslims while others are very individual to the book’s protagonist, Hayat Shah.While the message of Islam is universal, the Muslims are not monolithic. Cultural influences and customary interpretations from around the world impact the way the religion of Islam is taught and practiced. With migration from around the world, Islamic Centers in America are like a ‘mini United Nations’, a melting pot of Muslims from around the globe, who bring in diverse customs and cultures adding to the beautiful tapestry of the Muslim fabric of America, thus adding to the complexity of understanding Muslims and Islam. Personally, the message of Quran which resonates with me is: ‘Read and Reflect’, as it emphasizes the use of intellect, reason and logic and discourages from blindly following the customs and traditions of ancestors, which may be contrary to the essence of the peaceful religion of Islam. The future of Islam and Muslims, like any faith community, depends upon our youth. With the ever increasing negative stereotyping of Muslims and Islam by parts of the media, clergy and politicians, it is our responsibility to the next generations to bring in an era of Islam, which stands for social justice, equality of all beings and peace. After reading Ayad Akhtar’s book, American Dervish, I am convinced more than ever that the time and need for ‘Ijtihad’ is now, for ongoing contemporary narrative with contextual interpretation of faith and the Holy Quran, individually and collectively by scholars to help reshape and reframe the influence of religion on the mindset of next generation of Muslims, which engages them towards a peaceful coexistence in the world and peace within themselves. Sarwat Malik MD, FACP"}, {"userName": "Murabitha", "userReviewDate": "Feb 09, 2012", "userURL": "http://www.goodreads.com/user/show/3143168-murabitha", "userReview": "This is definitely a fast read. It's not the kind of book you want to linger over or revisit with any eagerness.* But that's not the reason I give it such a low rating. Interesting, compelling books add to the story of stories. They appear fresh. Offer us something new. And, while it is true that every story tells us a tale we've already heard in one form or another, the good ones do it in a way which surprises the reader. This book, American Dervish, rehashes the old in a connect-the-dots, predictable way. I mean, what popular culture American narrative of Muslimness has not included:- oppressed Muslim women- tyrannical Muslim men- violent Muslim men- hypocritical Muslim men- anti-semitic Muslims- the repressiveness of living pork-free- Muslims screeching for rights - Muslims plotting to bomb stuffIt's all in here and yet, we are constantly being told how fresh this book is. Huh? It's sad because I was really excited when I first heard of American Dervish. An American Muslim growing up in the Midwest at such a pivotal moment in history? Wow. I was practically salivating at the depth and nuances such a narrative could open up in the literary world. Reading it, I was reminded of a quote from a brilliant writer friend of mine: No one seems to want to hear that other American Muslim experience, the one that doesn't jibe with the narrative that has already been told. The narrative that has been stamped with approval is the one that is bleak, depressing and troubling. So to make it big, a book has to repeat this message. That is exactly what this book regurgitates - Muslims are troubling people. And, disturbingly, the book world applauds. It's like a book featuring Black people which serves you the same tired stereotypes. Or, a Jewish family drama with that mama, the guilty son etc etc. Fresh? With this schtick though, there's more at stake than just awful stereotypes. This book is full of assumptions about Muslim men and their violent \"tendencies\". Some parts describing Muslim men read like caricatures devised by anti-semitic writers in pre-war Germany to fuel misconceptions of Jewish men. I like what one goodreads reviewer said about how it would be interesting if this book gets much more publicity as it would signify just how much of a platform has been funded for it. *(i.e. The writing doesn't stand out in a way to warrant the accolades.) Still, I am optimistic and continue to hold out for that awesome book that will give us a fresh take on the American Muslim experience. A beautiful compelling book - because American Dervish is definitely not it."}, {"userName": "Jill Lapin-Zell", "userReviewDate": "Sep 24, 2012", "userURL": "http://www.goodreads.com/user/show/2588865-jill-lapin-zell", "userReview": "Ayad Akhtar’s “American Dervish” is one of the most moving books I’ve read in a long time. I won this book in a giveaway on Goodreads, and I’m glad I did, because I might not have picked up this book otherwise, and then would have missed out on a most enjoyable read.This book grabbed me from the start and never let me go. Its characters are multi-dimensional and believably flawed, and the writing is exquisite. For example, the passages where the author describes Hayat’s (who is actually telling his own story) spiritual awakening are particularly vivid and captivating. To be able to describe something so elusive and intangible is truly a remarkable thing. Similarly, the descriptions of Mina’s preparation of tea transcends the mundane. It is one of the most magical and eloquent passages in the book. The writing is almost ethereal. The most profound and significant message in the book is how human beings deal with pain. Every character in the book endures pain; sometimes it’s physical pain, sometimes it’s emotional pain, and sometimes it’s both, but it’s always a defining experience for that character. One caveat: there are some scenes in the book which some readers could find disturbing due to their brutality and violence. However, these scenes are not at all gratuitous and are quite necessary to convey the message of Hayat’s story. Not only do I recommend this book most highly, I also believe that it should be required reading in every multi-cultural studies class in every American high school and college. It will teach you about faith, love, despair and pain. It will resonate with you regardless of your religious and/or spiritual beliefs."}, {"userName": "Moin Hussaini", "userReviewDate": "Apr 06, 2012", "userURL": "http://www.goodreads.com/user/show/8636586-moin-hussaini", "userReview": "The last time I experienced a book like this was after reading The Namesake. Its rare to come from this background and find literature that so accurately reflects your own personal experience.In the case of American Dervish, it is very true to the emotional experience of a young Muslim boy's experience with religion - both alienating and comforting. The characters as more extreme and interesting versions of people in my own life. However, with some I felt that the \"juiced up\" versions of these people resulted in their becoming caricatures (e.g. the orthodox Muslims are made out to be bullies and antisemitic). In my experience, I've met orthodox Muslims without an ounce of bigotry and westernized ones that are terribly racist and antisemitic. I think Akhtar could have been critical of religion without resorting to this Hollywood canard. Nevertheless, a beautifully told and engaging story. I had a hard time putting it down."}, {"userName": "Saleh MoonWalker", "userReviewDate": "Aug 14, 2017", "userURL": "http://www.goodreads.com/user/show/66648866-saleh-moonwalker", "userReview": "Onvan : American Dervish - Nevisande : Ayad Akhtar - ISBN : 316183318 - ISBN13 : 9780316183314 - Dar 368 Safhe - Saal e Chap : 2012"}, {"userName": "Kate Z", "userReviewDate": "May 04, 2012", "userURL": "http://www.goodreads.com/user/show/4806827-kate-z", "userReview": "Before I started this book I saw an interview with Ayad Akhtar on the Tavis Smiley Show which framed my reading and enjoyment of the novel:http://www.pbs.org/wnet/tavissmiley/i...I was charmed and intrigued by Akhtar and especially interested when he talked about this being a novel about faith in America. He said that he thought that faith was an essential element in this country and this novel uses the Muslim faith as a way to explore that. It's not so much a book about being Muslim in America as it is a story about growing up and what it means to believe in God, understand the afterlife and also what it means to follow the practices of the faith into which you are born, either by following or rejecting the teaching(s) of your parents and one boy's journey through that. The main character, the ten year old boy Hayat, is first really introduced to the Muslim faith when his \"aunt\" Mina comes to live with his family from Pakistan. Mina is what we might refer to as a \"spiritual\" Muslim - she is quite devout but she places greater importance on the intention of faith than the actual practice (example, Hayat studies and memorizes the Quaran ... but in English. He is later told that \"doesn't count\", it has to be in Arabic. Mina tells him that it's not the language that counts, it's the intention of memorizing it to be closer to God). Hayat's Mother is a Muslim in name and appearance but not in real practice and Hayat's father is essentially an atheist. Hay at has to figure out whT he believes and what is important to him.The characters in Hayat's immediate family are complex; loving but flawed and that was definitely one of the strengths of the book for me. I had a harder time accepting the more stereo-typical characters in the greater Muslim community. I saw them as archetypes and I suppose that those profiles exist for a reason but those characters, and therefore their interplay into the novel didn't ring quite as true for me.The writing felt like most of the \"literary fiction\" I've been reading lately ... easy enough to read but not transporting. This was a novel of character and plot, not writing or transcendental ideas (despite the inclusion of Quaran passages and many exerpts from and references to R.W. Emerson).Good story which will make for a good book club discussion. I recommend it but it's not an \"all-time great\""}, {"userName": "Jennifer", "userReviewDate": "Jan 11, 2012", "userURL": "http://www.goodreads.com/user/show/1534691-jennifer", "userReview": "Round up my review of 1.5 stars to 2 I guess. This was a hard book for me to get through. When I was given the galley at Book Expo I was told that it was the next \"Kite Runner.\" I should've known better when anyone says a book is the next anything. I really wanted to enjoy this as I feel stories from Asia in general are under represented in the U.S. and am sure that Middle Eastern stories have been on the rise in the past decade. \"American Dervish\" is a coming-of-age story for a young Pakistani-American boy, Hayat. The main story is in the relationship of him between his Aunt Mina, how her residing with his family affects their life, and how Hayat's love for her grows into a dedication to the Muslim faith. His father is flawed as are his mother and those around him and then there's the feelings of love he has for Mina that are both natural and seem to straddle the line of romantic interest. The fact is the main drama is with the adults and as a child he is witness to them and told of them but not always a part of it, which I found to be the weakness. The fact that the whole story is told from his POV in a reflective manner and that he's not as in the drama as he should be that he doesn't confront his philandering father or his overly emotional and submissive mother or his faithful auntie in a bad relationship makes him very submissive and the story run a bit too long. I think much could've been cut and the protagonist of Hayat could have been more active especially since some of what he does is an impetus for later events. The end is rushed, but I did receive a galley so the ending and epilogue may have changed. But the ending was all told and not seen and the convenient reunion at the end seem very forced but I guess expected. I learned a lot about characters and how to utilize narrators and such from reading \"American Dervish.\" And am sorry I didn't enjoy it as much as I wanted to. I did appreciate being involved in the culture and the racism and prejudices but these are things as someone who is friends with people of this culture was aware of already. So perhaps for others it will be quite revealing but for those already in the know, not so much."}, {"userName": "Maggie", "userReviewDate": "Jan 19, 2012", "userURL": "http://www.goodreads.com/user/show/7458043-maggie", "userReview": "More like 1.5 stars.I felt excited to read this book after hearing the author being interviewed on NPR’s Fresh Air. On air, he sounded unsure of himself and, at the same time, very opinionated---a combination I really like for reasons I won't go into here. Akhtar’s bio is intriguing...Ivy-educated, actor, playwright and student of Sufi masters (!). Sadly, his novel is disappointing compared to his punditry. I bet, though, he’d write fabulous essays.American Dervish is a good, quick read but it lacks nuance. What should be complex issues (clash of Islam and the West, sexual awakening, family turmoil, oppression of women) and complex characters end up feeling flat and one-dimensional. None of the characters come to life with any humanness (maybe with the exception of the boy’s father); none of them are particularly likeable. And it doesn’t help that the plot is predictable and the writing spotty. The book does not feel primarily like a novel but more like a platform for a talking head role for Akhtar on all topics Muslim-American. The experience of reading it often left me wondering if a marketing dept wrote the book.I’m pretty puzzled by the good reviews here and elsewhere. (For my money, the most honest editorial review of this debut novel is in Publisher’s Weekly.) It may simply be that Akhtar is bright, personable and has got a good schtick and that the publisher has got deep pockets. Or if I drop the cynicism, it could be that for those readers who are new to the life of immigrants, coming of age tales and the range and contradictions of religious belief, American Dervish is a decent, if simplified, introduction. But for those more engaged with these concerns, the novel is facile and pedantic and doesn’t grasp the subtlety of human relationships. Maybe the main reason this book doesn’t work is that it is a commercial young-adult fable pretending to be a literary novel."}, {"userName": "Ksab", "userReviewDate": "Mar 18, 2012", "userURL": "http://www.goodreads.com/user/show/1500040-ksab", "userReview": "I enjoyed this book and read in in a day!! I found the book very interesting and especially well written in describing the multi faceted joys and challenges growing up in an immigrant commmunity.The author' s character developement as to the dilemnas and issues of personal psychological and cultural identity was amazing. My family has a particular interest in the American Islamic community.My ex husband and I converted to Islam nearly 40 years- I was a Muslim for 15 years- My grown daughter has lived in Saudi Arabia. We call ourselves Muslim-friendly. As a young wife( in my 20's) and mother of 3 young children I grew into adulthood in this community. K"}, {"userName": "Ilyse", "userReviewDate": "Apr 23, 2012", "userURL": "http://www.goodreads.com/user/show/5686285-ilyse", "userReview": "It is a rare book that captures my attention without needing to read 100 pages before finding my groove. This book held my interest from page one. It's a story about a Muslim-American family during the 80's and particularly the young boy, Hayat. I'm not going to summarize the plot. I will say the refreshing perspective Mr. Akhtar focuses on is that while they are Eastern in ethnicity and Muslim, their issues, inner conflicts and questioning of society within the Muslim community as well as their local community is universal. I've read books with Jewish and Christian characters torn between their religious upbringing and society's expectations. I'm guessing some people won't like it because it focuses on the hypocrisy and dogma that religion has. But whether you are a \"believer\" or not, it is a thoughtful, beautifully written story."}, {"userName": "Jill", "userReviewDate": "Dec 21, 2011", "userURL": "http://www.goodreads.com/user/show/2228181-jill", "userReview": "Hayat Shah – the only son of Pakistani Muslim parents living on the outskirts of Milwaukee – is very likeable, the type of person you can imagine sitting down and talking to way into the night. In the first few pages of the novel, he is getting ready to share his life story to a young Jewish woman with these words: “You may not like me very much if I tell you what happened…”But we do. As readers we do like Hayat as he reveals the good, the bad, and the ugly of his story, which begins when his mother’s best friend Mina departs from Pakistan and her controlling ex-husband with her small son. Hayat – at the cusp of adolescence – develops a serious crush on Mina, who encourages him to immerse himself in the Qur’an. Pretty soon, Mina falls for a Jewish doctor – the partner of Hayat’s father and his new sense of purpose merges with his growing sense of “love” and confused feelings of betrayal.It’s not only an intriguing but also a timely premise, as thoughtful Americans strive to gain greater understanding of “what it means to be Muslim.” And I believe the book has much to offer a young adult or mass market audience who likes a linear story with an educational twist. The story has an interesting protagonist, a story arc, and has much to say about the push and pull of secular, mystical, and religious Islam, the evolving role of women, and the confusion that accompanies growing up Muslim in America.However, like many plot-driven made-for-TV movies, American Dervish doesn’t dig nearly enough, not providing its characters with enough of an inner life, and sacrificing depth for a fluid story line. The result is often platitudes and melodrama, with messages strongly telegraphed. Here is Hayat’s mother, speaking to him: “Listen to me and never forget what I’m telling you. If you give yourself to filth and garbage, you will become filth and garbage. You will become the sum of what you desire…Promise me behta. Promise me you won’t end up like him. That you won’t live your life like him.” And here is Mina’s Jewish suitor, Nathan: “The way he has those people beholden to him. It’s revolting and immortal. And it has nothing to do with real Islam. Nothing at all.” Or mother talking about her friend Mina: “I keep telling her the fact that Nathan’s Jewish is a good thing. They understand how to respect women, behta. They understand how to let a woman be a woman, to let her take care of them.”Ayad Akhtar – an actor, playwright and novelist – is obviously striving to contribute to Muslim-Jewish (and Muslim-American) understanding, which is a very worthy goal and a good thing. But by leading the reader to conclusions and by simplifying premises, the book just doesn’t rise to high literary standards. In a world where “unhappiness hovers” and “nerve ends teem”, the novel is ultimately lacking. (2.5)"}, {"userName": "Lauren", "userReviewDate": "Dec 16, 2011", "userURL": "http://www.goodreads.com/user/show/3548900-lauren", "userReview": "There’s a lot to like about this book – indeed, I expect it to be a much read and discussed book in 2012 (and deservedly so). Taking place predominately in the early 1980s in the suburbs of Milwaukee, the book centers on young Hayat Shah and his immersion in his Muslim faith after his mother’s best friend, Mina, comes to live with the Shah family. It’s an absolutely fascinating book – rich and complex with plenty of specific details while still encompassing universal lessons – and wonderfully engaging. That said, if this book were a gymnastics routine, Mr. Akhtar doesn’t stick the landing. The ending drops much of the book's earlier nuance in favor of speeding to a resolution. After a languorous (but never dragging) pace that allowed the story to slowly unfold, as a reader, it was jarring (and not in a good way) to get rushed to the finish line. All the same, it’s worth of a read. Highly recommended."}, {"userName": "Don", "userReviewDate": "Apr 30, 2013", "userURL": "http://www.goodreads.com/user/show/2095370-don", "userReview": "(FROM MY BLOG)And Allah said: I am with the ones whose hearts are torn.--Hadith Qudsi The test of a first rate intelligence is the ability to hold two opposing ideas in the mind at the same time and still retain the ability to function.--F. Scott FitzgeraldAyad Akhtar's novel, American Dervish, begins with a prologue: Hayat, a Pakistani-American college student, is eating his first pork at a basketball game and exulting over his new freedom from the claims of religious faith. The novel then flashes back to Hayat's boyhood, his memories as a 12-year-old, living with his immigrant, but well-off, family in suburban Milwaukee.I began reading with the expectation that Akhtar was about to give us a Muslim counterpart to Joyce's Portrait of the Artist as a Young Man. And, indeed, like Joyce's autobiographical novel, American Dervish is a story of an adolescent boy who, after a period of being deeply devout, becomes disillusioned with his faith. Also, like Joyce, Akhtar reveals the beauty and wisdom of that faith, as perceived by the youth, as well as how religious belief can be used to narrow rather than open the mind of a sensitive and intelligent child. But where Portrait of the Artist is almost solipsistic in the narrator's focus upon himself, American Dervish's primary focus returns repeatedly to an older woman: Mina, the best friend of Hayat's mother, whom the boy calls his aunt.Hayat's family does not fit easily into the local Pakistani community. His father is a physician, an unbeliever, and an irritable but loving father. His mother has little interest in religion as such, but clings to the traditions of Islam out of homesickness for the Pakistani Punjab. Hayat himself is a quiet boy, but initially seems totally American -- Midwestern and suburban in his life and interests.But then, when he is 12, Aunt Mina, a strikingly beautiful woman escaping an abusive arranged marriage, arrives from Pakistan to live with Hayat's family. Mina reveals to Hayat the beauties of Islam, teaches him to pray, teaches him to memorize the Quran. Without understanding his own feelings, Hayat falls in love. Romantic love for an \"aunt\" clearly being impossible, he instead throws himself into her love of Islam. He abandons former pasttimes, spending all his free time memorizing verses.\"Almighty God,\" Muhammad said, \"let me see you.\"And all at once, he saw nothing but the Lord. He looked to the right and saw nothing but the Lord. He looked to the left and saw nothing but the Lord, and to the front, and the back, and above...and everywhere he looked, he saw nothing but the Lord. What the Lord looked like Muhammad would never say, other than that His beauty was so great he would have preferred to stand there gazing at Him forever.But Mina is unlike other members of the local Pakistani community, Muslims whom Hayat's father contemptuously describes as \"sheep.\" She is intelligent, cosmopolitan, and delights in the freedom of American society. She contantly reminds Hayat that forms of worship aren't important to God, what's important are the intentions of his heart. Memorization of the Quran -- which he's told would guarantee his parents' admission to Heaven -- is worthless if he doesn't understand what he is memorizing. Mina is greatly influenced by the Sufi dervishes, mystics whose orthodoxy conservative Muslims have always considered suspect, holy men who seek to surrender everything that might separate them from God's love.What the dervish found was true humility. He realized that he was no better, no worse than the ground itself, the ground that takes the discarded orange peels of the world. In fact, he realized he was the same as that ground, the same as those peels, as those men, as everything else. He was the same as everything created by Allah's hand. ... He and Allah, and everything Allah created, it was all One.Much of the novel's plot describes how Hayat, in his frantic possessive love for Mina, sabotages her engagement with Nathan, a Jewish doctor and his father's partner, forcing her unexpectedly into a marriage with a more \"suitable\" local Pakistani -- a man so insecure that he spends his life locking her away from all other people and physically abusing her.Mina dies of cancer, after years of abuse, a woman crushed in both mind and body by events she could not control -- and events for which Hayat feels intense guilt. Shortly before Mina's death, Hayat visits her in the hospital -- where he finds her delighting in the Scott Fitzgerald quotation she'd found in his published letters -- and confesses how he ruined her life. She told him it was God's will:Faith has never been about an afterlife for me, Hayat. It's about finding God now. In the everyday. Here. With you. Whether I'm living in a prison or in a castle. Sick or healthy. It's all the same. That's what the Sufis teach. ... Every single life, no matter how big or small, how happy or how sad, it can be a path to Him.Hayat can't agree, can't understand the hold Sufi thought has always had on her. She replies that her pain is how God speaks through her.\"[E]verything, everything, is an expression of Allah's will. It is all His glory. Even the pain ...\" She paused. \"That is the real truth about life.\"In an Epilogue, Hayat, years later and now a college graduate working in Boston as an intern for the Atlantic, runs into Nathan in Harvard Square. The doctor had stayed in touch by mail with Mina, clandestinely, and knew her story. He brushes off Hayat's attempts at apology, kindly, and essentially gives him the forgiveness that he needs.Hayat walks away from that encounter, strolling along the Charles river, feeling alive and filled with an odd gratitude. He remembers, for the first time in ten years, verses from the Quran he had memorized back when he was a devout boy of 12:Truly with hardship comes ease.With hardship comes ease!And so when you are finished, do not rest,But return to your Lord with love..."}, {"userName": "John Luiz", "userReviewDate": "Jan 17, 2012", "userURL": "http://www.goodreads.com/user/show/2501223-john-luiz", "userReview": "American Dervish is a terrific coming of age story. What makes it particularly stand out is that the protagonist, Hayat Shah, a 12-year-old Muslim boy isn’t simply the victim of selfish parents or bullying schoolmates. He has a petty and vindictive side, too, and the novel focuses on the lifelong guilt he feels over one particularly cruel act that he’s convinced changed the course of his “auntie’s\" life. The auntie, Mina, comes to America to live with Hayat’s family after her arranged marriage in Pakistan fell apart because of her meddlesome and overbearing mother-in-law. But when her husband divorced her, he threatened to take custody of their son when the boy turned seven. To help her escape that fate, Hayat’s mother, who was a childhood friend of Mina’s, lets her and her son come live with them at their home in Milwaukee. Through Mina, a brilliant and religious woman, Hayat learns about Islam and the Quran for the first time. Hayat’s father, Naveed, lost his faith after his sister died when the two were teenagers and he has nothing but contempt for the religious Pakistanis in their town, whom he sees as ignorant, backward, and hypocritical. Mina uses the Quran to teach Hayat how to appreciate every aspect of life and to live with ultimate humility before God’s graces. She makes him want to become a “hafiz,” someone who memorizes many verses of the Quran. Hayat believes that if he does, both he and his parents will get into heaven – a possibility that fills him with great hope because he worries that otherwise his father’s philandering and drinking will make him burn in hell. The beautiful Mina is more than a religious inspiration to the naïve Hayat. At 12, he still does not know what sex is, isn’t even sure if women have different parts than men, and when he starts having wet dreams, he doesn’t know what’s happening to him. Without understanding anything about sex, Mina is his first crush – a situation that becomes all the more complicated when he catches Mina in the middle of the night naked in the bathroom and on the verge of touching herself. As aroused as that image of her makes him, he doesn’t use it for his own masturbatory fantasy, but instead tries to become more devout. But when Mina meets and falls in love with his father’s partner, Nathan, Hayat does all he can to destroy that relationship, out of jealousy and because Nathan is Jewish. When Mina herself realizes the relationship with Nathan won’t work because of their religious differences, her family’s objections, and her son’s desire for a father who isn’t white, she settles for a marriage to a weak and mentally unstable but domineering Muslim man, and Hayat has to deal with years of guilt for sabotaging her one chance at happiness. Hayat’s mother is a particularly strong character. She suffers the constant humiliation of her husband’s affairs and opens up to her son about far more than she should, but when Mina lashes out at Hayat for trying to poison her son’s mind about the prospects of a Jewish stepfather, Hayat’s mother comes to her son defense and lets her best friend know she’ll kill her even she ever touches her son again. Overall, this is a courageous book and one that offers a not very flattering look at the anti-semitism and misogyny of a small group of Muslims who use the Quran to justify their hatred of the Jews and, in some cases, men’s right to beat their women. But this community of Muslims is no different, I suppose, than the Christian right when they use the Bible to justify homophobia. Here, Mina, provides the thoughtful counterbalance, by showing the goodness and humility the Quran can inspire when interpretations of it aren’t use to justify mean-spiritedness and cruelty. There is a lot of wonderful moral complexity to consider here. Is Hayat responsible for Mina’s fate or is Mina the one who set the ball in motion by filling his head with verses from the Quran and leading him to a mosque that would never accept Jews? Did Hayat’s one sabotaging truly alter the course of Mina’s life or did she make free choices along the way? It’s a lot to ponder, and the author deserves considerable accolades for embedding these issues inside a highly entertaining and moving story with so many great, fully-rounded characters."}, {"userName": "Roxane", "userReviewDate": "Feb 03, 2013", "userURL": "http://www.goodreads.com/user/show/1151637-roxane", "userReview": "This is a fast read, a coming of age story about a young man who falls in love with his mother's best friend and makes a terrible choice that has terrible consequences. I didn't care for this book. It made all women suffer and all men tyrannical. There was little variation in how any men and women in this book related to one another. There was very little happiness to be found. And then there was so much of the book that felt more like a nonfiction book about the Qu'ran. I wanted those sections to be woven more seamlessly into the narrative. I also thought the prologue and epilogue were really unnecessary and weakened the novel. The epilogue, in particular, was a way of allowing Hayat, the protagonist to have his guilt slightly absolved. It didn't serve the story. It served the writer and the reader and a desire for pat closure."}, {"userName": "Erick Mullen", "userReviewDate": "Jun 15, 2011", "userURL": "http://www.goodreads.com/user/show/5625129-erick-mullen", "userReview": "If you have ever been a father or a son, read this book. If you've ever loved someone you weren't \"supposed\" to love, read this book. If you watch the news and wonder why the Middle East is in constant turmoil, read this book."}, {"userName": "Logan", "userReviewDate": "Dec 19, 2011", "userURL": "http://www.goodreads.com/user/show/7213507-logan", "userReview": "Ayad Akhtar’s a friend, but even I was surprised by how much I was moved by his novel, American Dervish (Little Brown, January, 2012). It goes against the noise that seems to be everywhere in the news these days – protests, strife, discontent. It’s a quiet, thoughtful story about a boy trying to make sense of his life navigating the difficult topics of religion (Islam) and his culture’s “dirty laundry” – in this case, the neuroses of a Pakistani Muslim American family living in Milwaukee, Wisconsin.Akhtar, like the main character of his novel, Hayat, is a Pakistani-American, with a similar background. The book is (obviously) fictionalized to give him more artistic freedom. And given the turbulent nature of the material (Islam and its conventions) that’s understandable.There are critics of his work, perhaps as it should be. This is not a novel meant to foment debate and yet I do feel it can be challenging to be a truth-teller in any culture. What Akhtar’s written is both a story of a boy coming to terms with a youthful infatuation and a yearning for a sense of belonging – a sense of peace within himself, his family, and the wider culture.One of the choices he had to make was whether to write an academic dissertation of the state of the Muslim mind, a kind of Franz Fanon-for-Islam or a fully accessible work that conveys both the complexity of the situation as he sees it, but in a way that was not pedantic or overly academic. (And believe me, Akhtar, who teaches acting at a fancy school in Vienna and has degrees from Columbia and Brown could definitely have gone there.)But he chose the former, in short, he wrote something entertaining. And I think this was good – because let’s face it, in the post 9-11 world, an illuminating book about growing up Muslim should reach as many people as possible, and the best way to do that is to make it, well, a good read.And yet, to see this only as a book about Islam is incorrect. If anything, American Dervish really is about how specificity can help us see universality – in the same way that Jeffrey Eugenides remarkable novel Middlesex, a story about a Greek hermaphrodite growing up in Detroit, is not really about any of those qualifiers – Greek, hermaphrodite, Detroit – but about how we all can begin to transcend the labels of who we think we are. I believe Akhtar is still on a journey to discovering the layers of this truth and I look forward to his future works. We as readers are well served to have this novel as a contribution to our greater understanding of each other. I think his words are a plea for reconciliation – with the past, with conflict, with love, and with the divine. Many of us are unwittingly seeking those answers, but it is the courageous work of artists who have the ability to make that quest conscious – to share their efforts in the hopes that it will help the world. Akhtar put that struggle to the page. As if to drive the point home, he writes: The branches lightly creaked and swayed in the breeze. The river softly coursed at the bank’s edge.I kept listening. Another breath. And then another. And then again.And finally I started to hear it. It was only this:My heart, silently murmuring its steady beat.This passage comes at a moment when you think the main character is completely despondent, but it is instead a moment of clarity. He’s finally found what he’d been looking for.And this is why I am telling you – amidst all the noise, all of the drama, if you are quiet you will find there are people making works of goodwill. This is among them."}, {"userName": "Blair", "userReviewDate": "Jan 31, 2012", "userURL": "http://www.goodreads.com/user/show/272909-blair", "userReview": "Told mostly in flashbacks to the early 1980s, this coming-of-age novel focuses on Hayat Shah, a young Pakistani boy growing up in the American suburbs. Much of the plot revolves around his first crush on his 'auntie' Mina, his mother's best friend, who comes to stay with the family having fled her parents and husband in Pakistan. With Hayat's Westernised family lacking in any strong religious convictions, it falls to Mina to teach him about Islam, and a combination of youthful confusion and his burgeoning 'love' for Mina results in the boy becoming obsessed with the teachings of the Quran. When Mina becomes involved with Nathan Wolfsohn, a Jewish friend of the family, Hayat's jealousy, emotional confusion and religious fervour lead him to take actions which - as you might expect - have terrible consequences for almost everyone.Hayat is an engaging, likeable narrator and his journeys, both personal and religious, are related in a believable style. The naive purity of his adoration of Mina is touching, and his relationship with his parents, often awkward but full of love, is sensitively portrayed. His religious awakening, too, is carefully handled - he experiences great enlightenment, but is also exposed at an impressionable age to extremist views which threaten to warp his mindset and damage those he cares for. As a backdrop, the multiculturalism of the local community is very interesting, although there were times when I wished I could step outside Hayat's first-person viewpoint and learn more about his family, neighbours and acquaintances.I found American Dervish a pleasurable enough read: however, it moves at a leisurely pace to say the least. Nothing dramatic happens until halfway through the book, and even then, the 'action' is very subdued. Although I liked the story throughout, I often found it difficult to summon up any motivation to keep reading, and spent chapter after chapter wondering exactly where it was going. The prose style is nice, and flows well enough, but it's occasionally clumsy: I did feel at some points as though the book could have benefited from better editing.This is not a story in which the characters are given neat, happy endings - Hayat is the only one whose life appears to reach a positive conclusion, and even then it's bittersweet. The sometimes bleak story arc is admirable, but it can make what happens seem dull at points, and the reader is denied the dramatic showdowns, romantic reunions etc that could have been portrayed in a less realistic version of this story. In the end, the realism of American Dervish is both a plus and a minus. It makes the book feel 'better', more literary, more of an achievement - but it also makes it far less compelling than it could have been."}, {"userName": "Sorayya Khan", "userReviewDate": "Jan 09, 2012", "userURL": "http://www.goodreads.com/user/show/2683005-sorayya-khan", "userReview": "In a post 9/11 world in which the market's interest in Islam rewards a certain interpretation of the religion, I had my suspicions when I learned of American Dervish a few weeks ago. But when I heard the author on NPR, I liked the way he spoke of writing and his motivation for the book and decided to read it. The novel is Hayat's coming-of-age story set in Milwaukee where his Pakistani parents are immigrants. It is a commentary on growing up Muslim in a particular kind of Muslim community in the US, traversing the fissures of an immigrant's home life in the Midwest with school and all else outside the home. But the novel is also, very specifically, a coming-of-age story that is intertwined with the discovery of Islam. Hayat doesn't think much about Islam until his mother's best friend, Mina, appears at the scene with her young son, Imran, and introduces Hayat to the Holy Quran, the Prophet, and the rewards of studying the religion. All the while, however, Hayat falls hard for Mina in the serious crush kind of way all of us can remember from our youth, and Hayat's relationship with Islam unfolds alongside his awakening sexuality.Ayad Akhtar's prose is blissfully simple, no curlicues or stylistic tricks, a relief to me, given some of the things I've been reading. The story he writes is easy to follow, the timeline direct. On the other hand, there were elements that got in my way of surrendering to the narrative. The constant and explanatory nature of Islam was distracting and, in my humble opinion, overdone. The reader, even if non-Muslim, does not require so many verses of the Holy Quran included, nor so much explanation. Further, did Ayad Akhtar have to concentrate so hard on all that is negative about the Pakistani immigrant community in the US? The stereotypes are never ending. The idiotic Imam and his lackies, for example. Must all the Muslim men be problematic: a drunkard, philanderer, wife-beater, opportunist? Also, I am skeptical of some of Akhtar’s choices. The tendency of Hayat’s mother to confide in her son as a confidante – and about his father, no less – does not make sense.But what finally pulled me in, what finally rang utterly and completely true, what elevated this piece of fiction to the realm of universality was this: Hayat does something so cruel, so mystifying and yet so completely comprehensible, a child of any background, pulled by any number of forces, might have done the same. His cruelty changes Mina’s life, and thereby his and his family’s as well. It becomes the secret, the burden, he carries inside him as he grows into a man. This is the devastating truth that made the book worthwhile."}, {"userName": "Sayema", "userReviewDate": "Jan 19, 2012", "userURL": "http://www.goodreads.com/user/show/7014112-sayema", "userReview": "As a Pakistani Muslim American born and raised in the US, I was very excited when I heard about this coming-of-age story of a Pakistani American boy in the US written by a Pakistan American author. I also read positive reviews and, therefore, anticipated reading a nuanced, refreshing story with multidimensional characters reflecting an authentic Pakistani Muslim American experience. My anticipation quickly turned to dread as I read the first few pages of this novel, which describe the main character Hayat's so-called liberation and \"freedom\" from his religion as he sinks his teeth into a pork hot dog. The next few pages describe a college class in which the professor challenges the authenticity of the Muslim holy book, the Qur'an, while the protagonist Hayat happily follows along. It immediately struck me as an easy plot device for the author to portray the main character as one who has rejected his religion in order to gain freedom. I dreaded the rest of the story for fear that it would surely paint all Muslims as one-dimensional stereotypical caricatures...closed-minded extremists...but part of me hoped that that I would be wrong.Unfortunately, I was right. The cast of Pakistani and Muslim characters in this story covers the majority of stereotypes widely disseminated in society today: closed-minded, anti-Semitic Muslims; violent, abusive Muslim men; philandering, alcoholic hypocritical Muslim men; oppressed, fatalistic Muslim women. Aside from the one arguably nuanced character in the story, Mina, the rest of the characters are one dimensional. The negative portrayal of Pakistani Muslims as a whole was not only disappointing; it reeked of inauthenticity to me. There was a lack of nuance and a lack of humanity in these characters that rendered them unlikeable and unrelatable. I feel very let down. I hoped to read a story in which I could see a bit of my life experience within its pages. Instead, I read a story which panders to the mainstream Western narrative of Pakistanis and Muslims as backward, dysfunctional, extremist abusers, a story in which the protagonist must reject his identity and religion to find any semblance of redemption. I gave this story two stars because it was written well, for what it was, making for a fast and, at times, gripping read. On the whole, though, a disappointment."}, {"userName": "Elizabeth☮ ", "userReviewDate": "Feb 11, 2017", "userURL": "http://www.goodreads.com/user/show/990216-elizabeth", "userReview": "This is told from eleven year old Hayet's perspective. The family are Pakistani and Muslim, but do not really practice their faith. Hayat's father has a disdain for the Pakistani community and so the family are rather insular. That changes when a family friend, Mina, escapes a bitter divorce and comes to live with the family. Mina becomes a mentor to Hayat in his study of the Quran. What develops is a tight bond that causes Hayat to become jealous of any other person that takes Mina's attention from him. This is a study in faith and how that carries you in life. I found the ending particularly moving as we get to see Hayat make amends with those he has hurt."}, {"userName": "Cathy", "userReviewDate": "Feb 08, 2012", "userURL": "http://www.goodreads.com/user/show/5878625-cathy", "userReview": "Yet another book that gets rave reviews but gets a thumbs down from me. I wanted to like this, it started off pretty well, but then I got stuck. Most of the characters are just not likeable, the writing was flat at times, and I don't particularly enjoy \"coming-of-age\" stories. I was interested in learning about the Pakistani culture and traditions, but towards the end of the book, it became too depressing. Forced marriages for woman, brutal fathers, barbaric husbands, women who are completely oppressed -- sometimes physically and or emotionally. Hayat, the main character is about 11 or 12, and the story is told from his view. He and his family live in America, and a cousin of his mother's, Mina, comes to live with them with her young son, essentially to escape her father and ex-husband in Pakistan. Hayat is entranced with the beautiful Mina and she encourages him to learn more about his Muslim faith. Lots of conflict ahead -- familial and religious -- with terrible consequences."}, {"userName": "Constance", "userReviewDate": "Oct 01, 2012", "userURL": "http://www.goodreads.com/user/show/602423-constance", "userReview": "I want to give this book more than one star, really I do, but I just didn't like it. The whole book should have been a short story (and not a novella-y short story a la Alice Munro or Unaccustomed Earth, but a real short story) - I didn't find out any more about the characters after the first chapter and it was just conversation after conversation after conversation. Boring. Also the trope of Thing That Happened In The Past That Is Not Named Until The End is just so overused, that if you do use it, the Thing has got to be huge. For real huge. None of this, I omitted or lied and it had consequences, blah blah. It has to be like, \"Shit, man, my brother is actually my dad!\" or, \"And I'm a ghost!\" (but not that, because that's obviously been overdone too). Anyway, sorry, person of color author. :("}, {"userName": "Helena (Renchi King)", "userReviewDate": "Feb 26, 2016", "userURL": "http://www.goodreads.com/user/show/17067875-helena-renchi-king", "userReview": "Uživala sam u svakoj stranici! Ovakav stil pisanja volim.Puno mudrosti,pisane jednostavnim jezikom,iz perspektive dječaka.Dječak je Hayat,musliman porijeklom iz Pakistana.Upoznaje Minu,majčinu najbolju prijateljicu koja dolazi u Ameriku živjeti s njima,nakon mučnog razvoda.Mina je legenda..prelijepa,obrazovana s posebnim senzibilitetom prema vjeri.Ona postaje centar njegova svijeta.Ona ga uči o Islamu i svemu bitnome u životu..Priča je prekrasna,surova,tužna i velika.Sve u jednom!Svakako vam savjetujem da pročitate..:-)"}, {"userName": "Robin", "userReviewDate": "Jun 21, 2016", "userURL": "http://www.goodreads.com/user/show/19993-robin", "userReview": "Here's what I expected: Boy is troubled. Boy struggles with conflicting value systems of an ancient religion and a modern American lifestyle. Boy undergoes various family or other personal conflicts to emerge with less-naive but still deeply personal connection to cultural heritage and defines his own relationship to his faith (perhaps influenced by a 1990's America obsessed with independence of spirit.) We all feel better, learn something, and feel more tolerant of Islam provided that the practice of it is peaceful and benevolent, which at least some characters in the book prove to us that it can be. That's not what this book is. Instead, it is a harrowing account, somewhat carelessly and superficially written, of one boy's formative encounters with the best and worst that his religion has to offer. No punches pulled, sometimes quite literally. Roughly estimating, the pure, supportive, centering, joyful, and uplifting experiences of the narrator make up about 5%. The rest is pain and fear, both sublimated and openly expressed, displayed in the wide variety of ways that we as humans are so talented at accessing, so we are treated to needless repression and self-sacrifice, shouted hatred and incitement to violence, and everything in between. Ultimately, there is no portion of Hayat's religious experience that is untainted by wretchedness, and he escapes from it all in his young adulthood that makes readers feel grateful that the cycle will at least not repeat itself. This book neither challenged nor provided shades of color to my existing opinions about religion and how individuals use it to gain power over one another. I'm already a confirmed skeptic of organized religion, particularly the monotheistic faiths. I think that whoever invented the idea of hell has a lot to answer for. Those of us lucky enough never to have felt the dread of that eternal punishment are given the tourist's view of it here through Hayat's experience. What I found far more interesting than Hayat's motivation to avoid hellfire is his slowly unfolding understanding of Mina's core beliefs, since they clearly transcend Islam. Mina is inspired by Islamic texts and stories, teaching Hayat to interpret them with a focus on love, forgiveness, and good intentions. Her method of prayer is so close to mindful meditation that she might almost be referencing the yoga sutras of Patanjali. Unfortunately, Mina does not engage with Hayat about any of the violent or oppressive passages of the Koran. He is left to discover those on his own and hear them interpreted by others. How convenient for the novel that this is so. Akhtar gets quite a bit of extra pain by deciding that Hayat will not read the entire Quran and think about it, but instead will focus on memorizing it slowly so that he can become hafiz, thus ensuring a place for both himself and his parents in heaven. What a wasted opportunity for a deeper discussion. I wanted to hear him ask Mina about the fourth surah, which exhorts men to beat their wives if they do not obey, and the other passages with which he struggles as he encounters them in less thoughtful circumstances. Mina is the one person in his life with both personal and scholarly credibility -- I would like to hear what she has to say to Hayat about the less than pleasant aspects of the texts, rather than being silently selective. Instead, here is a fair reading of the overall arc of the novel: Hayat was untroubled by religious anxiety before Mina's arrival, since both of his parents had, to different degrees, shrugged off their religion. Mina then indoctrinates him with the Quran and her own joyful approach to spirituality, and leaves him unprepared for the moral quandaries to follow. No one picks up the slack to teach Hayat anything about his own sexuality, his place in society, or how to be a good and thoughtful person. He hears plenty about what NOT to do, and combining these excoriations with the impossible ideal Mina has set leaves him incapable of handling the inevitable cognitive dissonance which follows. Bad things happen. Gosh, if only Mina had not given him that Quran in the first place, what traumas might have been avoided? I find that story disappointing, and that is one reason that I am rating this as mediocre. The remaining reasons are the flat writing style (I felt this, he did that), the unconvincing voice of the ten-year-old narrator, and the lazy lapses in first-person focus when convenient for the author. The characterization is adequate but not memorable. Every character is flawed, and all of those flaws are laid out clearly for the reader to inspect. Meanwhile, none of the individual characters are perceptive enough to understand each other very well, so readers feel superior to the entire bunch. Overall, I am glad this book was not what I was expecting, as that would have bored me. The surprise here is that the author reveals so much of the very real negative aspects of a religion without apologizing for it or feeling the need to redeem it. I did, however, strongly wish for better writing and a few more deep conversations about faith, so that the book might linger longer in my thoughts."}, {"userName": "Laura Leaney", "userReviewDate": "Dec 19, 2011", "userURL": "http://www.goodreads.com/user/show/3633494-laura-leaney", "userReview": "This is a tough book for me to review. Although the story is a fine one, the writing isn’t artful or fresh enough for my taste. For most of the book I felt mired in stereotypes, although the generalities (Jews are smart and sensitive, Muslim men are narrow and patriarchal, women are hysterical and shrewish) are mouthed by the characters, not the author, I can’t help but feel that the book is too much surface and not enough depth. The story is told by Hayat Shah, a Pakistani-American, remembering the time he told his future college girlfriend, the Jewish Rachel, about his childhood. And it’s a tormented childhood, because Hayat is turned on to the Quran by his “Aunt” Mina while his secular doctor-father adamantly opposes his son’s new obsession and burns Hayat’s Quran in the backyard. Some of the scenes are painful to read; there’s so much at stake (marriages, honor, safety, reputation) – and the conflicts are not completely resolvable. Much of religious life, it seems to me, depends upon a person’s ability to accept paradox and ambiguity. If you embrace The Word literally (either the Bible or the Quran or the Upanishads or the Guru Granth Sahib Ji or the Torah or the Yasna………) then you’ve got to be able to reconcile the ancient intolerances with what modern culture expects or what your heart knows is truer. This is the idea that I think Ayad Akhtarv depicts, and his Muslim characters suffer additional hardship in trying to maintain this ancient faith in America. Hayat Shah’s boyhood study of the Quran begins simply as an attempt to secure the love of his beautiful and pious Aunt Mina. Along the way, he experiences moments of true spirituality (and many of the Quran’s verses are very beautiful) but between his scoffing father and his bitter, Freud loving mother, he gets completely fucked up. The narrow-minded and hypocritical members of the community intensify this effect during his most sensitive pre-adolescent years.I have no doubt that Akhtar must have offended more than a few believers with his portrayal of devout American Muslims. I like his bravery."}, {"userName": "Shirley", "userReviewDate": "Jan 27, 2012", "userURL": "http://www.goodreads.com/user/show/4564577-shirley", "userReview": "When I picked up a copy of American Dervish, I was immediately immersed in the story and didn't want to put the book down. Ayad Akhtar writes compellingly with a great talent for pulling the reader into the story with characters so realistic and imperfectly flawed that we feel an intimate knowledge of each person therein. American Dervish is the story of a Muslim family in America, with a great deal of reference to the Quran, the teachings of the Muslim religion and how time and maturity and experience can change how one interprets anything, including religious texts. There are a great number of trials, even amongst the community of fellow Muslims, and their perceptions of one another are often a source of contention amongst themselves. There are characters we come to admire, to empathize with, and others we loathe. That's how well developed they are. In saying all this, how wonderfully planned and executed this entire book is, there are portions I take exception to. In my personal opinion, American Dervish would have been much better without all the graphic sexual details! It deterred from the story that up to that point I had been enjoying. That being said, American Dervish enables an understanding of the difficult transition it can be for those of other faiths and/or cultures to acclimatize to an entirely new life. With a few exceptions, as noted previously, American Dervish tells a compelling tale of transitions, loyalty, love and honour in a book that may just make it to the big screen.'"}], "description": "American Dervish is a brilliantly written, nuanced, and emotionally forceful look inside the interplay of religion and modern life.Hayat Shah is a young American in love for the first time. His normal life of school, baseball, and video games had previously been distinguished only by his Pakistani heritage and by the frequent chill between his parents, who fight over things he is too young to understand. Then Mina arrives, and everything changes.Mina is Hayat's mother's oldest friend from Pakistan. She is independent, beautiful and intelligent, and arrives on the Shah's doorstep when her disastrous marriage in Pakistan disintegrates. Even Hayat's skeptical father can't deny the liveliness and happiness that accompanies Mina into their home. Her deep spirituality brings the family's Muslim faith to life in a way that resonates with Hayat as nothing has before. Studying the Quran by Mina's side and basking in the glow of her attention, he feels an entirely new purpose mingled with a growing infatuation for his teacher.When Mina meets and begins dating a man, Hayat is confused by his feelings of betrayal. His growing passions, both spiritual and romantic, force him to question all that he has come to believe is true. Just as Mina finds happiness, Hayat is compelled to act -- with devastating consequences for all those he loves most.American Dervish is a brilliantly written, nuanced, and emotionally forceful look inside the interplay of religion and modern life. Ayad Akhtar was raised in the Midwest himself, and through Hayat Shah he shows readers vividly the powerful forces at work on young men and women growing up Muslim in America. This is an intimate, personal first novel that will stay with readers long after they turn the last page.", "title": "American Dervish", "url": "http://www.goodreads.com/book/show/11080141-american-dervish", "average": 3.66, "cover": "https://images.gr-assets.com/books/1324342899l/11080141.jpg", "reviews": 1089, "authors": [{"url": "https://www.goodreads.com/author/show/4783638.Ayad_Akhtar", "name": "Ayad Akhtar"}], "type": ["Fiction", "Young Adult", "Religion", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/11080141-american-dervish", "http://www.goodreads.com/book/show/17833282-ameri-ki-dervi", "http://www.goodreads.com/book/show/13528358-american-dervish", "http://www.goodreads.com/book/show/13446763-american-dervish", "http://www.goodreads.com/book/show/13546202-ameri-ki-dervi", "http://www.goodreads.com/book/show/17801667-disgraced", "http://www.goodreads.com/book/show/22553549-the-who-the-what", "http://www.goodreads.com/book/show/25677398-the-invisible-hand", "http://www.goodreads.com/book/show/30201089-junk", "http://www.goodreads.com/book/show/25398742-el-aroma-secreto-del-lim-n-y-las-especias", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}