{"ratings": 668, "userreviews": [{"userName": "Patti", "userReviewDate": "Jan 14, 2013", "userURL": "http://www.goodreads.com/user/show/16427962-patti", "userReview": "Dear Library of the Living Dead:I say this as a fan of the Post-Apocalyptic genre, and zombies in particular.Please stop. Please stop putting out sub-par material, thereby making the genre a laughing stock among everyone else. Failing that, since I'm sure you want to jump on the \"Walking Dead\" bandwagon: Please publish writers who have some semblance of a plot and know what research is. Please don't publish writers whose maturity level peaked in tenth grade. Please hire a proofreader, or an editor, or a college freshman looking to make extra bucks because most of them know that \"too\" and \"to\" mean two different things and that character's names stay consistent throughout the book.Thank you."}, {"userName": "Cameron", "userReviewDate": "Jun 12, 2013", "userURL": "http://www.goodreads.com/user/show/1593477-cameron", "userReview": "Thank god I didn't pay for this.This is an absolutely awful, juvenile, amateur attempt at a zombie novel - quite possibly the worst I've ever read. I should have put it down when I read this line:...reaches the fence but keeps trying to walk forward like a retarded kid.Then I read this line:He slams it back home and jerks the barrel back so there is one in the chamber...and decided I'd keep reading for the laughs. I made quite a few more notations on my Kindle, but I won't bother to transcribe them all here. Suffice it to say that Mr. Long makes the grievous error of attempting to write about things like medicine and firearms without bothering to take the time to make even a cursory Google search to see what, for instance, Coumadin would do for a hemorrhagic stroke, or how a pistol is loaded. Women in the novel are treated with levels of misogyny and chauvinism that I would expect from a hormone-addled and poorly raised high-school boy. Multiple chapters are written as a platform to describe sex and sadism fantasies and make no attempt to advance the plot.In short, this book should have remained a private endeavor, locked in a drawer in a desk. I feel cheated to have spent my time on it; don't dare make the mistake of spending money on it."}, {"userName": "Patrick D'Orazio", "userReviewDate": "Nov 05, 2010", "userURL": "http://www.goodreads.com/user/show/4328815-patrick-d-orazio", "userReview": "Among The Living takes place in Seattle and starts out sharing with the reading audience the lives of four different people in the city. The author uses both third and first person perspectives as we go through the routines of their days. Hints of the start of an undead uprising are sprinkled throughout the story but much of the early part of the book keeps that as background noise for most of the characters...there is a gas leak in a neighborhood, it is cordoned off, there are strange stories on the internet but the news networks are saying nothing and the stories are disappearing as quickly as they appear. As the story rolls on we are given small bits and pieces, a few attacks, there is footage found online of some shaky cell phone video, etc. but the city and the main characters, for the most part, have no real comprehension of what is going on until it is far too late. The author slips from one character to the next with relative ease, pacing the story through their eyes, and in particular, through Mike, a journalist's eyes, who is telling us his story in first person. The other stories, about Lester, a drug dealer caught inside the neighborhood that is originally cordoned off, Kate, a serial killer who is just getting warmed up, and Grinder, the lead singer of a heavy metal band, are all told in third person. Tim does an excellent job of getting us up to speed on all his character's lives and how they act and react to everything going on around them. I found it particularly interesting that the only person we are given first person exposure to is the journalist and likely the most normal person of the bunch. Mike is dealing with difficult issues but his burgeoning relationship with a co-worker seems a bright spot in a story filled with three other characters who are all, in my humble estimation, disturbed in their own particular ways. It would have been interesting to see the first person perspective of the serial killer, though the insights into her psychy are pretty indepth (I would especially like to see the first person perspective of the \"other\", which drives Kate to do the horrid things she does). When it is finally clear that the deaders are at their full strength and their numbers are growing rapidly, the violence is in your face, visceral, and merciless. The author indiscriminantly throws us into the blender and lets us taste the agony of a city that is dying and coming back to life with the undead. A sequel would be natural and makes complete sense because in many ways, this tale has only just begun. The story is solid and the characters real and fascinating. I kind of figure Tim decided to give us the first person perspective with the more \"normal\" character of the lot. Since these four barely get to interact during the book, it will be interesting if he decides to carry along with a first person view and see what perceptions Mike develops about the drug dealer, the heavy metal lead singer, and the serial killer. The book is excellent and Tim, a first time novelist but someone who has written quite a few other works, definitely has some chops as a writer. My only true criticism is that there are some typos sprinkled throughout the book. Nothing that really detracts from the story but they are noticeable. It certainly did not keep me from enjoying the book a great deal and I am looking forward to picking up the sequel down the road when he gets around to writing it. If you are a fan of zombies or just of apocalyptic fiction in general, this is definitely one to pick up."}, {"userName": "Rhiannon Frater", "userReviewDate": "Oct 30, 2009", "userURL": "http://www.goodreads.com/user/show/1805401-rhiannon-frater", "userReview": "First off, I'm a big fan of Timothy W. Long's work. He submitted a short story to the witches anthology I am editing and I was instantaneously hooked on his writing. I then became a fan of his completely hilarious and gruesome online blog called “The Zombie-Wilson Diaries.” It has been snatched up for publication by the Library of the Living Dead Press and I am thrilled to be the editor.But despite my great love for Timothy Long’s work, I had yet to read “Among the Living.” When I found out I would be editing “The Zombie-Wilson Diaries,” I decided to order the book and add it to my huge stack of “to read” novels.This last week I dove into the book and I have to say I really enjoyed it. Tim has a unique way of writing that is very fresh and entertaining. Humor mixes easily with horror as he weaves a story about four very different people living in a city that is slowly sliding into chaos. The characters and their relationships come across as realistic and you find yourself being drawn into their world. Even though a few of the characters were not the best humankind has to offer, I found myself caring about their fate as the tension ratcheted up and the undead (or deaders) became more of a threat.Though there are four “major” characters, their time at center stage varies greatly. In fact, a “minor” character, named Alice, had me utterly wrapped up in her fate, whereas one of the major characters, Grinder, could have disappeared out of the story completely and I wouldn’t have missed him. His time at the center of the story was very limited and did not give me enough time for me to actually care about whether he lived or died.Lester, the drug dealer, and his girlfriend are a strong presence in the book and their sections are very suspenseful and frightening. Kate, the serial killer, is interesting, but really doesn’t have much to do other than off a victim then spend a lot of time talking to her neighbor, Bob. It is not until the end that she really comes into her own. Mike, our first person narrator (the others are written in third), has a tragic past and his budding relationship with a co-worker is very well-done. They really don’t do much until the very end, but by then, I was so emotionally invested in their relationship, I was on pins and needles as they tried to escape the hordes of zombies.This is definitely a solid four stars. I wish I could give it more, but I felt the uneven distribution of time among the characters weakened their impact on the overall storyline. I really loved the entire overall plot, the slow buildup of tension until the city explodes in mayhem, the characterization as a whole, and the gory, action-packed scenes toward the end. This is a good, solid zombie book and I highly recommend it.That being said, the best Timothy Long writing has yet to be revealed when “The Zombie-Wilson Diaries” is released in the near future. I may be a little biased in my review because I know this writer hits his full stride in that novel.One last note: the editing is not what it should be, but it does not deter from the story one iota.In short, BUY THIS BOOK! You won’t regret it."}, {"userName": "Starla B", "userReviewDate": "Jan 25, 2012", "userURL": "http://www.goodreads.com/user/show/4723546-starla-b", "userReview": "This story was gory, disgusting and terrifying, everything a zombie novel should be. I loved it! The descriptions painted a very vivid picture. I'll have nightmares for weeks, but I can't wait until the next installment comes out! A number of reviewers seem to have issues with the grammar and spelling. I can't say I really noticed the errors as I was reading, but I might be more forgiving than some readers. If you are someone who is offended by those type of errors, this might not be the book (or version) for you. Other reviews also talk about some of the unnecessary characters that don't add to the plot. Since this is the first in a series, I believe those characters will become important in the following books. They appeared in this book to provide their background as the events were happening. Yes, most of the characters are horrible people. Sometimes I felt the zombies were more sympathetic and easier to relate to than the live characters. However, I look forward to seeing those characters' personal growth in future installments."}, {"userName": "Toni", "userReviewDate": "Aug 21, 2013", "userURL": "http://www.goodreads.com/user/show/13706669-toni", "userReview": "This review is also on My Book Addiction as part of #zOctober2013! Holy. Crap. Among the Living is all kinds of mess-you-up-in-the-head goodness! This story is strange and wonderful, and I couldn’t stop reading it.This is a story about the first days of the apocalypse. The residents of Seattle are informed of a “gas leak,” an obvious cover up to keep people from panicking. The scenario is presented from several different POV’s, all very interesting and peculiar characters that took me by surprise. I mean, Lester’s girlfriend sends him away from the safety of their apartment to nab a designer bag from their friend, who is now a walking corpse with a really expensive purse! Who does that? Lester and his girlfriend had me laughing and made me tense at the same time. An odd combination of feelings, indeed.Mike, a journalist with a troubled past and a slow-growing fondness for his co-worker is the only character that comes at you from a first person viewpoint. I really enjoy first person narration when it’s done well, as it pulls me deeper into the story. It’s like having a friend tell you their story. I felt the biggest connection to Mike and Erin, and was chewing at my lip with anxiety as they tried to escape the undead. The rest of the characters are presented in third person — Lester and his crazy girlfriend, Kate the serial killer, and Grinder the lead singer. While I found each character fascinating in their own way, even some of the minor characters, it was Mike’s tale I longed to read the most. This story is dark, twisted and full of “Did that really just happen?” moments.Among the Living is a must read for all fans of horror and zombies! I will definitely be picking up more by this author. I highly recommend this book to folks with thick skin, and not just to avoid becoming infected. There are certain aspects of the story which have the potential to be offensive to more sensitive folks. I’m not one of those people, in case you haven’t noticed. ;)"}, {"userName": "Becky Ippolito", "userReviewDate": "Jul 30, 2012", "userURL": "http://www.goodreads.com/user/show/5861103-becky-ippolito", "userReview": "This book had the potential for more stars, but fell short with some lack of substance and too many characters. The apocalypse unfolds nicely, as word of a \"gas leak\" and a government coverup. Totally believable even if you get a little frustrated with the refusal of many to believe it. The main heroes are explored very well- with the exception of Ginder- who is absolutely useless to the whole plot. Mike, who has suffered his own loss of his young son some year prior, adds a component of loss before the really loss starts. Kate is an interesting character as a serial killer with a somewhat dissociative identity due to abuse as a child. Even Lester, the pothead drug dealer is a character you may root for, who for once in his life, it forced to get up and fight. Even short excepts of characters who are about to become deaders are interesting, but I still wanted more. I wanted to feel the loss of certain characters who were central to the story along the way, and it seemed with their lack of definition they were already dead."}, {"userName": "Ray", "userReviewDate": "Jun 27, 2012", "userURL": "http://www.goodreads.com/user/show/10472011-ray", "userReview": "Imagine a world crammed tight to its undead gills with lifeless souls who would happily feast upon your brains.. actually scrub that - we're already there right?So anyways, Among The Living by Timothy Long is that rarest of gems in the sea of Zombie fiction in that it's excellent.I wont give any spoilers here other than to say Timothy has breathed depth and life into the stars of his novel. I actually cared about the people whose lives were being turned upside down in a world gone insane.So if zombies are your thing give it a go."}, {"userName": "Denise", "userReviewDate": "Aug 01, 2012", "userURL": "http://www.goodreads.com/user/show/11340342-denise", "userReview": "I was not going to read this book. I am glad I did. the characters were vivid. There were a lot of different characters to keep reading interesting - you just have to keep up with who everyone is and where they are.I liked the take on the zombies - actually thinking about them, their families, how others reacted to them. Truthfully - I slept with the light on for a while, and avoided my neighbors. ( I have a overactive imagination, okay)."}, {"userName": "Art Griswold", "userReviewDate": "Feb 15, 2013", "userURL": "http://www.goodreads.com/user/show/14152985-art-griswold", "userReview": "The plot and story that surrounds it is excellent, I just have a tremendously hard time with the present tense style.I kept getting caught up in it and to me it detracted from the story itself.Long is a great zombie author, and he deserves all his good reviews. The tense style is just not for me."}, {"userName": "Claire Riley", "userReviewDate": "Jul 18, 2012", "userURL": "http://www.goodreads.com/user/show/4419930-claire-riley", "userReview": "Fabulous zombie novel with some of the most interesting characters ive read about in a long while. Wrote from the perspective of several different characters from day one of the zombie apocalypse. Can not wait for the next!!"}, {"userName": "Justin", "userReviewDate": "Nov 27, 2016", "userURL": "http://www.goodreads.com/user/show/5632782-justin", "userReview": "What do a depressed newspaper reporter, a death metal vocalist, a hedonistic drug dealer and a female serial killer/samurai have in common? They're about to have a front row seat for the end of the world. These Seattle residents are all going about their lives as usual when a strange new virus outbreak hits, causing painful death, instant reanimation and an insatiable hunger for human flesh and blood to all who come in contact with it. In Timothy Long's Among the Living, we get a somewhat different take on the traditional zombie tale.Zombie 411 - While I don't think the term \"zombie\" was ever uttered in this book, Among the Living is undeniably a zombie novel. The zombies start as the typical Romero-style shamblers but soon become the 28 Days Later-style sprinters.The good - Although I question the amount of character development in this book, especially given the short life spans, I have to say Long did a good job coming up with interesting, (mostly) realistic characters. You get to know an awful lot about the main characters in particular that by the end doesn't seem all that relevant. Perhaps he was aiming for a sequel that would bring their back stories into play? The action sequences were also handled well. They were tense, cinematic, and essentially what kept me turning the pages.The not so good - I know it's pretty standard in these kinds of books, but I had an issue with the first person narration, especially since the \"main\" character really didn't get much more time than the other principals, who were narrated in the third person. It affected the flow of the story. Some of the dialogue was over the top as well. No matter how clever a phrase may be, I need to believe it's something a human being might actually say to another person, and that wasn't always the case here. My other issue is with the way the book ended. I don't want to give away any spoilers, so I'll just say that it stretched believability, even by zombie novel standards.It's clear that Long had a lot of ideas - most of them very interesting - going into this book, and even though they don't always come together perfectly, Among the Living is a solid-enough zombie novel that's not your usual \"lone survivor\" type story. It's definitely worth checking out if you're a fan of the genre, especially if you can grab the kindle version on sale."}, {"userName": "Tracy", "userReviewDate": "Feb 27, 2012", "userURL": "http://www.goodreads.com/user/show/7620827-tracy", "userReview": "It's obvious Long can write but chose not to for much of this. There are major problems with tense (which sometimes changes twice in a single sentence), pronoun usage that makes it confusing who he's referring to, and overuse of tired phrases. That's all stuff that could be fixed with an editing pass, but it wouldn't matter because of the book's bigger problems.Each chapter follows a particular character, and all of the chapters for one of the characters are written in first person, while chapters for the other characters are written in third person. There's no reason for it, and it is jarring while adding nothing. Worse, the voice switches to second person at a few points in a vain attempt to make you feel like you're a zombie. It all smacks of a writer showing off instead of getting out of the way of the story.Even that wouldn't matter if the characters were compelling, but few are (and one has no reason to be included at all). Or if the reaction to the outbreak was remotely plausible, but it isn't. Or if Seattle was described in enough detail that people who don't live there would understand any of the settings, but only the barest of details are provided (sometimes just a name). Long seems to conserve all his descriptive powers for sex scenes and detailed reports about flesh, wounded or otherwise.Combine all that with an absurd ending to set up a sequel, and you end up with a regrettable read. It's sad, because there are sections here that prove Long has the chops to do much better work."}, {"userName": "Dawn Peers", "userReviewDate": "Mar 23, 2014", "userURL": "http://www.goodreads.com/user/show/1967886-dawn-peers", "userReview": "Among the Living is a US-based horror story, set in Seattle. This is a review of the unabridged audio version of the book.I *really* liked this work. Set in first and third person perspectives and showing us the lives of four different protagonists, it gives us a glimpse in to their lives and personalities (mostly) before the outbreak sets in. The characters are very different people, and the building-work for each of them is dealt with effectively by Long. I found myself disliking two of them immensely at the start, then feeling sorry for one, and hating the other even more, whilst wanting to shake one of the good ones on the shoulders going \"DEAR GOD SNAP OUT OF IT!\"So yeah, you might say I got a fair bit out of this book.This is character-driven and turn-based action. My kind of zombie book, the monsters play second fiddle, and are a supporting actor to the way humanity respond to catastrophic events. I felt this was very real in its portrayal of how mankind would actually respond - a panicky cover-up gone bad, delayed realisation followed by that moment where everyone in charge probably realises \"whoops, could have done that better\".The monsters themselves, whilst supporting actors they may be, are described with grisly aplomb. I liked the interlude stories as well, from tertiary characters and how they felt as the virus began to infect them.I'll certainly be hunting more out from Mr Long. An easy 5* read."}, {"userName": "Holden Attradies", "userReviewDate": "Feb 05, 2014", "userURL": "http://www.goodreads.com/user/show/5973016-holden-attradies", "userReview": "A solid zombie novel, but nothing that makes it really stand out in such a large genre other than the location. If you are from or familiar with Seattle and the surrounding area it definitely enhances the quality of this read.I listened to it as an audio book, which seems to be a good thing. Reading some other reviews there was a lot of writing quirks that I didn't notice too much as an audio book. I'm not sure if this is Long's first novel, but it has that feeling of an early book that isn't all that great but where you can see that a few books down the road the author is going to be pretty good.The four narratives were hard to follow at times which detracted from the story early on. Later on in the book as the four narratives drew closer in location and situation there was some definite pay off, and it seems like a strong set up for the sequel which I plan on starting right away. Some of the characters were really hard to like. The metal head and the douche drug dealer were both characters that were believable but so far removed from people I would happily have in my life I found there stories at time painful to read. The stand out character is the complex serial killer turned zombie slayer and I strongly hope she gets far more time in the sequel."}, {"userName": "Hillary Brown", "userReviewDate": "Jan 05, 2015", "userURL": "http://www.goodreads.com/user/show/6041693-hillary-brown", "userReview": "I can understand now why so many people had issues with the reactions and thoughts of the characters. However, I find it so refreshing to have anti-heroes. I think too many books, about post apocalyptic life, are filled with survivors that are morally superior. In reality, we would have a wider variety of survivors, if not a larger number of street-smart, morally ambiguous people. I loved the rawness of Kate and Lester...despite the fact that they are written as the dregs of society.If anything, the more moral the character...the more they seemed to want to deny the events transpiring.I'm not usually a huge fan of 1st person POV, but it really worked here. I have also read reviews that dislike the objectification of women. But, these were true to the inner thoughts of the characters (1st person). I ended up appreciating the honesty of it.This story falls short in some areas, but the characterization makes up for it. There is no substitution for a bad-ass with swords. Period.Anyone who is a fan of the anti-hero, gritty protagonist POV, will probably enjoy these books. (EX: Joe Abercrombie type characters, but don't expect the worldbuilding amazingness) Oh, you should probably dig ZA stuff too..."}, {"userName": "Felts", "userReviewDate": "Dec 19, 2011", "userURL": "http://www.goodreads.com/user/show/1710935-felts", "userReview": "Among the Living is a story that follows four people in Seattle at the beginning of a virus outbreak that turns people into \"deaders\". The four main characters are very different from each other (see book description above for most of their details) and their viewpoints of the outbreak and how they handle the emotional aspects of it are very interesting. The story is told in third person with three of the characters, but changes to first person with Mike for some reason. I'm not sure why this is, and it does take a little to get used to when reading it, but it's not too annoying. The style of writing in the first half of the book reminded me quite a bit of Richard Laymon, which the thirteen year old boy inside of me still loves. There is quite a lot of description of women's anatomy and weird sex scenes, but once the author gets that out of the way it turns into a very intense, and somewhat emotional tale. Looking forward to the second book, Among the Dead, and hope it does well.Side note: I read the Nook book version of this from Barnes and Noble and it was FREE. Even if it wasn't, it would still be worth a purchase."}, {"userName": "Tom", "userReviewDate": "Feb 02, 2013", "userURL": "http://www.goodreads.com/user/show/4690914-tom", "userReview": "This was my first read of Timothy Long's books and it won't be the last. The book only spans a couple of days, but within that time we get to see how a city could be overrun, and meet the individuals trying to live their lives before and during a city wide crisis which begins as a cordon of a part of the city due to a \"gas leak\", turning some people violent. We are introduced to several main characters, the two that most resonated with me were Mike and Kate. Mike, a journalist still suffering from the grief of losing his son, then his wife's fall in to alcoholism, who has a deep crush on his co-worker Erin. Kate, a serial killer who leads a double life as a sweet girl next door to her neighbour Bob. How the cordon of Queen Anne, Seattle, the first place to be hit with \"deader\" attacks effects them is the plot of the book.The events change these characters lives forever, and reveal who they really are. Whether they are good or evil, they all share the common goal to stay among the living."}, {"userName": "Angela Crawford", "userReviewDate": "Apr 29, 2014", "userURL": "http://www.goodreads.com/user/show/30952275-angela-crawford", "userReview": "The dead walk. Now the real battle for Seattle has begun. When a gas leak causes the National Guard to forcibly evacuate the neighborhood, Lester isn't going anywhere. The former dope pusher has a new clientele… the kind that require him to deal lead instead of drugs.  Mike, a newspaper reporter, suspects a conspiracy lies behind the chaos. He’s driven to find the truth, even if it means dragging his beautiful co-worker into danger.  Kate has a dark secret: she’s a budding young serial killer. As society collapses, her skill in dealing death may be the one thing that can keep her alive.  These survivors, along with others, are drawn together in their quest to find not only the truth behind the spreading apocalypse, but also to escape the madness they face at every turn. I loved this book! It grabs your attention from the very first page and keeps it until the end. Fast paced and fabulous! Fans of The Walking Dead or Dexter will love Kate as much as I did.  I would whole heartedly recommend this book! Great read."}, {"userName": "Karl Tybury", "userReviewDate": "Sep 15, 2013", "userURL": "http://www.goodreads.com/user/show/23451888-karl-tybury", "userReview": "I was recommended this book a while back and finally got around to reading it...I LOVED how each chapter is told by a different character .. I love how none of them are linked at all in any way.I actually loved some of the characters.. Disliked a couple, but hey, you can't like everyone...I also really liked the \"interlude\" chapters... They were nice little sections of the doomed.As for the book itself, I found that at the end I wanted more... Which means I liked it... Right? The problem I had was that some chapters were brilliant and then in others nothing seemed to happen. It also seemed to take quite a long time to build up... It wasn't until around 70% that I wanted to read and read and read... But now I know there's a second book maybe it was a good thing that you got to know the characters so much !!I can't wait to find out what the new companions get up to in the future..."}, {"userName": "Jonathan", "userReviewDate": "Jul 18, 2012", "userURL": "http://www.goodreads.com/user/show/3842225-jonathan", "userReview": "Among the living was a good read, and listen. I have the audiobook as well and switched between the ebook and the audiobook a few times. It’s the story of several characters at the start of a zombie apocalypse. I found the story of Kate very interesting, a serial killer who always figured she’d be caught one day but hey guess what? – zombies are here!! LOL! Some of the characters I didn’t really care for (Lester, Grinder and his band, and Angela ) and from the start I was really hoping they would die. I won’t tell you whether I got satisfaction regarding that or not. I think that is the first time I experienced that, unless that’s what the author intended me to feel, not quite sure. I enjoyed the scenes with Mike and Erin, newspaper reporters who finally admit they dig each other and maybe they can be happy and move past some previous life struggles buy hey guess what? - zombies are here!! Overall a solid zombie apocalypse tale which I have no trouble recommending to others!"}, {"userName": "RJ", "userReviewDate": "Apr 20, 2013", "userURL": "http://www.goodreads.com/user/show/4187755-rj", "userReview": "A log book style of different characters in the beginning and during the initial outbreak of the \"deader\" virus. It bounces back and forth between several characters including the mindset of one of the zombies as well. Lester and Andrea are a hoot, while Mike and Erin are a normal couple embarking on a new relationship. Then there's Grinder, the lead singer in a grunge band who is fantasizing on a new career amidst the carnage going on around him. Kate is a sick piece of work. Long's list of characters runs the gamut here. There are others, but these are the ones that hold my attention. There's nothing new to the genre here, but it's interesting enough to stay with it. The city is overrun in this first book. In the second book I assume we'll see if and how we get out of this mess."}, {"userName": "Stephanie Lunsford", "userReviewDate": "Sep 28, 2013", "userURL": "http://www.goodreads.com/user/show/14783992-stephanie-lunsford", "userReview": "I love the character development in thisbook ! You have multiple characters so it is different POVs from different parts of the city all same time frame. The one character you least expect becomes the main focus towards the end off the book & I love it! This book stars in Seattle where a \"gas leak\" occurs but it is really a cover up... I love how Tim not only goes behind the eyes of the characters but also shows POVs from the deaders too. Tim Long expertly mixes in the characters to perfectly lead them to where they are in the end of the book. Though I am really sad to see some characters go it wouldn't be a Zombie novel w/out loss! You must read this series cuz I know you will NOT be sorry! Timothy Long is a genius w/words!!!"}, {"userName": "Wulfwyn ", "userReviewDate": "Dec 22, 2011", "userURL": "http://www.goodreads.com/user/show/2288988-wulfwyn", "userReview": "I enjoyed this zombie book. As it opens with how the virus gets started and then concentrates on its first few days of progress I was a bit surprised. Happily. A lot of the ZBooks I read are already in the panic of the spread or take place once it has been in effect for weeks. Starting at the beginning and staying there made this book refreshing to me. I found this book to be well written and very entertaining. It is a fast read. Lots of action in it with some romance, sex, (some graphic), definitely violence. As stated there is alcohol and weed use. Adult language too.A full review can be found on www.alaskanbookcafe.com"}, {"userName": "Badseedgirl", "userReviewDate": "Feb 18, 2014", "userURL": "http://www.goodreads.com/user/show/20662786-badseedgirl", "userReview": "This novel was ok. It was typical of the lower end of the zombie sub-genre. The scenes of the zombie attacks had the right amount of gore, but I do not care for soft-core porn, and there was to much of this. I think the story line of how a serial killer would do in a zombie apocalypse is a new and refreshing idea. But Mr. Long, you cheapened it by making Kate a sexual sadomasochist with \"Daddy issues\". Why couldn't she just be a killer, why did she have to have the broken little girl back story. Mr. Long, you never would have given a male serial killer this kind of back story. It strikes of misogyny. Shame on you!"}, {"userName": "William", "userReviewDate": "May 15, 2012", "userURL": "http://www.goodreads.com/user/show/6118120-william", "userReview": "This book was full of blood, guts, gore, and zombies. Which was was TOTALLY AWESOME!!!! This is a great novel about a zombie virus outbreak in Seattle WA. It has strong characters which you begin to pull for, from the beginning. Even a drug dealer named Lester, and his girlfriend Angela, become likable & make you hope that they will get away from the deaders and find safety. Each page made you sit on edge with anticipation of a deader coming out of nowhere and biting one of the main characters. I would highly recommend this book for my fellow zombie lovers."}, {"userName": "Steve Wands", "userReviewDate": "Feb 07, 2012", "userURL": "http://www.goodreads.com/user/show/5282827-steve-wands", "userReview": "Among The Living, for me, was slow to start. There's a lot of characters, and each one is developed well. You really get a good feel for who these people are and what drives them. All the while the world is going to hell around them. What initially seemed slow starts to build up speed and before I knew it I was clicking away to the end of the book and wanting more. There is a lot to like here, and if you love zombie books the way I do, then you'll find a lot to love here. I just hope Kate is in the sequel."}, {"userName": "Camille", "userReviewDate": "Sep 10, 2015", "userURL": "http://www.goodreads.com/user/show/249544-camille", "userReview": "Ups and downsI considered giving up on this one. It felt a little slow (true zombie action doesn't start until about 85% in.) The characters were completely whacked. But they were interesting and I was curious to see how it would play out. The author did a really good job of making the characters seem real. They each had a distinct voice. I'm undecided if I will read the next one. I like how this focuses on one city rather than the whole world being wiped out in a week. But I worry that the next one will start out just as slowly. Plus the deaths at the end made me sad."}, {"userName": "Drew", "userReviewDate": "Mar 13, 2015", "userURL": "http://www.goodreads.com/user/show/7983972-drew", "userReview": "‘Among the Living’ takes a bit to get going, but when it does it offers a fun ride as the Zombie apocalypse begins. I’ve always had a little bit of a problem with the zombie apocalypse just happening too fast, which is why this book was so likable. People go about their daily lives knowing something is happening but not sure what until finally the zombie population has really started to grow and is finally noticed for the problem it is. Not for the faint of heart this book takes you into the head of survivor and zombie providing a nice thrill ride."}, {"userName": "Christine Collado-acebal", "userReviewDate": "Jul 24, 2013", "userURL": "http://www.goodreads.com/user/show/5908188-christine-collado-acebal", "userReview": "The story itself had potential, but it seemed like the character development and individual stories were rushed. I, unfortunately, bought the Kindle version which was devoid of editing and had pages or ends of sentences missing. I will read the second book in the series only because it earned better reviews and I would like to see how the rest of the characters/story develops. I hope I am not just being a glutton for punishment...we'll see..."}], "description": "The dead walk. Now the real battle for Seattle has begun. Lester has a new clientele, the kind that requires him to deal lead instead of drugs. Mike suspects a conspiracy lies behind the chaos. Kate has a dark secret: she’s a budding young serial killer. These survivors, along with others, are drawn together in their quest to find the truth behind the spreading apocalypse.", "title": "Among the Living", "url": "https://www.goodreads.com/book/show/6802300-among-the-living", "average": 3.71, "cover": "https://images.gr-assets.com/books/1348275965l/6802300.jpg", "reviews": 62, "authors": [{"url": "https://www.goodreads.com/author/show/3055114.Timothy_W_Long", "name": "Timothy W. Long"}], "type": ["Horror", "Horror", "Science Fiction", "Fiction", "Science Fiction"], "outlinks": ["http://www.goodreads.com/book/show/6802300-among-the-living", "http://www.goodreads.com/book/show/12782084-among-the-living", "http://www.goodreads.com/book/show/8684006-among-the-living", "http://www.goodreads.com/book/show/12829837-among-the-living", "http://www.goodreads.com/book/show/19010574-outbreak", "http://www.goodreads.com/book/show/7839883-the-zombie-wilson-diaries", "http://www.goodreads.com/book/show/21881447-outcasts", "http://www.goodreads.com/book/show/25352789-poisoned-earth", "http://www.goodreads.com/book/show/12284169-beyond-the-barriers", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/26583370-life-and-other-near-death-experiences", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/20552595-how-i-became-a-famous-novelist", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/36004055-not-perfect"]}