{"ratings": 94, "userreviews": [{"userName": "Zoeytron", "userReviewDate": "Aug 30, 2013", "userURL": "http://www.goodreads.com/user/show/12656534-zoeytron", "userReview": "Straightforward writing and plain as life characters make this a good solid read. Growing up in rural Alabama, Amy Lynn Braxton is a very grown-up little girl who has taken up the responsibilities of running the household since her mama died. She has a big heart and is a good worker, she takes care of her little brother, does the farm chores and helps out her grandma with her garden. Amy likes to fish and hunt, and she dotes on Dr. Pepper and moon pies. She is brave and strong and fierce, and she will need all of these qualities to combat the tragedies and atrocities that life has in store for her. The characters are really outstanding. Uncle 'Hatchet' Jack is kind and wise and scarred, literally and figuratively. Aunt Carly Jo is indeed the auntie we would all like to have, as one reviewer noted. Aunt Gloria is a busybody with her dyed black bouffant hairstyle, her weight somewhere North of 250 pounds and her polyester pantsuits that make a swishing sound when she walks. Granny Patches, Amy's daddy, Leon Braxton, Bubba the dog, and others are all made as comfortable and familiar to us as the proverbial old shoe. Love how little brother says 'Heck, yeah!'Life's lessons come at a price, but once learned they will serve well. 'The biggest part of being an adult is doin' the right thing when it's hard.' 'Things you get for free mean nothing to you. Things you work for you keep close and they are hard to throw away.' This was a story well-told and most enjoyable."}, {"userName": "Mike (the Paladin)", "userReviewDate": "Oct 07, 2016", "userURL": "http://www.goodreads.com/user/show/2187043-mike-the-paladin", "userReview": "I didn't place this on any shelf as I find it hard to actually differentiate. I bought the book for my Kindle and was drawn in right away. It opens as an absorbing tale of our young protagonist \"coming of age\" and learning about being a woman from Aunt Carla Jo and how to survive from the men in her life.I don't know, I want to like this book more than I do and I do think that after a period of time I may go back to it and do a reread. The story of her Navy life, the picture of life among the working poor of the Southern Mountains which tried to avoid stereotypes and give a more clear picture are definite positives. For some reason however I found my interest fading in and out.I'd suggest you definitely try this one yourself and see what you think."}, {"userName": "Greyweather", "userReviewDate": "Jul 21, 2013", "userURL": "http://www.goodreads.com/user/show/1154130-greyweather", "userReview": "Holy smokes this book was out-and-out fantastic. The story was by turns charming, moving, engaging, exciting, and intense. The characters, especially the main character and the others who are with us from the beginning of the book, are so well developed you feel like you know these people personally.I really hope the author is writing or planning to write more books because I haven't enjoyed a book this thoroughly in quite some time."}, {"userName": "Kia", "userReviewDate": "Dec 17, 2013", "userURL": "http://www.goodreads.com/user/show/5915975-kia", "userReview": "This is why I read indies! Amy Lynn is rich and vast and witty and wise. It's the tale of a good, strong Alabama girl and the unique, remarkable people in her life who shape her as she grows into a woman.As a girl, Amy Lynn Braxton suffers through some horrible events, any one of which could dispirit a weaker person and twist them into a hopeless, dehumanized wretch. But Amy is big-hearted, smart, and hard-working, and she is blessed with a strong, loving family. When tragedy strikes, she works through it by force of her own will, with the support and advice of her beloved Uncle Jack and Aunt Carla Jo. These two adults each have unique histories of their own and are unlike any characters I've come across in other books. Their wisdom and guidance help turn Amy into a very special young woman.Amy Lynn is not literary fiction; it's good, old-fashioned story tellin'. At different times it felt like a myth, a fantasy, an action adventure, and a legend. I loved reading this book because it was endlessly entertaining and completely unpredictable. It was packed with novel locations and detailed information about a myriad of things. I am from the NYC metro area, while Amy Lynn and her family are from rural Alabama. The culture is very different from what I'm used to and I grew to love it. The Braxtons live an easy-paced life full of love, common sense, faith, and enjoyment of each other, hobbies, and the outdoors. When evil strikes, as it does everywhere, they have very direct ways of dealing with it. Bracing and cathartic.Another noteworthy thing about this book is that not since Wally Lamb wrote \"She's Come Undone\" have I read a male author who could write a female protagonist so well. Jack July somehow recreated the thoughts and feelings of a female teenager, as well as several other female characters I also came to love. I especially appreciated how different these women were from the female characters in every other book I've read and movie I've seen. Yes, they fall and are sometimes even abused, but they are never victims. They are manifestly equal to the men and, though feminine, definitely not weak. I wish I knew women like these.I won't discuss the plot because it's a linear narrative, and anything I mention would be a spoiler. This book is one fascinating event after another. It's nice and long (461 pages) and ends with both a clear conclusion and an open door to further tales. I can't wait to read them!"}, {"userName": "Lori", "userReviewDate": "Dec 31, 2013", "userURL": "http://www.goodreads.com/user/show/6593665-lori", "userReview": "I really loved this story!!!! So much so that I haven't been able to start another book. I'm not really ready to let go of Amy Lynn."}, {"userName": "Nickie", "userReviewDate": "Aug 24, 2013", "userURL": "http://www.goodreads.com/user/show/22859598-nickie", "userReview": "It's been quite some time since a book grabbed my attention as immediately & thoroughly as Amy Lynn did! I lost 2 nights sleep whilst reading this, as I just couldn't put it down, once I got reading!From the very start, the characters will grab your heart, and you feel as if you know them almost as well as family. Amy Lynn is a young 12-year-old child when the story begins, and it is a joy to follow her through her life. Her family members are as likable as she is, and it is clear what influence their non-wavering love & support have, in the strong young woman Amy Lynn grows to be, and her strength & courage in overcoming a horrific incident that could have permanently damaged a lesser teenager.Jack July has the true storyteller's gift of pulling you into his tale & letting you *live* in the story, right along with the characters. You aren't just outside of the story, reading about imaginary people -- you are right there beside them, feeling their joy, sharing their pain, living their lives right along side them. I fell in love with not only Amy herself, all the other characters as well -- Jack & Carla Jo especially - who wouldn't love to have an aunt & uncle like them! I must admit, the very latter portion of the story had a bit more political undertones that I think it should have had. One character in particular, seemed somewhat unbelievable to me, or at least I would hope, that there aren't many people like her in the real world, at least not on \"our side\"! One brief scene involving this character really shocked me (and quite frankly, repulsed me) so badly, that it \"broke the magic spell\" and after that scene, I had a slightly harder time \"living\" in the story again. It's one thing when a \"bad guy\" does something depraved & terrible - that can be difficult enough, but after all, they're the \"bad guy\", so you somewhat expect it of them. Perhaps I'm too idealistic, but I don't expect to see the same level of horrific behavior from someone who's allegedly one of the \"good guys\", and particularly, I wouldn't expect them to *enjoy it* as this character purports to do.But that was just one very brief scene - and just one side character, whom we don't truly get to know until the very last bit of the book. That one very brief scene affected me quite strongly, for some reason that I can't quite fathom - most people will probably just fly right past it without giving it much notice. So IMO, it was just one small \"hiccup\" in an otherwise perfect story! In summary - BUY. THIS. BOOK. !!!! You will not regret it - it's a wonderful story, and I'm looking forward to Jack July's next book! DISCLAIMER: I received a copy of this book for free from the author, in order to read it & give my honest review of it."}, {"userName": "Erin", "userReviewDate": "Aug 22, 2013", "userURL": "http://www.goodreads.com/user/show/21462236-erin", "userReview": "I want to first start off by saying that I won this book on GR.com.This is not normally the type of book that I would read, maybe one that I would pick up and eventually, when I had time, go through a chapter or two. There was no putting this book down for me after the first 3 pages. Very rarely does a book pull me in so far that I fall in love with characters. I have to say that this book was beautifully written and I would read anything that Jack writes.I don't want to spoil this book or the plot for others but this is in my top 5 list of MUST read books. Congratulations to the author on such an amazing job!"}, {"userName": "Jim", "userReviewDate": "May 29, 2016", "userURL": "http://www.goodreads.com/user/show/9941403-jim", "userReview": "Amy Lynn actually does some things that are straight up horrifying. They're necessary. They make sense but they aren't pretty. Then again, given the circumstances it makes sense. Amy has seen some of the worst things that humanity is capable of and always bounced back. On the other hand, those things have left marks on her soul. When she does what she does it's shocking but it feels right. It's in character and it fits her background and situation. It leaves the reader sickened and wanting to celebrate at the same time.In short, this is a complicated character. She's a Navy Corpsman with the Marine training to have earned the spot. She's a stone cold killer when she needs to be but she works with children in a military hospital in Afghanistan saving lives. She refuses to join any of the sports teams at her high school and then finally gives in... and goes to states in her sport. She loves her family and friends... and she does what is necessary to protect them. It's a good thing for her that she has friends too, because she finds herself in trouble from time to time and she needs them to get her out of trouble.This is, however, not one of those books where only the main character is fully realized. Amy's uncle Jack is a great guy and a retired Navy Seal. Her Aunt Carla Joe is a woman with a story that is just as gut wrenching as Amy's, yet she is every inch a southern belle. Amy's father is a hard working guy of the kind that is commonly found in any American community who has just been through a lot. The Braxton family in general is not a family to be messed with but at the end of the day they're not doing anything that many of us wouldn't want to do in the same circumstances. These characters all work together to make this book both enjoyable and rewarding."}, {"userName": "Ian Hunter", "userReviewDate": "Jan 21, 2015", "userURL": "http://www.goodreads.com/user/show/36317404-ian-hunter", "userReview": "4.5 StarsOne very powerful drama about a young girl shackled with burdens (from the age of seven) that would break most adults. Seeing her face the hardest of lives with the stoutest of hearts will make you feel like a wimp for all your complaining about whatever it is you’re going through, but it will also give you courage and hope and the wherewithal to press on as you soak in what she has to teach you. Her journey and her life only gets harder just when you thought that wasn’t possible, just from the opening pages, all the way through to the end of the book. Her life, and her life lessons, is the stuff saints, sages and Zen masters write their sage wisdom about, so you too will be able to be more like her. This is a far more entertaining way to absorb that information (to my thinking.)Despite the informal, at times “unprofessional” storytelling, the lightly sprinkled typos and awkward sentences, this is some of the best character work I’ve ever seen in prose, and one of the most heartwarming stories I’ve read. It’s the opposite of anything coming out of Hollywood with all its “all that glitters is not gold” tiresome remakes of stories that were subpar to begin with. This is what real literature and real storytelling is supposed to be about, but so seldom is, even when undertaken by people who are actually trying, as opposed to intentionally seeking to be derivative."}, {"userName": "Andrew Justilian", "userReviewDate": "Jan 11, 2017", "userURL": "http://www.goodreads.com/user/show/27981187-andrew-justilian", "userReview": "This book was self published by an up and coming author.I did not know if I would like this series of books. but I was told by many people that I would really like them. I gave it a try using a borrowed copy. I thought the book started a little on the slow side. but I was made to promise to keep reading that I would like the book. and they were right. after the story took off i could not put it down. I bought the second book on Kindle so I could keep reading the story line. It is a story about a young lady from the south who had to overcome a great ordeal. and with help from some family and friends she becomes a really different person. A person that you come to love and respect. She is helped a great deal by her Uncle Jack and her aunt.I highly recommend this series of three books with a 4th one on the way."}, {"userName": "April", "userReviewDate": "Mar 06, 2016", "userURL": "http://www.goodreads.com/user/show/8257023-april", "userReview": "I love this book. It took me a couple of chapters to get really interested, but once I did, I couldn’t put it down, and then I immediately tore through the sequels.Amy Lynn is a delightful tomboy who, at 12 years, is subjected to some of the hardest horrors the world has to offer. With the help of her uncle, a special forces veteran, she learns to protect herself and overcome, and embarks on a path to bring justice to some of those who need it most.The character development is excellent, with poignant back stories and satisfying outcomes. It isn’t easy to write a female hero convincingly. Jack July does so with Amy Lynn. She is hard, but unassuming. Her tough vengefulness is tempered with humility. She is an inspiring, exciting heroine, and I want to be her. I highly recommend."}, {"userName": "K.M. Lowe", "userReviewDate": "Dec 23, 2015", "userURL": "http://www.goodreads.com/user/show/30514001-k-m-lowe", "userReview": "I loved this book! I only found this book through a friend but I certainly will be reading book 2 next."}, {"userName": "Carol Weigly", "userReviewDate": "Mar 05, 2017", "userURL": "http://www.goodreads.com/user/show/65648978-carol-weigly", "userReview": "Greatest book ever. Greatest author ever!!!!!!!!!!"}, {"userName": "Amelia", "userReviewDate": "May 17, 2014", "userURL": "http://www.goodreads.com/user/show/25156813-amelia", "userReview": "Amy Lynn is very well written and fascinating. The plots within plots, or rather how the main plot comes back to something in the past at times or to something that happened to another character previously is almost Clancy-esque. The Southern flavor of parts of the book is reminiscent of Fanny Flagg. However, the book and the story defy simple descriptors.As a first novel, it's a home run. Seriously. I was very pleased and riveted (and occasionally shocked) by the story. I sincerely hope Jack July is working on his second novel right now. The use of a female protagonist sets the book apart at the very start. I won't give away any plot details directly. Let it just suffice that the plot is complex and intriguing and the author does a great job of giving his characters plenty of character. As a native Alabamian, I found most of the feel of the parts of the book set in Alabama to be mostly authentic. On the down side, the book needs a bit of editing (typos and a few spots where bits of paragraphs seem to have been moved around accidentally, resulting in confusion which happens only at the beginning of a chapter so perhaps it's related to inputting the initial fancy capital letters at the start of the chapter text, some of which are the wrong cursive letter). As a native Alabamian, I found the use of French merchant names in the nearby big city to be very odd (Where in Alabama does that happen?) and the way high school swimming is described is rather off in the details at times but that will not be noticeable to readers without a background in high school swimming. Without these little errors, this is a five star book, for sure."}, {"userName": "John", "userReviewDate": "Apr 21, 2015", "userURL": "http://www.goodreads.com/user/show/9884325-john", "userReview": "Jack July’s debut novel is a winner. Why? Because he sucks you into the story from the first page, introduces you to characters real enough that within a few chapters you feel like they’re your friends, and then takes you and them on a ten-year ride you won’t soon forget.Amy Lynn Braxton is the country girl next door, and yet she’s like no one you've ever met. In this novel you’ll follow her life from age 12 to adulthood, but it’s not just a typical coming of age tale. Indeed, life throws things at this girl that many would not survive intact either mentally or physically, but she finds a way. Indeed, she SHOWS the way to deal with life’s blows and triumphs, sometimes by making mistakes, and at other times by avoiding them. At over 400 pages I thought it would be slow going, but I devoured the book in three days. So, no spoilers or hints of what happens... just a challenge to start this book and not keep going back to it every chance you get until you see what happens. If you can do that (put it aside and leave it), then you and I don’t enjoy the same pleasures from reading fiction.In my rating system, any stars below three is a marginal book; one I might or might not finish but will likely forget quickly. Three is pretty good, and I think about it for a few days after getting to “The End.” Four stars means I really liked it, and will definitely seek out other works by the author. Five stars means it’s one of the most entertaining books I've read in the last few months. You can bet I’ll be looking for Jack July’s next offering."}, {"userName": "L. Fabry", "userReviewDate": "Feb 17, 2014", "userURL": "http://www.goodreads.com/user/show/26497877-l-fabry", "userReview": "I must admit, I felt trepidation over reading a book named after its main character, but you can’t judge a book by its name. However, combined with the cover of a little girl with an assault rifle, you can judge a book by its cover.As suggested by the above, Amy Lynn is no ordinary girl, yet she somehow transcends into an every girl, in which anyone can relate to at least one of her experiences, but probably not all. During the first third or so, I would make the book mandatory reading for any grade to middle school girl, but the book takes dark turns not necessarily suitable for children.Adults, however, will find that as the subject matter gets deeper, they are more pulled into the story and invested in the future of the Braxton family. Amy herself is part what we all are, and part what we all wish we could be.Unlike other stories that paint small town Southerners to their respective extremes of inbred hicks OR most humble, polite people in the world, “Amy Lynn” features the best and worst of both, and remembers above all else, that Southerners are people first, not clichés.The last third of the book truly picks up the pace, and I found myself neglecting other things in order to finish, so don’t despair if you’re not hooked right away, you will be! Is a second part in the works?"}, {"userName": "Jack", "userReviewDate": "Apr 09, 2014", "userURL": "http://www.goodreads.com/user/show/22540604-jack", "userReview": "When I wrote this I had no idea anyone would read it much less like it. 78 out of 92 reviews on Amazon are 5 stars. Apparently someone likes it. I didn't write to get rich, I wrote to get well. Many parts of it are very personal although names, dates and places have been changed. I have never tried to acquire an agent or publisher, it is self published through createspace. Those \"professionals\" that have read it, like it but can't classify it because it has no genre. It obviously is that original. Makes sense because I have never had a writing class in my life. I'm currently enrolling in school to learn to drive a semi. However, I can tell a story. Stories like the ones that are told by uncles and grandparents that keep kids and family members spellbound on the front porch as evening transcends into night. You may see a lightning bug in your periphery or feel a skeeter settle on your neck as it enjoys an evening snack. So if you want to take a stroll outside the literary \"box,\" this ones for you, respectfullyJack July."}, {"userName": "Roy Griffis", "userReviewDate": "Aug 05, 2015", "userURL": "http://www.goodreads.com/user/show/10959233-roy-griffis", "userReview": "It's a powerful story, simply told. I enjoyed this novel very much. It's an engaging coming-of-age tale that feels honest in an emotional and a factual sense. Once I started it, I really didn't want to put it down. Mr. July's a hell of a story-teller, and the world he shared was a place I wanted to spend more time in.\"A powerful story, simply told\" is high praise from me. As a reader, I'm much more interested in characters and what happens to them than I am by the artifice of literary language used to describe them. As a writer, I have long wished to write something moving and as uncluttered as the song \"The Streets of Philadelphia\" by Bruce Springsteen. \"Amy Lynn\" is that kind of book, with that kind of unforced, unadorned emotional impact.It's that good."}, {"userName": "Lee", "userReviewDate": "Mar 17, 2015", "userURL": "http://www.goodreads.com/user/show/22112126-lee", "userReview": "I read this, intrigued by the reviews. So many five stars. I read this to understand more about southern 'redneck' culture and the mindset of small town, southern, US mentality. The author degrades his writing ability, yet he writes well. Engaging and engrossing. I found it very easy to read, descriptive and well delivered.My view on southern US mentality was only enforced by the tale, and more so by the large number of positive (patriotic) reviews attributed to a book and story well told, but perhaps not so amazing to garner such praise.I suspect southern 'rednecks' are proud of their country... Proud to be southern born... God appointed to deal out justice as they see right and fit.The book therefore for a non US southern citizen was disturbing in so many ways."}, {"userName": "Carol Weigly", "userReviewDate": "Apr 04, 2015", "userURL": "http://www.goodreads.com/user/show/41856201-carol-weigly", "userReview": "I liked this book very much. When the author tells you about the characters you know them. Those who read politics into this book aren't reading it for the pure pleasure of the story. This is a about a young girl growing up as the woman of the house without her mother and with other loss and tragedy in her life. It's about the love of family and extended family that holds them all together. It has been said that \"what is legal isn't always right and what is right isn't always legal\" and that holds true for some of the story line. It holds you from the time you start reading and is hard to put down. I truly believe that this would make a great movie. (R rated) SO PICK IT UP AND ENJOY."}, {"userName": "Tony Hisgett", "userReviewDate": "Aug 04, 2015", "userURL": "http://www.goodreads.com/user/show/10637613-tony-hisgett", "userReview": "This was an impulse buy after noticing a recommendation for the book on Amazon. I read a few good reviews and decided the book wasn’t too expensive so I gave it try, I am so pleased I did. This is the best story I have read this year.Some aspects of the book are a bit irritating, mainly the overblown partisanship, but this doesn’t detract from Amy’s story, which starts with her as a sweet 12 year old and followers her trials until she turns into a sort of feminine ‘Jack Reacher”The best recommendation I can make is that from the moment I downloaded the book I didn’t put it down until I finished, then I went straight to Amazon and downloaded the next book ‘Golden Angel’"}, {"userName": "Don", "userReviewDate": "Jan 31, 2014", "userURL": "http://www.goodreads.com/user/show/26278722-don", "userReview": "I enjoyed this book immensely, and that is saying a lot because it isn't the style of book I usually read. I'm more of a science fiction/fantasy/ escapist literature kind of guy. That being said, Amy Lynn, the title character is a deeply engaging girl who becomes an admirable young woman. She is deeply imbued with tradition American and Christian value by her tight-knit Southern family. She endures many hardships, some horrific, but emerges a stronger better person every time. After you read this story, you will wish she could be your child."}, {"userName": "Anastasia Atelier", "userReviewDate": "Jul 28, 2015", "userURL": "http://www.goodreads.com/user/show/45477819-anastasia-atelier", "userReview": "Watching this novel grow from when it was a glimmer in Jack's eyes has been a treat. There have been rough patches just like in Amy's life. But like Amy, those obstacles have been overcome.Now Amy seems destined for nothing except staying in the back woods until her aunt helps her realize what her potential really is. After that awakening, good gosh Amy is like a comet changing lives as she zooms by. One life most changed of course is her own. Engaging, compelling, tragic; all of that is here plus a lot more."}, {"userName": "David", "userReviewDate": "May 17, 2015", "userURL": "http://www.goodreads.com/user/show/8150118-david", "userReview": "Coming-of-age story of a young girl in the South. Bad things happen in her life that force her to grow up quickly and become strong. There are bad guys in the story but they usually meet a pretty ugly end. A really terrific story with great characters, couldn't put it down. There are two sequels I'll have to check out."}, {"userName": "cool breeze", "userReviewDate": "Oct 12, 2015", "userURL": "http://www.goodreads.com/user/show/27470888-cool-breeze", "userReview": "This is a remarkable gem in the rough, an amazing debut novel. It starts out as a coming-of-age story steeped in the rural South and then unfolds gracefully into a first-class action packed thriller. The character writing is outstanding and there are many memorable characters."}, {"userName": "Hannah Rae", "userReviewDate": "May 14, 2014", "userURL": "http://www.goodreads.com/user/show/31166073-hannah-rae", "userReview": "The writing was amazing and really kept your attention and the characters were fantastic."}, {"userName": "Tim Plett", "userReviewDate": "Oct 09, 2013", "userURL": "http://www.goodreads.com/user/show/12353996-tim-plett", "userReview": "I don't read a lot of fiction but this book held my attention throughout."}, {"userName": "Brian Neville", "userReviewDate": "Sep 20, 2014", "userURL": "http://www.goodreads.com/user/show/18033598-brian-neville", "userReview": "Disturbing in many ways."}, {"userName": "Blake W.", "userReviewDate": "May 28, 2018", "userURL": "http://www.goodreads.com/user/show/77304450-blake-w", "userReview": "Very well done first book in a series. Characters are introduced and fleshed out in an engaging and interesting manner."}, {"userName": "Declan", "userReviewDate": "Dec 22, 2014", "userURL": "http://www.goodreads.com/user/show/5934619-declan", "userReview": "A lot of Amy Lynn feels like a coming of age story, where we watch Amy Lynn go from 12 to 20 over the course of the novel. Along the way, almost every other character is fleshed out with their own backstories, usually with snippets and inserts that look like they were lifted out of newspaper clippings — though they don’t interrupt the narrative flow.When the book opens, Amy is practically running the family farm single-handedly — running both the kitchen and chores on the farm. Yes, she’s very much 12 going on 40. Before the book even opens, she has already lost both her older bother and her mother. Usually, this would make set the tone for a depressing, maudlin journey that I’d rather have root canal than read. However, Amy Lynn manages to avoid ever falling into that trap, and dodges the usual cliches. That the book avoids a depression-inducing tone is a cute trick, considering that it covers rape, prostitution, sex slavery, drug use, and two counts of mass murder. Not bad for a coming of age novel, huh? It helps that a lot of this is off-screen, and never delved into with any of the gruesome details.But, then again, anyone who can write a coming of age novel that I can read without making me desire to take a power tool to my brain already has my support.In almost any other context, Amy might come off as a bit of a Mary Sue — almost totally perfect in every way. Thankfully, she’s not that perfect (after all, she is a teenager for most of the book). As for the rest of her skill sets, she has a perfectly good reason for it. For anyone who ever saw the original tv show The Avengers (with no relation to Marvel comics), imagine Amy Lynn as the creation of a Southern Emma Peel. Amy is essentially trained by Rambo, and the fight scenes are reminiscent of Lee Child’s Jack Reacher novels.Amy Lynn has one problem. Well, it has two. The first problem is editing. I know that Jack July had Amy Lynn edited by professionals. I would ask for a partial refund, since there are a lot of strange punctuation errors and capitalization issues here and there. I’ll blame that on the professionals. The second problem? It’s too short.At the end of the day, Amy Lynn is as promised: thoroughly charming. It’s very much To Kill a Mockingbird for a modern audience.It's definitely a book for anyone who enjoys characters with deep and abiding faith. It's a book recommended for adults ... and for adults to read before giving it to their kids. Like with much YA fiction, there is dark content and R-rated language. It's a great book, but it depends on the audience"}], "description": "More an origin story than a traditional novel, Jack July's Amy Lynn follows the coming-of-age of a charming little Southern girl. Raised in a family of bootleggers and scoundrels, the motherless Amy is adopted by her Aunt Carla Jo, who teaches her everything about being a woman. A triumvirate of male Southern characters teach her other lessons: how to survive, how to live off the land, and how to be a winner. By the time Amy enlists in the United States Navy, she is the sort of heroic figure who commands respect - and over the course of her service in Afghanistan as a corpsmen attached to a Marine unit, she surprises everyone with her strength, skills, and heart.", "title": "Amy Lynn\n      \n          (Amy Lynn #1)", "url": "http://www.goodreads.com/book/show/18298233-amy-lynn", "average": 4.5, "cover": "https://images.gr-assets.com/books/1445940829l/18298233.jpg", "reviews": 35, "authors": [{"url": "https://www.goodreads.com/author/show/6923394.Jack_July", "name": "Jack July"}], "type": ["Fiction", "Thriller"], "outlinks": ["http://www.goodreads.com/book/show/18298233-amy-lynn", "http://www.goodreads.com/book/show/18283937-amy-lynn", "http://www.goodreads.com/book/show/17335914-amy-lynn", "http://www.goodreads.com/book/show/25329572-golden-angel", "http://www.goodreads.com/book/show/27074607-the-lady-of-castle-dunn", "http://www.goodreads.com/book/show/34677303-into-the-fire", "http://www.goodreads.com/book/show/39461365-amy-lynn-hatchet", "http://www.goodreads.com/book/show/40205863-amy-lynn-hatchet"]}