{"ratings": 84174, "userreviews": [{"userName": "Nataliya", "userReviewDate": "Jan 15, 2012", "userURL": "http://www.goodreads.com/user/show/3672777-nataliya", "userReview": "[and ultimately sacrifices his life (hide spoiler)]"}, {"userName": "Liz", "userReviewDate": "Jul 03, 2007", "userURL": "http://www.goodreads.com/user/show/119592-liz", "userReview": "I've become rather bitter with sci-fi over the years, as it used to be my favorite genre. But you can only read so many space operas and pretentious near futures before it gets to you a little.And then you decide to give an author a go because of some weird research string you were on... and it rekindles your love of why you started reading it in the first place. LeGuin approaches sci-fi as it should be; a thought experiment. Instead of spending pages upon pages describing the minutiae of every aspect of the future, she integrates snippets of mythology, politics, and does it in a way that you don't feel is droning on. There are parts that aren't very action oriented at all, and yet, they don't drag. I have no idea how she does it and am now rather enamored with this author.As for the book itself, it approaches more than the simple issue of gender; it's almost zen-like, with an exploration of a duality in a whole. And the main character was the type a cranky sap like me could really relate to. Best book I've read in a long while."}, {"userName": "Lyn", "userReviewDate": "Nov 27, 2012", "userURL": "http://www.goodreads.com/user/show/5253785-lyn", "userReview": "The Left Hand of Darkness by Ursula K. Le Guin has a voyeuristic quality, as if a description to a studious observation. I could not help thinking that I was reading a National Geographic article about a reporter visiting Winter, or Gethen as its inhabitants know it. Many readers cannot help but comment upon the Gethenians physiological androgyny, and this is certainly a central them of the story, but there is so much more to fascinate the reader. Le Guin has demonstrated again how she can create a science fiction fantasy novel that is both entertaining and enlightening, using the fantasy as a vehicle to explore social and psychological themes, and to state observations about our culture as metaphor. Ray Bradbury noted that to distinguish between science fiction and fantasy, fantasy is the larger genre, a mere impressionistic lens through which we can better view our world. Likewise, Philip K. Dick (Le Guin’s high school mate, though they were not then known to each other) uses his abstractions, not as a Kafka-esque absurdist portrait, but rather as shifting hyperbole to better highlight and caricaturize the real world. In this sense, Le Guin uses TLHOD to speak to us just under the surface about a great many subjects: sexuality, social mores, violence, politics, psychology, religion, and anthropology. The final scenes where the two journey across a vast wasteland of ice took this experience for the reader to another level. This is an excellent book."}, {"userName": "Cecily", "userReviewDate": "Apr 21, 2013", "userURL": "http://www.goodreads.com/user/show/1199525-cecily", "userReview": "The meagre 2* is more a reflection of my enjoyment rather than an objective measure of the book (it has won prestigious awards). It wasn't to my taste, and that was exacerbated by mismatched expectations. It is not really sci-fi, the gender and sexuality were a bit of a side-show, leaving curious combo of political intrigue and Boys' Own tale of derring-do in an inhospitable climate. The setting is another planet in the future, but right from the start, mentions of rain and reign contributed to the non-sci-fi feel.There were some some fascinating ideas, but I felt they weren't really developed. Also, the multiple names of many people and places made it a little less reader-friendly than it might have been.PLOTGenly Ai is a single human envoy sent to very cold planet (Gethen, aka Winter) to see if the humanoids there want to join the inter-planetary alliance, the Ekumen (etymologically related to \"ecumenical\"). He isn't first contact, but he is the first overt contact. The idea of him being alone is that \"One voice speaking the truth is a greater force than fleets of armies\", and also that although the planet might change him, he won't be able to change it.The planet does not have a single government, and Ai inevitably becomes enmeshed in power struggles between different realms. He starts off in Karhide, and compares subsequent events and encounters in Orgoreyn with those in Karhide. The other main character is Estraven, a senior courtier in Karhide, who is the second narrator.SEXThis is the book's USP: not people leaping in and out of bed with each other, but the fact that the Genthenians are ambisexual: most of the time they are both/neither sex (hermaphrodite neuters, or more positively, potentials or integrals), and when they go into kemmer (like being on heat), they can be either.It's easy and convenient to pigeon-hole people based on sex, and Ai understandably struggles with that framework not applying. One manifestation is linguistic: he admits defeat and mostly uses male pronouns (in part because he often meets people in male-associated roles, such as King), but it makes it hard for the reader to view the characters as anything other than male. Feminine qualities are rarely mentioned, but when they are, it is invariably pejorative, which feels strange coming from a female author. For example, \"effeminate deviousness\", \"sullen as an old she-otter\", someone's behaviour was \"womanly, all charm and tact and lack of substance, specious and adroit\". Furthermore, an earlier female investigator from Terra comments, \"A man wants his virility regarded, a woman wants her femininity appreciated... On Winter... one is respected and judged only as a human being. It is an appalling experience.\"For Ai, awkwardness extends to distaste: \"It was impossible to think of him as a woman... and yet whenever I thought of him as a man I felt a sense of falseness, of imposture.\" Much later, there is grudging acceptance: \"I saw... what I had always been afraid to see, and had pretended not to see in him\".Gethenian sexual behaviour and taboos are necessarily different from those typical on Earth, though this includes very relaxed (though still regulated) traditions regarding incest. DUALISMIn some ways, Winter is a very samey planet with one season and one/no gender (being fixed in one of two sexes is considered a peversion, though is tolerated). Does that make Gethenians more or less complete than Terrans? The title of the book is said to come from a Handdara poem, and after hearing it, Ai says to Estraven \"You're isolated and undivided. Perhaps you are obsessed with wholeness as we are with dualism\". The phrase is also likened to the duality of yin and yang.WARThere are feuds and rivalries on the planet, but no war, and no word for it. This is curious, but not really explained, other than that in Karhide hospitality, \"The stranger... is a guest. Your enemy is your neighbour\", along with another dig at women: they don't have war because \"They lacked... the capacity to mobilize. They behaved like animals in that respect, or women\"!They may not have a word for war, but they do have 62 words for snow, so The Great Eskimo Vocabulary Hoax continues... ;)TRUTHThe book opens with the narrator brazenly stating that \"Truth is a matter of imagination\", facts are not fixed, so the reader \"can choose the facts they like best\". However, although the book is mostly told in the first person, by either Ai or Estraven, there appears to be little contradiction in their accounts, so the point is wasted.Ai's people have developed mindspeech (telepathy), which clearly limits the scope for privacy and lying, but apart from one scene, this is another lost opportunity.RELIGIONThe first-person narratives are occasionally interspersed with snippets of Gethenian folklore. Two religions are mentioned: Handdara, which is \"a religion without institutions\" and which involves meditation, trance-like superstrength (dothe) and foretelling. The other is more monotheistic, and mentioned rather less. The predominant religions and consequent (or caused) different cultures in the two countries may be a factor in their political differences. ALIEN WORLDA short appendix explains quirks of the Gethenian calendar compared with Earth's, but the only interesting aspect is mentioned on page one of the story: it is always year 1; all other years are counted relative to now, which is potentially confusing (though not in practice). Another curious idea (even more so nowadays) is that \"Karhiders don't read much... and prefer their news and literature heard not seen; books and televising devices are less common than radios, and newspapers don't exist\"!Gethenians are adapted to the cold climate biologically (enduring low temperatures) and socially, in that they live somewhat communally. Their technological development has been steady, but slower than that on Earth. They have no flying vehicles, and it's suggested that, lacking any flying creatures on the planet (not even insects?), the possibility never occurred to them.Karhiders also have an important system of protocol/face/etiquette, called shifgrethor, which is mentioned often, but somewhat opaque (which is fair enough, as it puts the reader in a similar state of disquiet as Ai is in).CHARACTER DEVELOPMENTThere isn't much (it's primarily plot-driven), but some characters do change their opinions of others as events unfold. Although the King is often described as mad, he didn't seem particularly so. 42I was reminded of Douglas Adams' \"Hitchhiker's Guide\", which is possibly an homage, whether conscious or otherwise. Here, there is a discussion of what sort of question one could or should ask Foretellers, including the danger of asking \"What is the meaning of life?\" In fact, they perfected foretelling \"to exhibit the perfect uselessness of knowing the answer to the wrong question\".A FEW QUOTES* A powerful person \"cannot make an empty gesture or say a word that is not listened to. He knows it,and the knowledge gives him more reality than most people own: a solidness of being, a substantiality, a human grandeur.\"* A grand palace is \"the product of centuries of paranoia on a grand scale\".* Patriotism is \"fear of the other. And its expressions are political not poetical\".* \"my landlady, a voluble man\"* \"The coldness of it was perpetually incredible. Every morning I had to believe it all over again.\" (Shades of believing \"six impossible things before breakfast\" in Alice in Wonderland.)The blurb from the GR description says in the final paragraph that this is \"science fiction for the thinking reader\", so I guess failing to like it must be a fault in me as a reader, rather than Le Guin as the author!Also, David Mitchell cites it as one of the two finest science fiction novels (along with another le Guin, The Disposessed) at 10:30 in this interview: https://www.youtube.com/watch?v=lxq-F..."}, {"userName": "Samadrita", "userReviewDate": "Jun 24, 2013", "userURL": "http://www.goodreads.com/user/show/13266158-samadrita", "userReview": "They should do away with these tags - science fiction, speculative fiction and all them other clever maneuvers designed to erect barriers between the strictly literary and the mainstream - when it's Atwood who is writing or a Le Guin. Woe betide anyone who begs to differ. This deeply entrenched contempt of the other and this instinctive loathing of anything we fail to understand after a perfunctory once-over are not only the center of the man-made hullabaloo of gender but the root cause of all friction in this very reality of ours. A few years ago my cab had once been caught up in traffic at a crossing when I was taken unawares by somebody knocking on my window. I was startled at the discovery of the unexpected apparition who was the cause and source of this interruption - a sari-clad transgendered individual asking me for loose change. I must have flinched visibly because I recall the hopeful expression on his-her (see how our pronouns, too, betray the third sex?) face being gradually replaced by a look of mild mortification and apology. Apology for causing momentary distress to a young college-bound girl because apology is something owed only to the privileged and the ones born with society-approved sexual organs. Unable to successfully communicate, thus, he-she drifted away to another car window while I kept staring at his-her receding back, embarrassed at the sudden loss of my powers of speech. Fragments of this memory have risen to the surface of my consciousness time and again since then. But not until Le Guin familiarized me with Ekumen envoy Genly Ai and Gethenian citizen, ambisexual Estraven's mutual suspicion of each other was I able to pinpoint the cause of my visceral dread in that cab years ago. Like Genly and Estraven, I have been unknowingly initiated into the cult of fearing the unfamiliar. \n\"No, I don't mean love, when I say patriotism. I mean fear. The fear of the other. And its expressions are political, not poetical: hate, rivalry, aggression. It grows in us, that fear. It grows in us year by year.\"\nI am the product of a patriarchal societal order which is only starting to awaken to the far-reaching implications of 'misogyny' and the sociocultural fallout of holding heteronormative gender roles in higher regard than humanity. 'Homophobia' is a term which is yet to acquire a firm foothold even in the imaginations of the Indian intelligentsia since both our judiciary and the executive have proselytized on the unnaturalness of loving whomever we want to. Maybe in a couple of decades we'll rectify this foolishness too. But what about the members of the third sex, those hapless outcasts even our gender-biased language fails to address?Our government believes that making it conventional for transgenders to extort money from parents of newborns at hospitals could pass for employment opportunities.* These young parents feel righteously terrorized by their appearance and breathe a sigh of relief after they have finished with their loud performances celebrating the birth of a healthy child and left with their 'payments'. What seems less surreal? The daily enactment of this aforementioned ritual and the rationale (or lack thereof) behind it or Le Guin's ambisexual Gethenians who keep alternating between two genders?Again, you and I will choose what we know of and discard what we don't.\n\"And I saw then again, and for good, what I had always been afraid to see, and had pretended not to see in him: that he was a woman as well as a man. Any need to explain the sources of that fear vanished with the fear; what I was left with was, at last, acceptance of him as he was.\"\nSeveral realities clash violently every moment in this perplexing drama of life; which of them get to be bestowed with the stamp of normality and which of them get dismissed as aberrations depends on the will of the majority and what they identify with. And I can't imagine what could have been a more effective way of shedding light on this farce other than plotting this narrative the way Le Guin did - the meeting and eventual synthesis of two cultures, each fashioning its existence around contradictory value judgement systems.\n\"And I wondered, not for the first time, what patriotism is, what the love of country truly consists of, how that yearning loyalty that had shaken my friend's voice arises: and how so real a love can become, too often, so foolish and vile a bigotry.\"\nI thank that anonymous person years ago, whose humanity we have whittled down to the distinctness of his-her gender, for causing me to take notice of injustices I help perpetuate every moment with my ignorance and indifference. And I have Le Guin to thank for helping me realize that the apologetic look should have been on my face that day instead of his-her, that I can either hide behind these inherited labels of race, religion, gender and nationality or I can aspire to the ambition of becoming a citizen of the world and, in turn, the Cosmos. As ever the choice lies with me. With us.___*Only recently (April, 2014) has the Supreme Court of India stirred awake and given legal recognition to the 'third gender' who had so far been deprived of their fundamental rights as citizens."}, {"userName": "Ian \"Marvin\" Graystik", "userReviewDate": "Apr 05, 2013", "userURL": "http://www.goodreads.com/user/show/5022264-ian-marvin-graystik", "userReview": "[During the course of a 26-day sexual cycle, their sexuality changes: for around 21 days, they are \"somer\", sexuality is latent and inactive; for the balance, they enter \"kemmer\", during which they remain androgynous for all but a few days, when they acquire both sexual capacity and drive. Nobody knows whether they will acquire the sexuality of a male or a female. They could be either, month by month. A human could be both the mother of one child and the father of another.Because sexual activity is confined to a limited period, the bulk of their life is sexually indeterminate and inactive. (hide spoiler)]"}, {"userName": "Lizzy", "userReviewDate": "Nov 14, 2016", "userURL": "http://www.goodreads.com/user/show/30575403-lizzy", "userReview": "“The only thing that makes life possible is permanent, intolerable uncertainty: not knowing what comes next.\nIs Ursula K. Le Guin’s The Left Hand of Darkness only a science fiction story? Far from it, and that is why I enjoyed it so much. Oh, I like reading science-fiction, sometimes just for the entertainment of it. But this goes much beyond that. Different from some reviews, for me it did not seem a feminist advocacy. I would venture and say it is an anti-prejudice assertion. It is just a brilliant, endearing novel about people, relationships, and desires; that leads to insight and questionings on plenty of topics. While we are reading Le Guin's novel, we wonder about the impact of gender on human cultures and dualism versus unity. Even more, the difficulty of being isolated in a foreign land, and how people can survive and interact in such harsh climates. Le Guin discusses sentiments so close to us, such as fear, deception, and misunderstanding; patriotism and power struggles; and last, but not less important, facts versus truth.\nNo, I don't mean love, when I say patriotism. I mean fear. The fear of the other. And its expressions are political, not poetical: hate, rivalry, aggression. It grows in us, that fear. It grows in us year by year.\nLe Guin’s narrator is Ekumen’s envoy Genly Ai, a young man from Earth, that is in Gethern, on Winter, to bring the planet to his multi-world federation. The most striking characteristics of Winter is that the whole population are hermaphrodites. And only when in kemmer are either one or the other sex and feel desire. So, the peculiarity is that Genly is always male among people who are each in themselves neither and both female and male.\nLight is the left hand of darkness and darkness the right hand of light. Two are one, life and death, lying together like lovers in kemmer, like hands joined together, like the end and the way.\nBut at the beginning, Genly is too different and alien for that. He might repulse some of the local population, but there is no closer relationship until later. And enters the main Gethenian character, Estraven, Karhide’s Prime Minister. He is labeled a traitor and has to flee to the entirely different culture of Orgoreyn, where behind every man is the inspector.Genly and Estraven’s relationship grows from mutual suspicion to a deep friendship, and I found captivating to be along with them as their bond evolves. Much happens, but I loved to read about how Estraven and Genly escape through the freezing environment of icy mountains as they flee Orgoreyn on foot.\nAnd I saw then again, and for good, what I had always been afraid to see, and had pretended not to see in him: that he was a woman as well as a man. Any need to explain the sources of that fear vanished with the fear; what I was left with was, at last, acceptance of him as he was.\nDifferences usually lead to prejudiced, but we are free to act on it or to accept and understand. Le Guin’s creativity and originality coupled with its significance make The Left Hand of Darkness great literature and should not be missed. Highly recommended.“It is good to have an end to journey toward; but it is the journey that matters, in the end.”___"}, {"userName": "Agnieszka", "userReviewDate": "Aug 30, 2014", "userURL": "http://www.goodreads.com/user/show/2446508-agnieszka", "userReview": "They say that  The Left Hand of Darkness  is a landmark in the field of science fiction literature. Albeit such typecasting seems to be unfair simplification and trivialization since that novel goes much further and deeper than any other of that genre. In view of her interests including cultures, ecology, anthropology, Zen philosophy LeGuin writes  humanistic  science fiction, focused on creating unusual social models and analyzing living in them people. That way  The Left Hand of Darkness  can be read as a cross between a philosophical parable and anthropological and sociological report, only wrapped up in sf costume.Main protagonist and narrator ( in fact there are two narrators ), like a galaxy Marco Polo, arrives at the planet Gethen also called Winter. Genly Ai, it’s his name, is an envoy of Ecumen, semi-political, semi-economical organization gathering on a voluntary basis other planets inhabited by humans and which name clearly connotes ecumenism . He arrives with a mission to the planet Winter, to a country where there are sixty two terms for lying snow, and much more for falling one and ice. To the country ruled by a mad king adhering to specific code of conduct and driven by fear of the new and unknown. Finally, to the country inhabited by androgynous residents what becomes pretext to interesting discussion. What really defines us ? Race, nationality, common history and cultural heritage ? Or maybe gender ? How to find common ground between such different worlds ? Is society in which every parent can be a mother better or worse ? End to patriarchy and matriarchy, end to discrimination, violence or abuse ? This is a story about loneliness and need for closeness as well. Can you imagine bigger loneliness than two people from different worlds, in a tiny tent in the middle of an ice desert ? So close yet so distant ? But it is also a timeless tale about friendship, about overcoming initial prejudices and distrusts and attempts to understanding and acceptance of the Other. In any context, cultural, sociological, ideological, at the level of faith and knowledge, feelings and views. On getting rid of fear, contemptuous disregard and acceptance of the Other as someone autonomous yet complementary. Like light and shadow. It is yin and yang. Light is the left hand of darkness... how did it go ? Light, dark. Fear, courage. Cold, warmth. Female, male. It is yourself, Therem. Both and one. A shadow on snow  .And how significant, how universal in its simplicity is Genly’s observation when, after several weeks of murderous march through the Ice, saw another man,  a young, serious face, not a man's face and not a woman's, a human face . It is hard to find more humanistic message."}, {"userName": "J.G. Keely", "userReviewDate": "Aug 17, 2011", "userURL": "http://www.goodreads.com/user/show/84023-j-g-keely", "userReview": "The term 'Speculative Fiction' was developed out of a desire by some authors to separate themselves from the more pejorative aspects of the Sci Fi genre. Harlan Ellison famously hated the term 'sci fi', scorning the implication that his stories had anything in common with Flash Gordon or Lost in Space.In Speculative Fiction, technology is not there to facilitate the plot, or to dazzle readers with fantasy, but to provide the author with an opportunity to explore the human mind in unexpected, innovative ways. The heart of the genre is an introspective exploration of the nature of reality.Much of sci fi acts metaphorically: elements in the world act as symbols for things we recognize: the conflict between the human government and alien settlers represents the immigration issue, the planet-destroying laser shows how we feel about nuclear weapons, the super computer controls and organizes people like a cult.Speculative fiction also acts symbolically, but it is not allegorical--there is not a one-to-one relationship between the symbols of fiction and the reality we know. Instead, the authors use thematic symbols whose meanings can change, drawing us in with an odd familiarity, a \npresque vu\n, and then dropping away, leaving us with that most fundamental of human motivations: the need for a closure we cannot seem to find.It is the evocation of this need to discover--to know--ourselves, and thus, our world, which drives the speculative; and this is what LeGuin gives us: a thoughtful, introspective tale--a tale almost obsessively isolated, narrated from deep within the characters. We always feel their presence, we hear their observations and weigh them, and there is necessarily a constant separation between the reader and the voice on the page, a gap which exists in every story, but which we often forget is there.The trope of the 'unreliable narrator' is a fraught trap for authors, and I recall in Gene Wolfe's 'New Sun' it became a morass where reader, narrator, and author all intermingled--and the voice was lost. In order for the method to be effective, it must be clear to the reader where the narrator falters, and where he is likely to falter. It need not be deliberately misleading, and indeed it shouldn't be: characters who feel most confident talking about themselves usually end up giving themselves away guilelessly. I admit that I am uncertain how much of the narrator's philosophizing was LeGuin's, and I won't be until I have read more of her work, but even if the assumptions are hers, she managed to capably keep them separate from her world.Alienated, even.But that is her constant theme, and her story is stark: events are harsh and uncertain, and so the narrative is always driven back into the mind, into rumination, into patterns and cycles which consider the same ideas from many sides without simply repeating the same conflicts over and over.Yet the work is not remote or brooding--it has action, it has a plot, and it has emotional character interactions. The story always moves, and it shifts, giving the occasional outside view of another character, or some piece of alien myth, which were particularly unusual and well-constructed. It is not a heavy, weary tome, but it is certainly thoughtful, and we do not get lost in the story, because we are actively interested in it, and in its outcomes, because they are made personally important.The book held some disappointments for me--chiefly, I wished that the contemplations had delved a bit deeper, had been a bit more shocking, a bit more insightful, as the myths often were; but the narrator was stolid, in his way. I sometimes became annoyed at how thick-headed he was, how he failed to find solutions, but I sympathized in the fact that the solutions he sought were never easy to find, and that the central theme of the book was that it didn't matter if we found answers, because we so rarely ask the right questions, anyways.The pseudo-scientific elements often felt superfluous, especially in such a character-driven story. The implications of technology and telepathy are only as interesting as their impact on society and thought. She would sometimes bring in such notions, but they were always abortive, and added little to the story. They did provide a bit of wonder, but LeGuin was too ready to analyze them, to structure them, which made them quotidian without enmeshing them meaningfully into the world she had built.Also central was the exploration of gender, which was truly alien and speculative, but felt somewhat plodding and small. It feel true to the character, which I appreciate, but I would not have minded him breaking out of his shell, now and then, to hit on something that was a bit beyond him to really comprehend. I cannot say if the shallowness was the character's, or the author's, which means the writing was good enough to avoid transparency.But I was left with a sense of being unsatisfied, a desire for more introspection, a deeper plunge, if only to dredge up unexpected questions. Yet the structure, the character, the world, and the tone were all so carefully, specifically laid that I felt duly impressed. This book is a work, and it is a success, and if it does not reach too high, at least it does not fall to pretension, which is the danger of any redefinition which seeks to uplift entertainment to Art.But this is only my first LeGuin, and she deserves a second look. If she can deliver another vision, as carefully made as this one, but on a different theme, with a different sort of character, than I will be extremely impressed. If, however, she is only capable of one mode, one character, one theme--like Vonnegut--it is still a style worth experiencing at least once, and probably a handful of times."}, {"userName": "Markus", "userReviewDate": "Jan 31, 2016", "userURL": "http://www.goodreads.com/user/show/26681101-markus", "userReview": "Light is the left hand of darkness,And darkness the right hand of light.\nOn the distant world of Winter, ambisexual beings have lived in solitude for as long as anyone can remember. This peace is shattered when an envoy arrives from the Ekumen, offering the nations of Winter the opportunity to join a vast alliance of thousands of worlds…This book was my first foray into the science fiction works of Ursula K. Le Guin, already one of my favourite authors. I did not find it quite as strong as the Earthsea books, but that is mostly a matter of personal preference, as the focus of the books are quite different.The books in the so-called Hainish cycle are set on a variety of pre-spacefaring planets, and the reader experiences their interactions with the highly technologically developed outside perceived through the eyes of both agents of the Ekumen, the League of All Worlds, and indigenous citizens of the planets themselves. The Left Hand of Darkness is centred around the envoy Genry Ai and his relationship to the fascinating Prime Minister of Karhide, Therem Harth rem ir Estraven.Le Guin’s writing here is very good, but not masterly. The same goes for her setting, her characters and even her storylines. This author’s greatest strength lies in cramming vast amounts of literary value into the space of a mere two hundred pages. And in that aspect I have never seen her succeed like she does in The Left Hand of Darkness.More than anything, the book theorises on the answers to questions about human nature. What happens to a society in which gender is removed? A society which has no notions of femininity and masculinity? How does it react to the outside after an eternity of isolation? All these questions and more are in focus in one of Le Guin’s most famous novels."}, {"userName": "Apatt", "userReviewDate": "May 18, 2011", "userURL": "http://www.goodreads.com/user/show/2457095-apatt", "userReview": "“It was daunting, also, to me as a novelist. To invent a radically different sexual physiology and behaviour, not just as a speculation, but embodied in a novel, a story about people – people who most of the time were quite sexless but went into heat once a month, one time as a woman another time as a man? To get into the hearts and minds of such strange beings, bring them to being as characters – that would take some skill, not to mention chutzpah.”So says SF legend, Ms. Ursula K. Le Guin, in her introduction to this sci-fi classic. Fortunately, skill and chutzpah are not things she is short of. The Left Hand Of Darkness is her “thought experiment” to explore the idea of a human society without gender, no men or women, only people—and they are not aliens. The ramifications of this condition are numerous, no war, an odd concept in connection with “saving face”, uncontrollable sexual urges during “kemmer”*, no interest in sex during “somer”** etc.The plotline centers around Genly Ai, a representative of the Ekumen (a sort of galactic EU or UN), whose mission is to invite Gethen—a planet in the middle of an Ice Age—to join the Ekumen for various mutual benefits. The trouble is the concept of other planets is unknown to the Gethenians, who do not even have a word for flying, as there are no flying animals or insects on their planet. Air travel is also an unknown concept.Gethen (A.K.A. Winter) by Freak-Angel56This means that Genly’s claim to be a visitor from another planet come across as bizarre madness to most Gethenians. To make matters worse, his single-sex makes him a pervert by their standard. The only Gethenian with the imagination to believe Genly’s claim is Therem Harth rem i’r Estraven, the prime minister of Karhide, the country where Genly’s little rocket lands (the Ekumen’s spaceship is orbiting Gethen). Unfortunately, this belief causes poor Estraven to be stripped of his title and exiled. For the sake of progress Genly’s mission must succeed, and Estraven is his only hope.The Left Hand Of Darkness is a mind blowing, wonderful read. While it is quite short, 276 pages, it is not a book to be plowed through quickly in a couple of days. Le Guin sets a slow, steady pace throughout the book, gradually exploring the setting, the geography, the culture and, of course, the characters.Speaking of the setting I really like that there are multiple nations on this planet, in every other sci-fi books I have read the authors literally “imagine there’s no country” on alien planets. This makes for an even more detailed and vivid world building. The culture of the Gethenians fascinates me no end, as does their food, religion, limited technology, and strange animals. The non-gender, sometimes dual-gender, people are the most fascinating of all. Even their politics interest me, and I don’t normally like political SF, even Le Guin’s own  The Dispossessed is something of a drag for me.When I first read The Left Hand Of Darkness a few years ago I really liked the beginning and the end of the book, but there is a long section of around 50 pages in the second half of the book that depicts the two main characters’ trek across eight hundred miles of glacier that I found (at the time) to be very slow going, and a chore to get through; much like how our two heroes feel about their journey. However, forewarned is forearmed and I was ready for it this time and tried to concentrate harder while reading this “difficult” section. \n Our heroes trek across the vast Gobrin Ice, from one city to another. Click image to embiggen.To my surprise, I quite like most of it, especially the interactions between the two characters, in isolation from everybody else on the planet. The bonding and lowering of their personal barriers, and the eventual friendship (no, they don’t “get it on”). Their eighty days trek is often quite harrowing and I could almost feel icicles forming on my nose while their journey goes on and on. It does seem interminable at times, but my patience was not overly taxed on this occasion. I felt almost as relieved as Genly and Estraven when their journey ended, and the subsequent plotline is very satisfying and poignant.I would like to say that I emerged from reading The Left Hand Of Darkness a better and wiser man, but that would be ridiculous. I did feel quite uplifted afterward, though, I almost broke out into a song.Deservedly a classic, not to be missed._____________________* kemmer: The period of potency and fertility in the Gethenian sexual cycle, lasting three to five days, recurring every twenty-five to thirty days. (from the author’s glossary at the end of the book) **Somer: The period of sexual latency and infertility in the Gethenian sexual cycle, lasting 25 to 30 days. (from the author’s glossary at the end of the book)Notes:• The Left Hand Of Darkness is part of Le Guin’s Hainish Cycle, a sort of “Le Guin-verse” where most of her sci-fi stories are set (nothing to do with  Earthsea then).• I am not sure why this book is often called a feminist novel. The Gethenians have no fixed gender, and seem to value their occasional maleness or femaleness equally. The advantage of either gender type is not actually discussed.• My dear friend, and ace reviewer, Cecily doesn't dig it, but then she's crazy my GR BFF so I let it slide. Besides, perhaps her right hand digs it, but her left hand didn't get the memo. ;)• TV series adaptation in the works. _____________________Quotes:“Cultural shock was nothing much compared to the biological shock I suffered as a human male among human beings who were, five-sixths of the time, hermaphrodite neuters.”‘You? No.’ He stared even more closely at me. ‘I don’t know what the devil you are, Mr. Ai, a sexual freak or an artificial monster or a visitor from the Domains of the Void,“Ignorance is the ground of thought. Unproof is the ground of action. If it were proven that there is no God there would be no religion. No Handdara, no Yomesh, no hearthgods, nothing. But also if it were proven that there is a God, there would be no religion.”“Consider: There is no division of humanity into strong and weak halves, protective/ protected, dominant/ submissive, owner/ chattel, active/ passive. In fact the whole tendency to dualism that pervades human thinking may be found.”"}, {"userName": "Kaion", "userReviewDate": "Aug 12, 2010", "userURL": "http://www.goodreads.com/user/show/2670571-kaion", "userReview": "The Should I Read This Book Quiz: Ursula Le Guin is considered a Very Important science fiction writer for her anthropological chops, and The Left Hand of Darkness her classic in which a lone representative of the Ekumen is sent down to a heretofore un-contacted planet to convince its denizens to join this interplanetary human collective. Genly Ai’s mission is complicated by his inexperience with their society—the most significant difference with his own being that all Gethenians are neither male nor female, but have the capability to be either once a month in their kemmering period. But should you read it?[Begin Here:] Do you care about avoiding spoilers? If ‘yes’, go to A. If ‘no’, go to B.A. The phrase ‘Light is the left hand of darkness’ is deployed sans irony. If you just cringed, go to 3. If you were just pondering the duality of nature, go to 1. If you laughed and mentally composed the next line, go to C.B. A character describes an intense bonding moment with an alien thus: how the two of them finally understood each other as different beings, but essentially human… and how they wouldn’t have sex despite the tension because they respected each other too much. If you just thought that was intelligent, go to 1. If you just called the writer a ‘TEASE!’, go to 3. If you’re still hung up on the hermaphrodite part, go to C.C. Two characters talk philosophically about the themes of the book. If this happens in all your favorite novels, go to 1. If you think this is a overused and lazy device that usually leads to the plot paradoxically from confronting said themes, go to 3. If you’ve never realized this happened before, go to 2.1. Congratulations! You are an idealist. You love ‘world-building’, ‘details’, books about ‘ideas’, and authors who really ‘think’. I really don’t know why you haven’t read The Left Hand of Darkness yet, unless you are a sexist pig or one of those people who think all science fiction is people in rubber suits and Star Wars and therefore not smart enough for you.2. Congratulations! You are a waffler. You’ll read anything if anyone else is reading, which is what led you to such gems in past years as The Kite Runner. The problem is a well-known female science fiction writer holds as much widespread pop culture currency as a well-known Weather Channel anchor. So only undertake if you hang out in crowds where ‘LARP’ is a known acronym. Otherwise, you’re better off with tracking down the Swedish The Girl with a Dragon Tattoo movie.3. Congratulations! You are a realist. You laugh at all the enlightened super humans of the future, you think writers who want to espouse their philosophies should just do so without hiding behind aliens, and you skip sentences that have more than one made-up capitalized word. Chalk this up to a ‘skip it’, and continue secretly wishing to live in Brave New World.I fall almost completely firmly in category 3 on this test, with a side order of 2. Largely, I respect and appreciate what Ursula Le Guin brings to the table with her ideas of how gender shapes the very fabric of our society, be it through politics, morality, or philosophy. Ultimately however, I felt like these ideas didn’t lead anywhere. Like the ‘tease’ I brought up earlier, it was as if the novel were a large-scale violation of Chekhov’s-Gun principle.A lot of this is a function of the plot side of the equation- is this a story of first contact? Political intrigue? Survival thriller? Speculative anthropology/sociology? The narrative can’t really seem to decide. Subsequently there were long unfocused patches full of Proper Nouns, and ultimately the climax fails to truly address any of these storylines with aplomb.On a more personal note, this is my second Ursula Le Guin novel, and I can tell she’s not really the kind of writer that appeals to me. There’s a rarified style to her writing that prevents me from connecting to the characters. It’s something I brought up earlier in point C: I don’t need characters that talk about the ‘meaning’—I want characters that are recognizably human enough that when they illustrate the message, it needs no caption to resonate. Rating: 2.5 stars"}, {"userName": "Tadiana ✩Night Owl☽", "userReviewDate": "Mar 08, 2013", "userURL": "http://www.goodreads.com/user/show/8734459-tadiana-night-owl", "userReview": "Wow, there's a lot about this novel that I hadn't remembered. Like, basically the entire plot, other than the bare-bones outline.I'm going to stick with 4 stars here. Review to come.Initial post: Next up read from Ursula K. Le Guin: The Hainish Novels and Stories.* This one I read back in my college days, so my memories of it are pretty hazy. The unusual sexuality of the people on the planet Gethen, or Winter -- sometimes androgynous, sometimes male, sometimes female -- has stuck with me, but the plot has gotten lost in the mists of the years. So this'll be almost like reading it for the first time!*I received a free copy of this collection from the publisher for review."}, {"userName": "Jason Pettus", "userReviewDate": "Jul 01, 2008", "userURL": "http://www.goodreads.com/user/show/147289-jason-pettus", "userReview": "(Reprinted from the Chicago Center for Literature and Photography [cclapcenter.com]. I am the original author of this essay, as well as the owner of CCLaP; it is not being reprinted here illegally.)The CCLaP 100: In which I read for the first time a hundred so-called \"classics,\" then write reports on whether or not they deserve the labelBook #18: The Left Hand of Darkness, by Ursula K Le Guin (1969)The story in a nutshell:A highly unusual and controversial book at the time of its release (but more on that in a bit), Ursula K Le Guin's 1969 science-fiction head-scratcher The Left Hand of Darkness takes at its start an only slightly changed version of Gene Roddenberry's \"Star Trek\" and its United Federation of Planets; named the \"Ekumen\" in Le Guin's case, they are an enlightened collection of peaceful humanoid societies from around the galaxy, which over the centuries of contact now have all come to realize that they were in fact all started by the same master super-race, the mysterious and highly advanced Hainish people from millennia ago. The book itself, then, starts with \"first contact\" by one of these specially trained Ekumen, with a new planet called Gethen who the federation hopes to convince to join them; from just a plot standpoint, in fact, the entire book is not much more than an observation of this ambassador's time on the planet for his first few years, learning more and more about this incredible race as he does. Because that's the thing that got this book a lot of attention when it first came out, and in fact still gets it a fair amount of press -- the people of Gethen are in fact androgynes, not hermaphrodites but rather lacking any gender at all for most of the month, instead going into a kind of \"heat\" for a few days at which time various chemicals in their body produce both genitals and a sex drive, the gender based on a complicated mix of biology, partner status, personal preference and the like.As such, then, this book is almost a sociological study more than anything else, letting us experience through this black Earthling's 1969 eyes what this ice-planet full of Eskimo-like androgynes must be like, and how their society must be so different from ours; for example, how there's no such thing as gender imbalance in the workplace because of there literally being no genders, but how they see the entire concept of voluntary sexual desire to be the height of disgusting perversion, making them in some respects actually much more conservative than Earth's permanent-gender society. Without giving away too much of the plot, then, let's say that Le Guin basically imagines two main types of society on Gethen, much like Earth, an \"East\" and a \"West\" that are fundamentally different in some ways from each other; the novel, then, spends a third of its time in one society, a third in the other, the ambassador changing his opinions about them and bouncing from one to the other due mostly to the boisterous male Captain-Kirk-like wrong assumptions he is constantly making about the things going on around him; the last third of the novel, then, is a trippy late-'60s tale about him and one of these natives making a long and arduous journey by foot over the icy wasteland connecting these two societies, using the bleak desolation as a way to finally \"grok\" how the other's mind works.The argument for it being a classic:As I've mentioned at CCLaP before, there are basically two awards within science-fiction (or SF) that realistically compete for the title of \"most important,\" the Hugo and the Nebula, meaning that these groups are usually loathe to award their honor to the same book on any given year; so the few times in history they have, like they precisely did with The Left Hand of Darkness, brother believe me when I say you should pay attention. Because the book is not just a fine tale unto itself (but again, more on that in a bit), but signaled a very important moment in SF history; the first time the \"Establishment\" recognized the growing power and influence of the so-called \"New Wave\" within the genre, rising by no coincidence at the same time of the general youth counterculture of the '60s and '70s, dealing with many of the same themes in many of the same ways as such other \"Movement\" details as psychedelic music and independent films. It was not the first set of SF authors to attempt to speak of \"serious\" issues, as some guides erroneously put it -- genre authors had been tackling weighty and complex issues as far back as the '40s, after all -- but they were definitely the first authors to say that a book could be set in the future and still mostly deal with sociological issues and the human condition, versus the \"hard science\" space-opera details assumed by the genre in the decades before. And it was a movement that was started years before The Left Hand of Darkness, too; it's just that this book was the first time the old guard officially recognized it, and officially recognized that it was in fact the wave of the genre's future.Ah, but like I said, even if you take all this away, there's still the matter that this is a kick-butt book, its fans will say, one that will get you thinking about all kinds of issues in a way you never have before, one that like Tolkien's Middle Earth just ever-so-slyly references real human history in an impossibly ingenious way when meshing it into a fictional planet's fake history. (Take, for example, how Gethen's western half is a curious mix of democracy and fascism, basically the best and worst that real Earth's western half has to offer, a bizarre combination we've never actually seen in real history but that is a definite reflection of what combining the two might look like; while her fictional planet's eastern half is a mix of Buddhism and Confucianism, basically the Asian equivalent of what I just said about the West.) And let's not forget, this is also an extremely important pillar in the history of the relatively new academic field of Feminist Studies, as fundamental as something like Margaret Atwood's The Handmaid's Tale which usually gets a lot more press -- a book released in the middle of the '60s women's movement which dared to picture a society without gender, without pay differences or work differences or hiring differences between men and women whatsoever, and telling the entire story from the viewpoint of a sexist old-school male at that, even if he does happen to be black.The argument against:Not much, to tell you the truth, other than the usual argument that this is a genre novel, therefore perhaps not appropriate for a traditional \"Canon\" list for the general population. But we agreed here at the CCLaP 100 a long time ago that we're going to count genre literature as eligible for \"classic\" status, so this is not really an applicable argument for us.My verdict:So first let me just confess my personal bias right away -- that since I was raised by people who attended college during the Kennedy administration in the early '60s, I myself was raised with an appreciation for such pre-counterculture things as Mid-Century Modernist architecture, Dave Brubeck, and such so-called \"Silver Age\" authors as Isaac Asimov, Ray Bradbury, Arthur C. Clarke and more, giving me a tendency to dismiss a lot of New Wave SF writing in a cranky old-man style as \"that hippie trash.\" So please take it as sincere when I say I was absolutely blown away by The Left Hand of Darkness, and that it's immediately in my mind become one of the best novels I've ever read; because every single good thing you've heard about this is true, every single accolade, every single reason you've heard for why you should read it. In fact, I think it's very telling what Le Guin has admitted many times in past interviews, how it was the exact opportunity to do fictional world-building that mostly led her to SF in the first place; because that's the most interesting thing about this book as well, is the exquisitely complex portrait of a fictional global society she constructs here, which of course is really an immaculately unique look at our own society, seen through the kind of highly original prism that you can only get away with in this particular genre.In fact, there are a hundred different examples I could pick and expound on, so let me just pick one; let's talk, for example, about how amazed and turned-on and creeped-out I was by the oracle-like fortune-telling ritual described in this book, among the shamanistic tribes on the Eastern side of Gethen that have been practicing their religion for over 13,000 recorded years now. Basically, imagine a holy man who has learned how to read minds telepathically, in a sorta mystical way that makes for good trippy '60s literature; now imagine surrounding him with the insane and retarded, all of them naked and around a campfire, feeding them all psychedelic drugs, then letting them rut like animals in an uncontained orgy, the telepathic shaman feeding on the collective energy of these deranged orgasms until exploding in a frenzy of metaphorical futuristic visions. Yes, and this won the Hugo and Nebula! In fact, this book celebrates its 40th anniversary next year, if you can believe that, which makes it even more astounding; a highly experimental, barely comprehensible survey of humanity's worst and best tendencies, wrapped into a fantastical storyline that almost as an afterthought provides these sweeping mental vistas of ice-locked landscapes, that has nonetheless stood the test of time for two different generations now and eagerly entering a third. It was a real surprise, a huge treat, and something I heartily recommend to each and every one of you.Is it a classic? Yes"}, {"userName": "Lit Bug", "userReviewDate": "Jul 20, 2013", "userURL": "http://www.goodreads.com/user/show/14147234-lit-bug", "userReview": "[light (hide spoiler)]"}, {"userName": "Ashley Nuckles", "userReviewDate": "Jan 24, 2018", "userURL": "http://www.goodreads.com/user/show/55308610-ashley-nuckles", "userReview": "I’m probably missing the whole gist of this book because it basically flew right over my head, but I’m sure if I read a few analyses of it I’d enjoy it more!"}, {"userName": "Stuart", "userReviewDate": "Apr 02, 2013", "userURL": "http://www.goodreads.com/user/show/9456990-stuart", "userReview": "The Left Hand of Darkness: Brilliant depiction of an androgynous society on a frozen planetOriginally published at Fantasy LiteratureThe Left Hand of Darkness (1969), part of THE HAINISH CYCLE, won both the Hugo and Nebula Awards for Best SF Novel, and is well known as one of the first books in the genre to intelligently explore the nature of gender and identity. Ursula K. LeGuin is a highly respected writer known for her anthropological and humanistic approach to SF, and her presence has attracted many mainstream readers and forced literary critics to take the genre more seriously. For that alone we owe her a great debt, and she has also written a series of critical essays entitled The Language of the Night: Essays on Fantasy and Science Fiction (1979). Her other masterpieces include The Dispossessed (1974), which won the Hugo and Nebula awards, and THE EARTHSEA CYCLE of YA fantasy novels.I read The Left Hand of Darkness back in high school, and it had a profound effect on my perceptions of what intelligent SF can do. What it lacks in space battles, dazzling technologies, bizarre alien species, etc., it fully makes up by rigorously exploring what an androgynous society might be like, one in which people are neither male nor female for most of the month, except when they enter a state of kemmer, in which they become sexually active and seek a partner. When the Gethenians (the native human population) find a mate, one assumes male attributes and other female, but this state lasts only for a few days, so for the majority of the year Gethenians are androgynous and lack sexual urges. LeGuin’s genius is that she explores the implications of this “thought experiment” from so many angles, examining politics, war, economic development, friendship, love, loyalty, betrayal, all against the backdrop of a planet trapped in a relentless Ice Age, which also shapes the two nations of Karhide and Orgoreyn that features prominently in the story.The Left Hand of Darkness centers around Genly Ai, an Envoy from the Ekumen, a loosely-linked association of 85 human-inhabited worlds. Through long experience, the Ekumen has fine-tuned its approach to contacting new worlds for the first time. They initially send just a single ship, and from that ship send just a single Envoy at first. The intent is to avoid being viewed as a threat by the native peoples. So for much of the novel, Genly tries in vain to convince the peoples of Karhide and Orgoreyn that he is indeed an envoy from the stars, and not just a demented “pervert” who remains trapped in the state of kemmer as a male.Genly soon gets caught up in the political intrigues of the nation of Karhide, a political monarchy. Karhiddish society is complicated by the concept of shifgrethor, a complex system of pride, face, honor, etc. in which great care is taken not to give direct insult to others, and to make sure that others do not lose face, which reflects badly on one’s self. This makes it difficult for individuals to speak directly to the point, which makes it hard for Genly’s story to be accepted, as many view him as mad or deluded.Finally, Prime Minister Estraven chooses to accept his story and entreats King Argaven to accept an alliance with the Ekumen, which promises to bring new knowledge, technologies, and trade goods. Argaven, however, is a paranoid and insecure ruler, and instead chooses to exile Estraven from his borders. Estraven flees to Orgoreyn, a highly organized and bureaucratic nation, and Genly decides that it’s not safe to stay in Karhide and makes his way to Orgoreyn as well. Initially he is welcomed by one of the ruling factions, who seem to be more receptive and try to leverage his presence to further their stratagems. Unfortunately, other factions refuse to believe his story and he is betrayed and sent to a prison work camp deep in the icy mountains. Meanwhile, Estraven has been living as a powerless exile in Orgoreyn, but Genly mistakenly views Estraven as a cold and calculating political creature. He is therefore quite surprised when it is Estraven who comes to his rescue in the prison camp.This brings us to the main set-piece of The Left Hand of Darkness, the perilous and brutal voyage of the two across the Gobrin Glacier to avoid Orgoreyn patrols and make their way back to Karhide, hoping to allow Genly to contact his ship for aid. This arduous slog, for which LeGuin extensively researched Arctic expeditions beforehand, forces Genly and Estraven to spend several months in extremely close contact, as they are completely cut off from all other civilization and must depend on each other for survival. Of course it is Genly the off-worlder who must depend on the expertise and iron-will of Estraven, whom he previously distrusted, to get through this ordeal. LeGuin’s description of the sled journey, the minimal rations they share, the brutal sub-zero conditions and their effects on the bodies, minds, and spirits of the two is brilliantly detailed and convincing. You will feel as if you have been subjected to an Arctic journey and your hands may get frostbite just from clutching the book (there is no audiobook currently available, but I guess your ears would freeze instead).It is during this journey that Genly and Estraven are forced to understand the nature of the other. And it is Genly who has must struggle the most, as he has unconsciously tried to look at Estraven as a man for the sake of convenience, and begins to understand that Gethenians have both masculine and feminine traits, and that they are not in conflict. He begins to understand that Estraven is a steadfast friend, and I really credit LeGuin for avoiding the tempting pitfall of having the two characters have a sexual relationship. Their bond becomes deep but transcends gender.This must have been a profound insight when The Left Hand of Darkness was first published in 1969, at the height of a social revolution and as the feminist and women’s movements were forming. Perhaps it is more accepted nowadays that we all have male and female aspects to our personalities, and the LGBT movement has gained a lot of hard-won acceptance in recent years in parts of the world. But there are still plenty of resisters who yearn for a world of manly men and feminine women, and they will fight to maintain this world view at all costs. It’s an interesting study to apply the lessons of this book in today’s world.When Genly and Estraven finally reach their destination, an unexpected and tragic twist changes the political climates of both Karhide and Orgoreyn and makes it possible for these two nations to accept the offer to join the Ekumen. It is a powerful ending that will linger in the reader’s mind for some time. It reduced me to tears when I first read it 20 years ago, and I don’t do that often.So what are the implications of a genderless society? It is a testament to LeGuin’s storytelling that The Left Hand of Darkness manages to explore this without sacrificing readability. The most obvious aspect of Gethen’s nations is that they do not wage war on each other, though there are frequent small-scale skirmishes, intrigues, assassinations, and murders on an individual level. The lack of male aggressiveness precludes them from organized military conflicts. This seems a fair assertion to make: what major human society has ever had a military dominated by women, and urges to physical violence tend to occur more among men (anyone care to deny that?). Yet LeGuin doesn’t sugar-coat her androgynous society — there are still murders, jealousy, betrayals, etc. In addition, she also posits that Gethenian society is much less proactive in pursuing scientific progress, as it has been content in many cases to maintain primitive institutions and has lacked the motivation to innovate. Is the urge to innovate and invent something mainly found in men and not women? Or is that more a product of our societies’ preconceived gender roles? I have often wondered what an all-female society would be like, whether it could achieve the same level of technological achievement as ours. Honestly, I don’t know what form it would take, but it would almost certainly be different from what we have.But I think that LeGuin’s thinking, which some consider feminist, is much more subtle than that. She seeks to examine what kind of society would develop in the absence of genders. How would our energies be refocused if we didn’t have to worry and obsess about the opposite sex all the time? How would individuals treat each other in the absence of the dualistic world of men (hunters/gatherers/fighters) and women (child-bearers/nurturers/home-makers)? Would society be more egalitarian, with merit accruing to those with greater accomplishments without the clouding influence of gender?The societies of Karhide and Orgoreyn provide tantalizing hints, but their strengths and flaws are on full display. They are not feminist utopias by any stretch. In fact, I would argue that The Left Hand of Darkness is not really feminist fiction as it normally understood, designed to empower women by showing their positive aspects and the negative aspects of male-dominated societies. Instead, I view LeGuin is a humanist, determined to drill down to the roots of gender identity, and by stripping this away, hoping to reveal the core elements of humanity common to both men and women."}, {"userName": "Aubrey", "userReviewDate": "Jul 08, 2013", "userURL": "http://www.goodreads.com/user/show/4119460-aubrey", "userReview": "I hated the harsh, intricate, obstinate demands that he made on me in the name of life.\n4.5/5This is no The Dispossessed, a judgment equal parts quality of the work and personal taste of the reader, unfair and yet true if one keeps in mind that, regardless of individual ratings, I regard Le Guin as a gift to literature. Plenty are the authors who forge ahead with little regard for the reader, nearly ubiquitous are the ones who stay stolidly put in the kiddy pool out of want and necessity, leaving a mere few willing and able to serve as a bridge. One would think sci-fi would attract more of her kind with its natural inclinations towards melding wheeling extension with kindred reality, rather than endlessly sludging in circles of privileged solipsism whose talents lie in viciously retaliating against the slightest veering of status quo, but no matter. I will pity them for their ignorance, if nothing else.\n...it certainly was difficult to imagine him as a young mother. He was a hard shrewd jovial politician, whose acts of kindness served his interest and whose interest was himself. I had met him on Earth, and on Hain, and on Ollul. I expect to meet him in Hell.\nThere is a term I cannot remember that has to do with the skill of the author in taking on a believable voice without hinting at the personal beliefs of the writer behind the curtain. Whatever it is, it is a good one, a mindset that both circumvents the endless diatribes on whether authors may write assholes as well as makes the avoidance of caricature and stereotype an ability to be aspired to. In this work of seeming eradication of gendered double-standards, Le Guin writes a man with little recognition of feminism, developing along lines that aggravated and enlightened me in equal amounts. While it is obvious from her writing that she could have gone much further in breaking down the patriarchy, her aim was a narrative of culture and climate, not a polemic. Had the latter been the case, this work may not have won the Hugo and Nebula, her name might not be as revered on the popular level as it is, and ultimately a conversation about gender and its sociocultural effects may never have started in the unlikely breeding grounds of Star Wars conventions and Internet forums dedicated to Dune. \nAs we ran the sledge across the snow-bridges over narrow crevasses we could look down to left or right into blue shafts and abysses in which bits of ice dislodged by the runners fell with a vast, faint, delicate music, as if silver wires touched thin crystal planes, falling.\nAs said, Le Guin is a bridge, stronger all the more for its subtlety. Men the hermaphroditic Gethenians may be called, but out of limits of the narrator's androcentric language that is all too similar to my own English. Sexist dismissals crop up every so often, but far more powerful are the insinuations of what equal responsibilities for childbearing and domestic responsibility can accomplish on the national scale. Slowly but surely the narrator breaks the binds of his upbringing in order to appreciate the freedom beyond inexorable duality, handled in such a wonderfully constructed melding of thought, prose, and world building that any reader inclined to reading will find something to enjoy.\nHis loyalty extended without disproportion to things, the patient, obstinate, reliable things that we use and get used to, the things we live by.\nIt must be mentioned that the narrator is one whom US Americans like to describe as black. Take that as you will, but bear in mind the rarity of this in the esteemed literature of a genre that calls itself forward thinking, the narrator's own thoughts on the lack of women in the science and art of his own world, our world of reality and its obdurate copings with physical variance and biological fact. Expansion of horizons is sci-fi's game, yes? You don't need another world for that."}, {"userName": "Γκέλλυ", "userReviewDate": "Feb 03, 2018", "userURL": "http://www.goodreads.com/user/show/60290830", "userReview": "Αν ο Αναρχικός είναι το απόλυτο 10, τότε το Αριστερό χέρι είναι 9/10. Καταπληκτική η Λε Γκεν, ειδικά το δευτερο μισό το απογείωσε."}, {"userName": "Matthew Quann", "userReviewDate": "Jul 28, 2017", "userURL": "http://www.goodreads.com/user/show/22699228-matthew-quann", "userReview": "It has been a bit of a personal project of for the past year or so to sample from the classics of the sci-fi genre. It’s not that I think modern sci-fi is undesirable—indeed, I’m a huge fan—rather, there is a lot of reward in visiting trends in sci-fi from other times, seeing the foundations of modern sci-fi, and having a base understanding of the language of science fiction. Sci-fi is endlessly self-referential and to be well versed in the genre it is almost a requirement that certain books be read. This has led to a sampling of books that have challenged, awed, and befuddled me in equal measure. One of the treats that has been afforded to me in my readings is a deeper appreciation for sci-fi as a vehicle for any type of story to be told. Thus far, the Penguin Galaxy series has been the ideal selection of classics from which to broaden my horizons. \nDune\n is a spectacle of world-building, a metaphor for climate change, and a thrilling political drama that seems almost a precursor to George R. R. Martin’s A Song of Ice and Fire. \nNeuromancer\n presented a drug-addled future in which the lead character is equally as concerned with his next score and lay as the underlying AI-based mystery. It follows then, that Ursula K. Le Guin’s The Left Hand of Darkness is of similar experimental pedigree and was nothing at all what I expected. Genly Ai is an envoy from the Ekumen—your standard giant space empire—to the planet of Gethen, or Winter. He is sent alone, as per the Ekumen custom, to bring the planet into the fold of the interplanetary collective. What makes Gethen such a unique place, aside from the inhospitable constant winter, is the Gethenian people. There are no men, no women, only androgynous beings that assume a gender when they enter “kemmer”, or a reproductive state, which happens on a regular cycle. Thus the world of Winter is unlike our own in climate and culture.Though there are guaranteed to be thought pieces, theses, and reviews that have put it more eloquently than myself, The Left Hand of Darkness is a different breed of sci-fi. I like to think of it as a more anthropological sci-fi. Genly Ai’s journey to come to grips with a culture that holds no gender roles is more philosophical and emotional than I’d expect from most sci-fi. Where other books would spend time with physical conflict, The Left Hand of Darkness relishes in the expansion of Genly’s personal understanding of gender.It certainly makes for as topical a read today as it did when first published back in 1969. Gender and sexuality seem to so often fall into circuitous discussions in public and on the internet, and it was a breath of fresh air to read what is essentially a long treatise on what it would truly mean to live without consideration of another human’s genitalia. It also makes for a reading experience that is fairly challenging. Estraven, the Gethenian character with whom the reader spends most of their time, is difficult to imagine. In fact, the struggle to remove my own ingrained perception of gender during my reading of The Left Hand of Darkness stretched my mind in interesting new directions. If the intention is to challenge our preconceived notions of gender, Le Guin succeeds. Though this is all stimulating, the novel does lack a sense of forward momentum that made it a bit of a drag. In particular, there’s a good stretch in the back half of the novel where Genly and Estraven traverse the hostile world with hardly any provisions. This section seemed to drag on forever, and was infrequently warmed by the romance plot that runs alongside it. Though I kept expecting it, the intimacy here never becomes sexual, but is instead emotional, intellectual, and physical only in the sense of two people physically suffering together. There is a bit of suffering involved in the reading of The Left Hand of Darkness. I took on the book at a time in which I was too busy to give it its proper due and conjuring a winter wasteland is painful when the summer’s sunlight lands across the book’s pages. It’s a book that’s more satisfying in the abstract than appealing during the actual reading. As an academic exploration of classic sci-fi, it fits the bill even if it doesn’t make for an enjoyable experience overall."}, {"userName": "J.", "userReviewDate": "Jan 04, 2008", "userURL": "http://www.goodreads.com/user/show/743864-j", "userReview": "This book is a science fiction classic. To fans of feminist and political science fiction, it is more than a classic - it is a touchstone, a founding document, a rallying post.It follows Genly Ai, an envoy from the Ekumen (a perhaps-utopian union of worlds) to the planet Gethen, where the entire habitable zone of the planet has a climate at the extreme cold end of human tolerance - and where Gethenian natives lack biological sex and gender, but can unpredictably develop either male or female apparatus when \"in kemmer,\" which is a monthly cyclic state of being ready and driven to mate (yes, there has to be a better way to say this, and Le Guin manages it). Le Guin, as always, writes with specificity, honesty, and care. She devotes equal attention the the effects of both the cold and the odd biology on Gethenian culture, and never shoehorns in an authorial manifesto. Consequently, this book is no sort of call to revolution, despite being one of the first science fiction novels to deal with gender so intelligently and sensitively, not as a \"war of the sexes\" but as something far more nuanced. It is only feminist in that the emergent examination of the concept of gender is a thorough and intelligent one, and most of those tend to, after analysis, support a feminist viewpoint. Le Guin once said something along the lines of: \"I hoped, after I had taken away male and female, that what remained might be, simply, human.\" Mostly, though, it is an early and exceptionally incisive example of anthropological science fiction which opened the field to further investigations of this sort.There's a plot in there, too, eventually, and two characters whose relationship is convincingly troubled enough to be involving. The book gets much more compelling, I think, in the second half, as events propel those two characters onward and away from their fellows. In their isolation much of what was hinted at before is laid bare, and I experienced at least one moment of real awe and beauty. Which, you know, goes a long way toward making a book personally relevant, too."}, {"userName": "Tatiana", "userReviewDate": "Jan 04, 2010", "userURL": "http://www.goodreads.com/user/show/2250020-tatiana", "userReview": "As seen on The Readventurer\"The Left Hand of Darkness\" turned out to be quite a pleasant surprise for me. I do not read science fiction often and had to abandon my last attempt (\"The Hitchhiker's Guide to Galaxy\") for its utter stupidity, but this book was a sci-fi of a completely different sort. It wasn't just another novel about green aliens or space travel, it was an extremely clever and deep exploration of gender. Genly Ai is an emissary of the Ekumen (a union of human worlds) to planet Gethen, or Winter (called so for its extremely cold climate). His mission is to convince inhabitants of the world to join the rest of humanity in exchange of ideas and technology. However Genly is met with some reserve as the decision to join is hindered by alien to him intricacies of Gethenian politics and culture. What makes Gethen so unique and thus so hard for Ai to understand is that it is inhibited by the race of ambisexual (hermaphroditic) beings. All Gethenians have an ability to be both male and female. Most of the time their sexualities lay dormant and awaken only a few days a month during a period called kemmer (mating period). At the time of kemmer each Gethenian can become either male or female. The choice of gender is always incidental. Between the kemmers Gethenians are asexual. This sexual peculiarity makes Gethen quite a subdued race - its inhabitants are not assigned any gender roles, they are not sexually driven or sexually frustrated, they are less violent and ambitious. As the story progresses, Genly learns to understand this strange world a little better and even finds love.I was extremely impressed by Le Guin's imagination. The world of Gethen was thoroughly detailed and very well realized. Everything about Gethen - the direct effects of Winter's climate and Gethenians' ambisexuality on the social and political order, science, philosophy and even folklore - were developed in the most remarkable way. I was also amazed at how skillfully Le Guin presented romance in the story, because as you can imagine a love story between a man and an ambisexual being (or between two ambisexuals) can go horribly wrong in less talented hands. My only reservation about the book was the language. It took a few chapters to get used to a huge amount of Gethenian words, names and concepts. At times I had to reread some passages to understand them, because they seemed a little too densely written (my recent obsession with YA literature might be blamed for the softness of my brain too I suppose). But this wasn't so overwhelming as to spoil the reading experience for me. Highly recommended to those who enjoys quality science fiction."}, {"userName": "Bonnie Shores", "userReviewDate": "Nov 16, 2017", "userURL": "http://www.goodreads.com/user/show/25177308-bonnie-shores", "userReview": "DNF 😠 This book began by lecturing me—for just about 12 minutes—on what science fiction was/wasn't and telling me that authors are liars. Said lecture, imo, came off as pompous and wholly unnecessary. Although I already thought I hated it, I magnanimously decided to continue to Chapter 1. By 7:32 into the first chapter, which was narrated by what sounded to me like a very disinterested, very old man, I was done. I had downloaded this book a while back and it fit a challenge requirement, so I was excited to finally get a chance to read (listen to) it. Here is part of the book summary:\nThe Left Hand of Darkness tells the story of a lone human emissary to Winter, an alien world whose inhabitants can choose - and change - their gender. His goal is to facilitate Winter's inclusion in a growing intergalactic civilization. But to do so he must bridge the gulf between his own views and those of the completely dissimilar culture that he encounters. Embracing the aspects of psychology, society, and human emotion on an alien world, The Left Hand of Darkness stands as a landmark achievement in the annals of intellectual science fiction.\nApparently, I'm not intellectual enough to enjoy this book. 😢"}, {"userName": "Nandakishore Varma", "userReviewDate": "Sep 13, 2011", "userURL": "http://www.goodreads.com/user/show/6237864-nandakishore-varma", "userReview": "This is a pioneering work of science fiction. It is not space opera; it is not the hard SF of Asimov and Clarke which shows the impact of the science of the future on society; and it is not a fantasy where the scientific framework is used just as a convenient backdrop for the author to air her ideas. Ursula K. LeGuin explores deep questions of gender, about what it means to be a male or female, by creating a society of androgynous individuals, who take on male/ female sexual characteristics only at the time of mating, which happens monthly. Any individual can become a male or female depending on the situation. In consequence, they look at \"ordinary\" human beings as perverts, being continuously \"in heat\" according to them.Add to this mind-blowing concept interplanetary diplomatic relations and intrigue, and you have a gripping novel which manages to be literary, exciting and genuine science fiction at the same time. A rare achievement."}, {"userName": "Cassy", "userReviewDate": "Dec 29, 2010", "userURL": "http://www.goodreads.com/user/show/2282938-cassy", "userReview": "I generally visualize a book as a scale. An old fashioned scale like the one Lady Justice holds. On left side, you found the academic merits: concept, structure, significance. On the right side is the entertainment value. My goal is to find a well-balanced book that keeps me turning the page yet leaves me feeling full and even a little cocky. Sometimes I am in the mood for an unbalanced book. But if the scale is fully tilted to the left (supposedly genius but unreadable or boring) or to the right (fast-paced, fluffy nothingness), it is not getting five stars.This books leans to the left for me. This is a concept book, primarily about gender. And once you substitute snow for sand, it reminds me of Dune with its emphasis on world building and subtle political intrigue. (The back of my book even has a blurb from Frank Herbert.) Le Guin's writing sparks with intelligence. I marked several passages for rereading. And I oftentimes had to take a step back to understand and appreciate a sentence. All of this is very satisfying.However, the book stumbles on the entertainment aspect. Similar to Dune, the characters are complex and well-presented, but they didn’t elicit any emotional reaction from me. There is a goal and solid action which drives the plot forward, but I picked watching a movie during Christmas break over reading this book several times. (And the movies were not particularly appealing since my whole family had to agree on the selection.)I would recommend this book to others. It’s thought-provoking and well written. Just beware that it may be a bit of a chore to read. A worthwhile chore, but a chore all the same."}, {"userName": "Zanna", "userReviewDate": "Jun 29, 2014", "userURL": "http://www.goodreads.com/user/show/22591633-zanna", "userReview": "I'll make my report as if I were telling a story, for I was taught as a child on my homeworld that Truth is a matter of the imaginationI didn't want this book to end. I so badly wanted to stay on Gethen, Winter, the frozen planet, (although I suffer cold weather with ill grace, and miss my family at 3 hours' distance). Like Octavia Butler, Le Guin makes worlds I can't bear to leave, even when they are harsh or hostile. Of course, the magnetism is all in the telling. In this edition's introduction, Le Guin says 'the novelist says in words what cannot be said in words'. Accordingly, I can explain only in metaphor that this novel lights all my lamps.Our storyteller the Envoy is Genly Ai, a young man from Earth, who would, in my country and time, be recognised as and likely call himself Black. On Gethen he is darker than most, but the native people are variously 'red-brown and yellow-brown'. His report does not mention skin-colour prejudice on his own world, and on Gethen this does not seem to be an issue, although the king asks Genly, about the alliance of people he represents 'are they all as black as you?' Genly is also taller than most Gethenians, and his nose is different. But his main peculiarity is that he is always male among a people who are each in themselves neither and both female and male, capable, conditions being favourable, of pregnancy and impregnation. As well as causing some Gethenians to be repulsed by him, this is a personal challenge for Genly, who is as sexist as a well-educated young earthling might be expected to be, and his narration is marked by a dismissive attitude towards what he sees as femininity in the Gethenians: '[I was a]nnoyed by this sense of effeminate intrigue'. His androcentric attitude is most powerfullly evident in his misgendering of all Gethenians as 'he'. The unmarked masculine lies so heavily on the text that he renders the Gethenian words for family members not as child and sibling but as son and brother, yet being unable to bring himself to call the person who carried the child 'mother' unless they are in the physical phase of lactation, he calls them, as the Gethenians do, 'parent in the flesh'. This language is both revealing and a struggle for the reader, who must, like Genly, wrestle with their own concepts of gender, peeling the sign from what it mis-signifies.Genly's dislocated ideas about gender sometimes cause rather uncomfortable humour, such as when he describes his 'landlady' with hir* wide hips and gossiping, nuturing manner. Le Guin contradicts Genly's impressions with the history of this person, who has never given birth, but has 'fathered' several children. When Genly is explaining to the 'king' of Karhide that one of his photographs shows a woman, he reports 'I had to use the word that Gethenians would apply only to a person in the culminant phase of kemmer, the alternative being their word for a female animal.' Perhaps it is this problematic approach that causes the royal's reaction – he expresses disgust. Adult Gethenians have a monthly period of a few days when they are driven to seek sexual intercourse. Nobody is expected to work during this time – which reminds me of the old feminist joke that if men menstruated, monthly paid leave with hot water bottles and chocolate would be universally provided.The gender aspect of the worldbuilding is so fascinating that it would be in danger of overshadowing other aspects if they were not equally compelling. Envisioning the practicalities of human life on a world so cold that snow melts for only a few summer weeks, Le Guin creatively constructs architecture and transport modes adapted to the setting as well as the sensibilities of their makers. But it's the socio-political aspects that most compel me. I was struck by the revelation that 'Karhiders hire services not people' (and so anyone hired by a wealthy host to prepare and serve a meal would have returned to their own homes afterwards) Le Guin communicates the norms of culture with subtlety. Genly is always cold in Karhide – the people there do not care for comfort, but when he travels from the capital through rural areas he is delighted by the hospitality always given by invariable convention and admires and enjoys the way of life of the people for whom the tasks of social reproduction are the responsibility of all, and where law and order are weak forces. However, when he arrives in the capital of another country, Orgoreyn, where comfort and organisation are the norm, he is refreshed by the change, noting that the clothes are gaudy and cheaply made and the food insipid compared to those in Karhide but that this is a fair exchange for feeling warm and being looked after. Later, long after I had begun to feel uneasy, he starts to feel cosseted and deceived. In this comparison an opposition between 'civilisation' and war emerges.The main Gethenian character, Estraven, is a Karhider who much prefers hir* own culture to that of Orgoreyn, where 'behind every man is the inspector'. I did not understand Genly's mistrust of Estraven (and I disagreed with him, actually, that the 'king' was 'crazy'), at times he seemed to lack cultural understanding and be misled by his ideas about gender, projecting them onto his understanding of 'shifgrethor', the Gethenian concept of prestige which, for instance, makes it insulting to give advice. Fortunately, he becomes more humble and self-aware about this as the story progresses.The narrative is intercut with beautiful, fascinating, often violent Gethenian folktales on themes of love, death and time, which illuminate the two main spiritual disciplines Genly encounters, which both inform/reflect the people's concepts of time and knowledge. In Orgoreyn, the state religion follows a kind of prophet who is believed to have seen all moments past and future (an idea that reminds me of Laplace). Karhide has no religion, but there are 'Fastnesses' where people live in a kind of monkish seclusion and seek a states of mind that bear resemblance to some Buddhist ideas. Estraven's philosophical thoughts, as well as the tales, throw some light on this discipline: 'well in the Handdara... you know, there's no theory, no dogma... Maybe they are less aware of the gap between men [sic] and beasts, being more occupied with the likenesses, the links, the whole of which living things are a part' Genly cannot work out if its followers believe in god, but according to Estraven 'to be an atheist is to maintain God... the Handdarata... have chosen not to treat God as a fact, subject either to proof or belief: and they have broken the circle, and go free' I was moved by Estraven's beautiful nightly prayer: 'praise then darkness and Creation unfinished!' Hir* attitide to land and nation also touches me, and Genly's sexist reaction speaks to gender as a colonial concept:Hate Orgoreyn? No, how should I? How does one hate a country, or love one? I lack the trick of it. I know people, I know towns, farms, hills and rivers and rocks, I know the sun at sunset in autumn falls on the side of a certain plowland in the hills; but what is the sense of giving a boundary to all that, of giving it a name and ceasing to love where the name ceases to apply? What is love of one's country; is it hate of one's uncountry? Then it's not a good thing. Is it simply self-love? That's a good thing, but one mustn't make a virtue of it, or a profession... Insofar as I love life, I love the hills of the Domain of Estre, but that sort of love does not have a boundary line of hate. And beyond that, I am ignorant, I hope.Ignorant, in the Handdara sense: to ignore the abstraction, to hold fast to the thing. There was in this attitude something feminine, a refusal of the abstract, the ideal, a submissiveness to the given, which rather displeased me.I fell in love with Estraven and the culture of Karhide, prickly though it seemed at first. Perhaps most of all because it is what I most yearn for from my own roots, vainly, a storytelling culture: 'He told [our adventure] as only a person of an oral-literature tradition can tell a story, so that it became a saga, full of traditional locutions and even episodes, yet exact and vivid […] with comic interludes... and mystical ones... I listened as fascinated as all the rest, my gaze on my friend's dark face.Perhaps this lovely tribute to oral literature is Ursula's apology for telling an adventure story on the poverty of the printed page. Nonetheless, I was rapt, aflame with the emotions aroused by the tale, and when it was over, I longed already to hear it again*I have decided to use the (possessive form) gender neutral pronoun 'hir' for Gethenians, although in Genly's account they are all 'he' 'him' 'his' etc"}, {"userName": "Jan-Maat", "userReviewDate": "Jun 12, 2011", "userURL": "http://www.goodreads.com/user/show/5617661-jan-maat", "userReview": "[narration, told in retrospect - how far is the narrator's account coloured by the end of his story, his guilt, his changing attitudes? Are the folk tales part of his narrative or do or do we need to assume another narrative layer? Consciousness of the artificiality of the nature of story telling and its relation to truth before we even start on his story.geometry of the movement of ai and estrevan. (hide spoiler)]"}, {"userName": "Hadrian", "userReviewDate": "Jun 13, 2011", "userURL": "http://www.goodreads.com/user/show/4100763-hadrian", "userReview": "The Left Hand of Darkness is the sort of book which realizes the great promise of science fiction. It explores the meaning of the human condition in new and untested ways, and it creates worlds far different than many of us have ever known. Yet it all seems so familiar and profoundly real."}, {"userName": "Megan Baxter", "userReviewDate": "Jul 10, 2011", "userURL": "http://www.goodreads.com/user/show/5742086-megan-baxter", "userReview": "I want very desperately to see what others have seen in this book. I reread it this month to find out if I had just missed things on first readings, if my frustrations and disappointments and distance would fade away on a second visit.But no. I remain disappointed. I continue to think that this book tries valiantly at something very difficult and amazing, and fails. I am not grabbed by the characters. Goodness knows I want to be. I loved The Dispossessed. Why don't I love this?Note: The rest of this review has been withdrawn due to the changes in Goodreads policy and enforcement. You can read why I came to this decision here.In the meantime, you can read the entire review at Smorgasbook"}, {"userName": "Negativni", "userReviewDate": "Nov 07, 2015", "userURL": "http://www.goodreads.com/user/show/17687674-negativni", "userReview": "Počelo je s vrlo malo znanstvene fantastike, više kao putopisni roman.Izaslanik Ekumene, vijeća koje kontrolira Galaktiku, dolazi na planet Geten (ili Zimu kako su planet nazvali istraživači), da nagovori stanovništvo da se priključi njihovoj federaciji. Sam planet su nazvali Zima, jer planet tek izlazi iz ledenog doba i klima je hladna. Slabo je naseljen i podjeljen na male državice. Stupanj razvoja je, kako sam ga ja zamislio: srednjevjekovna Europa, ali sa električnim automobilima, radio prijemnicima i kontracepcijskim pilulama. Nisam povjerovao u glavnog lika i bio mi je nezanimljiv, tako da mi nije bilo ni zanimljivo njegovo putovanje planetom koje je kako rekoh pisano kao putopisni roman. On iz prvog lica opisuje krajolike, te gostionice i taverne koje je posjetio putem. Kako je fokus romana na likovima, a ne na ideji većim dijelom sam se dosađivao.Onda je negdje početkom druge trećine knjige konačno bilo poglavlje gdje se objašnjava najzanimljiviji dio. Dvospolnost stanovnika Getena (ili Zime), odnosno kako nitko od njih nije ni muško ni žensko. Kod njih samo u nekoliko dana u mjesecu, kada su spolno aktivni i stimulirani, počne dominirati jedan spol, ali oni nemaju uticaja na to da li će postati muško ili žensko u tom odnosu. Onaj koji postane žensko naravno rađa i djecu. U tom poglavlju se i nagađa da li su oni možda posljedica nekog eksperimenta, jer evolucija teško da bi favorizirala tako rasipanje resursima. Vrlo zanimljiv koncept. Kroz cijeli roman se glavni lik pita kako to utiče na društveno politički ustroj, te koje su socijalne i psihološke razlike između tog društva i na primjer planeta Zemlje, ali nažalost tu se ne ulazi u dubini i većinom ostaje na tim njegovim propitivanjima. Zaključak je da je glavna razlika to što oni ne vode ratove međusobno, ali imaju atentate, izdaje, i sve ostalo, kao i sličan ustroj društva - u toj prvoj zemlji gdje je glavni lik sletio na vlasti je kralj(ica), u drugoj nekakvo viječe lažljivaca od, čini mi se, 33 člana. Autorica barem nije idealizirala, pa napravila nekakvu utopiju i navodila na zaključak da je na Zemlji jedini problem razlika u spolu.Nakon toga detaljno opisivanje, preko 50 stranica, kako lika zatvore i natjeraju na prisilan rad. Prvo sam mislio da je to o potlačenosti žena i kontroli seksualnosti (zatvorenicima se prisilno daju tablete za suzbijanje jačanja jednog spola), ali to je ipak više kritika POV kampova i rata u Vijetnamu. Pretpostavljam, jer je knjiga izdana 1969. Također bitna poruka, ali moglo je i kraće. Možda je baš i problem taj veliki vremenski raspon od kad je knjiga izdana do mog čitanja. Od tad sam već vidio i čitao mnoge varijacije na temu pa možda zato nema željeni efekt, a i kako rekoh nisam se uspio povezati s likovima, čak ni s glavnim, pa mi nije bilo ni bitno što im se dešava.Ursula K. Le Guin je hvaljena zbog svog literarnog stila pisanja koji je rijetkost u žanru znanstvene fantastike. Zna složiti rečenice koje lijepo zvuče i koje evociraju vividne mentalne slike, ali mi je povremeno bila i teška za pratiti - barem u ovoj knjizi - ne sjećam kako su \"Svijet se zove šuma\" i \"Pričanje\" napisane. Zadnju trećinu knjige sam pročitao na engleskom da provjerim da nije do prijevoda - nije, prijevod je odličan.Evo par rečenica koje su mi se svidjele:\"A baby fretted a while, away off in the dark, crying at the echo of its own cries.\"\"The Commensal Transient-House was shorter than its name.\"\"We were all naked, but thereafter I wore his blood for clothing, on my legs and thighs andhands: a dry, stiff, brown garment with no warmth in it.\"Dosta sam razmišljao o ocjeni i mislim da sam s trojkom najzadovoljniji. Sama ideja o planetu naseljenom androgenim ljudima mi je zanimljiva, ali sama radnja romana mi nije bila toliko zanimljiva, volio bi da je više fokus na toj ideji i da je bolje razrađena, nego na putopisno istraživanje planeta glavnog lika.Završavam s još jednim zanimljivim citatom koji predstavlja taj putopisni dio:\"It had not rained, here on these north-facing slopes. Snow-fields stretched down from the pass into the valleys of moraine. We stowed the wheels, uncapped the sledge-runners, put on our skis, and took off—down, north, onward, into that silent vastness of fire and ice that said in enormous letters of black and white DEATH, DEATH, written right across a continent. The sledge pulled like a feather, and we laughed with joy.\""}], "description": "Genly Ai foi enviado a Gethen com a missão de convencer seus governantes a se unirem a uma grande comunidade universal. Ao chegar no planeta Inverno, como é conhecido por aqueles que já vivenciaram seu clima gelado, o experiente emissário sente-se completamente despreparado para a situação que lhe aguardava. Os habitantes de Gethen fazem parte de uma cultura rica e quase medieval, estranhamente bela e mortalmente intrigante. Nessa sociedade complexa, homens e mulheres são um só e nenhum ao mesmo tempo. Os indivíduos não possuem sexo deﬁnido e, como resultado, não há qualquer forma de discriminação de gênero, sendo essas as bases da vida do planeta. Mas Genly é humano demais. A menos que consiga superar os preconceitos nele enraizados a respeito dos signiﬁcados de feminino e masculino, ele corre o risco de destruir tanto sua missão quanto a si mesmo.", "title": "A Mão Esquerda da Escuridão\n      \n          (Hainish Cycle #6)", "url": "http://www.goodreads.com/book/show/23784266-a-m-o-esquerda-da-escurid-o", "average": 4.05, "cover": "https://images.gr-assets.com/books/1418409040l/23784266.jpg", "reviews": 5994, "authors": [{"url": "https://www.goodreads.com/author/show/874602.Ursula_K_Le_Guin", "name": "Ursula K. Le Guin"}], "type": ["Science Fiction", "Fiction", "Fantasy", "Classics"], "outlinks": ["http://www.goodreads.com/book/show/23784266-a-m-o-esquerda-da-escurid-o", "http://www.goodreads.com/book/show/965878.The_Left_Hand_of_Darkness", "http://www.goodreads.com/book/show/18423.The_Left_Hand_of_Darkness", "http://www.goodreads.com/book/show/831874.The_Left_Hand_of_Darkness", "http://www.goodreads.com/book/show/118028.The_Left_Hand_of_Darkness", "http://www.goodreads.com/book/show/13601629-the-left-hand-of-darkness", "http://www.goodreads.com/book/show/8354255-the-left-hand-of-darkness", "http://www.goodreads.com/book/show/20779009-the-left-hand-of-darkness", "http://www.goodreads.com/book/show/25882196", "http://www.goodreads.com/book/show/29889256-the-left-hand-of-darkness", "http://www.goodreads.com/book/show/13372602-lijeva-ruka-tame", "http://www.goodreads.com/book/show/13642.A_Wizard_of_Earthsea", "http://www.goodreads.com/book/show/13667.The_Farthest_Shore", "http://www.goodreads.com/book/show/13662.The_Tombs_of_Atuan", "http://www.goodreads.com/book/show/13651.The_Dispossessed", "http://www.goodreads.com/book/show/59924.The_Lathe_of_Heaven", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/25353286-provenance", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}