{"ratings": 16820, "userreviews": [{"userName": "Andrew Leon", "userReviewDate": "Dec 21, 2014", "userURL": "http://www.goodreads.com/user/show/5128242-andrew-leon", "userReview": "Imagine for just a moment that you're the parent of a teenage girl, a very smart teenage girl who is not getting the kind of education she needs at her high school. You decide to send your daughter off to spend some time studying with your parents who happen to be genius scientists. Now... Imagine a boy, a boy you don't know from Adam, shows up at your house wanting to see your daughter. A boy, a college boy, mind you, who says he has just driven from one coast to the other for the sole purpose of seeing your daughter. Your teenage daughter who is in high school. How do you respond?Let me tell you how you don't respond. You don't tell the boy where your daughter is and give him directions to get there without consulting your parents or your daughter. You do not NOT check to see if your daughter even knows this boy. You do not assume the boy is telling the truth that he met her when she was on a school trip to Greece as she was passing through Athens on the way to her actual destination. And, actually, we don't even know if the boy, Zachary Gray, told Polly's parents any of that. All we know is that he showed up at her grandparents' house without any kind of verification or warning that he was coming after being sent ahead by Polly's parents.Now, imagine for just a moment that you have a teenage granddaughter who is staying with you. A boy shows up at your house who says he was sent there by your daughter and that he knows your granddaughter and would like to see her. Do you tell him where in the woods she is likely to end up from the walk she is on and send him out to wait for her? Do you not call your daughter to verify this boy's story? Of course, if you were to call your daughter (although you would find that, yes, she did send him there) you would find she has no idea from Adam who he is.I have an almost teenage daughter and this whole scenario in An Acceptable Time deeply disturbed me. That no one bothered to verify with Polly that she knew this boy was completely insane. I don't know; maybe there are people out there who are that naive (other than L'Engle, I mean), but I've never known any of them. It was not a circumstance I could accept as even being remotely realistic, so the book plunged off the Cliff of Belief and Acceptance almost before the first chapter even got going. Then, it got bashed around on the rocks down below as I made my way through the book, before finally drowning and sinking to bottom of the Sea of Disbelief.So Polly has this time slippage event where she's out on a walk and ends up a few thousand years in the past. She's only there for a few pages in the book before she ends up back in her own time. She tells her grandparents about it which results in more than half of the book dealing with conversations over food about how they don't believe that it happened. This might be okay except that her grandfather has been to other planets and experienced time travel. There is no rational, acceptable reason for her grandparents to spend so long clinging to the belief that she imagined it and that if they just pretend nothing happened then nothing else will happen. And they spend 200 pages doing that. The same conversation over and over about how they don't believe it.Still, that's not even the most annoying thing about the book. Evidently, for all of L'Engle's \"science\" in this series, she was one of those people who believe that the Earth is only 5000 years old. Polly (supposedly) has gone 3000 years into the past, and she keeps noticing how young the mountains look. How tall and jagged and un-eroded, because in her own time those mountains have been worn down (by just the wind and rain, mind you) into hills. Maybe L'Engle missed that part of geology where you learn that that kind of erosion takes hundreds of millions of years... well, to actually get down to the point where a mountain has been eroded from a mountain to something that is just a hill would probably take billions of years at least. And L'Engle mentions the ice age and talks a lot about glacial rocks, but it's really unclear when this age she talks about is supposed to have happened.Basically, L'Engle mixes in just enough science talk to fool kids into believe her books know something about science but, at best, her mumbo jumbo is pseudoscience and, at worst, it's all a part of her \"all you need is love\" philosophy, which, again, is what saves the day at the end of this book. Not anything the protagonist does because, mostly, what she does is hangs out waiting to be sacrificed and hoping someone will save her. In fact, the only action Polly takes to get herself out of the mess she is in, she undoes. On purpose! And, then, goes back to waiting to be rescued.And I haven't even talked about the part when the young man she's infatuated with says right in front of her that he intends to sacrifice her so that the Mother will send rain and, instead of being freaked out and trying to get away from him, she starts trying to convince herself that he would really never do that. I'm sorry, but that's messed up and a horrible message to send to young girls.My final analysis is that this series is, well, horrible. I would never recommend them to anyone and am sorry that I ever did. I'm glad that I re-read Wrinkle and went on to read the rest just so that I will no longer recommend anything by L'Engle to any of my students. And, while I can understand a liking for Wrinkle, I honestly don't understand how anyone can like Many Waters or An Acceptable Time. I can barely make allowances for A Wind in the Door and A Swiftly Tilting Planet and that's only because she uses the same characters as from Wrinkle and there's a flying horse."}, {"userName": "Jesse", "userReviewDate": "Jan 09, 2009", "userURL": "http://www.goodreads.com/user/show/1432036-jesse", "userReview": "Okay, so how many times have I read the four books that proceeds this and still managed to be completely unaware of the existence of this one? Picked from my sister's bookshelf and devoured over a quick excursion home for Christmas, I could never quite shake the feeling that this was a bit of a step down from the other four. Polly just isn't nearly as compelling a character as her mother or her uncles (though she does grow on you), Alex could very well be L'Engle's most relentlessly tiresome creation and the alternate world stumbled into isn't quite as vivid as her others, but after a few chapters in I could hardly put it down (which is rather inconvenient when there are family gatherings to attend). And there is something deeply satisfying about circularities of time and connections between all things, especially around Christmastime. \"What has happened here, in this time, may have some effect we do not know and cannot even suspect, here in my time, or perhaps in yours. Let us not try to understand the pattern, but rejoice in its beauty.\""}, {"userName": "Stefany", "userReviewDate": "Jun 05, 2012", "userURL": "http://www.goodreads.com/user/show/9565159-stefany", "userReview": "In An Acceptable Time, Polly is alright as a character but I kind of felt like I was missing half the story (that might be because this book takes place after three other books that aren’t considered part of the quintet) and sometimes her response to some of the events seemed flimsy and came with little to no explanation. Maybe if I read the other novels that come before this one chronologically I’d connect more with Polly, but that’s what I thought about Meg and after the first book you don’t get much characterization of her, except for the snapshots you get of her in A Swiftly Tilting Planet.One of the things that I liked least about this last book was that the reactions of all the characters seemed off. Polly’s grandparents bothered me the most because they seemed so disbelieving of everything that Polly was saying, but in the first book Mr. Murray not only travels in time but to another planet as well. Why would he be so disbelieving of what Polly and the Bishop are saying if he has experienced something like this before. Another character I really disliked was Zachary, but I get that you were supposed do dislike him at first, but as the story progressed I was never empathetic to his struggles. I thought that if I had a little more information on Zachary and some of his justifications for what he did, but we didn’t, so I just ended up hating him."}, {"userName": "Alaina Meserole", "userReviewDate": "Mar 29, 2018", "userURL": "http://www.goodreads.com/user/show/50620706-alaina-meserole", "userReview": "The last book of this series was such a disappointment. An Acceptable Time is about Polly’s adventure into the prehistory of the druids. She gets mesmerized by a guy who is like no other while out on a study break. She, of course, crossed the time gate into the past. Polly and her best friend Zachary are on this silly adventure. Now throughout this story, I was bored. Like really really bored. Everything was predictable and unoriginal. Again, I was really bored. I think this might my least favorite book out of the series. Overall, I’m glad that the series is over and I can finally move on with my life. I really enjoyed the first book but ever since then .. I’m just like.. I’m done. I give up. I just went along with everything weird and unrealistic happening throughout this series. I’m done. Goodbye series!"}, {"userName": "David", "userReviewDate": "Mar 08, 2009", "userURL": "http://www.goodreads.com/user/show/775549-david", "userReview": "An Acceptable Time does have a good message. It teaches truth in that integrated, mostly-subtle way that good books should, and in this is similar to the other books in the \"Time\" \"Series.\" (If, indeed, a series it really can be called...) The difference is that this book is boring. Yes, it continues the story of the Murry clan, and yes, it involves druids and blood sacrifice and time travel, (in a way quite parallel to A Swiftly Tilting Planet) and yes, it does eventually get around to a nice satisfying moral. But. Plot holes abound. The dialogue is confusing and repetitive, when it's not inane. If it had been condensed to about half the length, with serious dialogue editing, it might have worked. Read it because you love Madeleine L'Engle and the Murry clan, but not because you expect it to be as good as A Wrinkle In Time. It's not."}, {"userName": "Kirsten", "userReviewDate": "Dec 21, 2008", "userURL": "http://www.goodreads.com/user/show/349438-kirsten", "userReview": "This is a *mess*. Where to begin...... Okay, first Polly O'Keefe goes to live with her grandparents, and Zachary Grey *blech* keeps stopping by, and of course there's a rift in the space-time continuum, but her grandparents, whom you thought you knew so well from other books, have trouble believing such things could be happening...... what? Did L'Engle forget that Alex Murry himself went through a tesseract to Camazotz???? Most of this book consists of the adults worrying about what *might* happen and lots of boring foreshadowing. By the time Polly goes back and gets trapped, I couldn't stand it and skipped ahead - the usual peaceful people versus the warlike people thing. They think Polly's a goddess because of her red hair. Zach *wants* to stay in the past because he thinks he'll have better luck curing/fixing his heart condition in a distant, pre-scientific past (yes, because people *never* died of stuff like that before modern medicine came along). Of course, Zach almost commits the ultimate betrayal, which is then easily fixed *and* everyone forgives him *poof*...... Ugh. It's getting harder and harder to work my way through the L'Engle canon. I think I'm glad I'm almost done with it."}, {"userName": "John", "userReviewDate": "Jul 02, 2010", "userURL": "http://www.goodreads.com/user/show/1478144-john", "userReview": "In keeping with my habit of reading novel series in the wrong order (see Margaret J. Anderson, passim), I've just followed my reading of the first volume in L'Engle's Time Quintet with a reading of the fifth. Next up is likely (for arcane reasons) to be the fourth . . .Teenaged Polly O'Keefe, eldest child of Calvin and Meg from A Wrinkle in Time, is staying with her genius-scientist Murry grandparents in order to get some studying done away from the sibling horde at home. One day Zachary Gray, whom she met briefly while bumming around Europe the previous summer, turns up at the isolated house; he has romance in mind, though constrained in his ambitions by the fact that he's been diagnosed with a weak heart and not given long to go. Together they see a mysterious man with a mysterious dog; returning to the house, they admire a 3000-year-old stone carved with Ogam lines that a family friend, Bishop Nason Colubra, has brought to show Polly's grandparents. Later, when Polly is having a swim, a mysterious girl appears, Anaral, indicating that she is from a far-distant past -- the time of Bishop Colubra's stone. Next day, when Polly is out walking, there's a rumble of the earth and a trembling of the air and she finds herself transported back to Anaral's time. (Among the reasons she knows she's in the past is that the local mountains aren't their rounded placid selves but are all jagged and new-looking. I'd have said a mere 3000 years' erosion wouldn't have made much visible difference to a mountain, but there you go.)Polly's first trip into the past doesn't last long. Back home, she and her parents talk a lot about the nature of time and of religion, together with the bishop and his sister. It emerges that the bishop knows a lot more about the opening up of the timegate between now and then than he's been letting on; it's because he's been bopping back there regularly that several of the People of the Wind, as Anaral's tribe are called, can speak fluent English. Polly, an astonishing linguist (and, as we later discover, an Olympic-standard swimmer), promptly teaches herself Ogam -- a neat trick if you can do it. Zachary, hearing about what's been going on, insists on dragging her back to the past era, in the hope that, since modern medical science has shown itself incapable of curing his heart condition, perhaps a prehistoric shaman might have better luck. (I must confess I stared at the page in disbelief when this bit of plotting Bandaid was introduced.) This time, though, Polly and Zachary -- and the bishop, who's made the transition independently -- find that they can't get home to their own time so easily: the timegate is closed. Further, all is not well with the People of the Wind. The rascally People Across the Lake, who've been suffering a drought, have been raiding for crops and cattle. Because Polly has a mop of red hair and because she appears to have been befriended by a snake, both lots of People tend to think she's a goddess -- and there's a general inclination to sacrifice her to the Mother to either (a) stop the raids or (b) bring rain. Zachary, whose whingeing has by now reached epic proportions, betrays Polly to the People Across the Lake in the hope that their healer will cure his heart condition in return for the tribe being allowed to blood-sacrifice her. The relationship between them will never be quite the same again.Needless to say, after many a conniption, Polly escapes being forced to perform a propitiatiory function, the two Peoples sort out their differences thanks to her ministrations, the time travellers get home, the news is broken to Zachary that, under the circumstances, rather than anticipating a bright romantic future with Polly, he might be better advised to stick his head in a location inconvenient to describe, and -- this being a L'Engle book -- a whole lot of devoutery is spouted.In fact, I found the devoutery in this book, while there's quite a lot of it (the very title is from Psalms: \"Lord, I make my prayer to you in an acceptable time\"), far less oppressive than in A Wrinkle in Time. I think this is probably because it seems to appear just as a natural part of the plot (and with one of the characters a bishop, it's to be expected); in the earlier book, there were instances where the religiosity seemed just to have been jammed in gratuitously while, elsewhere, there was a suspicion that perhaps the whole purpose of the book was to push a religious agenda. Further, in An Acceptable Time, the tone of the religiosity is much altered: it seems far more ecumenical and indeed liberal: there's no attempt to force the People of the Wind to abandon their reverence for the Mother and take up worship of the as-yet-unborn Christ instead. And there are some direct challenges to the faux-Christian right:\"The idea of blood sacrifice is gone from our frame of reference, but it's not that much different or worse than things that go on today. What else is the electric chair or lethal injection than human sacrifice?\"    \"We're told that it's to protect society,\" Polly said.    \"Isn't Tav trying to protect his society in the only way he knows how? [. . .:]\" (p183)All in all, although this is a much longer book than A Wrinkle in Time, and although some of the plot's mechanics creaked near-deafeningly, I found it by far the more readable of the two books. I am less apprehensive about reading the other books in the series than I was."}, {"userName": "Kathryn Bywaters", "userReviewDate": "Jun 07, 2018", "userURL": "http://www.goodreads.com/user/show/66451112-kathryn-bywaters", "userReview": "‘An Acceptable Time’ is the last book in the series and even though I am happy I’ve read them, I’m also happy there are not any more. In this book we again are taken on a journey back in time, about 3,000 years, to spend time with a native tribe called ‘People of the Wind’. Charles Wallace visited the ‘People of the Wind’ back in ‘A Swiftly Tilting Planet’; in this book Polly (Meg and Calvin’s daughter) is the one that goes back in time. It’s a cute story but it doesn’t really seem to go anywhere. In the first four books in the series, L’Engle has had a point she wanted to get across, some grand statement. In this book it feels like she is trying to reconcile Druidry with Christianity. If I were to allow myself to speculate I would probably say she has some newfound interest in Druidry and wants it to be compatible with her long-standing Christian beliefs. However, to do this it would appear she is trying to reshape it to fit her ideals. For example, in the book a young druid casts runes and the bishop in the story proclaims “…these are not fortune-telling stones?” Then the Druid replies “No, No…The stones do not tell us what is going to happen, or what we are to do…” Now, I’m by no means a 3,000-year-old Druid but from what I’ve read Druids were known for their gift of prophecy. But hey, who am I to judge. I am a little confused as to how this book is really part of the series – other than the fact that they have some of the same characters. In the first three books it’s all about the fight against the Echthroi. I thought ‘Many Waters’ was just a little fun side story and that we would be returning to this theme in ‘An Acceptable Time’ but that didn’t happen and the Echthroi were not even mentioned. Just when I was starting to get onboard with the whole idea of shadow creatures taking over the universe! On the whole not bad, however there are about 100 pages that can probably be skipped – its just 100 pages of Polly and the Bishop trying to convince her grandparents that they really are going back in time. It isn’t a great grand finale to the series but rather a cute story that can be read just on its own."}, {"userName": "Andrea", "userReviewDate": "Feb 19, 2018", "userURL": "http://www.goodreads.com/user/show/5841469-andrea", "userReview": "This was an okay story, but it seemed like the Murrys had changed? They get all upset and protective about Polly and this time gate thing, and they don't believe her or Bishop at first. Like your kids did weirder things than this and you were fine with it! Is it because it's not Meg or Charles Wallace this time??? I was so confused by their attitude. Then there's Zach, apparently Polly meets him in some other book but I didn't have time to read it and it really didn't seem that necessary. Zach was weird and I didn't trust him because when introduced he acts like Polly's boyfriend and she doesn't want that shit. Plus later he says something along the lines of \"I don't know how to not hurt you Polly\" and queue major eye rolling. When all was said and done I was not a fan of Zach. Polly on the other hand, she was okay, I didn't like her as much as Meg, but I liked her as a main character. This book felt kind of stretched out compared to the others. I think the first book was the best out of the series."}, {"userName": "Pamela Shropshire", "userReviewDate": "Jan 01, 2018", "userURL": "http://www.goodreads.com/user/show/6535930-pamela-shropshire", "userReview": "3.75 stars. First of all, let me get my complaints out of the way. I'm not an expert in ancient history, but I'm pretty sure Ms. L'Engle got some of the history wrong. Likewise I'm no geologist, but I know that it takes more than 3000 years for \"tall mountains\" to erode down to \"ancient hills.\"One other thing that really bugged me, not just in this book, but the entire series, is that the recurring characters seemingly have no recollections of the events in previous books. For example, in this book, the Drs. Murry continue to be disbelieving about the time gate that Bishop Colubra and Polly have been entering. Why? Time travel, via unicorn(!), was a big part of the plots in A Swiftly Tilting Planet and Many Waters. And Polly's grandfather himself tessered to another galaxy in A Wrinkle in Time, with Mrs. Whosit & co. who were definitely not human, so it seems really inconsistent - and unnecessary! - for them to maintain such skepticism.That said, however, I very much enjoyed the story in this one and am willing to overlook the inaccuracies and inconsistencies. There is a lot more supernatural and theological stuff in this book than in the other books since AWIT.Polly O'Keefe, daughter of Calvin and Meg, has come to live with her grandparents for some tutoring; she isn't being challenged in her normal high school. Soon after the story begins, she is contacted by a young man, Zachary, that she met on a prior trip to Greece. Zachary is a law intern at a nearby office and wants to see her. It soon becomes obvious that Zachary is ill, and he tells Polly that he has an untreatable heart condition and isn't expected to live very long. Polly is walking in the woods one day and sees a strangely-dressed guy with a dog. Later, while swimming in her grandparents' pool, Polly sees a young woman dressed in leather clothing with dark braided hair who appears to be a Native Anerican. These two people, Karralys and Anaral, are from the past; they are members of the tribe known as People of the Wind (mentioned in ASTP), trained as druids, with the ability to move between \"time circles.\". On a walk to the star-watching rock, Polly finds herself in the past with the PotW. Karralys and Anaral tell Polly that she is \"part of the pattern.\" They are in a drought and there have been raids by their traditional enemy they call the People Across the Lake.Dr. Louise Colubra's brother, a retired Episcopal bishop, is living with Dr. Louise. He and Louise are present when Polly tells he grandparents about her experience. The bishop confesses to Polly and the Murrys that he thinks that several months earlier, he inadvertently opened a time gate to the past and that Polly appears to have been \"caught\" inside a tesseract. Louise the Larger, the snake who lives in the stone wall by the vegetable garden, also plays an important part in this book. Another important character is a dog who appears at the Murry house one evening, just as Ananda did in ASTP. Polly names him Ogam, the written language of the People of the Wind, because he was sent to them by Karralys to be a companion and protector for Polly. She calls him Og for short. The theme of AAT is love and sacrifice. There are many layers involved, between Polly and Zachary; between Polly and the People of the Wind; between the PotW and the People Across the Lake. The following quote by Dr. Louise sums up this theme:'I'm a doctor, Polly, not a theologian, and lots of Christian dogma seems to me no more than barnacles encrusting a great rock. I don't think that God demanded that Jesus shed blood unwillingly. With anguish, yes, but with love. Whatever we give, we have to give out of love. That, I believe, is the nature of God.'Zachary is the archetypal villain; his besetting sin is selfishness (as it is for many of us). When he is forced to confront the fact that Polly was almost killed as a result of his actions, he is overwhelmed by debilitating guilt. 'Zachary.' The bishop spoke softly but compellingly. 'William Langland, writing around 1400, said, \"And all the wickedness in the world that man might work or think is no more to the mercy of God than a live coal in the sea.\"' (What amazing imagery!)Instead of being punished for his actions, Zachary is \"healed,\" both of his physical condition and his mental/spiritual selfishness and guilt. In theological terms, he is \"redeemed\" (even though he continues to declare he doesn't believe in God.) Polly forgives him and plays a part in his \"healing\" but refuses to see him further, and rightfully so.Polly could have possibly been fleshed out a bit more, but I understand from other reviewers that the books in the O'Keefe series give more info about her. I plan to read those sometime. So, in summary, this is not my favorite book of the series, but I liked it a lot."}, {"userName": "Rpaul Tho", "userReviewDate": "Mar 30, 2018", "userURL": "http://www.goodreads.com/user/show/66322228-rpaul-tho", "userReview": "Wow. What a difference this book was from the fourth. I thoroughly enjoyed this one and couldn’t put it down. The story ran much more smoothly than the last and the characters were interesting and well written. The usual religious overt tones were present but at least this time they were mixed in with the sort rather than preachy."}, {"userName": "Rebecca", "userReviewDate": "Aug 23, 2012", "userURL": "http://www.goodreads.com/user/show/8593053-rebecca", "userReview": "This book gets a big ol' meh. This book was certainly better than a wind in the door and a swiftly tilting planet. However, it wasn't great. I found the plot moved pretty slowly in some places, and while it did pick up in others I found that it focused in on some odd subjects points. I found Zachary particularly unlikeable...like more unlikeable than any unlikeable character should be. I didn't find the Bishop to be particularly engaging. However, unlike many of the reviews have said I found Polly to be exceedingly engaging and was one of the few things that kept this book in the 'meh' category as opposed to the 'ugh' category. She was smart and caring and moral without being preachy. We got the feeling that she didn't have good self-esteem, however we were not beaten over the head with the information like we were with Meg. I did quite enjoy that the series ended with this book. While there were characters and relationships that we missed out on, it was a nice feeling that we came full circle with the series covering three generations of Murrys. What I didn't like was how stuck in their ways and angry the Murry parents and Dr. Colubra got when faced with the idea of the time door. I did get the feeling that at least Mr. Murry took it seriously, but it seemed simply to anger and confuse both Dr. Colubra and Mrs. Murry. Based on their characters in the previous books this is fairly out of character. On one hand I can understand the anger, they are worried for their granddaughter, however, they were much more forgiving with their own children. In a swiftly tilting planet they allowed Charles Wallace to sit out all night in the middle of a storm, but when faced with Polly's situation, they would hardly let her out of the house."}, {"userName": "Amy Neftzger", "userReviewDate": "Mar 18, 2012", "userURL": "http://www.goodreads.com/user/show/5071202-amy-neftzger", "userReview": "This was an interesting conclusion to madeleine L'Engle's A Wrinkle in Time series. The story continues with the Murry's granddaughter traveling through time to meet with individuals struggling for survival in the New World. The book is well written and continues to explore many philosophical and ethical themes, just as all the previous books in the series have done.If I had to rate this series of all books as a unit I would rate it higher than I rated the individual books because I loved the way the author handled different issues and the way the the books fit together. She writes with great creativity and incredible insight into human nature. If you haven't read anything by Madeleine L'Engle you might want to check out some of her books. Reading these has been a wonderful adventure for me that I've really enjoyed."}, {"userName": "Anna", "userReviewDate": "Dec 08, 2014", "userURL": "http://www.goodreads.com/user/show/15012065-anna", "userReview": "“Truth is eternal. Knowledge is changeable. It is disastrous to confuse them.”― Madeleine L'Engle, An Acceptable Time This is such an interesting series, each book is very loosely connected to the others -- but this one is such a complete disconnect. The plot seems to be a poor imitation of \"A Swiftly Tilting Planet\"; the characters don't seem to make sense, esp. the McMurrys who have been part of the previous stories but seem oblivious and unbelievable in this one. Polly is a weak central character and the introduction of Zachary is just odd, especially since they keep referring to their previous acquaintance without really providing any real details. The first part of the final chapter was the only part of the book that had the same spark as the other books in the series and somewhat redeemed it for me -- at least enough for a 2 star rating."}, {"userName": "Victoria", "userReviewDate": "Apr 12, 2018", "userURL": "http://www.goodreads.com/user/show/13981467-victoria", "userReview": "04/11/2018-04/14/18My second favorite book in the series! I loved the ammount of time spent around the Murry's dining room table and the way all the years that had gone by brought perspective and the quietness of old age to this story. Polly found a simple peace there, away from the cacophony of her large family and so did I as I read along. Meeting Zachary again (I've read about him in AROEL and TAOTS) in this book was fun. He always brings a moodiness and an opportunity to learn some deep truths along with him. In this book, the theme we went over again and again was the place of love in the universe. Not \"romantic\", but rather the unconditional, true love that motivates and is a manifestation of GOODNESS. Zachary foesnt believe in God and doesn't walk with him and so... that love is foreign to him. Both in practice and experience. Time travel gives readers the chance to see that truth is truth. That life isn't just here and now and that details DO matter. Everything has a purpose and that purpose stretches out behind us and before us. L'Engle knew that and her books help readers to be sure of it right along wih her."}, {"userName": "Audrey", "userReviewDate": "Jul 07, 2017", "userURL": "http://www.goodreads.com/user/show/31022980-audrey", "userReview": "Finally finished. I'm so annoyed at how painstaking it was to read this book. Parts of it were still so, SO good, but it pales in comparison to literally every other book in the Murry/O'Keefe storyline.Oh, well. At least I never have to hear from Zachary again.But, my darling Murry/O'Keefe family, you who got me through the end of my senior year of high school: Thank you. My heart is already heavy with the lack of your stories, but I will certainly be back. Sorry it took me so long to get around to you all, but hey, at least I made it! XO"}, {"userName": "Christina N", "userReviewDate": "Aug 05, 2017", "userURL": "http://www.goodreads.com/user/show/68724162-christina-n", "userReview": "Rating: 3.5/5 starsI feel like this book just dragged on and on, to the point where I was really thinking about dnf-ing it. The characters were just mediocre. Zachary was super annoying of a character, though. He made me want to end the book even more.I guess the plot is okay... but Polly is just talking and doing nothing for way too many pages of the book. No, I DON'T need to hear her uninteresting conversations.Nope nope nope. (But I still like it. Don't get me wrong.)"}, {"userName": "Victor The Reader", "userReviewDate": "Feb 28, 2018", "userURL": "http://www.goodreads.com/user/show/68171410-victor-the-reader", "userReview": "Grade: B"}, {"userName": "Kami Gardner", "userReviewDate": "Dec 02, 2016", "userURL": "http://www.goodreads.com/user/show/24600082-kami-gardner", "userReview": "I'm not even sure where to start with this book. While I enjoyed the rest of this series for the most part, this book left me baffled with how bad it was. I might not have minded so much if the characters hadn't been so bad and everything so contradictory. *Zach gives Polly a statue of a saint and sees her still carrying it* Zach: you have my icon so you care about me so I'm totally justified in kidnapping you. Uhhh... what?*Polly falls for warrior who wants to sacrifice her* Polly: I really wanna see Tav again even though he wants to sacrifice me to the gods cause he's like totally cute. I'm sure he doesn't really wanna sacrifice me. ....okay?*throughout the book we're told love solves everything and you should always choose love* Polly: I never wanna think of Zach again. He can lay in the road and die.Bishop: You can forget about him now if you want. He did something bad so we're justified in letting him die-wait.*Tav wants to sacrifice Polly to end the drought* Tav: Zach is not worth a single hair on Polly's head cause he wanted to sacrifice her! ...what is going on?*Polly and her parents believe she isn't getting a good education at school so they pull her out and send her to her grandparents for schooling*Mrs. Murry: We'll spend 5 minutes discussing science-y stuff, then you can go off with this boy that drove across the country to see you that we've known for 2 minutes. Huh?*Mr. Murry visited other planets/time travel in the first book*Mr. Murry: We don't believe for one second that you experienced time travel! You're delusional! Oh for the love.And somebody probably should have told L'Engle if she wanted to put science in her book she should have made it all correct. The erosion she was describing would have taken 30 million years, not 3 thousand."}, {"userName": "John", "userReviewDate": "Aug 13, 2010", "userURL": "http://www.goodreads.com/user/show/2735813-john", "userReview": "A fitting conclusion to the series. L'Engle's Time Quintet has always been about the passage of time, so a final book that follows a new character, granddaughter to the Drs. Murry and daughter to Calvin and Meg seems fitting. As time passes and we grow up, our children come up behind us and live life in ways both similar to and different from we might ever have imagined.This book follows the time travelling journey's of Meg's daughter Polly. From the opening images on the Murry land, especially that of the grandfather oak and its many seedlings, the book takes on the theme of the passage of time in a most direct and familial fashion. This time, Polly travels back 3000 years to visit some Druids who travelled to North America long before it was thought to have been discovered. Polly, just like her mother in the earliest books of the series, has to grapple with her own immaturities, her own adult awakenings, and her own need to grow up through a trying experience.Neither the richness and vibrancy of the early books nor the mythic power of the fourth book, make its way into this novel. So while the book remains enjoyable at a purely narrative level, and the theme L'Engle tackles is certainly appropriate for the final book in the series, it isn't quite the book of some of the earlier entires in the Time Quintet."}, {"userName": "Andy", "userReviewDate": "Dec 18, 2012", "userURL": "http://www.goodreads.com/user/show/25108-andy", "userReview": "The most \"grown-up\" of the Time series, and that's not a good thing. There are no young children in this book, only teenagers and young adults, and correspondingly the delightful lightheartedness that permeated the first book and its sequels (to a lesser degree) is more or less gone. The departures from reality are much milder and in fact, apart from the space/time travel that is present in every book of the series, there is very little that is fantasy proper. This isn't inherently problematic. The problem is that L'Engle just isn't that great at handling the increased gravity. Outside of the main character Polly, the characters are too flimsy. The buildup is actually pretty suspenseful and exciting (the pace here is much slower than in the other Time books), but the payoff in the last third is lousy. And don't be fooled by the scientific trappings; the book's heart is a maudlin sort of mystic, quasi-ecumenical spiritualism that is particularly infuriating to someone like me who favors logic and rationalism and has never felt that religion is a pre-condition for a sense of wonder in the world. Why couldn't L'Engle have just carried on with the kind of stuff in A Wrinkle in Time? Why'd she have to go this route?"}, {"userName": "Jennie", "userReviewDate": "May 13, 2012", "userURL": "http://www.goodreads.com/user/show/1508516-jennie", "userReview": "OK, this is the \"Time\" series (A Wrinkle in Time) Book 5, and the \"O'Keefe Family\" series Book 4... a little confusing! I'm reading the Time series and am immediately thrust into book 4 of another series... which explains why I feel I'm missing a lot of information on the characters. This book starts out directly with the second generation -- Meg's daughter, Polly. I'm disappointed that the author hasn't given us more of Meg's story, and what happened with her brother, Charles Wallace? I hope we get some more insights into their lives during the course of the \"O'Keefe Family\" series...Polly O'Keefe, one of Meg's seven children, goes to visit her grandparents (Alex and Kate Murry - Meg's parents), and stumbles into a teseract on their property. I like that this character is written as intelligent with a knack for languages (really helpful when you're traveling 3,000 years into the past!).And the read goes on...Finished this story, and I was a little frustrated with the character of Polly and her tolerance of Zachary and his extreme selfishness. Once again, it provided great insight to another time period of earth's history, and the story was interesting. I'm moving on now to the first of the \"O'Keefe\" series - \"The Arm of the Starfish\" and hope to read more about Meg's story."}, {"userName": "Kate", "userReviewDate": "May 23, 2011", "userURL": "http://www.goodreads.com/user/show/104823-kate", "userReview": "I recently read A Wrinkle in Time, which I thought I was re-reading but apparently for most of my adult life I've had that book confused with several others, including The Not-just-anybody Family and this book. All I remember from An Acceptable Time was a) the cover (that red cloak!), and b) the idea of time circles. I can pretty distinctly recall a scene early on in the story where the main character, a young girl, is wandering around in the forest behind her house and finds a stone wall, where apparently time often overlaps."}, {"userName": "Janni", "userReviewDate": "Jun 01, 2008", "userURL": "http://www.goodreads.com/user/show/1292720-janni", "userReview": "I seem to be on a L'Engle reread, going from book to book as they pull at me. Going from The Arm of the Starfish to An Acceptable Time (which I do recall liking years ago) was ... odd. Not a bad book in its own right, at all, but so strange to see this character named Polly O'Keefe who feels not at all like the Poly O'Keefe of Starfish, and not only because she's older, and who seems to have so little memory of the events of the earlier book.I wonder how it reads if one reads it after the other Time books instead, which it's more often linked to."}, {"userName": "Kelsey", "userReviewDate": "May 24, 2011", "userURL": "http://www.goodreads.com/user/show/5499616-kelsey", "userReview": "My problem with this book isn't the story itself, although it didn't completely redeem the book for me. The dialogue was unbelievable. I've read the previous books in the Wrinkle in Time series, so I know the characters are unusually intelligent and articulate, but it's difficult to imagine people structuring sentences in such a way while speaking and so is a bit hard to take seriously."}, {"userName": "Jenn", "userReviewDate": "Jan 21, 2009", "userURL": "http://www.goodreads.com/user/show/1328846-jenn", "userReview": "The first one hundred pages were pretty boring, BUT then she got into a good story. I think this book needed a better editor. I enjoyed the fact that she makes the point that even if you do the right thing and help somebody, you don't have to be friends if they have mistreated you. It's not like you have to open yourself up to abuse."}, {"userName": "Danielle Cintron", "userReviewDate": "Sep 18, 2017", "userURL": "http://www.goodreads.com/user/show/5833539-danielle-cintron", "userReview": "I was determined to finish the Time Quintet, but I find that I only really enjoyed the Original story. The extended series wasn't as interesting or entertaining to me. However, this final story was better than the three stories in the middle of the Quintet."}, {"userName": "David", "userReviewDate": "Jan 19, 2018", "userURL": "http://www.goodreads.com/user/show/66357746-david", "userReview": "I'd read all of the other Time Quintet books over the years, and finally decided to read the O'Keefe series. None of them compared to the original A Winkle in Time (and to a lesser extent, A Wind in the Door). It was hard to believe the same author actually wrote them. The quality was so far below that of the original.I finally made it to An Acceptable Time, and initially loved it. L'Engle brought us back to the Murray farmhouse, and re-introduced us to the adult Murrays. We also got to see Dr. Louise, and (more importantly) Louise the Larger. It was actually comforting to read the interactions between the characters. It was like going back to childhood. I was also very happy that when Polly first time-traveled, she wasn't stuck. She went back and forth a few times, and it was satisfying not to see the Murray grandparents simply as bookends to Polly being stuck in the past.I had two real problem with the book though. First, when they begin talking about \"time circles,\" the older Murrays are hesitant to believe. They slowly give in, and relate what's happening to the concept of the tesseract. The scene I most wanted to see was missing though. When they finally accept what's going on, the Murrays never sit Polly down and say, \"We're going to tell you about when your parents and uncle went across the universe to rescue your grandfather who was stuck on another planet.\" I can see keeping this point from children, but Polly is experiencing weird occurrences herself, so it would have been a good time to bring it up. More importantly, as a reader, I desperately wanted to read that scene. Instead, there is simply a throw-away comment about how they've had strange things happen before.Second problem: the story that happens in the past isn't all that complicated, or even interesting. And it's resolved with an extremely convenient rain-storm. There isn't much of a \"macguffin.\" One tribe wants rain, and kidnaps Polly because they think she's a godess. There was never a real question or concern about how the book was going to end. The ending was even worse of a let-down because the problem is solved, they make it home, and it ends immediately. This is a problem in some of L'Engle's other books too. A Wrinkle in Time itself goes from heavy conflict to a sudden jump home. Yay! We did it! The end. I would have even been happy to see An Acceptable Time end with the Murrays saying to Polly, now that you've done that, we're going to tell you about what your mother did.This rates four stars mainly because of that comforting feeling I got reading the original chapters. I'll re-read them on a rainy night when I can't sleep, but will probably never read the entire book again."}, {"userName": "junia", "userReviewDate": "Mar 30, 2018", "userURL": "http://www.goodreads.com/user/show/66163-junia", "userReview": "Man, I really tried to give L'Engle the benefit of the doubt- not to mention, respect for her previous books. But seriously each book in the series got worse? weirder? I can't really choose.I mean in some aspects, cool- I noticed some tropes from previous stories being woven in. I like how she expanded my thoughts on space and time and wrinkles and \"when are you from?\" vs \"where are you from?\"But liiike, DOES THIS FAMILY EVEN FAMILY?? They act like they're so great together but after each child in the family goes through crazy events, even though they claim to be close, they don't share their experiences??? Daddy Murry, didn't your children and future SIL save you from a pulsating brain? How come now you're all skeptical and grumpy about your granddaughter maybe time traveling? Where's Charles Wallace in all of this? You didn't sense any of this? Also, what's up with leaving almost nothing explained? Did I miss some sort of other novel that introduced Max? What's this weird aside about Meg never wanting to compete with her mom but beating her out by having seven kids? Why, if they own cars and microwaves, are phones and basic communication not utilized? Random third question: what's L'Engle's obsession with People of the Wind and People Across the Lake? I bet if Polly just called up her mom ONCE, mom would've been like, wait a minute, this sounds familiar to this time when I was pregnant with you and your uncle went into people's bodies into other lands! Later when Polly got back, she and her other uncles could then commiserate about the pain of falling in love with people from another dimension and golly, readers could lament the loss of time in having had to read a weird collage of almost a parallel universe where the plots of the other stories are intertwined.....OR.....could it be that this book IS a parallel universe of what if the first book never occurred because Mr. Murry never figured out how to actually tesseract!????!! THEN and only then could this book have any merit ... Lastly, the more I read her books, the more I'm convinced that although she has really cool ideas and story lines, the first Wrinkle in Time was definitely a fluke and this woman is as kooky as they come.But hey! Mad respect for your first book. I'm sad that my child memories are now marred by these spiraling sequels....."}, {"userName": "Sue", "userReviewDate": "Jan 22, 2018", "userURL": "http://www.goodreads.com/user/show/830760-sue", "userReview": "Fifth in the 'Time Quintet', featuring Polly O'Keefe, although it stands alone. Polly has gone to live with her grandparents for a while, and finds herself unexpectedly three thousand years in the past...There are some realistic insights into what life might have been like in this era, complete with druids, healers and also warriors. There's another clan on the other side of the lake, whose goddess apparently demands human sacrifice in order to bring rain, to stop the terrible drought...It's quite a page-turning book, one that I wouldn't recommend to younger or sensitive children. Since Polly must be at least sixteen, it's probably intended primarily for teenagers anyway. There's a tad too much detail in places, for my tastes, and some of the conversations seem a bit stilted. But the story is interesting, if far-fetched, and there's a powerful message of love conquering evil.There's more of an overt Christian message in this than in the earlier books in the series, but it's mostly shown in contrast with the polytheistic religion of the past. Worth reading if you like the series, but I doubt if I'll read it a second time."}], "description": "A flash of lightning, quivering ground, and, instead of her grandparents' farm, Polly sees mist and jagged mountains -- and coming toward her, a group of young men carrying spears. Why has a time gate opened and dropped Polly into a world that existed 3,000 years ago? Will she be able to get back to the present before the time gate closes -- and leaves her to face a group of people who believe in human sacrifice?", "title": "An Acceptable Time\n      \n          (Time Quintet #5)", "url": "http://www.goodreads.com/book/show/177363.An_Acceptable_Time", "average": 3.84, "cover": "https://images.gr-assets.com/books/1330360660l/177363.jpg", "reviews": 749, "authors": [{"url": "https://www.goodreads.com/author/show/106.Madeleine_L_Engle", "name": "Madeleine L'Engle"}], "type": ["Fantasy", "Young Adult", "Fiction", "Science Fiction"], "outlinks": ["http://www.goodreads.com/book/show/177363.An_Acceptable_Time", "http://www.goodreads.com/book/show/10620776-an-acceptable-time", "http://www.goodreads.com/book/show/24761.An_Acceptable_Time", "http://www.goodreads.com/book/show/865966.An_Acceptable_Time", "http://www.goodreads.com/book/show/865979.An_Acceptable_Time", "http://www.goodreads.com/book/show/2367662.An_Acceptable_Time", "http://www.goodreads.com/book/show/33574273-a-wrinkle-in-time", "http://www.goodreads.com/book/show/18130.A_Wind_in_the_Door", "http://www.goodreads.com/book/show/77276.A_Swiftly_Tilting_Planet", "http://www.goodreads.com/book/show/151370.Many_Waters", "http://www.goodreads.com/book/show/14358.A_Ring_of_Endless_Light"]}