{"ratings": 15572, "userreviews": [{"userName": "Jim Fonseca", "userReviewDate": "Jun 03, 2017", "userURL": "http://www.goodreads.com/user/show/6743601-jim-fonseca", "userReview": "Did you ever wonder what it was like in Japan after its defeat in WW II? So here we are in Japan in 1947. Our main character, an older man and an artist, lost his wife in a stray bomb that also destroyed much of his home, and he also lost his only son in the war. But he still has two daughters; one married with a son, and one trying to get married, but she’s getting a bit old for that time and culture; she’s past her mid-20’s.Japan was occupied by the United States, of course, and we imposed our systems on them; everything from our politics to baseball. Some Japanese adopted the American values wholeheartedly. His grandson, fascinated by the Lone Ranger and Popeye, exemplifies this, as well as (eventually) his two sons-in-law, both 80-hour-work-week type corporate guys. Others see the country run by greedy businessmen and their political lackeys, and conspire to bring back the old ways and even the Emperor. There is growing urban poverty in Japan not just from the devastation but from the wave or migrants from rural areas flooding the cities. The clash of cultures is shown by this passage: “[The hotel] had been amongst the most pleasant of the Western-style hotel in the city; these days, though, the management had taken to decorating the rooms in a somewhat vulgar manner – intended, no doubt, to strike the American clientele with whom the place is popular as being charmingly ‘Japanese.’” The main character was a teacher and an artist commissioned to draw pro-war posters – are people turning against him? When he hears of the ritual suicide of a musician who composed pro-war marches he really starts to re-think his life. Were their military and political leaders brave or stupid? Did their leaders mislead the people or did they fight for their glory? He is forced to confront his role in the war. In Japanese culture at the time, the families of potential marriage partners “investigate” each other families. Last year the younger daughter’s engagement was broken off. No one knows why but the elderly man becomes concerned and starts going around to old friends whom he knows will be contacted in future investigations. We begin to see what his old life was like; his past artistic rivalries, triumphs and failures. A theme is the teacher-mentor (sensei) with his disciples and the inevitable breaking away, which may or may not be amicable. A lot of it is an old man’s talk over sake of bygone places and people.The retired artist has it both ways --- he talks humbly but secretly thinks a lot of himself and has a knack for getting others to sing his praises for him. But, he also apparently has a lot of hazy memories where his recounting of events differs from that of his daughters. Is he getting alzheimer’s? Of course they don’t dare disagree directly with him, but it goes like this: “Honorable Father, with all due respect, in many of these things you say we think you are full of crap.” (This occurs to me: Many Japanese have an obsessive attraction to Anne of Green Gables; many even come each year to the tourist venue at Canada’s Prince Edward Island to get married. Is a part of this due to the audacious mouthiness of Anne in such a culture of constraint? http://www.huffingtonpost.com/terry-d...)The floating world of the title is the “pleasure districts;” a main one downtown and several smaller neighborhood ones scattered through the city. “…one could get drunk there with pride and dignity.” Pleasure, geishas, gambling, drink, theater; all for men only, of course. “The best things are put together of a night and vanish in the morning.” His artistic training was in a school that painted that world – reminiscent of Toulouse-Lautrec. We also learn odds and ends about Japanese art; for example, the traditional device of expressing emotion through the textiles a woman is wearing rather than through the look on her face. Kazuo Ishiguro, the author, was born in Nagasaki in 1954, but when he was five his parents moved to England, where he was educated, so he is considered a British author. Floating World was his second novel, but Ishiguro is perhaps best known for The Remains of the Day, which won the 1989 Booker Prize. I highly recommend this book. Photo of Japanese soldiers viewing destruction two months after the bomb was dropped on Nagasaki. (from history.com)"}, {"userName": "William1", "userReviewDate": "Mar 24, 2011", "userURL": "http://www.goodreads.com/user/show/4684009-william1", "userReview": "Second reading. The gist of this novel is the narrator's culpability for his patriotic actions during the war with the U.S. Set in a suburb of Tokyo during the American occupation, the narrator, Masuji Ono, is now surrounded by those who blame him for Japan's disastrous gamble on war and those like himself. Ono's generation was that of the old men cheerleading for war. And there can be no question about his complicity. In his youth he trained as an artist of the demimonde or \"floating world,\" but turned to graphic propaganda during the war. His work was responsible for motivating untold thousands of young Japanese men to throw their lives away. Here's the rub though: Ono in the end was nothing more than a patriot. I agree that nationalism is abhorrent and that he was on the wrong side of history. But really it was Ono's misfortune, as it was Japan's, to be so catastrophically led. It strikes me as absurd that those around him berate and belittle him. There is even the suggestion by his eldest daughter that he do the honorable thing and commit seppuku, (literally, \"stomach cutting\"), as a means of cleansing the family name and clearing the way for the younger daughter's marriage negotiations. Reading the book I was reminded of how U.S. soldiers were treated when they returned from Vietnam. Ono was a combatant, no question. But it's really those around him him who've changed since the defeat, not Ono himself. Also read Ishiguro's The Remains of the Day, A Pale View of Hills and When We Were Orphans.I believe Ishiguru's model here may have been Yasunari Kawabata, the Japanese Nobelist. An Artist of the Floating World reminds me in some ways of Kawabata's  The Old Capital."}, {"userName": "Jan-Maat", "userReviewDate": "Jul 17, 2011", "userURL": "http://www.goodreads.com/user/show/5617661-jan-maat", "userReview": "Rereading this novel I felt that the award of the 2017 Nobel prize for Literature to Ishiguro was a very safe choice.In one way Ishiguro's books are not very interesting, the narrator might be unreliable or limited, there is a concern for memory and the role of a creative intelligence in understanding and reinterpreting the past, there are issues of guilt and responsibility, and love. And one can find these elements in book after book. But he is deft and clever, a safe choice for the nobel prize, his stories might even invite a careful reconsideration of the award decisions and the motivations of Alfred Nobel.At a certain point reading I was almost hurt to acknowledge that the book was only 206 pages long, how could that be, the sense of the mental space that the book demands of the reader is far greater, not in an obnoxious way, no he is an insidious writer, one doesn't notice the soft mist rising from the pages, one can not discern the moment that one becomes lost on a familiar path.Putting down the book and letting the mind wander and wonder a bit images seem open to continual reinterpretation, the reader mirrors the narrator trying to find some sense in the situation, but perhaps I must not take my mind's work too seriously the title is An artist of the Floating World, the floating world was the ephemeral existence of bars, of professional entertainers, boozy talk and dim, cosy lighting, certain artists attempted to capture the fleeting emotions and atmosphere perhaps the melancholy of a prostitute and her transitory beauty, as it happens the narrator was not an Artist of the Floating World, but his Master was, the narrator at some point turns his back on that in favour of painting posters promoting nationalism and expansionism, Japan's place as Imperial super power over Asia.a man who aspires to rise above the mediocre, to be something more than ordinary, surely deserves admiration, even if in the end he fails and loses a fortune on account of his ambitions (p.134)The novel is divided into four unequal sections, each identified with a little time stamp, from October 1948 to June 1950. So one can see that the bright world of Imperialism, has turned out to be brittle and itself was a kind of floating world, melancholy in retrospect, the war dead haunt the pages, and when not those who died then the guilt and culpability of the survivors. Bright suicides slice into the narrative, of company directors, of a composer of militant songs, might it be the narrator's duty to apologise in such a manner and to so accept his share of responsibility, and if so responsibility for what precisely?  'But these are the men who led the country astray, sir. Surely, it's only right they should acknowledge their responsibility. It's a cowardice that these men refuse to admit to their mistakes. And when those mistakes were made on behalf of the whole country, why then it must be the greatest cowardice of all' (p.56)The smell of burning wafts in, two, three times, finally the burning after air raids, but and this is the thing with his writing the smell carries us back to earlier instances of burning, of another's artist's anti-war work, of the narrator's own childhood drawings by his father, were might we begin and end the chains of responsibility and causality? Burning suggests not so much the possibility of the roads not taken, but of potential lives that were absolutely and decisively closed off for the narrator, but maybe this too is a way of subtly avoiding responsibility? In any case, there is surely no great shame in mistakes made in the best of faith. It is surely a thing far more shameful to be unable or unwilling to acknowledge them  (p.125)Can we even be certain about the harm we have caused, and when we have can we expiate that harm, do penance in some meaningful way? Can we talk about it to the next generation? And to the next?The narrator takes his grandson to the cinema to watch Godzilla, the grandson projects his fears on to his aunt and shows bravado - the boy doth protest too much - by laughing at the cinema poster, but in the darkness he has at age seven, enough self knowledge to sit with his raincoat over his head. Has his grandfather gone through life with his own raincoat over his head, is throwing a raincoat over one's head and ignoring the Godzilla in the room, the best way in fact of dealing with the immediate past when perhaps everybody was guilty and at the end of the day appropriate marriages still have to be arranged between the young people, and the old men have to feed the carp?It was worth reading twice, and puts The Chrysanthemum and the Sword in the shade for me.old reviewThis impressive novel set in the aftermath of WWII in Japan. Ishiguro creates a sense of stillness and normalcy around his narrator who comes across as an elderly but genial artist. Things happen around the narrator that seem inexplicable - the breakdown of his younger daughter's engagement, the loss of long-standing friendships. The outside world seems oddly strange. But as the narrator reflects on his life and his current troubles as readers we slowly begin to realise that the narrator's experiences are entirely explicable since slowly the extent of his committed engagement both personally and as an artist in the politics and ideology of pre-1945 Japan becomes clear."}, {"userName": "Samadrita", "userReviewDate": "Oct 22, 2012", "userURL": "http://www.goodreads.com/user/show/13266158-samadrita", "userReview": "If you've already read The Remains of the Day, chances are your enjoyment of An Artist of the Floating World will be greatly curtailed. And that is the sheer tragedy of this book.Replace Stevens with Masuji Ono. Replace a tottering England with a war-ravaged, financially unstable Japan and insert Ishiguro's penchant for allegory. And TADA you have An Artist of the Floating World.This book had potential to be a very emotionally charged commentary on a nation rebuilding itself from its charred (atomic-bombed) remains and reflecting on the flawed ideologies of its notorious past.But instead it felt like a curious combination of The Remains of the Day and A Pale View Of Hills with little improvisation thrown in. If in TRotD, Stevens laments living a life devoted to serving a Nazi-sympathizing, Jew-hating Lord with unquestioning loyalty, in AAotFW, Ono san experiences feelings of profound guilt for having created paintings supporting the war and Imperial jingoism. We see Ono repeatedly trying to convince himself that his ideals were not at fault and he only did what his feelings of patriotism (obviously misguided) inspired him to, at the time.But at the fag end of the narrative, Ono comes to terms with his 'mistakes' and even ends up offering an unsolicited apology to his daughter's father-in-law at her miai ('marriage interview session' in Japanese).Translation:- Ishiguro virtually makes Japan get down on its knees and apologize to the world for all its crimes against humanity. The evanescent night life of the pleasure district that Ono san uses as a theme for his paintings is actually a symbol of a 'floating', hesitant Japan about to turn over a new leaf. I cannot exactly put my finger on the things I did not find particularly appealing about this book. Maybe it's the matter-of-fact tone of Ono's narrative voice which will tend to annoy the reader at some point. Maybe it's the lack of a shadow of grief or an air of melancholy that pervaded the atmosphere of TRotD and A Pale View of Hills. Maybe it's the glaring similarities with TRotD. Or maybe it's the Booker-nominated writer Tan Twan Eng saying in an interview how he reads this book at least once every year which caused me to have really high expectations.I had assumed, a book ought to have created an exceptionally powerful impact for it to be Eng's all-time-favorite. But I guess as a Malaysian national, he must have strong sentiments associated with any book that so much as touches upon the topic of Japan's shameful past as colonial master of most of east/south-east Asia.So my advice for the uninitiated will be:- Read Ishiguro's works in order or at least read this one before reading The Remains of the Day."}, {"userName": "Sawsan", "userReviewDate": "May 17, 2015", "userURL": "http://www.goodreads.com/user/show/11592808-sawsan", "userReview": "الحرب العالمية الثانية لها تأثير كبير على الأدب يكتب كازو إيشيجورو عن التحولات في الفكر الياباني بعد الحربورأي الشباب عن مسئولية الجيل القديم عن الحرب والهزيمة رسام متقاعد آمن بالحرب ودعمها بفنه يُعيد تقييم مواقفه وأحداث حياته الماضية بعد الأذى الذي تعرضت له بلده وتغيُر العالم سياسيا وثقافياالكاتب يمر في الرواية على موضوعات مختلفة منها تأثر الشباب الياباني بالثقافة الأمريكية بعد الحربالتقاليد اليابانية في الزواج والتعاملات اليومية, وسرعة وجدية خطوات النهوض والتعافي في اليابان بعد الهزيمةالترجمة جميلة والسرد هادئ بين الماضي والحاضر"}, {"userName": "Michael Finocchiaro", "userReviewDate": "Jun 23, 2017", "userURL": "http://www.goodreads.com/user/show/48483884-michael-finocchiaro", "userReview": "An Artist of the Floating World is a nice pleasant read. Although Ishiguro had not lived through this period and lives in England, he evokes the languid rhythms of life in post-war Japan with panache. His protagonist addresses the reader in the second person over the entire book, telling us of his career as a propagandistic artist of pre-war Imperial Japan and his retirement. There is a marked similarity between Oji and the protagonist of The Remains of the Day, in that each had acted in morally ambiguous ways based on belief and their actions indirectly led to the atrocities of WWII in the two different theaters of Europe and Asia. Ishiguro invokes the Edo period of Tokyo (although the city is never named directly) and the destruction of the pleasure district in rounded, sensual tones just as the art of Ukiyo-E did. The protagonist was, in fact, trained as a traditional painter before being seduced by dreams of \"modern\" Japan led him to political painting. This had an adverse affect on his life - particularly his relationships after the war. The image on page 77 of the painter seeing his old protege Kuroda in the ruins of the post-war city and how \"a truck going by between [them], full of building workers\" is symbolic of this vast distance that his political stance put between him and his former master and students. This is an interesting and well-written book and if you are interested in this period, check out Kafu the Scribbler by Siedensticker which is about a real Japanese writer that would have been similar to Mori-san in the book."}, {"userName": "Sam Quixote", "userReviewDate": "Dec 17, 2017", "userURL": "http://www.goodreads.com/user/show/5759543-sam-quixote", "userReview": "Set in Japan right after WW2, Masuji Ono, a retired artist, looks back on his life and career from when he was a celebrated painter in the pre-war years to the social pariah he now is in the post-war years thanks to his ties to imperialist Japan. Doesn’t sound like much of a story, does it? It isn’t! I remember really enjoying Kazuo Ishiguro’s The Remains of the Day, so much so that I read it twice, so I don’t know why I’ve never read anything else by the guy. I decided to pick up the novel he wrote before Remains, An Artist of the Floating World, and found it to be, unfortunately, a tediously slow-moving load of nothing. So, post-war Japan had a real problem with pre-war Japan, namely with the imperialist jingoism that got them wrapped up in what became World War 2, with the survivors actively rejecting all aspects of “traditional” Japan and embracing the occupying Americans’ values and culture instead. Ono isn’t happy with that. Zzz…I kept hoping for something - anything! - to happen and it never did. There’s a “plot” involving Ono trying to marry off his youngest daughter but having trouble because of his previous associations with imperialist Japan. I couldn’t have cared less! I was looking forward to seeing what terrible stuff he’d painted to make him such a notorious figure except Ishiguro completely cops out on that point by never revealing it. All we’re told is that it’s “unpatriotic” and that Ono is a “traitor”. Booo! You can see Ishiguro flirting with the idea of the unreliable narrator that he would go on to perfect in Mr Stevens from The Remains of the Day but here the literary device is merely toyed with lightly to little effect. I like the title of this book and found out that the “Floating World” was a period of time in Japan’s history noted for its decadence and celebration of transient pleasures, so I guess Ishiguro’s drawing comparisons to that era with either pre or post-war Japan? I don’t know and I’m not really interested enough to think about it. But that vagueness is indicative of the book as a whole. It’s a well-written novel and gives you a strong sense of the mood of post-war Japan but it’s not enough for me. An Artist of the Floating World is so completely lacking in anything substantial that it failed to leave any kind of impression. A very disappointing, weak effort - I’d recommend checking out The Remains of the Day for a far better Ishiguro read instead."}, {"userName": "K.D. Absolutely", "userReviewDate": "Sep 19, 2010", "userURL": "http://www.goodreads.com/user/show/2156200-k-d-absolutely", "userReview": "I thought Kazuo Ishiguro was not one of the authors who do not rewrite themselves. This book proved me wrong. He is like many other authors who write at least two novels with similar plot, themes and even characters. They just change some aspects of the novel like settings, climax or maybe the names of the places and people. I was disappointed but the disappointment was not enough for me to give this 1 star because the book still has all those Ishiguro's trademarks that made me fall in love with his books: subtle, delicate and intricate writing. Still a worthy of money and time especially for his diehard fans.You see, I have read three of Ishiguro's works prior to this. All of them I really liked (4 stars): The Remains of the Day (1989), Never Let Me Go (2005) and Nocturnes: Five Stories of Music and Nightfall (2009). Each of them are totally different from one another. So, I thought he does not re write himself. I know that this book, An Artist of the Floating World was first published 3 years before The Remains of Day but I read this later. Had I read this first, I would have liked this and would have hated Remains.In my opinion, the similarities are obvious but there are also some minor differences. However, the plot is still too close to each other compared to let me say, Never Let Me Go. In this book, Masuji Ono is an aging painter and has been a respected artist in Japan. He worked hard for his craft and gained fame and honor from it. However, during the war, he became a police enforcer, something that was not really honorable. Now, that he is old, he wants everything that he will leave to be in order including the marriage of his daughter Noriko. In the traditional Japan, the parents look for potential husbands for their daughter. The process goes on some defined stages including some background checks on the family of the woman. In Remains, the aging man is Mr. Stevens who is an excellent butler. He works hard as a butler as he believes that is the equivalent of \"human dignity.\" However, his former boss had a shady dealing as Nazi informer during the war and it affected the stature of his otherwise prestigious Darlington Hall. Stevens has a co-worker, Miss Kenton, with whom he almost had a relationship. In their twilight years, they are both asking the \"what-ifs\", i.e., what if Mr. Stevens courted Miss Kenton, what if Miss Kenton said yes, what if they got married, etc. Both protagonists are male in their retirement years. Both have worked hard in their crafts. Both have some kind of regrets due to their own doing. Their own mistakes. Both are trying to correct those mistakes before they die. However, I will not tell you if they succeeded as that would be too much of a spoiler.The only differences: One is set in Japan, the other one in Britain. However, both of them are after WWII. Ono's mistake is his mainly own doing while Mr. Stevens is mainly his own undoing. He did not court Kenton even if he felt something for her. Also, Ishiguro was so brilliant that the voices of Ono and Mr. Stevens are totally different from each other. Both of these novels employ first-person narration and both narrators are unreliable and the reader has to take almost the whole book to fully figure this out. Each narrator, however, has their own distinct \"voices\" that is truly admirable because Ishiguro left Japan when he was 5 years old but he still was able to vividly capture the Japanese scenery, culture, tradition and the manner of speaking. The examples of this are when younger people address the aging Ono with Sensei and his daughter referring to him as third person \"Would my father be kind enough to consider...\" instead of how we say this nowadays \"\"Would you consider...\" This was the reason why I was hesitant to read another Ishiguro book. I was afraid that I would not like the next book and I would be forced to drop Ishiguro from the list of my favorite authors. I still have respect for him but oh yes, sadly, this book eroded his pedestal in my mind.I would like to call the attention of my friends who rave about Ishiguro because they've read \"Remains\" and \"Never Let Me Go\" and so they think that Ishiguro does not re-write himself. He does. In my opinion, at least."}, {"userName": "Sidharth Vardhan", "userReviewDate": "Nov 25, 2017", "userURL": "http://www.goodreads.com/user/show/58296635-sidharth-vardhan", "userReview": "\"And if on reaching the foot of the hill which climbs up to my house, you pause at the Bridge of Hesitation and look back towards the remains of our old pleasure district, if the sun has not yet set completely, you may see the line of old telegraph poles – still without wires to connect them – disappearing into the gloom down the route you have just come, And you may be able to make out the dark clusters of birds perched uncomfortably on the tops of the poles, as though awaiting the wires along which they once lined the sky. \"\nSet in post world war II Japan, this beautiful little novel is Ishiguro doing his usual great job - the subtlety, the painting of something larger (atmosphere of a country in this case) and a narrator who knows how to forget (unlike that of 'The Sense of Ending' Ishiguro's narrators never forget anything substantial - just a few minor details like when something happened or exchange a few details). Even the non-chronological flow of prose is so brilliantly conversational. The title refers to the kind of life artists lead - away from social responsibility chasing after soft, beautiful things that become unreal in daytime like pleasures from district. \n ' Artists’, my father’s voice continued, ‘live in squalor and poverty. They inhabit a world which gives them every temptation to become weak-willed and depraved. Am I not right, Sachiko?’‘Naturally. Yet perhaps there are one or two who are able to pursue an artistic career and yet avoid such pitfalls.'\nThe novel is about narrator's dilemma - of having to chose between avoiding those pitfalls and his artistic need to pursuit beauty\nAn artist’s concern is to capture beauty wherever he finds it.\"\nAnd his life is full of oscillations between the two and thus the metaphor of bridge of hesitation on his way to pleasure district. Smooth. The novel starts at a poin where author is inclined to believe that people around him are of opinion that not only he tried being socially responsible but failed with devastating effects to whole nation. And thus the need to look back at his own life. And question - if an artist is just giving out as his or her message what is the spirit of people at the time, how much he or she can be blamed for leading them? The other themes I am too lazy to discuss."}, {"userName": "Selena", "userReviewDate": "Jan 19, 2009", "userURL": "http://www.goodreads.com/user/show/128546-selena", "userReview": "After reading Never Let Me Go, I swore that I would read more of Ishiguro's work. It was fate that I ran across An Artist of the Floating World at my Library. The novel isn't a particularly long one - coming in at a mere 206 pages. It was a breeze to get through.I'm noticing that with Ishiguro's narrators so far, the tone is very conversational. Throughout this book, the protagonist Masuji Ono, a retired artist, speaks intimately to the readerThroughout the book, Masuji Ono, the protagonist, speaks to the reader directly. Much like in real conversations, there are tangents and complete changes of topic.Masuji, a retired artist, often finds himself wanting to describe what happened with one of his daughters , but somehow takes us back to his days of art apprenticeship and the trials Japan faced during WWII. The conversational tone added to how quickly the book passed, for me,because the stories were very interesting and it felt odd to have to put the book down during his conversational recollection.I don't really know how to tell you what the book is about. Masuju is trying to make sure his second daughter is able to marry. In Japan, there is a process prior to the marriage where both families investigate one another to make sure that they are pleased with the history of the family. They go as far as to hire investigators for this process.Masuji is particularly worried for his daughter because the year before, the suitor's family backed out of the marriage without any good reason. His daughters hint that this may be because ofMasuji's past.The book is very slow to reveal what it is that could potentially be spoiling his daughter's chances at marriage - but the journey that leads you there is an altogether interesting one.Masuji's opinions, which he heavily showcased in his paintings during WWII, are no longer held by society. They are in fact looked down upon by society. In Japan, people fault you for your past.I enjoyed the parts of the book that directly related to his art. The stories of his daughters were secondary. As a young child, he enjoyed painting and knew he would not take on the family business like his father wanted. I felt sympathetic to Masuji's character. I'm very familiar with what it is like to have your career belittled by others. The form of training that was offered in Japan for aspiring artists at that time is so interesting to me. When I was younger, I attended an art school over the summer where we were encouraged to create our unique style. In Japan, you gained respect by mimicking the style of an already famous artist.This novel has a very under-stated message. It speaks of misunderstandings and the changing views of a society. Masuji Ono, represents the \"older\" generation of Japan, the old views of how things are. His daughter's husbands represent the new generation, the generation of \"change\" which misunderstands the past. This short novel is able to give you a snapshot of post-war Japan in all its melancholy state through the eyes of a jaded retired artist."}, {"userName": "Matt", "userReviewDate": "Jul 20, 2008", "userURL": "http://www.goodreads.com/user/show/54697-matt", "userReview": "Steady, measured, gentle, sure-handed, slightly seductive.Ishiguro's narrator is fooling himself for sure throughout his tale, but you almost believe him.Some wonderfully graceful pacing, with the situations and pages melting into one another, which as one reviewer here remarked, makes a \"floating world\" all its own.It sort of reminds me of the thing said about Flaubert's \"Sentimental Education\"- the main theme is largely heard in the background. For Flaubert it was revolutionary upheaval in mid 19th Century France, shuddering the class distinctions and ever so gently rattling the cages of the bourgeoise. Brilliant trick, that.Ishiguro's up the same kind of thing here, though I gotta say he doesn't quite pull it off as well.the narrator's spent some time polishing the bronze of the powers that be in ww2 Japan, living in a sensual, apathetic 'floating world', and now he's come out it (somewhat) to face the fact that his life has been a sort of lie. He is trying to get over his predjuces and outmoded ways of thinking but he seems pretty much to stay where he is, physchically, though he mentally registers that he's been wrong. What I'm sort of getting at here is that the political and aesthetic sins of his generation (the narrator's, that is) are only really mentioned briefly, so subtly that they almost don't register. They don't touch the present actions, except as a moral lesson in memory.He pretty much just watches bemused and uncomprehending at his nephew, who is one of the more lively and skillfully drawn minor characters I've seen in a long time. Ono doesn't seem to have had to pay for very much of his errors in judgement, which sounds harsh but ruins some of the dramatic impact.Ishiguro seems to to be saying that an artist (even a nominally apolitical one) can't take a passive attitude to his culture and his times. He doesn't have the luxury of being a pure aesthete. In order to mature and have ethical integrity he's got to address of the moral complexities of his generation. He needs to make sure he's not the side of the executioners, to paraphrase Camus.Point well taken. And it's decently executed, but the character doesn't seem (and his world even less so, though there's the beautiful set piece of the falling leaves) haunted enough by the glare of fascism to really drive the point home. It's too mild on this issue, which is a bit of a shame because its mildness is also its blessing.Mostly very good, just read it for the set pieces and the characterization and the smooth, almost gliding quality of this very small but quite worthwhile story.I'm definitely curious about Ishiguro's other work, having loved the movie of \"The Remains Of The Day\" and heard all the highfalutin' praises of \"Never Let Me Go\", which apparently everybody in the friggin' world thinks is timeless genius.We'll see...as for now, I've got my hopes up."}, {"userName": "Praj", "userReviewDate": "Mar 17, 2010", "userURL": "http://www.goodreads.com/user/show/3381634-praj", "userReview": "Each time my eyelids bowed down to the devil of grave drowsiness, the concave depths displayed a lean, modest shadowy figure standing on the Bridge of Hesitation; the wrinkles on his forehead becoming deeper , trembling with culpability, wishing for Noriko’s miai to be an incessant success. The Idle Thoughts of an Idle Fellow\">Jerome K Jerome was accurate with his analysis of the solitude of an idle mind bringing generous thoughts. There I was, nursing an acute bronchial cough cursing the fateful knitting needles for hampering my purling flair even as Masuji diffidently questioned Mr.Kuroda’s whereabouts to his surly assistant. How could a man be punished for something he believed in? How can skepticism prevail on man’s patriotic ideals when his loved ones too perished in the dreadful horror? Is the idea of patriotism merely seductive when one does not have to stand on the edge of its justification? “Ordinary men with no special gifts of insight, it was simply our misfortune to have been ordinary men during such times.”, that is what Mr. Mastuda asserted rubbishing Masuji’s contemplation of a culpable survival. The close knit life of ordinary men is anything but ordinary. The narrow area of existence magnifies the aspects of circumstantial actions. The wrongs do not get washed by the flow of vast oceanic waves but float amid the marshes of a pond. Isn’t ‘the lives of ordinary men’ restricted as the stagnant pond waters? The tight-knit communities in which he daily moves, the by-lanes, the alleys which witness his daily travels and those numerous heads that pop up at the windows every time he closes his door; absolutely nothing is inescapable in the life of an ordinary men. With such unusual vigilance how could his troubles then be marginal? Dignity and self-respect brings a sense of calmly happiness to the life of an ordinary man. With no monetary affluence or supremacy, ‘dignity’ seems the only path of his civil acceptance. In a world so constricted with flimsy lifelines of obstinate relationships, exile is a nightmarish death.‘The validation of a war’; I dread debating this subject as my nerves tremble with utmost anger. A part of me appreciates the use of military powers in virulent situation of civil conundrum. And, then there is the other half that contests the legitimacy of the power usage in case of political egotistical fulfillment. Comprehension of any war literature is a chaotic process hindered by my faint heart. I have always nattily stayed away from any war related prose, especially the ordeal of soldiers or the aftermath of human lives. I may not know the tribulation of braving a war front or structuring a war graph, nevertheless I certainly know that is shameful to doubt the worthiness of valiant sacrifices. The anger that seethed when Suichi called the deaths of young Japanese soldiers wasteful appeased when he validated his disdain by questioning the prevailing injustice of seeing the ‘real culprits’ still alive and enjoying luxurious perks amid the brazenness of righteousness. “To my mind, that’s the greatest cowardice of all”. How true! Isn’t’ that a bitch! Ishiguro speaks the language of restless youths of many generations questioning the inequitable penalty of the war. The politicians, spiritual leaders, capitalist cliques waving their chameleonic flags of patriotism shy away from battling on their once beloved home ground. Why those clandestine escapes to safe havens when their own vile concoctions amalgamate in their own drinks? Why not brave the salient turmoil themselves, that these ‘benevolent guardians’ stir? Suichi admitting flaws of the nationalistic chimera, the misplaced self-respect and prevailing shamelessness veiled under a patriotic farce is a tale told by every life of a torn nation. Japan was a torn nation after the WWII, feelings ranging from compassions to abhorrence raced among the minds of those alive and trying to weave a better future in their displaced living. Those who once were applauded for their patriotic songs were now mercilessly beaten and whispers about selected betrayers flooded the atmospheric desolation. Masuji was among those who lived with ignominy finding getaways from his past leeched onto him like a hungry parasite. Masuji Ono may have once been the most revered artist of his time, but to me he is now a worried father of Noriko fearing the consequences of his past action being detrimental on his daughter’s future. Having lost his wife and son in the war, the only family Masuji had was his two daughters, how in the devil could he allow his condemnation of his war efforts hamper the bright prospects of his unmarried daughter. Masuji was no longer the influential artists of the Pre-war era; he was now an old feeble man who relied on old memories and occasion outing in the Midi-Hidari neighborhood for a pleasurable day; comprehending the wisdom behind the western influence in his grandson’s rearingKazuo Ishiguro highlights the apprehension of a man in admitting his mistake in the fear of his denunciation; chronicled three years after the war. An Artist of the Floating world, the name Ishiguro chose for his novel, travels through magical serenades of flamboyantly lit streets of Midi-Hidari district, the hypnotic sways of delicate fingers playing amongst the elegant kimonos captured through beautiful brush strokes ,where an local artist reveled in his honorable dignity only to lose it and then gain it back again with grit and determination as there is certainly no shame in admitting one’s mistake made in the best faith because in a ‘changing world’ one is bound to stumble and falter because no one is perfect or a virtuous ‘sensei’."}, {"userName": "Whitaker", "userReviewDate": "Aug 10, 2009", "userURL": "http://www.goodreads.com/user/show/1415047-whitaker", "userReview": "In this way and that I tried to save the old pailSince the bamboo strip was weakening and about to breakUntil at last the bottom fell out.No more water in the pail!No more moon in the water!"}, {"userName": "Abram Dorrough", "userReviewDate": "Sep 05, 2017", "userURL": "http://www.goodreads.com/user/show/54459790-abram-dorrough", "userReview": "Masuji Ono, the narrator, fights a constant battle against himself. Ono must emotionally cope with not only the guilt he feels from his past participation in injurious governmental activities, but also the pains of ageing and the loneliness he experiences through both the death of family members and his alienation from the new generation. Ono’s writings are a form of self-therapy. His tactic is to postpone the recognition of his past and spend as much time as possible avoiding a confrontation with it. He knows what he has done, but he refuses to accept his past as authentic. Therein lies Ono’s ironic conflict: recognition without recognition, belief and unbelief. Ishiguro effectively crafts an ironically trustworthy unreliable narrator to evoke Ono’s emotional conflict within the reader.One prevalent quality of the narration is Ono’s endless manner of beating around the bush, both while he is narrating his own account and while he recalls the conversations he has shared with others. For example, when he tries to visit an old pupil, he tries to make the same argument in practically the same words — “I would not ask you to jump to conclusions about matters of which you do not know the details” — six different times when speaking with the servant of the pupil before giving up. Undoubtedly, the circuitous manner of dialogue between Japanese people is common, especially while discussing touchy subjects. Getting straight to the point when one Japanese person might offend another is considered inordinately rude, and Ono consistently speaks in a culturally appropriate manner. The consistency of Ono’s roundabout dialogue throughout the novel is evidence of Ishiguro’s masterful knowledge of the Japanese way of life that had yet to change since the end of World War Two, and it establishes Ono as a culturally consistent figure; it makes him an authentic narrator, a genuine person in this world, an honest Japanese gentleman. This seems to put him at odds with the other quality he prominently demonstrates: a malleable memory.Ono’s circuitous way of rewriting facts when he speaks with himself at first inspires doubt in the reader. Constantly Ono is restating ideas and phrases, or he tells a story that has nothing to do with the subject at hand as a way of getting around the tricky words he does not want to share. While he shares a story, he often changes his mind about how a certain event had played out. His conversation with a previous suitor to one of his daughters provides an excellent example of this self-doubt:\"Did Miyake really say all this to me that afternoon? Perhaps I am getting his words confused with the sort of thing Suichi will come out and say. This is quite possible… I am certain enough, though, that some such conversation did take place… but as for the phrase ‘the greatest cowardice of all’, I am sure that was Suichi’s. In fact, now that I think of it, I am sure Suichi used it that evening.\"At first glance this technique seems to remove authenticity from the story and cause the reader to feel doubt; how can we rely on a narrator who is constantly changing his mind? The reader may wonder why it is that Ono, who is writing this account for himself, would not simply edit his story after he remembered the details and present the final product as he ended up remembering it. One reason Ono rewrites as he writes is because Ishiguro portrays Ono as an ageing Japanese man, and his writing style reflects Ono’s way of speaking with others. He writes as a simple old man with a failing memory. Age plays a large factor in Ono’s musings and changing of details, which only further contribute to Ono’s authenticity as character. This technique could also be a subtle appeal from Ono to increase his ethos: by remaining completely honest with the reader, Ono causes the reader to gain trust in him. After all, an effective method of gaining trust with others is to admit one’s own faults. Regardless of what the reader may think of the details Ono omits and changes, Ono is indubitably a Japanese artist, and the strongly characterized pathos behind his words remains.Ishiguro, a narrative craftsman, effectively forces the reader to walk around in Ono’s shoes and feel his internal conflict. Overall, Ono’s authenticity and honesty indicate that the reader can determine Ono’s broad intentions, but the reader may not believe all his words because Ono is constantly changing them. Thus, his ceaselessly circuitous dialogue, both external and internal, can either lead the reader to a level of confidence such that he or she may trust Ono’s account of his experiences and sympathize with him, or it can demonstrate how Ono’s unreliability as a narrator discredits his exact interpretation of events. This dichotomy causes the reader to go through the same ironic conflict as Ono — belief with unbelief. So it is that humankind looks back ironically at its collective past: horrific wars, deadly atrocities, terrorist attacks. We believe, but we cannot believe, the pains people are collectively and individually capable of inflicting on each other, even when living under totalitarian rule.This book simultaneously made me like Remains of the Day more and less than I did originally. Remains of the Day is essentially the same book as An Artist of the Floating World, except for one key difference: the conflict in Remains of the Day centers around our narrator dealing with his past inaction, while the conflict in An Artist of the Floating World centers around our narrator dealing with his past action. This book helped me identify what makes Remains of the Day engaging, but it also made me realize that Ishiguro basically copied this book to write Remains of the Day. Ishiguro is great at creating narrators, but the narrators from those two books are basically the same person."}, {"userName": "Ioanna", "userReviewDate": "Mar 09, 2018", "userURL": "http://www.goodreads.com/user/show/50334498-ioanna", "userReview": "Το θέμα που πραγματεύεται το βιβλίο αφορά την Ιαπωνία μετά το τέλος του Δεύτερου Παγκοσμίου Πολέμου. Δεν είχα ασχοληθεί ποτέ με το αντικείμενο και ομολογώ πως δεν ξέρω και πολλά γι' αυτό. Όμως ήταν πολύ ενδιαφέρον και νομίζω πως αξίζει λίγο ψάξιμο."}, {"userName": "Ani Lacy", "userReviewDate": "Feb 01, 2018", "userURL": "http://www.goodreads.com/user/show/53432267-ani-lacy", "userReview": "This book is difficult to describe. What is it about? An old man, an artist, a young man, grandchildren and satisfaction. Also regret and the courage to live a life you can be proud of."}, {"userName": "Lobstergirl", "userReviewDate": "Sep 25, 2009", "userURL": "http://www.goodreads.com/user/show/1910836-lobstergirl", "userReview": "With this my reading of Ishiguro's canon is complete. So he'd better be working on something new.The novel is set in postwar Japan. The first person narrator, Mr. Ono, is a retired artist reflecting back on his career and life. He is widowed, and his son was killed in a minefield in Manchuria. He has two adult daughters and one grandson. As he explains his daughter Noriko's attempts to find a husband, we are first led to believe that her lack of success is simply a result of unfortunate timing; the war threw up obstacles. Noriko is already 26, a bit past the husband-finding prime. As the novel progresses, we learn that two previous attempts to find a match for Noriko - these are long investigations in which the prospective groom's family will hire a detective to look into the potential bride's family and associates - have fallen through, and that this is due to her father's activities as an artist. Mr. Ono had changed his painting style from images of \"the floating world\" (the world of nighttime pleasure and entertainments) to one more patriotic and supportive of Japan's war aims, and had reported another artist to a government committee investigating artists who failed to be sufficiently propagandistic.Ishiguro's novels are like onions: you advance layer by layer to the interior, slowly peeling away what is being told to you, gradually gaining awareness of what is happening. They benefit from being read twice, so you can reread earlier passages with the knowledge learned from later ones. His narrators are always unreliable. Perhaps they are the most unreliable narrators in all of literature. Here, Mr. Ono will relate a story that seems to get at the crux of a matter, then muse offhandedly: \"But this is all of limited relevance here.\""}, {"userName": "Barry Pierce", "userReviewDate": "Jan 18, 2015", "userURL": "http://www.goodreads.com/user/show/4593541-barry-pierce", "userReview": "There's enjoyable monotony and then there's monotonous monotony. This novel falls into the latter category. Disappointingly. I personally think Ishiguro suffers the sophomore struggle with this novel. Eh, I don't know. This one just wasn't for me. It didn't entice me at all. I was just reading about these characters doing things and that was really it. However it written very well. But that's expected from Ishiguro."}, {"userName": "Anastasia", "userReviewDate": "Nov 09, 2017", "userURL": "http://www.goodreads.com/user/show/55368121-anastasia", "userReview": "(3,5*)"}, {"userName": "Sara", "userReviewDate": "Jan 25, 2018", "userURL": "http://www.goodreads.com/user/show/5512657-sara", "userReview": "An Artist of the Floating World has much the same flavor to it that Remains of the Day possesses. It is a first person narrative from a narrator who is obvious in his inability to be impartial or reliable. As we try to piece together the truth of this man and his life, there is a heaviness of spirit that emerges, a sense of failure that is misunderstood, and a sense that Ono, the narrator, not only misunderstands himself but also those around him.Like much of Ishiguro’s work, this book leaves you at the end with a lot of questions you feel you must not only ask, but answer. Is it better to have acted upon your convictions and been wrong than to have done nothing at all? Are we ever as important to the world as we believe we are? When does conviction become narrow-mindedness? Are we ever right to impose our views upon others, and what price is fair for making a mistake that can be literally seen as the mistake of an entire society? And, I suppose I would add one more: Can we ever remember the past as it actually was, or must be always alter it somewhat to make the memory survivable? Another question that I have pondered over my life is that of what makes an artist or a piece of art great? If it is declared to be great, can it then be less simply because fashions have changed, times have changed, or the subject matter becomes less palatable. I have wondered about this in regards to literature as well as painting. Sometimes it seems so arbitrary. For instance, there were paintings that were done by a student of a master (I believe it was Rembrandt, but don’t hold me to that). At any rate, they were mistaken to be the major artists’ works and declared to be masterpieces and worth millions. It was then discovered that although they were painted in the same time, they were not his work. Immediately they became second-rate and worth much less. How can this be so? If they were masterfully done, are they not still masterfully done? Are they of less value because the painter is no longer a well-recognized name or figure? The imagery in the novel is striking. There are many scenes where the description amounts to a visual painting:Beneath his umbrella, he was hatless and dressed in a dark raincoat. The charred buildings behind him were dripping and the remnant of some gutter was making a large amount of rainwater splash down not far from him. I remember a truck going by between us, full of building workers. And I noticed how one of the spokes of his umbrella was broken, causing some more splashing just beside his foot.If I could paint, I would paint this man, for I can see him and I can see how broken he is and how all of his physical environment echoes his loneliness and sorrow.In a world that is changing, that has already changed, post-war Japan, Mr. Ono is a fish out of water, a man who cannot reconcile his version of his life or his country with the version that is presented to him by his children or his society. He struggles to see why his masterpiece is now a forgery, or at the least a mistake. And, Ishiguro captures his struggle perfectly. The best things, he always used to say, are put together of a night and vanish with the morning. What people call the floating world, Ono, was a world Gisaburo knew how to value.Perhaps all things are temporary, fleeting, gone in an instant, and perhaps the only success or victory in life is to be able to see them momentarily and appreciate their value."}, {"userName": "Pedro Casserly", "userReviewDate": "Dec 06, 2017", "userURL": "http://www.goodreads.com/user/show/33457409-pedro-casserly", "userReview": "Kazuo Ishiguro, Premio Nobel 2017, nació en Japón pero vive desde niño en Gran Bretaña. Ha mostrado su cultura británica en la novela The remains of the day, conocida en Argentina como Lo que queda del día. En Un artista en el mundo flotante (de igual modo que en su novela debut, Pálida luz de las colinas), muestra su cultura japonesa, no sólo por la localización de la novela, sino por el estilo amable, sereno y desapegado de la narración. Masuji Ono es quien nos habla, desde el Japón de post-guerra. Es un artista retirado que se ocupa de su vida familiar, y mientras hace las gestiones para asegurar un buen matrimonio a su hija menor, va deshilando recuerdos de su vida. Su trayectoria como pintor, con sus distintos maestros, buscando capturar la belleza que el ojo no ve, el mundo flotante. \"Lo mejor en la vida, me decía siempre, se vive una noche y desaparece con el día, Ono, eso que la gente llama el mundo flotante, es un mundo que Gisaburo sabía apreciar muy bien\".Y también como un hombre de acción, en los períodos turbulentos de la restauración imperial. \"Como él decía, siempre es una satisfacción saber que lo que hicimos gente como él y como yo, lo hicimos de buena fe. Reconozco que, a veces, tomábamos decisiones demasiado audaces y, a menudo, actuábamos sin pensar en las consecuencias, obsesionados por una idea; pero más vale eso que no atreverse a expresarla por falta de voluntad o coraje\". No todo en la vida de Masuji Ono es puro y digno. Pero Ishiguro, a través de su elegante prosa, se aleja de cualquier condena para no interferir en nuestro acercamiento a cada personaje. Para quien pueda leerla con serenidad y sin prejuicios, una excelente novela."}, {"userName": "umberto", "userReviewDate": "Dec 07, 2012", "userURL": "http://www.goodreads.com/user/show/2580971-umberto", "userReview": "This was the first novel, by Kazuo Ishiguro, that I finished reading due to its seemingly familiar title mentioning \"the Floating World\" I first found in Ihara Saikaku's stories. From its 206 pages, I think, most readers should find reading it quite manageable as guaranteed by its Winner of the Whitbread Book of the Year Award in 1986. Reading it, as for me, was relatively enjoyable since I needed concentration in following various episodes and its key protagonist named Masuji Ono, the eminent painter, during his retiring years in the midst of his family, neighbours and friends after World War II ended. However, I think there are a few points after reading it worth mentioning so that my friends, perhaps, would like to follow suit and may suggest more ideas for creative reading in this community.First, it was mildly disappointing to me when I could come across the words 'floating world' after reading pages after pages till I reached this paragraph:We lived throughout those years almost entirely in accordance with his (i.e. Mori-san's) values and lifestyle, and this entailed spending much time exploring the city's 'floating world' -- the night-time world of pleasure, entertainment and drink which formed the backdrop for all our paintings. ... (pp. 144-145)I could not help wondering if this was similar to what I read in Ihara Saikaku's stories. However, from the context I think the author has applied such the floating world as the aftermath of Japan's unthinkable calamity in the world of impermanence.I would like to invite my friends to read this four-paragraph scene (pp. 8-9) preceding this excerpt below and appreciated the author’s writing style in which his readers, I think, could visualize such serene, noble and kind elderly ladies paying a visit to Masuji Ono on the prospective house and land sale: It was an eccentric procedure, but I saw nothing objectionable about it; it was, after all, much the same as being involved in a marriage negotiation. … When I gave my consent to the investigation, and expressed my gratitude to them, the younger sister addressed me for the first time, saying: ‘Our father was a cultured man, Mr Ono. He had much respect for artists. Indeed, he knew of your work.’ (p. 9)From these dialogs, we can see this is simply magnificent; I mean sheer pleasure derived from good, exceptional prose with its literary aesthetic impact on the mind. That is one of the reasons why we, I think, still enjoy reading hopefully in search of our favorite authors worldwide. In essence, this part is worth spending our time in the midst of our sometime chaotic world, that is, we can relax ourselves, imagine and be happy.I also admired another episode depicting Mr Ono’s initial encounter with Dr Saito around sixteen years ago, after having moving into his new house, while adjusting something he became aware of someone stand behind him:I turned to find a man of around my own age studying with interest my newly inscribed name on the gatepost. ‘So you are Mr Ono,’ he remarked. 'Well now, this is a real honour. A real honour to have someone of your stature here in our neighbourhood. I am myself, you see, involved in the world of fine art. My name is Saito, from the Imperial City University.’ ‘Dr Saito? Why, this is a great privilege. I have heard much about you, sir.’ … (p. 131)This lively, educated dialogs between these senior men should be cherished because each has his own way in conversing with honor and respect towards the other.Therefore, I think, this is one of the novels that its readers should enjoy reading to know and understand such typical Japanese familial relationships since we can appreciate their politeness, controversies and tolerance. From its 206 pages we could leisurely browse a few pages or more at our heart’s content till the end and apply our reading as a solid background for his other novels."}, {"userName": "Boris", "userReviewDate": "Feb 18, 2018", "userURL": "http://www.goodreads.com/user/show/11501632-boris", "userReview": "Това е може би най-японската книга на Ишигуро.Ситуацията е в следвоенна Япония. Дискусиите в романа са обичайно заподозрените - реконструкция на миналото, как войната се отразява на малкия човек, или още по-конкретно - на човекът на изкуството? Източните ценности присъстват много силно. До какво може да доведе чувството за вина и докъде може същото да те извиси?Въпроси, чийто отговор е различен във всяка една страна, която е преживяла Втората световна война. Ишигуро дава отговорите и повдига нови въпроси, сякаш от името на Япония. Хареса ми. Бих я сравнил с Остатъка от деня. Но много по-японска."}, {"userName": "Kavita", "userReviewDate": "Oct 04, 2016", "userURL": "http://www.goodreads.com/user/show/5858699-kavita", "userReview": "I liked the theme of the book, the setting, and what it is trying to say. I even enjoyed the writing and the details of post-war life in Japan sporadically. I just found the book in its whole rather boring. I really enjoy this style of narrative in films and Japanese films like in Cha no Oji or Tenten, which are good examples of this style. But it didn't work well as a novel for me.I am not completely sure what the author is trying to say either. Was it an apology for Japan's excesses during the war? Was it disillusionment with the kind of world Japan had built after the war with no place for many traditional values? Was it annoyance with the Western, and specifically American, culture that the Japanese had begun to admire without critical evaluation? Maybe all of these?The family dynamics were intriguing, though the characters were not endearing. The narrator was not sympathetic, and I think we could have done without the endless discussion of indoctrination between grandfather and grandson about how weak women are. I think this annoyed me the most and put me off the narrator. I also didn't think much of him for what he had done to Kuroda and then tried to excuse himself. This is my first book by this author. I have heard so much about Ishiguro that I expected much more and am rather disappointed. I mean, it's post-war Japan! It ought to have been more interesting!"}, {"userName": "Czarny Pies", "userReviewDate": "Oct 20, 2017", "userURL": "http://www.goodreads.com/user/show/29160274-czarny-pies", "userReview": "Kazuo Ishiguro le lauréat du Prix Nobel de Littérature de 2017 est en très grande forme dans \"Un artiste du monde flottant\". Le défaut de ce roman le plus souvent signalé est qu'il ressemble trop au roman qui l'a suivi \"Les Vestiges du jour\". La reprise est sans le moindre doute meilleure mais je suis très content qu'Ishiguro nous a donné les deux romans.J'ai des petites réserves à l'égard de l'authenticité de \"Un artiste du monde flottant\" dont les événements se déroulent au Japon parce qu'Ishiguro est un anglais. J'ai trouve que les actions et les pensées des personnages du roman d'Ishiguro ressemblaient beaucoup à celles des \"Quatre sœurs\" de Tanizaki. Donc, on peut facilement croire que le portrait du Japon de l'après la guerre que présente Ishiguro dans \"Un artiste du monde flottant\" est fiable. Pourtant on ne peut pas être certain qu'Ishiguro nous présente un Japon qu'il a connu. C'est possible qu'il l'ait emprunté de Tanizaki et d'autres."}, {"userName": "Pantelis", "userReviewDate": "Oct 05, 2016", "userURL": "http://www.goodreads.com/user/show/59132978-pantelis", "userReview": "\"The likes of you and me, Ono, when we look back over our lives and see they were flawed, we're the only ones who care now\"An old man's guilt is absolute loneliness, ultimate insomnia..."}, {"userName": "AC", "userReviewDate": "Feb 21, 2014", "userURL": "http://www.goodreads.com/user/show/1655437-ac", "userReview": "What a rich and marvelous novel. And what emotional depth Ishiguro displays.... I not only thoroughly enjoyed this book, I admired it. Highly recommended"}, {"userName": "Dacko", "userReviewDate": "Mar 22, 2017", "userURL": "http://www.goodreads.com/user/show/47530076-dacko", "userReview": "Sitnice koje se pamte, upečatljive scene, opipljiva atmosfera, virkanje u tuđu kulturu - čist čitalački užitak, a opet, nije to 'moja' knjiga, neka koju bih čitala dva puta ili nagovarala druge da je čitaju, što mi je preduslov za više zvezdica. I znam da sam surovija prema mejnstrim knjigama nego prema žanrovskim, valjda od ovih drugih imam manja očekivanja i ako me zabave - to je to, dok prve poredim sa mnogo jakim prethodnicima, što nije fer, ali eto.Važna napomena: ako čitate u prevodu (Deretino izdanje), ne čitajte ono što piše na koricama pre nego što pročitate samu knjigu."}, {"userName": "Calzean", "userReviewDate": "Oct 04, 2017", "userURL": "http://www.goodreads.com/user/show/26416859-calzean", "userReview": "Post WWII Japan. The recent past bites the lives of those who supported Japan's dreams of a single Asian empire. The narrator was an artist who supported the Emperor and now lives with regret, guilt, ageing, and loneliness. The conflict between the young looking forward and those blamed for the Japanese position was the highlight for me in a book of few words but with clear intent."}, {"userName": "Lyubov", "userReviewDate": "Mar 18, 2018", "userURL": "http://www.goodreads.com/user/show/17778059-lyubov", "userReview": "Ишигуро <3"}], "description": "This is the story of an artist as an aging man, struggling through the wreckage of Japan's World War II experience. Ishiguro's first novel.", "title": "An Artist of the Floating World", "url": "http://www.goodreads.com/book/show/18144266-an-artist-of-the-floating-world", "average": 3.74, "cover": "https://images.gr-assets.com/books/1372714599l/18144266.jpg", "reviews": 1288, "authors": [{"url": "https://www.goodreads.com/author/show/4280.Kazuo_Ishiguro", "name": "Kazuo Ishiguro"}], "type": ["Fiction", "Cultural", "Historical", "Literature"], "outlinks": ["http://www.goodreads.com/book/show/18144266-an-artist-of-the-floating-world", "http://www.goodreads.com/book/show/28922.An_Artist_of_the_Floating_World", "http://www.goodreads.com/book/show/742138.An_Artist_of_the_Floating_World", "http://www.goodreads.com/book/show/901446.An_Artist_of_the_Floating_World", "http://www.goodreads.com/book/show/9748769", "http://www.goodreads.com/book/show/527504.An_Artist_of_the_Floating_World", "http://www.goodreads.com/book/show/2851123-an-artist-of-the-floating-world", "http://www.goodreads.com/book/show/30840837-an-artist-of-the-floating-world", "http://www.goodreads.com/book/show/20746681", "http://www.goodreads.com/book/show/2327573.Un_artista_del_mundo_flotante", "http://www.goodreads.com/book/show/210892.An_Artist_of_the_Floating_World", "http://www.goodreads.com/book/show/38494597", "http://www.goodreads.com/book/show/13515010-an-artist-of-the-floating-world", "http://www.goodreads.com/book/show/27760706-slikar-prolaznog-sveta", "http://www.goodreads.com/book/show/6334.Never_Let_Me_Go", "http://www.goodreads.com/book/show/28921.The_Remains_of_the_Day", "http://www.goodreads.com/book/show/22522805-the-buried-giant", "http://www.goodreads.com/book/show/28923.When_We_Were_Orphans", "http://www.goodreads.com/book/show/28920.A_Pale_View_of_Hills"]}