{"ratings": 4797, "userreviews": [{"userName": "Rebecca Foster", "userReviewDate": "Nov 20, 2012", "userURL": "http://www.goodreads.com/user/show/5875398-rebecca-foster", "userReview": "When she was a teenager in Boston, McCracken was approached by a panhandler with a card reading I AM DEAF. She sympathizes with this tacit approach, thinking “surely when tragedy has struck you dumb, you should be given a stack of cards that explain it for you...This book, I am just thinking now, is that card” – a way of telling the world My first child was stillborn.McCracken and her husband, a fellow writer and professor, had sojourned in Berlin, Ireland and England before settling into a ramshackle farmhouse in the Bordeaux region of France to await the birth of their first child. The pregnancy went beautifully; it was an idyllic time in their marriage. There was not a hint of trouble until McCracken went to the midwife a week past her delivery date and was told that, although the heartbeat wasn’t as strong as might be hoped, everything seemed fine.Whether she didn’t want to kick up a fuss over nothing in a dramatic American style, or whether something was lost in translation in the conversation with the French midwife, McCracken left it at that. By the time she made it to a hospital, her son was dead. She had to go through the agony of labor only to produce a tiny corpse. They named their boy Pudding, the name he’d been known by in utero all along; “I’m glad we were in a foreign country. The French probably thought it was an ordinary Anglo-Saxon name, like William, or Randolph, or George,” she wryly notes.I didn’t much like McCracken’s celebrated novel, The Giant's House, but this memoir of losing a child is exquisitely written – a worthy companion to Ann Hood’s \nComfort: A Journey Through Grief\n and Joan Didion’s Blue Nights. Every line is worth rereading and quoting. I feel I’ve learned so much from it about how to relate to people who are grieving: for example, McCracken says she never tired of hearing the simple words “I’m sorry,” and always appreciated people’s efforts to commiserate with her, no matter how clumsy or trite. Saying something is what matters, rather than pretending nothing has happened. I have certainly been guilty of this crime of omission.Although she’s come to believe that “closure is bullshit,” this is a bittersweet book about moving on with life, finding that it doesn’t end even when you might (temporarily) wish it would. McCracken and her husband now have two children, but there is no replacing Pudding. The book’s concluding lines are amongst the most beautiful I have ever read: “It’s a happy life, but someone is missing. It’s a happy life, and someone is missing. It’s a happy life—”"}, {"userName": "Marcie", "userReviewDate": "Mar 08, 2012", "userURL": "http://www.goodreads.com/user/show/4314393-marcie", "userReview": "It's so hard to find the right words to describe this beautifully written poignant book. It sat on my to-read list for about a year and I put off reading it in large part because I became pregnant with my first child shortly after adding it to my list. (I didn't want to freak myself out) Then, when I lost my baby 4 days before his due date, it became an urgency to get my hands on it as if I could somehow procure the answers to my own situation by simply reading a book. I checked it out from a library 6 days after my son's death. It didn't offer me answers, there are no answers for losses such as these, but it gave me something else far more valuable - a deep connection to another women in my situation. I'm so grateful I had this book to turn to through the first month of my grief.Early on in the book McCracken states that this is the happiest story in the world with the saddest ending, but I found the opposite to be just as equally true. This book is incredibly sad - there is no question about it. It is also one of the happiest books I've ever read about losing a baby. It is brimming with both despair and hope. I related to it on so many levels and was often stunned by some of the similarities to my own situation and thoughts. I found it so much more comforting than anything about angels or going towards the light. It embraces the the reality of the here and now instead of trying to find easy solutions, gloss over the ugly parts, or build up the spiritual unknown. It doesn't over-analyze. It just accepts the seamless mingling of grief, pain, love, and joy as they are. I thought it was funny that she wished for a book that shared the lighter side of losing a child because, through her honesty, optimism, and resilience, she manages to produce that very book for others. This is a must-read for anybody who has lost a baby or for anybody that wishes to better understand someone that has."}, {"userName": "Beverly", "userReviewDate": "Apr 04, 2009", "userURL": "http://www.goodreads.com/user/show/1040177-beverly", "userReview": "I read this book on a recommendation of a friend who is familiar with the fact that I have gone through a similar experience in my own life. I, too, have delivered a stillborn son. What is ironic is that I had ordered this book off of Amazon, and it was delivered (and I started reading it) the day before the anniversary of my son's birth/death. I think the author did a wonderful job of putting her grief into words. I related to so many things that she said, felt, and did. My heart was breaking for her loss, while simultaneously breaking yet again for our own. I completely agree with her assessment of feeling an immediate bond with those who have a similar experience. I, too, was able to get pregnant almost immediately after our loss, and I also related to her panic clear through the next pregnancy. In all, I thought it was raw and honest. Maybe not for everyone. But, for me, good to see my own emotions in writing - knowing I'm not alone in the way I felt and still feel. Well done, and thank you to her for writing it."}, {"userName": "Katie", "userReviewDate": "Dec 30, 2008", "userURL": "http://www.goodreads.com/user/show/80861-katie", "userReview": "A hard book to comment on, but I will say that I read it in one night/morning, as I suspect most people do who pick it up. Also: I would like to take all my lessons in how to handle maternal grief and anxiety (when/if I experience it) from a three-headed oracle of Rachel Zucker, Joan Didion, and Elizabeth McCracken. The three of them should replace Hallmark permanently."}, {"userName": "Christy", "userReviewDate": "Dec 21, 2008", "userURL": "http://www.goodreads.com/user/show/1384976-christy", "userReview": "A thin, beautiful, sad - but defiant - book about the loss of a baby. It begins with the flat warning: \"Someone dies in this book. A baby.\" McCracken married her British husband in her late thirties and was thrilled to be living together in Bordeaux and pregnant with their first child (nicknamed Pudding.) Amidst the knocking on wood, the name games, and the well-wishes of friends and strangers, something goes very wrong and Pudding dies before birth. The book is written with a son finally born one year and five days after Pudding's death. It is a love letter to Edward (McCracken's husband), a card to the general public to explain (the death of a child never truly disappears), and a story for McCracken's living son, Gus. I have never lost a child; I have never thought of the traumatic removal of future hopes and dreams, the amputated feeling of loss that McCracken felt and still feels being the mother of a ghostly son, Pudding, and his very real successor. McCracken is funny, refuses to be over-sentimental, and consistently withholds artifice from the reader. A great, elegiac read."}, {"userName": "Charles", "userReviewDate": "Jan 22, 2011", "userURL": "http://www.goodreads.com/user/show/3486245-charles", "userReview": "I am not a curmudgeon. I have several living children. As a man, anatomical constraints have established that none has been carried in my womb or delivered through my loins. I have never lost a child; I hope that I never do.That being stated, writing about a devastatingly sad subject in a lyrical, emotionally honest, heartfelt, warm, sad, funny manner may make a great subject, and may elicit sympathy and empathy (those not being bad things at all), but does not necessarily make a great book. I am not indifferent to her story, her tragedy, her pain, her deep sadness, and the process – slow, not steady, never assured – of reluctant but necessary acceptance and the lifetime process of healing. I understand – or think that I do -- her difficulties in trying to understand if poor little Pudding is alive or dead, born or not, as well as her grappling with her baby’s death preceding birth. Her pain is real and palpable, and one that I hope I never experience.Nevertheless, while I found the short story to be deeply personal, I concluded that, in essence, it was a self-indulgent eulogy and catharsis."}, {"userName": "Deanna Roy", "userReviewDate": "Mar 09, 2011", "userURL": "http://www.goodreads.com/user/show/5101058-deanna-roy", "userReview": "When I first picked this book up in 2008, I put it down again within a few pages. I was upset.I too had lost a baby, three, in fact, and when McCracken called my wish for pictures a \"fetish\" and seemed to suggest I was wrong or strange for wanting footprints and memory boxes and any sort of artifact, I just couldn't read on.But here, three years later, a new friend suggested I try it again. I'm glad I did, as once I was past that hurt, I could see McCracken had written a clear-eyed memoir, used her beautiful talent with words to paint a picture of her loss on her terms. And along the way, she taught others who have never lost a baby how to handle us.There are so many ways to upset us, our difficult sorority of mothers-in-grief. Most books do. Mine probably will as well. Another amazing beautiful book of stories is \"About What Was Lost,\" which is well crafted but often harshly criticized for having mingled stories of abortion in with miscarriage. Perhaps there is no way to truly win us over; maybe we are too close to our losses and our own difficult tales. But McCracken has done the job about as well as it can be done."}, {"userName": "Edan", "userReviewDate": "Aug 08, 2008", "userURL": "http://www.goodreads.com/user/show/27925-edan", "userReview": "I read the excerpt of this in Oprah Magazine and it moved me more than anything I've read in a long, long time. ***Okay, so yesterday when I was sick with a weird, spacey cold, I lay in bed and read this book. It's beautiful, and incredibly sad, and what happened to Elizabeth and Edward is terrible. This book is so honest...I'm having a hard time writing this review, perhaps because the events in the book, both the awful and wonderful ones, feel too big to summarize or comment on."}, {"userName": "Megan", "userReviewDate": "Jun 29, 2010", "userURL": "http://www.goodreads.com/user/show/295070-megan", "userReview": "I was surprised to see AN EXACT REPLICA... compared by a reviewer to THE YEAR OF MAGICAL THINKING by Joan Didion: I can't think of two books which approach the same subject matter (the death of a loved one) more differently. Where Didion is most essentially writing about her own death--at least, the end of her family and context and relevance and time--McCracken is talking about trauma, a personal shame. Death is a whole different matter for old people than it is for young people. Which probably explains another thing that surprised me about this book: how similar McCracken's ordeal was to what I went through when I was diagnosed with a rare form of cancer last year, at age 22. I picked it up in a book store yesterday (and finished it last night at 3 AM) with the same hideous, gossipy impulses that cause anyone who hasn't suffered much lately to be interested in the pain of others. And it is to her credit as a writer that McCracken never lost that part of me--the part that loves a good story. But three things hit me unexpectedly. First, the jealousy. When she talks about her friends who were pregnant at the same time as she was (who email her pictures of their babies, or say, \"How is motherhood? Your son must be one already!\") she doesn't say it directly, but you can feel her grief and rage and frustration and yes, jealousy pouring off the pages. She exudes a sick feeling of inadequacy compared to these women, for whom pregnancy was so easy. I had the same feeling when I was diagnosed: your life path seems to diverge--you are no longer like other young women--and while you don't resent other people for living while you are suffering, they become distant from you: you are not someone who can be comforted by statistics (as McCracken says) when you've come down on the wrong side of such amazing odds. I remember, for instance, having dinner in Williamsburg one night when I was going through chemotherapy, and watching a very young woman whine very loudly about how she had left her cigarettes at home. That morning, in my oncologist's office, I'd read that lung cancer is the number one killer worldwide. But it wasn't just the smoking--it was the fearlessness I was jealous of, it was how much she cared about what other people thought of her. She was still a young person. AN EXACT REPLICA... articulates what it means to be a young person inside of a hospital room, inside of a trauma, looking out at healthy people living the happiest moments of their lives. The second thing is the guilt. The most moving moment in the book is when McCracken finds out her baby has no heartbeat, and she thinks, \"people are going to be mad at me.\" She plays this moment brilliantly, saving it for last--the book is structured so that we start with the aftermath of the loss of the baby, then read about her second pregnancy, and finally, see the moment at which she delivers the first--so that we understand that her desperation and sadness are emotions she holds close to her chest; at that point, we're not strangers she's shrieking her sorrow at in a bloody white Victorian nightgown and matted hair (to borrow her image). It sounds unbelievable if a medical emergency has never happened to you, but self-pity really isn't the first thing that goes through your head. (As McCracken points out, we usually seem to reserve our self-pity for moments when we're crying our eyes out over a man or some silly thing.) It's guilt for what you are putting your family through: the first thing I thought when the doctor told me there were cancer cells in my tumor was, I do not want this for my sister--my sister will not be defined as The Girl Whose Sister Died Young of Cancer. (I could hear it: \"Oh, it's so sad, her sister died of cancer ten years ago.\" I didn't feel comfortable around her until I found out that the cancer wasn't going to kill me.) The other thing you are ashamed of is your basic innate physical inability to do what other women do. That is why you simply cannot speak to certain other women after it happens, in particular, those who were never close enough to you to trust before the trauma occurred. Which brings me to this: when you have a traumatic event happen to you, some people really do stop talking to you. McCracken writes about the friend who took three months to offer her condolences with a lame excuse for herself--and whose words of grief were correspondingly wooden and cliche. My grandmother asked my mother three times for my address to send some sort of hypothetical greeting card--\"Sorry you got cancer?\"--I never received one. My sister told my cousin, who had been my absolute best friend in the world as a two year old up until college, and she never emailed or called me. My mother got a phone call from her a full year after my diagnosis--inviting us to her wedding (\"I've been kind of an asshole for not calling,\" she said). It's shocking who doesn't call. But it's also shocking who does. How many friends of friends of friends would do anything to help. Like McCracken, I had no idea how much this communal outpouring would mean to me. And it did. People are almost afraid to touch you when you go through some sort of statistically extraordinary trauma, as if you're contagious and ready to pounce, without realizing that almost anything they say is the right thing to say as long as they say it--and mean it (you can tell, and I can tell, and Elizabeth McCracken can definitely tell). But you know what? This is not a book about \"coping,\" and hallelujah for that. McCracken says something to the effect of \"Fuck closure,\" and it's true that there is nothing that helps less than pop psychology bullshit terminology, words like \"closure\" and \"the grieving process\" and \"forgiveness.\" (True story: I was prescribed acupuncture by my oncologist to help with nerve damage. He said, \"I feel some anger around you--do you know anyone around you who might be angry?\" Yes, actually, what I am is fucking furious.) AN EXACT REPLICA... is about walking inside the closet of grief and staying there for a long time, and losing yourself in sadness, and then coming back to yourself and knowing you are an entirely new person who will \"never be a woman whose first child did not die\" or never be a woman without cancer. My boyfriend lost two grandparents while I was going through chemotherapy, and we were unable to attend one of the funerals. The thing I found him always having to explain is that these people who die as grandparents have long, happy lives behind them. So while sad, their deaths are also understandable. There is a fairness, a natural order to this that human beings have spent centuries collectively making sense of. The death of a child, the death of a young woman--there isn't any sense. Even an autopsy of McCracken's child is inconclusive, so his death will always be a mystery, and at that moment you, the reader, think, my GOD, what else can this poor woman go through? (One of the hardest things for me was that my cancer is not caused by genetics or the environment. \"So what the hell IS it caused by?!\" I asked my doctor. \"We don't know.\") Of course, doctors are never very good at saying \"We don't know,\" which is why McCracken's midwife starts trying to place the blame on her only hours after the baby is born dead (\"Elizabeth, are you sure you were careful about what you ate?\" she asks, as McCracken is recovering from laboring and delivering a dead child). McCracken knows her memoir is also a love letter, but she wonders if she is writing a love letter to Pudding (the stillborn child), to her husband Edward, or to her living children (Gus, born only a year later, and Matilda). I think it is a love letter to other young women going through what she has gone through. She writes of recognizing other women who gave birth to stillborn children as part of a new family tree. And she struggles to remind herself that you never know what someone else is going through (the most important thing I learned from getting cancer--you truly never know). This is a book that had to be written, for the growing number of young women going through cancer--because no, it is NOTHING like your grandmother dying of cancer at 87--and for mothers going through the loss of a young child."}, {"userName": "Shelah", "userReviewDate": "Feb 25, 2009", "userURL": "http://www.goodreads.com/user/show/1193774-shelah", "userReview": "In An Exact Replica of a Figment of My Imagination, Elizabeth McCracken writes, sometimes in excruciating detail, about her experience giving birth to her first child, who was stillborn. It's both a hard book to read and a hard book to put down, and much more gripping than McCracken's fiction. It's not a book I'd give to a grieving mother who has just gone through the same experience, but maybe one I'd give to someone a few months later. She writes beautifully about the pregnancy, the birth, the aftermath, and ultimately, what it feels like to do it over again. I want to be able to write like this-- the pain, the beauty, all of it. But I don't think anyone wants to have this kind of experience in order to be able to have this kind of gift. As an aside, McCracken and Ann Patchett went to school together and she mentions her friend Ann multiple time throughout the book, and it's fun to see the real-life friendship of these two talented women."}, {"userName": "Lisa Lieberman", "userReviewDate": "Jul 15, 2014", "userURL": "http://www.goodreads.com/user/show/4742884-lisa-lieberman", "userReview": "I enjoyed this memoir, but the writer in me was always conscious of the choices McCracken was making, the analogies she chose to convey her pain, the timing of her revelations (like waiting until the very end, when she was going into labor with her second child, before telling us what she blamed herself for the most re: her first pregnancy). I appreciated her more, as a writer, for the choices she made; I could understand why she structured the book the way she did, why she withheld this information. It made the story more moving, kept us turning the pages. And I suspect that the process of making a story of her experience was necessary for McCracken, and it might help others whose pregnancies have ended in stillbirths feel less alone. She's found words to describe her sadness, her and her husband's shared pain and loss, and having those words is consoling, even if they don't take the pain away. But a book in which the scaffolding is so evident, while instructive, is not a great book. I will go further: putting an experience into words is a way of gaining distance and that's necessary, so we can go on with our lives after trauma and loss. Those programs where veterans or prisoners or homeless people are encouraged to write fiction or poetry serve a useful function, I think. And (as McCracken said) the process does not provide closure. There is no closure. Ever. You find one way of telling the story or an apt metaphor that conveys one aspect of your pain -- the way you felt on a particular day, say -- but you know the story's more complex than you can ever capture on the page. And the pain will come at you from a different direction the next time, catching you unawares, so what you understood when you wrote about it before is irrelevant now.This may be a problem with the memoir genre. Even when the author circles around her subject, coming at it repeatedly, and from different angles, she cannot present it with all the nuances that come across in a work of fiction. I'm trying to think of a memoir that struck me as a great book, as great as one of the novels I love. It may come back to the quote I put in earlier this week, to honor Nadine Gordimer (Burger's Daughter is a really great book, by the way): \"Nothing factual that I write or say will be as truthful as my fiction.\""}, {"userName": "Diane", "userReviewDate": "Nov 24, 2008", "userURL": "http://www.goodreads.com/user/show/279256-diane", "userReview": "One of the best books I've read this year."}, {"userName": "Amy", "userReviewDate": "Jan 05, 2011", "userURL": "http://www.goodreads.com/user/show/2190268-amy", "userReview": "I read this book when it was recommended by an author on NPR for their \"You Must Read This\" segment. It's a memoir by a woman whose first child was stillborn, and the reviewer described it as both funny and tragic. She said she finally decided to read it when a co-worker laughed out loud while reading a book and when the reviewer asked about it, it turned out to be this one. I have to say I didn't do any laughing out loud when I read it, but then again, I rarely do anyway. I read it because my first child, also a son, was stillborn and I was interested to read someone else's account. There was a lot I could relate to. I'll share some passages that resonated with me:\"After the baby died, I told Edward over and over again that I didn't want to forget any of it; the happiness was real, as real as the baby himself, and it would be terrible, unforgivable, to forget it. His entire life had turned out to be the forty-one weeks and one day of his gestation, and those days were happy. We couldn't pretend that they weren't. It would be like pretending that he himself was a bad thing, something to be regretted, and I didn't. I would have done the whole thing over again even knowing how it would end.\"\"'Oh Elizabeth,' my friend Lib wrote, 'these past ten months did happen, Pudding did happen, we won't forget him. He's part of our family, one of those cousins or great-aunts that not everyone has met but is still part of the whole damn sweet sad picture.'\"Our experiences were in many ways similar; we both took good care of ourselves, and sometimes felt smugly superior in our prenatal habits, never anticipating a negative outcome. (She writes of a friend in France who became pregnant while Elizabeth was pregnant with Pudding, who continued to smoke and drink throughout her pregnancy but who later delivered a healthy baby.) Hers was her first, and a son, as was mine. She wanted a minimal-intervention pregnancy and birth. She didn't worry much during her first pregnancy. I could also relate to the aftermath, to the never being sure of anything, to the future being an \"if\" not a \"when\". She wrote it from the other side of her second pregnancy, with a healthy baby son. I'm not there yet, being only 17 weeks into my second try at a happy ending. I can't tell you everything that was true for me in this book because so much of it was. I hope that someday I can write an account of my own experience in a way that would make it something others would want to read. In the meantime, if you want to read a moving, honest account of an experience such as ours I recommend that you pick it up. Don't be afraid of the subject matter. It has a happy ending. I'll even end this review with her words:\"It's a happy life, but someone is missing. It's a happy life, and someone is missing. It's a happy life--\""}, {"userName": "Jillene", "userReviewDate": "Mar 09, 2011", "userURL": "http://www.goodreads.com/user/show/4444195-jillene", "userReview": "I recently had a son who was stillborn and I read this book on the recommendation of others. I did not feel that I could relate to the author very well. Maybe my grief is still too new? I'm just not processing things the way she did and neither of us is wrong. We are different people, of course we will grieve differently. I think I was just hoping for more of a sense of someone else getting it. I cannot imagine chosing not to have pictures or to not hold him. For me, I wanted it all. As much time with his body as I could have, as many pictures as we could take, the plaster cast of his hand and foot. I needed the physical proof that he was real and he existed, even if he never lived outside of my womb. He still lived. We named him, we held him, we kissed him and we took pictures. Our older children held him and touched him. We talked and we cried and we spent as much time with him as we could. He touched so many lives. I cannot imagine having nothing of him but memories that will fade in time and a book that I've written. I'm not saying her choices were wrong. They're hers and not for me to judge. Just that those choices are not for me and it made it hard for me to relate to her as a result. I just felt really detached while reading her story and it wasn't the reaction I expected or was looking for."}, {"userName": "Jennie", "userReviewDate": "Feb 08, 2015", "userURL": "http://www.goodreads.com/user/show/702266-jennie", "userReview": "Even though Elizabeth's McCracken's loss is different from my own, I was comforted by her ability to articulate her grief. She touched on some things that were so acutely personal to my own experience of pain. I too, wished I could just hand people a card, or wear a t-shirt that said, \"My mother just died\" in the wake of my calamity. It's agonizing to walk through the world feeling gouged by grief and yet know that you are lobbing a grenade into the conversation when you tell someone. I also felt a strong connection to her words about people responding to her experience. All those cards and hugs and small gestures make such a huge difference - even just having someone acknowledge that you have been through a traumatic, life altering experience is affirming. Having witnesses to your suffering, people to reflect back to you - this is real, it happened. McCracken's words are a great reminder that even when we feel pathetic in the face of grief, just helping someone sit with it for a minute can be tremendously valuable."}, {"userName": "Arryn", "userReviewDate": "Apr 01, 2009", "userURL": "http://www.goodreads.com/user/show/972812-arryn", "userReview": "This book was a heartbreaking memoir about loss and life. There are no surprises here--McCracken tells you right up front that \"a child dies in this book: a baby. A baby is stillborn,\" and then adds that a healthy baby is born in this book, too. I was riveted by the story, told in bits and pieces, moving backward and forward fairly fluidly, leaving holes that weren't filled until the end. The writing is stark and honest, yet poetic in its simplicity. It reminded me in so many ways of Joan Didion's The Year of Magical Thinking. I felt like I was tiptoeing through the pages of Elizabeth McCracken's journal and I was constantly rummaging through my bedside drawer for a pen so that I could mark some of her wrenching insights into her ongoing journey through grief. The book is sad, but not overly depressing. The prose is candid, blessedly lacking sentimentality. As I put the book down, I felt as if I had walked a mile in her heavy shoes and emerged a more compassionate person."}, {"userName": "Kyla", "userReviewDate": "Oct 28, 2008", "userURL": "http://www.goodreads.com/user/show/85937-kyla", "userReview": "If you are one of those people who say \"I'd read it but the subject matter is so DEPRESSING\" well then move on, dear reader, I do not suffer your disease. Sometimes I worry that I find material on mourning and grief and loss so compelling. but this is the rawest of raw materials and it is usually authentic and that is what I appreciate.This book has the added bonus of being beautifully, impeccably, stark."}, {"userName": "sarah gilbert", "userReviewDate": "Jan 20, 2011", "userURL": "http://www.goodreads.com/user/show/237974-sarah-gilbert", "userReview": "Can reviews for a book that begins at the end of the story have spoilers? I think not. I struggled whether to give this book three or four stars, and in the final accounting, it was McCracken's '0n Writing' notes at the end that swung it to three. She writes of her child who has lived, she describes him over and over (and, in my edition, oddly changes the date of his birth forward a year to 2008 -- I'm sure it's a misprint but it's jarring!). And then she insists that she would never have written a memoir about her own children, never write about being their mother. \"He was the hero of his own story,\" she concludes, and then does not conclude.And that (besides subtly jabbing at every mother who *does* decide to write in memoir form about her children -- and although McCracken is making this determination while her oldest living child is only three, ish) reminded me how this story begins at the end, and so has no end. It was written in -- what, a few weeks? -- surely no more than five, according to her description. It shows the speed of writing; the determined lack of revision; the raw newness of her feelings, not yet tempered so she can look at the nurse who said those horrible things (well, one horrible thing, asking memorably if Elizabeth \"wasn't very careful about what she ate\" after the baby has died) with more empathy. Surely we have all said things in grief we should take back; surely we have all handled a relationship badly. Her lost friend and the Frenchmen and women who people this book get no angle of view. The organization of the story is curious, and often confusing; we often get slightly conflicting viewpoints about a situation. Sometimes her present self (sitting at her computer with her new baby on her lap) is all over the page; sometimes it is remote and impossible.This book could be better. However, it is certainly a useful book in that it is a book to read if you have lost a child through miscarriage or stillbirth or infant death of any kind; if you have struggled with these questions and pains. Am I pregnant, if the baby is dead inside me? How is it that I look at children conceived when my dead child was conceived, due when my dead child was due? How do I tell people, do I tell people, of the missing child? Is an obstetrician's office not a terrible, terrible place for a woman who has lost a child? Yes, it is; yes, I've asked many of these questions myself. A separate entrance, I've often thought, should be arranged for women who are grieving for their children, not expecting them. Separate bathrooms. Different reading material, surely. Elizabeth and I share this conviction.I enjoyed the reading but I did not spend the whole of the book in tears; I felt that Elizabeth was the sympathetic heroine that she perhaps could have been with more perspective, more revision. I think this is a good first draft."}, {"userName": "King", "userReviewDate": "Jan 04, 2011", "userURL": "http://www.goodreads.com/user/show/1464457-king", "userReview": "Last semester, I took a group dynamics class. You basically sit around in a circle and the professor asks you to share stuff about yourself. It was a fun class, some days less than others. We had two students there who had endured complications in pregnancy, resulting in the loss of possibilities. When they shared this with the class, I didn't really know how to feel. But that is not quite right. All of us have an idea of what to feel, as the empathy modules in our brains activate. To be more precise, I knew what to feel but didn't feel it. One of the two females commented \"No one really understands.\" And perhaps that is why I was unfeeling. I think this book has helped me with that part and in doing so, I feel like I will know how to feel when next presented with such a \"calamity,\" as the author puts it. It's not such a nebulous concept anymore. I did find it interesting that discomfort was a common reaction. I guess the gravity of such things just shuts down our mental process and renders us mute. Like McCracken says, it is like the only two options we give ourselves is to say something incredibly sagaciously comforting or something incredibly idiotic. Fear of the latter takes over. But I learned, echoing Da Vinci's sentiments on simplicity (\"...is the ultimate sophistication.\"), a terse \"I am sorry,\" is sufficient. Some words are better than no words, because tragedy is not something to be avoided like a leper with the ebola virus. Words link us with others, and when we offer them to others, we tell them that they are not alone. The memoir, is happy and sad. The whole spectrum of emotions are encountered. Laughter, tears, anger, peace, longing, etc. It brings the stirring scene of Steel Magnolia where Sally Field's character goes through the grieving process to mind. It also reminded me of Rabbit Hole, Next To Normal and The Lovely Bones. But it is better than those, because this is real. It is good grief. Scratch that. It is beautiful grief. It's the kind of happy sad cocktail that makes you embrace life in all it happy and sad craziness."}, {"userName": "Nancy", "userReviewDate": "Oct 18, 2013", "userURL": "http://www.goodreads.com/user/show/2893266-nancy", "userReview": "\"Grief lasts longer than sympathy, which is one of the tragedies of the grieving.\"I listened to this memoir on audio. Then I listened to it again. It is moving and sad and beautiful, and I fear that any attempt to describe it here will sound at best morbid and at worst like a Lifetime movie. But McCracken's memoir about her experience giving birth to a still-born child is neither of these things. It is a thoughtful, carefully constructed narrative, a love letter to her husband, and the card she wished she'd been able to hand to everyone who inquired and still inquires brightly \"How are things with you?\"; for everyone who asked, upon observing her second pregnancy and seeing her second baby, \"Is this your first baby?\" The answer is complicated.In the first pages of this memoir, McCracken relates the story of a reading she did in a Florida library years before she'd even met her husband or thought she'd ever be a mother. A woman approached her after the reading and suggested that she write a book about \"the lighter side\" of the death of a child. Only now, writing about her own experience losing a child, does McCracken seriously consider what this woman may have been getting at. Her thoughts about the woman's request and its connection to her own grief riveted me:\"I want a book that acknowledges that life goes on, but that death goes on, too. That a person who is dead is a long, long story. . .Your friends may say, 'Time heals all wounds.' No, it doesn't, but eventually you'll feel better. You'll be yourself again. Your child will still be dead. The frivolous parts of your personality, stubborner than you'd imagined, will grow up through the cracks in your soul. The sad lady at the Florida library meant the lighter side is not that your child has died--no lighter side to that--but that the child lived and died in this human realm with its breathtaking sadness and dumb punchlines and hungry seagulls. That was the good news. She wasn't going to pretend that he hadn't, no matter how the mention of him made people shift and look away.\""}, {"userName": "Lisa", "userReviewDate": "Jan 12, 2011", "userURL": "http://www.goodreads.com/user/show/3503089-lisa", "userReview": "I saw the positive press reviews, but forgot about this book until my fiance' bought it for me on my kindle. I finished it in one sitting. I am unfamiliar with Ms. McCracken's other work, but lord, I hope her body of work is better than this self indulgent, aimless, superior, judgmental drivel. This was clearly a vanity work which served a private, very personal purpose and for that I say \"Bravo!, I hope it was therapeutic.\" But did you or your agent have to visit this sub-par work on the rest of us? Ms. McCracken brings no epiphany to the, admittedly, devestatingly sad subject matter - not even her own as far as I could tell. Ms. McCracken, I am truly very sorry for the loss of your child. But, as to your writing product, there is no way this work would have ever been published but for your previously established reputation. I'm sorry I wasted my evening on the book and that my fiance' wasted his money."}, {"userName": "esmepie ", "userReviewDate": "Nov 11, 2008", "userURL": "http://www.goodreads.com/user/show/810962-esmepie", "userReview": "Hard to take the story of a still born child and make it anything but a devestating read. But somehow Elizabeth McCracken is able to do this. I actually laughed out loud several times. This reminded me a lot of 'The Year of Magical Thinking.' McCracken is a cool customer too. I thought it was very interesting. It's a memoir of a child who never existed except as a hope and as a thought for the future. How do you mourn that AND continue to go forward into a future you no longer trust. Very interesting questions and thoughts on grieving and what it means to be a mother."}, {"userName": "Sharlene", "userReviewDate": "Jan 14, 2014", "userURL": "http://www.goodreads.com/user/show/17532491-sharlene", "userReview": "George Saunders said in a recent interview that one of his goals as a writer (and as a person) was to 'really be able to step up to the beauties of life and the horrors of it, without any kind of flinching,' and in this beautiful memoir about the death of her first child, Elizabeth McCracken does just that. Like WAVE by Sonali Deraniyagala, and Emily Rapp's THE STILL POINT OF THE TURNING WORLD, this is a searing, world-cracked-open account of loss, but it is also strongly, profoundly, a book about love, and reading it is a heart-expanding experience."}, {"userName": "Jessica", "userReviewDate": "Apr 13, 2009", "userURL": "http://www.goodreads.com/user/show/680129-jessica", "userReview": "When an author writes this amazingly, I pretty much feel stupid writing anything in a critique. It has a sad subject matter (it's a memoir), but her treatment of it is so genius, that you are left uplifted and wiser as a result. Highly highly recommended."}, {"userName": "Jimena", "userReviewDate": "Aug 09, 2013", "userURL": "http://www.goodreads.com/user/show/4832581-jimena", "userReview": "I'd like to say from the onset that this review is coloured by my own experience. My second son, Lorenzo, was also stillborn in eerily similar circumstances as those of Pudding. Therefore, while my review may be useful for mothers who have lost babies, it may not be so for other readers. For those other readers, I will say that this is a wonderfully written, profound book about love and loss. I understand that the author did not mean this to be a \"self-help\" book about coping with stillbirth, but for myself and many others, it has become just that. It is helpful because, with all of its specificities, stillbirth ravages the souls of those who have lived through it in much the same way. Elizabeth McCracken speaks of an extended family tree, where you suddenly have a kinship with complete strangers, who have, like us, given birth to death. So much of what McCracken says in this book fills my heart with hope and beauty. So much I have also felt but lack the ability to put into words as skilfully as she does. There are many passages in this book that broke my heart all over again but somehow helped it heal. I love the notion of the \"happiest story in the world with the saddest ending\" because that it exactly what it is. I was happy, as happy as I've ever been, during the nine months in which Lorenzo lived inside my belly. It was the happiest time of my life and it seems unfair that the pain of his death should rob me from such joy. I also completely understand and treasure the need for being happy and even laughing in the face of tragedy, as a way of remembering the person's life and not just their death. So many things resonated with me: how she didn't want to meet the babies of the women who were pregnant at the same time. How you remember the horrible and unhelpful things some people said at the time but your level of tolerance for bullshit is somehow, and happily, now zero (I too lost a few friends after their reactions to my \"calamity\" or lack thereof). How the words and actions of others are a wonderful comfort without which life would seem unbearable. I should say (again, this may only be useful for those who have gone through it) that some of the things the author said were tough because they confronted me with my choices. I made a few different choices and I had to remind myself constantly that this was just her experience because otherwise I would have been very uncomfortable with some of the things she says. For instance, the author and her husband chose not to take a picture of their deceased infant son because they were afraid that they would fetishize him. This is a valid choice, of course, as are all choices in these circumstances, but I chose to hold my dead baby for as long as I possibly could and took many pictures. My son's picture is on my dresser along with all my other treasured family photos, as I feel it should be. He is part of my family and this is the way I chose to honor and remember him. I doesn't torture me to look at the picture, it makes me happy and proud. Unwillingly, the author's words make similar actions sound even more pointedly like those of the crazy Victorian ghost she describes. I was also jolted when she said that she didn't know her child. She corrects herself later on but I hold a huge grudge against a friend of mine who said something much like this. Of course I knew my child. I felt his essence and energy develop inside me for nine full months. Again, this is just to pick out the things that made me uncomfortable, but I understand that the author does not intend to write a guide on coping with stillbirth but a memoir of her own experience. I only point this out for those who could be reading the book for similarly therapeutic purposes.Having said that, this book was overwhelmingly beautiful. Reading about the loss of Pudding made me find sorrow again, but it also made me see the beauty in all of it. It moved me to read my own feelings so adequately described. For example, the author talks about needing a card that explains what she has been through, much like the cards that the deaf and hard of hearing often use to sensitise those around them. I could not agree more... I always wish I had a way of telling people that was straightforward... a way of saying, without being cold or self-pitying, that my second baby died before he could take his first breath, while I have no desire to dwell, there is not a day or perhaps an hour that goes by without me missing him. Elizabeth says that perhaps this book is just that \"card\". I think it could be my \"card\" too and I wish everyone I know would read it. I am so grateful to the author for being brave enough to write this book. It made me feel so much less crazy and less alone in this particular type of grief. Perhaps she didn't even mean it to, but, as hard as it was for me to read, this book helps heal my soul."}, {"userName": "A.K. Klemm", "userReviewDate": "Dec 22, 2012", "userURL": "http://www.goodreads.com/user/show/7345095-a-k-klemm", "userReview": "I have never felt so awful as a human being as when I sat reading An Exact Replica of a Figment of My Imagination knowing I’d be ‘reviewing’ it for a blog shortly after I finished. How do you justify that in your mind? ‘Reviewing’ something so personal, so devastating, so beautiful, so intense. As an avid reader, a constant reviewer, and one those people who presume to call themselves a writer though I’ve yet to have anything published, I felt like an inconsiderate intruder reading such an intimate account of a loss so great. It’s rare to read something so personal.As a mother, on the other hand, I wept. I wept, and wept, and wept, for little Pudding. I wept for Elizabeth. I wept for a friend who lost a baby not long after I had my own. I wept for all the things I may have said wrong, all the things I may have not said, and I wept for the selfish joy that my own sweet, precious child was snuggled next to me as I read. I wept for Pudding, I wept for another friend who died, I wept for his mother because even though she had 29 years with him he was still her child, and I wept for the baby cemetery that I pass every time I visit his grave.I’ve had a writer’s crush on Elizabeth McCracken for sometime. I have an extremely vivid memory of reading A Giant’s House while having lunch with the same friend whose grave I now visit. We devoured deli food, iced tea, and discussed the oddity of a romance between a librarian and child giant. I remember telling him what a strange tale it was, but if I could ever manage to write anything half so interesting I would pee myself with happiness. He promised to read it to, though I’m quite certain he never did because he was in the habit of reading the first thirty or so pages of something and then proclaiming himself an expert on a topic, starting novels and not finishing them, and making half-hearted promises… little things that I tend to hate in people, but for whatever reason found endearing in him. I loved him dearly, and for that reason, I’ve never been quite certain whether my Elizabeth McCracken crush was because Elizabeth McCracken was all that amazing, or if it was because thinking of her always reminds me of him. I cannot think of one without thinking of the other.Reading An Exact Replica of a Figment of My Imagination, I’m now quite certain that Elizabeth McCracken is that amazing, and deserves adoration outside the realm of Matty memories. She’s a wonderful writer, a fascinating person, has a rockin’ last name, and by sharing this book with the world has proved to me (without ever having met her) that she has a very giving soul.Elizabeth McCracken, thank you for sharing Pudding’s story. And from the bottom of my heart: I am sorry for your loss.For more reviews, go to anakalianwhims.wordpress.com."}, {"userName": "Jen", "userReviewDate": "Dec 16, 2014", "userURL": "http://www.goodreads.com/user/show/927041-jen", "userReview": "This is one of the most heartbreaking, moving, and beautifully written memoirs I've ever read. Elizabeth McCracken tells the story of her first son, a tragically stillborn child affectionately nicknamed \"Pudding\" by she and her husband while he was in the womb. This isn't just a story about the unique experience of a mother who endures the loss of a child. This is also a universal, tender, and touching exploration of the bottomless grief, comfort and pieces of healing that can come out of such tragedies. This passage from the book was particularly poignant:\"I don't know what to say,\" people wrote, or, \"Words fail.\" What amazed me about all the notes I got—mostly through e-mail, because who knew how to find me?—were how people did know what to say, how words didn't fail. Even the words words fail comforted me. Before Pudding died, I'd thought condolence notes were simply small bits of old-fashioned etiquette, important but universally acknowledged as inadequate gestures. Now they felt like oxygen, and only now do I fully understand why: To know that other people were sad made Pudding realer. Some people apologized for sending sympathy through the ether; some overnighted notes; it made no difference to me. I read them, and reread them. They made me cry, which helped. They moved me, that is to say, they felt physical, they budged me from the sodden self-disintegrating lump I otherwise was. As I was going mad from grief the worst of it was that sometimes I believed I was making it all up. Here was some proof that I wasn't.and:“This is why you need everyone you know after a disaster, because there is not one right response. It's what paralyzes people around the grief-stricken, of course, the idea that there are right things to say and wrong things and it's better to say nothing than something clumsy. I needed all of it. Direct comfort, hearsay grief.\"McCracken's honesty and clarity in her writing was a breath of fresh air after reading The Empathy Exams: Essays, which by contrast felt forced and manipulative. I highly recommend this book to anyone and everyone who wants to better understand how to cope with grief, and help others do the same."}, {"userName": "Joie", "userReviewDate": "Jan 07, 2011", "userURL": "http://www.goodreads.com/user/show/4724607-joie", "userReview": "I wish I could give half stars on Goodreads--I'd easily give four-and-a-half.Elizabeth McCracken's An Exact Replica of a Figment of My Imagination is both devastating and funny; it's quirky, poignant, and a whole host of other adjectives that you might or might not expect to accurately describe a memoir about the experience of having had a stillborn child. I read about it recently in a glowing review from NPR, downloaded it immediately, and pretty much wolfed it down in a matter of hours.Above all, and most importantly I think to its success, the memoir is honest. McCracken does not wallow, but she speaks of the grief she and her husband endured frankly and realistically. She is a tremendously likable narrator. Obviously the content could easily make this book too depressing to read--or too uncomfortable (the author makes frequent mentions of how frustrating but understandable it is for people to avoid wanting to acknowledge that anything so tragic has occurred, much less discuss it at length). But the structure helps keep that from happening--the first few chapters deal with more of an overview of what has occurred (and mercifully tell us early on that she has successfully had another child since); the middle section goes through a chronological telling of her pregnancy, childbirth, emotional aftermath, and second pregnancy; and the last few chapters deal specifically with the truly heartbreaking stuff, exactly what happened immediately before and after her loss of the child.Despite the necessarily sad nature of the content, the book is still often hilarious and optimistic in a realistic sort of way. Absolutely a great read."}, {"userName": "Tricia", "userReviewDate": "Mar 31, 2013", "userURL": "http://www.goodreads.com/user/show/3348030-tricia", "userReview": "I found this book, a used version, at Powell's in Portland, OR. I was drawn to it, even though at that point, I'd never lost a child. I was a mama to one, and pregnant with our second. The book sat on a bookshelf for years, and I'd pick it up every now and again but never felt compelled to open it and begin reading. Until March 27th, 2013.My husband and I went to our 19-week ultrasound to find out what gender baby #3 was. Instead of finding out the sex of our longed-for third child, we found out that our baby had been dead for five weeks. And that's when my old life ended and my new one began. As soon as I could be awake without crying until blood vessels broke, I HAD TO read this book. I read it in a few days. Elizabeth McCracken writes a book about stillbirth that isn't just sorrow and loss. There's hope, and love and triumph among the many layers that comprise the death of her first child, a baby boy. I felt like I was in her skin, that I could feel every emotion that swept through her cracked and splintered heart as she processed the loss of her baby. She is a gifted writer and memoirist. I don't know if I could handle the stillbirth of my child with the grace and perseverance she did. Through it all, you see her strength and the love for her husband shine through. There's no question that McCracken is a rare gem, in the literary world and beyond."}, {"userName": "Shonell Bacon", "userReviewDate": "Oct 15, 2008", "userURL": "http://www.goodreads.com/user/show/1024222-shonell-bacon", "userReview": "It's easy to write a book about a baby's death; the minute we hear or read \"a baby's death,\" the subject matter alone will evoke the stock emotions we know that come from something so traumatic - heartache, despair, tears, senselessness, depression...the list goes on infinitely.What's not easy is writing that story in a way that gets at the heart of the true emotions beneath the ones we so easily rely on. What Elizabeth McCracken does so wonderfully in her memoir \"An Exact Replica of a Figment of My Imagination\" is unflinchingly real and will break your heart and make you hope all in one breath. It's not just the painful story of her baby's death; it's also the true, minute details of thought, of feeling, of reaction that most people don't talk about. It's not just the painful story of her baby's death; it's also the story of moving on yet holding on, of loving but learning to let go, of learning to accept the new beautiful things in your life (like the birth of a beautiful baby boy) while learning the ongoing process of forgiveness. It is the epitome of how LIFE GOES ON and how we should never forget what we've lost but embrace it, accept it, and take pockets of it for good memories to help us when the sadness and heartache invades."}], "description": "\"This is the happiest story in the world with the saddest ending,\" writes Elizabeth McCracken in her powerful, inspiring memoir. A prize-winning, successful novelist in her 30s, McCracken was happy to be an itinerant writer and self-proclaimed spinster. But suddenly she fell in love, got married, and two years ago was living in a remote part of France, working on her novel, and waiting for the birth of her first child.This book is about what happened next. In her ninth month of pregnancy, she learned that her baby boy had died. How do you deal with and recover from this kind of loss? Of course you don't--but you go on. And if you have ever experienced loss or love someone who has, the company of this remarkable book will help you go on.", "title": "An Exact Replica of a Figment of My Imagination", "url": "http://www.goodreads.com/book/show/3291844-an-exact-replica-of-a-figment-of-my-imagination", "average": 4.12, "cover": "https://images.gr-assets.com/books/1437749017l/3291844.jpg", "reviews": 829, "authors": [{"url": "https://www.goodreads.com/author/show/73450.Elizabeth_McCracken", "name": "Elizabeth McCracken"}], "type": ["Autobiography", "Nonfiction", "Biography", "Biography Memoir", "Biography"], "outlinks": ["http://www.goodreads.com/book/show/3291844-an-exact-replica-of-a-figment-of-my-imagination", "http://www.goodreads.com/book/show/7980493-an-exact-replica-of-a-figment-of-my-imagination", "http://www.goodreads.com/book/show/6586193-an-exact-replica-of-a-figment-of-my-imagination", "http://www.goodreads.com/book/show/6434345-an-exact-replica-of-a-figment-of-my-imagination", "http://www.goodreads.com/book/show/136216.The_Giant_s_House", "http://www.goodreads.com/book/show/18339643-thunderstruck-other-stories", "http://www.goodreads.com/book/show/202913.Niagara_Falls_All_Over_Again", "http://www.goodreads.com/book/show/127955.Here_s_Your_Hat_What_s_Your_Hurry", "http://www.goodreads.com/book/show/32611620-juliet"]}