{"ratings": 111, "userreviews": [{"userName": "Carol [Goodreads Addict]", "userReviewDate": "Jul 14, 2014", "userURL": "http://www.goodreads.com/user/show/10717098-carol-goodreads-addict", "userReview": "Animal is by Nikki Rae\n“Evan wondered if now that Ava no longer had her family, if she would continue to survive. He wondered if she would be Ava anymore or just another animal Michael would keep in a cage, play with, and train to act whichever way he wished.”\nAva lost her parents when she was young. Now it’s just her and her cousin Toni. Ava never stays in one place long. It’s not that she doesn’t want to, but she just knows, she has to go, keep moving, to stay safe. It isn’t fair to Toni, to keep making her move. Ava is in the new apartment in New York. Toni is still wrapping things up and will be joining her soon. \n Ava loves animals and has a new job in a pet store. It’s here she first met Evan. He came in looking for a pet for someone else. He ended up purchasing a yellow canary. A couple of weeks later, Evan came back with Michael. The bird was having trouble adjusting to it’s new home and they wanted advice.\n Ava knows about vampires, knows how to detect them, but when she shook hands with Evan and Michael, she thought their hands were warm. They must be human. But she was wrong. She found that out the night they took her.\nMichael has been searching for Ava for a long time. He has finally found her and he wants her for his own. He plans to eventually turn her and make her his family. Evan doesn’t want to help him but Michael is forcing him to do so. \nNo one can write dark like Nikki Rae and this book is no exception. This is sort of a sister book to the Sunshine series but in no way is it a requirement to have read that series. It can be read as a stand alone. Actually, since I have read the Sunshine series, I kind of wish I had read Animal first. It explains a lot. \nAva is determined to survive and she will stop at nothing to do so. She is sick, weak, and injured. Still, though, she keeps trying. She tries to manipulate Michael. And when given the opportunity to escape, she tries, twice. But Michael is always one step ahead of her. The house he has them at is out in the middle of the woods, secluded. And there is snow on the ground, the temperatures are freezing. Ava still doesn’t give up hope. Evan tries to help her but can she really trust him? Her only real friend is the yellow canary and a little black cat Michael lets her keep.\nThis book will keep you on the edge of your seat throughout. I think my e-reader has dents in it from my fingers gripping it. I just could not figure out how she was ever going to get out of this situation. And the ending is shocking! Michael is truly evil. I admit sometimes I felt a little bit sorry for him but he really is just evil. If you like vampire stories with a dark twist, this one is for you. Nikki Rae is a fantastic author and you can’t go wrong with any of her books. I can proudly say that I have read them all and love every single one."}, {"userName": "Cody", "userReviewDate": "May 28, 2015", "userURL": "http://www.goodreads.com/user/show/35007929-cody", "userReview": "Well.. This was terrifying!Ava survived the fire that killed her parents; their job was to help vampires blend into human society. She knows that vampires started the fire and since then never stays in the same place for long. Ava and Toni her cousin move from place to place, always looking over their shoulders and never go out alone at night. Ava loves animals and gets a job at the local pet store. After getting settled in her new job, Evan & Michael (vampires appearing human) enter and ask advice on purchasing a bird. Little does Ava know that Michael has been searching for her for a long time and does not intend to let her slip through his fingers again… days later he has his human servants kidnap Ava.This book is seriously all kinds of dark and twisty and a bit frightening to read without the addition of vampires. Michael is a cruel villain; he has his mind set on exactly how Ava ‘his pet’ should act, he ensures this by the use of positive and negative reinforcement... trust me the punishments for her indiscretions is brutal. Ava proceeds to play the docile pet and creates a very convincing façade that she truly wants to make Michael happy and be apart of his family all the while plotting ways to escape. Evan wants to help Ava escape but Michael has the power to force him to do his bidding through mind control so instead he is left to clean and tend to Ava once Michael is done with her.This book turned out not to be my cup of tea, at 500+ pages it was much too long for this plot. Due to it’s length it failed to hold my attention for long and I found myself skimming chapters, also I would have loved a romance element to the book. The ending for me was a little unfinished as I was left with soo many questions.I would recommend this to lovers of dark paranormal and vampires as it’s full of traumatic events that take pieces of with you it. I am new to Rae's writing so although I wasn't the biggest fan of this book I do look forward to reading more of her work.Literary-ly Obsessed"}, {"userName": "Shirley Cuypers", "userReviewDate": "Apr 10, 2014", "userURL": "http://www.goodreads.com/user/show/15420153-shirley-cuypers", "userReview": "Original review  Hope was worse than love. Ava Brooks, a 20-year-old girl, has a passion for animals. She's been working in pet stores for a while so she could save some money for college.Ava moved into a apartment in New York for a new job in PetCity. Her one and only family, Toni is going to move in with her too. The two of them never stayed at one place for more than a year. Things hid in the dark that could hurt me. The sun made everything safe. Ava's been hearing a cat in the dark for a few days, but she was too affraid to go and look. But one day she does and there begins the trouble.Ava wakes up in a cold dark room without food. She doesn't know where she is or why she's there. But soon it'll all be clear. Michael wants Ava to be his, to be his forever.  Tired of trying. Tired of surviving. What was the point in being alive when I had no life? Will she make it out alive?You have these chapters of the present and sometimes a chapter from the past. It's really interesting and not anoying. You get to know more about Ava and the others.And the story has a multiple perspective, you read in Ava's, Michael's, Evan's, Toni's, Sam's and Myles's perspective. (Sorry if I missed someone)And god I missed the characters from the Sunshine Series and now some of them are back. And that Myles is in Animal makes it even better! O god I missed him. (Thank you, thank you, thank you!!!) This story is worth a try and hope I can read more of Nikki's work. I don't know how she does it, but she can make me think about her books and make me wonder if everything's all right with her characters. You're AMAZING Nikki!-I want to thank Nikki Rae for the beta copy!Status update 16/02:OMG! I love the cover, it's so beautiful. Wow, I'm so speechless!!"}, {"userName": "Karéz", "userReviewDate": "Dec 24, 2015", "userURL": "http://www.goodreads.com/user/show/29191994-kar-z", "userReview": "3.5 Stars!"}, {"userName": "Becca", "userReviewDate": "Apr 10, 2014", "userURL": "http://www.goodreads.com/user/show/10976294-becca", "userReview": "Do ever just feel heavy while reading a book? A good kind of heavy where you know that if you stop the crushing weight on sitting on your chest, the feeling of just utter doom won't go away but get worse? YeahThats how this went. When i started this i couldn't breath. It was like if i breathed, if i made to much noise i would disturb the book. Crazy I know, but it was so enthralling, all-consuming that I lost myself completely to the book. I didn't know where it began and i ended. The heavy emotions evoked through the book threaten to drown you. In the best possible way of course. If you are looking for something to reach into your chest, hold your heart and decide when you would really feel pain, this is the book for you. I am a pretty happy go-lucky kinda of person, its one of those things I like about myself ;) and I usually like books that are going to have the classic happy ending, and books that aren't going to consume and destroy me. For Nikki I will though, every single fucking time. I have to admit I think this is her best work so far. I don't think this for someone with the faint of heart, or looking for a happy little tale about vampires (or you know semi-happy, or you know...happy XD) If you know the background on this book *as its a spin-off/prequel sort of thing* from the Sunshine Series you know how this is going to end. I knew how it was going to end but yet it didn't stop me from hoping, it certainly didn't stop me from going: omigod, omigod, omigod they're all going to die. Animal will force you to the darkest part of your being, it will twist, gut, and maim you. It will own you until you have finished and even then you will be captured in its story. There is so much I want to say about this, but there is so little to say as well because I can't give away the story and I won't. This isn't a happy tale, and its about finding the beginnings of love in the darkest of places. This isn't a book you will start reading and fall for the anti-hero-hero, you will hate him, you will want to run from the deep dark mind that is Michael. It was more about surviving then it was about anything else, the hope of a life that would never really be Ava's again. Its about breaking someone so completely that they are owned even when they don't realize it. So I think if that is the type of read you are looking for, look no further. This is the dark paranormal read you have been searching for. If you want to experience so deeply that you will be barely holding on, i implore you to read this.I am seriously Nikki Rae really out done herself this time around and im still reeling from this book no joke. I will probably be for awhile now.Overall I thought this was a fantastic read. But please be aware this isn't some happy story about how a girl survives a traumatic experience because its dark, its harsh, and it will darken your soul"}, {"userName": "Alec John ", "userReviewDate": "Jul 29, 2014", "userURL": "http://www.goodreads.com/user/show/6371604-alec-john", "userReview": "Ava is afraid of vampires.That much was obvious within the first few pages of the book. I was a huge fan of Nikki Rae's novella, The Donor, so when she was giving out copies to beta readers, I had to snag on up. I will admit, I have not read the Sunshine Series yet, though I've really wanted to.This book is apparently a spin-off of Sunshine, but you wouldn't know if you haven't read Sunshine. This book can stand entirely by itself, and for that, I have to give Nikki props. Writing a spin-off can be difficult, especially if you're trying to make it so that it can be read before or after reading the series that started it.The story revolves around Ava, who has spent most of her list recently running from vampires. At first, you don't really know why, but with Nikki Rae's unique writing style, chapter layout, and story flow, you get to see bits of the past and of the present. Along with getting chapters told from the past and the present, you also get inside the head of a lot of the other characters in the novel, including Myles, Evan, and Toni (who I believe are also in the Sunshine series). Besides the creative writing, the story itself was phenomenal. Nikki really knows how to capture your heart and pull you right into the story. Ava clearly suffers from an anxiety disorder, and has panic attacks multiple times throughout the book. For me, this just added a whole new realistic layer that I wasn't expecting, although I should have after reading The Donor. As a sufferer of an anxiety disorder, I totally understood how Ava felt a majority of the book.In this twisted and haunting tale, you really get to know each of these characters, their motives, why they are the way they are, and you come to love them. Even the main antagonist gave me some good feelings a few times, because this novel just goes to show you how some \"evil\" people may really be feeling.All in all, this book was perfect and I couldn't have asked for it to go any other way. I really look forward to reading more of Nikki's work soon, and am silently praying that she writes another book that follows this. ***Also, just as a side note, I got to see the cover early, and it's GORGEOUS. I can't even handle it."}, {"userName": "Jennifer", "userReviewDate": "Jan 03, 2016", "userURL": "http://www.goodreads.com/user/show/6615397-jennifer", "userReview": "This review was originally posted to Jen in Bookland*Note: I received a copy of this book in exchange for an honest review*I was excited to start reading Animal. I really like dark reads so I thought this would be perfect for me. Unfortunately it was a bit of a mess. I really did not enjoy the characters or the storyline. It had a lot of promise, but it just didn't pan out for me.Ava had a traumatic experience in the past which left her with only her cousin Toni and panic attacks. She and her cousin keep moving around trying to stay away from the bad vampires that might be out to get them. She knows not to go out in the night, not to be alone in the dark, as she knows what is really out there. Her parents worked with the \"good\" vampires who wanted to fit into the human world, but she knows not all vampires are good. Her character didn't make much sense to me. She has a weird connection with animals and the way she talked about that was just off. I love animals, love all of them, but it just felt strange to me how Ava was with them. I was waiting for some kind of explanation, like she is part something, or has some secret power or whatnot, but it was just she loves animals and is good with them.Ava is also one of the stupidest girls I have read. She was so frustrating. She knows some things about vampires, but when she gets captures and held captive by some it is like she knows nothing. And she got on my nerves big time. She just kept making stupid decisions. Like before she was captured she kept hearing a cat crying outside at night. She knows not to leave her house at night, but the cat is crying out there! She really wants to go save it! She knows if she could just get it in her house they would both be okay since vampires cannot come in unless asked. So she hears the cat scratching at the door so what does she do? Puts on her coat to go wander around outside. I was just like what? Why are you doing that?!? If the cat is right outside why not just open the door and let it in? You can stay safe inside, you can help the cat, win win win right? No need to go wandering around in the dark....it made no sense. This was like the whole book for me. Why are you doing this? Why did you think this was a good idea? What is wrong with you?!? It was frustrating.Michael is the bad guy in the story. This vampire who just wants a family. He just wants some people to be with him and love him and never leave him. I am not sure if we were supposed to feel bad for him or what cause I sure didn't. He was a monster for reals, really a horrible person/vampire, but at times it seemed like his sob story was supposed to soften out hearts towards him. Odd.Then we also have Ethan who Michael is forcing to stay with him. Ethan has been with Michael for a long time and he hates that Michael can force him to do things (like help with Ava). He seemed like a good guy, but there was also this almost love interest thread between Ethan and Ava that I didn't get at all. Ethan definitely wanted to help her, wanted to keep her safe because she was special. And the way it ended? Just kind of open and not fulfilling at all. It was just not a very good read for me. It was all over the place and didn't make a lot of sense."}, {"userName": "Jonel Boyko", "userReviewDate": "Feb 15, 2015", "userURL": "http://www.goodreads.com/user/show/15432163-jonel-boyko", "userReview": "Rae has created an intricate story that will keep you captivated while making you ponder the possibilities. This well written story will take you on a chillingly dark journey in Rae’s well constructed world. The storyline is disturbing in such a manner that you can’t look away. Rae’s short chapters make you feel like you’re getting glimpses into the lives of the characters, snippets that when put together paint the entire picture. The flashbacks and memories draw you back into the past, showing what happened ears ago that lead to what’s happening today. The three major characters in this novel are all well developed, yet in quite different manners. I enjoyed how Rae highlighted certain aspects of each character, giving them a certain aura to the reader. Michael made me shiver, Evan evoked sympathy, while Ava made me want to exclaim ‘you go girl!’. It was very easy to see how they became who they are today based on their pasts. I’ll admit that I was a little confused as to how Myles tied in to everything. His past isn’t nearly as developed as the rest of the characters. In the grand scheme of things it wasn’t really that important, but I did find myself wondering how he came to know everyone. Rae has created a tale that is simultaneously wildly imaginative and shockingly real. It was a very intriguing story that I read in a single morning."}, {"userName": "Sharon", "userReviewDate": "Jun 28, 2015", "userURL": "http://www.goodreads.com/user/show/28180449-sharon", "userReview": "I would like to thank the author, Nikki Rae, for providing me with an electronic copy to review. For the most part, I found the plot compelling and the characters well defined. With regards to the main plot of the book, this is not the typical vampire story. I found the unique aspects of the plot to be arresting and this kept me turning the pages. The problem that I had with reading this book is the shifting points of view and perspective, as this ruins the continuity for me. My favorite character in Animal is definitely Evan, as his attempts at humanity make him complex and interesting. I would recommend this book to those readers who are fans of vampire stories and I look forward to reading more by this author in the future."}, {"userName": "Louise Seraphim Reviews", "userReviewDate": "May 26, 2014", "userURL": "http://www.goodreads.com/user/show/9744129-louise-seraphim-reviews", "userReview": "Oh wow! I'm still quite stunned by this story.It was dark, yet in a really weird way, quite beautiful. That's a bizarre explanation, I know. I'll explain more. Animal is a paranormal book, but it's also quite dark, and very deep and can mess with your mind a little. The best kind of book, in my opinion. Plus if your a hopeless romantic, you can also see elements of something building there.Ava, has never had the easiest of lives. After a traumatic event took her parents, when she was young, it has affected her life in many ways.Now there is just her and her cousin Toni. They move from place to place, never stopping in one place for long. Ava always keeps one thing consistent. She has to work with animals, she is like an all round animal whisperer, and connects to them, where she perhaps doesn't connect to many people. So we start the story with a new place, a new pet store, another chapter in Ava's life. Ava is on her own at the start, as Toni hasn't followed on to the new place yet. Things start off well, but Ava still has her episodes and darkness takes over. She struggles with many bi-products of her traumatic past, but has ways of dealing with the episodes and has to rely on these exercises, to get her through the tough times when she is on her own.\n\nI was afraid that my breathing was going to take over my body, and that was always bad. I could never stop an attack once that happened.\n\nAva starts to hear a cat crying, every night. Around the same time each night. It wakes her from her nightmares, and confuses her. But she knows she can hear it, and feels a pull to go and check on it. She goes through this every night for a while, until one night, she actually goes out to check, that's when her whole life changes.\n\nI couldn't see anything. There was fabric over my eyes. Something was digging into my wrists and my legs were wet. Cold. I must have fallen to the ground. But that couldn't be right. I was standing on my feet now, hands on either side of me, dragging me in one direction.\n\nI'm not going to go on and summarise what happens, once Ava leaves to check on the cat. From there on, things take a really dark turn, but it remains incredibly gripping. But it's a story that shouldn't be spoiled by information before hand. We get to understand what is going on. through quite a few characters. The pov's go between Ava, Michael, Evan, even a few from Miles, and Toni. Which actually makes it quite easy to understand what is going on from all angles. The sheer strength of Ava, is what kept shining through the story. You would think, from the outside, that everything is pretty hopeless for Ava. Most in her position would give up. Yet she doesn't. She does what she has to, even when she can't think straight, her strength keeps her going, and fighting. She has a plan, and won't give up. Although I felt sorry for her, I admired her more. I don't think I could be as strong as her, in her position. It was pretty scary!! \n\nI couldn't be the prey. This was my game. My rules. I just had to figure them out before things went too far. If they hadn't already.\n\nAnimal tells the story of Ava, Michael and Evan. They were characters who first appeared in Nikki Rae's first series, The Sunshine Series. Although you don't need to have read The Sunshine series beforehand. I felt that my knowledge of these characters not only helped understand, but also gave the story more background. All three of these characters show up in The Sunshine Series, many times, yet they aren't main characters, just background. But, what I will say is, after finishing Animal, I badly want to go re-read the other books, to remind myself of little details, and what happened to the characters after the Animal time line finished. I kind of wished I had read Animal first, then moved on to The Sunshine series afterwards. But whichever way you read them, they are all incredible and unique. I think, besides the amazing story, the important thing that shines through, would be the captivating writing. This story could not of been what it was, without the beautiful way in which it was told. It was haunting, and sometimes unbelievably sad, but I could picture every little detail like it was drawn in colours and photos, not just written. Which is why I think I see it as a beautiful story. Yes, that sounded a bit strange I know, it's hard to explain. It left lingering thoughts for a long time after I finished. I actually wanted it to continue, to know what happened afterwards. It's most definitely a must read!!! 5 stupidly big stars!\n\n\"The bird flew away.\" I couldn't help the sense of calm that washed over me at the words. We both knew what they meant, but we didn't have to say anything. \"Ready for what's next?\" he asked eagerly. \"Yes,\" I said, thought I knew I probably wasn't.\n\n**I was given an ARC of this book, in exchange for a fair and honest review**"}, {"userName": "Nicole Hewitt", "userReviewDate": "Apr 27, 2015", "userURL": "http://www.goodreads.com/user/show/4728643-nicole-hewitt", "userReview": "This review and many more can be found on my blog: Feed Your Fiction AddictionAnimal is a really twisted and dark vampire story, even grittier than Rae’s Sunshine Trilogy. I didn’t realize it at first, but this book is actually a sort of prequel to that series. It can be read alone, but this tells the backstory of two of the characters in the original series – Ava and Evan. I absolutely loved Sunshine, so I was eager to see how Ava and Evan got to where we met them in the Sunshine series!This is Ava’s story. She has spent the years since her parents’ death running – sure that vampires are hunting her. She’s right. When she’s finally caught, Ava has to submit and play along with her captor’s mind games in order to survive. She’s hoping for a chance to escape, but she doesn’t know if she can make it out alive – and still human.What I loved:Disturbing vampires. Even the “good” vampires in this book are far from the typical romanticized version that we often see. And Michael, the vampire who abducts Ava and enslaves her – he is all sorts of messed up and evil. The weird mind games he plays, the torture, his “rules” for Ava – it’s all very sick and twisted. And yet, even with all of that, Rae manages to give us moments where we actually feel sorry for Michael, tiny moments where we see his stolen humanity. This makes the story that much more compelling. Then there’s Evan, who wants to pull himself out from under Michael’s thumb but can’t. He wants to help Ava, but at the same time he is one of the people hurting her, so it’s hard to be completely on his side – you can see why Ava doesn’t completely trust him. Since the book is sometimes told from Michael’s and Evan’s POVs. Michael is a bit of an unreliable narrator, just because his vision of the world is so twisted, but it’s interesting to see things from his perspective. The book, as a whole, is very disturbing and definitely not for the faint of heart, but that’s part of what made it so compelling!Ava’s panic attacks. To add another layer of disturbing to the story, in addition to what Ava suffers at the hands of Michael, she also has mental breakdowns throughout the book – panic attacks that started when she lost her parents in a fire. These panic attacks are debilitating in the best of circumstances, but when she’s abducted, her fragile state becomes even worse. Ava is an interesting mix – sometimes she is able to show incredible strength in horrible circumstances and other times she’s just doing everything she can not to fall apart (and to survive).Touch of romance. There is a touch of romance to this book, but it’s definitely not the focus (which I was glad for in this type of book). Still, it added an extra layer to the book that had me wondering how it would all play out.The negatives:Felt a little long. At over 500 pages, this book did feel a little long sometimes. For me, the issue might have been compounded by the fact that it wasn’t until about a third of the way through that I realized that this was a prequel to the Sunshine series, and once I realized that, I was racking my brain to try to remember the details of the original series (which I loved, by the way). I felt like I couldn’t keep reading until I figured out exactly if and how this book was related to the series (but I couldn’t easily get my hands on it right away). This drove me crazy and interrupted my reading, making it feel like the book took even longer – but obviously this was my issue, not the book’s.If you’re a fan of darker vampire books, I would definitely read this book (and the Sunshine series too!). Rae doesn’t let her characters off easy, that’s for sure, but you won’t soon forget them! I give this book 4/5 stars.***Disclosure: This book was provided to me by the author in exchange for an honest review. No other compensation was given and all opinions are my own.***"}, {"userName": "Amy (Lost in a Good Book)", "userReviewDate": "Feb 26, 2015", "userURL": "http://www.goodreads.com/user/show/4473047-amy-lost-in-a-good-book", "userReview": "Note: I was provided a copy of this book for review.Animal is a story that is fascinating, eerie, and extremely captivating. I never once put the book down after I had begun and I was glued to each page that I read; always wondering what would happen, intrigued by what I had just read, and intense curiosity motivating me to keep going no matter what. Rae's writing grabs you and holds your attention from the start, even with the simplest of scenes, and while you do not know where the story will go, you still try and guess what will happen. Something I should know better than to do with one of Rae's stories.Even though Animal features characters from The Sunshine Series, this story is not really a prequel and it is not presented as being one. While it does deal with events before those in the series, it is more a completely new story about one of the minor characters. Animal tells the story of Ava, a girl who has been running almost her whole life until what has been chasing her finally catches up with her. What I knew about Ava was only partially explained previously, so it was fascinating and exciting to explore her past and discover where she came from and how she came to be the person you see in The Sunshine Series.Rae tells Ava's story with style and skill as well as multiple character perspectives which add a beautiful element to the storytelling. There is also a wonderful balance with the characters, each action and thought seems measured and calculated but there is no absence of worry or fear either. Emotions and reactions are not over exaggerated one way or the other and Rae is clever at demonstrating how each character is trying to remain in control in their own way and in their own circumstances. This believability brings the characters to life on the page and makes you invest in them, no matter who they are. Multiple points of view allow multiple justifications to be made which also means that many times sympathies can be misplaced, though often only temporarily. With her words Rae captures you and draws you into the story and you feel like you are there alongside each character, feeling what they feel and understanding who they are. The thrill and exhilaration that I love in Rae's writing is there as well, not to mention the unexpected and unknown, even with these familiar characters. While Ava does not initially seem to be, she is strong and determined and brave, though she never tries to be more than who she is. She follows the rules her parents taught her and she makes sure she knows the risks of her surroundings, choosing her moves carefully, always thinking of ways out and how to survive, even manipulating her situation to her advantage and discovering where cracks can be tested.A longer version of this review was published on my blog https://lostinagoodbk.wordpress.com/2..."}, {"userName": "Gabby (What's Beyond Forks?)", "userReviewDate": "Feb 19, 2015", "userURL": "http://www.goodreads.com/user/show/4039036-gabby-what-s-beyond-forks", "userReview": "Full Review at: What's Beyond Forks?Animal is a spin off of The Sunshine Series by Nikki Rae. You don't have to read the series to fully get what's happening in this book, but if you have read the series, you get to see into the psyche of Michael a little bit. We are given the perspectives of Ava, Evan, and Michael. Ava is brought to hell and back a few times through this book. It was pretty emotional reading from her point of view as a victim and how she coped with her situation mentally and emotionally and the things she did to survive. To me, Michael was the most interesting character though. Ultimately, he wants love and family, but he doesn't know how to get it, so he tries to create it in the only ways he knows how. This can literally be torture for his victims. He knows the difference between right and wrong, but for him it doesn't feel right unless it's wrong a lot of the time. He's a sociopath, because he still feels a form of remorse for the things he does, yet his moral compass is completely out of whack. That is my take on him anyway. Having read the Sunshine series, I felt like this book really added to it by giving us a lot of Michael's back story. I see him differently now. Not that that is a good thing. He's still his own special kind of crazy, but now I know what made him that way and how he thinks.The ARC Animal by Nikki Rae of was kindly provided to me by the author for review. The opinions are my own."}, {"userName": "Paranormal Books R Us", "userReviewDate": "Jul 14, 2014", "userURL": "http://www.goodreads.com/user/show/9276938-paranormal-books-r-us", "userReview": "Ever since the fire that took her parents from her when she was little Ava has been on the move. Never settling in one place for very long she knew she was running from something but she just wasn't sure who or what. Unfortunately for Ava that something finally found her and he has no intentions of letting her go.I am madly in love with this author's writing style and Animal is no exception. She isn't afraid to dig into the darkest parts of her characters and they are each intense, scary, and even beautiful in their own way. Nikki Rae manages to breath such an extraordinary life into each and every one of them that they kept me glued to the page from start to finish. It doesn't matter if they are good or evil I found myself thinking about them often. The story managed to wriggle its way so deeply into my head I was even dreaming about it! I eagerly await the next look into the fascinating worlds Nikki has created and in my opinion Animal is absolutely recommended!"}, {"userName": "S.J. Abbo", "userReviewDate": "Dec 15, 2015", "userURL": "http://www.goodreads.com/user/show/32265322-s-j-abbo", "userReview": "* I received this book in exchange for honest review.*It's not so dark but it's not for everyone. I think this is not romance and I don't know why I expect one. Good writing and very interesting story. Maybe everything is not black and white but monster stays monster and it's very refreshing. Girl fight till the end and you must respect that because that not a case in many similar books. Honestly, not what I expect and that is why three stars. Maybe even three and half."}, {"userName": "Sarah", "userReviewDate": "Aug 14, 2015", "userURL": "http://www.goodreads.com/user/show/7546831-sarah", "userReview": "I was very kindly provided with a copy of Animal to read and review.After losing her parents when she was still just a child, Ava has lived a regrettable and heartbreaking life, moving from town to town and trying to out run the monsters that claimed the lives of the two people she loved the most. Trying to stay one step ahead of the shadows, Ava and her cousin Toni are all each other have and all each other need. But no one can hide forever, no matter how far they run or how big a crowd they stand in. The darkess will always find a way to claim you.\nWhen I was fifteen, my entire life changed. A lot of people say that. Some people say that something bad or traumatic happened when they were a pre-teen and it changed them. I always thought they were exaggerating, at least a little. Most of the people I knew in high school said that over the summer they had changed. That they would never be the same. Those kinds of things are not what I'm talking about. This wasn’t some secret kiss shared at camp, no story of losing my virginity in the back seat of some guy’s parent’s car. I had no dramatic story about how I got my period at a school dance and ruined my white dress. What happened to me was different. Very different.\nThis was truely a stomach churning, heart pounding read a lot of the time. Between the creepy characters, the atmosphere of the tale and the superb writing style the author had used this was easy to fall in to right from the first page. The chapters are often short and to the point, the narrative runs between the five main characters and at times the story can shift back in time. To be honest, when I began reading it I thought all of that would make for one big nightmare, trying to keep track of whose thoughts we were hearing, what time we were in. But thankfully not only did Nikki Rae manage to pull it off, she did it exceptionally well.The five main characters are Ava, Evan, Michael, Myles and Toni. Although the story centres mainly around the first three, Myles and Toni both play their own vital parts in the storyline. Where as Michael was the monster, Evan and Ava were the heart and soul of the book. Michael was always superbly vicious, whenever he entered a scene you instantly felt tense and incredibly wary of where his current mood would leave his two 'house guests'. Ava often fooled me, just as you thought she'd rolled over and given up on her freedom she would always have a plan already in action.\nBut he gave her that hope. Hope was worse than love.He was darkness. He decided where the light came in.\nThis is one of those books where saying less in a review is so much more. It was thrilling to go in to this one with only the bare bones of the synopsis. I was never entirely sure who to trust, who would survive or exactly who I should be feeling sorry for. This was on track for being a five star read right up until the ending, it was so abrupt that I half thought I was missing a chapter or an epilogue from my copy. After what had been an incredibly strong book the whole way through, I felt that the ending let it down a little, it was left too open for me to feel entirely satisfied. I'm a lady who likes an ending to be tied up tightly and explained to the fullest.\nI didn't want to be the girl running as soon as it appeared that her leash was cut loose. I would not be an animal but I had to make him think I was.\nAn amazing book that I can't recommend enough. I'm not always such a huge fan of supernatural books but if done well, and done darkly enough for my personal tastes, then I will fall head over heels with it. And this was perfectly up my alley. It had moments that left me cringing, some that left me wanting to weep because Ava and Evan's chances couldn't of looked any bleaker, and its ability to leave me genuinely unable to see how things would end up, it was just so almost perfect. Despite the slightly lacking ending this is most certainly a book I plan on rereading when I'm in between reads and Nikki Rae is an author I will definitely be looking out for in the future."}, {"userName": "Ariel Mathis", "userReviewDate": "Feb 18, 2015", "userURL": "http://www.goodreads.com/user/show/17281109-ariel-mathis", "userReview": "*An ARC kindly provided by the author in exchange for my honest review.*Ummm...yea. I had a hard time coming up with a review for this book. Why? I'm emotionally drained. A book hangover if you will. Now while it took a lot out of me, I must say that there's a giddy side of me that is just gushing with excitement because I've read the Sunshine series and this book is the pre cursor to Sophie's story. We see how it all began. We see the WHY but it isn't justified. This story is one of survival. Ava, our main character, has the knowledge that there are indeed vampires living among her. Her parents taught her how to block them out of her head. She's so on guard that she moves from place to place. She has an anxiety disorder. Which really made me feel like taking a Xanax myself. It's not that it was reading how an anxiety attack starts, it was what she went through that had my heart pounding, me breathless, and of course I was scared. Michael is a sadistic, cruel monster. He has a twisted way of looking at love. He's followed Ava since she was a little girl, when he first came in contact with her. He always came up empty because he was always a step behind until he finds her in NY. I hate Michael. I don't care about why he is the way he is. Yes, his parents were wrong in what they did. Yes he got his revenge on them but why couldn't that be enough? Maybe because he's a vampire and certain instincts are more fierce than when you're human? Nope. Not buying it. Vampire or not, you have a choice. To do good or do evil. Obviously, he chose evil. And every human he has come into contact with has met an unfortunate end. All except Ava. But she doesn't escape so easily. Not without a daily reminder that she's been infected with his blood. You see what she goes through in the Sunshine books. It was not pretty. If anything it's painful & horrifying. I want to talk about two characters I left out. One, Evan. I first met him in the Sunshine series and I honestly thought he was a creep. However, I no longer feel that way. Yes, he helped Michael in taking Ava, but he kept telling her they were going to get away from Michael. We learn of Evan's story with his sister Katya. Michael has Evan caught by blood. So of course he has to do what Michael says or else.It turned out there were far worse things than death.And two, Myles. If I was in love with Myles when I read Sunshine then after reading this story I love him even more. Myles is the epitome of a good vampire. Just the total opposite of Michael. Myles treasures life. Myles is one of my favorite vampires, EVER!! He knows what Michael is capable of and that's why he does what he does. I am a huge fan of Nikki Rae & her writing. It is raw, unique, horrifying, and beautiful. I was enthralled and enticed into Ava's story. So much so I stayed up into the early morning to see how it ended. Afterwards, it makes you want to go read the Sunshine series all over again!! All I have left to say is, \"Well done, Nikki Rae.\""}, {"userName": "Kayla", "userReviewDate": "Mar 14, 2015", "userURL": "http://www.goodreads.com/user/show/11339363-kayla", "userReview": "Animal is quite the intriguing tale. I wasn't sure what to expect with this one because the cover doesn't give much away, nor does the synopsis. The novel starts out pretty slowly so I was a tad worried I wouldn't like this one as much as I liked this author's previous work. But before long, I couldn't put it down. The suspense in this novel is nearly overwhelming within certain moments.You have your characters - the main female lead being Ava. She seemed drab to me at first but that was because she's so used to hiding and never letting herself be comfortable. She's always looking over her shoulder, fearing what goes bump in the night. She has horrible anxiety & panic attacks. I've had my share of those when I was a teen and the author captures the feeling quite well. She loves animals. Good ones. Ones that are furry or feathery. But she's learned about what really goes bump in the night from her parents. Part of me wonders what would've happened if her parents had never been killed... Or if she never knew about the vampires at all. Would she have gone blissfully into the arms of Michael in the beginning before her cousin swept her away into hiding? Hmm things to think about. Anyways, then you have Michael. Dark, scary, warped, Michael... He's scary because he's so unstable. I never knew what he would do one moment from the next. I definitely wouldn't have been able to keep my wits about me like Ava does had I been stuck with him. Evan... I loved Evan's character. He was a great balance between the sane and the crazy psycho. The other supporting characters were great & I would even be up for another story featuring them again. The plot keeps you on your toes. You think Ava is getting stuck into Stockholm's syndrome, beginning to really have feelings for Michael... but it's all a part of her plan. Keep your enemies close. She does it wayyyy better and more dedicated than I ever could. Bravo to her. As the reader, you want her to do something and take action against Michael, save herself, but she does the exact opposite of what you really expected her to do. Loved that. It kept me on my toes as the reader. The climax... which one? It felt like there were moments that left you so high strung that you thought they were the climax, leaving you no where to go but down... But then it keeps going! I really enjoyed the way the story built and built. Overall, great novel once I became attached to & invested in the characters lives. Huge 4 star novel for me. This novel was just another reason proving why I love everything this author has published. Nikki Rae has a way of spinning the plot into the exact opposite direction you expect it to go. She leaves you wanting more. She builds and builds onto the story until you think you can't handle anymore... then she throws something else at the characters, leaving you feeling sucker punched. You can't turn the pages fast enough.Overall Rating: 4 Stars"}, {"userName": "Jennifer  (BTH Reviews)", "userReviewDate": "Jun 14, 2015", "userURL": "http://www.goodreads.com/user/show/19169838-jennifer-bth-reviews", "userReview": "I received a free copy of this book in exchange for an honest review. This does not affect my opinion of the book or the content of my review. Review originally appeared on Books That Hook4.5 starsI was pleasantly surprised by Animal. It was a great mix of horror and fantasy. The author kept the story going at a fast pace, skillfully limiting flashbacks and exposition of backstory. I appreciated that there were no information dumps and the story's goal became apparent very early on in the story.The basic storyline is: Ava, a young woman who is gifted with animals, is abducted, held captive, and tortured by a vampire named Michael who believes they are meant to be together and will stop at nothing to break her and make her his. Evan, another vampire, is forced to help Michael despite Evan's desire to help Ava.Both Ava and Evan are characters who evoke sympathy. Ava's panic attacks are realistic and justified. I didn't necessarily agree with her strategy for escape, but I could understand it, and I liked that she tried to take matters into her own hands. She never gave up, even when it appeared at times that she had. Evan, although helping Michael, tries to be kind to Ava. He's a likable character. Michael was a believable villain. His motivations were clear and made sense.Although the book is listed as urban fantasy, it lacks the kick-ass heroine and extensive worldbuilding that are typical of urban fantasy. I didn't mind about the heroine--it's a nice change to see someone vulnerable--and the worldbuilding isn't relevant to this plot because it takes place in only a few locations in isolation.The story is told from both first and third person point of view. I didn't like this because I felt like I was being disconnected from Ava when it switched to Michael, Evan, or Toni's point of view. Because first person is very intimate, I didn't want to leave Ava. However, I understand the need for some scenes to be told from other points of view. I think I would have liked it better if the entire book had been written from third person, rather than shifting between the two.This book is not for squeamish readers. Some parts were scary and bloody. I didn't mind; in fact I loved those scenes because they were terrifying but not overly sadistic.If you don't like cliffhanger endings, you probably won't like Animal. Some of the plot points are resolved, but not all of them.I enjoyed reading Animal. I recommend it to readers who like vampire stories with only a hint of potential romance. I give Animal 4.5 stars for fast pacing, excellent characterization, and a different kind of urban fantasy heroine."}, {"userName": "Ella Drayton", "userReviewDate": "Mar 05, 2015", "userURL": "http://www.goodreads.com/user/show/36201436-ella-drayton", "userReview": "I am in awe over this book. I am not really a huge fan of paranormal stuff but when I came across the synopsis of Nikki Rae's book, I knew I had to read it. I am so excited that she was kind enough to allow me an opportunity to review! I connected with the main character Ava right from the beginning because of her love and affection for animals. Ever since the accident that took away Ava's family, she's moved around from place to place with her cousin Toni and as a result she does not do well with interacting with other people. Animals love people unconditionally and do not judge others which is what draws Ava to them. When she and her cousin Toni move to a new neighborhood and she starts her new job a pet store, she meets two men who purchase a yellow canary. While her encounters with these two men seem really strange at first, she tries not to put too much thought into them because she is trying to keep from being so afraid of things. Little does she know that she will be meeting those men again soon. Ava's parents worked with vampires. And Ava blames them for her parents death. She's been terrified of vampires ever since. She's scared of being alone at night and is usually very cautious. On several different occasions at night she's heard a cat crying outside so when a young girl knocks on her door one morning asking her to help her look for her lost cat, she thinks nothing of helping her. This would be Ava's undoing. Ava's perseverance had to be my favorite element of her personality. Instead of giving up and letting the torment and torture happen without putting up a fight she tries on more than one occasion to escape the hell she's been forced into. She puts all of her energy into focusing on how to get away from the nightmare come to life. I'm scared if I talk about anymore of the other characters I'll give away too much of the book because I loved it so much and I won't be able to help myself. Michael is one of the best written characters in this book, in my humble opinion. Nikki writes him so well that you can't help but hate him. He's just that evil. And Evan is so endearing that he easily becomes of the favorites in the story. This is the first story I've read by Nikki Rae and I can honestly say that I will be reading more from her. I will be reading her Sunshine series as soon as I get a chance. I need some more of Nikki's dark, creepy writing in my life. And more surprises like the ending of this book. I didn't see it coming but it was a very good way to end it!"}, {"userName": "Debbie", "userReviewDate": "May 24, 2015", "userURL": "http://www.goodreads.com/user/show/10246637-debbie", "userReview": "Independent reviewer for Archaeolibrarian I Dig Good Books.You know, when you are reading?? Do you like to plot ahead?? See where a book might go and whether you are right?? I do, and sometimes I'm right and sometimes, I'm wrong. I don't mind either way, I like a book that keeps me on my toes.This one?? This book kept me guessing right to the very end! I said to my partner midway through, \" I can see this going one of three ways, oh maybe 4 ways\" and then??? A fifth way happens! I did not see that one coming, and I loved it! Its told differently, we get Ava in the first person, and everyone else, and I mean EVERYONE we get in the third. I see this is popping up more often, sometimes it works, sometimes it doesn't and here it absolutely does. We get Michael and Evan, Myles and Toni, in the third. Ava, we get her now, and we get chapters, only short some of them, a paragraph or two of her past. It took me a while, but those little snippets of her past lead nicely into the next chapter of here and now. Or I thought they did, anyway. In a round about way. I was kept guessing about why Michael was doing what he was doing. Kept guessing about the true connection between Myles, Evan and Michael. Kept guessing who Katya was. Kept guessing, guessing guessing! Sometimes, I struggle to word how I feel about a book, usually, because it affected me so. This is one of those times. Its dark, not a fluffy vampire romance, there are some twists to the usual vampire lore and the way makers control their creations. There is little or no sex, but it does get violent, especially when Michael is angry, and dishing out his punishment. The ending, as I said, was unforeseen. It also makes me think there may be a second book, but equally, one of those books that just finishes, ends, and leaves you hanging. Totally hanging after this one, I tell ya, hanging!Its long, too. 522 pages. Took me two days, but had I started it in the morning, I may well have read it in one sitting.This is also the first of Nikki Rae I have read. But it certainly won't be the last.I just realised, I didn't summary the book, not gonna. Nope. Can't. The blurb says it perfectly, and I don't want to take away from that. 5 full stars.**same worded review appears on Goodreads, Amazon.com and Amazon.co.uk**"}, {"userName": "S", "userReviewDate": "May 05, 2015", "userURL": "http://www.goodreads.com/user/show/10331616-s", "userReview": "Featured on StrangeWrites.comIn Animal, Nikkie Rae creates an unconventional hero for a demographic that is largely ignored: girls who are weak.The main character, Ava, has a panic disorder that is at times debilitating. For most of the book, she's trapped by a foe stronger than her in almost every way. She is, for all intents and purposes, weak. And yet Ava doesn't let that stop her from being a hero in her own right.What is a hero, really? Type it into Google and you get a bunch of images of superman followed by various other men clad in spandex. Type in 'women heroes' and up comes superman's counterpart, superwoman.Both are associated with a pretty conventional sense of strength: muscles, force, and the ability to kick your puny human ass up and down the globe. If you scroll down far enough, you'll get images of Real Life Women™ such as Oprah Winfrey or other famous women in power. In the end, they all fit in the 'strong role model' mold neatly with their super powers, super amounts of money, or super ability to exist in positions that are traditionally held by men because of their strength.But here's the thing: there are many girls who can't ever hope to aspire to the positions these women have. Being able-bodied is a privilege. Forget super strength, some have difficulty leaving their houses. Many girls can't stomach confrontation in any form. Chronic illness is more common than many think and poses real life consequences.Rae takes a girl who would normally be considered weak, drops her into a world where vampires exist and has one of these creatures with a serious megalomaniac issues kidnap her. Though panic attacks wrack her body multiple times while captive and she suffers brutally at the hands of her captor, she does not let that end her.She can't fight off her vampire keepers with force, so she gains their trust and manipulates them psychologically. No one knows where she is, so she makes an ally. She does the bravest thing that one can do at times, she survives. In the end, Rae proves that weakness does not equate to uselessness and provides one hell of a good read simultaneously."}, {"userName": "Brandee Price", "userReviewDate": "Jul 30, 2015", "userURL": "http://www.goodreads.com/user/show/3082941-brandee-price", "userReview": "*3.5 Stars*Animal started out very slowly for me The setup was slow. I did understand the necessity of the details once I got into the story further, but it did make me worry initially. While it did eventually capture and hold my interest, the pace never gained any speed.Ava is a young woman who grew up knowing about vampires. After losing her parents as a teen. she spent her life on the run. She never knew exactly what she was running from and she suffered debilitating anxiety and panic attacks over it. While she lived in a particular location, with her cousin, Toni, she worked at pet stores. Ava had a real affinity for animals - especially birds. When we first meet Ava, she seems rather weak. We watch her suffer from panic attacks, lean on her cousin, and basically stand in the shadows. So it was fascinating to see her be strong, plot and execute plans, and struggle to hold onto her humanity once certain events occur.Michael first met Ava when she was a young girl. Her parents worked at integrating vampires into human society. They refused to help him. He has a long and sordid history. As we get acquainted with him, we learn about the ill-effects an upbringing can have. Michael was a character I loathed and yet, at times, I was able to feel empathy towards him. He's a character you want to pick apart, climb inside, figure out the inner workings of his mind. But he will also scare you - make you want to hide under the covers. Evan is a great anti-hero, of sorts. He played a crucial role in everything that happens to Ava - both good and bad. And still I can't bring myself to hold the bad against him. He evoked more sympathy over his trials and tribulations from me than Michael did. I genuinely felt there was a good person in him.Rae's character development is what eventually won me over, kept me captivated. I liked the parallels she drew between Ava and Michael's canary. The dynamics between all the characters was interesting. It was only the pacing, which seemed plodding, and the switch between first person and third person narrative that took away from my enjoyment. (although I think the narrative switch makes sense)Overall, I liked Animal once I became more invested in the characters. I will read Rae again.**I received a complimentary copy in exchange for an honest review.**"}, {"userName": "Minerva", "userReviewDate": "Feb 23, 2015", "userURL": "http://www.goodreads.com/user/show/7937932-minerva", "userReview": "Would like to thank Nikki Rae for gifting me this book for a honest reviewI am a big fan of Nikki Rae's Sunshine series, this book is more of a prequel; you do not need to read the Sunshine Series to read this one, but it a great series to read. This book Wow!! I was afraid to read this and read what Ava had to goes through, so much happens. Such a dark twisted story, very well written, so dark and emotional.  Ava has always known about Vampires and was taught how to detect them and block them mentally. After her parents die in a fire when she was younger, she struggles to cope, struggles with severe anxiety. Not feeling safe staying in one place too long, she has been on the move with her only family Toni. Now they decide to try to settle in a new city, Ava even starts working in a pet store. But Michael has found her and is making sure she doesn't get away. Forcing Evan to help him, and go to the pet store where Ava works and meet her. Ava doesn't suspect that Evan and Michael are Vampires and are planning on kidnapping her.After Ava is finally captured she has to endure this twisted torture by the hands of Michael he has this twisted nature and how he punishes her and rewards her. Ava is such a strong character and she wants to survive this and is able to gain Michael's trust some what. Evan tries so hard to help Ava and you see him so helpless. He himself is another captive and being starved. You get to see this twisted fantasy family Michael wants them to be. This twisted love he has for Evan and Ava and how really crazy he is. \"Michael loved Evan, more and wanted him more. He only wanted Evan to see, he hoped that once all three of them-Evan, Michael and pet were a family, he would see how right everything was. They would be unstoppable and none of them would have to be alone ever again. She was the key and would hold them together.\"I loved that we get point of views from Ava, Evan, Michael and Miles and we get to see how they all dealt with this. Oh Miles such a good vampire, trying to save Evan and Ava and you see that his interference causes Michael to what revenge. You get Evan's story and what he did to help his sister, we also get Michael's origin; how he became a Vampire and some of the reasons he is the way he is. The ending was great, sad and bittersweet. Thank you!!!!"}, {"userName": "Shantal Oliver", "userReviewDate": "Dec 22, 2015", "userURL": "http://www.goodreads.com/user/show/34839002-shantal-oliver", "userReview": "Synopsis:Ava has spent her life running from the monsters that lurk in the shadows, always the prey. She finally thinks she can settle down, have a normal life, and work on not being so scared of the world around her. That is until she runs into her worst fear. He has finally found the potential family he has always wanted. All he has to do is make his little bird sing. Will Ava escape with her humanity intact?Review:When I began this book I honestly thought it would be another werewolf or some sort of shape shifter story, but instead was surprised (if not pleasantly so) to learn that it is a vampire novel. Our protagonist is Ava, a girl who suffers from an anxiety/paranoia disorder after her parents die in a fire who bounces form town to town with her cousin Toni when she feels like they have been there too long and the infamous they will be able to find them the longer they stay. Ava has just moved to a new city, and is working a shift in a pet store when in walks a pale handsome man asking about a pet; nothing nefarious at first, but then he keeps popping up at the store and in her personal life.\tLater on we learn that Ava’s parents helped vampires who wanted to be “human”, but they only helped “good” vampires, and in comes Michael a vampire Ava’s parents refused to help and in return years later he kidnaps Ava to make her his human blood bag or donor. I have to say Vampire fiction is one of my guilty pleasures, but this book barely did anything for me. The story concept is good and the plot went exactly where you thought it would go, in laymen’s terms it was not very surprising. Reading was very stop and go for me I hardly found it interesting in some places, but in others it picked up and had all of my attention. I didn’t really connect to any of the characters at except maybe Michael (the antagonist) which is strange because he’s a complete psycho( kind of like Klaus from the originals), hell bent on making Ava his, and doing so by punishing her or Evan(guy form the pet store) to gain her compliance. When I finished reading though I was left hoping that there would be a second book, because there were so many things left unanswered. I give Animal a 3 out of 5 hearts."}, {"userName": "EscapeNBooks", "userReviewDate": "Mar 12, 2015", "userURL": "http://www.goodreads.com/user/show/29345875-escapenbooks", "userReview": "I was gifted a copy of this book from the author in exchange for an honest review.“On the outside there was not permanent damage, but inside I was scarred forever.”We enter the story being introduced to Ava. She is an animal whisperer.  Dealing with animals is a breeze. Humans, not so much. At age 15 her life drastically changed.  Her parents had connections that introduced her to an irregular lifestyle. But, now they are no longer around to love and nourish her. She clings to routines and numbers to help her pass from one moment to the next.  “All I seemed to want was closeness, even if it meant being close to the monster that had taken me away from my life and tortured me.”“He” has watched Ava. From the time she was young, until the present time, he has watched her, always being just a step behind. But, he is tired of lurking in the shadows and has decided that it is now time to collect the prize that he has so dutifully watched.“They” are the unfortunate bystanders. The one’s who have no choice, but are now part of this story due to their grievous associations. They interact with each of our main characters in their own way, watching each hideous scene as more secrets and maddening behaviors are revealed. Even the less dreadful parts of the story are laced with an overshadowing evil presence that taints the good with its poison. Yet all of these characters persist, helping to weave together an intricate plan that will hopefully allow for a future.When I finish a book from Nikki Rae I am torn with emotions. Do I stand up an give applause? Or do I try to put the pieces of my Kindle, heart, and mind back together? It took me days to digest and sort out Animal so that I could write this review. The writing was what I have come to know from Ms. Rae. She is an excellent story teller. The character development was so gripping. The storyline made me want to double check all the locks on my doors, at the same time that I wanted to curl up in my couch and get lost in Ava's story. I believe a good description would be darkly mesmerized. Animal was not my typical happily-ever-after read, but there was finality, and the characters did find solace in this resolution.“The bird flew away.”"}, {"userName": "Elien", "userReviewDate": "Mar 02, 2015", "userURL": "http://www.goodreads.com/user/show/6205678-elien", "userReview": "This review and more on  So BookaliciousAnimal is a spin-off of Nikki Rae’s Sunshine Series. Ever since I read that series I’m in love with the author’s writing. We first got a glimpse of Ava in the Sunshine Series, back then I was intrigued with her story. So when I found out that Ava would get her own book I was so excited. Ava’s story didn’t disappoint me. Since Animal is a prequel to the Sunshine Series it can easily be read when you haven’t read the Sunshine Series yet. And believe me after you have finished this book you will want to read Nikki’s other work. Ava has been on the run for the last couple of years. She feels that someone is lurking in the shadows. Ready to grab her as soon she lets her guard down. But she knows from what she’s running but not from whom. Ava is one of the few humans that know that vampire live among humans. Her parents used to help them integrate into the human world. But they also taught her how to block them out of her head and never to trust one of them. Still somehow one of them managed to sneak into her world. All Ava can do now that her worst nightmare has come to life is try to fight and survive in any way that she can. I really admired Ava her strength. She is so incredibly brave, I don’t think I could have handled it the way she did if I was in her shoes. No matter how hopeless her situation seemed, she never gave up. When plan A failed she thought of a new plan. And if that one also failed she thought of yet another one. Never once did it cross her mind to just give up. Partly why she never gave up was because of Evan. She didn’t know if she could trust him, even Evan didn’t know if he could be trusted. After all he is bonded to Michael. But Evan reminded Ava whenever she thought that all hope was gone that there was something left to fight for. I really liked Evan for that. Overall I really loved this book. Nikki always manages to capture my attention and suck me into the story right from page one of the book. Her books are always so raw, horrifying and beautiful at the same time. For all of you who haven’t read any of her books yet, I would highly recommend them to you."}, {"userName": "Laura Greenwood", "userReviewDate": "Mar 02, 2015", "userURL": "http://www.goodreads.com/user/show/19290780-laura-greenwood", "userReview": "Review forthcoming on http://a-reader-lives-a-thousand-live...Title: AnimalAuthor: Nikki RaeFrom: Review CopyGenre: ParanormalChallenges: Winter COYER, 2015 New Release Challenge Links: Goodreads - AmazonAva has known about Vampires for years, her parents used to help them assimilate into human culture. Until the fire that is. Ava has suffered from breathing problems relating to anxiety ever since, and its only getting worse. Micheal has had his eye on Ava for a while, believing she is the girl he wants. Using one of his vampires, Evan, against his will to bring Ava in, they all face horrors in what persues.That moment where you realise many of the characters are the same as in the other Nikki Rae books you've read! I agreed to read this because I've loved everything I've read from Rae so far, and didn't actually read the blurb (yes I know, I do it alot) but the moment it clicked was a good one for me! I liked how Animal not only gave back story to Evan, Myles and Ava from the Sunshine series (as well as Micheal) but tied in The Donor to the same universe as well.One thing that should be said is that Rae's books aren't easy on her characters. The face horrible situations and you often end up questioning how they could possibly survive. As bad as that sounds, it does allow Rae to weave such a captivating story that you need to read on to find out how it ends.It was very interesting seeing another side of Micheal in Animal. In Sunshine he was most definitely the bad guy, and though there is little doubt that he is still bad in Animal, there were other, more caring aspects to his character. Though I think the parallels between Ava and the canary make it very clear how he should be seen.There felt to be a lot of symbolism and parallels in Animal, both using animals themselves, like the canary and the cat, but also between characters. Mainly between Ava and Katya (who wasn't actually a character but a memory) and also between Evan and Ava. It all interwove well and gave more layers to a book that had a small cast of characters.I really enjoyed Animal, both in a story as itself and as a companion to Sunshine, though it was a bit strange knowing what would happen to several of the characters in the future!"}, {"userName": "E.P.", "userReviewDate": "Jan 21, 2016", "userURL": "http://www.goodreads.com/user/show/9870224-e-p", "userReview": "I picked up (actually, downloaded) a copy of \"Animal\" after reading \"The Crow Box,\" Rae's latest release. I really liked \"The Crow Box\" and if anything, I liked \"Animal\" even better. It's the story of a young woman, Ava, who's on the run from...what? Vampires, it turns out. Only one of them has his eye on her and ***SPOILER ALERT****ends up kidnapping her, while another vampire seems to be in love with her, but is helpless to do anything about it. If this sounds like a cliched plot, Rae rewrites it in an incredibly fresh way. The romance element takes a back seat to Ava's mental problems and her careful negotiation of her captivity, as she gradually figures out how to turn her powerlessness into power, while worrying that she is in fact succumbing to the lie that she's building about her desire to remain in captivity rather than seek freedom. It's a fine portrait of the psychology of oppression and captivity, and worth reading for that reason alone. Readers searching for a lighthearted, sexy paranormal romance will probably not find what they are looking for, as the tone is very dark and there is very little that is sexy about what happens between the characters. However, if what you're looking for is a suspenseful supernatural thriller with a complex heroine, you will probably enjoy this book very much, although I for one found the tension to be so intense it was almost painful to read. It's up to the individual reader whether they consider that a plus or a minus, but it is indubitably well-done."}, {"userName": "Maureen", "userReviewDate": "Mar 02, 2015", "userURL": "http://www.goodreads.com/user/show/15138448-maureen", "userReview": "In ‘Animal’ we meet Ava, a girl with anxieties, trying to hide from her painful past. Although Ava’s life seems anything but happy, she’s managing the best way she knows how. But one night Ava makes a huge mistake and finds herself being taken by Michael, a very evil kind of man. From that night forward Ava lives her life in terror. The one little light in her current life is Evan, but even he is not safe from Michael. What I liked the most about ‘Animal’ was definitely Ava’s character. Even in the darkest times she is very strong and tries to find a way out of her ‘hell’. I loved the way Nikki Rae made me love Ava more and more throughout the book. This book is definitely dark, but it’s also very intriguing and keeps you on the edge of your seat. The fact that this book also includes vampires, made me like it even more. I love stories about vampires and this book is definitely filled with very bad but also good vampires.Somehow I really liked Evan from the very beginning. He just has this thing about him that made me like him, even though I didn’t really understand in the beginning if he was good or bad. This book is a spin-off of the Sunshine series, but you can definitely read this one without reading the series. Nikki Rae did another great job with keeping her readers on the edge of their seat and if you haven’t read any books by Nikki Rae before, this book will definitely make you want to read more written by her."}], "description": "Ava has spent her life running from the monsters that lurk in the shadows, always the prey. She finally thinks she can settle down, have a normal life, and work on not being so scared of the world around her. That is until she runs into her worst fear. He has finally found the potential family he has always wanted. All he has to do is make his little bird sing. Will Ava escape with her humanity intact?", "title": "Animal", "url": "https://www.goodreads.com/book/show/21893582-animal", "average": 3.69, "cover": "https://images.gr-assets.com/books/1424095640l/21893582.jpg", "reviews": 62, "authors": [{"url": "https://www.goodreads.com/author/show/6751095.Nikki_Rae", "name": "Nikki Rae"}], "type": ["Fantasy", "Paranormal", "Suspense", "Dark"], "outlinks": ["http://www.goodreads.com/book/show/21893582-animal", "http://www.goodreads.com/book/show/26148514-animal", "http://www.goodreads.com/book/show/25037495-animal", "http://www.goodreads.com/book/show/16637812-sunshine", "http://www.goodreads.com/book/show/20489653-sun-poisoned", "http://www.goodreads.com/book/show/21795547-sun-damage", "http://www.goodreads.com/book/show/24039015-the-donor-parts-1-3", "http://www.goodreads.com/book/show/21844566-the-donor"]}