{"ratings": 4877, "userreviews": [{"userName": "Julie", "userReviewDate": "Nov 08, 2016", "userURL": "http://www.goodreads.com/user/show/5210022-julie", "userReview": "An Obvious Fact by Craig Johnson is a Viking publication. “There is nothing more deceptive than an obvious fact” Sherlock HolmesThe Walk Longmire series by Craig Johnson is an auto add for me. I love, love, love these books!! This twelfth installment has Walt and the Bear traveling over to Hulett, near the Devil’s Tower monument, right in the midst of the Sturgis rally to investigate a hit and run accident. As usual, I chuckled often at Walt and Henry’s banter, especially with Henry on a Sherlock Holmes kick, which has him quoting the famous detective at every turn.  But, the case they are trying to help with just keeps getting more and more curious… and a little personal, too, especially for Henry, as his beloved ’59 Thunderbird, the one he named ‘Lola’, gets an unexpected starring role, and the ATF sticks their noses into matters, as well. This story is a slight departure, having a different backdrop, but our favorites are all present and accounted for- Henry, Walt, Vic, and dog, but a few characters must weigh in from afar, and others not at all, but we get to see another side of Henry, or at least a part of his past, which is most interesting. “Leaping to conclusions before one has the facts is the mark of a true amateur.” But, the atmosphere is mostly the same with the trademark humor, witty dialogue, and non-stop action, plus a unique cast of colorful characters that keeps Vic and Walt on their toes, and some pretty intense moments of suspense to cap things off. Overall, this book is as well written as all the previous chapters, and is another vastly entertaining addition to his wildly popular series.  4 stars"}, {"userName": "Thomas", "userReviewDate": "Aug 13, 2017", "userURL": "http://www.goodreads.com/user/show/24360539-thomas", "userReview": "4*This the 12th book in the Longmire series and as always, Craig Johnson has delivered a well written mystery involving many of the recurring characters in the series. Walt Longmire gets a call from a friend, Campbell County Sheriff's Deputy Corbin Dougherty. Dougherty wants Walt to help him investigate a motorcycle accident that has left the motorcyclist in a coma and unlikely to ever recover. Walt is renowned throughout the state of Wyoming as one the best investigators the state has. He is the Sheriff of fictional Absaroka County.As Walt starts to ask questions, he soon realizes that there are some major criminal activities going on.Some of the characters:Walt's friend, Henry Standing Bear, who came to participate in the annual Sturgis motorcycle rally.Victoria Moretti, Walt's undersheriff.Lola, an old girlfriend of Henry's. He named his car Lola. Walt's granddaughter is named Lola, after the car. Lola is the mother of the injured motorcyclist.Robert Nance, local rich guy, and father of the witness who reported the motorcycle accident.I liked the way the story went back and forth between humorous exchanges between the characters and the building mystery.One quote: Henry Standing Bear \"Not all fair maidens are worthy of rescue, Walt.\"This was a library book."}, {"userName": "Brenda", "userReviewDate": "Oct 18, 2016", "userURL": "http://www.goodreads.com/user/show/5240149-brenda", "userReview": "Craig Johnson's Longmire series has been a favorite of mine for awhile. I enjoyed this newest addition, but I don't think it's as good as others in the series. The usual crew and the humorous banter is there, but there's no American Indian mysticism and not much sense of place as in previous books. I miss that.The story takes place in and around the motorcycle event in Sturgis, South Dakota, and particularly in Hulett, Wyoming. Walt and Henry are on vacation, but of course there is a crime for Walt to get involved in. Vic shows up eventually, out of the blue as a surprise. In serious situations, there was no tension and the dialogue remained humorous. Henry's old flame, Lola, for whom his car is named, was despicable, so what did Henry ever see in her? And the young man, Bodaway, remains lying in the hospital as far as I know. Unfortunately, this book feels like Johnson didn't put in much effort and just scratched the surface of what could have been a great story. I hope the next book he writes is better."}, {"userName": "Trish", "userReviewDate": "Nov 12, 2016", "userURL": "http://www.goodreads.com/user/show/1826682-trish", "userReview": "Reading a Craig Johnson mystery is so reassuring. At a time when we have reason to wonder whether our government is working for or against us, here Johnson comes to let us know that there are people of goodwill laying their lives on the line for us every day. The ATF makes an appearance in this novel, and Johnson is kinder to them than he often is to the FBI. The AFT role-play characters that wouldn’t be out of place on the stage, though the guns aren’t toy replicas, and the crowd is more like the mob.There is so much information in a Craig Johnson novel, it is sometimes difficult to choose an element to emphasize: geology, geography, popular culture, Indian ways, and in this case … guns and motorcycle rallies. The setting is Hulett, Wyoming, next-door town to the annual Sturgis Motorcycle Rally just across the state line in South Dakota. A very handsome motorcyclist of Cheyenne descent winds up hospitalized, and when Longmire and Henry Standing Bear investigate, they discover that Lola, an old flame of Henry’s, is mother to the boy. Paint from her car is on the wrecked motorcycle.The ancient battle of the sexes plays out against a backdrop of big stakes, drugs, guns, money. Our perspective is realigned several times as readers struggle to trust anyone in this setting of bikers, races with life-defying odds, secret airports, and glamorous women over fifty years of age who are still dropping the jaws of young, reckless men. The title is explained in the first pages as Henry Standing Bear carries with him a three-volume set of The Complete Stories of Sherlock Holmes: “There is nothing more deceptive than an obvious fact.”One of the compelling features of Craig Johnson’s novels are that things like MRAPs have a certain kind of logic in one-road midwest border towns. We know the federal government has “retired” some of their military vehicles to towns willing to put up some rationale and some cash, but finding one in Hulett can be a goldmine to an inventive fiction writer. I appreciate Johnson’s sense of humor about these things, giving the vehicle a starring role, but once he mentioned it in the beginning we knew he was going to have to use it before the end.There is little evidence of the supernatural in this novel, unless one counts the outstanding story-within-a-story about the skeet shoot starring none other than Walt’s foul-mouthed undersheriff Vic, who returned to Wyoming from her failed search for the murderer of her cop brother in Philadelphia. Walt’s daughter in Denver calls a couple of times with news of Walt’s granddaughter, Lola, and with answers to puzzles. Cady is so familiar now to readers of the series that she no longer needs to be identified by name.Johnson’s series is so easy-going and inventive that it is easy to forget how difficult it is to construct a story where readers are stumped all the way to the end. And all the while we are ambling through some gorgeous country, getting a taste of local habits, and specialities like dinner plate-sized pancakes. For me, the best might be that I discovered the name of a geologic formation that my parents had visited way back before I was born when they travelled across country in an early Ford. Last year I found some photographs tucked away from their early days and knew that place, Devil’s Tower, must be something special, rising as it does 1,267 feet from the plain in northeast Wyoming, the site of America’s first national monument.Many thanks to a kind friend who sent me a signed first edition of this fine novel. I am so glad I had a copy to pick me up after an emotionally-draining week getting battered at the ballot box. Many of the folks who reside in Walt Longmire’s neck of the woods voted for our new president-elect. It is my everlasting hope that those residents are more like the good guys in Johnson’s novels than the bad ones. A Sherlock Holmes quote seems suitable, since Henry scatters them throughout this episode. “Mediocrity knows nothing higher than itself; but talent instantly recognizes genius.” Let’s hope they know what they were doing this election."}, {"userName": "Magdalena aka A Bookaholic Swede", "userReviewDate": "Jan 09, 2016", "userURL": "http://www.goodreads.com/user/show/1379514-magdalena-aka-a-bookaholic-swede", "userReview": "If I had to list my favorite ongoing book series would Longmire definitely be on it! I discovered the series a couple of years ago and read all the books that had been published until I ran out of Longmire books and then I had to start waiting for new ones to be written. The agony! \nAn Obvious Fact is book 12 in the series and while it's good I still think the last really great book was book 9, A Serpent's Tooth. Not that the books after A Serpent's Tooth has been bad, it's just that, despite how much I adore the characters in this series the stories has not always been so fantastic that I found the one in A Serpent's Tooth to be. I had high hopes that this book would prove to be really good since the last book ended with the murder of a close family member to Walt Longmire. But, the story in this book instead was about a young man run off the road and the appearance of the original Lola, the person that Henry's '59 Thunderbird is named after and in some extension Walt's granddaughter. Of course, the murder was mentioned since it has affected many of the characters in this book, but that about it. Nevertheless, despite not loving the story 100% was it quite enjoyable reading the book thanks to Walt, Vic, and Henry and of course Dog! Henry spent the book quoting Arthur Conan Doyle to Walt's annoyance, and Vic shows what a badass shooter she really is. And, Walt, as always got in trouble, well Walt, Vic, and Henry got in trouble. So, I can't say that I did not enjoy reading the book since I loved many parts of the book. It was just the \"case\" was not that interesting and the big bad was not a total surprise. And, Lola, well she was a real bitch and if I was Cady would I have renamed my child and definitely not called my car Lola again!I want to thank Viking Books for proving me with a free copy through NetGalley for an honest review!"}, {"userName": "Karl", "userReviewDate": "Jan 11, 2016", "userURL": "http://www.goodreads.com/user/show/1935255-karl", "userReview": "A narrator at the begging of the by gone television era series of “The Naked City “recounts the line: \"There are eight million stories in the naked city. This has been one of them.\", Well I guess the same thing cannot be said of Walt Longmire’s Absaroka County, Wyoming. The noble Sheriff packs up his dog “Dog” and his best friend Henry Standing Bear, a couple of motor cycles and heads on vacation to the annually held motorcycle get together in Sturgis, South Dakota Where Henry, AKA “The Cheyenne Nation” , can enter a motorcycle uphill racing competition. Sturgis is a small town in western South Dakota with a year-round population of less than 7,000 people. Yet every year more than a hundred thousand bikers descend on that tiny town to drink, race, and have fun.Another reason for the visit is Longmire has been asked to help look into a suspicious hit and run injuring a young man near a small town near the cycling events. And here we have the meat of this novel. Both Walt and Henry fall deeper and deeper into the rabbit hole created by this incident. “An Obvious Fact”, is the latest installment of this continuing series (officially number 12), has Henry quoting some Sherlock Holmes, and Longmire’s love interest, Victoria Morettli , engages in some fancy competitive skeet shooting. Craig Johnson infuses a layer of humor into the proceedings of this adventure in the “New West”, which is much appreciated, and if I had any reservations regarding this book, it would be the need to introduce a “Super Villon” into the narrative, as this degrades the general impact of the series as a whole and turns the participants into contrived super hero’s battling for the safety of humanity, turning Longmire into a pseudo James Bond type character.Overall I enjoyed the book.This is a paperback ARC of an Advanced Uncorrected Proof."}, {"userName": "Hobart", "userReviewDate": "Jun 08, 2016", "userURL": "http://www.goodreads.com/user/show/4084033-hobart", "userReview": "Craig Johnson is so consistent with these books that he makes it really hard to write about them. I've struggled with this one for weeks -- how can I say something I haven't before? I'm not sure I can, but I guess I can start with what makes this one different from the rest.For starters, Henry's borrowed Walt's set of Sherlock Holmes (without his knowledge or consent, but who cares) and spends the novel quoting Holmes at inopportune times to his buddy. I laughed every time. Walt didn't find it that amusing -- and paid him back by talking about what a silly and reckless endeavor riding motorcycles is -- much less racing/jumping/etc. He had plenty of opportunity to make these kind of remarks as the two of them were in Hulett, WY for the world's largest motorcycle rally, where Henry is attempting to recapture a victory of his younger days.Walt's been brought in to help with the investigation of a motorcycle crash, the small local police force is stretched beyond itself due to the rally and really can't take it on. It seems pretty cut and dry on the surface -- just a bad break and a bit of careless driving. But every time Walt looks at another piece of evidence, he finds more reasons to doubt the obvious facts.We learn a lot about Henry in this book -- but he's not really in it all that much (at least less than he's been in others, lately). And while he's not really at odds with Walt, you really can't say that he's on his old friend's side throughout (nor is he really acting all that rationally).Vic comes back to Wyoming, and injects her flair into the investigation and Walt's life. She also continues to be the embodiment of many men's dreams between her looks, brains, language, driving and shooting. I'm not going to say if she's my Platonic ideal, I will say that for a totally unrealistic character, she's a whole lotta fun.The Whodunit was pretty easy, the Whydunit was trickier (and the Accessories to the Who were more difficult, but not hard). But, hey, we don't read these books for the puzzle -- we do it to watch Walt figure things out and to spend time with our friends from the Equality State (and the nations within it). In the end, this is just what you expect out of a Walt Longmire novel -- some laughs, a nice little puzzle, a little fisticuffs, maybe a little gunplay (not necessarily a shoot-out). Well-paced, well-told, all in a day's work for Johnson.Disclaimer: I received this eARC from Viking via First to Read in exchange for this post -- thanks to both for this."}, {"userName": "Kathleen (QueenKatieMae)", "userReviewDate": "Sep 17, 2016", "userURL": "http://www.goodreads.com/user/show/6713486-kathleen-queenkatiemae", "userReview": "This is painful to admit but, as much as I adore Craig Johnson’s Longmire series, this latest book is my least favorite. Other reviewers noticed something not quite right with An Obvious Fact but were unable to put it into words. I can sum it up in one sentence: it’s lacking in Johnson’s usual spiritual context. Whether a byproduct of Native American mysticism or Walt’s love for his nearest and dearest, there is always some common spiritual element that propels the story forward. An Obvious Fact is lacking this spirit and it ruins the story for us diehards who have come to expect a deeper and more complex Walt.Set during the annual motorcycle rally in Sturgis, the story is crowded with weird characters wearing Viking helmets, drinking themselves stupid, getting arrested, starting barfights, showing off their choppers or flexing their testosterone. Henry and Walt are there so that Henry can relive the glory days of his youth when he set records on his motorbike. We meet Lola, the namesake of Henry’s car and Walt’s granddaughter. And there is a mystery (or two) that is not really a mystery (or two).First off, I don’t recall Henry riding a motorcycle in the previous books; he had Lola and Rez Dog. So this last hurrah is a bit of a head scratcher. Second, why would Johnson name a beloved car and beloved granddaughter after such an unbelievably unpleasant character?? Lola is grating, obnoxious, totally lacking in morals and sense of humor, and is downright not nice. And the mystery that is not a mystery? The title is borrowed from a quote by Arthur Conan Doyle (Henry is on a Sherlock Holmes kick) that there is “nothing more deceptive than an obvious fact.” Right there, the entire book is revealed: everyone and everything you suspect will be true. Usually there is some twist that throws me and all my deductive reasoning is for naught. But not this one. Kind of ticks me off. There are a few touching phone calls between Walt and the newly widowed Cady; the investigation into Michael’s murder is still ongoing. I learned the colorful names of some cool bars and I now know the humble origin of the Sturgis motorbike extravaganza. And not only can Vic drift like a pro, but she’s also pretty badass with the weaponry; she kept me happy, she always does. However, I found a major chunk of the book to be strangely insensitive and less noble than I expected concerning a hit-and-run victim. It was quite surprising. It would have made for a good soul-searching for one of the characters. Instead, the resolve leaves the reader with a bitter taste. And Walt wasn’t his deeply philosophical self, solving mysteries and saving lives. He still got in a few zingers when talking with the The Cheyenne Nation, but he was different this time. Maybe a peyote dream or a hypothermic hallucination would have helped (that’s for the diehards out there).Anyway, I don’t want to criticize an author I absolutely adore and respect so this is a really hard review to write. But, An Obvious Fact is not his best work. I will still preorder his books months in advance, and see him every time he comes to town, and I will see this series to the end because I absolutely love these characters and Craig Johnson. We'll just give this one a Mulligan and move on."}, {"userName": "Thomas Todd", "userReviewDate": "Sep 25, 2016", "userURL": "http://www.goodreads.com/user/show/31158200-thomas-todd", "userReview": "***1/2 This is Craig Johnson's most recent Walt Longmire novel set on the Wyoming and South Dakota border during the biker rally at Sturgis week. Henry & Walt come to town driving Lola with Henry's bikes in tow. The two soon run into one of Henry's old flames, Lola who ask for their assistance in finding out who tried killing her son who's in ICU from a motorcycle accident. Henry gets to hill race his bike, Vic shows up in a rented Dodge Challenger, which Walt has many names for including Orange Blossam Special. Walt, Vic & Hear end up working with other local officials and their PEQOUD, and ATF agents in solving an unrelated crime. Is the attempted murderer of Lola's son An Obvious Fact? You'll need to read to find out."}, {"userName": "HBalikov", "userReviewDate": "Sep 17, 2016", "userURL": "http://www.goodreads.com/user/show/929238-hbalikov", "userReview": "I took a break from my other reading to check out the new Longmire. No regrets. More than a four star, this is better than Craig Johnson's recent efforts. I will try to write a complete review soon, but here are some of the basics:- Walt has a basic mystery to solve- Henry is with him and we learn much more about his past- Vic is back, and less of a caricature than recently- The setting with Devil's Tower and the annual Sturgis biker festival is new- The mysticism is dialed back substantially- The bad guys are interesting- And, Johnson weaves some nice humor into his storyBoy howdy"}, {"userName": "Linda", "userReviewDate": "Jul 31, 2016", "userURL": "http://www.goodreads.com/user/show/745543-linda", "userReview": "This time Walt Longmire and his friend, Henry Standing Bear find themselves in the middle of a motorcycle rally as they investigate an accident of a young biker with possible ties to arms dealers. They find more than they bargained for as the deeper they dig, the farther down they go into a conspiracy with long reaching arms and all in the shadow of Devil's Tower.You can't go wrong with Walt Longmire and I highly recommend his new book."}, {"userName": "Kasa Cotugno", "userReviewDate": "Sep 14, 2016", "userURL": "http://www.goodreads.com/user/show/2345554-kasa-cotugno", "userReview": "Latest in the Longmire series which runs a different story arc from that on the Netflix series. Walt and Henry find themselves in Sturgis at the time of the annual biker convention, out of their usual neighborhood. Great backstory and satisfying mystery."}, {"userName": "Cindy Burnett", "userReviewDate": "Aug 21, 2016", "userURL": "http://www.goodreads.com/user/show/2445617-cindy-burnett", "userReview": "After reading An Obvious Fact by Craig Johnson, I now have two favorite mystery series – the Walt Longmire books and the Joe Pickett series by C.J. Box. Interestingly enough, they both take place in Wyoming. I had seen the Walt Longmire books at my local mystery store for years and had never gotten around to starting them. Recently I received this ARC from First to Read right around the time that I learned “Longmire” was a series on Netflix. My husband and I have been binge watching “Longmire” (which is fantastic), and I finally began the book series, starting with book 12. I absolutely loved it! Now I need to go back and read books 1-11. Walt Longmire is the perfect protagonist, and Vic and Henry are fabulous sidekicks.Walt Longmire is the Sheriff of Absaroka County, Wyoming. Walt, along with Vic and Henry, are called to nearby Hulett County, home to Devils Tower, to investigate a motorcycle accident occurring during the annual Sturgis Motorcycle Rally. While it initially appears to be one of many accidents occurring during Sturgis, Walt quickly discovers that there are greater forces at work as the Bureau of Alcohol, Tobacco and Firearms arrives, rival biker gangs stir up trouble, and an underground Nazi extremist group is uncovered. As the story unfolds, Walt, Vic and Henry strive to solve the increasingly puzzling mystery of the “accident” and its underlying causes.This mystery was particularly appealingly to me because we visited Devils Tower several years back during the Sturgis Rally (the timing was unintentional). It was a fascinating time to be there, and I thoroughly enjoyed reading about it through Craig Johnson’s eyes. I highly recommend this mystery and cannot wait for the next one. Thanks to Penguin’s First to Read for this ARC in exchange for an honest review."}, {"userName": "Mark", "userReviewDate": "Oct 13, 2016", "userURL": "http://www.goodreads.com/user/show/2037893-mark", "userReview": "I don't know what it is about Wyoming \"law enforcement\", but it is a compelling backdrop for two of my favorite authors and series: Craig Johnson's \"Walt Longmire and C.J. Box's \"Joe Pickett\"...good stuff!!!...While I've enjoyed the TV series, book Walt is SO much more entertaining than A&E/Netflix TV Walt...book Walt's & Henry's humor and lightness carry the novels to a much higher plane...in this one, Walt & Henry become involved in an ATF investigation in the middle of a Sturgis-like motorcycle rally by Devil's Tower, WY....We meet the original Lola, the human one, adding another possible layer to future stories...GREAT READ, as always!"}, {"userName": "Harvey", "userReviewDate": "Sep 24, 2016", "userURL": "http://www.goodreads.com/user/show/3324623-harvey", "userReview": "Enjoyed this latest Longmire very much. Reliably twisty plot, the usual suspects (Henry, Vic, and Dog, along with Walt), and a fun backdrop (Biker's Rally).As I also enjoy the Netflix series (just started Season 5), I must say that the books do a good job of incorporating humor (without going over the top). The TV series definitely has taken a darker turn and lacks that. Johnson's writing remains crisp and neat, and he adds touches such as useless trivia and (useful) Conan Doyle/Sherlock Holmes quotes."}, {"userName": "Sandy Lenahan", "userReviewDate": "Oct 18, 2016", "userURL": "http://www.goodreads.com/user/show/26236011-sandy-lenahan", "userReview": "Craig Johnson can do no wrong in my opinion. Witty, engaging and just a damn fine read. My favorite bit in An Obvious Fact are all the different names Walt gives Vic's rental car...the orange blossom special, pumpkin chiffon, the General Lee and the Great Pumpkin. The state of Wyoming should give Johnson the honorary title of State Tourism Treasure for all the love shown to Wyoming in the 12 books of his Longmire series."}, {"userName": "Jim", "userReviewDate": "Apr 18, 2018", "userURL": "http://www.goodreads.com/user/show/7627123-jim", "userReview": "Another fantastic Longmire tale from author Craig Johnson. Once again a solid thriller featuring Johnson's iconic characters. At just over 300 short and to the point pages, \"An Obvious Fact\", is a five stars out of a possible five star read. Although I'll the miss the TV show greatly, but the books were far superior all along. #LongLiveLongmire ! I hope there are several more books in this series. A do not miss series, and another do not miss book from this series. Without out haste read Craig johnson's Longmire books. Classics all !"}, {"userName": "Eric", "userReviewDate": "Apr 12, 2017", "userURL": "http://www.goodreads.com/user/show/76688-eric", "userReview": "This has become, and continues to be, my favorite book series. The author's ability to construct new and interesting plot-lines for the protagonist and supporting cast after a dozen books and a few short stories is endlessly impressive to me. This one, in particular, focused on a bike rally in nearby Sturgis, and the weekend bikers and motorcycle gangs an event like that brings. Compelling reading, as always. I eagerly await the next entry, The Western Star, which is due out later this year."}, {"userName": "Kathy Davie", "userReviewDate": "Jan 03, 2017", "userURL": "http://www.goodreads.com/user/show/4222001-kathy-davie", "userReview": "Twelfth in the Walt Longmire crime mystery series and revolving around a folksy sheriff in Wyoming with this story set in Hulett. It's been three months since \nDry Bones\n, 11.My TakeI always enjoy reading about Walt and Henry — Henry is a big reason I adore the Walt Longmire series. He's so serious in his concise, dry humor. Yeah, okay, I also like that he and Walt can take on anyone and win, lol.I'm of two minds about Walt. I love how he cares for people and how supportive he is. And I do adore his sense of humor.\"They asked me who I was, and I told them that I was a sheriff too and that we needed to touch badges so we could recharge.\"But Walt does pull some really stupid stunts some times. In An Obvious Fact, it's damn lucky he knows so many people, lol.Some scary \"fun\" was that story Heiple tells about World War II. Scary. He was obviously supposed to stay alive. EeekIt's all those confusing bits and pieces that caused me to drop the rating to a \"4\" \"3\". I got to ruminating in the night and realized that An Object of Fact was simply too full of tell to rate that \"4\". It's Lola's part in all this. She wasn't convincing as the femme fatale nor as a mother. Considering what's happened...I expect more of Johnson. I think we spend most of our time in Hulett. I don't understand Lola's role in all this. And that woman is really somethin' else. Manipulative. Cold. And she sure rubs Henry the wrong way. And what I want to know is where did Walt get the idea about Lola and Post? Where did his conclusions at the very end about Lola come from? Admittedly, I actually can see that happening — can any mother be that cold?? What was with the Nance invite for the shooting contest? Were Walt and Henry heading over for the rally anyway and got called in for the accident? Why else would Henry have his bikes?Yeah…Johnson dropped hints all over the place, but I was still lost.Meanwhile Walt gets dragged in to the twenty-first century to the tunes of Lynyrd Skynyrd.The StoryIt's a combination vacation and accident investigation when a young biker is run off the road during Sturgis week and ends up in critical condition. In one sense, it's old-home week for Henry as he competes in the rally and comes up against an old flame of a femme fatale — the woman for whom Henry named his '59 T-bird.It's the accident that is so much more than it seems as the ATF, a biker gang, and a donated military-grade vehicle come into play against a number of slick, bullying thugs who have their own agendas.The CharactersWalt Longmire is a sheriff in Absaroka County. Dog is Walt's 150-pound security system. Henry Standing Bear, a.k.a., Cheyenne Mountain and Heads Man of the Dog Soldier Society, Bear Clan, named his '59 Thunderbird \"Lola\" for her. Cady named her daughter, Walt's grandchild, for Henry's car. Lucie is Henry's 1940 Indian Four motorcycle while Rosalie (named for Rosalie Little Thunder) is the dirt bike. Vic Moretti is Walt's deputy and girlfriend.\nHulett, Wyoming is…\n…where most of the action appears to take place. William \"Nutter Butter\" Butter is the chief of police. Corbin \"Deputy Dog\" Dougherty transferred from Gillette after a, um, incident. The Pequod is an MRAP, a Mine-Resistant Ambush Protected vehicle, and the police department's latest acquisition.Bob Nance is a local, sort of, who made his wad in ceramics in the auto industry. Mr. Frick is one of his bodyguards. Chloe is his wayward daughter. George \"Gogo\" Lance was staying in the same hotel. Connie Evans, Patricia Frontain, Annemarie Parker, Raye Lankford, Kelly McBride, and Dr. Carlton (with whom Walt has a connection) are all first-class shooters in the contest. The Bucket of Blood Saloon is popular.Sturgis, South Dakota is……where the Sturgis Motorcycle Rally takes place, and where once a year, almost a million bikers show up. Jamey Gilkey has a motorcycle shop in Sturgis.The Black Hills Classic was……started back in 1938 when Clarence \"Pappy\" Hoel founded the Jackpine Gypsies Motorcycle Club. KOTA Territory News is a TV station.The Tre Tre Nomads are……a motorcycle gang from Arizona. Bodaway \"B-way\" Torres is twenty-two. The Lola is Loa Wojciechowski, a former \"hot-n-heavy\" girlfriend of Henry's from 30 years back, and B-way's mother. Delshay Torres, a Yavapi Apache, owns a custom bike shop, Crossbones Custom, in Maryvale, Arizona, and is B-way's dad and Lola's ex. Brady Post is the \"spokesman\", a.k.a., Enforcer, for the gang. Big Easyis the bodyguard assigned to B-way.Eddy the Viking, a.k.a., Crazy Eddy and a drunken idiot, is one of the original Jackpine Gypsies. He used to work for Kiddo. Phil Vesco is his thievin' buddy.Rapid CityIrl Engelhardt is the sheriff. Herb Robinson owns a wrecker service. The Chop Shop is a custom motorcycle garage owned by the out-of-control Billy ThE Kiddo, who used to have his own TV show. Earl Heiple, a retired world history professor, is one of Billy's neighbors and hates the ground he walks on. Evelyn is the wife who died 17 years ago. Piseano's Pacchia makes great pizza. Tiffany is a waitress there.\nCheyenne, Wyoming\nCady is Walt's daughter and working for the state attorney general's office in Cheyenne. Lola is her eight-month-old baby daughter. Her husband, Mike, was murdered (he was also Vic's baby brother; \nDry Bones\n). Lena \"Nonnie\" Moretti is Vic and Michael's mother; she's in Cheyenne helping Cady with Lola. Alexia Mendez will be doing Lola's daycare. Joe Meyer is the Wyoming attorney general and a friend of Walt's; Mary is his wife.Libby Troon owns Liberty Bail Bonds.DCI's Accident InvestigationMike Novo is their motorcycle expert. T.J. Sherwin is the head of the lab unit. And she's got some rep!Operation Bad God is……an ATF undercover operation. One of their operatives has been undercover for the past 13 years. John Stainbrook, a.k.a., Ray Swift, is in charge. Apelu is a confidential informant for the ATF. An RAC is a Resident Agent-in-Charge; an ASAC is an Assistant Special Agent-in-Charge.The Agent-in-Charge in Denver is Mike McGroder.Cattle Kate's was a titty-bar back in the day. Brandon White Buffalo had been a bouncer there. Kate and Gowder are the Philadelphia detectives in charge of Mike's murder case. Bidarte is their suspect. Bill Tichenor had been a polymer technician in Silicon Valley.The Cover and TitleThe cover has its woodcut design with the front end of a motorcycle aimed right at Walt in this bucolic graphic with its bright blue sky and green, green grasses bordering the light brown dirt road as it leans past Devils Tower on the distant left. Well, I'm guessing it's Walt in that light blue denim shirt with the sleeves rolled up and blue jeans, wearing a brown Stetson, and carrying a rifle as he checks out the road where B-way was shoved. A black band at the top showcases the white font for the series information. The author's name is beneath that in black with the title beneath that in white. A round badge at the bottom notes that Longmire is streaming on Netflix.The title is a nod to the Cheyenne Mountain's interest in Sherlock Holmes, for Henry is most interested in An Obvious Fact."}, {"userName": "Scott", "userReviewDate": "Feb 06, 2018", "userURL": "http://www.goodreads.com/user/show/24668886-scott", "userReview": "**As I continue my Longmire series read, full disclosure requires that I openly admit I am a devoted fan of the Longmire television show (on A/E and now Netflix) and have enjoyed reading the previous books in the Longmire book series that inspired that show even more. With that said, I am still doing my best to provide objective and an honest review. ** “An Obvious Fact” is the twelfth book in the “Longmire” mystery series, continuing the fictional adventures of Walt Longmire, Sheriff of Absaroka County, Wyoming; his daughter, Cady, the world’s greatest lawyer; his best friend, Henry Standing Bear; his loyal and outspoken deputy, Vic Moretti; his loyal and less outspoken deputy, and Dog, his faithful animal companion. When the story begins, Walt and Henry have been to Hulett, Wyoming to investigate a young biker who was run off the road and lies in critical condition in the local hospital. The connection to our heroes is that the young man is the son of Lola – yes, the famous Lola for which Henry’s classic ’59 Thunderbird is named after as well as Walt’s granddaughter. The challenge is that Hulett is the town nearest to both the first national monument – Devils Tower – as well as Sturgis, where the largest motorcycle rally in the world is taking place. After meeting Lola, talking with local law enforcement leaders, and trading threats with Brady Post, strong-arm enforcer for the Nomads motorcycle gang, Walt’s investigation gets complicated fast. Then throw in Bob Nance, businessman millionaire, Billy ThE Kiddo (yes that’s the right pronunciation), a local reality television star, and a cold-blooded death of one of the primary suspects, and the mystery gets even more surreal. Lola seems to be far more rebellious and less helpful than would be expected, and a visit from Vic shakes everything up, including a wild ride with a local police car and entry into a local skeet shooting tournament.There are many good moments in this book. Walt’s interactions with Brady and Bob Nance, Henry’s determined Jackpine Gypsies uphill motorcycle race, Vic’s competitive shooting skills and trash talking with Bob Nance, and I haven’t even mentioned meeting the famous Lola. Johnson did such a good job of making her more colorful, complex, and mischevious than we would have expected.I also loved the author’s use of Arthur Conan Doyle’s “Adventures of Sherlock Holmes” as an excellent reference point, not only for the book title, but also as a major clue in the outcome of the mystery. Henry brings Walt’s copy of this classic with them to read and the two make constant reference jokes, including Henry’s repetitive “There is nothing more deceptive than an obvious fact.” For me, this has become one of my all-time top-ten favorite “Longmire” lines. As a matter of fact, the Cheyenne Nation has many golden comments in this book, and Vic has a few of her own. Overall, “An Obvious Fact” is like a lot of the other “Longmire” books. It is a story that focuses on family, love for our children, friendships, reflections on lost love and what could have been, and of course, diligently seeking justice the “Longmire” way. One additional closing comment. One thing I am realizing about the “Longmire” books is that I have enjoyed them so much that I will go back and reread them again. They are so well written that I will want to enjoy them over again. I’ve seen many comments on both Goodreads and the Longmire Book Club page on Facebook from others about how other people have read the books multiple times. I now understand the attraction. It is real and I am loving the books. The only sad thing is that I have only one book left – “The Western Star” – and I will have read them all. Then I will have to wait the next six long months for “The Depth of Winter” to be published. That seems like a long time away without a “Longmire” fix…"}, {"userName": "Albert", "userReviewDate": "Jul 24, 2017", "userURL": "http://www.goodreads.com/user/show/5916992-albert", "userReview": "An Obvious Fact is book #12 in the popular Walt Longmire series. Fans of the Netflix series will find the books that inspired the show to be quit different. No character more so, than Henry Standing Bear. In An Obvious Fact Henry steps forward as his past and present are strongly intertwined in a mystery of murder, guns and drugs and lost lovers. A mystery Sheriff Walt Longmire must solve even though it will open of the past of his oldest and best friend.Sheriff Longmire is called to consult on a death in Hulett, Wyoming during the week of the biggest motorcycle rally in the world. In the shadow of the Devils Tower, Hulett is usually a very quiet little town. But during the week of the bike rally, it becomes a host to sex and violence and roaring engines. Longmire's longtime friend Henry Standing Bear joins Walt on the trip. Standing Bear is determined to win back a trophy he once had from the group of riders. Walt is asked to look into the accident of a young rider, who seemingly lost control of his vehicle on the remote roads. Longmire quickly has suspicions about the crash. He doubts that it was an accident and the entire mystery gets very complicated when the rider is found to be part of a biker gang. One that is being monitored by the Bureau of Tobacco and Firearms. Not only that but the biker is the son of the woman Henry Standing Bear once had a love affair with. The woman he had named his '59 Thunderbird after and who is the namesake of Walt's granddaughter. The mysterious and seductive Lola.In a time and place where no one is going to talk to anyone wearing a badge, Sheriff Longmire must wade through the distrust and shadows to come to the truth. As Sherlock Holmes is apt to say, \"There is nothing more deceptive than an obvious fact.\"Fans of the Netflix series or not, Craig Johnson's Walt Longmire series should be required reading in American modern western literature. The insights into the plight of the tribes of the native american Indian in our modern era and the encroachment on the native lands by not only developers but the rich who want to play cowboy or rancher, would be eye opening that those who live on the east coast and the spoiled west.Johnson has a firm handle on his main character and over the course of twelve novels we have seen Walt grow into the Sheriff we all have come to know and admire. When I read a Longmire novel I am reminded of the terminology of the Cowboy Poet. There is a great beauty to the land and the life he has chosen to lead. He is that hero who needs to set the world right. To battle against the injustice in our world and defend those who cannot defend themselves. But above all is his love of the law. The truth is his basic nature and from these tenants he shall not and cannot stray.The supporting characters very often are as strong as Longmire is. Henry Standing Bear and Undersheriff Vic Moretti. Together they create the team that drives the Longmire series. An Obvious Fact is a fine addition to this series as the initial mystery is one that at times gets lost in the greater picture of what is going on. But we return to the initial mystery and the obvious fact of what really happened on the dark road the night the young man crashed. An Obvious Fact we simply don't want to accept."}, {"userName": "Laura (Kyahgirl)", "userReviewDate": "Nov 06, 2017", "userURL": "http://www.goodreads.com/user/show/2906277-laura-kyahgirl", "userReview": "3/5; 3 stars; B-I saw a friend's review of this one and realized I had forgotten to review it when I listened earlier this year. A few things stand out in my memory of this book. First, George Guidall is the perfect narrator for these stories. Second, what kind of nut hooks up with a person like Lola? I can't believe Henry named that awesome car after such a horrible person. Lastly, this one wasn't a good as some of the others in the series but the main characters will always keep me coming back."}, {"userName": "Kevintipple", "userReviewDate": "Nov 24, 2016", "userURL": "http://www.goodreads.com/user/show/5470907-kevintipple", "userReview": "An Obvious Fact finds Sheriff Walt Longmire on the road outside of Hulett, Wyoming at a crash site. Located in northeastern Wyoming, the small town is best known the Devils Tower, the first national monument. Most likely the second most famous thing it is known for is the Sturgis Motorcycle rally in nearby Sturgis, South Dakota just across the Wyoming border.After examining the macadam road under the August sun and seeing no sign of any skid marks on the turn, Sheriff Longmire and Henry Standing Bear make the nine mile drive into Hulett. While Henry plans to try his hand once again at a couple of events during the rally, Sheriff Longmire is in town to help with an investigation. Campbell County Deputy Corbin Doughtry regarding a recent motorcycle accident. Tores, known to one and all as “B-way” is in a medically induced coma over in a hospital in Rapid City and critical.Doughtry is pretty sure that B-way was deliberately hit by somebody that fled the scene. Not only is that a problem, members of his motorcycle club, the “Tre Tre Nomads” are actively harassing Doughtry who is trying to not only work the case, but deal with all the problems during Rally week. Their enforcer, a man known as Brady Post, is the biggest problem. Doughtry needs help, as do the other members of law enforcement who are doing everything they can to keep the peace in an area overrun by tourists, motorcycle clubs, and more.Then there is the explosive problem of the real life “Lola” who rocked Henry’s world all those many years ago. Not only is she heavily vested in the situation that brought Sheriff Longmire to town, she still has the power to mess with Henry. Not that he needs her help as he is acutely aware that the day when he can no longer compete at Sturgis is coming very soon.As in the recent novella, The Highway Man, Sheriff Walt Longmire is far from home and helping an officer he respects in An Obvious Fact. Though there is some interplay between himself and Vic as well as Cody, most of the interaction is with Henry Standing Bear who carries a significant part of the book. He also provides some laugh out loud moments regarding Sherlock Holmes and his cases. Billed as the 12th in the series (apparently ignoring novellas, short story collections, and other stand alone stories) An Obvious Fact: A Longmire Mystery is another good one from author Craig Johnson. While the mystical is always present in these tales it takes a backseat to the present day mystery that is tinged with flashes of humor. While this series should be read in order, this one could be read first as previous events are only briefly discussed. Most of the backstory in this book refers to the woman who inspired Henry many years ago. An Obvious Fact, like everything else by Craig Johnson, is solidly good and very much worth your time.An Obvious Fact: A Longmire MysteryCraig Johnsonhttp://www.craigjohnson.com Viking (Penguin Random House LLC)http://www.penguin.com September 2016ISBN# 978-0-525-42694-3Hardback (also available in audio and eBook formats)336 Pages$28.00Material supplied by the good folks of the Plano Public Library System.Kevin R. Tipple ©2016"}, {"userName": "Mark", "userReviewDate": "Jan 02, 2017", "userURL": "http://www.goodreads.com/user/show/6755739-mark", "userReview": "Another year and 2016's Longmire book which was long awaited and its content did not live up to expectation, perhaps because my expectation was somewhat different.Let me explain after the murder of Cady's husband, Lola's father, Vic's baby brother, Walt's son-in-law anyone would expect a rather revenge driven book. And yet we get no such thing we get Walt Longmire giving a helping hand to a colleague while Bear pride of the Cheyenne tries to relive his glorious youth with a spot of uphill motor racing. The helping hand is due to a comatose biker whose mom is none other than the notorious Lola after whom a certain car is named. As it happens the young man might be the fruit of some Cheyenne loin and so Walt and Henry get roped into the not so much an accident but more an attack on the young man his life.As Walt gets to know more of the original Lola, the circumstances of his accident that combined with a massive come together of a lot of Bikers in a small town he has to find out why this attack happened, who killed an ATF agent, How can you smuggle arms on a motorbike and who is doing what and to whom.A nice whodunit in which Vic shows her marksmanship in shooting, Bear his skills on a motorbike and Walt his skills with driving something worthy of the army, and Dog enjoys himself and Bikers learn to respect him.There is seemingly no further steps towards the murder of the most important man in Little Lola's life. Or would it be that Longmire does seem to collect a lot of inter-agency goodwill which could come in handy when they start hunting for the one responsible.Still a fairly decent Longmire even if you are missing the little community where Longmire does his sheriff bit. Well worthy of your time and especially a great starter of a new year."}, {"userName": "Linda Baker", "userReviewDate": "Aug 07, 2016", "userURL": "http://www.goodreads.com/user/show/2530071-linda-baker", "userReview": "It is always a red-letter day when the newest Longmire novel lands at my house. I have said it before but I never thought that a series featuring a Wyoming sheriff might become a must-read. An Obvious Fact does not disappoint. Walt and Henry Standing Bear are supposedly on vacation in the small town of Hulett, Wyoming, just across the state line from Sturgis,South Dakota, home of the famous Sturgis Motorcycle Rally. Henry is going to participate in the hill climb, but Walt is looking into an accident in which a young cyclist was severely injured. Walt never really takes a vacation after all. Both Walt and Henry are unaware that the injured young man is the son of the legendary Lola, after whom Henry's classic Thunderbird, and Walt's granddaughter, is named.Henry, however, seems strangely reluctant to get involved with Lola in any way.An Obvious Fact turns into a wild ride involving undercover ATF agents, biker gangs, neo-Nazi wannabes, gunrunners and a megalomaniacal millionaire. I am always happy when Henry Standing Bear is present for most of the action.The byplay between the two old friends adds to the humor that is always present to a greater or lesser degree. Walt's undersheriff and love interest, Vic Moretti, also adds to the fun when she competes in a skeet shooting match, something she has never done before. I have no idea where the relationship between Vic and Walt is going but it is fun to watch.Thanks to First to Read for an advance digital copy in return for an honest review. I highly recommend An Obvious Fact.RATING- 4.5 Stars"}, {"userName": "Melliott", "userReviewDate": "Nov 26, 2016", "userURL": "http://www.goodreads.com/user/show/2533084-melliott", "userReview": "This was a solid entry into the Longmire canon. Even when the guy's on vacation, he can't seem to manage to stay out of trouble. I enjoyed Henry's last stab at reliving his youth (I'm referring to the motorcycle competition, not to Lola), and the \"on location\" nature of the setting was refreshing, although I missed the Native American context of most of the other books. Great descriptive detail, characters, and dialogue, as usual."}, {"userName": "Chris Conley", "userReviewDate": "Dec 12, 2016", "userURL": "http://www.goodreads.com/user/show/7209420-chris-conley", "userReview": "There seems to be no end to the great stories about Walt, Henry, Vic and the rest of the Absaroka County gang. Even though this one wandered away from home, the story is still excellent. These books are such wonderful blends of mystery, character development and dry wit that I always end up reading them way too fast. So, now I am left waiting for the next book. Poor, pitiful me."}, {"userName": "Nicholle", "userReviewDate": "Jan 08, 2017", "userURL": "http://www.goodreads.com/user/show/439795-nicholle", "userReview": "Always nice to have a visit from Walt, Henry, and Vic. I'd be perfectly happy if they didn't even try to solve a crime...***2017 Popsugar Challenge - AudiobookRead Like Nicholle Challenge - Book by an author who will be or has already spoken at THE Library."}, {"userName": "Tom", "userReviewDate": "Sep 18, 2016", "userURL": "http://www.goodreads.com/user/show/931469-tom", "userReview": "Walt &a Company take a trip out of Absaroka County to mingle with bikes and solve a few mysteries."}, {"userName": "Linda", "userReviewDate": "Sep 17, 2016", "userURL": "http://www.goodreads.com/user/show/15024981-linda", "userReview": "Typical Longmire - twisty plot, wry humor, literature and trivia in spades. An excellent addition to the oeuvre."}], "description": "In the latest installment of the New York Times bestselling Longmire series—the basis for the hit drama Longmire, now on Netflix—Walt, Henry, and Vic discover much more than they bargained for when they are called in to investigate a hit-and-run accident near Devils Tower \nIn the midst of the largest motorcycle rally in the world, a young biker is run off the road and ends up in critical condition. When Sheriff Walt Longmire and his good friend Henry Standing Bear are called to Hulett, Wyoming—the nearest town to America's first national monument, Devils Tower—to investigate, things start getting complicated. As competing biker gangs; the Bureau of Alcohol, Tobacco, and Firearms; a military-grade vehicle donated to the tiny local police force by a wealthy entrepreneur; and Lola, the real-life femme fatale and namesake for Henry's '59 Thunderbird (and, by extension, Walt's granddaughter) come into play, it rapidly becomes clear that there is more to get to the bottom of at this year's Sturgis Motorcycle Rally than a bike accident. After all, in the words of Arthur Conan Doyle, whose Adventures of Sherlock Holmes the Bear won't stop quoting, \"There is nothing more deceptive than an obvious fact.\"", "title": "An Obvious Fact\n      \n          (Walt Longmire #12)", "url": "http://www.goodreads.com/book/show/27774703-an-obvious-fact", "average": 4.22, "cover": "https://images.gr-assets.com/books/1447101819l/27774703.jpg", "reviews": 552, "authors": [{"url": "https://www.goodreads.com/author/show/63607.Craig_Johnson", "name": "Craig Johnson"}], "type": ["Mystery", "Westerns", "Fiction", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/27774703-an-obvious-fact", "http://www.goodreads.com/book/show/27996418-an-obvious-fact", "http://www.goodreads.com/book/show/32071351-an-obvious-fact", "http://www.goodreads.com/book/show/109901.The_Cold_Dish", "http://www.goodreads.com/book/show/236862.Death_Without_Company", "http://www.goodreads.com/book/show/236857.Kindness_Goes_Unpunished", "http://www.goodreads.com/book/show/2812358-another-man-s-moccasins", "http://www.goodreads.com/book/show/5950876-the-dark-horse", "http://www.goodreads.com/book/show/37581710-the-company-of-demons", "http://www.goodreads.com/book/show/40024832-empire-of-sin", "http://www.goodreads.com/book/show/8343548-the-bricklayer", "http://www.goodreads.com/book/show/40193155-among-the-wicked", "http://www.goodreads.com/book/show/23818400-the-snow-garden", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/23157833-almost-dead", "http://www.goodreads.com/book/show/33555347-crime-scene", "http://www.goodreads.com/book/show/30249521-fatal-frost", "http://www.goodreads.com/book/show/40266676-remains-of-innocence", "http://www.goodreads.com/book/show/34330657-finding-claire-fletcher", "http://www.goodreads.com/book/show/28824403-outfoxed", "http://www.goodreads.com/book/show/23957469-huntress-moon", "http://www.goodreads.com/book/show/40204087-the-deepest-secret", "http://www.goodreads.com/book/show/35115882-what-the-dead-know", "http://www.goodreads.com/book/show/40267317-ragdoll", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/39791173-the-girl-before", "http://www.goodreads.com/book/show/40205081-last-witness", "http://www.goodreads.com/book/show/40205040-dead-weight", "http://www.goodreads.com/book/show/18903409-weekend-warriors", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/40193809-eye-for-an-eye", "http://www.goodreads.com/book/show/27239265-the-short-drop", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/17623604-you-only-live-twice", "http://www.goodreads.com/book/show/17377392-thunderball", "http://www.goodreads.com/book/show/17284593-casino-royale", "http://www.goodreads.com/book/show/17623578-for-your-eyes-only", "http://www.goodreads.com/book/show/40193858-the-cuckoo-s-calling", "http://www.goodreads.com/book/show/17304110-live-and-let-die", "http://www.goodreads.com/book/show/18780375-dr-no", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies", "http://www.goodreads.com/book/show/17379070-moonraker", "http://www.goodreads.com/book/show/18799804-diamonds-are-forever", "http://www.goodreads.com/book/show/40205231-the-spy-who-loved-me", "http://www.goodreads.com/book/show/17377384-from-russia-with-love", "http://www.goodreads.com/book/show/40243961-the-cape-refuge-collection"]}