{"ratings": 1811, "userreviews": [{"userName": "Kathleen", "userReviewDate": "Jan 09, 2014", "userURL": "http://www.goodreads.com/user/show/13954899-kathleen", "userReview": "This week has been either cowboys or blind heroes. This is my first encounter with Linda Lael Miller's writing, and frankly, I have no clue why she gets such high marks. Maybe it's just me. Maybe it's this particular book. The plot is full of gaps and inconsistencies, the relationship developed overnight, and the heroine is unlikeable for the first several chapters.Jack Garrett's audio narration is worth five fabulous stars, though. This heroine. Grrrr! A schoolmarm in small town Texas, 1915, Piper steps outside during a December blizzard, at night. She capably drags Sawyer McKettrick into her schoolhouse when she finds him \"half-covered in snow\" and unconscious from blood loss - bullet wound. Does she bother to take off his wet clothing? Nope. She leaves them on all night, but just tosses a blanket over him. No hot water bottle for him. No hot bricks or warming pan (she lives in the schoolhouse). Not even a pillow for his head! And she is just too plum tuckered out to drag him across the room to the fireplace, so he must stay there, lying by the door. Hey, at least she got him inside, right? She cleans and bandages his bullet wound, and determines that it definitely needs stitches, but decides there is no way she could ever push a needle through his skin. What an idiot! The next day, she reluctantly gets some quilts from her hope chest, because --- why, he's cold! But he might get blood on her wedding quilts. After all, she got his blood on her gray mittens so she had no choice but to burn them. Yup. Her only pair, in December, during a blizzard. I guess she's never heard of cold water and soap. Did the same thing to her ONLY cloak -- and it's gray, too. Now this poor impoverished idiotic feeb of a school teacher has no cloak and no mittens. Lord spare me! And all her fretting about whether he is an outlaw, when Clay clearly trusts him, his cousin.Gradually I warmed up to Piper, but just enough to keep listening to the wonderful voice of Jack Garrett. She goes through a character shift midway through the book and becomes \"fiesty\" enough to stand up for a suffering student. Then I have to deal with the stupidity of Clay and his wife, Dara. Ok. So, Dara gives birth to a baby, far from town on their ranch. During the week the baby is born there was a diphtheria scare in town. And another attempted murder. So, what do the proud new parents do? They bring the newborn infant -- barely a week old -- to town for the Christmas pageant!! This is 1915, folks! Cold building, with one potbelly stove. Horses, not heated cars. No doctor in the town, only a dentist. No hospital. Sure, bring the newborn! NO BRAINS!!And Sawyer didn't go after his killer? We'll just let that plot thread disappear. Why not?And Bess (the brothel owner) butted in where she had no business, taking huge risks when she is the only thing standing between destitution and her young daughter. But that's okay, cuz Piper sees in Bess's love for Jenny Sue the real spirit of Christmas. Love. A mother's love that will sacrifice everything. Except...oh yeah...she's bringing her daughter up inside a brothel. The same brothel that the author described as degraded. If Bess has enough money to own a brothel -- one of the few places in town with indoor plumbing -- she has enough money to leave town and give her daughter a fresh start elsewhere.Oh vey.But the smexy scenes were certainly explicit. And there are some heartwarming scenes with the school children, and with Clay and Dara's girls."}, {"userName": "Susan", "userReviewDate": "Oct 04, 2012", "userURL": "http://www.goodreads.com/user/show/1127488-susan", "userReview": "Very good book - of course, it's a McKettrick story. Sawyer has come to Blue River to take over as marshal from his cousin Clay. Before he can do that he's shot and left for dead. Piper finds him and takes him to her room at the schoolhouse. He's hurt too badly to be moved and must recover there. This does Piper's reputation no good, so they marry to make it all respectable. I really liked both Piper and Sawyer. Piper is from the East, and a bit nervous about being in the \"wild west\". She comes off as rather timid at first, worried about Sawyer being an outlaw, even though he says he's a McKettrick and Clay's cousin. Once she accepts the fact that he's there to stay, her natural practicality and sass comes out. I like the way she stands up to him when she needs to, but also takes care of him. She is surprised by his offer of marriage, but realizes that she wants to marry him. I love her natural kindness to one of the little girls at her school and the girl's mother, the local madam. I thought the part where she went to the brothel when the girl was sick was terrific and loved the way she stood up to everyone. She fell for Sawyer pretty quickly, but they seemed to complement each other very well. Sawyer seemed pretty laid back for a McKettrick. In spite of his injury he was very courteous to Piper, not at all arrogant. He found her worry about him being an outlaw amusing, and enjoyed her spunkiness when it came out. His decision to marry her to save her reputation surprisingly didn't scare him. In fact, he found the idea appealing. He also gave her fair warning that he intended to seduce her. I really enjoyed the way he backed her up over the little girl's care. The ending at the ranch in Arizona, with all the family there, was very good."}, {"userName": "Emily", "userReviewDate": "Aug 21, 2012", "userURL": "http://www.goodreads.com/user/show/4365117-emily", "userReview": "Not ready to settle, Sawyer McKettrick finds himself taking a job as Marshal in Blue River, Texas. When he is shot, he finds himself in the care of the town's school teacher, Piper St. James. For the first time in his life, Sawyer wonders if he has met his match. Although Piper is cordial, she also has a spark of temper which he happens to enjoy igniting. As Christmas draws close, so does their feelings for one another and Sawyer doesn't plan to let that feeling go.I am always a sucker for one of Linda Lael Milller's books, they are always fun and have spirited characters that you can't seem to forget. An Outlaw's Christmas is another fantastic read, Piper is head strong and although society still has certain perimeters for women, she finds that there are ways to get around them when others are in need. Wonderful Christmas story that captures the essence of the holiday.Review on CataRomancehttp://cataromance.com/2012/08/review..."}, {"userName": "Lexi", "userReviewDate": "Aug 25, 2012", "userURL": "http://www.goodreads.com/user/show/9107401-lexi", "userReview": "A great holiday read!An Outlaw’s Christmas is a sweet and endearing story about two people finding love in the most unusual of places.Sawyer McKettrick arrives in Blue River, Texas looking to get away from some things in his past. His cousin Clay lives nearby and Sawyer is going to take over his job as town marshal for the time being. As soon as he gets off the train, he is shot by an unknown assailant. Spooked, his horse takes off and Sawyer, injured and barely conscious hangs on until the horse come to a stop beside a tiny building in the middle of a raging snowstorm. Sawyer falls from the horse and passes out in the snow.Piper St. James relocated from Maryland to take the job as the schoolmarm in Blue River. Her home consisted of a small room built off the back of the one room schoolhouse. It wasn’t much, but it was all she had. Her cousin Dara Rose had recently been married and sang the praises of Blue River, causing Piper to make the long trek across country to be near her only family. However when she got to Blue River, it wasn’t all she thought it would be so she was saving all her meager earnings to buy a ticket back to Maryland. Everything changed one night in the middle of a snowstorm when she sees a horse standing outside her window. She rushes outside and finds a man, shot and unconscious in the snow at her feet.Using all her strength and resources, Piper manages to drag the man into the schoolhouse and tends to his injuries as best she can. He weaves in and out of consciousness over the next day, but to Pipers relief, he stays alive until help arrives. Clay, Dara Rose’s husband comes to check on her when the weather clears and is shocked to discover his cousin Sawyer passed out on the floor of the schoolhouse. He gets the doctor and they quickly tend to Sawyer’s injuries but determine if they try and move him, Sawyer will not survive the trip so much to Piper’s chagrin, they carry him to her bed and leave her, a single woman and schoolmarm to tend to this stranger’s injuries. Piper is terrified what the town gossips will say about her, but knows helping Sawyer is the right thing to do, so she concedes.As Sawyer slowly recovers, he and Piper slowly grow an awkward situation into a blossoming, sweet romance that ends with true love.An Outlaw’s Christmas is a charming story of hope, dedication and redemption that will have to smiling and bring tears to your eyes. Linda Lael Miller weaves a beautiful Christmas tale that hits all the right notes to warm your heart. This was my first novel by Linda Lael Miller and I was hooked! I started with book one of the McKettrick Series and have enjoyed them more than I can say!Thanks for Reading My Mindhttp://readingmymindreviews.blogspot...."}, {"userName": "Rhonda", "userReviewDate": "Sep 13, 2012", "userURL": "http://www.goodreads.com/user/show/955320-rhonda", "userReview": "An Outlaws Christmas by Linda Lael Miller 4 STARS I liked An Outlaws Christmas. Thier are some love scenes in the end of the book. I liked Piper. At first she is timid but then we find out for one of her kids she is tough enough. Its a snowy winter when Sawyer comes to Blue River, TX on the train in 1915. He is riding his horse for a bit of exercise after the train ride they had taken before going to the hotel. When Sawyer feels like someone is watching him and then he hears the shot. He is shot in the left shoulder and his horse takes off. Sawyer stays on till the horse stops right by the school. Sawyer has come to town to take over as sheriff for his cousin Clay. Clay is busy building up his ranch and with a new baby coming wants to stay home more. Sawyer never thought he would be shot before he even got settle in. Piper is from back east and she is teaching at the one room school and living in the back room. As she is going outside to the outhouse She finds Sawyer's horse and then Sawyer. She is able to get him up and into the school but he falls on the floor. Sawyer is more worried about his horse. Piper is unsure what to do. Thier is a blizard and she is afraid she would get lost trying to get help. She gets the horse into the shed and gives him a bucket of snow and wipes him as good as she can. Piper then tends to the wound as best she can even though she does not want to. She uses the special quilts she has to cover him. She is worried that he is an outlaw. Stays up all night watching him. The next morning Clay McKettricks comes in from his ranch to check on her. His wife Dara Rose is Piper's cousin and worried about her. Piper is glad to see him and told him that a man has been shot and is in the school. Clay is surprised to see his cousin and best friend lying on the floor. Clay gets him on Piper's bed and then goes for the doctor. Who is a dentist not a doctor he is always telling people. The Doctor says thier is no way to take him anywhere, it would kill him. The Doctor promises to get things that Piper will need. Clay will be back soon as he can but his wife is 9 months pregnant. Piper is worried that her being single will ruin her chance of marriage someday and she will lose her job. At least the children won't be coming to school until the weather cleared up a bit. I like how Linda tells stories. I have enjoyed her McKittrick family. I was given this ebook to read in exchange for honest reviews from Netgalley. 09/25/2012 PUB Harlequin Imprint HarlequinHQN"}, {"userName": "Shannon", "userReviewDate": "Aug 14, 2012", "userURL": "http://www.goodreads.com/user/show/1301989-shannon", "userReview": "(ARC generously provided by NetGalley)Back in the mid-1990s I discovered Linda Lael Miller by way of her vampire series (beginning with Forever and the Night). This was before the vampire romance genre became big and overdone (thanks a lot, Twilight) and I loved the passion and the darkness of her characters. Nobody does \"bad boy\" like a vampire. So when I read Miller now, I expect that same passion and intensity.Sadly, that was lacking in An Outlaw's Christmas. Okay, it's a Christmas story, so I probably should expect lightness and dreams come true. And that's here, and it's done sweetly. Piper is a school teacher in a small town when a wounded Sawyer McKettrick, who's in town to take over as marshal for his cousin, Clay, shows up on her doorstep, literally. She nurses him back to health with the help of Clay and the local dentist (because there's no doctor in town). She and Sawyer end up getting married because it's improper for a woman to be alone with a man, even under extenuating circumstances like this. Of course, they fall in love and live happily ever after, just like they should in a Christmas story.Here's the thing: Piper and Sawyer's romance was boring. There was no build-up, no excitement. They were in love within a few days of meeting, and Sawyer spent a good portion of those first few days unconscious. We're told Piper is bold early in the book, but aside from a moment when she stands up for someone who needs it, we don't see any boldness. In fact, she marries Sawyer - despite her misgivings - simply because the town busybody decrees that they must. She never once confronts her. As for Sawyer, he decides to not get revenge on the man who ordered that he be shot, but we don't know anything about his thought process, only that tells Piper he loves her now and that she's his family so he doesn't need revenge. But how did he arrive at that conclusion? That's never explored.I've read one or two of Miller's McKettrick series - I read the Christmas one last year, as a matter of fact - and I enjoyed them. This one, though, is entirely forgettable. Not bad, just forgettable. In fact, I finished it last night, and as I write this now I'm already having trouble recalling it enough to review it."}, {"userName": "Arlena", "userReviewDate": "Feb 27, 2013", "userURL": "http://www.goodreads.com/user/show/6139982-arlena", "userReview": "Author: ‌Linda Lael MillerPublished By: HarlequinAge Recommended: AdultReviewed By: Arlena DeanBook Blog For: GMTARating: 4Review:\"An Outlaw's Christmas\" by Linda Lael Miller was a sweet 'McKettrick' historical romance series read that only this author could give to its readers. This was a well written Christmas western style story giving the reader a wild west sort of flair. We find Sawyer McKettrick has come to Blue River, TX to take over a position from his cousin Clay as a Marshall, however, upon arriving he is shot and collapses in a school yard. After he comes to he discovers that a Piper St. James has recused him and now that could ruin her reputation. Why was this and what happens next ...you will only find from picking up \"An Outlaw's Christmas\" to see what will happen next for these two people.I found the characters are all very interesting that really keep you captivated in what will be going on next. With Piper, we find that she is one that will stand up no matter what the consequences may be and Sawyer is one that is stubborn, strong willed that holds a bit of mystery of his reputation. We will find from Clay, Dara Rose, Chester Duggins, Bess Turner, Ginny Sue, Doctor Howard, to Eloise only to name a few in the novel were all deeply developed crew giving the reader a smooth ride from the beginning till the end. Get ready for a fast paced, warm, funny, sweet and easy read that will keep you intrigued till the end. Would I recommend this McKettrick series \"An Outlaw's Christmas\"...my answer would be YES!"}, {"userName": "Mareli", "userReviewDate": "Aug 17, 2015", "userURL": "http://www.goodreads.com/user/show/2939471-mareli", "userReview": "I spent my holidays reading the whole McKettrick's series. A bit on the short side. But really Sawyer didn't tell me anything new.Sweet and short"}, {"userName": "Lisa", "userReviewDate": "Oct 07, 2012", "userURL": "http://www.goodreads.com/user/show/2797072-lisa", "userReview": "I'm a big fan of Linda Lael Miller's McKettrick series. The original books are probably still my favorites. This one is more in that time frame than her latest books in the series. Set in in 1915 the main two McKettricks in this book are Sawyer McKettrick and Clay McKettrick(A Lawman's Christmas) sons of Jeb and Kade McKettrick from the original books in this series. It was fun to go back and kind of visit those books. There are some surprise appearances at the end of the book that i was so happy to see. Poor Piper like all books set in what i call way back when she as a school teacher was compromised by doing a good deed and saving Sawyer's life. If she was a man i wouldn't have mattered but back then apparently if you stayed in the same house ( even if it's a school house) with a man who wasn't your husband you were a fallen woman. Never mind the man was half dead from a gun shot wound and had no idea what was going on for hours. Piper had been a orphan and raised with her cousin Dara who was married to Clay McKettrick and convinced Piper to move out to where they lived in Blue River Texas. She took on the job of school teacher but had decided to save her every penny and move back where she came from. All that ends when she finds Sawyer in the snow and drags him in the school house in a blinding snowstorm. Her reputation is ruined the minute she does this but she could not possibly leave him there to die. Sawyer was a body guard of shorts and got tangled up with his boss's wife. He left before things got complicated but the his boss wants him dead. That's why he finds himself shot 5 minutes after getting into town.Which perpetuates the idea he might be a outlaw to Piper when she find him and he's also carrying a gun. I enjoyed this book. You have some danger from the shooter but you have your romance between Sawyer and Piper as they get to know each other. Piper struggles to find herself and her purpose and her place as a married woman. Loved the characters and like i said the surprise at the end. Well worth reading if you love a good western romance but more so if your a fan of the original books in the McKettricks series. 4 out of 5 Modokker Book Picks for An Outlaw's Christmas by Linda Lael Miller."}, {"userName": "Jillian Pearl", "userReviewDate": "Mar 13, 2016", "userURL": "http://www.goodreads.com/user/show/47369696-jillian-pearl", "userReview": "I hadn't read any of Linda Lael Miller's work before this. Based on the cover and the blurb (An Outlaw's Christmas) I was surprised to find the story was set in 1915. I didn't mind because I like historical romances, but it would have been nice to have a hint of that in the cover and blurb.That said, the story captured my attention and pushed me to keep reading in order to discover the answers to the questions brought up in the first few pages. In the first half of chapter one, there was a twist that caught me off guard and made me want to know more than ever, what was going on in this tiny town.The school teacher, Miss St. James, lives in a small room behind the classroom in the schoolhouse. One evening during a snow storm she discovers an injured man outside. Forced to decide between helping him, knowing it means destroying her reputation, or leaving him to die, she makes a choice that will forever change her life.The cast of characters that make up the rest of the townsfolk are believable and add depth to the story. Most of them I liked, and one, well two, I hated. I also got a kick out of the old-fashioned phrases that Miss St. James uses. I'd recommend this book to anyone who likes a little history, a bit of humor, and some mystery with their romance."}, {"userName": "Guilty Pleasures Book Reviews", "userReviewDate": "Sep 24, 2012", "userURL": "http://www.goodreads.com/user/show/4391611-guilty-pleasures-book-reviews", "userReview": "Rhayne's review posted on Guilty Pleasures4 Stars>/b>If you are a fan of the McKettrick series by Ms. Miller you won’t want to miss out on her latest. An Outlaw Christmas throws us right back into the mix of this fabulous family we have all come to love.This story focuses on Sawyer McKettrick and Piper St. James. It takes place in 1915 and gives us a heartwarming tale surrounded by a magical time of year.Sawyer is heading to Blue River to take over the Marshal job from his cousin, Clay. Upon his arrival he is shot and left for dead. Piper finds him nearby the school house that she teaches at, in the midst of a horrible storm. She knows that it’s not proper for her to be alone with this wounded stranger, but she can’t turn her back on him either.After much ridicule from the town folk about her improper behavior, Sawyer presents her with a solution; marry him so the rumors and gossip will stop, and her reputation will be salvaged. She has only known this stranger for a few days, his plan is insane, but somewhere deep inside she knows being married to Sawyer is what she wants and longs for.The characters are sweet and very easy to fall for. Sawyer is sexy, confident, and witty. Piper is headstrong and feisty, yet gentle and caring. When they are together they just complete each other.If you are looking for a book with a lot of drama and conflict/resolve plots, you won’t find it within these pages. This is just a quick read about two strangers who meet under dire circumstances and learn to lean on each other and eventually love each other. There is not a lot of build up with their relationship and their feelings for each other surface rather quickly. Go into this book expecting a light, fun, and sexy Christmas story and you won’t be disappointed."}, {"userName": "Julie Barrett", "userReviewDate": "Sep 01, 2012", "userURL": "http://www.goodreads.com/user/show/3023796-julie-barrett", "userReview": "An Outlaw's Christmas by Linda Lael MillerISBN: \t\t9780373777013Sawyer McKettrick, Blue River, TX Dec 1915\tjust off the train on the back of his horse, Cherokee and he got shot in the shoulder. The horse sped away in the deep powdery snow while he slouched over the horse and held on for dear life.Piper St. James is the school teacher getting ready to decorate the tree for the holidays.Her cousin, Dara Rose thad talked her into coming all the way from Maine to teach. She's wondering if she has made a mistake...She goes through the trouble of getting the unconscious man into the school, taking care of his horse, getting wood and water and then attending to his wounds.Dawyer's cousin Clay, who's married to Dora arrives and with a doc mends him up some and puts him to rest on her bed. Now who will ever marry her if they find out she lived with a man and no chaperone??The solution is for him to rest there for a few days then travel to something closer to town. Clay has to tend to his wife who may be giving birth soon....They spend a lot of time together talking about the past and what he hopes to accomplish as the new sheriff-taking over from Clay.She gets into the same bed with him for warmth and agrees to marry him in name only when the preacher can get there due to the fact that he's been alone in the same building as her...She fears the one who shot at him will return...Characters are easy to keep track of although the story line introduces many during the book.Births, deaths, shootings, holiday shows and so much more on top of very steamy hot sex make this a very worthwhile read."}, {"userName": "Alex", "userReviewDate": "Aug 27, 2012", "userURL": "http://www.goodreads.com/user/show/1147634-alex", "userReview": "The Deal: Not wanting to go home and settle down at the family ranch, Sawyer McKettrick took his cousin Clay's up on his offer to become the new sheriff of Blue River, Texas (which used to be Clay's job), but he wasn't expected to be shot at upon arrival or the freak snow storm that left him strandled at the town's school house and under the care of Piper St. James. Originally from Maine, Piper only came out west because her cousin - and only living relative - Dara Rose convinced her to, so she became the new Schoolmarm, only to slowly realize that she was actually better off back in Maine. The only thing better in Blue River is the closeness to Dara Rose and her daughters. Now, she's saving for a return trip home and trying to survive the harsh winter. But then, to top it all off, she finds a stranger half frozen in her doorstep, a stranger that puts in danger not only her reputation but also her heart. My Thoughts: For the last couple of years, ever since Christmas Brides, I always look forward to Linda Lael Miller's Christmas story of the year but this time I wasn't quite as charmed with An Outlaw's Christmas as I was with A Lawman's Christmas last year. I think that I just didn't feel like I got to know Sawyer or Piper all that well, so I had a hard time believing them together. However, the book did had some very nice character and it was good to check in with Dara Rose and Clay, and their friends. It was a sweet book but I kind of expected a bit more since I had enjoyed the previous Christmas stories so much. An Outlaw's Christmas comes out September 25th, 2012"}, {"userName": "Anna's Herding Cats", "userReviewDate": "Aug 02, 2012", "userURL": "http://www.goodreads.com/user/show/5417092-anna-s-herding-cats", "userReview": "Originally Posted for Herding Cats & Burning SoupOh I liked this. An Outlaw's Christmas was one of those books that I immediately felt comfortable with. It's just a sweet story and the writing flows so easily. This was my first time reading Linda Lael Miller and I may just have to stalk her now. And...um...by stalk I mean, wave nicely from WAY over here as I devour everything she's ever written. Piper and Sawyer were both wonderful characters. They're compassionate and honest with the perfect touch of fire in them. I really enjoyed watching love sneak up on the pair. And how they dealt the not-so-proper situation they found themselves in after Sawyer landed injured on her doorstep and compromised her reputation. I loved how they were with each other. A touch, a look, a murmured word just when the other needed it. There was such a comfortable, right feeling to the two of them as a couple. An Outlaw's Christmas is just a feel good kinda book. It's short, sweet and warms your heart. I loved the little glimpse into a family full of solid honorable men and bold feisty women. Always a great combination. I'll definitely be going back now and checking out the rest of the McKettrick clan. They sound like a damn fine group of men and women and I can't wait to hear all of their stories."}, {"userName": "Becky", "userReviewDate": "Dec 24, 2012", "userURL": "http://www.goodreads.com/user/show/7288979-becky", "userReview": "Sawyer is on his way to Blue River, Texas in a snow storm to take over as marshall from his cousin Clay. A shot rings out and Sawyer is shot in the shoulder. His horse takes him infront of the school, where he falls to the ground unconscious. The schoolmarm, Piper St. James is struggling to keep enough fire wood and water in her small room of the school to make it through the storm. When she tries to get through the storm to fetch more wood she see's a horse and goes out. She trips over something frozen underneath. To her surprise she finds it to be a strange man who is bleeding. She struggles to get him to the steps of the school and gets him to help her get him into her bed. This shirt-less, handsome, out-law looking stanger in a single schoolmarms bed? The story evolves through his recuperating; the reprocussions of a young, unmarried woman in a small town in the 1915's keeping a man with her unchaperoned. I enjoyed this quick reading holiday story and found Piper and Sawyer wonderful characters. I felt like I was part of this story and town. Piper is a strong, independent character. Sawyer, as rough as he comes off, is a kind, caring, compassionate man. The ending is pedictable, but the story is charming and warm hearted. A nice cold evening read this time of the year. I would definetely read more of her work."}, {"userName": "Judith", "userReviewDate": "Aug 29, 2012", "userURL": "http://www.goodreads.com/user/show/3214090-judith", "userReview": "Filled with the color and cultural norms of an Old West community, this story is an unusual encounter between a hardened old cowboy, coming back home to be a temporary marshall, and a prim and proper school marm who is hoping against hope that she will find a man willing to marry her and give her the family she so desperately longs for. Yet just by taking Sawyer McKettrick into her school house and giving him care after his life-threatening wound, she has put the complete cabash on any hoped-for future. Her reputation is sullied beyond redemption, especially by those women who would use anything and everything to put down those they consider beneath them. It's a wonderful holiday story with love and laughter, the interaction between an old cowboy and an uptight female, the wonder of Christmas seen through the eyes of a child being raised in a brothel, and the loving joy of parents who are proud of their children. It is also the story of a gentle and sneaky sort of love that grows between two unlikely partners, almost forced into a marriage in order to save a woman's reputation, and one that is built on respect and an awareness of the inner beauty that a truly good human being possesses. Another wonderful story from an author who has made her literary home in the West."}, {"userName": "Mcfree", "userReviewDate": "Dec 23, 2013", "userURL": "http://www.goodreads.com/user/show/4719625-mcfree", "userReview": "A 5 for story 1--An Outlaw's Christmas. This is pure Miller. She has created a great combo in Sawyer and Piper. I really liked Piper's intrepid nature. Sawyer wasn't as fully realized as Piper, but he filled the bill as the good guy. This is apparently at least the second in a set of stories about a branch of Miller's McKettrick family, but it stands on its own.A 0 for the second story--Escape from Cabriz. I quit in the middle. I certainly hope this has never been published as a separate novel. I didn't know Miller could write this badly. I am surprised she let it be published as is. I have no interest in panning the book in detail. If you think the first novel is worth the cover price, go for it. If not, look for An Outlaw's Christmas on its own.I don't understand why publishers poison a good writer's reputation this way. I will no longer feel comfortable in picking up a Miller book without researching it carefully. It makes me sad."}, {"userName": "Tima", "userReviewDate": "Jul 01, 2014", "userURL": "http://www.goodreads.com/user/show/5300365-tima", "userReview": "Sawyer is on his way through Blue River, Texas when he's shot. It's dark and snowy and he can't see who fired the shot. He had agreed to come be a temporary marshal. So his first day in town isn't very promising. Arriving at the local school house he loses consciousnesses from the blood loss. Piper, the single school teacher, isn't exactly thrilled to be saddled with this bleeding man. She knows her reputation will be ruined if she takes him into her home. But she can't exactly leave him in the snow, bleeding to death.The characters were fun and enjoyable. I haven't read anything by this author before and was pleasantly surprised. The additional characters also add depth to the story. I wouldn't mind reading another book about several of them. There are a few loose threads that aren't followed through at the end or in the epilogue, but it didn't really bother me. The story ended well, but left some openings for another book about the family."}, {"userName": "Crystal", "userReviewDate": "Oct 05, 2012", "userURL": "http://www.goodreads.com/user/show/8114559-crystal", "userReview": "I loved this book! Of course I have never meet a Linda Lael Miller book that I did not love. You can never go wrong with one of her books and a Christmas book is a must READ for me. Sawyer McKettrick arrives in Blue River, Texas for the marshal job. He runs into trouble as soon as he arrives and ends up at the school yard. The teacher who is settling in for the a major snow storm finds him there. Piper St. James takes in Sawyer to help him recover. She's a little worried about her reputation but the doctor and Sawyer's cousin convince her to let Sawyer stay until he recovers. Sparks start flying between these two and it's such a cute romance to watch them come together. I really enjoyed this book. Of course like I said I've never meet a Linda Lael Miller book that I didn't love and this one is no different."}, {"userName": "Brad Jae ", "userReviewDate": "Oct 02, 2012", "userURL": "http://www.goodreads.com/user/show/7671634-brad-jae", "userReview": "\"An Outlaw's Christmas\" Linda Lael Miller ... Really great book! I found myself reading this book until the crack of dawn!! literally!!!!. I loved the fact that the book wasn't cliche and to over the top. The book was really heartwarming and so funny! I had a couple of laughs along the way. (parents was looking at me really weird for laughing while reading this book!!). Can't wait for the next addition for this series as of January 2013."}, {"userName": "Harlequin Books", "userReviewDate": "Sep 28, 2012", "userURL": "http://www.goodreads.com/user/show/1255470-harlequin-books", "userReview": "\"Each year Miller gifts readers with a warm and touching McKettrick story, celebrating family, friends and the miracle of the season. Her latest holiday story shines with compassion and the belief in the inherent kindness of man, rekindled by the holidays. Miller touches hearts with gentleness and sensitivity.\" RT Book Reviews, rated 4 stars"}, {"userName": "Leigh Ann", "userReviewDate": "Jan 22, 2013", "userURL": "http://www.goodreads.com/user/show/16670102-leigh-ann", "userReview": "great follow up for lawman's christmas"}, {"userName": "Georgina", "userReviewDate": "Nov 30, 2012", "userURL": "http://www.goodreads.com/user/show/3056926-georgina", "userReview": "Lightweight and unbelievable in parts but the characters are interesting and I enjoyed the storytelling."}, {"userName": "Juliewheatcox.Net", "userReviewDate": "Feb 14, 2018", "userURL": "http://www.goodreads.com/user/show/40123628-juliewheatcox-net", "userReview": "A cleaver depiction of the social mores, concerns, and fears of the early 1900's. Also, the advent of modern plumbing & electricity, or the lack thereof; i.e. the poor little girl who was growing up in a brothel had all the modern conveniences, whereas the teacher had none.The romance was stilting since Piper thought Sawyer was going to leave her as soon as he was well enough to ride away. It got much better once Clay put her mind at ease.The story would have been much better if the ending hadn't been so rushed. Too much was jammed into a few pages. But other than that, I enjoyed the story."}, {"userName": "Dawn ♥ romance", "userReviewDate": "Dec 22, 2016", "userURL": "http://www.goodreads.com/user/show/4120638-dawn-romance", "userReview": "I enjoyed this historical holiday romance. A lot happened in the couple weeks before Christmas. I could buy into the rushed relationship considering the culture of the time. I liked the character of both hero and heroine. Teacher Piper takes in a wounded man she found in a snowstorm outside her school room and soon learns he is Sawyer, there to take over for his cousin the sheriff."}, {"userName": "Jackie", "userReviewDate": "May 18, 2018", "userURL": "http://www.goodreads.com/user/show/2195441-jackie", "userReview": "This was a combo read with 2 short stories combined in same digital book.A lovely western romance and an intriguing contemporary second chance/romantic suspense.Both couples in both tales are well matched and each story is enjoyable even though they are also predictable."}, {"userName": "Ruth", "userReviewDate": "Jan 03, 2017", "userURL": "http://www.goodreads.com/user/show/1643935-ruth", "userReview": "A fun historical romance. Piper finds a man laying in the snow outside her little school house and drags him inside before he freezes to death, but his recuperation in her back room has more than a bit of an impact on her reputation in this small Western town."}, {"userName": "Thressa", "userReviewDate": "Nov 03, 2017", "userURL": "http://www.goodreads.com/user/show/70969502-thressa", "userReview": "It was a good short read book."}, {"userName": "Sue", "userReviewDate": "Apr 22, 2013", "userURL": "http://www.goodreads.com/user/show/9795327-sue", "userReview": "The better book was The Lawman's Christmas, but not bad. It just didn't hook me like it should have."}, {"userName": "Kellie Mackrell", "userReviewDate": "Jul 22, 2017", "userURL": "http://www.goodreads.com/user/show/33828097-kellie-mackrell", "userReview": "I enjoyed this a little better than book 14 as I am guessing I already felt I knew the characters a little. This also had a little more punch to the storyline for me."}], "description": "With his wild heart, Sawyer McKettrick isn't ready to settle down on the Triple M family ranch in Arizona. So he heads to Blue River, Texas, to seek a job as marshal. But in a blinding snowstorm he's injured—and collapses into the arms of a prim and proper lady in calico.The shirtless, bandaged stranger recuperating in teacher Piper St. James's room behind the schoolhouse says he's a McKettrick, but he looks like an outlaw. As they wait out the storm, the handsome loner has Piper remembering long-ago dreams of marriage and motherhood. But for how long is Sawyer willing to call Blue River home?As the gray skies clear, Piper's one holiday wish just might bring two lonely hearts together forever.", "title": "An Outlaw's Christmas\n      \n          (McKettricks #15)", "url": "http://www.goodreads.com/book/show/13548157-an-outlaw-s-christmas", "average": 4.14, "cover": "https://images.gr-assets.com/books/1343714475l/13548157.jpg", "reviews": 144, "authors": [{"url": "https://www.goodreads.com/author/show/6223.Linda_Lael_Miller", "name": "Linda Lael Miller"}], "type": ["Romance", "Holiday", "Westerns", "Romance", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/13548157-an-outlaw-s-christmas", "http://www.goodreads.com/book/show/17738246-an-outlaw-s-christmas", "http://www.goodreads.com/book/show/18885705-an-outlaw-s-christmas", "http://www.goodreads.com/book/show/5022538-logan", "http://www.goodreads.com/book/show/5022581-dylan", "http://www.goodreads.com/book/show/5022691-tyler", "http://www.goodreads.com/book/show/59953.McKettrick_s_Luck", "http://www.goodreads.com/book/show/74024.High_Country_Bride", "http://www.goodreads.com/book/show/28168785-runaway", "http://www.goodreads.com/book/show/35148447-juliet", "http://www.goodreads.com/book/show/35913695-hidden-secrets", "http://www.goodreads.com/book/show/40198274-kiss-me-while-i-sleep", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/35839275-kian", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/26186801-someone-like-you", "http://www.goodreads.com/book/show/18800300-from-thin-air", "http://www.goodreads.com/book/show/18950617-sweet-caroline", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/18800331-to-hope", "http://www.goodreads.com/book/show/33016164-royally-bad", "http://www.goodreads.com/book/show/34609092-royally-ruined", "http://www.goodreads.com/book/show/40193474-the-finishing-touches", "http://www.goodreads.com/book/show/40193549-roses", "http://www.goodreads.com/book/show/19032297-accidentally-in-love-with-a-god", "http://www.goodreads.com/book/show/29231863-splinter", "http://www.goodreads.com/book/show/23622993-claimed", "http://www.goodreads.com/book/show/40243614-just-jilted", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/18800455-the-pms-club", "http://www.goodreads.com/book/show/18800812-gypsy", "http://www.goodreads.com/book/show/35708042-bodyguard", "http://www.goodreads.com/book/show/18800579-willow", "http://www.goodreads.com/book/show/30126159-mosaic", "http://www.goodreads.com/book/show/40389026-summer-island", "http://www.goodreads.com/book/show/12369122-because-of-you", "http://www.goodreads.com/book/show/29373539-the-lullaby-sky", "http://www.goodreads.com/book/show/28441063-secretly-hers", "http://www.goodreads.com/book/show/23271170-tycoon-takedown", "http://www.goodreads.com/book/show/18800411-come-high-water", "http://www.goodreads.com/book/show/33001355-before-i-knew", "http://www.goodreads.com/book/show/40205166-the-paradise-of-glass", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/21425515-once-haunted-twice-shy", "http://www.goodreads.com/book/show/40272947-the-pursuit-of-tamsen-littlejohn", "http://www.goodreads.com/book/show/40193595-the-story-of-beautiful-girl", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/30184217-say-goodbye-for-now", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/18800690-love-is", "http://www.goodreads.com/book/show/40494988-thirty-five-and-a-half-conspiracies", "http://www.goodreads.com/book/show/20489452-thirty-one-and-a-half-regrets", "http://www.goodreads.com/book/show/20687181-thirty-two-and-a-half-complications", "http://www.goodreads.com/book/show/40198652-twenty-eight-and-a-half-wishes", "http://www.goodreads.com/book/show/15836745-twenty-nine-and-a-half-reasons", "http://www.goodreads.com/book/show/36685093-the-unimaginable", "http://www.goodreads.com/book/show/29339972-thirty-six-and-a-half-motives", "http://www.goodreads.com/book/show/23263614-thirty-three-and-a-half-shenanigans", "http://www.goodreads.com/book/show/40199170-thirty-and-a-half-excuses", "http://www.goodreads.com/book/show/24778061-thirty-four-and-a-half-predicaments"]}