{"ratings": 3532, "userreviews": [{"userName": "Darth J ", "userReviewDate": "Apr 01, 2013", "userURL": "http://www.goodreads.com/user/show/18974711-darth-j", "userReview": "[I'm not going to get too real with you guys here, 'cause some things need to remain personal and I don't do \"feelz\" very well so no more *sad trombone noises* (hide spoiler)]"}, {"userName": "Jeffrey Cohan", "userReviewDate": "Dec 17, 2010", "userURL": "http://www.goodreads.com/user/show/4606121-jeffrey-cohan", "userReview": "The shame about David Servan-Schreiber's book \"Anticancer\" is that if you don't have cancer, you're unlikely to read it. It's a shame because the book's recommendations for lifestyle changes apply to everyone, whether you're battling cancer or not. Besides, everyone has cancer cells and everyone is bombarded with carcinogenes, so it behooves us to do all we can to protect our health in the face of these internal and external threats. Servan-Schreiber covers an enormous amount of ground in 220 pages, dispensing advice in the areas of diet, meditation, spirituality, exercise, and even cell phone use (thank you, Devra Davis). But only on the topic of diet and nutrition does he really go into depth, and here even people well-read on the topic might learn a thing or two. For instance, did you know that cooked tomatoes offer more lycopene, especially when they're cooked in olive oil? \"Anticancer,\" though, is mainly a repackaging and compiling of some of the most common-sense ideas out there. Unfortunately, most people never stop to consider these ideas, which explains why we have epidemics of cancer, diabetes and obesity in our country, not to mention of personal and family dysfunction."}, {"userName": "John Harris", "userReviewDate": "Feb 09, 2013", "userURL": "http://www.goodreads.com/user/show/17273047-john-harris", "userReview": "I can't begin to tell all that this book meant to me during my cancer fight. I stumbled across it a few days after my diagnosis. I wasn't looking for a cancer book. Yet, it changed my life.This book showed me that I can do things to stay healthy, despite doctors saying there's nothing I could do. I still had to do six rounds of chemotherapy and surgery but this book still gave me valuable information and I think helped me stay alive.The book follows Dr. Servan-Schreiber's story of his own \"accidental\" discovery of cancer and going in then out of remission. With that said, he backs up all his points with research. What are his major points?That we create/nurture the \"terrain\" of our bodies or immune systems by what we eat, how much we exercise and how we manage stress. I am over-simplifying but you'll have to read the book to get the details.It's been three years since my stage 4 diagnosis and I still follow everything that's in this book. One part that I think is weak: Dr. Servan-Schreiber was not a religious person so his focus on the spiritual aspect is really centered on yoga and more of a new age philosophy. As a Christian, I believe Christianity has a whole lot more to give.Don't think you have to be a cancer patient to buy this. If you want to live healthy and keep disease away, buy this book. I am pretty much a skeptic when it comes to self-help, cure-all philosophies but this is not one of those. Just buy the book."}, {"userName": "Lisa (Harmonybites)", "userReviewDate": "Jun 03, 2014", "userURL": "http://www.goodreads.com/user/show/2596042-lisa-harmonybites", "userReview": "Color me dubious. The further I read into this book, the more skeptical I became--which is a shame, because Dr Servan-Schreiber with his unique perch as physician, research scientist and cancer patient would, I thought, be the perfect person to sift the solid science from wishful thinking and outright quackery but...This book is rated as high as it is because nothing in his proposed program could do harm (the mindset being a different story) and I couldn't help being fascinated by parts and moved by others. Servan-Schreiber with his background as a research scientist was lucid and engaging in describing cancer's mechanisms and cancer research. I loved reading about \"mighty mouse\"--the mouse seemingly immune to cancer. I had to agree after reading those early chapters that \"cancer is a fascinating and perverse phenomenon.\" And I couldn't help but be moved and inspired by many of the stories--not just his own but that of naturalist Stephen Jay Gould who against the odds beat his own cancer, and Jacqueline, a cancer patient who found reserves of strength in practicing karate with fellow cancer patients.How could I not be moved? I was diagnosed with Stage Three Breast cancer in September of last year. In the preceding months I've undergone months of chemotherapy, a mastectomy, radiation treatments and will continue getting infusions of Herceptin until this October. And I've met far too many cancer patients who are on their second or third round with cancer. I don't want to go through all this again--thus the appeal of the promise of the title. I could certainly identify with and understand so much the people in these pages went through--and I get the fierce hope that you could take your destiny in your own hands--that you can beat back your body's betrayal. Feeling in control is so very important to you. I get that.But there's a flip side to that which isn't so positive. I've encountered people certainly who believe the patient should be blamed for their cancer. In a review of mine critical of one health guru I was told straight out that I should listen to this author--that it was my lifestyle that had made me sick. I believe Servan-Schreiber plays into this with his insistence on the \"mind/body connection\"--this idea, or at least implication--that if you succumb you had not just the wrong lifestyle but the wrong attitude. Ironically Servan-Schreiber's own careful tending of his \"terrain\" did not stop him from dying of cancer some years ago. Humans are mortal--that's not under our control and sometimes when it comes to cancer we lose--and it's not our fault.And there's another problem with this kind of view--that cancer is under our control and would be prevented if only the medical and pharmaceutical establishment would acknowledge the truth. To Servan-Schreiber's credit he emphasizes the importance of conventional therapy, and emphasizes his prescriptions are meant to be complimentary, not alternatives. In the book Herceptin, one of the drugs I'm taking, is described as \"a revolutionary drug qualified in 2005 as a 'major turning point in the eradication of suffering and death from cancer.'\" I'm expected to survive this--and for that I credit the achievements of those lambasted pillars of the medical and pharmaceutical establishment. But in these past months I've met more than one cancer patient who have refused not just (admittedly scary and debilitating) chemotherapy but the relatively low-risk/high benefit radiation and hormone treatments. Who have told me that people like my oncologist are shills for the pharmaceutical companies and \"don't you know what they give you in chemo is poison?\" I do know--that's the point--it poisons the cancer. Yes, it poisons the patient as well--but we have the better chance of bouncing back.So I worry books like these contribute to the paranoia, the distrust of life-saving medicines. All the more because in the end Servan-Schreiber struck me as ultimately far too credulous--there seemed to be no cause of cancer ever put out there from cell phones to deodorants to Teflon pans he wouldn't credit--ditto any purported alternate therapies down to that of shamans and Tibetan monks. Servan-Schreiber takes seriously T. Colin Campbell, a doctrinaire vegetarian and author of The China Study--a controversial figure but Servan-Schrieber skips the controversy. I just never got the sense in this book that evidence on the other side was considered beyond the quick dismissing of straw men. Some of what he cautions against might cause cancer, some of what he advises might be protective--my point is in the end I felt no confidence he could help me sort out which.However, as I wrote above, at least the prescriptions themselves would do little harm--except maybe to your wallet--organic food and cosmetics, water filters... Much of the advice is what any doctor would tell you--avoid processed foods, consume plenty of veggies, fruit, tea, fish rich in Omega-3, get plenty of sunshine and exercise. No, the seductive dangers of the book are more subtle than that."}, {"userName": "Kelsey", "userReviewDate": "Apr 09, 2011", "userURL": "http://www.goodreads.com/user/show/68736-kelsey", "userReview": "READ THIS BOOK EVEN IF YOU DON'T HAVE CANCER! It absolutely changed my life. I refer to it as my \"bible\" and there are marks, bookmarks, tags, underlines, notes etc. all that I've added myself. Thankfully, my good friend gave me the most current edition with new research on CELL PHONE use. I don't have children myself, but I do have an 18 month niece who I adore in every way, shape and form, and I have told my brother and his wife to keep the cell phone AWAY from her. Until she's at least 12 yrs. old. I repeat, READ THIS BOOK!!!"}, {"userName": "Stephany", "userReviewDate": "Nov 01, 2009", "userURL": "http://www.goodreads.com/user/show/1839090-stephany", "userReview": "Please: Save yourself four years scouring Medline and buy this book. Four years is approximately the amount of time it took for me to find about half of the scientific literature in this book. Later, if anyone says \"But there's no scientific evidence that you can fight cancer naturally!\" you'll be armed with a tome of evidence to the contrary.The author is a straddler, and I admit I'm partial to straddlers. His expertise and experience have made him someone who comfortably straddles the worlds of academic research, the medical community, pharmacological research, and natural agents that fight disease. He knows enough about each culture to tell readers why there are certain gaps in the knowledge of each.Anti Cancer is all around excellent scientific writing, some of the best I've read this year. The author has a tremendous talent for distilling complex ideas into clear, concise sentences and reinforcing them with diagrams and images that make scientific points clear to people with no prior information on how cells work, for example, or how our immune systems work. The author would be a great teacher (if he's not already).Most importantly (to me), Anti Cancer is not chock full of pat statements akin to \"This natural thing works. Really!\" Wholly unsubstantiated claims from naturopaths disappoint me no less than deceptive statements from big pharma. I need the why and the how of something in order to believe in it, and this book is full of why and how. In Anti Cancer, there is never a claim that something works without an immediately ensuing explanation of why and how it works: One of many excellent examples is \"How green tea, and specific kinds of green tea in particular, stop angiogenesis in tumors and the conditions under which it works best.\" In addition, I am pleased with the author's comfort with gray areas, which is what most of life's more complicated aspects have. Our culture (and U.S. culture is the only one I can speak to) seems uncomfortable with these, and whole segments of the populace seem to want the comfort of \"In all cases, THIS is the right thing to do.\" Instead of reinforcing this, the author explains that he has experienced and still advocates traditional cancer treatments, and he is also comfortable with stating the benefits of natural treatments of cancer without claiming that they can cure cancer completely. The author is comfortable stating the problems with processed food and meat while also acknowledging studies that show that the type of meat (grass fed vs. not, for instance) makes a difference. Claims like this may disappoint more hardcore vegan readers.Which brings me to my last accolade: The author is comfortable and honest about the limitations of knowledge, while also stating what is known and not shying away from that gap. He does not tend toward extremism or what I'm starting to call the militant religiosity of certain beliefs, which we see in regard to organic vs. GMO food; natural childbirth vs. hospital birth; immunization benefits vs. drawbacks; and all sorts of other aspects of daily life. This is a welcome relief from the usual level of discourse that posits things in either-or relationships vs. \"both\" and \"maybe\" and \"sometimes.\"Everyone can benefit from reading this book. At the very least, you'll learn how your immune system works and how to strengthen it to fight not just cancer, but many diseases."}, {"userName": "Cindy", "userReviewDate": "Aug 02, 2011", "userURL": "http://www.goodreads.com/user/show/5928081-cindy", "userReview": "An amazing book that is full of fascinating FACTS based on scientific studies on ways to boost your immunity and fight off cancer with foods, changes in your immediate environment, and by enhancing the health of your mind-body connection. There are many things you can do that will make a difference in your odds of getting cancer and surviving it. After the author's own bout with brain cancer, he went searching for non-pharmaceutical things he could do to make a difference for himself and his outcome. He brings together all this information in this book with recommendations for putting them into practice in everyday life. Green tea and turmeric? We won't go another day without these in my household. Shiitake and maitake mushrooms? They taste better than those plain, old, white ones, anyway. Dark chocolate that's at least 70% cocoa? Beautiful. Buy it, read it, put these recommendations into practice for you and your family.Buy a copy for your doctor, too."}, {"userName": "Batu", "userReviewDate": "Aug 17, 2012", "userURL": "http://www.goodreads.com/user/show/6110772-batu", "userReview": "One of the best books I have ever read fiction or non-fiction! It is not just about avoiding cancer or leading a healthy life but it is about living and dying. Although the book talks a lot of about scientific research that has been done to support his recommendations which are incredibly interesting, it is also a very compassionate book that is written from the heart. The author is an accomplished MD and Ph.D. who talks about his family, life and experiences living with brain cancer for 19 years. Please read this book and apply what you have learned to your everyday life. It will make a tremendous impact on the quality of your life."}, {"userName": "Martha Love", "userReviewDate": "Apr 22, 2013", "userURL": "http://www.goodreads.com/user/show/14767901-martha-love", "userReview": "AN IMPORTANT BOOK FOR PRACTITIONERS IN HEALTH AND PSYCHOLOGY! This book is so well written, and it has a great amount of research data included in an easy to read narrative style. I applaud Dr Servan for this very helpful book contribution in understanding the immune system and how it effects our health and well-being. I was particularly interested in his conclusion from medical studies that the ability to keep one's emotional state in balance and stress-free is also important to aid the immune system to fight off alien cancer cells and tumors. I felt his book so important that I cited it in my own book and discussion on using somatic practices on gut feelings to strengthen the immune system and combat dis-ease. While this book would be of great value for anyone to read, I definitely recommend this book for all practitioners in health and psychology.I recommend this book for all people who have cancer or have a family member struggling with cancer to read as a guide for finding your way through and eating healthily to stay well.Martha Love.author of What's Behind Your Belly Button? A Psychological Perspective of the Intelligence of Human Nature and Gut Instinct and Increasing Intuitional Intelligence: How the Awareness of Instinctual Gut Feelings Fosters Human Learning, Intuition, and Longevity"}, {"userName": "Hamood Alsudais", "userReviewDate": "Nov 03, 2011", "userURL": "http://www.goodreads.com/user/show/6728220-hamood-alsudais", "userReview": "This book is one of the best book I've read. I bought it from Vancouver airport (2010) and it was my travel mate for my long trip but the thing I wanna to mention here is a short story happened to me when one guy at the plane came to me and asked me \"why you reading that book?? \" He answered to him self \"because I had a prostate cancer and I followed a lot of things written at this book !! I play sport more than young did and my progress is very great !!! \" .This conversation changed my plan which was to use this book as a reference only !! to a new plan to finish this book and read it again !! And after I did that 2 weeks later I'm very thankful to that Scottish guy ... And I hope he is doing fine with his disease ....Getting back to the book ... The great thing it is a collection of a hard experiment for David with brain cancer and it covered the whole picture of his life health, social, .. etc. And beside that it was full of studies and researches about anti cancers which were unique because of the medical background of the author, This book is a great one for every one especially those who had cancer or one of their families. I highly recommend this book to those who work at hospitals or medical field."}, {"userName": "Erin", "userReviewDate": "Apr 15, 2009", "userURL": "http://www.goodreads.com/user/show/89929-erin", "userReview": "I love this book. I was already obsessed with learning about food, so I knew a lot of what was in here, but now that I'm fighting with my husband against his disease, I'm more than motivated to know what foods (and other issues) help and hurt the healing (and cancer-prevention) process. I've not eaten meat for almost two months, save for fish, and although I doubt I'll ever announce myself a vegetarian, I won't be surprised if I never eat meat again. This book is fantastic. Whether or not you have cancer in your family, it's worth reading. EVERYONE is a candidate for cancer, and our westernized environment and diet are ensuring that we are going to be affected by it.P.S. for you meat-lovers, the author does not promote giving up meat, simply cutting back and going totally organic, grass fed, etc. But, if you read \"What to Eat,\" you'll know there's not enough planet space to support eating a ton of well-raised meat anyway. I love that book too. Oh, and \"Skinny Bitch\" seconds a lot of these sentiments, although I'm still not ready to go full tofu and sans cheese."}, {"userName": "Jeremy", "userReviewDate": "Dec 12, 2009", "userURL": "http://www.goodreads.com/user/show/1070642-jeremy", "userReview": "I try to be sparing with my FIVE STAR ratings, but this is certainly the most important book I read in 2009 and maybe in the past five years.This book is for you if you've battled cancer, know someone who has, or it is a part of your family tree - in other words this book is for everyone.DSS has an amazing story (brain cancer survivor), incredible background (neuropyschiatrist, MD, PHD), and very strong pen. This book does three things that are so vital in today's society of ever-increasing cancer diagnoses...1.) Puts a face on the disease through clear medical descriptions and pictures.2.) Teaches the reader how to avoid and/or limit exposure to the causes and catalysts of cancer.3.) Makes it possible to see past the diagnosis (or future diagnosis) so many face.It's medical, it's inspirational and it's an incredibly important book that should jet to the top of many reading lists."}, {"userName": "Angelea", "userReviewDate": "Nov 10, 2014", "userURL": "http://www.goodreads.com/user/show/1436369-angelea", "userReview": "This book was recommended to me by the breast cancer case manager I work with who was treated for an aggressive breast cancer herself six or seven years ago. She said she got a lot out of this book and that many of her patients have, too. I liked that the author provides scientific evidence to support his recommendations, but with a healthy dose of pragmatism. I think he very fairly marries conventional medical treatment with how diet, nutrition, stress management, and exercise have the potential to work synergistically not only with treatment, but likely promoting prevention of cancer in the first place. I'd go so far as to conclude that the recommendations in the book have the potential to prevent or have a role in the treatment of many chronic diseases."}, {"userName": "Mynde Mayfield", "userReviewDate": "Dec 05, 2012", "userURL": "http://www.goodreads.com/user/show/10976393-mynde-mayfield", "userReview": "Wonderful, comprehensive with medical studies to back it up. Beginning with the biology of cancer itself, helping the layperson understand what's happening in our bodies when/how cancer is present and what we can do to prevent and/or compliment a western medical treatment protocol. I especially loved the section on the mind-body connection but wish he would have talked about Eastern medicine (herbs and acupuncture). The most valuable section of the book for me is on diet and this is one reason it will stay on my virtual shelf indefinitely. I'll be referring to it frequently as I continue to personally tweak my diet for cancer prevention. PS. I'd recommend this book whether or not you've been diagnosed, and if you have been diagnosed, it covers so much of what your western docs will not/cannot say to you about \"what else you can do.\""}, {"userName": "Linda Vituma", "userReviewDate": "Apr 07, 2015", "userURL": "http://www.goodreads.com/user/show/39992026-linda-vituma", "userReview": "Racionāli un iedvesmojoši par līdzsvaru starp tradicionālu un alternatīvu aprūpi un dzīvesveidu. Sāku šo grāmatu lasīt ar aizdomīgumu un bažām. Pabeidzu - iedvesmota. Daudz atziņu un sajūtu manī raisīja šī grāmata. Un ir vārdi, kurus mēģinu aptvert vēl šodien. Piemēram: \"..ka astoņpadsmit gadu es \"dzīvoju veselīgu dzīvi ar vēzi\"\"."}, {"userName": "Dana King", "userReviewDate": "Jan 25, 2015", "userURL": "http://www.goodreads.com/user/show/656580-dana-king", "userReview": "Anticancer had a lot of good information in it, but was also full of pretension and bizarre & irrelevant stories about the author's ex-wives. I can't recommend it as a good reading experience. So here's a summary tailored for people interested in breast cancer.The main message is that cancer is a chronic disease influenced heavily by the environment and lifestyle. Although mainstream western medicine is excellent at treating acute problems, it terrible at preventing and treating chronic problems. Dr. S-S thinks that nutrition, exercise, and \"peace of mind\" are also needed to treat (and prevent) cancer and goes over the limited research, and a gazillion anecdotes, showing how these things may influence cancer. He quotes a World Health Organization report that up to \"80% of cancers may be influenced by lifestyle and the environment.\" The most convincing research to support that was a study that showed Chinese women who moved to San Francisco had 3-5 times the rate of breast cancer than women in the same age groups who stayed in China.Dr. S-S believes that nutrition, exercise, and whatever (woo-woo, religious, or other) ways we can stay calm influence immune system function. We all have \"microtumors\" which could turn into cancer. These can be kept in check by the immune system but tumors that successfully take hold actually hijack the immune system in order to grow. The nutrition information is extensive. There are lists of vegetables that inhibit the growth of specific types of cancer, according to the one doctor in Montreal who decided to research this despite the fact that nobody can patent food as a treatment and make millions like pharmaceutical companies do. (Taxol was one profitable example which took something like 500 million dollars for the research to validate it as effective.) Garlic, leeks, scallions, are at the top of the list for all types of cancer and brussel sprouts, cauliflower, cabbage, kale, broccoli, radishes, and onions round out the top of the list for breast cancer. One section recommends against eating sugar or anything with a high glycemic index. Also, this book finally cleared up the mystery for me about whether eating meat is healthy or not. We get much better nutrition from the meat and eggs of animals that have eaten good diets themselves. If you feed animals nothing but cheap processed corn products, then their meat isn't good for us. There's some pro-Omega-3 info (vs. Omega-6) discussion which points to the benefits of eating fish and taking fish oil supplements. Green tea obstructs cancer formation and growth in 3 different ways and just 2 cups a day provides those benefits.There was a more about the benefits of support groups, exercise, and finding peace of mind. One interesting thing is that it doesn't take much exercise to provide a protective effect for breast cancer. \"Walking 2-5 hours per week at a normal speed has a powerful effect on preventing relapse.\"The book covers the important point that none of this means that anyone is responsible for having cancer. The environment/lifestyle issues are cultural and a lot of our food is produced in unhealthy ways. Some people (maybe 20% or more) will get cancer regardless of these factors."}, {"userName": "Jean", "userReviewDate": "Mar 11, 2011", "userURL": "http://www.goodreads.com/user/show/95947-jean", "userReview": "Learned a lot about how to eat better. Here is the list I made based on advice from the book.Green Tea – has to steep 10 min and be drunk within an hourAgave nectar – (reduce white sugar, honey, brown sugar, maple syrup)Olive oil – 1 tablespoon a day, don’t bring to smoke point (bad if used at high heat)Spices - Turmeric – has to be mixed with a generous pinch of black pepper and olive oil (add agave nectar to remove slightly bitter taste). Rosemary, Thyme, Oregano, Basil, Mint, Parsley, Ginger, etc.Veggies - Garlic, Onions, Leeks, Shallots, Chives, Cabbage, Brussels Sprouts, Bok Choy, Broccoli, Cauliflower, Carrots, Yams, Sweet Potatoes, Squash, Pumpkin, Tomatoes, Persimmons, Apricots, Beets,SpinachFruit - Plums, Peaches, Nectarines, Citrus Fruit, Pomegranate juiceSoy – Tofu, Tempeh, MisoMushrooms – Shiitake, Maitake, Enokidake, Cremini, Portobello, Oyster, Thistle Oyster, Turkey-TailSeaweed – Nori, Kombu, Wakame, Arame and Dulse (use in soups, salads, with beans and lentils)Berries – Strawberries, Raspberries, Blueberries, Cranberries (can be frozen)Vitamins – especially DOmega 3’s – fatty fish, ground flaxseeds (put on everything), flaxseed oil, grass fed organic animal products, walnuts, hazelnuts, pecans, almondsOthers – Yogurt, Lentils, Bulgur, Nicola potatoes, Beans, Red wine, Dark chocolate > 70%"}, {"userName": "Ann", "userReviewDate": "Mar 21, 2010", "userURL": "http://www.goodreads.com/user/show/208469-ann", "userReview": "I'm sure I never would have been motivated to read this unless I'd had breast cancer this year, but that's probably true for many people who pick up a book with this title. The book was actually given to me by the lady who cleans my house. She is Brazilian and had heard of it, and when she gave it to me, early on in my chemo treatment, I put it aside, promising to myself that I would read it some day. Now I'm at the stage where I'm facing the \"what next\" in this illness, and I finally picked up the book and read it cover to cover in two days. It was exactly what I needed at this point in my recovery--ideas for ways to build one's immune system and to feel just a tiny bit \"in control\", even if it's just an illusion. The ideas are things we've all heard about--nutrition, exercise, good energy, attitude etc., but he cites interesting case studies which appear to support the idea that all of these approaches can help the body fight off cancer when used in addition to conventional medicine. I recommend this to people who've had cancer and to people who never want to get it."}, {"userName": "Fran Pereira", "userReviewDate": "Mar 23, 2017", "userURL": "http://www.goodreads.com/user/show/18273916-fran-pereira", "userReview": "Muito interessante, relato de um médico que se vê acometido por um raríssimo tumor cerebral e, desenganado por seus colegas de profissão, que lhe dão uma expectativa de poucos meses de sobrevida, decide tomar frente de seu tratamento e promove uma mudança geral de hábitos em sua vida."}, {"userName": "0spinboson", "userReviewDate": "May 01, 2014", "userURL": "http://www.goodreads.com/user/show/2559314-0spinboson", "userReview": "The nutritional advice in this book is a step in the right direction, but frustrating because a. the 'science' behind it consists mostly of epidemiological intuitions even though there is much more interesting science to be found, b. the author pulls his punches when it comes to dietary recommendations (inveighing against non-organic animal products but seeing organic as healthy, which they aren't), and c. (connected to a.) he seems to have missed pretty much all research into plant-based (vegan) diets that is already out there. I find the last point particularly puzzling, because even though S-S arrives at the conclusion that only plant-based nutrition helps in the fight against cancer, and even though he writes (end of ch. 8) that 'In its “Dietary Goals for the United States,” [the McGovern committee] naively recommended “lowering the consumption of meat and dairy products” [because of its role in causing heart disease/stroke]', he never states (dares to state?) the conclusion that seems to logically follow, namely that a fully plant-based diet is the only way to go. And if we look at his dietary recommendations, we see that while he emphasizes eating legumes/fruits/vegs, he writes to discourage animal product consumption than that \"Meat and eggs are optional. They don’t represent the main ingredient of the plate. They are there primarily for added taste\", without emphasizing that these foods are specifically unhealthy. This even though it should have been clear even based on his own research that precisely such strategic vacillation has led to millions of unnecessary cancer, diabetes and heart disease deaths.Now, to provide interested readers with a few links, I would point out that since the book was released in 2009, a lot of additional evidence has been found that meat, dairy and egg consumption are strong or even primary contributors to 13 out of the 16 causes of death. For instance, it was recently discovered that cholesterol serves as food for tumors (leading to the lowered LDL values that were earlier seen as 'proof' that blood cholesterol does not contribute to cancer risk); further evidence was found that IGF1 (a growth hormone found in all dairy products, which is produced by cows to help their calves grow) promotes cancer growth, so that any dietary intake is undesirable; and that the eating of meat leads to a low-level inflammatory response associated with, among other things, diabetes and atherosclerosis, because the meat contains bacterial toxins that enter the meat-eater's bloodstream. In sum, especially for cancer patients, but really for people generally, the eating of animal products should be avoided across the board."}, {"userName": "Isaure", "userReviewDate": "Mar 10, 2017", "userURL": "http://www.goodreads.com/user/show/49446688-isaure", "userReview": "Pour l'instant ce livre me laisse ébahie et je me demande comment j'ai pu passer à côté pendant tant d'années... Il serait presque \"d'utilité publique\" de le faire lire au plus grand nombre !"}, {"userName": "Michael Lepage", "userReviewDate": "Aug 19, 2009", "userURL": "http://www.goodreads.com/user/show/2643705-michael-lepage", "userReview": "Read my complete review on my blog at http://www.lifeemerging.com/blog/book... .David Servan-Schreiber grew up in Paris. He became a doctor and scientist at the University of Pittsburgh. One day, his research subject failed to show up, so he volunteered to have a brain scan as part of the research study he was conducting with his colleagues. To his surprise,he himself, discovered that he had brain cancer. And so begins a unique story - Schreiber's own journey through cancer as a young, budding doctor and researcher who discovers that doctors don't have all the answers. I loved this book!Servan-Schreiber is a rare specimen indeed!His views on complimentary therapies to chemo and radiation are not what I would expect from most MDs. He recommends therapies that probably EVERY cancer patient has tried, but would never dara speak to their oncologist about. BUT that's not all.He provides ample research, data and case studies to back up his arguments!NOW that's beautiful!Facing a near-terminal diagnosis, he had no choice but to refuse to believe that there were no other options than chemo and radiation. He refuses to believe that the patient can do nothing and doctors can do it all.He takes on some big topics: * what foods can enhance chemotherapy * why proper nutrition is paramount but overlooked by oncologists * why sugar is cancer's best friend * toxic environments we frequent everyday * invoking deep healing with meditation * the anti-cancer mind * finding beauty in deathAnti-Cancer is a *must-read* for anyone who is going through cancer right now. But it's also a *must-read* for those of us who are survivors. Check it out!"}, {"userName": "Aija Ekmane", "userReviewDate": "Apr 11, 2015", "userURL": "http://www.goodreads.com/user/show/40003281-aija-ekmane", "userReview": "Grāmata pārsteigums? Nē.Grāmata deva ko jaunu? Jā.Pirmoreiz es patiešām iedziļinājos , kas tas \"vēzis\" vispār ir un kāpēc viņš tik slikti padodas ārstēšanai. Nu baigais nezvērs.Katram par sevi jāparūpējas pašam un jāpalīdz saviem bērniem. Veselīgs ēdiens, sports un harmonija sevī ir mūsu pašu atbildība. Ir lietas ko es ņemšu vērā turpmāk veidojot ēdienkarti, piedomāt vairāk vai mēs ģimenē pietiekošā apjomā nodarbojamies ar sportu.Nepīpēt un neļaut to darīt mūsu bērnu klātbūtnē! Ja fiziskas aktivitātes loma pretvēža dzīvesveidā un pretvēža ēdiena izvēles nozīme tikai pamazām tiek pierādīta, tad smēķēšana kā vēža izraisītājs ir sen pierādīts un pasīvās smēķēšanas kaitīgums nepīpētājiem arī. Es esmu tā, kura aizrāda pīpētājiem un pēc šīs grāmatas izlasīšanas, to darīšu vēl sparīgāk. Vai mani uztrauc, ja pīpētāji ar mani negribēs komunicēt, neaicinās uz ballītēm? Pilnīgi noteikti nē. Es domāju, ka šī ir grāmata, kura jāizlasa visiem vēža skartajiem un viņu draugiem un tuviniekiem. Mums ir jāmācās komunicēt un tas ir ļoti svarīgi visiem un abpusēji, komunicēt nevis lai vaidētu un kāds žēlotu, bet lai celtu mieru, labsajūtu un harmoniju attiecībās. Lai negaidītu no cilvēkiem to, par ko apkārtējiem nav ne jausmas, ka no viņiem tiek gaidīts. Un atceramies, ka atnesot drēbes no ķīmiskās tīrītavas, tās vairākas stundas āra gaisā ir jāvēdina!!!!"}, {"userName": "Happyreader", "userReviewDate": "Dec 23, 2012", "userURL": "http://www.goodreads.com/user/show/901783-happyreader", "userReview": "Beautifully written motivator to improve your lifestyle habits and your life overall. If nothing else, you’ll end up drinking more green tea. Better yet, you’ll also focus on relieving stress, exercising more, reducing environmental pollutants, reducing body fat, and eating more cruciferous veggies, mushrooms, garlic, whole plant foods, and omega 3s and less sugar, refined carbs, pesticides, and animal fats. While that sounds really dry and not so motivational, this book is incredibly moving. It’s vastly compassionate towards the physical, emotional, and spiritual pain suffered by cancer patients and those close to them. Yet I hope that you read this book before cancer ever strikes. Obviously, perfect health is guaranteed to no one; nevertheless, the practices and habits recommended by the author, who lived for almost 20 years past his initial brain cancer diagnosis, are beneficial on so many levels without harmful side effects. Kind of limiting that the book is called Anti-Cancer when it’s also Pro-Health and Healing. So lovely that the author was able to transform his personal experiences and research of cancer therapy into such a poignant, beneficial, and practical book."}, {"userName": "Edie", "userReviewDate": "Jun 10, 2011", "userURL": "http://www.goodreads.com/user/show/934380-edie", "userReview": "Another cancer book that I would recommend to anyone who wants to live a healthier lifestyle. The author is a physician who found out he himself had brain cancer by accident while working on clinical trials. This chronicles his journey and how his own diagnosis changed the way he conducted his research, and eventually his life. It advocates a holistic approach but the nutrition stuff is actually backed up by hard science. It's not a self-help book, but he does touch on the subject of how such a diagnosis can affect personal relationships and self worth. My favorite part is near the end when he discusses how he cames to terms with his own mortality. I have changed my diet as a result of reading this; he uses a scientific appproach but does so in layman's terms and I understood a lot of stuff after reading it that I had heard about before but didn't quite \"get,\" like the relationship between the glycemic load of a food and subsequent spike in insulin is related to cancer-cell growth."}, {"userName": "Christine", "userReviewDate": "Jul 16, 2013", "userURL": "http://www.goodreads.com/user/show/922106-christine", "userReview": "This is a great book. The cover says all of us have cancer cells in our bodies (something my husband who does genetic sequencing informatics had also told me), but not all of us will develop cancer. The Action Pages near the end of the book offer concrete, practical advice for the lifestyle that can prevent 60% of cancers. Yes, eat more fruits and vegetables, but no they don't all have to be raw to keep their inflammation-fighting, immunity-boosting properties (eating foods raw preserves enzymes which may have other benefits not discussed here). Other parts of the book are very moving like stories of people who beat cancer, or even if dying from cancer felt that Dr. Servan-Schreiber had saved his life because of encouraging him to do something meaningful for others before he died, etc. A chapter on how to talk with people who may not recover is also included. He is a psychiatrist, too, after all, not just a neurological researcher who survived two brain tumors. I think most people would really like to check this book out: http://amzn.to/131TM0o"}, {"userName": "Bam", "userReviewDate": "Feb 21, 2012", "userURL": "http://www.goodreads.com/user/show/5922426-bam", "userReview": "This book was selected by my book club and at first I was reluctant to read it. My mother had passed away from pancreatic cancer the previous month and I didn't even want to think about cancer, much less read about what she might have done to prevent it or lengthened her life. But I eventually began reading it and was inspired by it to make some changes in our lifestyle. This is not the first book I have read on this topic of changing diet, exercise and the existence of a mind-body connection but it may have been what I did need to read right now. My husband and I started changing the way we have been eating because of stress. For the first time in my life, I began to drink green tea 3 times a day. We had already started walking often and I resumed yoga. This does give a person hope that there is something active we can do to help our bodies avoid cancer or heal themselves and I am grateful for that. In the end, we will see how well we do because of trying to create a healthier 'terrain', I guess."}, {"userName": "Miguel", "userReviewDate": "Dec 07, 2013", "userURL": "http://www.goodreads.com/user/show/5945151-miguel", "userReview": "http://silenciosquefalam.blogspot.pt/...Em 1992, no decurso de uma experiência realizada no seu laboratório de investigação, um psiquiatra francês, então com 31 anos, descobriu que tinha um tumor maligno no cérebro. David Servan-Schreiber aceitou combater a doença aliando o tratamento médico tradicional (cirurgia, radioterapia e quimioterapia) com uma filosofia e postura proactiva, que abrangia as terapias alternativas, e o que posteriormente veio a confirmar-se o essencial: um estilo alimentar auto-regenerador, eliminando da sua dieta alimentos que faziam mal a si e à sua doença. Assim, David travou o alastramento de ... http://silenciosquefalam.blogspot.pt/..."}, {"userName": "Heidi (Yup. Still here.) ", "userReviewDate": "Jun 11, 2014", "userURL": "http://www.goodreads.com/user/show/2443993-heidi-yup-still-here", "userReview": "Even though I have read a lot of this information elsewhere it is always nice to find validation in alternative treatments from someone whose background originates the traditional side of medicine. I look forward to the day when traditional medicine embraces alternative ideas. With the two teams working together that would create the optimal healthcare experience IMO. This was easy to read and contained valid and useful information for everybody - not just cancer survivors (or as I like to be called \"ass kicker\" :)"}, {"userName": "Burcu  Babal", "userReviewDate": "Sep 15, 2013", "userURL": "http://www.goodreads.com/user/show/2646981-burcu-babal", "userReview": "Kesinlikle bundan sonraki hayatımın başucu kitabı!"}], "description": "At age thirty-one David Servan-Schreiber was a rising neuroscientist with his own laboratory for brain imaging funded by the National Institutes of Health. While testing brain-scanning equipment, he discovered a tumor the size of a walnut in his own brain. This is the moving story of how a researcher and scientist who believed only in conventional treatments was transformed into an integrative physician who realized the importance and power of the body's natural defenses against chronic disease. Dr. Servan-Schreiber's advice details how to find the right blend of traditional and alternative health care; how to develop a science-based anticancer diet (and the small changes that can make a big difference); the top ten household products to replace; understanding the effects of helplessness and \"unhealed wounds\" both physical and emotional, and how to regain balance; and how to reap the benefits of exercise, yoga, and meditation. Anticancer takes us on an inspiring personal journey and ultimately guides us to a new way of life. Unabridged on 7 CDs.", "title": "Anticancer: A New Way of Life", "url": "http://www.goodreads.com/book/show/3423527-anticancer", "average": 4.38, "cover": "https://images.gr-assets.com/books/1328743977l/3423527.jpg", "reviews": 537, "authors": [{"url": "https://www.goodreads.com/author/show/88711.David_Servan_Schreiber", "name": "David Servan-Schreiber"}, {"url": "https://www.goodreads.com/author/show/712655.Robert_Fass", "name": "Robert Fass"}], "type": ["Health", "Nonfiction", "Autobiography", "Medical"], "outlinks": ["http://www.goodreads.com/book/show/3423527-anticancer", "http://www.goodreads.com/book/show/1886829.Anticancer", "http://www.goodreads.com/book/show/6741399-anticancer", "http://www.goodreads.com/book/show/3423526-anticancer-a-new-way-of-life", "http://www.goodreads.com/book/show/6626326-anticancer-a-new-way-of-life", "http://www.goodreads.com/book/show/25313055-anticancer-pretv-a-dz-vesveids", "http://www.goodreads.com/book/show/5013702-anticancer", "http://www.goodreads.com/book/show/9416028-anticancer-a-new-way-of-life", "http://www.goodreads.com/book/show/10455430-anticancro---uma-nova-maneira-de-viver", "http://www.goodreads.com/book/show/153401.The_Instinct_to_Heal", "http://www.goodreads.com/book/show/12475840-not-the-last-goodbye", "http://www.goodreads.com/book/show/30175272-uw-brein-als-medicijn", "http://www.goodreads.com/book/show/20850695-notre-corps-aime-la-v-rit", "http://www.goodreads.com/book/show/36193389-uw-brein-als-medicijn"]}