{"ratings": 491, "userreviews": [{"userName": "Sarah Grace", "userReviewDate": "Apr 03, 2018", "userURL": "http://www.goodreads.com/user/show/59507807-sarah-grace", "userReview": "[such as thinking about the other character going through the bathing process . . . Eww. (hide spoiler)]"}, {"userName": "Deanne Patterson", "userReviewDate": "Feb 03, 2017", "userURL": "http://www.goodreads.com/user/show/34916386-deanne-patterson", "userReview": "An Uncommon Protector (Lone Star Hero, #2) I knew I enjoyed reading Shelley Shepard Gray's books but this one just blew me away. This is the best one I've read to date! Rich in historical detail and vivid descriptions you will feel as if you are there with Laurel Tracey and Sergeant Thomas Baker. Laurel has the hardship of trying to run a 100 acre ranch on her own. Knowing she is unable to do it she buys a prisoner for a years time to work her land and protect her from squatters on her land. Thomas Baker is what some would call a hard man, unflinching,uncaring. After all he has been through who could blame him. When he was just a child there was an Indian raid on his home. His father told him to go in the crawl space under his house and not come out no matter what he heard and he heard plenty. He heard the killing of his brother,mother and father. It turned him bitter. Having no one to care for him he wanders about until he is old enough to join up and fight. Taking risks no one else will because he has no one to care about him he advances fast and moves up the ranks. He lands in jail when he can't pay off a debt.On Laurel's ranch he swears to work it and protect her. There is danger around every corner there and it has Laurel scared. She is respectful and kind to him and he feels undeserving of it. He may be a hard man and have seen bloodshed in the war but he would never let any harm come to Laurel,he would lay down his life to protect her. Historical romance at it's best with a hint of danger in the suspense.The title is so perfect for this book, An Uncommon Protector, that is exactly what Thomas Baker is. He goes above and beyond. I hope this book is next on your to buy list as it's simply a do not miss book!Excellent,excellent book. I look forward to reading many more books by Shelley Shepard Gray.I highly recommend this to fans of Historical Romantic fiction.Pub Date 07 Feb 2017 Thank you to NetGalley and Zondervan Fiction for providing me with a copy of this book in exchange for my honest review."}, {"userName": "Marlene", "userReviewDate": "Dec 21, 2016", "userURL": "http://www.goodreads.com/user/show/27110787-marlene", "userReview": "It seems like I don’t give many solid five-star ratings. This is largely because I don’t round my ratings up. I always round down, because I know I tend to be more generous than many other reviewers - and because I want to be able to see at a glance on Goodreads which books I have actually given five stars to! So I’m impressed that I’ve given both this book and the first in the series five stars. Good job, Shelley Shepard Gray! An Uncommon Protector (Zondervan, 2017), second in the  Lone Star Hero series by  Shelley Shepard Gray, is a Christian historical romantic suspense set in Texas in 1867 with occasional flashbacks to 1865 Johnson’s Island in Ohio. The novel is a standalone story, but I’d still recommend starting with book #1, \n A Loyal Heart\n. I chose An Uncommon Protector from NetGalley in exchange for an honest review, because I enjoyed the first book so much. Rating: 5 starsThe hero: Sergeant Thomas Baker, is one of a close knit group of officers who were imprisoned together at a Confederate Officers POW Camp. These men were first introduced in A Loyal Heart: the highly respected Captain Monroe, Major Ethan Kelly, Lieutenant Robert Truax, and Lieutenant Phillip Markham. They were “some of the finest men he’d ever met.” They take their friendship with each other very seriously, keeping in touch with a strong commitment to be there for one another. While in the POW camp, Thomas tended to chafe against the Union guards. His “mouth always had gotten him into trouble,” ever since his family died. As a child, his father ordered him to hide during a Comanche attack, and Thomas’s family was wiped out. “Never again would he follow instructions he didn’t agree with.” Then as he grew up, he’d “constantly had to fight and scrape to survive.” However, Thomas “sure wasn’t the type to sit around and feel sorry for himself.” The heroine: Laurel Tracey is an orphan. Her father and brother died in the war, and her mother succumbed to influenza a few years later. Red Roan Ranch is now Laurel’s, and she is alone in the world except for two mooching step-siblings. She “was attempting to run what was left of a pitiful cattle operation with barely twenty head, little money for alfalfa for them to graze on, and far too many squatters in the area. She was exhausted and beginning to think she was never going to be able to keep the ranch going.” Laurel is in serious need of help. “She liked her ranch. She wanted to keep it, wanted to live there.” Laurel and Thomas cross paths when he is one of a group of prisoners “serving short jail terms for minor infractions,” assigned to fix her fence as a charitable deed. “There was something about the man that had caught her regard and held on tight.” In a brief conversation, she learns that that he is eligible for release the following day if someone hires him as an indentured servant for a year. And that’s just what she does, figuring it’s a good investment of her limited funds.Christian elements: I’ve listed just a few quotes. Faith is strong in the story but not flaunted. I didn’t see anything that concerned me. *Laurel: “Let’s believe him… It’s the Christian thing to do.” *Thomas: ”I am hard. But because of that, I’ve learned to reach out to our Lord. I’m a man who needs all the help he can get.” *Of Thomas: “He’d learned along time ago to stop feeling guilty about the past and concentrate on looking forward. That was his chief survival skill.” What I liked: *I like that Thomas is a flawed character, but the reader sees his heart and sees him grow, and it is so easy to root for him. Laurel is a lovely character inside and out and is very brave, but she is also vulnerable. I always enjoy a hero and heroine who so obviously fit each other so well. Also, they’re definitely drawn to each other, but the romance is not rushed, which makes sense for their positions as employer and indentured servant. *I enjoyed the following exchange, which simultaneously acknowledges that Thomas’s presence is outside of societal norms and provides a justification for it. And the comeuppance of an obnoxious character is fun, too.Laurel’s step-brother: “You being here is already ruining her reputation.” Thomas: “It very well might be. But she will be safe with me.” What I didn’t like: I could only find two very minor issues. An odd use of the word rectify (in my opinion) and a discrepancy about Thomas’s age. Thomas was 22 in 1865, he is still 22 in 1867, and it’s mentioned again later that he’s 22 in 1867. Oops! Perhaps that has been fixed, as I read an eARC. Not enough to bring this book down from five stars, though. If Shelley Shepard Gray writes any more books in this series, they will be auto-reads for me. (I am really hoping there will be a novel for each of the military friends.) As the rest of the author’s books under this pseudonym appear to be Amish stories (which I avoid), I plan to dip my toes into her Westerns under the pseudonym  Shelley Gray. So I’ve put her Chicago World’s Fair Mystery series on my to-read list. I highly recommend this book to any fan of Christian historical romantic suspense. As I said earlier, the faith elements are not flaunted. They are so integrated into the characters that I think this book would also appeal to non-Christians."}, {"userName": "Staci", "userReviewDate": "Mar 06, 2017", "userURL": "http://www.goodreads.com/user/show/11909124-staci", "userReview": "Shelley Shepard Gray knows how to weave a solid post Civil War love story.In An Uncommon Protector, Laurel is trying to save her ranch. Her parents and brother are deceased and she is determined to turn the ranch into a thriving one. Thomas is a former soldier serving time in prison for a gambling debt. On the surface, they seem an unlikely pair.While the romance was good, my favorite parts of the novel were the flashbacks to the POW camp and the bond of brotherhood among the soldiers detained there. As with A Loyal Heart, the main character is noble and admirable.While I enjoyed A Loyal Heart just a bit more, An Uncommon Protector was a good novel and I look forward to the next in the series."}, {"userName": "Beth Erin", "userReviewDate": "Feb 24, 2017", "userURL": "http://www.goodreads.com/user/show/40899796-beth-erin", "userReview": "Full review on Faithfully Bookish http://wp.me/p7ngfE-AFY’all, this series has something very special… man love. That’s right, I mean good old fashioned, band of brothers, solemn vow loyalty! Toss in a Texas damsel in distress, a dash of mystery, a splash of danger, and a healthy dose of romance and that, my friends, is a recipe for one delicious read!Laurel Tracey is just another rancher’s daughter-next-door until readers consider her resilience, determination, and tenacious work ethic. Thomas Baker is no stranger to hardship and that just seems like a huge understatement. His fierce drive to protect Laurel extends beyond repaying a debt, Thomas is determined to defend her honor, her livelihood, and her home.Readers become acquainted with the heroes of this series through flashbacks to their time in the POW camp and each reunion after the war’s end is both challenging and heartwarming. I can’t wait to see which officer will find love next!I requested the opportunity to read and review this title through BookLook Bloggers and NetGalley. The opinions expressed are my own."}, {"userName": "Lisa  (Bookworm Lisa)", "userReviewDate": "Apr 27, 2017", "userURL": "http://www.goodreads.com/user/show/864649-lisa-bookworm-lisa", "userReview": "This book is a second in a series, but can be read as a stand alone. I have not read the first, and completely enjoyed and understood this one. Now that I know some of the backstory and characters, I really want to read the first book.This book takes place in Texas after the Civil War. Many women are widows and fatherless, Laurel falls into this category. She is trying to keep her family ranch up and running while finding a lot of opposition. Her step-siblings are leeches and want her to sell so they can have fund, there are other ranchers trying to get hold of the property. She is a strong and determined young lady who sees an opportunity to hire and ex-convict to help her run off the unsavory characters around her.Fortunately for her, the ex-convict is a man of integrity. He hasn't lived a perfect life and has emotional as well as physical scars. From the moment they meet, there is a spark that neither is willing to act upon. Both care more about the other than they do themselves.This book has some violence, and kissing.Source: I received a review copy from Negalley. All thoughts and opinions expressed are my own."}, {"userName": "Beth", "userReviewDate": "May 20, 2018", "userURL": "http://www.goodreads.com/user/show/4075354-beth", "userReview": "Chivalry and loyalty are two words that describe this series and the characters perfectly. Thomas Baker, while a bit rough around the edges, is loyal to the core, and when his new boss Laurel Tracey needs his help, he freely gives it. Moreover, he realizes they will need more help than just the two of them can give, so he calls upon his friends - also former soldiers, who are willing to help at almost a moments notice.Laurel, though still a woman of her time, is determined to keep her ranch and her family legacy intact. Others seek to use the fact that she is a woman alone to their advantage. Though she finds it uncomfortable to go against what society dictates, she is willing to do it for her ranch and for her very life.An Uncommon Protector is a good story. Not great for me, but good. The plot is engaging, and the characters are the best part, in my opinion. The romance is where things fell a bit flat. It moves way too fast for my preference in a story and lacks any build-up whatsoever. Other readers may not mind this as much, but it's usually a sticking point with me. I also like more historical details in a story, and this one is very light in that regard.Still, it's a sweet romance, and while they weren't my new favorite couple, I did still like Laurel and Thomas together. I do want to read book three at some point, to finally get a story that focuses on Major Kelly because he's still my favorite out of the four friends.Thank you to the publisher for a complimentary copy of this novel. I chose to read and review it, and the opinions expressed here are my own."}, {"userName": "Tina", "userReviewDate": "Jan 16, 2017", "userURL": "http://www.goodreads.com/user/show/12159793-tina", "userReview": "An Uncommon ProtectorShelley Shepard Gray\tFans of historical fiction will love this book set just after the Civil War in Fort Worth, Texas. In this story, which is the second in Gray’s Lone Star Heroes series, we meet Laurel and Thomas. Laurel lost her father and brother in the war; shortly thereafter she loses her mother and stepfather as well. She is trying hard to hold on to her family’s cattle ranch, even though her step-siblings want her to sell out. Thomas is a former soldier who spent part of the war in captivity on Johnson’s Island with a group of men anyone would be lucky to know. He is now a convict, put in jail for failing to pay his debts from a poker game. \tLaurel purchases Thomas for one year to in exchange for his freedom. She needs his help to run the ranch. There have been problems with squatters and she can’t handle it all on her own. Thomas is only there one day when trouble begins in earnest. Someone wants Laurel to sell so bad that they are willing to kill her cattle, poison her creeks, and shoot at the two of them. As they try to figure out what is happening, Thomas calls on his friends from Johnson’s Island (some of whom we already met in The Loyal Heart, book 1). The adventure is exciting and love is in the air from the first page of the book. Laurel and Thomas very clearly care for each other, but they must work through their own personal thoughts and what society deems acceptable. Will they find love in the end? Will Laurel save her ranch? Read the book and see! It is totally worth it!\tI received a free copy of this book for my honest review from NetGalley."}, {"userName": "Pamela", "userReviewDate": "Oct 21, 2017", "userURL": "http://www.goodreads.com/user/show/70584887-pamela", "userReview": "This is the second book in a series, but it can be read as a stand alone (insert wildly appreciative applause) I have an immense dislike for books that forced you to buy the next in a series to just find out what happens, readers should want to buy the next in a series, not have to. That said, I plan on buying the first one because I really enjoyed this one! Set just after the Civil War in Fort Worth, Texas this is a well written story of love, loss, vulnerably, loyalty, the human spirit and faith with just the right amount of historical detail to transport you back in time. The wonderful chemistry between the characters mixed with a bit of mystery and suspense keeps you turning to the next page and makes this a don't miss read."}, {"userName": "Dana Michael", "userReviewDate": "Mar 11, 2017", "userURL": "http://www.goodreads.com/user/show/32139670-dana-michael", "userReview": "An Uncommon Protector is the second book in A Lone Star Hero Series. I absolutely loved it. The uncommon protector was a civil war veteran named Thomas who was plucked from jail to help save Laurel Tracey's ranch. This book includes a band of brothers who swore a promise to each other in a prisoner of war camp to come to each other's aid should the need arise. The hero was a tough guy who was so tender and protective of Laurel. She was a sweet but determined heroine who trusted a convict and prisoner of war to help her save her ranch and keep her safe. This was a very good book and I never got bored and I looked forward to each new page I turned.I am committed to this series and I cannot wait for the next one to be published.*I was given a copy of this book from Thomas Nelson Publishers and was under no obligation to leave a review."}, {"userName": "Carrie Schmidt (Reading is My SuperPower)", "userReviewDate": "Feb 11, 2017", "userURL": "http://www.goodreads.com/user/show/6084197-carrie-schmidt-reading-is-my-superpower", "userReview": "Y’all just go ahead and get your fans and fainting couches handy, ok? Because Thomas Baker will have you swooning before the first chapter is finished. His rakish grin, his handsome figure, his rogueish thoughts … whew. Maybe just go on ahead and sit by the nearest snowbank while you’re reading this too. Or, if your weather is miserably unwintry like Kentucky’s, read by the open freezer door.Besides Thomas and all his swooniliciousness, we also get to meet Laurel. She’s a fantastic heroine, strong enough to hold her own yet vulnerable enough to admit she needs help. The chemistry between these two is palpable and electric from the instant their eyes first meet and just gets better as their story progresses. Both protagonists already have compelling backstories that give dimension to their characters, and the way these stories are presented – as well as the growth that each experiences along the way – makes these two of my favorite of Gray’s characters!Bottom Line: An Uncommon Protector is a story bursting with everything western romance fans are looking for. Bits of intriguing history woven throughout, fantastic characters, humor, sincerity, and some sizzle too! Enhancing the story even further is a bit of mystery/suspense that keeps tensions high (and brings out Thomas’ protective side quite nicely) as well as the message of redemption and “value” that is subtle but also clear and sweet. While this is part of a series, it can certainly be read as a stand alone novel. I always love a new Shelley Shepard Gray read, but this one is a new fave!(I voluntarily reviewed a complimentary copy of this book.)See my review at ReadingIsMySuperPower"}, {"userName": "Velva Brown", "userReviewDate": "Nov 28, 2016", "userURL": "http://www.goodreads.com/user/show/23598768-velva-brown", "userReview": "An Uncommon Protector – Shelley Shepard Gray\tThe last book I read by Shelley Shepard Gray was A Texan’s Choice, and from what I can remember – and the cover helps me remember – I really liked it. An Uncommon Protector was a good read also. It is the story of Thomas, a man who can’t seem to catch a break, and Laurel, a woman carrying the responsibilities of a man after the Civil War.\tThomas is serving time for an unpaid gambling debt, but was “purchased” by Laurel to help on her ranch. He is a hard-working man with a good heart. Laurel is sensible and believes she is destined for a life on her own. She desperately wants to save her ranch. There are people who want her land, and will stop at almost nothing to get what they want. Fortunately, Thomas has a solution to the problem. I won’t share more because I don’t like to spoil the reading for people. \tI liked that this book looked at the heart of Thomas – not his situation. I liked that it showed that even though society deemed him a “worthless criminal” his character showed through. \tI did think the book was good, although it was a little slow.I was given this book in exchange for an honest review."}, {"userName": "Maureen Timerman", "userReviewDate": "Jan 17, 2017", "userURL": "http://www.goodreads.com/user/show/3840941-maureen-timerman", "userReview": "This is the second book in this series, and just as good as the first one The Loyal Heart, and you might consider reading this one too, but you don’t have to have read the first to enjoy the second.Thomas Baker as a mother I wanted to grab and hold that poor boy, and things don’t seem to get much better for him when he ends up a Confederacy Prisoner, and our dear boy has a temper, not that I blamed him, but he sure does get whipped for it.What put these two together is kindness and belief in God, when on a hot day in Texas Laurel Tracey offers a drink of water to the prisoners fixing her fence, the sheriff is helping her out. Our boy is there and that meeting might just save both of their lives.I loved the compassion, even in adverse conditions of these people who lived their faith, and the help they received from people who are not related, but love God. Why would people kill innocent animals, greed sad to say? You will be wrapped up in this time and period in no time, and I can’t wait for more, as there are more friends here.I received this book through Net Galley and the Publisher Zondervan, and was not required to give a positive review."}, {"userName": "Judy", "userReviewDate": "Nov 11, 2016", "userURL": "http://www.goodreads.com/user/show/1244630-judy", "userReview": "Although somewhat predictable, the memorable characters faced with an interesting situation made this a mostly satisfying read. Some chapters go back in time to provide background information about Thomas which filled in his character, helping me better understand him. I received an ARC from the publisher through NetGalley."}, {"userName": "Savanna Kaiser", "userReviewDate": "May 16, 2017", "userURL": "http://www.goodreads.com/user/show/23133077-savanna-kaiser", "userReview": "This book delivered everything I hope for in historical fiction. Our wounded hero is admirable and likeable even though he’s a bit rough around the edges and our heroine is strong and lovely and in need of a friend. The unlikely pair finds themselves thrown in the middle of a mystery and threatened by an unknown enemy. This Post-Civil War tale had me glued to the page.I’ve really enjoyed this entire series. I’ve liked getting to know these ex-Confederate brothers-in-arms and the women they fall in love with. Thomas made friends for life with his fellow-prison mates following the war. Their bond and friendship really blesses the story with a sense of family and healing for these men who’ve suffered a great deal. Watching his friends come to his rescue was endearing and comforting. They’re true friends and each of them added to the story.I also enjoyed watching the attraction between Laurel and Thomas spark to life quickly. The dilemma of their circumstances made for a unique storytelling twist. I loved how their weaknesses and strengths complimented each other and how they were willing to sacrifice for love. Their story really has it all – charm, humor, adventure. I have no doubt my fellow historical fiction readers will love this book.I received a free copy from the publisher. No review, positive or otherwise, was required—all opinions are my own."}, {"userName": "Rachael", "userReviewDate": "Mar 21, 2017", "userURL": "http://www.goodreads.com/user/show/21139362-rachael", "userReview": "This was an enjoyable read, and I liked both the main characters. Laurel is very independent out of necessity. Thomas Baker makes for an amazing hero with a past to touch anyone's heart. I read this in one sitting and enjoyed the light hearted story.I don't always explain my star rating, but some have said they wish reviewers would so I'm going to try to do so for most of my reads. This book got three stars because after a few chapters, I knew exactly how it was going to end. It was entirely predictable. Still an enjoyable read, but I give books with more depth and originality higher stars. This book was very much character driven. Not much history in it. The characters are plenty to fill the story and make for a good one.I received this read from the publisher for my honest opinion which I have given."}, {"userName": "Laura", "userReviewDate": "Feb 20, 2017", "userURL": "http://www.goodreads.com/user/show/2521894-laura", "userReview": "First, the disclaimer. \"I was provided a free copy of this book. All opinions are my own.\" That done, AN UNCOMMON PROTECTOR is the second book in the A Lone Star Hero's series, but it stands alone. I didn't read the first book A Loyal Heart and had no trouble following along with this book. I mostly read Ms. Gray's Amish series, but have read one of her historicals in the past so decided to give this one a try. It has an interesting premise. Single girl losing ranch so she hires a convict (when he's release on (sort of) parole or really sold on the auction block) to work for her to save the ranch. When Laurel brings Thomas home, her step-siblings rebel, attempting to call her bluff, and with no money or place to stay, walked eight miles to town. Laurel let them go. I didn't like the step-siblings at all. I did like Thomas' outspokenness, though he was inappropriate much of the time, and I'm glad he was a man of honor even if he did have a rather low opinion of himself. Laurel is learning to be outspoken, so she is struggling to find the fine footing between being a genteel lady and being owner of a ranch and forced to make her own decisions for herself and others.Ms. Gray isn't real big on faith messages, her books are more sweet romances with little to no mention of faith, so this book shouldn't be offensive to anyone (even if they are anti-Christian). If you like a strong faith message, look further, but if you like sweet romances, then Ms. Gray is a writer to consider. Her books are fun, imagitive, and light-hearted. Warning: There is use of God's name in vain and some soft-swear words."}, {"userName": "Elizabeth", "userReviewDate": "Feb 09, 2017", "userURL": "http://www.goodreads.com/user/show/16510688-elizabeth", "userReview": "An Uncommon Protector ( A Lone Star Hero’s Love Story)By: Shelley Shepard GrayAn Uncommon Protector is book two in A Lone Star Hero’s Love Story by Shelley Shepard Gray. Wow, Ms Gray captured me at the start and did not let go till the end. She weaves an uncommon love story that will have you trying to read faster, and turn the pages faster to see what is going to happen next. I really loved Laura Tracey and Thomas Baker, the two main character who was really brave and strong. Laura lost all her family except a step brother and a step sister who does not want to help Laura out on the ranch. She needs some help bad. Thomas Baker is in jail for not paying his debts. I liked the friendship he had with some friend, they were true bond brothers. Thomas takes a liking to Laura right away, but he thinks he is not good enough for her. He wants to protect her. He was my kind of hero. This story will steal your heart and leave you with wanting more. I was given a complimentary copy of this book, but was not told that I had to give a positive review. All opinions are my own."}, {"userName": "Yvette", "userReviewDate": "Mar 15, 2017", "userURL": "http://www.goodreads.com/user/show/17897022-yvette", "userReview": "What an outstanding follow-up to the first Lone Star Hero's Love Story, The Loyal Heart. When the first Lone Star Hero called on his band of brothers for assistance, one of them was unable to answer the call. This is his story, and we quickly learn why Thomas Baker was unavailable.When Laurel Tracey sees Thomas for the first time, as part of a chain gang working on her ranch, she is fascinated. Left to run her family's ranch alone after the devastation of the Civil War, she soon finds herself hiring the attractive convict out of jail to help her.Featuring two people from different backgrounds who find what they need in each other, this is a wonderful story. Highly recommended for those who enjoy historical fiction with sweet romance. I am looking forward to reading more of this series, and more by this author.This review refers to a copy received from Thomas Nelson and Zondervan's Fiction Guild, in exchange for a review. All opinions expressed are my own. Full review on bookworlder.wordpress.com"}, {"userName": "Emilee", "userReviewDate": "Mar 11, 2017", "userURL": "http://www.goodreads.com/user/show/11072558-emilee", "userReview": "This is the first book I have read by Shelley Shepard Gray. I picked it up on the \"new\" shelf at the library. After I started it I realized it was book two in A Lone Star Hero's Love Story. But it was certainly enjoyable as a stand alone. I was conflicted on how to review this book because there were a few parts I just didn't feel worked for me for example, Laural Tracey's position on the ranch. Supposedly she has been running the ranch all alone for a few years, but when she hires Thomas she seems to be almost helpless. If I remember right, Laural and Thomas are both 22 but they seemed years older, which in a way makes sense because of what all they had been through but then again in seemed a little off to me. The other thing that bothers me is that Thomas was sleeping in the house the second night he was there. It was hard for me to wrap my brain around that because of the time period. But I tried to put those things aside and started to enjoy it. The hero, Thomas was refreshing. He is different from most other wounded, flawed heroes. And Laural was okay, I didn't connect as much as I would have liked to. I did appreciate how well the story line moved along and didn't seem to drag out the romance for months. That was a plus for me."}, {"userName": "Angela Bycroft", "userReviewDate": "Apr 23, 2017", "userURL": "http://www.goodreads.com/user/show/7833108-angela-bycroft", "userReview": "Two people - both desperate to escape. One a jail cell and work gang, the other - her the danger that lurks on her own property boarders. When Laurel Tracey decides to scandalise her home town and free a man from the local jail in exchange for a guaranteed years work - she knows she’s taking on a risk. But something about this particular prisoner inspires a strange confidence and trust. Could this deal both work to the others advantage?Thomas Baker, former solider and recent jail bird on account of some unpaid debts, is overwhelmed by Laurel’s gesture and her immediate trust. Soon he realises he’d do just about anything to see Laurel safe, happy and more than anything - protected. I had previously read the first book in this series, A Loyal Heart and really enjoyed it. This was a simpler tale - but no less romantic or worthy of my time. Laurel and Thomas were well likable characters and while their story may not have had as many twists and turns as the previous book - I would still heartily recommend as a cosy read, perfect for reading on a wet windy day. \u2028Can’t wait for more from this series."}, {"userName": "Brittany", "userReviewDate": "Mar 13, 2017", "userURL": "http://www.goodreads.com/user/show/18727044-brittany", "userReview": "An Uncommon Protector is a great addition to the Lone Star Hero collection. The stories in this series can stand alone. Each story contains a hero who was part of a group of Confederate POW soldiers. These men formed an incredible bond that proved to be strong even after the war was over and these stories took place. The bond between these men provided the common link between the stories. I liked both the main story and the flashbacks to the POW camp. Those flashbacks helped me understand how Thomas viewed himself within the group.This novel was really enjoyable to read. It had danger, vile characters, sweet and tender romance, and hope. I really liked both main characters. Laurel was a strong woman, yet she learned when to ask for help and rely on others. Thomas had to overcome a lot in his life. Even in this book he had growing to do, yet he was a strong and loyal defender.This story was a joy to read from start to finish and I definitely recommend it to fans of historical fiction set around the civil war era.I received a complimentary copy of this book. All opinions are my own.You can read this review on my blog at:https://brittreadsfiction.wordpress.c..."}, {"userName": "Susan K", "userReviewDate": "Feb 19, 2017", "userURL": "http://www.goodreads.com/user/show/4377518-susan-k", "userReview": "This was a cute period novel, set after the Civil War in Texas. Thomas and Laurel come together after Thomas' indenture to Laurel for a year to help him leave prison. Thomas is a former Confederate soldier who has a quick tongue, but loyal, and has integrity to help others and work hard. His past, the death of his parents and hard scrabble existence as a young man on his own, let him to be very independent, but loyal to those who become his family. Laurel is fighting her step-siblings and a former suitor to build up her ranch, and keep her home. They combine together to help the ranch, but as circumstance escalate, to save it and themselves from villains intent on scaring Laurel off the ranch. Loved the flashbacks into Thomas' life and his prison experiences. Both of them are genuine, honest characters, with sincere and honest hearts. I loved their mutual attraction. Laurel was more 'sweet', but definitely still hard working and willing to work and fight for her home. I can't say it was a perfect period piece, but definitely a fun read for me today. This was a cute read, but still a little deeper read for the subject matter with the Prison scenes. The secondary characters were a little flat for me, so really a 3.5, but will round up to 4 with the depth of the feelings and emotions that were portrayed with the war/prison elements. I will be reading other things by this author to see some of the other side stories from this group of Civil War Soldiers.Romance, clean, mild Christian elements. I received a copy from NetGalley in exchange for a fair and honest review."}, {"userName": "Kelly Bridgewater", "userReviewDate": "Feb 08, 2017", "userURL": "http://www.goodreads.com/user/show/33835690-kelly-bridgewater", "userReview": "After reading Shelley Shepard Gray's Chicago World's Fair Mystery series and being pleased with two out of three of them, I had a good idea of how Gray writes. She invites me into the historical setting with no problem. I could picture the setting and see the characters moving around. I understood the character's plight and emotions. While the story is predictable and non-original, I did like the hero who was a \"bad\" guy turned right, even though I believe his crime that put him in prison wasn't that horrible. Since it is a historical romance, I knew right away that Laurel and Thomas would fall in love and end up married. While the plot idea of someone wanting to scare Laurel off her hundred acres has been overdone, I did enjoy the time I spent reading the story. Once the bad guy was revealed to Laurel and Thomas, it was a quick hand trick and the bad guy was hauled off to jail. I hoped for a better stand-off, but Gray didn't give me one. An Uncommon Protector is a great book for fans of historical romances right after the Civil War. While I prefer to read something with more suspense in it, Gray does a good job at weaving together a story that I enjoyed.I received a complimentary copy of An Uncommon Protector from Zondervan Publishing and the opinions stated are all my own"}, {"userName": "Julia Wilson", "userReviewDate": "Jul 16, 2017", "userURL": "http://www.goodreads.com/user/show/29770295-julia-wilson", "userReview": "An Uncommon Protector by Shelley Shepard Gray is a marvellous Christian historical romance, set in the aftermath of the American Civil war. I absolutely loved it.War changes people - for better or for worse. Bonds of brothers formed in hardship, persist in peacetime, united by shared memories and promises. Women and children suffered. Men did unthinkable things. Some people still believed in goodness. \"She still believed in goodness in the world, even though she had survived a war.\"War can make or break people, freeing them from their past. In times of crisis, men turned to God. \"I realise how much they have to be thankful for and they count their blessings.Conflicts continue to rage even though war has ended. Greed drives men forwards, when really they should be thankful for all they have.There is the theme of loss. Characters who have lost their whole families still have a drive to survive. God promises to repay the years the locusts have taken.War leaves scars. Some are visible, others are hidden deep inside.There is a wonderful air of love and care that pervades the novel. Whilst some will let us down, others will always have our backs.Kindness is over the whole novel. The leading lady is kindness personified. If she can alleviate suffering with a kind word or action, she will. Shelley Shepard Gray has drawn wonderful characters once again. Her heroine is a mixture of strong yet vulnerable. In her kindness, she will not suffer fools gladly. Likewise, the leading man is a mixture too. His past has made him self reliant and reluctant to let others in. His past has also made him the caring man, the reader sees. The pair have a wonderful volley of dialogue backwards and forwards.I always adore Shelley Shepard Gray's novels and An Uncommon Protector is one of her finest. For a real treat - buy it and read it today.I received this book for free. A favourable review was not required and all views expressed are my own."}, {"userName": "Just Commonly", "userReviewDate": "Mar 05, 2017", "userURL": "http://www.goodreads.com/user/show/19895197-just-commonly", "userReview": "There is just something about A Lone Star Hero's Love Story series by Shelley Shepard Gray. Book 1, The Loyal Heart had captured my heart, and in the second book of the series, An Uncommon Protector we are once again thrown into a story of how war had affected and change people. And before we get to that, lets talk about our main characters, Thomas Baker and Laurel Tracey. Boy oh boy! Thomas Baker is one worthy hero. Rakishly handsome and with a grin that can heat through the pages to our fingers, Thomas Baker is loyal and honest, sometimes with humorous or embarrassing results. Either way, you will fall in love with him. Yet, we can't forget the partner in this uncommon love story, Laurel. She is tenacious and strong-willed. From their first encounter to the last scene of the story, their chemistry is spot on. We will not find a better pair in this story than them (though I'm really loving the banters between the team - we'll get to that in a bit). As a couple, they may be my favorite set from all the stories the author (that I've read so far). I do need to check back on another favorite of mine and confirm this claim. Speaking of characters, we have the camaraderie of the men's unit under Captain Devin's promise pact.\"What kind of men were they? What kind of men dropped everything and rode miles and miles on the basis of one telegram? Men unlike any she'd ever known.\" (225)So true it is, and that's what truly struck me with this series. There's friendship, the type that highlights loyalty in all caps, but it's much more than that. It's a promise, a promise that held true to each of these men's hearts, and in turn representative of the promise from our Lord to us. The mystery aspect was interesting, and had provided the catalyst for the story to move forward, and the chance for us to see our main characters get to know each other, and for us to meet the rest of the unit again. I am so looking forward to Major Kelly and Captain Devin's story! I love how the author easily woven in a little background of the unit, Thomas' and Laurel's backstory and bring forth the story as a whole. In all, a wonderful Book 2 in a series, that can easily be read as a standalone. I really enjoyed An Uncommon Protector, and even more so than book 1, The Loyal Heart!One of my favorite scenes:\"Miss Tracey, I would have paid good money to have you at my side when I gave Thomas orders during the war. Your presence would have saved us form many hours watching him pace and fidget.\" (228)This review first appeared on Just Commonly blog.Disclaimer: I received a copy of this book from the author/publisher. I was not required to write a positive review, and have not been compensated for this. This is my honest opinion."}, {"userName": "Amy", "userReviewDate": "Mar 13, 2017", "userURL": "http://www.goodreads.com/user/show/9945907-amy", "userReview": "An Uncommon Protector is the second installment from the Lone Star Hero series. The War Between the States was hard on Lauren Tracey. She loses her mother, father, and her brother. She has inherited a 200 acre ranch-a ranch she is running alone. She decides to free Thomas Baker from jail and hires him for a year to help her on the ranch. The two have to solve a mystery of why her cattle are suddenly dying. Could they find that their own lives are in danger?I thought An Uncommon Protector to be a pretty good read. I liked Lauren from the start and enjoyed the chemistry between her and Thomas. Even though Thomas was just released from jail, I still felt that he was a good man. He would do anything to protect Lauren, making me love him more and more throughout the book. The story is full of historical details that I felt like I was transported back in time. There are some mystery and suspense that kept me wondering what would happen next. I think this is the best book I have read by Shelley Shepard Gray yet.A great, clean, historical romance.Five starsI received this book from the publisher. But was not required to write a review. This review is 100% my own honest opinion."}, {"userName": "Galaxy Adventurer", "userReviewDate": "Mar 06, 2017", "userURL": "http://www.goodreads.com/user/show/21821354-galaxy-adventurer", "userReview": "What the book is about:Overwhelmed by the responsibilities of running a ranch on her own, Laurel Tracey decides to hire a convict—a man who’s just scary enough to take care of squatters and just desperate enough to agree to a one year post.The years following the war have been hard on Laurel Tracey. Both her brother and her father died in battle, and her mother passed away shortly after receiving word of their demise. Laurel has been trying to run her two hundred acre ranch as best she can.When she discovers that squatters have settled in her north pasture and have no intention of leaving, Laurel decides to use the last of her money to free a prisoner from the local jail. If she agrees to offer him room and board for one year, he will have to work for her to pay off his debt.Former soldier Thomas Baker knows he’s in trouble when he finds himself jailed because he couldn’t pay a few fines. Laurel’s offer might be his only ticket out. Though she’s everything he ever dreamed of in a woman—sweet and tender-hearted, yet strong—he’s determined to remain detached, work hard on her behalf, and count the days until he’s free again.But when cattle start dying and the squatters damage a barn, Thomas realizes more than just his freedom is on the line. Laurel needs someone to believe in her and protect her property. And it isn’t long before Laurel realizes that Thomas Baker is far more than just a former soldier. He’s a trustworthy hero who’s survived a terrible past. He needs more than just his freedom, he needs her love and care too.My Review:I really enjoyed Shelley Shepard Grey's Chicago World's Fair Mystery series, so I was excited to read this. And while this wasn't as good as that series, it was still a cute historical romance book :)One of the things I liked most about this book was Thomas and his war friends, friendship :)Laurel's step-siblings were horrible, I didn't like them(or Landon) at all ;PLaurel, herself, was a strong and kind main character.Overall I enjoyed it, but it didn't wow me.I received a free book from Thomas Nelson/Zondervan Fiction Guild in return for a honest review."}, {"userName": "Donna", "userReviewDate": "Apr 30, 2018", "userURL": "http://www.goodreads.com/user/show/5379274-donna", "userReview": "SweetThis story holds a lot of depth as he and she learn to value themselves more. This book has strong spiritual overtones without being preachy. The strength of honor is magnified and the desire to be our brothers keeper."}, {"userName": "Lisa Johnson", "userReviewDate": "Feb 21, 2017", "userURL": "http://www.goodreads.com/user/show/7092311-lisa-johnson", "userReview": "Title: An Uncommon Protector (A Lone Star Love Story #2)Author: Shelley Shepard GrayPages: 305Year: 2017Publisher: ZondervanMy rating is 5 stars.This is a good, old-fashioned, Western romance set in 1867 for the most part with some flashbacks to 1865. The main characters are Laurel Tracey and Thomas Baker. Thomas was introduced in the first book of the series, The Loyal Heart. The flashbacks take place in Ohio in a Confederate soldier prison camp toward the end of the Civil War.Thomas Baker has really done it this time. He was caught in a poker game with men much more experienced than himself. As a result, he owed them a lot of money that he didn’t have; therefore, he was put in jail. He now faces more jail time unless someone is willing to buy him for one year to work as an employee. He has no hope for that, but understands he got himself in this situation.Laurel Tracey is a lone female trying to hold on to the family ranch after the deaths of her father and brother in the Civil War and her mother’s death as well. She has two ungrateful stepsiblings who are living with her and taking her for every dime she has without doing any work around the ranch. She desperately needs some help or she will be forced to sell the ranch, which is just what her stepsiblings want. Her neighbor also wants her to sell and has offered to buy the ranch or he could marry her to help her out. Laurel is determined to keep her ranch and thus determines to hire an employee, who just happens to be a former prisoner. Thomas comes to work at the ranch and immediately he and Laurel sense an attraction to each other. That very day, however, trouble starts on the ranch. After a few days, Thomas realizes he is in over his head and calls for help from his former Confederate soldier comrades.I really liked how Thomas leaned on the Lord throughout his whole life, even when he admittedly made some very poor choices. He still considered himself a Christian and didn’t falter in his belief in God. I also liked the interaction between Laurel and Thomas. They always tried to do what was best for the other and also what was best in God’s eyes. Thomas definitely showed his protectiveness for Laurel as she was protective of him. They both were protective of the ranch and also recognized they were protected by the Lord. I can’t wait for the third book in this wonderful series!Disclosure of Material Connection: I received one or more of the products or services mentioned above for free in the hope that I would mention it on my blog. Regardless, I only recommend products or services I use personally and believe will be good for my readers. I am disclosing this in accordance with the Federal Trade Commission’s 16 CFR, Part 255. “Guides Concerning the Use of Endorsements and Testimonials in Advertising.”"}], "description": "Overwhelmed by the responsibilities of running a ranch on her own, Laurel Tracey decides to hire a convict—a man who’s just scary enough to take care of squatters and just desperate enough to agree to a one year post.The years following the war have been hard on Laurel Tracey. Both her brother and her father died in battle, and her mother passed away shortly after receiving word of their demise. Laurel has been trying to run her two hundred acre ranch as best she can.When she discovers that squatters have settled in her north pasture and have no intention of leaving, Laurel decides to use the last of her money to free a prisoner from the local jail. If she agrees to offer him room and board for one year, he will have to work for her to pay off his debt.Former soldier Thomas Baker knows he’s in trouble when he finds himself jailed because he couldn’t pay a few fines. Laurel’s offer might be his only ticket out. Though she’s everything he ever dreamed of in a woman—sweet and tender-hearted, yet strong—he’s determined to remain detached, work hard on her behalf, and count the days until he’s free again.But when cattle start dying and the squatters damage a barn, Thomas realizes more than just his freedom is on the line. Laurel needs someone to believe in her and protect her property. And it isn’t long before Laurel realizes that Thomas Baker is far more than just a former soldier. He’s a trustworthy hero who’s survived a terrible past. He needs more than just his freedom, he needs her love and care too.", "title": "An Uncommon Protector\n      \n          (Lone Star Hero #2)", "url": "http://www.goodreads.com/book/show/30613569-an-uncommon-protector", "average": 4.08, "cover": "https://images.gr-assets.com/books/1465912124l/30613569.jpg", "reviews": 176, "authors": [{"url": "https://www.goodreads.com/author/show/1271571.Shelley_Shepard_Gray", "name": "Shelley Shepard Gray"}], "type": ["Christian Fiction", "Historical", "Romance", "Historical", "Christian"], "outlinks": ["http://www.goodreads.com/book/show/30613569-an-uncommon-protector", "http://www.goodreads.com/book/show/31298920-an-uncommon-protector", "http://www.goodreads.com/book/show/2942614-hidden", "http://www.goodreads.com/book/show/8468267-the-caregiver", "http://www.goodreads.com/book/show/6748375-winter-s-awakening", "http://www.goodreads.com/book/show/8501404-grace", "http://www.goodreads.com/book/show/4187968-wanted"]}