{"ratings": 69, "userreviews": [{"userName": "Texas", "userReviewDate": "Apr 17, 2018", "userURL": "http://www.goodreads.com/user/show/80026578-texas", "userReview": "A fun, heartwarming, second chance at love, intriguing series that's just perfect to spend the time reading. Best sequentially, but not necessary.Any Way You Slice It #1 - Wish I could have read these books in order, but it doesn't matter. A well thought out romance with realistic dialog and characters and an interesting, entertaining plot. Any more would be spoilers. This series is more substantial than a lot of this genre.Any Way You Fight It #3 - Second chance at love. Another well written, funny romance with interesting characters and an entertaining plot. I can't say more or it would be spoilers. I enjoyed reading this series.Any Way You Want It #5 - If you enjoy S. Claflin and T. Pedersen, you'll love McDonell, too! It's the first chapter and you're already laughing and rootin' for the good guys. A well written, fun-filled romance, this time with Chloe and Moose. My second story by this author and now I want to read them all. Moose is my favorite male character.Any Way You Build It #6 - A well-written, fun, exciting, clean romance. I had to finish it in two sittings; work, a four-letter word, interrupted me. It was complete, but I believe there's more to the story. This is the first story I've read by this author, but I've got another one ready to go from Amazon. I asked the author if I could review this book.Any Way You Spin It #7 - Another second chance. Another well written, heartwarming romance with interesting characters and a realistic plot. None of these books are repeats, but interesting, fun books on their own, just a piece of a larger picture.Any Way You Like It #8 - Another heartwarming, humorous, intriguing second chance romance in one of my favorite places with some of my favorite characters. This complete series is well written with well developed characters with realistic dialog and no stupid formulas, along with interesting and intriguing storylines. While complete with humor and bad guys, these books are substantial pieces, not fluffy junk. This is my second favorite, which is actually hard to decide on since all the books are favorites! There's also a preview of the book, Something of a Spark."}, {"userName": "Margaret Watkins", "userReviewDate": "Nov 15, 2017", "userURL": "http://www.goodreads.com/user/show/21488270-margaret-watkins", "userReview": "This cute romance is a lot of fun. Todd is determined to ride the waves of life, working in his tree house and playing games, but marriage and children have no place in his Peter-Pan lifestyle. However, unlike most playboys, Todd has a wounded soul and is in fact a really nice guy. When Sarah is thrown a lifeline through the death of her aunt, she inherits her home, giving her and her two children a place to live. However, things are still not easy as in order to work Sarah needs childcare, something she cannot afford. As neighbours, Todd and Sarah have everything going for them, except for their personal vows never to get attached to anyone again. Sarah finds that she cannot escape notice in the small town and when disaster strikes, Todd ropes his friends in to give her the assistance she needs. He also cannot escape Sarah’s two young children, and when Zach and Livi latch onto him, Todd finds himself giving more of himself than he ever intended. This book is well written and is part of a series, however in spite of again meeting old friends, this story is a standalone and can be read as such. Although there is passion, the story is basically clean and can be read by most age groups."}, {"userName": "Kim", "userReviewDate": "Oct 24, 2017", "userURL": "http://www.goodreads.com/user/show/35092738-kim", "userReview": "I obtained this free e-book from Amazon and I am voluntarily writing a review. Sarah is the widowed mother of two children one of which is wheel chair bound after a hit and run accident. She has uprooted her family and moved them to a new town where she has inherited her Aunt Esme's house. It is scary with no job, no money, and not knowing a single soul but it gives her a chance to save money with no rent and a fresh start for all. Todd is the seriously sexy devoted to being single has an office in a tree house guy next door that was good friends with her aunt."}, {"userName": "KB", "userReviewDate": "Oct 29, 2017", "userURL": "http://www.goodreads.com/user/show/68220044-kb", "userReview": "4 starsI purchased Any Way You Build It by Monique McDonell August 15, 2017 and this review was given freely. Sarah returns to claim the home deeded to her by her Aunt. The sexy, sweet, and mysterious neighbor Todd helps Sarah and her kids settle in bringing love and happiness while Todd hides his secret. Denial, attraction, humor, tragedy, and a caring town make this a complex and heartwarming novel."}, {"userName": "Ed Fritz", "userReviewDate": "Nov 22, 2017", "userURL": "http://www.goodreads.com/user/show/26403850-ed-fritz", "userReview": "Super Love StotyThis is a realistic story with real people and believable actions . There is no suspense because from thr start it is obvious that the two main chaacters are destined to be together. However t is intersting to watch it happen"}, {"userName": "KRISTEN LAWRENCE", "userReviewDate": "Oct 30, 2017", "userURL": "http://www.goodreads.com/user/show/30606924-kristen-lawrence", "userReview": "Could not finish this oneI don't know how this story got good reviews. I really wanted to like it, but I just couldn't force myself to read any more. Simplistic plot, characters without dimension and conflict for the sake of conflict."}, {"userName": "Love", "userReviewDate": "Mar 29, 2018", "userURL": "http://www.goodreads.com/user/show/9732230-love", "userReview": "Cute RomanceThis is such a cute little romance with sweet characters and adorable and heartwarming moments and charming place to come visit and experience true love over and over again."}, {"userName": "Heather B", "userReviewDate": "Jun 04, 2017", "userURL": "http://www.goodreads.com/user/show/58103373-heather-b", "userReview": "My first book by Monique McDonnell, Any Way You Build It is the 6th book in the An Upper Crust series. This was a great & fun read with some fun humor mixed in with the already great characters."}, {"userName": "Jacki", "userReviewDate": "Jan 18, 2018", "userURL": "http://www.goodreads.com/user/show/38980886-jacki", "userReview": "What I liked:The writing styleThe characters Part of a series: Upper Crust Standalone HEA I look forward to reading more from Monique McDonell."}, {"userName": "Ateereel", "userReviewDate": "Nov 01, 2017", "userURL": "http://www.goodreads.com/user/show/3649730-ateereel", "userReview": "Enjoyed reading this bookIt was an engaging read. The billionaire situation along with a kind of Cinderella story mixed in is fairy tale like but we all need that once in a while."}, {"userName": "Anita", "userReviewDate": "Apr 08, 2018", "userURL": "http://www.goodreads.com/user/show/24872107-anita", "userReview": "Loving it!Being able to read stories that show true love, and relationships building from nothing has been amazing. I can't wait to read the rest of the series."}, {"userName": "Clarissa Boggs", "userReviewDate": "Nov 17, 2017", "userURL": "http://www.goodreads.com/user/show/47572519-clarissa-boggs", "userReview": "Best book in the series I've read so far.five stars"}], "description": "When single-mother Sarah pulls up in front of the house her aunt left her she has three goals; help her kids be happy and healthy, find a job and stay away from men. The last year has been a hellish rollerc-oaster and now she needs to create a stable life where everyone, including her, has their two-feet firmly planted on the ground. What she didn’t count on was a sexy neighbour who made keeping her focus and her balance way too hard. Todd has two rules, never date locals and even more importantly never date women with kids. Growing up with his own mother and a revolving door of ineffectual step-fathers Todd has vowed never to put anyone in that position. He’s perfectly happy living his life with his Peter-pan syndrome undisturbed – until Sarah and her two adorable children move in across the street and turn everything upside down. Todd isn’t the kind of guy who can stand back when someone needs help and Sarah clearly needs a lot. When Sarah gets injured Todd has no choice to step in and be a good neighbour who lends a hand, because he’s definitely not helping her because he likes her. Opportunity, proximity and attraction mean two neighbors determined to remain single have quite a struggle on their hands. If you like tree houses, indoor camp outs and shameless flirting you’ll love Any Way You Build It.", "title": "Any Way You Build It\n      \n          (Upper Crust #6)", "url": "http://www.goodreads.com/book/show/34775743-any-way-you-build-it", "average": 4.29, "cover": "https://images.gr-assets.com/books/1491254308l/34775743.jpg", "reviews": 17, "authors": [{"url": "https://www.goodreads.com/author/show/6154665.Monique_McDonell", "name": "Monique McDonell"}], "type": ["Romance", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/34775743-any-way-you-build-it", "http://www.goodreads.com/book/show/25045423-any-way-you-slice-it", "http://www.goodreads.com/book/show/25613729-any-way-you-dream-it", "http://www.goodreads.com/book/show/16110993-hearts-afire", "http://www.goodreads.com/book/show/14761500-mr-right-and-other-mongrels", "http://www.goodreads.com/book/show/17898735-alphabet-dating"]}