{"ratings": 323, "userreviews": [{"userName": "Tasha", "userReviewDate": "Jul 21, 2014", "userURL": "http://www.goodreads.com/user/show/929521-tasha", "userReview": "The third in the Mr. Tiffin’s Classroom series, this book focuses on Elinor, a girl who just wants everything to be perfect. Unfortunately though, poetry and perfection really don’t work together no matter whether you are talking haikus, concrete poems or rhyming stanzas. A poet is going to be visiting their school and Elinor desperately wants to impress her with her poetry. But as the time goes by, the pressure builds and Elinor becomes less and less able to write poetry. When she finally does start writing, she’s not happy with any of the poems she has written. Can the kind teacher Mr. Tiffin find a way to let Elinor know that it’s OK to make mistakes? Maybe this is a job for a poet!This is a wonderful addition to an already strong series. McNamara “perfectly” captures the trap of perfectionism for students and the pressure that it builds in a person. Tying it to poetry was inspired, something that doesn’t work with tension or pressure but instead relies on inspiration and creativity. Elementary students will see themselves in both Elinor and her classmates who are more relaxed about the entire thing. Watch for the poem that ties to How Many Seeds in a Pumpkin? for fans of the series. Karas’ illustrations continue in his signature style that is playful and friendly. His drawings add to the accessibility of the entire book and the series as a whole. A winning addition to a popular series, this third book will delight during poetry units and may inspire a more relaxed approach to writing too. Appropriate for ages 6-9."}, {"userName": "Jana", "userReviewDate": "Jan 16, 2017", "userURL": "http://www.goodreads.com/user/show/4051653-jana", "userReview": "This great mentor text uses a story about a little girl struggling through the writing process to come up with a perfect poem to present to an author visiting her school for Poem In Your Pocket Day. Things at school usually come pretty easy for Elinor. But has she and the other students in Mr. Tiffin's class study poetry in anticipation of a visit from Emmy Crane, a famous poet, she stresses out because she can't write a perfect poem to put in her pocket. This would be great to share with students during National Poetry Month in April."}, {"userName": "Sara Grochowski", "userReviewDate": "Aug 17, 2014", "userURL": "http://www.goodreads.com/user/show/2530658-sara-grochowski", "userReview": "Elinor can't wait to meet Emmy Crane, a visiting poet, but her excitement wanes when she has trouble writing the perfect poem. A Poem in Your Pocket is a wonderful story about poetry and creativity in which one student must learn to let go of perfection to find the poem in her heart. This read aloud will fit seamlessly into Poetry Month lesson plans and discussion, but its themes about creativity make it appropriate for any time of year!"}, {"userName": "Abby Shoe", "userReviewDate": "Apr 18, 2016", "userURL": "http://www.goodreads.com/user/show/52051966-abby-shoe", "userReview": "Synthesis:A Poem in Your Pocket is a beautiful children's literature text that focuses on the topic of poems. Elinor is a student in Mr. Tiffin's class who is intent on writing the best poem ever! The night before \"Poem in Your Pocket\" day at her school where a real poet is going to be visiting, Elinor becomes so obsessed with writing the PERFECT poem that she doesn't even have one prepared to share with the rest of the school. The the poet asks her to share her poem, she beautifully shares the poem from her mind that she had not rehearsed just simply felt. Ways for Classroom Use:This piece of literature would be a wonderful read aloud for a k-3 class learning about poems. Different types of poetry- haikus, metaphors, and similes- are all mentioned with examples from students in the text. While the students are learning about the need for creativity and raw emotion when writing a poem, they are also informed of different forms of poetry. I think that it would also be fun to incorporate a \"Poem in Your Pocket\" day in my future classroom as well! This text has a great message as well.Why This is a WOW Book:A Poem in Your Pocket (Mr. Tiffin's Classroom Series) is a WOW book for me because of the beautiful and honest message that it sends. Poetry is a raw form of literature. Poetry is honest, sometimes happy and sometimes sad, but always honest. I loved watching the progression of Elinor's struggles and final triumph as she spoke a beautiful, thoughtful poem that can directly from her mind in front of the entire school. I love the idea of \"a Poem in Your Pocket Day\" and I will definitely implement it into my future classroom during literacy."}, {"userName": "Mary Ann", "userReviewDate": "Apr 12, 2015", "userURL": "http://www.goodreads.com/user/show/1610575-mary-ann", "userReview": "Poetry encourages us to see the world through a different lens, slowing down to notice small details. But how do you encourage a child who's feeling absolutely stuck, unable to let go enough to trust their own \"poet's eye\"? This delightful new picture book offers a gentle lesson on how a special teacher and a visiting poet did just that.I adore this story, for its message that poetry begins in the heart, and for the way it shows how we all need to be kind and not judge our own attempts too harshly. Brian Karas's illustrations add gentle warmth throughout. I especially love the way he shows poet Emmy Crane as an African American woman, incorporating subtle affirmation of the diversity of our classrooms, students and authors.See my full review: Great Kid Books"}, {"userName": "Samantha", "userReviewDate": "Feb 03, 2015", "userURL": "http://www.goodreads.com/user/show/1380067-samantha", "userReview": "A class prepares for an author visit to celebrate National Poetry Month and Poem in Your Pocket Day by learning to write several types of poems. One little girl struggles with expressing herself accurately in a poetic form and finds that a talk with the visiting author helps her organize her thoughts and feelings into an artful expression at last.Love the inclusion of different types of poetry, love the way the problem and solution are handled, love the diversity present in the gouache, acrylic, and pencil illustrations, and love the back matter (Elinor;s Poetry Page of tips and Mr. Tiffin's Pointers).Highly recommended for classroom use, especially during a poetry unit with grades 2-4."}, {"userName": "Kathleen", "userReviewDate": "Jun 19, 2015", "userURL": "http://www.goodreads.com/user/show/41810523-kathleen", "userReview": "During the month of April (National Poetry Month) the young students in Mr. Tiffin’s class are getting lots of experience with poetry. The children learn about similes and metaphors, as well as different types of poems. As the students in the book learn about them, the reader also learns because examples of students’ work are woven into the story in this picture book. We read Haiku, Acrostic, Concrete and Funny poems that were written by the children in the story. At the end of the book, a poet visits Mr. Tiffin’s class and helps the children understand that poetry is really about writing from the heart. The words don’t have to rhyme and they don’t have to be perfect. This is a very sweet book, and would be a great way to introduce a poetry unit in a primary classroom."}, {"userName": "Jill", "userReviewDate": "Nov 09, 2015", "userURL": "http://www.goodreads.com/user/show/763923-jill", "userReview": "This is a really great book about poetry w/ really nice and fun examples. Also shows how sometimes, the harder you try at something, the more elusive it becomes. Great for the ECRR category \"write,\" but it is better for kids older than the target age for a CLEL bell award."}, {"userName": "Alice", "userReviewDate": "Oct 05, 2015", "userURL": "http://www.goodreads.com/user/show/5756197-alice", "userReview": "A very nice book about Poetry. In April we should do \"poem in your pocket day\" This book talks about all sorts of poems what I poem can be..like it doesn't always have to rhyme. Me personally my favorite types of poems are the Acrostic and the Concrete! Fun ways to make poetry not a drag!"}, {"userName": "Kate Hastings", "userReviewDate": "Jul 13, 2015", "userURL": "http://www.goodreads.com/user/show/107746-kate-hastings", "userReview": "Grades 2-5. Great mentor text for poetry unit. Defines simile and metaphor, shows concrete, haiku, and acrostic forms. Defines poetry and gives ideas for writing poems. Great book for a mini-lesson or writers workshop."}, {"userName": "Marissa Kiddey", "userReviewDate": "Mar 18, 2018", "userURL": "http://www.goodreads.com/user/show/76498224-marissa-kiddey", "userReview": "A poem in your pocket is a good start off for a poetry section in the classroom. It shows how the student goes through anxiety when it comes to schoolwork or something they care deeply for. This book even outlined a few simple types of poems that could be pertinent to your classroom."}, {"userName": "Ro", "userReviewDate": "Jun 02, 2018", "userURL": "http://www.goodreads.com/user/show/4678429-ro", "userReview": "This is a spot-on story to generate interest in poetry; learning about the variety, reading and writing it. As the title lets us know, it also introduces the poets.org celebration Poem In Your Pocket Day. Share this story in March to get ready for National Poetry Month in April!"}, {"userName": "Donna Smith", "userReviewDate": "Oct 21, 2017", "userURL": "http://www.goodreads.com/user/show/13085685-donna-smith", "userReview": "A fun children's book that can be used by middle or even high school English classes to give students examples of types and elements of poetry including the metaphor, simile, haiku, acrostic, concrete, and funny poems."}, {"userName": "Natalie", "userReviewDate": "Oct 19, 2016", "userURL": "http://www.goodreads.com/user/show/60660305-natalie", "userReview": "This book was alright. I really enjoyed the pictures but yet I felt like there was too much going on the page and distracted from the words. It had a good story line, and trying to get kids to enjoy poetry a little bit more. Teacher could use this book for an introduction to poetry, but I feel there could be more to the story or changed some way to have it more interesting and want to buy it for ones self."}, {"userName": "Brooke Seidel", "userReviewDate": "Oct 12, 2015", "userURL": "http://www.goodreads.com/user/show/46854437-brooke-seidel", "userReview": "Title: A Poem in Your Pocket Author: Margaret McNamara Illustrator: Margaret McNamara Genre: Book of poems or poetry collection Theme(s): Introducing poetry to childrenOpening line/sentence: Elinor is a perfectionist. She loves school and takes her assignments very seriously.Brief Book Summary: Students are having someone who writes poems come talk to them. They are talking about the poet while they are making rhymes. To prepare for the poet, the children are learning about literary elements to use in their poetry. At the end, the students share their poetry and new poetry skills that they have learned. Professional Recommendation/Review #1: Children's Literature - Carol WolfenbargerIn this story, a poet visited a school to share her love of poetry with the students, and her visit inspired “Poem in Your Pocket Day.” An over-achiever, Elinor, announces that she will wear jeans with six pockets on the day of the poet’s visit and that she will have an original poem is each of the pockets, making six original poems in all. Elinor and her classmates will have the month before the visit to read poetry and find inspiration to write their own poems. Readers will see that Elinor puts herself under pressure to write the best poem, but she cannot seem to write the perfect poem. On the day of the poet’s visit Elinor has to admit that she has no poem in the one pocket of the dress she’s decided to wear. Emmy Crane, the fictional poet, recognizes Elinor’s embarrassment. With gentle encouragement, Emmy helps Elinor assemble her ideas into a poem. The book concludes with Margaret McNamara’s suggestions when trying to put one’s own thoughts into a poem. Poem in Your Pocket will be a useful in classrooms to inspire students to write poetry. Reviewer: Carol Wolfenbarger; Ages 5 to 8.Professional Recommendation/Review #2: School Library Journal 12/01/2014Gr 1–3—Elinor is a perfectionist. She loves school and takes her assignments very seriously. For Poetry Month, Mr. Tiffin teaches his class about different kinds of poetry, similes, and metaphors. Anticipating an upcoming author visit by a real poet, students are asked to write a poem and put it in their pocket. Elinor plans to wear her jeans with many pockets so she can have one in every pocket, but her obsession with perfection impedes her creativity. On the day of the visit, the child has not created anything that she considers good enough to share. When the guest asks her to read her poem, Elinor reveals that she \"has a poem in the pocket of her mind.\" When she recites it, her words flow beautifully. This is a great book to share during National Poetry Month. Brief explanations are given for the more common poetry forms and the idea of a \"Poem in Your Pocket Day\" is inspiring. Pair this book with the works of Shel Silverstein, Paul B. Janeczko, Jack Prelutsky, Douglas Florian, or Robert Louis Stevenson, among others, to make a persuasive unit on the delights of the genre. Colorful illustrations of a busy classroom filled with enthusiastic students and a determined child keep the subject light and humorous. This title shines a light on a subject worthy of discussion.—Mary Hazelton, formerly at Warren & Waldoboro Elementary Schools, MEResponse to Two Professional Reviews: Both reviews state how this book will encourage and influence children to write poetry and be fond of poetry. This book is inspiring to young poets and will allow students to be enthusiastic about writing poetry. This book will motivate students. Evaluation of Literary Elements: There are similes and rhymes. For example, “math is like a knot”. They are also introducing metaphors. Consideration of Instructional Application: After reading the story to children have them independently write down their initial thoughts on poetry. Do you think poems seem hard and scary? Do you think poetry seems fun? Have you ever read a poem? Have you ever written a poem?"}, {"userName": "Alex (not a dude) Baugh", "userReviewDate": "Mar 31, 2015", "userURL": "http://www.goodreads.com/user/show/4449236-alex-not-a-dude-baugh", "userReview": "April is National Poetry Month and what better way to start the month than with a picture book about poetry. And Margaret McNamara's third book about Mr. Tiffin and his students is definitely up to the task.All through April, Mr. Tiffin's class is going to learn all about poems in preparation for poem in you pocket day and a author visit from a well known poet, Emmy Crane. But Elinor has spent all of March at the library studying poetry. so now she has all the answers when it comes things like similes, metaphors concrete poems, haiku, acoustic poems.But when Mr. Tiffin takes the class out for a walk to practice using their poet's eyes, the kids in Elinor's class all seem to be able to see the poetry around them except Elinor. And when brings brown bags with surprises in them for everyone and asks each student to write a poem about what's in their bag, Elinor just can't seem to get one written. Her poetry journal is blank.Over the weekend, Elinor writes poem after poem, but none are good enough as far as she is concerned. Finally, on Poem in Your Pocket Day, Elinor goes to school with an empty pocket. In assembly, Emmy Crane reads some to her own poetry to the children, and each child reads their poem to her. But when its Elinor's turn, she courageously goes up on the stage and confesses to Emmy that she has no poem, none were perfect enough for a poet like her. No poem is perfect, Emmy tells her, but can she help Elinor find her poet's eye?A Poem in Your Pocket is an ideal book for introducing young readers and writers about poetry, a subject that is so often overlooked in schools these days. It is a wonderful read aloud as well as a great teaching tool. McNamars's definitions of the different poetic terms used are simply defined making that aptly suited for young children just starting their poetic life. I loved the walk Mr. Tiffin took the kids on to discover the poetry in the things that they see everyday but probably don't think much about. Added to this wonderful book are Karas's gouache, acrylic and pencil sometimes full page, sometimes spot illustrations, adding to and enhancing the story. He really captures Elinor's frustration and despair, along with the eagerness with which the other kids in the class embraced poetry. I really liked that Mr. Tiffin's class was portrayed as very diverse. I thought this was going to be a story about a girl who just wasn't terribly poetic. Instead it was about how we all have a poet's eye and that there is no such thing as a perfect poem. Of course, the underlying message is about how the need to be or do something perfectly results in being completely unproductive because nothing measures up. And bravo for the portrayal of a caring teacher and poet who both gently showed Elinor what's important.A Poem in Your Pocket is a book not to be missed.This book is recommended for readers age 5+This book was borrowed from a friendRemember - Poem in Your Pocket Day is Thursday, April 30, 2015This review was originally posted on Randomly Reading"}, {"userName": "Margie", "userReviewDate": "Apr 18, 2015", "userURL": "http://www.goodreads.com/user/show/5281649-margie", "userReview": "When you reach into your pocket forgotten treasures may be discovered. Depending on the owner of the clothing these tokens represent captured memories; a perfectly round pebble or a bit of sea glass, coins left over from a recent purchase, an old movie theater ticket, a handful of acorns or a dog treat. Unless this attire is worn on a daily basis the locating of a lost item is cause for rejoicing. In twenty days, all around the United States (maybe the world), people will be purposefully placing something of importance in pockets. Poem in Your Pocket Day will be celebrated on April 30, 2015. Newly released this year A Poem in Your Pocket (Schwartz & Wade Books, an imprint of Random House Children's Books, January 27, 2015) written by Margaret McNamara with illustrations by G. Brian Karas takes us back for a visit with Mr. Tiffin and his students (How Many Seeds in a Pumpkin? and The Apple Orchard Riddle). My full recommendation: http://librariansquest.blogspot.com/2..."}, {"userName": "Nancy", "userReviewDate": "Mar 09, 2015", "userURL": "http://www.goodreads.com/user/show/6147556-nancy", "userReview": "I enjoyed this children's book. It told of a class, who were learning how to write poetry, in preparation for the visit from an author of poetry. One little girl is afraid to read or show her work. She wants everything to be perfect. She study's and works really hard, but she throws her work away. They are taught about different kinds of poetry. The rest of the class presented their poems for the author, and Elinor says she doesn't have a poem. The author has her come up on the stage, and asks her questions. She has her close her eyes, and asks her to tell her thoughts about what she had wanted to write. She told her she had told her a poem, and talked about having a pocket in your mind. April is the time for school to celebrate A Poem in Your Pocket. That is such a good idea."}, {"userName": "Cindy", "userReviewDate": "Apr 18, 2015", "userURL": "http://www.goodreads.com/user/show/1106686-cindy", "userReview": "\"Usher in National Poetry Month with Mr. Tiffin and his students, stars of the hugely popular How Many Seeds in a Pumpkin? and The Apple Orchard Riddle. Once again, Margaret McNamara sets her playful, child-friendly story in the classroom, and this time, poetry—from metaphors to acrostics to haiku—is the name of the game. The focus here is on Elinor, whose confidence falters as she tries to write something \"perfect\" for Poem in Your Pocket Day and impress a visiting poet. G. Brian Karas's accessible, adorable illustrations add to the fun.Includes a list of Mr. Tiffin's tips for celebrating Poem in Your Pocket Day.\" AmazonLibrary Use: A perfect book to introduce poetry to students. The best two pages are the last two which would make an excellent anchor chart for poetry rules. Themes: poetry, schools, authorship, self-confidence."}, {"userName": "Lynne", "userReviewDate": "Feb 14, 2015", "userURL": "http://www.goodreads.com/user/show/1324789-lynne", "userReview": "Mr. Triffin and his students are excited because they have an author coming to visit. She is a poet and the kids are studying poetry and writing poems in preparation for \"Poem in Your Pocket\" day and her visit. Everyone expects Elinor will have a wonderful poem because she is always the best student. Elinor starts out eager and aiming to wear her pants with lots of pockets so she can fill each pocket with a poem she wrote. She is working hard and struggling to write the perfect poem. And that's where the problem comes. She's trying so hard that she can't seem to write anything.This is a great story for school age children. I would have been eager to use this with my high school students as they wrote and struggled to get that right word, that perfect sentence or line. I will be sharing this book often."}, {"userName": "Lori Gravley", "userReviewDate": "Jan 28, 2016", "userURL": "http://www.goodreads.com/user/show/16570889-lori-gravley", "userReview": "\"Elinor is a library,\" said Tara, \"filled with silence.\"Elinor, the perfectionist poet (I can relate) of this book tries very hard to write a perfect poem for the poet who is coming to visit, but nothing she writes is good enough, until she speaks from the heart about all she's seen and heard. At one point, Mr. Tiffin reminds his students that \"poetry is a messy business.\" It is, but one made less messy by the permisison to make mistakes that this book offers. This is a great book for April, but poetry shouldn't be relegated just to April. Read this book aloud anytime to remind students that making mistakes and not getting it just right are things that all writers struggle with. Give them permission to want to it to be perfect and permission to be imperfect."}, {"userName": "Dione Basseri", "userReviewDate": "Jul 14, 2016", "userURL": "http://www.goodreads.com/user/show/13970278-dione-basseri", "userReview": "I appreciate the look at different types of poems in this book. Traditional rhyming, free-form, shaped poems, haiku. And even stream-of consciousness, as we get at the very end.It's also nice to see a look at what something creative like poetry can do to a perfectionist. A young girl is determined to show a visiting poet her perfect poem, but she can barely go a few hours without deciding her old work is terrible. Something all writers can identify with.While this may work as an introduction to a poetry unit for perhaps a first or second grade class, it doesn't seem interesting enough to be included in a private household's collection. If you'd like to try it, your library likely has a copy. If they don't, it's no big loss."}, {"userName": "Brenda", "userReviewDate": "Feb 09, 2015", "userURL": "http://www.goodreads.com/user/show/4796411-brenda", "userReview": "A Poem in Your Pocket by Margaret McNamara and G. Brian Karas shares life in classroom that seems real to me. Let me know what you think after you've read it. Have you ever wanted to do something so much and you want it to be so good and so perfect that you can't do it at all? Since it's impossible to be perfect, nothing ends up being good enough. That's what happens to Elinor in Mr. Tiffin's class. The class is learning all about poetry and preparing for the day when Emmy Crane, a famous poet, will come to share her poetry with the school and to hear the original poems written by Mr. Tiffin's class. Elinor tries to create a poem but nothing is right all the way through to the visit. Read it to find out how the story ends"}, {"userName": "Martha", "userReviewDate": "Apr 19, 2015", "userURL": "http://www.goodreads.com/user/show/8507616-martha", "userReview": "Poem in your Pocket Day is celebrated in the third week of April, during Poetry Month. The story of young perfectionist Elinor trying to create a poem to present to a famous poet Emily Crane during an author visit, is suspenseful and packed with great writing tips. With G. Brian Karas lovely whimsical gouache, acrylic, and pencil illustrations of Mr. Tiffin's warm classroom setting, teachers will be able to find clear examples of how to write a metaphor, simile, and examples of poems, in a variety of formats in the text. The idea of a Poetry Pocket Day is a terrific idea for inspiring kids to express themselves poetically with \"words from the heart, and words from the heart are where poetry begins,\" as Emily Crane explains to Elinor, who listens to her gratefully."}, {"userName": "Susan", "userReviewDate": "Apr 06, 2015", "userURL": "http://www.goodreads.com/user/show/40338278-susan", "userReview": "This book clearly introduced and explained poetry as well as similes, metaphors, haiku, acrostic, concrete, and funny poems. Therefore the book would be either a good introduction to or review of a poetry unit for young learners. In addition the main character known as Elinor provided a good example of someone trying too hard to be perfect or at least first when it is not always the best or even necessary. The important terms and lesson were presented by the author and illustrator in a fun, easy manner and accompanied by brightly colored illustrations that clearly supported or extended the text. The package as a whole should encourage a love of poetry and support an individual's freedom to be creative. I highly recommend this book."}, {"userName": "Clare Rossetter", "userReviewDate": "Oct 26, 2015", "userURL": "http://www.goodreads.com/user/show/34371686-clare-rossetter", "userReview": "Well written story of a little girl named Elinor who works very hard for months to get ready for the visit of a poet to her school. She just can't seem to write a poem for poem in your pocket day. On the big day she still has nothing written and feels she is doomed but the poet shows her how a poem is created. Elinor is not only relieved by the kindness but is able to understand how not all poems are written. The illustrations are simple and often there as a backdrop for the text. Great text for introducing poem such as Keep a Poem in Your Pocket which can be a fun way to do poetry in class."}, {"userName": "Susan", "userReviewDate": "May 23, 2016", "userURL": "http://www.goodreads.com/user/show/10949071-susan", "userReview": "Elinor is excited to know that a poet is coming to the school for Poem in Your Pocket day. She and her classmates learn all about poetry and figurative language. They learn about the different types of poems and how to write them. The big day comes but Elinor is struggling with her poem, because it is not perfect. She needs some help. Luckily the author is there to help her. This is a great book to use during the teaching of poetry. It would be a good introduction to a poetry unit."}, {"userName": "Stephanie Croaning", "userReviewDate": "May 07, 2015", "userURL": "http://www.goodreads.com/user/show/20627290-stephanie-croaning", "userReview": "April is National Poetry Month and this book would make an excellent read aloud to kick off the month. It can be used to help clarify the difference between metaphors and similes (there are plenty to identify throughout the text) and it teaches a great story about how poetry starts with what you feel in your heart. All schools should have a Poem in Your Pocket Day during April. There are even some good ideas about how to celebrate and organize such a day in your own school."}, {"userName": "Kristen", "userReviewDate": "Feb 29, 2016", "userURL": "http://www.goodreads.com/user/show/139875-kristen", "userReview": "This book totally inspired me. There's so much I could do with it and my students. Great introduction before an author visit, or a great actual \"Poem in your Pocket\" day where students share the poems they've been working on and wear clothes with pockets to store them. Also has good information about getting ideas to write, what to do when you're stuck, and can spark discussion about the writing process itself. Great book!"}, {"userName": "Skye Bryant", "userReviewDate": "Jul 26, 2015", "userURL": "http://www.goodreads.com/user/show/16911466-skye-bryant", "userReview": "\"Words from the heart are where poetry begins.\" This book is a must-read for any teacher trying to teach poetry. And it approaches the subject in a gentle and fun way. Poetry is shown as something that not only takes time and patience, but also can take many forms. The forms shown are from hyberbole to metaphor to simile to haiku. Just remember, in the words of Mr Tiffin \"Poetry is a messy business.\""}], "description": "Usher in National Poetry Month with Mr. Tiffin and his students, stars of the hugely popular How Many Seeds in a Pumpkin? and The Apple Orchard Riddle. Once again, Margaret McNamara sets her playful, child-friendly story in the classroom, and this time, poetry—from metaphors to acrostics to haiku—is the name of the game. The focus here is on Elinor, whose confidence falters as she tries to write something \"perfect\" for Poem in Your Pocket Day and impress a visiting poet. G. Brian Karas's accessible, adorable illustrations add to the fun.Includes a list of Mr. Tiffin's tips for celebrating Poem in Your Pocket Day.\"A nimble introduction to poetry as well as a sensitive look at the perils of perfectionism.\" —The New York Times\"Pair this book with the works of Shel Silverstein, Paul B. Janeczko, Jack Prelutsky, Douglas Florian, or Robert Louis Stevenson.\" —School Library Journal, Starred", "title": "A Poem in Your Pocket\n      \n          (Mr. Tiffin's Classroom)", "url": "https://www.goodreads.com/book/show/22237003-a-poem-in-your-pocket", "average": 3.94, "cover": "https://images.gr-assets.com/books/1404962073l/22237003.jpg", "reviews": 88, "authors": [{"url": "https://www.goodreads.com/author/show/135113.Margaret_McNamara", "name": "Margaret McNamara"}, {"url": "https://www.goodreads.com/author/show/167891.G_Brian_Karas", "name": "G. Brian Karas"}], "type": ["Poetry", "Childrens", "Academic", "Language", "Childrens"], "outlinks": ["http://www.goodreads.com/book/show/22237003-a-poem-in-your-pocket", "http://www.goodreads.com/book/show/22856263-a-poem-in-your-pocket", "http://www.goodreads.com/book/show/22237004-a-poem-in-your-pocket", "http://www.goodreads.com/book/show/1873420.How_Many_Seeds_in_a_Pumpkin_", "http://www.goodreads.com/book/show/10475205-the-three-little-aliens-and-the-big-bad-robot", "http://www.goodreads.com/book/show/12186326-george-washington-s-birthday", "http://www.goodreads.com/book/show/14823888-the-apple-orchard-riddle", "http://www.goodreads.com/book/show/16065637-sylva-and-the-fairy-ball"]}