{"ratings": 1193, "userreviews": [{"userName": "Kate", "userReviewDate": "Aug 27, 2011", "userURL": "http://www.goodreads.com/user/show/4732601-kate", "userReview": "I turned to the back of the book to read the author's credentials, expecting the usual Oxbridge/Ivy League pedigree and litany of awards. Instead I was shocked to learn that Marc Bloch had been tortured and killed by Nazis. Here was a historian who joined the French Resistance rather than escape while he could. He penned this meditation on the nature of history as a Jew in occupied France, without the aid of an academic library. Wow. It would be impossible not to respect Marc Bloch. Though this book isn't perfect, it is amazing that it even exists.There is much to say about the work. As a literature- and material culture-loving type of history grad student, I especially appreciated the value Bloch put on sources beyond documents found in archives. He incorporated place names, old words, objects, and the built environment into his historical analyses. He questioned things like thinking of historical eras in terms of centuries (or really trying to divide up discrete eras to begin with). He considers how a historian evaluates sources and the various falsehoods that can creep into them. The Historian's Craft is an artifact of its own time, as one can tell from some of Bloch's post-positivist, not-exactly-Marxist, yet pre-post-structuralist [?] ideas and ways of framing them. [Edit: I've since learned about the Annales School that he was part of. Makes sense now]. The prose style is quite florid, filled with analogies and metaphors, unlike most historical writing today. Then there's the subtitle: \"...History...and the Men who Write It.\" So, yes, it's dated in certain ways.Still. This book is well worth reading and considering."}, {"userName": "Pat", "userReviewDate": "Jun 13, 2016", "userURL": "http://www.goodreads.com/user/show/37797281-pat", "userReview": "“Le cause in storia non si suppongono. Si cercano” .Bloch sospese la stesura di “Apologia della storia” per unirsi al movimento di Resistenza Franc-tireur, scelta che gli costò la fucilazione per mano dei nazisti il 16 giugno 1944.Il libro uscì, incompiuto, nel 1949 grazie al suo amico e compagno di studi Lucien Febvre.Cos’è la Storia? Bloch afferma che è la scienza degli uomini nel tempo. “Lo storico non pensa solo \"umano\". L'aria in cui il suo pensiero naturalmente respira è la categoria della durata.”Dunque, in che modo lo storico deve indagare il passato per restituire ai contemporanei la memoria dell’umanità?Il buon storico somiglia all'orco delle fiabe: là dove fiuta carne umana, egli sa che è là che si trova la sua preda.Compito dello storico è analizzare criticamente fonti documentarie e narrative individuando inesattezze e falsità, che fra tutti i “veleni in grado di viziare una testimonianza” è il più potente; suo compito è ragionare sulla scelta delle testimonianze, sul metodo di ricerca e lavoro, sullo studio degli accadimenti e degli uomini; suo compito è ancora lavorare con onestà intellettuale per riconsegnare ai posteri la Storia scevra da ideologie e strumentalizzazioni.Tante, tante le domande e le riflessioni in quest’opera interrotta drammaticamente dalla Storia, che rimane testo fondamentale per storici e non.Conoscere il passato per comprendere il presente, perché “L'incomprensione del presente nasce fatalmente dall'ignoranza del passato”. Ecco il grande insegnamento di Bloch."}, {"userName": "Nelson", "userReviewDate": "Dec 26, 2010", "userURL": "http://www.goodreads.com/user/show/4578245-nelson", "userReview": "Someone should write a book about people writing books away from their libraries. A passel of them owing to war, WWII in this case (and, I think, in the case of Auerbach's Mimesis); others to distance or remote location (Empson in China). There is something ballsy about saying 'here's my opus--I wrote it from memory since the Nazis blew up my books, the indigenous population cooked them in a stew, the sherpa dropped them in a crevasse...' Anyhoo. Bloch's book is a more elegant, less systematic version of David Hackett Fischer's indispensable Historians' Fallacies. There are some lovely passages here on the historical enterprise, larded with much wisdom about perspective, language, sources and so on. I do wonder how much of the style is owing to the interventions of Lucien Febvre, who rescued the manuscripts on which the text is based, or the English translator Peter Putnam. French medievalists, or just medievalists in general, ought to have a go at this, since most of Bloch's illustrative anecdotes derive from his own historiographical practice. It ends rather abruptly, and the penultimate chapter on Historical Analysis is less polished than the previous three. Nevertheless, worthwhile."}, {"userName": "Mark Bowles", "userReviewDate": "Aug 30, 2014", "userURL": "http://www.goodreads.com/user/show/30797551-mark-bowles", "userReview": "* Introduction* What is the use of history? What is the legitimacy of history?* There is an entertainment value to history* History can help to integrate fragments of knowledge into a unified whole, synthesis* History, Men and Time: This chapter defines history* This book accepts a broad interpretation of the word history--inquiry* The object or history or inquiry is man* History is further defined by calling it the study of men in time* The present effects the knowledge of the past, as does the past influence the present* Thus, history is the study of men in time from the past to the present* Historical Observation* Historians cannot directly observe what they study. They look through others eyes* But, history does leave behind traces which the historian can observe directly* As our methods improve we can better see the past--ex. archeology* The most difficult task is to assemble the evidence of the past (documents)* Historical Criticism* Not all documentary evidence is truthful* Criticism of documents in archives began in 1681* One type of bad evidence is fraud or forgery. This can lead to positive evidence when the motive behind the forgery is discovered.* A second type of bad evidence is a slight misrepresentation of the facts (a bias).* In order for an error to become accepted as historical truth it must fit with social conscious (it must sound plausible)* We can critically accept documents by how well they \"fit in\" with other documents of its particular time period. Ex. if a 10th century document were written on paper and all others were written on parchment, it is likely that the paper document is a fraud* This is critical comparison. It can either accept of deny the authenticity of a document by comparing it to its time period.* The majority of the problems of historical criticism are actually problems of probability. Ex. what is the likelihood that the document is correct.* Historical Analysis* Should historians attempt to merely understand or should they judge what they study? To judge something we impose our own value system on the past. Thus, the goal of the historian is understanding* Analysis requires a language to accurately describe the facts. The problem is that language meaning has changed throughout time. Thus, the vocabulary of documents itself is another form of evidence.* Periodization is another tool for analysis. Centuries are given a variety of attributes that help describe those who lived in that time. Yet, human time will never correspond directly with clock time. (centuries do not philosophically begin in xx01) * Historical Causation: why did an event happen?* The most recent antecedent is usually defined as the cause of an event (ex. a man falls off a cliff. Gravity or the slope of the mountain is not blamed, his misstep is.)* Causes are not to be assumed. They are to be looked for..."}, {"userName": "Domenico", "userReviewDate": "Jan 21, 2017", "userURL": "http://www.goodreads.com/user/show/32554109-domenico", "userReview": "Il famoso saggio di Bloch, sul quale si sono formate generazioni di studenti, esamina il problema spinoso della ricerca storica e dei suoi metodi. Una buona ricerca non deve solo prendere in esame il passato, ma anche il presente da cui prendere le mosse. Nell'analisi di un'epoca storica è opportuno spostarsi dal passato verso il presente o viceversa? Per il grande storico francese sarebbe meglio procedere a ritroso, dal più conosciuto al meno conosciuto, onde evitare che, procedendo al contrario (ossia dal passato verso il presente), si incorra in quella malattia cui erano affetti tutti gli storici dell'antichità: quella dell'ossessione delle origini. Quando lo storico pretende di fare ricerca storica rintracciando le origini, rischia di pregiudicare tutto il suo lavoro: cosa fa lo storico in questo caso, se non cercare di spiegare tutta la storia da quel punto zero arbitrariamente rintracciato? In questo saggio appassionante Bloch parla anche delle fonti che ogni storico dovrebbe tenere in considerazione e del processo dinamico, e non statico, di narrativizzazione di tali fonti. Il documento e la fonte non sono di per sé eloquenti se lo storico non le riesce a farle \"parlare\". La bravura dello storico sta nell’interrogarle correttamente. E a quali fonti bisognerebbe prestare fede? Ai racconti di uno Svetonio o a degli utensili ritrovati all'interno di un sepolcro funebre? Qui lo storico allude alla distinzione tra fonti intenzionali, e quindi più soggette a distorsioni prospettiche di ogni tipo da parte di autori che vogliono dare una certa immagine di sé ai posteri, e fonti preterintenzionali, ossia quelle tracce di vita quotidiana lasciate senza alcuna intenzione, di per sé più neutre e vere regine nel testimoniare le epoche che furono. Opera geniale."}, {"userName": "Marc", "userReviewDate": "Aug 31, 2015", "userURL": "http://www.goodreads.com/user/show/2876105-marc", "userReview": "Deze Nederlandse editie van Marc Bloch’s Apologie pour l’Histoire is uitzonderlijk, vooral omdat het een grondig aangepaste teksteditie is, voorzien van een degelijke inleiding en begeleid door een notenapparaat dat onduidelijkheden toelicht en stellingen van Bloch in zijn context zet en met bibliografische verwijzingen ondersteunt; tenslotte zijn ook nog aanvullende teksten van Lucien Febvre en Bloch zelf toegevoegd. Ik was enkele maanden geleden al eens begonnen aan een oude Franse editie, maar kreeg me er niet doorheen geworsteld. Dat heeft alles te maken met het onvoltooide karakter van de tekst (Bloch werd door de Nazi’s geëxecuteerd in 1944 terwijl het boek nog niet af was), maar ook met Bloch’s nogal redeneerstijl, voortdurend slingerend tussen algemene stellingen en concrete voorbeelden, zonder veel systematiek. In de Nederlandse vertaling en met de begeleidende noten kwam de tekst veel beter tot zijn recht. Een dikke pluim dus voor vertaalster en tekstbezorger Marleen Wessel. Inhoudelijk heeft de tekst van Bloch niet zo erg veel te bieden: het is – zoals de titel zegt – inderdaad een pleidooi voor geschiedschrijving als métier, als ambacht, met zijn sterke en zijn zwakke kanten. Dit lijkt te suggereren dat Bloch geschiedschrijving helemaal niet als wetenschap zag, maar dat is een brug te ver, Bloch raakt die problematiek wel aan maar blijft eerder vaag. Hij voert in elk geval aan dat geschiedschrijving een heel jong vak is dat nog volop in ontwikkeling is en bovendien handelt in de moeilijkste materie die maar denkbaar is, namelijk het menselijke handelen. Dit boek is door het martelaarschap van Bloch omgeven met een aureool van heiligheid onder historici; voor mij stelde het toch wel wat teleur."}, {"userName": "Tessa", "userReviewDate": "Apr 11, 2008", "userURL": "http://www.goodreads.com/user/show/1058002-tessa", "userReview": "Marc Bloch is one of my new heroes. The incredible thing about this book is that he wrote about the role of the historian completely without the aid of sources--and it's soooo good. He had his teaching license and books taken away by the Nazis, and later he was killed by one of their firing squads outside of Lyon, France, for his involvement in the French Resistance."}, {"userName": "Dan Beaver", "userReviewDate": "Feb 24, 2014", "userURL": "http://www.goodreads.com/user/show/8240466-dan-beaver", "userReview": "Second reading of this book; placed here because I really don't remember when I read it first.This is a remarkable little book that should be read by anyone in the social sciences since the methodology transcends."}, {"userName": "Sara", "userReviewDate": "Sep 20, 2014", "userURL": "http://www.goodreads.com/user/show/22686309-sara", "userReview": "Read for school."}, {"userName": "DoctorM", "userReviewDate": "Mar 25, 2011", "userURL": "http://www.goodreads.com/user/show/175916-doctorm", "userReview": "A 20th-c. classic, and a book that's been on my shelves since I was an undergraduate. A fine read by a fine scholar, and essential reading for anyone preparing to do History as a profession."}, {"userName": "Mariana", "userReviewDate": "Jan 12, 2017", "userURL": "http://www.goodreads.com/user/show/28048435-mariana", "userReview": "Muy interesante."}, {"userName": "Marta", "userReviewDate": "Jan 09, 2015", "userURL": "http://www.goodreads.com/user/show/3883215-marta", "userReview": "This is the best book on historiography that I've ever read. So good. I kept muttering \"yes! yes!\" to myself while reading."}, {"userName": "Marcelo Melo", "userReviewDate": "Sep 23, 2013", "userURL": "http://www.goodreads.com/user/show/16297140-marcelo-melo", "userReview": "Figura no melhor que me já chegou às mãos."}, {"userName": "Eduardo", "userReviewDate": "Jun 26, 2017", "userURL": "http://www.goodreads.com/user/show/6038892-eduardo", "userReview": "Pienso que este libro lo escribió Bloch teniendo en mente a los estudiantes universitarios franceses de nivel superior, los suyos también, que planeaban convertirse en historiadores profesionales. Hay pasajes del texto, sin embargo, que se vuelven bastante esotéricos, como si Bloch se olvidara de los estudiantes y estuviera conversando consigo mismo, o con otros eruditos. También pueden deberse estos fragmentos algo enredados –al menos para mí– a las condiciones en que escribió el grueso de su apología, creo que en la prisión, guiándose por su memoria, sin fuente ninguna, mientras esperaba su destino, que fue la muerte por fusilamiento. La última frase de su libro comienza así: “Se buscan...” [Elles se cherchent...]¿Para qué sirve la historia?, se pregunta Bloch en la primera línea de su ensayo. Éstas son sus respuestas: — distrae (“indiscutible atractivo de la historia”)— nos ayuda a vivir mejor (“está destinada a trabajar en provecho del hombre, ya que tiene como tema de estudio al hombre y sus actos”)— nos provee de un conocimiento dinámico (es “una ciencia en marcha”)— contribuye a la dialéctica de la sociedad humana (el historiar es un “auténtico problema de acción”)— capta lo vital de la sociedad humana (“Esta facultad de captar lo vivo es, en efecto, la cualidad dominante del historiador”)— para unir el estudio de los muertos con la ciencia de los vivos— para abrir una nueva ruta hacia la verdad y la justicia (“gracias a la elaboración de la técnica de la crítica [o interpretación] del testimonio” escrito)Es cierto, como escribió Norman Cantor, que cuando leemos a Bloch no podemos sustraernos a las denotaciones y connotaciones de su martirio (tortura y ejecución a manos de los nazis en Francia en 1944), al ello detraer de la calidad de sus planteamientos, pues tenemos la tendencia de perdonarle todas sus faltas, defectos, contradicciones como historiador, lo que no hacemos con los demás historiadores. Que eso no tiene remedio: Bloch viene escoltado por su tragedia. Pero la pasión que Bloch pone en sus ideas lo debe redimir y salvar de cualquier parcialidad por parte del lector. Y si las condiciones de su muerte conforman hasta cierto punto el conocimiento que derivamos leyéndolo, cuánto mejor."}, {"userName": "Habemus_apicellam", "userReviewDate": "Aug 02, 2017", "userURL": "http://www.goodreads.com/user/show/20567354-habemus-apicellam", "userReview": "La conversazione interrotta E' terribile e simbolico che questo libro si interrompa bruscamente nel momento in cui Bloch analizza il concetto di causa nell'analisi storica. I nazisti hanno eliminato una mente brillante e soprattutto aperta, lasciandoci orfani di una persona capace di vedere oltre, mantenendosi sempre legato alle persone. E quindi la storia come scienza che parla degli essere umani, una scienza, e quindi improntata al rigore e alla disciplina come le altre scienze. Per inciso, è notevole vedere come Bloch conosca bene la chimica e la fisica del suo tempo, usandole come pietre di paragone per lo sviluppo dei propri concetti: segno di una mente curiosa e aperta ad ogni aspetto dello scibile. Le parti di discussione della critica, della linguistica, dell'analisi delle fonti sono profonde e cariche di concetti, quindi una lettura non sempre agevole per il non esperto, ma comunque fondamentale per ogni amante della storia!"}, {"userName": "Luis", "userReviewDate": "Sep 29, 2017", "userURL": "http://www.goodreads.com/user/show/19968477-luis", "userReview": "Before going into college, I seriously considered becoming a historian. I ended up studying chemistry and getting accustomed with the rules of the scientific method. And in comparison, this book can be very well considered as a study on the method for history. Bloch is very aware of the possible bias of historians while examining information, and specially of acknowledging the ignorance of situations based on the available data. It is a perfect introduction to the understanding of history as a science."}, {"userName": "Славея Котова", "userReviewDate": "Jul 08, 2017", "userURL": "http://www.goodreads.com/user/show/35943999", "userReview": "Хубава книга, но твърде разпиляна в интердисциплинарното анализиране.. И един хубав цитат \"Тъй като впрочем няма нищо по - изменчиво по природа от подобни присъди, подложени на всички колебания на колективното съзнание или личната прищявка, историята е приела облика на най-несигурната дисциплина: кухите обвинения са следвани от толкова безполезни реабилитации. Робеспиеристи, антиробеспиеристи, молим ви за милост: смилете се и просто ни кажете какъв е бил Робеспиер\""}, {"userName": "Alice", "userReviewDate": "Feb 17, 2017", "userURL": "http://www.goodreads.com/user/show/8090504-alice", "userReview": "Marc Bloch's \"The Historian's Craft\" is a necessary read for anyone even considering becoming a historian. It details in a thoughtful and comprehensive way the limitations and difficulties of bridging that gap between the dead and the living. A truly masterful work by an experienced and equally amazing author, \"The Historian's Craft\" is at once educational and a reflection on historiography."}, {"userName": "Jenny Grieve-laing", "userReviewDate": "Mar 07, 2018", "userURL": "http://www.goodreads.com/user/show/7669580-jenny-grieve-laing", "userReview": "This little gem has been on my shelf since I discovered Bloch as a postgraduate. I wish I had read it as an undergrad in history as it has so much to offer the aspiring historian. A great legacy for Bloch, who was killed by the Nazis and it remains a wonderful guide for historians."}, {"userName": "Fabio", "userReviewDate": "Sep 03, 2017", "userURL": "http://www.goodreads.com/user/show/37304285-fabio", "userReview": "Pietra miliare. Punto."}, {"userName": "Hillary Borders", "userReviewDate": "Sep 18, 2017", "userURL": "http://www.goodreads.com/user/show/2951943-hillary-borders", "userReview": "Read for Historiography"}, {"userName": "Daniel Petrocelli", "userReviewDate": "Mar 14, 2018", "userURL": "http://www.goodreads.com/user/show/56245107-daniel-petrocelli", "userReview": "Marc Bloc, patriot and historian. Feudal Society got my started on my academic pursuits as a Medieval Historian. Brilliant."}, {"userName": "Cata Chacón S. ", "userReviewDate": "Mar 21, 2017", "userURL": "http://www.goodreads.com/user/show/5081771-cata-chac-n-s", "userReview": "Una excelente lectura para sumergirse en la labor del historiador."}, {"userName": "Gerardo", "userReviewDate": "Feb 07, 2016", "userURL": "http://www.goodreads.com/user/show/19806621-gerardo", "userReview": "E' un testo di una chiarezza illuminante, accessibile a tutti. Di fatto, è un manuale che sintetizza tutti gli strumenti dello storico. Ma, più in profondità, racchiude una sua grande saggezza. Prima di tutto, sottolinea un fatto mai scontato: quel che accade appartiene alla dimensione umana. La storia non è qualcosa di oggettivo, ma qualcosa che prevede in sé tutta la mutevolezza umana: menzogne, alterazioni, punti di vista marcati, culture diverse, tutto contribuisce a rendere sempre parziali le tracce della storia degli uomini, per quanto queste si sforzino di essere neutrali. Ciononostante, questo non impedisce allo storico di essere e di dover essere rigoroso. Ha al suo fianco numerosi strumenti che gli permettono di raggiungere un certo grado di comprensione. Infatti, la storia va compresa, affinché essa non diventi pura aneddotica. Comprendere significa prendere con sé e ciò è possibile quando lo studio della storia penetra all'interno dell'esperienza: ciò non significa necessariamente che si potrà imparare dalla storia ad essere migliori, ma significa che la storia può aiutarci a imparare ad osservare meglio ciò che accade intorno a noi. La storia è un piacere poiché soddisfa il nostro bisogno di narrazioni, ma allo stesso tempo la storia è anche un esercizio intellettuale che sviluppa la nostra capacità critica. E infatti, la storia procede attraverso l'uso di strumenti critici, i quali sono ripresi dal mondo della filologia e della linguistica. E' importante notare come gran parte dello sforzo degli storici sia un lavoro di decifrazione di codici: scrittura, pittura, artigianato, urbanistica, ecc. Imparare questi strumenti, inoltre, mette al sicuro dalle mistificazioni delle produzioni umane, sia lontane che vicine.Il testo, purtroppo, non è stato concluso per via della morte dell'autore (fucilato dai nazisti perché uomo della Resistenza). E' un vero peccato, perché era giunto ad abbozzare le prime pagine che ragionavano sul concetto di causa: prime pagine che, però, sono già pregne di molti pensieri. Infatti, quel che resta afferma che anche le cause studiate vengono scelte a seconda degli interessi di chi guarda e che mai si riuscirà a definire un quadro così preciso capace di elencare tutti i fili dell'intricato intreccio degli eventi storici."}, {"userName": "Jessica", "userReviewDate": "Jan 01, 2013", "userURL": "http://www.goodreads.com/user/show/7290583-jessica", "userReview": "Some scholars possess the ability to be quietly brilliant, conveying ideas and information in an conversational but comprehensive style. Marc Bloch is the rare individual who translates that skill to his writing.This is an excellent little text that addresses how historians approach their profession. It is written informally and covers the process of thinking and writing historically--everything from defining what the aims of history can be, to using and evaluating bias in evidence, encouraging interdisciplinary approaches to questions, and analyzing events and causation when crafting a narrative. It works great as a starting point for discussion with undergraduate students, and would likewise be useful for anyone interested in looking 'behind the curtain' on how professional historians approach their trade. For me, the book is all the more powerful knowing the historical moment in which it was written: Bloch writes from within occupied France while serving as part of the French Resistance forces during WWII, and he writes from memory (without any of his books to serve as references) and with poignant awareness of the uses (or misuses) of history in state projects of the late 1930s. Without losing hope in the tasks ahead, Bloch writes to future generations of historians to show them the path to follow."}, {"userName": "Sense of  History", "userReviewDate": "Aug 18, 2015", "userURL": "http://www.goodreads.com/user/show/26055396-sense-of-history", "userReview": "This book offers a reflection on some fundamental aspects of the historical profession, with valuable insights. But it is rather unsystematic, and clearly unfinished. Especially his assertion that sources, or traces as he calls them, are more useful as indirect witnesses, namely to extract things out of them there that were not intended by the witness, is a bit too extreme. This is true in the field of mental history (histoire des mentalités), but it neglects a very wide domain of the historical métier. Occasionally there was a surprising insight, as for example the statement that there is only a gradual difference in the investigation of the far past and that of the recent past, because also the present is sometimes only very imperfectly knowledgeable, through lack of testimonials and communication flaws, so that even a reconstruction of very recent facts can only be but imperfect."}, {"userName": "Davide Ferrari", "userReviewDate": "May 17, 2016", "userURL": "http://www.goodreads.com/user/show/52571979-davide-ferrari", "userReview": "Un libro fondamentale per qualsiasi studente o studioso di storia; in esso si evidenza il metodo storico, ad oggi predominante, canonizzato da uno dei più grandi storici e pensatori del '900 europeo. Tuttavia \"L'apologia\" di M.Bloch è un libro complicato, di difficile comprensione, soprattutto se non si è avvezzi al linguaggio storiografico. La difficoltà della lettura non risiede solo in questo; infatti il lavoro di March Bloch non era pensato per la pubblicazione; in esso si scorgono più che nozioni agili una serie di considerazioni personali dell'autore sulla ricerca storica, sulla figura e sul \"mestiere\" di storico. La pubblicazione, postuma, seguita dal figlio è sicuramente frutto di una considerazione dell'importanza che le riflessioni del padre avrebbero potuto avere su una nuova epistemologia della ricerca storica."}, {"userName": "James", "userReviewDate": "May 22, 2012", "userURL": "http://www.goodreads.com/user/show/9069661-james", "userReview": "If you are at all interested in learning how historians find out about the past, what problems they encounter and how they can and do make decision about what to include and what not, this is a must read. The author was killed by the Nazi in WWII as member of the French resistance, which left this book unfinished. However, it is still a monumental work. It's easy to read, but still contains huge amount of useful and pertinent information without the \"academic rhetoric\" that is so common among scholars. In recent years, I have encountered so many people of the both sides of the debate of whether the bible is reliable, Jesus existed, and related topics. Rarely do I find someone who has even a clue about historiography. If you want to engange in such topics, and you want to keep yourself from sounding like a completely idiot, this book is probably the best place to start."}, {"userName": "Luis Cardenas", "userReviewDate": "Aug 09, 2015", "userURL": "http://www.goodreads.com/user/show/30048979-luis-cardenas", "userReview": "La historia personal de Bloch, así como su nefasto final a manos del totalitarismo hacen de este libro aún mas curioso y exquisito, ya que fue en su encarcelamiento cuando lo escribió. Con una sencillez impecable, Bloch describe todos los corredizos pasos de la Historia como ciencia y como filosofía, de sus ventajas y desventajas como ciencia social, de los pasos en falsos y las fortalezas que debemos aumentar, así como las debilidades que deben ser vigiladas. Bloch narra en uno de sus capítulos que a los historiadores se les dificulta lograr captar la atención del lector para el estudio de la historia ya que es difícil que una cienca tan pesada pueda mezclarse con una buena prosa, no obstante es muy probable que Bloch se fue sin saber que él si consiguió esa prosa digna y amalgamarla a la ciencia de la historiografia."}, {"userName": "Jackie", "userReviewDate": "Jun 14, 2010", "userURL": "http://www.goodreads.com/user/show/1078831-jackie", "userReview": "Excerpt from my essay:Bloch expands upon this departure from positivism, attributing the theory’s shortcoming to the human element in history. To determine the cause of a regime change, we cannot use the same formulaic precision as a mathematician would use to solve a proof. “Where calculation is impossible we are obliged to employ suggestion.” In rejecting a completely scientific approach to analyzing history, both Bloch and Carr inherently admit to a degree of uncertainty in any historical work. However scrupulously a scholar sifts through original documents, eye-witness accounts, and physical evidence to determine the most probable cause of an event, the resulting theory will amount to, at best, a very educated hypothesis. The highest perfection that a historian can strive for is a theory with an infinitely high probability of truth."}], "description": "Dificilmente se encontrará alguém que a história não tenha mais ou menos fascinado, que mais não seja pelo seu aspecto aliciante de desvendar coisas desconhecidas. Mais difícil ainda será encontrar quem não tenha apelado ou ouvido apelar para as lições da história: a cada passo se repete que «a história é mestra da vida».Ora tudo isto, desde o fascínio que exerce às lições que nela se pretende encontrar, põe o problema do sentido da história — o problema que ingenuamente punha aquele pequeno estudante quando perguntava: «Papá, para que serve a história?»O presente volume, de que apresentamos a 6.ª edição, escrito por um homem que fez da investigação histórica a sua profissão, pretende da resposta à pergunta acima enunciada e a outras que nela se encontram implícitas. O autor, além do problema das opções que ao historiador se põem quanto às linhas de orientação a seguir no seu trabalho, debruça-se também sobre o problema dos métodos da investigação histórica. Deu-nos assim uma pequena suma, de leitura indispensável a quem deseje ultrapassar os aspectos epidérmicos duma disciplina em que, mais ou menos, todos estamos interessados.(Da contracapa.)", "title": "Apologie Pour L'histoire Ou Métier D'historien", "url": "http://www.goodreads.com/book/show/1367386.Apologie_Pour_L_histoire_Ou_M_tier_D_historien", "average": 4.02, "cover": "https://images.gr-assets.com/books/1183029098l/1367386.jpg", "reviews": 87, "authors": [{"url": "https://www.goodreads.com/author/show/5892.Marc_Bloch", "name": "Marc Bloch"}], "type": ["History", "Nonfiction", "Philosophy"], "outlinks": ["http://www.goodreads.com/book/show/1367386.Apologie_Pour_L_histoire_Ou_M_tier_D_historien", "http://www.goodreads.com/book/show/9051.The_Historian_s_Craft", "http://www.goodreads.com/book/show/8958071-apologia-della-storia", "http://www.goodreads.com/book/show/355993.Apologie_Der_Geschichtswissenschaft_Oder_Der_Beruf_Des_Historikers", "http://www.goodreads.com/book/show/16146113-pleidooi-voor-de-geschiedenis-of-geschiedenis-als-ambacht", "http://www.goodreads.com/book/show/246420.The_Historian_s_Craft", "http://www.goodreads.com/book/show/27214247-introducci-n-a-la-historia", "http://www.goodreads.com/book/show/18219291-introdu-o-hist-ria", "http://www.goodreads.com/book/show/2741768-introducci-n-a-la-historia", "http://www.goodreads.com/book/show/13116707-apologia-della-storia-o-mestiere-di-storico", "http://www.goodreads.com/book/show/16076324-the-historian-s-craft", "http://www.goodreads.com/book/show/25860570-apologia-della-storia-o-mestiere-di-storico", "http://www.goodreads.com/book/show/402971.Feudal_Society_Volume_1", "http://www.goodreads.com/book/show/1968034.Feudal_Society_Volume_2", "http://www.goodreads.com/book/show/152476.Strange_Defeat", "http://www.goodreads.com/book/show/10217815-i-re-taumaturghi", "http://www.goodreads.com/book/show/402973.Feudal_Society"]}