{"ratings": 26073, "userreviews": [{"userName": "Amanda", "userReviewDate": "Jul 22, 2011", "userURL": "http://www.goodreads.com/user/show/5856299-amanda", "userReview": "As one who always reads other reviews before reading and reviewing a book, I feel like I should respond to what some of the other reviewers have to say. First of all, some complain that the writing style is too sophomoric. Well, every writer has his voice, and how interesting would the world be if everyone wrote or spoke exactly the same way? Yes, the writing style is simple, but that just makes the book(s) easier too read. Secondly, as to the complaints that the books are sexist, that's just silly. In fact, you can even see that the writers probably felt obligated to respond to those claims by giving the character Chloe some strange dialogue, such as telling Tsion that she felt insulted when he called her a \"precious little one.\" At any rate, Chloe's character is as strong a female lead as a reader can ever hope for.Anyway, I thoroughly enjoyed this book. I feel that the writers have come a good distance with character development, as I find myself actually caring what happens to them and feeling some emotion with what they are going through. They learn, they grow, they make mistakes, they are as human as fictional characters could be. Also, the writers have gotten better at building suspense. There is no immediate gratification when something mysterious comes up -- sometimes you have to wait several chapters to find out what is going on. And finally, they do a good job keeping you guessing with who is the \"good guy\" and who is an \"impostor.\" It really puts you in a place to relate to what the characters must be feeling. I will definitely continue on in this series."}, {"userName": "Alex", "userReviewDate": "Oct 20, 2008", "userURL": "http://www.goodreads.com/user/show/934422-alex", "userReview": "Okay, so another reason to dislike these books is the good math. Ready? Alright. One of the main characters is pregnant, right? And has been for lets give them the benefit of the doubt three months at the beginning of the book. Okay. Now: There is a five-month plague of demon locusts (just take it at face value) and anyone stung by them will be writhing in pain for a) the rest of the five months that the plague exists, and b) for five whole months after that. When does the main character give birth? Just as people start coming out of the terrible pain. Basic maths mean that she was pregnant for 13 months at a minimum. This means one of three things: 1) she's pregnant with the AntiChrist, but that can't be, because we know who the AntiChrist is. 2) She's an elephant, which I'm not cutting out as a possibility. Or, 3) LeHaye and Jenkins are impossibly bad at math."}, {"userName": "Kristin Myrtle ", "userReviewDate": "Dec 28, 2010", "userURL": "http://www.goodreads.com/user/show/1576317-kristin-myrtle", "userReview": "This is the Left Behind book that made me the maddest. However it did not dissuade me from continuing the series. You'd think with a book called Apollyon: The Destroyer Is Unleashed there would at the very least be a character names Apollyon in the book. Sadly, no. There is not even a \"destoyer.\" The name Apollyon is mentioned twice but no demon lord arises as I mistakenly believed. There are however these ridiculous demon hybrid locusts. They're 3 to 4 inches long with the 12 part segmented body of a horse and the head of a man with long flowing hair. Oh ya and they can talk. They only bite the unbelievers and when they do their victims have 5 months of agony where there are even unable to commit suicide. These locusts eventually die off. These books aren't bad but they're not good either. But the writers do do one thing right. They are compulsively readable with intriguing characters and cliffhangers galore."}, {"userName": "Alexander", "userReviewDate": "Jun 25, 2016", "userURL": "http://www.goodreads.com/user/show/50854041-alexander", "userReview": "The beginning started off slow but quickly built up towards the middle and held strong all the way to the end. A very satisfying fifth installment to the Left Behind Series. ProsIntenseSuspenseClift hangersPlot twistsCharacter developmentPlot developmentConsNothing"}, {"userName": "Neil", "userReviewDate": "Apr 16, 2018", "userURL": "http://www.goodreads.com/user/show/11192244-neil", "userReview": "[well, other than Chloe expressing for the first time she hopes she can be the instrument God uses to kill Carpathia and Hattie saying that her hatred for Carpathia and her desire for revenge by killing him were all that kept her alive and gave her purpose for her miserable life (hide spoiler)]"}, {"userName": "Victor Gentile", "userReviewDate": "Jul 03, 2011", "userURL": "http://www.goodreads.com/user/show/2528881-victor-gentile", "userReview": "Tim LaHaye and Jerry B. Jenkins in their book “Apollyon” Book Five in the Left Behind series published by Tyndale House Publishers takes us to the events of Chapter 9, verses 1-12 in Revelation, the last book of The Bible.In the Bible book of Revelation an Angel is dispatched to the bottomless pit with a key. Once the pit is opened out pour locusts upon the Earth unlike any ever seen before. And their sole purpose is to torment for five months \"only those men which have not the seal of God in their foreheads\". These locusts have a leader, \"And they had a king over them, which is the angel of the bottomless pit, whose name in the Hebrew tongue is Abaddon, but in the Greek tongue hath his name Apollyon. (Revelation 9:11). According to the Greek Dictionary Apollyon simply means, \"Destroyer\".Nicolae Carpathia continues his rise to power and wants to eliminate all the believers that are opposed to his One World Religion. The world's believers are gathering in Jerusalem for a stadium rally and Carpathia decides to wipe them all out there. Capt. Rayford Steele is now the pilot for Carpathia while Buck Williams is working for Carpathia's news network. The remaining members of the Tribulation Force must figure out a way to stop this wholesale slaughter.Dr. LaHaye and Jerry Jenkins provide a fictional background for the real events that the final book of The Bible, Revelation, speak about: the end times. The Biblical accuracy in“Apollyon” is flawless and the story is a page turning thriller. There are wonderful themes: salvation, faith in what you cannot see and who is in charge despite appearances to the contrary. I do not recommend starting this book late at night because it will cost you sleep as you will not want to put it down. Mr. Jenkins is an excellent writer and knows how to twist your nerve endings as he tightens the suspense. I am looking forward to book six in this series.If you would like to listen to interviews with other authors and professionals please go to www.kingdomhighlights.org where they are available On Demand.To listen to 24 Christian music please visit our internet radio station www.kingdomairwaves.orgDisclosure of Material Connection: I own this book. I was not required to write a positive review. The opinions I have expressed are my own. I am disclosing this in accordance with the Federal Trade Commission’s 16 CFR, Part 255  : “Guides Concerning the Use of Endorsements and Testimonials in Advertising.”"}, {"userName": "Timothy", "userReviewDate": "Jan 25, 2011", "userURL": "http://www.goodreads.com/user/show/4873764-timothy", "userReview": "In this, the fifth book of the \"Left Behind\" series, the writing has definitely improved, for the most part. Another big improvement is a noticeable lessening of illogical actions and events that were so annoying in earlier volumes. That is not to say that is is completely lacking, though. In this book, we are reminded of the revelation in the \"Soul Harvest\" that Carpathia had Bruce Barnes poisoned. The question is, \"Why?\". At the time, Bruce (and the \"Tribulation Force\" as a whole) was no great threat to either Carpathia or the Global Community. The story, however, is still the same flaccid, tepid series of escapes, rescues, and chases that we have become used to from these authors. It also shows the same lack of imagination that has plagued this series from the beginning. Once again, the action reads like something stolen from a second rate movie or a two bit TV show and are further robbed of any tension or suspense by the characters constantly reminding each other that God is protecting them, so they are, ultimately, safe from any serious harm. Add in the fact that the authors have given me no real reason to care about the characters, and what should have been exciting scenes crackling with tension and concern are nothing more than just a boring sequence of words. Even the title of the book is nothing more than a cheap attempt to grab the readers' interest. Apollyon, \"chief demon of the abyss\", never puts in an appearance. When his horde of demon locusts finally put in an appearnce, about two-thirds of the way in, they are only there for about two chapters and are not all that terrifying. They sting people once, causing swelling and pain, and then move on. Perhaps that is the greatest downfall of these books: they are too tame. These events should be terrifying and heart-rending, but come across as limp and comical. (Witness the slapstick scene of Bo and Ernie trying to escape the locusts.) Even the descriptions of scenes of decadence and liscentiousness are watered down to the point where the most abominable actions include men kissing other men and (horrors of horrors!) tattoo parlors. These books aren't just a waste of time and paper. They are also a waste of a great opportunity to give us frightening, exciting, gut-wrenching stories."}, {"userName": "Melissa", "userReviewDate": "Jan 14, 2012", "userURL": "http://www.goodreads.com/user/show/4188079-melissa", "userReview": "Book #5 of this series has Raymond sneaking out of Israel to save his life and Buck, Chloe, and Tsion going to Israel to hold a huge conference for the witnesses. I never figured out why and that theme held true through most of this book. So much of what happened in this book left me thinking why would they do that or how could they do that? The main characters are constantly putting themselves in situations that noone should survive, yet they do things that if the world conditions really were as they are discribed in the book would be impossible for them to do.Either because the writing is just not that good or because my thought process is wired differently from the authors, I keep thinking along the lines of how? There was a major earthquake but because of solor power all these torn up houses have power to run? After that much distruction it would take a long time for power lines to be fixed but they have no problems with having food or cooking it? I get the solar power thing, but how is the power getting to the destroyed houses? And all of the gas stations are ok to the point they have no problems always having gas for the cars, after a major earthquake? These people, who none of are trained hackers or techs, suddenly can hide there websites and phone calls from the most powerful person in the world? If you're not the kind of person these things bother then you may not have any problems with the story. The characters are in and out of danger, they're having a baby, and there is some good scripture written throughout the book. There's characters that you like a great deal finally coming to the light. I will continue to read the series as overall it is good one, with a good meaning behind it, some of the books are better than others."}, {"userName": "Cassie", "userReviewDate": "Aug 03, 2015", "userURL": "http://www.goodreads.com/user/show/29329598-cassie", "userReview": "This one drove me nuts because there was still a lot of recapping and with the new seal of God on all the Christian's foreheads, there's less worry about who to trust...but don't worry...there are still some impostors around! Hattie: I still cannot stand this woman, but as a believer, I get how passionate they are about trying to win her to Christ...but some are so hard hearted, there is nothing you could say. They have to either choose to believe or not. My gut would be telling me to cut her loose and pray like crazy. I hate that loss had to happen for the Trib Force to have a new hideout and shelter. I hated a lot of the loss that has taken place so far. When you get attached to the characters, the loss hurts even more. Chaim...still driving me crazy too. He is so intelligent that he cannot believe. It's frustrating, but again, much of the human race is this way. They explain faith away. Keep going is all I can say. As this is the second time through this series...it really does get more exciting. And the writing is better with each one. Still easy to read, but exciting."}, {"userName": "King Possum", "userReviewDate": "Jan 06, 2013", "userURL": "http://www.goodreads.com/user/show/8746088-king-possum", "userReview": "pretty boring book. I forgot I was even reading the book. I have read a few of the DARK-HUNTER series and am reading STONE OF TEARS right now. I will go back and finish the book one day because I can't advance a story without first reading what comes before. all series must be read in order is how I read and I do want to know what happens in the rest of the series. maybe I will enjoy the book more in a year or so but I doubt it. as a whole so far the series is pretty good; I just haven't got into this book at all. I am not a Christian and at times these books, understandably, get a little preachy so it kills the mood for me.read it if you want everyone is different. I am not saying it is a bad book but I just haven't found the love for this book. always read, even if you don't like what you are reading still read, reading is a great skill to have. I hope this book stays around for a while because it is worthy of reading. not the best most coherent review I know but I am not very good at making reviews. enjoy the book as best you can."}, {"userName": "Holly Lindquist", "userReviewDate": "Dec 12, 2010", "userURL": "http://www.goodreads.com/user/show/2650600-holly-lindquist", "userReview": "Here in Volume 5 of the Left Behind series, authors Jenkins & Lahaye prove that even a book can have bad CGI. See, if this was a big blockbuster movie you'd be thrilled by the possibility of seeing some really cool monsters. The title says Appollyon and the tagline says: The Destroyer is Unleashed. Sounds truly epic, right?Yeah.. Right up until the part with the little demon locusts with little angry faces. Bad CGI strikes again! So you leave the theater ruing the wasted expense of popcorn, soda, and ticket and having bad flashbacks of that time you took your date to see Van Helsing. That's this book.PS: The back of the book says this is the \"most shocking and explicit portrayal\" in the Left Behind series yet. After reading it I can say with certainty that I have seen more shocking Jim Henson productions."}, {"userName": "Oceana", "userReviewDate": "Mar 27, 2015", "userURL": "http://www.goodreads.com/user/show/7154927-oceana", "userReview": "Ah this one was really good too! I liked this storyline, and things are getting pretty intense now! I can't wait to keep reading this series!"}, {"userName": "Becky", "userReviewDate": "Jun 28, 2013", "userURL": "http://www.goodreads.com/user/show/2529064-becky", "userReview": "Good but not great. Still I want to read the rest of the series."}, {"userName": "Naomi Bowen", "userReviewDate": "Feb 19, 2017", "userURL": "http://www.goodreads.com/user/show/13105541-naomi-bowen", "userReview": "POTENTIAL SPOILERS AHEAD! !Don't be deceived by the title of this book. The monster you may remember from Pilgrims Progress doesn't appear - he's only mentioned by the strangest locust demons you'll ever read about - UNTILL you realise that's exactly how the Bible describes them! (Rev 9:7-11) As I've said in previous Left Behind reviews, these books are great for bringing Revelation to life & making you turn again to the Word, the Truth, to see if LaHaye's depiction matches up.Also brought to life are the two witnesses of Rev 11. They make a powerful appearance at a huge Christian gathering in Israel - one which reminds me of Christian camps I've been on where God's presence is so strong...However, parts of the story really drag. This book seems to focus a lot on the pregnancy of two main characters - which isn't always that interesting. Some characters remind frustratingly unchanged.But I guess that's true of life. People respond in different ways to God - and there are those who refuse to come to Him even when the truth is right under their nose. And sometimes - like Hattie - it's because they think they don't deserve His love.Well, none of us do. But Christ does! And if He thinks you're worth dying for...who are you to disagree with Him?"}, {"userName": "Pamela Hatch", "userReviewDate": "Nov 27, 2017", "userURL": "http://www.goodreads.com/user/show/72489185-pamela-hatch", "userReview": "Apollyon (Left Behind #5) / written by Tim LaHaye and Jerry B. Jenkins -- Wheaton, IL : Tyndale House Publishers, c1998. (403 pages) -- RANGE 9 -- ADULT BOOKS FOR YOUNG ADULTSSUMMARY: The Tribulation calendar moves closer to the halfway point and the fourth Trumpet Judgment strikes the solar system and cripples the earth. and then the fifth Trumpet Judgment brings the plague of scorpionlike locusts led by Apollyon, chief demon of the abyss. The judgements are getting worse and worse and the Tribulation Force members are in exile as fugitives of the Global Community. Tens of thousands of the 144,000 witness meet at Teddy Kollek Stadium to sit hear the teachings of Tsion Ben-Judah who returns to Jerusalem for this historical event.REVIEW: They just keep getting better and better. The plague of locusts is a powerful scene and the horror of the creatures is very vivid in the description as the story unfolds. The Tribulation Force finds new members and will loose a few while we wonder about the future of the others.Just keep reading and then grab the next one and keep reading some more."}, {"userName": "Amy T.", "userReviewDate": "Apr 25, 2018", "userURL": "http://www.goodreads.com/user/show/64574447-amy-t", "userReview": "This is the fifth book in the Left Behind series. In this book, the Tribulation force travels to Israel for an international gathering of believers that Nicholae Carpathia, the antichrist, tries to foil. As the book progresses, more trials face the Earth and these trials challenge friends of the Tribulation force to consider belief in Christ.I have yet to be disappointed with a book in this series. It helps that I have become attached to the characters and find myself rooting for them as they face the trials of the Tribulation, hoping they will survive. These characters are super well-written and fascinating. In addition, the interpretations of Scripture that make up the plotline are mind blowing, frightening, and fascinating. I found that this book was almost as good as the third and fourth books (my favorites in the series so far) but not quite as riveting, action packed, and engaging. Very good still though! I definitely got through it quickly and was moved and inspired at all the right moments. I continue to highly recommend this series."}, {"userName": "A", "userReviewDate": "May 13, 2017", "userURL": "http://www.goodreads.com/user/show/46858626-a", "userReview": "I enjoyed this book and it was very exiting. However, it did disappoint me in select areas. *SPOILERS AHEAD*. Okay so Hattie loses her baby, we all knew it was going to happen. This was a very sad event and I feel like it happened and then everyone except Hattie moved on. Chloe and Buck got home and they didn't even acknowledge this significant event. Poor Hattie, she got hardly any sympathy. Also, why is Ken dead? He was such a likable character and he will be missed. I know these things are super nit picky, but I have high expectations for Mr. Jenkins and Mr. LaHaye. I feel like Hattie needs to just do something. Anything! Leave or stay, make up your mind Hattie. Also, it bothers me slightly that the baby was named after two dead people. The only problem with this is the trib force didn't want to tell the baby about the past events. So why give him a name that makes the trib force remember the past events? Anyway, I'm looking forward to the next book and my faith in the series has not been wavered."}, {"userName": "Kim Justice", "userReviewDate": "Jul 18, 2017", "userURL": "http://www.goodreads.com/user/show/6457398-kim-justice", "userReview": "Starting this review is well, easy to say the least. I started reading the first book in this wonderful series just as soon as I heard about them. Being from a christian home life growing up and as well as my husband and family this was a no brainier. I am going to do one review including the whole series. From the first page of the first book to the last page in the last book, I was not able to put these books down. I grew hunger so to speak for each page. I have always had a great belief in the Bible and in my Faith. This series, although some would call fictional, I believe are very close to what will:To read more of my review: https://breathoflifebookreviews.blogs..."}, {"userName": "Geoff Battle", "userReviewDate": "Jul 02, 2017", "userURL": "http://www.goodreads.com/user/show/67231576-geoff-battle", "userReview": "The fifth chapter of the Left Behind series can be divided in to two halves in regards to the plot. The first, which centres around a conference and Nicolae's approach to it is lacking any real action until it wraps up, and although there are some character developing motions, it is largely redundant. The second half drives the story forwards in line with the expectations laid out in Christian literature. The writers ensure nothing can be predicted other than the general predictions and their artistic license is employed well in ramping up the action and creating plot twists. Overall, Apollyon is a standard and entertaining entry in the sequence, however it never delivers any real impact."}, {"userName": "Cynthia", "userReviewDate": "Jun 08, 2017", "userURL": "http://www.goodreads.com/user/show/8352993-cynthia", "userReview": "I am absolutely riveted by these books and when I am reading one I cannot put it down. I tear through it, page into page, and am always disappointed when I reach the end. The character development continues and the authors do not make the mistake of painting them in black and white (except antichrist, of course,) but you see the humanity - theirs, and ours. Our pettinessess and our greatnesses, our selfishness and our self sacrifice. The next book in the series is on my shelf and it is next on my list."}, {"userName": "Melissa Cunning", "userReviewDate": "Jul 10, 2017", "userURL": "http://www.goodreads.com/user/show/35859030-melissa-cunning", "userReview": "This was my favorite book of the series so far. There was a definite bone chilling factor that is encountered in this book that was never present in the previous ones. The thought of Apollyon, a a torturous creature that makes you wish you were dead while never actually killing you? And all because you are not a believer? I have to say Tim Lahaye has taught me so much, and all through the voices of fictional characters. I can't wait to read the next one!"}, {"userName": "Nicole", "userReviewDate": "May 17, 2018", "userURL": "http://www.goodreads.com/user/show/1435391-nicole", "userReview": "I read what I did of this series because it was one of the few books my then-husband would read, and I wanted to be able to discuss books with him. I won't be reading more of these books, or re-reading any of the ones I already read, and reading them didn't help give me and my ex-husband anything interesting to talk about anyway since he didn't want to hear the ways in which my opinion on the series varied from his."}, {"userName": "Shanna", "userReviewDate": "Oct 16, 2017", "userURL": "http://www.goodreads.com/user/show/23125030-shanna", "userReview": "The believers from the unbelievers have been marked with the cross on the forehead. locust come and attack anyone not protected by the Lord. they must suffer this judgment for 5 to 10 months giving the Tribulation Force time to plan and prepare for the next seal and judgment. You have to read this series. I'm in love with the characters and I just can't seem to put these down once I start them. I'm raving about this series"}, {"userName": "Elijah Abanto", "userReviewDate": "Nov 24, 2017", "userURL": "http://www.goodreads.com/user/show/13291004-elijah-abanto", "userReview": "This novel, fifth in the Left Behind series, is a very realistic take at the Tribulation period, particularly at the time the first Trumpet judgment has happened -- the locusts and Apollyon. The characters are real people to me, making me care for them. Thank you Lord for this novel."}, {"userName": "Denise", "userReviewDate": "Jul 03, 2017", "userURL": "http://www.goodreads.com/user/show/2898303-denise", "userReview": "I am taking these for what they are...a story. Several points I thought to myself..ugh oh my, yeah right, and so on, but it is simply a story...so I keep going to say I have read the series and it isn't bad, something keeps pulling me in even after the ugh."}, {"userName": "Gary Brisco", "userReviewDate": "Aug 08, 2017", "userURL": "http://www.goodreads.com/user/show/66032835-gary-brisco", "userReview": "Very good bookThese books go hand and hand and i love reading each book to discover everything they have to offer. I look forward to completing the series."}, {"userName": "Nakia", "userReviewDate": "Sep 07, 2017", "userURL": "http://www.goodreads.com/user/show/71195521-nakia", "userReview": "A well written book. Enjoyed reading it."}, {"userName": "Al", "userReviewDate": "Jun 10, 2017", "userURL": "http://www.goodreads.com/user/show/8613162-al", "userReview": "Books in the series go up and down - this was one of the up ones."}, {"userName": "Patricia Hamill", "userReviewDate": "May 14, 2017", "userURL": "http://www.goodreads.com/user/show/12951093-patricia-hamill", "userReview": "Pretty good, odd ending. The locusts were, um, interesting. At least I know what the title means now.Overall I liked it, but it's not as exciting as some of the others."}, {"userName": "Mel", "userReviewDate": "Nov 07, 2017", "userURL": "http://www.goodreads.com/user/show/72756604-mel", "userReview": "Couldn't put it down!"}], "description": "A New York Times BestsellerThis is the fifth volume in the Left Behind series of novels based on New Testament prophecies about the end of life on Earth. In this book, the world has been visited by a plague of demon locusts that attack anyone without the seal of God etched on their foreheads. Internet communication is becoming the primary means of maintaining unity within the underground resistance movement of believers. New global warfare threatens a third of the world's population. And the Tribulation Force members deal with personal crises, including pregnancies and lost family members.", "title": "Apollyon\n      \n          (Left Behind #5)", "url": "http://www.goodreads.com/book/show/79705.Apollyon", "average": 3.97, "cover": "https://images.gr-assets.com/books/1407891956l/79705.jpg", "reviews": 419, "authors": [{"url": "https://www.goodreads.com/author/show/7625163.Tim_LaHaye", "name": "Tim LaHaye"}, {"url": "https://www.goodreads.com/author/show/15412.Jerry_B_Jenkins", "name": "Jerry B. Jenkins"}], "type": ["Christian Fiction", "Christian", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/79705.Apollyon", "http://www.goodreads.com/book/show/1953659.Apollyon_", "http://www.goodreads.com/book/show/228262.Apollyon", "http://www.goodreads.com/book/show/2385626.apollyon", "http://www.goodreads.com/book/show/6568318-apollyon", "http://www.goodreads.com/book/show/27523.Left_Behind", "http://www.goodreads.com/book/show/228258.Tribulation_Force", "http://www.goodreads.com/book/show/27528.Nicolae", "http://www.goodreads.com/book/show/228261.Soul_Harvest", "http://www.goodreads.com/book/show/85957.Assassins"]}