{"ratings": 6614, "userreviews": [{"userName": "Ace", "userReviewDate": "Apr 23, 2018", "userURL": "http://www.goodreads.com/user/show/23405868-ace", "userReview": "5 starsBryce Courtenay, storyteller extraordinaire and one of my most favourite authors tells the tragic story of his own son and his horrendous struggles in life. Damon is born a hemophiliac and accidentally contracts AIDS through a \"life saving\" blood transfusion. My heart goes out to every family who has been and may ever have to suffer such hardship, I'm not sure I would be able to cope without heavy sedatives.\"When the afflictions which continued to beset Damon didn't fill me with despair, I marvelled at the capacity of the human body to take the kind of punishment the remorseless onslaught AIDS delivers to it. How Damon was able to survive was a mystery. Why he'd want life to continue was even more bewildering. -Bryce Courtenay"}, {"userName": "Suzanne", "userReviewDate": "Aug 29, 2012", "userURL": "http://www.goodreads.com/user/show/11889829-suzanne", "userReview": "I wasn't writing reviews when I read this. I was blown away by Mr Courtenay's story, the first and only I've read this far. And Damon's. I really loved this book. A relative was one of the first to die of HIV/Aids here and I just hated to see the prejudice (in the story as I was too young to know what was going on around me). I ached for the Courtenay family."}, {"userName": "Collette", "userReviewDate": "Mar 30, 2008", "userURL": "http://www.goodreads.com/user/show/1037547-collette", "userReview": "Wow! I know my eyes are still red from crying as I finished this book this morning before heading to work. Obviously that was not a good choice but what do you do? This is a book so full of courage and love that my words won't do it justice. Bryce Courtenay writes his son's story of growing up as a haemophiliac who acquires AIDS from a blood transfusion during the time when AIDS was just hitting the news in the states. Damon grew up in Australia so no one really new what it was all about until it was too late and it was already in the blood banks. Damon's attitude thoughout his 24 years of living with thousands of blood transfusions and an endless amount of sickness of one form or another is amazing! When he is in his late teens he meets Celeste, another teenager and the love that grows between them is one you just don't hear about. She becomes his world and he becomes hers. This book took me through many emotions, including sadness, but it was also an inspiration in so many ways. I highly recommend it.Bryce is one of my favorite authors and even though this was a true story (non-fiction is just not my favorite)he always weaves a tale that sweeps you up and draws you inside."}, {"userName": "Jennifer (JC-S)", "userReviewDate": "Jan 30, 2011", "userURL": "http://www.goodreads.com/user/show/283014-jennifer-jc-s", "userReview": "‘Trust Damon to die on April Fool’s Day.’Damon Courtenay was born on 4 November 1966, and died on 1 April 1991. This is his story, written by his father and published in 1993. Damon was the third son of Bryce and Benita Courtenay and was born with classic haemophilia. ‘Its not a disease, so you must put the idea of a cure from your minds immediately. Haemophilia is caused by a factor missing in your child’s blood, the ingredient which causes it to clot.’‘It’s not something we can ever fix.’ In 1983, the Courtenays were advised that Damon had become HIV positive – most likely because of the blood transfusions he had required to treat his haemophilia. In 1988, he experienced his first real AIDS-related crisis after undergoing surgery for the removal of his wisdom teeth.‘I picked up the AIDS virus from the blood product that I use regularly for control of haemophilia. It seems such a bitter irony that the medicine that has saved my life became the poison that may soon end it.’It was indeed a bitter irony, and Damon’s story is a heartbreaking one. But it is not bereft of joy or of love.I have had this book on my bookshelf for 17 years: I knew, broadly, what the book was about but couldn’t bring myself to read it until recently. And now that I have read it, I am saddened by the medical circumstances: of haemophilia; of its treatment and of the fact that the source of Damon’s AIDS appears to have been a consequence of contaminated blood donations. A blood donation process – since changed - which did not exclude groups at high risks of AIDS infection from donating blood.I found this book moving and upsetting. It describes both the best and the worst of the medical profession: many dedicated people helped Damon even though the medical system itself seemed to move very slowly in recognising the need for change to its processes and systems. Damon Courtenay may have lived a brief life, but one consequence of it is, as I discovered, a perpetual trust fund (the Damon Courtenay Memorial Endowment Fund administered by the Haemophilia Fund Australia) which provides grants that can be used for the care, treatment, education and welfare for people with bleeding disorders and (or) their families. This fund was established by Damon’s parents in 1993 in Damon’s memory.Jennifer Cameron-Smith"}, {"userName": "Jenny", "userReviewDate": "Mar 27, 2010", "userURL": "http://www.goodreads.com/user/show/3501645-jenny", "userReview": "I actually read this book about 25 years ago... but it is a book that will never leave me.I still temember the absolute power of the book and my utter devaststion when I finished reading. it took me on such a rollercoaster ride and made me realise another side of life that I was fortunate to not have encountered. It was probably part of the reason that I now value my family so much... because you never know what is going to happen in the future. If you want to read a book about compassion, devotion anf hope, then this is that book."}, {"userName": "Sunflower", "userReviewDate": "Dec 23, 2008", "userURL": "http://www.goodreads.com/user/show/978027-sunflower", "userReview": "This book is overly long and tedious in its level of detail. I understand that it is an attempt to make sense of the death of a greatly loved son, but 639 pages filled at times with the minutiae of serious illness does become a challenge to finish. It is also somewhat dated now, but does serve to show us how things have changed in both attitudes to, and treatment of HIV/AIDS. Hopefully for the better. (This review is of course not meant in any way to belittle what the family went through, and my admiration for people who are prepared to share such intimate details of their personal lives)"}, {"userName": "Deyanne", "userReviewDate": "May 10, 2016", "userURL": "http://www.goodreads.com/user/show/4274599-deyanne", "userReview": "I am drained - both emotionally and physically after completing this memoir. This was a long read for me and an incredibly arduous yet loving journey for the marvelous family of Damon Courtenay. To have a son born a hemophiliac is beyond daunting. I had no idea about all of the spontaneous bleeds of a hemophiliac nor the resulting physical deterioration in the body. The \"mother\" part of me reading this book wept openly. How did these parents continue to find their needed strength both physically and emotionally? Add an AIDS contaminated transfusion to the mix and life really becomes challenging. One reviewer I read wrote:\"This isn't a book you actually \"enjoy\" but it is an important book. It is the book Damon asked his father to write, to instruct people about AIDS and, he hoped, reduce some of the stigma attached to AIDS victims. (Damon died in a time when you were expected to wear gowns, gloves and masks when entering the room of someone with AIDS) You will laugh, you will cry and you will scream at too many in the medical community who made things terrible for Damon at various points in his life, from babyhood all the way up to his death.\" So why read this tribute to a dead son? For me it was the empathy I feel and the beginning bud of understanding of this terrible condition. There were so many obstacles: ignorance, depression, seizures, pain, loneliness, but these elements were blended with the dedication of a devoted lover (Celeste), generous and caring doctors (at the end of Damon's life), a profound belief in the power of the mind, an unquenchable attitude of gratitude and a zest for life. My challenges seem smaller now. My life is abundantly rich and full. This well-loved author \"barred his soul\" if you will and in so doing touched mine."}, {"userName": "Brian", "userReviewDate": "Jan 27, 2009", "userURL": "http://www.goodreads.com/user/show/1778081-brian", "userReview": "The Power of One by Bryce Courtenay is one of my favorite books of all time, but since he's not big in the U.S., it's difficult to find other books by him. I found April Fool's Day in a used book store, and was excited to read it.This was a great book, but not in the traditional sense. It's got the same great story-telling feel that Power of One had, but it's completely different because this is the true story of his son Damon's struggle with haemophilia. To stop his \"bleeds\" he needed regular blood transfusions to stay alive, which ironically ultimately killed him as he contracted HIV from one.Some parts of this book were tough to read, and I had to put it down a few times and take a mental break. The effects of Damon's diseases were so awful and the thought of watching a family member go through that was pretty terrible. It's amazing to me that Bryce Courtenay was able to write this book with all the painful memories it must have brought up.I almost feel like the title of his debut novel \"The Power of One\" would have been more fitting for this novel. Despite the horrible fortune dealt to Damon from the moment he was born with haemophilia and later AIDS, he never wanted to be a burden on his family or his girlfriend Celeste. He faced each day with a positive outlook and always believed he could beat his diseases eventually and made huge plans for his future, and he never complained about the immense pain he was constantly enduring. He had an inner strength that is rare for anyone, let alone someone who was dealt such a bad hand.Overall, a great story. I wouldn't recommend it to anyone who is very sensitive as the story is very honest and the effects of the diseases were disturbing. It will change your outlook on people suffering from AIDS and make you thankful for having your health, something we all take for granted every day."}, {"userName": "B the BookAddict", "userReviewDate": "May 25, 2013", "userURL": "http://www.goodreads.com/user/show/19832827-b-the-bookaddict", "userReview": "Courtney at his most honest and his best. ★ 5"}, {"userName": "Liza Fireman", "userReviewDate": "May 01, 2016", "userURL": "http://www.goodreads.com/user/show/28266634-liza-fireman", "userReview": "Wow, wow, and ouch ouch ouch. This book is full of pain, it is heart wrenching. It is the story of Bryce Courtenay's son, Damon, that died at the age of 24, after 24 tough years. Damon was a hemophiliac, and to say the truth, I found out that I know almost nothing about hemophilia. What is a bleeding (well, you can't even see the blood), how it is treated (several blood transfusions every week), how limited is a child with hemophilia, and what are the \"longer\" affects on the body, that is deteriorating and losing even its limited freedom.Now add to that HIV/AIDS, and you got more pain, that cannot be contained. And then, I found out that I don't know too much about AIDS either. So that was eye opening, in the most painful way possible. But it is so very important to know more about it. And at least we made some progress and some of the prejudices have improved.But above all, it is a story about love and dedication. The true love between Damon and Celeste, his girlfriend, and her amazing dedication. And the Courtenays dedication, 24/7, since this is what hemophilia means. And love and dedication play a big role in terminal illness, and they helped the Mighty Damon in almost impossible states, not leaving him for a moment, even when it seems impossible to continue. It is a hard book, but I believe it is the best book to allow somewhat to understand what a terminal ill person goes through. And Bryce Courtenay succeeds to bring it both from the point of view of the family and of the ill person. I can't even describe how I felt throughout some parts, especially when Damon was on the verge of death, in tough life risking states. Heart wrenching, but so so important. You'll learn a lot about hemophilia and AIDS (and about irresponsible medical systems). I don't think that loved the book is a good description, but my heart was expanded (and shrunk at times) by reading it. I ached for the Courtenay family.(4.5 stars but I'll go with the 5 here)"}, {"userName": "Bev", "userReviewDate": "Jan 16, 2011", "userURL": "http://www.goodreads.com/user/show/4806357-bev", "userReview": "Damon was dead. The book starts with his death, so there is no surprise at the outcome. This is the story of Damon Courtney, a hemopheliac who contracted AIDS from a blood transfusion and died at age 24. It is beautifully and sensitively told by his father, one of Australia's best known writers, his girlfriend Crystal, and his mother. I learned more about hemophelia and AIDS than I ever knew and at the end I was sobbing at Damon's death. This isn't a book you actually \"enjoy\" but it is an important book. It is the book Damon asked his father to write, to instruct people about AIDS and, he hoped, reduce some of the stigma attached to AIDS victims. (Damon died in a time when you were expected to wear gowns, gloves and masks when entering the room of someone with AIDS) You will laugh, you will cry and you will scream at too many in the medical community who made things terrible for Damon at various points in his life, from babyhood all the way up to his death.Damon died in 1991. My friend Steve nearly died in 1996, but then new drugs came along and now Steve and countless others are living with AIDS rather than dying from it. It is no longer the automatic death sentence it once was. Which makes me sad that The Mighty Damon died too soon."}, {"userName": "Alsha", "userReviewDate": "Dec 25, 2011", "userURL": "http://www.goodreads.com/user/show/977721-alsha", "userReview": "An admittedly poignant story told in a very bloated fashion. I found myself skipping a lot of digressions and trivia. This is not of course a commentary on the life, pain and experiences the family went through, which are touching in an exceptional way. The amount of medical malpractice they went through is infuriating and saddening. For myself, I simply prefer more conciseness and deliberate focus when it comes to carving a path or a perspective through a story. Depositing everything into a huge mass comes across as tedious sometimes. From a reader's perspective, selective detail would have been more powerful, I think, emphasizing the craftsmanship of the novel over completeness. But of course the book was written first and foremost as the fulfillment of a promise and secondly as a necessary act of memory for the author. Those things make including every detail important too."}, {"userName": " Mandy - Lace Vintage ♥", "userReviewDate": "Dec 10, 2016", "userURL": "http://www.goodreads.com/user/show/8521586-mandy---lace-vintage", "userReview": "April Fool's Day is the incredibly moving story of a young man's life cut short by AIDS and the true & pure love for a young woman that will inspire you to live every day to its fullest and love like there is no tomorrow. There is truly no other words to describe it expect that it is a must read novel that will change how you see life. \"The lovely smiling image I have of Damon will remind me that Love is an energy-it can neither be created or destroyed. It just is and always will be, giving meaning to life and direction to goodness. Our love will never die.\"Celeste. April Fool's Day"}, {"userName": "Pmj", "userReviewDate": "Jan 05, 2012", "userURL": "http://www.goodreads.com/user/show/7268032-pmj", "userReview": "After having an allergy misdiagnosed as Asthma when I was a child, I avoided doctors as much as I could. I had been prodded with various needles for 4 years and was sick of being sick. The idea of donating blood after all that was not something I felt like volunteering for... Until I read this book. Mr Courtenay didn't pull any punches when it came to describing his own part in the story, which made it all the more powerful. I've been donating blood for the past couple of years now, and will continue as long as I am able."}, {"userName": "Tanya", "userReviewDate": "Nov 25, 2007", "userURL": "http://www.goodreads.com/user/show/126507-tanya", "userReview": "I'm not close to done but felt compelled to say ... wow! Now that's I've finished it ... still wow! Definitely an inspiring story of love and devotion under impossible circumstances. I also enjoyed the Australian \"flavor\" (for lack of a better word). If anyone in SD is interested in this, the Central library branch has a copy. It'll be back there within the week, after I turn it in."}, {"userName": "Lynda", "userReviewDate": "Nov 23, 2012", "userURL": "http://www.goodreads.com/user/show/13400128-lynda", "userReview": "An extremely moving book about love, friendship, support, ignorance and prejudices. The death of a son from aids."}, {"userName": "Candace", "userReviewDate": "Apr 01, 2018", "userURL": "http://www.goodreads.com/user/show/5866014-candace", "userReview": "This was one of the hardest reads I have had in a long time. Took me over two weeks to finish it, and at times I could have put it down. I am sure it was cathartic for the family to write it, but it is very depressing. Thank god the drugs have improved so that those who are HIV+ can live a long life. It was interesting to learn about haemophilia and how difficult a disease it is to manage. My grandfather was apparently a bleeder, but unless it was a very mild case, I am not sure he even had it now. Learning about the way AIDS kills was horrific. I feel so sorry for the poor people dying of this disease. I hope that the medical community learned its lesson and if some other disease appears in blood, they will have a better risk plan in place. To think that the poor haemophiliac community who were already having a shit life shortened by their disease, had to then die horrifically, as well as being ostracised by the community. I know that Bryce and Damon wanted this to be a love story, but it was just a tragedy to me."}, {"userName": "Diana E. Young", "userReviewDate": "May 18, 2013", "userURL": "http://www.goodreads.com/user/show/16546816-diana-e-young", "userReview": "This book, written by Bryce Courtney, is unusual because it is a non-fiction book. Sadly it is a true story about his young son who developed AID’s as a result of an infected blood transfusion, which he received because of his hemophiliac disease. The story is set in Australia, his native home. The narrative is told from different perspectives...Bryce, the father, the mother, the victim Damon and his girlfriend, Celeste. Each adds their own voice to the unfolding of this deadly disease.It is a sad tale, written in memory of Damon, to be an expose on the lacking state of the medical system in Australia at the time. Although the medical system should have known better, they did not take adequate care by banning AID’s patients from donating blood, as other countries had already done. In addition, AID’s was almost treated like the plague, where you were an outcast. Courtney openly admits that it was still easier on Damon who contracted AID’s through medical treatment and not his sexual lifestyle. Nonetheless, Courtney manages to capture the blatant ostracism of anyone with AIDS. I enjoyed reading the book and felt moved as a parent to bear witness to the life and struggles of Damon. His strength dealing with life as a childhood hemophiliac was inspiring. The unfairness of developing AIDS was heart-wrenching and sharing the journey with Damon’s girlfriend, siblings and parents was at times hard to read, but that was because the writing was so poignant that there was little left to the imagination as to their true feelings. Damon’s mother was openly honest as she admitted to being angry and totally raw with grief. Courtney was brave enough to admit that he may have put the writing of his current book ahead of flying home with the family when Damon was so sick.I would recommend this book highly as creative non-fiction. It not only educates you on hemophilia and AID’s but also shares a powerful love story of not only the couple, but of Damon’s brother and parents. It is a sad story, but one that needed to be told. The writing compels you to keep turning the pages. I was already a fan of Bryce Courtney having read both the Power of One and the Potato Factory and look forward to reading his other novels."}, {"userName": "Matthew Bushnell", "userReviewDate": "Jan 01, 2011", "userURL": "http://www.goodreads.com/user/show/3602484-matthew-bushnell", "userReview": "Having enjoyed many of Bryce Courtenay's books I simply read this one without knowing anything about the plot. It is hard to critique a book that is really an invitation into the life of the Courtenay family as they share the struggles of their son, Damon, a haemophiliac who later develops AIDS as a result of a blood transfusion. I felt privileged to be brought into the journey as Bryce, (and other family members), shared their joys, sorrows, triumphs and griefs in the midst of a very difficult circumstance. The book is a challenge to greater understanding and compassion for people suffering with AIDS. I commend Courtenay for his raw honesty. Damon would have been an extroadinary person to meet."}, {"userName": "Jacinta", "userReviewDate": "Apr 13, 2015", "userURL": "http://www.goodreads.com/user/show/42118963-jacinta", "userReview": "A deeply personal story from a stellar writing talent. An insight into the harrowing experiences of the Courtenay family around the life and death of son, Damon, who, while receiving blood transfusion to manage haemophilia, contracts HIV. Courtenay describes Damon's journey, couched in the unwaivering love and support of his partner, Celeste, his family, and friends. A labour of love and breathtaking tribute."}, {"userName": "Alicia", "userReviewDate": "Nov 17, 2010", "userURL": "http://www.goodreads.com/user/show/4553661-alicia", "userReview": "No other book as made me want to write to author! This book made me want to do that! I read this book in almost one sitting. You know from the beginning that his son has past on, but I was laughing and crying all the way through. At the end I was a balling mess. This is a true story of the authors son who son contracted HIV+ through a blood transfusion, in the early day of the virus. Please please read this book, if you read nothing else of Bryce Courtney."}, {"userName": "C.", "userReviewDate": "Sep 06, 2008", "userURL": "http://www.goodreads.com/user/show/1425694-c", "userReview": "I think I've written enough reviews about Bryce Courtenay to give a fairly obvious impression of what I think of him. However, my vague recollections seem to tell me that this one was a little different: more genuine, perhaps. Still sloppily sentimental and with the tendency to romanticise characters, but what Courtenay does have in buckets is compassion, and he uses it liberally here. It's as sad a tale as any and you can't help but feel sorry for the guy."}, {"userName": "Lynn ", "userReviewDate": "Apr 19, 2012", "userURL": "http://www.goodreads.com/user/show/3684725-lynn", "userReview": "This is my all time favourite book!I read it after having lived in Australia so the context of the narrative was alive to me. A truly moving account as told by the father of a haemophiliac son in the days when the world was first experiencing the Aids epidemic. This is a beautiful story of love, family and never ending faith in humanity. Unfortunately a really difficult book to get hold of now or I'd buy it for all my friends as a must read!"}, {"userName": "Glenda", "userReviewDate": "Jan 06, 2017", "userURL": "http://www.goodreads.com/user/show/5816015-glenda", "userReview": "very touching, i couldnt put it down"}, {"userName": "Wilma Rebstock", "userReviewDate": "Jul 30, 2011", "userURL": "http://www.goodreads.com/user/show/5924219-wilma-rebstock", "userReview": "APRIL FOOL'S DAY is a very sad but true story,"}, {"userName": "Joanne", "userReviewDate": "Jul 13, 2013", "userURL": "http://www.goodreads.com/user/show/22006608-joanne", "userReview": "Brilliant!"}, {"userName": "F.", "userReviewDate": "Sep 18, 2016", "userURL": "http://www.goodreads.com/user/show/16048143-f", "userReview": "Read years ago. Need to reread"}, {"userName": "Sarah Newton", "userReviewDate": "Feb 17, 2013", "userURL": "http://www.goodreads.com/user/show/12384449-sarah-newton", "userReview": "This book is incredible. So sad and tragic, be prepared for lots of crying. Learned so much about blood and illness. Really wish it was a work of fiction"}, {"userName": "Amanda Jane", "userReviewDate": "Jul 01, 2014", "userURL": "http://www.goodreads.com/user/show/32635305-amanda-jane", "userReview": "Beautifully written! Make sure you are a box of tissues whilst reading.Heartbreaking!"}, {"userName": "Denise DeRocher", "userReviewDate": "Feb 23, 2013", "userURL": "http://www.goodreads.com/user/show/6350600-denise-derocher", "userReview": "About his son dying of AIDS - powerful, heartbreaking, worth reading more than once."}], "description": "In the end, love is more important than everything and it will conquer and overcome anything. Or that’s how Damon saw it, anyway. Damon wanted a book that talked a lot about love. Damon Courtenay died on the morning of April Fool’s Day. In this tribute to his son, Bryce Courtenay lays bare the suffering behind this young man’s life. Damon’s story is one of life-long struggle, his love for Celeste, the compassion of family, and a fight to the end for integrity. A testimony to the power of love, April Fool’s Day is also about understanding: how when we confront our worst, we can become our best.", "title": "April Fool's Day", "url": "https://www.goodreads.com/book/show/510247.April_Fool_s_Day", "average": 4.16, "cover": "https://images.gr-assets.com/books/1387732682l/510247.jpg", "reviews": 291, "authors": [{"url": "https://www.goodreads.com/author/show/63.Bryce_Courtenay", "name": "Bryce Courtenay"}], "type": ["Nonfiction", "Biography"], "outlinks": ["http://www.goodreads.com/book/show/510247.April_Fool_s_Day", "http://www.goodreads.com/book/show/7913379-april-fool-s-day", "http://www.goodreads.com/book/show/835710.April_Fool_s_Day", "http://www.goodreads.com/book/show/920287.April_Fools_Day", "http://www.goodreads.com/book/show/2347486.April_Fool_s_Day", "http://www.goodreads.com/book/show/19428872-april-fool-s-day", "http://www.goodreads.com/book/show/122.The_Power_of_One", "http://www.goodreads.com/book/show/2336.Tandia", "http://www.goodreads.com/book/show/2339.Jessica", "http://www.goodreads.com/book/show/137808.The_Potato_Factory", "http://www.goodreads.com/book/show/2341.Tommo_and_Hawk", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/40205082-everything-is-horrible-and-wonderful", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}