{"ratings": 1284, "userreviews": [{"userName": "Rosie", "userReviewDate": "Jun 15, 2016", "userURL": "http://www.goodreads.com/user/show/55610606-rosie", "userReview": "A obra é uma sátira ao momento de mudança que se vive em Portugal com a Regeneração, séc. XIX. Um fidalgo Transmontano, em tudo por tudo austero e conservador, que ao mudar-se para Lisboa, para exercer o cargo de deputado acaba por se mudar a si próprio, no sentido lato da palavra, ao se deixar corromper pela luxúria que existe na capital. Achei muito atual o tema, mas sobretudo muito muito caricato e divertido. Sinceramente fez-me rir o antagonismo entre o \"antes\" e o \"depois\". A transformação é deveras escandalosa e calamitosa. Contudo, o dialeto floreado parafraseado no parlamento é quase intragável e dei por mim a pensar se era defeito meu, se seria eu muito iletrada ou se os discursos não seriam uma verborreia incompreensível. É um clássico. Vale a pena ler, mais a mais é pequena a obra."}, {"userName": "Gonçalo Fernandes", "userReviewDate": "Jan 01, 2016", "userURL": "http://www.goodreads.com/user/show/49060385-gon-alo-fernandes", "userReview": "[Em A Queda dum Anjo, Camilo Castelo Branco relata ao leitor (como o próprio faz questão de enumerar inúmeras vezes) um intenso e interessante período da vida de Calisto Elói de Silos e Benevides de Barbuda, morgado da Agra de Freimas, \"nascido em 1815, na aldeia de Caçarelhos, termo de Miranda\". É casado há vinte anos com D. Teodora de Figueroa, morgada de Travanca e sua segunda prima, e o matrimónio é utilizado como elo de união das duas famílias.Considerado o herói da história, Calisto Elói é um homem verdadeiramente culto, cujo interesse político assenta na ala legitimista e cujo principal objectivo é oferecer à sua aldeia uma legislação tão nobre quanto ela merece, ignorando as perversões do presente e voltando às leis de um longo passado. O seu interesse pelos clássicos antigos - gregos e romanos - tornam Calisto uma personagem erudita, com bastante atenção ao mundo que o rodeia, e fazem-no apaixonar pela leitura, ao ponto de passar dias fechado na sua biblioteca.Incentivado por locais, Calisto dirige-se a Lisboa e torna-se deputado, defendendo, no Parlamento, os ideais de uma monarquia justa, honrosa e nobre, com desprezo pelo luxo e opulência e concentração na melhoria significativa da vida dos \"lusitanos\". É, aliás, a figura altamente lusitana de Calisto que o torna alvo de chacota no Parlamento (principalmente por parte de Libório), dado o seu ar provinciano e altamente ingénuo. Ao deparar-se com a pobreza de Lisboa em relação aos relatos que havia lido, Calisto começa a perder a esperança de mudar o que seja no rumo do país, não desistindo, ainda assim, de discursar de forma persuasiva e apaixonada em frente aos seus colegas de profissão. Esta irreverente e apaixonada persuasão é notada por Sarmento, um idoso aristocrata que o convida para o seu círculo social. Convivendo diariamente com Sarmento, Calisto Elói conhece as duas filhas da família: D. Catarina - a quem salva de uma relação venenosa - e D. Adelaide - por quem se apaixona vivamente.Ao apaixonar-se por Adelaide, o herói da narrativa descobre um sentimento totalmente novo: o amor. Enquanto casado com Teodora, Calisto sempre fora alheio à paixão, uma vez que sua mulher havia integrado o sentido literal de casamento e optado por viver uma vida tradicional, mais preocupada com a sua habitação do que com o seu marido, o que inevitavelmente leva a uma relação despojada de amor, de paixão, de carinho (sentimentos que Calisto encontra apenas nos seus livros). Porém, ao ver-se novo neste sentimento, Calisto excede a sua posição fidalguia e declara-se horrorosamente a Adelaide, cujo espanto a leva a sair de Lisboa e isolar-se longe de Calisto, para que não o perturbasse.É nesta altura que Calisto se apercebe da crueldade do amor; a paixão que havia nutrido por Adelaide havia mudado mentalment eo deputado, e agora lúcido da sua situação, Calisto decide embarcar num novo eu e muda radicalmente a sua postura, despindo o seu ar de provinciano e simultaneamente vestindo um ar lisboeta. Cai o anjo.Surge na história D. Ifigénia de Teive Ponce de Leão, fidalga viúva de um general com quem se casara no Brasil, e prima em vários graus de Calisto. Magoado pela paixão não recíproca, o herói deixa-se encatar pela aparência de D. Ifigénia, e tão rápido como esqueceu Adelaide, apaixona-se por sua prima, com quem vive um intenso romance. Com a sua mudada aparência e vivendo agora um amor proibido e escondido, Calisto torna-se amante do mundo moderno, lendo literatura francesa e respeitando os ideais do século das luzes.Pasmada pelo total desprezo e pela ausência prolongada de seu marido, Teodora decide partir rumo a Lisboa, impedida apenas pelo seu primo Lopo de Gamboa, que se declara a Teodora como seu verdadeiro amante (para imenso horror de Teodora, que se considera uma mulher honrosa e que nunca trairía os ideais de matrimónio). Calisto encontra-se com Teodora em Miranda, e a sua atitude de desprezo para com a mulher, que durante vinte anos não o amara verdadeiramente uma única vez, e cuja personalidade o levara por um caminho totalmente diferente e mais pobre que o encontrado em Lisboa, é notada por Teodora, que se zanga e o acusa de traição. Calisto abandona Miranda com a promessa de se separar da mulher. Mais tarde, Lopo de Gamboa avisa Calisto que Teodora se dirige a Lisboa para o humilhar, e enquanto Calisto se prepara para abandonar o país de forma a não ser encontrado e confrontado, Lopo aconselha Teodora a dirigir-se a Lisboa, acção verdadeiramente audaz e cruel de Lopo, que afinal havia planeado toda a situação de forma a magoar Teodora e fazê-la odiar Calisto e adorar Lopo. O plano resulta: Teodora abandona Lisboa sem encontrar Calisto e com a certeza absoluta de que o marido a traíra com uma mulher mais bela que ela. Ao chegar a Miranda, decide entregar-se ao amor de seu primo, enquanto Calisto regressa a Lisboa e passa a viver sem preocupações com sua nova mulher: D. Ifigénia. (hide spoiler)]"}, {"userName": "Luís C.", "userReviewDate": "Sep 07, 2014", "userURL": "http://www.goodreads.com/user/show/34132356-lu-s-c", "userReview": "The Fall of an AngelThe character Calisto Eloi of Silos and Benevides of Barbuda was a typical Portuguese gentleman of good family. He married for interest with D. Teodora Barbuda Figueiroa also from good families, and she lived in Caçarelhos. It was traditionalist and was always lagged reality, had the habit of reading, but only classical authors. When he held the presidency of the Chamber, even for just one day, come to think of resurrecting the old legislation to govern.Calisto was elected and left for Lisbon. In the capital, it comes to look old places that no longer exist because of an earthquake, but he had seen in old books he read. In parliament planned to fight for lower taxes, for combating luxury and was always in defense of morals and good customs. It became known by the ancient and difficult language. I was always concerned about making pompous speeches.One day, when he met a woman named Adelaide, Calisto found that had never truly loved. But Adelaide did not relate to a married man. Soon after, he meets the young widow of General Ponce de León. The woman, a Brazilian, was blond, was about thirty years and was behind Calisto to get a pension. He ended up in love with her and rode him a house.From this moment, gave a total transformation in the life of the character. Calisto takes on modern customs before condemned. Before it was too stuck in the past and traditions, but at the end leaves grow a mustache and goatee, wearing modern clothes, forget Theodora wife, goes to spend a lot of money, switch to the opposition and definitely separates it from the woman who ends up marrying a cousin.\nHighly recommended by my cousin Iphigenia (Portuguese cousin, of course) whose name I treat affectionately Jenny, which is one of the characters of the book .."}, {"userName": "Tempo de Ler", "userReviewDate": "Sep 23, 2014", "userURL": "http://www.goodreads.com/user/show/10165683-tempo-de-ler", "userReview": "O fidalgo Calisto Elói, por brilhar entre ignorantes, é encaminhado para Lisboa com o objectivo de representar os seus eleitores. Para trás deixa a propriedade rural, a esposa trabalhadora e, pouco a pouco, todos os seus escrúpulos...Chegado à corrupta capital, o contraste é gritante: Calisto está fora de moda...em vários sentidos! Sem querer reconhecer que o mundo evoluiu, insiste para que se façam aplicar leis e regras desactualizadas; escandaliza-se com pouco, critica tudo e está determinado em levar à letra os seus clássicos de literatura, apesar destes darem provas, uma e outra vez, de não lhe trazer nada de bom. Muito púdico, Calisto confronta os seus oponentes políticos com inteligência e distinção, enchendo-se de moralidades para lhes tecer severas críticas. Contudo, na sua ânsia por converter...Calisto acaba convertido. As traições sucedem-se umas às outras e em vários níveis (ideais, valores, crenças, os estimados clássicos, os amigos e até a esposa) quando o coração de Calisto se sobrepõe à razão que sempre o orientou. Poderíamos afirmar que, com isto, o pobre Calisto se trai a si mesmo mas temos que reconhecer que, embora agindo injusta e cegamente, Calisto apenas queria amar e ser amado. Lamentavelmente, esta busca pela felicidade tornou-o tão velhaco e escorregadio como os seus anteriores alvos de censura. Nesta crítica à sociedade e muito provavelmente em justificativa às suas próprias decisões e comportamentos, Camilo Castelo Branco serviu-se de um vocabulário rico, carregado de humor e injectado de sarcasmo que, só por si, já vale a leitura. A história não abunda em originalidade mas a competência do autor dá tamanha graça e vida às suas personagens que o rumo da narrativa acaba por se tornar secundário."}, {"userName": "Lucy Qhuay", "userReviewDate": "Aug 21, 2016", "userURL": "http://www.goodreads.com/user/show/7115693-lucy-qhuay", "userReview": "No que toca à escrita do autor não há nada a apontar, mas quando se fala das personagens e do enredo já é outra história.O protagonista e suposto 'anjo', Calisto Eloi é uma figura anedótica e puritana, com a mania que sabe muito e é um senhor distinto, mas na verdade é ridicularizado por grande parte das pessoas que o rodeiam.Já a sua mulher, D. Teodora, é simplesmente cega e igualmente ridícula, por confiar demais nas pessoas e deixar-se enredar em coisas que são 'areia de mais para a sua camioneta', como diz a expressão.Enfim, esta novela não vai a lado nenhum."}, {"userName": "Nuno Ramos", "userReviewDate": "Aug 10, 2017", "userURL": "http://www.goodreads.com/user/show/68640706-nuno-ramos", "userReview": "Agradável surpresa, de fácil leitura. Camilo mostra-nos a ambivalência de duas culturas no mesmo país. O Portugal do rural , do antigo, em contraponto com o Portugal urbano , de Lisboa , do parlamentar. Mostra-nos como se chega a deputado e como essa nova vida faz alterar a forma de viver e ver os novos tempos, passando do partido Legitimista (conservador) a liberal.Pontua o humor com a sagaz visão de um País em mudança."}, {"userName": "Amanda Prado", "userReviewDate": "Oct 04, 2017", "userURL": "http://www.goodreads.com/user/show/50424944-amanda-prado", "userReview": "2.5 estrelas. .5 a mais pela “moral final” diferenciada, mas de resto é uma história já bem batida."}, {"userName": "Jorge Maia", "userReviewDate": "Dec 03, 2012", "userURL": "http://www.goodreads.com/user/show/9250562-jorge-maia", "userReview": "Publicado em 1866, o romance A Queda dum Anjo (para uma visão rápida e esquemática da obra ver aqui ou aqui) será, juntamente com Amor de Perdição, uma das obras mais lidas de Camilo Castelo Branco. Algumas leituras apressadas vêem na obra uma crítica à corrupção de costumes ou uma paródia ao que se vivia em Portugal, na época, ou mesmo uma espécie de gargalhada que Camilo lança ao rir-se de si mesmo. A obra talvez permita essas leituras. No entanto, elas parecem claramente redutoras daquilo que o romance permite ler. A temática da queda é central na cultura judaico-cristã. A queda de Adão e Eva ou a queda de Lúcifer, o anjo da luz, são mitos estruturantes do nosso imaginário e estão presentes na própria construção da obra. Fundamentalmente, a queda do casal originador da espécie humana. O que surpreende na leitura do romance é que a queda não arrasta consigo o castigo. Pelo contrário, a queda trouxe a felicidade ao herói caído. Se há ironia na obra, ela começa com o título e a forma como a temática da queda é tratada.Duas linhas de reflexão podem ser interessantes. Uma diz respeito à tensão entre eternidade e historicidade. A segunda mobiliza os pólos da convenção e da natureza. Da conjugação destas duas linhas poder-se-á encontrar uma chave de leitura que se coloque para além das abordagens escolares e rotineiras sobre esta obra de Camilo. A queda é o elemento central onde se cruzam estas duas linhas.Continuar a ler em: http://kyrieeleison-jcm.blogspot.pt/2..."}, {"userName": "Jorge", "userReviewDate": "Jul 31, 2011", "userURL": "http://www.goodreads.com/user/show/1899728-jorge", "userReview": "Sinceramente esperava mais deste livro. O seu argumento parece-me um pouco gasto. O provinciano vem para a a cidade e deixasse corromper pela mesma. Parece que os escritores destes tempos viam um antítese entre o campo virtuoso e a(s) cidade(s) como o antro do pecado. Eu não creio que esta dicotomia alguma vez existisse.Quanto à vertente mais politica do livro de Camilo Castelo Branco nada de novo acrescenta ao facto de em Portugal nós termos uma aversão à vida política mais ou menos endémica. Mas, por outro lado, sermos pouco eficazes na criação de soluções para a resolução dos males que tão facilmente detectamos (sobretudo nos outros). Talvez isso aconteça por vivermos durante séculos na Lua (ou seja Ásia/Índia, América/Brasil e África (Angola, Moçambique, etc.).Como esse mundo acabou, voltámos por assim dizer à nossa matriz inicial. Talvez seja tempo de escrever, não apenas sobre o que está mal mas sobretudo, sobre o que há a fazer para sermos, como povo, mais felizes."}, {"userName": "R.B.", "userReviewDate": "Dec 08, 2014", "userURL": "http://www.goodreads.com/user/show/11329643-r-b", "userReview": "Não sou um tradicional apreciador do estilo de Camilo, mas esta novela sobre a queda moral de um grande peixe pronviciano quando se muda do seu aquário para o grande mar, foi diferente sem o ser.Penso que a grande diferença foi a extensão. Para o que costuma ser a escrita de Camilo tudo toma uma forma muito mais condensada o que faz com que não haja grandes delongas nas paixões assolapadas nem com que haja muito espaço para dissertar sobre a tragédia do viver.Facilmente, se quisessemos esconder de um leitor o destino que está reservado ao nosso Barbuda, poderíamos mudar o título da obra para Camilo Condensado. Não o podendo fazer, leiamos pois esta obra, sorrindo com as passagens que nos remetem para estes tempos tão distantes e tão iguais, e admirando como Camilo consegue colocar no papel o seu sentiment de repulsa para com o Portugal do seu tempo."}, {"userName": "Inês Montenegro", "userReviewDate": "Oct 20, 2014", "userURL": "http://www.goodreads.com/user/show/4802863-in-s-montenegro", "userReview": "Não chamaria Calisto de “anjo”. Desde o início que a sua personagem se assemelha mais ao tipo de beata que apregoa e exige a moralidade e “bom” comportamento dos demais, maldizendo-os, apenas porque não esteve ainda numa posição similar. E, de facto, quando a oportunidade lhe surge, cede à imoralidade como todos os outros. Mais do que a queda de um anjo, título irónico, é o percurso de um homem comum, que não foi capaz de agir como falava.Review completa em: https://booktalesblog.wordpress.com/2..."}, {"userName": "Sofia", "userReviewDate": "Nov 05, 2011", "userURL": "http://www.goodreads.com/user/show/4306189-sofia", "userReview": "Esta novela de Camilo Castelo Branco volta a pegar na sátira de obras como Eusébio Macário para criticar novamente a sociedade da época. No entanto, o estilo da prosa é algo diferente, mais pesado e um pouco moralista. Há enormes nacos de texto que, sinceramente, me quebraram imenso o ritmo (e a vontade) da leitura, e nota-se uma grande diferença do passo da narrativa a certa altura. Do autor prefiro os devaneios românticos de Amor de Perdição ou as comédias de costumes Eusébio Macário e A Corja."}, {"userName": "S.", "userReviewDate": "May 05, 2016", "userURL": "http://www.goodreads.com/user/show/7627658-s", "userReview": "2,5"}, {"userName": "Fernando Nunes", "userReviewDate": "Jan 14, 2018", "userURL": "http://www.goodreads.com/user/show/30757648-fernando-nunes", "userReview": "Da transformação do homem, de rural a urbano; de prolixo a comedido no discurso. Da encenação política e da competição da incompetência. De tudo isto trata o livro. Mas nota-se, porventura só noto eu, que Camilo queria despachar a encomenda a toda a velocidade. Quem sabe se não teria já recebido do editor os réditos respectivos. Contudo, é Camilo a escrever, com a elegância que a sua pena nunca descurou."}, {"userName": "Bic", "userReviewDate": "May 17, 2016", "userURL": "http://www.goodreads.com/user/show/5288500-bic", "userReview": "«A Queda dum Anjo» é a história de Calisto Elói, morgado da Agra de Freimas, casado com D. Teodora de Figueiroa e deputado eleito às cortes pelo círculo de Miranda. Representando uma posição legitimista, dispõe-se a combater a corrupção vigente em Lisboa. Os valores que defende são tradicionais, o que faz com base numa cultura livresca antiquada. Combate o abastardamento desses costumes no meio urbano. A personagem de Calisto Elói sofre uma metamorfose, essencialmente pelo contacto com o meio urbano e pela experiência do amor que nunca antes sentira e a que não resiste. Enceta uma relação ilícita com D. lfigénia Ponce de Leão, com quem terá dous filhos, acabando por rejeitar a mulher, D. Teodora de Figueiroa, que por sua vez se unirá a um primo, de quem terá também um filho. Sendo uma sátira social, as personagens d' «A Queda dum Anjo» funcionam como estereótipos do suposto quadro social e cultural da época. A obra pode eventualmente servir como referência do quadro sócio-cultural da época. «A Queda dum Anjo», cuja narração nos é revelado situar-se em 1864, foi publicada pela primeira vez em 1865, portanto, numa fase de transição para o realismo (a Questão Coimbrã é desta altura) quando o romantismo em meados do séc. XIX evoluía com maior vigor no sentido da crítica social e duma crescente observação realista da sociedade. Na transição do ultra-romantismo para o realismo, «A Queda dum Anjo» representa uma novela de actualidade afectada duma certa preocupação moralista, mas uma visão burguesa das realidades limita a abordagem dos temas sociais. Contudo, é pelo moralismo e pela crítica social carregadas de ironia que se aprofundam conteúdos mais realistas. Camilo toca-os na crítica dum cenário rural que gira em torno duma aristocracia de reminiscência antiga; e na crítica social urbana, do meio burguês e do meio parlamentar da Regeneração. São os ambientes e caracteres conformados ao romantismo que são mostrados com mais sarcasmo. É também um publico burguês fruto do romantismo o alvo da produção literária. O significado deste paradoxo não é claro, mas é lícito pensar numa intenção interventiva. Enfim, Camilo oscila entre o esquema da novela passional e a novela satírica de costumes. N' «A Queda dum Anjo» contendem as duas, que o novelista raro conseguiu resolver numa síntese ficando assim ao nível da oposição idealismo/materialismo (no sentido moral mais vulgar)..."}, {"userName": "Isabel Maia", "userReviewDate": "Jul 30, 2010", "userURL": "http://www.goodreads.com/user/show/2074673-isabel-maia", "userReview": "Calisto Elói, morgado de Agra de Freimas, vive numa pequena aldeia, de seu nome Caçarelhos, em perfeita harmonia com a sua esposa, D. Teodora de Figueiroa. O conhecimento dos clássicos, aos quais dedicou as leituras de toda uma vida, encheu-o de uma sabedoria moralista e conservadora que faz com que seja eleito deputado pelo círculo de Miranda. A sua presença em Lisboa e os seus discursos no Parlamento fazem sensação por causa da defesa da moral dos costumes antigos em detrimento do luxo e dos teatros. A experiência da sociedade lisboeta, no entanto, não deixa o morgado imune. A contaminação da personagem e os indícios da queda expressam-se exteriormente através da primeira visita a um alfaiate lisboeta. Esse é o primeiro passo de um percurso que culminará na transfiguração de anjo em alguém que a sua própria mulher não reconhecerá. Esta transfiguração exterior traduz uma metamorfose moral, consumada na defesa de princípios liberais em discursos tão ocos como aqueles que no início condenara e na ligação adúltera que mantém com uma viúva brasileira, D. Ifigénia Ponce de Leão. Com isto, Camilo pretende, usando a história de Calisto como alegoria, traçar o processo de contaminação de um Portugal saudável e incorruptível pelas mudanças políticas, sociais, culturais e religiosas da época.Confesso que já não pegava em Camilo Castelo Branco desde que estudei o livro Amor de Perdição no Ensino Secundário. Aproveitei que me cruzei com este exemplar bastante em conta na Feira do Livro da Póvoa de Vazim para o adquirir e encontrar-me de novo com a obra camiliana. Através da história de Calisto, Camilo defere duras críticas à sociedade, com especial enfoque na classe política. Mas apesar de essas mesmas críticas serem pungentes, o tom com que o autor aborda ao tema é leve. Camilo utiliza o humor, criando uma série de personagens-tipo para alcançar o ponto a que pretende chegar. É esse humor que, de certa forma, facilita a leitura desta obra e não a torna demasiado maçadora ou cansativa. Foram várias as gargalhadas que dei durante a leitura, principalmente nos momentos de discussão parlamentar. Os discursos da Assembleia em 1820 parecem tão vagos de ideias e tão cheios de palavras vãs como os de hoje. Um livro interessante, que recomendo a quem tem gosto pelos livros considerados clássicos da nossa literatura."}, {"userName": "Mafalda", "userReviewDate": "Jun 30, 2010", "userURL": "http://www.goodreads.com/user/show/2124504-mafalda", "userReview": "Been wanting to finish this one for quite some time. I had tried to read it before, but I always got stuck in the first few chapters. Now I know it really isn't my fault because the book starts with a whole lot of establishing who the main character is, how he behaves, looks and feels about the world, and in particular, politics. A Queda D'um Anjo is the story of Calisto Elói, a simple man from the Minho region who comes to Lisbon because he's persuaded by his closest friends that he should be in the parliament, setting the example. I won't reveal too much, but I'll say this: the title explains it all. It's a very cutting novel, digging into the worst of our political class - and it is, unfortunately, not dated in the slightest. I read that this book is quite different from what we would expect of Castelo Branco, since he's mainly known for his novels. As the only other one I've read is Amor de Perdição, I can't judge, but I will recommend this, as it is a very easy and gripping read. Also, it has many funny moments, especially when Calisto is just settling in his Lisbon quarters. In one of them, for example, he was feeling a bit under the weather, so he decided to follow the advice of one of his \"classics\" and drink the reinvigorating water from a fountain in Lisbon. It just so happens that after drinking that water, he felt even worse, which made him look at the book again and see that the cure for an upset stomach (which was caused by the same, possibly polluted water he drank) was drinking some more of that water. That chapter ends with the narrator informing us that from then on, he only drank wine. Also, the book ends on a slightly unexpected note, but that just added to its value as one of the great portuguese classics.Excerpt:Fez Calisto uma longa pausa, e prosseguiu, interpolando os dizeres com algumas pitadas, que solenizavam a gravidade das falas.- Ninguém devera casar sem muito ler e sem aplaudir aqueles preceito do casamento escritos pelo eminentíssimo Plutarco.- Não conheço - disse a dama... - Li Le mariage, de Balzac.- Não sei quem é; deve ser francês.- Pois não leu?- Eu não leio francês. Não me chega o meu tempo para tirar águas sujas de poços infectos.as seen in: http://cherry-rambles.blogspot.com/20..."}, {"userName": "Helena", "userReviewDate": "Apr 08, 2009", "userURL": "http://www.goodreads.com/user/show/2193881-helena", "userReview": "A Queda Dum Anjo é o título de um romance satírico de Camilo Castelo Branco, escrito em 1866.O «anjo» da história é Calisto Elói de Silos e Benevides de Barbuda, um fidalgo da província transmontana que se deixa corromper pelos luxos e pela devassidão de Lisboa, quando para aí se desloca para representar a sua terra no Parlamento, como deputado. O factor peremptório para a sua «queda» foi o amor, sentimento desconhecido para o protagonista até então, devido à sua pacata vida na sua terra natal, sempre alheado do mundo e absorvido pelos seus livros. Inicialmente, apaixona-se por Adelaide, filha do desembargador, mas como não é correspondido, rapidamente encontra quem o console: a sua prima Ifigénia, a mulher fatal que até o faz deixar a sua esposa, D. Teodora.Dá-se também uma alteração nos valores defendidos por Calisto: de adepto do partido miguelista passa a defensor das ideologias do partido liberal, abandonando a sua irrepreensível conduta moral, a intolerância para com a modernização que corrói as bases da sociedade e os princípios tradicionais que erigiram a nação portuguesa. Muda até de aparência: deixa de usar os trajes antiquados da sua terra e passa a acompanhar as tendências da moda lisboeta.Separado da sua mulher junta-se a Ifigénia da qual tem dois filhos. Também D. Teodora «dá frutos», tendo um filho do seu primo Afonso Lopo de Gamboa.Em suma, A Queda Dum Anjo é o retrato exagerado do político português do século XIX: primeiro, simples, ingénuo, temente a Deus, desprovido de maldade; depois, corrupto, fútil, arrebatado por paixões e pouco cioso dos seus deveres. Por isso, \"Calisto Elói, protagonista de A Queda Dum Anjo, é lido como símbolo de Portugal, nação dividida em duas temporalidades: o velho e o novo, o antigo e o moderno»."}, {"userName": "Catarina", "userReviewDate": "Jun 08, 2014", "userURL": "http://www.goodreads.com/user/show/11205539-catarina", "userReview": "Este livro é uma crítica aos vícios do homem, e embora se foque numa época passada, não podia ser mais actual do que efectivamente é.Camilo Castelo Branco escreve para o leitor como quem fala com ele, e todo o livro tem reflexões pessoais do autor e comentários que colocam a história sob outra perspectiva. São como pequenos segredos que só o autor e o leitor conhecem, como se de longe estivéssemos a observar a vida do protagonista, em vez de estarmos a ler sobre ela.Achei esta forma de escrever sublime e muito diferente do habitual. Tanto nos provoca surpresa em determinados momentos, como nos faz sorrir estupidamente por algum comentário mais mordaz ou engraçado.Contudo, raramente se desvia do cerne da questão, e ao longo de todo o livro vamos acompanhando a mudança de Calisto, sem grande surpresa.É comummente aceite que qualquer homem de bom coração, idealista e convicto das suas opiniões, que entre na política, depressa percebe que não ira muito longe se não optar por escolher um lado e seguir os hábitos e opiniões do lado que escolher. Calisto vai mais longe na sua mudança, tão radical que quem o conheceu toda a vida mal o reconhece no fim, e deixa-se consumir pelos vícios da cidade, sob a desculpa de uma vida outrora insatisfeita, usando o amor como motivo para tão grande mudança.O anjo cai, de facto, porque de anjo nada tinha, era apenas igual a todos os outros homens, que se deixam levar pelo que desejam, na maioria das vezes sem pensarem primeiro nos seus deveres.Um livro em bom português e muito esclarecedor, que merece fazer parte dos clássicos da nossa literatura :)"}, {"userName": "Sarouel", "userReviewDate": "May 28, 2010", "userURL": "http://www.goodreads.com/user/show/3137554-sarouel", "userReview": "jádoreA partir de agora, cada vez que me referir a Camilo Castelo Branco, utilizarei a expressão \"Jádore\" (para quem se lembra do anúncio de perfume, em que uma tipa entrava dentro de uma piscina com um líquido dourado, dizia \"J'adore\" e é a essa entoação que quero chegar!), porque gosto assim tanto.História de amor que pretende ser protagonista, mas que disfarça a crítica social, moral e cultural que CCB faz a Portugal do seu tempo. No entanto, se for lido agora praticamente não existem diferenças, é só mais uma questão de semântica. ´O protagonista aparece-nos como um sujeito relativamente simples, pragmático dentro dos seus limites, guiado pelo que considera a \"receita\" para uma vida ideal (?). É mandado para a cidade grande, onde se dá o choque cultural e tudo muda. No meio deste caminho, ficamos a conhecer alguns aspectos da vida social e política de Lisboa no séc.XIX. Não me quero esticar mais, porque tendo sempre a escrever sempre mais um pouco e não quero desvendar nada. É um livro muito fácil de ler, podemos ler a estória ou a história, ou ambas se tivermos vontade...Enjoy!!!boas leituras, put the cream on porque não queremos ter cancro!!"}, {"userName": "Daniela Rodrigues", "userReviewDate": "Nov 20, 2012", "userURL": "http://www.goodreads.com/user/show/5722462-daniela-rodrigues", "userReview": "Gosto de Camilo! Há anos que queria ler livros dele. Lembro-me de ser pequenina e de passear na papelaria da minha tia a olhar para os livros que um dia haveria de ler e de ter uma especial curiosidade por Camilo. Todos me diziam que era um grande romancista português. Mas, talvez devido à época em que viveu, convenci-me de que teria uma escrita muito intrincada e de difícil acesso. Atualmente, não podia estar em mais desacordo. Apesar do lirismo com que escreve (que me leva a sentir um pouco como Calisto quando Libório discursa no Parlamento), este é um livro de mais de 200 páginas que se lê num ápice e que dá gosto acompanhar. Gosto do modo como ele se assume como narrador de algo que \"realmente aconteceu\" e como descreve as gentes e costumes daquela época. Na altura, tal como hoje, o Parlamento era, de certo modo, uma chachada. Falavam, falavam e pouco ou nada diziam. E para a mim a grande surpresa foi o divórcio! Não fazia a mais pequena das ideias de esse conceito já existia no final do século XIX!"}, {"userName": "Agostinho Barros", "userReviewDate": "Jun 23, 2016", "userURL": "http://www.goodreads.com/user/show/56688252-agostinho-barros", "userReview": "A Queda dum Anjo vem relatar um época retrograda, que recua à inícios do século XIX para retratar de forma crítica a sociedade e a política do país, realçando de igual modo as fases de transição de um Portugal antigo para um Portugal moderno. Publicada em 1860, esta obra apresenta uma evidente dependência com o passado, no passadismo do “anjo” que cai bem como no contraste com o Portugal atual, sendo que, como refere Óscar Lopes a obra faz uma sátira da vida política e parlamentar do constitucionalismo, e exalta o arcaico provinciano de Angra de Freimas que é corrompido pela alta burguesia de Lisboa A segunda metade do século XIX é marcada pelas grandes mudanças ocorridas ao nível das infraestruturas e meios de comunicações. Este período é marcado pelas políticas fontistas de Fontes Pereira de Melo que farão o país progredir gradualmente apesar de ainda atrasado perante os outros países.Tratando-se de uma obra recorrentemente discursiva, o narrador irá narrar os conflitos entre Calisto Elói e Libório Meireles (portuense"}, {"userName": "Tita", "userReviewDate": "Sep 18, 2014", "userURL": "http://www.goodreads.com/user/show/2120755-tita", "userReview": "Este é o segundo livro que leio de Camilo Castelo Branco e se já não tinha gostado particularmente de \"Amor de Perdição\", ainda consegui gostar menos deste \"A Queda dum Anjo\".Calisto Elói é um morgado transmontano, conservador e defensor dos bons costumes, que é eleito deputado e é enviado para Lisboa, onde acaba por \"ceder às tentações\" da capital. Eu percebo a tentativa de criticar os costumes da época, principalmente das grandes cidades, que poderiam ser vistas como boémias, mas não me convenceu a visão entre aldeia vs cidade e virtuoso vs pecado.Acho a escrita de Camilo chata, demasiado floreada e trabalhada. Quanto à história, também não a achei nada de especial, focando-se nas alterações de comportamento de um homem defensor da moral e bons costumes, que acaba por se transformar no aposto.Não gostei e julgo que não voltarei a ler Camilo Castelo Branco, pelo menos nos próximos tempos."}, {"userName": "Fernando Ferreira", "userReviewDate": "Nov 12, 2013", "userURL": "http://www.goodreads.com/user/show/22931607-fernando-ferreira", "userReview": "Excelente. Camilo Castelo Branco, com a maestria que lhe é típica, constrói uma engraçadíssima narrativa onde não fica pedra sobre pedra: seus personagens são todos impiedosamente achincalhados! E isso em meio a cenas de rasgada ironia e comicidade. Camilo consegue escancarar ao leitor todos os vícios e fraquezas morais de seus personagens, mas o faz sem ódio, sem rancor, sem despeito. As gargalhadas plautinas que o livro oferece são impagáveis. Nota aqui para a lide parlamentar entre Calisto Elói e o afamado Dr. Libério (ou Libório), verdadeiro festival de oratória empolada e bolorenta!Mas claro que a obra não fica apenas no cômico e no irônico. Camilo, em meio às parvoíces de Calisto Elói e outros, mostra a baixeza da sociedade lisboeta, intoxicada de costumes e modismos franceses, vulgar e interesseira. De outro lado, o retrato da antiga aristocracia rural, saudosa de sua honra e posição que não existem mais, decadente e esquecida.Em suma, é diversão garantida por algumas horas."}, {"userName": "Jorge", "userReviewDate": "Oct 20, 2014", "userURL": "http://www.goodreads.com/user/show/4511126-jorge", "userReview": "Em primeiro lugar devo dizer que há muito tempo que não me custava tanto seguir uma narrativa. O estilo de Camilo é divertido e satírico, mas também faz uso de um português bastante complexo e não muito acessível. Embora tenha andado um bocado perdido em certas descrições, ou parágrafos mais aprimorados, a verdade é que esta Queda de um Anjo tem pormenores deliciosos. É a história de um provinciano muito versado nos clássicos, Calisto Elói, que eleito deputado da Assembleia em Lisboa, aos poucos vai-se deixando “corromper”, e percebe que a sua existência tinha sido até então muito limitada.Quem conhece a vida real de Camilo Castelo Branco vai encontrar neste livro paralelismos evidentes, nomeadamente na apologia ao divórcio, que não era muito bem vista pelos seus conterrâneos.Embora tenha gostado dos ditos pormenores satíricos e humorísticos, no cômputo geral acho que este livro não tem grande substância. Daí a minha pontuação: 3 estrelas."}, {"userName": "DonQuijote", "userReviewDate": "Sep 04, 2013", "userURL": "http://www.goodreads.com/user/show/9945545-donquijote", "userReview": "Teniendo en cuenta el momento histórico/literario en el que se escribe esta novela, cabe destacar su retórica, los argumentos, el amplio vocabulario, la descripción, la ironía, el estilo... todo! No obstante, por ser una lectora del s. XXI todos esos elementos que hacen del libro una gran obra y de Camilo Castelo Branco un clásico de la literatura portuguesa me resultan en ocasiones pesados. Con los discursos en la tribuna del parlamento me pierdo, al final no sé qué estaban discutiendo!! Demasiadas metáforas, demasiadas referencias a otros escritores, a veces pierdo el hilo del argumento. El final de la historia, más mundano, resulta más entretenido y hace que se merezca la cuarta estrella."}, {"userName": "Vasco Ribeiro", "userReviewDate": "Jun 19, 2014", "userURL": "http://www.goodreads.com/user/show/32313077-vasco-ribeiro", "userReview": "Camilo Castelo Branco é um escritor genial. Pena que tivesse de viver da escrita, porque isso em alguns casos obrigou-o a escrever, do que se ressentiu a qualidade de algumas das suas obras. Não é o caso desta. A história está bem construída, as personagens, se bem que caricaturadas, são nossas conhecidas: Portugueses, e Portuguesas, de todos os tempos. O livro merecia que eu o saboreasse mais e com mais tempo para merecer que Camilo, como é seu hábito, dialogasse com o seu leitor, numa alegre e bem disposta cavaqueira em que nem sempre estamos à sua altura. É certo que gosto mais deste Camilo, quase realista, do que do Camilo Romanticão dos grandes dramas. E também acho que o Camilo se gostava e revia mais nesta veia elevadamente cáustica."}, {"userName": "Miguel", "userReviewDate": "Jun 19, 2014", "userURL": "http://www.goodreads.com/user/show/30476196-miguel", "userReview": "É uma história simples, mas bem contada. Espirituosa e divertida, cai no entanto no exagero em determinadas situações, forçando certas atitudes e características às personagens que provavelmente não seriam tão lineares fora do universo fictício. Em todo o caso, é uma deliciosa ilustração dos costumes da época - muito semelhantes aos dos nossos nossos dias.A linguagem, essa, é riquíssima (se bem que um pouco floreada e afastada do Português corrente)."}, {"userName": "Marisa Martins", "userReviewDate": "Aug 18, 2016", "userURL": "http://www.goodreads.com/user/show/38870824-marisa-martins", "userReview": "Sobre o livro: trata-se de um romance satírico que descreve a corrupção da personagem principal, o fidalgo Calisto Barbuda, ao mesmo tempo que faz uma caricatura da vida social, da política e dos costumes de Portugal naquele tempo.É daqueles livros que se lêem em três tempos! Gostei muito da história, achei muito irónico, ao mesmo tempo que era engraçado também. Impossível não achar piada a algumas passagens."}, {"userName": "Nightingale_jt", "userReviewDate": "Jul 30, 2014", "userURL": "http://www.goodreads.com/user/show/33469334-nightingale-jt", "userReview": "I just love to read Camilo Castelo Branco's works. The story is so funny and the characters are so likeable. I got lost sometimes when I was reading, because Camilo stops the action to describe things. And he spends so much time describing that when he returned to tell the story and the action continued, I had to go back and see where werer we before."}], "description": "Uma das novelas mais célebres de Camilo Castelo Branco (publicada em 1866, no Porto) constitui uma notável caricatura da vida política nacional, mas também uma parábola humorística acerca do desvirtuamento do Portugal antigo.O protagonista, Calisto Elói, um fidalgo transmontano, austero e conservador, é uma espécie de encarnação satírica desse Portugal: eleito deputado, Calisto vai viver para Lisboa, onde se deixa corromper pelo luxo e pelo prazer que imperam na capital, tomando por amante uma prima afastada, Ifigénia, e transitando da posição miguelista para o partido liberal no governo.Ironicamente, a esposa de Calisto, Teodora, uma aldeã prosaica, imita-o na devassidão: vendo-se desprezada pelo marido, une-se a um primo interesseiro e sucumbe ela própria aos vícios da modernidade.", "title": "A Queda dum Anjo", "url": "https://www.goodreads.com/book/show/3401591-a-queda-dum-anjo", "average": 3.73, "cover": "https://images.gr-assets.com/books/1239040397l/3401591.jpg", "reviews": 51, "authors": [{"url": "https://www.goodreads.com/author/show/465498.Camilo_Castelo_Branco", "name": "Camilo Castelo Branco"}, {"url": "https://www.goodreads.com/author/show/5764540.Ant_nio_Sousa_Homem", "name": "António Sousa Homem"}], "type": ["Classics", "European Literature", "Fiction", "Cultural"], "outlinks": ["http://www.goodreads.com/book/show/3401591-a-queda-dum-anjo", "http://www.goodreads.com/book/show/8135196-a-queda-de-um-anjo", "http://www.goodreads.com/book/show/16035320-a-queda-dum-anjo", "http://www.goodreads.com/book/show/18214542-a-queda-dum-anjo", "http://www.goodreads.com/book/show/18334202-a-queda-dum-anjo", "http://www.goodreads.com/book/show/13039013-a-queda-dum-anjo", "http://www.goodreads.com/book/show/6386899-a-queda-dum-anjo", "http://www.goodreads.com/book/show/20437166-a-queda-dum-anjo", "http://www.goodreads.com/book/show/15720787-a-queda-dum-anjo", "http://www.goodreads.com/book/show/7830319-a-queda-dum-anjo", "http://www.goodreads.com/book/show/909710.Amor_de_Perdi_o", "http://www.goodreads.com/book/show/7914378-a-brasileira-de-prazins", "http://www.goodreads.com/book/show/8175423-eus-bio-mac-rio", "http://www.goodreads.com/book/show/5391590-amor-de-salva-o", "http://www.goodreads.com/book/show/9190226-o-retrato-de-ricardina"]}