{"ratings": 473, "userreviews": [{"userName": "Cheryl Gatling", "userReviewDate": "Mar 30, 2012", "userURL": "http://www.goodreads.com/user/show/4604883-cheryl-gatling", "userReview": "I picked this book up more or less by accident, and was thrilled to find that it takes place in Syracuse, my home town. The characters work at Johnson-Crowes hospital, which is obviously meant to be Crouse-Irving hospital, where I work. They live in Euclid, which is a real town north of the city. References to the Onondaga Indian Reservation, the Moyers Corners Fire Department, \"the strip between the hospital and Syracuse University\" that is Marshall Street, watching the Orangemen, and driving up to eat fish on the shore of Lake Ontario all gave me a thrill. (Although I was disappointed that on page 181, Melvina tells Jem that Onondaga Lake is salt water, which is not true. It is true that Syracuse was once one of the world's major salt producers, but the salt came from underground springs.) Why is this book not better-known locally? Why aren't Syracuse book clubs eating it up? Of course the book is not really about Syracuse. It could have been set in almost any other American town. It is about Matussem Ramoud, immigrant from Jordan (not Jordan, near Elbridge, but Jordan the country), and his two grown daughters. Matussem is dazed and directionless since the death of his wife. His joy is playing jazz drums with his band made up of himself and a few guys from the gas station. The girls need husbands, or so the Jordanian relative insist. The book is about individuality versus family expectations. The book is about what is home? What does it mean to be Arab in America? (This was still a problematic question, even before 9/11.) And how do you deal with the death of your mother? These questions are implicit throughout most of the book's wandering, leisurely narrative, and emerge mostly at the end. The ranting of the Jordanian characters, in their accented English is hilarious, and reminded me, as it did others, of My Big Fat Greek Wedding. I found the characters of the (self-described) \"white trash\" neighbors uncomfortably stereotypical. The info at the back of the book says that the author used to live in Euclid, New York, so I have no doubt that she based the Otts and Ellises on people she actually knew, but still... you know you're a redneck when your trailer is surrounded by trash, and you have a passel of children by different fathers, and you can't read. I also thought that in a book published in 1993, the author should have known better than to have Melvie the Super-Nurse wear a white uniform and a cap. Whites and caps were long dead by then. But I quibble. The writing was beautiful, and there was a sad, sweetness under the funny family conflict."}, {"userName": "Sherien", "userReviewDate": "Mar 29, 2009", "userURL": "http://www.goodreads.com/user/show/260861-sherien", "userReview": "Arabian Jazz is a story depicting the Jordan immigrant experience and their struggle to cope with cultural conflict in America. Jemorah and Melvina, the second generation in the story are American born who are half Jordan and half Irish American trapped in the ‘in betweeness’ issues. Are they Arab? Are they American? They don’t feel a strong bond towards the Jordan culture but on the other hand, the American society don’t perceive them as truly American. Through out the story we follow their conflict in finding identity. Marriage and class is also an issue that this story tries to deliver. Should the girls follow and be ‘good’ obeying Jordan girls and marry Jordan men? Should they even have to marry at all? If yes to whom? To an Arab or to their American lovers? As with the main characters in this story, the American society (characters) depicted in this story are those from the middle and lower class. In a bigger perspective, this story shows how (like an immigrant in an American society) the lower class people regardless of what their nationality are, can also be an outcast in their society.The first generation in this story discovers how hard it is to try to maintain their motherland culture. The father—Matussem is an interesting character in my opinion. After living for so many years in America, later on he couldn’t find himself quite at ‘home’ in his motherland—Jordan. The American society will always see him and his family as an outcast. His passion in his Jazz music can be seen as his way of finding ‘home’. His Jazz music is his true identity. At some parts, I could not thoroughly enjoy the story. I found some parts of the book to be draggy and dull. I see some of the characters kind of stereotypical. Another thing that is a turn off for me is the way the author writes which I found somehow dry and not engaging enough. Other than that, I still think the theme about cultural identity, marriage and music quite interesting. It just could have been written better in my opinion."}, {"userName": "Sarah", "userReviewDate": "May 30, 2011", "userURL": "http://www.goodreads.com/user/show/5524769-sarah", "userReview": "Jemorah and Melvina Ramoud have been raised by their father – a Jordanian American man whose love for the drums is the only thing that can dampen his grief for his late wife. Now in their 20′s, Jem and Melvie are a source of constant worry to their aunts, who long to see them married off to a nice Arabian man. Jem is brilliantly intelligent but lacks the motivation to do much with her life, working as a secretary in the same hospital as her father and sister. Melvie is a highly driven nurse, who takes no guff from her patients or her family and friends, she is as stubborn and powerful as a force of nature. As different family members travel from Jordan to assist in the attempts to find men for these women, Jem and Melvie and their father, must come to terms with who they are and who their family is. The girls must struggle to define themselves – are they Arabian or American? Or can they be both? And they must forgive themselves for what happened to their mother – who was with both of them the night she died. Along their path of healing and learning, other family members are drawn in and given a chance to forgive themselves for ancient wrongs and misdeeds.I didn’t really have a great reason for picking this book up, mostly because we were trying to take as many books from the library as we could to help them move and this sounded vaguely interesting. The basis for the story (finding your racial identity or dealing with the death of your mother) wasn’t very pertinent for me but I still found both Jemorah and Melvina enthralling as characters. The storytelling was lovely and lyrical, with portions of such beautiful prose that it could have been considered poetry.You could call this book a novel without a conclusive ending – it isn’t wrapped up all neat and tidy like a Jane Austen novel. But it still is satisfying. All throughout the story, there’s a frantic and unhappy and unsettled tone. But the ending is mellow and peaceful, and you see that it’s the perfect way for you to leave the family."}, {"userName": "Eliza", "userReviewDate": "Jun 23, 2010", "userURL": "http://www.goodreads.com/user/show/1679771-eliza", "userReview": "Although the other books by this author I love, this one fell short. It didn't have a clear plot, and it tried to tell the stories of too many people. It was a compendium of thoughts and events occurring everywhere over a span of time, and it was just too much. No one character was developed enough, instead each was developed a mediocre amount. The book ended up dragging on with no focus."}, {"userName": "Terri", "userReviewDate": "Apr 06, 2012", "userURL": "http://www.goodreads.com/user/show/6815565-terri", "userReview": "I really liked this book, which I have been meaning to read for a long time. A few years ago I listened to Crescent, by the same author, as an audiobook, and really enjoyed her characters and the mixture of cultures and myths and tales and real people trying to find their places in the world."}, {"userName": "Diane C.", "userReviewDate": "Oct 29, 2009", "userURL": "http://www.goodreads.com/user/show/1841246-diane-c", "userReview": "Have read all her other books..........this was the first and least sure handed. I love her books, but this one, as another reader commented, was long on dialogue, character forming and short on plot. It didn't draw me in. I skimmed, and then quickly read the end. It never becomes compelling."}, {"userName": "Mom", "userReviewDate": "May 31, 2018", "userURL": "http://www.goodreads.com/user/show/6503374-mom", "userReview": "Arabian Jazz is the story of an Arab-American family struggling between their two cultures. The main characters are two motherless sisters, both nearing 30 years old and still single. Their aunt fears that they will never marry, at least not the nice Jordanian men she feels they should marry. The novel is humorous and entertaining, containing beautiful lines and stunning descriptions. Unfortunately, the plot is meandering at best and many of the characters mere stereotypes. I read up to page 250 and then decided: what's the point?\" The plot was going nowhere. I abandoned the book, although I admit that I feel I may have thus missed some hysterical bits of dialog and/or some lovely lines of prose. But, really, the story was lacking a central core of meaning and I expected more.Having read and loved several of Diana Abu-Jaber's other books: Crescent,  Language of Baklava, and Life Without a Recipe, I was excited to find this book in the local \"free library.\" I suggest that readers pick up those other books first, as they are sure to satisfy. This was her first novel, and it shows."}, {"userName": "Terry", "userReviewDate": "Feb 04, 2018", "userURL": "http://www.goodreads.com/user/show/863133-terry", "userReview": "Last year, I read two of Diana Abu-Jaber's novels and one of her memoirs and thoroughly enjoyed them all. Her descriptive writing style, especially when involving food and cooking, was pure prose. \"Arabian Jazz\" was her first novel and I just cannot get into it. I'm 237 pages in and I think that's where I'll leave it. The story is about two motherless, Jordanian-American sisters in their late 20's whose aunt is worried that she'll never get them married off. One sister is very focused and outspoken and the other is very unsure of herself. Their forays into dating are just rather silly and some of the characters that surround them seem to just fade in and out. Disappointing."}, {"userName": "Debra B.", "userReviewDate": "Sep 23, 2017", "userURL": "http://www.goodreads.com/user/show/9395922-debra-b", "userReview": "Wow! What an impressive debut novel! An imaginative tale of culture clash with wonderful character development. I really cared about the characters. Poignant, quirky, at times laugh-out-loud funny and at other times heartbreakingly sad, I thoroughly enjoyed this novel. Having lived in Syracuse for eight years, I also loved the depictions of that area in upstate New York. Bravo, Ms. Abu-Jaber!"}, {"userName": "Sierra", "userReviewDate": "Jun 05, 2018", "userURL": "http://www.goodreads.com/user/show/81122885-sierra", "userReview": "Lots of characters to keep track of, but beautiful descriptions. I enjoyed getting a glimpse into a new culture and seeing how the characters interacted. I wouldn't necessarily call the ending satisfying, but I don't regret reading it."}, {"userName": "Mayisha", "userReviewDate": "Aug 18, 2017", "userURL": "http://www.goodreads.com/user/show/56984442-mayisha", "userReview": "an interesting read"}, {"userName": "Peggy Thomson", "userReviewDate": "Feb 26, 2018", "userURL": "http://www.goodreads.com/user/show/44441342-peggy-thomson", "userReview": "Families are weird, frustrating, and sometimes, wonderful."}, {"userName": "Carol", "userReviewDate": "Jun 05, 2018", "userURL": "http://www.goodreads.com/user/show/1911743-carol", "userReview": "This novel is a hot mess. Entertaining at times but such a mishmash of characters."}, {"userName": "Wawan", "userReviewDate": "Sep 15, 2013", "userURL": "http://www.goodreads.com/user/show/160602-wawan", "userReview": "Narrating the life of an Arab immigrant family in a small town on upstate New York, Arabian Jazz is a powerful reinterpretation of the American dream and the idea that the United States is the land of immigrants. If we are so familiar with the myth of the American dream, this novel is one we need to read. It deconstructs that idea without tossing away altogether the said myth. On one hand, it has narratives about individuals whose presence in the United States is practically rejected. These individuals, Arab immigrants, native people, and African American, get derided by the dominant group. On other hand, it also presents characters whose presence and upbringing in the United States liberate them from the trap of immobilizing traditions. Its fuse of music and psychology is one the like of which I've never found in any American novel hitherto. Music is present neither in the form of quotations from evergreen songs or ones that have been the classics of our age nor in the biography of legendary artists with their philosophies. Music, in this case Jazz, is present in the haphazardness of the characters' English, the well-metered but often unpredictable leaps between narratives, and the correlation between the music and its characters' backgrounds. I would argue that the only music that can perfectly represent this novel and the main Arab immigrant character is indeed jazz. Related to the whimsical nature of the novel, I came to decide that the cover of this edition (the colorful cover) is indeed more representative of the novel compared to the beautiful, well-crafted, soft cover of the later editions."}, {"userName": "Debbie", "userReviewDate": "Aug 16, 2011", "userURL": "http://www.goodreads.com/user/show/5276322-debbie", "userReview": "Just a brief review.This is the story of the Ramoud family, Matussem and his two grown daughters Jemorah and Melvina. Matussem and some of his extended family members emigrated from Jordan before his daughters were born. The Ramoud's live in a small decrepit town called Euclid in upstate New York. Matussem married an American woman and on a trip back to Jordan when the oldest daughter was 9, his wife passed away. In general it seems as if this is a story of the three Ramounds trying to find themselves or continue living in spite of this loss as the years pass on. There is an inner struggle between what it means to be Jordanian and what it means to live in America. This book was comical when it surrounded the family, their little quirks, hang ups, personalities, the aunt consistently trying to arrange marriages for the two daughters. I can see where the author tried to include other characters from the town and their lives to create some depth but I just don't think it was successful. I really wanted to only hear about the family and could care less about these strange characters living in the town. There were also some sterio typical little aspects that I just didnt think were neccessary. This book was ok in my opinion as long as the author stayed on the subject of the family and their comradery but when she tried to mix it up, it just fell flat for me. I'm giving it 3 stars because it was alright and I've given 2 stars to things I really disliked so, 3 stars. But, as I always say, read it for yourself and let's see what you think."}, {"userName": "Tricia", "userReviewDate": "Oct 28, 2010", "userURL": "http://www.goodreads.com/user/show/1924595-tricia", "userReview": "Abu-Jaber writes quite evocative and lovely descriptions, but overall the writing style was kind of odd and fragmented - modern fiction, perhaps? Not what I'm used to. The book was more character driven than plot driven. Even so, I feel like it could have been tighter - too many pages were spent reinforcing the character traits we already knew, rather than enhancing and focusing them. Around page 300, Jem had a sort of breakthrough and the book was more engaging from there on out (even if I did put it down in annoyance at one point :^). I read and really enjoyed The Language of Baklava: A Memoir during my \"food memoir\" phase, so I've been meaning to read other books by Diana Abu-Jaber. If I remember correctly, this (Arabian Jazz) is the book she starts while in Jordan, as mentioned in Baklava."}, {"userName": "Lizzie", "userReviewDate": "Oct 10, 2016", "userURL": "http://www.goodreads.com/user/show/2366307-lizzie", "userReview": "I was a big fan of Crescent, but I did not love this book nearly as much. This definitely felt like a first novel, and I think Abu-Jaber's later novels are vastly improved. Overall, the themes were excellent, and similar to her later novels. It is an exploration of what it means to be \"half\" - in this case half Arab and half white; and what it means to live in between cultures. I enjoyed the role reversal of the younger sister being more dominant, and the older sister being the daydreaming, flighty one. All of the characters were eccentric, and I felt like I should relate to them - but I just couldn't get invested in their lives. Some of the characters felt a little too far-fetched. It felt a little unbelievable that Jem would even consider running away with Gil Sesame. And the Otts family felt too stereotypical of a family entrenched in poverty. In summary: read Crescent and her later novels!"}, {"userName": "Victoria Allman", "userReviewDate": "Mar 24, 2013", "userURL": "http://www.goodreads.com/user/show/1549423-victoria-allman", "userReview": "Arabian Jazz is a look at life through the eyes of an almost thirty year-old Arabian/American woman searching for identity. Diana Abu-Jaber writes of what it means to be Arabic, American, an immigrant, a daughter, and a woman trying to find her sense of place in the world and in an often-kooky family. This is done with humor, heart, and breath-stopping prose that are so lovely you will find yourself re-reading passages again and again to hear the rhythm of her language.I think everyone has an Auntie Fatima, no matter which culture you come from. And I wish I had a Nassir in mine.Like Abu-Jaber's other novels, she transports you into another culture. Her words are poetic and thought-provoking. It is a beautiful experience to read her writing.Victoria Allmanauthor of: SEAsoned: A Chef's Journey with Her Captain"}, {"userName": "Tarn Allen", "userReviewDate": "Apr 21, 2008", "userURL": "http://www.goodreads.com/user/show/625682-tarn-allen", "userReview": "I first read this book in college, and Diana Abu-Jaber has since become one of my very favorite fiction authors, perhaps my very favorite contemporary author. It's a kick to go back and re-read this, her first novel, after having been blown away by her other work since, and having had the chance to meet her at Wordstock this past fall, where she was awesome and thoughtful and friendly and insightful and became one of my real-life heroes as well as my literary ones. Is there a more beautiful description of a mother's long fingers than \"they brushed through her hair like candles.\" Warm and weird and gentle and beautiful...her writing gives me chills!"}, {"userName": "Tory", "userReviewDate": "Sep 15, 2011", "userURL": "http://www.goodreads.com/user/show/1562536-tory", "userReview": "This is a sweet story. I thought the author did a wonderful job describing characters and moments; I could easily envision Uncle Fouad and Auntie Fatima. I enjoyed the dynamics between Jemorah and Melvine Ramoud and their father, Matussem. In a way it reminded me of \"My Big Fat Greek Wedding\"- Jem and Melvie are caught between two worlds as children of a Jordanian immigrant father and a (deceased) Irish-American mother. I was sad to see this story end and thoughts of this crazy, loving family continue to linger with me. Great read!"}, {"userName": "Stacey Neve", "userReviewDate": "May 03, 2016", "userURL": "http://www.goodreads.com/user/show/26471751-stacey-neve", "userReview": "I guess I kept reading because I liked the characters, but other than that I found the book disappointing. It seemed like the author was trying to tell too many different stories, so while some were very good, it felt like they didn't get enough attention to do them justice. There was also a plot twist or two (if you can call them plot twists when the story lacks a clear plot) that was so random and out-of-nowhere that it felt forced and unnecessary, instead of feeling surprising and driving the story forward."}, {"userName": "Bryn", "userReviewDate": "May 08, 2010", "userURL": "http://www.goodreads.com/user/show/423843-bryn", "userReview": "I chose to read this book because I really enjoyed one of Abu-Jaber's later books, Crescent, which I read several years ago. A couple pages into the book I thought it sounded a little too familiar. A couple more pages and I began to recall having checked it out from the library not long after I read Crescent and returning it unfinished a couple days later. It is quite unfortunate I did not have this recollection in the bookstore when I bought it."}, {"userName": "Chelsea", "userReviewDate": "Dec 03, 2014", "userURL": "http://www.goodreads.com/user/show/17223248-chelsea", "userReview": "I spent the first quarter of this book worrying that the main character, Jermorah, didnʻt have enough backbone for me to enjoy her journey. However, by the end of this rhythmic tapestry of a novel, I was rooting for her, and even more importantly, I felt that Abu-Jaber had breathed so much life into her world and characters that I actually closed the book believing that Jermorah was out there, someone in the world, continuing the journey she had started."}, {"userName": "Grace", "userReviewDate": "Aug 10, 2009", "userURL": "http://www.goodreads.com/user/show/267933-grace", "userReview": "Very nice. I like the way Abu-Jaber writes. The book left me hanging a little bit, and it was very long for a book that didn't have a more definitive conclusion, I thought. But I liked the characters. At first everything seemed a little unlikely, but by the end of the book I felt every character was genuine and possible."}, {"userName": "Mirka Breen", "userReviewDate": "Jul 30, 2016", "userURL": "http://www.goodreads.com/user/show/8445397-mirka-breen", "userReview": "This book is poignant, FUNNY, and delightful. My one slight reservation has to do with a feeling of unclear steering, plot wise. But it evaporates about three quarters in, and I am eager to read other books by this wonderful writer.There aren't many books of fiction like it, depicting an Arab-American family, warts and all, with no political agenda whatsoever. We need more."}, {"userName": "Zora O'Neill", "userReviewDate": "Oct 08, 2015", "userURL": "http://www.goodreads.com/user/show/2724918-zora-o-neill", "userReview": "Beautifully written, and hilarious. The redneck neighbors are perhaps a little over the top, but that is hugely offset by the vividness of many of the main characters. There's a certain \"Confederacy of Dunces\" air to some of the comic scenes--but fortunately this book engages with meaty issues much more than CoD did."}, {"userName": "Jenny (Reading Envy)", "userReviewDate": "Apr 24, 2007", "userURL": "http://www.goodreads.com/user/show/68030-jenny-reading-envy", "userReview": "I like the other book I read by Abu-Jaber a little better (Crescent) but this one had the same charm of the contrast between middle eastern cultures and American-born children of people from this area. It's funny how the littlest things can make a book seem dated. This was published in 1993, and little things like people having discussions in an airport gate just can't happen anymore!"}, {"userName": "sdw", "userReviewDate": "Aug 27, 2008", "userURL": "http://www.goodreads.com/user/show/232376-sdw", "userReview": "I liked the end of the book more than the beginning. There is an outlandishness that is just a little too much for me. There is enough going on in this novel however that it would be fascinating to explicate and I look forward to encountering some lit crit about it. And I will be looking up her other novels. Oh, and I think she has a Portland connection. I'm always partisan to oregon."}, {"userName": "Chelsea", "userReviewDate": "Aug 12, 2008", "userURL": "http://www.goodreads.com/user/show/1074311-chelsea", "userReview": "I didn't enjoy this book until Chapter 35 --those 20 pages were the best part of the entire book. It finally all came together and became less chaotic, the pieces fell in place and it was beautiful and made it all worth it."}, {"userName": "Michele", "userReviewDate": "May 31, 2009", "userURL": "http://www.goodreads.com/user/show/271190-michele", "userReview": "I think this was supposed to illustrate the life and identity crises of members of a Jordanian immigrant and his American born daughters. It kind of fell flat for me in that regard. However, it was an interesting look at the cultural social dilemmas of the sisters."}], "description": "In Diana Abu-Jaber's \"impressive, entertaining\" (Chicago Tribune) first novel, a small, poor-white community in upstate New York becomes home to the transplanted Jordanian family of Matussem Ramoud: his grown daughters, Jemorah and Melvina; his sister Fatima; and her husband, Zaeed. The widower Matuseem loves American jazz, kitschy lawn ornaments, and, of course, his daughters. Fatima is obsessed with seeing her nieces married—Jemorah is nearly thirty! Supernurse Melvina is firmly committed to her work, but Jemorah is ambivalent about her identity and role. Is she Arab? Is she American? Should she marry and, if so, whom? Winner of the Oregon Book Award and finalist for the National PEN/Hemingway Award, Arabian Jazz is \"a joy to read.... You will be tempted to read passages out loud. And you should\" (Boston Globe). USA Today praises Abu-Jaber's \"gift for dialogue...her Arab-American rings musically, and hilariously, true.\"", "title": "Arabian Jazz", "url": "http://www.goodreads.com/book/show/149569.Arabian_Jazz", "average": 3.4, "cover": "https://images.gr-assets.com/books/1348130988l/149569.jpg", "reviews": 53, "authors": [{"url": "https://www.goodreads.com/author/show/6330.Diana_Abu_Jaber", "name": "Diana Abu-Jaber"}], "type": ["Fiction", "Contemporary", "Literature", "Novels", "Cultural"], "outlinks": ["http://www.goodreads.com/book/show/149569.Arabian_Jazz", "http://www.goodreads.com/book/show/893703.Arabian_Jazz", "http://www.goodreads.com/book/show/77991.The_Language_of_Baklava", "http://www.goodreads.com/book/show/773454.Crescent", "http://www.goodreads.com/book/show/12853341-birds-of-paradise", "http://www.goodreads.com/book/show/149576.Origin", "http://www.goodreads.com/book/show/25622810-life-without-a-recipe", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}