{"ratings": 390, "userreviews": [{"userName": "Brittney ~ Reverie and Ink", "userReviewDate": "Aug 14, 2017", "userURL": "http://www.goodreads.com/user/show/50044222-brittney-reverie-and-ink", "userReview": "Hey guys! So I'm seeing lots of turmoil in my feed but I thought I'd pop in. I'm not crazy about switching covers/etc in a series either, but before you go off on a huge tangent, go check out Sabaa's reasoning for the changes. My thoughts on the design/etc don't matter, and I happened to adore the old covers SO much, but this woman did a cool thing with her influence, and I'm so glad I know why! Link below :) https://twitter.com/sabaatahir/status...So all in all, you don't have to like the covers and you're totally entitled to your own opinions, but just be kind and respectful, please! My Blog ~ Instagram ~ Twitter ~ Etsy"}, {"userName": "Mikee Andrea (ReadWithMikee)", "userReviewDate": "Jul 04, 2016", "userURL": "http://www.goodreads.com/user/show/44137919-mikee-andrea-readwithmikee", "userReview": "OKAY BUT WHY DO WE HAVE TO WAIT UNTIL 2018???As if ONE year wasn't long enough, Sabaa goes and makes us wait TWO years for the next book. :((((((((What are we supposed to do until then? :'("}, {"userName": "Renee Ahdieh", "userReviewDate": "Mar 18, 2018", "userURL": "http://www.goodreads.com/user/show/5021803-renee-ahdieh", "userReview": "whyyyyy, sabaa, whyyyyyyy???(aside: mwahahahahahaha)you know how they tell you that good things come to those who wait? i never bought into this school of thought bc i'm pretty much veruca salt when it comes to books. but, holy hell, is A REAPER AT THE GATES worth it. i was immediately drawn back into this darkly dangerous world and all its amazing characters. each POV is distinct and painstakingly wrought. the action is intense, and the angst made my heart hurt for days afterward. it's smart, sexy, and gut-wrenching. exactly what you've come to expect from the brilliance of sabaa tahir.all i'm saying is that i need more. now. in veruca salt singing voice: DON'T CARE HOW, I WANT IT NOWWWWWWW."}, {"userName": "Andreea Pop", "userReviewDate": "Jun 30, 2016", "userURL": "http://www.goodreads.com/user/show/4858513-andreea-pop", "userReview": "THIS COMES OUT THIS YEAR. Holy moly, time has passed rather quickly. But I'm still not happy about the cover style change. Hmph. Meaningly, my torturous, never-ending wait.  Because freaking 2018."}, {"userName": "emi", "userReviewDate": "Aug 14, 2017", "userURL": "http://www.goodreads.com/user/show/34410191-emi", "userReview": "Me:  Nothing can be worse than the Tower of Dawn coverA Reaper at the Gates: *exists*#WhatTheFuckAn Ember in the Ashes is one of my favorite series ever. I don't deserve this."}, {"userName": "Zemira (Kylo Ren fangirl) Warner", "userReviewDate": "Sep 03, 2016", "userURL": "http://www.goodreads.com/user/show/4995937-zemira-kylo-ren-fangirl-warner", "userReview": "I hope Helene murders all the hateful peasants, rules the world and finds someone worthy of her greatness."}, {"userName": "maymay❀", "userReviewDate": "Aug 14, 2017", "userURL": "http://www.goodreads.com/user/show/49148508-maymay", "userReview": "what the heck happened to the matching cover designs ????the title is 💯💯💯👌👌👌💯💯 but the cover is so OFF AND NOW IM SAD AND CONFUSED WHY DONT WE HAVE MATCHING COVERS !????!!!!????. . . also. . .is anyone not gonna mention how Elias looks gorgeous ???? i mean like not to be shallow or anything but. . .his face !!!"}, {"userName": "Scrill", "userReviewDate": "Aug 14, 2017", "userURL": "http://www.goodreads.com/user/show/418203-scrill", "userReview": "Edit:Ok, so I am mad that it wont match my other hardback covers. If you're buying the books with these covers, the older editions also got revamped, and together they look alright I guess...but my bookshelf feng shui is going to be thrown off. I dunno, I was just such a fan of the original. Here are the remakes of the original covers, in case you haven't seen them.So at least the color hues are similar....Cover reveal:Kept seeing these comments about the book cover, and I kept scrolling cause I was like dunno what that is don't care. Till I realized what series this was for. Really, why did they change the cover style?And why does Elias look like he just popped out of Assasin's Creed?****EDIT-Answers to my initial questions found in this interview"}, {"userName": "Hannah Greendale", "userReviewDate": "Apr 30, 2018", "userURL": "http://www.goodreads.com/user/show/43377498-hannah-greendale", "userReview": "[Laia's brother, Darin (hide spoiler)]"}, {"userName": "Melissa ♥ Dog/Wolf Lover ♥ Martin", "userReviewDate": "Aug 15, 2017", "userURL": "http://www.goodreads.com/user/show/17438949-melissa-dog-wolf-lover-martin", "userReview": "This cover is freaking AMAZE BALLS! Guess I will go over and pre-order for NEXT YEAR. Lol"}, {"userName": "Hari ~Brekker-Maresh~", "userReviewDate": "Jun 30, 2017", "userURL": "http://www.goodreads.com/user/show/18823024-hari-brekker-maresh", "userReview": "8/14/17WE HAVE A TITLE, I REPEAT. WE HAVE A TITLE. THIS IS NOT A DRILL.  I am the definition of sHOOKETH by the TITLE BUT THE COVER????? AM I THE ONLY ONE SLIGHTLY DISAPPOINTED AND BY SLIGHTLY I MEAN WTFFFFFF Hun, take a look at the rest of your fam. Do. You. Look. Like. Them? No.Are. You. Still. Pretty. Anyway? Maybe.I'm not cover hating except I totally am but like... Um. Ok. Let's just be happy we have a cover with pretty pictures. WADDUP BROWN PRIDE! But why couldn't you match 😫And maybe it'll match with the fourth one? But oh no oops. We gotta wait 8 months for this to come out and then like another year or so after that (but I hope the fourth one matches???)Amberish. Blueish. And now greenish themed. Ok. I can live with this. Hopefully.BUT THAT TIIIIITLE THO.(Also update: THEYRE RELEASING NEW EDITIONS OF 1 and 2 TO MATCH WITH THIS SO YAYYYYY- ref in the comments)7/1/17JUST REALIZED WE HAVE TO WAIT UNTIL 2018 FOR THIS BOOK.HAVE WE INVENTED TIME MACHINES YET????????????"}, {"userName": "Fables&Wren", "userReviewDate": "Aug 14, 2017", "userURL": "http://www.goodreads.com/user/show/42780417-fables-wren", "userReview": "Okay but why did you change the cover because I own the first two and now they won't match and I mean it's super cool looking and I love it but can we finish one edition and then start the other because I'll have them both"}, {"userName": "♆Hayley", "userReviewDate": "Sep 08, 2016", "userURL": "http://www.goodreads.com/user/show/22062635-hayley", "userReview": "Why why why WHY! Why do we have to wait so long?! I need more of my little buttercup, cinnamon roll. This better be like a thousand pages of Laia and Elias staring lovingly into each other's eyes."}, {"userName": "Tweebs♥️", "userReviewDate": "Nov 21, 2016", "userURL": "http://www.goodreads.com/user/show/35431290-tweebs", "userReview": "So, I was on Pinterest and then my ass came across some fan art of Laia from An Ember in the Ashes series and god damn. THIS FAN ART IS BOOTIFUUUL UNTIL I SAW THE FUCKING RELEASE DATE FOR BOOK 3HOLD THE FUCK UPI didn't even check the release date properly. What is this? Did it say 2018? Is my eyes playing games with me? Do I need to book myself an appointment to thoroughly check if my eyes are functioning well? I'M IN FUCKING AWEAT THIS RELEASE DATE.I don't even know what I'm going to do with myself. Why did Sabaa Tahir make A torch against the night so mothereffing amazing? You expect me to wait legit a year and half for Book 3?? My goodness gracious, someone hold me. I'm done with this like good the fuck bye."}, {"userName": "Rose", "userReviewDate": "Aug 06, 2016", "userURL": "http://www.goodreads.com/user/show/36179502-rose", "userReview": "I KNEW IT!!!!okay so from what I know, sabaa said she'd probably be writing up to two more books after a torch against the night...and I'm not complaining. [also casually dying of happiness bc more elias YAS]"}, {"userName": "Amy", "userReviewDate": "Aug 14, 2017", "userURL": "http://www.goodreads.com/user/show/10732821-amy", "userReview": "Its almost as if publishers don't understand readers at all. Publisher : What should we do with the cover of the third book in the series?Cover Designer : We should make it   COMPLETELY DIFFERENT! Publisher : Perfect! The readers will love it! Readers:"}, {"userName": "Alana • thebookishchick", "userReviewDate": "Aug 14, 2017", "userURL": "http://www.goodreads.com/user/show/12402009-alana-thebookishchick", "userReview": "I am SO insanely excited for this but worried for my baby Helene.ALSOWhile I'm not a fan of the cover I give the author a tremendous amount of respect for the reason she had the covers changed."}, {"userName": "Beatrice (beatriceinbookland)", "userReviewDate": "Aug 14, 2017", "userURL": "http://www.goodreads.com/user/show/41218661-beatrice-beatriceinbookland", "userReview": "there's a special place in hell for those who think that cover changes are a good idea"}, {"userName": "Ayesha S.", "userReviewDate": "Aug 15, 2017", "userURL": "http://www.goodreads.com/user/show/55972693-ayesha-s", "userReview": "Okay, so not the most aesthetically pleasing cover, but I'm here for any form of brown representation."}, {"userName": "Jennymort *The Dark Lord, House of Slytheread, Sailor Jupiter, Siren*", "userReviewDate": "Nov 17, 2016", "userURL": "http://www.goodreads.com/user/show/35147071-jennymort-the-dark-lord-house-of-slytheread-sailor-jupiter-siren", "userReview": "[I am never like this but -It's like Shadowcaster all over again.this shit is fucking with my aesthetics.and it's fucking with my goddamn bookshelf vibes.  (hide spoiler)]"}, {"userName": "Chelsea ❤Peril Please❤ ", "userReviewDate": "Mar 08, 2018", "userURL": "http://www.goodreads.com/user/show/8422853-chelsea-peril-please", "userReview": "Brag much?!\n\nDid I mention I love Penguin Teen? And that Sabaa and I are besties?.....Didn't think so :PDearest Sabaa, Let's have a chat, you and I.Upon the release of your Elias quote earlier this week for an A Reaper at the Gates preview, it has come to my attention that you intend to cause my main man grief-GOOD. The better for an epic love story.\n\"All things have a price, Elias Veturius. The price of saving her will haunt you for all your days. Will you pay it?\"\nHowever. We both know you don't really want to hurt him, now do you? That's what I thought.We're both rational book [boyfriend] loving gals who could kick it around town whilst singing the praises of all our favorite men and the peril they go through to save their true loves.Because that's all it is, right? A story? You'd never actually hurt my baby Elias (my book husband (among many, but this is neither here nor there), thank you)-it's all for the beauty of the story and the theatrics of it all.So we'll continue to have these wholly fictional chats over drinks, over nights out on the town, over coffee (or, in my case, Mountain Dew)...But if you so much as hurt a hair on my Elias's precious little head (more so than you already have), our alliance is severed and I cut all ties to our fictional friendship.I'm sorry, but rules are rules, and you can't double cross a friend after you [fictionally] promised to keep a character safe. You can't double cross on the safety of a loved one.So-Here's hoping you choose to do the SMART thing. The RATIONAL thing. Don't make me abduct you for ransom. I don't want to have to do this-you don't want me to have to do that, do you? Of course you don't. Do you want me to cry?Of course not.Sincerely,Chelsea-Forever your biggest fanAKA Psycho BBF Girl Who Will Go To Drastic Measures To Ensure Her Boys Survive"}, {"userName": "Zoha ", "userReviewDate": "Aug 06, 2016", "userURL": "http://www.goodreads.com/user/show/48320485-zoha", "userReview": "The cover is the UGLIEST thing I have ever seen! No matter what Saba says in her message about a POC character on the cover and yada yada yada. I don't care. Can't the cover be both gorgeous and have a POC character on it?  This is a JOKE! And if I read this book it would be for Helene! ***I thought it was a duology ??? :O Not that I am complaining! ;) One more book with Elias and Laia !!! ^_^ *dances a happy dance*"}, {"userName": "Katerina Kondrenko", "userReviewDate": "Jun 30, 2016", "userURL": "http://www.goodreads.com/user/show/36306002-katerina-kondrenko", "userReview": "Uh-oh. I thought A Torch Against the Night would be an epic action-packed conclusion, but look at this... Now I'm afraid the previous part would be just a filler with angst, but still hoping for the best."}, {"userName": "Katrin D", "userReviewDate": "Aug 05, 2016", "userURL": "http://www.goodreads.com/user/show/7018363-katrin-d", "userReview": "WHAT DO YOU MEAN 2018?????"}, {"userName": "Mohammed Arabey", "userReviewDate": "Sep 02, 2017", "userURL": "http://www.goodreads.com/user/show/13592557-mohammed-arabey", "userReview": "I've tried to like the dragging plot of the second book just because I loved the fast, rich, well paced plot of the first book.And I was still going to buy the 3rd book and give ut a try.. BUT NOW THE AUTHOR & PUBLISHERS SAID NO.Ruining the cover continuity with stunning imagination killer new covers..you bought these two books with these covers? It's old fashion get over it and buy our new f*** idea of the covers to continue the rest of the God-know-how-long-we-gonna-drag-the-plot parts.I remember having a huge backlash from my friends and followers when I just add pictures of my imaginary cast of the story in my just one REVIEW.. not the book cover itself.Funny that when I read an interview with the author, she said she's playing a certain video game, she liked to change the whole covers to suite her current video game. -oh and that other reason of judging the other books covers as not respect women enough, or colored characters...-So say hello to the women and colour characters saviour covers.And my collection of bought books of this series stops at two.Mohammed ArabeyIn 2 Sep. 2017"}, {"userName": "Eryn✵", "userReviewDate": "Aug 14, 2017", "userURL": "http://www.goodreads.com/user/show/17568354-eryn", "userReview": "Um. Yeah. That is one ugly cover. I'm about to make a new shelf for gross covers and pop this one in there, hahaha, 'cause nope."}, {"userName": "sofia (sam willows)", "userReviewDate": "Aug 24, 2016", "userURL": "http://www.goodreads.com/user/show/55057635-sofia-sam-willows", "userReview": "OH MY GOT HERE IS A TITLE AND A COVER HOLY FUCKat first I was a bit hesitant about the change but after I saw Sabaa's message and take on it I FUCKING LOVE IT WITH ALL MY HEART SAY YES TO REPRESENTATION FOR BROWN KIDS"}, {"userName": "Aimal (Bookshelves & Paperbacks)", "userReviewDate": "Aug 14, 2017", "userURL": "http://www.goodreads.com/user/show/23504479-aimal-bookshelves-paperbacks", "userReview": "Update: 05/20/2018 - My re-read of AEitA and ATAtN is done, and now I physically cannot wait any longer for Reaper, so can June 12th FLY here, please and thank you.*If you told me a few years ago that I'd see someone who looks like me on the cover of a bestselling fantasy series, optioned for a movie, written by a Pakistani author? I would laugh in your face, but here you are, and here I am, crying with joy."}, {"userName": "trash™️ ", "userReviewDate": "Aug 14, 2017", "userURL": "http://www.goodreads.com/user/show/60786433-trash", "userReview": "why:)did:)they:)change:)the:)cover:)style:)"}, {"userName": "Elise (TheBookishActress)", "userReviewDate": "Aug 17, 2017", "userURL": "http://www.goodreads.com/user/show/52545435-elise-thebookishactress", "userReview": "I don't even go here but can I say that the new book two cover is fantastic and way better than this one the Laia model is beautiful and I love her!! why don't they just release hardcovers of books one and two as wellALSO I read her twitter (which y'all should too bc she says some important shit!!) and I'd also like to say that I am currently in love with Sabaa Tahir"}], "description": "Beyond the Empire and within it, the threat of war looms ever larger.The Blood Shrike, Helene Aquilla, is assailed on all sides. Emperor Marcus, haunted by his past, grows increasingly unstable, while the Commandant capitalizes on his madness to bolster her own power. As Helene searches for a way to hold back the approaching darkness, her sister's life and the lives of all those in the Empire hang in the balance.Far to the east, Laia of Serra knows the fate of the world lies not in the machinations of the Martial court, but in stopping the Nightbringer. But while hunting for a way to bring him down, Laia faces unexpected threats from those she hoped would aid her, and is drawn into a battle she never thought she'd have to fight.And in the land between the living and the dead, Elias Veturius has given up his freedom to serve as Soul Catcher. But in doing so, he has vowed himself to an ancient power that will stop at nothing to ensure Elias's devotion–even at the cost of his humanity.", "title": "A Reaper at the Gates\n      \n          (Ember Quartet #3)", "url": "http://www.goodreads.com/book/show/30809786-a-reaper-at-the-gates", "average": 4.26, "cover": "https://images.gr-assets.com/books/1507476834l/30809786.jpg", "reviews": 237, "authors": [{"url": "https://www.goodreads.com/author/show/7770873.Sabaa_Tahir", "name": "Sabaa Tahir"}, {"url": "https://www.goodreads.com/author/show/7770873.Sabaa_Tahir", "name": "Sabaa Tahir"}], "type": ["Fantasy", "Young Adult"], "outlinks": ["http://www.goodreads.com/book/show/30809786-a-reaper-at-the-gates", "http://www.goodreads.com/book/show/37901428-a-reaper-at-the-gates", "http://www.goodreads.com/book/show/27774758-an-ember-in-the-ashes", "http://www.goodreads.com/book/show/25558608-a-torch-against-the-night", "http://www.goodreads.com/book/show/25202098-sneak-peek", "http://www.goodreads.com/book/show/31520883-untitled", "http://www.goodreads.com/book/show/29476315"]}