{"ratings": 69819, "userreviews": [{"userName": "Jean", "userReviewDate": "Feb 22, 2016", "userURL": "http://www.goodreads.com/user/show/19300421-jean", "userReview": "“To Sherlock Holmes she is always the woman. I have seldom heard him mention her under any other name.”So begins the very first story in the very first collection of stories about Sir Arthur Conan Doyle's fictional detective with a phenomenal brain, Sherlock Holmes. A Scandal in Bohemia was originally published in \"The Strand Magazine\" in 1891, and altogether Arthur Conan Doyle ended up writing 56 short stories about his most popular invented character. It was not the world's introduction to the great detective however, as it had been preceded by two of the four Sherlock Holmes novels – \"A Study in Scarlet\" and \"The Sign of Four\". So although we tend to think of this as our first introduction to Sherlock Holmes, it is not. That honour lies with \"A Study in Scarlet\". We now usually read A Scandal in Bohemia as the first in the collection entitled, \"The Adventures of Sherlock Holmes\".The story begins whilst Dr. Watson is visiting Holmes, and the two are exchanging banter. A mysterious visitor arrives, introducing himself as Count Von Kramm, \"a Bohemian nobleman\" who claims to be acting for a wealthy client. However, the reader soon learns the measure of Holmes, as he quickly deduces that the visitor is not all that he seems. He is none other than Wilhelm Gottsreich Sigismond von Ormstein, Grand Duke of Cassel-Felstein, and is the hereditary King of Bohemia. Realising the impossiblility of denying his true identity, the King reveals his face and tells the pair his problem.He is to become engaged to Clotilde Lothman von Saxe-Meiningen, a young Scandinavian princess. However, five years previously he had been involved with an American opera singer, Irene Adler, who now lives in London. He was now trying to recover certain letters and an incriminating photograph of the pair of them, which he had sent to her during their relationship. He had tried everything in his power, but Irene Adler refused to return them.The King says that he \"would give one of [his] provinces\" to have the photograph back\", and Sherlock Holmes is intrigued enough to take on the case with the assistance of his friends, Dr. Watson. The tongue-in-cheek dialogue between the two sparring partners is very enjoyable,“By the way, Doctor, I shall want your cooperation.''I shall be delighted.''You don't mind breaking the law?''Not in the least.''Nor running a chance of arrest?''Not in a good cause.''Oh, the cause is excellent!''Then I am your man.''I was sure that I might rely on you.” Conan Doyle of course invented the names of these royal personages, which seem so much of a mouthful. Interestingly though, he placed his fictional dynasty in a real country, Bohemia, whose Austrian Emperor bore the title the \"King of Bohemia\". There was however no such place as the \"Kingdom of Scandinavia\".How Sherlock Holmes sets about solving the problem is ingenious, and sets the standard for the stories which follow, some of which are even better in my view. The plot is fast-paced, involving trickery, more than one marriage, secrets and subterfuge, a smokescreen, a street brawl, an exciting chase scene, and the use of the modern railway system. We learn much about Sherlock Holmes's unique combination of arrogance, sensitivity, and sense of humour (even though sometimes it may seem misplaced). There is a double impersonation, by which we learn that he is a master of disguise and acting, and we learn that he has much respect both for his friend and colleague Doctor John Watson, and also for a strong proud woman, who has no malice but much intelligence.Arthur Conan Doyle himself ranked A Scandal in Bohemia fifth in his list of his twelve favourite Sherlock Holmes stories. It is memorable for introducing the character of Irene Adler, the only woman who ever managed to outwit the detective. Since it is one of the first occasions we meet Sherlock Holmes, it is remarkable how quickly it conveys his character in one short story. We observe his brilliance in deducing the problem and identifying the king in the first place. We also note his arrogance and witty waspish comments. For instance when the King enthusiastically expostulates, \"Would she not have made an admirable queen? Is it not a pity she was not on my level?\"Holmes replies scathingly that Miss Adler is indeed on a very different level from the King. And we see ... or perhaps a better word would be \"observe\" ... (for in Sherlock Holmes's own words, sometimes, “You see, but you do not observe”) that he has a soft centre after all, by his sentiment in wanting to keep the photograph of Irene Adler in preference to a far greater monetary reward.“And that was how a great scandal threatened to affect the kingdom of Bohemia, and how the best plans of Mr. Sherlock Holmes were beaten by a woman’s wit. He used to make merry over the cleverness of women, but I have not heard him do it of late. And when he speaks of Irene Adler, or when he refers to her photograph, it is always under the honourable title of the woman.”"}, {"userName": "Tadiana ✩Night Owl☽", "userReviewDate": "Mar 21, 2017", "userURL": "http://www.goodreads.com/user/show/8734459-tadiana-night-owl", "userReview": "“You see, but you do not observe. The distinction is clear.\"I'm gradually making my way through the Sherlock Holmes stories collected in The Adventures of Sherlock Holmes, which you can download free here at Gutenberg.org. This one is the story of The Woman.To Sherlock Holmes she is always the woman. I have seldom heard him mention her under any other name. In his eyes she eclipses and predominates the whole of her sex. It was not that he felt any emotion akin to love for Irene Adler. ... And yet there was but one woman to him, and that woman was the late Irene Adler, of dubious and questionable memory.A Bohemian nobleman, half-heartedly in disguise (note the highly effective half-mask) until Sherlock, bored, informs him that he knows who he is, hires Sherlock to help him with a scorned woman who has vengeance on her mind, now that he's dumped her (because she's not of the nobility) and plans to marry a nice, straitlaced blueblooded girl. Unfortunately for the guy, she has a picture of them together, along with letters and other evidence of their illicit relationship that will surely ruin his marriage plans. So Sherlock is hired to steal the incriminating photograph.I don't want to say a lot more, because it's short and easily spoiled. It's a pretty straightforward Sherlock Holmes case, made memorable by the woman Sherlock goes up against. Despite his disdain for women generally, he's impressed ... and, to his credit, not at all impressed with the nobleman who left her. There's some great dialogue between the characters, like the nobleman and Sherlock's discussion of why this woman's evidence can't be dismissed as fake, and this interchange between Sherlock and Dr. Watson:\"By the way, Doctor, I shall want your co-operation.” “I shall be delighted.” “You don’t mind breaking the law?” “Not in the least.” “Nor running a chance of arrest?” “Not in a good cause.” “Oh, the cause is excellent!” “Then I am your man.” Bonus material: When I Googled to find out what a \"cabinet\" photograph is, I found this tremendously helpful page on a Stanford Univ. website, explaining not only that term but many others in the story that may not be familiar to modern readers.Next up: The Red Headed League."}, {"userName": "Buggy", "userReviewDate": "Jun 24, 2012", "userURL": "http://www.goodreads.com/user/show/3099666-buggy", "userReview": "Opening line: “To Sherlock Holmes she is always the woman. I have seldom heard him mention her under any other name. In his eyes she eclipses and predominates the whole of her sex.”Well this was a surprise; the classics and especially mysteries are not my usual fare but due to my recent obsession with the BBC series Sherlock (How yummy is Benedict Cumberbatch) and then watching Downey and Jude Law in the movie Game Of Shadows I realized that I had never actually read any of Conan Doyle’s stories. After some research trying to figure out where to begin, I eventually bought The Adventures Of Sherlock Holmes and settled on this story. And wow, I didn’t expect to enjoy this half as much as I did (or at all for that matter) but I guess this is why Sherlock Holmes is still relatable today.I’d initially expected to have to put in considerable effort just to get through this, I mean it was written in 1892 so it was bound to be very, well literary. You know all formal and tedious. In fact I’d anticipated needing a dictionary just to be able to understand what the characters were talking about, but to my surprise A Scandal In Bohemia turned out to be an absolute delight to read. The actual story is quite basic yet also filled with complexities and hidden meanings and I would also have to call this a romance -of sorts. It’s also funny, relevant, cunning, witty, romantic and ultimately sad. What a great introduction to the world of Sherlock Holmes.Told from Dr. Watsons POV (now that I didn’t know -I’d just assumed these were Sherlock’s stories.) We begin with Watson “dropping by” Baker Street to visit Holmes. He hasn’t been by his old residence or seen Holmes of late due to his recent marriage and the two have drifted apart. I guess you could say he feels nervous about visiting because he never really knows what state Holmes will be in; elated, depressed, manic, high on opium or cocaine or in some clever disguise? It’s always a bit of a crap shoot. In any case he appears happy today and also excited due to the prospect of a new and exciting case. Sherlock then asks if Watson will assist him; “I shall be delighted”“You don’t mind breaking the law?”“Not in the least.”“Nor running a chance of arrest?”“Not in good cause.”“Oh the cause is excellent.”“Then I am your man.”“I was sure that I could rely on you.”The client turns out to be the King of Bohemia; he requires Holmes’ assistance in obtaining an incriminating photograph of himself and one Irene Adler before he marries. It seems this past affair would ruin him because of her “station.” So far the King has tried unsuccessfully to buy it (she won’t sell) to bribe her servants and finally even to steal it but Ms. Adler is always one step ahead. Holmes dons several disguises throughout his case, first as a groomsman to gain access to Adler’s property and spy on her and then later as an (injured) clergyman. Irene Adler is a fantastic character, gaining the upper hand and in the end even outsmarting Holmes. I suppose it’s her cleverness that causes Holmes to fall for her and why in the end she becomes known only as the woman. Cheers305jb5"}, {"userName": "Huda Aweys", "userReviewDate": "Aug 25, 2013", "userURL": "http://www.goodreads.com/user/show/16197752-huda-aweys", "userReview": "أعجبنى ذلك العنصر الأنثوي الذى اضافه السير كونان دويل الى مغامرته هذه المرة :) ، فقد اضفى بعد انسانى .. عاطفى جديد على شخصية هولمز ! جعلنا نعدل قليلا من زاوية نظرنا اليه كآلة للبحث و التحليل .. و التحقيق لا غير ! ، و لا اكذبكم خبرا ، كان مدعى لسرورى ، أن تنتصر احدى بنات جنسي على هولمز المشهور ، فنحن ايضا لا نعدم الذكاء و الحيلة و لا تنقصنا المقدرة على التفكير المنطقي .. التحليلي .. العلمى !و امثال ايرين في التفكير و الحيلة هم حقا من يستحقون الحصول على لقب (المرأة) فالمرأة هي كيان جميل ..و ذكي :)"}, {"userName": "Anne ", "userReviewDate": "Jan 17, 2016", "userURL": "http://www.goodreads.com/user/show/23304719-anne", "userReview": "More like 3.5/5 S*T*A*R*S really.\n\nThe stage lost a fine actor, even as science lost an acute reasoner, when he became a specialist in crime.\n\nIt seems to me that Mr. Holmes is an exceptional crime investigator. And more than that. He's a character I'll be most delighted to make an acquaintance with. It's clear that the skills he displays in this book are only basic to his character, it feels like there's more. For this investigative episode, Mr. Holmes is contacted by a sketchy character in a mask who turns out to be a king, and is presented with a case which requires the utmost discretion and confidentiality. One which threatens to cause what will be a great Scandal in Bohemia.▶ \n\nAND WHAT DO I THINK?\n\nThis was a good introduction to the world of Holmes. A light one. One thing's for sure. Mr. Holmes does deserve a place in the list of greatest mentions. The thing is, I don't know, I guess I was expecting more. More complexity? more mystery? I don't know. Just more. But I take into account that this is the first book in the series - at least I think it is. Please correct me if I'm wrong - and it can only get better. So I do believe it's going to build into a series I'll come to love. Because yes, I will be reading the rest of the Sherlock Holmes books. Slowly but surely. I might even finish them before half of the year runs out. Is that possible? I mean, I actually don't know how many books there are, exactly, so I might just be putting my foot in my mouth(haha. Foot. In. Mouth. Get it? You don't? **looks frustratingly puzzled** Well it's supposed to be funny, really.) I really like Watson, Holmes' dear, dear friend. And from what I foresee - and this is all conjecture now - he's going to be a steadfast and loyal sidekick. What's really great is they seem to have a great and adhering friendship between them. That's more reason to read more of Holmes' investigative adventures. It promises to be fun, entertaining, humorous and dare I say it, mysterious and investing. I just love great displays of friendship in books! Adding adventure to that, only leaves something that I could very well say will be the death of me and my academic life. I want to start watching Holmes' on Tv now, but there are school books with my name on them by my bedside table. Forgive me education.✔ \nTo Mr.. Sherlock Holmes: \nI look forward to our future encounters. And remember.And lastly, is it weird that I feel like I've made some kind of great achievement, or excelled remarkably and commendably at some enterprise? I don't know. I feel like this is a milestone, honestly. I feel elated!!! I'm going to take a picture for keeps in remembrance of this day. I really am. Say nyehhhhhI was born silly. Too sad.Recommended to me by my lovely friend, Councillor. Thank youuu!"}, {"userName": "Traveller", "userReviewDate": "Feb 10, 2015", "userURL": "http://www.goodreads.com/user/show/3145526-traveller", "userReview": "This is a very interesting article with some background on Conan Doyle and Sherlock:http://www.wired.com/2015/02/health-w...I quote from the article:Wearing his now-iconic hat, clamping a pipe between his teeth, Sherlock Holmes endures as the very definition of deductive reasoning. His encyclopedic knowledge and diamond-sharp observation skills make him a larger-than-life figure that continues to fascinate audiences on both the small and big screens.Originally penned by Sir Arthur Conan Doyle, a physician, the character of Holmes has undergone various tweaks and changes over the years as new writers and actors have put their own spin on the famous detective. However, his ability to gather, manage and analyze many snippets of information to draw conclusions about the motives, methods and outcomes of major crimes remains constant.It is alleged that Conan Doyle found the inspiration for his most famous character in Dr. Joseph Bell, one of his medical school professors. Dr. Bell was considered an excellent diagnostician who impressed Conan Doyle with his ability to correctly “guess” professions, daily routines and medical diagnoses of patients, students and colleagues using bits of information that others might ignore or find irrelevant. --(Dr. Richard Hu, writing on Wired magazine.As for this specific adventure, it gets 5 stars because Irene Adler!I love the implications; with her, Conan Doyle surely manages to sidestep the blanket accusation of sexism that radical feminists love to sling against white Victorian males as a group. Hmm, but that said, I suppose Doyle might still not be off the hook, since some might still aver that Ms Adler is not represented as enough of a 'rounded' character? Oh well, Doyle still passes in my book. It's enough for me that she is brilliant. ;)In addition to that, I like that she makes Sherlock more human to the reader; that her character demonstrates that Sherlock can have human emotions after all."}, {"userName": "emma", "userReviewDate": "Oct 02, 2016", "userURL": "http://www.goodreads.com/user/show/32879029-emma", "userReview": "irene adler is. a. baller.i'd rather read a series of books about her, personally."}, {"userName": "Foad", "userReviewDate": "May 06, 2015", "userURL": "http://www.goodreads.com/user/show/25683251-foad", "userReview": "اين داستان يكى از داستاناى جالب شرلوك هلمزه، از اين جهت كه تنها پرونده ايه كه شرلوك هلمز با تمام زيركى و درايتى كه به خرج ميده، توش شكست ميخوره. و خب، شكست خوردن كارآگاه توى داستان جنايى، توى اون دوره خيلى معمول نبوده؛ مخصوصاً شكست خوردن شرلوك هلمز نابغه كه كمترين نقطه ضعفى نداره. و ماجرا وقتى جالب تر ميشه، كه بدونيم كسى كه شكستش ميده، يك زنه به نام \"آيرين ادلر\". هر چند انتخاب زن زيباى اغواگر به عنوان ضد قهرمان در داستانهاى مردسالارانه ى اون دوره غيرمعمول نبوده، اما نكته اينه كه كانن دويل آيرين ادلر رو خيلى خبيث تصوير نميكنه؛ تا جايى كه هلمز هميشه با نوعى احترام آميخته با نفرت، با لقب \"آن زن\" از ادلر ياد ميكنه و عكسش رو براى خودش نگه ميداره.تقريباً توى همه ى اقتباس هاى سينمايى و تلويزيونى شرلوك هلمز، آيرين ادلر به شكل هاى مختلفى حضور داره."}, {"userName": "Jason Koivu", "userReviewDate": "Feb 18, 2013", "userURL": "http://www.goodreads.com/user/show/1742824-jason-koivu", "userReview": "Holmes done over by a bird?! Certainly the man is not at his tip-top form and neither is this story, but it's a good one, perhaps for its contemporary pathos. Holmes for once seems fallible, almost human. Not only does he slip up, he also falls for a woman. No, it's not Doyle's best bit of writing, but for the sake of posterity, it might be the best thing he ever did for his Sherlock Holmes series."}, {"userName": "Brooklyn Tayla", "userReviewDate": "Apr 22, 2015", "userURL": "http://www.goodreads.com/user/show/34712899-brooklyn-tayla", "userReview": "A perfect little re read to welcome myself back into Conan Doyle's world."}, {"userName": "Niko", "userReviewDate": "Feb 05, 2013", "userURL": "http://www.goodreads.com/user/show/16788296-niko", "userReview": "A scandal in Bohemia is a short yet entertaining adventure of no other than the greatest sleuth of fiction history, Sherlock Holmes.In this case, Holmes is once again accompanied by his Boswell, partner and trusted friend, Dr. John Watson. But this time, Dr. Watson is already married to Mary Morstan allowing changes to their \"flatmate\" relationship in Baker street. They were approached by an anonymous masked client who turns out to be Wilhelm Gottsreich Sigismond von Ormstein, the great Duke of Cassel-Felstein and hereditary King of Bohemia himself. He asks for the help of the two in solving and in redemption of a specific object from the hands of Irene Adler, his former liaison, on which they had failed in many attempts. At this time, the great duke is already engaged to the young scandinavian princess and he's afraid that this Adler woman might threaten him and his marriage through the certain object, a photograph of the duke and adler. Sherlock then had a plan and used his ability of disguise to enter the home of adler and find out as to where the photograph was hidden. Using Holmes' plan and Watson's helping hand, they were successful and were clever enough to locate the object yet disabling them to get it because many eyes are on them as of the moment. They are then bound in contacting the duke and telling him that they already know the location of the photo and that they're planning to have possession of it on the following day. Unfortunately, they were unable to anticipate that miss adler was already knowledgeable of their future acts as to the previous events of deception by the tandem. As the duke, holmes and watson are at the peripheral of Miss Adler, they were shocked to have been informed that Irene has set to fly to England with the photo and never to return again. Sherlock redirected to the location of the photo for assurance and found a photo of Irene Adler in a gown and a letter addressed to Holmes saying that she's already aware of their plans and that the duke has nothing to worry about for she is in love with another man and will not interfere with his marriage unless he takes any threatening action towards her. The story ends when Sherlock asked the duke to have Irene's picture in his possession as a reminder of the woman who outwitted him. To Sherlock Holmes, Irene Adler is not just a woman, she is The Woman."}, {"userName": "Sarah ~", "userReviewDate": "Aug 13, 2014", "userURL": "http://www.goodreads.com/user/show/9446828-sarah", "userReview": "تبقى دائما مغامرة شيرلوك هولمز وجون واتسون مع ايرين آدلر استثنائية ..ممتعة وجميلة جداً ..وتتجلى فيها عبقرية السير آرثر كونان دويل ..وهي من الروايات المفضلة لدي من سلسلة شيرلوك ..التي أعيد قراءة بعض رواياتها حالياُ وأخرى أقرؤها للمرة الأولى .."}, {"userName": "Dani Jade", "userReviewDate": "Dec 20, 2015", "userURL": "http://www.goodreads.com/user/show/41664104-dani-jade", "userReview": "\"A Scandal in Bohemia\" is the first story in the  The Adventures of Sherlock Holmes  story collection, the third publication in the Sherlock Holmes series (after the first two novels, so the first story collection). The King of Bohemia hires Holmes to retrieve an incriminating photograph his ex-mistress is threatening him with. One of the absolute classics, and featuring the infamous Irene Adler. A great starting point and introduction to the Sherlock Holmes stories."}, {"userName": "Laura", "userReviewDate": "Jul 12, 2013", "userURL": "http://www.goodreads.com/user/show/900147-laura", "userReview": "\"A Scandal in Bohemia\" was the first of Arthur Conan Doyle's 56 Sherlock Holmes short stories to be published in The Strand Magazine and the first Sherlock Holmes story illustrated by Sidney Paget. (Two of the four Sherlock Holmes novels -- A Study in Scarlet and The Sign of the Four -- preceded the short story cycle). Doyle ranked \"A Scandal in Bohemia\" fifth in his list of his twelve favourite Holmes stories.A movie was made based on this book and it's available at YouTube."}, {"userName": "Gieliza", "userReviewDate": "Feb 05, 2017", "userURL": "http://www.goodreads.com/user/show/34088223-gieliza", "userReview": "3.5 stars!"}, {"userName": "Jason Donoghue", "userReviewDate": "Apr 29, 2018", "userURL": "http://www.goodreads.com/user/show/63867638-jason-donoghue", "userReview": "Truly an enjoyable read, I would recommend it. I find Holmes a character like no other"}, {"userName": "Councillor", "userReviewDate": "Aug 12, 2015", "userURL": "http://www.goodreads.com/user/show/40792319-councillor", "userReview": "Doyle’s novels on the incomparable and inimitable Sherlock Holmes are presumably some of the most significant detective stories ever written, drawing a perfectly unique and charismatic character with a lot of recognition value, accompanied by Watson, the everyman commenting on Sherlock’s ways of behaviour with observations and comments of his own. I’ve only read one of them so far before deciding to download the „Adventures of Sherlock Holmes“, a collection of twelve different short stories, which can be found free of charge and legally on the website of Project Gutenberg. And I have to admit, the one I read was probably not the best one to start with when reading the Sherlock novels – it was „The Valley of Fear“, Doyle’s seventh Sherlock novel, and probably the weakest one, judging from several reviews and my own feeling about it. After reading that one, I quitted reading the Sherlock novels for some months, finding it difficult to bestir myself to read „A Study in Scarlet“, the first novel about Sherlock if I got it right. But now it has finally found its place on my „to-read-next“ list.„A Scandal in Bohemia“ has been the inspiration for the first episode of the second season of BBC’s successful Sherlock Holmes TV adaption. By creating the interesting character of Irene Adler, Doyle managed to show another new side of the perfectly portrayed character of Sherlock (not to mention that the modernized version of Irene Adler, played by Lara Pulver, has been even more interesting and versatile with all those different sides the authors decided to allow her character to show). It is no particularly long story (approximately 8,5k words) and, thus, cannot be compared to any of Doyle’s novels (only one of which has been read by me so far, a fact I’m willing to change during the next time). But Doyle was capable of creating an interesting atmosphere, especially by including a lot of humorous conversations, and his writing style is pretty captivating (sort of the contrary to what I remember about reading „The Valley of Fear“, but I’m prepared to eliminate my poor impression of this one in order to gain a new opinion on the Sherlock novels).I’d give this short story 4.0 stars, recommending it to everyone who likes reading a well-plotted crime story with interesting characters. And it’s free, so don’t think too long about reading this – just read it."}, {"userName": "Jaksen", "userReviewDate": "Jan 29, 2016", "userURL": "http://www.goodreads.com/user/show/7233842-jaksen", "userReview": "[This story involves a king being blackmailed by a vengeful woman, and the woman is Irene Adler, whom Holmes ever-after refers to as 'the woman.' This is supposedly the only tale in which Holmes does not win and is outwitted by someone else - and she's a woman! Holmes takes on the case to help the king and gain back the photograph and using subterfuge, an array of disguises and his keen intellect almost succeeds.  (hide spoiler)]"}, {"userName": "Melvina Kelmendi", "userReviewDate": "Dec 20, 2016", "userURL": "http://www.goodreads.com/user/show/19211470-melvina-kelmendi", "userReview": "I love it. I loved it so much. I am so happy.Also, since I watched the TV show before starting these stories Benedict Cumberbatch and Martin Freeman will forever be Sherlock Holmes and Dr. Watson to me. P.S. The bind-up I am reading these stories in is the most beautiful book I have ever owned."}, {"userName": "Brian ", "userReviewDate": "Mar 01, 2015", "userURL": "http://www.goodreads.com/user/show/30718608-brian", "userReview": "I loved reading Sherlock Holmes when I was a kid. I remember this arch villain named Moriarty who fell off a cliff and haunted him. I also remember giant mastiffs and a lot of fog. It's going to be fun to be reacquainted. This first short is really cool. His skills are introduced and he gets ousted by a girl."}, {"userName": "Lacey", "userReviewDate": "Mar 02, 2018", "userURL": "http://www.goodreads.com/user/show/50447338-lacey", "userReview": "I've made a terrible mistake. Sherlock Holmes may very well be my favorite person to ever exist. I'm obsessed with the TV show, I'm obsessed with the books, and I'm overall OBSESSED with Sherlock Holmes. I can't go back. What choice do I have but to read all fifty two pieces of literature about Sherlock Holmes? RTC!--------–---------------------------------------------------------------------Review can also be found on my blog, Lacey Paris Books(link in my bio!) I've become obsessed with Sherlock Holmes. I watched the first episode of Sherlock on a whim. I love Benedict Cumberbatch because he played Alan Turing in The Imitation Game, so I thought I'd give the show a go. I've either made the best decision of my life...or the worst one.A Scandal In Bohemia was an automatic 5/5 stars. Immediately after I watched episode one of the show, I knew I'd found a story I adored. I checked out the first three Sherlock Holmes short stories from the library and devoured A Scandal In Bohemia in one night. I'm now determined to read all fifty six Sherlock Holmes related stories of Arthur Conan Doyle's.I love Sherlock's unique and charismatic personality! He's much different in the books than he is in the TV show, but I love him nonetheless. While I relate to TV Sherlock, I admire and aspire to be novel Sherlock! Also, I'm almost positive TV Sherlock is asexual. It's great to see some main stream representation for underrepresented minorities.I also love John! He's such a sweetheart and his friendship with Sherlock warms my heart. It seems more problematic in the TV show than it is in the books, but both are equally enjoyable to watch/read.Irene Adler is brilliant and that's all I've got to say about that. I hope I'll be seeing more of her.I obviously won't reveiw all fifty six stories but I thought it was important to document my initial arrival to 221 B Baker Street! I'm sure Sherlock Holmes will be appearing more and more throughout my reading. This is defiantly the start of something beautiful!"}, {"userName": "Cintia", "userReviewDate": "Mar 22, 2015", "userURL": "http://www.goodreads.com/user/show/12050671-cintia", "userReview": "THE GAME IS ONExcellent!!I must say, if it has Sherlock Holmes on it, the book is, hands down, good. I had read this one a long time ago, and this time was actually a re-read. In the meantime, of course, I watched BBC \"Sherlock\", and, by the way, the episode based on this story is really awesome (the whole show is).I think the point of this story is to say that Sherlock isn't, after all, entirely foolproof. He's smart, and we all know what he can know with only looking at something/someone. But I love the fact that he was bested when he least expected it, and by the least likely person. A woman. \"The\" woman. It puts an end with the idea that the detective is perfect, that there's nothing that can be hidden from his mind. Sherlock never distinguished a woman from the next, they were all the same, and saw them more like an object of pathological study than people. But Irene Adler proved to be different, and defeated him in his own game. It's a short, quick, and entertaining read.When it comes to Sherlock Holmes, there's no time wasted!"}, {"userName": "Ashrakat Deyab", "userReviewDate": "Sep 28, 2013", "userURL": "http://www.goodreads.com/user/show/14397172-ashrakat-deyab", "userReview": "YES!! And my new favorite character is... Irene Adler! Which is a surprise since I hated her in the series. But yes, FINALLY, someone's able to beat Sherlock Holmes and it's a woman! Go go feminists! xD And can I just say that it is such a great thing that a story like this was written in a time when women still didn't have their full rights? So, Mr. Arthur Conan Doyle, you have my respect. Plus, this specific story was mostly comic relief so it was a very light and enjoyable read.Favorite quote(s):1.“By the way, Doctor, I shall want your cooperation.''I shall be delighted.''You don't mind breaking the law?''Not in the least.''Nor running a chance of arrest?''Not in a good cause.''Oh, the cause is excellent!''Then I am your man.''I was sure that I might rely on you.”2.“You see, but you do not observe. The distinction is clear.” 3. \"He used to make merry over the cleverness of women, but I have not heard him do it of late. And when he speaks of Irene Adler, or when he refers to her photograph, it is always under the honorable title of THE woman.\""}, {"userName": "Cáitín  Ní Loingeacháin ", "userReviewDate": "Jul 05, 2017", "userURL": "http://www.goodreads.com/user/show/48059322-c-it-n-n-loingeach-in", "userReview": "I loves this first look we get of Sherlock and Watson in their first every story together."}, {"userName": "Allie Mayenschein (alliecatreads)", "userReviewDate": "Jan 16, 2018", "userURL": "http://www.goodreads.com/user/show/25590259-allie-mayenschein-alliecatreads", "userReview": "While this ended up being anti climatic, I did enjoy how the reason it didn’t work out was because a woman was more clever than Sherlock was!"}, {"userName": "Emily", "userReviewDate": "Sep 11, 2013", "userURL": "http://www.goodreads.com/user/show/2342883-emily", "userReview": "A Scandal in Bohemia by Sir Arthur Conan Doyle is an interesting book to read. It was one that I assigned for my summer reading book group on Sherlock Holmes. I chose it because it was one of those stories what gets remade into TV and movie versions of Sherlock Holmes. So I thought I’d read up on the original version. I was half surprised and half completely not at the lack of romantic tension in it. I always thought it would be weird if Sherlock had a romantic attachment to someone, but it is built into all the shows and movies so I thought there must be something there. I think what makes it so vulnerable to misconception is the first lines: “To Sherlock Holmes she is always the woman. I have seldom heard him mention her under any other name. In his eyes she eclipses and predominates the whole of her sex.” But then Watson continues, “It was not that he felt any emotion akin to love for Irene Adler. All emotions, and that one particularly, were abhorrent to his cold, precise but admirably balanced mind.” I took that at face value, but apparently a lot of people still wonder.The other thing I like about Holmes, which is in this particular adventure, is that he does not always win. Sherlock has become such invincible super detective, the prototype to all modern mysteries, it makes me pleased to see that he actually wasn’t written that way. He may be a cold, calculating genius, but he can still be outwitted."}, {"userName": "Saw", "userReviewDate": "Jun 29, 2017", "userURL": "http://www.goodreads.com/user/show/69007263-saw", "userReview": "This is the book in which Sir Arthur introduces Irene Adler to us. She is brilliant. I was just 8 when I read this book in my native language. I really loved this. I didn't want Holmes to fall in love with her anyway. However, she married Godfrey Norton, right?But Daughter of Sherlock Holmes was published. And it is the book in which the author introduces Sherlock and Irene's daughter to us. I was like DAMN!!!"}, {"userName": "Mohammed", "userReviewDate": "Sep 25, 2015", "userURL": "http://www.goodreads.com/user/show/12729887-mohammed", "userReview": "ايرين إدلر أو كما يسميها هولمز \"المرأة\"الوحيدة التي كسرت تحفظ هولمز, وهي المرأة الوحيدة التي هزمت هولمز في لغز."}, {"userName": "Kat", "userReviewDate": "Mar 03, 2016", "userURL": "http://www.goodreads.com/user/show/6076668-kat", "userReview": "My first ever Arthur Conan Doyle read and it was awesome!!! I am binge watching Sherlock now. Definitely gonna pick up the rest of the short stories in the next days to come!"}, {"userName": "Teresa", "userReviewDate": "Apr 02, 2016", "userURL": "http://www.goodreads.com/user/show/21673685-teresa", "userReview": "La verdad es que me ha gustado pero como el vocabulario era un poco difícil alguna cosa se me ha quedado por el camino..."}], "description": "Holmes is hired by the King of Bohemia to recover blackmail evidence, held by the woman whom the king once promised to marry, but who he abandoned for a woman of noble birth.", "title": "A Scandal in Bohemia (The Adventures of Sherlock Holmes, #1)", "url": "http://www.goodreads.com/book/show/1848444.A_Scandal_in_Bohemia", "average": 4.22, "cover": "https://images.gr-assets.com/books/1189170223l/1848444.jpg", "reviews": 592, "authors": [{"url": "https://www.goodreads.com/author/show/17932981.Ronald_Holt", "name": "Ronald  Holt"}, {"url": "https://www.goodreads.com/author/show/2448.Arthur_Conan_Doyle", "name": "Arthur Conan Doyle"}], "type": ["Classics", "Mystery", "Fiction", "Mystery", "Short Stories"], "outlinks": ["http://www.goodreads.com/book/show/1848444.A_Scandal_in_Bohemia", "http://www.goodreads.com/book/show/6367051-a-scandal-in-bohemia", "http://www.goodreads.com/book/show/37581710-the-company-of-demons", "http://www.goodreads.com/book/show/40024832-empire-of-sin", "http://www.goodreads.com/book/show/8343548-the-bricklayer", "http://www.goodreads.com/book/show/40193155-among-the-wicked", "http://www.goodreads.com/book/show/23818400-the-snow-garden", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/23157833-almost-dead", "http://www.goodreads.com/book/show/33555347-crime-scene", "http://www.goodreads.com/book/show/30249521-fatal-frost", "http://www.goodreads.com/book/show/40266676-remains-of-innocence", "http://www.goodreads.com/book/show/34330657-finding-claire-fletcher", "http://www.goodreads.com/book/show/28824403-outfoxed", "http://www.goodreads.com/book/show/23957469-huntress-moon", "http://www.goodreads.com/book/show/40204087-the-deepest-secret", "http://www.goodreads.com/book/show/35115882-what-the-dead-know", "http://www.goodreads.com/book/show/40267317-ragdoll", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/39791173-the-girl-before", "http://www.goodreads.com/book/show/40205081-last-witness", "http://www.goodreads.com/book/show/40205040-dead-weight", "http://www.goodreads.com/book/show/18903409-weekend-warriors", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/40193809-eye-for-an-eye", "http://www.goodreads.com/book/show/27239265-the-short-drop", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/17623604-you-only-live-twice", "http://www.goodreads.com/book/show/17377392-thunderball", "http://www.goodreads.com/book/show/17284593-casino-royale", "http://www.goodreads.com/book/show/17623578-for-your-eyes-only", "http://www.goodreads.com/book/show/40193858-the-cuckoo-s-calling", "http://www.goodreads.com/book/show/17304110-live-and-let-die", "http://www.goodreads.com/book/show/18780375-dr-no", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies", "http://www.goodreads.com/book/show/17379070-moonraker", "http://www.goodreads.com/book/show/18799804-diamonds-are-forever", "http://www.goodreads.com/book/show/40205231-the-spy-who-loved-me", "http://www.goodreads.com/book/show/17377384-from-russia-with-love", "http://www.goodreads.com/book/show/40243961-the-cape-refuge-collection"]}