{"ratings": 341, "userreviews": [{"userName": "Tosh", "userReviewDate": "Jun 03, 2013", "userURL": "http://www.goodreads.com/user/show/133661-tosh", "userReview": "A collection of pieces that F. Scott Fitzgerald wrote for various publications that the editor James L. W. West put together showing his memoir writing. What's fascinating to me was that Fitzgerald was extremely famous at the time of these articles - so he conveys himself as a character that the public already knows about. In a sense he's a performer in his own writing.Some pieces are better then others but still all of them are interesting. All you get is really a snapshot but filtered through Fitzgerald's sense of style. I think he was an amazing writer."}, {"userName": "Michael", "userReviewDate": "Mar 10, 2012", "userURL": "http://www.goodreads.com/user/show/88295-michael", "userReview": "Mostly worthless. A bit of a Fitzgerald yard sale, this loosely thematic collection gathers together 19 ostensibly autobiographical pieces. I say \"loosely\" because most were written for a quick buck when FSF needed to pay the bills, so that the lion's share of the pieces (\"essays\" is too lofty a term for these sketches) read like throwaway of-the-moment glosses on, say, modern \"girls\" (tellingly not \"women\"). Thick with name checks and given to a self-indulgently chatty tone that has worn very badly, a reader would be hard pressed to see the real writer in this collection.If not, that is, for a few glimmers of greatness in the dross. In the first hundred pages are the amusing (though also faintly appalling) \"How to Live on $36,000 a Year\" and its follow-up, \"How to Live on Practically Nothing a Year,\" written in FSF's youth and both of which are worthwhile. But it is in the last fifty or so pages, when FSF is older and a bit disillusioned, that the best pieces lie. These final half-dozen pieces are more carefully written and perhaps as a result, touching. \"An Author's Mother\" is a deftly empathetic imagining of his mother's last hours that, by never directly addressing his grief, captures it all the better; and \"Author's House,\" \"Afternoon of an Author,\" and \"A Hundred False Starts\" all show us a writer prematurely in his twilight years, struggling to find something to say. The melancholy of these later pieces, like that in FSF's \"The Crack-Up,\" are a sharp reminder of just how good he was. A pity he didn't live past forty-four, didn't get through these dark years to a place where he could write from a wiser perspective."}, {"userName": "Sierra Sitzes", "userReviewDate": "Aug 19, 2013", "userURL": "http://www.goodreads.com/user/show/7630969-sierra-sitzes", "userReview": "I picked up my copy of this book at the infamous Shakespeare and Company in Paris this summer. I figured, being at one of the Lost Generation's creative epicenters, I might as well buy a book about the writers rather than the novels themselves. (Plus, I own most of Fitzgerald's work anyway.) I expected to gain a better understanding of Fitzgerald, his generation, and the thought behind his writing. I did not expect the impact this collection of essays would have on my own awareness as a writer. Fitzgerald's insight into his generation and the change between its predecessor and its successor is impressive. He writes with the wisdom of a man who observed much more than the forty-four years he was alive. His essays are impregnated with profound ideas and common sense without being pretentious. Consistently, there are references to politicians/socialites/actors of the time, but this edition contains a helpful appendix.A must read for any fan of the time after the Great War, the Lost Generation, or early twentieth century americana."}, {"userName": "Dee", "userReviewDate": "Jun 03, 2014", "userURL": "http://www.goodreads.com/user/show/23699961-dee", "userReview": "This book consisted of several short stories and essays which Fitzgerald had written during his career. Every piece was unique and provided insight into some aspect of Fitzgerald's character. All I can say is, he was an extremely hilarious and talented man!"}, {"userName": "Karen", "userReviewDate": "Nov 11, 2011", "userURL": "http://www.goodreads.com/user/show/2421965-karen", "userReview": "Many of the essays in here have been included in other works, so they are not exactly new, but it was fun to read them all together. They seem to be arranged chronologically so it was also nice to watch the writing style change over Fitzgerald's career."}, {"userName": "Wendy S.", "userReviewDate": "Aug 15, 2011", "userURL": "http://www.goodreads.com/user/show/3814776-wendy-s", "userReview": "\"What I Think and Feel at 25\" is my personal favorite."}, {"userName": "Mark Taylor", "userReviewDate": "Aug 13, 2017", "userURL": "http://www.goodreads.com/user/show/2501888-mark-taylor", "userReview": "F. Scott Fitzgerald’s non-fiction writings are not as famous as his novels and short stories, but they contain some superb pieces that shed light on the life of this fascinating author. One reason that might explain why Fitzgerald’s non-fiction writings are less well-known is that they have been scattered all over the place. It would be wonderful to have one volume that collected all of his major non-fiction pieces in one place. A Short Autobiography, edited by Fitzgerald scholar James L.W. West III, was issued in 2011 with the aim of collecting Fitzgerald’s non-fiction works that reveal more of his personal life. Unfortunately, A Short Autobiography doesn’t include any of the “Crack-Up” essays, but it does have many other excellent pieces.Another issue with Fitzgerald’s non-fiction is that some of the pieces are hard to categorize. Is “An Author’s Mother” fiction or non-fiction? It’s been published in collections of Fitzgerald’s fiction, but it also appears in A Short Autobiography. There’s obviously some fiction in it, as the name of the author in the piece is not F. Scott Fitzgerald, and unlike the author in the piece, Fitzgerald didn’t have a brother. However, the piece does seem to be a pretty accurate portrait of Fitzgerald’s mother, Mollie McQuillan Fitzgerald. Fitzgerald was constantly borrowing from his own life to inform his fiction, and the line between the two is often blurred. In the very first line of the first piece in A Short Autobiography, “Who’s Who-and Why,” from 1920, Fitzgerald writes: “The history of my life is the history of the struggle between an overwhelming urge to write and a combination of circumstances bent on keeping me from it.” (p.1) Little did he know how true this would be throughout the rest of his short life. There were always parties, and alcohol, and many other distractions for Scott that would keep him from his work. However, that being said, he was still very prolific despite all the distractions, turning out roughly 180 short stories, four completed novels and one unfinished novel in his forty-four years. In “Princeton,” an affectionate look at the university Fitzgerald attended, (and didn’t graduate from) he mentions that 5% of his class at Princeton were killed in World War I. That’s a staggering fact that makes clear what a large impact the war had on Fitzgerald’s generation. One of the pieces that showcases Fitzgerald’s sense of humor is “Salesmanship in the Champs-Elysees,” which is written in the voice of a French car salesman. For me, one of the highlights of A Short Autobiography was hearing Fitzgerald’s authorial voice in a more personal way.In “One Hundred False Starts,” an essay from 1933 in which Fitzgerald detailed the many ideas for stories he had that never panned out, he wrote: “There is the question of dog stories. I like dogs and would like to write at least one dog story in the style of Mr. Terhune.” (p.126) Two years later, Fitzgerald finally did write his dog story, “Shaggy’s Morning,” an odd account of a day in the life of a dog, written from the dog’s perspective. It was an interesting experiment, although perhaps not entirely successful. “Shaggy’s Morning” is one of the few Fitzgerald stories to be published during his lifetime that has never been collected in a book. In “Author’s House,” another essay written for Esquire in 1936, Fitzgerald wrote: “A writer’s temperament is continually making him do things he can never repair.” (p.139) This was certainly true in Fitzgerald’s case, as he wore out his welcome with friends again and again through his drunken behavior. One of the most beautiful pieces in the book is “The Death of My Father,” which Fitzgerald wrote after his father’s passing in 1931. He never finished it, and it was first published in 1951 in The Princeton University Literary Chronicle. It’s a short piece, only three pages long, but it paints a vivid picture of Scott’s relationship with his father Edward. In it, Fitzgerald wrote: “I loved my father—always deep in my subconscious I have referred judgements back to him, to what he would have thought or done. He loved me—and felt a deep responsibility for me—I was born several months after the sudden death of my two elder sisters and he felt what the effect of this would be on my mother, that he would be my only moral guide. He became that to the best of his ability. He came from tired old stock with very little left of vitality and mental energy but he managed to raise a little for me.” (p.118) This passage was repeated almost word for word in Tender is the Night, when Dick Diver learns of his father’s death: “Dick loved his father—again and again he referred judgements to what his father would probably have thought or done. Dick was born several months after the death of two young sisters and his father, guessing what would be the effect on Dick’s mother, had saved him from a spoiling by becoming his moral guide. He was of tired stock yet he raised himself to that effort.” (Tender is the Night, p.203) A Short Autobiography reveals parts of Fitzgerald that we don’t often get to see in his fiction. For this reason, it’s an essential read for fans of Fitzgerald’s writing."}, {"userName": "Sirène", "userReviewDate": "Mar 17, 2017", "userURL": "http://www.goodreads.com/user/show/6691242-sir-ne", "userReview": "Before I start this review, allow me to make a note that I have been completely in love Fitzgerald's work since I was 15. I have an extensive collection of Fitzgerald, from his novels to nearly every short story he has written. In addition, I was happy to find this book which has a compilation of news articles and columns he's written throughout his career. The beginning of the book had me completely in awe and starstruck because it was different from anything I have read from him. It was personal and intimate. I thoroughly enjoyed having the chance to glimpse inside the mind of the man who's writing encompassed the jazz age. The articles that stood out the most to me was How to Live on Practically Nothing a Year and \"Wait Till You Have Children of Your Own!\"All my biases aside, the writing falls weak and choppy from page 92 throughout the end. I was disappointed because halfway throughout the book it was obvious he was only writing because he needed the money. It is understandable considering how he talks about how often he and Zelda found themselves overspending and back to where they started in a situation where they ran out of money. Overall, I found myself underwhelmed and often times bored. The philosophical arguments and tangents are what keeps the rating of this book neutral for me because it was refreshing to know how progressive he was at such a conservative time period. I believe the book would have been great if it stayed consistent with a theme and left out the boring content he wrote solely to get out of debt."}, {"userName": "Erin Quinney", "userReviewDate": "Mar 26, 2018", "userURL": "http://www.goodreads.com/user/show/4269160-erin-quinney", "userReview": "\"Autobiography\" is a bit of a misnomer, but these essays do paint a picture of the man, if only a particularly blurry one. Fitzgerald frequently wrote just for the paycheck. There's, of course, nothing wrong with that, but it does call authenticity into question if a person has to write what will sell. Nevertheless, his talent is certainly obvious. Then, I already knew that. A few of these essays were very good and relevant in this climate of disillusionment. Some were amusing. The last one summed up Fitzgerald's generation quite nicely."}, {"userName": "Hannah", "userReviewDate": "Jan 02, 2018", "userURL": "http://www.goodreads.com/user/show/9003266-hannah", "userReview": "It was so nice to read something that made me feel nostalgic -- F. Scott Fitzgerald was such a big part of my teenage years, and now my adulthood as well. Reading several short bits of prose relating to his own growing pains as a young adult were incredibly reassuring and relatable. Reading about the disconnect that he, too, felt between generations and people as a whole was good to see -- for the world works on a cycle, and I find comfort in that promise.Reading this book was like sitting down and catching up with an old friend somewhere; nice, quiet, and homey."}, {"userName": "Louise", "userReviewDate": "Apr 03, 2018", "userURL": "http://www.goodreads.com/user/show/31434920-louise", "userReview": "I bought this at the Shakespeare & company bookshop in Paris. It started out very good, and I enjoyed reading about his thoughts about his wife and daughter. However, it just seems like a collection of articles, which don’t all seem autobiographical. There is also one point where there is just a list of drinks he has tried. . . I understand it was the prohibition, but 3 pages of a drinks list didn’t seem very autobiographical."}, {"userName": "Richie", "userReviewDate": "Aug 20, 2017", "userURL": "http://www.goodreads.com/user/show/11379917-richie", "userReview": "Wonderful insight into the mind of Fitzgerald. I really enjoyed the pieces on child rearing."}, {"userName": "Erika Dreifus", "userReviewDate": "Mar 01, 2012", "userURL": "http://www.goodreads.com/user/show/3856462-erika-dreifus", "userReview": "“At the time of his death, Fitzgerald [1896-1940] had not published an autobiographical work of any sort – something almost unimaginable in today’s climate. Now James L.W. West III, Edwin Erle Sparks Professor of English at Pennsylvania State University, has gathered 19 personal essays written from 1920 to 1940 and arranged them chronologically to disclose Fitzgerald’s life story. From ‘What I Think and Feel at 25′ to ‘One Hundred False Starts,’ these essays would seem to serve as an intellectual autobiography and should inspire Fitzgerald readers new or returning.”That Library Journal “pre-pub alert” piqued my curiosity in A Short Autobiography. With the blessing of my editor at The Writer, I requested a review copy. I expected to fall truly, madly and deeply in love with the book. I am left in a somewhat less passionate, but still positive, state.Don’t get me wrong: The Library Journal summary is correct, as far as it goes. But it fails to mention a salient point, tucked between the book’s preface (an essential introduction – do not skip it) and the first essay: “The texts for fifteen of the nineteen items in this collection are taken from My Lost City: Personal Essays, 1920-1940, a volume in the Cambridge Edition of the Works of F. Scott Fitzgerald published in 2005 by Cambridge University Press.” In other words, serious Fitzgerald aficionados may have encountered most of the essays in this book already.But for the garden-variety fans among us, the book offers a compact and intriguing reminder of Fitzgerald’s all-too-short life. Editor West is correct when he observes that Fitzgerald “wrote about himself with insight and humor, adopting poses and reinventing himself as the occasion required.” Readers who write are likely to pick up a few ideas about style and structure for their own future use.Moreover, A Short Autobiography*provides some tantalizing tidbits regarding Fitzgerald’s own writing and publishing history. The book’s first two texts – “Who’s Who – and Why” and “An Interview with Mr. Fitzgerald by F. Scott Fitzgerald” – date from 1920, the year when Fitzgerald’s first novel, This Side of Paradise, was published. Here is the opening sentence of the former essay: “The history of my life is the history of the struggle between an overwhelming urge to write and a combination of circumstances bent on keeping me from it.” The rest of the piece chronicles the rejections and obstacles that this lionized author encountered on his way to first-book publication.Thirteen years later, Fitzgerald published an essay titled “One Hundred False Starts.” This too is a must-read for other writers. Filled with confessions (“Yet even now when, at the recurrent cry of ‘Baby Needs Shoes,’ I sit down facing my sharpened pencils and block of legal-sized paper, I have a feeling of utter helplessness.”) and observations (“Mostly we authors must repeat ourselves—that’s the truth.”), this essay merits reading – and rereading.Apparently, Fitzgerald sought to publish a book very much like this one during his lifetime. He was on to something.*My thanks to Scribner for the complimentary review copy. A version of this review originally appeared in The Writer magazine.*"}, {"userName": "Josh Lewis", "userReviewDate": "Jul 02, 2016", "userURL": "http://www.goodreads.com/user/show/8062466-josh-lewis", "userReview": "There are many memorable essays in this compilation, especially in its latter half, and one does catch a good snippet of Fitzgerald's life through them. For instance, one can see a stark difference between the man wrote \"An Interview with Mr. Fitzgerald by F. Scott Fitzgerald\" and the one who authored \"Author's House.\" The former was written shortly after the success of Fitzgerald's first novel and was bright-eyed and self-indulgent; in contrast, the latter looked back on a life filled with failure and disappointment but also looking ahead with humility and wonder.Many of the essays do smack of Fitzgerald's attempt to make a living through their wide array of topics and chatty narrative, but one sees some glimmers of his life, especially through essays like \"How to Live on $36,000 a Year\" and \"How to live on Practically Nothing a Year.\" One thing is made clear through it all, though: he was sharply observant about his generation and their search for identity in between the world's two greatest wars. People reading this book can expect to get those few glimmers of Fitzgerald's personal life, but I would suggest his short stories or novels before this collection."}, {"userName": "Dale", "userReviewDate": "Mar 14, 2012", "userURL": "http://www.goodreads.com/user/show/1160645-dale", "userReview": "Fitzgerald is a tough one to critically review: I feel like his books shimmer on my shelf, full of art deco design and illegal liquor and cigarette holders. There's an allure there that you want to live inside, even when there's also shallowness, pettiness, and depression. That said, I'm quite immune when there's this little to draw you in. I agree with those who say there are some later gems and some moments of brilliance in the earlier works, but I really don't think these even remotely compare to some of his greatest work, and in particular, in the short-form. It's almost besides the point for me whether the works are technically fiction or nonfiction.For me, and this is entirely just my own preference and humble opinion, nothing in this book even remotely reaches the giddiness and zeitgeist (sorry, I know, it's a pretentious word, but I don't know how else to describe it) revealed in the last few lines of \"May Day\"\"What floor, please?\" said the elevator man.\"Any floor,\" said Mr. In.\"Top floor,\" said Mr. Out.\"This is the top floor,\" said the elevator man.\"Have another floor put on,\" said Mr. Out.\"Higher,\" said Mr. In.\"Heaven,\" said Mr. Out."}, {"userName": "Candace", "userReviewDate": "Mar 11, 2013", "userURL": "http://www.goodreads.com/user/show/2485970-candace", "userReview": "My favorites were \"What I Think and Feel at 25,\" and \"One Hundred False Starts.\"\"...I might as well declare that the chief thing I've learned so far is: If you don't know much--well, nobody else knows much more. And nobody knows half as much about your own interests as you know. If you believe in anything very strongly--including yourself--and if you go after that thing alone, you end up in jail, in heaven, in the headlines, or in the largest house on the block, according to what you started after. If you don't believe in anything very strongly--including yourself--you go along, and enough money is made out of you to buy an automobile for some other fellow's son, and you marry if you've got time, and if you do you have a lot of children, whether you have time or not, and finally you get tired and die.If you're in the second of those two classes you have the most fun before you're twenty-five. If you're in the first, you have it afterward.\" -excerpt from \"What I Think and Feel at 25\""}, {"userName": "Melissa", "userReviewDate": "Oct 05, 2011", "userURL": "http://www.goodreads.com/user/show/395209-melissa", "userReview": "Not really a biography so much as insight into Fitzgerald's way of thinking.I enjoyed the humorous essays much more than some of the others that spoke to his general disillusionment. He peppered his writing with a lot of references to popular figures of his time that I did not know - I'm glad his novels refrain from this, for the most part. Since most of these pieces were written for magazines, the pop culture was most likely appropriate.Still, it's not really a biography. You can only make guesses about the course of his life from the essays. I think this book would be much more interesting to a person who has read an unauthorized biography of Fitzgerald and knows the facts and events of his life."}, {"userName": "Christine Rebbert", "userReviewDate": "Aug 26, 2013", "userURL": "http://www.goodreads.com/user/show/2413207-christine-rebbert", "userReview": "A collection of essays in an autobiographical vein, written during the years he was between 20 and 40. My favorite ones were \"How to Live on $36,000 A Year\" followed by \"How to Live on Practically Nothing a Year\"; in the one, he's amazed to find they spent that much in one year, but trying to economize -- primarily by moving to Europe, where he's told one can live on next to nothing -- doesn't really pan out either. Some have not \"aged\" well. Some pieces were first published in popular mainstream magazines like Saturday Evening Post but are so \"literate\" that it's hard to imagine them being well-received in present-day popular magazines. But a nice addition for those trying to consume everything FSK..."}, {"userName": "T.E.", "userReviewDate": "Jan 01, 2016", "userURL": "http://www.goodreads.com/user/show/10373937-t-e", "userReview": "Read this because I really wanted to re-read \"This Side of Paradise,\" but I left it in my dorm over the holidays so I made do with this. Not half bad, I guess; I like Fitzgerald every so often in decent doses. His essays are, however, rather vastly inferior to his fiction, and he's still a bit of a stuck up, sad little twerp who needs to settle down. Also, his humor is--not humorous. It's got a sort of forced gaiety to it like some kind of vaudeville show or something. I dunno. He's not very funny; he shouldn't try.Anyway, very enjoyable read.Get bent, Fitzgerald."}, {"userName": "Sera", "userReviewDate": "Dec 09, 2011", "userURL": "http://www.goodreads.com/user/show/576203-sera", "userReview": "I really enjoyed this compilation of essays by Fitz. I admit that I have a bit of a crush on him, because he was a very witty and clever man, who happened to look good, too. I found some of his takes on the role of women as mothers and how to parent to be very interesting, albeit aloof and a cynical. I also enjoyed reading about how difficult it was for him to write.The only flaw was that there wasn't much about Zelda. I wouldn't call this an autobiography but the book does give some good insight into the man that Fitz was in his own words."}, {"userName": "Matt Thomas", "userReviewDate": "Mar 03, 2012", "userURL": "http://www.goodreads.com/user/show/5929429-matt-thomas", "userReview": "This is a collection of Fitzgerald's articles published in the Saturday Evening Post, and other popular magazines of the roaring '20s. Each one provides some insight into the famous author, characterizing him as egomaniacal, brilliant, and hopelessly selfish. It contradicted the portrait I had formed of Fitzgerald after reading The Great Gatsby so many times. I was hoping for introspective; courageous; caring; someone able to grow beyond a narcissistic self-image constructed at the age of 12. I guess I was hoping for Nick Carraway, the hero Fitzgerald knew he could never be."}, {"userName": "Jennifer", "userReviewDate": "Nov 18, 2016", "userURL": "http://www.goodreads.com/user/show/2073950-jennifer", "userReview": "This was a great collection of personal essays by F. Scott Fitzgerald that he published in various magazines and newspapers in the '20s and '30s. There were a couple of essays that were so overburdened with cultural and political references that even with the annotations it was hard to make heads or tails of them. The essays about the craft of writing were revelatory and I loved them. I'm not sure what I love more - reading works by authors I love or reading about the writing process of authors I love."}, {"userName": "Liv ", "userReviewDate": "May 05, 2013", "userURL": "http://www.goodreads.com/user/show/1650769-liv", "userReview": "So this one's complicated because it claims to be an autobiography, but is really a collection put together of his essays and such because Fitzy never wrote an autobiography (his publisher wouldn't accept it - stupid). So there were some that were very intriguing and enjoyable to read; others, I couldn't really connect to the content or what he was saying. Regardless, did give me some insight into this great writer."}, {"userName": "Joe Mossa", "userReviewDate": "May 08, 2016", "userURL": "http://www.goodreads.com/user/show/193186-joe-mossa", "userReview": "this is a taste of his non fiction. it s not an autobiography. he talks of his struggles being a writer and the difficulties of writing to earn money. Like Virginia Woolf he says ..all you need to earn money is a pencil and some paper.. I like that concept and wish I could do so with my many writings. but, although i consider myself to be a writer, i never rewrite. thus, i have many handwritten journals which no one but me can read. i wished i would have typed them years ago."}, {"userName": "Megan", "userReviewDate": "Dec 15, 2014", "userURL": "http://www.goodreads.com/user/show/37964296-megan", "userReview": "Some essays were better than others, but overall I loved this book simply because I love Fitzgerald. He was clever and gifted with incredible insight, and didn't spare himself or his peers from his sharp analysis and criticisms. Fitzgerald also possessed an unmatched wit that shines through in his non-fiction essays."}, {"userName": "Diane Heath", "userReviewDate": "May 08, 2013", "userURL": "http://www.goodreads.com/user/show/13343364-diane-heath", "userReview": "This \"autobiography\" is actually a collection of essays/short stories from F Scott Fitzgerald. Knowing him only because of The Great Gatsby, I found some of the essays of interest and quite fun while others seemed a bit slow. His essays re: Living on $36,000 a Year and Living on Nothing were more autobiogtaphical in nature and fun to read."}, {"userName": "Kate", "userReviewDate": "Aug 25, 2011", "userURL": "http://www.goodreads.com/user/show/1643707-kate", "userReview": "This is a fun little book for a Fitzgerald fan (like me), but not as advertised: for true autobiography, try \"The Crack-Up\" or the many wonderful collections of Scott's correspondence (especially \"The Correspondence of F. Scott Fitzgerald,\" which I believe is out of print). This collection is, for the most part, glib magazine work -- clever and well-written, but a far cry from autobiography."}, {"userName": "Kevin Kizer", "userReviewDate": "Oct 15, 2011", "userURL": "http://www.goodreads.com/user/show/2412154-kevin-kizer", "userReview": "Didn't even know this was out until I saw Scott's doleful eyes staring out at me as I passed by in a bookstore. An interesting read for F. Scott devotees. Not a MUST read, but insightful as to F. Scott's state of mind as he passed from the brilliant energetic young novelist to the bitter 40-something would-be screenwriter."}, {"userName": "Stacy", "userReviewDate": "Feb 26, 2012", "userURL": "http://www.goodreads.com/user/show/7898977-stacy", "userReview": "This collection was put together by my favorite English professor, so I'm a bit biased. That being said, if you're already a Fitzgerald fan, you'll love a behind the scenes look into his writing and state of mind. If you aren't yet a Fitzgerald fan, these wise, unflinching, and still timely essays will most likely inspire you to seek out his work."}, {"userName": "W.T.", "userReviewDate": "Mar 31, 2013", "userURL": "http://www.goodreads.com/user/show/930443-w-t", "userReview": "I've spent a lot of years reading literature and classics and there is a near, slight embarrassment when I admit that I've never read anything by F. Scott. Additionally, all I know of the man is from what I have read about his contemporaries when they are all lumped together in a discussion. Personally, I enjoy the idea of reading about the man before I read his work."}], "description": "A self-portrait of a great writer. A Short Autobiography charts Fitzgerald's progression from exuberant and cocky with \"What I think and Feel at 25\", to mature and reflective with \"One Hundred False Starts\" and \"The Death of My Father.\" Compiled and edited by Professor James West, this revealing collection of personal essays and articles reveals the beloved author in his own words.", "title": "A Short Autobiography", "url": "http://www.goodreads.com/book/show/10842701-a-short-autobiography", "average": 3.69, "cover": "https://images.gr-assets.com/books/1332189617l/10842701.jpg", "reviews": 45, "authors": [{"url": "https://www.goodreads.com/author/show/3190.F_Scott_Fitzgerald", "name": "F. Scott Fitzgerald"}, {"url": "https://www.goodreads.com/author/show/901670.James_L_W_West_III", "name": "James L.W. West III"}], "type": ["Nonfiction", "Biography", "Autobiography", "Biography"], "outlinks": ["http://www.goodreads.com/book/show/10842701-a-short-autobiography", "http://www.goodreads.com/book/show/11869163-a-short-autobiography", "http://www.goodreads.com/book/show/4671.The_Great_Gatsby", "http://www.goodreads.com/book/show/46164.Tender_Is_the_Night", "http://www.goodreads.com/book/show/46165.This_Side_of_Paradise", "http://www.goodreads.com/book/show/747746.The_Curious_Case_of_Benjamin_Button", "http://www.goodreads.com/book/show/4708.The_Beautiful_and_Damned"]}