{"ratings": 117, "userreviews": [{"userName": "Janie", "userReviewDate": "Aug 22, 2015", "userURL": "http://www.goodreads.com/user/show/4853971-janie", "userReview": "Rating: 2.5 stars.I purchased this from watertones because the hardcover book was on deal. The book was alright, not the type I would pick out now but it was decent. The hero (or the guy who the heroine ends up with) isn't the sort I liked. I like my alpha males. Oh, and the heroine isn't the type I liked either. I did however put the hardcover book to good use! I cut out the pages and hollowed it out and used it for my art project assemblage piece."}, {"userName": "Anne", "userReviewDate": "Dec 30, 2009", "userURL": "http://www.goodreads.com/user/show/2464996-anne", "userReview": "This is a really lovely book: Natalie's a most endearing heroine, and although the story strains your credulity a bit - can you imagine meeting someone at a speed dating event who gives you the use of a rent-free flat in Rome? - once she gets to Italy it soars. It's well written, funny (her job as a jumper-outer on Rome ghostwalks is brilliant!) and full of memorable and distinctive characters like the lovely Teresa the food writer, Olivia who runs the tea museum, Claudio the stud estate agent. There's food in abundance, lots of Rome detail, a touch of Keats and Shelley and a to-die-for romantic leading man. I'm with Anne on chick lit - when it's done well it can be excellent, and this book was wonderful. Don't miss it."}, {"userName": "Liz Fielding", "userReviewDate": "Apr 12, 2010", "userURL": "http://www.goodreads.com/user/show/3546122-liz-fielding", "userReview": "I really enjoyed this book. The heroine was human in every way. Weak, strong, funny, sad. And I loved the ending."}, {"userName": "Philippa", "userReviewDate": "Jul 28, 2010", "userURL": "http://www.goodreads.com/user/show/2131056-philippa", "userReview": "The ending was what made me give this 3 stars rather than 4 - because I really liked the book as a whole, I found it a very absorbing tale,if very familiar! I've certainly been there done that, so I identified with the heroine Natalie to some degree. The description of Rome and the flat where she's living, the food her neighbour cooks (drool!) and the relationships she develops in her time there were all well written and interesting reading. The only problem I had was towards the end when bloody Michael shows up and she goes back to him (at first)!! I was like, \"Natalie!! WHY?!\" I really wanted her to have a showdown with him, and I just kept waiting for her to throw a drink in his face or something, SOMETHING to demonstrate her newfound self esteem and that she deserved better. But perhaps that was the point - perhaps Sarah Duncan is trying to show us that we can be very weak sometimes when we are faced with the opportunity to get back with someone we once loved, even if we feel in our gut it's the wrong thing to do, this whole idea of being settled and with someone is very appealing, even if the person offering that to you is wrong for you. But I've always been a bit cut-throat when it comes to exes and have never gone back to any of them, ever, so I couldn't relate to this at all!!Anyway, even though it did end with her ditching Michael the arsehat at the airport, I still felt it was too close for comfort because there's only something like 4 pages left of the book by the time she finally gets rid of him, so I spent all of that time feeling like she was going to get back with him!! By the time the book ended it all just felt a bit anti-climactic for me. But overall it's a lovely book and a fun read - kept me occupied from London to York and back, quite happily!"}, {"userName": "Dorothy", "userReviewDate": "Aug 07, 2015", "userURL": "http://www.goodreads.com/user/show/10695144-dorothy", "userReview": "[I would have liked to see Natalie be strong enough to reject Michael instead of meekly agreeing to move in and accept the job. I thought less of her because she seemed to be going down the road of \"any man is better than no man\". I can see why the author did it - she wanted to extend the story by another chapter. But for me, it was one Black Moment too far!  (hide spoiler)]"}, {"userName": "Marie", "userReviewDate": "Mar 12, 2013", "userURL": "http://www.goodreads.com/user/show/7776008-marie", "userReview": "In the beginning, this book reminded me a lot of \"Eat, Pray, Love\"- the ending of a relationship, the fleeing to Rome, the food, new friends, but luckily that's where the similarities ended, because I would have hated to re-read something copied or similar. Sarah Duncan has her own unique style of writing, with her english wit and humour, she makes you enjoy what you're reading. I love books that are set in different surroundings, because they let you travel along with them, as though you're experiencing new things through the eyes of the author and seeing new settings with them. I also liked the ending, it was satisfying, and what I was waiting for..."}, {"userName": "Darlene Abdilla", "userReviewDate": "Nov 08, 2011", "userURL": "http://www.goodreads.com/user/show/5225879-darlene-abdilla", "userReview": "The only reason I chose to read this book is because of my obsession with Italy. However I can actually say I enjoyed the book it actually makes you think of the stupid mistakes we do because we want to be liked by others. Although the story strains your credulity a bit - can you imagine meeting someone at a speed dating event who gives you the use of a rent-free flat in Rome? Still it is written in an excellent way and I really loved the ending!"}, {"userName": "Nikki", "userReviewDate": "Aug 18, 2011", "userURL": "http://www.goodreads.com/user/show/5542850-nikki", "userReview": "Entertaining book finished in two sittings (one late night!), made more enjoyable by following the author's blog and occasionally sitting back and trying to see her tips and techniques put into action."}, {"userName": "Shay", "userReviewDate": "Aug 13, 2011", "userURL": "http://www.goodreads.com/user/show/3135022-shay", "userReview": "Very easy to read - the plot isn't exactly a surprise, but I liked the location and the characters. It probably isn't even that realistic but I don't want to start nit picking! I would recommend it to anyone who wants to escape to Rome, and will probably read it again."}, {"userName": "Chanpreet", "userReviewDate": "Jul 25, 2011", "userURL": "http://www.goodreads.com/user/show/5334800-chanpreet", "userReview": "I had been really excited to read this book, but I wasn't able to get into the book. It just didn't live up to its hype. :("}, {"userName": "Pollypoptart", "userReviewDate": "Jan 12, 2010", "userURL": "http://www.goodreads.com/user/show/1855606-pollypoptart", "userReview": "Loved this book - and it made me REALLY want to visit Rome!"}, {"userName": "kelly", "userReviewDate": "May 15, 2013", "userURL": "http://www.goodreads.com/user/show/16367408-kelly", "userReview": "A little disapointing but enjoyable to read!"}, {"userName": "Spidermonkeyloo", "userReviewDate": "Mar 10, 2014", "userURL": "http://www.goodreads.com/user/show/20862745-spidermonkeyloo", "userReview": "The reason I have given this 2 stars is because I am soon heading to Rome myself, so enjoyed reading about the various landmarks and tourist attractions. It made me more excited to go!"}], "description": "A warm and romantic tale of love, sex and making the right choices from the increasingly popular author of NICE GIRLS DO and ANOTHER WOMAN'S HUSBANDWhen Michael tells Natalie that he 'needs space', she’s devastated. She thought he was the love of her life but now Michael’s found himself a new girlfriend. So much for space. Natalie tries speed-dating, but how could she move on when she's still yearning for Michael? One of her speedy dates is Guy and, despite the lack of chemistry, at least she's now got a date for her best friend's wedding. But past indiscretions are about to come to light. Natalie needs to escape. Guy happens to own a flat she can borrow... in Rome! There Natalie makes some fabulous new friends and discovers who puts the Rome into Romeo. She's falling in love – but is it with Rome, or with someone she finds there?", "title": "A Single to Rome", "url": "https://www.goodreads.com/book/show/7173476-a-single-to-rome", "average": 3.76, "cover": "https://images.gr-assets.com/books/1348428474l/7173476.jpg", "reviews": 14, "authors": [{"url": "https://www.goodreads.com/author/show/93840.Sarah_Duncan", "name": "Sarah Duncan"}], "type": ["Womens Fiction", "Cultural", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/7173476-a-single-to-rome", "http://www.goodreads.com/book/show/7173480-a-single-to-rome", "http://www.goodreads.com/book/show/161857.Adultery_for_Beginners", "http://www.goodreads.com/book/show/273282.Nice_Girls_Do", "http://www.goodreads.com/book/show/7494149-kissing-mr-wrong", "http://www.goodreads.com/book/show/3228473-another-woman-s-husband", "http://www.goodreads.com/book/show/26127927-the-ultimate-self-sufficiency-guide"]}