{"ratings": 3980, "userreviews": [{"userName": "Madeline", "userReviewDate": "Jan 26, 2010", "userURL": "http://www.goodreads.com/user/show/617334-madeline", "userReview": "1. There are three things you should know about this book before you start it:1a. IT IS BRILLIANT.1b. EVERYONE IN IT IS EXTREMELY FUCKED UP.1c. It's gonna wear you out.2. As Meat Loves Salt is a dark, brutal, intelligent, and moving novel. If you could write Caravaggio down, it would be this book. (Interestingly, it has a lot in common with Jarman's movie too - and for reasons other than obsessive erotic fixations with beautiful blond men!) It is beautiful and frightening - terrifying, in some places - but captivating and startlingly erotic.3. By far the most remarkable thing about the book is the protagonist, Jacob Cullen. Other people have called him a sociopath, and while I agree that he'd probably benefit from some modern medication, his problems stem not from his lack of a conscience but from his susceptibility to anger. He's a monster, but he's far from the only monster in As Meat Loves Salt. (Also, he has no personal charm. His life is not smooth, and he's not really an opportunist - I mean, okay, if we want to talk about fictional characters that might be sociopaths, Scarlett O'Hara is probably much closer to that profile. But Jacob Cullen is in thrall to his own wrath - he's a sinner, a criminal, and a violent man, which is plenty, honestly.) His violence manifests on a different scale than that of the men around him; as we see in the passages about the New Model Army, he disdains the brutality of the seventeenth century soldier, which creates a fair amount of irony. But actually, this makes him more frightening, because Cullen's violence is so wrapped up in how he thinks of love. He kills - and rapes - to defend what he thinks of as his. His deep insecurity makes him easy to rouse to anger, but it makes his love fierce and compelling (and completely fucked up, which bears repeating). However, the way McCann immerses us in the violence, including the violence Jacob enacts, creates a very attractive argument against passion . . . or at least against the particularly twisted, Heathcliffe-like passion exhibited here.4. I'm rarely absorbed so much by a book - I think it actually sped up my metabolism, so, uh, yeah - and I was definitely overstimulated by this one. It's an easy book to fall into, which is part of why it's so disturbing. But I like it when books freak you out, a little. Or a lot. This one freaked me out a lot, but in ways that made me want to draw ENORMOUS HEARTS ON IT.5. The love story - I don't have any hesitation calling it that, although it goes veryveryveryvery wrong by the end - is excellent. It's convincing and however many problems you have with Jacob you still want it to work. Oh, and actually the sex is pretty delicious too, and it's not described with flowery phrases or anything terrible (thank god).6. Other things As Meat Loves Salt reminded me of: Giovanni's Room (it's kind of a facile comparison . . . unless you've read them both), A Suitable Boy (anti-passion, complicated historical/political/social themes), La haine (violence). There are probably others I'm too mentally exhausted to think of right now.*ETA October 31, 2012: I thought rereading this would be easier than the first time, because I thought if I knew what happened it would be easier to deal with it.I was wrong.A. W. Eaton has an article on rough heroes (I have a number of problems with the article but that's irrelevant), and I . . . really wonder if she's read this book."}, {"userName": "mark monday", "userReviewDate": "Jun 14, 2015", "userURL": "http://www.goodreads.com/user/show/131922-mark-monday", "userReview": "O Wrath, your tang is surely the most spicy and pungent of all the Seven Deadly Sins! your flavor is compelling, so exciting and satisfying... it gives purpose and heat and righteousness all at once. never mind the taste of ashes left in the mouth after the meal is over; that is soon forgotten in the yearning to again consume the dish and recapture its flavor once more.As Meat Loves Salt is many things: a thrilling historical novel of the 17th century English revolution; a darkly-hued psychodrama about a man and his demons; a story about another man, idealistic, born before his time and bound to suffer for it; a tragic tale of best laid plans gone awry and dreams ground to dust; a book detailing the horrors of violence; a passionate romance.the historical context and the details of living in that era are meticulous and vividly depicted - but they never overwhelm the narrative. \"you are there\" as the cliche goes, but this is not an intensely immersive experience. ignore the nonsensical description on the back cover that goes on about the food and decor and clothing described within - that is barely present in any way other than to set a scene. details never take over the plot and never overshadow the themes. enough description is given to allow the reader to feel how the surroundings actually feel. overall the key word is not \"lush\" - it is \"stark.\"the prose is amazing.warning: there are two devastating rape scenes in this book.the anti-hero of As Meat Loves Salt is beautifully rendered. Jacob Cullen runs hot and when his flames aren't high, he smolders. he's both monster and man, lover and rapist, hero and killer; he's many things. a man who has only the bitterest contempt for the mechanized quality of a life of service, who chafes at the class system, and views his fellow humans with thinly veiled suspicion. violence comes all too easily to him; he is a man consumed by wrath, always ready when opportunity arises to indulge in that vice. it is curious to read reviewer responses to this character because many seem to hold him at a distance, to view him as an Other, to talk about him in terms of his villainy or his potential schizophrenia. I had a different experience in that I saw a lot of him within me. I've experienced the same unreasonable and foolish jealousies, the same vindictive pettiness, the same lack of faith in both structures and individuals, the same urge to do violence on those who annoy or offend me. I think many men and not a few women have felt the same. and I've certainly felt his yearnings for perfect companionship, his stumblings towards some inchoate spirituality, his deep attraction to a person he has deemed as \"good\", his core of neediness that his pride has transformed into a thorny barrier that warns Beware rather than beckoning Come Hither. Jacob Cullen, I totally get you.the love of Jacob's life, Christopher Ferris, is also perfectly rendered. he's certainly worthy of a swoon. Ferris' innate goodness, his idealism and kindness and sunny demeanor, his desire to create a society that is fair and equal, his hatred of injustice and how he dismisses both hoary institutions and \"inspiring\" politicians in all of their many guises, his contempt for violence and possessiveness... all of that fit hand-in-glove with his less attractive qualities - condescension and high-handedness, a transparent sort of trickiness, a tendency to overindulge in alcohol, an optimism that veers into thoughtlessness and, finally, a willful blindness to reality.McCann adroitly contextualizes Jacob and Ferris's relationship and their very different personalities within all of the changes happening during this particular revolution. the desire to throw off the yoke of class and gender barriers; the basic need for freedom. but even more than a contextualization, their relationship and their personalities both comment on and personify those things - and how those things often end in terrible failure. but whether such people and endeavors eventually fail or not, that chafing at the bit is a key part of the human condition. such things often leads to ugliness and violence, but such is life.In the souls of the people the grapes of wrath are filling and growing heavy, growing heavy for the vintage.- John Steinbecksweet Jesus, that ending. so hard and true and sad. so full of unanswered questions. the ending of As Meat Loves Salt is a good reminder of why and how a truly excellent book can be so rewarding and fulfilling yet also be so tough and draining and heartbreaking. an experience to remember and to learn from, but perhaps not one to repeat."}, {"userName": "karen", "userReviewDate": "Feb 20, 2009", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "this is the kind of book worth missing a subway stop for; and another book i have had for at least five years without picking up. how many hidden jewels do i have buried under stupid lurid family sagas?? but to be relevant: this is a real sink-your-teeth-into-it book, full of war and rage and betrayal and rough sex. but there are some tender things in it to, like umm... umm.... i dunno, a man who loves red-tinted glass?? yeah but he does some raping, so.. there are some rabbits... but they are mostly food. no i suppose this isnt a gentle book but it is wonderfully written, and there is some true love in it, its just not rodanthe love. which i think is a good thing."}, {"userName": "Paul", "userReviewDate": "Sep 26, 2007", "userURL": "http://www.goodreads.com/user/show/424914-paul", "userReview": "This book will make you absurdly happy and sad. At one point, I read trembling with excitement, my heart racing and a smile stretched on my face. The day before I had sworn never to read it again. The thing about this book is that you will find yourself repulsed by the protagonist, you will hate him, and yet you are bound to him. And throughout it all you will play the part of the good angel on his shoulder, just hoping he will make the right choices. And when he does you feel happy enough to explode. And when he doesn't you throw the book across the room and go for a walk. No book has ever made me want to do either, so this book is extraordinary - a gloriously frustrating read."}, {"userName": "Michelle, the Bookshelf Stalker  Queen of the Undead", "userReviewDate": "Mar 19, 2011", "userURL": "http://www.goodreads.com/user/show/3039709-michelle-the-bookshelf-stalker-queen-of-the-undead", "userReview": "I will never, ever, ever start a book late at night again (or until I forget that I said this). I literally read this book straight through the night, non fricking stop! This damn author has this wicked ability to warp my numb ass right back in time so that I felt like I was there watching the scenes unfold instead of simply reading the scenes.Oh and let me tell you the scenes I was watching were not of the fluffy bunny type. No, they were of the Ted Bundy type. Here is the most twisted revelation of my book reading-instead-of-sleeping experience, I felt for Jacob. Jacob, innocent & sane servant to definitely not innocent, questionable sanity but no longer a servant; is one of the most fascinating characters I've read about in a long, long, long time.Ok, here is my disclaimer. This book is definitely not for everyone. Shoot, it is probably not for most people (but I still think plenty of people will seriously enjoy this book). There are brutual scenes in this book but they are necessary in telling Jacob's story.All right, enough rambling. I can't even say I'm going to sleep now because noooo, I can't. I have a full day ahead of me.Damn you Maria McCann!"}, {"userName": "Marita", "userReviewDate": "Jan 19, 2014", "userURL": "http://www.goodreads.com/user/show/17415449-marita", "userReview": "Oh my gosh; it is hard to believe that this well researched story is a debut novel.The anti-hero of this novel spends most of his life struggling with his inner self. At the start of the novel Jacob Cullen seems a perfectly ordinary young man about to marry his sweetheart, and then wham!In the next part of the novel Jacob is fighting in the English Civil War on the side of the Roundheads. It is here that Jacob meets the love of his life and where we get to know him better. A large muscular man, Jacob is menacing and even violent towards those who thwart him or get in his way and on the other hand he is obsessive about the one he loves. At times he is completely overcome by jealousy and unable to control his passions. In this manner he manages to isolate himself more and more and he becomes known as the Bad Angel. He is aware of his problems and he tries not to listen to \"the Voice\". Like so many of us he often wishes that he can go back in time and change what he has done or not do it at all!Christopher Ferris takes Jacob under his wing and together they end up staying with Ferris's aunt in London. Ferris is the antithesis of Jacob in every way. Ferris cares about people and his great desire is to create a commune where everyone is equal and all share in the labour and subsequent rewards. And this leads to a new phase in their lives, but will Jacob be able to curb his neediness and his jealousy? Will he be able to bridle his tongue and his propensity for violence?Towards the end there is an interesting twist - I was wondering how this issue was going to be resolved. And then comes the shattering finale...###Note: There are some graphically described rapes in this novel."}, {"userName": "Catie", "userReviewDate": "Dec 13, 2010", "userURL": "http://www.goodreads.com/user/show/1886642-catie", "userReview": "This is one of those books that I just fell hard and fast for – there was no “warming up” or “getting to know you” period. The first line is one of my favorites this year:”On the morning we dragged the pond for Patience White, I bent so far down trying to see beneath the surface that my own face peered up at me, twisted and frowning.”It immediately sets the gruesome scene, and is the first peek into a dark mind. Maria McCann has such a gift for writing. I feel like I didn't so much read this book as lived it. Every sentence is so potent; I just wanted to linger in this book (as heartbreaking as it is) for days. When I put it down, I felt a little lost for a while. That’s the hardest and most brilliant part of this book – I was so connected to the main character that I felt everything that he was feeling, and I dared to hope for great things for him. Unfortunately, this is a doomed hope because Jacob Cullen “was not made to be loved” (in his own words).Jacob Cullen is a large and imposing man, dark and prone to violence, possessive with hints of madness. He loses his temper and commits unspeakable acts. Desperate and on the run, he joins up with a group of soldiers and meets quiet, naïve dreamer Ferris. As his attachment to Ferris becomes more intense, he becomes more emotionally unstable.Jacob is as compelling as he is unreliable. I was drawn in by every word, but at the same time was caught wondering how much is colored by his own madness. I really wonder what this story would have looked like from another character's point of view. Through the course of the book Jacob shows himself to be cruel, abusive, and quick to anger, but he also shows himself to be caring and loyal and brave. I hoped desperately for Jacob to find peace and happiness, but I read this book with a sense of total dread, waiting for the other shoe to drop. This is a book about the complete altering power of love - it can make you gentle and patient; it can make you crazy; it can make you lose everything. Perfect Musical PairingRadiohead – All I NeedAs usual, there are some differing opinions on the interpretation of the lyrics of this song. But, since this is my review, my opinion is all that matters! Mwa ha ha! I think that this is the ultimate intense, devoted, sick-love song. It has a dark, haunting orchestral sound that fits perfectly with this book.I'm an animalTrapped in your hot carI am all the daysThat you choose to ignoreYou are all I need"}, {"userName": "Laura", "userReviewDate": "Aug 20, 2011", "userURL": "http://www.goodreads.com/user/show/6087599-laura", "userReview": "Time for a VERY belated review:I am currently reading Ace, King, Knave by Maria McCann, and unfortunately I can't help but compare it to this first of her books that I read, which I'm not sure I will ever get over. I wish I had been a Goodreads member when I read it, so that I would have had a reason to write down my thoughts on paper. I remember it being on my mind for days, probably weeks after I finished it, and it still haunts me. As well as being one of the best examples of realistic, gorgeously vivid and detailed historical fiction I ever encountered, it's one of the most powerful and disturbing works as well. A big part of the impact comes from the unique narrative voice, a 17th century man named Jacob who is probably a paranoid schizophrenic before such a definition existed- a man constantly driven and inhabited by his “dark angel.” I once read that early schizophrenics sometimes thought the voices they heard were the devil, since that fit the belief structure of the time. I think Jacob saying it is his father's voice, guiding him, then later the Devil, both leading and cursing him, is just his way of trying to make sense of the voice in an era when they had no concept of his condition. What makes the novel so dark is that Jacob is in many ways a despicable character, who does terrible things, yet it is hard not to be captivated by him, to feel for him, and to at times forget what he is capable of and root for him. In that way, the author is \"beguiled\" by him just like Ferris, and Caro, and others. In the ambiguous last section, as Jacob seems to be lapsing into his delusions more and more, he becomes a truly unreliable narrator, and the reader can only speculate about how much of what he sees and believes (the true identity of the woman with the baby, for example) is a trick of Jacob's mind. In my opinion, the cruel irony of Jacob’s story is that he is drawn to good/beautiful people in a very innocent way- he truly wants to love and be loved by them. But he and the \"dark angel\" lurking in his mind seem destined to destroy them instead, which makes him a fascinating and complex anti-hero.The other central character, Christopher Ferris, is also complicated, and a man of contradictions. He has that trait where he's drawn to save people, and there can be hubris in that, as well as goodness. I view his tragic flaw as a kind of stubborn idealism; a refusal to abandon his vision of a better world, or the good in people, even when reason dictates he should. Ferris is in some ways a progressive, rational man, but in others ignores all rationality. That said, I grew incredibly attached to his character.I would never call this book a love story; I think it is almost impossible to characterize, except as dark, visceral historical fiction. I also think it must be polarizing, a book readers might find horribly disturbing, or brilliant and haunting (or like me, both.)"}, {"userName": "Whitaker", "userReviewDate": "Aug 09, 2009", "userURL": "http://www.goodreads.com/user/show/1415047-whitaker", "userReview": "Ah yes, tortured gay romance. Exceedingly tortured gay romance. \"Is there any other kind?\" he asks, tongue firmly in cheek. Actually, this was much better than that piece of tortured fluff Call Me by Your Name. For one thing, there's no masturbation-with-a-ripe-peach scene. Other than the sheer cheesiness of that, if you've ever held a squishy ripe peach in your hand, you'll know that the end result of that will be smeary peach pulp and not two neat halves that can be assembled back together like a Tiffany box with a diamond ring inside. That type of maudlin saccharine fantasy is not what you are going to get here. This story has heft. We are in the head of Jacob Cullen, and he can be an exceedingly unlikeable man. Indeed, the novel starts off with us learning that he has killed someone. And after that he rapes his newly wedded wife. Later, he bashes his best friend. This is one chappie who really should go for Anger Management Classes. But, those were violent times. England was in the throes of the Glorious Revolution. We learn facts about the murder victim and his wife that, if not entirely exonerative of Jacob's actions, at least show that all is not black and white in this world where brother is set against brother and kings were to be beheaded by commoners. I found it difficult to read in the same way I found Giovanni's Room difficult to read. The emotions were too raw, too close for me sometimes; I had to put down the book and go away for a while. But that is what, ultimately, I loved about this book. It paints people in all their ugly glory: pulsating with need and desire, sometimes good, sometimes bad, but entirely human. If it's hard to read about, it's hard in the same way holding a mirror up to our own conflicted selves is hard. Maria McCann gets us well into the psyche of Jacob Cullen and no, Jacob Cullen is not a nice man. He rages with anger, need and desire; desperate to be good, and failing as often as not. In other words, he's human. And that's why I liked this book."}, {"userName": "Jerry", "userReviewDate": "Apr 04, 2008", "userURL": "http://www.goodreads.com/user/show/1053005-jerry", "userReview": "Finishing this book broke my heart. I honestly did not want it to end and when it did I cried. Maria McCann has written the most beautifully historically accurate story about two soldiers in Oliver Cromwell's army who quite unexpectedly fall in love. The story is at times savage and grisly in war and tender and heartbreaking at times. London in the 17th century was not a civilized place. McCann is a professor of history at Sommerset College in England and you get the full benefit of ther knowledge and research in the novel. The beginning of the book is a bit hard to get into because one of the main characters appears to be such a dreadful person that it takes a bit of reading to appreciate it. Once I got into it I was totally into the story and I have recommended it a great often and with alacrity."}, {"userName": "Maya Panika", "userReviewDate": "Mar 22, 2009", "userURL": "http://www.goodreads.com/user/show/1411655-maya-panika", "userReview": "My lord but Jacob Cullen is a disturbed and dangerous soul! - Something you should know before reading this book because he draws you into his world and makes you love him, hate him, weep for him by turns as he destroys everything he loves and - for what? The lovers are two halves of a coin, light and dark, one as honest and easy to read as the other is secretive and Machiavellian – or are they? Because there’s a cruel twist that had me aching and an end that made me cry half the night (and that doesn’t happen very often, believe me).Dark, cruel, all too believable, terribly real (in a literal sense) and highly recommended."}, {"userName": "Erastes", "userReviewDate": "May 11, 2010", "userURL": "http://www.goodreads.com/user/show/151619-erastes", "userReview": "Jacob Cullen, a man of hasty temper and with an unstable temperment is forced, for reasons I won’t divulge, to flee the manor where he serves with his wife and his brother. Very soon he falls out with them and they desert him, leaving him to attempt to walk to Bristol. He falls in with The New Model Army (Cromwell’s Army) and joins them for a month or two in which time he becomes obsessed with Christopher Ferris, a troubled but basically good man.This is a very clever book, in a lot of ways. It’s incredibly well researched, and makes my version of the English Civil War seem rather shallow in comparison. Tthe immersion into the period is deep, convincing and realistic. It does what I always appreciate in a book, it tells of the world without over describing it. After all, when you walk into a room you don’t think “I walked into the room where there were two Persian rugs four Hepplethwhite chairs, some red velvet curtains and a desk with…. ” You simply describe what is immediate. This book does that; it’s not to say that there isn’t superb period detail in there, there is, but it’s only brought out when it’s necessary. Clothes for example. Jacob’s clothes are described in exquisite detail at one point, right down to lace and buttons but they are amazing clothes, nothing the like of which he’s seen or worn before – so it makes perfect sense for him to describe them. And so it goes, that’s how the book is, never info dumping, but making you feel you are there.What really impressed me more than anything else is the sure bravery that the author shows in writing this 1. from the point of view of a man, a soldier in that time – knowing that she was going to have to show his view of the war etc but 2. That Jacob is just about as unpleasant a character as I’ve ever read about. I can’t believe that Ms McCann meant him to be anything else, and as far as I am concerned she suceeded admirably. As an author, I can’t imagine how any writer can embark on a story like this and yet – why not? Most of us are pretty unpleasant types! However, my hat is off to her. Not only did she write about a man with (as far as I was concerned, your mileage may vary) no redeeming qualities save that he loves another man but she kept me hooked into the book so deeply that I was willing him to have some kind of redemption, to bring about some miraculous ending which I could tell, even quite early on was never going to happen.Jacob is truly unpleasant, but so brilliantly written that he’s hardly even aware of it himself for most of the book. Of course, this is perfectly sensible – how many of us actually think we are awful people? Jacob’s sense of self-loathing however, is ingrained in every page, less so at the beginning and ebbs and flows throughout, but gradually working into a crescendo ending with the last two heartbreaking lines. It again shows such skill that I wanted to smack/kick/kill Jacob for most of the book and yet he had me sobbing when I reached the last page.I suppose in this day and age he would be known as a Sociopath – and in fact if you read the list of Sociopath social traits on this page you would think that Ms McCann made a note of all those character traits and started with Jacob using this as a base. What I don’t understand , even though I’ve re-read the first chapters several times to get a gleaning of it, is WHY he did what he did at Beaurepair. I can’t see any reason for it, other than he just “wanted to”.I pitied him, immensely, because I could tell that he wasn’t going to change, but I pitied Ferris even more because he’d fallen in love with the wrong man, and that’s something I can relate to, big time. But Ferris was a grown man, and he had plenty of choices to cast Jacob aside – and could have done – and didn’t. He even dumped poor Nathan without a word, and as far as I know nothing more than a shirt looted from Basing to run off with a man who he knew he couldn’t change. He was taking a risk too, as at that point he didn’t even know if Jacob was going to be acquiescent to a homosexual relationship and he was leaving behind an established one for an uncertain future. But I guess I understand that. Better to leave a lesser love for the promise of The Big One. And Jacob could have been The Big One if he hadn’t've stuffed it up, like he stuffed everything up.As a nice change this book wasn’t OKhomo (everyone’s gay and everyone’s OK about it) and I didn’t expect it to be as it isn’t a Romance and I was expecting it to be an accurate historical novel. In fact the men are’nt “GAY” at all, in the way that we would know it today, they’ve both been married and allegedly in love with their wives. They both consider marrying again. Ferris I think knows his sexuality better than Jacob (who is more opportunist – I think he would have had Nathan had he offered himself up) but Jacob is (I think) drawn to Ferris first as a friend and then finds he love him. But the risks they run are very real, are reflected in every single sexual encounter they have, even when they are “safe” in Ferris’s Aunt’s house in London. I did wonder about the wooden floorboards and the wooden beds though as I found it difficult to imagine it would have been easy to muffle the sounds of male sex which can be quite acrobatic. But the danger is there, hanging, lynching, burning – all of them a very real dange, even though even then, they knew that proof would have been needed.There was one point when I had a WTF moment and that’s when Jacob met up again with Zeb; I didn’t see the point of this – I didn’t understand how Zeb had the knowledge he had, why he didn’t use it and what the meeting was set up to do – it seemed rather pointless. But then, I guess that’s realistic – not all meetings we have in this world are filled with meaning.All the minor characters were great. I don’t think one of them was pallid or forgettable. I think possibly because Jacob hates them all in varying degrees, partly in jealousy that he can’t bear anyone to get close to Ferris. In fact the only character that I think that Jacob truly loved was Aunt, and possibly because she was more of a mother to him than his own mother was. It was so touching when she said “don’t worry, your hair will soon grow back” and Jacob looked around “eagerly” – like a child so desperate for affection and he found she was speaking to someone else. It was a briliant moment because Jacob had actually been empathising with the woman who had been shorn, and after that, I think he lost the empathy.The “venture” was doomed to fail from the begiining, I don’t know if any of these ventures DID suceed and there were a few of them, you can’t blame the people, they’d had Cromwell and his cronies banging on about how everyone would be granted land, and all men were created equal so it wasn’t surprising that a few people formed communes in this way.As to the ending – the Voice – and Jacob’s gradual descent? I don’t know. It’s the kind of book that has had me thinking all day. I cried at the end, bitter frustrated tears at the stupid stupid man – but then, if he had behaved differently he’d have been with the commune at the end. Then I went and bored my dad with it for about an hour and I’m still running it through in my head. I need to read it again. Did Jacob know the date was different at the end? Did the letter get it wrong? Was it Caro? Or had Jacob’s mind broken at the loss of Ferris? Was it “Caro” with Ferris in the wood? There’s so many questions I can’t answer. On the surface it all seems plain sailing, but we are inside the head of a man on the brink of madness, and frankly – how much of it all can we trust?And the ending – stellar. It was the only thing he could do really – he wasn’t going to kill himself, after all – not with those character traits, he’ll blame everyone else in the world before he’d blame himself – although perhaps if the colony had ALL gone on a flipping ship it would have been a different book!So yes – I loved it. Impressed impressed impressed. By the way, there is quite a lot of sex, but it’s quite subtle, but there is a lot of it."}, {"userName": "Sofia", "userReviewDate": "May 31, 2014", "userURL": "http://www.goodreads.com/user/show/14453898-sofia", "userReview": "I was aware that the book was making me sad whilst I was reading it but I realised just how much when at the moment of finishing it I felt like a load had been lifted off my chest, I felt lighter, a ray of light touching me at the thought that I did not have to touch that world again. A world where hope does not exist. Where Ms McCann makes sure that no ray of sunshine is left.This story left me questioning what I've just read that is what I will take with me. A story unreliably told by Jacob so what I just read might just be a whole bunch of delusions. There might be truths mixed in but I cannot pinpoint them so everything is left up in air. This mixture has left me feeling unsettled, sad, angry and hopeless. Definitely time for a brain shower.BR - Maya 18th April 2015 - Without Maya's company in this one I doubt that I would have finished. I am rather undecided about the rating really:-it is a book I'll probably remember-the characterisation of Jacob is very good-I did not really love the writing-the bleak atmosphere it created is top notchso I don't know"}, {"userName": "Richard", "userReviewDate": "Feb 22, 2012", "userURL": "http://www.goodreads.com/user/show/5114444-richard", "userReview": "Other reviewers have beautifully described the plot and the characterization, and if you read the reviews, you will see the passion this book elicits. This is the kind of novel that should win awards, but doesn't. For me, it was a completely engrossing experience. I found myself struggling to get through the work day so I could get home and continue reading. What a complex, bloody, beautiful, and terrifying read. McCann is a writer of great skill. Though the book is over 500 pages long, it certainly didn't feel like it. Her writing is clear and precise, the characters are vivid and conflicted, and the moments of passion or violence will have your heart pounding in your throat. As Meat Loves Salt is a book that will make you shout out loud and then weep alone in your apartment. It will turn you on, break your heart, and outrage you."}, {"userName": "Lisa", "userReviewDate": "Jan 13, 2016", "userURL": "http://www.goodreads.com/user/show/14819128-lisa", "userReview": "This was my first experience of Maria McCann's work and what an experience it was! This book is just incredible! Set against the backdrop of the English Civil War, it's got murder, madness, an obsessive yet passionate relationship between two very different men and a dangerous yet strangely charismatic antihero who could easily rival Heathcliff. Sound intriguing? It is!McCann is a very talented writer as she brings the 17th century vividly to life yet never overloads you with details and descriptions. She provides you with just enough information to envoke a clear picture in your mind and that's it. There is no info-dumping here. I also really like how she writes dialogue. It feels authentic for the time period but is still understandable to the modern reader. As for the characters, Jacob Cullen has got to be one of the most memorable protagonists I have come across in a long time. He is dark, brooding, troubled and prone to bouts of anger and jealousy which often spill over into acts of violence and cruelty. However, he is also passionate, vulnerable and charming and is equally capable of being tender and loving. In other words, he is a multifaceted and contradictory character and I found myself drawn to him like a moth to a flame. The first person narrative takes you deep inside his head, which is an unsettling place to be at times, but it makes for an interesting reading experience as he is such an unreliable narrator. Whilst I can't say I liked him, I still found myself rooting for him. The same goes for Ferris, another flawed yet highly interesting character who is so different from Jacob in many ways yet equals him in terms of his passions. Their relationship is the beating heart of this book and it held me captive throughout. The rest of the supporting cast were fully fleshed out and all added something to the plot, even if their contribution was only minor.It goes without saying that I highly recommend this book. It had everything I want in a historical fiction novel and a whole lot more besides. I felt so many different emotions whilst reading it and I didn't want to reach the end. It won't be for everyone as it is dark, violent and disturbing at times and McCann doesn't shy away from letting you know what is going on. I personally didn't think that any scenes were overly graphic but you certainly get the picture so if you are triggered by violence or sexual content then approach this with caution. The pace is also quite slow, particularly in the middle, so keep that in mind if you normally prefer things that are more fast paced. However, if you are in any way interested in this book, please pick it up and give it a try. It is one of the best books I have ever read and it seems that it is not very well known and I think that is a great shame as I am sure there are a lot of people out there who would enjoy it but simply do not know of its existence. This was McCann's debut novel and she has since published two more, The Wilding and Ace, King, Knave. Both have now been added to my TBR pile and if they are half as good as this then I will be in for a treat.5 big, fat, shiny stars."}, {"userName": "Aleksandr Voinov", "userReviewDate": "Sep 05, 2012", "userURL": "http://www.goodreads.com/user/show/2585530-aleksandr-voinov", "userReview": "The writing is gorgeous, though I admit to skipping some colony-related bits post the 50%-mark. Jacob is a pretty disturbing character, and I'm still not sure whether he's driven insane by some religious guilt or meant to be a sociopath."}, {"userName": "Karla", "userReviewDate": "Aug 18, 2014", "userURL": "http://www.goodreads.com/user/show/2846441-karla", "userReview": "DNF at 52% because bored to tears. The writing's pretty, but that's about it. The plot was MIA and the pacing was shot to hell and back."}, {"userName": "Elisa Rolle", "userReviewDate": "Aug 12, 2011", "userURL": "http://www.goodreads.com/user/show/2156728-elisa-rolle", "userReview": "I waited and waited before reading this book; I found all the possible excuses, like it was out of stock… and they released a paperback version! Like it was too expensive for the shipping cost… and they released an ebook version! It really seemed “they” wanted for me to read it… who they are? My conscience, my heart and my damn love for good historical novels that of course overcome the small voice that was saying, be careful, this book will haunt you. Oh, how much it was right! And unfortunately my voice was not as strong as Jacob’s voice, that made this man the devil that he was. The book is set during the English revolution of Cromwell and Jacob Cullen is what today you will define a psychopath. For how much I liked him, yes, I did, I was probably liking the man I wanted him to be, the man he could have been if his illness was not making him a monster. When he was able to not listen to his devil inner voice, Jacob was almost a romantic hero; and even if he commits ugly actions, even uglier since they are against the ones he loves more, he is in pain after that… is it enough to make him a good man? No, unfortunately it’s not, since the other Jacob, the one who is following the voice, is like the puppy who bites the hand that is feeding him, for no apparent reason if not that he believes that hand was feeding/loving someone else. Jacob falls in love for Christopher, and Christopher for him; I truly believe it was love, and I truly believe Jacob is regretting the end of this love (and please don’t be angry, this is not a real spoiler, it’s enough to read any review, or even the blurb, to understand this is not an happily ever after story). Only a man in love could say to the voice (yes, Jacob “talks” with the voice…): “Why did You bid me drown the letter? I have lost something that he touched, and the destruction of it has gained You nothing, for now I no longer read the words, I hear them, as if he implored me face to face: Speak to me, Jacob, do not play the tyrant. Speak to me.” Almost as a precise surgeon, the author chose these words, “Speak to me”, to open and close the first time Jacob went to Christopher, exactly in the middle of the novel, and to close the book, right the last words before the End. Speak to me, Jacob, maybe Christopher was saying, Speak to me and not to your voice? Was Christopher aware that Jacob was crazy, that there was nothing to do to save him? But there is nothing much to say, Jacob is ill, completely crazy, and for how much Christopher loves him, the other man has dreams that in the end he realizes cannot include Jacob, and that is the moment when Jacob will bite the hand who is feeding him, feeding him love. You want passion, wrenching love, wonderful and original characters, perfectly carved setting? As Meat Loves Salt is your novel. You want sweet and romance, frilly dresses and comfortable feelings? Avoid this novel as a plague. http://www.amazon.com/dp/0007429266/?..."}, {"userName": "Red Haircrow", "userReviewDate": "Jul 04, 2010", "userURL": "http://www.goodreads.com/user/show/3960979-red-haircrow", "userReview": "The reader is immediately drawn into the world of Jacob Cullen, a darkly charismatic former servant turned soldier whose sincere cravings for love and understanding are too often marred by his jealous and suspicious nature which creates a mystery the reader discovers in well-timed increments.After seeming to escape a troubled past, he falls in love with a fellow warrior, who passionately accepts and teaches him of the love between men, yet their own obsessive behavior threatens to destory everything they hoped to build.Although written in first person, which so many people tend to be biased against because it has been lamentably done so many times, this author does it well. So well in fact, you forget your self and literally are drawn into the emotional conundrum which is Jacob. At times you can hate his viciousness but somehow you never lose empathy for his struggle to find out who he really is, and what he really wants.For myself, I love history, I love food and I love good descriptions and an in-depth yet not overly heavy tone. Maria strikes the perfect balance with her extensive knowledge of the customs and lifestyles of the people in that era of England. Yet not only that, but the dynamics of politics and societal class are conveyed to her readers without being boring or academic.This novel is proof positive a woman can very well write not only a good book involving gay or bisexual male characters, but do an outstanding job of capturing and revealing some of the unique dynamics such relationships have, plus heart pounding sensual scenes which are seared into your imagination long after you’ve turned the last page. The power struggles, the twists of love and hate which reflects one’s own personal doubts and biases: this novel has everything.From my review/interview site Flying With Red Haircrow. Please follow the link to see all reviews above and beyond those I've loaded here at Goodreads.com.http://flyingwithredhaircrow.wordpres..."}, {"userName": "Laxmama ", "userReviewDate": "Aug 13, 2016", "userURL": "http://www.goodreads.com/user/show/31804110-laxmama", "userReview": "I feel like I need a support group after reading this book. I both loved & loathed this book. The book captured the mood and feeling of the English Civil War, the brutality and fears. I felt so many emotions reading this, hate, disgust, pity and sadness at both of the main characters, but mostly sickening fright for Jacob's rage. I feel he was unaware of his mental disturbance, making him complete monster, yet by the end I pitied and even sympathized with him and his frantic, uncontrollable pain and rathe of emotions. I had quite a different view of Ferris then most of the other reviews. It appears he is to be the good to Jacobs evil, I did not view him that way. I believe Ferris to have known that Jacob was mentally ill from the start. He chose him over Nathan, due to his physical strength what role he would play in the colony. Ferris was both manipulative and selfish, and he used Jacob's obsession with him to his advantage. Just as he used his Aunt, when he left her alone sick. I questioned his true ideals when he visited if he really was about sharing and brotherly love, why not help Becca at all when she was so tired, why only at the colony when it's all under his control. It wasn't until I reached the end of the book when I could not decipher what is real or what is in his head. So much of this book is brutally frightening Yet that that is the power this book had over me while reading. So many questions I can't shake. I am grasping for closure."}, {"userName": "Ashley", "userReviewDate": "Oct 24, 2011", "userURL": "http://www.goodreads.com/user/show/4276409-ashley", "userReview": "It just occurred to me that, without necessarily meaning to, I find myself rereading this book once a year. I'll go months without thinking about it, without thinking about anything related to it, and then one day I'll be driving and see a tired-looking pedestrian and I'll be back there with Jacob on the Devizes road, parched of throat and sore of foot and so hungry he won't even think about food. Then nothing will do but read those scenes again, and before I know it I'm in Winchester, I'm in London, I'm watching what infatuation and and anger and not a little madness can do to a person, and the kind of damage that person can do to those around him. Every time I finish this book I'm somehow simultaneously in love, and appalled, and exhausted and kind of afraid, and in awe, and I just never know what to do with myself. Except maybe for trying to get everyone I know to read it. Read it if you like love stories, even though this is not exactly a love story. Read it if you like war novels, even though this is not really a war novel. Read this book. No really. Please. I will thank you, and you will thank yourself."}, {"userName": "A.M. Riley", "userReviewDate": "Jun 06, 2010", "userURL": "http://www.goodreads.com/user/show/1381619-a-m-riley", "userReview": "This review is a little spoiler-ey. And a tad annoyed. Don't read if you don't want to know.Gorgeous historical, beautifully written which, nonetheless, felt angry towards homosexuals. Or, perhaps, men.The main character is a brutal narcissist. I tried to find a metaphor to explain his behavior, thinking that perhaps he represented the old bourgeois? ********SPOILERSThere is neither redemption or consolation for the characters or the reader. The main character is filled with remorse but who knows if it is genuine or only because he has lost something that he desired? The reader is not left with any sense that the main character will change, only that he will carry his evil to the New World.In the end all I could imagine was that the author was dumped for a man. Seriously. I could not imagine why else anyone would conclude a story in this manner. There seemed to be no purpose to it. Just your typical, 'gay is okay if they are dead at the end' story.It gets three stars because it was brilliantly written. But I have to admit, I hated it."}, {"userName": "Catherine", "userReviewDate": "Jul 08, 2017", "userURL": "http://www.goodreads.com/user/show/54357988-catherine", "userReview": "4.5 starsG O D I'M IN AGONY"}, {"userName": "Cristina", "userReviewDate": "Jun 12, 2017", "userURL": "http://www.goodreads.com/user/show/10105913-cristina", "userReview": "This is a long-due review and I apologise with the friends on GR if they find themselves re-reading things that I may have already put in threads and comments. Since I opened  Maria McCann's astonishing debut novel on June 22, I've found myself dragged into its world of violence, love, sexual confusion and religious obsession. Her world crawled under my skin and has stayed there ever since. I've been talking about this book with some of the lovely people I've met here on GR and even 'gently' pushed some friends to read it. I just need to talk about it - it can't be helped. And yet, until today I couldn't bring myself to attempt to write a slightly more coherent review on it and even now I fear I'll never manage to put into words what this book means to me.Jacob Cullen and Christopher Ferris are outstanding creations - one dark, brooding, violent and disturbed but also passionate and loving, the other blonde, graceful, equally passionate and idealistic, but with a stubbornness that almost makes him blind to the realities surrounding him. Reading the book, it's easy to love and despise them at the same time, to hope for things to go well when quite clearly, they can only go from bad to worse. Maria McCann does an incredible job at keeping the tension up - the novel is like a rollercoaster, full of twists and turns, ups and downs, jolting rises and terrifying drops. By the end, I felt drained and exhausted.The historical context is incredibly well researched: the New Model Army, the Diggers' colonies, the violence of the English Civil War are all recreated with a vividness that brings them to life and makes them leap from the page. The language is equally incredible - the sentences are sinuous and sensual, so evocative that every day I find myself re-reading sections of the book to refresh their sound in my mind.AMLS is dark, passionate, heartbreaking, painful and completely draining in that kind of delightful way only certain novels can be. It's a book to go back to and I cannot but highly recommend it."}, {"userName": "the gift", "userReviewDate": "Sep 28, 2011", "userURL": "http://www.goodreads.com/user/show/3403278-the-gift", "userReview": "i have read some women authors, some historical fiction, some epic, some queer, but not much- or any i recall- woman authored historical epic queer fiction. i have read work with gay central characters yes, but not rough sex romances. i read this on recommendation of a blog on guardian.co.uk, which was about the yearly anti-award of the 'bad sex' award, how prudish english are, how there should be an award for good sex. this was put forth, by some poster, as an example of what good erotica is. intrigued, i got a copy...i read with intent. i gauged every woman entering the story as potential sex/romance partner with the scary, psychotic, violent, explosive narrator. i was patient, after all it is a long book, i was certain that she would show up eventually... i had to read 195 pages before i realized it was not political or philosophical but physical passion, for this other man. i am sometimes an idiot. this good sex is same sex...so i continued to read. this is erotica of the emotional not mechanical kind. i had to recast my expectations. i am not gay: but i have heard of rough sex, i have heard of role-playing, of s&m romances, and i suppose this character narrating is an exciting 'top'... but this does not work as erotica for me. in fact, despite the sensuous, emotional, physical, detail, that creates the world of the characters very well, at great length, it offers not much erotic pleasure for me...i do give this a 3 because it is well-written. it creates a very powerful portrait of the world: the filth, the war, the politics, the religion, the idealism. this is definitely a curative for any romanticization of the era...i do not know if this really is a spoiler: several women i have talked to figured it out from the blurb on the back cover... i do not know if other straight men like this book or if only gay men and some women like it. i do not like to imagine that my sexuality or gender identification or whatever precludes appreciation any kind of literature, but maybe this is so. i hope i am now alert to possibilities of stories i had not thought of before..."}, {"userName": "Abigail", "userReviewDate": "Aug 17, 2013", "userURL": "http://www.goodreads.com/user/show/6870114-abigail", "userReview": "Even three weeks after reading it, I'm still not sure what I made of this book. The blurb on the back is misleading: it sets the book up as a fairly standard historical doorstop-novel, following the fortunes of a country lad separated from his fiancée and forced to find his way in the world. The novel is anything but typical. It's a psychological thriller, a tale of twisted erotic love and an accurate and fascinating evocation of one of the most interesting times in British history. Ultimately, however, I cared for few, if any, of the characters and the ending is abrupt and unsatisfying. I suspect it's setting up for a sequel.As I say, the novel's historical detail is superb. As someone who's studied the seventeenth century in depth, I don't think I've read a modern novel that better evokes the language, the mind sets, the historical events and the political and religious complexities of the time. It was this authenticity that kept me reading, rather than the adventures of Jacob, whom you quickly realise is a seventeenth-century Tom Ripley. I found his story moved me little - with the exception of his and Ferris' attempts to resist their feelings for one another. This section is exquisitely told.I think I was so little moved because the characters didn't engage me. While certainly mentally ill - I hesitate over a diagnosis - Jacob is supposed to charm all of the other characters. Perhaps because the novel is only told from his perspective, I find this charm hard to credit, which lowers my opinion of all characters.My distaste for Jacob isn't due to his psychotic (if that is the correct terminology) tendencies; I found Faulks' Engleby and Highsmith's Ripley sympathetic at times. I'm really not sure what it is that stopped me from caring.I would recommend this book to all those who want to gain a clearer understanding of the seventeenth century; I do not, however, want to encounter Jacob Cullen again."}, {"userName": "Daniel", "userReviewDate": "May 30, 2018", "userURL": "http://www.goodreads.com/user/show/29777818-daniel", "userReview": "dnf@20% -- Look, the writing is excellent. The characters are compelling. But I have zero interest whatsoever in watching this trainwreck play out and seeing Jacob murder and rape more people he doesn't deserve. No thank you. Just no."}, {"userName": "Maya", "userReviewDate": "Mar 09, 2015", "userURL": "http://www.goodreads.com/user/show/23315852-maya", "userReview": "Violent love eats up what it does love, and is mere appetite.\nIf someone had asked me ten days ago (when I finished reading) if they should read this book, I’m pretty sure my answer would have been: no. Because, for me, what it came down to was that this book was almost 600 pages of misery, torment, and gloom which eventually led to an ending that left me not only emotionally drained but in angry tears. I can count on my fingers the moments the two main characters experienced happiness or joy, and even these were overshadowed by constant hints and omens of bad times coming. But.I can’t ignore the fact that the author managed to make me feel for the violent protagonist (and violent is probably a weak adjective to describe Jacob). By the 15% mark I was wondering if Jacob could ever be redeemed as a character, and shortly after that I knew he wouldn’t be. Although it’s never specifically mentioned in the book I believe Jacob had a mental illness (or at least an inability to control his anger) that made it quite easy for him to reason his actions. And while later he would feel remorse for his doings it was not for the right reasons but because of fear of what his lover would think of him. Yet, when Jacob fell in love, and no matter how extreme his possessiveness and jealousy were, he did love with passion and selflessness that touched me. And even though the relationship he had with Christopher Ferris was at times toxic because they both brought out the worst of each other, it did give me hope for Jacob. It’s not that I expected love would save him but it was obvious how much calmer and controlled he was when his feelings were returned. Also, I found it oddly endearing that Jacob was always instinctively drawn to good people, and how when accepted he tried his best because all he really wanted was to be loved. But it was never meant to be – the dark power that drove him was stronger than his heart. Since I am still torn between how unsettled this book left me and the amazing job the author did with Jacob, I decided not to rate it. BR with Sofia - April 18, 2015.Sofia and I discuss the book in detail (and with spoilers) here. It was mainly the fact that I had her to chat with that kept me reading. Otherwise I’m not sure I would’ve made it to the end."}, {"userName": "Sophie", "userReviewDate": "Nov 08, 2009", "userURL": "http://www.goodreads.com/user/show/2158493-sophie", "userReview": "This is an excellent book. A historical novel set during the English civil war, it's an absolutely engrossing read. It's also very, very dark, and the story really got under my skin. The two main characters are both appalling and appealing at the same time. I picked it up after it was recommended on some m/m list, and indeed the relationship between the two men is at the heart of the book. But it is not a happy romance, no, far from it. But it was breathtaking to read - I don't recall ever reading a book where mere looks between two characters felt this erotic. Reading the book, though, you know everything is doomed from the start (believe me, this is not a spoiler), which makes it both hard to read and impossible to put down. The language is amazing; it pulled me in from the very first sentence. And even though reading it hurt, hurt badly, I am very glad I read it, because like it says in a review included at the front of the book, this is a book that stays with you for a very long time."}, {"userName": "Alicja", "userReviewDate": "Feb 24, 2013", "userURL": "http://www.goodreads.com/user/show/4745220-alicja", "userReview": "rating: 4.5/5I loved and hated this novel at the same time. The back cover says that this is a dark erotic (nothing too graphic and not that much either) tale but it really is so much more. McCann weaves the dark and violent with sweet and innocent brilliantly. Born into nobility, Jacob Cullen was reduced to servant status after his father died. Years later he, and his two brothers, are living relatively comfortably as house servants. Jacob is also about to be wedded to a woman he loves. However, his past catches up with him when he realizes he was seen killing a man and the law is after him to bring him to justice. This leads to a series of events where, while battling his inner daemons, he creates a path of destruction through the lives of everyone he meets, strangers as well as those he loves. Jacob is really twisted; he has anger management issues and doesn’t seem to be able to control himself when emotions take over. And yet as he goes through life hurting people, strangers as well as those he loves, I couldn’t help but cheer for him and hope and beg of others for forgiveness (and a happy ending). What makes this book great is also what kept frustrating me. The destruction he leaves behind is painful, even revolting and he seems to keep repeating the same mistakes over and over again. It is like a train wreck that you see coming, over and over, and each time you are powerless to stop it and yet, yet you can’t stop watching. McCann has a wonderful way with words and seems to grasp realistically a way of speaking in 17th century England. The book is long but beautifully written (each word as necessary the others around it), the words seem to flow of the page so it doesn’t take too long to get through it. She is one of those authors that can transport you into another time and place, straight into the lives of these characters."}], "description": "In the seventeenth century, the English Revolution is under way. The nation, seething with religious and political discontent, has erupted into violence and terror. Jacob Cullen and his fellow soldiers dream of rebuilding their lives when the fighting is over. But the shattering events of war will overtake them. A darkly erotic tale of passion and obsession, As Meat Loves Salt is a gripping portrait of England beset by war. It is also a moving portrait of a man on the brink of madness. Hailed as a masterpiece, this is a novel by a most original new voice in fiction. A Harvest Original", "title": "As Meat Loves Salt", "url": "https://www.goodreads.com/book/show/271487.As_Meat_Loves_Salt", "average": 3.9, "cover": "https://images.gr-assets.com/books/1398025759l/271487.jpg", "reviews": 549, "authors": [{"url": "https://www.goodreads.com/author/show/158276.Maria_McCann", "name": "Maria McCann"}], "type": ["Historical", "Historical", "Fiction", "Lgbt", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/271487.As_Meat_Loves_Salt", "http://www.goodreads.com/book/show/11328793-as-meat-loves-salt", "http://www.goodreads.com/book/show/618322.As_Meat_Loves_Salt", "http://www.goodreads.com/book/show/11328792-as-meat-loves-salt", "http://www.goodreads.com/book/show/12797153-as-meat-loves-salt", "http://www.goodreads.com/book/show/1444942.As_Meat_Loves_Salt", "http://www.goodreads.com/book/show/7292530-the-wilding", "http://www.goodreads.com/book/show/17907300-ace-king-knave", "http://www.goodreads.com/book/show/20324506-holiday-in-iceland", "http://www.goodreads.com/book/show/17239379-beacons"]}