{"ratings": 5808, "userreviews": [{"userName": "Violet wells", "userReviewDate": "Mar 09, 2018", "userURL": "http://www.goodreads.com/user/show/4196681-violet-wells", "userReview": "I'd probably argue that Mark Helprin's greatest asset can also be his greatest flaw. This is his mental exuberance. This book doesn't need to be 790 pages long. It's often his philosophical digressions, somewhat repetitive in nature, that I'd have been much more ruthless in weeding out. It's perhaps a novel that thinks it's wiser than it is. That said he's a brilliant storyteller and when he's focussed on the plot this was a riveting read. A Soldier of the Great War is the story of Alessandro Giuliani, and essentially his experiences as an Italian soldier during WW1. It's often exuberantly and romantically unrealistic. Giuliani is like Nietzsche's superman. There's virtually nothing he can't do. Alessandro is haunted by Giorgione's enigmatic painting The Tempest (to be found in the Academia in Venice). The regenerative allure of the woman and child. But Alessandro isn't very convincing as a family man; he's too much of a loner and an adventurer to excel in the role of son, father or husband. Rarely do we see him in domestic situations. Mostly he's engaged in daring high adventure escapades, the kind of stuff young boys dream of. The passages about his mountaineering exploits were among the best and written with a seemingly intimate and passionate knowledge. Another thing I liked was the light carelessness with which the book carries its research. Often writers have a habit of littering historical novels with the grating superfluous tokens of their study of the subject. He's not a great stylist, not a musical writer. His prose could do with some of the discipline which comes from a heightened sense of the rhythms of language. But there was more than enough of the magical here to make me want to read more of his books."}, {"userName": "Warwick", "userReviewDate": "Jan 26, 2017", "userURL": "http://www.goodreads.com/user/show/53165-warwick", "userReview": "Confusing ‘epic’ with just ‘very long’, this book has entertaining sections but cannot justify an investment of 860 pages. It tells the story of one Alessandro Giuliani, an Italian soldier who goes off to fight in 1914 and soon shows a propensity for escaping death and injury which is only matched by his proficiency as a rider, his irresistibility to women, his prowess as a mountain-climber, his fortitude, his moral strength, his physical strength, his perceptive art criticism, his religious insight, his cutting one-liners, his rakish anti-authoritarianism, and his ability to attract woodland creatures like a Disney princess:Perhaps because he had been without his family, solitary for so long, the deer in deer preserves and even in the wild sometimes allowed him to stroke their cloud-spotted flanks and touch their faces. And on the hot terra cotta floors of roof gardens and in other, less likely places, though it may have been accidental, doves had flown into his hands. Most of the time they held in place and stared at him with their round gray eyes until they sailed away with a feminine flutter of wings that he found beautiful not only for its delicacy and grace, but because the sound echoed through what then became an exquisite silence.That's from page one, and had me muttering ‘oh fuck off…’ under my breath already. As well as being overwritten it is also just clunky (that long, commaless string of words that begins the third sentence is especially unwieldy), and although what follows is usually perfectly readable, this paragraph does get to the heart of the book's core problem, which is that it takes itself far too seriously while not taking its subject seriously enough.Although Helprin is pitching this as a grown-up literary treatment of war, it has almost nothing in common with the works of writers who were actually in the First World War and who are talked up on the book's back cover. It reminded me more of historical romances like The Three Musketeers than of anything by Hemingway or Remarque; Helprin's hero is just not living a plausible experience of the conflict. He is whisked away from certain death so many times and in such unlikely ways (seconds before his execution by firing squad, for instance) that it is hard not to start finding it comic as he saunters through yet another cliff-hanger untouched while the poor mortals around him drop like malnourished flies.Alessandro is, indeed, a kind of virile superman. Again, we are supposed to take this seriously but I found it mostly laughable. He is always the biggest, bravest, most commanding presence in every scene. He cannot walk ten feet away from his division without women falling at his feet: on one occasion he sleeps with a woman sitting next to him on an overnight train, while on another he arranges a sexual liaison with someone seconds after meeting them while jogging across a city square. He refuses to have sex with an adoring prostitute, however, because he is also a paragon of moral fibre. In reality, of course, sexual desperation among soldiers was almost pathological, most of them were not very good at speaking to real women, and queues for the run-down brothels went literally around the block. A braver and better book might have attempted that story, but instead we are treated to some kind of weird heroic wish-fulfilment figure.Alessandro's exemplary traits might have been more bearable had he at least been forced to change or develop them in adversity, but he doesn't. He begins the book with an unerring sense of the truth of the world, and his losses and hardships do nothing but confirm him in his convictions. Indeed, he seems to treat the pain and misery of war as something like the ritual mortification undergone by a Christian saint. This is not inappropriate given the religious nature of Alessandro's worldview. Helprin would like his hero to come across as a kind of Herman Hesse-style magus figure, and there are many wistful and high-minded passages in here about God's beauty and consolation and how the light and truth of the world can be apprehended by those with an eye for it. These sections sound wise and sensible, but if you look at them for a second, they turn out to say nothing much at all except that you just have to have faith. In the context of the First World War, I found this a bizarre, offensive, and ultimately very conservative kind of snake-oil for an author to be pushing.Still, there are some lovely descriptions of Rome along the way."}, {"userName": "David J.", "userReviewDate": "Mar 01, 2008", "userURL": "http://www.goodreads.com/user/show/930562-david-j", "userReview": "“My father wanted me to join him in the practice of law, but I saw how greatly he suffered the requirement of being clever. It separated him from his soul, and it didn’t get him anything other than a living.”I suppose it is always true that we gain from books what we can relate to. The themes that dominate our daily lives in our teens, our 20’s, 30’s, and so forth vary radically. These themes are filters over what we read and absorb, creating a different experience for us each time we read. So it is that as I read A Soldier of the Great War that the themes of my early 30’s dictated what was important to me. My brother recommended the book to me, and warned me that I had to make it at least 100 pages before putting the book down. This is good advice for anyone who picks it up. Although there is nothing wrong with the writing, the first 70 to 80 pages of this book remind me more of Plato’s The Republic than the epic novel advertised on the back. Even Russian novels get into the story more quickly than this did. Still, the build up is crucial to the character and his motivation to tell his story.The protagonist’s name is Alessandro Giuliani. It opens in 1964 when Alessandro is in his seventies. After being kicked off a bus, he decides to walk the significant distance to his destination with an 18 year old boy he meets along the way. On their journey, Alessandro tells the boy a portion of his life story, which of course focuses on the time he spent as a soldier in World War I, the \"Great War.\" Alessandro’s confidence makes him a compelling character, even if it comes off to the reader as arrogance at first. Rather than engaging in mindless chatter with everyone he meets, Alessandro tests new characters in the novel by answering their questions with absurdities and sarcasm in an attempt to weed out those who are not capable of lively discussion. The book’s theme focuses on human spirituality, chance, providence, and defining yourself by your love for those around you rather than work or money. Early in the book, Alessandro’s father warns that “a profession is like a great snake that wraps itself around you. Once you are enwrapped, you are in a slow fight for the rest of your life, and the lightness of your youth leaves you.” In a time of my life when I am looking for satisfaction in my “career” this message hit home. Alessandro decides early on not to choose a career that might dim his eyes to all that is good and beautiful around him, and chooses to become a student of aesthetics. When one character questions the usefulness of his chosen path, Alessandro responds “My passion is not for analysis, but for description. Anyone can analyze…but to describe something so as to approach its essence is like singing.” At one point in the story, Alessandro reflects on a time when he worked for little pay as a laborer even though his education entitled him to a far more prestigious and lucrative career: “We ate simply, we were healthy, and we were uninterested in those things that should be called possession not because they are possessed but because they possess. Those ten years were the happiest of my life save the first ten, the years in which I had neither position nor success, and no one took notice of me. Those were the years of the parent holding the child in his arms, lifting him high in the air, and pulling him close. As I held my own son, when he was a baby, God was right there.”In my own career, I have chosen a path that seems less ambitious than others. When I attend meetings and conventions with my peers, I notice that my suits are poorer in quality, my shoes are cheap, and my car would pass as sufficient for a high school student. However, unlike my well paid colleagues who profess a love for their chosen vocation, I am home every night by 5:00pm. I play with my son and spend time with my wife. I agree with Alessandro that one of “the finest thing[s:] in my life was being with my son when he was a baby. …every word that came from him, every expression, every smile, even his tears were worth a million times an honorable profession.”This book helped remind me why I work where I do. In the end, it will not matter what kind of car I drove, or how expensive my suits were. All that will matter will be the relationships I have fostered with my wife, children, siblings, and parents. The final moments of the book find Alessandro alone on a hillside. “Alessandro burned with the images of those he loved. He threw aside all the great things he knew, he threw aside the ineffable beauties, the principles of light, and he burned with their memory.…“He remembered when his infant son had cried for a reason that Alessandro had long forgotten. He had held nothing back. All his heart had been in his cry, and then he had peace. How beautiful he was when his face was filled with tears.”"}, {"userName": "Matt", "userReviewDate": "Dec 28, 2011", "userURL": "http://www.goodreads.com/user/show/1232712-matt", "userReview": "I finished this novel with a newborn baby (my own, if you’re wondering) on my chest. The book and the baby were (literally) roughly the same size, so turning the pages without waking the infant was a challenge. Also challenging was trying to read after having been awake for three straight days. The old saying is definitely true: it’s tough to read while suffering audible and visual hallucinations. (At one point, the heat duct in my room starting lecturing me on the European Monetary Union; that was when I knew I needed sleep bad). What was my point? I’ve totally forgotten, because my brain feels like I’ve just consumed three gallons of Nyquil and only two gallons of Red Bull. Oh, yeah. My point is that, on a normal day, in my old life, I’d have a hard time reviewing Mark Helprin’s A Soldier of the Great War. The mastery of its prose, the depths of its philosophy, and the confidence in its execution, is just that daunting. It’s even harder to review it now, with a baby on my lap and a milk-spit-stained t-shirt on my back. But I’ll try. To begin, A Soldier of the Great War is not your typical World War I novel. Forget Erich Maria Remarque’s All Quiet on the Western Front. Heck, forget the Western Front entirely. This is not a story of trenches and barbed wire. There are horses, but none of them are anthropomorphized. It does not feature Brits, Frenchmen, or Germans. To the contrary, the main character is – of all nationalities – an Italian named Alessandro Giuliani. (Since the fall of the Roman Empire, Italians are better known more for their calzones and hand-talking than their martial abilities. But I digress). The novel is structured as an extended flashback, framed with scenes featuring an elderly Alessandro. It begins in 1964, with Alessandro catching a streetcar to Monte Prato, 44 miles from Rome. He gets on the car, and is on his way, when he spots a young man on foot trying to keep up. Alessandro forces the driver to make an unexpected stop, and ends up outside with the young man, whose name is Nicolo. The two set out on foot. Alessandro, a professor of aesthetics, begins a dialogue with Nicolo, an illiterate factory worker. Creative writing teachers are always preaching a hook. You’ve got to hook the reader right away, and draw them into the book. You’ve got to call me Ishmael them, or all unhappy families are unhappy in their own way them. Helprin ignores this advice completely. In fact, he does the exact opposite, as the first 80 or so pages are barely more than a dialectic. Full disclosure: I’ve started and quit this book before, out of sheer boredom. But that was when I was younger, and all I cared about was getting to the battle scenes. I’m more mature now, so I also care about getting to the sex scenes (of which there are none, unfortunately). This time, I did not quit. This time I pushed onward. And I want to encourage you to do the same. Maybe you’ll even like these pages; it’s not as though they are poorly written, because they aren’t. I guess you can view this section as a more engaging version of Plato’s Five Dialogues. I for one, simply had no desire to return to my days in a freshman level philosophy class, trying to stay awake while a bumbling adjunct meditated on Descartes. Fortunately, the story eventually cuts away from Alessandro’s ad hoc roadside lecture series. The first flashback brings us back to a time when Alessandro is a young child, on a trip to the Alps with his father, an attorney. This brief, lyrical section demonstrates almost all the novel’s many virtues: an exquisite sense of place; an unabashed romanticism; a mordant wit; and amazingly memorable sequences, such as Alessandro’s midnight gondola ride down the mountainside, with a man dying of a heart attack. The next flashback moves the story forward in time. It shows us Alessandro as a young man, riding fast horses, climbing mountains with his friend Rafi, and wooing a young woman who lives near his father’s house. During this section, Helprin includes a long sequence in which Alessandro attends an ambassador’s ball, and later sneaks into a party at the French Embassy, where he stumbles upon a young girl named Arianne. She was the youngest, but she stood out among the other girls because of her beauty. When she was a child the physical characteristics that would later make her very beautiful were so striking that she seemed to have been almost homely. Only someone of long experience might have seen breathtaking beauty awkwardly sleeping in what appeared to have been catastrophically misaligned features – the broad expanses of her cheeks and her forehead, the independent energy of her eyes, the painfully beautiful arch of her brows, the smile that, even at a distance, even in memory, filled anyone who had seen it with love and paralyzing pleasure.These early flashbacks, which also includes a train ride to Munich where Alessandro gazes upon Raphael’s portrait of Bindo Altoviti, create an atmosphere of peacefulness, indolence and, most importantly, beauty. Aesthetics – the nature of beauty – is a recurring theme in A Soldier of the Great War. The ugliness of war is continually contrasted to the beauty of life. Sometimes (too often, in fact) Helprin does this explicitly, in Alessandro’s frequent monologues. Other times (and more powerfully), he accomplishes this task by mirror-twinning early scenes of peace (such as Alessandro and Rafi enjoying a prewar climb) with later scenes of battle (Alessandro fighting with the Alpini among his beloved mountains).These prewar scenes, set in the Alps, or in a lovingly reconstructed Rome (Helprin must have great affection for the city, since he seems to know its every back alley), proceed at a languid pace.Suddenly, and without much transition, Helprin jumps forward several years, to 1916, where Alessandro is already a member of the 19th River Guard, a group of naval men turned into infantry. This spatial leap, leaving Alessandro as a young civilian and rejoining him as a veteran soldier, is effectively jarring, mimicking as it does the confusion that must occur when moving from peacetime to war. From this point on, the story follows a more conventional timeline, remaining with Alessandro until the war ends (that is, with no more cutaways to old Alessandro). Alessandro’s experiences are not typical of the average “soldier of the Great War.” There is no trace of (for instance) All Quite on the Western Front, and its familiar antiwar framework of excited-young-man-going-to-war-and-losing-his-youth-to-the-madness. There are some scenes set in the trenches, with the ubiquitous mud, rats, and barbed wire. But the most familiar trait of World War I – its static, grinding nature – is nowhere in evidence in Helprin’s novel. Instead, Alessandro finds himself in an ever-shifting current, flowing from one adventure to the next. One moment he is with a special unit hunting deserters among the Mafioso in Sicily; the next moment he is a deserter himself, awaiting execution. He finds himself, at various points, quarrying marble for tombstones, serving with Italy’s elite mountain troops, riding with a troop of Bulgarian cavalry, and as a prisoner-of-war in a Hungarian palace. \tMany of these scenes have the quality of a fable about them. They are real, yes, but also heightened somehow. It’s not magical-realism by any measure, but it’s not vérité either. The people Alessandro meets and talks to (with some exceptions) don’t feel like well-developed three-dimensional human beings, with their own back-stories; to the contrary, they come off as symbols, their mouths filled with dialogue that is meant to challenge Alessandro’s own beliefs or, more often, that serve as straw-ideas for Alessandro to bludgeon with his intellectual powers. One of the novel’s more irritating tics is Alessandro’s constant pontificating. No one is safe from his erudition, including his superior officers, his captors, and his fellow soldiers. Somehow, despite Alessandro’s insubordination, contentiousness, and lack of any knowledge of civil discourse, no one punches him in the mouth (or has him arrested, or shot, or at least gagged). Here, Alessandro: I’m a critic. I write essays about works of art. It’s like being a eunuch in the seraglio, but unrequited love is the sweetest, and I have the proper distance. I can compress the qualities of beauty I’ve been trained to see, store them up, and bring them out at will, rapid-fire, in the combinations I want. Images. Thousands, hundreds of thousands of images. My field was the aesthetics of painting. In homage to that, I keep the images compressed in tiny little squares, like the works of Oderisi da Gubbio or Franco Bolognese, like little postage stamps. Each one glows. It’s as if you were looking into a firebox through the peephole or peering into one of those Easter eggs with scenes painted within, or watching a brightly illuminated and distant part of a city through a telescope with sparkling optics…At times like these, Alessandro comes off as a douche-ier version of Ted Mosby from How I Met Your Mother. Often, I really wanted to punch him in the nuts. This is not a plot-oriented novel, in which all the narrative strands lead to a thundering climax (a great battle, a great kiss). Rather, the novel is a series of big set pieces stitched together with the aforementioned philosophical exposition. No sooner has Alessandro survived one encounter than he is on his way to the next. The risk with this kind of setup is that it creates a sensation of what could possibly happen next? that stretches credulity and believability. Moreover, by framing the novel with an elderly Alessandro, Helprin has assured you of one important thing: his main character survives. Thus, no matter what kind of fix Alessandro gets himself into, there is no dramatic tension. We know that Alessandro makes it into spry, wealthy, acid-tongued old age. Helprin overcomes this by making these set pieces absolutely amazing. It is at these times that the writing is at its most dazzling, creating images that last in your mind. Take, for instance, a sequence in which Alessandro, serving with the Alpini, is ordered to climb to a lookout post high in the mountains. From that vantage point, alone, he is supposed to keep an eye on the enemy. Helprin does a commendable job evoking the terror, the loneliness, and also the beauty of the assignment: It was remarkable to see the whole world, so wide and so blue, from one place. Straight on, the sky had as much depth and distance as above, and with the clouds below running to the horizon like a white floor, Alessandro believed that he was in the sky rather than under it. For that reason, though not for that reason alone, he felt nearly all the time something akin to the sensation of flying: not vertigo or a feeling of motion, but an aura of lightness, disconnectedness, and quiet. Glacier light arising from blue ice is blinding and cool. When it blends with the light of the sky it commands attention and awe, as if in it the real work of the world is accomplished, and the operations of the richer, warmer light below are of a lesser, fallen order. Because the story is told in the third-person limited, Alessandro appears on just about every page. (There are only two or three times that the book leaves his point-of-view. These cut-scenes, while a bit of a narrative cheat, are quite effective). This was a bit problematic for me, since Alessandro, though putatively the humanist hero, is also something of an arrogant blowhard. I don’t think a single person who falls into Alessandro’s ambit manages to escape without a lecture. Another result of the tight focus on Alessandro, aside from vague annoyance, is that secondary characters don’t make much of an impression. Certainly, we meet a lot of people. However, as I mentioned above, many of them serve only as intellectual foils for our protagonist. Dozens of others, such as the various soldiers in Alessandro’s company, are only dimly defined, and disappear too quickly to be memorable. Furthermore, the female characters suffer from a debilitating defect: they seem to exist only as obstacles for Alessandro to conquer. And by conquer, I mean penetrate Biblically. Even Luciana, Alessandro’s sister, serves this purpose, during a queasy mid-war interlude in which her attraction to her brother is strongly implied. (Not having sex with his sister is just one of the many things Alessandro is forced to overcome during the Great War). A Soldier of the Great War strives mightily to be about many things, love included. Unfortunately, most of Alessandro’s interactions with women boil down to him giving his pre-packaged speech about aesthetics, and then somehow getting into their pants (or the early-20th century variation thereof). The chief exception is Alessandro’s love affair with a nurse, which is supposed to be a dramatic centerpiece, but actually dwells in the land of been-there-done-that. (With the World War I backdrop, the Italian setting, and the soldier-nurse relationship, one is almost forced into comparisons to Hemingway’s A Farewell to Arms. When brought into that relief, Alessandro’s affair seems even paltrier than before. You just can’t beat Catherine and Henry for aching love and kick-you-in-the-teeth tragedy).If there is an antagonist, that role belongs to Orfeo Quatta, who might be Helprin’s most ingenious creation. Orfeo is a mad dwarf who used to work as a scribe in the office of Alessandro’s father’s law office, before being replaced by the typewriter. During the war, Orfeo gets a job in the War Department, and spends his time changing orders and troop dispositions, according to his whim. In that way, Orfeo becomes the laughing, raving symbol of the lunacy of war. I thought there was a lot of unevenness in A Soldier of the Great War. It’s episodic in nature, and some episodes work better than others. And there was only so much of Alessandro I could take, before I started to wish him ill. That aside, Helprin’s enormous talent cannot be denied. He has created something that is overflowing with ideas, intelligence, humor, and lasting images. This is accessible – if sometimes pretentious – literary fiction, with prose worth remembering. It was enough to leave me – sleep-deprived, covered in baby puke, surrounded by diapers – a bit in awe. And more than a bit jealous of Helprin’s talent."}, {"userName": "Chrissie", "userReviewDate": "Dec 09, 2007", "userURL": "http://www.goodreads.com/user/show/632247-chrissie", "userReview": "Whatever I could possibly say cannot do justice to this book. How Helprin uses language is magnificent - the dialogue, the thoughts he evokes, the humor, the beauty he paints for the reader. I have to give this book five stars, although I have only read half. Well now I have completed the book and this makes me so sad - I didn't want it to end."}, {"userName": "Steve", "userReviewDate": "Jul 31, 2007", "userURL": "http://www.goodreads.com/user/show/236411-steve", "userReview": "When we first meet Alessandro, the soldier from the title, he’s an elderly but still vital man who takes a principled stand against a streetcar driver who refused to stop for a would-be rider giving chase. Alessandro ends up getting off as a kind of protest and faces a distant journey on foot with the impressionable young man who’d been left behind. Along the way, Alessandro tells him (and us) quite a story. It’s filled with events and perspectives prior to the war that hint at the kind of soldier he ultimately becomes. Then it’s off to the Great War itself with all the context you would ever need to see it for what it was.Had the lone theme of the book been “war is hell”, it still would have been very good. We’re made to care about these guys, which is the key to hating whatever can snuff them out. But Helprin expanded way beyond that. I tried to figure out what made it so much better than other books of its type and concluded that it had a lot to do with Helprin’s confidence. He knew his research was good so that Alessandro’s many duties as an Italian soldier seemed genuine. Surviving the front lines, climbing the Alps, chasing deserters, awaiting a death sentence, recovering in a hospital--it all seemed very real. At the same time Helprin mixed in some elements bordering on the surreal, almost silly, but all to good effect. There were even a few laughs, which are not easy to fold into a work like this. What impressed me most, though, in this vein of self-assurance was how Helprin gave this courageous, war-hardened man a heightened sense of aesthetics and love. An intellect like Alessandro’s, which was well-schooled and constantly at work, would come across as stilted in most any other writer’s hands. Thankfully, Helprin knew he had the chops to make it work.This is one of my wife’s favorite books of all time. Now I know why. Highly recommended for a time you can fully absorb it.Updated 11/16/2011: Alessandro didn't often drink beer, but when he did, he preferred Dos Equis."}, {"userName": "Lewis Weinstein", "userReviewDate": "Dec 30, 2011", "userURL": "http://www.goodreads.com/user/show/2231715-lewis-weinstein", "userReview": "A Soldier of the Great War is a compelling read and I was left with a marvelous portrait of a thoughtful man whose life has been horribly distorted and, despite his heroism and accomplishments, and his own longevity, largely wasted by the experience of meaningless war. This is mankind's history ... over and over again, from time immemorial to the present day. Helprin's writing technique (at least in this book and Refiner's Fire, which I read a year or so ago) is to tell a sequence of what seem to be unrelated tales in the life of a single character. mild criticism #1 ... I found the leaps to new time frames and places a little disconcerting. At least in this book, as opposed to Refiner's Fire, the leaps are always forward in time. The skips do allow the presentation of an extended time range without filling in all the details and thereby producing an overly long book. The downside is that without clear transitions, the reader can become confused, never a good thing.even milder criticism #2 ... the book suffers from an excess of description. Helprin is so good at it that he does it too often and in too much detail. There were many times when I wanted to know what happened to Alessandro and was frustrated by an overly long descriptive passage.And yet ... it is so very good, thoughtful and enlightening.Alessandro's musings about death, facing his own while remembering all the others he has seen, are by themselves worth the reading. The best evidence, he hopes, of some future after death is contained in the hints of a past before birth. There's a thought that will stay with you."}, {"userName": "switterbug (Betsey)", "userReviewDate": "Feb 07, 2012", "userURL": "http://www.goodreads.com/user/show/2843912-switterbug-betsey", "userReview": "A friend recommended this epic book to me despite knowing I wasn't fond of Helprin's novels. Well, he certainly perceived my taste fittingly, and I am forever indebted to him for persuading me to read this beautiful, evocative, deeply resonating story of a soldier-scholar living through WW I.This is not like any other war novel I have read, and I've read a number of them. Although you are taken inside the reality of war--in the muddy trenches, in the grasp of grenades, marching with battalions, and tramping through the punishing terrain and climactic extremes, the focus isn't limited to the strategies/hierarchies/bureaucracies of war games, although they are present and compelling. This is a story of an Italian aesthetic, Alessandro Giuliani, who is devoted to life, humanity, and art, and whose love for one woman is inexhaustible. He is as passionate about the song of a bird, the luminosity of a star, the tufts of clouds, and the play of light and color on a painting, as he is of surviving the war.The jacket art on my edition is a partial view of La Tempesta, by Giorgione, a Renaissance painting that plays a pivotal role in the story. The eloquence of Helprin's tribute to this work of art, through Alessandro's sensitivity and regard to its poignancy, left me breathless. I have never been so exquisitely moved by a painting through a novel, and I vow to visit the Accademia in Venice someday and stand in front of its powerful beauty.This is a novel to keep handy on a shelf once you have finished reading it, just to have access to its potent passages. You can open to any page and find poetry in prose. It elevates my thoughts to embody Alessandro and his five senses. Here is an example of the book's uncommon beauty that shines everywhere on these pages:\"It seemed unbelievable that the sky, twisting and boiling like burning phosphorous, was silent, for its light and thunder suggested thunder, explosions, and the sound of the sea. The stars were busy and intent, as if before the moon came up they had to unburden themselves of all they had seen during the daylight hours, when they could not speak. Now they ran riot, and their light made the snowfields breathlessly dim.\"This is one of the most exalting contemporary novels I have ever read. It demands patience, as it is not only hefty, but dense as well, with long chapters and copious forays into detailed and metaphorical description. This is a book for an ardent reader who desires a sensory experience with exuberant narrative scope. After finishing it, I felt still and quiet, as if in repose, and then I wept, reflected, and avidly thanked the literature gods for sending this to me. I like to think I am an improved person for having read this exceptionally cultivated novel of the human condition."}, {"userName": "Lori", "userReviewDate": "Dec 26, 2009", "userURL": "http://www.goodreads.com/user/show/744602-lori", "userReview": "It's taking me a long time to read this. Not because it's bad. Just the opposite. The writing is so exquisite that my heart is breaking over and over again and I realize I'm not making the time to read. Yet I'm drawn back every day, and then wonder why I'm avoiding it. Against the backdrop of the brutality and idiocy of war, the beauty of life and the spirit are awesome, awesome as in the mysterious majesty that raises us to ecstasy.100 more pages and I don't want it to end.Breathtaking. My god the man can write. I'm in a void right now, left to wonder what can I possibly read next that won't shatter under the reverberations lingering from finishing this book."}, {"userName": "Mark Linehan", "userReviewDate": "Jul 30, 2007", "userURL": "http://www.goodreads.com/user/show/85085-mark-linehan", "userReview": "This book puts Erich Maria Remarque to shame. Beautiful prose highlights a forgotten front of a forgotten war as a student of aesthetics becomes a soldier of World War I in the Italian army. The characters brought to life by Mark Helprin are perfectly tragic in their hope and optimism. As you read, you desperately try to connect yourself to Alessandro, but as you press on, you come to realize that we are all Nicolo, his companion on the road away from Rome in 1964, ignorant and selfish, thinking no farther than our noses. Anyone who has ever been to Rome or Italy would adore this book, and for anyone who has ever loved."}, {"userName": "Raeden Zen", "userReviewDate": "May 21, 2013", "userURL": "http://www.goodreads.com/user/show/10289004-raeden-zen", "userReview": "A Poetic Journey During War and Peace“Alessandro grieved. His punishment was that nothing in the world could touch him. His punishment was that God had put him into battle and preserved him from its dangers.”In summer 1964, after the operator of a streetcar denies a fare to a young boy, an elder man, Alessandro Guiliani, walks off in protest. Alessandro joins the boy, and in their journey from Rome to a far away village, he tells the boy the story of his life; from his early days living as the son of an attorney, (during which time he has an unforgettable encounter with an Austrian Princess), to a young Roman intellectual who foresaw the coming conflict in Europe, to a soldier battered in the trenches, to a man who discovers the meaning of his life in the Italian Alps, to an elder who imparts lasting wisdom upon an illiterate boy, Alessandro’s life is one in which none of us would want to live, but that all of us long for. A life filled with adventure and joy, sadness and love, death and rebirth, a life which he, as noted above, acknowledges is marred by the scars of war, scars from the trenches, scars from the forced labor—emotional scars owing to the death of friends, family and strangers. Mark Helprin transports the reader with poetic prose and images to a distant time, an enchanting place that was early 20th century Europe, and Italy in particular, as it turned into an abyss of war. The story is epic, the voice is omniscient, the plot is tragic, and by the denouement, the sense that anything is possible even during the worst of times, the sense that over that seemingly insurmountable hill there lay the light that can bring hope to the darkest heart, is what makes Alessandro’s story truly unforgettable.The bottom line: “A Soldier of the Great War” is a must for anyone interested in Italian history prior to and during the Great War, lyrical prose, a meandering storyline with multiple, well-timed twists, and a masterful study of the human condition."}, {"userName": "Roger Brunyate", "userReviewDate": "May 09, 2016", "userURL": "http://www.goodreads.com/user/show/42294189-roger-brunyate", "userReview": "The Man Who Still Heard MusicThe electricity rose up his spine and he trembled not from shock but because, over the sound of the guns, he was still able to hear sonatas, symphonies, and songs.Alessandro Giuliani is listening to field guns being tested in Munich in 1914, the year before Italy entered the War against Germany and Austria. Although mostly interested in the visual arts, Alessandro should know about music and beauty of all kinds; as a Professor of Aesthetics, it is his métier. But he learns about it the hard way. When the war breaks out, he is just about to take his doctorate at the University of Bologna. He volunteers for the Italian navy in the hope of avoiding conscription into the trenches, but he ends up in some of the worst fighting of the war nonetheless, facing the Austrians across the river Isonzo. Subsequent phases of the war will take him to Sicily, the high Alps, and many other places, and he proves as natural a soldier as he is an aesthetician. Alessandro's appreciation of beauty, which shines through every chapter of his reminiscences as an old man in the 1960s, has not emerged despite his exposure to death and danger, but because of them.Hundreds of men worked below, in a brilliance that made the vast quarry look like a piece of bright moon that had crashed to earth. They appeared to be mining not stone but white light, and when they took the stone in slabs and caused it to float through empty space, tracked by searchlights, hanging on gossamer cables and unseen chains, it was as if they were handling light in cubic measure, cutting and transporting it in dense self-generating quanta from the heart of magical cliffs.Alessandro's image of looking down into a marble quarry as men work through the night to make tombstones for the Italian dead is one of dozens that have stuck with me indelibly since I first read this wonderful book a decade ago. It is a magical image, cinematic in is theatricality and scale, yet the men down below are prisoners working murderous sixteen-hour shifts, and Alessandro is about to join them. It is not that Helprin underestimates the brutality of war, or the hardship of suffering; it is just that Alessandro always finds things to marvel at, no matter how terrible things are around him. He finds wonder everywhere: in a midnight bathe in the Isonzo between the two front lines, in the sunlight glinting off a flight of birds that feed off the battlefield dead, in the walls of flame from burning stubble that line the Italian coast as he travels slowly southward on a cattle steamer, in the fury of a thunderstorm breaking over icebound peaks, in galloping a fine stallion across the plains of Hungary. \"And how does God speak to you?\" somebody asks him; \"In the language of everything that is beautiful,\" he replies.The only other modern novel that comes close in fantasy, wonder, or scale is David Mitchell's recent The Thousand Autumns of Jacob de Zoet. But this comparison also points to a weakness that I noticed on second reading but missed or excused the first time. At 800 pages, this is a long book, slow to get started and over-extended at the end. Although Helprin skillfully sets up the combination of reality and imagination at the beginning, and is careful to ensure that every episode, however colorful, is also realistically plausible, the long sequence of such events demands an increasing suspension of disbelief. There comes a time, after about 500 pages, when one wonders how many more humps and turns this roller-coaster has. There is also a bizarre thread, involving a former employee of Alessandro's father, a diminutive mad clerk placed in an important position at the Ministry of War, which seems more in the manner of Catch-22 than the basic seriousness of the rest of the book.And it is serious. It is a book about God, and honor, and joy, and endurance, and above all about love. Love in a spiritual sense, love among families, love between friends, the love of man for woman. There is a moment early in the book when Alessandro comes upon a young girl weeping quietly beside a Roman fountain at night. There is another when he goes to Venice to look at the enigmatic picture by Giorgione known as La tempesta, involving a young soldier and a naked woman with a baby facing one another against the background of a gathering storm. Both gleam with that magical grace which Helprin conjures so effortlessly. But both will resonate throughout the book to wondrous effect, more than once bringing tears to my eyes, and lingering in my mind for ever."}, {"userName": "Tamir Damari", "userReviewDate": "Dec 13, 2008", "userURL": "http://www.goodreads.com/user/show/1532934-tamir-damari", "userReview": "Helprin is not for everyone. He's moralistic, his female characters are an afterthought, much of his philosophy is better suited for the 19th century and his books invariably involve military conflict. That being said, he's is the most talented writer I've ever read. He can make the most mundane event sound poetic, and his gift for metaphor is staggering. There are passages within each of his books which almost literally take your breath away.There is a relentless optimism to all of his stories. He is a Romanticist with a capital \"R,\" and his world-view is imbued with a kind of pantheistic spirituality. He also has a keen sense for absurdist/slapstick humor. A Soldier of the Great War sticks to his typical template: a male protagonist who proves his virtue through courage in battle. But while the general blueprint is predictable, the voyage is a wonderful whirlwind. The protagonist, Alessandro Giullani, is a student of aesthetics at the turn of the 20th century. He is content to live a life of contemplation and study, but the \"Great War\" (WWI) intercedes, and M. Giullani is caught in the war's maelstrom. What ensues is a modern-day Homeric tale of action and bravery. Woven into the battle descriptions (there are many) are lengthy meditations regarding art, music, god, morality, romantic love and the insanity of mechanized war. In lesser hands, this would be a recipe for pompous disaster. But due to his immense talent, Helprin pulls it off. Say want you want about his choice of themes, you can't doubt the man's skill."}, {"userName": "deLille", "userReviewDate": "May 04, 2010", "userURL": "http://www.goodreads.com/user/show/992712-delille", "userReview": "I tend to race through books, which was a huge mistake with this one. A Soldier of the Great War needs to be read slowly with each description and each passage savored. It is a gorgeous, almost achingly beautiful book. If someone could \"paint\" a book, this would be it. True art. Reading this book is like taking a drug... you walk away seeing everything from a different -- and spiritually deeper -- angle. This book makes me realize how asleep we are, and how much richer life is than we ever stop to notice. But also, how meaningless we are. Sobering. Heartbreaking. Stunning."}, {"userName": "Keith", "userReviewDate": "Dec 05, 2007", "userURL": "http://www.goodreads.com/user/show/659583-keith", "userReview": "My pick for the best American novel of the late 20th century. Dramatic, engrossing, a long and poignant read, an amazing journey in the midst of war, the discovery of love, all anchored by heartbreakingly beautiful prose.From the Mark Helprin web site (used with permission) In the summer of 1964, Alessandro Giuliani, an old and partially lame professor of aesthetics —white hair and mustaches, white suit, cane— is thrown off a trolley on the outskirts of Rome after he comes to the defense of a young and semi-literate factory worker who has irritated the driver. Alessandro and Nicolò, the boy, decide to make the very long journey into the mountains, on foot, as a defiant pilgrimage away from those things --worthless and imposed--that people allow to take the place of real life. In their trying walk, the towns of Italy glittering below them in the warm summer air, the sea polished by a weightless fume of silver light the old man is moved to tell the story of his life: of a youthful paradise instantly shattered by the First World War, of how he lost one family, gained another, and lost it as well. The boy is enthralled by the war and its spectacular events, by Alessandro's privations, heroism, and adventures, and by the extraordinary beauty of the story and in its telling. At the end of the long walk, however, he comes to understand its deeper import, that love is superior to and greater than all the glories of civilization, but that each is heightened by the understanding of the other, and that even in the face of death, life can be made worthwhile if these things are made to run together seamlessly, like a song."}, {"userName": "Rick Slane", "userReviewDate": "Apr 08, 2015", "userURL": "http://www.goodreads.com/user/show/17459218-rick-slane", "userReview": "An old man was reminiscing mostly about his WWI experiences as an Italian soldier. At times I wished he would hurry up and get on with the story lines that interested me. Then at others I wanted to know more about his life and his thoughts. This book is not for everyone. If you like Joseph Heller (Catch-22),Vonnegut & Remarque you might enjoy this novel. It is about 800 pages so I recommend it to patient readers."}, {"userName": "Kyle Mcclure", "userReviewDate": "Sep 09, 2007", "userURL": "http://www.goodreads.com/user/show/91130-kyle-mcclure", "userReview": "You win, Mr. Helprin. Your fine novel transcends my smart-ass review. Even so, I give you five out of five pitons driven into the rock face of an impossible cliff in the Italian Alps by a soldier we have come to love on his way to rescue his friend who we hope is not dead. You get extra credit for your humorous inclusion of the roller-coaster decorating profession."}, {"userName": "Levi Walls", "userReviewDate": "May 05, 2013", "userURL": "http://www.goodreads.com/user/show/11968267-levi-walls", "userReview": "Brilliant!! A comedy of errors and a beautiful picture of life and why you should never give up!!"}, {"userName": "William Clay", "userReviewDate": "Jul 25, 2008", "userURL": "http://www.goodreads.com/user/show/1364957-william-clay", "userReview": "I always liked books where the protagonist confronts whatever obstacles confront him and overcomes in the end. Reading this book,and reading Mark Helprin in general, is like listening to a Mozart Symphony. I feel arrested by it's melodies until it's conclusion. Helprin's gift for prose is unparalleled. His descriptions are so vivid I felt like I was watching a film. What I don't particularly like are books, or films that try to portray \"true life\" as it were. These are ones where the bad guy gets away with it, or the hero's death is meaningless (example is the film \"Arlington Road\"). That isn't what I think life is all about. Mark Helprin's book is a perfect example of what a good book should be. That is one where his descriptions of whatever depravity, loss, difficulties and ugliness only serve to heighten and accentuate the beauty, love and light that life should be about that he is equally adept at describing."}, {"userName": "Dan", "userReviewDate": "Dec 29, 2007", "userURL": "http://www.goodreads.com/user/show/632985-dan", "userReview": "So...this would probably be the greatest novel ever written. It is a war story and a love story, a story about God and beauty, a story about perseverance, and it's really funny and quirky at times. Mark Helprin is our most intelligent writer, and our most underappreciated. I don't read many books more than once, but I've read this one 3 times and some of the passages countless times."}, {"userName": "Lobstergirl", "userReviewDate": "Jan 15, 2009", "userURL": "http://www.goodreads.com/user/show/1910836-lobstergirl", "userReview": "The novel probably deserves more than 3 stars. Parts of it are very moving, and Helprin has important things to say and creates a wonderful, deeply humane character in Alessandro Giuliani. But it was a long, looooong slog. It felt like a 40-mile hike. More chore than fun."}, {"userName": "Ahmad Sharabiani", "userReviewDate": "Dec 01, 2015", "userURL": "http://www.goodreads.com/user/show/614778-ahmad-sharabiani", "userReview": "A Soldier of the Great War, Mark Helprin"}, {"userName": "KOMET", "userReviewDate": "Oct 22, 2011", "userURL": "http://www.goodreads.com/user/show/4183137-komet", "userReview": "Never was I MORE RELIEVED to be done with reading a book as I was with this one. This tale, in which Alessandro Giuliani, an aging First World War veteran in his dotage, speaks about his life to a young lad (Nicolo) in his late teens while the 2 make their way on foot from the countryside to Rome during August 1964, is ponderous and tiresome. Alessandro, who grew up and lived a life of ease and comfort up til the First World War, loves to pontificate on just about any subject. In this respect, he comes across as very annoying and pompous. The prose also had a tendency to be clunky and superfluous. This novel I had had in a closet for almost a decade. But it was only a few weeks ago that I felt compelled to read it because it touched on the First World War (a subject I am more eager to learn about) and it had been a New York Times Bestseller. So, the more I read this novel, the more I found myself fighting it, hoping that I would find a more engaging tale. Alas, it was not to be. To quote the character McBain from \"The Simpsons\": 'BYE, BOOK!' Begone! To the local library this book goes."}, {"userName": "Captain Sir Roddy, R.N. (Ret.)", "userReviewDate": "Nov 14, 2014", "userURL": "http://www.goodreads.com/user/show/2482609-captain-sir-roddy-r-n-ret", "userReview": "A lyrical, enchanting and sweeping tale that was simply impossible to put down once I started reading. This is the story of a human life, the life of a young Italian, Alessandro, at the very beginning of the 20th century, learning to live and love with his family in Rome, mountain climbing in the Italian Alps, and then becoming a man on the battlefields of World War I. I don't quite know how to describe it, but there is something almost Tolstoyan in Helprin's wordcraft and the breadth and scope of this beautiful novel. It is elegant, nuanced and sophisticated, rich and inviting, and expresses the full gamut of human emotions and cannot help but evoke empathy in the reader. For those of you who are veterans, or have veterans in your family, this is book to read and savor, a novel to share. This is a classic, a novel that will be read by many one-hundred years, even two-hundred years from now. I know that this is a novel that I will be revisiting every few years for the rest of my life. Yes, it is just that good!"}, {"userName": "Petra", "userReviewDate": "Feb 18, 2010", "userURL": "http://www.goodreads.com/user/show/1733683-petra", "userReview": "This is a beautiful story. Allesandro’s tale of his life is a love story to his family & comrades in arms. The author, Mark Helprin, makes us care for the characters in this book and grieve for them & their families. Allesandro tells his story with charm and humour and he’s shown to be a man of substance, feeling and loyalty. He travels with a young, uneducated young man who he defended. Niccolo is enthralled with the story that Allesandro tells of the war, his part in it, and his loves. He comes to realize that love rises above all and that love never dies and lives beyond one’s life time. Helprin told a wonderful story of a good man living through terrible times and yet rose above the experiences."}, {"userName": "Pam Jenoff", "userReviewDate": "Nov 11, 2016", "userURL": "http://www.goodreads.com/user/show/4980927-pam-jenoff", "userReview": "In honor of Veteran's Day, I choose this story of an elderly man recounting his life during World War I. Such an epic story of love, loss and redemption, and so beautifully written. I first read it 21 years ago while stuck in Lille, France during a train strike and I have loved it ever since."}, {"userName": "Robin Mccormack", "userReviewDate": "Feb 10, 2018", "userURL": "http://www.goodreads.com/user/show/6734331-robin-mccormack", "userReview": "A Soldier of the Great War is one of those books that once finished, you have to let yourself ponder what it is you've just read, let it sit with you for a time, while you formulate your thoughts. After being immersed in Alessandro's world for three weeks, it will take me a while to surface. It's epic, poetic, heart wrenching, funny, scary, breathtaking, maddening, and leaves you with much to ponder."}, {"userName": "Cameron", "userReviewDate": "Feb 06, 2012", "userURL": "http://www.goodreads.com/user/show/2590373-cameron", "userReview": "An interesting and well-written book, but not one of my favorites. Helprin is a skilled writer, but not brilliant; the story is engrossing and the setting is well-chosen, but I think in the end what really bothered me is that the main character, Alessandro, fails to become truly lovable. He is admirable in a super-hero way: infinitely competent, succeeding when he should and failing when he must. Although we experience nearly every minute of his long life, his strange and frightening experiences during the long war, his various loves, the death of his father, and his two escapes from imprisonment, we never become devoted to him as a man and a human being. The book in general skirts the territory of magical realism too often--impossible feats are performed, plot quandries are solved with coincidences, and we never doubt that Alessandro will achieve what he wishes to. Helprin is at his best with descriptions of light, sound and smells: he makes us feel as if we are there, but the emotions of our protagonist are frequently less vivid. And in the end, the book was just too damn long--I had to struggle through the last 100 pages, irritated by minor plot twists and time-outs to admire the sky or the trees or the birds. Some novelists don't appreciate the value of the story and where it takes us; they would rather sing a song and paint a picture than hurry us along the road to adventure."}, {"userName": "Sam Negri", "userReviewDate": "Nov 27, 2012", "userURL": "http://www.goodreads.com/user/show/6843313-sam-negri", "userReview": "My copy of this book was 860 pages. I read 400 pages and finally came to the conclusion that it was a waste of time because I had practically no curiosity about the main or subordinate characters. I tossed it.This book was a bestseller when it came out. I have no idea why. It is essentially a collection of 1,500 word anecdotes with a thin film of connecting glue.Most of what came out of the characters' mouths was implausible. There's an awful lot of inflated dialogue that sounded to me like words tumbling over themselves in search of a profound insight. Most of these attempts at insight did not quite rise to the level of Zorba the Greek's observation: \"Clever people and grocers, they weigh everything.\"At the very least, a novel must give me at least one engaging character and be written with enough skill to make me curious about what is going to happen to that character. A Soldier of the Great War did not meet those basic standards. After reading half the book, I came to the conclusion it was just one damn thing after another, and it was boring."}, {"userName": "John", "userReviewDate": "May 21, 2015", "userURL": "http://www.goodreads.com/user/show/2095414-john", "userReview": "This is a difficult to categorize book, as it swings from serious to farcical and much of it strains credulity, but oh, what a tale! It is fascinating to read about life in Europe around the turn of the century and into the Great War, or what we now called World War I. The world was turned upside down by that war, and it is apparent in the book. The dynasties die, the nobility fade away, and what is left is the modern world. Helprin has a deep awareness to the way the setting of the book allows him to play off themes and milieus to take his story to places that he wants it to go. And he does take the reader for quite a ride. I won't spoil it for those who've not read it, but it is a thrill. I recommend it."}], "description": "From acclaimed novelist Mark Helprin, a lush, literary epic about love, beauty, and the world at war.Alessandro Giuliani, the young son of a prosperous Roman lawyer, enjoys an idyllic life full of privilege: he races horses across the country to the sea, he climbs mountains in the Alps, and, while a student of painting at the ancient university in Bologna, he falls in love. Then the Great War intervenes. Half a century later, in August of 1964, Alessandro, a white-haired professor, tall and proud, meets an illiterate young factory worker on the road. As they walk toward Monte Prato, a village seventy kilometers away, the old man—a soldier and a hero who became a prisoner and then a deserter, wandering in the hell that claimed Europe—tells him how he tragically lost one family and gained another. The boy, envying the richness and drama of Alessandro's experiences, realizes that this magnificent tale is not merely a story: it's a recapitulation of his life, his reckoning with mortality, and above all, a love song for his family.", "title": "A Soldier of the Great War", "url": "https://www.goodreads.com/book/show/87985.A_Soldier_of_the_Great_War", "average": 4.35, "cover": "https://images.gr-assets.com/books/1328874912l/87985.jpg", "reviews": 650, "authors": [{"url": "https://www.goodreads.com/author/show/8146.Mark_Helprin", "name": "Mark Helprin"}], "type": ["Fiction", "Historical", "War", "Cultural", "War"], "outlinks": ["http://www.goodreads.com/book/show/87985.A_Soldier_of_the_Great_War", "http://www.goodreads.com/book/show/1257753.A_Soldier_Of_The_Great_War", "http://www.goodreads.com/book/show/988507.A_Soldier_of_the_Great_War", "http://www.goodreads.com/book/show/632975.A_Soldier_of_the_Great_War", "http://www.goodreads.com/book/show/17876657-a-soldier-of-the-great-war", "http://www.goodreads.com/book/show/12967.Winter_s_Tale", "http://www.goodreads.com/book/show/87060.Freddy_and_Fredericka", "http://www.goodreads.com/book/show/13391073-in-sunlight-and-in-shadow", "http://www.goodreads.com/book/show/87989.Memoir_from_Antproof_Case", "http://www.goodreads.com/book/show/87984.The_Pacific_and_Other_Stories"]}