{"ratings": 603, "userreviews": [{"userName": "Poppy", "userReviewDate": "Jan 10, 2008", "userURL": "http://www.goodreads.com/user/show/273353-poppy", "userReview": "I have the original edition of this book, and the title used to read \" ... Why Princess Margaret Will Never Be a Kappa Kappa Gamma.\" This means I'm much classier than these nouveau types who bought the reprinted edition."}, {"userName": "Kerry", "userReviewDate": "Nov 24, 2010", "userURL": "http://www.goodreads.com/user/show/4578705-kerry", "userReview": "I have a lovely Southern belle co-worker who lent me her copy of this very funny book. Tips such as these are helpful:\"Want to know if someone is a real Southern belle? Just look in her cupboard. If she's got an iced tea pitcher and a deviled egg plate, you can bet she's as Southern as tomato aspic.\"\"My dear, this is something you must always remember. Your bosom can be fake. Your smile can be fake and your hair color can be fake. But your pearls and your silver must always be real.\"- South Carolina Grandmother talking to her GranddaughterImportant vocabulary for the Southern belle:Lovely - \"She comes from a lovely family.\"Precious - A high compliment. \"Aren't you just the most precious thing?\"Darlin' - Also a high compliment, to be used along with precious for better emphasis. \"How is that precious husband of yours? He drives the most darlin' little sports car.\"Cute - Not exactly a high compliment, but not a complete put-down either. \"Don't you look cute! (This means you still have an outside chance of making Kappa Kappa Gamma, but you're not as solid as you would be if you looked precious or darlin'.)\"Sweet - The kiss of death. \"Who;s that sweet little thing in the corner. Just look at that sweet little dress she's wearing!\"Nice - The kiss of death with the coffin sealed. \"Well, I don't know her well, but she seems perfectly nice. (She'd better think about volunteering at the hospital because she's never going to make the Junior Auxiliary.)\""}, {"userName": "Kate", "userReviewDate": "Aug 11, 2010", "userURL": "http://www.goodreads.com/user/show/3874506-kate", "userReview": "\"First there's [Kappa:], then you get married, then there's Junior League, and then you die.\" Awesome!"}, {"userName": "Stacie", "userReviewDate": "Jun 21, 2010", "userURL": "http://www.goodreads.com/user/show/3199657-stacie", "userReview": "Of course I like it...I'm a Kappa!"}, {"userName": "Sharon Huether", "userReviewDate": "Jul 23, 2017", "userURL": "http://www.goodreads.com/user/show/3534528-sharon-huether", "userReview": "Southern Bells love to have everything matching from their wardrobe to a planned party, which are usually themed.Southern Belles love their silver sterling flatware, not silver plate. They pick out their pattern well before they get married. Good silver is more important than designer luggage.When in college, being a part of sororities is a must.Life in the south is manners and tradition. This was a fun read."}, {"userName": "Lilia", "userReviewDate": "Feb 22, 2015", "userURL": "http://www.goodreads.com/user/show/4142437-lilia", "userReview": "Fun! Yes, much of this is how it is, some of it isn't (I grew up in Northern VA in the 70's and now live in Central VA, to give some perspective). But it all depends on \"who your people are,\" where you live, and your age. Some of the traditions are lovely to uphold, others are not so nice. My favorite part is the section on \"The Twelve Patterns of the Southern Silver Zodiac.\" I always adored my mom's silver, (and she's from way down south - South America!) and my grandmother's silver. My Oma Kate kept (in a custom-made cabinet on display) some beautiful demitasse spoons from her travels around the world. I haven't met many people these days who bring out their silver or even care to inherit/buy any, but I just remember knowing it was a special occasion when mom set the table with it."}, {"userName": "Judi", "userReviewDate": "Mar 26, 2014", "userURL": "http://www.goodreads.com/user/show/11482194-judi", "userReview": "This is a short read, adult picture book full of humorous looks into the reasons Southern Belles act the way they do. I had a friend (very Southern) tell me that those days have passed into history and life is different now, but I found plenty of evidence that attitudes and small habits continue to carry through the generations.If you're from anywhere but the \"South\" and try to live there, you need this information. Heaven forbid you get labeled not just as a Yankee, but \"tacky\" as well. Save yourself."}, {"userName": "Katherine", "userReviewDate": "Jul 11, 2010", "userURL": "http://www.goodreads.com/user/show/3967933-katherine", "userReview": "Another must read for young girls that introduces them to a world of what it means to be a Southern lady This book, although meant to be satirical, truely explains traditional Southern graces, which will no doubt soon be forgotten. It was amazing how my mom fit almost all the characteristics of a true Southern belle, as I always knew she was. Actually, this book can be enjoyed by all ages!"}, {"userName": "Noel", "userReviewDate": "Mar 06, 2008", "userURL": "http://www.goodreads.com/user/show/968598-noel", "userReview": "The piece on flatware? Totally me. I think this book may be why I joined a sorority, and own a deviled egg plate."}, {"userName": "Christine Kenney", "userReviewDate": "Sep 07, 2017", "userURL": "http://www.goodreads.com/user/show/63302832-christine-kenney", "userReview": "Interesting read from the perspective of someone whose education/career ambitions resulted in excessive mobility-- What customs keep people rooted in an area? What advantages do they enjoy from having roots? A lot of it seemed more like a 1990's primer. I'm not sure belles are as deeply committed to big teased hair and cemetery plots overlooking department stores as they might have once been."}, {"userName": "Brenda", "userReviewDate": "May 31, 2018", "userURL": "http://www.goodreads.com/user/show/5415617-brenda", "userReview": "This book was written in 1991 and it sure reminds me of my mother and grandmother! Deep South Traditions rule! Of course I do see some of my friends in this book as well - Ginny, Kelli, Caren and I suspect Amy too, who loaned me this book! Such CHARM!"}, {"userName": "Paige Turner", "userReviewDate": "Jan 26, 2018", "userURL": "http://www.goodreads.com/user/show/75082679-paige-turner", "userReview": "I went to a college in the South. Somebody lent this to me. It was very helpful."}, {"userName": "Veralisa Waterwall", "userReviewDate": "Jan 03, 2018", "userURL": "http://www.goodreads.com/user/show/25236375-veralisa-waterwall", "userReview": "Reminded me of a friend who is from Texas, went to UT Austin, pledged Kappa Kappa Gamma and joined The Junior League."}, {"userName": "Ashley Callen", "userReviewDate": "Mar 06, 2018", "userURL": "http://www.goodreads.com/user/show/60699393-ashley-callen", "userReview": "amazing fluff"}, {"userName": "Suzanne Kittrell", "userReviewDate": "Nov 08, 2010", "userURL": "http://www.goodreads.com/user/show/2493895-suzanne-kittrell", "userReview": "Every Southern female should read this book and heed its advice. My cousin Beez gave this to me many years ago and I just unearthed it this past week - I had been searching for it and feared it was lost. But. . .if you ever need to know how and why those of us with Arkansas/Southern roots think we are so different from the rest of the country, then read this book. It is falling down, can't catch a breath, funny. It will tell you so much about all those \"quirks\" Southern women inherit and how important they are to your social development as a true Southern belle. There are several sequels to this first book (circa 1993) but this is by far the most revealing. And just to offer you one little tidbit from this author (who was Society Editor of the Dallas Morning News when it existed - you know she saw her share of this breed of womanhood), one of my favorites is \"Your bosom can be false, your smile can be false, but your pearls should be real.\" Yes, words to live by, I say."}, {"userName": "Holly", "userReviewDate": "Nov 30, 2011", "userURL": "http://www.goodreads.com/user/show/1994638-holly", "userReview": "Anyone born in the South or currently living here must read this book. It is hilarious and it will only take an hour or two at the most! Some of my favorites:A Southern Belle's Ten Golden Rules- #5 Never date your sorority sister's ex-husband until at least there years after the divorce. You might need her to write your daughter a Kappa Kappa Gamma recommendation one day. Just remember it's a lot easier to find a new man that it is to get your daughter into Kappa.A Southern Belle would rather walk down Fifth Avenue naked that wear white shoes before Easter or after Labor Day.Your bosom can be fake. Your smile can be fake and your hair color can be fake. But your pearls and your silver must always be real."}, {"userName": "Momma", "userReviewDate": "Feb 07, 2017", "userURL": "http://www.goodreads.com/user/show/4839533-momma", "userReview": "EnjoyableRead it in one day"}, {"userName": "Connie Anderson", "userReviewDate": "Feb 19, 2014", "userURL": "http://www.goodreads.com/user/show/22624726-connie-anderson", "userReview": "One of the funniest books I've ever read. Not only for \"Southern Belles,\" but for anyone who dares to be less than an authentic person. Interesting chapter on how the word \"sweet\" can be used to devastate, which can also apply to use of a variety of similar words as well, i.e. \"kind,\" \"nice,\" ... In an age where few people say what they mean and mean what they say, this book might just be a real examine of conscience for \"Southern Belles\" and \"D* Yankees\" alike!"}, {"userName": "Meg", "userReviewDate": "Feb 04, 2009", "userURL": "http://www.goodreads.com/user/show/1009267-meg", "userReview": "Research for Miracle Worker... Believe it or not, those Southern Belles LIVE by a lot of this stuff TODAY! I still remember when someone in my Texas junior high school made fun of me for wearing white after Labor Day. It wasn't even a winter white! For shame. Guess I would never be a kappa gamma gamma, either."}, {"userName": "Jennie", "userReviewDate": "Feb 07, 2008", "userURL": "http://www.goodreads.com/user/show/731088-jennie", "userReview": "Yet another \"Jennie is obsessed with the South\" book - this one is hilarious, especially the stories of all the faus pas us non-Southerners commit. Like Fergie wearing white shoes in Texas in November - just not done, honey.Loved it. Very funny.I want to ask my grandma all kinds of questions now, just to find out for sure if this stuff is true."}, {"userName": "Priscilla", "userReviewDate": "Dec 29, 2016", "userURL": "http://www.goodreads.com/user/show/5563319-priscilla", "userReview": "Very entertaining read!! This book gives tips, lists, and advice on what all Southern belles should know. Some of the tips are things I've grown up knowing (like when to wear white shoes, having a hope chest, and the significance of football, pageants and iced tea). But other things like silver patterns and bridesmaids dresses matching the pinch were new to me. Humorous, quick read."}, {"userName": "Christi", "userReviewDate": "Dec 12, 2012", "userURL": "http://www.goodreads.com/user/show/10202481-christi", "userReview": "None of what I read was news to me, even though I might be considered \"tacky\" by a true Belle for only following a few of the \"rules.\" Along with not owning a deviled egg plate. That book had me cracking up though!"}, {"userName": "Kim", "userReviewDate": "Oct 17, 2011", "userURL": "http://www.goodreads.com/user/show/4980499-kim", "userReview": "Got this as a gift from my sister-in-law. Wonder if she was trying to help this \"lost in the south\" Yankee! LOL.....veery funny read and most of it is still true! Hard to believe it but I saw and heard it with my own eyes."}, {"userName": "Jamie", "userReviewDate": "Jul 25, 2011", "userURL": "http://www.goodreads.com/user/show/5877235-jamie", "userReview": "Funny and accurate, from the parts I'm familiar with. I'm not from a serious Belle area (South Louisiana) like Atlanta or Beaumont or something like that, but some of it still rings completely true."}, {"userName": "Mimielle LaFauve", "userReviewDate": "Jan 29, 2009", "userURL": "http://www.goodreads.com/user/show/1890644-mimielle-lafauve", "userReview": "If you do not already have a favie silver pattern or know not to put dark meat in your chx salad then you just might need this. I learned all this stuff at Grand-mama's knee...(smothers a hysterical giggle if you think it is important and serious=^^=)"}, {"userName": "Kristina", "userReviewDate": "Jul 29, 2011", "userURL": "http://www.goodreads.com/user/show/5343167-kristina", "userReview": "I had a lot of fun with this book It's funny and educational, some in a \"seriously?\" kind of way. It makes me very glad I didn't grow up in the rigid structure of Southern Society and that my Phi Sig sisters are delightfully diverse. My Grandmother's DAR status is quite enough, thank you."}, {"userName": "Rick Segers", "userReviewDate": "Jun 16, 2012", "userURL": "http://www.goodreads.com/user/show/3352473-rick-segers", "userReview": "A fun little book. If you like something like this on southern culture you would also like \"Having It Ya'll\". It seals with more than just southern bells. I enjoyed this book. The only negative was the edition I was reading had rose colored print on a pink background and it was quite hard to read."}, {"userName": "Jerry Wall", "userReviewDate": "Aug 07, 2016", "userURL": "http://www.goodreads.com/user/show/51527001-jerry-wall", "userReview": "quaint book about habits of southern belles. You need good silver, and a deviled egg plate as well as a good opinion of yourself.Slightly dated but still acknowledges correctly the three religions of the south -- Baptist, Methodist,and football (some might say nascar0"}, {"userName": "renie", "userReviewDate": "Apr 09, 2007", "userURL": "http://www.goodreads.com/user/show/52801-renie", "userReview": "No lie, there is a picture of my husband's Aunt Durden Moss in this book. And yes, she is wearing full length white kid gloves. Philip's grandmother, Margaret Moss, God rest her soul, definitely knew the secret to winning the Natchez, MS garden club wars as well."}, {"userName": "Emily Von pfahl", "userReviewDate": "Jul 07, 2006", "userURL": "http://www.goodreads.com/user/show/12318174-emily-von-pfahl", "userReview": "Southern women of all ages will laugh because everything in here is true, at least in part. If you are newly arrived to the South or have married a Southern, I recommend you pick this book up to understand some of our ways."}], "description": "The Southern belle lives on, in a world of proprieties and protocols that would shame the Royal Family (and have). An uproarious guide to the manners, mores, and mystique of the legendary ladies of the South. What The Official Preppy Handbook did for the madras-and-penny-loafer set, A Southern Belle Primer does for the indestructible ladies from below the Mason-Dixon line.", "title": "A Southern Belle Primer, Or Why Princess Margaret Will Never Be A Kappa Kappa Gamma", "url": "https://www.goodreads.com/book/show/269989.A_Southern_Belle_Primer_Or_Why_Princess_Margaret_Will_Never_Be_A_Kappa_Kappa_Gamma", "average": 3.99, "cover": "https://images.gr-assets.com/books/1386923972l/269989.jpg", "reviews": 65, "authors": [{"url": "https://www.goodreads.com/author/show/157490.Maryln_Schwartz", "name": "Maryln Schwartz"}], "type": ["Humor", "Nonfiction", "American", "Humor"], "outlinks": ["http://www.goodreads.com/book/show/269989.A_Southern_Belle_Primer_Or_Why_Princess_Margaret_Will_Never_Be_A_Kappa_Kappa_Gamma", "http://www.goodreads.com/book/show/279013.A_Southern_Belle_Primer", "http://www.goodreads.com/book/show/1691087.New_Times_In_The_Old_South", "http://www.goodreads.com/book/show/13313377-a-southern-bell-primer", "http://www.goodreads.com/book/show/13288042-new-times-in-the-old-south", "http://www.goodreads.com/book/show/13299760-what-is-this-world-coming-to", "http://www.goodreads.com/book/show/36393766-a-southern-belle-primer"]}