{"ratings": 1395, "userreviews": [{"userName": "Hannah", "userReviewDate": "Jan 28, 2017", "userURL": "http://www.goodreads.com/user/show/17442587-hannah", "userReview": "Beautiful story! Just as enjoyable as the first book, and not quite as painful to read. Kája is a vibrant character, so much so that I feel I could step back in time and recognize her in her secretarial work or her teaching. My one gripe is that Kája's suitor curses twice. Yes, he was provoked, but I was very disappointed to see that Cambron put in the actual word. Minus one star."}, {"userName": "Sarah Sundin", "userReviewDate": "Apr 10, 2015", "userURL": "http://www.goodreads.com/user/show/3186480-sarah-sundin", "userReview": "A Sparrow in Terezin takes you from the terror of London during the Blitz, to the horror of the concentration camps, to modern-day London and San Francisco. Kristy Cambron paints a touching picture of a woman trying to do the right thing in a time when evil prevailed, and the ripples her actions send into the future. Beautiful writing and heartbreaking imagery make the novel sing, proving Cambron’s acclaimed debut novel, The Butterfly and the Violin, was no fluke. I highly recommend this book."}, {"userName": "Rachel McMillan", "userReviewDate": "Dec 18, 2014", "userURL": "http://www.goodreads.com/user/show/2201736-rachel-mcmillan", "userReview": "There were moments of lyrical genius and snatches of a poetic sensibility showing that Cambron has honed her skill in her sophomore novel. As in the first, the underlining themes of art amidst the atrocities of the Second World War and Concentration camps (here, Terezin: the ghetto and labour camp in Prague) is well-met with the characters' crises of faith and trust in their Creator. As in Butterfly and the Violin, I found that the modern frame was disjointed; but Cambron is SO adept at winding a historical plot: coloured with hope and pathos and strewn with snippets of unbelievable smart snatches of history unique to the CBA. Thus, I will always seek her out.Kaja is well-met by a string of romance in British journalist Liam and while their attraction developed quickly---it did so strongly so I was eager to see how they played against each other in bomb-riddled London and then in the mire of central Holocaust. Cambron also surprised me with the character of Dane -- a nice companion piece to the work done by Kate Breslin in \"For Such a Time\" ( and I would recommend readers of one read the other for comparative experience). He was nothing if not a snatch of grace in the midst of horror. William and Sera are tried, in modern times, with a burgeoning marriage and more problems than they can handle, and their frame ties up nicely with hope and solidity.A great, fast-paced read that I flew through with expert historical cadence and heart-squeezing scenes :)"}, {"userName": "Cara Putman", "userReviewDate": "Mar 29, 2015", "userURL": "http://www.goodreads.com/user/show/674427-cara-putman", "userReview": "In the Sparrow of Terezin, Kristy Cambron has crafted a beautiful story of parallel journeys: a completely free-standing story set during World War II, and the other a continuation of the contemporary story in The Butterfly & the Violin. The pages move seamlessly from one story to the next, yet leaving me with a longing for more in each story. This makes the pages fly and makes it difficult to walk away from the story when real life intervenes.The historical characters are so real, their losses unimagineable, and the hope they find in the darkest of nights tangible. The historical story slips between Prague, London, and Terezin during the war. The journey is one of discovery, family, and war. It is a story of loss and saving.The contemporary story is one that will not cleanly stand alone. You could read it without first reading The Butterfly & the Violin but you will lose some of the deep meaning of the characters' battles. This said, it is a beautiful story that will compel you to follow Sera through the challenges and decisions she must make.The Sparrow of Terezin is a story that will embrace readers who love a mix of modern and historic, romance with emotion, beauty with an awareness that God sees every sparrow."}, {"userName": "m a r y l i z", "userReviewDate": "Aug 16, 2017", "userURL": "http://www.goodreads.com/user/show/56772107-m-a-r-y-l-i-z", "userReview": "Undeniably beautiful and horrible all at once. It's a story that needed to be told. It's about hope. Beauty. Trust. Courage. And about a God who's watching over us, even in the darkest places.4 stars!"}, {"userName": "Sarita", "userReviewDate": "Nov 13, 2016", "userURL": "http://www.goodreads.com/user/show/37168935-sarita", "userReview": "Kristy Cambron's writing is captivating and filled with emotion from page 1 of this story.Sera and William - it was great to catch up with these two and the challenge they faced was filled with emotion and except for the struggles newly weds had to face, there was another challenge Sera and Will had to face which could make or break a marriage. Some of the decisions they made had me frowning, but everything flowed together by the end of the book.Kaja and Liam - The WW2 story was interesting, filled with action, heartache, pain and hope. The children's story opened by eye to a different part of history I didn't know anything about. I loved the friendship between Kaia and Liam. I loved Dane's character - think back to WW2, I always think of the Germans as cold heartless men, but I know as with Dane, there was a lot of men who didn't agree with how the Jew's were treated and had compassion. Compassion and love for humanity spilled through Dane's character which was like the early sun rays on a cold morning in this story.The story of Hope and keeping hold of God came across strongly.There was one section which didn't seem to fit with my understanding - when Kaja's father made a reference to Christ - Jew's only believe and worship God, so the Christ reference were strange. I know Kaja's mother were Christian, so I guess, even though it was never told, that the family did believe in Christ and the salvation through him."}, {"userName": "Jesseca Wheaton", "userReviewDate": "Sep 07, 2015", "userURL": "http://www.goodreads.com/user/show/39986158-jesseca-wheaton", "userReview": "I started this book as soon as I finished the first one yesterday. Wow. It's been awhile since I got this caught up in a story. Kristy has a way of making you feel as though you're right there with the characters. I enjoyed this book even more then the first one (if that's even possible). I can't remember the last time I've laughed and then cried over a book like I did with \"A Sparrow in Terezin\". It has a simple, easy-to-relate-to feel, but at the same time there is the deeper meaning that the author has woven through out the story line.Seriously, I can't come up with adequate words to describe it. Heartbreaking, beautiful, raw, gentle. Those are a few words that come to mind. ;) It's one I'll read over and over again!"}, {"userName": "Alicia", "userReviewDate": "Mar 23, 2017", "userURL": "http://www.goodreads.com/user/show/11105817-alicia", "userReview": "On one hand I really liked it. On the other hand I didn't. Unlike The Butterfly and the Violin, I didn't feel like the past and present storylines connected very well. I also enjoyed the historical part much more than the contemporary part- in fact, I think that the former could have been its own book (since so much happened!). The WWII storyline: Kaja escapes her beloved Prague as the Nazis invade, moving to London (where she meets a charming reporter named Liam). When she discovers the truth of what is happening to Jews in Nazi-occupied countries, she returns back home to save her parents.It was a moving story, and I was in awe of how all the characters, who'd been through so much terror, managed to find beauty in life in so many ways. The story flowed well and was captivating. There were a few plot points that seemed rather unrealistic, but it proved to be a story to remind us to never forget. The present day storyline: William and Sera have just become husband and wife when William is arrested for an uncommitted crime. Sera searches for a way out by finding answers in her husband's family's secrets.I must admit, I was barely interested in this storyline. The plot seemed a bit muddled and overdramatic. I did like all the characters though.4 stars for the historical part and 2 stars for the contemporary part, so 3 stars overall."}, {"userName": "Brenda Hawley", "userReviewDate": "Apr 14, 2015", "userURL": "http://www.goodreads.com/user/show/6367469-brenda-hawley", "userReview": "I was very disappointed with this book. I am an avid reader of this genre and expected another spell binding experience but the more I read, the more of the plot seemed contrived and unrealistic. The modern day story had too much useless dialogue and the main character, Sera, seemed to whine most of the time. The second plot centered in 1942 when a Jewish girl who escaped the Nazis in Prague and ended up in London, decides to go back to rescue her parents from the Nazi war machine. First of all, Kaja seems totally ignorant of the enormity of the war in Europe and the ridiculousness of her expecting to cross Nazi controlled countries as a Jew to find her parents and then somehow get them out of the Nazi's hands. I have researched and read enough about what was going on during this time period to know that no one, except the Allied spies, were able to penetrate the continent, and then it was horrifically difficult to get downed fliers or agents out of Europe and back to England safely. She would have had an extremely difficult time just getting into Nazi territory from England let alone getting all the way to Prague without being caught. Next, her boyfriend just happens to meet her as she boards the train from London to the coast with papers and a uniform which recognizes her as a Red Cross worker. Together they manage to get into the Netherlands as part of the Red Cross (this was that easy??? The book seems to think so)and successfully make their way to Prague where she finds her parents still there and not already sent to a concentration camp as only a few of the Jews still left in the city. When the Nazis come early to round up her parents (she was supposed to have a day to get them to safety), she burns her Red Cross papers and uniform and goes with them to the camp, Terezin, where she experiences untold horrors and extreme cruelty. All of this was just too unrealistic for me to buy based on all of the reading and studying I have done about the conditions and difficulties in Nazi occupied Europe in 1942. I wanted to like this book.. I really tried but I kept shaking my head over and over again."}, {"userName": "Olivia", "userReviewDate": "Oct 04, 2016", "userURL": "http://www.goodreads.com/user/show/43582060-olivia", "userReview": "I want to cry because I love this book so much!As Sera and William battle issues at the start of their marriage, Kaja flees Prague as the Nazi's take over and she meets the dashing reporter Liam Marshall. Through the darkness they endeavor to find hope-not in what they can see-but in what God can.The writing was definitely improved from the last one and I felt that both timelines flowed better together. The emotions surrounding both stories pull at your heart and make you wish the book wouldn't end. The connections from the first book are really neat and loved that Sophie was in this one :)The romance was just right-a few kisses not detailed-and the Christianity felt stronger and more real. I loved with Kaja spoke with Sophie about Jesus' sacrifice on the cross. Amazing!I was impressed with Liam's character (speaking of which the author depicted British speech very, very well!), but when Dane was introduced I just thought \"Wow\"! And I love how the children in Terezin are described as sparrows. My emotions were skyrocketing at the end and it takes a lot for a book to do that to me!This ends happily, despite the sadness throughout the book. I highly recommend this and will no doubt grab a chance to read it many more times in the future! This is a book you won't regret reading. I bought it full price and don't mind in the least. It was worth it!"}, {"userName": "Anna", "userReviewDate": "Nov 14, 2015", "userURL": "http://www.goodreads.com/user/show/4438781-anna", "userReview": "Wow, I couldn't put it down, reading late into the night. Sera and William are celebrating their wedding day when William is arrested for fraud. Sera believes with all her heart that William is innocent. What their journey to prove that William had no role in the wrong doing is the unraveling of the story of Kaja. Kaja and her sister leave Prague before the Nazi's begin to round up the Jews. Her parents remain behind. Kaja's father is Jewish, but as a doctor hopes to use his skills to save the lives of he and his wife. Kaja ends up in London and lands a job at a newspaper. When she learns of the atrocities being committed, she knows she must try to locate and save her parents. The outcome finds her trapped in the ghetto Terezin. She is given the job of teaching the young children art and uses this to offer them hope. She calls them her little \"sparrows\", a euphemism for freedom from her childhood. My heart broke over Kaja's circumstances, and yet God's love is always present. What I have come to love about the Hidden Masterpiece Novels is the introduction of historical events of the Holocaust I knew nothing about."}, {"userName": "Nicole", "userReviewDate": "Apr 08, 2018", "userURL": "http://www.goodreads.com/user/show/7839064-nicole", "userReview": "I would rate the historical part of this book (Kaja's story) 5 stars, but overall went with 4.I've read other books that take place in the holocaust ghettos, and like those you can't walk away from this book and forget what you've seen in those streets. This story was bittersweet and powerful. And I can't leave a review without at least mentioning Dane. Uhhhgh... *cries, conflicted* Wow. Really good read."}, {"userName": "Alyssa", "userReviewDate": "Mar 30, 2015", "userURL": "http://www.goodreads.com/user/show/1586516-alyssa", "userReview": "Oh. My. Gosh. I don't even know how to put my feelings into words right now. This was quite an emotional roller coaster-- one I'll never forget and a story I've been so honoured to journey through alongside the characters. This dualogy has quickly become a favorite and has a permanent place in my bookcase. UPDATE 04/11/2015{About the Book}Two women, one in the present day and one in 1942, each hope for a brighter future. But they'll both have to battle through their darkest days to reach it.\"Today. \"With the grand opening of her new gallery and a fairytale wedding months away, Sera James appears to have a charmed life. But in an instant, the prospect of a devastating legal battle surrounding her fiance threatens to tear her dreams apart. Sera and William rush to marry and are thrust into a world of doubt and fear as they defend charges that could separate them for life.\"June 1942. \"After surviving the Blitz bombings that left many Londoners with shattered lives, Kaja Makovsky prayed for the war to end so she could return home to Prague. But despite the horrors of war, the gifted journalist never expected to see a headline screaming the extermination of Jews in work camps. Half-Jewish with her family in danger, Kaja has no choice but to risk everything to get her family out of Prague. But with the clutches of evil all around, her escape plan crumbles into deportation, and Kaja finds herself in a new reality as the art teacher to the children of Terezin.Bound by a story of hope and the survival of one little girl, both Sera and Kaja will fight to protect all they hold dear.{My Review}I was so impressed by Cambron's debut novel, The Butterfly and the Violin. I was completely absorbed in that story and after I finished I immediately wanted and needed the sequel. When it came time for the organization of the launch team for A Sparrow in Terezin I jumped at the opportunity. And when it came in the mail I may have done a happy dance and squealed. (Of course I did.) Unfortunately, I had other review books to read first but I started it as soon as I could.I started this book around noon and I never put it down! The story begins at Sera and William's wedding which they rushed towards due to pending legal issues for William. After the ceremony the Feds show up an officially arrest William on fraud charges. And Sera promises she will never give up on proving her husband's innocence. Sera even goes to London to see her husband's father. Sera even has a exciting secret she's keeping from William.A Sparrow in Terezin was another delightful read which also ended Sera and William's story and gave us Kaja's story. The latter was heart wrenching. If you love historical fiction and contemporary fiction this is the book for you. I'm also looking forward to Kristy's next works which are set in the Gilded Age."}, {"userName": "Staci", "userReviewDate": "Jul 27, 2014", "userURL": "http://www.goodreads.com/user/show/11909124-staci", "userReview": "Kristy Cambron has followed up her debut, The Butterfly and the Violin, with a beautifully written novel in A Sprarrow in Terezin.The story of Sera and William picks up where it left off and the action on the current day story was immediate.Kaja's story set during WWII was a bit slower to develop and I admit took me a bit to appreciate the background leading up to her time in Terezin. In hindsight, I do see the beauty of setting Kaja's back story to fully appreciate her as a character.The last 100 pages of the novel flew by as I kept turning to see what would happen next. There were other characters than Sera, William and Kaja that I enjoyed getting to know, but don't want to write a spoiler in my review.A Sparrow in Terezin is beautifully written. Kaja's story revealed to me the story of thousands of children impacted by Terezin.This novel is recommended for those who enjoy historical fiction, especially WWII novels."}, {"userName": "Cheri", "userReviewDate": "Jun 18, 2014", "userURL": "http://www.goodreads.com/user/show/1998770-cheri", "userReview": "Thanks NetGalley!If you haven't read the first book in this series The Butterfly and the Violin you really should read it first.I couldn't put this book down! This book has two stories-one is a modern day story and the other is a story set in WWII. Both stories will grip you from page one until you turn the last page and are sad that it had to end. I will be reading both books in this series again."}, {"userName": "Amanda", "userReviewDate": "Dec 31, 2016", "userURL": "http://www.goodreads.com/user/show/14077258-amanda", "userReview": "Absolutely beautifulIf I could rate this higher than 5, I would. It's such a beautiful fictional telling of terazin. I had tears in my eyes at the finish of the story."}, {"userName": "Julia Wilson", "userReviewDate": "Feb 10, 2015", "userURL": "http://www.goodreads.com/user/show/29770295-julia-wilson", "userReview": "A Sparrow In Terezin by Kristy Cambron is the second book in the Hidden Masterpiece series, and I was blessed to receive a copy. There are some books that you read, and then get on with your life, without so much as a backwards glance. The Sparrow In Terezin is not one of those books. This novel pierces your heart, and will remain with you long after the last page is read.A Sparrow In Terezin continues to follow Sera and William, who marry at the start of the novel. William is immediately accused of a crime he didn't commit. Sera is sure that William's estranged father, Thomas who lives in London will be able to help prove William's innocence. So why is William so reluctant to let Sera see Thomas? What is he hiding?As with book one, so William and Sera's story is interspersed with that of Kaja, who lived in Prague at the outbreak of the second world war. As the Nazis march into the city, so Kaja's father arranges for her and her sister Hannah to travel with Hannah's husband to Palestine. From here, Kaja finds herself in London two years later, and works as a journalist for The Telegraph. Here she meets journalist Liam who also does undercover work. The action continues throughout world war two.Once again Kristy Cambron has created realistic and likeable characters. Sera and Kaja are both strong, godly women with a tremendous sense of loyalty. They will drop everything to support or help their families.The action during the war years is hard at times, especially in Czechoslovakia. Kristy Cambron shows that even in the bleakest of times, there is always hope. When all around you are doing the wrong thing, there is still the opportunity to be brave and do the right thing. The reader is reminded that Christians can be seen as beacons of hope, shining in a dark world.Whilst I was reading, I was reminded of Jesus' words to 'take care of the widows and orphans', as Kaja has a huge heart for children. She will put herself at risk, to help them.As Christians, we are called to make a difference in the world. We need to be world changers, by helping one person at a time. This comes through clearly in the novel.I found that I got very involved in the story. Kristy Cambron writes so well that I found my emotions got completely caught up with the action in the novel. There were times, particularly in the war years, when tissues were definitely needed. Kristy Cambron writes with such a passion for people, particularly the plight of the innocent Jews in world war two, that one cannot fail to be moved to tears, and also anger at man's inhumanity to man.The overwhelming theme of the novel is loyalty - loyalty to families, loyalty to God, loyalty to principles. Sera stands by William. Kaja stands by her family, not just her own flesh and blood, but others who need her help.I found A Sparrow In Terezin an amazing novel. Kristy Cambron has a unique talent for writing parallel stories, linking people with issues that matter. As a historian I believe that no one must forget the evil done to the millions of innocent people in world war two. It is our duty to tell the next generation, and through Kristy Cambron's novels, keep alive the memory of a lost generation. I cannot get enough of Kristy Cambron, and I am hoping there will be a book number three in the series!"}, {"userName": "Erin ", "userReviewDate": "Dec 31, 2014", "userURL": "http://www.goodreads.com/user/show/2997696-erin", "userReview": "Find this and other reviews at: http://flashlightcommentary.blogspot....There's no point in denying it, I was excited about reading Kristy Cambron's A Sparrow in Terezin. I downloaded the book to my kindle the moment the publisher issued it for review and jumped in without a second of hesitation. Three pages later, I slammed on the breaks. Had I done my homework it wouldn't have been a problem, but I'd jumped the gun and learned the hard way that Cambron's Hidden Masterpiece series aren't written as standalones. I'd barely scratched the surface, but I was brutally aware I'd missed something huge, so I did a little digging and learned A Sparrow in Terezin is in fact, a sequel. I also realized I had an advanced reader's copy of its predecessor on hand, so like any other book addict, I had a good laugh at my own expense and picked up The Butterfly and the Violin with the same blind enthusiasm I'd given its successor.Things did not go well. Not well at all, but that's a story for another review. Suffice it to say skepticism replaced the eagerness I'd previously experienced and I was hesitant to pin my hopes on a second Cambron novel. Book in hand, I ultimately decided to proceed with caution, but I quickly discovered prudence had little effect on the end result. I found the conclusion of book one incredibly far-fetched and I was bitterly disappointed to see Cambron refashion her improbable resolution as the foundation of book two. William and Sera continued to bore me, but I enjoyed being reunited with Penny and found something to appreciate in Liam, Kaja and Dane. I liked the historic details of the 1939 storyline, but can't say I thought much of the present day drama. I've never been of fan of instant romantic attraction so I had a lot of difficulty with Kaja's love life and while I enjoyed the scope of her experience, I found much of it predictable. The nail in the coffin, however, was the same lack of balance I noted in the original story. Again, some readers appreciate this sort of handling, but I personally prefer inspired lit that displays faith and fiction in equal measure. When all is said and done, I like Cambron's command of language and while I think her religious messages have merit, I admit the heavy-handedness of her presentation doesn't sit well with me. To each their own, but I don't believe I'll be returning to this series or author any time soon."}, {"userName": "Emily", "userReviewDate": "Jul 16, 2015", "userURL": "http://www.goodreads.com/user/show/7443757-emily", "userReview": "SO GOOD!!! One problem: I was so wrapped up in Kaja's story of fleeing Prague during WWII, her relationship with Liam, and the horror and struggles of life in Terezin that I wasn't as interested in the present day story. But still ... another wonderful story by Kristy Cambron! I look forward to reading more of her work."}, {"userName": "Karen Collier", "userReviewDate": "Oct 01, 2014", "userURL": "http://www.goodreads.com/user/show/25860913-karen-collier", "userReview": "Kristy Cambron’s The Butterfly and the Violin (see my review) was one of my favorite reads of 2014. I was impressed by its beautiful portrayal of hope in the form of art amidst the horrors of war. I also loved the way the contemporary and historical storylines complemented each other. This second novel in the series follows in its predecessor’s footsteps, continuing William and Sera’s contemporary story, while introducing a new set of historical characters through which to portray hope in seemingly hopeless circumstances.I greatly admire this author’s writing style. The description, imagery, and symbolism found in both her books so far are simply gorgeous. So much so that I found myself highlighting one beautiful passage after another, intending to re-read and share. Let’s just say that there are far too many of these to share them all! You’ll just have to read the books.Well, okay. Here’s just one example from Chapter 28:“Collages dotted the room, hung on the wall with old tacks or pinned to lengths of twine draped along the back wall. Theirs was art fashioned from life in Terezin; the children’s expression made from old newsprint and label paper from old cans. They used what they had. Stretched where they could. And all the while, Kája tried to believe that she wasn’t feeding them false hope.”There’s a lot to love in this story. The characters are complex and engaging. The storylines and situations are compelling and emotionally charged. In fact, the only thing that bothered me about the storytelling was that I found myself skeptical of the reasoning behind a couple of decisions made by Kája in the historical storyline and William in the contemporary one. I can’t go into detail without risking spoilers, but let me hasten to say, I still enjoyed the story a great deal, and would not hesitate to recommend it, particularly to anyone who enjoyed The Butterfly and the Violin (which you really should read first).The romance between Liam and Kája is well written, and they seem quite well suited, but I have to admit that some of the scenes with Dane and Kája turned out to be among my favorites in the book. I also loved the scenes with Sophie in both the historical and contemporary storylines that centered on the cross, the clock tower, and the sparrows. There’s some beautiful symbolism and a touching message there.Thank you to the publisher for providing a complimentary electronic copy of the book via NetGalley for review purposes.This review appeared first on my blog at http://karencollier.com/book-review-a... where I review Christian fiction books and audiobooks."}, {"userName": "Jamie", "userReviewDate": "Apr 01, 2015", "userURL": "http://www.goodreads.com/user/show/8586696-jamie", "userReview": "What a story of hope, sacrifice and finding beauty in the darkest of places and times! Kristy Cambron’s sophomore novel, A Sparrow in Terezin, is another beautifully written tale, drawing you into two different times and eras, but connected through a child who survived the war. It’s not an easy story to read (stories surrounding WWII rarely are), but it’s 112% worth it!This history of what happened around the world during WWII, especially the horrific things done to Jewish families who crossed paths with the Nazis is a disturbing topic. Yet even in the midst of such horror, those brave souls who survived tell stories, not of darkness, but hope. The art of so many innocent children lost, the daring sacrifices people made to mess with the Nazis’ plans and save others…it shines light on a dark period in history.Kája’s tale of returning to her country is one of such courage, sacrifice and love of family. There are many heart breaking moments along the way, but through her life and her eyes, we catch a glimpse of true heroism. Plus I really enjoyed the friendship and relationship of her and Liam. He was fabulous friends! In our modern day story, I loved seeing Sera and William as a married couple. Dealing with deep wounds, it was refreshing to see a couple deal with issues while already married. It shows the mess within the beauty, the courage of daily choosing and what forgiveness looks like. While I enjoyed the historical setting a bit more (based on a personal preference and obsession with history), I liked coming back to Sera and William too!Right after I finished this book, without even realizing, I started singing this hymn (in case you’re wondering, I only sounds pretty to Jesus : ), one I haven’t thought of in years. Yet the way the book ended, with Kristy’s final notes, I’m not surprised my heart and soul thought of this song.Where have you seen beauty in the broken recently?(Thank you to Thomas Nelson and the author for a copy of the book in exchange for my honest review)Originally posted at http://booksandbeverages.org/2015/04/..."}, {"userName": "Lydia (Overweight Bookshelf)", "userReviewDate": "Apr 09, 2015", "userURL": "http://www.goodreads.com/user/show/4230224-lydia-overweight-bookshelf", "userReview": "Full review here: http://www.overweightbookshelf.com/20...What drives humanity back from the brink of despair and capitulation during histories darkest hours? Hope. Like a single ray of light permeating the darkness, hope illuminates even the deepest desperation. Kristy Cambron’s sophomore novel weaves a singular thread of hope through the lives of two women separated by time but connected through a Holocaust survivor.While I found Sera and William’s contemporary story to carry weight and heart, of the dual plots, it was Kája’s story that I yearned for. Her quiet resilience and heroism during Blitzkrieg in London to her return to Prague and eventual imprisonment at Terezin concentration camp gave me a sense of urgency to continue reading. With haunting descriptions and poetic imagery, Cambron takes readers back to a ghetto shrouded in misery where thousands of souls passed from this earth and fewer than 100 children survived its horrors or deportation. A Sparrow in Terezin will break your heart and then painstakingly put it back together with the hope beauty that rises from the ashes of broken dreams.**Disclosure: review copy provided by Litfuse Publicity**"}, {"userName": "Kate Breslin", "userReviewDate": "Jun 16, 2015", "userURL": "http://www.goodreads.com/user/show/8891389-kate-breslin", "userReview": "Kristy Cambron weaves a masterful tapestry of past and present in her novel, A Sparrow in Terezin. I thoroughly enjoyed reading this beautifully written tale of two women of faith, each from a different time and place, yet both seeking to recapture love through God’s healing grace. My heart was moved by lovely Sara, overshadowed with despair and uncertainty despite the sunny shores of modern-day San Francisco’s coast; and Kája, lonely and anxious amidst the frightening ambience of WWII Europe. Cambron’s detail to history is so well-researched and hauntingly accurate, this captivating story kept me turning the pages!"}, {"userName": "Schuyler", "userReviewDate": "Oct 22, 2015", "userURL": "http://www.goodreads.com/user/show/7481557-schuyler", "userReview": "Wow! Loved reading almost the entire thing in one day. I'm excited to review it soon! Kristy's work is beautiful as always!"}, {"userName": "Sara", "userReviewDate": "Jun 20, 2014", "userURL": "http://www.goodreads.com/user/show/22114100-sara", "userReview": "A wonderful book!!!"}, {"userName": "Joy C.", "userReviewDate": "Jan 06, 2015", "userURL": "http://www.goodreads.com/user/show/10371233-joy-c", "userReview": "What a beautiful, beautiful story! Oh my word, I am going to need some thought before plunging into a review. Suffice to say I loved it as much as \"The Butterfly and the Violin\". . . If not more! It was so good, so moving and heart-wrenchingly sad. There were a few flaws, I felt, in the way Cambron would sometimes reveal big information in a narrative style and tell us what happened, or rush through in between details instead of showing us what actually happened especially regarding the historical storyline with Kaja (or even Adelle) that left me impatient and wanting to know more - that is the one real flaw I felt to this book, as well as \"Butterfly and the Violin\". But the prose, on the other-hand, the stylistic style Cambron writes with, and weaves through her stories, with all the description and lyrical beauty of an artist, is just lovely and a joy to behold! Sometimes I just wanted to gather up her beautiful words up like diamonds! In regards to the romance, it was written sweetly, but quite ahem. . . romantically, and I did not exactly fancy reading the kissing parts, (It is appropriately written, and better than other Christian romance novels I have read. . . still, I can't say that it was something I really preferred reading when it got too mushy.) thankfully, the romances of \"The Hidden Masterpieces\" series, while being a sweet and vital part of the two books, never overwhelm the themes or character-arcs of the story. Comparing the two-war-time stories themselves I think I love \"The Butterfly and the Violin\" just a bit more - I loved Adele and Vladimer's story! It was so sweet, beautiful and moving, and also I loved their romance more - old-fashioned, tender and sweet all the way! But while I really didn't enjoy the contemporary story-line with Sera, Penny and William in the first book (too contemporary-ish for my tastes!), Sera and Will's story and their characters, in particular, improve vastly in \"A Sparrow of Terezin\". While I couldn't enjoy all the conflicts and tensions, the character development was great, and the chapters quite exciting! It does not remove the fact that William and Sera have all the modern American characteristics and lifestyle views on romance, marriage, relationships and . . . Stuff! well, it just bugs me, that's all. (I will say also that I still am a little confused by William's legal charges. . . Quite confusing!)But let us dig into the truly special part of this story, and why I loved \"A Sparrow in Terezin\" so much, shall we? I loved treading the history of the 1940s, the horror of the holocaust, and the setting of Europe during the War (including the London Blitz - one of my favourite parts!). . not to mention the hope-and-faith filled themes. And Kaja and Liam <3. Oh dear! Those two tore at my heartstrings so much. I couldn't help but loving their characters, their struggles and tears and joys. The fact that Kaja (I honestly like her full name Katerina more, don't you?) is a half-Jewish Christian from Prague, who loves her country and her dear parents, and has a deeply compassionate heart, despite her fears and struggles. The little things like the mention of poppies; the clock and the sparrow and the lesson her father told her as a child about God and time; her love of art and Dickens :)). She is so brave and self-sacrificing! I loved her so much.Oh, and there is Liam Marshell. For a while, I could not place whether his character would fall under the trope of stereotypical, handsome, charming love-interest with a dirty secret that would bore me out (aka something like William.) but really quite from the start, I knew and hoped he would be better than that, more noble, quirky, interesting and honourable than that. So glad my hopes were fulfilled! I loved Liam's character - everything from those glasses, and the awkward way of making himself mysterious to Kaja, to his English sense of \"the upper lip\", and the way he looked out for Kaja always and protected her! (Except the kissing part. . . no, sorry, Liam, you don't kiss a girl while all hell's broken loose and bombs are falling right all around you in London!) :P. This maybe something of a spoiler, but I have to say it. . . Bit once Kaja makes her \"big decision\" in the novel which involves the Red Cross, held some of my absolute favourite moments between the two of them. . . like. . . \"And if you don't meet me two weeks from now--\"\"I will.\"\"But if you don't,\" he said, and leaned in to stare her directly in the eyes. The lines in his face tensed on a serious whisper. \"The whole of the German army won't be able to hold me back. So help me, Kaja, I'll come in after you.\" (Pg. 180):D <3 The hardest and most painful part of this book, is also the most beautiful. Namely, the war. . . the history. . . The story of the camps in Terezin, the grief of the Jews, of Kaja's parents in Prague, and the heartache of the thousands and millions of Jews (old men, women and little beloved children!) being murdered and hounded to their deaths. I loved learning more about this historical aspect of the war, how Terezin was one of those \"in-between\" concentration camps where if they were transferred they'd be taken to the death camps. . . and the idea of the Nazis making it appear as a \"model\" camp, and the heartbreaking facade that it was. And the story of those children, with their art drawings, in those camps, and how Kaja gave them a hope, in the horror of what they suffered, in God. \"Not one sparrow falls to the ground . . . \" The ending was truly a beautiful close to the story, and moved me deeply! I teared up a little I think, by the end. . . it was heartbreaking. (Like just thinking of Dane makes me want to cry!) and yet healing and bittersweet too. It is sad that there are going to be no more books in the series, but I definitely appreciated the time I spent in both \"Masterpiece\" books, and may even wish to re-read them in the future. Kristy Cambron is one modern author in the Christian fiction marketplace I am so glad to have discovered!"}, {"userName": "Linda Klager", "userReviewDate": "May 08, 2018", "userURL": "http://www.goodreads.com/user/show/30001467-linda-klager", "userReview": "Who has courage enough to be able to encourage others while in a concentration camp? I am not sure many people would have the strength to lift up others in such dire circumstances. Kaja was such a sweet and caring soul. She loved her parents so much that she gave up her sweetheart and the life they would live to face the dangers of going into a camp to try and rescue her parents.What a terrible time in the history of the world when the Jewish people were hated so much that many of them were murdered. This book showed that in these terrible times even there were small glimpses of hope.I like stories of strong women of faith. This was a great read. It would be good to read the book \"The Butterfly and The Violin\" first before reading \"A Sparrow In Terezin\"."}, {"userName": "Rachel", "userReviewDate": "Jan 25, 2018", "userURL": "http://www.goodreads.com/user/show/33731734-rachel", "userReview": "I am apparently a glutton for punishment and decide to read all the books that will rip out my heart and stomp on it back to back. Story SHOULD move you though. As you read the words of the author's heart poured out on the page...If you finish unchanged...What was the point? These characters, these stories, may be fictional, but they represent many people who had to live through one of the darkest times in history. Ask yourself, what can we learn from them? What are they trying to tell us? Fiction CAN and WILL challenge you to grow, to learn, to thrive...Multiple times I wanted to cry (and there were times tears escaped) while listening to this story. Knowing that the horrors depicted in this book were lived out in reality during WWII. Kristy Cambron...I tip my hat to you...You have found BEAUTY in the ashes of a history that is riddled with sorrow and death. You have brought redemption to life on the page. You have spoken TRUTH and LIFE and LOVE into the hearts of any who lay a hand on your books. But none more so than this one*. Thank you. A Sparrow in Terezin truly is a masterpiece.*Revision: And The Lost CastleI won a print copy of this book from the author. This review is based on the audio version which I borrowed from my public library. I was not required to write a positive review. All opinions expressed are mine alone."}, {"userName": "Carole Jarvis", "userReviewDate": "Nov 24, 2014", "userURL": "http://www.goodreads.com/user/show/2054668-carole-jarvis", "userReview": "Reviewed at The Power of Words: http://tinyurl.com/knsnpmyKristy Cambron is an author whose writing not only entertains, but makes me feel. After reading The Butterfly and the Violin and A Sparrow in Terezin, these are just a few of the qualities that I've come to associate with Kristy's writing: humanity in the midst of the most horrific inhumanity . . . historical and character authenticity . . . haunting imagery . . . agape love . . . raw and honest emotion . . . heartfelt romance . . . God working through seemingly hopeless situations.One thing that especially touches me is how Kristy focuses on some aspects of WWII that aren't all that familiar and shows how the arts were used to inspire hope in the darkest of places. In The Butterfly and the Violin, it was Adele having to play her violin in the Women's Orchestra of Auschwitz for those walking to the gas chambers. And in A Sparrow in Terezin, it's Kája discovering her hidden potential as she teaches art to the children of Terezin. Kristy also runs a connected contemporary storyline along with the historical, showing how important legacies can be. I think it is these two factors that makes both novels capture my heart - stories that I might not have read otherwise because of their Holocaust theme.I enjoyed Will and Sera's story from the previous book and it was great to continue on with their marriage, seeing how they dealt with issues many of us face - fear of rejection, the need for total honesty, and the importance of trust. As for Kája and Liam - what great characters! Sometimes it's not until we face a pressure-filled situation that we find out what we're capable of, with God's help, and that is the case with Kája. I was riveted to their story and their tender, emotional romance is one of my all-time favorites.Vivid imagery is one of Kristy's strengths, as shown in this poignant description of the people of Terezin, seen through Kája's eyes: \"Those interned in the little city were somber, their expressions vacant. The old and feeble perched on benches, sitting like lost birds without a tree. Others walked about as dirt-covered ghosts, haunting the streets, their expressions of despair the most vivid thing about them.\"While the Holocaust represents some of the worst evil of which man is capable of inflicting on another human being, we know not only that God never leaves or forsakes us, but that He works through those who are completely surrendered to Him. From the beauty of the Prague clock tower and the spiritual message of hope that it inspired in Kája, to a glimpse of God seen through the humane acts of an SS officer, God's timing and involvement in our lives is a central theme, as shown in Kája 's words to Liam: \"My father used to say that all of time is set to a clock - God's clock. We're given so much of it from sunrise to sunset each day. And it's in God's will that time continues to move. He watches over all of us, wherever we should go. . . . And especially when fear overrides our feeling of safety.\"The imagery of sparrows always makes me think of God's tender care, and even Jesus used them as a visual in Matthew 10:29: \". . . not one of them will fall to the ground outside your Father’s care.\" A Sparrow in Terezin is a beautifully moving story, one that I highly recommend.Thank you to Kristy Cambron and Litfuse Publicity for providing a copy of this book in exchange for my honest review."}, {"userName": "Wanda", "userReviewDate": "Jan 15, 2015", "userURL": "http://www.goodreads.com/user/show/12836621-wanda", "userReview": "The marriage of William and Sera is hindered by William's past. He is being charged of felony grand theft and forgery, and is facing prison time for crimes he didn’t commit. But Sera is determined to face the humiliation because she trusts her husband, and believes in his innocence. Kaja fled Nazi-occupied Prague in March of 1939, leaving her half Jewish parents behind, with a promise from them that they would be on the next train. Kaja’s parents had sent her away because things had begun to turn bad in Prague, but they had no way of knowing that their daughter was now in the most dangerous place in the world. War had chased her to an ARP Shelter in the heart of London – she was living in the Blitz, caught up in another nightmare. Kaja read that the Nazis were killing Jews, rounding them up and sending them away where many of them were never heard from again. The camps in the East were killing centers where the Jews, along with women and children, were murdered with bullets and by gas. Kaja makes the decision to return to Prague to rescue her parents. Liam Marshall, a reporter assigned to the war beat, meets Kaja in London, and is immediately attracted to her. A romance soon blossoms between them. Liam knew there was no way of stopping Kaja from returning to Prague. He understood Kaja’s heart and used his connections to help her in her quest. Kaja was a woman of incredible will, and astounding courage, who was about to embark on a harrowing journey of great sadness. And the story unfolds as Kaja returns to Prague and ends up in Terezin, a halfway point – a holding pen for Jews that was a combined ghetto and concentration camp. Between 1942 – 1944 more than 15,000 children passed through Terezin, living in horrific conditions, while they awaited to be transported from the ghettos to one of the Nazi killing centers. The author cleverly weaves together two storylines that are compelling and beautifully written. The characters are strong and unique, and the engrossing story that takes place during WWII is vividly described – quite captivating. A slight negative comment – I couldn’t become fully engaged with the story of William and Sera, and I did read the first book in the series, The Butterfly and the Violin. My rating is 4.5 stars.Prepare to lose yourself in this thrilling novel, beautifully crafted, by an extraordinary author.I received a complimentary copy of this book from BookLook Bloggers in exchange for an honest review."}], "description": "Bound together across time, two women will discover a powerful connection through one survivor's story of hope in the darkest days of a war-torn world.Present Day: With the grand opening of her new art gallery and a fairy tale wedding just around the corner, Sera James feels like she's stumbled into a charmed life until a brutal legal battle against fiance William Hanover threatens to destroy their future before it even begins.Now, after an eleventh-hour wedding ceremony and a callous arrest, William faces a decade in prison for a crime he never committed, and Sera must battle the scathing accusations that threaten her family and any hope for a future with the man she loves.1942: Kaja Makovsky narrowly escaped Nazi-occupied Prague in 1939 and was forced to leave behind her half-Jewish family. Now a reporter for The Daily Telegraph in England, Kaja discovers the terror has followed her across the Channel in the shadowy form of the London Blitz. When she learns Jews are being exterminated by the thousands on the continent, she has no choice but to return to her mother city, risking her life to smuggle her family to freedom and peace.Connecting across a century through one little girl, a Holocaust survivor with a foot in each world, these two women will discover a kinship that springs even in the darkest of times. In this tale of hope and survival, Sera and Kaja must cling to the faith that sustains them and fight to protect all they hold dear even if it means placing their own futures on the line.", "title": "A Sparrow in Terezin\n      \n          (Hidden Masterpiece #2)", "url": "http://www.goodreads.com/book/show/22578264-a-sparrow-in-terezin", "average": 4.24, "cover": "https://images.gr-assets.com/books/1404475923l/22578264.jpg", "reviews": 304, "authors": [{"url": "https://www.goodreads.com/author/show/7271055.Kristy_Cambron", "name": "Kristy Cambron"}], "type": ["Historical", "Christian Fiction", "Fiction", "Historical", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/22578264-a-sparrow-in-terezin", "http://www.goodreads.com/book/show/24426926-a-sparrow-in-terezin", "http://www.goodreads.com/book/show/26383310-a-sparrow-in-terezin", "http://www.goodreads.com/book/show/18850688-the-butterfly-and-the-violin", "http://www.goodreads.com/book/show/25884871-the-ringmaster-s-wife", "http://www.goodreads.com/book/show/29737083-the-illusionist-s-apprentice", "http://www.goodreads.com/book/show/35554148-the-lost-castle", "http://www.goodreads.com/book/show/25561613-the-hidden-masterpiece-collection", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}