{"ratings": 10144, "userreviews": [{"userName": "Dan Schwent", "userReviewDate": "Feb 06, 2008", "userURL": "http://www.goodreads.com/user/show/870755-dan-schwent", "userReview": "When Tom Wallace's brother-in-law hypnotizes him at a party, he inadvertently wakens something in Tom. Now, Tom sees the ghost of a woman in a black dress and can sense peoples' thoughts. But who is the woman in the black dress...?Sometime in that half-forgotten time before Goodreads, I went on a Richard Matheson binge and this is one of the books I read. I thought I'd unloaded it at the local used bookstore years ago but I stumbled upon it in my basement while looking for something else. Since I'd forgotten most of it in the eons since I originally read it, it was like a whole new book.A Stir of Echoes is a ghost story but it's also about the secrets people keep hidden from one another. Tom Wallace lives in a neighborhood in the suburbs with a wife, a baby, and another baby on the way. When he suddenly becomes a medium, things slowly go pear-shaped.It's a fairly creepy tale, told in Richard Matheson's all meat, no filler style. Imagine waking up in the middle of the night to find a ghost in your house. Still, the biggest horrors are his neighbors and what they're capable of. I had a vague idea of how things went down but the twists still caught me off guard. As always, Matheson's prose is as smooth as bar of soap and just as slippery. A Stir of Echoes was really hard to put down, even on the second read. One of these days, I'll have to watch the Kevin Bacon movie. Four out of five stars."}, {"userName": "Delee", "userReviewDate": "Jan 29, 2014", "userURL": "http://www.goodreads.com/user/show/6168268-delee", "userReview": "I want you to pretend you're in a theater, an enormous theater. You're sitting near the front....It is completely black inside. the walls are dark velvet, the floors are covered with dark velvet rugs. It's black inside, absolutely black...Except for one thing. In the whooooole pitch-black theater there's only one thing you can see. The letters on the screen. S-L-E-E-P. You're very comfortable. Veeeery comfortable. You are just sitting there and looking at the screen, looking, loooooking at that single word. Sleep...sleep...sleeeeeeep...The story takes place in Hawthorne California in the 1950s. Tom Wallace is living in a rented house with his pregnant wife -Anne- and his son- Richard. Things are going pretty smoothly until the day his brother-in-law -Phil- visits, and the three adults go over to a neighbor's house for a little get together. After a few drinks the topic turns to hypnotism- and after some gentle ribbing- Phil convinces Tom to be his subject. What was supposed to be just party trick- turns dark and frightening when Tom starts to have visions of a strange women in his house- and that is just the beginning...A STIR OF ECHOES is my first experience with a Richard Matheson novel. And all I kept saying to myself was -why I hadn't read him before!!? I would have given this 5-stars if not for one teeny tiny little issue I had with what I will call \"The Scooby-Doo\" ending- where the killer explains in great length the reason for the murder and the way they went about it...Other than that it was a perfect, creepy, hair-raising read!"}, {"userName": "Bill  Kerwin", "userReviewDate": "Aug 21, 2009", "userURL": "http://www.goodreads.com/user/show/83582-bill-kerwin", "userReview": "An enjoyable novel about a man hypnotized at a party who then begins to exhibit psychic powers--including the recurrent appearances of a woman who may or may not be a ghost. Matheson--author of I am Legend, numerous classic creepy short stories and many of the best Twilight Zone episodes--has written better things, but this still kept my interest. I am a fan of the movie with Kevin Bacon, and was surprised by how much different the atmosphere and setting is in this, the original. The movie is set in a gritty working class Chicago neighborhood in the '90's, among average Joes skeptical of psychic abilities; the novel is set in the '50's in a tract of post-war prefab housing that in spite of its blandness, newness and all American wholesomeness still provides a home for viciousness and a few dark secrets. I think this would have made a very good novella. Even at a mere 200 pages--it is a little too long."}, {"userName": "Lyn", "userReviewDate": "Dec 13, 2011", "userURL": "http://www.goodreads.com/user/show/5253785-lyn", "userReview": "Richard Matheson has quickly become one of my favorites, he is a master of his genre. This is about psychic powers and telepathy and all rolled up into a classic ghost story. Published in 1958, it is refreshing to read a minimalistic work in an age of sensationalism and graphic detail. It is obvious how influential he has been to generations of writers after him, I think Stephen King must have put this book down and kept it close before writing The Dead Zone."}, {"userName": "Trudi", "userReviewDate": "Dec 30, 2011", "userURL": "http://www.goodreads.com/user/show/1416912-trudi", "userReview": "Richard Matheson (1926 - 2013)Thanks for the stories.Before I say anything about this classic bit of horror, I want to put a plug in for the film adaptation. Stir of Echoes starring Kevin Bacon is a truly terrifying ghost story. I always felt it didn't get the attention it deserved because The Sixth Sense was released earlier the same year and stole all the thunder (for the record, I think Stir of Echoes is the better movie). If you haven't seen it I highly recommend that you do. You won't even spoil Matheson's novel because the movie takes a very different approach to the story and the mystery.Now with that out of the way on to the book! The more Richard Matheson I read, the more I understand why Stephen King touts him as his biggest influence. Twenty years before King ever started writing about small towns and all the ugly things small town residents can get up to, Matheson was writing about horror in the suburbs. He takes the familiar, safe, boring 'burbs and all the white, middle-class people who abide there and introduces monsters. Sometimes the monsters are purely psychological, sometimes ghostly, other times it is an affliction (as with Scott Carey in The Incredible Shrinking Man or Robert Neville in I am Legend). Whatever \"the monster\", what you really get as a reader is some pretty keen insight into human behavior. And sometimes it can be a lot uncomfortable to read. People can think pretty ugly, and act even uglier. Tom Wallace is your \"every man\", your average middle class schmoe attempting to live out the American Dream with his young wife and son. Tom's life takes a turn for the bizarre when he jokingly allows his brother-in-law to hypnotize him. Suddenly Tom's mind is wide open and he begins to \"know\" things and see things, a forbidden knowledge that throws his life into chaos. This is a simple story, but it packs a lot of punch. It is a ghost story and a mystery and a peek into 1950's human psychology. It's interesting to read just how the husbands and wives relate to one another in this novel; it becomes quickly apparent that not only is the story set during that time, but that the author is also writing from a pre-Women's Lib perspective. This gives the novel an authentic old-fashioned feel that works extremely well given the subject matter. I loved it. One note about the reader -- he is fantastic, and I think contributed a lot to my overall enjoyment of the story. He has this wicked bass voice and when he whispers it will give you chills."}, {"userName": "Maciek", "userReviewDate": "Mar 13, 2012", "userURL": "http://www.goodreads.com/user/show/2969647-maciek", "userReview": "First publishes in 1958, A Stir of Echoes is Richard Matheson's third major work, the first two being the classic I Am Legend which guaranteed his literary immmortality, and The Incredible Shrinking Man, the classic horror novel with a man racing against literally increasing odds.The basic plot crux is very simple and the storyline doesn't deviate much from it: Tom Wallace agrees to undergo a hypnosis, as he believes he won't be affected by it. As it usually turns out in novels of the uncanny things don't exactly go the easy way out, and Tom notices that his life has changed. He realizes that he is able to read the thoughts of people around him, and has strange visions of a woman in a black dress in his house. He finds that his abilities are not always welcome, and as his sense of isolation progresses so does the mystery that he is trying to solve.What is notable about A Stir of Echoes is that apart from the technological gadgets like the cellphone or the computer the novel doesn't feel at all dated. Matheson writes in a language which is simple and clear, and the sense of Tom's growing sense of isolation and disturbance is well rendered. Short in lenght with 0% filler, the novel can be read at one or two sittings with the tension steadily developing until a surprising ending. However, the fact that it was published after two of Matheson's most influential novels makes it seem pale in comparison; along with the fact that he later wrote masterful short stories and adapted some of them as scripts for the original >i>Twilight Zone, and has written novels such as Somewhere in Time and What Dreams May Come, both adapted into well known films. A Stir of Echoes is not a bad novel, but it's not exceptional either; it should serve as a good way to spend an afternoon or two, but it's hardly to be a lifechanging experience."}, {"userName": "Mark", "userReviewDate": "Jul 03, 2013", "userURL": "http://www.goodreads.com/user/show/3470857-mark", "userReview": "Dammit, Matheson, what the hell was that?? That has to be one of the all-time worst cop-out endings. You're better than that, man. See, Matheson and I have history. This is the first novel of his I've read, but still, we have history. Matheson was my very first favorite author. And he was without my even knowing it. I grew up on Twilight Zone, the repeats and the 80s movie and redo, and my Mom, goodness love her, was cool enough to say, \"You would love this,\" when I was no more than six. We watched the Twilight Zone movie and the scenario that stood out most was, of course, the thing on the wing of the plane. Only much, much later did I find this was a redo of a classic episode of the original TZ. Damned thing gave me nightmares for years. But such delicious nightmares. Few things can compare with a good chill down your spine. And then, a few years later, Mom says, \"Oh, they're going to replay Duel. You have to see that one, you'd love it!\" We watched, and damned if I didn't sit there, rapt. Still one of the most awesome things I've ever seen. And who did I find while reading I Am Legend in the early 2000s wrote all these kick ass stories? One Richard Matheson. I've since read as many short stories as I could get my hands on, strangely avoiding his novels (Legend is more a novella than a novel). Til this one. One of the neatest things about Richard Matheson (at least in his short work) is how no-nonsense his writing is. He's like Hemingway or the hardboiled mystery writers of the 1930s. He writes in super-streamlined sentences that bang-poing right to the center of your mind. You can read two sentences from him and you're in the story. The scene is set, the movie's rolling in your mind. The other neat thing about him is the way he successfully mingles the supernatural and the commonplace. He's kind of like John Cheever in that, with a lil more sci-fi leaning. He has this story, one included in the back of the Tor edition of I Am Legend, called \"Dress of White Silk\" that is one of the most unsettling things I've ever read. It loses none of it's quiet intensity after several rereadings. I think I avoided his novels for so long, afraid they would never be able to live up to his short work. And in a way, judging by this one, anyway, they can't. The biggest problem with A Stir of Echoes is that chapters, say, four through thirteen could be compacted into two chapters. Three max. There was so much wishy-washy decision making from the characters that not only did it feel disingenuous, it slowed the pace of the story to zero. Everything that happened in these chapters was like one step forward, one step back. You remained planted right where you were. This is very unlike Matheson's short work. Sometimes, you have to read his short stories twice just to figure out what the hell happened. He has a screenwriter's eye for scene and moves along at breakneck speed. For some people, this may be too thin; but I tend to love it. Too much detail and I tend to lose the forest for the trees. Finally, finally, things pick up, and then it's like the Matheson I know and love. From that point on, it's the usual rocket ride. But what the fck was that ending, man?? It's like you forgot what the actual problem was. The problem wasn't D. It was all the way back at A. Yes, yes, you did give us a little mumble about how it could possibly be solved. BUT, then you went and solved D in full detail when D needed nothing more than a hint. It was obvious, man. But A. Fifty years later and Problem A is still dangling, waiting to have some sense of closure. I like, heck, love, open-ended stories, ambiguous endings, but you clean forgot what your problem to be solved was. And, since we're talking about uncharacteristic qualities in your work, what was all the cutesy baby names you had the characters call each other? That doesn't happen in your short stories. It sounded phoney as hell and was almost enough to make one gag. Still, there were elements here where I knew it was you. The wise-cracking, though now terrifically dated, was humorous, in an antiquated way, of course. And the characters, when not baby-talking and making the same stupid decisions over and over, were real and (mostly) believable. But this is not the one you'd want to put on your resume as the first offering to prospective fans. Short stories, man. That's where you rocked."}, {"userName": "Carmine", "userReviewDate": "Oct 27, 2017", "userURL": "http://www.goodreads.com/user/show/43396096-carmine", "userReview": "Il sorriso dell'apparenza Soleggiata e ridente questa Tulley Street, classico quartiere di una medio-borghesia accogliente con i propri dirimpettai, prodiga nel mantenere verde il giardino e ingenuamente innocua quando scappano le due birrette il venerdì sera.L'ignoranza diventa salvifica per la nostra incolumità; le menzogne raccontante a noi e gli altri un indispensabile compromesso - questo è quello che ci ripetiamo ogni giorno - per sopravvivere.Perché dovremmo vivere con degli specchi in casa, quando non vedere è molto meglio?"}, {"userName": "Shorty", "userReviewDate": "Jul 06, 2016", "userURL": "http://www.goodreads.com/user/show/3347032-shorty", "userReview": "Brilliantly done. Quite a bit different from the amazing movie, with Kevin Bacon. Still, completely enjoyable, as it is a solid murder mystery with supernatural overtones that fair very well, even though it was written originally in 1958. The audiobook was narrated very, very well by Scott Brick."}, {"userName": "Becky", "userReviewDate": "Jul 29, 2008", "userURL": "http://www.goodreads.com/user/show/1376766-becky", "userReview": "I love reading Richard Matheson's stories. Even if the story itself isn't quite to my taste, and not everything he writes is, the writing is so enjoyable to read. I don't know what it is about it that makes it so, but it's just so accessible and straightforward and unassuming, and it just hooks me right from the start. I love it. I've seen the movie based on this book, before I knew it was a book, and before I'd ever read anything of Matheson's, and I enjoyed the movie. That's really the best way to do it, because it allows me to enjoy both versions independently for what they are. The movie is... pretty far removed from the story in the book. Other than the hypnotism catalyst and the ghost-story mystery, there's not very much similarity between them. But maybe that's for the best, because I was quite surprised by the direction the book took, and enjoyed it quite a lot. I really like the deeper line of thought and questioning that runs through this book. This is a short book, but inside is some interesting stuff that pertains to consciousness and higher consciousness and the like. I like Matheson's theories on things, although I don't usually agree with them. But at least he reasons things out and provides something to think about. That I will most definitely give him credit for. The mystery aspect of this book was a good one. I thought I had it all figured out and I didn't. I love when a mystery keeps me on my toes. Anyway, I would definitely recommend this one for any fan of paranormal mysteries... I mean paranormal in the broadest sense here, as there are no vampires (sparkly or otherwise), werewolves, or anything, but it is outside the realm of the strictly mundane world. Horror October 2011: #1 (Ok, a little early, but who's counting?)"}, {"userName": "Jason Parent", "userReviewDate": "Jul 15, 2013", "userURL": "http://www.goodreads.com/user/show/11708867-jason-parent", "userReview": "This is one of my faves. Thinking about a re-read."}, {"userName": "Sandy", "userReviewDate": "Dec 16, 2015", "userURL": "http://www.goodreads.com/user/show/6043535-sandy", "userReview": "Richard Matheson is an author who never seems to let me down. The first two novels that I read by the man, \"I Am Legend\" (1954) and \"The Shrinking Man\" (1956), are superb and highly original sci-fi creations, and both have been memorably filmed. (I seem to be in the distinct minority in preferring the 1964 U.S.-Italian coproduction \"The Last Man on Earth,\" starring Vincent Price, over 1971's \"The Omega Man,\" featuring Charlton Heston, although neither quite does justice to the \"I Am Legend\" original. \"The Incredible Shrinking Man,\" of course, filmed in 1957 with Matheson's screenplay and starring Grant Williams, is one of the finest science fiction outings of the '50s.)And then there was \"Hell House,\" a Matheson horror novel from 1971 that was one of the scariest books I have ever read; Matheson scripted the screenplay for 1973's \"The Legend of Hell House\" and turned it into one of the scariest movies you could EVER hope to find. And I have yet to mention any number of gripping shorter pieces that I'd read by Matheson over the years; 1953's \"Slaughter House\" is a particularly fine example, and almost a warm-up for \"Hell House.\" Given this faultless track record, I was thus particularly keen on reading Matheson's first out-and-out supernatural thriller, \"A Stir of Echoes,\" especially after noticing a highly laudatory review of same in Newman & Jones' excellent overview volume \"Horror: Another 100 Best Books.\" Originally released in 1958, when the New Jersey-born author was 32, his 5th novel has turned out to be, for this reader, still another winning creation.In \"A Stir of Echoes,\" the reader encounters Tom Wallace, a 27-year-old aircraft-plant employee who lives in a SoCal suburb with his pregnant wife, Anne, and their young son. The Wallaces' tranquil existence is given an upending one evening when Tom allows himself to be hypnotized by his brother-in-law at a neighbor's house party. The hypnotism is a successful party treat, but Tom immediately begins to suffer after-effects. In the days to come, he develops some truly uncanny abilities. He is able to see into his female neighbor's lustful, rutting mind; sense from afar when his wife has been injured; divine the criminal intentions in the babysitter's unhinged noggin; tell the sex of his unborn child; anticipate the death of an in-law, a ghastly nearby train wreck, and a neighborhood shooting; and perform \"automatic writing.\" He also begins to develop psychometry (the ability to touch an object and learn things about its owner). But perhaps worst of all, Tom now begins to see, practically every night, the spectral image of a beseeching woman, seemingly coming from beyond the grave....\"A Stir of Echoes\" is a simply written book, told in what Matheson has described in interviews as a \"less is more\" manner. It is absolutely unputdownable also, I might add; I zipped through this one in record time. The book is one of gradually escalating suspense, culminating with a very neat, double-twist ending and one sweet coda. The Wallaces make for a charming couple, and the reader is disturbed to see how Tom's newly acquired abilities go far in tearing their marriage apart. Matheson also excels in rendering expertly written, realistic dialogue--I’ve rarely read better--and this emphasis on realism makes the more supernatural elements go down all the easier. Writing of the book in the Jones & Newman volume, author Ed Gorman tells us that because Tom is so credible a character, \"the reader accepts without question the only unrealistic elements of the book--the paranormal scenes.\" Very true. But Matheson also adds other hyperrealistic touches to make us buy into the central conceit. The Lighthouse jazz club in Hermosa Beach where the Wallaces go on date night...it's been there since 1949, and exists to this day. The Hawthorne street in Inglewood, near where the Wallaces live...yes, it's there, as well. And to put the icing on the already realistic cake, Matheson gives us a fairly detailed and seemingly plausible explanation for Tom's newfound abilities, courtesy of family friend and psychiatrist Alan Porter. (The book takes its title, incidentally, not only from the Archibald MacLeish poem \"Chambers of Imagery,\" with its \"stir of echoes down the creaking floor,\" but also from Porter's statement regarding humankind's repressed paranormal talents, which, he believes, were stronger in primitive man: \"I believe they still exist in us, faint echoes of their former vitality.\")Matheson's book contains any number of genuinely eerie sequences (any scene with that ghostly woman is of course a standout), and the author's quiet way of describing them turns out to be a highly effective one. Much like Robert Neville in \"I Am Legend\" and Scott Carey in \"The Shrinking Man,\" Tom is an ordinary man (as his name might suggest) desperately trying to understand and carry on in a set of bizarre circumstances far beyond the range of ordinary human comprehension. Tom's situation is a bit more enviable than the others' in that he is able to enlist his wife for support longer than Neville and Carey could, but perhaps Tom, family man that he is, also has more to worry about, as well. The reader likes Tom--we admire the wonderful, loving rapport he has with both Anne and his young son--and hopes that he will be able to see his way through, a proposition that becomes increasingly unlikely as the novel proceeds.Like those other Matheson titles previously referenced, \"A Stir of Echoes\" also received the big-screen treatment; in 1999, it was released with Kevin Bacon starring as Tom. I have not seen the film (yet), but hear that it is a reasonably faithful adaptation (not by Matheson this time, but rather by director David Koepp), although it moves the story's setting to Chicago, ups the age of Tom's young son, and inexplicably changes Tom's name to Tom Witzky. (Why do screenwriters DO that?!?!) Bacon is not who I would have visualized in the lead, but as good an actor as he is, I'm sure he does a fair job. Still, it's hard to imagine the film being as compelling and irresistible as Matheson's original. \"The book is as vital and fresh as it was when it first appeared nearly half a century ago,\" Gorman goes on to write, and that is most assuredly the case. Richard Matheson--who, sadly, left us in 2013 at age 8-- is now a very solid 4 for 4 with this reader. And I have a feeling that after I read my next Matheson book, 1978's afterlife fantasy \"What Dreams May Come,\" that tally will be an even more impressive 5 for 5....(By the way, this review originally appeared on the FanLit website at http://www.fantasyliterature.com/ ...a most excellent destination for all fans of Richard Matheson....)"}, {"userName": "Bill", "userReviewDate": "Apr 15, 2013", "userURL": "http://www.goodreads.com/user/show/810550-bill", "userReview": "This was pretty good. A very quick read about a guy who, after becoming hypnotized at a party, begins to experince some paranormal abilities. Matheson can tell a story, that's for sure, and since this one is told mostly via dialogue and first person narrative, you're finished before you know it. I don't really have a whole lot more to say about it because a) I'm really busy, and b) yeah, it's Matheson, so if you like him you'll like this.So, a short review for a 200 pager. I liked it. Recommended."}, {"userName": "Helen", "userReviewDate": "Apr 03, 2017", "userURL": "http://www.goodreads.com/user/show/2040938-helen", "userReview": "3.5 stars.Superb writing. Tom was most likeable and the descriptions of his experiences were vivid and real, a masterful blending of the everyday mundane and the incredible.However, the ending was neither one thing or the other; neither resolved or left open. Still, an excellent story and I liked that the film diverged from the plot of the novel and yet retained the essence of the tale. Both are worth checking out!"}, {"userName": "Emma", "userReviewDate": "Oct 26, 2017", "userURL": "http://www.goodreads.com/user/show/26734926-emma", "userReview": "Tom Wallace and his wife Anne are your standard perfect 1950s couple. They have one son, and another child on the way. Tom has an average job, and the couple attend normal boring dinner parties at their neighbour's house. However, one evening everything is thrown into jeopardy when Tom is hypnotised into developing psychic powers... I very much enjoyed this book, as I didn't know anything at all about it going into it. I only found out about 3/4 of the way through that it's supposed to be a horror story- It really isn't scary, and that's coming from the biggest scaredy cat around. It is a good thriller though, and it had me guessing what was going to happen next throughout.Now onto the film adaptation with Kevin Bacon!"}, {"userName": "Megan", "userReviewDate": "Aug 29, 2012", "userURL": "http://www.goodreads.com/user/show/1233686-megan", "userReview": "Richard Matheson filled A Stir of Echoes with so much potential, but ultimately the book never delivered. There is a lot of creepy and introspective paranormal stuff. And an interesting cast of characters. Where Matheson failed is by focusing on the abnormal happenings surrounding main character Tom, and not going into quite as much detail with the other characters. When everything is said and done, this story really isn't about Tom, but throughout much of the book, we are led to believe it is. Nonetheless, I am still a Matheson fan and plan to continue reading his work. This just wasn't the best. And nothing like the movie, at least as I remember it ;)"}, {"userName": "Marko Radosavljevic", "userReviewDate": "Sep 03, 2017", "userURL": "http://www.goodreads.com/user/show/24376934-marko-radosavljevic", "userReview": "2.6...Iskreno se nadam da je ova bljutava mlaka kaša posledica lošeg prevoda.Metisonu dajem još jednu šansu."}, {"userName": "Lou", "userReviewDate": "Nov 24, 2010", "userURL": "http://www.goodreads.com/user/show/3699303-lou", "userReview": "A evening with friends and loved ones having fun playing games could take a turn for the worse, one person ends up in un-treaded waters and a countdown commence as the fabric around you peels away bit by bit.Knowing more than the average man can be a deadly weapon a torment if you have precognition's of something bad and it turns out exactly as you envisioned. Well that the predicament for one man in this story.As they say ignorance is bliss.Matheson is a master when it comes to gripping you and immersing you into a story and once he gets his claws into you he does not let go till the end! Page-turning carousel ride and as you go around a jack-in-a box pops out at you with a few surprises  \"The walls are dark velvet, the floors are covered with dark velvet rugs. It's black inside, absolutely black. Except for one thing. In the whole pitch-black theatre there's only one thing you can see. The letters up on the screen. Tall, thin, white letters on the black, black screen. They spell sleep. Sleep. You're very comfortable, very comfortable. You're just sitting there and looking at the screen, looking, looking at that single word up there. Sleep. Sleep. Sleep.\" \"And the most monstrous of monsters is the female monster,\" I mumbled, \"because they are shrewd monsters, because they are monsters of deceit, because they can lurk monstrously, hiding themselves behind a veneer of falsity, because they are monsters of deception.\""}, {"userName": "Troy Blackford", "userReviewDate": "Oct 16, 2015", "userURL": "http://www.goodreads.com/user/show/4177031-troy-blackford", "userReview": "A masterful work of telekinetic and supernatural horror from one of the top masters in the field, the late Richard Matheson. This 1958, tight-as-a-drum novel is, like most of Matheson's work, taut and right to the point, able to be read in a single feverish sitting. Equal parts mystery, suspense novel, and outright horror, its occasionally slightly jarring 1958's setting doesn't obliterate the feeling that this story is a timeless one, only adds a few touches of sociology to a great tale. Absolutely recommended: one of the classics."}, {"userName": "Eℓℓis ♥", "userReviewDate": "Oct 25, 2017", "userURL": "http://www.goodreads.com/user/show/46838158-e-is", "userReview": "In occasione del gruppo-tour halloweeniano su Facebook --> Piuma&Calamaio - Suggerisci un libro  Io sono Helen Driscoll si presenta come una ghost-story, all'apparenza, ricca di suspense... Esatto, soltanto all'apparenza perché di veri momenti da brivido non ce ne sono. La narrazione in prima persona e la scorrevolezza del testo e dei dialoghi sono gli unici punti a suo favore, Matheson avrebbe potuto sfruttare meglio il potenziale della trama perché più che sull'aspetto paranormale sembra concentrarsi soltanto sull'introspezione del protagonista e dei personaggi comprimari che gli ruotano intorno. Il finale - che speravo riuscisse a farmi cambiare idea e a rivalutare l'intero racconto - scivola nella banalità più totale e si risolve in pochi confusionari attimi.Un libro gradevole, se si sta cercando una lettura breve e un po' fuori dagli schemi... Ma niente di eccezionale."}, {"userName": "Flavia", "userReviewDate": "Oct 29, 2017", "userURL": "http://www.goodreads.com/user/show/44675676-flavia", "userReview": "Il paranormale che piomba addosso all'uomo comune. La mente che si apre a percepire ogni cosa e l'individuo che lotta per non impazzire, non essere sopraffatto, imparare a gestire lo straordinario che irrompe nell'ordinario.Qualche ingenuità qua e là, una rapida carrellata di fenomeni psi che a tratti risulta un po' forzata, ma il tutto è comunque gestito in modo lineare, semplice ma comunque curato. La storia magari non trasmette molti brividi, anche a causa di decenni di variazioni sul tema, siano essi letterari o cinematografici, ma la materia è trattata con efficacia quasi visiva, scorre come un film, e soprattutto non ha il tono spocchioso e didascalico di certi romanzi che sul paranormale sversano fiumi di parole promettendo chissà quali rivelazioni per poi lasciarti a bocca asciutta. Non è un capolavoro ma di sicuro un piacevole prodotto di intrattenimento, curato, diretto e onesto."}, {"userName": "George K.", "userReviewDate": "Sep 24, 2015", "userURL": "http://www.goodreads.com/user/show/4675995-george-k", "userReview": "Μ'έναν εντελώς τυχαίο τρόπο (αγγελία σε ομάδα στο Facebook), έπεσε στα χέρια μου αυτό το κλασικό βιβλίο τρόμου, ενός από τους καλύτερους συγγραφείς του είδους και αγαπημένου του Στίβεν Κινγκ. Αυτό είναι το τρίτο βιβλίο του Ρίτσαρντ Μάθεσον που διαβάζω, μετά τα εξαιρετικά \"Ζωντανός θρύλος\" και \"Το στοίχειωμα\", και αυτό με την σειρά του μου άφησε πολύ καλές εντυπώσεις.Ο αφηγητής της ιστορίας μας, Τομ Γουάλας, ευτυχισμένος οικογενειάρχης και εργαζόμενος, ένα βράδυ υπνωτίστηκε από τον αδερφό της γυναίκας του, σε μια συνάθροιση γειτόνων, έτσι για πλάκα. Από εκείνη την στιγμή άρχισε να διαβάζει τυχαίες σκέψεις των γύρω του, να νιώθει πράγματα από το μέλλον, ακόμα και να βλέπει το φάντασμα μιας γυναίκας στο ίδιο του το σπίτι. Φαίνεται ότι κάποιες ψυχικές δυνάμεις που δεν ήξερε ότι κατείχε, τελικά αφυπνίστηκαν. Πόσο επικίνδυνες είναι όμως αυτές οι δυνάμεις; Πραγματικά πολύ καλό βιβλίο, εξαιρετικά καλογραμμένο, που ναι μεν δεν τρομάζει ιδιαίτερα, προσφέρει όμως κάποιες ανατριχίλες, αποδίδει ρεαλιστικά και πολύ ωραία την ζωή στα προάστια και έχει ενδιαφέροντες χαρακτήρες, ανθρώπους της διπλανής μας πόρτας. Και το τέλος είναι αρκετά δυνατό και ανατρεπτικό. Η γραφή είναι πραγματικά πολύ καλή, άκρως ευκολοδιάβαστη και ξεκούραστη, με σωστές περιγραφές. Η ατμόσφαιρα σούπερ.Το βιβλίο το έψαχνα αρκετά χρόνια και χαίρομαι πάρα πολύ που τελικά το βρήκα και το διάβασα. Ήμουν σίγουρος ότι θα με ικανοποιήσει με την ιστορία και την γραφή του, και έτσι έγινε. Μπορεί να μην τρόμαξα ιδιαίτερα, ένιωσα όμως ανατριχίλες, δέθηκα με την ιστορία και ενδιαφέρθηκα πάρα πολύ γι'αυτά που τράβηξε ο αφηγητής. Σίγουρα άξιζε όλη την φασαρία για τον εντοπισμό του."}, {"userName": "Lady of the Lake", "userReviewDate": "Oct 06, 2010", "userURL": "http://www.goodreads.com/user/show/1332853-lady-of-the-lake", "userReview": "I'm thinking that in 1958 when this book was originally published this was very creepy amd very scary. However in 2010 when we have the amount of HORROR thrown at us in the media, film and the written word today, it was much less so. However, it does give a nice Thrill and somethingTo think about! I certainly would never let anyone hypnotize me at a casual party to liven things up!! The human mind is not to be messed with by amatures! This was a super fast read at 224 pages but those pages did pack a few twists and turns! This may not be out and out horror butIt did have some thrills and chills to offer! Other than the reference to getting a baby sitter for .50 cents an hour you wouldn't know this wasn't A current story! In fact I did not Know when this was written until after I read it and the .50 cent issue was really the only thing that stood out as something definitely from years ago! Definitely worth a read."}, {"userName": "Kathy Worrell  ツ ", "userReviewDate": "Oct 14, 2015", "userURL": "http://www.goodreads.com/user/show/4994087-kathy-worrell", "userReview": "Audiobook read by Scott Brick Scott Brick gets 5 stars for narration. He reads this novel so well, it seems like he becomes the characters. (I might be scared if I was his wife.)I enjoy a good, spooky, novel and A Stir of Echoes was just that.....spoo-ooo-ky! I did have a \"scooby-doo moment\" near the end of the story. I think I heard: \"I would have gotten away with it, too, if it wasn't for you meddling kids.\" Something like that, anyway."}, {"userName": "Jeremy", "userReviewDate": "Jul 09, 2008", "userURL": "http://www.goodreads.com/user/show/1310936-jeremy", "userReview": "See the movie that is loosely based on the book (starring Kevin Bacon). It is much edgier and more effective than the book. Even if you like Matheson (which I do...I think...), this book comes across as being quaint (written in the '50s) and predictable."}, {"userName": "Irene", "userReviewDate": "Jul 09, 2017", "userURL": "http://www.goodreads.com/user/show/42617033-irene", "userReview": "Me di cuenta de lo que estaba leyendo a las pocas páginas, y casi me arrepiento de no revisar de qué va un libro antes de empezarlo. En fin, apenas recuerdo nada de la película, exceptuando la cara de Kevin Bacon, lo cual es bueno para mí y quizá malo para la película.Me gusta mucho el estilo narrativo de Matheson (Soy leyenda es uno de mis libros favoritos ever), por lo que he disfrutado mucho con la lectura de esta novela (si no fuera porque desde hace unos años no me gusta demasiado el terror). Solo me chirriaba algún pequeño detalle, como por ejemplo: ¿por qué narices no contactas antes con tu cuñado, sí, ese que te hipnotizó? O ¿qué pasa con el peine? (Se llega a entrever al final, pero con la importancia que se le había dado en su momento, es un poco frustrante que el autor no vuelva a mencionarlo de manera directa).A pesar de ello, es una lectura entretenida, al más puro estilo casa encantada. Lo que no me ha dejado buen sabor de boca en absoluto es el final: o a mi versión ebook le faltan páginas, o es un final abruptísimo que desmerece totalmente el resto del libro."}, {"userName": "P", "userReviewDate": "Oct 12, 2017", "userURL": "http://www.goodreads.com/user/show/7260321-p", "userReview": "My God but this was dull. It made me start a new shelf for movies that are better than the books they're based on, because after years it's difficult to keep them sorted in my head."}, {"userName": "Aleksandar Doynov", "userReviewDate": "Oct 27, 2017", "userURL": "http://www.goodreads.com/user/show/41058900-aleksandar-doynov", "userReview": "Recensione qui:https://sognotrailibri.blogspot.it/20..."}, {"userName": "Mark", "userReviewDate": "Jun 25, 2013", "userURL": "http://www.goodreads.com/user/show/798905-mark", "userReview": "Tom Wallace is an office-worker everyman, newly moved into a rented house on Tulley Street in Hawthorne with his heavily-pregnant wife Anne and their young son Richard. The Sentas’ live on one side - they own Tom’s house - and aren’t particularly nice, whilst Elsie and Ron on the other side are perhaps a little too over-familiar. Across the road live Frank and Elizabeth Wanamaker - he’s an arse of a man, especially to his heavily pregnant wife. At the start of the book, Anne’s brother Phil comes over, they go to a party at Elsie’s house and Phil hypnotises Tom. None of them think anything of it, until Tom starts to see a smartly dressed woman in his lounge. Although it was first published 55 years ago, this was the first time I’d read it (I started it, in homage, the night I learned of Mr Matheson’s passing) and I wish I’d read it sooner. It seems almost churlish to mention it but whilst a couple of aspects are dated, as is only to be expected, they add a level of charm to a story that is as rich and vibrant as if were published last year. The characterisation is spot on - we find out a lot of details as the story moves on but there are no false notes at all - and you really care about Tom, Anne and baby Richard, whilst sympathising heavily with Elizabeth. The jolts in the story - the lady, Helen Driscoll, in the lounge, the tomato tin on the head, the gunshot, the train - are all expertly written, shocks that are blended so carefully into the writing that you’re surprised before you realise. There are some aspects that have been since mined (a similar sensation, I imagine, to seeing ‘Psycho’ for the first time today) but this carries everything out with a brisk quality, strong writing - almost noir-ish at times - and a great sense of pace that whips the reader through to the climax. If there is a false note, for me it was the introduction of Alan Porter, a psychiatrist friend of Tom’s, who has a chapter of exposition about mediums and telepathy that does drag - but again, this is 55 years old and if there’s only one chapter that slows things down, I’m willing to accept that. This is a cracking novel, assured and spooky and rich in detail, from a master of the genre and I can’t recommend it highly enough."}, {"userName": "Fiona MacDonald", "userReviewDate": "Oct 14, 2016", "userURL": "http://www.goodreads.com/user/show/2417021-fiona-macdonald", "userReview": "Interesting story. Even more interesting to know that Matheson inspired Stephen King. It's quite well written, and has a Dean Koontz/Richard Laymon feel to it. Creepy story about what happens when a man starts having visions of the future, and of a terrifying female presence in his house. Soon his life, work and marriage is on the line."}], "description": "Tom Wallace lived an ordinary life, until a chance event awakened psychic abilities he never knew he possessed. Now he's hearing the private thoughts of the people around him-and learning shocking secrets he never wanted to know. But as Tom's existence becomes a waking nightmare, even greater jolts are in store as he becomes the unwilling recipient of a compelling message from beyond the grave!This eerie ghost story, by award-winning author of Hell House and I Am Legend, inspired the acclaimed 1999 film starring Kevin Bacon.", "title": "A Stir of Echoes", "url": "http://www.goodreads.com/book/show/33553.A_Stir_of_Echoes", "average": 3.89, "cover": "https://images.gr-assets.com/books/1439014946l/33553.jpg", "reviews": 527, "authors": [{"url": "https://www.goodreads.com/author/show/8726.Richard_Matheson", "name": "Richard Matheson"}], "type": ["Horror", "Fiction", "Mystery", "Fantasy", "Thriller"], "outlinks": ["http://www.goodreads.com/book/show/33553.A_Stir_of_Echoes", "http://www.goodreads.com/book/show/7852561-a-stir-of-echoes", "http://www.goodreads.com/book/show/904622.A_Stir_of_Echoes", "http://www.goodreads.com/book/show/9692972-io-sono-helen-driscoll", "http://www.goodreads.com/book/show/10285916-stir-of-echoes", "http://www.goodreads.com/book/show/390774.A_Stir_Of_Echoes", "http://www.goodreads.com/book/show/21315057-a-stir-of-echoes", "http://www.goodreads.com/book/show/6726396-a-stir-of-echoes-library", "http://www.goodreads.com/book/show/16110571-kome-anje-odjeka", "http://www.goodreads.com/book/show/6994588-a-stir-of-echoes", "http://www.goodreads.com/book/show/36380640-a-stir-of-echoes", "http://www.goodreads.com/book/show/547094.I_Am_Legend_and_Other_Stories", "http://www.goodreads.com/book/show/14064.I_Am_Legend", "http://www.goodreads.com/book/show/33547.Hell_House", "http://www.goodreads.com/book/show/33555.What_Dreams_May_Come", "http://www.goodreads.com/book/show/33544.Nightmare_At_20_000_Feet"]}