{"ratings": 561800, "userreviews": [{"userName": "Nataliya", "userReviewDate": "May 02, 2010", "userURL": "http://www.goodreads.com/user/show/3672777-nataliya", "userReview": "[Tywin, however - I did not give a crap about him (pun intended!), but Shae...Not cool. (hide spoiler)]"}, {"userName": "mark monday", "userReviewDate": "Feb 26, 2011", "userURL": "http://www.goodreads.com/user/show/131922-mark-monday", "userReview": "it's time again for... A Game of Heroes and Zeroes! spoilers ahead__________HEROES\nhe's the Revenant Robin Hood, leader of a band of merry men whose purpose is to steal from the wicked, give to the needy, ransom the royalty, hang the bad guys, and maybe get laid some. Lord Beric comes equipped with a nifty super-power (courtesy of the Lord of Light, 'natch)... he gets to come back from the dead! unfortunately, his various hideous wounds get to come back with him. but so what... all those scars (and missing eye, and noose-blackened neck, and crushed-in head) only make him more manly. he's just the dreamiest!\nso what if she's socially awkward, mulishly stubborn, and entirely unimaginative... this young miss may be the last remaining True Knight in the realm! she kicks some serious ass, is loyal to a fault, and she brings out the human in that Jaime Lannister. at one point she stops to take a break by burying some random dead people hanging from a tree. what a big heart she has, it's adorable. you go, girl!\nha, ha - you thought he was the villain! joke's on you, sucker/reader. this gifted songster is not only the leader of the Free Folk (and what's not to like about them? they believe in freedom, equality, and the pursuit of happiness - even their tendency to steal women is sorta charming)... he is a man who turned his back on the rigid class system and general stuck-upedness of Westeros society for the charms of anarchic wildlings. he's just trying to get all his people away from those infernal Others. goodbye, mysterious villain... hello, brave hero!\nsure, her eyes glow red. sure, she's a little bloodthirsty. sure, she wants to sacrifice some children. what of it? we all have our flaws. don't judge this sorceress... her only goal is to, um, SAVE THE ENTIRE WORLD FROM UTTER DESTRUCTION. have some sympathy for her goals already. it's not like you could do a better job at trying to SAVE THE ENTIRE WORLD FROM UTTER DESTRUCTION. i want her on my team!***~ and a special shout-out to classy old-timer Lady Olenna, Queen of Thorns. well finally someone realizes that King Joffrey's shenanigans are truly intolerable. extra bonus points for naming your personal bodyguards \"Left\" and \"Right\". ~__________ZEROES\nhey, King Asshole, ever hear of keeping your word? seriously, Promiseslayer, what's wrong with you? you may win your battles, but you break your vow over a little punani? and what's up with chopping off the head of your own bannerman? not too bright, son. and all the good intentions in the world doesn't excuse your tendency towards Usurping the Rightful King. duh. my gosh, as far as common sense goes... the apple sure doesn't fall far from the tree.\ngood grief, two winners in one family - those lucky Starks! hmmm, let's see... you capture the wrong guy in book 1... you free an enemy in book 2... you seriously underestimate the most obvious \"secret\" villain in the world in book 3. what the hey? clearly you should have retired years ago. but i sense some redemption in your future. i know you have some bloodthirstiness in you, so let that freak flag fly in book 4 and get down to some serious villain-killing already!\nwow, i used to love you so much. until i realized you were getting sorta inappropriate with Danerys. yeah, she's brave and beautiful and a queen and she frees entire cities worth of slaves and she has three lovely dragons. but didn't you notice that she's about a third your age? and on top of that, you're a jealous liar. get outta here, Creepy McCreeperson!\ncome on, wolfie - Arya is supposed to be your soulmate! she's running all over Westeros just trying to get back to the fam, clearly needing a helping hand or paw... so why are you off galivanting about the countryside, chasing deer and hanging out with your new wolfpack buddies? well you did save her ass by taking down some of those Brave Companions - but that's a case of too little, too late. and here i thought that wolves are a girl's best friend. silly me. i guess your stomach is so much more important.***~ a special Zero mention must be made for Tyrion the Imp. where did that brain of yours go? why are you getting your ass handed to you again and again? well at least you unstuck your head from that ass and finally delivered some seriously overdue comeuppance... but i had to read 900 pages to get to that part. i want my old Tyrion back, stat! ~__________no review necessary, there are enough excellent ones out there. i loved this book, as i loved its predecessors. my favorite parts were the scenes with Sandor Clegane and Arya Stark. those two vicious killers were made for each other and their relationship was both laugh-out-loud funny and strangely moving. awww. at long last, a father figure that a child can truly look up to, and a daughter surrogate who knows what it means to really, really want to get some payback. and now on to the next one!"}, {"userName": "Melissa ♥ Dog/Wolf Lover ♥ Martin", "userReviewDate": "Feb 12, 2017", "userURL": "http://www.goodreads.com/user/show/17438949-melissa-dog-wolf-lover-martin", "userReview": "Freaking awesome re-read!**OKAY, SPOILERS FOR THOSE THAT HAVEN'T READ IT YET**Reading this was cray because I keep looking to see if I had read it before! I thought why is so much of this familiar. Then I thought, \"Oh yeah, stupid, you own and have watched all of the current shows!\" <--- I mean duh! I was going to give this one 4 stars because it's the one where they kill more of the Stark's and wolf and I wanted to go in, turn into my own dragon and burn them all down! but then . . . THIS ↓Oh happy day! Oh happy day! What joy!!!!!!!!!!!!!!!!! ❤I love so many people on the show and in the books. But my favorites are: 1) Jon ❤2) Tyrion3) Arya4) Daenerys5) Brienne6) Sam7) Sansain no particular order because I tried that one already. In the book there were certain scenes I liked better than I did in the shows. I love the shows and I love the books so far. But, in this book there were more parts with dialogue that I really enjoyed. My favorite in this book were the scenes between Brienne and Jaime. I know, you didn't see that coming right? I mean you would think it would have been all the parts about Jon since he's my hunneh bunneh but nope. I liked his parts better in the show and nooo it's not because I can look at him in the show. Although. . . nevermind. I just felt like there was so much more to Brienne and Jaime's time together in the book. I wished he would have quit calling her ugly and such though. Jerk, but they did seem to be friends of a sort at the end of their time and I liked that. The things you miss in any book is the commentary in someone's head. Of course some I would rather not read about. But I really loved the parts where we could read Tyrion's thoughts about Sansa. They were sweet and true and sad in many ways. Overall I enjoyed the book because of the parts with Joffrey dying. Bwhahahahaahahahahahahah! And the parts with Brienne and Jaime. I loved all of my other characters parts but these were the highlight moments for me. Or course you know when you get rid of one evil b•stard, along comes another one!MY BLOG: Melissa Martin's Reading List"}, {"userName": "Mohammed Arabey", "userReviewDate": "Apr 12, 2015", "userURL": "http://www.goodreads.com/user/show/13592557-mohammed-arabey", "userReview": "وسط إنشغال الملوك بلعبة العروش، تعم الفوضي في البلادتحاط بين سيوف الخارجين عن القانون وأعدائهمبين غيوم عواصف شتاء قادم، وعاصفة السيوفعاصفة السيوف أو كما ترجمته 'صليل الصوارم' الأنشودة الثالثة من أغنية الجليد والنارجزء أضخم مما سبق، ملحمي ،ملئ بالتطورات والمفاجآت الدموية..والشاعريةليثبت جورج آر آر مارتين أن سلسلته تحوي بجانب الدراما والحرب، الرعب والفانتازي والسحر..شيئا من الرومانسيةفبهذا الجزء بجانب أغاني السيوف وصليل الصوارم، هناك أغنيات مليئة بالمشاعر ، لا أستطيع أن اجزم بأنها كلها رومانسية، ولكن الأكيد أنها ستحرك مشاعرك وتجعلك تشعر بتعاطف أكثر مع هذه الثنائيات الغير متوقعةهو الجزء اﻷفضل بالنسبة لي من بعد الجزء اﻷول، والجزء اﻷكثر قوة حتي اﻷن ، لتميزه بقصص ضخمة للشخصيات ،ومزايا أخري كثيرة سيكون الريفيو مجرد عرض 3 مزايا هامة لها لنختلف عن الريفيوهات السابقة ربما ﻷن هذا الجزء كان مخططا قبل الانتهاء من كتابته في اواخر التسعينات أن يكون الأخير قبل أن يغير المؤلف رأيه بعد الجزء الثاني لتتحول أغنية الجليد والنار من ثلاثية إلي سباعية ~~~~~~~~~أولا ، مصائر تُعرف و أسرار تنكشف ------------------بهذا الجزء الكثير من المصائر والأسرار التي تعود للجزء الأول تنكشف وبمفاجأت ودقة كعادة المؤلففي الجزء الأول أرسل مساعد الملك روبرت ' إيدارد ستارك' فرسان لوقف أعتداءات عائلة لانيستر في بلدان النهر وتحقيق العدالة, ولم نعرف مصيرهم بعد وفاة الملك ومساعده نيد ستارك, هنا سنعرف مصيرهم وحياتهم في ظل حكم الملك جوفري المراهق, ومساعده تايون لانيستر نفسهفما مصير هؤلاء الفرسان الذي صار يدعي الملك الجديد أنهم خارجين عن القانون ؟ و ما مصير الخارجين عن القانون الذين أستعان بهم لانيستر لنشر الفوضي في بلدان النهر؟من أرسل قاتل لأغتيال أبن أيدارد ستارك الصغير بالجزء اﻷول؟ وهل سيلقي جزاءه؟ وما سر قدرة بران ستارك نفسه للدخول في عقل ذئبه؟ وهل أخوته لديهم جزء من هذه الموهبة؟ما سر تحركات الهمج، القوم اﻷحرار ناحية الجدار؟ وهل لها علاقة بأختفاء عم جون سنو بالجزء اﻷول؟ماذا بعد أنتصارات روب ستارك ملك الشمال في كل معاركه؟ هل يضمن له ان يكسب الحرب؟ ولماذا تشعر أمه كاتلين ستارك بكل هذا الخواء برغم الأنتصارات؟ماهي الخطوة التالية لملكة التنانين؟ الملكة الشرعية لويستروس والمنفية وراء البحار؟ و ما سر الرجلان الذان يتبعناها منذ الجزء السابق؟ وماسر عدم ثقة فارسها به؟ماذا سيفعل الملك ستانيس براثيون بعد هزيمته؟ وما سر تشبثه بالأبن الغير شرعي للملك السابق روبرت براثيون؟ وهل للمرأة الحمراء دور بهذا؟ تلك الكاهنة التي يمقتها مساعده دافوس؟ هذا الجزء يكشف أيضا جانب مظلم عجيب للمعتقدات والأديان الغريبة التي مازالت تنتشر في الممالك السبع , هناك جزء به سحر وغموض ...وقدرات خارقة للطبيعة , هذا غير الأعتقاد أن كل هذه القدرات تزيد بسبب ظهور التنانين من جديدولكن صدقني مهما بلغ السحر أشده, لا شئ أكثر ظلاما ولا قسوة من الغدر البشري والخيانات .. وعاصفة سيوفه*****************************\n~~~~~~~~~~ثانيا , الشخصيات الجديدة-------------بالرغم من أن بعض الشخصيات ظهرت في الأجزاء السابقة كشخصية جانبية أو فرعية للشخصيات الرئيسية إلا أن هذا الجزء يشهد تحولهم لشخصيات أساسية لها فصول خاصة يجعلك تفهمهم أكثر, تدرك مشاعرهم وتفكر بعقولهم وتري من وجهة نظرهم .. وهذه الشخصيات هيجــيمـي لانيــستـرأبن أثري عائلات ويستروس، الوسيم،المتعجرف، ذابح الملك ،كاسر النذر خائن العهد، صاحب العلاقة الغير شرعية مع أخته سيرسي..وقد يكون المتهم في إرسال قاتل لبران ستارك ذو التسع سنوات بعد أن ألقاه من البرج بالجزء اﻷولفي هذا الجزء ستتعرف أكثر عليه, علي وجهة نظره بأسلوب لا يخلو من روح جيمي نفسها, العجرفة والسخرية الدائمةولكنك أيضا ستتفهم دوافعه وسر خلف قسمه لحماية الملك وذبحه للملك السابق \"الملك المجنون\"في رحلة خلال هذا الجزء ستغير من حياته..ولكن لهذا حديث أخرسـامـويل تارلـيبالرغم من كونه مجرد شخصية جانبية في جزء \"جون سنو\" بالجزئين السابقين , بالرغم من كونه الشخصية الجبانة والتي تخشي كل شئ ماعدا الأعتراف بذلكولكنه يثبت شئ من الثبات بنهاية الجزء الثانيونتيجة لأنفصاله لتوالي الأحداث عن جون سنو بنهاية الجزء الثاني وأنفصال جون سنو نفسه عن الحرس الليلي لينضم للهمج في مهمة سرية كان يجب أن يكون هناك من ينقل لنا ماذا يحدث بين الحرس الليلي والجدار بالشمال خاصا أن الأوضاع كانت أكثر توترا وخطورة عن الأجزاء السابقة يثبت المؤلف أنه يكتب كل جزء بما يتناسب مع الشخصية , وكأن شخصية أخري تماما تكتب الجزء هذا الجزء ستشعر فعلا أن شخص جبان هو من يكتبها..في وسط صراعات ضخمه تجمع بين غدر الأنسان, رعب الكائنات الغريبة المتوحشة الجليدية , ومشاعر الرجولة الطبيعية في حماية المرأة الضعيفة..حتي ولو كان يشعر بضعف أكثر منها -------------فضلا عن هذه الشخصيتين هناك الكثير من الشخصيات التي تظهر لأول مرة ,كجماعة فرسان أحرار \"أخوان بلا راية\" وطائفتهم بقيادة \"بيرك دوندرايون\" وكاهن أخر \"ثورون\" يتبع نفس العقيدة العجيبة السحرية لأله النار كالمرأة الحمراء ميليساندرا هناك أيضا الظهور الأول ل\"مانس رايدير\" قائد البرابرة ,أو كما يطلق عليه \"ملك خلف الجدار\" ,والذي يقابله لأول مرة جون سنو ليعرف سر تحركات الهمج \"البرابرة\" نحو الجدار وقري الشمال وهي شخصية مثيرة جدا ومكتوبة بشكل ممتاز بالرغم من قصر دورهحتي الشخصية التي تظهر في أخر فصل..10 صفحات يروي قصة حياته في عائلة \"فيري\" وسوء حظه..لتنتهي حياته في هذا الفصل الوحيد كما أن هذا الفصل اﻷخير نفسه ينتهي نهاية غير متوقعة ولم تظهر حتي اﻷن بالمسلسل ، نهاية صادمة غريبة ومشوقة تدفعك لمعرفة المزيد بالجزء التاليولكن هذا ما أعتدناه من جورج آر آر مارتين, كل شخصية مهما كان ضآلة حجم دورها لها حياة وتاريخ يحاول دائما كتابة ملامح منه بين الأحداثهذا غير وصف الملامح , الملابس, الطعام , كل أدق التفاصيل ليجعلك تعيش بهذا العالم الذي أبتدعهوتطورات ونضج يحدث لباقي الشخصيات التي نتابعها منذ الأجزاء الماضيةآريا ستارك ومعاناتها للوصول لأمها في ظل عاصفة السيوفكاتلين ستارك وصدماتها المتوالية من أخبار سيئة ووفيات أقرب الناس لهاسانسا ستارك والتي أيقنت أن الحياة ليست كالأغاني, علي الأقل العاطفية منهاجون سنو ومهمته كخائن للحرس الليلي وتعقدات تلك المهمة لأن لن يثق به بسهولة سواء الهمج أو حتي أخوانه من الحرسبران ستارك ورحلته نحو الشمال, والموهبة العجيبة لدخوله أجسام ذئبه, في ظل شتاء قادم وعاصفة سيوف تايرون لانيستر وصراعه مع أخته , تسلطات وتحكمات أبيه , الغباء السياسي والأخلاقي لأبن أخته الملك جوفري دافوس سيورث مساعد الملك ستانيس ,وأتهامة بالخيانة من بعد الحرب فقط لأنه يشعر بمدي ظلام السحر الذي تمارسه الكاهنة الحمراء ,كاهنة أله الناردانيريس تارجريان وخطوتها الصعبة المليئة بالمخاطر لتجميع جيشا وسفنا لتستطيع العودة لعرشها الشرعي, عرش الممالك السبع ..العرش الحديدي\n****************************************\n~~~~~~~~~~ثالثا , الأغنيات بأغنية الجليد والنار----------------بالأجزاء السابقة نجد سانسا ستارك, فتاة علي أعتاب المراهقة , تعشق الأغنيات , أغنيات الفرسان الشجعان , الحب والفروسية والجمال.. كانت تشعر أن الحياة كتلك الأغنياتولكن الحياة في اغنية الجليد والنار ليست من ذلك النوع , من نوع مختلف من الأغنيات والتي تم ذكرها في أجزاء سابقة ولكن هنا نجد أن اغنيتين بالأخص كان لهما النصيب الأكبر من التماثل مع الأحداث وهما{{{ The Bear and the Maiden Fair أغنية الدب و العذراء الجميلة}}}\nالأغنية الرسمية لأنشودة عاصفة السيوفهي عن عذراء جميلة تنتظر أن ينقذها أمير ، عوضا عن ذلك ينقذها الدب المشعر وتنشأ بينهما علاقة غير متوقعةهذه الأغنية تكررت في أكثر من فصل لأكثر من شخصية في مواقف مختلفة, بالرغم من أنها ذكرت في جزء سانسا ستارك وساندور \"الكلب\" كاليجان في نهاية الجزء الثاني, إلا أنها تعزف كاملة هنا في جزء سانسا أيضا..وستجد تماثل ضخم بينها وبين بعض ما حدث لبعض الشخصيات, أو الثنائيات الغير متوقعة كمل أشرت ببداية المراجعة.. ولنبدأ بـجيـمي لانيـستر وبريني من تارث----------------- هذا الوسيم المغرور المتعجرف و \"برينيي الجميلة\" ، إبنة لورد 'تارث' الضخمة البنيان، غير جميلة الملامح حيث لقبها جاء كسخرية منها، القوية، صاحبة القيم و اﻷخلاق، شخصية مختلفة تماما عنه ،كإختلاف السماء واﻷرض، تمقته ﻷنه خائن عهد و ذابح الملك..ولكنها مكلفة بعهد من السيدة كاتلين ستارك لتوصيل أسيرها جيمي لأراضي الملك فداء لإبنتيها سانسا و آريا ولكن الرياح كما تعودنا بتلك اﻷغنية لا تأتي أبدا كما تشتهي السفنفسيعترض جيمي و بريني الكثير من اﻷعداء،والمعرقلات الخطيرة وفي رحلتهما هذه سيتغير الكثير من حياتهما الحوار بينهما مكتوب بأسلوب ممتاز جعلني أعشق هذا الجزء من بدايته للنهاية، فقد نجح جدا المؤلف في أبراز التناقض بينهما بل ويجعلنا نقرأ وندخل ذهن ذابح الملك لدرجة قد تجعلك تتعاطف معه بشدة .. أو علي اﻷقل ستتحمله كما إحتملته بيرني في رحلتهما في جزء ملئ بالدموية ، و عاصفة السيوف...واﻷهم صراع حقيقي بين جميلة ، ودبلتكتمل أغنية \" الدب والعذراء الحسناء\" ..إلي حد ما جزء الحوار مكتوب به بشكل به شئ من المرح والكوميديا بالرغم من كل صعوباته ودمويتهجزء فعلا يكاد ينافس أجمل قصص الحب..وان لم يكن جزءا رومانسيا علي الأطلاق~~~~~~~~~~~~~~~~~~~~~~~~سـانسا ستـارك و تـايرون لانيستر-----------------من بعد الجزء الثاني تغير تماما مستقبل كليهما، فسانسا لم تعد مخطوبة للمتوحش الملك جوفري ، وعليه فهي العذراء الجميلة تنتظر فارسا ينقذها من أراضي الملك وقبضة سيرسي و لخطة أخري يلعبها منزل 'هايجاردن' الذي منه خطيبة الملك الجديدة مارجري تايريل، تقرر السيدة أولينا مكافأتها بعرض زواج أحد عائلة تايريل، وأن تنتقل للعيش بهايجردن وتبعد عن الملك جوفري وسيرسيوترتفع أمال سانسا بذلك الفارس الذي سينقذها ولكن، إنها أغنية الدب والعذراء الحسناء...إنها أنشودة عاصفة السيوففتايرون لانيستر ، القزم ، أيضا تغير مستقبله تماما عن الجزء الثاني، فهو لم يعد من الحرب التي خاضها دفاعا عن أراضي الملك محبوبا أكثر، بالعكس عاد مكروها أكثر ،جريحا جروح شوهته أكثر من بعد نجاته من محاولة إغتيال دبرتها أخته ليظهر أنه سقط في الحربتم نزعه من منصبه تماما كمساعد 'يد' الملك لصالح أبيه تايون لانيستر والذي صار يتحكم فيه بشراسة أكثر ، وايضا أخته سيرسي وحتي أبن أخته الملك جوفري ولكن ما زاد عن كل ذلك، رد فعل أبيه المفاجئ فور معرفته خطة عائلة تايريل السرية لتزويج سانسا ...فقد قرار سبقهم وتزويج ابنه القزم المشوه من الحرب \"تايرون\" لسانسا ستارك...العذراء الحسناءكلا الجزئان ،جزء سانسا وجزء تايرون، يتداخلان كثيرا في أحداث مشتركة تجعلك تشعر باﻷسي لكليهما ، والورطة التي جمعتهما سويا ...تماما كأغنية الدب والحسناء العذراء..وما أقسي مفاجآت اﻷغاني التي كانت تعشقها سانساكما أن جزئهما سيشهد التطورات والمفاجآت البشعة الصادمةوبالرغم من تشابك الجزئين لكنهما سيتفرقا في مسارات لن تتخيلها ومفاجآت تلك العاصفة...عاصفة السيوف ~~~~~~~~~~~~~~~~~~~~~~~~آريا ستارك وساندور \"الكلب\" كاليجين-------------------لم تطلب يوما أن ينقذها فارس، فهي فتاة صغيرة عنيدة..شهدت إعدام أبيها وعانت صعوبات في الطريق لتصل ﻷخيها ملك الشمال...وبعد هروبها بأعجوبة من هارينهال بنهاية الجزء الثاني، تواجه مصاعب في طريقها إلي ريفيررن ، مدن منطقة النهر ، حيث أخيها روب ستارك ملك الشمال وأمها ...ولكن الطريق صعب وملئ بقطاع الطرق، وحتي فرسان الملك السابق المعدمين \"الأخوان بلا راية\" والذين يصطحبوا آريا معهم للحصول علي فدية... ولكن من قال أن صحبة هؤلاء الأخوان سيجعلها بمأمن من عاصفة السيوف؟ هذا الجزء سنتعرف علي جماعة الأخوان بلا راية والعجائب الخارقة للطبيعة التي يقوم بها كاهنهم ، وتظل آريا أسيرتهم هي وجريندي و هوتباي من الجزء السابق، ولكنها تجد نفسها تبتعد دوما عن وصولها لأهلها..ولكنهم ليسوا الدب هنافكما قلت أن أغنية الدب والعذراء الحسناء هي اﻷهم هنا...ولكن ليس الدب في حالة آريا...وإنما الكلب 'ساندور كاليجان' و الذي سيقلب اﻷحداث لهذا الجزء فهل سيكون منقذها؟هذا الجزء يقدم علاقة عجيبة بين ساندور وعائلة ستارك, تشعر فعلا بشئ غريب, هل هو مذنب فعلا طوال الوقت؟ أم أن طبيعته البشرية جعلته قاسيا ولكن ليس ظالما كأخيه \"الجبل\" جريجور كاليجنفكرة إنتقام آريا من كل من ظلم عائلتها وأصدقائها تتعظم في هذا الجزء ،ولكن هذا الجزء الضخم ، لا أنكر ان اغلبه كان مرهق بغارات السيوف بين الخارجين عن القانون و الفرسان اﻷحرار و كان يمكن إختصاره بشكل أفضل كما في المسلسلوأيضا سيشهد مفاجآت صادمة ، دموية باﻷخص عندما يقترب من......ولكن لنعود لهذا لاحقا~~~~~~~~~~~~~~~~~~~~~~~~جون سنو و ياجريت من القوم اﻷحرار-------------------بعد الجزء الثاني وإنضمام جون سنو للهمج، البرابرة ، أو كما يطلقون علي أنفسهم 'القوم اﻷحرار' ، وذلك ليكسب ثقتهم كمرتد عن الحرس الليلي ولكي يعرف خططهم وسبب تجمعاتهم الضخمة وزحفهم إلي جنوب أراضيهم نحو الجدار ... سيتعرف جون علي ياجريت والتي ﻷنه أبقي علي حياتها بالجزء الثاني، تساعده في أن يكسب ثقة قومها هي تساعده، وتقربه من قومها...تحاول أن تثبت له أن الجميع يجب ان يكونوا أحرارا، وأن لا أختلاف بين قومها وقومه...جميعهم بشرا من دماء واحدةالمعضلة هنا هي أن جون سنو لا يريد خلف قسم أخوية الحرس الليلي, والذي يقتضي عليه ألا يتزوج أمرأة..ولكنه إن لم يكن طبيعيا مع ياجريت فأن هذا سيزيد شكوك القوم الأحرار ..فماذا سيفعل؟من منهما الدب، ومن العذراء،هي الهمجية, هو الحارس المخلص لقسمه الأمر هنا مختلط ..في قصة جميلة عن المساواة، حق الحرية ، الشجاعة واﻷخلاص ...وقصة حب أكثر وضوحا من أي قصة أخري باﻷحداث، كتبها المؤلف بطريقة ممتازة ، ومؤثرة عندما يفقترق الطريقان ..وتليق بنفس الوقت بالجو العام للأحداثستعشقها ، وستعشق الجملة التي تقولها كماركة مسجلةأنت لا تعرف شيئا ، جون سنو~~~~~~~~~~~~~~~~~~~~~~~~سامويل تارلي و جيلي من القوم اﻷحرار--------------------بالرغم من جبنه إلا أن شهامته ظهرت عندما إستنجدت به فتاة من القوم اﻷحرار ،جيلي، حيث يقوم أبيها/زوجها في حالة إنجاب بناته/زوجاته أبن ذكر ، فأنه يقوم بالتضحية به لآلهة الجليد!! وعندما علمت جيلي بحملها ولدا لم تجد سوي ساموبالرغم من رفضه بالجزء السابق إنقاذها بسبب قسم أخوية الحرس الليلي، إلا أن الأحداث المؤسفة الغادرة تجعله هو أيضا يحتاج إنقاذهي تنويعة مختلفة للأغنية..فكلاهما يحتاج إلي إنقاذ وكلاهما سينقذ اﻷخر فقط بوجودهما سويا~~~~~~~~~~~~~~~~~~~~~~~~دانيريس تارجيريان و سير جوراه مورمونت----------------------هي أيضا تنويعة مختلفة من اﻷغنية...هي الملكة الجميلة التي تحاول أن تكون قوية ، أرملة دروجو قائد قوم الدوسراكي اﻷقوياء، ملكة التنانين ، ولكنها أيضا في حاجة لمن يدعمها ويرشدهاصديقها المخلص كما تراه، سير جوراه , ولا تعلم عن أنه في البداية كان جاسوسا عليها لصالح الملك روبرت براثيون، هو سير جوراه هو يحبها ليس كمجرد فارس وملكته، بل هو يعشقها، يحاول حمايتها من كل الرجال ولا يثق بأحد مما يجعلها تضيق خنقاهي أيضا لديها شكوكها للفارس المنضم مؤخرا ومساعده كتابعان لها، ولكنها لا تشعر تجاه سير جوراه بنفس المشاعر، مما يجعلها في خضم جزءها الزخم باﻷحداث دائما في ذلك الصراع العاطفي ، حتي تنقلب اﻷحداث وتبدأ المفاجأت، ولا تنس النبؤة التي سمعتها دانيريس بنهاية الجزء الثاني حول 3 خيانات ستقابلها في طريقها وقد واجهت اﻷولي بالجزء اﻷول من الساحرة التي كلفتها حياة زوجها وأبنها في رحمها...مما جعلها شديدة الحذر تجاه الجميعبالرغم من أن الفارس سير جوراه ليس له فصول خاصة إلا أنك تشعر بعشقه لها من خلال الفصول الخاصة بدانيريس , من طريقة حديثه وأقترحاته لها وحتي نظرته لكل من حول ملكته ,دانيريسجزء ملئ بالمفاجأت والتحالفات والشكوك أيضا*****************************\n{{{ The Rains of Castamere أغنية أمطار علي كاستامير}}}\nهي اﻷغنية الثانية المهمة بأحداث ذلك الجزء والأخيرة بهذا الريفيوهي عن اﻷمطار التي سقطت علي قلعة منزل عريق بالممالك السبع والذي تحدي يوما منزل لانيستر ، وتمرد عليه بعد أن كان تابع له ، ليرد عليه تايون لانيستر بحرق القلعة وقتل كل أفراد هذا المنزل ليمحيه تمامالتسقط تلك اﻷمطار علي اطلال القلعة تنتحب ولا أحد يسمعهالا أود حرق اﻷحداث، ولكن يكفي ذكر أن مشهد أحد حفلات الزفاف بهذا الجزء ﻷحد من تحدي منزل لانيستر تحول لحفل دموي، بشع...سمي بعدها ب'الزفاف اﻷحمر' ولا أعتقد أن بهذا مبالغةحتي المؤلف جورج آر آر مارتين يعترف أنه أصعب مشهد كتبه في حياته  حتي الأن علي الأقل ...وبالرغم من وجوده بعد بداية النصف الثاني من هذا الجزء الضخم إلا أنه أجّل كتابته حتي النهايةأتذكر وقت مشاهدتي لهذا المشهد بالموسم الثالث للمسلسل المبني علي الرواية-قبل قرائتي لها- ظللت صامتا لدقائق ، لا أصدق الدموية ، الوحشية، الغدر هذا كلهالخيانة التي تتعارض مع أي عرف، قوانين، تقاليد أو حتي اﻷديان كلها المختلفة بالممالك السبعمشهد صادم ، قاتل وأتذكر جيدا أني شعرت أنني لا أريد مشاهدة هذا المسلسل بعد ذلك ، وسأبيع الكتاب اﻷول الذي إشتريته ولم اقرأه بعد وقتهافما فائدة متابعة مسلسل وقراءة رواية بها كل هذا الظلم...الظلام...الأستبداد والخيانة والخداع من أجل لعبة المناصب والكراسيلعبة العروشصراع ملوك ، عاصفة سيوف، صليل صوارمولكن عندما قراءتها...وبنهاية هذا الجزء باﻷخصوجدت أنها لا تختلف عن عالمنا إلا في المسمياتومازال هناك فرصة للتغيير، الثأر وتحقيق العدلفقط يجب أن تصمد...تعافر...تلعب ولكن بشرفتلعب ، لعبة العروشوإلي ريفيو الجزء الرابعمحمد العربيمن 21 أبريل 2015إلي 10 مايو 2015"}, {"userName": "Jessi", "userReviewDate": "Jun 22, 2011", "userURL": "http://www.goodreads.com/user/show/2838930-jessi", "userReview": "First an update on the Direwolf situation\nI still do not have one...sadface.This series !!! What can I say I am loving it! I don't know if I was just sick of everything else or just needed the escape but I am soooooo enjoying. The great thing is that I am on the third book and its not like I can't say which book I like better, which was weaker they are one long story that come in three(so far for me) packages.Its not like Indiana Jones. Where we say\" man I love Indiana Jones but... that second one WTH? \" You know, with Kate Capshaw and her never ending shriek and there were monkey brains.Do you remember the monkey brains? I remember the monkey brains.Refresher\n**I will make no mention of Indiana Jones and the skull of shit or whatever it was called because I have decided that Harrison Ford needed a new boat and it should not be included in the series.Anyways A Song of Fire and Ice seems to different from the other series I have read *cough* Sookie Stackhouse *cough*. I find them very refreshing and I never have any idea where its going or how he is going to get us there,also do not get attached to anyone cause George R R Martin be killing bitches left right and center. No one is safe.Confession time: I seem to have a crush on The Hound\nWHAT? Shut up! I dont want to talk about it!\nWhatever! I am not even sure he is alive,the last time we saw him he was feeling a bit stabbed under a tree and I am not puting a \"spoiler tag\" on that, cause if I don't know then I am not spoiling anything. Maybe its cause he is so grumpy? This series brings out some weird attractions, my friend said she thought Littlefinger was sexy, he is a quirky mother f@&ker I'll give ya that, also she did not judge my hound problem so we're good."}, {"userName": "Matt", "userReviewDate": "Jun 19, 2011", "userURL": "http://www.goodreads.com/user/show/1232712-matt", "userReview": "This year (2011) has been rough for those of us who count ourselves Minnesota Twins fans. A few weeks ago, however, I watched Francisco Liriano nearly pitch a perfect game. Earlier in the season, Liriano pitched a no-hitter, which was a bright spot in an otherwise unremitting series of losses, injuries, and disappointment. But this was different. This meant more. This was a perfect game (and you can’t get better than perfect). The announcers, with no regard for karma, started talking about the possibility in the fifth inning. I didn't start to get excited until the seventh. I thought to myself: I might be watching something for the history books. Then, in the eighth, the third baseman made an error, and the perfect game was over (the following inning, he lost his no-hit bid as well). The game went down as a victory for the Twins, and for Liriano, but it will be lost in the eddies of baseball history. It was a very good game; but it was not a masterpiece.Back in May 2007, I watched the season finale of the third season of Lost. The series, which focused on a group of airplane crash survivors on a mysterious island, became a pop cultural phenomenon with its intriguing present-day storyline intercut with meaningful flashbacks to the off-island lives of the passengers.The third season was up-and-down, but after a strong homestretch, Lost gave us a finale for the ages. In the final moments, the show revealed that the flashbacks we thought we’d been watching for the previous two hours were actually flash-forwards, and that some of the passengers had gotten off the island. After picking up the pieces of my brain, I thought to myself, I might be watching the greatest television show of all time. Flash forward to 2010, when Lost concluded with a melodramatically satisfying but substantively hollow conclusion. It ended as a very good series, with individual episodes as strong as anything that ever aired on television, but it was not a masterpiece. I just finished George R.R. Martin’s A Storm of Swords, and I’m getting the same feeling I did watching Liriano in the 7th inning, or watching the third season finale of Lost: the thought that I might be in the midst of something special. Something that might linger and last. Something that be be considered a classic. Not classic fantasy. But a bona fide literary monument. I have grave doubts that Martin can finish this series, or that he can finish it with the same strength with which he started (reviews of the next book, A Feast for the Crows are not encouraging), but when I finished the last page, I certainly sensed the possibility of greatness. If Martin can finish this – if – then he will have accomplished a feat that will demand attention (including from those snotty New York Times Book reviewers who won’t read “fantasy”). Swords is Book Three in Martin’s A Song of Ice and Fire cycle. It begins where Book Two, A Clash of Kings left off. At the end of Kings, we were treated to the epic battle of the Blackwater; Winterfell was razed; the Night’s Watch was north of the Wall; and it appeared that the Lannisters, including the young, sociopathic King Joffrey, were ascendant. My main critique of Kings was that it started slowly and maintained that agonizing pace right up until a blistering third act that completely reshaped my feelings. Storm doesn’t bother with a slow build-up. It gets into things from the first page. From front to back, this is the best of the series so far, and a stunning novel in any light. The ever-expanding plot of A Song of Ice and Fire is impossible to summarize neatly. In Storm, as in the other books of this series, the story is told from the alternating viewpoints of various characters. The selected viewpoints are: Jaime Lannister, Tyrion Lannister, Jon Snow, Catelyn Stark, Arya Stark, Sansa Stark, Bran Stark, Samwell Tarly, Davos Seaworth, and Daenerys Targaryen. I sometimes criticized the point-of-view choices in the first two books, for the reason that Martin’s decisions often led to viewpoint redundancies and glaring blind spots. That is, Martin would often have several characters in one place, talking about one thing, while huge swaths of the storyline lacked a single witness. As a consequence, big chunks of exposition, central to the plot, were fed to the reader as secondhand hearsay, rather than experienced by a beloved character. For the most part, this problem does not arise with Storm. The viewpoint characters are well chosen and spread out across Westeros, doing things rather than talking about them. Sam is with the Night’s Watch beyond the Wall, being chased by the Others (they’re a kind of cold-weather mash-up of vampires and zombies). Jon is riding with Mance Ryder’s free-folk in a sort of Dances With Wildings subplot that allows us some insight into the wildlings lifestyle (and occasions any number of hastily-scrawled sex scenes). Catelyn is with her son Robb, the King of the North, who blunders badly by breaking his oath to marry a Frey daughter. Jaime Lannister embarks on a perilous journey back to King’s Landing, guarded by the female knight Brienne of Tarth. Meanwhile, back in King’s Landing, a wounded Tyrion awakens to find that his good deeds have not helped his standing. The presence of his father, Tywin Lannister (a great peripheral character), and the scheming of his sister, Cersei, threatens his position at court. Across the sea, Daenerys gathers an army she hopes will allow her to retake Westeros. Of course, not all the viewpoint characters are created equally. Sansa Stark finally has things to do (and finally rejoins the plot; she has basically stood mute since betraying her father Eddard in A Game of Thrones), but she is still dumber than a garden gnome. Martin finally convinced me that Davos Seaworth, loyal to royal pretender Stannis Baratheon, is an important character; unfortunately, his importance does not make him interesting. Like Eddard Stark before him, Seaworth’s square, dogged sense of honor – shorn of wit or pragmatism – makes him an uninspired character.These criticisms are only half hearted, though. The overall quality of Martin’s plotting choices easily cover up the fact that, in a game of chess between Sansa and a sack of unpeeled potatoes, I would wager on the potatoes. Even an otherwise tiresome character such as Samwell Tarly, who is the sniveling heir of Tolkien’s Samwise Gamgee, is given things to do. Heck, I even grew to like Daenerys. In the first two books, I was wholly underwhelmed by her subplot. Though I fully understand (or think I understand) Martin’s endgame with respect to Daenerys, I didn't like how he kept cutting away from the main story to heap page after page upon this unconnected plot thread. In Storm, Daenerys does not get much closer to joining the rest of the book, but she does get to kick some ass. I never figured I’d be a person to get much enjoyment from a dragon unleashing fire on an unassuming victim. I was wrong. Many of the highlights of this book I will not touch, even vaguely. Things happen that are surprising, shocking, and heart-wrenching. If at all possible, you should attempt to finish this book before accidentally stumbling across a massive spoiler. Surprises aside, many of Storm’s highlights stem from four characters in particular: Jaime the Kingslayer; Jon Snow of the Night’s Watch; Arya Stark; and Tyrion the Imp. Storm is the first book in which Jaime becomes a viewpoint character. In the past, we knew him as the sister-f***ing, child-defenestrating, king-killing sword master. He appeared a cruel, golden-haired villain, one who inspired terror in the heart of our putative heroes, the Starks (the further you get into A Song of Ice and Fire, the less sure you become about who the heroes and villains really are). In Storm, Jaime spends much of his time on the dangerous, outlaw-infested roads back to King’s Landing. Though his chapters are hampered by his unfortunate, almost Tourette Syndrome-like use of the word wench, we learn a lot from Jamie about his time guarding Mad King Aerys. What we learn causes us to seriously reevaluate our earlier judgments, and begins nudging him along the villain-hero spectrum. Jon’s story is where the bulk of the action happens. And by action, I mean fighting and sex. Without giving away too much, I think it’s appropriate to say that Jon is at the center of a battle on the scale of Return of the Kings’ Pelennor Fields. This battle really tilts A Song of Ice and Fire away from the realistic-fantasy from A Game of Thrones and into the fantasy-fantasy of The Lord of the Rings. There are mammoths and giants and spying eagles, but I didn't care, because there were also catapults and trebuchets and murder holes and burning oil. In other words, cool stuff. Arya was one of those characters I initially didn't like. For some reason, thematically or otherwise, Martin has chosen for viewpoint characters a high number of children, persons with disabilities, and children with disabilities (I’m not including Sansa’s low-functioning, though I could). This means that a lot of our protagonists are a bit atypical; furthermore, many of them haven’t had a lot to do till now. In Storm, the kids finally start to grow up. Bran, the crippled boy, takes some huge strides in terms of reader-interest, as he begins to harness his shape-shifting abilities. However, I was more impressed with Arya’s storyline. She falls in with a gang of outlaws, joins forces with Sandor “the Hound” Clegane, and generally blurs the moral dividing line between good and bad. It’s a bold authorial choice when you take a relatively innocent child character and slowly turn her into a cold, steel-eyed killer. Finally, Tyrion remains the transcendent character he was in the first two installments. I expected his droll wit and smartass remarks to start wearing thin, but Martin’s choice to put Tyrion on the defensive, hemmed in by his father and sister, was an act of genius. It kept him evolving, which is no small feat after we’ve spent so much time with him. What I’ve just mentioned is just a smattering of the pleasures within A Storm of Swords, a novel that is overstuffed with awesome. This is a big book, and there is room for everything a fiction fan – not just a fantasy fan – could want: swordfights, torture, poison, beheadings, betrayals, shocking deaths, shocking fake-deaths, terrifying beasts, chuckle-inducing sex scenes, large scale battles, miracles. As I’ve already mentioned, there are a lot more supernatural and fantastical aspects than before. These are things that might have been off-putting for the old me, the me who never read fantasy. It’s even possible that I never would’ve started A Game of Thrones if these things has existed at the start. Well, too late; I’ve been sucked in. Besides, Martin does a really good job of grounding these aspects with his no nonsense, matter-of-fact descriptions. It was easy for me to accept the prospect of dragons because Martin describes them with such biological precision. And it was easy for me to accept the storyline of Lord Beric Dondarrion, who is repeatedly killed and brought back to life by the Red Priest Thoros, because Martin’s portrayal of Beric is so gruesomely detailed (Beric is given life, but he is not healed; he walks around with a crushed skull and a missing eye). For those of you who prefer Tolkien’s wordy, action-light style to numerous beheadings, maimings, and juvenile descriptions of oral sex, Storm should satisfy those cravings as well. Amid all the slayings and treachery, Martin still finds time for his characters to tell lengthy stories about the old days, and the long, violent, exciting history of Westeros. There are even songs! This is a great novel. Not great fantasy; great literature. Martin’s prose is not elegant. Rather, it is detailed. He writes descriptively but clearly. His style is to create visual images with words. Accordingly, he goes to great lengths telling you about architecture, physical features, clothing, colors, and smells. Even minor castles or minor characters are imbued with depth. It can sometimes be overwhelming, trying to keep all this detail straight. Mostly, though, the result is a novel that is immersive and tactile. You feel surrounded by Martin’s world. You feel like you can gauge the reactions of Martin’s characters. There may be dragons and sorceresses and the walking dead, but it feels real. That is not the extent of Martin’s talent. He has a marvelous sense of humor, and a nice, organic wit threads its way through novel, leavening the dour proceedings. Martin also has a nicely-tuned sense of dialogue. There are enough crisp one-liners and bon mots to put one in mind of The Godfather. Storm is the midpoint of what Martin has said will be a seven-book cycle. I would be lying if I said I didn't have grave concerns (grave being relative, of course) about the rest of the series. There are so many variables as to make a prediction impossible. Can Martin sustain this dense style? Does he have any idea where all his plotlines are heading? Will success, riches, and fame blunt his skills? Does he have enough years left in his life to finish this grand project? It’d be nice to say these questions don’t matter, that A Storm of Swords and the other completed novels can stand on their own. They can’t. Ultimately, Storm will be judged upon the entirety of A Song of Ice and Fire. If the cycle falters, or is left unfinished, then Storm will be reevaluated along with the rest. There is no denying Storm’s essential qualities. It remains to be seen, however, whether it is part of a masterpiece, or something a bit less."}, {"userName": "karen", "userReviewDate": "Nov 08, 2012", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "[number one:shea's betrayal of tyrion. and the whole time it was happening, i was hoping she had some kind of plan,and it was all just some strategy, but nooooo! i really believed in her, and the way her story ended was heartbreaking to me. way more heartbreaking than robb, oddly. but doubly sad, because the actress who plays her is a love of mine, from one of my all-time favorite movies:which i try to promote as often as possible.number two:telling jaime you killed joffrey??i know you're pissed, tyrion, butyou're better than that. (hide spoiler)]"}, {"userName": "Candace", "userReviewDate": "May 11, 2016", "userURL": "http://www.goodreads.com/user/show/16384209-candace", "userReview": "Each one of these humongous books has managed to completely captivate me. I have loved listening to the characters evolve with this series as their fantastical world changes around them. Nothing is off-limits and nobody is sacred. As anxious as it makes me, the fact that I never know what to expect next is a big plus for me. When you read as much as I do, it is rare to be surprised, but Mr. Martin manages to keep me guessing.While the second book had multiple kings rising to power and fighting for their piece of the Iron Throne, this book took the story in an entirely different direction. What goes up must come down. In this epic saga full of scheming and betrayals, the power players are constantly changing. 'A Storm of Swords' completely changes the landscape of this story yet again.Aside from the fall of kings, the way the characters are presented had me rethinking my previous judgments. As each character's thoughts and actions were explored, it became clear that there is no \"good\" or \"bad\" person. Even despicable characters had redeeming qualities and/or motivations that were understandable, if not admirable. Similarly, the less than pure intentions and actions of some of my favorite characters were brought to light. Everyone is flawed and vulnerable in some way.The only exception to this was Joffrey. I couldn't find a single redeeming quality in that evil brat. Maybe it was there and my hatred for him just wouldn't allow me to see it. Nonetheless, he remained true to his role of \"ultimate villain\".As with the first two books in the series, be prepared for plenty of blood and gore. Characters will die, sometimes gruesomely. Don't get too attached. This definitely isn't a series for the faint of heart. Now that I've finished the third book, I can begin to spot some of the inconsistencies between the books and the HBO series. There are some omissions that have been made, but nothing that I thought was critical to this story so far. I've also noticed that a few things are presented out of sequence. Again, this didn't take away from the enjoyment for me, but it was noticeable if you're reading and watching subsequently.Overall, I am still loving this story. It is still confusing at times, with an extremely complex storyline. However, I feel like I'm getting a better grasp on things. It's on to the next one for me."}, {"userName": "Bookdragon Sean ", "userReviewDate": "Feb 27, 2014", "userURL": "http://www.goodreads.com/user/show/27788046-bookdragon-sean", "userReview": "When I first read A Game of Thrones  I hated Jaime Lannister. Now, I think he’s awesome. If someone would have told me then, that by book three I would consider him one of my favourite characters, I’d have likely pushed them out of the moon door. It’s quite surprising that George R.R Martin actually changed him around like this. Well, I say change around. What I actually mean is showed the reader what he actually is. Never before, with any novel, have I had my feelings of pure hatred completely collapse in on them self and turn into pity and admiration. George R.R. Martin achieved this astonishing reversal by showing us the man as he saw himself. Instead of ignorant Ned Stark condemning him in his point of view, we see how Jaimie thinks. Indeed, we see his side of the story and why he committed his Kingslaying. It was no ill thought out act or cowardly murder; it was a killing of pure honour and decency. Surprising, I know. I was convinced by Ned Stark’s judgment. I, too, saw a backstabber and murderer. I was glad when the veil was lifted because never before has a character been so wrongly perceived by so many. Jaimie Lannister, certainly, deserves more recognition for his act. But, like a man of honour, he kept the details to himself and cared not what the world thought. He knew that he exacted justice and that’s all that mattered. Jaime reached for the flagon to refill his cup. \"So many vows...they make you swear and swear. Defend the king. Obey the king. Keep his secrets. Do his bidding. Your life for his. But obey your father. Love your sister. Protect the innocent. Defend the weak. Respect the gods. Obey the laws. It's too much. No matter what you do, you're forsaking one vow or the other.” And then there’s Tyrion’s little fiasco with that crossbow. I mean, wow! I did not see that coming. I literally cheered the very first time I read that; it was so perfect and so necessary. The way the chapter ended was superb also. I’d put the quote in, but that would be a big plot spoiler. I guess there is only so far you can push someone before they finally snap, and lash out against the world. Tyrion could only take so much abuse and disuse from the ones who should actually love him. What he did was totally justified and necessary for his own survival. He simply couldn’t go on anymore with that kind of treatment. The end he provides to his victim’s name will well, and truly, sully his reputation. It was most apt to finish him in such a way. What an awful, and deserved, way to go. Also, I think the blow of the red wedding has somewhat softened over the years. Initially, it is upsetting and horribly unjust, but then you read the build-up of it again and see it in a different light. It is clear that it was completely King Rob’s fault. He caused it; he should have known better than to renegade on such an important deal. It was pure folly. He left himself completely vulnerable. But, he isn’t to blame completely; he was very young after all. Maybe one day the Starks will be avenged completely. Well, I think it’s obvious that there is only on person with the capabilities to do it. By this point in the series Dany has truly cast aside her fear. She has realised who she is and what she is capable of; she has become the dragon her brother was attempting to be. But, for all her power, she lacks wisdom. It isn’t a lack of wisdom born of stupidity, but through a lack of experience. She needs someone to guide her and help her realise her destiny; she needs someone well versed in the game to lead her steps, and insure her politics are not completely detrimental. In short, she needs someone braver than Jorah and someone more cunning than Barristan; she needs a strong right hand. She needs an ally who can truly save her. It’s just a shame that the television show has beat Martin to it! However, she still has her own natural leadership abilities. She has taken an army and freed a city; she has found her voice and her confidence. But, she still needs help. Dragons are a powerful weapon, though they will only take her so far. They’ve saved her in this novel, and they will save her again. But, it takes more than Fire and Blood to win a throne, though it does help. This, for me, is the strongest novel in the series so far. The characters have evolved and become figures of investment. The characters in this are truly brilliant. It’s why this series is so damn good. It’s very difficult to actually pick a favourite because with each novel my opinions seem to change as the characters do. It’s also very hard to give each of them a mention in a review! I didn’t even talk about Jon Snow. Never mind. I think it’s clear what my opinion of this book is. I do love this series! A Song of Ice and Fire 1. A Game of Thrones- A life chnaging five stars2.A Clash of Kings- An Impish five stars3. A Storm of Swords - A Lannister loving five stars 4.  A Feast for Crows - A flat 3.5 stars"}, {"userName": "Cassy", "userReviewDate": "Jun 16, 2011", "userURL": "http://www.goodreads.com/user/show/2282938-cassy", "userReview": "[Stannis saving the Wall and, more importantly, the murder of Joffrey, Tywin, and Lysa. Hooray! I won’t be missing any of them. It seemed uncharacteristic for Martin to kill off the bad guys. Yet I thank him from the bottom of my heart. The prospect of watching Sansa become the king’s abused mistress or subject to her lunatic aunt was too much for me to bear. (hide spoiler)]"}, {"userName": "Jacob McCabe", "userReviewDate": "Oct 26, 2012", "userURL": "http://www.goodreads.com/user/show/6386602-jacob-mccabe", "userReview": "THAT ENDING. OH MY FREAKING GOD. AND SANSA. WITH THE LITTLEFINGER THING.AND DANAERYS. WITH...EVERYTHING.AND TYRION. WITH THE SHAE THING. AND HIS FATHER.AND JON. WITH THE WALL. AND THE WILDLINGS. AND THE OTHERS. AND YGRITTE.AND BRAN. WITH...just kidding, no one cares about Bran.AND CATELYN. WITH HER PROBLEMS, AS THEY ARE A-PLENTY.OH MY FREAKING GOD."}, {"userName": "Dan Schwent", "userReviewDate": "Jan 29, 2013", "userURL": "http://www.goodreads.com/user/show/870755-dan-schwent", "userReview": "Three kings contend for the throne and King Joffrey's wedding day grows near. Can he hold the throne with Robb Stark and Stannis Baratheon nipping at his heels?Yeah, that's a woefully inadequate summary but it's not laden with spoilers, either.Here we are, the third installment of Weddings, Beddings, and Beheadings, and my favorite one so far. In fact, I was thinking about downgrading them to 4's just so I could show how great I thought this one was. Martin outdid himself this time.First of all, there were quite a few deaths in this one. I wasn't expecting Robb Stark to go out like that. Tywin and Joffrey more than had it coming, however. The Red Wedding was pretty surprising, as was the trial by combat for Tyrion's fate. Speaking of Tyrion, his wedding to Sansa was also quite unexpected. I'm still not sure where things are going with Davos Seaworth but I'm already itching to find out.Jon Snow continued to be my favorite character, from his stint with the wildlings to his defense of the Wall to his imprisonment and eventual election to commander of the Night's Watch. The prospect of Snow becoming Lord of Winterfell is an intriguing one and I'm anxious to see how it unfolds.Another plotline I'm particularly enjoying is that of Arya and the Hound. The Hound could easily be a scene-chewing villain but is a surprisingly deep character. Arya is shockingly bad ass for a preteen.One character I'm surprised I've grown to like is Jaime Lannister. He's an arrogant unapologetic bastard and I love him for it. I'd read a whole book of Jaime's exploits.Also, how about Petyr Baelish? What a bastard!I'm giving this five stars with an exclamation point next to it. After a short break, I'll be devouring the two remaining volumes."}, {"userName": "Madeline", "userReviewDate": "May 28, 2012", "userURL": "http://www.goodreads.com/user/show/111921-madeline", "userReview": "[especially since you're probably actually the bastard child of Robert and Lyanna, so you're gonna have to deal with that sooner or later (knowing Martin, it'll be way later, and it's only a theory anyway so I wouldn't put too much stock in it) (hide spoiler)]"}, {"userName": "K.", "userReviewDate": "May 01, 2011", "userURL": "http://www.goodreads.com/user/show/2327078-k", "userReview": "Dear George R. R. Martin, No, wait! I didn't mean it! YES I DIIIIID!! Sincerely,K."}, {"userName": "Melanie", "userReviewDate": "Jun 24, 2014", "userURL": "http://www.goodreads.com/user/show/3030788-melanie", "userReview": "1.) A Game of Thrones ★★★★★2.) A Clash of Kings ★★★★★#readASOIAF Read-Along - Hosted by Riley from Riley Marie, Elizabeth from Liz Loves Literature, and Kayla from BOOKadoodles. ♥This book is heart-wrenching, and not just because this book contains the Red Wedding, but because this book leaves you with a sense of hopelessness. Many of these characters with good hearts and souls have such terrible things happen to them, while liars and killers prosper. Sometimes having a heavy pocketbook is more important than being a good person. *insert thought provoking parallel about how this mirrors our world and makes it even sadder*As always, I want to state a disclaimer, like with all of the books in this series, that there are many very graphic rape and gang-rape scenes. I couldn't even list all of the triggers for sexual abuse in this book, so please use caution when reading. As scary as the sexual violence is to me, I think it is very believable in this world and helps to show people that the real monsters aren't just beyond the wall; they are human beings capable of very evil things. \"To omit them from a narrative centered on war and power would have been fundamentally false and dishonest, and would have undermined one of the themes of the books: that the true horrors of human history derive not from orcs and Dark Lords, but from ourselves. We are the monsters. (And the heroes too). Each of us has within himself the capacity for great good, and great evil,\" GRRM even says (perfectly) himself, via The Guardian.I am loving this reread, and I'm loving being able to piece together theories that I completely missed in prior readings. Game of Thrones truly is the best show on television, and these books are truly a tier above the rest of high fantasy out there. I know they can be intimidating and a little dark, but they are so worth it. I can't recommend this series enough. GRRM is honestly a genius, and I'm still not sure if I'm worthy enough to read his words. The rest of this review will have spoilers from A Game of Thrones, A Clash of Kings, and also mild spoilers for this book, A Storm of Swords! If you have not read the first three books in this series, and do not want to get spoiled, please do not read this portion of my review!My favorite story-arc in A Storm of Swords is, hands down, no question, Jaime's. Jaime's story of redemption is honestly one of the best I've ever read. His actions truly are all \"for love\", he just starts learning what unconditional love is a little late in life. In this book, Brienne is on a mission, from Catelyn, to return Jaime to the Lannisters in hopes of getting her daughters back. Jaime's change is so apparent on this trip with Brienne. I think Jaime is also, probably, the most complex character in this world. I can't see him having a happy ending, but I hope his redemption story leads him to it, rather than death.\n\n“I've lost a hand, a father, a son, a sister, and a lover, and soon enough I will lose a brother. And yet they keep telling me House Lannister won this war.”\n\nTyrion is the other Lannister that gives me a lot of feelings. Tyrion is such an amazing metaphor on how the society we live in today treats people that look \"differently.\" His father will never accept him, his sister will never love him, and no one in the kingdom will take him seriously even though the kingdom is only standing because of him in A Clash of Kings. What a terrible hand he is constantly being dealt, and all because of his physical appearance that he has no control over. I want, so badly, for Tyrion to win the game of thrones.\n\n“The greatest fools are ofttimes more clever than the men who laugh at them.”\n\nAnd thanks to Tyrion, we get to see more of a new and beloved character - Oberyn Martell. His pain and revenge mission was really inspiring and heartfelt. I wish we could have seen more of him, and Dorne (don't get me started on show Dorne, please), because he really was an amazing character, who deserved his revenge. Also, he had one of the best duel scenes I've ever read in my entire life. Again, GRRM is a god among men. \n\n“Rhaegar fought valiantly, Rhaegar fought nobly, Rhaegar fought honorably. And Rhaegar died.”\n\nMy favorite character, Davos, and his points of view were a little painful this reread. Stannis is so out of his mind because of his need for power. He is legitimately upset because Robert was King, Renly ruled their home, and Ned got to be hand of the king. None of his actions are because he wants what is best for the realm. Seeing him being hurtful to Davos really upset me. The weird thing is, I like Melisandre and I think she is a great anti-hero, but Stannis just enrages me. I never understood the fan following he has. But that's okay, because Davos is my little cinnamon roll and I pray no harm ever comes of him. Especially because of all he has lost and endured in this book. Oh, poor Catelyn. I guess we can talk about her and how her story-line is, by far, the saddest in this book. Don't get me wrong, Catelyn has upset me very much with her treatment of Jon and her naive thinking in other books, but in this book I can't help but have an immense about of empathy for her. I am not sure I've ever reading anything like the Red Wedding. You can feel Catelyn's helplessness in a way I can't even put into words. Her desperation and her defeat are so palpable. I've never been a fan of Cat or her chapters, but this piece of literature breaks me every time. \n\n“All these kings would do a deal better if they would put down their swords and listen to their mothers.”\n\nIf only Robb would have just listened to his mother. If only he would have been able to keep it in his pants for a night, or to not feel guilt afterwards. If only Robb would have stayed in Winterfell. I mean, I can play the \"if only\" game with Robb all day, but that doesn't make the results of what happened any different. Robb left Winterfell to avenge his father. Robb trusted himself over his mother. Robb is a grown man that wanted to have sex, and felt obliged to marry a girl after he took her virginity. I mean, it's not like he did terrible, unthinkable things, he did things that a young boy would do. It doesn't ease the pain, or make me less upset, but he actions are somewhat understandable. \n\n“He won the war on the battlefield and lost it in a bedchamber, poor fool”\n\nAnd since the Red Wedding is much different from the show, is this going to be the last mention of Jeyne Westerling? I'm not saying consenting adults can't have sex, but she seemed a little manipulative, and so did her father and uncle (who Greywind didn't like). I'm excited to see if anything comes from the Westerling family down the road in this series.Sansa Stark is just getting passed around from one person to the next. I think she really embodies what it is like to be a high-born lady in this world. All she wants is her prince charming, because she has been fed promises of him her whole life, but all she receives is disappointment after disappointment, while counting her ever growing list of dead family members. Also, Littlefinger is gross.Arya, my favorite Stark, is still doing everything in her power to hide that she is a high-born lady in this world. Sometimes, I truly forget her age, but when I remember my heart bleeds all over again. She has endured so many things that I wouldn't wish upon my worst enemies, but she overcomes them all. Arya is super inspiring and motivating, to me. I hope her journey with The Hound isn't over, and the end result turns out like it did in the show.Rickon is nonexistent and Bran is, sadly, forgettable in A Storm of Swords. I'll be honest with you; Dany's story-line in this book is a little boring for me. All of my feelings just manifest to hate for Kraznys mo Nakloz, the slave trader Dany tries to bargain with. Seriously, he makes Joffrey, Cersei, and The Mountain look like saints! Any leftover feelings I had went to being creeped out about Jorah, and how he is such an old pervert. Like, I always thought the show portraying his love for Dany was so wrong. I know it's mostly because Emilia Clarke doesn't look thirteen, but still, Jorah is such a creep. Unfortunately, these two very dark clouds loomed over Dany's story, and made her chapters not as enjoyable as some of the other main protagonists in this book.\n\n“I am the blood of the dragon. I must be strong. I must have fire in my eyes when I face them, not tears.”\n\nSam had the other lackluster chapters, for me. Sam is one of the few characters I like on the show much more than reading about in the books. I know GRRM loves him, and I know his love for books will obviously play a bigger role in this story, but as far as A Storm of Swords goes, Sam was boring as hell. I mean, he's literally killing white walkers and still, somehow, being boring as hell doing it. I don't even understand. But, he did put Jon's name in the running for Lord Commander, so I can't dislike his character or anything. Lord Commander Snow. Oh, how my heart breaks for Jon over and over again, too. He's constantly trying to prove his worth to people who refuse to see it. I loved how he was able to actually experience happiness with Ingrid, even for just a short while. Also, I remembered them having sex, but I completely forgot how much sex him and Ingrid had. Holy shit, I so didn't remember reading that. Oh, Jon Snow. \nTHINGS I MISSED IN MY PREVIOUS REREAD(S):\nMance Rayder is Able, inspired by Bael the Bard, in A Game of Thrones - There is a story that Bael the Bard snuck into Winterfell and had sex with a Stark woman and impregnated her. Mance was inspired by this tale, and in A Game of Thrones a man named Able and a washer woman were very interested in Theon and Arya at the feast that Robert Baratheon attended when he finally made it to Winterfell. Well, this was because it was Mance and the spear wives/wildings in disguise, spying on what was going on in Winterfell! Maege Mormont and Tormund Giantbane are totally in love - I will come back to this in my review of A Dance with Dragons, but this book still hints at the fact that Tormund likes to \"sleep with a she-bear\", and Maege Mormont not only fits the description, but House Mormont's symbol is a bear. Tormund even has the title \"Husband of Bears.\" Tormund has wildlings sons, but they have no mother north of the wall, this could be because Tormund keeps the sons, so they will not be considered bastards. Maege could keeps all the girls, which, by the way, none of them have fathers, and Maege can still marry them off to live good lives under House Mormont. Also, this means Lyanna Mormont, who won everyone's hearts in S6, is one of their love children! Dreams are way more important than what they seem -  Alt Shift X just made an amazing video about some of Dany's dreams and how important their foreshadowing will be, but he has also made an Arya video a while back that really stuck with me this reread. Arya dreams and wargs in this book constantly, and her fascination with warging into Nymeria is such a big part of this book's story. Bran also wargs into Summer, missing how it feels to move on his own, but Arya's dreams really stuck with me and I think will play a much bigger role in her character's development. Also, Alt Shift X is amazing. Please, spam all his videos. If you're a ASOIAF fan, you will not regret it. I'm sorry if this review seems all over the place. I get so passionate about this series, and while writing I have like fifty different trains of thought going! I loved this reread, and I'm learning so much information I had previously missed. I always loved A Storm of Swords, because it seemed so action packed, while giving us this surprise ending that introduces one of the main themes that the show has chosen not to do - Lady Stoneheart. Blog | Twitter | Tumblr | Instagram | Youtube | Twitch"}, {"userName": "Etnik", "userReviewDate": "Apr 12, 2015", "userURL": "http://www.goodreads.com/user/show/34369915-etnik", "userReview": "PERFECTIONFull review to come!"}, {"userName": "Ken-ichi", "userReviewDate": "Nov 25, 2011", "userURL": "http://www.goodreads.com/user/show/216786-ken-ichi", "userReview": "[* Eddard was a lord. Now he is dead.* Catelyn was a lordly lady with a loving, honorable husband and 5 beautiful children. Now she's a widow, her kids are all dead (or so she thinks), and she, also, is dead. Bonus: she's a zombie.* Sansa was an annoying, helpless, spoiled preteen. Now everyone she's ever loved is dead, but she remains annoying and helpless despite it all.* Arya was an endearing highborn tomboy. Now's she's a murderous urchin, but still endearing.* Jon was a bastard. Now he's a lord. But he's still a bastard.* Rob was a nondescript dude. He's still that, except now he's dead.* Bran was a little boy with two eyes who liked to climb. Now he's a slightly older little boy with three eyes who hangs out with frog-eaters, mind melds with animals, and is looking to get lessons from another three-eyed mind melder who might be undead.* Rickon was a side note. He remains so.I keep wondering whether these books are sexist or not, which usually boils down to the question of whether or not female characters have agency. I don't know if that's a reasonable test of gender bias, but that's where my mind goes. It's certainly true that most of the female characters rarely make decisions that influence the narrative, but I think that's equally true of the males. Some exceptions I can think of include Arya escaping Harrenhall, Catelyn freeing Jaime, Danaerys freeing slaves. Cersei, despite being one of the most overtly willful women in the story and the most vocal about gender bias in her society, seems to have little real power. She wanted to spare Eddard, he ended up dead. She wanted to save her kids, Joff ended up dead. She wants to marry her brother but her dad keeps wedding her off for political reasons.Another possible way to approach the issue might be to ask whether the books sanction male chauvinism. I don't think you can read these books and believe that men are intrinsically superior to women, because there are plenty of idiotic men and plenty of capable women. As I wrote in a previous review, I do think these books objectify women much more than they do men, which at the very least is distinctly gynophilic (a new word I just looked up!), and probably allows some hetero men and lesbians to indulge in fantasy that many women might find demeaning. That said, though, speaking as a heterosexual guy, I find most of the sex in these books to be more ham-fisted than arousing. However, I doubt Martin did that intentionally. I guess \"ham-fisted\" could qualify as arousing if you have some kind of ham fetish. Let's just stop talking about this. (hide spoiler)]"}, {"userName": "Jason Koivu", "userReviewDate": "Apr 23, 2013", "userURL": "http://www.goodreads.com/user/show/1742824-jason-koivu", "userReview": "[Sansa. Her willingness to go with Ser Dontos and let him 'take her home' when she knew full well she had no home to go back to was Martin's false step in his effort to get Sansa into Little Finger's clutches. (hide spoiler)]"}, {"userName": "Angela", "userReviewDate": "Jul 30, 2015", "userURL": "http://www.goodreads.com/user/show/30035966-angela", "userReview": "THAT ENDING.... The middle. .. The beginning.... THAT ENDING. WHAT WHAT JUST HAPPENED."}, {"userName": "Roya", "userReviewDate": "Dec 22, 2014", "userURL": "http://www.goodreads.com/user/show/12222982-roya", "userReview": "Second read on 19/03/2016 - 26/04/2016\nI haven't been reading as much as I would like to these days. Aside from this series, which is more of a commitment than anything else, I rarely reach for other books. Perhaps it's because I'm reading nonfiction, but I rarely feel enthusiastic about reading. So far the reading year hasn't been amazing. And I don't think it has to do with the books, but my inability to enjoy them as I used to. Nevertheless, I've noticed that all the books I've re-read recently, I've enjoyed even more than I did the first time.I saw the first episode of the new season of Game of Thrones on Sunday with my dad. Due to a horrific episode in the previous season, I had vowed to never watch it again. Unsurprisingly I decided to give it another chance. In all honesty, I feel as if the show is doing far better than the books regarding its plot. Yes, these books have altered my outlook on reading completely. They have changed my taste overall more than anything else has. Still, until the series is complete, I can't consider it a favourite. There are so many loose ends and no guarantee that they'll ever be tied off.The hope that Martin will complete the series before his death is contagious, but as time passes, I'm beginning to realise how completely unrealistic it is. The show has moved on and my hopes for a conclusion are gradually fading altogether. I sound pessimistic, I know. In all fairness, this is an excellent series and one I'd recommend to nearly everyone. It's absolutely worth the time spent and even the high probability that it will never be completed.I think I've mentioned it before, but reading these again has made me far more tolerant of the POV characters. Karl (my fellow buddy reader) only likes a few (Arya, Tyrion, and Davos), whereas I hardly have any I dislike. Perhaps Samwell, who's the character Martin says he himself resembles best. That explains a lot. The first time I read these I barely liked any of the characters, but now for whatever reason, I can appreciate most of them and it's sort of refreshing.I rarely make updates for these books like I used to and in my reviews I hardly discuss the plot. I apologise, but in the end I feel as if I'm enjoying it too much to make updates. There's too much to talk about to ever fit into one review, and that's disregarding any spoilers. Reading the first half of this book felt like a prison sentence. I didn't want to finish the series and was only doing so because Karl and I had agreed that we would. I never wanted to read a book again, and not because I didn't like books, but because things were a mess. My health for one. Stress from family, The whole not-going-to-college thing, etc. Things I haven't mentioned here and probably won't because I feel they're too dull to elaborate on. In the midst of all this I somehow found that I was able to escape again in the pages of this book. I feel like a lot have things have changed since the first time I read this, but my love for it remains. If anything, it's only increased.\nFirst read on 30/03/2015 - 13/05/2015\nIt's seven in the morning and I already have \nThe Bear and the Maiden Fair\n playing on repeat. I think I'm really beginning to appreciate this series. Each book so far has been better than the one before it. Martin's story, if ever he manages to finish it, may very well become one of my favourites.This book was darker than the other two, but this just made it all the more exciting. It feels like this is where things are finally starting to pick up. Some loose ends were finally tied off too, so that was good.The characters were amazing as always. The younger ones in particular are developing wonderfully. Daenerys and Arya are becoming stronger, Sansa wiser, and even Bran's chapters are improving. Some characters I'm not too fond of, but even Jaime isn't quite as bad as I thought him to be.From beginning to end, this book was as good as the stuff under Casterly Rock. I wish I could say more, and there really is so much more to be said, but I'm at a point in the series where practically anything can be seen as a spoiler.I'm pretty happy with myself though. I'm almost at the part in the series where the show is currently (the fifth episode of the fifth season). I didn't think I'd get here so soon, but here I am.I was considering taking a brief break due to the recent reading slump I've been suffering, but I started the series in December, so whatever the argument, it's a poor one. Onwards!"}, {"userName": "Kelly (and the Book Boar)", "userReviewDate": "Jun 16, 2014", "userURL": "http://www.goodreads.com/user/show/11183856-kelly-and-the-book-boar", "userReview": "Okay, not really. There's still a shit-ton more pages after this."}, {"userName": "Nastassja", "userReviewDate": "Aug 01, 2011", "userURL": "http://www.goodreads.com/user/show/2639169-nastassja", "userReview": "***SPOILER ALERT******SPOILER ALERT******SPOILER ALERT******SPOILER ALERT******SPOILER ALERT***What can I say that hasn't been said before? This series just keeps getting better and better. The third instalment had more twists and turns than I could count, taking me from utter elation to despair and back again, sometimes within a few pages. Things get pretty bleak but also incredibly awesome, everyone suffers horribly, but in the end some really pivotal events occur that I really, really did not see coming. And MAN are there some surprising characters. I'm really looking forward to the next two books, but not looking forward to potentially waiting another 6 DAMN YEARS for the sixth one to come out. Hop to it, George! (P.S. I say that with love) This book takes some of the more, shall we say \"unsavoury\" characters in the series and lets you see into their motivations. In particular Jaime, who until this point is the evil asshole who killed Aerys Targaryen and pushed Bran out of a window. Not to mention he's doing his sister. He's shallow, completely vain, and would kill you so much as look at you. Enter Brienne, Renly's killer-accused, a stubborn (and apparently really, really ugly - we hear about how ugly she is at least a dozen times in every chapter she's in) woman who develops the cutest frienemy relationship with Jaime ever. Between that and having his hand chopped off, his character goes through some rather interesting moral and personality changes and I hate to admit it but I kind of like him now.Tyrion. Oh man. This poor guy. Not only does he lose his nose and practically half his face, he's forced into yet another sham marriage, hoping that for some reason his new wife won't find him as repulsive as he knows he must look. His father and sister want him dead, and he's stripped of all the power that made his character so delightfully cheeky and smarmy in the first two books. The realm hates his guts, the woman he's in love with betrays him, and everything just falls to pieces around him. I just want to give the guy a hug or something. Watching him deliver some much-deserved revenge at the end of the book was satisfying to say the least.Bran, Arya, and Sansa. None of them have a clue what each other are up to, half of them think the other half are dead, and so on. Sansa's story in book three is nothing short of horrifically painful to read. There is a brief moment of relief when she finally escapes the clutches of the Lannisters, only to fall into the clutches of someone else with (shocking, I know) designs on her of their own. Bran hasn't found the three eyed crow yet, but he hasn't been caught by anyone and for once, seems to be doing well. Arya can't seem to stop getting captured by pretty much everyone she runs into, but I almost clapped in joy when she finally got Needle back. As for the bizarre father-daughter relationship she has with the Hound, I kinda wish she hadn't left him to die but I think I'm a little more fond of him than she is. Samwell and Davos were two characters I had troubles getting into, mostly because all Davos does is try to convince Stannis Melisandre is evil (duh - although she does seem rather earnest in her attempts to save the world) and Samwell annoys the crap out of me because all he does is whine. About everything. I am hoping he is finally starting to grow a pair, it seems like he might be toward the end of the book.Daenerys was the only character who seemed to do well, despite the usual betrayals she emerges relatively unscathed. Her attraction to that random slaver guy is a little weird, why do all of the women in the series seem to have terrible taste in men? I am not particularly even that fond of her character since she took off on her own, but the dragons are pretty badass. I just wish she would reach Westeros already so her story didn't seem so disjointed from what is happening in the rest of the book. But oh wait, she's staying in Meereen now. Awesome. I am also waiting for her decision to banish Jorah come back to haunt her, as I am sure it inevitably will.Jon Snow. I love Jon Snow! I can't wait to see him as commander of the Night Watch. He totally earned it. I am also very happy he reunited with Ghost, if I had to read about another direwolf disappearing or dying I was going to throw my book out the window.The Red Wedding chapter was by far the hardest thing to read. You would think the Starks would eventually learn to STOP TRUSTING PEOPLE THEY KNOW WHO WANT THEM DEAD. SERIOUSLY. Catelyn is just as bad as Eddard, it's so infuriating! Although it opens the door for an interesting plot segue, or at least I'm assuming it will. The final page of the book was pretty darn cool as far as that whole thing is concerned.As usual, another page turner for me and I will be starting on the next book right away. I need to finish this series so I can go return to my normal life already."}, {"userName": "Ryan", "userReviewDate": "Sep 06, 2008", "userURL": "http://www.goodreads.com/user/show/1500718-ryan", "userReview": "[rather than defending King's Landing against invading armies, this time he merely watches the Red Viper's \"pole-vault\" duel (hide spoiler)]"}, {"userName": "Graham Herrli", "userReviewDate": "Feb 10, 2012", "userURL": "http://www.goodreads.com/user/show/4503128-graham-herrli", "userReview": "Several aspects of this book make me want to give it only one star, several push me to rate it closer to the opposite end of the spectrum. I give it just over three stars.On the one-star end:The writing style grates. Opening to a random page, I find \"green as the summer grass\" and \"caught between the hammer and the anvil.\" Opening to any other page would provide similar cliches. The book could be shortened without removing substance: long lists of knights names and heraldry may mean something to the author, but to the casual reader with no interest in memorizing the hierarchy of a fictional chivalric system, such lists only delay reading as I skim past them. I suppose I should at least be pleased that Martin appears finally to have learned the word \"crenel\" so that I no longer need to suffer through his repeated mentions of \"the gap between the merlons\"....Yet the writing style is nothing compared to the utter lack of subtlety and tact. What bothers me most about this book is Martin's repeated description of random murders and rapes, included for what I can only assume must be their presumed shock-and-awe value. Although I can appreciate Martin's ability to evoke such emotional responses as righteous anger, pity, and revulsion, I cannot help but think that the overall view of humanity he projects is far too negative. Epic works need sorrow, but they need joy as well, and A Song of Ice and Fire is far too long not to have some lasting joys. Any book of any worth carries with it a message; Martin's seems just to be \"valar morghulis,\" Ancient Valyrian for \"all men must die\" and hardly a message worth sending. On the four- or possibly five-star end:Martin does a wonderful job of characterization by switching to a third-person limited focus upon a new character with each chapter. Just when a character seems most demonized, Martin zooms in upon that character to explain his history and motivation. The inherent flaw to this technique is that to humanize one character's actions yet another character must be demonized. In the end, some characters such as Gregor Clegane and the Mad King Aerys must be left demonized without the reader ever getting a glance at a human side to them.Martin also creates several intriguing religions and passingly hints and a few philosophical quandaries. For example, he passingly touches upon the idea that fire is warmth and light, yet it destroys to create these, thus provoking questions about the goodness or evilness of its nature. Despite its flaws, the book makes me want to keep reading the series. I hope to see the characters, religions, and budding quandaries developed in greater depth in the next book. I hope, perhaps, that one of the characters may even come to the realization that although \"all men must die,\" it is equally true that all men must live. The fire may burn out, but first it burns."}, {"userName": "Kyoko SWords", "userReviewDate": "Dec 10, 2017", "userURL": "http://www.goodreads.com/user/show/6094834-kyoko-swords", "userReview": "Lo he terminado pero me he demorado mucho más de lo que esperaba. Como me suele pasar con los libros que me gustan mucho; intencionalmente atraso la lectura todo lo que puedo porque NO ME LOS QUIERO TERMINAR.No sé si será mi favorito de la saga, pero 'Tormenta de espadas' hasta ahora ha sido el que más me ha hecho emocionar. Lo viví intensamente desde la primera hasta la última página.'Juego de tronos' es un libro lento de introducción. Eso no le quita lo fascinante, pero es abrumador y denso. Entendible porque apenas te están introduciendo en un universo, personajes e historia vastísimas.'Choque de reyes' llega para romper un esquema que 'Juego de tronos' nos \"enseñó\". Nos muestra que no solo estamos ante un juego bélico y militar de reyes, caballeros, mercenarios y bandidos. Si no que también nos adentramos a un mundo de fantasías, maldiciones, brujerías y magia.Es por eso que esta saga se reinventa con cada entrega; cuando crees que todo se ha dicho, llega algo y te rompe la cabeza... Y de paso el corazón.Eso pasa con 'Tormenta de espadas': conspiraciones, acción, traición, drama, sangre, revelación, tragedia y fantasía. Muchas de las dudas que llevábamos a cuestas durante las dos previas entregas, se resuelven aquí. Pero tranquilos, que si creían que ya todos los misterios se habían revelado, PUES NO, que acá nos dejan mil más abiertos (y ese epílogo que es para morir de angustia).De forma objetiva, 'Tormenta de espadas' es el libro más equilibrado de los tres de la saga: el drama, la acción, el crecimiento de los personajes, la fantasía, la narrativa, es que tengo que meter todo en el mismo saco porque todo está en las perfectas dosis. George R. R. Martin no tendrá la narrativa más fascinante, pero su universo lo compensa. Cada nueva historia, cada nuevo nombre, cada nuevo giro, cada nuevo desenlace... Todo hace de Martin un GENIO. No puedo expresar en palabras mi admiración por este sujeto. Es tanta su habilidad, que aunque tiene más de 5 perspectivas narrativas diferentes, ninguna pierde credibilidad. Todos sus personajes tienen una voz auténtica y creíble, pero sobre todo característica: uno ya sabe que Jon habla desde el deber, que Jaimie desde el sarcasmo, Arya desde la valentía, Sansa desde el miedo, Daenerys desde el orgullo... etc.De forma completamente subjetiva, este libro contiene demasiada emoción para mi pobre corazón... Y eso fue lo que más amé de él. Me reí con Jaimie, grité con Tyrion, me angustié con Davos, lloré por El Perro (Y MUCHO. Carajo, no saben como amo al Perro), incluso soñé con Robb y Cat. El desarrollo y evolución de los personajes es brillante; nadie es nunca igual y tu corazón queda dividido al igual que tu juicio. No tengo si no solo halagos para las mil y no sé cuántas páginas que componen 'Tormenta de espadas', tanto así que no tengo absolutamente negativo que comentar.Pero ojo, siempre lo he dicho. Me cuesta un montón ser impersonal con los libros que disfruto. Siempre que me topo en este tipo de situaciones, termino engrandeciendo hasta los defectos de los libros que amo. Esta saga no es para todo tipo de personas y de eso sí soy consciente, pero si tú eres ese tipo de persona que cree que 'Juego de tronos' es una lectura/universo adecuado para ti, adelante. No lo dudes. 'Juego de Tronos' y 'Choque de reyes' es solo una pequeña entrada para lo que te vas a encontrar en 'Tormenta de espadas'; y ni siquiera esos dos libros previos llegan a prepararte el corazón para toda la adrenalina que vas a sentir con este.Pero como ya dije, me es difícil mantener la calma cuando se trata de hablar (y ya puedo afirmarlo con total certeza) de la que se ha convertido en mi saga favorita.5 estrellas y mi fervor infinito para este libro."}, {"userName": "Ben Babcock", "userReviewDate": "Jul 11, 2010", "userURL": "http://www.goodreads.com/user/show/1188122-ben-babcock", "userReview": "N.B.: As with my review of A Clash of Kings, I will avoid spoilers for this book but not for previous books.We had a good thing going back in the beginning of A Game of Thrones. Robert Baratheon was King of Westeros, and while he wasn't a great guy, at least the kingdom was stable. Then he died and it all went to hell. Now we have more kings than castles. Joffrey and Stannis both lay claim to the Iron Throne, and Robb Stark has managed to get himself declared the King in the North and anger both of them in the process—not that Robb has much of the north any more, because Balon Greyjoy, ruler of the Iron Islands, has invaded that while Robb is away fighting Lannisters. Oh, and across the Narrow Sea, Daenerys Targaryen continues to dream about returning to retake Westeros in a blaze of dragon-assisted glory.So the situation is a mess, an ugly mess, and it only gets worse. And, having lured you into this review with my friendly assurances that I won't spoil anything about this book, I now betray you. (Please imagine me laughing maniacally and twirling my non-existent moustache as you read the next sentence.)A lot of characters you probably like die in this book.Of course, everyone who has read A Game of Thrones knows there are no \"safe\" characters in these books. Martin will kill off anyone, but the body count does rise considerably in A Storm of Swords. A lot of reviews I've read express disappointment in this, especially when the reviewer considers some of those who die the \"protagonists\" of the series. There is one comment on a review (which does contain spoilers for this book) that captures this attitude quite nicely, and at the risk of skirting spoilers, I will quote from it:Maybe that's life. Maybe it's \"real life\" pure and simple and Martin should be lauded as a genius for injecting that grim reality into his fantasy series: life sometimes sucks and on your way to glory, you just die. But that's not what I personally want to get out of something in which I invest countless hours of reading. I want the payoff. I want to see all the struggles and triumphs of the characters mean something. The Starks were the heroes in this world - they were a family and I wanted to see that family come back together again.I want that too. It's a reasonable want to have, because regardless of the Starks' status as protagonists, they embody attributes of goodness that make us want to see them succeed. Unfortunately, that's not going to happen, and not just because Martin is dedicated to a grim portrayal of the medieval reality. It's not going to happen because that would not make sense given the political situation in Westeros. And it goes all the way back to A Game of Thrones and the death of King Robert.Robert's death broke the kingdom, and we cannot put it back together again so everything will be just as it was. None of the claimants for the Iron Throne are going to pick up where Robert left off: Joffrey is a mean-spirited boy controlled by the Lannisters; Stannis is rigid and joyless; and Daenerys is inexperienced. Regardless of whichever faction eventually emerges victorious, the new Westeros will be very different from the Westeros as it was under Robert. And in none of these versions of Westeros do I see much place for a reunited Stark family—certainly not after Robb seceded from the Iron Throne. Perhaps if the series ended with Robb successfully cementing his place as King in the North and leaving the southrons to fight amongst themselves for the Iron Throne—but that once again assumes the conceit that the Starks are the protagonists and that theirs is the central story of this series. I'm not prepared to do that. As much as I like the Starks, viewing them as protagonists severely restricts the scope of this series, at least in my opinion.I think it's fine to be disappointed with A Song of Ice and Fire for failing to meet that expectation. But there's also a bit of caveat emptor going on here: what did you expect, really? Martin goes to great lengths to point out that his world is not like a fairy tale. We see this in the brutal awakening Sansa receives in A Game of Thrones, and again in A Clash of Kings, and again in this book. She's a little slow on the uptake, but she is finally beginning to grasp that she is a chess piece and life is not like a song, that few knights are truly brave and noble and honourable, and that she cannot trust anyone, not even those who claim kinship with her. Martin has never promised us, explicitly or implicitly, that the Starks were going to get a family \"happily-ever-after.\" He has always been upfront about the \"grim reality\" of Westeros. So while I understand and empathize with those who want something different, I won't criticize Martin for failing to deliver something he never so much as hinted at giving us. As I concluded in my review of A Game of Thrones,… a lot of people build up an idea about this book in their minds, and when it fails to conform to that idea, they become disillusioned and kick it to the curb.Martin's grim approach to his fantasy actually makes finding meaning in \"the struggles and the triumphs of the characters\" possible. A Song of Ice and Fire has a cast of thousands of characters who are all at odds with one another. With those dynamics, telling a traditional fantasy story with the conventional tropes of heroism would be rather hopeless. And so, in order to make the struggles of his characters meaningful, Martin needs more than a single, symbolic death or a crucial moment of self-sacrifice; he needs to inflict upon each character unique and harrowing hardships. Although these trials often share similar themes, their particulars are always different: e.g., Arya and Sansa both receive a cascading series of reality checks in this book, but each receives them in a different way.Some of the most interesting developments in A Storm of Swords come not from the Starks but from the Lannisters. There is a new sheriff in King's Landing: Tywin Lannister is now the Hand, and he manages to alienate not one, not two, but all three of his children! He treats Tyrion with nothing but loathing and disgust. He undermines Cersei's position as Queen Regent and Joffrey's adviser, plotting instead to remarry her to anyone he needs as an ally. And he and Jaime come to sharp words after Jaime decides to assert himself. All three Lannister siblings suddenly discover that they are not quite as powerful, as clever, as well-positioned as they thought they were. I liked watching Tyrion come to terms with his treatment at Tywin's hands; I loved watching Jaime. Martin adds depth to the Kingslayer, thanks in part to an intriguing chemistry of honour and duty between him and Brienne of Tarth. While that does not make up for what Jaime has previously done, it lets me sympathize with him. In many ways, he has been as much a pawn his entire life as Sansa has been. A Storm of Swords is a rude awakening for him as well—in more ways than others—and there is a glimmer of hope that he will turn down the path of redemption. It is hard to tell, though, with the chaos in King's Landing at the close of this book. (More moustache-twirling here, muwhahahaha.)At this point, I am having a difficult time deciding who I want to see win the throne. I am still trying to determine whether Littlefinger is just an opportunist or secretly a Chessmaster manipulating all the events from behind the scenes. If you really want to know, though … I wouldn't mind seeing Daenerys on the Iron Throne.After a disappointing story in A Clash of Kings, Daenerys returns in A Storm of Swords and kicks ass. In A Game of Thrones we watched Daenerys grow from victim and young, scared girl to the leader of a tribe of Dothraki and mother of dragons. Now she is becoming a queen in her own right, not to mention a pretty savvy general. More importantly, Daenerys is the perfect mix of outsider and familiar face that the kingdom of Westeros needs right now. She is a Targaryen, a member of the family that ruled for hundreds of years until Robert's rebellion. So her claim is pretty solid. Unlike her father Aerys, however, she seems to lack the madness that made a continued Targaryen rule problematic. So far her approach to justice has been a lot easier to stomach than Stannis' troubling religious fervour or Joffrey's … well, everything. So I am officially declaring for Team Daenerys, at least for now—I reserve the right to jump ship at the first sign that Jon Snow decides to be King of Awesomeness and name Sam Tarly his Hand.Speaking of Jon and Sam, A Storm of Swords finally hearkens back to the threat of the Others. I appreciate Martin returning to this plot after putting it on the backburner for A Clash of Kings. The tension created by his portrayal of a diminished and nearly-beaten Night's Watch reminds me of the sense of foreboding that accompanies Robert's dying days in A Game of Thrones: it is going to get worse before it gets better. After all, winter is coming.It's true enough that Martin is asking a lot of us. With each book, the lines between protagonist and antagonist blur even more, and it seems less and less clear who we should want to see victorious. That demands a certain level of faith from the reader, faith that Martin will present a resolution that, if not the happily-ever-after we are so trained to expect, at least crystallizes the series into a final, definitive state. I can see why this type of demand would give some readers pause. The fact that Martin makes it while continuing to deliver stories replete with intrigue and plots, promises and betrayal, and love and war means that I am willing to wait and see where he takes us next.My Reviews of A Song of Ice and Fire:← A Clash of Kings | A Feast for Crows →"}, {"userName": "Franco  Santos", "userReviewDate": "Sep 01, 2014", "userURL": "http://www.goodreads.com/user/show/29931457-franco-santos", "userReview": "Tormenta de Espadas es un libro que me atrapó desde la primera página. Es increíble. Muy intenso, desgarrador y es imposible soltarlo. Sus 1200 carillas se pasan rapidísimo, y cuando lo terminás sentís un vacío inmenso. El enano se ha levantado de entre los muertos. Y mira, está aún más feo que antes, corre y cuéntaselo a tus amigas.En muchas partes me dejó literalmente boquiabierto. Martin con este libro llegó a su punto cumbre, al momento álgido de la historia, por ahora. Tantas muertes, tanto dolor, tanta desconfianza. Tiene hartas escenas extraordinarias que se nos quedan grabadas a fuego en nuestras mentes.A veces, los mayores estúpidos son más astutos que los que se ríen de ellos.En este tomo la vida de los personajes y los reinos cambian en todos los aspectos; es un quiebre en la saga. La primera mitad es sublime y la segunda es, aunque parezca imposible, mejor. Tiene un final que me esperaba, sin embargo, el cómo sí me sorprendió. Realmente increíble. Martin creó una obra maestra. Directo a mi shelf de favoritos."}, {"userName": "mrsj", "userReviewDate": "Jun 16, 2012", "userURL": "http://www.goodreads.com/user/show/3579525-mrsj", "userReview": "[especially the Red Wedding  (hide spoiler)]"}, {"userName": "Jim", "userReviewDate": "Jul 12, 2010", "userURL": "http://www.goodreads.com/user/show/2193587-jim", "userReview": "A Storm of Swords, by author George R.R. Martin, is the third installment in the 'A Song of Ice and Fire' series, and has become a must-read series for fantasy enthusiasts at this point. The Battle of the Blackwater is finished, but the Seven Kingdoms are hardly at peace. This story continues with the aftermath of the slaughter outside the walls of King's Landing and the ongoing campaigns of the kings to lay claim to Westeros. Tywin Lannister has arrived at King's Landing to take control of the kingdoms through his grandson, King Joffrey Baratheon. Robb Stark continues his campaign to unite the west and rid his mother's homeland of the Lannisters, but must now contest with the Ironmen taking control of his kingdom in the north. Stannis Baratheon sits defeated back in his home of Dragonstone, but plots his next move with the help of the Red Priestess, Melissandre. Meanwhile, Daenerys Targaryen, mother of the last dragons, plots, maneuvers and rampages her way through the Free Cities in the name of justice. All while Jon Snow contends with infiltrating the massive, reckless barbarian horde as an agent for the Night's Watch. Without question this is the best of the series so far. Sure, Martin obsesses with his usual descriptions of every single character's clothing and armor down to the last ridiculous detail. He also maintains his peculiar fondness for having to explain countless extravagant meals with his famous 'birds launching out of pies' dish. But he makes up for it with a realism and grit rarely found in the fantasy genre. Plus, this book has everything men love to read about: blood, guts and decapitations galore, giant knights whacking helpless stable boys' heads in half, hot priestess babes with red eyes, teenage lesbian sex, an angry noseless midget, and some fat kid who slays zombies. What could be better than that? Martin has some amazing plot twists that you just don't see coming and he's fearless with torturing, maiming and killing off vital characters. The character development is getting deeper and better, the action is kick-ass Braveheart style, and the magic and mysticism continue to get more entwined to create a mysterious and wondrous world. This is the best book I've read in some time."}, {"userName": "Laz", "userReviewDate": "Dec 20, 2013", "userURL": "http://www.goodreads.com/user/show/22313662-laz", "userReview": "BLOODY HELL THIS WAS PERFECT. This book had me in the beginning like: Then everyone started dying and it was a mix of: This And this And then I read the last 4 chapters and I was like:What I loved about this book was the fact that it never, not even for a second, made you think of the tv series. I felt like reading and experiencing all these effing events for the first time even though I've watched all of the seasons of the tv series.This book had an edge that the first book had but the second lacked completely. It's an extraordinary novel which is full of twists and treachery, bravery and cowardry, faith and love, erroneous and righteous, gallantry and thievery, insanity and sanity, war and peace. Kings and queens, bastards and first-borns, lords and ladies. Yes, yes, I can go on for hours.Ummm, what else? Oh, yes, there is an abundance of \"what the fuck\" moments that are just to the point and leave you, well, I couldn't be more depicting with the gifs I posted above.Mr. Martin leaves the readers breathless once more as he delves more into this fantastic world he's created from scratch. It's incredible to see the ordeals everyone is going through and it's even more incredible to see how he doesn't hesitate to kill a character, even important ones. If you ask me which I think the best book in the series is I'll reply \"the third\" without even blinking because it indeed was. What was special about this book was how Mr. Martin woves certain things into a character's personality and then how he loves making stubborn characters who won't ever change for anyone and for anything. What is more, it's also exemplary, regarding some characters, how much character development there is, and what is even more worth applauding is the fact that even though the characters are too many there is still a balance at how he delivers the chapters. The enormity of this book scared me in the beginning but while reading more into this I wished it was longer because at some point you get lost in the story and you just can't part with it.What I love about these books is how we see both sides of the world. The one which feels too real and the one which is full of magic and wonders. There is a harmony between the two and the one is joined by the other. The lines are both blurred and kept at bay in an odd way. I bet it's the ice and fire thingy.Well, wow, the next book in the series is one I haven't even seen on screen yet. I'm that much more excited about it."}], "description": "An alternate cover for this isbn can be found here.Here is the third volume in George R.R. Martin's magnificent cycle of novels that includes A Game of Thrones and A Clash of Kings. Together, this series comprises a genuine masterpiece of modern fantasy, destined to stand as one of the great achievements of imaginative fiction.Of the five contenders for power, one is dead, another in disfavor, and still the wars rage as alliances are made and broken. Joffrey sits on the Iron Throne, the uneasy ruler of the Seven Kingdoms. His most bitter rival, Lord Stannis, stands defeated and disgraced, victim of the sorceress who holds him in her thrall. Young Robb still rules the North from the fortress of Riverrun. Meanwhile, making her way across a blood-drenched continent is the exiled queen, Daenerys, mistress of the only three dragons still left in the world. And as opposing forces manoeuver for the final showdown, an army of barbaric wildlings arrives from the outermost limits of civilization, accompanied by a horde of mythical Others—a supernatural army of the living dead whose animated corpses are unstoppable. As the future of the land hangs in the balance, no one will rest until the Seven Kingdoms have exploded in a veritable storm of swords...", "title": "A Storm of Swords\n      \n          (A Song of Ice and Fire #3)", "url": "http://www.goodreads.com/book/show/62291.A_Storm_of_Swords", "average": 4.54, "cover": "https://images.gr-assets.com/books/1497931121l/62291.jpg", "reviews": 20245, "authors": [{"url": "https://www.goodreads.com/author/show/346732.George_R_R_Martin", "name": "George R.R. Martin"}], "type": ["Fiction", "Fantasy", "Fantasy", "Science Fiction Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/62291.A_Storm_of_Swords", "http://www.goodreads.com/book/show/10396652-a-storm-of-swords", "http://www.goodreads.com/book/show/10902111-a-storm-of-swords", "http://www.goodreads.com/book/show/13393471-a-storm-of-swords", "http://www.goodreads.com/book/show/1179967.A_Storm_of_Swords", "http://www.goodreads.com/book/show/13253102-a-storm-of-swords", "http://www.goodreads.com/book/show/11158673-a-storm-of-swords", "http://www.goodreads.com/book/show/7013345-a-storm-of-swords", "http://www.goodreads.com/book/show/6307964-a-storm-of-swords", "http://www.goodreads.com/book/show/643629.A_Storm_of_Swords", "http://www.goodreads.com/book/show/16010516-tormenta-de-espadas", "http://www.goodreads.com/book/show/13633674-tormenta-de-espadas", "http://www.goodreads.com/book/show/13355451-a-storm-of-swords", "http://www.goodreads.com/book/show/13496.A_Game_of_Thrones", "http://www.goodreads.com/book/show/10572.A_Clash_of_Kings", "http://www.goodreads.com/book/show/13497.A_Feast_for_Crows", "http://www.goodreads.com/book/show/10664113-a-dance-with-dragons", "http://www.goodreads.com/book/show/147915.A_Storm_of_Swords"]}