{"ratings": 636345, "userreviews": [{"userName": "Stephen", "userReviewDate": "Dec 11, 2010", "userURL": "http://www.goodreads.com/user/show/1413439-stephen", "userReview": "Considered Grisham's best novel by many readers far more perspicacious than moi, this well-written, emotionally-charged thriller certainly delivers. While it doesn't rank as my eye's own personal apple, I can certainly see why it is esteemed by fans of both the legal-thriller and Grisham. Despite being fast-paced and a true page-turner (what I would call a popcorn-read), there's a gravity and social conscience that pervades the story and adds a weight to the narrative. There is depth here, more than I expected. Setting aside for the moment my gripes over some of the language used in the book (one vulgarity in particular), Grisham does a nice job of capturing the setting and providing an authentic feel and voice to his characters. Overall, a satisfying read that held my attention throughout. PLOT SUMMARY:Despite its brisky pace, Grisham’s Mississippi-based legal thriller deals with some tough, serious issues (e.g., race-relations, vigilantism and “justice versus lawful”). The plot centers on the trial of a poor black father who murders the two white shit stains who raped, tortured and brutalized his 10 year-old daughter. The crime and the subsequent trial triggers a firestorm of racial tension as factions on both sides become vocal and volatile. From the opening pages that describe the brutal rape (which was gut-wrenching in the extreme to experience, especially as a dad) through the final reading of the verdict, Grisham drives the narrative effortlessly and keeps the reader hooked and engaged. His story-telling is excellent. THOUGHTS:However......now that I have both seen the movie version and read the book, my final verdict is that the film is both more enjoyable and the higher quality product of the two. I say this despite the fact that the movie is arguably the “sweatiest” most lathery film in American history and my wife and I crack up about that every time we see it. \n\nThose pictures don’t do credit to the muggy, perspiration-overload of the real thing, but if you haven’t seen it, trust me…the movie dripped sudor from every pore like a hooker in church. Words like sheen and glistening are too understated. It was more like the actors showered, got dressed without drying off, walked through a “mister” and then wiped down with a moist towelette before every...single...scene.Now, not everyone was complaining about the drenchiness since it was Matthew McConaughey, Sam “it’s the one that says Bad MF” Jackson, Ashley Judd and Sandra Bullock doing the sweating, but still...hilarious and a bit distracting. BOOK GRIPES:Keep in mind that I liked the book, so my gripes below really point towards why I didn't rate the book higher than 3 stars.1. Too much fluff: When you can take a 528 page book and condense it into a 2+ hour movie that captures perfectly the essence of the story and manages to be even more emotionally powerful, it indicates that the novel was a little thin in the story department. This is the case here. While the expanded story and segues are interesting, the central plot contained too much unnecessariness that could’ve been easily discarded without touching the heart of the story...as the filmmakers did. 2. Excessive use of \"N\" word: Given that the novel is set in 1984, I had a real problem with the significant use of the “N” word* in the story. *(No, South Park fans, I am not referring to “nagger.”). \n Had this been set in the 50’s or 60’s, I would have seen it as a product of the times and swallowed my uncomfortableness. However, it just seems odd that as late as 1984, the word (and the frame of mind that goes with it) would be used so casually and regularly. Given that Grisham is from the South and went to school in Mississippi, he may be spot on with his characterization, and he probably is. If true, this is just very, very sad. Still, its constant use grated on me and I thought the movie did a much better job with the dialogue. This is coming from someone who does not normally favor filtering words through the PC processor. 3. The Main Character: Jake Brigance is not nearly as likeable in the book as he in the movie and I found it hard to engage with him. Now I think we can all agree that Matt McConaughey is not exactly a high level thespian. \nHowever, he did bring the right tone to this role and I found myself comparing the novel’s version unfavorably. 4. The Ending: Again, I liked the movie version so, so, so much better. While the main outcome is the same, I really liked the way the movie handled the climactic closing argument and was disappointed in the novels path to the verdict. I also really enjoyed the last scene in the movie where Jake and his family go to a barbeque at Carl Lee’s house where their two daughters can play. I thought it was perfect. Okay, so enough griping. I thought the book was good. I thought the movie was very good. If you've seen the movie, I don't think you are missing much by skipping the book. However, if you haven't seen the film, I would recommend reading the book first and then watching the adaptation. I think you will enjoy both.3.0 stars. Recommended."}, {"userName": "Councillor", "userReviewDate": "Nov 10, 2015", "userURL": "http://www.goodreads.com/user/show/40792319-councillor", "userReview": "\"A Time to Kill\" is a riveting story of retribution and justice ... so does the title imply. Replace riveting by frustrating and you know what I felt while reading this doorstopper of a book.On more than 500 pages, John Grisham delves deep into the schemes and entanglements of a trial in the Southern USA. The premise was so interesting that it was impossible not to pick this book up: A ten-year-old girl is raped by two drunken men, and her father takes the law into his own hands by killing the rapists of his daughter. The major problem in this case: The girl and her father are black, and the two rapists are white. If there is one thing Grisham manages to implement perfectly in his story, then it is the exploration of arguments about why the father should be sentenced to death or declared innocent as a result of the circumstances. The reader always bears in his mind how the jury would be reacting in case the roles were reversed - if two black men had raped a white girl of ten years -, but the fact that acquitting the father of his crime would encourage many other people to commit self-administered justice too also needs to be taken into account.Might this premise deliver storytelling material for so many pages? Yes, it might. Only ... it didn't. Shortly after Gary Su Jake Brigance assumed his duty of defending his client, the novel drifted away into long-winded, boring and insignificant rambling. Many people claim this story to be very realistic for how the situation for black people in Mississippi during the 1980's was like. I have never lived there, so I have no idea how real it really was, but the way Jake Brigance acted and behaved definitely did not feel realistic to me. Because who doesn't get royally dunk three days before an important trial? Never before have I been that frustrated by a protagonist who behaved like an asshole towards his wife and just about everyone else he encountered, but was still portrayed like the absolute hero. Throw an incapable prosecutor into the game to make Brigance's light shine even brighter, and you have the perfect Grisham version of Fleming's James Bond.And let's not even address the lack of emotions during the entire novel. You might think that a ten-year-old girl being raped by two drunken men will leave you feeling sorry for her and her family, on the edge of shedding tears? I have to disappoint you, because Grisham's writing deprives every single emotion from every potentially touching scene. You never know how a character feels inside his soul, because Grisham only tells, only allows his reader to guess what his characters might feel at this very moment. 1.5 stars, rounded up due to the interesting premise and the very relevant topic down due to me reconsidering the relevance of the rating system Goodreads suggests (1 star equaling \"didn't like it\")."}, {"userName": "Rebecca McNutt", "userReviewDate": "Jul 18, 2017", "userURL": "http://www.goodreads.com/user/show/36977686-rebecca-mcnutt", "userReview": "Riveting, somber and powerful, A Time to Kill is a totally unforgettable legal thriller telling of secluded prejudice in a small Southern town, and one lawyer who wants to change the world."}, {"userName": "Brina", "userReviewDate": "Mar 29, 2016", "userURL": "http://www.goodreads.com/user/show/2933855-brina", "userReview": "Read when it first came out. I really ought to reread this prior to reading Sycamore Row. I remember being captivated with the story of Jake Brigance but I details are sketchy at best at this time. Seems like a summer reread is on the horizon."}, {"userName": "James Thane", "userReviewDate": "Mar 23, 2010", "userURL": "http://www.goodreads.com/user/show/3483907-james-thane", "userReview": "I confess that when one of my book clubs made this our monthly selection, I approached it with more than a little trepidation. I knew that this was Grisham's first book and that when it was first published as a hardcover, he could hardly give it away. Sales were so poor that there was initially no paperback release. Only after the success of The Firm and other of Grisham's books was this one finally resurrected and released in paperback.Like most of Grisham's other readers, I jumped aboard the train with The Firm and never looked back. Though I've enjoyed most of his later books, I simply took it for granted that this first effort was probably his \"practice\" novel, that it was not very good, and hence the poor sales. I further assumed that his publisher, anxious to milk the Grisham brand for all it was worth, only finally published A Time to Kill in paper simply to cash in. Accordingly, I've avoided it all these years until I was finally forced to read it.I'm very happy that I was. The book turned out to be a gripping story with better-defined characters and a much more interesting setting than many of Grisham's later books. In fact, it may be one of his best.The tiny town of Clanton, Mississippi, is shocked when two drunk and drug-addled thugs viciously assault a ten-year-old girl, failing to kill her only because they could not find a bridge from which to throw the child. The two are quickly arrested and charged with various crimes related to the attack, when the girl's father, a decorated Vietnam vet, takes the law into his own hands and kills the men who so gruesomely violated his daughter.The father hires a young, up-and-coming lawyer named Jake Brigance to represent him. But this is Mississippi and the case is complicated by the fact that the victim and her father are black while the two dead thugs were white. The population of the town is evenly divided between blacks and whites and, while most people irrespective of race, condemn the actions of the two thugs, they are divided, mostly along racial lines, over the issue of whether the father should be convicted of premeditated murder or be given a medal for ridding the town of the two scumbags.Grisham plays fair with both sides, and it's clear that he knows very well the setting, the people and the dynamics of the situation. There are a number of great characters in this novel and very few of them are pure of heart. These are much more complex characters than those usually served up in books like this, and the story grabs you from the start. It also raises a lot of thought-provoking questions. It's a great read, and I'm only sorry that it took me so long to get to it."}, {"userName": "Ahmad Sharabiani", "userReviewDate": "Sep 30, 2013", "userURL": "http://www.goodreads.com/user/show/614778-ahmad-sharabiani", "userReview": "A Time to Kill, John GrishamA Time to Kill is a 1988 legal thriller by John Grisham. It was Grisham's first novel. تاریخ نخستین خوانش: ماه اکتبر سال 2001 میلادیعنوان: زمانی برای کشتن؛ نویسنده: جان گریشام؛ مترجم: هادی عادلپور؛ مشخصات نشر: تهران، کوشش، 1378، در 526 ص؛ شابک: 9646636145؛ موضوع: داستانهای نویسندگان امریکایی قرن 20 معنوان: زمانی برای کشتن؛ نویسنده: جان گریشام؛ مترجم: جواد سید اشرف؛ مشخصات نشر: تهران، زرین، 1378، در 640 ص؛ شابک: 9644070178؛ داستان وکیل جوانی به نام «جیک بریگانس» است که دفاع از یک متهم سیاه پوست، در برابر هیئت منصفه ای سفیدپوست را برعهده میگیرد، جریان بسیار پیچیده، اما جذاب و شیرین پیش میرود. البته از نظر کسی که به سیستم قضایی آمریکا علاقه هم داشته باشد. «زمانی برای کشتن» نخستین کتاب «جان گریشام»، و گویا نزدیکترین اثر به شخصیت ایشان باشد. ا. شربیانی"}, {"userName": "Andre Gonzalez", "userReviewDate": "Oct 24, 2017", "userURL": "http://www.goodreads.com/user/show/53583787-andre-gonzalez", "userReview": "This book totally rocked my world! I had asked for a legal thriller as a recommendation and I'm glad to have this one suggested! The racial tension in this story felt as real as it did in To Kill A Mockingbird. I felt I was right there in Clanton, Mississippi trying to dodge the KKK and marching with everyone else. This is my first Grisham novel, and I'll definitely be exploring more!"}, {"userName": "Charlotte", "userReviewDate": "Feb 29, 2008", "userURL": "http://www.goodreads.com/user/show/225244-charlotte", "userReview": "Continuing with my reading of all Grisham titles. This is the first I've read of the southern trial novels. Extensive use of the N word was disturbing but it's used for an accurate portrayal of the voice of white southerners of the period, not gratuitously. Much more disturbing was the scene of the violent attack on a little girl that's the basis of the story. Again, not gratuitous. This novel was based on a true story. A thoughtful and thought provoking reminder of the cruelty and racial prejudice in our not-so-far past. Really interesting descriptions of the trial and the jury and its deliberations."}, {"userName": "Tadiana ✩Night Owl☽", "userReviewDate": "Jan 16, 2014", "userURL": "http://www.goodreads.com/user/show/8734459-tadiana-night-owl", "userReview": "One of my least favorite Grisham's books, and that's saying something. Actually I kind of liked The Pelican Brief and one or two of his others, but mostly they strike me as mediocre writing combined, more often than not, with pulpit-pounding and breast-beating about some legal issue. In this case the setting is a murder trial for a African-American man who gunned down his 10 year old daughter's rapists, who are stereotypical Southern white trash racists who tried to murder this little girl and left her for dead. The legal question is whether jury nullification is sometimes justified. Grisham, as par for the course, loads the dice on that issue.I've only read as many of Grisham's books as I have because my father-in-law (another voracious reader) thought that because I was a lawyer I would automatically like Grisham books, so I regularly received them from him as birthday and Christmas presents. My FIL is gone now, may he rest in peace, so no more Grisham for me."}, {"userName": "Shaun", "userReviewDate": "May 23, 2016", "userURL": "http://www.goodreads.com/user/show/9779623-shaun", "userReview": "A satisfying legal thriller.Grisham gives the reader much to ponder in this story of a black man who kills two men who raped and brutally beat his 10 year-old daughter. It's hard not to root for the father. It also makes one wonder if the story would have worked as well had it been his wife or sister who had been raped instead (probably not), which in and of itself is worth thinking about. It certainly makes one wonder if and when murder is ever justifiable, and exactly how we draw those lines in the sand as individuals and as a society.That said, there were times the characters felt one dimensional. Lots of stereotypes. Occasionally, the story and the characters bordered on satire. Toward the end I grew weary of the tongue-and-cheek dialogue between characters. I also felt Grisham offers a very cynical view of lawyers and the legal process, which at times adds to the story and at other times takes away from it.Overall, an incredibly well-written story, with relevant and important themes."}, {"userName": "Jenny", "userReviewDate": "Aug 22, 2007", "userURL": "http://www.goodreads.com/user/show/300899-jenny", "userReview": "There are 104 pages of review on this book, and I read two pages worth and agreed with a dozen or so. I always wondered why cheap thrillers like this book never get discussed in great literature classes and I think I can answer that question. 1. Because there is no interpretation. Books like this are no brainers. Little thinking is required.That's really it. Now for the book review. First of all, Grisham needed like 1 or 2 more pages to close out. He rushed the ending. Sure it was a great thriller. It posed a great ethical question- Is it ever right to take the justice system in your own hand? Grisham evidently thinks so and the reader most likely will feel sympathy for the \"killer\"- Carl Lee. This is my third John Grisham book- I agree with the readers who say once you've read one Grisham book, you've read them all. He makes practicing law sound very appealing, like CSI flaunts investagaters. I read the Firm first- absolutely loved it. The Runaway Jury was definately a 2 star rating. This was a thriller, so I gave it a 3. I don't know. The whole book left me feeling really empty and thinking what am I doing wasting my time reading these types of books?"}, {"userName": "Bryce", "userReviewDate": "Feb 02, 2009", "userURL": "http://www.goodreads.com/user/show/1987923-bryce", "userReview": "My favorite Grisham, and I've read almost all of them. He states in his own words that sometimes he gets \"a bit verbose\" - but I really liked it because of the depth that he goes into on the characters, which is mostly absent from his other stories."}, {"userName": "Karl Marberger", "userReviewDate": "Jun 02, 2018", "userURL": "http://www.goodreads.com/user/show/58621278-karl-marberger", "userReview": "I liked it."}, {"userName": "Paul Eckert", "userReviewDate": "Feb 11, 2011", "userURL": "http://www.goodreads.com/user/show/2894762-paul-eckert", "userReview": "A young black girl is raped by two rednecks in Mississippi. She survives and is able to identify the two men. Before their trial begins, the girl’s daddy shows up at the court and mows them down with an M16. Now the black dad is on trial for his life, and attorney Jake Brigantz (the archetype of all Grisham lawyers to come in future novels – young, cocky, inexperienced lawyer takes on an evil entity, in this case racism) has taken on the case in order to keep the well-meaning father off death row. At the heart of the novel is the question, “Would you convict a man for killing the men that raped and beat his daughter?” Grisham effectively sets the stage for a theme of conditional morality that carries really well throughout the book. At every plot point, someone is facing a morally ambiguous decision that affects the lives of other people. Many of them have no problem bending the rules, or being downright unethical. Our hero, Brigantz, seems to have the most difficult decisions to make, as his decisions affect more people than anyone else. He doesn’t spend a lot of time considering whether his decisions are right, but he certainly suffers the consequences of the decisions he makes. As in his other novels that I’ve read, Grisham does the morality tale well within the confines of the legal system. He shows how our legal system, theoretically our most fair and objective institution, is full of gaping holes that are not easily fixed. It’s a classic prisoner’s dilemma (no pun intended) wherein one must be willing to sink to the lowest ethical rung of the opposition in order to have a chance of winning. A system of justice that is supposed to be based on a judgment of the facts instead hinges on so much more.This was Grisham’s first novel, and it shows in a lot of ways (and not all of them are bad). For one thing, the story is way too long. Grisham drags the reader through every painstaking point in the legal process, even those moments which have little or no impact at all on the case or the story at large. Subplots are carried for three quarters of the book, only to be conveniently discarded near the end. As for the characters, Jake Brigantz is too good to be real. I don’t know much about being a lawyer, but I’m willing to bet that it is nearly impossible to run a successful law practice with just yourself and a secretary, and even less plausible that one could take this bare bones practice and defend one of the biggest capital murder cases in state history with just the help of a couple of lawyer friends and a gorgeous stranger that literally just shows up at the front door. Luckily, Grisham’s brush with sex scenes are brief, because they’re almost too embarrassing too read, like a horny fourteen-year-old boy’s idea of sex. Every time Jake’s wife is on the page, Grisham never fails to mention her ‘bronze’ legs and arms, and in one paragraph mentions ‘bronze legs’ at least three times. There are many plot holes and inconsistencies, though many are forgivable for the sake of the story. Fortunately, the court scenes are rather short, and the story is propelled by everything happening around the trial. The end is satisfactory enough, and I think it’s the right ending for this story. A Time to Kill is a story of competing interests, and in the end no one is truly a good person. The fun is trying to figure out one’s own position amongst the many presented in the story, and thankfully there are few easy answers."}, {"userName": "A Girl Has No Name", "userReviewDate": "Oct 18, 2016", "userURL": "http://www.goodreads.com/user/show/29402776-a-girl-has-no-name", "userReview": "4 stars!Die Jury - A Time To Kill in English – was the first Grisham I have read. I’ve heard about him and his books a lot, but somehow I kept going back for other authors I already knew. But I have to say that I enjoyed this one a lot. I won’t write anything about the plot itself – most people know it anyways, either because there are tons of good summarizing reviews out there, or because they have read or seen the movie (which isn’t nearly as good as the book) themselves. So let me just say a little about what I liked: American law is always something a little mysterious and – let’s just say it – a little crazy for me. It is very different from what we know in Europe and I was super curious to get a little information on the American system in this book and I have to say that the parts of the book set in the courthouse were by far the ones I enjoyed the most. It was very interesting to see how the process developed and what possibilities the different parties had to act and react. The selection of the jury and its discussions afterwards was very well done. It took a little to really get into the book – the first scene was of course heartbreaking and totally catchy, but the introduction of so many characters in such a short time made my head spin. I still kept mixing up some of them during the book. I really liked our main character Jake Brigance, he might not be the usual super hero and has some serious character issues, but that made him very credible. I also had a few problems with the pace of the plot. I had the feeling that we had a furious start, followed by a very slow middle part which ended in a too fast ending. I guess that such things come with experience and we have to keep in mind that this is Grisham’s first novel. Well, I will definitely keep my eyes out for other Grisham books!"}, {"userName": "Cody | codysbookshelf", "userReviewDate": "Apr 14, 2017", "userURL": "http://www.goodreads.com/user/show/56352820-cody-codysbookshelf", "userReview": "My first John Grisham novel was his latest release, The Whistler: a capable, if not entirely thrilling, read. Because I give every author two chances to 'wow' me, I decided to take a stab at Grisham's debut, A Time to Kill. Wow. Wow wow wow. Was I impressed! Set in northeastern Mississippi (an area I've ridden through many times, and have a certain affection for), a young black girl is kidnapped and brutally raped by two white rednecks, both career criminals despite only being in their twenties. The two are caught and arrested, but that does not make the girl's pain go away, of course — so her father takes matters into his own hands, and murders the two rapists in cold blood. Jake Brigance, a young lawyer who is desperate for the big time, takes the case despite its daunting nature. What unravels is something that thoroughly impacts the entire fictional town of Clanton, Mississippi, and the reader as well. There is no black or white here, only a world of gray; while most readers can sympathize with the girl's father, was it right of him to murder the men? What is morally justifiable? What role does the court system play in our lives, and even when juries make the 'right' decision, is it still wrong? These are questions Grisham leads the reader to, never fully answering them but instead inspiring thought and meditation. I know I certainly look at the American justice system in a new light after reading this fabulous novel. This was a journey that had me glued to the pages, and I would have read it much faster had life not intervened. I was shocked by how fleshed out the town of Clanton and its inhabitants really are, in the pages of this weighty story; Grisham is one who can tell a tale, and had that talent from the very beginning . . . as is evident here, in his debut novel. I was not sure what I wanted the final decision to be — guilty, not guilty, mistrial — because of all the twists and turns and new revelations that come to light during this volume's 480-ish pages. That's a good thing. The person who begins reading this novel and the person who finishes this novel aren't the same, not completely; this is one with true potential to impact, all these years later. It really stands up. John Grisham is one of America's most popular authors, and I can now see why. I cannot wait to work my way through the rest of his releases, but I don't know if any of them can top this one."}, {"userName": "Janie Johnson", "userReviewDate": "Jan 13, 2017", "userURL": "http://www.goodreads.com/user/show/5116650-janie-johnson", "userReview": "I don't normally read books like this one, but a good friend recommended it so I decided to give it a shot. Now I am glad that I did, it make me view court room dramas in a whole different light. This is also a first time read for me with this author.SynopsisIn this searing courtroom drama, best-selling author John Grisham probes the savage depths of racial violence...as he delivers a compelling tale of uncertain justice in a small southern town...Clanton, Mississippi. The life of a ten-year-old girl is shattered by two drunken and remorseless young men. The mostly white town reacts with shock and horror at the inhuman crime. Until her black father acquires an assault rifle and takes matters into his hands.For ten days, as burning crosses and the crack of sniper fire spread through the streets of Clanton, the nation sits spellbound as young defense attorney Jake Brigance struggles to save his client's life...and then his own.I have to be honest and say I was not sure about this book at all. The more I read though, the more I was intrigued. I really enjoyed the writing style a lot. The story was very engaging and was pretty quick paced. I also found this story to be very thought provoking as was a young adult in the year that this book was written. I did not think much about how thick the racism was in the 80's. Reading this book brought that to the forefront for me. It also made me think about what I would have done if this was to happen to me, if my child had been raped, beaten and left for dead. What would I have done? How would I have reacted? This book really makes reader's think about it.I absolutely loved the characters in this book, well most of them anyway. They were developed very well. Of course my favorite would be Jake, but I also really enjoyed Ellen even though she came into the story relatively late. I would have loved to have had her a bit sooner into the story and maybe learned a bit more about her. I could relate to the characters very well because they felt so real and down to earth most of the time. I also found them to be very likeable for the most part. Since I was recommended this book, I must recommend it as well, even for those who do not like courtroom dramas like me. I think this book could change your mind. I look forward to experiencing more of this author in the future."}, {"userName": "Jennifer", "userReviewDate": "Mar 13, 2008", "userURL": "http://www.goodreads.com/user/show/987281-jennifer", "userReview": "I love this book... it shows so starkly the fight against racism in the small town South. You can't help but feel the justice in a man taking the law into his own hands... because the law has failed him. And because of that, it forces you to confront your own beliefs, your own morals... you have to question the sanctity of the law and what you're willing to put your faith in. It brings up the issues of right and wrong in a way that's almost horrifying in its use of grey area.And it's got one of my favorite parts that I've ever read in any book anywhere, that sticks with me years later... at the end of the trial when the main character asks the jury to picture the horrifying abuse and degradation and injuries that the little black girl was subject to... and then to imagine that she's white. It's almost like a physical blow and it's stuck with me ever since.Heck, it's how I picked my candidate for the Democratic primaries... lines up their resumes and their plans and looked at them and went, \"OK... now what if they were both white men?\"This book changed the way I look at the world, with that one simple sentence."}, {"userName": "Jenny", "userReviewDate": "Apr 12, 2010", "userURL": "http://www.goodreads.com/user/show/2941401-jenny", "userReview": "I HATED this book - why I finished all 500+ pages I will never know. I picked it up at the library just browsing for something light - I liked Pelican Brief and thought I would read another John Grisham. I think Mr. Grisham is trying to protray Clanton, Mississippi as the main character and to do this employs a lot of stereotypes about the deep south, including extensive use of the \"n\" word, as well as describing others in the town as \"the whites\" \"the rednecks\" etc. The main character, Jack Brigance is completely unbelievable as an ambitious lawyer - would an ambitious lawyer given the best case of his life really drink three margaritas before the closing arguments and argue most of the case hungover? Story lines were left hanging, weird sexual tension was developed between characters and then abruptly dropped as story lines. Sloppily written, unengaging story, cured me of ever reading Grisham again."}, {"userName": "Wilier", "userReviewDate": "Nov 07, 2017", "userURL": "http://www.goodreads.com/user/show/59044847-wilier", "userReview": "Este libro me ha mostrado una nueva forma de abordar el genero de novela negra. Estaba acostumbrado a ver el típico detective que se enfrenta a un caso imposible el cual con astucia y mucho talento lo puede resolver dejándonos a toso asombrados al final de la historia. No es este el caso. En este libro John Grisham nos demuestra que no es necesario y nos muestra un thriller judicial con un caso bastante simple el cual es resuelto de forma bastante impresionante.Déjenme que les hable un poco del argumento principal de esta historia para que puedan entenderme. En el pequeño pueblo de Clanton, en el condado de Ford, Mississippi, una niña afroestadounidense de 10 años llamada Tonya Hailey es cruelmente violada y golpeada por dos hombres blancos racistas, James Louis \"Pete\" Willard y Billy Ray Cobb. Posteriormente, un grupo de lugareños encuentra a Tonya y la niña es trasladada rápidamente a un hospital, mientras Pete y Billy Ray alardean en un bar de carretera sobre el crimen que cometieron. Carl Lee Hailey, el padre de Tonya, consternado e indignado, consulta a su amigo Jake Brigance, un abogado blanco que ya había representado a su familia anteriormente. Le pregunta si podría lograr que reciba una absolución en el caso de que matara a los dos hombres. Jake le dice a Carl Lee que no haga nada estúpido, pero admite que si se tratase de su propia hija, él mataría a los violadores. Mientras Pete y Billy Ray son escoltados de vuelta a la cárcel tras su audiencia de fianza, Carl Lee, determinado a vengar a Tonya, asesina a ambos hombres con una M-16.Acá está el meollo del asunto. ¿Merece ser condenado a muerte este padre que ha vengado la violación de su hija? El libro juega constantemente con este dilema alagando un trasfondo explícitamente racista dejando claro la mayoría los personajes que si hubiese sido un padre blanco vengando a su hija violada por unos negros no hubiese sido condenado sino mas bien hubiese sido condecorado por el alcalde de la ciudad. Esto me hace pensar en la sociedad estadounidense. Bien sabemos que en los 60s el reverendo Martin Luther King fue el precursor de un movimiento que dio como resultado una reforma de los derechos civiles acabando con la segregación en dicho país. El reverendo King tenía un principal crítico dentro de la comunidad negra llamado Malcolm X. Malcolm criticaba que dicha reforma no era necesariamente una solución para el problema de una sociedad racista. Permitir que negros y blancos puedan sentarse juntos en el mismo café no era necesariamente lo que el país necesitaba, no era precisamente la igualdad que a comunidad negra merecía como seres humanos para entonces. Todo este conflicto generó una serie de disturbios y protestas provocando la muerte de ambos lideres. Pero entonces ¿Quien tenia razon? Y este libro definitivamente le da la razón a Malcolm, aun en los 80s el racismo en esta sociedad estaba profundamente arraigada y me hace preguntar si en esta epoca sigue siendo de igual modo. No estoy muy seguro. El libro no ahonda en los personas, se remite a la narración de los hechos y mientras la historia se va desarrolando vamos conociendo a los personajes. Lo cual me pareció de los mas interesante. La prosa de Grisham es concisa y simple al extremo. Estoy de haber leído este primer libro de este autor y ahora entiendo porque es uno de los mas vendidos en la historia norteamericana. Sin muchos plot twists y con un final bastante predecible no deja de ser una historia muy interesante y entretenida que me ha hecho reflexionar bastante. Fue interesante ver el punto de vista de un abogado en un caso de condena a muerte, ver como se preparan estos juicios al detalle y los pensamientos que pasan por la cabeza tanto del fiscal como del juez como del abogado defensor. Me hizo ver que la justicia no es del todo una ciencia exacta. Donde hasta el ego de las partes involucradas puede causar una diferencia en las personas procesadas, un juego bastante peligroso la verdad.El veredicto es poco creíble y bastante hollywoodense pero posible dentro del sistema legal de doce personas cualquieras tomando su voto. En mi opinión tal vez no era justo que fuese condenado a muerte pero si que cumpliera por lo menos la condena mínima de sus crímenes en consideración de lo sucedido con su hija. 3/5"}, {"userName": "Emma", "userReviewDate": "May 26, 2018", "userURL": "http://www.goodreads.com/user/show/28489639-emma", "userReview": "3.5 stars I enjoyed this but it didn’t entertain me as much as I hoped."}, {"userName": "Corey", "userReviewDate": "Jan 25, 2014", "userURL": "http://www.goodreads.com/user/show/12949855-corey", "userReview": "Wow! What a powerful book, I can't believe I hadn't read it sooner. I've seen the movie a numerous amount of times because I'm a big fan of both Matthew McConaughey and Samuel L Jackson. My eyes were glued right to the pages from beginning to end, I just couldn't put it down. I remember watching the movie for the first time when I was in my mid-teens and I remember not liking it at that time because it was hard for me to understand the court and legal system, but as I got older I watched it again and I loved it. This book is to me not just John Grisham's best book, but it is now a book I'm putting in my list of favorites. The book is very emotional and some parts were very disturbing and hard to read, and it's sad to say it's probably happened in real life. An excellent book that I recommend to everyone!"}, {"userName": "Matt", "userReviewDate": "Mar 26, 2014", "userURL": "http://www.goodreads.com/user/show/5903843-matt", "userReview": "Before returning to Clanton Mississippi and Ford County, I took some time to refresh myself of my first journey here, to see where the Grisham journey had its humble roots. While it is likely this novel is not the traditional 'must-read' before diving into SYCAMORE ROW, I chose to remember the powerful novel that Grisham admits barely made a blip on the radar until after THE FIRM pushed him to the top of all the reading lists. This is a wonderful book that introduces readers to a Mississippi where desegregation is no more than a word in the dictionary. When the brutal rape of a 10 year old black girl makes small ripples amongst the vast majority of Ford County's white population, the townsfolk continue with life as usual, leaving the black population to mourn the injustice. All, that is, but Carl-Lee Haley, father of the victim. The two white men accused of the rape are charged and the legal process begins its slow march. When Haley takes things into his own hands and shoots both men while they are in the courthouse, the ripples turn to tidal waves, dividing the town along racial lines. After Jake Brigance, town lawyer and admitted liberal, agrees to take the case, all eyes are on him and how he will argue a case that appears cut and dry. Using an insanity angle, Brigance tries to sway popular opinion in a county where black rights are all but nil. This small county soon has the eyes of the entire country as support on both sides heightens. It is only when the Klan begin enacting their own form of justice that violence and retribution stain the Mississippi legal process. Brigance begins building a defence, using the meagre $900 offered to him while his family chooses to protect themselves when he refuses to follow. Using an odd patchwork legal team whose interest in the case outweighs their desire for payment, Brigance brings the case forward. Before a jury of his peers, Haley is presented as a grieving father and man whose mind was completely altered by the acts of two drug addicts. As the city is torn apart, Brigance can only hope that justice is truly colour-blind in the racist south. Grisham planted the seed of legal literary excellence with this novel and it should be required reading for the legal thriller fanatic.Grisham does so much in this novel on so many levels. From addressing the ne'er-spoken race divide in the South as it relates to legal equity to the nuances of courtroom thrillers for which he will become famous, to the formulaic storyline of the lawyer swimming against the tide on the side of justice all issues come out front and centre throughout the novel. Grisham tackles all these as a complete unknown in the literary field and does not stray away from strong social commentary throughout. While I will admit my mind flashed to the wonderfully done film based on the novel throughout the reading, I could see and feel the characters develop on the page and take life. Without throwing punches, Grisham dispels the rumours that desegregation stopped the race riots and that all is well throughout the country. Speaking about what he knows best--the law and Mississippi--Grisham brings the reader into the fold and captures them with riveting narration, stellar legal description, and a set of characters whose perfection within the story has them fit like the proverbial glove. This was surely the novel that got the Grisham craze started and, to me, proves to be one of his timeless classics.As an added aside, I cannot leave this review without presenting what may seem like quite the far-fetched claim. As I listened to the audiobook version of this novel, I could not help but wonder if Grisham sought to create a newer version of the Harpee Lee classic, To Kill a Mockingbird, bringing the injustice of the law between the races to the forefront. While Brigance is no Atticus Finch, this parallel cannot be disregarded as the reader sees the tension building and the complete despair of the defence counsel as the evidence pours forward. While I am almost certain Grisham would deny its connection, the reader who has taken the time to read both will surely see some similarities in both. Have things changed much since 1960? Since 1989? Surely some steps have been made in this regard, but I would venture to say that the two novels, which act as strong social commentaries, are not far off from what is still going on.Kudos, Mr. Grisham, for allowing me such a raw glimpse into the realm of justice in the South and not candy coating it in the least. Onward to SYCAMORE ROW... with a plethora of characters in my quiver and a passion for Ford County once again!"}, {"userName": "Melanie", "userReviewDate": "Jun 04, 2009", "userURL": "http://www.goodreads.com/user/show/1119240-melanie", "userReview": "I've actually never read a Grisham book before. Don't everyone throw tomatoes at me at one. Maybe the reason I haven't read one before was 'cause I was afraid I would be compelled to buy the rest of his books and I'd rather save the money for purchasing my very own movie studio."}, {"userName": "Dennis", "userReviewDate": "Oct 04, 2011", "userURL": "http://www.goodreads.com/user/show/1512303-dennis", "userReview": "John Grisham is always a favorite go-to for fast-paced, engaging storytelling that pulls you through, chapter by chapter, page by page, clear up until you reach the end. This was a great depiction of race tensions, and the good, bad and ugly of 1980s Southern life. The author is well suited to portray the South both sympathetically while at the same time never shying away from its more shameful aspects.Carl Lee Hailey's young daughter, who happens to be black, is brutally raped and left for dead by two savage thugs, who happen to be white. The thugs meet their maker after Carl Lee goes all Mississippi justice on their hind ends in the middle of the courthouse right after an arraignment. The small town of Clanton erupts into pandemonium as his capital murder trial draws near and then finally gets underway.Clanton is center stage for a colorful array of caricatures: the frat boy hot shot defense lawyer and his sorority sister wife; the drunken blue blood mentor; the big city Memphis millionaire pimp and his scummy Midwestern hired gun; the ambitious smug D.A.; the do-gooder Northerner law clerk; and the list goes on. The story proceeds effortlessly: serve, bump, set, spike.Once again, politically correct types bemoan the realities of the South, including \"excessive use of the 'N' word\" in this book. Hating the South is still the last acceptable prejudice allowed in this country. I don't like the N word either, but it was commonplace in Mississippi even through the 80s, like it or not. And in this story it happened to be directly relevant to depicting the prevalent perspectives and prejudices in Ford County. I still do not understand how there are so many complaints about that word when you'll almost never hear complaints about the F word or other profanity from any number of other authors. I, for one, love Grisham because he scarcely uses any profanity in any of his books. We should watch not to be hypocritically and self-righteously all about censorship only when something doesn't suit our particular fancy.This was as good a representation of Grisham's work as there is. I felt like I was there on the front lines at an exciting trial where the stakes were high and the pressure continued to build and build clear up until the very last moment."}, {"userName": "Chris", "userReviewDate": "May 10, 2012", "userURL": "http://www.goodreads.com/user/show/7688466-chris", "userReview": "A Time To Kill by John Grisham was an enthralling tale, it appealed to me because although the book as a whole, was written to sound very serious the way the humour was mixed into the story was perfect. The triumphs and defeats all the way through Jakes court case were explained very clearly, so much so that I felt as though I was Jake, sitting stiff in front of the judge testing my witnesses and building my case. The way the drama is presented is thrilling and at many points throughout my experience of this book I felt my heart stop and skip a beat.The story itself follows the talented and dedicated street lawyer Jake battle out a court case against an intimidating private law firm.Jakes client, a loving father, has without a doubt commited a revenge murder of two drug dealing \"rednecks\" who brutally raped his daughter.Jake must fight for a black mans freedom in a oppressive racist county, the fate of his client is almost pre decided as Jake enters this legal war. Can Jake pull through and win this almost impossible case? Or will he go down fighting for whats right?John Grisham’s “A time to kill” deserves the Best Selling title that it has earned, it’s a masterpiece of Modern legal dramas."}, {"userName": "David", "userReviewDate": "Nov 19, 2008", "userURL": "http://www.goodreads.com/user/show/1529727-david", "userReview": "I have always had mixed feelings about Grisham, but this is one of his best. The inherent drama of a death penalty story, with a background in the crime of rape, makes this a natural for an audiobook, where the high drama can really be brought out."}, {"userName": "Kevin Walther", "userReviewDate": "Feb 18, 2010", "userURL": "http://www.goodreads.com/user/show/3308825-kevin-walther", "userReview": "A Time to Kill By: John GrishamReview by: Kevin WaltherA Time to Kill is written by John Grisham. It takes place in Clanton, Alabama in the spring and summer of one year in the 1970’s. This is a time where racism is still very evident in southern states, and is a major issue in the book. The story revolves around a trial in which a black man has killed the two white men who brutally raped his eleven year old daughter. The man who kills the two men who rapped his daughter is Carl Lee Hailey; he is a married man who has three sons, and a daughter Tonya. He works at a paper mill and is the main source of income for his family. The two men he killed are Billy Ray Cobb and James Louis Willard, both known for their reputations regarding there use of drugs and opinions towards other races. The attorney representing Carl lee is Jake Brigance, a young lawyer who has only a few murder cases under his belt, but represented Carl Lee’s cousin on a murder charge and got him off. He is also married with one daughter.The novel begins with Cobb and Willard rapping Tonya Hailey, the cops quickly find out who did it because Cobb and Willard were bragging about it at a local bar. When Cobb and Willard are escorted out of the court house after their preliminary hearings, Carl Lee Hailey comes out of a cleaning closet with a machine gun and kills the two men. Carl Lee is put into custody for the murders, and he requests Jake Brigance to represent him in court, even though he is tempted at times from groups like the NAACP to use their lawyers. The D.A. is Rufus Buckley, who is determined to win this case not only for the positive publicity he would gain for his law and political career, but also because he and Jake Brigance are constantly feuding with each other. During the trial Mr. Brigance, his secretary, and some possible jurors are harassed by the KKK, sometimes in very harmful ways. Jake and his family receive so much harassment that he has his wife and daughter move with her parents in South Carolina to keep her out of harms way. There is also plenty of excitement surrounding the court house once the trial begins, with reporters from all over the country present, and the front lawn of the court house divided in two, the KKK on one side and Carl Lee supporters on the other.Many themes are present throughout the novel, the most popular being the racial issues that were present in this time and region of the United States. This theme is evident during the protests related to the trial, when the KKK is brought back into Clanton, when the NAACP tried to get involved in the trial, and in the trial itself when the question is presented, would he be treated the same if he was white and killed two black men who raped his daughter? Another theme that is evident in the novel is, doing what you believe to be right vs. what the legal system believes to be right. This theme is clear when Carl Lee Hailey kills the two men who raped his daughter, despite it being very illegal because he cannot live knowing his daughter’s rapists are still alive, and that she would have to live knowing they were alive. So, Carl Lee thought his personal view of what was right was a better option than letting the two men go to jail and be let out in a few years.When I was reading this book, I was very surprised at the level of racism that was present, especially because it was only 30-40 years ago. I haven’t been to this part of the country, but I hope it has changed drastically for the better since then. Even though Carl Lee did murder two men, I think he should be a free man, because what the two men did to his daughter was sick, disturbing, and horrible. I don’t think any child should go through what Tonya Hailey did, and I think Carl Lee’s response was appropriate for what happened.Also, when I read this book I liked the way it was written, it was my type of book, I just couldn’t put it down. It was full of action and dialogue that wasn’t boring, and had very few low points that I would consider useless."}, {"userName": "Katherine 黄爱芬", "userReviewDate": "Sep 01, 2014", "userURL": "http://www.goodreads.com/user/show/3839010-katherine", "userReview": "Bagaimana perasaan seorang ayah ketika putri kecilnya yg baru berusia 8 thn diculik, digantung, diperkosa bergantian, bahkan dicekik nyaris terbunuh, dan dibuang begitu saja?Jelas kalau saya sbg Carl Lee Hailey, ayah gadis itu, saya juga akan menembak mati 2 terdakwa kriminal pemabuk, pecandu narkoba itu, memastikan bhw sampah tsb tdk akan meneror putrinya lagi.Nah, ini menjadi tugas Jake Brigance, pengacara di Ford County, utk membela Hailey, yg tidak punya uang dan membayar Jake dgn tarif super minim. Walau sblmnya sempat diserobot, namun berkat kegigihan dan kelicikannya, Jake berhasil merebut kembali kasus berharga ini.Jake menghadapi tugas menghadapi kasus ini dgn berani, dgn totalitas luar biasa, tidak gentar terhadap semua rongrongan dr Ku Klux Klan, termasuk membakar rumahnya dan anjingnya, penembakan terhadap dirinya yg meleset dan mencederai org lain seumur hidup, asistennya jg diculik dan dianiaya. Jake pantang mundur, walau teror demi teror ini mengguncang sarafnya dan menjadikannya lebih sering mabuk2an drpd biasanya.Keadaan Jake makin diperparah dgn saksi ahlinya, psikiatri yg diduga pernah ditindak pidana. Untungnya psikiatri dari pihak Negara tidak kalah parahnya dan Jake mencabik-cabiknya di ruang sidang.Menjelang hari vonis, suasana makin memanas. Demonstrasi bergelombang dari para kulit hitam yg berusaha menuntut membebaskan Carl Lee, Klan yg antagonis juga memicu keributan dan perkelahian antar demonstran. Para juri yg diisolasi semakin ketakutan dan tidak kedap dari ancaman Klan. Dapatkah para juri mengambil keputusan yg obyektif dari kasus kontroversial ini?Buku ini menarik karena kasusnya tidak biasa dan berbau rasialis. Jake dan teman2 satu kubunya mewakili orang2 yg bukan anti kulit hitam. Tokoh Lucien sbg pandito Jake, orang kaya eksentrik yg memilih jadi pengacara yg anti-mainstream, dgn cerita2 masa lalunya dgn selipan humor kering. Atau Harry Rex, pengacara perceraian yg licik dgn humor-humor sarkasmenya, serta Ellen Roark yg dipanggil Jake sbg Row Ark, memiliki kecerdasan dan dedikasi sama tingginya walaupun dia seorg newcomer.Dan acungan jempol justru pada saat author menggambarkan seorang pendeta kulit hitam yg hipokrit, Pendeta Agee. Pendeta ini tidak punya urat malu dgn mengais dolar demi dolar dari orang2 miskin warga kulit hitam, menggunakan kemalangan cerita keluarga Hailey utk memperkaya diri sendiri, dan tidak memberikan satu sen pun kepada istri Hailey yg sudah tercekik hutang dan biaya hidup. Beruntunglah karena tekanan persuasif Jake yg bekerjasama dgn Ozzie, sheriff kulit hitam, uang sebesar $6000 itu berhasil diberikan kepada keluarga Hailey.Cuma saya kurang suka pada saat pemilihan juri yg bertele-tele, yg nyaris memakan sepertiga isi buku, yg bagi saya itu membosankan walaupun itu adalah elemen penting bagi buku ini.Bagi kalian yg menyukai suspense fiction ttg hukum, novel ini cocok utk Anda."}, {"userName": "Jason P", "userReviewDate": "Nov 23, 2013", "userURL": "http://www.goodreads.com/user/show/7208243-jason-p", "userReview": "Two nights ago I finished listening to this great piece of art. The last Grisham novel I read/listened to, The Innocent Man: Murder and Injustice in a Small town was fantastic in ways that can only be described as an excellent documentary that was thought provoking and influential. That book was one of Grisham's non-fictions that he tackled later on in his career, where he tracked down a fantastic story of a man who was tried and convicted of a murder he did not do. By the time I was done with it I was over the moon with John's work. A Time to kill had pretty much the same feelings I had with the previous. I felt that it had everything anyone who likes court case dramas would like. The main character Jake Brigance is a young buck of a lawyer with old school values, he stumbles upon this case of a father who shot and killed two men who raped and beat his little girl of ten years. All this happens in the south, which around that time in the story is still facing the battle of racism. Jake takes on the case of defending a black man in a partially racist town, a town where the KKK has their own motives, and will do everything in their power to make the case, Jake, and everyone close to him pay for taking the side of a black family. I though the story was very well written. The prose was in a classic court room style which added a beautiful atmosphere to the novel, the terminology throughout the novel was simple and concise to the point where I felt like I was watching an episode of Law and Order. The emotional rollercoaster is what had me hanging on, it dipped and dived at times, it never relented, but justice always shines through…. Well, sometimes anyway.I am looking forward to travelling along the squeaky courtroom floors of Grisham’s canon. He has style and grace that I am so grateful to have experienced."}], "description": "Before The Firm and The Pelican Brief made him a superstar, John Grisham wrote this riveting story of retribution and justice -- at last it's available in a Doubleday hardcover edition. In this searing courtroom drama, best-selling author John Grisham probes the savage depths of racial violence...as he delivers a compelling tale of uncertain justice in a small southern town...Clanton, Mississippi. The life of a ten-year-old girl is shattered by two drunken and remorseless young men. The mostly white town reacts with shock and horror at the inhuman crime. Until her black father acquires an assault rifle and takes matters into his hands.For ten days, as burning crosses and the crack of sniper fire spread through the streets of Clanton, the nation sits spellbound as young defense attorney Jake Brigance struggles to save his client's life...and then his own.", "title": "A Time to Kill\n      \n          (Jake Brigance #1)", "url": "http://www.goodreads.com/book/show/32542.A_Time_to_Kill", "average": 4.04, "cover": "https://images.gr-assets.com/books/1390195915l/32542.jpg", "reviews": 4543, "authors": [{"url": "https://www.goodreads.com/author/show/721.John_Grisham", "name": "John Grisham"}], "type": ["Fiction", "Mystery", "Thriller", "Mystery", "Suspense"], "outlinks": ["http://www.goodreads.com/book/show/32542.A_Time_to_Kill", "http://www.goodreads.com/book/show/18605647", "http://www.goodreads.com/book/show/1177118.A_Time_to_Kill", "http://www.goodreads.com/book/show/907830.A_Time_To_Kill", "http://www.goodreads.com/book/show/1054051.Die_Jury", "http://www.goodreads.com/book/show/1038927.A_Time_to_Kill", "http://www.goodreads.com/book/show/4172070-tiempo-de-matar", "http://www.goodreads.com/book/show/204729.A_Time_to_Kill", "http://www.goodreads.com/book/show/1518149.A_Time_To_Kill_Saat_Untuk_Membunuh", "http://www.goodreads.com/book/show/17448500-a-time-to-kill", "http://www.goodreads.com/book/show/5358.The_Firm", "http://www.goodreads.com/book/show/5359.The_Client", "http://www.goodreads.com/book/show/32499.The_Pelican_Brief", "http://www.goodreads.com/book/show/24192.The_Runaway_Jury", "http://www.goodreads.com/book/show/5349.The_Rainmaker", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}