{"ratings": 1244, "userreviews": [{"userName": "Nick Black", "userReviewDate": "Oct 06, 2014", "userURL": "http://www.goodreads.com/user/show/655723-nick-black", "userReview": "marvelous! each year brings a new body of pop-nuke printed material, most of it rehashed and a good deal of it wrong. the discerning criticality fetishist is lucky to find a single good book among the dreck. last year's was Schlosser's Command and Control. this year we get Atomic Accidents. too much alliteration.i knew the basic facts about most of the events in this book (though the history of arranged train collisions was news to me, and delightful), but only because i'm a freak who's familiar with things like Los Alamos National Laboratories' Review of Criticality Accidents and has pored over tables detailing genetic damage as a function of 90Sr / 137Cs fallout in Kahn's On Thermonuclear War and has a shelf titled Oppenheimania. despite that, i was regularly surprised by new information, some of it major elements from the history of reactor engineering (this is a better survey of different reactor types than i've seen in most textbooks, and certainly a more entertaining one), some of it details staggering in their nerdiness (did you know the part number for the neutron generator used in the Mk-28 gravity bomb was MC-890A?), some of it personal reflection (thoughts on DASA/DNA/DTRA logos over the years). Mahaffey goes all the way and delivers the goods: most authors might be content to reference the urban legend that the AMF \"candlepin\" bowling pin spotter was inspired by fuel rod management technology from the Fermi-1, but Mahaffey is there with patent dates and part numbers. there's a lot of oral nuclear tradition and lore that Mahaffey's preserved in one place, previously unavailable or available only by trawling through the American Nuclear Society's unbearable Nuclear News. if you're a fan of David Lochbaum's \"Fission Stories\" series at All Things Nuclear (and if you're not, then to hell with you), you're gonna be happy.i'm pretty sure mahaffey never reveals any currently classified information (nota bene: i have never held the Q+SigmaX (DoE) or TS+CNWDI (DoD) clearances necessary for weapon design work), which is understandable, but the weapons junkie will still find some gems. the marvelous qualities of 237Np, for instance, had escaped my attention. the discussion of melt-castable explosives is at least at the level of Agrawal's High Energy Materials. sometimes he's teasing (what are these alleged evidences for a neptunium test, Herr Doktor? and alluding to Fermat's Last Theorem when discussing \"secret Japanese uranium-extraction filter materials\" in a footnote doesn't fly. for one, fermat was almost certainly bullshitting or at least wrong. two, we can all go read Seko et al's \"Aquaculture of Uranium in Seawater\". i suspect the good doctor simply lacks confidence regarding amidoxime chemistry), which is annoying. he toes the line regarding initiator design (pretty much entirely classified), though i bet he knows more than he's saying. there's negligible information regarding thermonuclear design, which makes sense given the book's topic.minor nits: the bibliography is good, but i'd have appreciated inline references, and plenty of details are presented for which i can find no listed source (i've confirmed some of them via literature checks, but a good number require simply trusting Dr. Mahaffey). the photographs are uninspiring, either iconic early 20th century shots everyone's seen or Mahaffey's own color shots. i understand not wanting to license photographs, too, but there's frankly way better pictures of nuclear reactors than these (i dug the selfie among the CRTs of Baxley, Georgia's Hatch plant). finally, dr. mahaffey doesn't quite seem to understand youtube URIs, which is more charming than anything--the man has forgotten more science than most of us will ever know, despite our new-fangled YouTubes.finally, mahaffey is quite often funny, and always pleasant to read. not many authors could pack this wealth of technical detail into 420 readable pages. mahaffey deploys garrulous, digressive footnotes with all the abundance and profuseness of david foster wallace, and just as in Infinite Jest they're some of the book's best material. mahaffey writes with verve, and--unlike most technical prose--there are few gross lapses in editing. one gets the idea he'd be a good guy to have a beer with, discussing breeder reactors and why Jimmy Carter was a douchebag and pranks one could play on John McPhee.tl; dr: if you like reading books about controlled fission and its applications, read this. if you don't, you probably won't enjoy it very much. and remember, kids, a day without nuclear fusion is like a day without sunshine!full disclosure: Dr. Mahaffey graduated my alma mater (Georgia Tech), and we both worked at the Georgia Tech Research Institute, though not at the same time."}, {"userName": "Peter Mcloughlin", "userReviewDate": "Apr 06, 2014", "userURL": "http://www.goodreads.com/user/show/16212136-peter-mcloughlin", "userReview": "I am a very liberal person. My views are probably far to the left of anyone who has been in the White House. One point of disharmony between myself and my political compatriots is on Nuclear Power. I think the promise of nuclear power is great and I think its critics concerns about safety are overblown. This book is a detailed exploration of the dangers of nuclear power and the ways things can go wrong with it. The public is fearful of radiation contamination and indeed radiation is harmful. The dangers of radiation are quite real but again they are overblown.As with any technology there is the problem of safety and accidents. This book explains almost every major accident and forensically shows where things went wrong. A person reading this book will get a very detailed picture of nuclear power and the variety of ways it is harnessed. This book provides a service to the reader by detailing the specifics of Nuclear Reactor designs, the dangers of radiation and the various safety problems involve one can get a balanced view of the risks and benefits of nuclear power. The author also proposes that light-water reactors have problems that make them sub-optimal and that a liquid sodium reactors would be a safer bet. There is a saying. I would prefer the devil I know to the devil I don't know. By having a detailed picture we understand how bad (or good) the devil is."}, {"userName": "Peter Tillman", "userReviewDate": "Mar 26, 2018", "userURL": "http://www.goodreads.com/user/show/8101737-peter-tillman", "userReview": "This one suffers a bit in comparison to his excellent \"Atomic Adventures\", which I read not long ago:https://www.goodreads.com/review/show...So I'll probably get back to it, unless the library calls it back first.....Nope, someone else wants it.Looking at my notes: Mahaffey says keeping accidents secret always makes things worse. This was particularly evident in the old USSR, where admitting a mistake could cost you (literally) your life. Or your job, and a free trip to Siberia! Lots of gory details, almost all involving experienced people ignoring safety guidelines because.... Well, because.Power density: the current fad for solar & wind goes contrary to the trend since the Industrial Rev began, and is unlikely to continue (he says), once people see the costs. As we already have in Calif, and the Germans, and.... The remarkable density of politicians, and stubornness of the so-called Greens, were mentioned. I will add, 'Against stupidity, the Gods themselves rage in vain.' -- Friedrich von SchillerAlong those lines, we might mention the TX-16/EG-16, a remarkable cryogenic H-bomb built in the mid=1950s. Rated at 11 megatons, it weighed around 82 tons, and would fit (barely) in the bomb bay of a specially modified B-36 \"Peacemaker\". It was the size of a large Airstream trailer. Five were built. Fortunately, no calls for its use were received.And mention should be made of a helpful US govt book, published in 1945 for $1.25: \"Atomic Energy for Military Purposes\". Basically a \"how-to\" primer, many, many orders were received from the USSR. Many helpful photos were added in the 1946 edition. It went through 8 editions and was published in 40 languages. No mention of the careful reasoning behind this unprecedented show of openness, for what hd been a carefully (if ineffectively) guarded military secret. Remarkable.3.5 stars, for as far as I read (266 of 426). I might come back to it, in the sweet by & by."}, {"userName": "Kazen", "userReviewDate": "Oct 05, 2014", "userURL": "http://www.goodreads.com/user/show/12818720-kazen", "userReview": "It's been a long time since I've read non-fiction that kept drawing me back to see \"what happens next\" but Atomic is totally that book.The subject matter helps - nearly every recorded radiological mishap and disaster, both famous and little-known. There are caves of death in the Ozark Mountains circa 1880, radium paint that killed dozens, World War II, Three Mile Island, and of course Fukushima Daiichi. Mahaffey leads us through each, carefully explaining isotopes and reactions in ways that neither make you feel stupid nor dumb down the material. He states his biases right in the introduction:The purpose of this book is not to convince you that nuclear power is unsafe beyond reason.... On the contrary, I hope to demonstrate that nuclear power is even safer than transportation by steam and may be one of the key things that will allow life on Earth to keep progressing; but please form your own conclusions.I think he's done a great job of this - I come away from the book thinking that nuclear power has great potential but man, we need to find a way to engineer human stupidity out of it. Whether it's worth the try is left up to the reader.I cannot review this book without mentioning the footnotes - don't skip them! Some are more information or links to videos, and others are tidbits that are awesome but wouldn't fit anywhere else. For example:It is difficult to find a cross-section view of the Fermi 1 reactor that does not have a big X drawn through the refueling car. It was not a popular accessory.I leave you to find the 1975 geek joke on your own."}, {"userName": "Space Out With Sci Fi in June The Haunted Reading Room", "userReviewDate": "Feb 05, 2014", "userURL": "http://www.goodreads.com/user/show/7302570-space-out-with-sci-fi-in-june-the-haunted-reading-room", "userReview": "I totally loved this book, which sounds odd considering the topic; but it is so educational, diligently researched, and well-written that it is actually entertaining. As a child of the Korean Conflict and Cold War, anything atomic has always been a hot topic of intrigue for me. The author's research has been exceptionally wide-ranging, and I feel as if I've just finished a year's university course in the topic; that's how much I've learned."}, {"userName": "Edward", "userReviewDate": "Apr 12, 2014", "userURL": "http://www.goodreads.com/user/show/11376588-edward", "userReview": "This book was fascinating, thorough, and a keeper. Read this with \"Command and Control\" if you want a complete look at accidents involving nuclear technology on both civilian and military sides. The recounting of early work and experiments with radioactivity was compelling in a gruesome, morbid way."}, {"userName": "Hiawatha Bray", "userReviewDate": "Mar 08, 2014", "userURL": "http://www.goodreads.com/user/show/29446913-hiawatha-bray", "userReview": "At once highly technical and highly entertaining, this history of nuclear accidents comes from a guy who, like me, is a fan of nuclear power. But he's not blind to its flaws or to the inevitable failings of the humans who operate nuke plants. Fans of technology history books will love this one."}, {"userName": "Atila Iamarino", "userReviewDate": "Dec 29, 2016", "userURL": "http://www.goodreads.com/user/show/5648532-atila-iamarino", "userReview": "O livro abre anunciando que é uma versão moderna da colisão de trens, aquele acidente que desperta um misto de curiosidade mórbida e admiração pelo tamanho da desgraça. E entrega bem.Passa pela descoberta de alguns tipos de radiação, dos testes que o Tesla fez, das operárias que molhavam pincéis com rádio na boca, até o desenvolvimento da tecnologia de fissão. Tanto para guerra quanto para a produção de energia.Foi um livro que me fez ficar contando as histórias para a esposa, de tão curiosas. Achei especialmente marcante os eventos onde misturas com urânio ou plutônio atingiram a massa crítica simplesmente por descuido. Eu não fazia ideia do problema que a estrutura de um recipiente traz. Ah, claro, também tem os vários casos de descaso dos russos com segurança, informação passada para os envolvidos e a escala das cagadas. Não conhecia por exemplo o desastre de Kyshtym de 1957, uma bomba suja acidental que contaminou uma área enorme na URSS e por muito tempo não se sabia o ocorrido.Para completar, ainda termina com uma avaliação bem balanceada sobre os problemas e vantagens da produção de energia nuclear. Só por essa parte já seria um bom livro, mas as histórias dos desastres são o ponto alto mesmo."}, {"userName": "Bill", "userReviewDate": "May 13, 2018", "userURL": "http://www.goodreads.com/user/show/3925186-bill", "userReview": "After reading hundreds of pages detailing accidents, from small to large, which sometimes result in victims dying agonizing deaths from radiation exposure over weeks, the single most common thread through all of these accidents were that they started with people taking shortcuts. So, don't take shortcuts. Seems like a good lesson for life in general.Because of the cover and title, I expected that most of this book would focus on famous power plant incidents such as TMI. However, only two chapters cover accidents at commercial plants. Instead Mahaffey crafted a meticulously researched encyclopedic timeline of accidents from the very early days of bomb research and experimental reactors to Cold War plane crashes involving nuclear weapons all the up to Fukushima. Some of them are more exciting than others and I definitely felt he favored completeness over concision. Nevertheless, his enthusiasm and deep research shines through (just sample some of dry humor in the frequent footnotes), and I really enjoyed this book.I felt like I learned a lot of interesting trivia of U.S. history as well as a better appreciation for how nuclear power plants and bombs work. Mahaffey does a good job characterizing how society has viewed radiation, from the radium girls painting watch dials to movies like China Syndrome (after reading this book you'll know why an out of control power reactor core won't melt through the bottom). He demonstrates how media has sensationalized and misrepresented incidents. By the end, I came to agree with his main thesis that, while dangerous, nuclear power does not deserve its reputation. When done carefully, it is acceptably safe. When I was in middle school I wrote a report on nuclear energy claiming it could be produced safely. My teacher was unconvinced by my paper. If I had only had this book as a source, I think I could've convinced him. Unfortunately, nuclear energy still seems dead in the U.S. for now and the carbon content of our atmosphere is paying the price."}, {"userName": "Conor Cook", "userReviewDate": "Oct 18, 2017", "userURL": "http://www.goodreads.com/user/show/60078066-conor-cook", "userReview": "Could not even finish this book! It was too dull and boring. I was only on the fourth chapter and didn't know how I got there or what had happened in between. I had high hopes for this book since it had a 4.2 rating out of 1000+ ratings but it was worse than an old high school text book."}, {"userName": "Alexander Temerev", "userReviewDate": "Nov 20, 2017", "userURL": "http://www.goodreads.com/user/show/808220-alexander-temerev", "userReview": "An excellent and entertaining journey through history of nuclear accidents, both civilian and military. I especially appreciate the optimistic tone, and the fact that this book has been written by a nuclear engineering professional, as opposed to an investigative journalist."}, {"userName": "Lis Carey", "userReviewDate": "Dec 06, 2014", "userURL": "http://www.goodreads.com/user/show/3726509-lis-carey", "userReview": "This is a highly readable account of the history of atomic power as seen through its accidents and safety failures. That might sound like it's anti-nuclear power, but in fact Mahaffey is a long-time advocate. His major point is that in fact significant accidents are fairly rare, and that with a few notable exceptions, serious casualties are even rarer.His account starts with a bizarre episode in the Ozarks in the late 19th century, with the accidental discovery of what eventually proved to be a radium mine.I will say that the discussion of radium and its various uses, not just for night-glow dials but its medical uses, both science-based and as \"mineral water,\" is by itself worth the price of admission.As he takes us through the development of the bomb, and the first reactors to produce bomb-grade material, and then the development of peaceful nuclear power, there are stories both terrifying and delightful. Initially, everything had to be learned the hard way.The most terrifying detail, to my mind, is that for years the US military tried to develop nuclear-powered military aircraft. Surely they would never crash... Fortunately, that proved to be a technical bridge too far, and the program was cancelled.A recurring theme is that while all of the power-plant and bomb transport accidents involved designs that failed to anticipate a potential technological vulnerability, the power plant accidents only became disasters when one worker or another overrode the automatic controls, often for what seemed like logical reasons. There's also discussion of how politcal and economic factors played into decisions, as well as the inertia of sticking with a known design that's been reliable and effective, even though there may be better designs and paths not followed, that might make nuclear power safer, more reliable, and less unsettling for a concerned public.He does repeatedly hit a favorite theme of mine, the ways in which excessive secrecy to prevent public panic in fact fed public fear that there were dangers they weren't being informed about.All in all, this was an interesting and enjoyable read, or rather in this case enjoyable listen, and Tom Weiner captures exactly the right tone in his reading of it.Highly recommended.I bought this book."}, {"userName": "Teejay", "userReviewDate": "Oct 09, 2014", "userURL": "http://www.goodreads.com/user/show/19139481-teejay", "userReview": "I rarely can consider a non-fiction book as five stars (though many get to 4.5, GR does not allow that classification so I round-down).This is a five-star book. With sincerely-hefty credentials and a vast bibliography of reference material, Mahaffey lays down an absolute page-turner for anyone interested in atomic accidents, failure mode analysis, design analysis, cold-war psychology, and the human proclivity to \"Foxtrot Unicorn\". His command of radiological chemistry is impeccable, and he writes for the scientist as well as the layman. He tells the stories of atomic mishaps - many of them the same as I've read in many other books, but in this case the background and detail is FAR greater than I've ever encountered. He has a muted but very discernible sense of humor throughout (despite the sobering subject matter) that he wields without ever being condescending, making this a quite enjoyable read - and a reference book I'm going to hang onto as a great summation of the decay paths of various isotopes. In addition - I have never read a technical book whose footnotes were as detailed and engaging as the text itself. If you are into any of the disciplines I mentioned above, this book is well-worth the price of admission. You'll want to read it a second or third time. First-rate; five stars, no equivocation!"}, {"userName": "Ralph", "userReviewDate": "May 25, 2016", "userURL": "http://www.goodreads.com/user/show/15897348-ralph", "userReview": "5.0 out of 5 - Well researched and captivating. A must read for physics aficionados. If you have an interest in atomic energy, you will probably have a hard time putting this book down. Filled with numerous detailed accounts of the development of atomic technology, accidents involving nuclear energy, and beginning with staged train wrecks (yes, non-atomic train wrecks), Dr. Mahaffey has done an outstanding job weaving a narrative for the non-technical person filled with lots and lots of technical information for those with deeper interest in physics and chemistry.This is a very, dare I say, entertaining, information dense book and I look forward to reading it again."}, {"userName": "Rebecca", "userReviewDate": "Apr 13, 2014", "userURL": "http://www.goodreads.com/user/show/22606267-rebecca", "userReview": "I greatly enjoyed this book. This book covers accidents and incidents involving nuclear power in the US and other countries. It covers major events, like the SL-1 explosion, as well as other events that are generally unknown. The author is witty and sarcastic. I really enjoyed his comments in the numerous footnotes. You will be shocked at how little regard was given to the safe disposal of reactors and radioactive debris in the early days. This book is important and informative and reveals just how fragile our grip on nuclear safety really is."}, {"userName": "Greg Williams", "userReviewDate": "Jun 08, 2014", "userURL": "http://www.goodreads.com/user/show/20687436-greg-williams", "userReview": "For me, this was an interesting book. It can be a bit technical and repetitive. But that was kind of the point. It is amazing how reckless we have been when researching nuclear fission. And this book shows that we often have made the same mistakes over and over again when trying to perfect nuclear reactors. It turns out that there have been a lot more accidents than Three Mile Island and Chernobyl. And that's what made it the most interesting to me.BTW if you are dealing with nuclear reactive materials and you see a blue flash, it's too late."}, {"userName": "Jon Josserand", "userReviewDate": "Jul 06, 2014", "userURL": "http://www.goodreads.com/user/show/4247799-jon-josserand", "userReview": "An amazing compendium of accidents and mishaps involving nuclear energy in the laboratories, nuclear fuel mining and fabrication, civil nuclear power plants, and the stewardship of nuclear weapons by the military. I previously I knew of a few of these, and assumed I knew of most of them. I was wrong by a wide mark. This is a straightforward book, which starts with the dangers inherit in the steam industry, and proceeds forward into the early scientific research of nuclear power, then into the military and civilian use of this power source."}, {"userName": "Jani-Petri", "userReviewDate": "Mar 11, 2014", "userURL": "http://www.goodreads.com/user/show/5957642-jani-petri", "userReview": "Very informative book by an engineer who knows his stuff. Goes through all major (and some minor) screw-ups in painful detail. I consider myself to be fairly well informed on these things, but this book taught me a lot."}, {"userName": "Andrea", "userReviewDate": "May 27, 2014", "userURL": "http://www.goodreads.com/user/show/938217-andrea", "userReview": "Really enjoyable and informative, though still a challenge that only complicates my understanding and opinions about nuclear energy. The footnotes were often the best part."}, {"userName": "Nicole", "userReviewDate": "Aug 29, 2017", "userURL": "http://www.goodreads.com/user/show/225957-nicole", "userReview": "This book didn't really work for me. I was not interested in the details of just how different kinds of nuclear reactors and such work, and so for large sections, I couldn't concentrate on the descriptions. Since I was listening to an audiobook, I'd just kind of mentally drift until the accident actually happened. I was also really hoping for more descriptions of the aftermaths of the accidents, but Mahaffey usually ended the story once there was no more meltdown happening. I did enjoy the stories of very early radiation accidents and the end stories about Three Mile Island, Chernobyl, and Fukushima, but again, it wasn't quite the focus I was looking for. And while I don't mind that Mahaffey is trying to convince the reader that nuclear power is our best resource going forward, I was really bothered that he both somewhat dismissed the problems at Fukushima Dai-ichi as ultimately unavoidable because no design can prepare for all possible events and yet predicted there would never again be such a severe accident in the future. I also thought he was rather cavalier about people's fears of radiation contamination. I too reminded myself about the radiation exposure that comes with eating one banana a day when I lived less than 100 km north of Fukushima, but I also saw what happened to the produce grown to Fukushima's south, and I wouldn't suggest anyone eat them to make any kind of point about our society's inflated concerns."}, {"userName": "Paul", "userReviewDate": "May 28, 2018", "userURL": "http://www.goodreads.com/user/show/2579781-paul", "userReview": "This is a solid set of anecdotes about atomic accidents. Because nuclear power and nuclear bombs are so fantastical and have a semi-mystical quality to them, these sorts of anecdotes tend to be told over and over again in popular culture. This book digs deeper and contains a bunch of nuclear-related accidents I had never heard of before. For example, I've heard the story of the Demon core many times before, but apparently there were parallel safety incidents that occurred in Russia that basically mirrored the demon core accidents, and that is rarely mentioned. This book is full of that kind of thing.I also really liked that Mahaffey managed to write a book about the history of nuclear accidents that spares no details but also leaves you feeling more confident in nuclear power. He's not putting a whitewash on nuclear power by any stretch of the imagination, but - presumably because he comes from a nuclear engineering background - he's not playing on the fear and disinformation that people have been spreading about nuclear power for ages. Definitely a recommended read.4.5 of 5 stars"}, {"userName": "Bryan", "userReviewDate": "Apr 26, 2017", "userURL": "http://www.goodreads.com/user/show/21424051-bryan", "userReview": "This book is a great read to dispel superstitions and misplaced fears about nuclear energy. The author accomplishes this by relating the details of just about every nuclear mishap known to mankind.While there are real dangers associated with nuclear energy and radiation, the general populace tends to blow these dangers way out of proportion and as a result, we rely much more on hydrocarbon based energy. By contrast, coal has resulted in many more deaths and is much worse for the environment, but remains one of the largest sources of energy in the United States - primarily because of misplaced fear."}, {"userName": "Gina", "userReviewDate": "Aug 09, 2017", "userURL": "http://www.goodreads.com/user/show/16664169-gina", "userReview": "I'm not pro-nuclear energy, but I found the information presented here to be extremely interesting and engaging. This book left me with as clear and detailed an understanding of nuclear physics, engineering, and history of civilian and military applications of nuclear technology as you can get outside a classroom.I rarely learn this much from a single book. A must-read, whether you are pro-nuclear energy or against it."}, {"userName": "Susan Gallagher", "userReviewDate": "Aug 13, 2017", "userURL": "http://www.goodreads.com/user/show/7340859-susan-gallagher", "userReview": "Could be subtitled \"Plutonium is crazy stuff, and people do dumb things with it.\"The physics was a bit hard to grasp at times, but the stories were fascinating. It ended on a high note, with hope for major advances in the safety and efficiency of nuclear energy production."}, {"userName": "Jeanine", "userReviewDate": "Jan 30, 2018", "userURL": "http://www.goodreads.com/user/show/2045445-jeanine", "userReview": "I can’t even with this. I’m not a scientist, but I could probably qualify now after listening to this shit for hours on end."}, {"userName": "Steve Rochford", "userReviewDate": "Mar 22, 2017", "userURL": "http://www.goodreads.com/user/show/5766047-steve-rochford", "userReview": "Great book!This book is a thrilling journey through the history of nuclear accidents. Great pace, great content, and amazing events in history to reflect on. The technical content is laid out efficiently and explained with enough concern for the layman that anyone with a decent attention span can understand it.I would read this book again and would definitely recommend it to anyone interested in the fascinating story of nuclear power.If I could wish for one more chapter it would be a certain depth of understanding of the comparison of accidents and harm done by power facilities of other fuel types, coal, etc. That, perhaps, would be best suited for another book."}, {"userName": "Paul", "userReviewDate": "Aug 21, 2014", "userURL": "http://www.goodreads.com/user/show/596266-paul", "userReview": "I picked this book up on Monday, it was listed on BookBub as being available from Amazon for my Kindle, for $1.99! It is easily worth the regular price of $13.99. The author breaks down most known accidents, mishaps,, and mishandling of of nuclear weapons, nuclear power plants, and nuclear technology. What makes this book different is that the author is a pro advocate of. The nuclear power, but breaks down what went wrong, how it went wrong, what should or could have been done differently,, and if possible what was learned from it, in terms that are relatively understandable, for a non nuclear physicist. Yes at time it is overly simplified or optimistic, but you still get a full clear story, of everything from the development of the first atomic bombs, the \"tickling the dragon\" experiment, the mishandling of nuclear weapons, Three Mile Island, Chernobyl, and Fukushima. You also learn about some of the mishaps and lax precautions at Hanford plutonium manufacturing plant, Rocky Flats plutonium trigger Manufacturing plant, and the bomb assembly plant Pantax in Texas.There are many wonderful books that cover each of these case study subjects exclusively and far more in depth such as 1. The Making of The Atomic Bomb- Richard Rhoades2. Full Body Burden- Kristen Iversen (Rocky Flats)3. Command and Control- Eric Schlosser (Nuclear weapons development, mishandling and mishaps).This book details each incident expertly and the reader gets a much better understanding of what is a nuclear reactor, what is criticality, what is a meltdown, what makes a bomb atomic. This is a fantastic, informative, and an enjoyable book to read."}, {"userName": "Kyle Bunkers", "userReviewDate": "Oct 12, 2014", "userURL": "http://www.goodreads.com/user/show/22356256-kyle-bunkers", "userReview": "I was very impressed with both the writing, writing style, and information present in this book. It presents a good story about a good sample of the atomic accidents throughout the past ~150 years. The author gives a good discussion of what went wrong, defining things as need be, without getting overly technical, and making sure to keep the story interesting with the \"human\" element to the story. I would definitely recommend this, as while the author is \"pro-nuclear\", he gives an even-headed unbiased view of each accident, and spells out some possibilites for future nuclear power reactors. If you do like this book, make sure to check out Richard Rhodes's \"The Making of the Atomic Bomb, as the two are in a similar vein."}, {"userName": "Victor Goodman", "userReviewDate": "May 19, 2014", "userURL": "http://www.goodreads.com/user/show/31520953-victor-goodman", "userReview": "Who knew ? Well everyone in 1905-20. Radium was the thing. Mineral water was great because it contained radon; they didn't know that but it sure felt good. \"What doesn't kill you will make you stronger\". The author doesn't believe this but many Americans do--it is the basis of homeopathic medicine. The author is a great storyteller. There are at least a hundred scary stories in this book. I really like his use of slang and vivid descriptions of desperate actions as operators try to outthink the dreaded atomic piles. Now I know the difference between fast neutrons and slow neutrons. This is a big deal."}, {"userName": "Elaine Bennington", "userReviewDate": "Oct 14, 2014", "userURL": "http://www.goodreads.com/user/show/29544470-elaine-bennington", "userReview": "I wondered--now I see. \"atomic accidents\" was a book I picked up on kindle almost as a Halloween story fest and I wish to be forgiven by the author. even though it is complicated reading, I could not put it down. Well written and even humorous in spots (like gallows humor), the book is a history of atomic fission, both bombs and reactors. it is a must-read for those of us who have worried about this issue and who yet know we must do away with coal plants. excellent writing from a real insider from nuclear reactors--read it and learn."}], "description": "A “delightfully astute” and “entertaining” history of the mishaps and meltdowns that have marked the path of scientific progress (Kirkus Reviews, starred review). Radiation: What could go wrong? In short, plenty. From Marie Curie carrying around a vial of radium salt because she liked the pretty blue glow to the large-scale disasters at Chernobyl and Fukushima, dating back to the late nineteenth century, nuclear science has had a rich history of innovative exploration and discovery, coupled with mistakes, accidents, and downright disasters. In this lively book, long-time advocate of continued nuclear research and nuclear energy James Mahaffey looks at each incident in turn and analyzes what happened and why, often discovering where scientists went wrong when analyzing past meltdowns. Every incident, while taking its toll, has led to new understanding of the mighty atom—and the fascinating frontier of science that still holds both incredible risk and great promise.", "title": "Atomic Accidents: A History of Nuclear Meltdowns and Disasters: From the Ozark Mountains to Fukushima", "url": "http://www.goodreads.com/book/show/20579068-atomic-accidents", "average": 4.2, "cover": "https://images.gr-assets.com/books/1396783468l/20579068.jpg", "reviews": 154, "authors": [{"url": "https://www.goodreads.com/author/show/7476706.James_Mahaffey", "name": "James Mahaffey"}], "type": ["History", "Science", "Nonfiction", "Audiobook", "Science"], "outlinks": ["http://www.goodreads.com/book/show/20579068-atomic-accidents", "http://www.goodreads.com/book/show/17654695-atomic-accidents", "http://www.goodreads.com/book/show/20820098-atomic-accidents", "http://www.goodreads.com/book/show/30756442-atomic-accidents", "http://www.goodreads.com/book/show/20608458-atomic-accidents", "http://www.goodreads.com/book/show/6600498-atomic-awakening", "http://www.goodreads.com/book/show/32191825-atomic-adventures", "http://www.goodreads.com/book/show/13135745-nuclear-accidents-and-disasters", "http://www.goodreads.com/book/show/13795249-nuclear-power-set-6-volumes", "http://www.goodreads.com/book/show/13795103-the-history-of-nuclear-power", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}