{"ratings": 179, "userreviews": [{"userName": "Carol", "userReviewDate": "Mar 09, 2008", "userURL": "http://www.goodreads.com/user/show/951050-carol", "userReview": "When I was in college I heard the author give a reading from this at my dorm and was so enchanted I bought the book on the spot. More than 20 years later I still think Childress is underrated as a fine Southern writer. He should be a lot more famous than he is."}, {"userName": "Reid", "userReviewDate": "Dec 12, 2009", "userURL": "http://www.goodreads.com/user/show/1235793-reid", "userReview": "This books starts off well, with an interesting story and well-drawn characters. About a third of the way in, though, it devolves into an odd mysticism that the author seems incapable of either delineating or sustaining. There is no plausibility to the character of the \"boy touched by fire\", and no deeper meaning lurking in the darkness of evil which seems to surround this town. One wonders if Childress is not another in a long line of young Southern writers who hope to claim Faulkner's crown; if so, he is not up to the task, and perhaps should content himself with simple storytelling until his craft is a bit more honed. In all fairness, this is a first novel, and 25 years old. He has written more since; perhaps he has a better grasp at this point and I should give him another chance. His prose is sharp and strong, and his characterizations sure, even where his story is weak. My guess is that his later novels were much better."}, {"userName": "Anna", "userReviewDate": "Aug 11, 2012", "userURL": "http://www.goodreads.com/user/show/10642160-anna", "userReview": "I really like this author. This book is not for the squeamish, but I couldn't put it down. Loved his characters, esp. the southern dialects."}, {"userName": "Summer", "userReviewDate": "Sep 24, 2007", "userURL": "http://www.goodreads.com/user/show/394774-summer", "userReview": "This book is so, so awful! I hated it. There were a lot of themes of hoodoo (however you spell it) and witchcraft and all these crazy symbols...I had to read it for Alabama lit and was then forced to give a presentation on this awful thing.But I feel like I need someone else to read it so I can discuss...so maybe I would recommend it to my friends, even though it is so crappy."}, {"userName": "Martina Clark", "userReviewDate": "Jan 01, 2014", "userURL": "http://www.goodreads.com/user/show/19895472-martina-clark", "userReview": "Loved loved loved this book. To be sure, it is a dark and delicious tale, but one that reminds me why a good writer is such a treasure and, certainly, Mark Childress is not only a good writer, but an extraordinary writer. Highly recommend!"}, {"userName": "Gwen", "userReviewDate": "Sep 14, 2010", "userURL": "http://www.goodreads.com/user/show/1686548-gwen", "userReview": "I enjoyed the first half of the book, by the end I was getting tired of it and didn't like the direction it took. I felt confused some of the time."}, {"userName": "Libby", "userReviewDate": "Feb 06, 2012", "userURL": "http://www.goodreads.com/user/show/1292993-libby", "userReview": "I have read all of Mark's newer books and have loved them. When I found this one and realized it was a much earlier work, I decided to give it a try. Unfortunately, I didn't care for it at all."}, {"userName": "Tuluka", "userReviewDate": "Apr 18, 2012", "userURL": "http://www.goodreads.com/user/show/8354471-tuluka", "userReview": "Interesting, had to go back and re-read again to \"get\" it all. But, enjoyed it."}, {"userName": "Sara", "userReviewDate": "Jan 02, 2014", "userURL": "http://www.goodreads.com/user/show/8879294-sara", "userReview": "Eh. This book started out with a lot of promise... then went downhill from there. By the end, I had no idea what was going on."}], "description": "\"The ambivalence of fire--as evocation of glowing love and furious destruction--permeates this stunning first novel by Mark Childress, a young Southern writer who gives fresh expression to his region's literary preoccupations. A World Made of Fire is set in rural Alabama in the decades before World War I . . . Childress has created a wholly believable world. The landscapes are forceful and the characters deeply felt. . . . A World Made of Fire probes varieties of tenderness and love, principally from the viewpoint of [a] young girl, Estelle Bates, whose literary forebears include Lena Grove in Faulkner's Light in August. . . .Childress dramatically traces her course, keeping the violent and the tender elements in a tense, remarkably effective balance. . . . Reading it is rather like staring for a good long while into the coals of a fire; in that concentration of energy, many things can be learned\".--Newsday", "title": "A World Made of Fire", "url": "http://www.goodreads.com/book/show/559611.A_World_Made_of_Fire", "average": 3.38, "cover": "https://images.gr-assets.com/books/1175797333l/559611.jpg", "reviews": 14, "authors": [{"url": "https://www.goodreads.com/author/show/104125.Mark_Childress", "name": "Mark Childress"}], "type": ["Fiction", "American"], "outlinks": ["http://www.goodreads.com/book/show/559611.A_World_Made_of_Fire", "http://www.goodreads.com/book/show/2350203.A_World_Made_of_Fire", "http://www.goodreads.com/book/show/550821.Crazy_in_Alabama", "http://www.goodreads.com/book/show/178759.One_Mississippi", "http://www.goodreads.com/book/show/8666775-georgia-bottoms", "http://www.goodreads.com/book/show/559609.Gone_for_Good", "http://www.goodreads.com/book/show/450838.Tender"]}