{"ratings": 345, "userreviews": [{"userName": "Jan C", "userReviewDate": "Apr 02, 2012", "userURL": "http://www.goodreads.com/user/show/1855321-jan-c", "userReview": "I love Barry Maitland and this series. Very thoughtful. He does have a note that this was written before 9/11.He gives full portrayals of the Muslims in the book.He had me fooled. I didn't figure it out until after Brock did. Although at that point it seemed like this was almost the only solution left. And, yet, he still had a few twists and turns to puzzle me. I'd started The Verge Practice but was having trouble getting into it. Why? Because I had missed the book following Silvermeadow, Babel. I did have a little trouble remembering what had happened to Kathy in the last book, it having been a number of years since I read it; and this is a major storyline here, at least in the beginning. She thinks about leaving Brock and the team. I'd forgotten how much I was missing Barry Maitland and his stories. Good thing I have several more of his to go through. I've always thought that The Marx Sisters was the best; but this was very good, too. And it is on kindle now."}, {"userName": "Sam Still Reading", "userReviewDate": "Jun 16, 2010", "userURL": "http://www.goodreads.com/user/show/162915-sam-still-reading", "userReview": "Babel was the last Brock and Kolla novel I had in my TBR stash. I was quite sad about this, as Maitland writes fantastic British crime novels from the perspective of detectives David Brock and Kathy Kolla. I’ve read the majority now (completely out of order) and I can confidently say that they are the best British police crime series I’ve read. The characters are believable, the crimes interesting (yet plausible) and I haven’t been able to guess the killer 100 pages in.In summary, this book takes place shortly after Silvermeadow (but you don’t need to have read this for the novel to make sense). Kathy has been attacked personally and is thinking of leaving the police. Brock has just been put on a new case- the murder of a university lecturer on his way to a lecture. The initial evidence points to a fundamentalist religious group, yet not is all it seems at the university.Written pre-September 11, 2001, I felt this book dealt sensitively with the Muslim faith. There are no stereotypes or messages pressed on the reader and I felt I learned more about the faith.Babel is slightly different to the other Maitlands I’ve read in which a lot of time is spent trying to figure out the motive for murder after the murderer has been discovered. This is unusual but no less gripping. The plot twists and turns and just as you think it’s finished, there’s a twist which is plausible given the previous events.I’m not usually a big crime fan but I highly recommend the Brock/Kolla series. They’re a bit like The Bill before it got entangled in the character’s lives (and the shaky camerawork). You do hear a bit about Brock and Kolla’s personal lives, but I think this would be less than a chapter in the whole book. The focus is on the crime and the police’s role.http://samstillreading.wordpress.com"}, {"userName": "Tony", "userReviewDate": "Jan 19, 2009", "userURL": "http://www.goodreads.com/user/show/1361000-tony", "userReview": "Maitland, Barry. BABEL: A Kathy and Brock Mystery. (2002; U.S. 2003). ****. Here’s another well-written and literate police procedural from this author, who seems to never run out of new plot twists. This one starts off with the assasination of a philosophy professor on the steps of his university in London. He is approached as he is walking down by a man in a hooded shirt, wearing what appears to be a mask. The assasin shoots him twice in the heart. He loses himself in the crowd before anyone realizes what has happened. The professor was just about to deliver an address about the evils of science as practiced at the university. Turns out that the university is heavy into research on medical genetics. Most of the work is funded by the Arab/Islamic countries because of some of their special needs. The university has already suffered some setbacks because of some reputed religious slurs against Muslims and can’t take much more, especially since they depend on their funding supporters. In the process of the investigation, we learn a lot about genetics and about Islamic fundamentalists. Brock and Kathy get on the case and try to determine who the killer was and what – among many possibilities – was the motive for the killing. The tension is high between Muslims and Christians in London, and our investigators have to tread lightly to make sure that this case doesn’t lead to an escalation that would lead to further demonstrations between the two religious groups. As in previous novels from this author, our heroes from Scotland Yard are single-minded in their pursuit of potential motives and suspects, and, as usual, Kathy seems to spend a great deal of her time with a new “friend” or two in bed. This is an excellent series and I recommend it highly."}, {"userName": "Ivonne Rovira", "userReviewDate": "Aug 06, 2013", "userURL": "http://www.goodreads.com/user/show/3803671-ivonne-rovira", "userReview": "In Babel, Barry Maitland's sixth entry in the Kathy and Brock mystery series, Sergeant Kathy Kolla's suffering from post-traumatic stress disorder incurred during the horrific ending to the previous book, Silvermeadow. Indeed, Kathy's state of mind remains so fragile that she's contemplating giving up her police career.Amidst her angst, a masked gunman fatally shoots an academic at the fictional University of Central London East as he's on his way to deliver what was promised to be a controversial lecture. Why was philosophy professor Max Springer killed in broad daylight? Does the murder have anything to do with Islamic terrorism, as some have hinted? Or with a secretive gene-research lab on campus that Springer had been reviling? Or does the cause of Springer's death lay in yet another quarter? As with all of his books, Maitland sets a fast pace for Babel and loads the novel with surprises. I never saw the end coming nor even once suspected the true culprit. Babel makes for a great read for all, although those familiarized with the cause of Kathy's trauma from having read Silvermeadow will enjoy the novel much, much more.Again, special thanks to my Goodreads friend, Magda, from Down Under who pointed me to Aussie writer Barry Maitland."}, {"userName": "Kirsty Darbyshire", "userReviewDate": "Dec 07, 2010", "userURL": "http://www.goodreads.com/user/show/4631512-kirsty-darbyshire", "userReview": "My enthusiasm for this series is waning a little. I've got a bit fed up with the way that DS Kathy Kolla throws herself into danger at the end of every book, it's in character but it's over the top. In this book Kathy is still recovering from the events of the end of the last book so she's a bit less sure of herself and it's actually DCI David Brock who walks into a stupid situation near the end. I'd say that he has more logical reasons to do so than Kathy usually does but it still needles me and the high drama that results is all a bit silly. There's a lot of good and interesting stuff in this book, mostly to do with the plot that concerns itself with religious fundamentalists, there are some good relationships portrayed, Kathy's love life actually seems realistic for once, but there were more than enough bits of the book that had me rolling my eyes as people acted in not quite believable ways. On the whole I did enjoy reading it but I'm not sure that it's going to stick with me and it won't be a favourite."}, {"userName": "Ashley", "userReviewDate": "Oct 07, 2015", "userURL": "http://www.goodreads.com/user/show/2745871-ashley", "userReview": "I didn't enjoy this one as much as the others, because the misdirection was heavy handed and parts of Maitland's portrayal of the Muslim community came off as racist. Here, as with how homosexuality was handled in The Malcontenta, characters in the story express bigoted beliefs about Muslims, including calling people \"the Iraqis\" and suggesting two Iraqi scientists were thugs and could have been responsible for smuggling guns into the country...because they were Iraqi and being used by another man to intimidate someone. Another portrayal was obvious Western bent to Near Eastern ways of life was the characterization of Manzoor, a Pakistani business owner. I'm not even going to address the treatment of the radical Muslims at the beginning of the book, which was straight up profiling and uncomfortable to read.I liked the mystery and the unraveling of the conspiracy, but the racial elements dates it. Not one of the stronger Maitland stories."}, {"userName": "Pam Foster", "userReviewDate": "Mar 07, 2018", "userURL": "http://www.goodreads.com/user/show/8801041-pam-foster", "userReview": "Enjoyed the first 5 Brock & Kolla books better than this one. This didn't have the energy of the others and the supporting characters weren't as well drawn, but still an interesting plot and outcome."}, {"userName": "Any Length", "userReviewDate": "May 12, 2018", "userURL": "http://www.goodreads.com/user/show/5571087-any-length", "userReview": "An interesting book, but one must consider it was written before September 11!"}, {"userName": "Monica", "userReviewDate": "Mar 05, 2016", "userURL": "http://www.goodreads.com/user/show/5870323-monica", "userReview": "The fact that this book was written a couple of years before the attacks of 9/11 is noteworthy. The principal themes of cultural conflict and religious fundamentalism are even more timely today than they were fifteen years ago. The other themes in the book, genetic engineering and the commercialization of university departments and studies are equally timely. That said, I found it an interesting read rather than a particularly engaging one.A curmudgeonly philosophy professor at a mid tier university is gunned down as he is walking into a lecture. He has been railing against the university's shift from liberal studies to genetic research funded by commercial interests, many from the middle east. He has been equally scathing in his criticism of religious fundamentalism and scientific arrogance, so there are many potential suspects. Brock is leading the team investigating, Kolla is still on leave considering whether she want to return to the job. He misses her observational skills and her dogged persistence in sifting through evidence and she comes to realize that she doesn't want to give up policing.I found the denouement a bit of a stretch and not entirely convincing."}, {"userName": "Candy Wood", "userReviewDate": "Jul 23, 2011", "userURL": "http://www.goodreads.com/user/show/5858970-candy-wood", "userReview": "An author's note says that this fifth book in the Kathy and Brock series of London police procedurals was written before 9/11/2001. Otherwise, one would assume that Maitland intended to build on the interest in Islam generated by that day's events. Actually, several trendy issues are explored here, not only the fears associated with Muslim immigration but also genetic research and the state of Britain's new universities as they have increasingly adopted a business model. The first victim is a philosophy professor whose department has been all but abolished. Various twists ensure that the plot is not predictable, as Maitland continues to develop the character of Sergeant Kathy Kolla in interesting ways. Anyone who has not read the previous book, Silvermeadow, should still have enough information to understand the crisis Kathy is experiencing at the beginning of this one. I was glad not to remember the exact details, which almost put me off the series. (Hmm. Now on Goodreads, I see that this title is supposed to be #6. Confusing.)"}, {"userName": "Julie", "userReviewDate": "May 20, 2013", "userURL": "http://www.goodreads.com/user/show/12355186-julie", "userReview": "I wasn't sure what I expected with this novel, but it was great!! It kept my attention; I couldn't put it down until I finished it. First of all the racial tension and international feel of London was clearly portrayed in the novel. There were different types of Muslims (Shia & Sunni) from different countries (Pakistan, Lebanon, etc.)involved in the tale. The author tackled the idea of honor-killing and racism. On the other side, the mystery involved philosophy vs. genetic science. At one point in the novel, it seems to be that the suspects are Muslim and then at another point, professors and a center for genetic research. Very well crafted together for a surprise ending. I really like the police work of Brock and Kolla as well. It is nice to see how their minds work, but also how they struggle with events that have happened in their lives. It makes them more realistic. I will definitely read more by this author!"}, {"userName": "Anna", "userReviewDate": "Apr 19, 2014", "userURL": "http://www.goodreads.com/user/show/2710780-anna", "userReview": "As always, I enjoyed Maitland's work. One of my favorite things about his books is that they each enter pretty fully into an aspect of life I wouldn't know about...art, religion, mall security, etc. I enjoyed this book more for its focus on academics than radical Muslims, but it kept my interest all the same.I do have a qualm that I think is mentioned in other reviews. Leon Desai shows up again and everything Kathy says, and his thought that \"if he had been stronger they would have been very happy together\" suggests that the author has completely forgotten that Leon is gay. The guy came out and left Kathy for a guy, which is fine (if sad) for me, but we can't act like that didn't happen, Maitland! So why are they discussing getting back together only as friends? Why is Kathy blaming her missing their date for the end of their relationship? I will not be happy if this is not resolved in a reasonable, continuous to the storyline way."}, {"userName": "Cheryl", "userReviewDate": "Oct 23, 2013", "userURL": "http://www.goodreads.com/user/show/8188205-cheryl", "userReview": "It's been a while since I've read a Kathy and Brock mystery - and this is an older one --- but was not as caught up in the story as I have been in some of the others. Having said that, the story line showing the old differences between Asian immigrants to England - both those who have been there for generations but because they keep with old traditions, are seen as not integrated; and those who have just come to England and run into the wall of prejudice -- were quite up to date in its focus. The relationship between Kathy and Brock has always been rather vague to me, and this particular story didn't clear that up any for me. Not a bad read - just not as good as I've read of the author's."}, {"userName": "Mike", "userReviewDate": "Aug 11, 2011", "userURL": "http://www.goodreads.com/user/show/3566810-mike", "userReview": "Another fine, multi-faceted, multi-threaded outing with Brock and Kolla from Mr. Maitland. This time the threads involve some very contemporary subjects like the West (particularly a ratings-mad press) seeing terrorism around every corner when the actual event may be rooted in traditions and customs older than mere \"terrorism\". Throw in some academia-based jealousies, the changing emphasis of large 'business-oriented' universities, cutting edge genetics, and the effect of a flat world in general for good measure. Superimpose it all on Kathy's wavering indecision about her future after the last terrifying outing and place it in the colorful setting of London's Docklands, and 'that side' of the river in general, and you are in for a real page-turning, mind-straining treat!"}, {"userName": "Kay", "userReviewDate": "Dec 02, 2011", "userURL": "http://www.goodreads.com/user/show/4833867-kay", "userReview": "Got this on loan, free to Amazon Prime members, for my Kindle.  As is typical of Maitland's mysteries, this is a thoughtful and thought-provoking whodunit that is--if anything--more relevant in 2011 than it was in 2003. The victim is a distinguished philosophy professor whose writings on the Holocaust, the Palestinian cause, and fundamentalism have made him very controversial. Was he killed for his beliefs or for something entirely different? As Britons generally and the police force in particular try to come to grips with the role of Muslims in British society, this book also takes a look at the ethics of genetic research. Worth rereading!"}, {"userName": "Laura", "userReviewDate": "Jan 15, 2011", "userURL": "http://www.goodreads.com/user/show/1000163-laura", "userReview": "This is my favorite in the series thus far. Now that I've gotten to know the characters, the decisions they make about their private and their work lives are more meaningful than they were earlier in the series. The plot was solid--exciting and tricky, though not unbelievable (for the realm of a mystery/thriller, which of course has to be a bit unbelievable or it wouldn't be any good at all) and I just love Maitland's use of the prologue. I have a literary crush on the prologue; he uses in them in all (I think...) of these books, but this one was especially effective. Highly recommended."}, {"userName": "Diogenes", "userReviewDate": "May 22, 2016", "userURL": "http://www.goodreads.com/user/show/31907708-diogenes", "userReview": "2.5 starsA London detective sergeant is about to leave the police after a terrible (but not described) ordeal, but gets involved and rejuvenated in a new and complex investigation, For fans of the Brock & Kolla series, this will keep them happy, but for others - it might seem a bit like reading something written for young adults; overly simplistic, ploddingly plotted and a great pains to be politically correct."}, {"userName": "Connie", "userReviewDate": "Apr 04, 2013", "userURL": "http://www.goodreads.com/user/show/2045664-connie", "userReview": "This is not as strong a mystery as the others in the series. I liked that it continued from the end of the previous book, Silvermeadow. It also helped me to understand more of Kathy and Leon's relationship as well as that of Brock and Suzanne. Hope to read the next one in the series as soon as it's available from the library."}, {"userName": "Kelv", "userReviewDate": "Feb 03, 2013", "userURL": "http://www.goodreads.com/user/show/4341127-kelv", "userReview": "Good for the following reasons; the author gave enough information about each character and there past events without having to read previous books. Story was at an ok pace and interesting. Events seemed real, so to did the dialog. Ending had a twist but somewhat predictable and therefore not that ground breaking. Kathy and Brock were enjoyable, so too was Darr and Haygill."}, {"userName": "Angie", "userReviewDate": "Mar 26, 2011", "userURL": "http://www.goodreads.com/user/show/440629-angie", "userReview": "I just love the subtle mixture of these mysteries. Maitland does put together a fab and twisty plot but it is Kathy and Brock that keep you coming back. They aren't wonderful and perfect and do everything right all the time, they make mistakes and stumble. The author lets them be who they are and that is rare in character making sometimes."}, {"userName": "Kerim Kavakli", "userReviewDate": "Dec 02, 2014", "userURL": "http://www.goodreads.com/user/show/35051708-kerim-kavakli", "userReview": "Barry Maitland's books are good, but not brilliant. He is much better than most detective novelists like J. Patterson and the Brock and Kolla series don't really get tiring. His only trope is to include a twist in the last 50 pages where Kolla solves the last piece of the crime puzzle."}, {"userName": "Deb", "userReviewDate": "Apr 17, 2010", "userURL": "http://www.goodreads.com/user/show/1916635-deb", "userReview": "6th in the series....i like this british mystery author. very good characters....mysteries are suspenseful...."}, {"userName": "Mamatufy", "userReviewDate": "Jan 30, 2016", "userURL": "http://www.goodreads.com/user/show/4795029-mamatufy", "userReview": "I enjoy the way the author blends & weaves the story & characters, makes for an interesting story."}, {"userName": "Sue", "userReviewDate": "Apr 25, 2011", "userURL": "http://www.goodreads.com/user/show/1444481-sue", "userReview": "Still contemporary British mystery with a twist. running to the end of this series and will be sad to see it end."}, {"userName": "Kathy Daso", "userReviewDate": "Oct 09, 2016", "userURL": "http://www.goodreads.com/user/show/20410223-kathy-daso", "userReview": "Great...academia, genetics research, Islam and murder."}, {"userName": "Gary Van Cott", "userReviewDate": "Jun 15, 2013", "userURL": "http://www.goodreads.com/user/show/17554688-gary-van-cott", "userReview": "Most of the way through I thought this was a great book, but then it dragged at the end."}, {"userName": "MaryAnn", "userReviewDate": "Nov 02, 2009", "userURL": "http://www.goodreads.com/user/show/1799650-maryann", "userReview": "Harder to follow than some of the others in this series, but a good read nonetheless."}, {"userName": "Mary", "userReviewDate": "Mar 10, 2016", "userURL": "http://www.goodreads.com/user/show/3043495-mary", "userReview": "Another excellent book from Barry Maitland. What will I do when I've read them all?"}, {"userName": "Mary G.", "userReviewDate": "Jul 15, 2010", "userURL": "http://www.goodreads.com/user/show/380583-mary-g", "userReview": "Another very good police procedural from Maitland."}, {"userName": "Carol", "userReviewDate": "Jun 06, 2010", "userURL": "http://www.goodreads.com/user/show/3376463-carol", "userReview": "Not as good as prior Maitland mysteries, perhaps because the story line about Islamofascism was in effect rendered outdated by 9/11."}], "description": "In Babel, Kathy Kolla and David Brock, Scotland Yard’s brilliant and unconventional crime-solving team, take on an unsettling new mystery that touches many sensitive issues: Arab fundamentalism, genetic engineering, and murder.Following her ordeal in the stakeout at the Silvermeadow supermall, Detective Sergeant Kathy Kolla is on leave, so haunted by past events that she is tempted to quit the force for good. Hearing about this puzzling new case makes her realize that nothing can keep her out of the game for too long. Professor Max Springer, a distinguished if controversial academic, has been brutally murdered on the steps of a London university. Springer was known for his stand against Islamic extremism, but was that motive enough to kill him?While Kolla and Brock start looking for answers in London’s Arab community, rivalries within the university point in another direction, and Springer’s colleague, a professor of medical genetics, becomes involved. Is he as troubling a figure as he seems? Meanwhile, why would somebody leak information about this critical investigation to the media, risking an explosion in the streets? In this taut and satisfying mystery, Barry Maitland proves once again that he is one of the masters of police procedural writing today.", "title": "Babel: A Brock and Kolla Mystery\n      \n          (Brock & Kolla #6)", "url": "http://www.goodreads.com/book/show/24428994-babel", "average": 3.81, "cover": "https://images.gr-assets.com/books/1420931370l/24428994.jpg", "reviews": 33, "authors": [{"url": "https://www.goodreads.com/author/show/86734.Barry_Maitland", "name": "Barry Maitland"}], "type": ["Mystery", "European Literature", "Thriller", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/24428994-babel", "http://www.goodreads.com/book/show/13574932-babel", "http://www.goodreads.com/book/show/150080.Babel", "http://www.goodreads.com/book/show/150085.Babel", "http://www.goodreads.com/book/show/150081.The_Marx_Sisters", "http://www.goodreads.com/book/show/150078.No_Trace", "http://www.goodreads.com/book/show/150082.The_Chalon_Heads", "http://www.goodreads.com/book/show/190527.The_Malcontenta", "http://www.goodreads.com/book/show/23252909-crucifixion-creek"]}