{"ratings": 22, "userreviews": [{"userName": "Andre", "userReviewDate": "May 20, 2018", "userURL": "http://www.goodreads.com/user/show/5321728-andre", "userReview": "Professor George Yancy wrote an op-ed in the NYTimes entitled, Dear White People. It was essentially an open letter to white people, a ‘gift’ he called it, for white folk to take an honest and no doubt painful look at how their whiteness continues to feed the monster of white supremacy. And so this slim volume is an exploration of the backlash he received via the responses to his ‘gift.’Professor Yancy maintains he was fully aware of how white people would respond, though by his writing it feels like he was shocked into another level of awareness that clearly he wasn’t all that prepared for. He was truly shaken by the intensity and vitriol of white reaction to a very benign, albeit bold letter. He details in this slim volume the excerpts from many of those who reached him via email, snail mail and voice mail. There were death threats, the copious use of the N-word, comparisons to animals, etc. All this over a letter that was offered as a gift with love simply seeking a little reciprocity in asking one to be vulnerable. It is frightful to read some of the feedback, but it’s not a fright born of fear, but one of disgust. George Yancy asks the white reader to shoulder some of this pain, requesting they take all this in and sit with it and empathize with how he must feel. He suggests that his personal pain is just a microcosm of what Black people experience daily as they move through life. How does whiteness affect Blackness? How does implicit bias impact the Black body and psyche? It “feels as if Black embodied existence is in a constant and unrelenting state of trauma.”If people are sincerely interested in change, then a tremendous amount of work must be done and what George Yancy is saying, the heaviest burden is on those who benefit the most from this system, i.e. white people.He is certainly not the first writer to make such a claim, in fact James Baldwin, who is heavily quoted throughout this text was writing about race, racism, and white-black relations in the 60’s. There are also plenty contemporaries who have taken up the mantle including a number of white scholars and writers many of which are referenced here also. It is not an easy thing to be told you are a problem and harder still to hear that, and subsequently gather the intestinal fortitude to challenge oneself to move from problem to solution, to become less of a problem and indeed minimize the role and impact you have on the maintenance of white supremacy. That is the ultimate ask of George Yanky’s ‘gift.’One must “risk tarrying with a disagreeable mirror that refused to walk quietly around the issue of whiteness.” What is the takeaway? Well he warns against one processing these words as guilt. No, “that is far too easy” he states. Instead, “Daily, white people should take account and ask: What have I done today to alleviate the anguish, to mitigate the evil, to prevent humiliation, to fight against oppression, white arrogance, white color -evasion, white privilege, white hypocrisy, white denial, and everyday white normative ways of being?”Not only was his letter a gift, but this entire volume is a gift, if one receives it as such and does the hard work required to make this world easier for all to navigate with an absence of existential anxiety."}, {"userName": "David Wineberg", "userReviewDate": "Mar 11, 2018", "userURL": "http://www.goodreads.com/user/show/31506695-david-wineberg", "userReview": "The backlash in Backlash is the vile, hateful and vulgar response by white bigots and supremacists to George Yancy’s Dear White America, an editorial in the New York Times in 2015. In the article, Yancy offered what he repeatedly calls his “gift” to white readers, to recognize their own racism. In Backlash, Yancy gives the bigots far too much stature, quoting their ugly missives, voicemails and death threats, painstakingly analyzing their word choices, questioning their semantics and patronizing their English. As if they were credible and had value. He lowers himself to their level repeatedly. He has also spent an enormous amount of time on their misogynist websites, giving him further ammunition against their atrocious ignorance. He even criticizes the responses of whites who thanked him. He is not easy to please.Yancy’s argument is that America is innately racist by its institutions. So even if you’ve married interracially, have children of a different race, and never uttered the n-word, you are still a racist if you are white. “Loving a few Black people is not proof you have confronted your own racism,” he says. You still enjoy white privilege and don’t have to be on the defensive every day. Yancy says “We (Blacks) have been forced to lay claim to our humanity … ad nauseam.” He repeats and pounds this message continuously. It gets old.Where Backlash really falls down is in its terribly shallow scope. For someone who (frequently) touts his PhD, Yancy’s world is remarkably tiny. His navel-gazing never reaches beyond American borders. As I’m certain he knows, the USA is not the problem. Man is the problem. All over the world, majorities oppress minorities. Race is an exclusive club whose members are easy to identify. The Malays oppress the Chinese in their midst. The Burmese abuse the Rohingya, and the Japanese are superior to everyone in the world. Possibly the most striking example was Liberia, where America shipped Black slaves 200 years ago, sending them “back to Africa” (though few had ever been there). The slaves immediately lorded it over the natives, keeping them unemployed, ignorant, out of government, unequal and subservient - in their own land. Every society has its derogatory names for people of other nationalities, races, and religions. No one is perfectly Politically Correct. Yancy must know all this, but Backlash makes it seem this is a uniquely American disease, aimed only at American Blacks. Backlash is Yancy taking revenge and getting the last word, nothing more. Although he repeats (too) many times that it is written with “love”, it drips with sarcasm, anger and bitterness aimed directly at whites.For Yancy, the USA is a racist society, and therefore all whites are racists. Yancy’s bottom line is if you aren’t part of the solution (and precious few make the cut), you are the problem. End of discussion.David Wineberg"}, {"userName": "Beth", "userReviewDate": "Mar 21, 2018", "userURL": "http://www.goodreads.com/user/show/446657-beth", "userReview": "This seems like a real missed opportunity. Yancy's \"Dear White America\" letter, published in the New York Times in 2015, was a spark that started a conversation (or, in some cases, a vitriolic hissy fit), and I was hoping this book would expound on the letter in a way that would help open our white eyes to the structure of white privilege that makes up our world. Unfortunately that's not the case here.Yancy covers well the ground of overt racism by sharing the many horrific responses he received after \"Dear White America\" was published, and he states over and over again how while this overt racism is easiest for us white people to denounce, it's not the be-all and end-all of white racism and privilege, and we whites should not use our denouncement of blatant KKK-style racism as absolution. However, he rarely gets into the details of what exactly the white power structure of our society looks like today so that we can *get it.* He gives only two or three examples, such as being followed in a store due to the color of his skin, and not until at least halfway through the book (after a lot of lecturing about white racism, white privilege, etc.). By then, the people that most need their eyes opened have either already stopped reading or have already assumed a defensive stance! Perhaps changing the order of the book, so these examples (and hopefully others) come first, would get people thinking about things first, critically instead of defensively. Yancy also mentions an article by Peggy McIntosh where she gives 46 examples of white privilege, and then says \"I highly recommend this article.\" Great, but...why not give some more examples here instead of just directing people to read a different article to *get* what you're trying to explain?Listen. I know it's not the job of people of color to educate we white people on our racism, either overt of covert. But if the purpose of the \"Dear White America\" letter and of this book, as Yancy repeatedly states, is to hold up an honest and unflattering mirror to us white people of the world, to give us the gift of truth and honesty and inviting us to be vulnerable and honest in return, then DO IT. Simply saying \"white people are racist\" repeatedly doesn't help us to SEE IT, to recognize or acknowledge it. The last line of \"Dear White America\" DOES:\"If you have young children, before you fall off to sleep tonight, I want you to hold your child. Touch your child's face. Smell your child's hair. Count the fingers on your child's hand. See the miracle that is your child. And then, with as much vision as you can muster, I want you to imagine that your child is black.\"More of that would make all the difference in this important book and conversation. *Thanks to NetGalley for the ARC, provided by the author and/or the publisher in exchange for an honest review."}, {"userName": "Lacy Cunningham", "userReviewDate": "May 25, 2018", "userURL": "http://www.goodreads.com/user/show/7118559-lacy-cunningham", "userReview": "The letter ‘Dear White America’ by George Yancy was offered as a gift; Backlash is an extension of that gift and an examination of how the gift was received. The title serves as a warning of what’s to come. The format is a mix of epistolary, close-reading, references to other scholars writing about racism and impassioned plea. The close-reading element is particularly effective in that Yancy refuses to temper the ugliness of the responses to the letter. Indeed, he could have merely described having received hate mail, death threats, angry phone calls, the need for police presence near his office, and fearing for his life and the family he’d leave behind. No - he reprints letters in their entirety and close-reads them like dangerous poems, a surgeon spreading guts out on the table and forcing the white reader to look at every piece as if it were your own. Yes, it should make you sick. At the same time, Yancy in no way is trying to alienate or frighten the white reader by showing them what lies beneath. Truth, the letter, the book - these are gifts to white people who are, as he calls it, sutured. Asking your reader to be vulnerable and open to being wounded for the sake of love and justice is brave and also necessary in a country where this refusal to examine how white supremacy is the reason Black bodies face death every day for simply being Black. He is not suggesting we are all members of the KKK. Of course we aren’t. But our country is built on a history of subjugating Black bodies to lift up white ones, even if it’s not your foot that was first to stand upon a neck. White Americans are so ego-bound they refuse to see anything beyond their own personal choices that they believe these choices are context-free. In short, this is the message we need and it is long overdue. White readers, we are so lucky to be offered this letter with love and justice and collective liberation at the heart of it. Put yourself in Yancy’s position and look very honestly at yourself and how you would react to a deluge of death threats. Could you be so gracious? Take the gift. Use it well."}, {"userName": "Vnunez-Ms_luv2read", "userReviewDate": "Mar 19, 2018", "userURL": "http://www.goodreads.com/user/show/68031837-vnunez-ms-luv2read", "userReview": "I am not sure how I felt about this book. Having read \"Dear White America\", I was anxious to read this entry. I do understand what the author was trying to do, but throughout my reading I kept asking myself\" Does he really think this is going to make anyone admit their racism\"\"? The book is written with \"love' as the author states many times, but honestly, I did not feel the love. All i felt was a sort of bitterness toward White America. I must say that the author has a way with words and some will agree, some may not. But, this book can be a good conversation starter. Thanks to NetGalley, the author and the publisher for the ARC of this book in return for my honest review."}, {"userName": "Roger", "userReviewDate": "May 05, 2018", "userURL": "http://www.goodreads.com/user/show/1852104-roger", "userReview": "I earnestly support Yancy's arguments set out here and aim to be a racist committed to antiracist work, but think this would have been better served as a Times follow-up rather than a slim book. The chapters did not develop or sharpen beyond the chief points made in the 2015 article Dear White America."}, {"userName": "Paul Muench", "userReviewDate": "Jun 04, 2018", "userURL": "http://www.goodreads.com/user/show/18442702-paul-muench", "userReview": "Taking things for granted is the greatest human weakness and strength. The challenge is how to know the difference."}, {"userName": "Sharon Bodnar", "userReviewDate": "Jun 08, 2018", "userURL": "http://www.goodreads.com/user/show/13031288-sharon-bodnar", "userReview": "This book expanded on “Dear White People”, a Christmas column Yancy wrote for the New York Times."}], "description": "When George Yancy penned a New York Times op-ed entitled \"Dear White America\" asking white Americans to confront the ways that they benefit from racism, he knew his article would be controversial. But he was unprepared for the flood of vitriol in response. The resulting blowback played out in the national media, with critics attacking Yancy in every form possible--including death threats--and supporters rallying to his side. Despite the rhetoric of a \"post-race\" America, Yancy quickly discovered that racism is still alive, crude, and vicious in its expression. In Backlash, Yancy expands upon the original article and chronicles the ensuing controversy as he seeks to understand what it was about the op-ed that created so much rage among so many white readers. He challenges white Americans to rise above the vitriol and to develop a new empathy for the African American experience.", "title": "Backlash: What Happens When We Talk Honestly about Racism in America", "url": "http://www.goodreads.com/book/show/36751217-backlash", "average": 3.86, "cover": "https://images.gr-assets.com/books/1514005238l/36751217.jpg", "reviews": 8, "authors": [{"url": "https://www.goodreads.com/author/show/10716.George_Yancy", "name": "George Yancy"}], "type": ["Nonfiction", "Race", "History"], "outlinks": ["http://www.goodreads.com/book/show/36751217-backlash", "http://www.goodreads.com/book/show/5225988-black-bodies-white-gazes", "http://www.goodreads.com/book/show/13212258-look-a-white", "http://www.goodreads.com/book/show/214493.What_White_Looks_Like", "http://www.goodreads.com/book/show/2060566.African_American_Philosophers", "http://www.goodreads.com/book/show/221862.The_Cornel_West_Reader"]}