{"ratings": 245, "userreviews": [{"userName": "Susan", "userReviewDate": "Aug 29, 2014", "userURL": "http://www.goodreads.com/user/show/7728786-susan", "userReview": "I was lucky enough to be a Beta Reader for the second book. Savannah makes you feel as if you are there with the family as she details her life journey that started at age 13. As they make the harrowing journey to the Russian border and finally after months of horrid conditions on trains they finally have clean beds when they change trains in Russia. They go to a beautiful lake and run into a Russian couple walking toward them and the girl is beautiful and naked(?)--Savannah's brother is having a heart attack!! The first stop they are able to take warm showers and wash their hair. On this portion of the trip they stay in a Yuk, ride horses across the plains and her brother falls in love!! During this adventure they also spend a long time traveling to destinations that appear very boring (Communism era towns)but give them the feel of what it was like to live under Communism. They met many travelers from other countries and spend time with them going to places they shouldn't--guess what happens when they get caught!! If you have ever thought about going to Tibet or watch the sunrise over Mt Everest in Nepal you really need to read this book. You will find yourself wondering how they ever managed to see so much and do so much and get out alive. By the way--Savannah may have grown her boobs in China but she had her first real crush in this book. The book draws you into every day lives of the people in the countries they travel thru and makes you want to head out on a trip following in their footsteps. Enjoy the second book, I know I did, and I can't wait for the next installment--what happens--how does Savannah complete her education when she was taken out of school at 13. What is her mother, her sister, her brother doing now? We are impatiently waiting, Savannah!!(less)"}, {"userName": "Jessica Lipowski", "userReviewDate": "Sep 08, 2014", "userURL": "http://www.goodreads.com/user/show/31618876-jessica-lipowski", "userReview": "Once again, and to no surprise, I thoroughly enjoyed Savannah’s second memoir. “Backpacks and Bra Straps,” the second book in the Sihpromatum series, shares honest, raw emotion, everything from inner angst to family conflict and breathless moments (literally) to laughing hysterically. Through her beautiful and descriptive words, the author takes you along for the ride. I could easily imagine the sights, sounds and smells along the way. She weaves in travel and historical facts, too.I remember when I finished “I Grew My Boobs in China,” I couldn’t wait for the next book. I desperately wanted to experience more. Now, after finishing “Backpacks and Bra Straps,” I have exactly the same feeling. I want to find out where the family ends up next. Plus, it left me wanting to hit the road. I love watching Savannah grow up and mature as she travels the world. I’m certainly ready for “Rusty Tracks and Booby Traps,” the third book in the series (still to be released).Sihpromatum is one series you will definitely not want to miss. Join the Canadian family’s journey backpacking around the world and experience their adventures through Savannah’s eyes."}, {"userName": "Ionia", "userReviewDate": "Sep 13, 2014", "userURL": "http://www.goodreads.com/user/show/16434239-ionia", "userReview": "In this second volume of Savannah Grace's fantastic recount of her and her family's travels around the world, we get a much more personal and up-close view of the family dynamics and spirit amongst her group. Whereas the first book primarily focused on young Savannah's emotions and experiences, this one gives us a broader range, and written from a more experienced and mature point of view the story flows even better yet is still ripe with Savannah's ever present charm and personality. The humour in this book is honest and revealing and laugh out loud funny at times. I enjoyed listening to her tell, in her own words, about the many experiences she and her family had--including some trying times that made them all weary and exhausted. One thing is for sure, Savannah was made for adventure and her indomitable spirit will keep her on the move and hopefully be bringing us more books in the future. If you have not met Savannah Grace yet, you should do so, and if you have not read her books yet, what are you waiting for? They may just prompt you to live on the edge and seek out your own adventures. This review is based on a complimentary copy from the author in exchange for an honest and unbiased review. All opinions are my own."}, {"userName": "Rlbailey1453", "userReviewDate": "Sep 01, 2014", "userURL": "http://www.goodreads.com/user/show/16638377-rlbailey1453", "userReview": "Wonderful book by Savannah , looking forward to more adventures."}, {"userName": "Grady", "userReviewDate": "Sep 13, 2014", "userURL": "http://www.goodreads.com/user/show/1362506-grady", "userReview": "Sihpromatum: 'A blessing that initially appears to be a curse.'Initially from Vancouver, Canada but now living (or settled for the moment) in The Netherlands, Savannah Grace now stands firmly in the literary arena with a book with a title that for many may seem as though it will be a rather silly piece of `chick lit.' Nothing could be further from the truth. Grace is only 23 years old and has the class and the style of a seasoned performer in the manner in which she treats a maximally dysfunctional family story into one of the most tender and warm and wise (and hilarious), for the lack a better term, memoirs that absorbs all the angst of family dissolution post divorce, unfathomable adventure on an aimless backpacking trip through Asia and Mongolia that our author turns into a positive experience.The language of the book reveals an informative and fascinating report about her family's wandering habits and in this second volume she continues her march toward adulthood through Russia, Kazakhstan, Kyrgyzstan, through Western China and Tibet, and finally, to watch the sun rise over Mount Everest in Nepal. Savannah's initial reluctance to travel and the personal growth she documents distinguishes this raw tale from most travel memoirs. She knows well how to keep the humor rolling without negating the psychological and physiological changes that she undergoes. The mixture f cultural observations and influences with family dysfunction and coping are served up as well (if not better!) than volume 1 with that memorable title I GREW MY BOOBS IN CHINA.What happens during this extended journey into rarely trod adventures in the designated countries offers more insight into what becoming an individual and an adult means on the most basic level. Her version of the odyssey is an honest, rich accounting of encountering unique and endearing personalities, places, realizations, and an exploration of the world and life we all will envy. It is refreshing to discover a new writer who at this young age has gained an emotional maturity and a polished writing style and gratefully proves that the public has won - now that there is volume 2 BACKPACKS AND BRA STRAPS with hopefully promises of more to come. This is a terrific book to enjoy on your own and then share with young people around you to give that ray of light to illuminate the possibilities of turning a potential curse into a blessing."}, {"userName": "Rosie Amber", "userReviewDate": "Oct 04, 2014", "userURL": "http://www.goodreads.com/user/show/12118203-rosie-amber", "userReview": "Backpacks and Bra Straps is the second book following Savannah and her family as they spend a year Backpacking. They are a family group; Mum, older brother Ammon (a seasoned traveller), 18 year old Bree and 15 year old Savannah. They started their journey in China and the first book \"I Grew My Boobs In China\" tells of the way they adapted to the people and the cultures of the countries they began to travel through. Not on any big tourist trails, they have a small daily budget and travel on buses and trains as the locals do.This second book has them crossing in to Russia with a 7 hour delay whilst the train and all its occupants are searched, making their journey from Mongolia a whacking 37hours. You get up close and personal accounts of their travels going to amazing places like Lake Baikal, the deepest, oldest and cleanest lake in the world. Along the way they meet people who so often go out of their way to help them find accommodation, buy tickets and deal with language barriers. It returns your faith in mankind.Their journey doesn't go without challenges and fears, sometimes the journeys were really dangerous as mad drivers raced on roads up and down mountain sides and crossing border controls was often painstakingly slow with the need to work their way around officialdom on a number of occasions.What is great about these books, is meeting the real people and seeing places that few others experience because of the way the have chosen to travel. Living in close proximity does have it's own challenges which they learn to overcome, and the life lessons that Savannah has more than makes up for being taken out of her Canadian school and leaving her friends thousand of mile away.This part of their journey ends with Bree's friend Steph joining them for a two week hike to base camp mount Everest, a most memorable journey and I felt I travelled with them every step of the way, it meant different things to each of them when they conquered the climb and as they left the area in a helicopter for their next adventure Savannah reflects on her new word \"Sihpromatum\" a curse that turns into a blessing which sums up how she feels about much of this experience.I really do recommend these books to anyone with even a slight interest in travel and the rest of the world."}, {"userName": "Linda", "userReviewDate": "Mar 09, 2017", "userURL": "http://www.goodreads.com/user/show/23873887-linda", "userReview": "I suspected that I would enjoy this sequel more than the first and this proved correct. More reflective better written and more informative. Now, if I can just get my hands on #3."}, {"userName": "Jessica Strider", "userReviewDate": "Sep 09, 2014", "userURL": "http://www.goodreads.com/user/show/6006441-jessica-strider", "userReview": "This is the second volume in Savannah Grace’s rendition of what started as her family’s year long trip around the world. The book jumps right into the action as the family reaches Russia by train. There’s a bit of flashback information to get you up to speed, and readers who skipped the first book (dealing with China and Mongolia) will find chapter 5’s discussion of where they’ve been interesting. After Russia they stop briefly in Khazahkstan and Kyrgyzstan, then cross back into China and trough it to Tibet and Nepal. The book ends with their trek to the top of Kala Patthar, 263 meters above the Mount Everest base campThe book is full of fascinating cultural observations and travel details (mostly via her brother Ammon’s guidebook lectures). It’s interesting to read how different things are handled in different parts of the world. The long wait times and even longer bus rides show the challenges of this type of travel even as Savannah points out the benefits of seeing things as a native and meeting new people.As the trip wears on tempers wear thin and the last third of the book involves a lot of family drama. It’s interesting, though probably more detailed than I needed.The descriptions remain vivid and really make you want to book your own trip to these places (well, some of these places). The book is quick paced and the writing smooth.I beta read the manuscript and so didn’t see the photos that accompany the text.If you like travelogues and/or biographies, this one is worth the read."}, {"userName": "Amber Leigh", "userReviewDate": "Sep 08, 2014", "userURL": "http://www.goodreads.com/user/show/10013995-amber-leigh", "userReview": "I was so happy when this book was released, I had been waiting quite awhile since the first one. This book was amazing and I couldn't put it down. This book is quite different from the first as you can see how everyone in the group has grown so much in the months they have been traveling. It was one of the most honest travel memoirs I have ever read and I loved it. I read the first book when I was living abroad and it was great to understand those first moments of travel and now I have read the second book after a few more trips and Savannah really puts moments of travel into words just beautifully! The author creates amazing descriptions of situations and places that would be almost impossible to explain and takes the reader on the adventure with the family. There are some moments in the book where I actually laughed and others where I couldn't stop reading until late in the night. During the climb of Mount Everest, I couldn't stop reading, it showed all the internal and external struggles of climbing the famous mountain.It's a beautifully written book that is able to capture all the beautiful, funny and horrible moments of travel. It is also very well written on her experience and how she was growing as a person. I learned a lot about countries I have only dreamed about seeing and it was great to see how much there is to see in those countries that many people don't visit, I think it was wonderful to see some light shed on these countries and open peoples minds to the area. It has made me want to see so much more in Asia."}, {"userName": "Rebecca", "userReviewDate": "Feb 12, 2015", "userURL": "http://www.goodreads.com/user/show/9887357-rebecca", "userReview": "This is the 2nd book by this author about her travels with her family. You def should read them in order although there are lots of references to the first book in this one as well.What really put me off in a big way from this book was the chapter about \"Privacy\". Some of those details were a bit too intimate for me, and since the narrator is 15 years old at the time the events take place I really feel they should not have been included in the book. After reading what I did not wish to read I immediately skipped to the end of the chapter and then seriously considered whether or not I would even finish the book. In the end I did finish the book but found myself skimming more and more. I guess someone told the author that \"intimate details\" sell books or something. I don't know. I guess I am being an old prude but again considering the age of Savannah and her sister Bree I think there were several things that should have been edited out.Beyond that... I liked that there was a map and links to the photos and I was very interested in the adventures and the traveling itself.I'm on the fence as to whether or not I will read book #3 when it comes out though and I won't be recommending this book to anyone."}, {"userName": "amanda", "userReviewDate": "Oct 30, 2014", "userURL": "http://www.goodreads.com/user/show/31416927-amanda", "userReview": "Great Memoirs from a Different PerspectiveI read the first book in the series \"I Grew My Boobs in China\" and immediately bought \"Backpacks and Bra Straps\".I've read so many travel memoirs, but what's really unique about about these books is that they're from the perspective of a teenage girl. I did a little bit of traveling myself around the ages of the author in the books, and it's a totally different experience at that age than now as an adult. It's interesting to read about her thoughts and experiences about some of the same places that are written about in other memoirs, but from the mindset of a teenage girl who wasn't given the choice about the trip vs. an adult who (probably) takes the time to save money and plan out the trip of their lifetime. The author really seems to have grown up a lot since the first book. She went from feeling like she was being unfairly dragged around the world to actually appreciating and enjoying the experience. I can't wait for the next book!"}, {"userName": "M.M. Strawberry Reviews", "userReviewDate": "Nov 21, 2014", "userURL": "http://www.goodreads.com/user/show/12558730-m-m-strawberry-reviews", "userReview": "YES! After reading the first volume, I was thrilled to star this book, and it did not disappoint at all. Savannah Grace does a really nice job of writing about her feelings during the treks, and describing nicely the things she sees during her travels, and her reactions to them. It was also interesting to see the family having fights, and I will be honest, I think that she was justified in her feelings about her pets, and that her mother was unfair to treat her the way she did after Savannah unloaded her feelings about having to give up her pets.I enjoyed the whole book, but I would have to say my favorite was when they are in Nepal, and making their way to Mount Everest. The way that Savannah describes the trip to see the sun rise over Mount Everest was just stunning, and I wish I could have been there with her. I have truly enjoyed this series so far, and I can say in all honesty that I am more than eager to get on to Book 3, and can't wait for it to come out, because I am definitely eager to read more of her adventures, especially in India."}, {"userName": "Ilana", "userReviewDate": "Sep 10, 2014", "userURL": "http://www.goodreads.com/user/show/4335525-ilana", "userReview": "After reading the first book, I was very curious about the follow-up. I was not disappointed, as the journey of the travelling family continues with even more suspense and catching travel stories. The writing is even better, with dialogues and many geographical and historical details that might convince you in a couple of pages that it's about time to have your indefinite leave of absence while discovering the world. This volume covers mostly the travel through Russia and some former Russian Republics, a world mostly unknown and out of reach to most European and American audiences. While writing about this spaces, Savannah not only put those countries on the map but also demonstrates that it is possible to successfully travel off the beaten path. Already looking forward to the next book from the series."}, {"userName": "Sheila Higgins ghen", "userReviewDate": "Sep 02, 2014", "userURL": "http://www.goodreads.com/user/show/14869181-sheila-higgins-ghen", "userReview": "Book number 2 was such a great continuation of \"Sihpromatum-I Grew My Boobs in China\". You feel like you really know the family well and experience all the ups and downs along with them. Savannah is such an engaging and descriptive writer that she makes you feel like you are accompanying them on their journey with all the sights, sounds and smells of foreign countries. She is so honest with her first hand accounts of all the triumphs and setbacks of long term travel. It has all the exciting and educational elements of a good travel book along with the character development and interpersonal relationships of juicy novel. I didn't want it to end!! Can't wait for Savannah to include us all in adventure #3!"}, {"userName": "Claire Gibson", "userReviewDate": "Aug 29, 2014", "userURL": "http://www.goodreads.com/user/show/14653083-claire-gibson", "userReview": "I loved reading this as one of the chosen Beta Readers. Savannah is very good at keeping her readers informed, included and up to date. Cudos to you Savannah. I have enjoyed feeling like a part of your world, both inside the book and outside.This continued very closely on the same vein as \"I grew my boobs in China.\" If you enjoyed the first book as much as I did, you will enjoy the second, perhaps even more as you follow the family on more of their worldly adventures. It is worth every moment of reading. My biggest complaint is that I needed to keep reading, which made it end all that much faster. I will probably re read it soon, and then may add more to my review.Savannah, when you are back in BC, I think I will need to purchase \"signed\" editions of both."}, {"userName": "Kay Mcaloney", "userReviewDate": "Oct 01, 2014", "userURL": "http://www.goodreads.com/user/show/12424425-kay-mcaloney", "userReview": "4.5 if that was possible! I really enjoyed the second book of the series and look forward to the 3rd book to see what the travelers have to teach us and share with us. To have such vivid descriptions in the book, Savannah must have some detailed journal! I thoroughly enjoy the descriptions of the transportation modes the family takes. I liked the first book a little bit better, but it might have been because of the places they travelled and the people they encountered. What an opportunity to travel as they have and to see the things they have seen and experienced. Going over some of the ped bridges, taxis, busses, and helicopters were fun to read about. Such close quarters!"}, {"userName": "Joann", "userReviewDate": "Aug 29, 2014", "userURL": "http://www.goodreads.com/user/show/4505115-joann", "userReview": "Savannah's second book is as exciting and thrilling as her first. I love travel books and her style of writing is awesome. You feel like you are a part of her family as they traverse the world. What a wonderful family they must be and she doesn't shy away from writing about the arguments and emotions that rise up. I remember that when I finished her first book \"I Grew My Boobs in China,\" that I couldn't wait till this one was published and already I am having the same thoughts on her next travel book. Her writing is incredible and her pictures are awesome. Keep traveling and writing, Savannah!"}, {"userName": "Emily", "userReviewDate": "Sep 12, 2014", "userURL": "http://www.goodreads.com/user/show/4933620-emily", "userReview": "As with I Grew My Boobs in China, Backpacks and Bra Straps is an amazing read. Savannah has a knack for bringing the reader right into the action and making us feel like we were there. The arrival of Stephanie was not only great for Bree's sweet tooth, but also served to show just how much Savannah's perspectives had changed in the first five months of their adventure!I can't wait for Rusty Tracks and Booby Traps!"}, {"userName": "Alice", "userReviewDate": "Aug 29, 2014", "userURL": "http://www.goodreads.com/user/show/2585747-alice", "userReview": "This is a fun memoir continuing the story of one family's incredible journey around the world. Besides the travel adventures, this book is also about family dynamics - and how being constantly together can create tension, even in a tight knit group. All of the family members begin to crack at the complete lack of privacy; but in the end they all come together over shared hardship."}, {"userName": "Michelle", "userReviewDate": "Jan 22, 2016", "userURL": "http://www.goodreads.com/user/show/2202559-michelle", "userReview": "I loved I Grew My Boobs, and I adored this second installment of Savannah's account of trekking the globe with her family just as much. I actually had tears in my eyes while reading about their watching the sun peek out from behind Everest. I can not wait to read the next book!"}, {"userName": "Maureen", "userReviewDate": "Dec 23, 2015", "userURL": "http://www.goodreads.com/user/show/1827256-maureen", "userReview": "What an amazing story! I loved every minute of it. I have always enjoyed reading true stories of people traveling and this is by far the best one yet! Savannah takes you along and writes in such a way you feel as though you are right there experiencing it too."}, {"userName": "Naomi", "userReviewDate": "Sep 26, 2014", "userURL": "http://www.goodreads.com/user/show/5764230-naomi", "userReview": "It was OK. The first book kept me more interested."}, {"userName": "Debrah0683", "userReviewDate": "Aug 08, 2015", "userURL": "http://www.goodreads.com/user/show/32933311-debrah0683", "userReview": "Loved the book and reading about the family's adventures. Can't believe they did all what they did. Looking forward to the next one"}, {"userName": "Rebecca Hislop", "userReviewDate": "Aug 03, 2017", "userURL": "http://www.goodreads.com/user/show/31555479-rebecca-hislop", "userReview": "It’s hard to believe that this book was written by a 15 year old girl as she has such wonderful powers of description. She is travelling with her mother, brother and sister through Asia, Tibet and Nepal where they make a trek to see the sunrise over Everest. The whole thing is astounding. It’s a very honest account of the family dynamics and about the squabbles and arguments that happen in most families but which seem more intense among them as they are literally living together and frequently sharing a room all day and every day. She voices her frustrations at her situation but also describes her appreciation of all that she is experiencing and seeing. Her brother Ammon is a mine of information and I loved his ‘travel guide’ talks along the way. I also liked the accompanying photos and the video clip with specially selected songs. Now I need to read book one – somehow I missed it! I also am looking forward to reading the next part of this intrepid family’s adventures"}, {"userName": "Richard Croner", "userReviewDate": "May 10, 2018", "userURL": "http://www.goodreads.com/user/show/53036719-richard-croner", "userReview": "Having just read a book regarding K2 I found the final segment on Savannah and her family's experiences on climbing to the base camp on Everest particularly interesting. I have traveled extensively but not to area's covered in this book and found her well written descriptions enticing and elicited a personal desire to see the described areas myself. The family and their interactions added an additional dimension to the book: at times funny but always true to life. It is a good book and I really enjoyed it."}, {"userName": "Robert Johnson", "userReviewDate": "Jul 11, 2017", "userURL": "http://www.goodreads.com/user/show/38378004-robert-johnson", "userReview": "The best author of memoirs yet. Can't believe she is only - uh, as old as she is or was when scribbling. In addition to a good read, it was enjoyable to hear that normal families were handling normal family problems, in normal ways, all the while having educational fun at it. Though usually I don't have the capacity to appreciate poetry, her poems (if they were poems) seemed goodly adequate. I think. Again, the best author yet."}, {"userName": "Buckens", "userReviewDate": "Jul 23, 2017", "userURL": "http://www.goodreads.com/user/show/46000171-buckens", "userReview": "Loved it and cant wait for part 3 to come out"}, {"userName": "Sheila", "userReviewDate": "Mar 07, 2015", "userURL": "http://www.goodreads.com/user/show/2039269-sheila", "userReview": "Once up on a time, the teenaged Savannah Grace found herself traveling the world with her mother and siblings, carrying their worldly goods in backpacks, and occasionally annoying big brother by leaving bras (and bra straps) lying around. Sihpromatum is a true story, and truly absorbing. Backpacks and Bra Straps is its second part, but don’t worry – you can pick it up and read straight away without needing to read part one. There again, why not read part one as well, and be equally enthralled and entertained?The story starts with a bang, or rather, with the barrel of a gun pointed by a handsome but scary Russian soldier. Savannah's brother knows almost everything, including when not to be scared, and even which part of a plane is safest in an accident. Her mother combines a pleasing real-world wisdom with a zany sense of adventure: \"Don’t let past experience affect your view of new people.\" And her sister is... well, a sister. Meanwhile the scenery's surely a character too, beautifully but very unobtrusively described with warmth and teenage affection.If you can’t travel the world, this book (or series) might well be the next best thing. For those who like their trips well-ordered, it offers a way to experience life on the edge. And for those with dreams of seeing Pakistan, Afghanistan, Kazakhstan and more, it offers vicarious experience without the accompanying danger.The author’s voice is enjoyably youthful and honest. Family dialog, through good times and bad, is pleasingly real. Growing up is hard. And growing to know the real world out there (as well as the world within) is a wonderful experience, generously share by in inspiring and truly inspired author.Disclosure: I’d read book one and I couldn’t resist book two. Roll on book three please!"}, {"userName": "Pat Ellis", "userReviewDate": "Apr 04, 2015", "userURL": "http://www.goodreads.com/user/show/35502392-pat-ellis", "userReview": "I wondered if this sequel to Sihpromatum: I grew my Boobs in China would once again be able to transport me to the far-away places visited by the Author her Mum, Brother & Sister and retain my interest - it certainly did & I was not disappointed. Savannah Grace at 14 is 'thrust' into a 'trip' that's she's not looking forward to at all... Sihpromatum: Backpacks and Bra Straps is the 2nd instalment of the journey 3-4 months in that the Author's Mum has taken 3 of her children on. This Memoir takes you further on their journey through Russia including Kyrgyzstan - Western China and Tibet. It's written openly and honestly and of course you can feel some of the frustrations within the family - my goodness they are having to live 'very closely' . This memoir had me laughing, wondering what on earth they were doing and mostly feeling quite inspired at what a Mum and her kids can achieve & also at how The Author and her siblings dealt with such a trip. I really don't want to give too much away in my review and I am certainly looking forward to the next instalment that's for sure. I do recommend this Memoir and feel it would be a great read for teenagers and young adults alike - as well as a middle-aged reader like me."}, {"userName": "Alison", "userReviewDate": "Aug 29, 2014", "userURL": "http://www.goodreads.com/user/show/7606431-alison", "userReview": "In this second book of this families four years of travel, they takes us to Russia, Kazakhstan, Kyrgyzstan, through Western China and Tibet, where they finally, get to watch the sun rise over Mount Everest in Nepal.Her first book was, called Sihpromatum __ I grew my Boobs in China, and was a fun beginning to this epic adventure, giving us a glance into how it came about and taking us through China and Mongolia. Savannah is a very talented young writer, who can draw us in and make us feel as if we were there with them, through their family discussions, fights, thoughts and observations. She can switch so easily from this family banter to the wonderful poetic and beautifully described scenes of the areas they are traveling through. She gives us a visual, that makes you want to pack up and go. We also get a lot of wonderful information, from her brother Ammon, who is the only male on this trip and a lover of history and we really get a feel for what we are reading about.Her sister Bree, three years older, is a free spirit and co-conspirator, and confidant. Her Mother the one that keeps them all in check, or so she thinks.I was sad to see this second book end and now cannot wait for the third one to come out."}], "description": "Savannah Grace’s best selling, award winning saga of her family’s four-year-long backpacking adventure continues. \"Backpacks and Bra Straps\" picks up where \"I Grew My Boobs in China\" leaves off, offering insights into how family dynamics are affected by such intensive togetherness as well as a candid, intriguing look at world-wide travel and the camaraderie of the backpacking community, told from a perceptive young woman’s viewpoint. This second instalment of her Sihpromatum series takes us to Russia, Kazakhstan, Kyrgyzstan, through Western China and Tibet, and finally, to watch the sun rise over Mount Everest in Nepal. Savannah’s initial reluctance to travel and the personal growth she documents distinguishes this raw tale from most travel memoirs. See website for photos and more info… www.sihpromatum.com", "title": "Backpacks and Bra Straps\n      \n          (Sihpromatum  #2)", "url": "https://www.goodreads.com/book/show/23119958-backpacks-and-bra-straps", "average": 4.14, "cover": "https://images.gr-assets.com/books/1409226913l/23119958.jpg", "reviews": 48, "authors": [{"url": "https://www.goodreads.com/author/show/6520230.Savannah_Grace", "name": "Savannah Grace"}], "type": ["Travel", "Autobiography", "Nonfiction"], "outlinks": ["http://www.goodreads.com/book/show/23119958-backpacks-and-bra-straps", "http://www.goodreads.com/book/show/23161061-backpacks-and-bra-straps", "http://www.goodreads.com/book/show/19937223-i-grew-my-boobs-in-china", "http://www.goodreads.com/book/show/23126350-rusty-tracks-and-booby-traps", "http://www.goodreads.com/book/show/35114741-sihpromatum", "http://www.goodreads.com/book/show/20793248-five-bestselling-travel-memoirs-box-set", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/40205082-everything-is-horrible-and-wonderful", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}