{"ratings": 2688, "userreviews": [{"userName": "Jameisha", "userReviewDate": "Nov 12, 2012", "userURL": "http://www.goodreads.com/user/show/12535670-jameisha", "userReview": "I thought this was a very informative book about the life of Bass Reeves, a United States Deputy Marshall for 3 reasons. 1) I had never heard of this man, and when I finished reading the book I felt like I learned everything I needed to know. The book isn’t over powering with information, but it recounts important moments in his life, and how he affected the world around him in a way that allows you to understand who he was, what he did and why he's important. 2) I loved the way it was written. It's like someone is telling a story about someone they knew, like they had witnessed the events. It also words things in a way that takes you to the time period when Bass was living. I also liked the way events or situations were described. Killing and murder are talked about but it’s never glorified. Everything is said straight to the point but there is also a humorous feel to some of the events being told. 3) The illustrations. I liked how they took up the entire pages in the book and the painted medium used. They were very colorful and went well with the part of the story they were representing. I thought this was a very good bio and I learned something new by reading it. I'm sure children would be interested in learning more about Bass Reeves, as well as some of the other figures mentioned in the story."}, {"userName": "Eva Mitnick", "userReviewDate": "Nov 11, 2009", "userURL": "http://www.goodreads.com/user/show/633929-eva-mitnick", "userReview": "As the size of the book and his portrait suggest, Bass Reeves was larger than life. Born into slavery in 1838, he escaped from his owner during the Civil War and headed off for Indian Territory, where he lived with and was sheltered by Indians. After the war, he bought a farm, married, and \"true to the song of his life, Bass had a big family\" - 11 children. In 1875, Bass was hired by Judge Parker to track down outlaws as a deputy U.S. marshal - and because he was smart, honorable, a crack shot, and knew his territory like the back of his hand, he became one of the most valuable of the 200 marshals patrolling 74,000 square miles of what would later be Oklahoma.The tales of his adventures and exploits read like tall tales, but apparently they are all true. To catch his quota of outlaws, he wore disguises, planned elaborate hoaxes, and in general used any trick possible to bring back in the bad guys - or bad ladies, as the case might be. Belle Starr, the bandit queen, turned herself in to Bass Reeves when she found out he had her warrant. After 32 years and more than 3000 arrests, Oklahoma became a state and Bass Reeves lost his job - so at the age of nearly 70, he become a police officer in Muskogee, OK and worked until he died several years later.Both the text and the illustrations are captivating, creating a vivid portrait of a man who seems to rank right up there with Paul Bunyan and John Henry. The book opens with the capture of outlaw Jim Webb - \"Jim Webb's luck was running muddy when Bass Reeves rode into town\" - blasting us right into the action as Bass Reeves chases Webb down. This simple, colloquial language, glinting with just enough Western slang and lilt to make reading it aloud a joy, continues throughout the book. An example:\"Even horses played a part in his disguises. Like many U.S. marshals, Bass rode some of the finest. Most times, he forked a handsome sorrel. Bass rode proud in the saddle. There was no mistaking his silhouette. But prize horseflesh could be a dead giveaway that the rider was a lawman. Bass always kept some rough stock and rode lazy while undercover.\"Don't know what \"forked\" means? Check out the glossary of Western words at the back, and while you're there, be sure to read the timeline (which includes Bass Reeves' induction into the Hall of Great Westerners of the National Cowboy & Western Heritage Museum in Oklahoma City in 1992), the list of further reading and websites, a bit of fascinating information about Judge Parker and the Indian Territory, and best of all, a fine bibliography of books, articles, and manuscripts about Bass Reeves.I've been a big Christie fan for years - his art is always powerful, whether depicting young Bass feeding a horse at dusk or an anguished but stern Bass turning in his own son after he had committed murder. Full-page spreads offer dramatic scenes, often outdoors, while smaller paintings show us smaller moments like that of Bass trying to talk sense into captured outlaws (\"Getting through to them was like trying to find hair on a frog, butg Bass kept trying\"). The text is often set on yellow-gold paper that looks creased and stained with brown, bringing to mind the travel-worn warrants that Bass must have kept in his saddlebags or folded into an inside pocket of his jacket. The endpapers depict Bass's United States Deputy Marshal star against this background.This is altogether a marvelously entertaining and thought-provoking portrait of a little-known Western hero. The bold and action-packed illustrations will pull kids in and the rollicking text will grab hold and keep them hooked until the end. Don't let this sit on your shelves - display it and talk it up to kids, parents, and teachers.Highly recommended for ages 8 and up."}, {"userName": "Becky", "userReviewDate": "Sep 08, 2012", "userURL": "http://www.goodreads.com/user/show/12274873-becky", "userReview": "Biography – Juvenile FictionSummary: Maintaining an infallible integrity and sense of character, Bass Reeves, U.S. Marshal in the Indian Territories from 1875 to 1907, (eventually to become Oklahoma) arrests over 3000 men and women in creative ways to establish peace in extremely unlawful areas. He kills only fourteen men in all that time and is never wounded. Vaunda Micheaux Nelson renews the interest in this forgotten African American hero of the American West with the true stories of a man born a slave becoming a larger than life legend in his time. Critique: (a.)One of the most intriguing aspects of this book is the presentation of Bass Reeves’ life as a man of color during the early 1800’s and the extensive research and portrayal of not just events in his life, but how his strong character was maintained personally and respected by everyone from the criminal to all colors of men. (b.) Nelson does an extraordinary job of sharing the creativity and character of Reeves as he successfully pursues wanted men and women. “Bass took many a bad man by surprise through the use of disguises. One day he’d pose as a cowboy. Another he’d be a tramp, a gunslinger, or an outlaw.” (p.21) The author’s research reveals the notorious outlaw, Jim Webb, giving his revolver to Bass Reeves while dying in a salute of honor to the man who had finally ended his crime career. The notorious “Bandit Queen,” Belle Starr, surrenders to him for the first time in her crime career when she receives word that he is looking for her. (c.) She describes his character using “cowboy” words to absorb us into the time period: “But the biggest thing about Bass Reeves was his character. He had a dedication to duty few men could match. He didn’t have a speck of fear in him. And he was as honest as the day is long. ” (p.11) and “But Bass was as right as rain from the boot heels up. He couldn’t be bribed. And he shot only as a last resort…“ (p.20) The combination of her revealing research and use of cowboy language engages the reader to be captured into a brave man’s tale.Curriculum Connection: This is an excellent book for teaching elementary through high school African American history as well as the Wild West and the settling of the Indian territories. It teaches about a great African American man of character who couldn’t read and who came from a background of slavery yet was incredibly smart, creative, brave, and respected. It also describes how some men hated him merely based on the color of his skin. In a culture where the Wild West is mostly depicted as white cowboys fighting brown Indians, this story is an incredible display of a black man of faith keeping the law in dangerous times and territories."}, {"userName": "Catherine", "userReviewDate": "Jun 14, 2015", "userURL": "http://www.goodreads.com/user/show/41506537-catherine", "userReview": "The book, “Bad News for Outlaws”, describes the life of Deputy Marshall Bass Reeves. Reeves dedicated his life to serving the public by deceiving thieves and arresting outlaws. During his youth, Reeves was a slave in Texas where he sang of pistols, rifles, thieves, and killers. At one point, his mom thought he was going to become a criminal! One night, Reeves, who was a surly tall man, hit his owner and fled towards Indian Territory. For a short time, he lived within tribes and started to make life for himself as Deputy Marshall. In order to catch outlaws, Reeves wore a variety of disguises and went to extreme lengths to track down outlaws in the area. He became admired among his community, as well as in the outlaw circuit. With a warrant out for her arrest, Bandit Queen Belle, a notorious outlaw, even turned herself in out of respect for Reeves. The illustrations in the book utilizes solely primary colors, which I believe show the simplicity of the time. The illustrations are made with big brush strokes across the page. One image displayed the barrel of Reeve’s gun right before he killed an outlaw, which may evoke fear and unrest in an intended reader. I would utilize this book in a classroom grades 3 and up as an example of a high quality text for a biography unit. By modeling a high quality text in the classroom, I hope to encourage positive book choices to my students. “Bad News for Outlaws” was awarded the Correta Scott King Award and is highly acclaimed."}, {"userName": "June", "userReviewDate": "May 05, 2011", "userURL": "http://www.goodreads.com/user/show/430751-june", "userReview": "Got this at work and picked it up because of the Coretta Scott King Award. Remarkable story of a runaway slave who was hired by Judge Parker as a U. S. Deputy Marshal. His use of disguises and unflappability are a great read. I love the story of the skunk. Belle Starr turned herself in when she heard Bass had her warrant. His reputation was so big he was able to cut a man down that a mob was lynching and ride off with him. He also had to arrest his own son, since no one else wanted to. After Oklahoma became a state he hired on with the Muskogee police force. Even though he was nearly 70 and walked with a cane not a single crime occurred in his patrol area during his 2 years on the force. The author's note concludes: \"Bass's story is so incredible it comes close to sounding like a tall tale. But it isn't. It's true. And I've done my best to tell it true.\"Definitely going to highlight and use it during Black History Month! 5/5/11Read to a 3rd grade class and even though it is maybe a little long it kept their interest.2/11/13Used again for a 3rd grade class studying people. Maybe not as popular as Lebron James: I Love Challenges!, but they were good listeners."}, {"userName": "Pamela", "userReviewDate": "Jun 07, 2014", "userURL": "http://www.goodreads.com/user/show/20048096-pamela", "userReview": "This juvenile non-fiction book commemorating the life of Deputy U.S. Marshall, Bass Reeves was as delightfully illustrated as it was informative. Bud Ledbetter, a fellow lawman called Bass \"one of the bravest men this country has ever known.\" In his 32 years of service, Bass Reeves \"arrested more than three-thousand men and women . . . He [himself] was never wounded . . . Remarkably, he killed only fourteen men in the line of duty.\"Bass Reeves, an unsung hero. Vaunda Micheaux Nelson did a wonderful job researching and presenting his story; aided by the beautifully conveying artwork of R. Gregory Christie."}, {"userName": "Krista the Krazy Kataloguer", "userReviewDate": "Jan 18, 2010", "userURL": "http://www.goodreads.com/user/show/316102-krista-the-krazy-kataloguer", "userReview": "Outstanding book about a black man who, for some 30 years, was a deputy U.S. Marshall in the Indian Territory, which later became the state of Oklahoma. He escaped slavery as a child to live with the Indians before becoming Marshall. These are the sorts of people who bring history to life. I'm sure I would never have heard of this man if Nelson hadn't written this book. Best of all, at the end she provides a photo of the real Bass Reeves, plus a glossary, timeline, and lots of web sites and books for further reading. Highly recommended, and well deserving of the 2010 Coretta Scott King Medal for best author/text."}, {"userName": "Jazzmon Cobb", "userReviewDate": "Apr 15, 2018", "userURL": "http://www.goodreads.com/user/show/76563390-jazzmon-cobb", "userReview": "Bad News for Outlaws is an amazing book that follows the life of a historical legend, Bass Reeves. A runaway slave during the Civil War, Reeves escaped to the Indian territories; he was welcomed and respected within the Native community. In addition, Reeves was a very large and strong man who had a near perfect shooting range. His skill, reputation, and good heart qualified him to become the territory protector, and in 1875 became an official U.S. Marshall. He excelled at his title, being the only lawman to successfully arrest every assigned warrant—dead or alive. He arrested ore that 3,000 criminals in his lifetime! Bass was respected by many, feared by outlaws, and led an influential life as peacemaker in Indian territories. Most importantly, he always sided with justice—even when it came to his own family members. This book is a great historical book for reluctant readers! It is filled with wonderful artwork and short, action-packed paragraphs that are engaging entertaining enough for even the shortest attention span. In addition, there is a wonderful index of “western words” that not only help readers understand western lingo, but also adds to the books thematic western aesthetic. A wonderful read for all, especially African American youth who want to learn more about the positive contributions blacks have made in American history!"}, {"userName": "Audra", "userReviewDate": "Mar 30, 2018", "userURL": "http://www.goodreads.com/user/show/16010856-audra", "userReview": "This is a children's book, but still very informative. Bass Reeves grew up a slave but later became one of the best deputy marshals in the Indian Territory (which later became Oklahoma) for 32 years. He was a man of integrity, very tall, and very well-respected. He was an excellent marksman and cunning. So cunning that when he was given warrants for outlaws to capture them, those outlaws were considered as good as caught because Bass Reeves always got his man. Once Indian territory became Oklahoma state, Reeves was out of a job, but not for long. He was then hired by the Muskogee, Oklahoma police force and even though he was almost 70 and walking with a cane by that time, he was still very much feared by lawbreakers. Don't cheat yourself by not reading this because it's a children's book. It's a great book and has some wonderful references at the back for adult books that were used to gather research on the subject."}, {"userName": "Cheryl", "userReviewDate": "Jul 08, 2017", "userURL": "http://www.goodreads.com/user/show/7241616-cheryl", "userReview": "Great introduction to a historical figure I had never heard about. I would've rated it 5 stars, but I wasn't the biggest fan of the artwork."}, {"userName": "Jill", "userReviewDate": "Feb 02, 2013", "userURL": "http://www.goodreads.com/user/show/1444762-jill", "userReview": "This book tells the story of Bass Reeves, who was born into slavery in 1838 in Crawford County, Arkansas. Like most slaves, he was given the surname of his owner, George Reeves. During the Civil War, Reeves fled north to what is now Oklahoma, and lived with Native Americans.In 1875, a U.S. Marshal in the so-called Indian Territory hired 200 deputies and, hearing about Reeves’ skill with Indian languages as well as with a gun, he took on Reeves as well. Reeves worked for thirty-two years as a deputy, and was reputed to be “one of the bravest men this country has ever known.” He died at age 72 in 1910 of a kidney disease. Hundreds of people – blacks, whites, and Indians, attended his funeral.The story of Reeves is a natural for kids. It is a real-life action-packed look at the Wild West that doesn't read like non-fiction at all. It features a fantastic hero who overcame the worst sort of adversity with his exceptional mind and extraordinary gumption. For example, as a slave, Bass was never allowed to learn to read, but when he became a deputy, he managed to capture outlaws by his ingenuity and courage. He would have arrest warrants read to him by someone else, and in the process he would memorize the shapes of the letters for each name, along with the charges against that person. Then he’d go out hunting. As the author writes:\"Even when he got thirty warrants at one time, Bass always brought in the right outlaws.”He not only arrested the criminals (he once brought in seventeen prisoners at once!) but at night, he’d talk to them about the Bible and about repentence.His bravery was legendary; he actually stopped a lynching in action once, as the angry mob “just watched in awe as he rode off.”And his integrity was unquestioned as well. He even arrested his own son for murder, after none of his colleagues would do it out of respect for Bass.In Bass’s career as a deputy, he arrested more than three thousand men and women, and only killed fourteen in the line of duty. After Oklahoma became a state and the Indian Territory ceased to exist, he was hired on with the police force in Muskogee, Oklahoma. Nobody would mess with him given with his reputation:\"During his two years on the force, not a single crime occurred in his patrol area.”Evaluation: This is a wonderful story, and R. Gregory Christie’s illustrations meet his usual high standards. (Christie is a three-time winner of the Coretta Scott King Illustrator Honor Award.) In this book, Christie styles some of his paintings to look like Old West wanted posters. Although most of the pictures use earthy tones, they are bold and vibrant and set against bright blue skies.It took me a while to get used to Mr. Christie. As he has said in an interview:The disproportionate compositions and elongated figures [of my art] are meant to be a directional device for the viewer, my own natural inclination, and a challenge for the viewer to break away from the established fundamental belief that all children’s books must be realistic or cute.”Once you get used to the idea that children’s books are a good medium for introducing different visual styles as well as conveying stories, you can’t help but fall in love with Christie. Supplementary material at the back of the book includes a glossary of western words, a timeline, a guide to further reading and websites, and more.Rating: 4.5/5Note: This book was the 2010 author award winner of the Coretta Scott King Book Award."}, {"userName": "Kym Winchester", "userReviewDate": "Mar 11, 2013", "userURL": "http://www.goodreads.com/user/show/15683259-kym-winchester", "userReview": "Audience: I feel this book is appropriate for older elementary school-aged children, perhaps grades 3-6. This is due to more mature subject matter, including talk of slavery and murder. Appeal: I think children interested in history, especially about the \"Wild West\" type of outlaw stories would love this book. Also children interested in learning about African American's part in helping settle our country. Application: I would use this book in teaching about American history. It could also be tied into Black History Month-but I personally feel we should be teaching multiculturally all year round! I would perhaps do an activity discussing what children know about the parts of African Americans in the early history of the USA. I think this book would really be interesting to contrast some of the limited points of view children have been taught, i.e., only about slavery in the early history of the USA.Awards: This book won the Corretta Scott King Award in 2010. It also won the American Library Association Notable Books for Children in 2010. Book review from Booksinprint.comPublishers Weekly( November 02, 2009; 9780822567646 ) With lively language and anecdotes, Nelson (Juneteenth) chronicles the life of African-American lawman Bass Reeves in a biography that elevates him to folk hero. The story opens with an action-packed sequence leading to Reeves killing criminal Jim Webb. The second spread has readers staring down the barrel of Reeves's rifle, in an attention-grabbing, somewhat unsettling closeup. As Webb lay dying, he \"gave Bass his revolver out of respect. Bass buried Webb's body and turned in the outlaw's boots and gun belt as proof he'd gotten his man.\" Christie's (Yesterday I Had the Blues) dynamic full-page oil paintings portray a somber, statuesque Reeves, his big eyes shining from under the brim of his deputy's hat. The folksy language is heavy with simile (\"Bass took to guns like a bear to honey\") and jargon (vittles, slack-jawed cowpoke), inviting a drawly reading. It's an arresting portrait of a man who rose from escaped slave in Indian Territory (now Oklahoma) to become a federal marshal who made thousands of arrests, including his own son, but killed only 14 men. A glossary, bibliography, time line and other source material are included. Ages 8-12. (Oct.) (c) Copyright PWxyz, LLC. All rights reserved(c) Copyright PWxyz, LLC. All rights reservedKI agree with this review; the paintings are subdued but vivid, and I found that the folksy language almost took me back in time to when these events actually happened. I agree with the unsettling close up account of some of the events-this is why I feel the book would be too much for younger readers."}, {"userName": "Crista", "userReviewDate": "Feb 17, 2011", "userURL": "http://www.goodreads.com/user/show/3566301-crista", "userReview": "2010 Coretta Scott King Award Winner.When looking at the Coretta Scott King Award and applying it to the 2010 winner, Bad News for Outlaws, The remarkable life of Bass Reeves, Deputy U.S. Marshal, I came to the following analysis. This colorfully narrated story was written by by Vaunda Micheaux Nelson, illustrated by R. Gregory Christie. Each page describes factually accounts and details of the legendary life of Bass Reeves. The language used is straight from that time period, which gives it a sense of authenticity. Luckily, there is a glossary of terms in the back to help those of us who are unfamiliar with the western vernacular. I like how she is telling us all of the research and documented facts by making it feel like a “tall tale” this way it is easy to understand and relate to. The illustrations are beautiful paintings set in the 1900’s. The colors used give you a sense and feel of the old west. They are a perfect matching to the story. I love how they are set almost has worn pages from old wanted posters. In order to qualify for the Coretta Scott King award, the book needs to “consistently motivate youth readers to stretch their imagination and thinking” This story definitely reaches that goal. The readers can picture what is going on and feel as though an elder from the time is telling them about Marshal Reeves. Another criteria is to: “represent trend-setters, innovations, or fresh explorations of themes or topics or perspectives”. As the author notes in the end, there really are not stories about black cowboys or marshals that are written for children. This story brings Bass Reeves back into our thoughts, so will not become an “unsung hero”.Another qualifier is that the book must: “commands an influential place in literature by and about African American”. Everything about Bass Reeves screams character, honesty and respect. He did things by the law and was feared or respected by every person he encountered regardless of skin color. He made over 3,000 arrests and only had to take 14 lives in the process. That is amazing for that time period. I loved the stories about how he would outsmart those he was after. He would pretend to need help, and then make the arrest.I love how this story is for the older student. It is a nonfiction picture book with a lot of meat to it. The readers are gaining information, knowledge and history without realizing they are learning. This book definitely shows all of the characteristics and qualities needed to be a Coretta Scott Winner."}, {"userName": "Taylor Destito", "userReviewDate": "Nov 16, 2013", "userURL": "http://www.goodreads.com/user/show/23604830-taylor-destito", "userReview": "Bad News for Outlaws: The Remarkable Life of Bass Reeves, Deputy U.S. Marshall tells the story of Bass Reeves. He was a slave who escaped into Indian Territory in the early1860s. When the civil war ends in 1865, Bass is finally a free man and bought land in Arkansas, married, and had 11 children. Because the country was still unexplored, there were lots of outlaws and therefore lots of murders, robberies, and other illegal activity. In 1875, the U.S. government sent Judge Isaac C. Parker to control the territory. He hired Bass to track down outlaws because Bass new the territory, could shoot well, and had great tracking skills. Bass was illiterate but he used his resources and often disguised himself while he tracked the outlaws so they wouldn’t catch on. The book includes many of the stories of outlaws Bass captured. To get the reader interested, the story starts off with the death of Jim Webb when there was a standoff after Bass tracked him down for two years. Included in the book are details about Bass capturing and turning in his own son who killed his wide for being untrue. During his time as a U.S. Marshall, Bass Reeves captured over 3,000 outlaws and only killed 14 men. The story ends with a short description of Bass’ death in 1910 from Bright’s disease.This story really illustrates the reality of the wild wild west while telling the story of Bass Reeves at the same time. The illustrations are colorful and very detailed. Images are abstract when necessary but they get detailed when the illustrator wants you to see a certain emotion or scene clearly. The paintings and format of this book are definitely what attracts readers. Some of the text is even printed so it looks like they are on “Wanted” signs. Also, in the back of the book are countless references including a glossary, timeline, more information about Bass Reeves and the Indian Territory, and resources so readers can verify or learn more about the information presented in the book."}, {"userName": "Laurie", "userReviewDate": "Dec 08, 2012", "userURL": "http://www.goodreads.com/user/show/12452140-laurie", "userReview": "Citation: Bad News for Outlaws: The Remarkable Life of Bass Reeves, Deputy U.S. Marshal, by Vaunda Micheaux Nelson. (Carolrhoda Books, 2009). 40p. Biography.Summary: This book tells the history of Bass Reeves, a feared and respected lawman of the old west. Born a slave, Reeves escaped to the Indian Territory and devoted his life to bringing law to the territory that would become Oklahoma.Critique: (a.) This book reads as a tall tale, almost too good to be true. The style draws the reader in right from the start, sharing Reeves’ incredible life story. Rather than starting with his early life, the author begins with one of the outlaw showdowns where Reeves relied on his quick thinking, bravery, and marksmanship to survive. The illustrations are painted primarily, and lend graphic detailed support to the text.(b.) Nelson introduces Reeves as a hero, and then offers the background that led to his regard. Sections are kept short and action packed. Each page is begun with a sentence in bold print, drawing the reader into the exciting tale, while allowing for quick access to different time periods in his life. The back of the book provides a glossary of western words, a timeline, and suggestions for further reading.(c.)One of the strongest examples from Reeves’ life that the author included was when he was tasked to bring his own son to justice. (p.28,29)This true example of Bass Reeves’ devotion to duty showed how important the law was to Reeves. Illustrations portray his solemn acceptance, supporting the tone and expression of the text far better than a photograph could have done.Curriculum Connection: I would use this book with upper elementary students to introduce another perspective and participating factor of the American West. I would first ask students to discuss and share their previous knowledge, as a way to address any misconceptions or stereotypes. It would also be a great addition to a biography study."}, {"userName": "Sarah BT", "userReviewDate": "Feb 03, 2010", "userURL": "http://www.goodreads.com/user/show/2438338-sarah-bt", "userReview": "About the Book: Bass Reeves was a former slave who became a U.S. Deputy Marshal. He worked hard bringing in criminals and was respected and feared for three decades. His story may sound like a tall tale, but this is the life of Bass Reeves. GreenBeanTeenQueen Says: Bad News for Outlaws is this year's Coretta Scott King Author Award winner. I'm so glad it won because not only do I think this book is incredibly deserving, but I'm not sure I would have come across it otherwise. I don't know if I can express how much I loved this book. It's a picture book biography, but I think the subject and text make it perfect for tweens who might not typically be interested in non-fiction. It could also make a great introduction to biographies, as it really does read like a tall tale. Vaunda Micheaux Nelson captures the voice of the old west perfectly and it was so wonderfully written. Ms. Nelson also includes many \"western words\" and includes a glossary of terms that readers might not recognize. I think this adds to the authenticity of the text. Bad News for Outlaws very much reads as though someone has just told you \"come sit by the fire and I'll tell you a tale\"-there is a distinct narrator throughout and I could hear that narrator in my head while reading. Give this one to readers looking for a good hero story-they'll be thrilled. And I'm sure they'll add Bass Reeves to their hero list like I have after reading."}, {"userName": "K.C.", "userReviewDate": "Jul 17, 2012", "userURL": "http://www.goodreads.com/user/show/2522026-k-c", "userReview": "Nelson, Vaunda Michaux.(2009). Bad News for Outlaws: The Remarkable Life of Bass Reeves, Deputy U.S. Marshal. Minneapolis: Carolrhoda books.Category: biography, Coretta Scott King Award (author)This is the story of Bass Reeves, a runaway slave who lived in Indian territory, living among Native Americans. He was later is hired as a U.S. deputy marshall in the territory that became Oklahoma. Over 32 years as a marshal, he captured hundreds of outlaws; he always got his man (and in the case of notorious outlaw, Belle Starr, his woman) Several individual stories are presented that show his varied techniques to capture outlaws. He sometimes used disguises to trick his targets. Nelson tells how he once dressed as a farmer and purposely ran over a stump with his wagon to draw outlaws out of the house to help him. He was so committed to doing the right thing that Reeves even brought in his son when he found him on the wanted list. This is an inspiring, untold story that brings history to life. Illustrations by R. Gregor Christie are outstanding.Themes: Bass Reeves, U.S. Marshals, African Americans, criminals, frontier and pioneer lifeClassroom uses: read-aloud, social studies, Black History month"}, {"userName": "Heidi", "userReviewDate": "Jan 24, 2010", "userURL": "http://www.goodreads.com/user/show/324467-heidi", "userReview": "Picture Book for Older ReadersWinner of the 2010 Coretta Scott King award, Vaunda Micheaux Nelson’s well-researched account of Bass Reeves, slave turned Deputy U.S. Marshal, is a story of honesty and bravery. Bass Reeves’s story is told through a spirited, old-west narrative which will motivate reluctant readers. Kids will love learning about sharpshooter Reeves and how his disguises and trickery helped him arrest more than 3,000 outlaws over 32 years in Indian Territory. R. Gregory Christie’s painterly illustrations are brilliantly hued and unique in their perspective, shifting between birds-eye, close-up, landscape, and a kind of first person view. Following the story is a glossary of Western words, a timeline, and more information about Indian Territory and Judge Parker. Some violent images and descriptions make this book appropriate for readers third grade and above, but overall, this is a story about integrity and will illicit rich discussion. Reeves always tried to find a way other than violence, and over his long, legendary career, he killed just 14 men. This is a wonderful multicultural text because it shows multiple cultures interacting in multiple contexts. Indeed, Reeves’s funeral was attended by hundreds of blacks, whites, and Indians."}, {"userName": "Charles Kim", "userReviewDate": "Nov 19, 2012", "userURL": "http://www.goodreads.com/user/show/12333143-charles-kim", "userReview": "Grade/interest level: 5thReading level: Lexile, 860LGenre: Picture; Multicultural Literature; Historical FictionMain Characters: Bass ReevesSetting: Indian Territories (1875-1907); present-day Oklahoma POV: Third PersonBad News for Outlaws talks about Bass Reeves,a U.S. Marshal in the Indian Territories from 1875 to 1907 (which eventually became Oklahoma). He was the first black man to become a U.S. Marshal and was good at being one. He arrested over 3000 men and women in creative ways to establish peace in extremely unlawful areas, killing only fourteen men in all. Throughout his whole career as a U.S. Marshall he was never wounded. Nelson brings back one of America's heroes from the late 1800's, a story of a man who, although was born into slavery, rises above his situation to become a legend of his time. I would use this text in my classroom as a read aloud to quickly talk and write about an important African American figure in our history. This can be used in both literacy, math and social studies. Literacy has the writing component, math has the statistical analysis, and a deeper look into the history of the West can be studied for social studies."}, {"userName": "Jann Barber", "userReviewDate": "Jan 01, 2014", "userURL": "http://www.goodreads.com/user/show/2107952-jann-barber", "userReview": "Someone on Tumblr posted a piece on Bass Reeves, Deputy U.S. Marshal. I found that I wanted to know more, and so I purchased a copy of Black Gun, Silver Star that I have not yet read. I checked Bad News for Outlaws out of the library.This book is brief and for children. I did not feel that the information given painted a strong picture of Bass. I look forward to reading Black Gun, Silver Star, as it is written for adults and should have more flesh on the bones. I am curious to see whether any of the anecdotes from this book appear in Black Gun, Silver Star.I did enjoy the illustrations in this book. R. Gregory Christie is an award-winning illustrator and he has won the Coretta Scott King Illustrator Honor Award three times.Bass had a strong moral compass. He started out as a slave, escaped after a fight with his owner, lived with Indian tribes, and then became a Deputy U.S. Marshal. He was respected, although not everyone liked him. He only killed 14 people, yet tracked and arrested over 3,000. He even had to arrest one of his sons when the young man killed his wife.Bass died of Bright's disease."}, {"userName": "babyhippoface", "userReviewDate": "May 12, 2011", "userURL": "http://www.goodreads.com/user/show/282057-babyhippoface", "userReview": "Legendary lawman Bass Reeves went from slavery to wearing a star for the U.S.Marshall's office, capturing over 3,000 bad guys in Indian Territory and beyond. I will admit this laudatory picture book came close to being over the top in it's adulation--from what I read here, Bass was darn near perfect. But you know what? That's okay. Some men deserve to be remembered that way, and apparently Reeves is one of those men. Bravo, Bass.I appreciated the author's note at the end that explains why she chose to write about Bass Reeves: as a child she didn't know any heroes of the American West who had black skin like hers existed. How much difference might it have made in all her childhood games if she had known about Bass Reeves? Today's kids need to know there was such a man. This book is on the 2012 list for the Sequoyah Book Award, a kid-selected honor, and though it likely won't win, lots of Oklahoma kids will be introduced to a hero from their own state they probably would never have known about otherwise."}, {"userName": "paula", "userReviewDate": "Nov 06, 2009", "userURL": "http://www.goodreads.com/user/show/1543634-paula", "userReview": "I am pretty close to loving this book. I love that Bass Reeves was a real guy, a tall black man with a bushy mustache and a deputy's star, way back when in Indian Territory. Roustin' outlaws and all that. I love that this story shows the flip side of Little House on the Prairie. And MOST of the time, I love the tone. I love the swagger of the Western lingo the author is setting down. But she's inconsistent in its use, and some of the now-obscure terms (Bass Reeves is said to have \"forked\" his horse, which means that he sat on it) that she uses, which are helpfully explained in a glossary, are not bolded in the text, which means you have no idea that any help is on offer.I am also not wild about the illustrations. The painterly, rough style works in some places but makes the pictures hard to read in others. The palette is also, I think, unnecessarily muddy. LOVE the cover though.All praise to Vaunda Micheaux Nelson for bringing us this terrific story. I hate to say a word agin' it."}, {"userName": "Kathleen", "userReviewDate": "Dec 12, 2016", "userURL": "http://www.goodreads.com/user/show/16103061-kathleen", "userReview": "*ahem*BASS REEVES IS SUPER DUPER AWESOME. *ahem*This short picture book is a quick and dirty biography of Bass Reeves, one of the longest-serving deputy marshals in United States history. And have I mentioned he's super duper awesome? He's a black man, born in slavery, who made his reputation as one of the best, most honest, and relentless sharpshooters in the marshal ranks. Even Belle Starr turned herself in rather than try to run away from Bass Reeves. Belle Starr. When he retired from the marshal service and joined the police (because complete retirement is for wusses) there was not a single crime in his patrol district the entire time he was there. Do not fuck with Bass Reeves. And do learn all about him because SUPER DUPER AWESOME. The book itself is pretty rad too, but mostly BASS REEVES."}, {"userName": "Paige", "userReviewDate": "Mar 06, 2014", "userURL": "http://www.goodreads.com/user/show/16248035-paige", "userReview": "Bad News for Outlaws: The Remarkable Life of Bass Reeves, Deputy U.S. Marshal by Vaunda Micheaux Nelson is a great read, especially for 3-5 grade students who may be reluctant or uninterested readers. The book uses \"old West\" language to tell the story of Reeve's exciting life capturing criminals. Nelson writes, \"But Bass was as right as rain from the boot heels up. He couldn't be bribed.\" I would use this textbook in a unit study with other books that highlight this time in American history (Indian territory 1875-1900). The book that came to mind while I was reading was True Grit. While that book might be for older students, another similar fiction story would be a nice pairing. Only one photograph of Reeves was included in the book, but there were many eye-catching illustrations to support the text. The author included a timeline, glossary, suggested readings and websites, and additional information about Indian Territory to support comprehension of the text."}, {"userName": "Amber Haynes", "userReviewDate": "Mar 08, 2015", "userURL": "http://www.goodreads.com/user/show/27456705-amber-haynes", "userReview": "A larger than life human being, with a larger than life legacy! Bass Reeves was a U.S. Deputy Marshal in Indian territory during the time just after the Civil War and slavery ended. He was keen to detail and a sharp shooter, only shooting when utterly necessary. Taking down about 3,000 outlaws, including his own son, Reeves was the most feared deputy of his time. The author of this book tells this story of a remarkable African American man making a positive name for himself fresh out of slavery. This book is rich in vocabulary and would be great in a 3-5th grade classroom. It depicts the time without going into the gritty details. Younger students may find this book harder to get into and comprehend without guidance. However, with guidance this could lead into a great history lesson. It also seems to be a high interest read for boys."}, {"userName": "Jackie", "userReviewDate": "Jan 06, 2011", "userURL": "http://www.goodreads.com/user/show/180349-jackie", "userReview": "The true story of African-American U.S. Deputy Marshall, Bass Reeves, who administered law in the Old West with compassion, fairness, and lawfulness. During his remarkable career from 1875 until the early 1900's, he brought to justice hundreds of outlaws, while killing only 14 even though he was instructed to bring the criminals in 'dead or alive'. Born into slavery, Bass saw freedom once the Civil War was over, and he was sought for this tough, grueling job because of his moral ethic and adherence to law. A real hero of The Old West, Bass Reeves is a figure that makes our country proud. This kid-friendly biography is chock full of facts, timelines, and historical pictures. The illustrations are a little muddy and blase, yet they do not significantly detract from the story."}, {"userName": "Kathleen Whitaker", "userReviewDate": "Jun 28, 2012", "userURL": "http://www.goodreads.com/user/show/9910853-kathleen-whitaker", "userReview": "This book is great for boys and girls learning about the Old West. The book tells of a slave that became a U. S. Marshall. He was a marshall for 32 years, arrested more than 3,000 men and women, yet only killed 14 of them because he preferred alive to dead. He believed in goodness and even tried to convert his captives to ment their ways. When one of his sons killed his wife, Marshall arrested his son and stayed by him. Marshall had a long career in law enforcement and he couldn't read! He worked out a system that worked for his and kept him honest. This book could be read to primary boys and girls, grades K-3. This book is informative about a man big in many ways. This book won the Coretta Scott Kind award (2010)"}, {"userName": "Kathleen Ferrel", "userReviewDate": "Jun 23, 2012", "userURL": "http://www.goodreads.com/user/show/9888273-kathleen-ferrel", "userReview": "Bad News for Outlaws is historical multicultural book about the life and legend, Deputy U.S. Marshal Bass Reeves. It is a short biography of the \"best U.S. Marshall Oklahoma has ever seen.\" Bass Reeves was one of the first black U.S. Marshal's west of the mississippi. I thought this book was very well written and the details the author adds about each character give this story a nice touch. The nice thing about this book is at the end there is a glossary for the \"western words\" used throughout the story. It could be for younger children or older depending on how advanced their reading level is. Children ages 7 through 10 that are interested in western stories would enjoy this book. This book is from the Coretta Scott King Book Awards list. KF"}, {"userName": "Jim", "userReviewDate": "Oct 13, 2011", "userURL": "http://www.goodreads.com/user/show/2105546-jim", "userReview": "6 star book.bass reeves was a real life paul bunyun. born a slave, he escapes during the civil war into indian territory. he perfects his shooting and learns tracking, languages and the country. becomes a deputy marshall under the hanging judge, isaac parker. belle starr turns herself in rather than be tracked by him. he's a sharpshooter that hates killing. if luke short were an artist this is what his art would have tried to look like. really great author notes. this should be in all elementary school libraries. the temptation would be to feature it only during black history month. Don't. this is real storytelling, not 'just' a black book or a biography for kids."}, {"userName": "Theophilus (Theo)", "userReviewDate": "Mar 08, 2010", "userURL": "http://www.goodreads.com/user/show/1733270-theophilus-theo", "userReview": "I am a big fan of Bass Reeves and have read a lot about him, including several of the books referenced by the author. I expected much. It was a great book. Condensed to a perfect size for its audience with only the exciting parts left in. Not all of them mind you, but the age appropriate ones. Good to read to children and challenging for very young readers to tackle on their own, including a glossary. Why was this man left out of American Western history for so long? Thanks to the author for helping bring him to our attention once again. Maybe the history taextbook writiers will take notice when their youngsters ask them for more info about the great Bass Reeves."}], "description": "Sitting tall in the saddle, with a wide-brimmed black hat and twin Colt pistols on his belt, Bass Reeves seemed bigger than life. Outlaws feared him. As a deputy U.S. Marshal and former slave who escaped to freedom in the Indian Territories, Bass was cunning and fearless. When a lawbreaker heard Bass Reeves had his warrant, he knew it was the end of the trail, because Bass always got his man, dead or alive. He achieved all this in spite of whites who didn't like the notion of a black lawman.For three decades, Bass was the most feared and respected lawman in the territories. He made more than 3,000 arrests, and though he was a crack shot and a quick draw, he only killed fourteen men in the line of duty. Bad News for Outlaws reveals the story of a remarkable African American hero of the Old West.", "title": "Bad News for Outlaws: The Remarkable Life of Bass Reeves, Deputy U. S. Marshal", "url": "http://www.goodreads.com/book/show/2934707-bad-news-for-outlaws", "average": 4.03, "cover": "https://images.gr-assets.com/books/1309353583l/2934707.jpg", "reviews": 319, "authors": [{"url": "https://www.goodreads.com/author/show/57823.Vaunda_Micheaux_Nelson", "name": "Vaunda Micheaux Nelson"}, {"url": "https://www.goodreads.com/author/show/537319.R_Gregory_Christie", "name": "R. Gregory Christie"}], "type": ["Biography", "Childrens", "Nonfiction", "History", "Cultural"], "outlinks": ["http://www.goodreads.com/book/show/2934707-bad-news-for-outlaws", "http://www.goodreads.com/book/show/12458860-no-crystal-stair", "http://www.goodreads.com/book/show/20899295-the-book-itch", "http://www.goodreads.com/book/show/553456.Almost_to_Freedom", "http://www.goodreads.com/book/show/26618833-don-t-call-me-grandma", "http://www.goodreads.com/book/show/7049322-who-will-i-be-lord"]}