{"ratings": 10793, "userreviews": [{"userName": "Jayson", "userReviewDate": "Sep 12, 2016", "userURL": "http://www.goodreads.com/user/show/22106879-jayson", "userReview": "(B+) 78% | GoodNotes: It elicits introspection from the shadows of things, by contrast and simile, in bespoke villains, affinity, recall and trial."}, {"userName": "Melissa ♥ Dog/Wolf Lover ♥ Martin", "userReviewDate": "Mar 04, 2017", "userURL": "http://www.goodreads.com/user/show/17438949-melissa-dog-wolf-lover-martin", "userReview": "I enjoyed this book and loved the graphics. Absolutely loved them. The story line was great as well. I may come back later and add pictures, but you can look at all the other reviews. I liked certain other characters put in appearances in the book as well. Of course now I want to collect them all and there are so many that I want and I DON'T have the winning lottery ticket, so . . . . . . ."}, {"userName": "Jeff ", "userReviewDate": "Sep 05, 2014", "userURL": "http://www.goodreads.com/user/show/12618229-jeff", "userReview": "The Joker shooting and paralyzing Barbara Gordon is one of those iconic moments in comics. Sick, twisted, yet memorable. The New 52 Batgirl iteration treads on dangerous ground by having her legs restored and having her don the cape and cowl again, but Gail Simone makes it work in one of the few New 52 revamps that had some legs, at least in this volume.The cure itself isn’t dwelled on, but the trauma still haunts Barbara and getting back into crime fighting shape isn’t easy. The bad guys still hit hard.As Batgirl attempts to get her mind and body back in the game, she goes up against Mirror, a villain, who wants to take back miracles that were visited upon Gothamites. Bastard!!! Simone creates some nice symmetry between the anti-miracle Mirror and Barbara’s gratitude for her own medical miracle.Bottom Line - A decent New 52 Batbook; it goes down easier than Batwoman, Vol. 1: Hydrology. It kind of loses momentum with the second story in this volume, but still worth giving a look. Will someone please press the damned elevator button already?"}, {"userName": "Anne", "userReviewDate": "Jul 12, 2012", "userURL": "http://www.goodreads.com/user/show/1720620-anne", "userReview": "Babs is back!And better than ever!?Well, no.And maybe, yes.See, I'm one of those who has been rooting for someone to stick Barbara Gordon's ass in a Lazarus Pit for years. Get her outta that chair! So, the thought of the original Batgirl finally coming back made my inner geek do somersaults. Yay!Yeah, I liked Stephanie Brown and Cassandra Cain, but I wanted Barbara. Nobody could take her place. Ever. And I finally got my wish. Except...be careful what you wish for.'Cause now I miss Oracle.I guess I should explain that a bit, but let's start off with...The GoodGail Simone. I love her. She manages to write female superheroes who are a tad more realistic than some of those written by her male counterparts. By that I mean that 'occasionally' men tend to write women the way they see them. Or maybe the way they wish they were. Overly sexy. Overly frigid. Overly frumpy. Overly sexy...Ahem.Ok. I'm not just bashing boys here! A lot female writers do the same things to male characters. Look at all the emo guys wandering around in YA novels. *snort* Yeah, it's realistic for a teenage guy to want to Wait For Marriage. Riiiight.I'm getting off topic, though. What I meant to say, was that Simone is a great voice for women in comics. She made Wonder Woman cool, and she's doing the same thing for Barbara.But here's why I miss Oracle...The Not-As-GoodWhen Barbara Gordon was Oracle she was a badass with a headset. Constantly jacked into everything that was going on, she was the go-to girl for information. She was calm under pressure. She was mature, and sure of herself.Now?Ehhhh.And I guess that's what I miss.The story goes like this:Three years ago the Joker shot Barbara, leaving her paralyzed from the waist down. There is no mention of her being the Oracle in this book, so I have no idea if that happened or not. It doesn't seem likely, because Barbara still seems pretty young and unsure of herself. No Badass with a Headset sort of attitude.Evidently, Jim Gordon finds out about some long-shot surgery/treatment, and lo' and behold, Barbara can walk again!*canned applause*Unfortunately, Babs has some PTSD to deal with when it comes to guns. Well, who wouldn't, right?She's also trying to take out some lame Gotham villains, on legs that aren't quite up to par. Yet. However, as she mentions in the opening pages, she's got upper arm strength like a mother...In the end, I think Simone did a good job with what she had to work with, and I have a feeling that these books are just going to get better and better as the new/old Batgirl finds her footing again.Recommended!"}, {"userName": "Corey", "userReviewDate": "Feb 18, 2013", "userURL": "http://www.goodreads.com/user/show/8853070-corey", "userReview": "When DC first announced New 52, I didn't understand the reasoning behind it. If they were going to reboot their superhero universe, why do it halfway? Why not jettison decades of overly complicated continuity and start fresh?That question went double for Batgirl. Barbara Gordon hadn't been active as Batgirl in the DC Universe for over 20 years, and she absolutely deserved a starring role in her own contemporary comic. But again, if you're rebooting continuity, why preserve the events of The Killing Joke that paralyzed her, put her in a wheelchair, and cut short her crimefighting career? Why not just let that storyline rest, along with Barbara's years as Oracle, and spotlight a version of Batgirl who had never been forced into retirement in the first place? Why saddle her with the same baggage as post-Knightfall Batman, a martial artist who was crippled by a spinal injury and then miraculously returned to perfect, peak-performance health?And then I finally got around to reading this hardcover volume collecting the first 6 issues of New 52 Batgirl, and I received my answer: Gail Simone. Writing about Barbara Gordon as a very real person recovering from a life-altering injury at the hands of a psychotic madman, Gail Simone has resurrected Batgirl as one of the most compelling heroes in comics. Given a second chance in life that she acknowledges as nothing short of a miracle, Barbara is a completely human character filled with doubts, fears, and imperfections that make her relatable to the readers that will be rooting for her to succeed even as they empathize with the pain of her failures.It's easy to see why Simone is one of the most popular writers working in comics, and why there was such an uproar from outraged fans when she was ever-so-temporarily removed from the Batgirl series by DC, who thankfully realized the error of their ways and reinstated her sooner rather than later. For me at least, she single-handedly justified the creation and existence of the New 52 universe that I had been more than willing to dismiss."}, {"userName": "Steph", "userReviewDate": "Apr 05, 2013", "userURL": "http://www.goodreads.com/user/show/3192797-steph", "userReview": "We used to chase each other like this. Two kids flirting in a way only a handful of people on Earth could ever match. He with his acrobatics... and me with my ballet.Everyone else can go home, basically."}, {"userName": "David Schaafsma", "userReviewDate": "Dec 15, 2016", "userURL": "http://www.goodreads.com/user/show/269235-david-schaafsma", "userReview": "Okay, this surprised me, and I like it. I only read it because 1) Lauren recommended it to me as one of the strongest entries in the New 52 (ugh), and 2) because I will likely teach another YA GN courses next summer and want to read stuff I didn't use this summer. Barbara Gordon, the comish's daughter, once paralyzed by the Joker, is back on her feet. And strong, thanks to Simone, and the artwork is solid. She's complex--has survivor's guilt!--and has to face Mirror, in a couple ways, as villain and self reflection. Good concept and just okay villain, but good overall, like 3.75."}, {"userName": "Sam Quixote", "userReviewDate": "Aug 26, 2012", "userURL": "http://www.goodreads.com/user/show/5759543-sam-quixote", "userReview": "Barbara Gordon is back as Batgirl! As most people know, her character was shot in the spine and crippled by the Joker in Alan Moore’s “The Killing Joke” and for years afterwards was in a wheelchair, becoming Batman’s tech support as Oracle. With the New 52 relaunch last year, she was controversially taken out of the wheelchair to become Batgirl once again. Interestingly, the events of the “Killing Joke” still happened but 3 years of physiotherapy and pioneering surgery has taken Barbara from the wheelchair back onto her feet. Mentally though she’s forever scarred and she’s still not 100% physically fit and this book re-introduces her character for a new audience to get to know her. Barbara is the best thing about the book. Getting to know her character, seeing her back in action as Batgirl, it’s all handled superbly by Gail Simone who gives Barbara a genuine voice and depth. In a city like Gotham where Batman has such a firm grasp of the city, it’s cool to see Batgirl carving out a niche for herself as another caped crusader while navigating the complexities of her own personal life. That said, the book is let down by sub-par villains. The first is called “Mirror”, a former army guy whose family died in a blazing car fire which he somehow survived. The incident snapped his mind leading him to somehow take revenge on anyone who’d miraculously survived a terrible event. It’s not the most logical route to becoming a villain is it? I mean, if he was that distraught, wouldn’t he just kill himself? Putting on an elaborate mirrored costume and enacting the “Final Destination” films is just too much of a stretch. The second is a villain who got her psychic powers over men after being shot in the head and surviving. Really? Anyway, the book is still a great read with enough going on to distract from the hows and whys of these oddball villains showing up - just tell yourself it’s Gotham City, the home of the performance artist villain. I’m conflicted over the decision to take Barbara out of the wheelchair as it seems a bit of a cynical decision (and what was wrong with Stephanie Brown anyway?) but Gail Simone’s written a fantastic book that gives Barbara Gordon/Batgirl an energetic and fun re-awakening."}, {"userName": "Steve", "userReviewDate": "Apr 10, 2015", "userURL": "http://www.goodreads.com/user/show/2314568-steve", "userReview": "This Batgirl is Barbara Gordon, the classic one everyone was harping for before the reboot and everyone was cursing when this was announced. First thing to note is that \"The Killing Joke\" did occur so she was paralyzed and she was Oracle but now she's been healed.Barbara Gordon is handled by the only person suitable to handle Barbara Gordon's return, Gail Simone, the writer who made her name by establishing the modern Barbara Gordon. This Barbara Gordon is very interesting as she's coping with getting out of the wheelchair, finally, and returning to crimefighting. She's out of her game and trying to regain the confidence that was shattered by the Joker.The first villain is decent and seems fitting. The Mirror does a great job at challenging the heroine on multiple levels, not just physically, but mentally and emotionally by making her doubt her recovery. This makes the heroine interesting and the villain threatening.The dialogue is well done and scenes are being set into place for later stories. Artwork is excellent with the mirror shots being really nice to look at. It also makes the fight scenes clear and interesting.The second villain is not very memorable and if I didn't look up her name I wouldn't be able to tell you. She has an interesting backstory but she feels like a throwaway and we'll probably never see her again. She doesn't add much, but at least I could still enjoy the comic because of the main character, something that I find hard to do with Batman comics since the villains are always the best part. The story is interesting simply because the character is interesting."}, {"userName": "Paz R.M.", "userReviewDate": "Oct 03, 2014", "userURL": "http://www.goodreads.com/user/show/28910448-paz-r-m", "userReview": "First Read: 10/04/2014: 4 Stars Second Read: 08/21/2016: 4 Stars Lots of people love Babs as Oracle, but this time around, a younger Barbara is back as Batgirl. Three years ago the Joker shot Barbara and left her paralyzed from the waist down. Barbara spent years on a wheelchair, but thanks to a risky new surgery she's healed and ready to come back to her old self. Or at least that's what she's trying to do. Her scars run deep and she's struggling to find herself and to heal. She's afraid, but she's brave. So even though she's suffering from PTSD, she won't let fear win. The four first issues are great. Simone's writing is perfect, she makes Barbara a compelling, complex character. She's not afraid to make her flawed. Babs is sometimes bitter, sometimes cheerful, she's smart as hell, but she makes mistakes. She feels guilty, she's dealing with survivor's guilt, so she will never underestimate this second change given to her. In those four issues, Babs will deal with a villain called Mirror. He'll challenge her weaknesses and also make her face the question she's been to afraid to answer. Why her? Why did she get a miracle when others didn't? The artwork in this volume is beautiful. There are some spectacular illustrations of Babs as Batgirl and the costume design is intimidating, is stunning, and so freaking kick ass. The coloring is on point and, especially in the first mini arc, it sets the tone of the scene so well.The last two issues though, they weren't as great as I was hoping for and that's mostly because of the weak villain. Her story feels rushed and unnecessary, although the clear convenient similarities with Batgirl's own story are obvious so I understand the use of the character, I found this mini arc so uninteresting. I did like Bruce's mini cameo and how we get some glimpses of Batman's and Batgirl's mentor and apprentice relationship though. \n(GUESS THE KILLING JOKE TEAM DIDN'T READ THIS SERIES)\nOverall, I loved my time reading and rereading this volume and I can't wait to see what the next installments will bring to Barbara's story. It was a great beginning with a complex heroine and an amazing team behind the scenes."}, {"userName": "Crystal Starr Light", "userReviewDate": "Mar 26, 2013", "userURL": "http://www.goodreads.com/user/show/3990525-crystal-starr-light", "userReview": "Another winner! Even a comic newbie like me could enjoy this and not get lost in missed backstory.Oh and you know what? This was the sort of carefree, laid-back, no-nonsense voice Laurell K. Hamilton attempted with Anita Blake and succeeded in only making Anita sound like an arrogant brat. Here, it works beautifully.I'll need a pay raise to be able to follow all these great comic series I keep finding."}, {"userName": "David - proud Gleeman in Branwen's adventuring party", "userReviewDate": "Dec 11, 2012", "userURL": "http://www.goodreads.com/user/show/10923016-david---proud-gleeman-in-branwen-s-adventuring-party", "userReview": "I went into the New 52's \"Batgirl\" series with very mixed feelings. On the one hand, I enjoyed many stories with the Cassandra Cain and Stephanie Brown Batgirls, and I was saddened to see those stories apparently wiped out of existence. Also, I was a huge fan of the stellar Birds of Prey runs by Chuck Dixon & Gail Simone, so again, the idea that DC was reversing all of that didn't sit too well with me. On the other hand, I've never been a fan of Alan Moore's \"The Killing Joke\", the story in which Barbara Gordon was shot through the spine and lost the use of her legs. Barbara's only function in that particular story was that of a victim, and considering she was almost never seen in the Bat-books for several years after TKJ, it was pretty obvious the Bat-editors originally had no intention to do anything more with the Barbara Gordon character...although they were more than happy to try to take most of the credit after Kim Yale & John Ostrander brilliantly reinvented Barbara as the computer hacker Oracle in \"Suicide Squad\" (a book that was not part of the Batman line and was not edited by any of the Batman books' creative force). Add to that Alan Moore's claim that Barbara Gordon's treatment in TKJ came about after an editor told him to \"cripple the bitch\", it's always left me questioning exactly how much misogyny was running rampant throughout DC at the time, so to me, the reversal of the events of TKJ felt like a triumph for women in the comic-book world.So, as I said, I had very mixed feelings going into the first volume of Batgirl, and now that I've read it...well, I STILL have mixed feelings!Overall, I was somewhat disappointed with Batgirl. Compared to Gail Simone's incredible work on series like \"Birds of Prey\" and \"Secret Six\", this just paled in comparison. The two main villains in this collection, \"The Mirror\" and \"Gretel\" suffered from \"trying-too-hard\" syndrome, where Simone had them ranting like lunatics in order to make them seem creepy, but it was so over-the-top, it just felt cartoonish instead. Sometimes the dialogue was so corny, it led to me inventing a new acronym...GOL (groaning-out-loud)! An early sequence in which Barbara says \"I found you, babies\" as she's about to confront a gang of killers is particularly cringe-inducing. And it's hard to take the stories too seriously, considering there are some absurd loopholes throughout. When Batgirl is unable to prevent The Mirror from killing a cop, why is the cop's partner so obsessed with bringing in Batgirl, instead of, y'know, the ACTUAL MURDERER?!? After being hired to kill Bruce Wayne, why does Gretel just stand in the background (while holding two weapons, mind you) when a brainwashed Bruce seems to be completely vulnerable?!? That said, there are also moments of Gail Simone's trademark brilliance throughout the story as well. Barbara Gordon comes across as far more human than most comic-book characters. She suffers from post-traumatic stress as a result of the events in TKJ. She isn't ready to forgive the mother who walked out on her years ago. But while she may not be perfect, she also exhibits more compassion than normally seen by comic-book characters. Whereas most superheroes quickly disappear after stopping a crime, after Batgirl saves a couple from a gang of muggers, she offers to stay with them until the police arrive (pretty brave, considering one police detective in particular is obsessed with arresting her). After defeating Gretel, she asks the authorities to be gentle with her, as she is sympathetic to Gretel's pain. These traits make Barbara an incredibly likeable character, one that the reader truly cares about and feels for. So, ultimately, Batgirl as a series is somewhat lacking so far, but Batgirl as a CHARACTER is absolutely amazing!"}, {"userName": "Lauren", "userReviewDate": "Nov 29, 2016", "userURL": "http://www.goodreads.com/user/show/52343138-lauren", "userReview": "Batgirl is well and truly back!Barbara Gordon, who most consider to be the true Batgirl, has overcome her paralysis to once again fight crime on Gotham's streets and bring those pesky criminals to justice. I absolutely loved this re-vamped version of Batgirl and tore through the book wishing it was longer. I think Simone has done a wonderful job in capturing Gordon's spunky personality and the illustrations are crystal clear and simply beautiful. The atmosphere is dark right from the word go and there is lots of tension to sink your teeth into. I know some people didn't really like the extended interior monologues but I thought they were a wonderful addition to the story and really helped me to gel with Gordon. Overall, a fantastic read which is definitely a keeper. Plus, I already have the second one on order :)"}, {"userName": "James DeSantis", "userReviewDate": "Jul 17, 2016", "userURL": "http://www.goodreads.com/user/show/16060275-james-desantis", "userReview": "This was okay. 2.5 is what I'd give it. Solid art (that one shot of her ass was odd but okay) and the overall storylines feel very disconnected at points. However, this volume does have redeeming values. One thing I loved was her interaction with Dick, bruce, and her roommate. They all felt well crafted and had heart. Jim's interaction was decent as well. However, the mother relationship felt a little forced, and didn't mend well. Also the villains main reasoning was...dumb? I didn't feel it. So it's enjoyable for what it is but nothing special. I'll check out the next volume hoping it's stronger than the first."}, {"userName": "Jesse A", "userReviewDate": "Oct 15, 2014", "userURL": "http://www.goodreads.com/user/show/21013603-jesse-a", "userReview": "Wasn't in love with this one. Might be a member of the bat family I can do without."}, {"userName": "Mike", "userReviewDate": "Nov 04, 2012", "userURL": "http://www.goodreads.com/user/show/1776702-mike", "userReview": "We get the nickel tour of Barbara Gordon's highlights reel: good father, eidetic memory, was in a wheelchair, shot by Joker, part of Batman's posse. Reasonably well-executed exposition.I am aware of the history of the character, how much Gail Simone loves her and is invested in how much she means to fans, and how controversial the change (out of the chair) is.Keeping all that in context, I cant help but find Barbara's first chapter a little melodramatic. I'm hoping that's just getting it out of the way early on - make a splash, then get out of the pool - and we won't be subjected to constant agonising over the \"one true moment her whole life changed\" drama. I get it but this better not be everything Batgirl means.I also can't say I was a big fan of the inner monologue when I started the book - I'm OK when it's remarking on the action, but it's downright off-putting when it's selling us on the character (even if a little over-arrogant and then proven otherwise). Show me, don't tell me - it may take longer but it's better storytelling and more compelling for the reader (at least for me). It's especially painful when Simone goes on to explain, in progressive detail the exact motivations of the villain - in case we missed the subtle allegory to Batgirl's transformation and mixed emotions at her renewed health. As the story continues I'm getting accustomed to it - I wouldn't recommend it for every writer but maybe this is Simone's thing, and I think once she gets going, it's a reasonable way to add depth to the story.I find this book troubling and my love of Simone wavering - I went into this wanting to love Simone wholeheartedly (even if I'm indifferent to the DCU as a whole), even though my previous encounters with her work make me think she's a little earnest (and sadly, the only word I can think of for the way her writing hits me is \"amateurish\") for my tastes. I love Simone's politics and her undeniable impact on fandom (especially GLBTQ) as a presence. I'd honestly love to be able to say that her writing style (or her characterisations) really hit home with me and made me feel gleeful and mesmerised (like she does for so many others). I notice how much Barbara sounds 20-ish - but I *notice* it, moreso than I *believe* it - knowwhatimean?Can someone fill me in on what I'm missing - Anne, Sam, what do you groove on so hard?I like the art - clear action, clean lines, great inks and colours. Most shots are framed well and a few creatively; a few are also framed a little exploitively, which bothers me every time and makes me wonder if Syaf is a junior version of that dude on the Catwoman reboot. I like the art more than the writing, and I really wish I didn't have to say that. I'll keep trying with Simone and I'll give her next volume a try - there's something I want to discover in this writing real bad."}, {"userName": "Nikki ", "userReviewDate": "Feb 18, 2014", "userURL": "http://www.goodreads.com/user/show/223837-nikki", "userReview": "I very much enjoyed my first foray into Batgirl -- certainly much more than I did the volume of Batman I choked down a while back for a class. Barbara Gordon is fun, and I have a thing for redheads anyway, I liked the art and her interactions with Bruce Wayne, and it's a good introduction for someone new to DC.I had two nitpicks. One, I didn't think terribly much of the villains. They seemed almost too easily dealt with, like Gail Simone was starting Batgirl out soft because of the point I'm about to get to. It kind of makes sense, since she is being reintroduced and she is portrayed as needing to get back into the game here, but. Eh. I didn't really care about the villains, put it that way. It felt a little bit rushed, too, though when I flipped back through it didn't seem too bad. Maybe because the villain I was more interested in, Gretel, had less space.The other thing was, well... why did we have to have a miracle cure for a disabled character? I don't know much about Barbara Gordon or how prominent she might have been as a disabled character, so maybe there have been other issues building this up, but just jumping right in and finding that she was completely paralysed and then got better \"miraculously\" (as several people point out), it just didn't feel right. I thought I was okay with it at first, given the way she talks about the time in a wheelchair and insists she's not delicate now she's out of it, but it didn't quite add up for me.Still, enjoyable, and I'll pick up some more Batgirl when I get chance."}, {"userName": "Brittany", "userReviewDate": "Jan 17, 2015", "userURL": "http://www.goodreads.com/user/show/26154285-brittany", "userReview": "***Pink Taco Buddy Read with the Shallow Readers! Female Lead this time: Barbara Gordon a.k.a. Batgirl***This was my first encounter with Batgirl. I didn't think I would like it as much as I did. I actually thoroughly enjoyed it.The first chapter was a lot of new information for me. I think it bogged me down, to be honest. But it was all info that I needed in order to know what the hell was going on. My favorite part about this volume was that the two separate stories were mysteries. Very different from the X-Men and Hulk I've read, where instead you get shocking \"Wow, didn't see THAT coming!\" moments. Babs really unravels the mysteries well, and not just with intuitive hunches all the time. She does research and studies and I like that about her. Her wits can't prevail all on their own every time.As the story continued, Barbara grew on me. At first I thought her intense back story of being shot by the Joker would bog her down for me, but it ended up being what fueled her. I'm not 100% certain as to why she decided she was meant to be Batgirl, but this event cinched the deal apparently. She literally got back on her feet and went to meet crime head on. Her inner dialogue shows that she isn't indestructible, that she knows she has weaknesses, and that she's ultimately just a girl trying to do good. Her relationships with her father and new roommate are points that I really liked as well. And Momma Gordon showing up? She reacted PERFECTLY. You can't forgive in one day.The villains were pretty awesome. Mirror was a badass with a dark past and went about his revenge in entirely the wrong way. His emotional trauma fueled him in the complete wrong direction, but man was his outfit fucking amazing. As for Gretel: let the trauma ensue as well. Her hypnotic powers are a force to be reckoned with. And with her came a Batman appearance, and he was a gentleman to the max. Totally loved it.Redhead superheroes for the win. This was awesome."}, {"userName": "Sesana", "userReviewDate": "Aug 09, 2012", "userURL": "http://www.goodreads.com/user/show/5172893-sesana", "userReview": "So many mixed feelings here. I wasn't exactly excited about the whole concept. I loved Barbara as Oracle, and I felt like she was, overall, a really positive character. The idea of handwaving her disability away because guys who had crushes on her as Batgirl when they were kids want to erase the last 24 years of her in another role. And I was right, in a way. The end result was to handwave away her disability (she got some sort of surgery somewhere or other, and it happened long before the first issue) and seemingly erase years of character development, some of which Simone herself did. But that's what they did, and we obviously have to live with it.The thing is... Simone did a really, really good job with what she was handed. She was given a younger Barbara who'd never (as far as I can tell) had the experience of being Oracle, and she writes her admirably. The best thing that I spotted about Babs is her sheer joy at being Batgirl again. On the other hand, the two villains are just completely uninteresting. We'll probably never see them again, because they're dull. Simone handles them about as well as she could, but the concepts just aren't there. Babs needs better villains (maybe she could borrow Batman's Rogues. There's enough of them, after all) to make a real go of her book."}, {"userName": "Michelle Cristiani", "userReviewDate": "Feb 23, 2013", "userURL": "http://www.goodreads.com/user/show/1135369-michelle-cristiani", "userReview": "Barbara Gordon is (and always was, really), easy to like. She's chatty, and would be a fun buddy. So why am I stopping at 3 stars? I don't think Batgirl as a character has the gravitas to hold up on her own. The very best parts of this are when Batgirl is with another hero. The section with Nightwing is poetic and touching, and the section where she guards Bruce Wayne is brilliant. When she's alone she lacks gravitas. This isn't really Simone's fault: she does as well as anyone could have.My other critique is that Batgirl always seems airhead-like. This used to be acceptable, but is especially hard to take given Gordon's run as Oracle, where you rarely saw her smile and her lines were serious and few. To have her jump back into bouncy and chatty seems a disconnect. This one I think is Simone's fault. (Maybe DC told her to keep it all light and rainbows, though - you never know.) All we see of Gordon's former skills is a little computer tracking here and there, and passing references to her smarts. Simone wove a great tale but I'm not seeing Babs as the sum of her parts here. Doesn't mean I won't keep reading it, though. It's fun. I just was hoping for something a little deeper, given the character's history."}, {"userName": "Donovan", "userReviewDate": "Jul 05, 2015", "userURL": "http://www.goodreads.com/user/show/27218681-donovan", "userReview": "Who is Batgirl? Babs Gordon takes a gutshot from Joker which lands her in a wheelchair. This is the story of her fighting demons and getting out of the chair to return the favor. Like Batman but with hope, Batgirl wants revenge and to just change the world. Gail Simone writes Batgirl with grit, humor and heart. She is a light in the darkness, hope to despair, triumph to tragedy. If you need some optimism after a solo Batman binge, try this on."}, {"userName": "Nicole", "userReviewDate": "Mar 28, 2013", "userURL": "http://www.goodreads.com/user/show/163750-nicole", "userReview": "My first Batgirl story and the first time I’ve read a superhero graphic novel written by a woman. It’s nice to get an authentic female point of view in such a story for a change. The plot threads were quite good; there was a lot stuffed in there. I liked how Barbara was able to go toe-to-toe with her friends Nightwing and Batman and how she wanted to prove herself on her own without relying on them to rescue her. She’s tough; but she’s still vulnerable, both in terms of her recovery from the gunshot wound that left her paralyzed and in terms of having realistic emotional issues she’s working through on several levels.The art was also high quality, with lots of wonderful realistic detail. Plus, there’s the depiction of a woman who has a reasonable figure (instead of having breasts that look like a pair of surgically implanted volleyballs), has her vulnerable skin covered when she’s in action, and has functional heels on her boots. And--finally!--a writer who has Nightwing (formerly Robin the Boy Wonder) go by Richard instead of that other awful nickname. Although I’m not too keen on people calling Barbara “Babs”, but at least that doesn’t happen too often.I definitely want to see where else Barbara's story will go."}, {"userName": "Miguel", "userReviewDate": "Jan 06, 2015", "userURL": "http://www.goodreads.com/user/show/21499193-miguel", "userReview": "Amazing!!! Super \"dark\" and deep! With a lot f twists and wtf moments (good moments)!!! AMAZING!!! Love Barbara!"}, {"userName": "Khurram", "userReviewDate": "Jun 14, 2017", "userURL": "http://www.goodreads.com/user/show/25493797-khurram", "userReview": "Good story, great are work. I became a fan of Ardian Syaf's art work from his work in Superman Earth One vol 3, and the Batman Superman recent issues. His art work every bit as good here.Barbara Gorgon is back as Batgirl. This is not a complete reboot in the new 52. The events of the Killing Joke did happen. The Joker did shoot her in the spine, she was wheelchair bound for a number of year. Now finally through a mix of physiotherapy and an experimental new surgery she is back on her feet. However the psychological effects of her ordeal are still very much present. I like the contradictory thoughts that go through he head in the middle of a fight, but outwards she has the make jokes and quips to project confidence she does not feel.She also has come back with something to prove to herself, and her closest colleagues. There is a good side trip story of her and Nightwing. Batman makes a guest appearance in the last story (final 2 issues), but he lets this stay Barbara's stroy. The title is well named because as Barbara is making her own comeback she is facing 2 villains who were one heroic people in their own right, but their own violent traumas have turned them bad. The only reason I did not give this 5 stars is because I felt things in Barbara's personal life were a bit rushed. However a really did enjoy the series and am looking forward to the next volume."}, {"userName": "Peter Derk", "userReviewDate": "Dec 13, 2012", "userURL": "http://www.goodreads.com/user/show/2007216-peter-derk", "userReview": "Batgirl is unparalyzed. Apparently by some weird surgical procedure done in South America or something (South America being the home of revolutions in surgical science). I'm fine with that. I can live with that. Let's face it, there was a period in the 90's when it seemed like every lineup of buddies in a comic or cartoon included a guy in a wheelchair, right? Which was alright, but they seemed to always be making the point that people in wheelchairs could do everything everyone else could do. Which I hated. Because it's just not true. I'm not trying to be an ass, and I think people in wheelchairs probably have a very good chance to make great, fulfilling lives for themselves. But to pretend that being in a wheelchair doesn't change a lot about a person seems pretty stupid. One thing someone in a wheelchair can't do is be Batman. Unless the 90's television show Mantis is to be believed (http://en.wikipedia.org/wiki/M.A.N.T.I.S.). I think maybe we're past the point of pretending that everyone is the same, and maybe moving onto something else where we say people are different but of equal baseline value. So thumbs-up there.On to more related topics.A friend once told me she doesn't like when female superheroes are just lady versions of existing male superheroes. Why have Spider-Woman instead of just something new? Why can't a lady become an established thing of her own instead of being the girl version of something else?Batgirl, to me, will always be a sort of lesser version of Batman. Less interesting. Less exciting. Less dangerous. And I don't think it's because she's female. Not at all. I honestly think it's because instead of taking the time to come up with something new, they made a girl Batman. Also, in this slim volume there were two incidents where Batgirl pointed out a little guilt for eating muffins. I mean, if you're beating the holy bejeezus out of people in alleys all night, I'm sure the extra carbs will do you very little harm, lady. I guess that's my thing, my stitch with this sort of thing. Batman doesn't give a hot damn about carbs. Not because he's a man, though. Because he's Batman and driven by a desire to stop crime in all its forms and ultimately avenge the death of his parents, a quest that he will sadly never complete. So he worries about the Joker breaking out, or someone blowing up the Batmobile, or the identity of a new billionaire who seems to have sinister motives. Not having a second muffin.I don't think Batgirl caring about carbs is about her being a woman, either. I mean, yes, it's a quick signifier of what we think of as femininity in a very easy sense. \"Carbs, am I right, ladies?\" But to me, it's a problem because it expresses a lot more than that. To me, it expresses that this character seems to have very little to worry about, very little to do, and not much excitement. Which makes for a great, happy person, and kind of a boring comic book."}, {"userName": "Chris Lemmerman", "userReviewDate": "Feb 20, 2015", "userURL": "http://www.goodreads.com/user/show/7530649-chris-lemmerman", "userReview": "Gail Simone proved that she can write Barbara Gordon for years in Birds of Prey, so she's the obvious fit for the Batgirl New 52 series. Of course, this is a slightly different Batgirl than before, having now survived and recovered from her attack by the Joker made famous in the Killing Joke, and she now has a new lease on life as she returns to crime fighting.The uncertainty in Barbara's narrative shines through, as does her optimism about the future, although her doubts about herself are also ever present. She feels like a complete character, rather than just another face in a Bat-suit. Her supporting cast are also well fleshed out. Her new roommate manages to establish a lot about herself in a short space of time, and both Barbara Gordon Snr. and Commissioner Gordon are well handled too.The villains that Barbara battles really embody the theme of 'The Darkest Reflection', taking aspects of herself and warping them, showing how Batgirl's life could have gone ever so wrong if she was a different type of person. The Mirror story is possibly a little too long, and the Gretel one not long enough, but the overall storyline lands pretty well, and feels like good groundwork going forward.Ardian Syaf's art is bright and clear, although he struggles with Batgirl's acrobatics at points, contorting her legs in particular in some I'm-sure-are-physically-impossible poses, but for the most part works very well. The extra pencils by inker Vincente Cifuentes in the later two issues gel well with Syaf to the point you'll barely notice the difference."}, {"userName": "Rachel", "userReviewDate": "Nov 17, 2015", "userURL": "http://www.goodreads.com/user/show/30786235-rachel", "userReview": "I devoured this story, enjoying every detail on characters I've wanted to read but never had access too. Only hope my school library brings in more.We had Barbara Gordon as Batgirl after being shot by the Joker, miraculously able to walk after being in a wheelchair. She returns as Batgirl, vulnerability and unsureness in situations showing her transition from trauma to a hero. We had a adorable scene with Nightwing and after all their fun she says she wants to fight independently and he understands. Batman as both egos played a part; especially in respecting Barbara's opinion and helping her growth. I thoroughly enjoyed this and will definitely read more Batgirl."}, {"userName": "Elilith", "userReviewDate": "Sep 13, 2015", "userURL": "http://www.goodreads.com/user/show/31052139-elilith", "userReview": "Para poder leer la Batgirl del 2015 y entenderla he tenido que ir a los tomos anteriores del 2011 y estoy muy contenta de haberlo hecho. Este primer tomo es brutal y tenía muchísimas ganas de cogerlo entre mis manos. Ha sido una primera toma de contacto con el universo DC estupenda y estoy deseando leer los tomos que me quedan! :)"}, {"userName": "Anna (Curiosity comes before Kay)", "userReviewDate": "Oct 26, 2014", "userURL": "http://www.goodreads.com/user/show/4846819-anna-curiosity-comes-before-kay", "userReview": "Really enjoyed reading Barbara Gordon's story! Kept hearing things about how great this was and it is definitely one of the best New 52s I've read so far. Full review to come."}, {"userName": "Angie", "userReviewDate": "Jan 10, 2015", "userURL": "http://www.goodreads.com/user/show/1120393-angie", "userReview": "Part of my 2015 goal to read something by every author I'm following on Twitter."}], "description": "As a part of the acclaimed DC Comics—The New 52 event of September 2011, Barbara Gordon is finally back as Batgirl!The nightmare-inducing brute known as Mirror is destroying the lives of Gotham City citizens seemingly at random. Will Barbara be able to survive her explosive confrontation with this new villain, as well as facing dark secrets from her past? A new chapter in the riveting adventures of Batgirl continue in stunning fashion, with script by fan-favorite Gail Simone and stellar art by superstar Ardian Syaf!This volume collects issues 1-6 of Batgirl, part of the DC Comics—The New 52 event.", "title": "Batgirl, Vol. 1: The Darkest Reflection\n      \n          (Batgirl (2011) #1)", "url": "http://www.goodreads.com/book/show/13228436-batgirl-vol-1", "average": 3.95, "cover": "https://images.gr-assets.com/books/1361895856l/13228436.jpg", "reviews": 606, "authors": [{"url": "https://www.goodreads.com/author/show/45103.Gail_Simone", "name": "Gail Simone"}, {"url": "https://www.goodreads.com/author/show/1186079.Ardian_Syaf", "name": "Ardian Syaf"}, {"url": "https://www.goodreads.com/author/show/4608379.Vicente_Cifuentes", "name": "Vicente Cifuentes"}], "type": ["Sequential Art", "Sequential Art", "Superheroes", "Comics", "Graphic Novels Comics"], "outlinks": ["http://www.goodreads.com/book/show/13228436-batgirl-vol-1", "http://www.goodreads.com/book/show/15798403-batgirl-volume-1", "http://www.goodreads.com/book/show/15798408-batgirl-vol-2", "http://www.goodreads.com/book/show/17671934-batgirl-vol-3", "http://www.goodreads.com/book/show/353701.Villains_United", "http://www.goodreads.com/book/show/18404437-batgirl-vol-4", "http://www.goodreads.com/book/show/9898038-birds-of-prey-volume-1"]}