{"ratings": 4412, "userreviews": [{"userName": "Daniel", "userReviewDate": "Apr 06, 2009", "userURL": "http://www.goodreads.com/user/show/4695-daniel", "userReview": "Holy crap, Dorothea Brande, why the hell is your book almost completely forgotten?I give \"Becoming a Writer\" five stars not because it's the most amazing book ever written -- it is, after all, an instructional book, and as such has its limits -- but because it feels almost like it was written yesterday, not 75 years ago, when it actually was published. More importantly, it far surpasses even the most famous and best-loved books on writing that have come since. I couldn't bring myself to finish Natalie Goldberg's \"Writing Down the Bones\" from 1986, and found Anne Lamott's \"Bird by Bird\" from 1994 flawed but better; Brande's 1934 manual, however, easily blows them both away.Brande's genius is that she doesn't really care whether you're talented or publishable, what kind of material you want to write, or whether writing is, in and of itself, an important activity. All she cares about is that, if you're reading her book, you want to write, and she's going to show you how to do it. And she doesn't mince words: Becoming a writer, she makes clear, requires strict discipline and continuous practice.As I haven't tried her techniques yet, I can't speak to how successful they will be for me, but they certainly appear sound: forcing yourself to write on a strict schedule, in various frames of mind, and without giving yourself any excuses. And I love the passage that ends the \"Writing on Schedule\" chapter: \"Right here I should like to sound the solemnest word of warning that you will find in this book: If you fail repeatedly at this exercise, give up writing. Your resistance is actually greater than your desire to write, and you may as well find some other outlet for your energy early as late.\" See what I mean about Brande not mincing words? Even with pages and pages devoted to the writer getting in touch with his unconscious mind, there's nothing namby-pamby about \"Becoming a Writer.\"A reader of Brande's book may quarrel with my assertion that it feels like it was written yesterday, as there are several passages that discuss using a typewriter. But any publisher who wanted to modernize this book -- and I'm certainly not suggesting such be done -- could easily replace the word typewriter with computer (and the words portable typewriter with laptop), and the meaning would be unchanged. Brande also doesn't write at length on the topic.As a side note, you have to give Brande credit in her passing mentions of then-contemporary authors. She somehow was able to name-drop writers who, almost without exception, continue to be read today: Wharton, Hemingway, Forster, Wodehouse, Woolf and Ford Maddox Ford among them. Granted, those writers all were quite famous in their day, but so were many others who are no longer read. (OK, I did have to look up who Kathleen Norris was, but she's the exception.)By the way, if you read the reprint of Brande's book with a foreword by John Gardner, it's completely skippable. Gardner may have had noteworthy things to say about the art of writing elsewhere, but here he doesn't add much, I'm sorry to say. No matter: \"Becoming a Writer\" needs no introduction, and its readers should just dive right in."}, {"userName": "Joselito Honestly and Brilliantly", "userReviewDate": "Jun 03, 2015", "userURL": "http://www.goodreads.com/user/show/2190636-joselito-honestly-and-brilliantly", "userReview": "I read this classic, first published in 1934, thinking it might be able to help me write well. Instead, it merely showed me why I am not a writer. Why I cannot be a writer. Why I've stopped writing reviews here at goodreads and why I have plenty of books which I've finished reading and now find difficult to write reviews of, partly because I've lost my immediate impressions about them together with whatever it was which had kept my interest alive while reading them.How many times have I heard that in order to write well one must be a reader? This book, however, says that reading can be bad for the writing craft. It even prescribes an exercise where one is told to wake up half an hour, or a full hour, earlier than he customarily rises in the morning and, without talking, reading or doing anything else at all, just WRITE. Write about anything and whatever comes to mind. For Dorothea Brande says that it is, at this time, in the twilight zone between sleep and full waking state, \"when the unconscious is in the ascendant\" that one can reap the full benefit of the \"richness of the unconscious.\" She says that the root of genius is the unconscious.But I have never written anything in the wee hours of the morning. Not anything before breakfast. When I am unconscious I am out. When I am awake I am not unconscious. I grab anything I can read (usually the book I've been reading the night before) upon waking up; I read before, during and after breakfast, inside the toilet, inside the car on my way to work during heavy traffic. Every single day I've never missed reading something. Worse, I've been led to believe that writers are born, not made, and that the great writers I've known were geniuses who had been gifted with this rare ability to write well with ease and spontaneity. Not true, Brande says. Anyone can write and genius can be taught and learned, and that it is precisely the belief to the contrary that stifles and kills one's innate ability to weave magic through the written word.I also never reread. We should, Brande says. To learn from the great masters one must read their works once for pleasure and then reread them again, this time with a critical eye so we can see more clearly their beautiful creative patterns. Of course she made no advice to those similarly situated like me with a mountain of unread books all equally demanding my attention, silently mocking me daily with the thought that I've wasted good money acquiring them, what with this certainty that I will never be able to read them all even if I reach the age of 150 with a good eyesight.I have not learned \"to see again\" (\"Learning to See Again,\" Chapter 11). I have submitted myself spinelessly to this \"dullness of apprehension\" which the author labelled as \"a real danger to a writer.\" I need to hold my restless mind still, but it refuses to be pinned down to silence and immobility. My everyday concerns and pleasures are like antagonistic cheerleaders distracting my writing mind.Besides, reading is much easier than writing. And I am busy. So except for this, an attempt to explain, I have ceased to write."}, {"userName": "Jeanette  \"Astute Crabbist\"", "userReviewDate": "Feb 08, 2012", "userURL": "http://www.goodreads.com/user/show/796425-jeanette-astute-crabbist", "userReview": "Four stars for content, and the fifth star for renewal of hope."}, {"userName": "Stuart Aken", "userReviewDate": "Nov 09, 2011", "userURL": "http://www.goodreads.com/user/show/4176122-stuart-aken", "userReview": "On 13 September, I posted a piece on the difficulties that often beset writers on my blog. In that post I mentioned Dorothea Brande’s excellent book, Becoming a Writer, and, having discovered I had never actually reviewed this seminal work, promised I would do so. I re-read the book, and here’s that review.As budding writers, we’re all faced with a bewildering panoply of books on the techniques of the craft. As beginners, this huge bulk of work on how to perform the miracle many of us see as writing, can seem very daunting. So, why am I bringing to your attention yet another book, causing you further anxiety of deciding in which of the hundreds of volumes you should invest your valuable time and energy, let alone money? Well, let me first say that this attempt to persuade you of the value of this book isn’t aimed only at beginners. Well established, experienced authors will also benefit from the words of wisdom contained within this relatively slim volume.The first clue is in the title. Becoming a Writer isn’t a technical manual. It’s not a guide to grammar, style or subject choice, genre, presentation or any of the many other, often contradictory aspects of writing that are shoved relentlessly at beginning writers. This, if at all possible, is the book you should read before you even contemplate immersion in the techniques of the trade. If that moment has already passed, worry not. I’d read dozens of technical books on the craft before I happened upon this wonderful book in the late 80s. But I wish I had come upon it at the very start. So much time and energy would’ve been saved and so much misunderstanding would’ve been avoided.As Dorothea states so eloquently at the start of her encouragement to writers, we are all told, repeatedly, by books, lecturers, course leaders, and many others in the writing trade, that ‘genius cannot be taught’. Here, however, is a writer who exposes this lie and provides practical exercises aimed at discovering and freeing your own inner genius.A word of warning: if you wish to continue your life believing yourself a writer without putting that possibility to the test, do NOT read this book. If you see writing as some sort of dilettante occupation involving no real work, DON’T read this book. Once she’s explained the lies behind the discouragement of so many of the writing trade’s so-called experts regarding the ‘magic’ of writing, she presents her readers with a hard choice. If, having attempted her initial exercises, you discover you’re incapable of following her advice, she suggests you take up some other career and leave writing to those who take it as the serious lifestyle it must be if anything worthwhile is to come from your scribbling.This isn’t simply a book. In order to gain anything from reading it, the reader is required to undertake certain exercises. Initially, some of these may seem arbitrary, meaningless, pedantic, even a little odd. But, and I speak from experience, perseverance will pay out in spades. As a direct result of reading this book and following the advice, I’m now able to write anywhere, under any conditions, and turn out the germ of a worthwhile story more or less at will at one sitting. I believe that to be an aim worthy of effort. If you think there’s no chance of you ever achieving this level, read this book before you either give up writing or face the rest of your life in a state of dissatisfaction where your hopes have no chance of fulfilment.I’m not going to attempt to provide a synopsis of the book. But I will quote a short statement taken from the back of the copy I picked up, second hand, for less than the price of a coffee. ‘Becoming a Writer…is unique and genuinely inspirational. She (Dorothea Brande) believes there is such a thing as the writer’s magic, that everybody has it in differing degrees and that it can be taught. This book is about freeing that unconscious ability in all of us.’Both John Braine, who wrote the foreword of the edition I have, and Ted Willis have words of praise for the book. Braine claiming that it is ‘…the only book about writing which has been of practical help to me…’ And Willis describing it as ‘…the best book on creative writing and the process of creative writing that I think I have ever read…’So, if you’re looking for a ready guide to discovering and utilising your innate abilities as a writer, and you’re prepared to put in the work required, this is the book for you. If, on the other hand, you’re only playing with the idea of becoming a writer, this is also the book for you; for it will confirm your lack of seriousness and perhaps persuade you to try something more suited to your personality.I recommend it unreservedly to all those who take seriously the complex, wonderful, frustrating, creative, stimulating and rewarding art and craft of writing."}, {"userName": "Kressel Housman", "userReviewDate": "Apr 02, 2008", "userURL": "http://www.goodreads.com/user/show/575806-kressel-housman", "userReview": "Without exception, this is my very favorite book on writing. More than craft, it’s about psychology – the psychology of the artistic mind. Dorothea Brande breaks down the creative process into two parts: the unconscious or imagination, and the conscious or inner editor. When you see the stereotypical “temperamental artist,” she explains, what you are seeing is an artist whose conscious and unconscious are at war with each other. When artists get themselves in balance, both their writing and their other responsibilities fall into place.When I first read this book, my writing life was way out of balance, so this was a life-changer. And now that I’ve written this review, I think it’s time to re-read Becoming A Writer. I’m looking forward to it immensely. I know it can only bring positive change into my life."}, {"userName": "Brent", "userReviewDate": "Jul 03, 2017", "userURL": "http://www.goodreads.com/user/show/3742957-brent", "userReview": "Recommended by Bradbury in Zen in the Art of Writing, this has some interesting ideas on respecting and working with your creative unconscious."}, {"userName": "Hanan Al Thawadi", "userReviewDate": "Apr 16, 2016", "userURL": "http://www.goodreads.com/user/show/44116634-hanan-al-thawadi", "userReview": "كتاب لياقات الكاتبللكاتبة : دوروثي برانديترجمة : فريق ضاد\\ غزة عدد الصفحات : 156الناشر : دار كلمات للنشر والتوزيع \" الطبعة الثانية \"بدأت بقراءة الكتاب وأنا في اعتقادي انه سيكون على شاكلة الكتب السابقة التي قرأتها عن فن الكتابة الابداعية ولكنني اكتشفت أن هذا الكتاب يحمل بين طياته افكارا أبداعية محفزة لأولئك الذين تستهويهم الكتابة ويريدون الولوج إلى ذلك العالم الشاسع من أبوابه الصحيحة .وكما وعد مترجم الكتاب في نهاية مقدمة المترجم انه كل من سيقرأ الكتاب سيتذكره كعلامة فارقة في مسيرته الكتابية وانه لن يكون ذات الشخص بعد قراءته.وأنا اضم صوتي للمترجم ، إذ أنني خرجت بعد قراءته وكأنني شخص آخر قد تفتحت مداركه على أمورا عديدة في مجال الكتابة الابداعية .يضم الكتاب محاور عدة منها :--\tالصعوبات التي تواجه الكتّاب الجدد -\tتكوين مزاج الكاتب-\tمستنقع اليأس -\tأحلام اليقظة-\tعن المحاكاة -\tاستراحة الكاتبوغيرها الكثير ولكن اهمها تلك التمارين التي من خلالها تستطيع أن تطوع شعورك الباطني \" اللاوعي \" على إدرار الكلمات دون جهد بشرط أن تؤديها بصرامة وتلتزم بها التزاما مميتا إلى أن تكتب بطلاقة ووقت ما تشاء .وفي ختام الكتاب هناك بعض الإرشادات والمراجع التي تحث الكاتبة دوروثي براندي على ان تتواجد عند كل كاتب مبتدأ فتقول : يجب أن يحتوي الجزء الأكبر من مكتبتك على الأعمال الكلاسيكية ، وحاول أن تقلص وبشكل كبير من الكتب المعاصرة \" أي الكتب التي كتبت في آخر عشرين سنة \" وتأكد أنه كلما باعدت بينك وبين الموضات المعاصرة كلما قويت مناعتك ضدها أي استطعت أن تكتب بأصالة وصدق دون محاكاة .الخلاصة : كتاب قيّم ومفيد جدا للكتّاب المبتدأين وهو بمثابة دورة تدريبية مكثفة . وبما أنني من محبي الكتابة سوف تكون لي مع الكتاب قراءة ثانية متأنية وبشكل مفصل ودقيق.مراجعة : حنان محمد الذوادي التاريخ : 07 مايو 2016م"}, {"userName": "Rania", "userReviewDate": "May 11, 2016", "userURL": "http://www.goodreads.com/user/show/13779475-rania", "userReview": "الكتاب في الحقيقة موجه لفئة الكتاب الناشئين لأن كل ما يتضمنه هذا الكتاب يعرفه الكتاب المتمرسين في عملية الكتابة. الكتاب يضع قدمك على أول طريق الكتابة، يوضح لك نقاط لن تكتسبها إلا بالخبرة وكثرة الكتابة والإطلاع. لكن في النهاية يمكنك وضعها نصب عينيك وأنت تقدم على عملية الكتابة.الكتاب يتضمن تمارين تفيد الكاتب الناشئ. أعجبني فصل استراحة الكاتب. في نهاية الكتاب ستجد العديد من المراجع التي تفيد الكتاب بشكلٍ عام في الكتابة."}, {"userName": "Sharon", "userReviewDate": "Dec 01, 2010", "userURL": "http://www.goodreads.com/user/show/4455752-sharon", "userReview": "This is a duplicate, slightly revised, of the Amazon review I wrote back in 2001. It's actually the top-rated review there. (Edited to add: I have just discovered that Amazon has removed that review! No idea why.)Becoming a Writer is unlike any other writing book on the market today. As Brande says in the introduction, even then, back in 1934, there were several books on writing, and most of them are about the basic rules of storytelling, organisational problems, and so on. This book is different. You will find nothing about plot, dialogue, structure, beginnings, endings here. Nothing about the actual nuts and bolts of writing.Instead, Brande is trying to reach the writer who is not yet sure he/she is a writer. The shy, insecure artist who believes that somehow there is a magic to writing, a magic that other, successful writers have and which has somehow eluded him. And who desperately longs to find a key to that magic.This book provides that key.Brande talks about the artistic temperament, and the need to cultivate spontaneity, and innocence of eye, as well as the ability to respond freshly and quickly to new scenes, and to old scenes as though they were new, and to see \"traits and characteristics as though each were new-minted from the hand of God\". Stories, Brande says, are formed in the unconscious mind, which must flow freely and richly, bringing at demand all the\" treasures of memory, all the emotions, scenes, incidents, intimations of character and relationship\" which is stored away beyond our awareness.In a nutshell, this book is about tapping that rich store in the unconscious mind.These days there are all kinds of workshops and books about creativity, tapping the unconscious, using meditation to reach the inner artist, and so on. In fact, any writer who has dabbled a little bit in the so-called \"spiritual arts\" would be capable of putting together a how-to treatise on writing, painting, dancing, or any other form of creativity, a how-to-do book on writing just by filling it with Buddhist sound-bites.The thing about Brande is that she said it first, and said it best. This book is pioneer work; in 1934 George Harrison had not yet gone to India to set off the boom in meditation, and we were not yet informed on the validity of \"right-brained\" thinking.Brande describes convincingly the interplay between the unconscious and the conscious mind, for the latter does have a role to play in he process or writing. The unconscious, says Brande, is shy, elusive, and unwieldy, \"but it is possible to learn to tap it at will, and even to direct it.\" The conscious mind, on the other hand, is \"meddlesome, opinionated, and arrogant, but it can be made subservient to the inborn talent through training.\" What wonderful, inspiring words! What courage they installed in me, when I first read them!The rest of the book tells us how, exactly, to tap the wealth of the unconscious mind. She provides exercises and practical examples of what can be done to get the those buried stories richly flowing. She plants that seed of knowledge in your soul which will tell you \"This is it\", and will catapult you - as if by magic! - out of the slough of despond and into the actual work of a writer.I read this book in 1981, at a time when I never dared dream of writing a complete novel. Immediately after reading it I began the exercises. They helped. Then I began to write my first novel. What more can I say, except that Brande's advice works. In the years 1999 to 2004, my three novels Of Marriageable Age, Peacocks Dancing, and The Speech of Angels were published.Those three books were followed by ten years in which nothing was published, but I still write on, still following Brande's \"method\". In 2014, a new publisher, Bookouture, republished Of Marriageable Age. In January 2015, a new book, The Small Fortune of Dorothea Q was published, and at the time of writing, The Secret Life of Winnie X is going through its last edits, to be published in July 2015. I have a couple more unpublished novels, plus, of course, Sons of Gods, a new version of the Mahabharata. Without Brande I doubt I would ever have started."}, {"userName": "Rose", "userReviewDate": "Dec 08, 2007", "userURL": "http://www.goodreads.com/user/show/581125-rose", "userReview": "Long before Julia Cameron gave budding artists a creative kickstart with \"The Artist's Way\", Dorothea Brande was coaxing aspiring writers out of self-imposed dry spells, first with her creative writing classes and finally with \"Becoming A Writer\", which is a Cliff Notes version of the practical lessons she presented to one roomful of disillusioned students after another during the 1920s. \"Becoming a Writer\" was originally published in 1934. Long before introspection became the norm in our society, Ms. Brande addressed the fears and frustrations that prevent writers from maximizing their true potential. She proposed a series of exercises to get one's creative mechanisms in gear and make the act of writing so automatic that self-censorship loses its hold. She scorned the adage that where writing was concerned, \"true genius can't be taught\", elevating the hopes of her students and the hackles of the existing literary community, which (figuratively) shot interlopers on sight. By encouraging the use of daily writing, regular exercise, and heavy doses of reading as the means of unlocking creative power, Ms Brande probably saved many new authors from seeking inspiration in a bottle of bathtub gin. It's a small book, and the content is sparse compared to the huge volumes that occupy the shelves in the Writers and Writing sections of bookstores, but in the case of \"Becoming A Writer\", a little says a lot."}, {"userName": "محمود راضي", "userReviewDate": "May 30, 2016", "userURL": "http://www.goodreads.com/user/show/4725851", "userReview": "كان آخر ما قرأته في مجال الكتابة اﻹبداعية منذ ما يقرب من سبعة أشهر كان (ورشة سيناريو جابرييل جارسيا ماركيز)، والحق أني لم أنل منه القسط الذي يكفيني من الاستفادة حتى مع وجود بعض الجوانب الجيدة به هنا وهناك، لكني شعرت في كثير من اﻷحيان أن أعضاء ورشة ماركيز كانوا يتحدثون مع أنفسهم أكثر من حديثهم مع القاريء المتابع ذاته.وهذه المرة جاء في طريقي كتاب دوروثي براندي هذا بالصدفة، ولم أكن قد سمعت به من قبل، لكنه كتاب هائل ويدخل إلى لب اﻷمر مباشرة بدون أية تعقيدات وبدون أي تنظير فارغ وبدون حتى وعود زائفة، فدوروثي هنا تقدم في كتابها الصغير هذا كم هائل من التمارين التي تهدف في المقام اﻷول لكسر النهر المتجمد الذي يفصل بين الكاتب وعملية الكتابة ذاتها، شيء يماثل تمارين اﻹحماء الضرورية قبيل اﻹقدام على المباراة المرتقبة."}, {"userName": "Eric", "userReviewDate": "Jan 29, 2013", "userURL": "http://www.goodreads.com/user/show/5113724-eric", "userReview": "BECOMING A WRITER is not a writer’s manual in the sense that it will not teach you about plot or grammar or viewpoint. Instead, think of it more as a manual for the artist’s brain. Brande writes about how to confront your fears and doubts, how to get your mind in a place to be productive, and how to balance your inner editor against your inner creative. In other words, this is the book you need to read before you start writing. It’s a great tool for beginners or for those who have been feeling blocked or unproductive lately.Brande begins by discussing the fears, the worries, and the self-imposed limits most beginners put on themselves. I recognized a lot of myself in this early section, so it kept me reading.Brande then moves onto the dual nature of the artist’s brain: the conscious and the unconscious. The bulk of the book is about not only understanding that dual nature, but also positioning yourself to use that duality most effectively. Brande is convinced that only after you get those two halves working together will you produce your best work. And her calm, relaxed tone convinced me of this fact as well.Mind you, this book was first published in 1934. This was before the spread of Transcendental Meditation or other movements. But good advice is good advice. And BECOMING A WRITER is full of great advice, even if it discusses typewriters and stationary stores. After reading it, you will know how to engage your creative side, how and when to call upon that internal editor. You will agree with Brande when she says that your genius is infinite. It’s just a question of accessing it. This book will show you how. It will renew your creativity, and help you remember why creating is worth confronting those fears and insecurities."}, {"userName": "Nesrin  Saad  ", "userReviewDate": "Jan 28, 2017", "userURL": "http://www.goodreads.com/user/show/15572270-nesrin-saad", "userReview": "تقترح عليك دوروثي براندي في هذا الكتاب عدة خطوات و تمارين والتي من شأنها ان تضعك على الطريق نحو الكتابة الأبداعية ، شعرتُ بالملل في البداية و لكن التمارين المدرجة فيه جددت طاقتي و حفزتني على المضي قدماً ، الترجمة جيدة و أختيار فريق ضاد/ غزه كان موفقاً ."}, {"userName": "♥ Ibrahim ♥ ", "userReviewDate": "Jul 04, 2013", "userURL": "http://www.goodreads.com/user/show/1178748-ibrahim", "userReview": "I like especially her chapter 5, Harnessing the Unconscious:Toward Effortless WritingWriting calls on unused muscles and involvessolitude and immobility. There is not much to besaid for the recommendation, so often heard, toserve an apprenticeship to journalism if you intendto write fiction. But a journalist's careerdoes teach two lessons which every writer needsto learn —that it is possible to write for longperiods without fatigue, and that if one pushes onpast the first weariness one finds a reservoir ofunsuspected energy —one reaches the famous\"second wind.\"The typewriter has made the author's waymore rocky than it was in the old days of quill andpen. However convenient the machine may be,there is no doubt about the muscular strain involvedin typewriting; let any author tell you ofrising stiff and aching from a long session.Moreover, there is the distraction set up by the littleclatter of keys, and there is the strain of seeingthe shafts continually dancing against the platen.But it is possible to make either typing or writingby hand second nature, so that muscular strainwill not slow you down or keep you from writing.So if you are to have the full benefit of therichness of the unconscious you must learn towrite easily and smoothly when the unconsciousis in the ascendant.The best way to do this is to rise half an hour, ora full hour, earlier than you customarily rise. Just assoon as you can—and without talking, without readingthe morning's paper, without picking up thebook you laid aside the night before—begin to write.Write anything that comes into your head: lastnight's dream, if you are able to remember it; theactivities of the day before; a conversation, real orimaginary; an examination of conscience. Writeany sort of early morning reverie, rapidly and uncritically.The excellence or ultimate worth ofwhat you write is of no importance yet. As a matter of fact, you will find more value in this materialthan you expect, but your primary purposenow is not to bring forth deathless words, but towrite any words at all which are not pure nonsense.To reiterate, what you are actually doing istraining yourself, in the twilight zone betweensleep and the full waking state, simply to write. Itmakes no difference to the success of this practiceif your paragraphs are amorphous, the thoughtvague or extravagant, the ideas hazy. Forget thatyou have any critical faculty at all; realize that noone need ever see what you are writing unless youchoose to show it. You may, if you can, write in anotebook, sitting up in bed. If you can teach yourselfto use the typewriter in this period, so muchthe better. Write as long as you have free time, oruntil you feel that you have utterly written yourselfout.The next morning begin without rereadingwhat you have already done. Remember: you areto write before you have read at all. The purpose ofthis injunction will become clear later. Now allyou need to concern yourself with is the mere performanceof the exercise."}, {"userName": "لطيفة", "userReviewDate": "Sep 23, 2016", "userURL": "http://www.goodreads.com/user/show/9495667", "userReview": "جيد لكل كاتب ناشئ."}, {"userName": "علي الماجد", "userReviewDate": "May 24, 2017", "userURL": "http://www.goodreads.com/user/show/23958010", "userReview": "نشر لي حتى الان ستة روايات و عشرات القصص القصيرة والمقالات، سألت نفسي ما عسي استفيد من هذا الكتاب المخصص للنشاء او المبتدئينفي الحقيقة ان من يقول ان هذا الكتاب للمبتدئين فقد جانب الحقيقة الكاملة، هو مفيد للمتمرسين بقدر ماهو للمبتدئين و اعتقد فعلا ان الكتاب سيفيد المتمرسين اكثر من المبتدئينهناك شيس غامض وساحر بالكتابة واحيانا يتلاشى هذا السحر لا تستطيع الكتابة رغم ان دماغك يكاد ان ينفجر من كثرة الافكارهنا تفهم كيف تبدأ بطريقة صحيحة و بشجاعةنعم كتبتهاتحتاج الشجاعة لتكتب فالكتاب شجعان لانهم قادرين على مداعبة شياطينهم وتقبيل ملائكتهمالصمت او الغيبوبة الفكرية مهمة جدا ن نعالج دواخلنا وطبقة اللاوعي حتى تنبثق منها الافكار الحرة و تسطرها الاناملالكاتب يكتب بثلاثة عقولالوعي والعبقرية و اللاوعيفهمت الان كيف تتعارك تلك العقول على كتاباتي و اصبحت اقدر قدرة على تنظيم جنودها الكتاب بلاشك مذهل رغم انه ممل في بعض الاجزاء ولكن كل تعليم ممل"}, {"userName": "Carol", "userReviewDate": "Jul 25, 2016", "userURL": "http://www.goodreads.com/user/show/12353805-carol", "userReview": "Ok, can I say how much I liked this book? It has very good advice for beginners at writing, and for those of us who have been going at it alone for more than 10 years, it's amazing to read, from an experienced woman, all the advice she gives to novices, and realising you've been doing exactly that on your own. Sure, with this book I should've gotten to where I am sooner, but thinking back on my journey, I kinda like exploring it on my own terms. It made me happy knowing I've been doing things right, that I'm traveling along the right path. And although I still have much more to cover, I have never been more motivated about my desire to write."}, {"userName": "Kathleen Flynn", "userReviewDate": "Mar 02, 2018", "userURL": "http://www.goodreads.com/user/show/1290013-kathleen-flynn", "userReview": "I know I say this every time, but this is one of the best books I've read about writing. Very interesting ideas about how to work in greater harmony with your unconscious, and harness its power deliberately. We think of the 1930s as being a long time ago (as they are) but in some respects people then had things better figured out."}, {"userName": "Andrew", "userReviewDate": "Mar 21, 2010", "userURL": "http://www.goodreads.com/user/show/1824367-andrew", "userReview": "This is a wonderfully lucid book. I would not hesitate to take writing advice from Dorothea Brande, for the simple reason that her own writing is so elegant and clear. As I was reading, I was reminded of George Orwell’s dictum that good writing should be like a window pane. Brande’s book, written in 1934, is a perfect exemplar. It does not draw attention to itself, but simply communicates the author’s ideas in a clear, pleasing manner.Brande states from the outset that she will not deal with issues of technique. Even in 1934, there were plenty of books and writing courses to give advice on plot, pacing, etc. In any case, her belief is that in most aspiring writers, the problems holding them back are not technical, but psychological. The reason people turn up to workshops and classes and buy endless books is not to learn the craft, but to discover the secret of being a great writer.\"In almost every case he will be disappointed. In the opening lecture, within the first few pages of his book, within a sentence or two of his authors’ symposium, he will be told rather shortly that genius cannot be taught; and there goes his hope glimmering.\"The aspiring writer may not believe that he/she is looking to acquire the secret of a writer’s genius, but that’s really what it is, even if only unconsciously held – an idea that there is some kind of magic about writing. And Brande agrees: “I think there is such a magic, and that it is teachable. This book is all about the writer’s magic.”The rest of the book contains a lot of practical advice on setting schedules, etc., all of which is good. But the part that really stood out for me was her discussion of genius. For her it is not a rare gift owned only by the likes of Shakespeare; rather it’s something that anyone can access, but most people don’t know how to. She says that writers should think of themselves as split personalities: a hard-working, sensible artisan, and a free-spirited, spontaneous, sensitive artist. Both sides must be in balance: too much spontaneity and the writing never gets done; too much sense and the writing gets done but is no good.Having recognised this need for a split personality, it is then important to cultivate the sensitive “unconscious” side even as your workaday self gets you to your desk on time. One idea I loved was not talking about your writing until it is done. This is something I have always done without really knowing why – it just seemed to work better for me that way. Brande’s view is telling a story to friends before writing it down is very dangerous:\"Your unconscious self (which is your wishful part) will not care whether the words you use are written down or talked to the world at large... Afterward you will find yourself disinclined to go with the laborious process of writing that story at full length; unconsciously you will consider it as already done, a twice-told tale.\"In addition, the unconscious is very sensitive to criticism, and the damage done by talking too freely can be severe:\"Send your practical self out into the world to receive suggestions, criticisms or rejections; by all means see to it that it is your prosaic self which reads rejection slips! Criticism and rejection are not personal insults, but your artistic component will not know that. It will quiver and wince and run to cover, and you will have trouble in luring it out again to observe and weave tales and find words for all the thousand shades of feeling which go to make up a story.\"There’s so much other valuable advice in this book that I can’t summarise all of it. In fact, I feel as if I should read this book on a regular basis. So many of the ideas resonated with me, but they’re the sort of thing that are easy to forget when you’re mired in the routine of writing. So this is definitely one to keep on the shelf, and pull out at regular intervals, especially when things are getting tough and inspiration is hard to find."}, {"userName": "Amalia Danciu", "userReviewDate": "Feb 15, 2017", "userURL": "http://www.goodreads.com/user/show/50255354-amalia-danciu", "userReview": "biblia scriitoricească. cu siguranță"}, {"userName": "Anton", "userReviewDate": "Jul 23, 2017", "userURL": "http://www.goodreads.com/user/show/2641050-anton", "userReview": "An accomplished stylist in her own right, Brande hits a rhetorical sweet-spot between sympathetic nurturer and uncompromising drill sergeant. This is a book on overcoming the (many) psychological hurdles to developing a writing life. It's accessible, practical, and inspiring, and now has a permanent place near my writing desk."}, {"userName": "Mohammed Kurdi", "userReviewDate": "Jun 22, 2016", "userURL": "http://www.goodreads.com/user/show/54093833-mohammed-kurdi", "userReview": "لم أشعر بالانتماء إلى هذه الأفكار. أنا على يقين بأن لها صدى كبير عند كثير من القراء و الكتاب وإنه من الظلم بمكان و ليس من حقي الإساءة إليها. الكتابة فن ابداعي، و هذه أقل الحقائق عرضة للغبار بالإضافة إلى أن الكاتب الناجح ساحر بالضرورة، وأرى، وقد تتغير أفكاري قريبا، أن هذه الحقائق ليست بحاجة إلى تفسير. ببساطة، كل منا(كاتب)في مرحلة ما وذلك حالما تتهيأ له روحه وأفكاره بصورة خاصة، لكن استحقاق المسمى يحتاج إلى ما يحتاج من صقل وإرشاد ونقاد وجمهور قراء. ومع أن(الكتابة)تكمن داخل كل منا، وكلنا أصحاب قصص وأفكار تستحق النور إلا أنها لا تُعطى إلا لذلك الذي يبحث عنها تحديدا في داخله.. ما أدراني!"}, {"userName": "James", "userReviewDate": "May 27, 2011", "userURL": "http://www.goodreads.com/user/show/3963686-james", "userReview": "I've loved this book for the last 15 years. First published in the 1930s — it's so outdated that she talks about how you need a portable typewriter — this is hands-down the best book I've ever read on how to write and the only one you'll ever need. Writers write, right?"}, {"userName": "Abrar", "userReviewDate": "Apr 12, 2017", "userURL": "http://www.goodreads.com/user/show/7171207-abrar", "userReview": "الكتاب جيد .. يحتوي على بعض المهارات و الطرق الاساسية للكتابة .. لأي كاتب في بدايات مراحل الكتابة ..بوجد أيضًا بعص التمارين التطبيقية كالمراجعة النقدية للنص ..شعرت قليلًا بعدم تجانس محتويات الفصول في الكتاب .."}, {"userName": "Samah Migdad", "userReviewDate": "Nov 10, 2016", "userURL": "http://www.goodreads.com/user/show/61262462-samah-migdad", "userReview": "كوني مدير فريق ضاد/ غزة، أحب أن أشير إلى أن هذا الكتاب قام بترجمته أحد أعضاء فريق ضاد، عبدالرحمن أبو عابد، وهو كتاب لا أظنّ أن أي هاوٍ للكتابة يستطيع الكتابة كتابة جيّدة ما لم يقرأه. شكرًا للمترجم الذي اختار أن يترجم الكتاب لأهميته."}, {"userName": "Eng.Roudha", "userReviewDate": "Oct 08, 2016", "userURL": "http://www.goodreads.com/user/show/39109020-eng-roudha", "userReview": "09-10-2016"}, {"userName": "Dana.kafri", "userReviewDate": "Aug 24, 2017", "userURL": "http://www.goodreads.com/user/show/38579181-dana-kafri", "userReview": "ممتع وشيّق هو حقاً كما قالوا عنه سيترك فيك أثرا ك أثر الفراشة لا يزول ممتنة لهذ ه الكاتبة على هذه التجربة التي تعلمت منها الكثير"}, {"userName": "C.S. Boag", "userReviewDate": "Mar 12, 2015", "userURL": "http://www.goodreads.com/user/show/22299961-c-s-boag", "userReview": "This is a book that aspiring writers must read to achieve the magic that gets those words on paper.All my life I thought I could do both- live a normal life and write. It's only now that I realise I can't. It is a heady time I am 71.In the last few years I have had five books published, before that it has been journalism and a few short stories. It has taken all this time to realise that writing is a full-time business.I follow Brandt's precepts. I have place set aside for writing, there are no books there and no windows. I go there to write; when I stop writing I leave. In addition, there are two other rooms: a library and a study. The library is no more than a store room for several thousand books. The study is where I read, research and dream and plot- it has windows, three of them all beautiful; a twenty volume dictionary and music.I read Brande a long time ago. She says- and she is right- that you must have dedicated time and place for writing. You must know how to get yourself in the mood for writing, and you must take all you need for the duration- including the all important thermos of coffee.Read this, heed what it says and write."}, {"userName": "Eman", "userReviewDate": "Apr 12, 2017", "userURL": "http://www.goodreads.com/user/show/2670193-eman", "userReview": "المؤلفة في هذا الكتاب لم تضع طرق سحرية أو مستحيلة. عرضت أفكار سهلة التطبيق على سبيل المثال: .الكتابة اليومية، النقد الذاتي، القراءة مرتين (الأولى للمتعة والثانية للنقد)، المُحاكاة، ثق بنفسك.مايدهشني أن بعض الكتابات كالذهب لا تبلى. هذا الكتاب نشر في عام 1934..وكأنه كتب قبل قليل، .هذا الكتاب مُفيد بالدرجة الأولى لمن يحاول أن يكتب قصّة بشخصيات وأحداث وحبكة مُتقنة."}, {"userName": "Elle", "userReviewDate": "Jan 10, 2016", "userURL": "http://www.goodreads.com/user/show/6207865-elle", "userReview": "Not so much a 'how-to' guide; more a 'pep talk' for those of us who want to be more creative but spend so much time being critical of our own ideas that we never get anything down on paper. Good stuff."}], "description": "Refreshingly slim, beautifully written and deliciously elegant, Dorothea Brande's Becoming a Writer remains evergreen decades after it was first written. Brande believed passionately that although people have varying amounts of talent, anyone can write. It's just a question of finding the \"writer's magic\"--a degree of which is in us all. She also insists that writing can be both taught and learned. So she is enraged by the pessimistic authors of so many writing books who rejoice in trying to put off the aspiring writer by constantly stressing how difficult it all is.With close reference to the great writers of her day--Wolfe, Forster, Wharton and so on--Brande gives practical but inspirational advice about finding the right time of day to write and being very self disciplined about it--\"You have decided to write at four o'clock, and at four o'clock you must write.\" She's strong on confidence building and there's a lot about cheating your unconscious which will constantly try to stop you writing by coming up with excuses. Then there are exercises to help you get into the right frame of mind and to build up writing stamina. She also shows how to harness the unconscious, how to fall into the \"artistic coma,\" then how to re-emerge and be your own critic.This is Dorothea Brande's legacy to all those who have ever wanted to express their ideas in written form. A sound, practical, inspirational and charming approach to writing, it fulfills on finding \"the writer's magic.\"", "title": "Becoming a Writer", "url": "http://www.goodreads.com/book/show/76788.Becoming_a_Writer", "average": 4.0, "cover": "https://images.gr-assets.com/books/1421200325l/76788.jpg", "reviews": 320, "authors": [{"url": "https://www.goodreads.com/author/show/43634.Dorothea_Brande", "name": "Dorothea Brande"}, {"url": "https://www.goodreads.com/author/show/481146.John_Gardner", "name": "John Gardner"}], "type": ["Language", "Nonfiction", "Reference"], "outlinks": ["http://www.goodreads.com/book/show/76788.Becoming_a_Writer", "http://www.goodreads.com/book/show/29929360", "http://www.goodreads.com/book/show/19392324-becoming-a-writer", "http://www.goodreads.com/book/show/17707739-wake-up-and-live", "http://www.goodreads.com/book/show/33141863-diventa-scrittore", "http://www.goodreads.com/book/show/35010028-svegliati-e-vivi", "http://www.goodreads.com/book/show/39993690-ab-jetzt-gelingt-s", "http://www.goodreads.com/book/show/39944190-ab-jetzt-gelingt-s"]}