{"ratings": 148, "userreviews": [{"userName": "Elizabeth", "userReviewDate": "Mar 08, 2014", "userURL": "http://www.goodreads.com/user/show/732741-elizabeth", "userReview": "Hämärä, tahmea tunnelma nousee sivuista. Saisio herättää köyhyyden epätoivoisuutta ja väistämätöntä syöksykierrettä fyysisten yksityiskohtien kuvaamisella. Sielun eroosion prosessi kuvataan tuskallisella, selvästi havaitulla proosalla. Pidin siitä, vaikka oli vaikea lukea sen.As a side note, it was easy to follow for a language learner, and it contained a lot of useful new verbs."}, {"userName": "Petteri Hynönen", "userReviewDate": "Apr 21, 2018", "userURL": "http://www.goodreads.com/user/show/36966086-petteri-hyn-nen", "userReview": "Synkkä mutta mestarillinen."}, {"userName": "Samu", "userReviewDate": "Mar 17, 2018", "userURL": "http://www.goodreads.com/user/show/38455364-samu", "userReview": "3,5 tähteä. Mitähän tästä edes sanois. Ihan hirveä kirja todella monella tavalla, samalla myös kuvaava maailmasta, joka on olemassa."}, {"userName": "Joni", "userReviewDate": "Jan 24, 2018", "userURL": "http://www.goodreads.com/user/show/21616619-joni", "userReview": "Ajalleen tyypillinen rosoisempi nuorisojuttu, (tai sitten mieleen tulee joku \"Sairaan kaunis maailma\" 90-luvulta). 70-luvun idealismi on mennyt ja nuoriso ryyppää, räkii ja tekee rikoksia eikä kirjailija anna armoa tai tarjoa sovitusta lopussa. Teksti on dialogivetoista ja tiivistä ja sopii hyvin sovitettavaksi elokuvaksi, jollainen siitä tehtiinkin, mutta vasta vuonna 2016."}, {"userName": "Mikael Kuoppala", "userReviewDate": "Jan 23, 2014", "userURL": "http://www.goodreads.com/user/show/5874853-mikael-kuoppala", "userReview": "Pirkko saision vuonna 1981 kirjoittama tiivis romaani \"Betoniyö\" ei valitettavasti ole koskaan lakannut olemasta ajankohtainen. Kirja kuvaa yhden päivän ja yön tapahtumia kahden veljeksen elämässä. Veljekset ovat Ilkka ja hieman nuorempi Simo. Alkoholisoituvan yksinhuoltajaäidin pojat elävät tyhjää elämää toivottomassa helsinkiläislähiössä. Ilkkaa odottaa kymmenen kuukauden vankilatuomio. Hän herää myöhään kuumana kesäpäivänä ja vaeltelee kaupungissa päämäärättömästi nuoremman veljensä kanssa. Poikien äiti juhlii baarissa ja käskee pojat pois illalla saapuvan miesvieraan tieltä.\"Betoniyön\" vahvinta antia on sen tiheän painostava, unenomainen tunnelma, jota Saision taidokas kieli maalailee vastapainoksi töksähtelevälle, karkealle, mutta luonnolliselle dialogille. Kerronta on dialogipainotteista, mutta lyyrinen proosa kaappa lukijan silti mukaansa houruiseen uneen, joka lopulta muuttaa muotoaan painajaiseksi. Kirjan kuvaama vuorokausi on kuuma, kostea ja täysin pysähtynyt. Pysähtyneenä hautuva lähiö herää henkiin vahvasti, sen olotila ja tunnelma kuvastavat täydellisesti Ilkan ja Simon sisäistä maailmaa.Nuorten syrjäytyminen on yhä kiperiä yhteiskunnallisia kysymyksiä. \"Betoniyö\" on edelleen viiltävän vakuuttava kertomus ilmiön taustoista. Kirjan keskiössä on nuorempi veli Simo, jolle eksyneen isoveljen antama malli avaa harvat toimintaohjeet. Simo on lähestulkoon ontto, vailla identiteettiä ja omia näkemyksiä elämästä. Ja juuri siksi hahmo toimii niin hyvin. Koulusta poisjäänyt Simo on täysin irrallaan ympäristöstään, hänelle välinpitämäöttömyys ei ole valinta vaan koko olemassaolo. Täysin passiivisen ja lähestulkoon puhekyvyttömän, jatkuvasti keskusteluja väärin ymmärtävän teinin sielunmaailman luulisi ärsyttävän, mutta Saisio saa lukijan samastumaan vaikeaan hahmoon todella vahvasti, vaikka kerronta onkin koko ajan toteavaa ja raportoivaa suoran myötäelämisen sijaan.Simon- ja myös nihilistiseen itsetuhoon tuudittautuvan Ilkan- sielunmaisema muistuttaa masennuskuvausten hahmoja. Tulevaisuutta ei ole. Seuraavaa tuntiakaan ei ole. Se ei yksinkertaisesti ole olemassa hahmoille, joiden ei kannata ajatella jokaista hetkeä ja olotilaa pidemmälle. Lukija kokee edessään mustan tyhjän seinän, johon hahmot ovat täysin tottuneet.Romaani on tarinaltaan yksinkertainen ja suoraviivainen, mutta tematiikan selkeys toimii hyvin yhdistettynä mestarilliseen esteettiseen sisältöön. Näin vahvatunnelmaista ja unenomaisuudestaan huolimatta realistista yhteiskuntakuvausta ei kovin usein pääse lukemaan."}, {"userName": "Riku Sarlin", "userReviewDate": "Jun 15, 2015", "userURL": "http://www.goodreads.com/user/show/25179055-riku-sarlin", "userReview": "Saision kirja lienee jonkinlainen kirjallinen merkkitapaus 80-luvulta. Siinä ei oikeastaan taustoiteta kertojan äänellä yhtään, vaan taustat selviävät pikku hiljaa dialogista. Pidin tyylistä. Henkilöt ovat hirveitä nilkkejä, mutta näin varmaan pitää ollakin että saadaan se vähitellen selviävä tausta riittävän kiinnostavaksi. Dialogi on ihan pelkkää puhekieltä, ja varmaan 80-luvun alussa ollut jotain uudehkoa."}, {"userName": "Jenna Kallio", "userReviewDate": "May 15, 2016", "userURL": "http://www.goodreads.com/user/show/47584206-jenna-kallio", "userReview": "En osaa enkä halua sanoa tästä oikein mitään. Muuta kuin että suosittelen tätä ihan jokaiselle luettavaksi."}], "description": "“Betoniyö on kaikkineen komea teos.” - Arto Virtanen, Suomen Sosialidemokraatti 9.10.1981Pirkko Saision julma Betoniyö ilmestyi ensi kerran vuonna 1981. Kolmekymmentä vuotta on kulunut. Yhä Suomen lähiöissä kasvaa nuoria miehiä, joiden tulevaisuus näyttää pelkkää tyhjää. Mitä siitä seuraa?Simo ja Ilkka ovat viinaanmenevän yksinhuoltajaäidin poikia, joista kumpikaan ei ole löytänyt omaa paikkaansa. Ilkka on viimeisiä päiviä vapaana ennen vankilatuomion lankeamista. Simolla on jäänyt keväällä koulu kesken. Veli näyttää miehen mallia, mutta roolimalli ei ole kaksinen. Tapahtumat tiivistyvät yhteen kesäpäivään ja yöhön Helsingissä. Helteinen ilma seisoo. Kumpikin veljeksistä joutuu todistamaan tapahtumia, joita ei haluaisi nähdä. Lopulta Simon sisällä roihahtaa. Pirkko Saisio on kirjailija, joka uudistuu jatkuvasti. Betoniyö on yksi merkkipaalu Saision uralla. Siinä hän omaksuu tyylin, josta jää vahva jälki hänen myöhempiin teoksiinsa. Pelkistetty muoto, symboliikka ja unien kuvaus yhdistettynä iskevään ja aidon kuuloiseen dialogiin on yhä tuttua Saisiota.Uudessa painoksessa on mukana johdanto, joka valottaa Betoniyön aikalaisvastaanottoa ja kirjan suhdetta Saision muuhun tuotantoon.", "title": "Betoniyö", "url": "http://www.goodreads.com/book/show/18752357-betoniy", "average": 3.31, "cover": "https://images.gr-assets.com/books/1383578840l/18752357.jpg", "reviews": 7, "authors": [{"url": "https://www.goodreads.com/author/show/573273.Pirkko_Saisio", "name": "Pirkko Saisio"}], "type": ["Fiction", "Mystery", "European Literature"], "outlinks": ["http://www.goodreads.com/book/show/18752357-betoniy", "http://www.goodreads.com/book/show/1174220.Betoniy_", "http://www.goodreads.com/book/show/2622854-punainen-erokirja", "http://www.goodreads.com/book/show/1174225.Pienin_yhteinen_jaettava", "http://www.goodreads.com/book/show/7543490-el-m-nmeno", "http://www.goodreads.com/book/show/6088780-vastavalo", "http://www.goodreads.com/book/show/32071429-mies-ja-h-nen-asiansa"]}