{"ratings": 81, "userreviews": [{"userName": "Sue", "userReviewDate": "Feb 16, 2017", "userURL": "http://www.goodreads.com/user/show/2829018-sue", "userReview": "Original WritingFascinating story. Very unusual man as the father. Never could have imagined this kind of story. A delight to read. Something to think about for a long time."}], "description": "A unique offer for fans of Amy Bloom, bestselling author of Away...sample just one piece from her stunning new collection of interconnected short stories. Available at this special price for a limited time only.Love, in its many forms and complexities, weaves through New York Times bestselling author Amy Bloom’s astonishing and astute new work. Insightful, sensuous, and heartbreakingly funny, Where the God of Love Hangs Out illuminates the mysteries of love, family, and friendship. In the haunting story Between Here and Here, a daughter reluctantly steps in to take care of the infirm father she hated for so many years. As a tribute to her late mother, and to show that she is a better person than her father, she gives everything she has to this terrible old man and revises history. Between Here and Here and the eleven other stories that comprise Where the God of Love Hangs Out showcase stories of passion and disappointment, life and death, that beautifully capture deep human truths.", "title": "Between Here and Here", "url": "https://www.goodreads.com/book/show/7378831-between-here-and-here", "average": 3.86, "cover": "https://images.gr-assets.com/books/1261444392l/7378831.jpg", "reviews": 1, "authors": [{"url": "https://www.goodreads.com/author/show/115220.Amy_Bloom", "name": "Amy Bloom"}], "type": ["Short Stories", "Literary Fiction"], "outlinks": ["http://www.goodreads.com/book/show/7378831-between-here-and-here", "http://www.goodreads.com/book/show/8179992-between-here-and-here", "http://www.goodreads.com/book/show/18316089-lucky-us", "http://www.goodreads.com/book/show/217086.Away", "http://www.goodreads.com/book/show/35876524-white-houses", "http://www.goodreads.com/book/show/197750.A_Blind_Man_Can_See_How_Much_I_Love_You", "http://www.goodreads.com/book/show/6593575-where-the-god-of-love-hangs-out"]}