{"ratings": 12534, "userreviews": [{"userName": "Tish", "userReviewDate": "Mar 24, 2008", "userURL": "http://www.goodreads.com/user/show/221811-tish", "userReview": "I lived in the small-town South for 15 years. I may not have been born and bred there - but, hey, I've read the Southern Belle Primer; I can use \"y'all\" properly in a sentence; I like my tea sweet & my steak chicken fried. That said, I do get so tired of the whole \"crazy folks\" thing with Southern characters. Must everyone be sooo dang quirky? Really. I've met a few \"characters\" in my time, but the South is not populated entirely with whack-a-do weirdos. In fact, most of us are normal, well-adjusted individuals who are interesting people nonetheless. Maybe, someday, someone will write about some of us."}, {"userName": "Jeansue Libkind", "userReviewDate": "Jun 02, 2008", "userURL": "http://www.goodreads.com/user/show/972925-jeansue-libkind", "userReview": "Jackson says in the first sentence in the book that Between is a real place but she’s never been there. I have. I drove through it regularly in the early 1980s on Route 78 going from Athens to Atlanta. I would always exclaim, “Here we are, in Between.” My teenage son would moan and began to chide me when the town sign came into view, “Don’t say it, Mom.” I saw a row of unpainted houses, their porches complete with sloping roofs and old sofas alongside one side of the highway. Apparently there are several streets behind it and a town square; I regret never turning off and investigating. This is a pretty good novel. No one will mistake it for great literature but no one will go away feeling like they wasted their time. Nonny, the main character, is the link between the Fretts and the Crabtrees whose 30-year feud keeps the entire population (90 in Between) on their toes. Nonny also drifts between her home and Athens, her two disparate lives rarely intertwining and she wavers between her husband and a new direction. Generations of Fretts and Crabtrees show up, throw up, blow up, grow up and generally create mischief. The plot moves quickly and caroms nicely. Must this happen in Between? No, it could be any small town in the world but placing it in Between, Georgia adds zing. Yep, I should have turned off the highway and taken the byways."}, {"userName": "Mauoijenn ~ *Mouthy Jenn* ~", "userReviewDate": "Mar 13, 2015", "userURL": "http://www.goodreads.com/user/show/2569271-mauoijenn-mouthy-jenn", "userReview": "Another great book from Jackson. I was laughing all through out this great story. The characters were hysterical and brought great life to this work. Excellent southern fiction."}, {"userName": "Kim Kaso", "userReviewDate": "Jul 16, 2017", "userURL": "http://www.goodreads.com/user/show/39507342-kim-kaso", "userReview": "I really like Joshilyn Jackson's books. I have read several, my first was an ARC that I won, and I've been working my way backwards since then. This one had a particularly eccentric group of characters and some unusual social situations--apparently based on the author's mother's family from what I read in the afterward--which had the peculiarly small town flavor I remember from my childhood, with a Southern accent. I loved the characters and the relationships, the Southern Gothic aspect of the Dollhouse and Butterfly 🦋 Museum, the family feuds, and I truly loved Nonny and her adorable niece. I liked the way the plot unspooled, with kinks here and there, and no predictable end point. It felt like life...I should get a divorce, but I still have something with this guy, tomorrow is too soon, next week will be better...messy and indecisive, as we can be when life requires changes. I truly loved Mama and Genny and even Bernese...& all of the uproar around the dogs. I looked forward to reading this every night before I fell asleep. Ms. Jackson is a consummate storyteller, prepare to laugh and be emotionally touched by this quirky bunch and their domestic drama. Highly recommended."}, {"userName": "Amanda", "userReviewDate": "Jun 14, 2008", "userURL": "http://www.goodreads.com/user/show/1219253-amanda", "userReview": "An enjoyable, but overall predictable, quick read. I always enjoy Joshilyn Jackson's books, especially this one's take on the rivalries that crop up between Southern families that are only exacerbated by life in a small town. There are some humorous moments, a few twists, and likable characters. Particularly inventive is Jackson's use of a main character, Nonny, who literally finds herself \"between\" the Fretts and the Crabtrees (the ersatz Hatfields and McCoys of the story), as well as the character of Stacia, who raises Nonny as her own. Stacia, who suffers from Usher's Syndrome, was born deaf and progressively loses her eyesight, but that doesn't stop her from being outspoken and independent, as well as an artist and a caring mother. Liked it, but did not love it.Cross posted at This Insignificant Cinder"}, {"userName": "Tania", "userReviewDate": "Dec 28, 2014", "userURL": "http://www.goodreads.com/user/show/6450088-tania", "userReview": "An easyreading novel set in the South. Although not as good as A Grown-Up Kind of Pretty I enjoyed the characters and the story. The perfect read for a rainy day, I alternatively giggled and snivelled in the few hours this charming book took me to read. My only complaint is that I find the characters very similar to her other books, but I think this is probably my fault as I've read three of her books in a very short space of time. I'll wait a few months, but I'll definitely be reading all her books.The Story: In the tiny Georgia hamlet of Between (population: 91), the only news is the seemingly never-ending feud between the Crabtrees and the Fretts. Caught at the crux of the quarrel is Nonny Frett, the biological daughter of impoverished teenager Hazel Crabtree. Soon after her birth, Nonny was left \"on the better side of the tracks\" with the relatively affluent Frett family. Now grown up and badly married, this true \"betweener\" must confront old family conflicts as she negotiates a new life and motherhood."}, {"userName": "Debby", "userReviewDate": "Apr 04, 2009", "userURL": "http://www.goodreads.com/user/show/1394632-debby", "userReview": "Boy am I glad a GR friend (Thanks Sheryl) recommended this author on her profile. Between, Georgia on CD was narrated by the sutor which made the book even more enjoyable. Wonderful characters, very engaging story. I couldn't put it down. I've already reserved her other books from the library. If you like reading Maeve Binchy, Elizabeth Berg, or Lee Smith to name a few, I think you'd like reading Joshilyn Jackson too. I highly recommend Between, Georgia. I'll be starting her 1st book, Gods in Alabama tomorrow!"}, {"userName": "Jael", "userReviewDate": "Jun 27, 2010", "userURL": "http://www.goodreads.com/user/show/3931373-jael", "userReview": "I don’t know about everyone else, but if I like one book by a certain author I’m certain to go back for more. At the end of God’s in Alabama there’s a teaser to Joshilyn Jackson’s second novel Between, Georgia. Ms. Jackson got me again. Nonny Frett came into the world amid turmoil. Her birth mother Hazel Crabtree literally gave her up to the Frett family after giving birth in their living room. Ever since she has been caught between two dueling families. The Fretts and the seemingly crazy Crabtrees control the small town of Between, Georgia. Nonny Frett is raised by her mother Stacia, who is deaf and blind, and her aunt Genny, who is teetering on the edge of insanity. When the granddame of the Crabtree family, the crazy alcoholic Ona, finds out she has a granddaughter there is no peace between the two families. Nonny visits Ona as a young child, but the kibosh is quickly put on that. Ever since Nonny’s aunt Bernese, the head of the Frett family, and Ona trade deadly looks in town. At a moment’s notice Ona can call on her crazy relatives to terrorize the Frett family or better yet sic her dog “The Bitch” (that’s not me using colorful language that is how the dog is referred to in the book!) on Genny.The first chance she gets, Nonny uses her college degree to get out of town. It leads to a career as a sign language interpreter. A failed marriage to the complicated Jonno follows. But if you can’t guess already the turmoil between the two families constantly draws her back home. Everything soon comes to a head for Nonny. Her impending divorce and a family crisis cause Nonny to finally decide what she wants in life.If you haven’t noticed I tend to like books that involve some kind of family strife. I’ve got no answers on that. I can relate more to family matters than the latest sci-fi novel, which I will read some day. The subject matter of Between, Georgia might sound overly dramatic, serious, but Jackson does it with spot-on humor. She explores what it truly means have family and a sense of belonging. Check it out!"}, {"userName": "B.", "userReviewDate": "Jun 23, 2008", "userURL": "http://www.goodreads.com/user/show/182314-b", "userReview": "I found myself laughing out loud when I read this! Every chapter was a new \"chunk\" of drama in Between, Georgia. I love books that are set in the South, especially Georgia since I was born, raised and still live in Georgia. Nonny seemed to always be in a pickle and I was always rooting her on. ~~~***SPOILER***~~~I found myself wanting to slap Nonny silly over her interactions with Jonno. And I definately wanted to choke the life out of Bernese. And I certainly couldn't help but keep my fingers crossed that she would end up with Henry, even if he was a cousin - albeit, a fourth cousin. I also felt my eyes well up over the loss of Stacia's dolls, Genny's dog attack, and the possible loss of Fisher. This book definately kept me guessing. I never expected to be touched emotional in so many different ways. My mouth was either a gaping hole of \"what the hell\", an upturned smile of satisfaction, a quivering lip of despair and sorrow... and I'm pretty sure I scowled a time or two."}, {"userName": "Julie", "userReviewDate": "Dec 07, 2009", "userURL": "http://www.goodreads.com/user/show/1788628-julie", "userReview": "I think someone recommended this book to me ages ago because it was about a woman (with a deaf-blind mom) who was an interpreter. Not that the book is only about that - no way - more layers than a wedding cake, people! But, seriously, there's not too many novels about deaf-blind people, CODAs (Children of Deaf Adults) or interpreters out there, so I gave it a try. Oh, also, my husband said it was awesome, and I like him.Very cool (and fairly accurate) portrayal of the family dynamics when there's a deaf child in the midst. I've honestly never met twins where one is hearing and one is Deaf, but it made for a great story and a handy interpreter. Also, she really does a good job explaining Usher's Syndrome and the independence/capability of most people who are Deaf-blind. I often found myself smiling at all the tactile joke inserted for people who know what it's like to live with someone who's blind/deaf-blind. I loved all the little details about an interpreter's life as well - all the running around, setting a 30 minute wait time for a client, having to work in/move to the bigger cities to be able to make a living while knowing the smaller communities need you just as much.I had the book on CD, and I have to say, that's the way to do this story. The author read it herself - ok, I know sometimes that's disastrous, but she's a former actor, so she was AMAZING! Her voices matched the colourful characters to the letter, and I found myself quoting a lot of the lines later on - one of the ways I use to judge if something is going to be memorable or not.This is one VERY messed up family and main character, but their world is just so quirky and disturbing that you can't look away, and what's worse/better, is that you'll be wanting to tune in again - long after it's over - like one of those reality shows where you have to wait to find out who the babydaddy is, even though these people are TOTAL STRANGERS!Anyway, good book!"}, {"userName": "Ptreick", "userReviewDate": "Mar 20, 2008", "userURL": "http://www.goodreads.com/user/show/1010795-ptreick", "userReview": "I read \"Gods in Alabama\" last fall and found this book to be way too similar. Are all of Jackson's characters cut from the same cookie-cutter pattern? The overbearing female figure, the passive/agressive narrator, the too-good-to-be-true boyfriend that the narrator takes forever to discover. I just don't understand the weak Southern woman she perpetuates in her books... women who sit around not taking action (which is, in itself, taking an action)..."}, {"userName": "Nancy", "userReviewDate": "Jan 02, 2008", "userURL": "http://www.goodreads.com/user/show/441823-nancy", "userReview": "Stopped reading midway through the book when I realized I didn't really care what the characters did or what happened to them. Find it hard to believe that a dog that viciously attacks two women would not have been put down or at least taken away from the owner. Once the plot stretched the limits of believability, reading further became a waste of time."}, {"userName": "Christi", "userReviewDate": "Feb 15, 2008", "userURL": "http://www.goodreads.com/user/show/195949-christi", "userReview": "just didn't ever love this bookit was decent but I wish it focused more on Stacia, her talents, her art, her abilititesinstead we got the story told from the point of view of her daughterI thought the book was leading up to an ending with tragedy that would hammer home to Nonnie what her mother was trying to teacher her: making a decision/taking charge of your life and having something happen to create an outcome for you are not the same thing.I think the book could have been infinitely better if the ending left the main character with a great loss that would have been prevented if she did what needed to be done and made decisions. Instead she lucked out. Tragedy averted. Cue up the Lifetime ending that gives us unlikely happiness as they drive off, literally, into the sunset."}, {"userName": "Alice", "userReviewDate": "Jan 08, 2013", "userURL": "http://www.goodreads.com/user/show/11743159-alice", "userReview": "This is one of those books I found myself enjoying despite the fact that I could never quite pinpoint what I was enjoying about it. I think it may be the characters (they're all so easy to get fond of, in one way or another), and although I'm not left feeling like, \"That was a great book!\", I'm still glad I read it."}, {"userName": "Christa", "userReviewDate": "Jul 17, 2008", "userURL": "http://www.goodreads.com/user/show/261662-christa", "userReview": "I thought that this book was both charming and profoundly moving. Between, Georgia is one of the most enjoyable books I have read lately It was sweet and engrossing, and I couldn't put it down. The main character of this book, Nonny Frett, is the link between two conflicting families in the small town of Between, Georgia. Although a Crabtree by birth, Nonny was raised by Stacia Frett, a warm, caring woman who was born deaf and later became blind. Stacia's two sisters, sweet, neuotic Genny, and domineering, overbearing Bernese, are an intregal part of Nonny's life. When the novel opens, Nonny is only a fews days away from a divorce that she isn't certain she wants. A family crisis that involves the Crabtrees brings Nonny back home to Between, where she has to try to soothe fraying tempers before there is real trouble. While she is trying to stop the hostility between the Frett and Crabtree families, Nonny also has to make some decisions that are significant to her future. Everything comes to a head when Nonny is unable to avert violence between the two families.I thought that this was really a great book. I loved the way the mother-daughter relationship between Stacia and Nonny was portrayed as being so caring and protective. I enjoyed the characters that were part of the Frett and Crabtee families with all of their foibles. There were some unpleasant and disturbing events in the book, but I was satisfied with the way they were handled. Nonny has my admiration for the way in which she had to grow as a person and learn to make and carry out definitive decisions. Reading this book was a pleasant and satisfying experienc."}, {"userName": "Emily", "userReviewDate": "Aug 11, 2011", "userURL": "http://www.goodreads.com/user/show/1353392-emily", "userReview": "Between is the name of the town, geographically between Athens and Atlanta, and between is an excellent descriptor of protagonist Nonny herself. She is between her two families, the one that birthed her and the one that adopted her; the world of the hearing and that of her deaf mother, between one man and another, and between who she is and who she wants to be. Jackson weaves an emotional and hilarious tale with rich characters, a compelling plot and a honeyed writing style which converge to propel this book into favorite-zone. I wholeheartedly enjoyed every moment I spent reading it."}, {"userName": "Carol", "userReviewDate": "Dec 29, 2013", "userURL": "http://www.goodreads.com/user/show/10079019-carol", "userReview": "There is plenty of drama in the small town of Between, Georgia. A place where everyone knows everyone and more. The notorious two families who mirror the Hatfield & McCoys kept the story moving steadily throughout the book. Actually, right from the start. Nonney comes home to Between and finds herself engulfed in the relationships encompassing both families. There were moments of laughter,sadness and joy which kept me yearning for more. I enjoyed how Joshilyn Jackson exposed the strength and fralities of each family."}, {"userName": "Just - The romance reader", "userReviewDate": "Apr 04, 2009", "userURL": "http://www.goodreads.com/user/show/2184659-just---the-romance-reader", "userReview": "Talk about a book full of quirky characters! Reading Between Georgia made me want to hop in my car and travel down to Georgia in search of this little town and it's cast of characters so I could slap a few of them and hug a few of them. I'd especially like to hug that moody and adorable little Fisher. There were a couple little shockers in the book, but I have to say the ending was worth it."}, {"userName": "Rainey", "userReviewDate": "Mar 02, 2017", "userURL": "http://www.goodreads.com/user/show/1209448-rainey", "userReview": "I always enjoy Jackson's books more than I think I will, and I always find joy in the relatable characters. Nonny feels like a friend, someone who grew up where I did and deals with the same kind of crazy I deal with. Watching Nonny grow and deal with a wonky family dynamic and a manipulative ex, I found myself invested and hoping for a happy ending. Jackson builds southern characters like few can."}, {"userName": "Sarah Jamison", "userReviewDate": "Nov 02, 2015", "userURL": "http://www.goodreads.com/user/show/179411-sarah-jamison", "userReview": "Deja vu, y'all. I started this book thinking I'd heard the story already-- scared teenager wears only sweatsuits to conceal a pregnancy. When the baby comes, she goes to the neighbor's house and gives birth on the floor of foyer. Seemed too familar. But I clearly didn't get past that because the rest of details-- pistols, luna moths, baby stealing and Beatrice's poetry from Much Ado About Nothing were new and strange and wonderful. And drew me into a book that made me laugh and rage and cry and then cry some more.Between, Georgia is about Nonny, who lives in Athens, but her whole family is back in Between. Her mama, Stacia, who is deaf and blind and lives with Genny, her twin. Her mama and aunt's other sister, Berneice, lives there too, and helped to deliver Nonny into Stacia's arms on the floor of her foyer surrounded by gunshot-stunned luna moths. Nonny's grandma, Ona Crabtree, lives closeby too, matching Berneice slight for slight in a generations old feud between the Crabtrees and the Fretts. And Nonny's in the middle. Birthed and immediately abandoned by a teenage Crabtree, Stacia Frett claims Nonny and raises her as her own, creating their family with one beautiful story of mother-daughter love after another.That is, until.... And I can't bear to say anything more about it. I want you to read it and experience it. The feud explodes, of course. And what had been a sort of one to one, Berneice versus Ona quid pro quo gets muddled when there are too many extenuating circumstances for one woman to keep track of. Especially when she needs to be in Athens, not Between, because she has got to finally get a divorce.And now I'm going to take on the cliche. I laughed. I gasped. I rocked back and forth and mumbled, \"No no no no.\" I cried, hard, from sadness. And then I cried, hard, with joy. Jackson's world is pretty small-- one town square and a few miles of houses. But her characters are huge, realistically drawn people. They are complex and motivated and driven to interact with one another in nonsensical ways, just as we all are. I found Jackson's writing highly technical, but like the best of writers, you only notice it after it's past. In a book that starts out with a gun, by the time acts three and four roll around, she's introduced about twelve more. And all of them are necessary. Jackson also narrates the audio book I listened to, and her acting skills and ability to voice characters is second to none. One of the best I've ever heard. I'd get out of the car of an evening and my own weirdo semi-southern accent would take on a heavy dose of country until I could get it out of my head.Highly recommended. A wonderful, memorable story."}, {"userName": "Meg", "userReviewDate": "Nov 08, 2011", "userURL": "http://www.goodreads.com/user/show/3423663-meg", "userReview": "Oh, Joshilyn Jackson. How do you craft such intriguing, lovable characters? And create a menagerie of love and amusement out of such weird, dysfunctional people? To say I raced through Between, Georgia is an understatement. As I borrowed an audio version from the library (time crunch!), I found myself prolonging errands so I could spend just a little more time in Between. I loved that Jackson incorporated completely out-of-the-box characters like Stasia Frett, a blind and deaf woman who felt compelled to become Nonny’s mother when her biological mess of a teenage birth mother couldn’t care for her.As Between is such a small town, the Fretts and Crabtrees no each other very well. The Crabtrees might be hardscrabble poor and vicious, but that doesn’t mean they take kindly to their own flesh and blood being taken in by a holier-than-thou Frett.Sometimes it’s hard to articulate why you mesh so well with a story, but I’ve quickly become enamored with Jackson and find myself savoring each and every one of her words like an expensive truffle. Though Nonny could be boneheaded at times, I thought she was a wonderful and caring person — a truly great daughter — and couldn’t help but laugh at the Frett sisters, all of whom were good-hearted but more than a little eccentric. Bernese was probably my favorite. Jackson always has at least one character that brings the zingers, making you laugh or cry at the most unexpected moments. That was definitely Bernese for me.Entertaining and heartwarming by the close, I wanted to drive my own self down to share a glass of tea with the ladies of Between, Georgia. Nonny’s struggles with family — those who gave you life versus those with whom you make a life — will ring true for many. Fans of Southern fiction and Jackson’s exquisite storytelling will find plenty to love here, and I can’t wait to pick up her newest novel: A Grown-Up Kind Of Pretty."}, {"userName": "Jackie Lane", "userReviewDate": "Jul 13, 2009", "userURL": "http://www.goodreads.com/user/show/1885732-jackie-lane", "userReview": "Family Feud, Southern Fiction Style.Joshilyn Jackson hooked me when I read Gods in Alabama, which to this day is still one of my favorite books.Taking place in Between, Georgia, Nonny begins by telling how she came to be Frett instead of a Crabtree, being raised by three sisters, Stacia, Genny and Bernese.Then we move on to Nonny's relationship with her soon to be ex-husband Jonno. Even though they are in the process of a divorce, they seem to keep ending up together.Ona Crabtree, wants to be in Nonny's life and she is her grandmother.Nonny learns ASL and moves to Athens, Georgia, but is constantly being summoned back to Between by Bernese using her 5 year old granddaughter, Fisher, who adores Nonny.Although there is a ton going on here, once you begin reading this, all the crazy characters fall into place. At times this book is heartbreaking and at other times you just want to laugh, but by the end of the book, you realize that family is everything and no matter what, you love your family.5 stars!"}, {"userName": "Elvan", "userReviewDate": "Feb 05, 2015", "userURL": "http://www.goodreads.com/user/show/3769293-elvan", "userReview": "Entertaining Chick Lit. I love reading books by this Southern US writer. This episode of family feud may be a bit more over the top than some of her other work but I am drawn in every time by her colourful characters and plots. Hidden under the slapstick comedy and witty rapport is a protagonist with a deaf and mostly blind mother who grows up to be an interpreter for the deaf. This story is so convoluted I wouldn't even know where to begin so I will just say I loved it less than some of her other books but as usual, Joshilyn Jackson pulled out an emotional heart stopping ending which made me a very satisfied reader.3.5 stars"}, {"userName": "Rod", "userReviewDate": "Nov 12, 2009", "userURL": "http://www.goodreads.com/user/show/1788562-rod", "userReview": "This gets five stars. A masterpiece. Definitely the best book i've read all year. Its totally fun, kicks ass, and made me cry all at once. And the author blended in a nice touch about people with Usher's syndrome. The ending is incredible. This'll make a great movie someday...if hollywood doesn't screw it up. It could be as good as Where The Heart Is or Second Hand Lions."}, {"userName": "Mistyleedrury", "userReviewDate": "Dec 08, 2008", "userURL": "http://www.goodreads.com/user/show/1645198-mistyleedrury", "userReview": "I love novels set in the South, and this was no disappointment. It is rich with Southern character and anyone who has lived in and loved the South will find very familiar folks in Between, Georgia. The book follows Nonny Jane Frett and her life that is torn between two feuding families as she tries to keep everyone happy - while getting her own life in check. An easy, fun read."}, {"userName": "Kathleen", "userReviewDate": "Aug 03, 2017", "userURL": "http://www.goodreads.com/user/show/6793990-kathleen", "userReview": "I had a hard time with this book because although I kept thinking about the book when I wasn't reading it..it was definitely lacking in plot. The beginning was strange and hard for me to follow, the middle was lacking, and the ending was decent. But yet, a couple times I smiled while reading the last two chapters. Side note: I found the protagonist's nicknames for her fellow family members highly annoying. It seemed very forced and excessive to me. I'm all about nicknames fyi. Just felt odd to me. Agh.. this is just a hard one for me to decide if I liked it or not lol. After writing these thoughts out, the correct word to describe this book would be \"forced.\""}, {"userName": "Gail Grow", "userReviewDate": "Feb 25, 2018", "userURL": "http://www.goodreads.com/user/show/5016033-gail-grow", "userReview": "Another quick beach read with a predictable, feel good ending. But the plot was unusual and the characters lively and, on the whole, it was an enjoyable read."}, {"userName": "Rosina Lippi", "userReviewDate": "Jan 11, 2010", "userURL": "http://www.goodreads.com/user/show/3139413-rosina-lippi", "userReview": "Like the author's first novel, the primary focus of Between, Georgia is the narrator's relationship with her female relatives and the greater context of the tiny Georgia town where they all live in anything but peace. The narrator is Nonny, thirty years old, on the brink of divorcing a charming but morally challenged husband. If only she could stay out of his bed. Nonny is an interesting, strong character with an engaging voice but she also has a lot of trouble making up her mind. Not because she's flighty. That role will be taken up by the priceless Amber DeClue, who at one point shouts \"I've got to go iron my hair!\"Nonny's personal demons follow from her unusual history: she was born to Hazel Crabtree, the teenage unmarried daughter of the Crabtree matriarch, but adopted by Stacia Frett (also unmarried) and raised by Stacia, her twin sister Jenny and her older sister Bernese. The Fretts have money, maintain their property meticulously, and work hard, but Nonny's adoptive mother Stacia was born deaf, and will lose her sight by age thirty. Her twin Genny has escaped this fate, but she is anxious to the point of crippling neurosis. The Crabtrees - Nonny's birth family - are every bad thing you've ever heard about white trash, but they are also sturdy and fearless.This novel has a lot of plot, but it's very well handled, everything braided together in an interesting and not always predictable pattern. I never lost track of the many characters, and I was interested in all of them. There is a small but very compelling romance tucked in here as well, and we watch Nonny trying to work up the resolve to end her troubled marriage and the courage to take what is being offered to her by another, far more worthy guy.If I had any reservations about the story, which involves everything from raising butterflies to the social intracies of American Sign Language, it had to do with the incident that puts a match to the Frett-Crabtree fuse. The Crabtrees have an autoparts yard, and in the yard they have three Dobermans who have been poorly trained. Somebody does a bad job of locking a gate and one of the dogs attacks poor nervous Genny, coming just short of killing her before help arrives. One of the Fretts retaliates by shooting the dog in question. There is a fraught negotiation between Nonny and Ona Crabtree, the grandmother who wanted to raise her and has been frustrated in her attempts to gain Nonny's love. Nonny wants Ona to give the two remaining dogs away before Genny gets out of the hospital; Ona uses this as a way to manipulate both Nonny and Bernese, her arch enemy. There were a few logical flaws here, but not enough to ruin the story for me. In fact I have been thinking about this novel a great deal, wondering about the characters, what happens with them after the novel closes. Wondering about Stacia, who suffers a loss of objects crucially important to her, but who goes on (as Nonny points out) to live a rich life from what is left to her, something she knows how to do very well.There's something unique about Jackson's narrative voice, and I like it."}, {"userName": "JG (The Introverted Reader)", "userReviewDate": "Dec 16, 2008", "userURL": "http://www.goodreads.com/user/show/48404-jg-the-introverted-reader", "userReview": "Nonny Frett is caught between. She was born into the Crabtree family and secretly adopted into the Frett family, two groups that have been fighting since time immemorial. She wants to divorce her husband but she's caught between lust and lassitude. She's frequently caught between what she wants to do and what she feels like she has to do. How appropriate is it that she lives in a town called Between, Georgia?I enjoyed this. Parts had me laughing out loud, I was worried sick in other places, and I was ready to slap some characters around in still others. It felt like a real slice of someone else’s life. The whole Hatfield and McCoy thing was a little over the top, but it made for a good story, and gave Nonny a good backdrop against which to grow into herself.Nonny is thirty years old, but she hasn’t really found herself yet. She’s constantly dissecting herself and her behavior, looking to see if she’s more Crabtree or Frett in the whole “nature vs nurture” dichotomy. She tends to float along in life, either choosing not to make decisions, or content to let others make them for her. In all honesty, I related a little too much to her, so I liked watching her become who she was always meant to be.I loved Nonny’s mother. She was born deaf and has lost her sight by the time the book takes place. There's no word of complaint from her though. She's actually the rock of the family. She's an artist, she's wise, and she takes care of business. Her sister Bernese would argue, but Stacia is the one they rely on to keep them anchored.Nonny’s family is practically all women. She has an aunt Bernese that is a holy terror. She’s supposed to be going through a “bad patch” in the book, but since that’s all I saw of her, I didn’t like her at all. Nonny’s birth grandmother, Ona, is possibly even worse. She’s mean, she’s drunk, she’s manipulative, and she’s lonely. It’s a bit of a lethal combination. But even these two manage to grow, and I found myself seeing through their eyes a little by the time everything was over. This would be a good book club book. There are lots of things to discuss here, the various ways that females relate to each other and hurt and heal each other being chief among them. Life in a small town and that whole “nature vs. nurture” thing would invariably come up as well. Any red-blooded women are probably going to talk about the men in the book too. Oh my! I’m a sucker for a fictional man with long hair, especially if I get to “watch” him let it down, literally and figuratively. Is it a little steamy in here? ;-)After all the good stuff I just said, I can only bring myself to give this three and a half stars. There’s no real reason except that I enjoyed it while it lasted, but I don't think I'll remember it very long. I do recommend it if you're looking for a family drama with touches of humor."}, {"userName": "Libby Chester", "userReviewDate": "Jul 06, 2013", "userURL": "http://www.goodreads.com/user/show/3815302-libby-chester", "userReview": "Very good book with a great lead in plot. Hooked me from the start. Love the southern background of Georgia and the author really sets the atmosphere for readers who love stories about the South. It may be good ole boy country, but Jackson also makes the family dynamics crazy realistic. The protagonist, Nonny Jane is born to 15 year old Hazel Crabtree, who makes her way to the house of Bernese Frett. Hazel has kept her pregnancy secret from her mother Ona, and all the other Crabrees, so when Bernese's sister, Stacia wants to adopt the baby, Hazel is more than willing to give the baby up. The humorous telling of Nonny's birth had me chuckling several times. The book flashes to Nonny's thirtieth year, when she's on the fence about ending her ten year marriage to good looking boy band man, Jonno. Her mother, Stacia has Usher's syndrome and has become blind as well as deaf. Stacia's twin, Genny, and sister Bernese, as well as Bernese's granddaughter, Fisher, round out the feminine side of the Frett family. Nonny's connections to her family are deep and the author does a great job of enticing the reader to become engaged in the family dramas. The dramas are many, complex, and often humorous. The Crabtrees and the Fretts have had an ongoing feud over the years, and although Nonny is at the heart of it, the reader gets the sense that the differences in the two families would have always presented obstacles to any amount of getting along. As Jackson weaves the story, however, the reader comes to realize that the two families have more in common than just Nonny. I do wish that Jackson had created a more likeable character out of Ona Crabtress, Nonny's biological grandmother, but perhaps that's just a bias of mine. Lovely read!"}], "description": "Between, Georgia", "title": "Between, Georgia", "url": "http://www.goodreads.com/book/show/120696.Between_Georgia", "average": 3.87, "cover": "https://images.gr-assets.com/books/1441803547l/120696.jpg", "reviews": 1166, "authors": [{"url": "https://www.goodreads.com/author/show/45915.Joshilyn_Jackson", "name": "Joshilyn Jackson"}], "type": ["Fiction", "Womens Fiction", "American", "Audiobook", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/120696.Between_Georgia", "http://www.goodreads.com/book/show/241969.Between_Georgia", "http://www.goodreads.com/book/show/1355807.Between_Georgia", "http://www.goodreads.com/book/show/223462.Gods_in_Alabama", "http://www.goodreads.com/book/show/10960383-a-grown-up-kind-of-pretty", "http://www.goodreads.com/book/show/17349119-someone-else-s-love-story", "http://www.goodreads.com/book/show/32600726-the-almost-sisters", "http://www.goodreads.com/book/show/7114381-backseat-saints", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/26583370-life-and-other-near-death-experiences", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/20552595-how-i-became-a-famous-novelist", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/36004055-not-perfect"]}