{"ratings": 1834, "userreviews": [{"userName": "Melki", "userReviewDate": "Mar 27, 2014", "userURL": "http://www.goodreads.com/user/show/5293536-melki", "userReview": "The whole world seemed to be trying to be decent, and I seemed an indecent thing in it.*This one was recommended to me by my pal John, who described it as \"... a two evening read filled with social misfits.\" Though I spend most of my evenings surrounded by social misfits, I decided to give a read anyway. I'm fairly glad I did, as the book provides an excellent glimpse into what your friends, neighbors, and maybe even some of your relatives, might be getting up to behind closed doors.Most of the stories concern basically decent men who've been kicked around by life. These are men who stay too long at the bar and find every reason why they not only need to, but deserve to cheat on their wives. Sometimes, their wives have had enough of it and have kicked the sorry sons of bitches out on their lazy asses. Yeah, we should hate these fellows, but more often than not, they are too pitiful to scorn. I credit Brown's writing talents for making the weasels tolerable.A few of the tales are about struggling writers. In Acceptance, the quality of one man's sex life depends on whether or not he \"likes\" his wife's latest literary efforts. The last story, more of a novella really, is about a recently divorced man waiting for word on the short stories he has sent to publishers. Will the mail bring a big envelope containing a rejected story or will it be a letter of acceptance? And the funniest story, Discipline, is the document of a writer incarcerated for plagiarism who recounts weird, ungodly tales about torture and involuntary sex with obese women:Why did you think they weren't going to take you out and torture you? Were you friendly with any of the guards?No. Certainly not. They were all former editors. That was one of the requirements.Oh, Larry must have really enjoyed writing that one. Sticks and stones may break bones, but sticking it to an editor is a writer's best revenge. * from 92 Days"}, {"userName": "Perry", "userReviewDate": "Apr 07, 2012", "userURL": "http://www.goodreads.com/user/show/6354112-perry", "userReview": "Hillbilly-roticaI really appreciated and enjoyed Brown's novel Joe. Here though, the stories seemed somewhat juvenile, the dialogue forced and the sex disgusting. I think Brown worked around some \"sho-nuff\" rednecks before beginning his writing career. From personal experience, I know how this can scar the somewhat sensitive soul: at 18, I worked a summer in a factory with nothing but blue collar rednecks (God bless 'em: a Southern phrase to cushion the blow) who provided me an assortment of some of the most disgusting images of sex I still cannot cast out of my mind, and at a time when I was still a virgin (a fact I obviously didn't disclose to them) and porn was unavailable (in 1983).Reading the title story, consisting mostly of raunch in a parked vehicle, reminded me of that summer of lost innocence. I can't say the memories were fond. Brown's sex scenes are as sensual as a couple of hogs gruntin' and ruttin' around in a pen-full of slop. Granted, it's been a while since I read this. Yet, like the amaretto that made me extremely sick on my first college road trip, just a whiff of Big Bad Love turns my stomach now.I cannot recommend this. If you want to try a book by the late Larry Brown, a fine author in many respects, I suggest Joe or Fay."}, {"userName": "Anthony Vacca", "userReviewDate": "May 08, 2016", "userURL": "http://www.goodreads.com/user/show/27183668-anthony-vacca", "userReview": "A collection of short stories that exude Bukowski's influence on Brown like beer sweat on a miserably muggy Mississippi afternoon. But unlike Bukowski, Brown is an infinitely more imaginative and gifted writer, and each of these stories about men behaving badly carries more weight than just being celebrations of methomania and misanthropy. Each of the first eight stories knowingly features what can be interpreted as a stand-in for Larry Brown (all of these boozy first-person protagonists having names that start with the letter \"L\") and each deals with avoiding the responsibilities of marriage, parenting and burying your dead dog by dedicated focus on such acts as drunk driving, bad sex, fishing, stalking flashers, moping around strip clubs, the occasional joint, fist fights and more drunk driving. But Brown was never a one-note writer, and the last two pieces take turns for the ambitiously metafictional. \"Discipline\" is a transcript of a Kafkaesque trial featuring another L-named writer incarcerated for the crime of plagiarism and forced to work on improving his writing or suffer the bizarre punishments concocted by his cruel prison guards, who all happen to be ex-editors. The last chunk of this collection is dedicated to the novella \"92 Days\", an eviscerating account of a struggling writer (with--once more with feeling--the same initials as the author) who destroys his marriage and abandons his kids so that he can focus all of his attention on waiting for rejection letters from publishing houses and on hazardous amounts of drinking, self-loathing and drunk driving. All in all, Brown's second collection is a bleak but humane exploration of despair paired with the desire to create."}, {"userName": "Diane Barnes", "userReviewDate": "Jun 29, 2015", "userURL": "http://www.goodreads.com/user/show/7262060-diane-barnes", "userReview": "I love Larry Brown, and I loved these short stories. He manages to make us understand and feel sorry for the losers he writes about. They mean well and have good intentions, but they just need a beer to think straight, and then another one and another, and......These stories are funny and sad at the same time. Absolutely hilarious to the reader on the outside looking in, until you realize that there's something a little tragic in the telling.The last story in the collection \"92\" seemed a bit semi-autographical, about a man with writing ambitions who couldn't seem to get published. Then I realized that all the narrators in this book had different names, but always the same initials, L.B. Maybe Larry Brown put a little of himself in all of these guys."}, {"userName": "Kirk Smith", "userReviewDate": "Jul 05, 2015", "userURL": "http://www.goodreads.com/user/show/15749169-kirk-smith", "userReview": "I run hot and cold on Larry Brown, but there is some creative brilliance in 'Discipline'. I laughed out loud on a few things so I plan to follow through and read all of his work. My favorite by LB is 'Fay', a book I will probably read again some day. I thought he pushes the shock value button a little too much with this collection. As I described my thoughts earlier: \"Ooops!! I stepped in some Grit!!\""}, {"userName": "Diane S ☔", "userReviewDate": "Aug 12, 2015", "userURL": "http://www.goodreads.com/user/show/4159922-diane-s", "userReview": "3.5 These are not stories of the genteel South, ,where people are concerned with their reputations. Nope, these are crass, crude stories of those often talked about in country western songs. Pick-up trucks, driving down country roads aimlessly, some married but always on the lookout for something better and if they can't figure out an answer to the problems of their lives or they feel and unwanted emotion, why they just have another beer. Alcohol fixes everything. Yet there was something that in these stories, or at least some of them that appealed to me, because despite their hard exteriors there is just something a little soft in their interiors. Maybe, or I hope so anyway.Also liked how the stories ended with a little ironic humor. My first Larry Brown, hope to read a novel of his soon."}, {"userName": "Camie", "userReviewDate": "Aug 02, 2015", "userURL": "http://www.goodreads.com/user/show/7399266-camie", "userReview": "Ok , I took one for the team , and anyone who thought any earlier monthly choice was too Chick lit , sweet and fluffy , I'd say we're even. Rifle racks in pickup trucks, beer, and women ( mostly dreamed up) , the only think I can think of to call this is loser lit. ( not wanting to call it man lit, or guy lit ..lol) If you weren't depressed when you started this book , you may very well be by time you're done. This author is a married guy , with three kids , and has written a book called Facing The Music, which won a Mississippi Institute of Arts and Letters award for literature. Well knock me over with a feather. 2 stars"}, {"userName": "Shaun", "userReviewDate": "Aug 17, 2014", "userURL": "http://www.goodreads.com/user/show/9779623-shaun", "userReview": "3.5 starsThis was good in a Kurt Vonnegut sort of way, and while I appreciate the superb quality of writing and relevant themes, generally speaking, it's just not my favorite kind of storytelling. I imagine this collection will hold appeal to the literary community, particularly those struggling writers out there who may relate all too well to the protagonists in a number of the stories.Intelligent, different, and well-written. Three stars because sometimes I have a limited tolerance for certain types of blatant/in-your-face satire as well as the caricatures offered both in terms of characters and themes."}, {"userName": "Lydia", "userReviewDate": "Apr 19, 2008", "userURL": "http://www.goodreads.com/user/show/602795-lydia", "userReview": "Damn, I love Larry Brown. I just can't get over him, and everytime I remember that he's died, I mourn that I'll soon run out of things of his to read. He somehow writes stories that are at once familiar and foreign. To be honest, the people he writes about are people I would have avoided in Mississippi. I fully admit my classism and snobbery here. And he doesn't make me want to go back and become friends with them. But he does make my heart break for them. Big Bad Love is a collection of stories, all about men who are struggling with everything and spend most of their time driving around drinking beer. And in that simplicity, he creates incredibly complex characters, all of whom are shades of Brown himself. Read it if only for \"92 Days\", the last story in the collection, and the one that makes you appreciate every unpublished writer you've ever known."}, {"userName": "Melanie", "userReviewDate": "Mar 28, 2012", "userURL": "http://www.goodreads.com/user/show/4093022-melanie", "userReview": "The short stories in this collection are entertaining, bluesy in that doo-wop way and plenty fun. The narrator in each short story could be the same guy, likely the point: that big bad love brings out the big bad wolf in us all. 3.5 stars."}, {"userName": "Franky", "userReviewDate": "Jul 23, 2015", "userURL": "http://www.goodreads.com/user/show/2534471-franky", "userReview": "This collection was a mixed bag for me. I thought many of the stories in Part 1 were a bit repetitive and unnecessarily crude. The stories have a consistent theme of the narrator, who seems out of luck and love, trying to find himself, happiness or meaning in life. However, many times he tries to find it at the bottom of a can of Old Milwaukee. Some have said there is a bleakness, which I agree, but I think Brown writes it in a more of comically grim sort of way. A few notable stories that I did enjoy: “The Apprentice” was quite funny. It deals with the narrator describing his wife as an aspiring writer who wants to be published. She is constantly asking him to critique her manuscripts, which he hates to do. There are a few funny bits in the story. One part is when the narrator asks his wife if she read “Moby Dick”, to which she replies: “No, I but I saw it on the late movie. Gregory Peck and all them. Did that come from a book?” I also thought the story “Sleep” was a good one, where the narrator reflects on life and philosophizes. I liked the longer works, “Discipline” and “92 Days”, in parts 2 and 3, better than the shorter pieces. “Discipline” was a sort of spoof, satire, with a man on “trial” for committing the sin of plagiarizing well-known authors. It really shifts the entire mood to a much lighter tone after reading part 1. I felt the best in the collection was 92 Days, as I think it pulls together the central themes of all the works: struggling with life, trying to find happiness, aspiring to get published. It has a mix of humor and pathos that really ties the entire collection together. I’m sure that many in this collection could be the basis of a country song in a smoky bar.This was my first Larry Brown book. I might check out some of his other stuff."}, {"userName": "Sarah", "userReviewDate": "Oct 27, 2011", "userURL": "http://www.goodreads.com/user/show/3959062-sarah", "userReview": "Hated it. While I appreciate Brown's writing (he is a good writer), his stories are filled with beer, sex, and bars, and his characters are all unhappily married and seem to be getting sadder and more depressed by the page. The stories were just too bleak, and I kept hoping something, anything, would turn around, but it didn't. I think when a writer reaches that point when he cannot do anything for his characters, he should not be writing that story, but Brown keeps going, people keep dying, marriages keep falling apart, and there's just more sex and beer. I will admit that Brown has a great way of portraying the people he writes about. I knew from reading these stories that they were based on him or people he had met because he never seems to look down on these men who shirk responsibilty and parenting to get wasted and have sex, but instead seems to emphathize with them and their struggles with being published. In that respect, Brown is a great writer. I personally just don't enjoy the content."}, {"userName": "Marley", "userReviewDate": "Jul 17, 2007", "userURL": "http://www.goodreads.com/user/show/198612-marley", "userReview": "I won this book in a breakup-letter-writing contest. It's signed, in pencil. Who signs in pencil? Amateur! But ok, it might be good, and I have a nagging goal of reading the books I own. This one is at my parents' house... one of these days, I guess."}, {"userName": "Winter Branch", "userReviewDate": "Dec 07, 2007", "userURL": "http://www.goodreads.com/user/show/110948-winter-branch", "userReview": "This was one of the better short stories collections I ever read. All of the stories are linked together with similar themes. For the most part the collection reads as a loose narrative telling the tales of some very amusing and complex characters set in rural Mississippi (director Arliss Howard incorporated this idea into his film adaption of one of the book's stories). The highlights include a guy that complains that a certain part of his wife's body is way too big for his liking or the story of the town weirdo flashing women by the dumpster. Then there are the middle-of-the night-side-of-the-road-half-inside-the-car-half-outside-of-the-car-impulsive love making scenes, those are great. The only story that seems a bit out of place is the one about a man on trial for plagiarism. It is hilarious and reads more like Vonnegut and seems like the odd one out here. The character has been sentenced to 5 years, where he is forced to write. As part of his punishment he must have sex, blindfolded and with his nose plugged, with a grossly obese, unkempt woman. Amazing.However, my most enjoyment from the novel was reading the story about Leon Barlow in \"92 Days\" and his struggles to get published, stay sober, get money, and ward off his ex-wife. I couldn't help but feel I was getting a rather revealing glimpse into Larry Brown's pre-published days."}, {"userName": "Michael Anthony", "userReviewDate": "Nov 25, 2012", "userURL": "http://www.goodreads.com/user/show/4329630-michael-anthony", "userReview": "I debated whether or not to give this collection of short stories 3 or 5 stars, and though I ended up with 4, it's certainly not what it deserves. Separately, each of these stories has earned closer to 5 in my book, but as they're collected, they seem to run together. When Big Bad Love is read as a whole it's difficult to decipher one from the other. Don't get me wrong, Brown is a fantastic writer with strong characters and a terrific ear for dialogue, but if you're planning on picking up this collection, make sure you give yourself enough time in between stories to shake off the grim and grimy places Larry Brown takes you."}, {"userName": "Melody", "userReviewDate": "Aug 31, 2011", "userURL": "http://www.goodreads.com/user/show/186853-melody", "userReview": "Larry, Larry, Larry. Who in the heck were you? These stories are dark and written in first person and they are all about people that I know I certainly wouldn't want to be good friends with. These stories aren't the best thing I've read by the late Mr. Brown - but I miss him so. So I'm willing to read whatever's left out there that I haven't yet read."}, {"userName": "Rusty", "userReviewDate": "Jul 02, 2007", "userURL": "http://www.goodreads.com/user/show/163573-rusty", "userReview": "This collection was my introduction to Larry Brown, and has remained one of my favorite books for a long time now. If you like rural settings and gritty, down on their luck men who struggle to make their way in the world, especially with women, you'll like this book."}, {"userName": "Nate", "userReviewDate": "May 16, 2012", "userURL": "http://www.goodreads.com/user/show/9385642-nate", "userReview": "This book removed the top of my head. Larry Brown is incredible. So much emotional power it's a little ridiculous. I'm pretty bummed this is the last of his fiction that I haven't read. The good news is that his writing is so good it deserves multiple re-reads."}, {"userName": "Lawyer", "userReviewDate": "Aug 23, 2015", "userURL": "http://www.goodreads.com/user/show/3025547-lawyer", "userReview": "Big Bad Love: Larry Brown Looks at Love and Other ThingsComplete review to follow. There's a lot to reckon on with this collection of short stories."}, {"userName": "Greg", "userReviewDate": "May 09, 2007", "userURL": "http://www.goodreads.com/user/show/80945-greg", "userReview": "Brown's stories, all save for one written in the first-person, feature wonderfully authentic narrative voices. As a transplanted Southern male, the rhythms and dictions of Brown's narrators were nearly enough to give me flashbacks. However, the narrators were largely undifferentiated; they bled into one another, and the voice that had seemed so singularly wonderful when I read the first story felt somewhat threadbare by the time I finished the closing novella.These stories are also sunk deep within the Southern oral tradition—so much so, in fact, that not all of them seem to work as printed literature. The plots of most of the stories are episodic, and the writing is weighted heavily toward exposition over scene. The strongest stories in the collection—\"Sleep\" and the novella \"92 Days\"—are the ones that buck this trend.In all, though, I'd recommend Big Bad Love on the strength of its narrators' voices alone. \"My dog died,\" the title story's narrator tells us at the story's opening. \"I went out there in the yard and looked at him and there he was, dead as a hammer. Boy, I hated it. I knew I'd have to look around and see about a shovel. But it didn't look like he'd been dead long and there wasn't any hurry, and I was wanting a drink somewhat, so I went on out a little further into the yard to see if my truck would crank and it would, so I left.\" And even though the story that follows doesn't completely cohere, it's a simple pleasure just to sit back and let this deep-fried Southern men speak."}, {"userName": "Kurt", "userReviewDate": "Jan 05, 2012", "userURL": "http://www.goodreads.com/user/show/6405404-kurt", "userReview": "This book is in three parts:Part 1. A collection of very, very readable short stories - typical Larry Brown. A complaint is that these stories go a little too far over the line of \"sharing a common theme,\" and begin falling into an area of, \"this is the same story, with the same character, over and over, again.\"Part 2. Is a slightly longer short story that might very well be the worst thing I've ever read by an acclaimed author. It's a joke story, like the type of thing you write when you're bored and frustrated with the process of writing, so you give yourself a break and write something... well, stupid. How this got published is very, very beyond me.Part 3. Is a very long short story/novella, which is a combination of the two parts that preceded it. Once again, the characters/story are very good, but the exact same thing that you've already read throughout the dozen or so stories that make up Part 1. And perhaps they're things that I would have let slide if I wasn't coming immediately off of the sourness of Part 2, but I couldn't help but noticing this story peppered with sudden, glaring shards of plain bad writing.I'm a Larry Brown fan, and this book is not a disaster (except for Part 2), but it is a disappointment."}, {"userName": "Ava Butzu", "userReviewDate": "Jan 05, 2014", "userURL": "http://www.goodreads.com/user/show/5453266-ava-butzu", "userReview": "In these loosely connected stories of masculinity gone awry, Brown introduces a variety of guy-types who perpetually miss opportunities to straighten up their lives. With booze and women being the two Achilles heels of our misfit heroes, they manage to skate by most times in the name of survival. I found myself shaking my head when they made destructive choices, and surprised that they didn't suffer more dire circumstances for their selfish actions. However, this may be the crux of what makes Brown's writing so much more subtle than one might initially perceive. The undertone of sadness forces its way through the macho veneer so that we can appreciate the loss, destruction, and despair that result from an inability to escape who we are.\"Big Bad Love\" is coarse and gritty. This grit is became his touchstone long before the word \"grit\" became a cliche representing a badge of honor to be worn for hard work and stick-to-itiveness."}, {"userName": "Jo Ann", "userReviewDate": "Jan 29, 2012", "userURL": "http://www.goodreads.com/user/show/227587-jo-ann", "userReview": "Given to me by my son for Christmas, I was so eager to read this Southern author, as I'd read his book, Fay, in the late 90's, for book club. He's a rough 'n tumble guy, with lots of crass depictions and words: I have been teased by my book club ever since I recommended, and we read, Fay. This book of short stories apparently is reflective of many Southern men (how much of this is autobiographical, one wonders?) who have a penchant for hard drinking, fast women, fast sex, divorce, and pick up trucks. Larry Browns's writing is witty, fully human, sorrowful, compelling. Many of these short stories also helped me appreciate the struggles and joys of authors and their writing! Thanks, Paul!"}, {"userName": "Tim Spears", "userReviewDate": "Feb 28, 2011", "userURL": "http://www.goodreads.com/user/show/3265664-tim-spears", "userReview": "I'll get back to this."}, {"userName": "Paul", "userReviewDate": "Jul 28, 2011", "userURL": "http://www.goodreads.com/user/show/4856618-paul", "userReview": "My first five-star read of this year, yet I didn't 'love' every story in this collection of ten shorts (nine stories and one 87 page novella). So how does that work? Well, the power of Larry Brown's writing in this second collection of his is such that while I don't think that everything he tries to do here is a complete success, the value and impact of his creation when it IS a success is so overwhelming that I have no choice but to give the book the highest rating. The novella \"92 Days\" which closes the collection is among the very best of his work, and probably one of the best shorter stories I've ever read.These stories show us characters familiar to Brown's rural Mississippi. Mostly male, working class, and white, these characters often drink too much, have difficult or failed marriages, and are frequently running into trouble. They clearly follow a range of autobiographical themes. The stories are grouped in three sections. The first features the opening eight salvos, and then the second and third sections include a satirical dialogue - \"Discipline\" - where a writer on trial stands accused of plagiarism (that I didn't care for so much), and the novella \"92 Days\" respectively.In the opening story \"Falling Out of Love\" - '...it was an evening as fine as you could ask for except that we had two flat tires on our car some miles back down the road and didn't know where we were or who to ask. Besides this main emergency, I knew things weren't right.'\"The Apprentice\" is an amusing insight into the life of a struggling author pre-publication, and how the obsessive compulsion to write can affect a marriage. It is the male narrator's wife Judy who wanted to be the writer: '...I didn't know what to do. If I said it was bad, she'd sull up or maybe cry. She cried a lot when I didn't like her stuff. And if I said it was good when it really wasn't, she'd get very encouraged and sit right down and type it up all nice and neat and send it off to \"Playboy\" or somewhere, and then get all broke down when it came back rejected.'\"Wild Thing\" is a hopeless tale of an unhappily married forklift driver who has an affair with a younger married woman he meets in a downtown bar. The title story then sees Brown explore another side of matrimonial unhappiness: his narrator Leroy, is spending time in town drinking and playing Tom T Hall songs on the jukebox, avoiding going home and having to bury his dead dog, and his wife Mildred who '...was sexually frustrated because of her overlarge organ...'\"Gold Nuggets\" sees a slight change of scenery, but not flavour, as the story is set among the strip bars and back alleyways of a Gulf Coast harbour town. The pathetic narrator is in town with a pot of money to pick up shrimp for himself and his associates - who he doesn't even like. He promptly falls victim to the tawdry attractions the town has for him. 'It was a bar somewhere between Orange Grove and Pascagoula, one of those places where they charge you nothing to get in and then five dollars for a ten-ounce Schlitz. It was dark. Everyone had on sunglasses but me...''...They hadn't even set it on the table when the other one leaned over and said she wanted one, too. So I bought her one. And told her to bring me another beer. I didn't care. I wanted to wake up broke and sober. I figured if I couldn't buy a drink, I couldn't get a drink. We jawed some old shit, it didn't matter what we said. We all knew the score. Their job was to rob me, my job was to pay for the robbery. All night long if possible.'\"Waiting for the Ladies\" is a powerful story of a man whose wife tells of a flasher exposing himself at the local dump. The narrator is newly out of work and has enough time on his hands to ride around looking for the pervert, fantasising about what he'll do to him given the chance. The story reveals far more about the narrator than you'd initially expect.Then, \"Old Soldiers\", a poignant tale of Leo, a Vietnam veteran spending time with Mr Aaron - a WW2 veteran who fought with Leo's father in Europe. Leo frequents Mr Aaron's general store where they drink together and tell stories. A 3rd character, Squirrel, is a local barfly in his 50s or 60s, and a mutual friend of both. One evening sees Leo 'trapped' at the bar - looking for a good time but instead, mildly annoyed, nursing a drunk Squirrel who needs a ride home... '\"I was on the front lines at Korea,\" he said. I looked sideways at him.\"I didn't know that,\" I said.\"Hell yes.\"I listened then, because moments like that are rare, when you get to hear about these things that have shattered men's lives. I knew my daddy never got the war out of his head. When he got to drinking that's what he'd talk about. Mama said when they first got married he'd wake himself up screaming from a nightmare of hand-to-hand combat, knives and bayonets and gun stocks. With sweat all over him like he'd just stepped from water. I listened to Squirrel.'The final story - \"92 Days\" is the novella which alone is easily worth the book's price. Brown immerses us into a world very similar to that which he himself had not long recently been in. The struggling author (though unlike Brown 'Lonnie' is divorced from his wife and never sees his young kids) spends his days writing and drinking, and opening the mail with dread. He reads Faulkner and Bukowski and tries to picture Betti DeLoreo, the editor who wrote him a rejection letter, full of compliments for his 'voice', and encouragement to not give it up. His ex-wife keeps the pressure on for alimony and child support, while he has a finite number of days to keep on writing full time before his money runs out altogether, and he goes back to house painting.'I went down and checked the mail. Water bill, light bill, phone bill, and somebody wanting to give me an AM/FM radio worth $39.95 if I bought a quarter acre of land in some resort area in Arkansas for $6800. Nothing from Betti DeLoreo. But at least nothing had come back. Yet. I had fourteen stories on their way to or back from various editorial offices across America.I went back to the house, opened a beer, and sat down at the machine. I sat there all afternoon waiting for it to say something to me and it never did.'But Lonnie writes plenty of stories. One he starts is about a widowed go-go dancer called Marie, locking her three sleeping children in the car in the parking lot. She ends up quitting and riding '...around for a while, wondering why her husband hadn't had enough sense to buy life insurance. She didn't have enough dog food for their dog.At this point I realized I couldn't help them, realized I wasn't a writer, and threw it away, which scared the shit out of me.' I think Larry Brown is one hell of a writer, and this is a superb collection, whose images and characters will stay with me a long time."}, {"userName": "Steve", "userReviewDate": "Jul 18, 2017", "userURL": "http://www.goodreads.com/user/show/2507965-steve", "userReview": "A reminder here that 2 stars is \"it was OK\". Southern fried Bukowski - which, for me, is not a good thing. Same kind of cult following, who seem to believe that being drunk imparts a wisdom of some sort. I suspect that his novels are better, since he has to do a bit more in 300 pp than get his narrator drunk on beer. I don't remember, can you really get that drunk on beer? My favorite was \"Old Soldiers\", which showed a glimmer of empathy and hope. \"Discipline\" would have been thrown out of editor's office, if Brown's name was not on it. Although I do love the ending, where Brown mimics the overblown Southern Faulkneresque prose popular with so many other Southern writers. And \"92 Days\" probably was written while he was drunk most of the time - just a rant, and a hope, with no ending.Looking forward to watching the film version of this - see what stories were chosen to drive the movie's plot.After this I may have a hard time picking up another Brown title - although I do have a copy of another of his story collections sitting on my shelf, \"Face the Music\". I'm afraid I'll start it and go, \"Oh, here we go again!\" and put it down, for good.Oh, also picked this up to read because of its influence on John Moreland's CD, \"Big Bad Luv\", which I have yet to give a listen to. But I understand it is also filled with tales of drunkenness and heartbreak."}, {"userName": "Colin Brightwell", "userReviewDate": "Feb 11, 2018", "userURL": "http://www.goodreads.com/user/show/33356348-colin-brightwell", "userReview": "Larry Brown understood pain. He could write what it means to love and hurt and yearn and that feeling that you ain't gonna get what you want in the end. Goddammit I'm jealous of how easy he makes it look. The last story in this collection, \"92 Days,\" might be the most realistic depiction of a writer in a work of fiction. Move over, every character in a Stephen King novel. Brown has a story here that is so damn compelling and painful and yet deeply poignant. The man had talent. More people should read him."}, {"userName": "Nick Moran", "userReviewDate": "Jan 26, 2018", "userURL": "http://www.goodreads.com/user/show/3545804-nick-moran", "userReview": "At its worst this book is dross like the saddest dating sub-Reddit but at its best this bastard sings like John Moreland* driving with the windows down, mudflaps slapping something fierce as he peels the hell out of Gulfport, northbound on Route 49 to escape the heat. Not for nothing: Best depictions of every day drunks this side of Lucia Berlin.*Title not a coincidence"}, {"userName": "Trevor Mangan", "userReviewDate": "Jun 01, 2017", "userURL": "http://www.goodreads.com/user/show/2059554-trevor-mangan", "userReview": "I love Brown's novels, but the short stories never quite took off for me."}, {"userName": "Brenna", "userReviewDate": "Feb 23, 2018", "userURL": "http://www.goodreads.com/user/show/5739342-brenna", "userReview": "Engrossing; stories and anecdotes about life that are both broken and complete. Descriptive, vulnerable and provoking."}], "description": "Big Bad Love", "title": "Big Bad Love", "url": "http://www.goodreads.com/book/show/539933.Big_Bad_Love", "average": 4.13, "cover": "https://images.gr-assets.com/books/1467539369l/539933.jpg", "reviews": 118, "authors": [{"url": "https://www.goodreads.com/author/show/31125.Larry_Brown", "name": "Larry Brown"}], "type": ["Short Stories", "Fiction", "American", "Gothic"], "outlinks": ["http://www.goodreads.com/book/show/539933.Big_Bad_Love", "http://www.goodreads.com/book/show/4006497-big-bad-love", "http://www.goodreads.com/book/show/377993.Joe", "http://www.goodreads.com/book/show/256109.Father_and_Son", "http://www.goodreads.com/book/show/888492.Fay", "http://www.goodreads.com/book/show/377994.Dirty_Work", "http://www.goodreads.com/book/show/377991.Facing_the_Music", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}