{"ratings": 14965, "userreviews": [{"userName": "TK421", "userReviewDate": "Apr 01, 2010", "userURL": "http://www.goodreads.com/user/show/2624672-tk421", "userReview": "You all probably remember the fantastically cheesy film Big Fish directed by Tim Burton. For me, it was pure visual and storytelling enjoyment. But what you may not realize is that BIG FISH the novel towers over the movie. When I first bought a copy of this, just before they began releasing the movie coast-to-coast in 2003, I remember reading the back cover and thinking to myself: “Huh, a book about a man who doesn’t really know who his father is…how mundane.” O, how silly my thoughts were—this story is anything but mundane. This is a tragic story of not really knowing a father, but it is so much more. Let me explain. BIG FISH is a complex story about family, self, emotional certitude, and conflict between a son and father told through Tall Tales, snippets and allusions to the THE ODYSSEY and pinches of Joyce’s ULYSSES. If that doesn’t arouse some interest, you may be dead. The story is simple: Edward Bloom is dying, and his son, William Bloom, wants to know the truth of who his father really was as a person. But Edward is unwilling to give up anything easily, and William is determined to think that his father is an irresponsible liar that only told exaggerated stories of his own life.In an easygoing storytelling voice, William Bloom pieces together who is father was as a person, but, more importantly, he also pieces together who his father was a father. Through fantastic environments the reader is navigated through adventures both light and dark to the truth. Stories of giants and witches and obscure poets and lost towns and strange circuses allude to who, and what, Edward Bloom was. But, like most truths, ascertaining fact from fiction is a troublesome endeavor. I cannot think of a better story that exemplifies the strange relationship between a father and his son. Personally, I could relate to William’s angst of not really knowing his father; and this personal relationship to the story made it all the more powerful. I mean, c’mon, who really knows their parents? As children our parents are super heroes or villains, as teenagers they are a footnote in our lives. It is not until adulthood that we begin to understand that our parents had lives and dreams, fears and recourses or events that made them into the people they are. As a father myself, I am often caught wondering what my son and daughter will think of me as they grow older. What stories will be true? What ones will be fabrications of distorted memories? What imprints have I given them? In the end, does it matter? I can’t say. But I hope they have stories of me that they will tell their children, as I have shared stories of my father to them. HIGHEST POSSIBLE RECOMMENDATION"}, {"userName": "AMEERA ", "userReviewDate": "Jun 03, 2016", "userURL": "http://www.goodreads.com/user/show/32325414-ameera", "userReview": "I'm glad to read this amazing book actually more than book teach you more stuff and nothing impossible in this life but just don't give up and finally my favorite book this year"}, {"userName": "K.D. Absolutely", "userReviewDate": "Oct 30, 2011", "userURL": "http://www.goodreads.com/user/show/2156200-k-d-absolutely", "userReview": "On the day I was born, there was a big typhoon. The water was seeping through the ceiling of the hospital room and there was a dripping pan catching the falling raindrops beside my mama’s bed. I was the youngest in the family and my papa did not bother to wait and see me right after I was born. I guess he was no longer excited to see another mouth to feed in addition to my two older brothers and a sister. Three days after my mama’s caesarian operation, my papa picked us up but the streets were still flooded so we had to ride on a banca to cross the street and flag a jeepney a few blocks away from the hospital.30 years after.On the day my daughter (my only child) was born, I waited in front of the delivery room. I got nervous when the doctor went out the first time. She told me that my daughter seemed not to be bulging inside my wife’s womb as if she was enjoying herself there. So, she had no choice but to do a CS and so I needed to sign a waiver. I signed it right away because I was excited and I forgot to even discuss the matter with my parents-in-law who were with me. The second time the doctor came out, my name was called. She handed me my daughter saying “It’s a girl!” I immediately carried my daughter in my arms and I noticed that her eyes were closed. I called her “baby” and upon hearing my voice she opened her eyes and looked at me! I loved her since the first time I saw her. After a few seconds, she closed her eyes. Then the nurse approached us and gestured me to hand my daughter back. I did not want to. I wanted to bring my daughter home with me as if the initial bond was just formed magically and instantly between us that could never be broken forever.Big Fish: A Novel of Mythic Proportion is a 1998 autobiographical novel by Daniel Wallace (born 1959). It is about an absentee father Edward Bloom who is a good provider but prefers to work away from home and a son Will Bloom who is facing the reality that his father is dying but he does not know him yet and even hates him for missed his growing up years. Edward is a joker and has a passion for storytelling. His stories are comic and full of fantasy elements. However, at the bottom of his heart, Edward Bloom only wanted to become a great man, i.e., \na big fish\n – to provide for his family and in the end get the nod of his only son – his approval.When do you say that a father is an absentee father? Traditionally, fathers are the primary provider in the family. We work to put food on the table, to send our children to school, to clothe them, to provide all the other necessities or sometimes once in a while, luxuries. Not all of us are fortunate to find work – some even prefer to maintain some distance like Edward - that would enable us to see our families at the end of each and every day. Many of us sacrifice not seeing our families as frequent as we wanted to just to fulfill our role of being good providers. Given that we sacrifice this longing to be with our family, do we still get tagged as absentee father. That’s unfair.When I was growing up, there were times when my papa was in the city as he was a city policeman. When my daughter was growing up, there were times when I had to be away as I was doing systems implementation in other Asian countries. I missed the chance of watching her in several of her school affairs – family day where she danced on the field, a quiz bee on science fair when she was a contestant, etc. I regretted those but I had no choice as my work required me to be away. How do you then draw a line a between an absentee father and one who is only trying to keep a job to support a family? This book does not provide a direct answer but shows the effect of having an absentee father: the psychological longing of a son facing the father whose love he was wanting to feel all his growing up years.But this is not an all-out emotional book. It is not even a tearjerker. It is comic being peppered with funny jokes that can make you laugh out loud. I did in a couple of times. To those who have read this book, I laughed really loud on Edward’s story about the man who loves his cat and also the one about Edward having the ability to predict who would die by dreaming about it the day before the person’s death. Those two are really, really funny.I have seen the film but the book is definitely better."}, {"userName": "peiman-mir5 rezakhani", "userReviewDate": "May 28, 2015", "userURL": "http://www.goodreads.com/user/show/42133960-peiman-mir5-rezakhani", "userReview": "دوستانِ گرانقدر، از آنجایی که قبل از خواندن این رمان، فیلمی با عنوانِ \"ماهی بزرگ\" به کارگردانی «تیم برتون» را سالها پیش دیده بودم، از همان آغازِ خواندن، به راحتی، خط به خط کتاب را درک میکردمدر زمانِ خواندن، تمامی کتاب برای من حکم یک سری داستان های خیالی و به نوعی به یکدیگر متصل را داشت، تا اینکه به انتهای کتاب رسیدم... متوجه موضوع جالبی شدم: از دیدگاه من نویسنده، آقای <والاس>، با انتخاب پسر و پدر، به نوعی قصد داشت دوباره به بحث استوره (اسطوره) برسد. چراکه در ابتدای داستان میخوانیم که پسر تمامی داستان های پدر را تخیلی و ساختهٔ ذهن پدرش میداند و رابطهٔ خوبی با پدر ندارد، زیرا پدر را انسانی خیال پرداز میداند... ولی در انتهای داستان، کم کم با شخصیت پدر آشنا میشود و به نوعی با پدرش آشتی میکند... و قسمتی که باعث شد شک من به یقین تبدیل شود، آنجایی بود که پسر در لحظهٔ مرگ پدرش، شروع کرد پایانی برای داستان پدر ساخت، که من را به یاد داستان های استوره ای انداخت که در برخی از آنها پسر با پدر مشکل دارد، ولی با هم آشتی میکنند و بعد پسر ادامه دهندهٔ راه پدر میشودپس نویسنده با هنرمایی در آخر این رمان توانست به راحتی یک داستان افسانه ای را به صورتِ استوره ای به پایان برساندالبته پس از نوشتنِ ریویو متوجه شدم که بر رویِ جلد و کاور کتابی که در گودریدز ثبت شده است، اشاره ای نیز به موضوع استوره ای بودنِ این داستان شده استدر جایی مطلبی خواندم در مورد نقد یک ایرانی بیسواد و از آن دسته از نادان هایی که همه چیز را به دین مرتبط میدانند... این بیخرد، گفته بود در این رمان نویسنده از کتاب های به اصطلاح مقدس بهره برده است... همینکه تمام افتخارات جوانان این سرزمین را از الطاف و نظر، امامان و ائمه دینی میدانند و اعتماد به نفس را از جوانان این سرزمین گرفته اند، کافی نیست... حالا سراغ هنرمندهای غیر ایرانی نیز رفته اند... مثلاً این به اصطلاح استاد دانشگاه که کرم و انگل، مغزش را خورده است، میگوید: در این داستان، منظور از ادوارد و پسرش .. همان پدر و پسر و روح القدس بوده است... یا در آن قسمتی از داستان که ادوارد به درونِ رودخانه شیرجه میرود و مار را میگیرد تا دختر را نیش نزند.. و بعد میبیند که مار تبدیل به چوب شده است.. نویسنده از داستان موسی و چوبش و رود نیل و هزار تا موهومات دیگر و خزعبلاتِ مذهبی استفاده نموده است... یا وقتی ادوارد به غول میگوید: بیا من را بخور و گاو و گوسفند و محصولات مردم را نخور، منظور نویسنده همان قربانی کردنِ داستانِ موهومِ ابراهیم بوده است... عزیزانم، شما ببینید چقدر این موجود به اصطلاح منتقد ادبی، نادان و تحریف کننده است... نمیگوید ادوارد از روی حس انسانی و همنوع دوستی خودش و از رویِ مهربانی و انسانیت به غول این پیشنهاد را داده است، بلکه میگوید: داستانِ مسخرهٔ قربانی کردن بوده است... واقعاً زبانم از توصیف این موجوداتِ بیخرد ناتوان شده است.. بعید نیست، این به اصطلاح استاد به شاگردهای بیچاره در دانشگاه گفته باشد که وقتی ادوارد با ماهی حرف زده است، منظور داستان سلیمان بوده است و حتی از انسان و ماهی شاید برسد به داستانِ یونس و همینجور ادامه بدهد تا بگوید منظور همان ماهی عرعر بن کرکره بوده که با علی بن ابیطالبِ تازی دوست بوده است و در آخر بگوید: نویسنده اصلیتش عربستانی بوده است و اجدادش در خیمه های مکه ساکن بوده انددوستان خوب و آگاه ایرانی، باید بگویم این چرت و پرت ها و به اصطلاح نقد های ادبی، ساختهٔ ذهن هایی میباشد که به واسطهٔ دین و مذهب به مرز فاسد شدن و گندیدن رسیده است و بوی گندیدگی آن تمامِ سرزمینمان را برداشته استدوستانِ خردگرا، هنر و خلاقیتِ نویسندهٔ این رمان زیبا، هیچ ارتباطی با داستان های موهوم دینی و مذهبی ندارد، و این موضوع یک سناریوی تکراری و کثیف میباشد که سعی دارند همه چیز و همه کس را به دین مرتبط بدانند**************************امیدوارم از خواندنِ این داستانِ زیبا، لذت ببرید<پیروز باشید و ایرانی>"}, {"userName": "Diane Barnes", "userReviewDate": "Feb 23, 2017", "userURL": "http://www.goodreads.com/user/show/7262060-diane-barnes", "userReview": "I'm not a big fan of magical realism, but if it's done well, by an author who can make you believe in anything, just by the quality of his writing, it can be something special. \"Big Fish\" did that for me. I was under Daniel Wallace's spell from the first word. I guess a lot of people feel that way, because it has been turned into a film and a Broadway production."}, {"userName": "Amanda", "userReviewDate": "Jan 30, 2009", "userURL": "http://www.goodreads.com/user/show/1845094-amanda", "userReview": "I bought this novel based on my enjoyment of the Tim Burton film, but was surprised at how slender it was considering the vast amount of material the film got through. Once I started to read Wallace's novel, it became obvious why. The film was greatly padded out, using the material from the book as a backbone (the book reads more like a collection of concept notes for the film than a full novel). The film also made several changes in Edward Bloom's character (making him more likeable), for example, in the novel, it is confirmed that Bloom did have an affair, where the film had the woman deny that there was any infidelity (despite her attempts to seduce him). Wallace's choppy, flitting style, like flicking distractedly through various TV channels all showing different episodes of the same vast biography, also makes it hard to foster a bond with any of the characters and therefore hard to care about any of their exploits, not matter how spectacular. This is the greatest example of 'The film was better' I have ever come across."}, {"userName": "Selene Matheson ", "userReviewDate": "Jul 21, 2016", "userURL": "http://www.goodreads.com/user/show/22492662-selene-matheson", "userReview": "BookTube-A-Thon Challenege 2016 #3 Read a book you discovered through BookTube. (I found this over with Ashley from saidthestory).BookTube-A-Thon Challenege 2016 #6 Read and watch a book-to-movie adaptation."}, {"userName": "Jeffrey", "userReviewDate": "Jul 04, 2008", "userURL": "http://www.goodreads.com/user/show/1006205-jeffrey", "userReview": "Please, read this book. Once in a while, like The Five People You Meet in Heaven, comes a book that is original, full of wonder, Chronicle of Narneish, so full of meaning and beauty that all must buy it, read it, and pass it on. This is perfection. Oh, also see the Tim Burton version of this. As a matter of fact, just see all of Burton's movies. How else to do such a story? Great!"}, {"userName": "Rouyuan", "userReviewDate": "Mar 08, 2017", "userURL": "http://www.goodreads.com/user/show/25143358-rouyuan", "userReview": "A book I thoroughly enjoyed and would recommend. I watched the movie many years ago, and liked it (albeit I now only have very vague memories of it). The film adaptation diverged in some ways from the book, while still keeping the core concepts, concepts I enjoyed both watching and reading about. This story is about a son coming to terms with the inevitable death of his sick father—as well as trying to come to terms with the 'mythic' life of the same man and trying to make sense of who exactly is his father.It's a testament to the book's writing that despite me ultimately disliking the father, I was still wholly interested and invested in the father-son relationship, that I could even understand the sort of strained, frustrated affection the son had for this flawed man who was so difficult to reach out to. It's what I'd consider a fairly terse book, with the narration of the father's life being straightforward and brief, with that charming, whimsical Southern voice used, while the present-day portions with the son dealing with his sick father would take their time, languishing, stretching the contemporary prose to meet with the difficulty of impending death, an impending deadline of how long the son has before he loses his chance to finally connect to this difficult old man. The ambiguous ending was also very stirring, in my opinion—do we take it at face value and accept the 'mythic proportions' the father achieves, or do we choose to read between the lines and imagine that this might be the son's way of coping with his father's death and how much (or how little) he really knew him? Either way, if nothing else, this book makes me want to watch the movie again, and that's not a bad thing at all."}, {"userName": "Shovelmonkey1", "userReviewDate": "Nov 11, 2011", "userURL": "http://www.goodreads.com/user/show/3926982-shovelmonkey1", "userReview": "Edward Bloom is dying. But he's taking his time about it. Time enough, in fact, to have four run ups to the actual event itself and to recount the varied adventures, myths and fables which have attached themselves to the Bloom name since not long after he was born. For son, William Bloom, having a legend for a father is not easy. Firstly it's a lot to live up to but, there's also the problem that no one knows where the fairy tale that is Edward Bloom's history ends and the reality begins.Edward Bloom always felt himself to be a big fish in a small pond and he was determined that one day he would swim away from his small town and see the wider world and he'd make a name for himself and no mistake about it. From small town sporting hero to giant tamer; from reclaimer of magic eyes to dog-vanquisher; from gallant knight to real estate mogul; from myth to father figure. Who is the real Edward Bloom? This story presents itself as a charming fairy tale for the modern age but really it is an examination of the father-son bond as two people who are closely linked but worlds apart reconcile themselves with their imminent separation brought about by death. In doing so William Bloom is forced to ask himself how well we really can know our parents? Will they ever be real people or will they always be shrouded in the cocooning layer off tall tales and heroics which we applied to them as children?A fluffy family orientated read which will leave you with a centre gooey-er than a truck load of Cadbury's Caramels."}, {"userName": "Jessica", "userReviewDate": "Jul 19, 2014", "userURL": "http://www.goodreads.com/user/show/2744708-jessica", "userReview": "3.5 stars. It's hard to read a book when you've been a huge fan of the movie for years, and that was the case with this book. Big Fish is one of my absolute favorite movies, so in my mind, it was just expressed and elaborated slightly better in the movie.  The book was still a good, quick read, and of course, I just adore the ending. <3"}, {"userName": "Brooke", "userReviewDate": "Nov 13, 2015", "userURL": "http://www.goodreads.com/user/show/5242679-brooke", "userReview": "I have seen the movie adaptation of this book over a dozen times and it still remains one of my absolute favorites. I was a little reluctant to pick up the book because of my love for the film, but it's shortness and urge to revisit a wonderful story changed my mind. The message is the same in the book as it is in the movie; remembrance through stories. Though the book was different I still really enjoyed it!"}, {"userName": "Malcolm Everett", "userReviewDate": "Jul 09, 2017", "userURL": "http://www.goodreads.com/user/show/39050916-malcolm-everett", "userReview": "This book can be summed up in four words: Great writing, no plot.Like most readers, I watched the movie adaptation first, although I don’t remember much about it now. Since I’m working on a story that has a dreamy, fabulist writing style, I wanted to read something similar, and Big Fish certainly fits that description with passages like this: They say he never forgot a name or a face or your favorite color, and that by his twelfth year he knew everybody in his home town by the sound their shoes made when they walked. They say he grew so tall so quickly that for a time—months? the better part of a year?—he was confined to his bed because the calcification of his bones could not keep up with his height’s ambition, so that when he tried to stand he was like a dangling vine and would fall to the floor in a heap.However, there is no story here. Nothing really changes, and the characters are only vehicles for weirdness. In the author interview at the end of my edition, Wallace admits that the dying father narrative was only added in to impose some kind of traditional structure. Still, it’s that real-world component that gives the book meaning, revealing themes of emotionally distant fathers and self-mythologizing. A reviewer, in reference to the Big Fish movie adaptation, said, “A well-told lie illuminates the truth in far better clarity than a simple recitation of the facts ever can.” Given this idea, I somewhat expected the fantasy scenes in this book to have real-world equivalents, like in Neal Shusterman’s Challenger Deep, but any parallels are most likely coincidental rather than intentional. For example, in one of the earlier scenes, Edward Bloom attempts to leave his hometown but instead ends up in a sort of purgatory. You get the sense that all the townspeople in this middle place are stuck in stasis after having failed to achieve the big dreams they once had. The desire for escapism is also evident throughout the story, namely in how Bloom wanted to elevate his own importance in the eyes of others by always playing hero. Humans are social beings, and it’s a fairly universal feeling to want to be remembered as “big fish,” to be interesting and accomplished and well-liked.The strangeness of Big Fish also made me question some of my own assumptions about storytelling. Do stories need to have a “point”? Do they have any obligation to teach us lessons or reaffirm our values? What is it that we so love about the conventional three-act narrative?I was fascinated by the quotes on the author’s Wikipedia page as well. He has said of his past writing endeavors that “The pure pleasure of invention, of making stuff up, clouded over everything else. I couldn’t tell the difference between a good story and a good story told well.” I also related to his feelings about the magic of words appearing on the page: “I write things I didn’t know I was capable of writing, and sometimes that feels like magic. It isn’t; it’s just me.” Wallace’s general attitudes toward the craft provide insight into his writing process, which seems to be purely improvisational. Big Fish reads like freewriting with zero preplanning, the author’s subconscious ideas somehow floating to the forefront. \nThe Bottom Line:\n Despite the story’s utter lack of forward momentum, the short chapters and vibrant prose made this an enjoyable read; I think writers can learn a great deal from how Wallace constructs a sentence."}, {"userName": "Elaine", "userReviewDate": "Apr 26, 2017", "userURL": "http://www.goodreads.com/user/show/16316375-elaine", "userReview": "My introduction to Big Fish was through the movie over 12 yrs ago. I really enjoyed it. I remembered it as a fun and sort of lighthearted tale with an underbelly of serious lessons to be learned. While I am not a big fan of fairy tales I do enjoy folk tales. I grew up listening to my very southern grandfather tell me how he rigged up matchboxes full of dirt for large beetles to pull and how he \"shot a bear off a horse\". I am no stranger to a \"whopper\". When being told a whopper your job as the listener is not to question the story. Your job is to imagine these wonderful tales and laugh and beg for more!This lyrical story pulled me right in. Each chapter is an individual tale all coming together to paint the picture that was Edward Blooms extraordinary life. Some of the \"chapters\" weren't even a whole page while others where much longer. The writing was easy to follow and I have no complaints in that regard.A sort of doom and gloom hung over the book. As the story progressed it became pretty depressing and I liked Edward less and less as a character. However, the books main focus seemed to revolve around the relationship between a child and a parent. Edwards son narrates the novel telling the reader about the life his father lead, a life of mythic proportions. As the reader you literally observe a child, and not a child necessarily only in age, leaving behind the idealized view of a parent. In this regard the author succeeded immensely. I was reminded of Go Set A Watchman. Towards the end of the novel Scout is told that as a young child she confused her father with God and the failings she currently sees in her father where always there if she had just looked. In Big Fish we are told about the perception of Edward Bloom, not the reality. The way EVERYONE saw Edward, not the way he was. I haven't read much in the way of magical realism so I hope I'm using the term correctly when I say this book isn't exactly what it appears to be. As the reader you are required to peel back the curtain and look beyond what is being presented. Otherwise you're getting a small collection of folk tales revolving around a single character.In the end I went with 3.5 stars but rounded up to 4. I didn't dislike the book. I found the message slightly depressing and was left with a feeling of sadness upon my completion of the book. I enjoyed the stories and I know I will be thinking of this book often."}, {"userName": "Xueting", "userReviewDate": "May 22, 2017", "userURL": "http://www.goodreads.com/user/show/4691420-xueting", "userReview": "I had the great fortune and pleasure to have Daniel Wallace as my Intro to Fiction writing professor this spring at Chapel Hill. He was thoughtful, funny and most of all very sweet to all of us in the class. And I could feel his sentimental kinda old soul in the words of this book. So the story is made up of vignettes or short stories, the structure has a 'purpose' that I don't know how to capture without sounding too flimsy-fantastic, and fantasy's not all it is. To me it's important not just to decide what we (the reader) believe in in the stories and why, but also to realise that the decision is basically the question of the kind of 'truth' each belief creates. And Daniel Wallace connects the magical bits to the more obviously and fully real-life bits, while leaving little overlaps so we can make our own decision how they connect. I loved some of the little vignettes more than others, and the last one was probably my favourite. Some of the stories did feel disjointed and, to be honest, cliched or over-hyperbolised in a not so pleasant way, but still those flaws made me think about the flaws of our memory-making processes and how they added some unexpected sentimentality to the story when I think about who's telling the story, and now I realise I think about the storyteller point-of-view a lot as I read the book... Anyway I thought it was original and very interesting especially in terms of characterisation. I can't wait to check out the movie!!"}, {"userName": "Lauren Stoolfire", "userReviewDate": "Sep 09, 2017", "userURL": "http://www.goodreads.com/user/show/6857324-lauren-stoolfire", "userReview": "I had no idea that this story started off as a novel after having loved the Tim Burton film starring Ewan McGregor. As soon as I realized that fact, I had to try it for myself - and I tackled it as a part of #TheReadingQuest. While I ended up liking the book well enough I have to admit that I absolutely adore the movie. There are quite a few differences between the book and the movie, but I'd say the changes are to the film's advantage. Overall, though, I think the film has the tone and the spirit of the story, but it's presented in more of a linear fashion. Plus, the coda from the film gives the viewer a little peek at the truth behind the myth of Edward Bloom, whereas the book leaves us to make up your mind with multiple versions of the ending. Overall, I can't recommend the movie enough and I recommend the book to those that are very interested in magical realism or seeing how myths and legends look in a modern setting."}, {"userName": "Susan Tunis", "userReviewDate": "Apr 06, 2013", "userURL": "http://www.goodreads.com/user/show/2870840-susan-tunis", "userReview": "My father is a fishMy best friend is a little obsessive about reading the novel before seeing the film. Not so, me. I’m a bit more laissez faire in these matters. I saw and thoroughly enjoyed Tim Burton’s 2003 adaptation of Big Fish, and didn’t think too much more about it. Fast forward a decade, and I hear that a major, Broadway-bound musical is on the way. Now I know it’s time to return to the source material.In the past, it has occurred to me that I have an overdeveloped sense of whimsy. I’m a middle-aged woman, for God’s sake. But I love this sort of light, heart-warming, and above all whimsical tale. Daniel Wallace’s debut novel charmed my socks right off! It is, first and foremost, a tale of paternal and filial love. The brief novel is told through the eyes of son William as he watches—four separate times—his father Edward dying. It doesn’t sound like an upper, I know, but Edward Bloom is a larger-than-life character.All his life, Edward was a teller of jokes and tall tales. He’s the sort of character who charms everyone around him. And yet, as much as his father has always made him laugh, William feels that all the jokes and stories have kept him at arm’s length, and that he’s never really gotten to know his father. Now in these final hours, he seeks a deeper connection—all while a greatest hits montage of tall tales recounts Edward’s extraordinary, eventful, and one might even say mythic, life. Edward confesses to his son, “I wanted to be a great man… Can you believe it? I thought it was my destiny. A big fish in a big pond.” Later William acknowledges, “He’s just being him, something he can’t not be. Beneath one façade there’s another façade, and another. And beneath that, the aching dark place, his life.” By the end, however, each man gets what it is he needs:“His illness was his ticket to a better place. I know this now. Still, it was the best thing that could have happened to us, this final journey. Well, maybe not the best thing, but a good thing, all things considered. “In Wallace’s novel, it’s the journey, not the destination. The folksy fables that make up Edward’s life are as colorful and imaginative as anything you could wish for, and full of humor. And Daniel Wallace’s narrative voice is distinctive, as well as distinctly Southern. He has a wonderful, playful way with language, as with this passage: “This is what is meant by last words. They are keys to unlock the afterlife. They’re not last words, but passwords, and as soon as they are spoken you can go.” While Edward is more legend than man, it is William who is the emotional core of the novel. He’s what keeps the story grounded and creates resonance with readers. Everyone knows what it is to love (and feel frustrated by) a parent, and so the emotion William experiences is universal.This was a fantastic introduction (15 years late) to a new novelist. I can’t wait for a chance to see the musical! It will be magical on the stage. It’s been years since I’ve seen the film, but Burton did a lovely adaptation. Many of the stories from the novel are recreated faithfully. Others are altered or created from scratch in the same voice. I was delighted to discover in the book passages that never made it into the film as well. Commenting on adaptation on his blog, Wallace noted that Big Fish was now a book, a movie, and a musical. He offered one final adaptation. Big Fish, the haiku:He hides behind liesand charm. I do not know him.My father is a fish."}, {"userName": "Graydon Panzica", "userReviewDate": "Feb 19, 2014", "userURL": "http://www.goodreads.com/user/show/15891429-graydon-panzica", "userReview": "This book. Was wonderful. I started it yesterday, and probably would have finished it way earlier today if I hadn't had work. It's a very quick read, and left me feeling refreshed and ready for more, sad to see it end but feeling fulfilled."}, {"userName": "Shoa Khan", "userReviewDate": "Mar 18, 2015", "userURL": "http://www.goodreads.com/user/show/23794303-shoa-khan", "userReview": "This is the story of Edward Bloom, who is dying, narrated by his son, who in turn takes the tale to mythic proportions (as suggested by the subtitle).This is quite a short read seeped in wonder, legend and magic realism."}, {"userName": "Melika", "userReviewDate": "Jul 24, 2015", "userURL": "http://www.goodreads.com/user/show/24018914-melika", "userReview": "خاص بود؟! آره. اولش رو هم خیلی خوب شروع کرد و تا چندین و چند صفحه خیلی خوب پیشرفت و هی آدم میخواد بیشتر بدونه ولی وسطاش تا نزدیک ِ انتهاش یه حالت ِ خنثی ِ بدی داشت. یعنی اون جذبه ی اول ِ کتاب به کل ناپدید شده بود. توی اون صفحات آسون نمیشد ادامش داد ولی در کل خوب بود."}, {"userName": "Abby", "userReviewDate": "Dec 07, 2008", "userURL": "http://www.goodreads.com/user/show/1069403-abby", "userReview": "I think the guy who plays the main character in this movie is attractive, but I forgot his name. If that's not a good reason to read the book, then I don't know what is."}, {"userName": "Orbi Alter ", "userReviewDate": "Feb 22, 2018", "userURL": "http://www.goodreads.com/user/show/7571837-orbi-alter", "userReview": "Simpaticna, njezno duhovita bajka :)"}, {"userName": "Phyllis", "userReviewDate": "Mar 23, 2008", "userURL": "http://www.goodreads.com/user/show/879601-phyllis", "userReview": "While I was reading this book, I kept wondering if I liked it. It seems the more I read, the better it was, especiallyat the end, which made me smile. It wasn't until the endof the book, that it made sense in it's entirity. I loved the ending in this book. All the mythology and exaggeration,made me question the value of the story, at first I onlyseemed to attend to the father/son conversations that I feltwere real and poignant. Little by little, I started to appreciate Wallace's use of mythology to tell his story, andunderstood his talent as an author."}, {"userName": "Asghar Abbas", "userReviewDate": "Oct 13, 2015", "userURL": "http://www.goodreads.com/user/show/37421322-asghar-abbas", "userReview": "A novel with a BIG heart; tailor-made for Tim Burton and he totally made a movie out of it. Read it."}, {"userName": "Hana", "userReviewDate": "Feb 15, 2015", "userURL": "http://www.goodreads.com/user/show/10571559-hana", "userReview": "True story. My grandfather was an incurable joker. Also an incurable smoker. He always joked to his doctors that \"It's not the cough that carries you off, it's the coffin they carry you off in!\" The day after he died in the early 1960s the whole family was sitting in the living room remembering him when the telephone rang. My uncle answered and came back laughing but with the tears streaming down his face.\"What? What is it?\"\"They asked for Joe. I...I said he wasn't available. They said to tell him his subscription to Life is up!\"I have to read this book."}, {"userName": "J. Bookish", "userReviewDate": "Aug 03, 2017", "userURL": "http://www.goodreads.com/user/show/6382906-j-bookish", "userReview": "Oddly enough, this book is the third incarnation of Big Fish I've consumed. To be honest, though, I don't think I would have loved it so much if it weren't for the movie and the musical bolstering it. All three pieces together create an odd but beautiful combination of story, visuals, and sound and IT IS INCREDIBLE. Absolutely love the way this story takes hold of the imagination."}, {"userName": "Altay Aktar", "userReviewDate": "Feb 22, 2017", "userURL": "http://www.goodreads.com/user/show/40808937-altay-aktar", "userReview": "\"Bir adamın anlattığı hikâyelerin hatırlanması o adamı ölümsüz kılar, bunu biliyor muydun bakalım?\""}, {"userName": "Sunshine Manuli", "userReviewDate": "Aug 19, 2014", "userURL": "http://www.goodreads.com/user/show/31851722-sunshine-manuli", "userReview": "Not only is \"big Fish\" a simple story about life and death , but also it is a story about the relationship between a son and a father. Every single human being has stories to be told which in fact belong to us as a part of our life , but everyone of Edward's stories told by his son William forms a \"novel of mythic proportions\" as the title suggests. Persuading giants, helping people, taming wild dogs and other heroic acts, William thinks that he does not really know who his father is, just only through these fantastic and extraordinary legends. But what William wants is to see his real father and what his feelings and thoughts are. Also, the version of Pinocchio in flesh and blood (William) knows that this could be the last chance to sort this mistery out or maybe William has to accept Edward just the way he is.From my perspective, this story is very moving and emotional. It is really well-thought out and well-written. It is dramatic and funny at the same time. Finally, I'd like to say that I really like the part of the story in which William and Edward are talking about religion and Edward answers him through a joke about Jesus and Pinocchio. From my point of view, the moral of this joke is really important and meaningful that is: his son is the best thing he did in his life."}, {"userName": "Arghavan", "userReviewDate": "Feb 18, 2014", "userURL": "http://www.goodreads.com/user/show/7531404-arghavan", "userReview": "ورژنِ تیم برتون ش رو دوست‌تر می‌داشتم. داستانِ زندگیِ ادوارد رو پیوسته‌تر نشون داده‌بود؛ و یه اپیزودِ داستان رو به همون اپیزود محدود نکرده‌بود؛ شخصیت‌ها از بخشِ خودشون سرک می‌کشیدن به بخش‌های دیگه. و خب فانتزی‌تر و کیوت‌تر بود؛ ضمنِ این که من اون رو خیلی وقت پیش دیدم و ضمنِ این که اساساً تیم برتون خداست.این، یه مقدار فصل‌هاش گسسته‌تر بود. جای بازی‌های عـالیِ فیلم، توصیف‌ها و تشبیه‌های خوب داشت. فضا رو یه مقدار دراماتیک‌تر کرده‌بود جای فانتزیِ تیم‌برتونی. ولی مسلماً درنوعِ خودش خیلی خوب بود این هم. هرچند که با تقریبِ خوبی می‌تونم بگم اگه این رو قبل از دیدنِ فیلم‌ش خونده‌بودم، باز هم فیلم رو دوست‌تر می‌داشتم؛ ولی خب. چیزِ خوبی بود این هم.و این که راضی بودم؟.. نمی‌دونم؛ انتظارِ دیگه‌ای هم نداشتم خیلی. چی می‌تونه جایِ تیم برتون رو بگیره واقعاً؟! :ی"}, {"userName": "Sanja_Sanjalica", "userReviewDate": "Aug 16, 2015", "userURL": "http://www.goodreads.com/user/show/8096368-sanja-sanjalica", "userReview": "4.5Interesting, sweet, well written. I first saw the movie and didn't get it at all, maybe I was too young. So I didn't expect too much of the book, but it really surprised me."}], "description": "He could outrun anybody, and he never missed a day of school. He saved lives, tamed giants. Animals loved him. People loved him. Women loved him (and he loved them back). And he knew more jokes than any man alive.Now, as he lies dying, Edward Bloom can't seem to stop telling jokes -or the tall tales that have made him, in his son's eyes, an extraordinary man. Big Fish is the story of this man's life, told as a series of legends and myths inspired by the few facts his son, William, knows. Through these tales -hilarious and wrenching, tender and outrageous- William begins to understand his elusive father's great feats, and his great failings.", "title": "Big Fish", "url": "http://www.goodreads.com/book/show/129984.Big_Fish", "average": 3.65, "cover": "https://images.gr-assets.com/books/1348134701l/129984.jpg", "reviews": 1450, "authors": [{"url": "https://www.goodreads.com/author/show/15393.Daniel_Wallace", "name": "Daniel Wallace"}], "type": ["Fantasy", "Fiction", "Magical Realism", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/129984.Big_Fish", "http://www.goodreads.com/book/show/7455221", "http://www.goodreads.com/book/show/26048682-big-fish", "http://www.goodreads.com/book/show/22394370-big-fish", "http://www.goodreads.com/book/show/14569000-big-fish", "http://www.goodreads.com/book/show/607584.Big_Fish", "http://www.goodreads.com/book/show/30826374-krupna-riba", "http://www.goodreads.com/book/show/11468206-b-y-k-bal-k---efsanevi-l-lerde-bir-roman", "http://www.goodreads.com/book/show/27441.Mr_Sebastian_and_the_Negro_Magician", "http://www.goodreads.com/book/show/15803016-the-kings-and-queens-of-roam", "http://www.goodreads.com/book/show/27443.The_Watermelon_King", "http://www.goodreads.com/book/show/31451136-extraordinary-adventures", "http://www.goodreads.com/book/show/159342.Ray_in_Reverse", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/25353286-provenance", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}