{"ratings": 11064, "userreviews": [{"userName": "karen", "userReviewDate": "Dec 06, 2016", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "congratulations, 2017 goodreads choice winner in graphic novel & comics!!\noooh, goodreads choice awards semifinalist for best graphic novel! what will happen?\n\nthis is both very similar to and very different from Adulthood Is a Myth.thematically, much of the same ground is covered: procrastination, social awkwardness, the joy of comfortable clothes, the irritants that go along with being female, self image, and the bullying inner voice we all have that keeps our ego in check.however, while adulthood was a collection of unrelated cartoons (and NOT a graphic novel, goodreads), this one contains some longer-form pieces where we get more insight into what makes sarah andersen tick, which makes it a good companion book to Introvert Doodles: An Illustrated Collection of Life's Awkward Moments, as both address the difficulties the authors have with the world's expectations of being a social person to someone who is not naturally that way inclined, and how much human interactions can suck.\n and as honest and laudable as I Don't Know How to Be a Person was, i'm much more drawn to one of the other long-form pieces called SADIE (How I Learned to Get Over Myself and Love Cats), which is about how she went from being alienated by the internet's catcentric obsession:\nto accidentally becoming a crazy cat lady like the rest of us through the fuzzy mind-control of a loaner-cat named sadie.\nand now she is one of us\nwell done, sadie! more bodies for the calvary!as with adulthood, there are plenty of scenarios very familiar to my own experiences. some that i think are true for many:\n\nsome that i know are familiar to all the ladies out there:\n\nand some that fall into the \"i thought i was the only one!!\" category:\nthere's also some nice giggle-pokery at insufferable people\nand, while i understand it is not the point she is making, i am interpreting this to be a bold anti-bird stance, which you know i'm on board with\nso, another fun and funny collection which only strengthens my resolve to be sarah andersen's bestie. sarraahhhhhh…. come to maaaaaaggie!!\nalthough this will probably not be tolerated.\n***************************************************i did not turn my computer on once during the holiday weekend. and it felt great, but also very stressful. so when i saw the first cartoon in this collection, my heart recognized a kindred spirit:\nthank you for putting my feelings into pictures, sarah andersen!full review to come********************************someone plz gimmie a heads-up if this comes onto netgalley!!"}, {"userName": "Aneela ♒the_mystique_reader♒", "userReviewDate": "Jan 26, 2017", "userURL": "http://www.goodreads.com/user/show/29923106-aneela-the-mystique-reader", "userReview": "Sarah Andersen is the \"Queen of Relatable Humor\". I laughed at every single page saying \"Yeah, I can totally relate to this and this and this and.......\"The way she has illustrated social anxiety and over-thinking is just superb. With her awesome sense of humor she has become my favorite author. Love her a lot!I can't wait to get a copy of Big Mushy Happy Lump for myself and I am already waiting (eagerly) for the next one. Yes, yes, I am that greedy for her books! \nHere are some of my favorite pages:\n\n\nThat's exactly how I spend my money\n\n\nEverytime!\n\n\nAnd when I read the lyrics of my favorite song\n\n\nGuilty as Charged\n\n\nExactly! Hurt my babies and I will roll you like flat breads\n\nARC of this book was provided by Andrews McMeel Publishing via NetGalley in exchange for an honest review."}, {"userName": "Shelby *trains flying monkeys*", "userReviewDate": "Dec 26, 2016", "userURL": "http://www.goodreads.com/user/show/1053760-shelby-trains-flying-monkeys", "userReview": "2.5 stars.I know. I'm that mean heifer. I love this author's work, but if I'm going to shell out my hard earned monies that I earn at a job I hate..it's got to be for some new work.Not just a re-hash of stuff I've already seen.For example:\nI do admit to thinking the above image is one of the most fantastical things ever, but to put it back in book two? Umm I'm not a fan of that.There is plenty of wonderful in this one..\nI'm still going with being a hater and liking her first book way more.Booksource: Netgalley in exchange for review."}, {"userName": "Elyse", "userReviewDate": "Mar 06, 2017", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "\"Has anyone ever told you that sometimes, maybe, you can be......\"\"DRAMATIC?\" \"No Baby\"\"HAPPY\"Sarah Andersen's scribbles collection is ADORABLE!!!!  and hilarious, for both men and women of all ages. Life can be messy, and painful. Sarah Andersen is sweetly funny and moving....filled with with \"personal essays on Sarah's real-life experiences\".....with adult challenges! Completely Lovable!!!Thank You Netgalley. Andrews McMeet Publishing, and Sarah Andersen"}, {"userName": "Nat", "userReviewDate": "Feb 16, 2017", "userURL": "http://www.goodreads.com/user/show/23381142-nat", "userReview": "I was mentally and emotionally spent after having read Hannah Kent’s Burial Rites, so this comic collection fit perfectly for my need of something light and easy to cheer me up. I also found Big Mushy Happy Lump a lot more enjoyable and relatable than Andersen's previous collection, so that left me with an ever bigger smile plastered on my face.Sarah Andersen's second collection picks up right where the first left off–huddled under a pile of blankets avoiding the responsibilities of the real world. These new comics (and illustrated personal essays!) follow the ups and downs of the unrelenting self-esteem roller coaster that is young adult life: budgeting woes, cramps, the nuances of sweather theft, and the joy of staying home all day with a box of pizza. All aboard.So without further ado, here are some of my favorite pieces:\n\n\nI hate how relatable the above one is….\nI laughed out loud at “punch the sun.”\n\nReminded me of the song Take a Hint from the show Victorious.\nThis genuinely happened to me today!! And I was stunned when I read the lyrics and discovered how they didn't fit my expectations in the least.\nWhere is the lie!!!\nThis is me. This is who I am.\n“Let's just cuddle in spirit made me burst into laughter. \nI hate when this happens!!\n\nI snorted at the description of “a greasy onion.”\nI feel personally attacked by this.\n\n\nOverall, I was more than surprised by how much I enjoyed Big Mushy Happy Lump. Particularly the addition at the end of personal essays combined with comics were surprisingly fun to read. This time around, I cannot wait for more of Andersen's comics!ARC kindly provided by the publisher in exchange for an honest review.Expected publication: March 7th, 2017\nNote: I'm an Amazon Affiliate. If you're interested in buying\n Big Mushy Happy Lump, just click on the image below to go through my link. I'll make a small commission!\nThis review and more can be found on my blog."}, {"userName": "Nostalgia Reader", "userReviewDate": "Jul 20, 2016", "userURL": "http://www.goodreads.com/user/show/6560108-nostalgia-reader", "userReview": "[HOLY CRAP YOU GUYS THERE'S GONNA BE ANOTHER COLLECTION, THIS IS VERY IMPORTANT, LIFE-CHANGING NEWS. (hide spoiler)]"}, {"userName": "C.G. Drews", "userReviewDate": "Mar 01, 2017", "userURL": "http://www.goodreads.com/user/show/11375137-c-g-drews", "userReview": "I really enjoyed the first Sarah Scribbles book so I was pretty excited to read this one!! It was, of course, SUPER RELATABLE for anxious introverts. Although I didn't think it was quite as relatable as the first one. For starters: I don't like cats (#allergic) and I don't steal the larger comfy sweaters of humans in my life (I don't have larger humans in my life and I don't like touching other people's clothes...no thank you). BUT!! There were comics on forgetting everything but remembering excruciatingly painful things...spending tons of money on books but being a scrooge elsewhere...avoiding humans....trying to talk to a human but instead being just an awkward cabbage...and watching your motivation bust a hole in the wall and run away from you forever.Dude, #relatable.The whole comic didn't quite tie together as nicely as the first though, hence just the 3 stars.But it was still so fun!! Thoroughly recommend!!"}, {"userName": "Alex ☣ Deranged KittyCat ☣", "userReviewDate": "Dec 27, 2016", "userURL": "http://www.goodreads.com/user/show/13555222-alex-deranged-kittycat", "userReview": "Sarah Andersen, I love your drawings! I could say that it feels as if she can crawl inside my head and see my most intimate thoughts and frustration. But I see many other people feel the same way. So I want to thank Sarah for showing me that there are other people such as myself out there. And I hope that she will publish many more Sarah's Scribbles books/comics. *I thank Sarah Andersen, Andrews McMeel Publishing, and Netgalley for this copy in exchange for an honest review."}, {"userName": "Amalia Gavea", "userReviewDate": "Mar 17, 2017", "userURL": "http://www.goodreads.com/user/show/56789747-amalia-gavea", "userReview": "I know now who my ever- faithful companions for life are. Meet Mister Social Anxiety and Mister Over-Thinking while Mister Crippling Lack of Self-Confidence appears in many Oscar-worthy cameos. And these gentlemen are gloriously presented by the pen of the magnificent and ridiculously talented Sarah Andersen.I feel so connected to the wonderful character Andersen has created. The introverted, procrastinating, awkward me was constantly nodding in agreement over every sketch. It is a glorious feeling when you close a cute, little book and you discover you have a big smile on your face. And let me tell you, the world of antithesis between introverts and extroverts that Sarah has created is a very pretty, amusing, and comforting place........and a little terrifying, but I have my shock-blanket just to be on the safe side..."}, {"userName": "David Schaafsma", "userReviewDate": "Apr 25, 2017", "userURL": "http://www.goodreads.com/user/show/269235-david-schaafsma", "userReview": "Second collection of Sarah Scribbles, more of the same, funny, light, focused on her introversion, lack of self-confidence, social anxiety, body image, guys vs women. . . . her life, basically. Some pieces on art. I smiled throughout, sometimes laughing aloud. Adorably self-deprecating. You don't know who this is? Here's some of her stuff:http://www.gocomics.com/sarahs-scribbles"}, {"userName": "Megan Johnson", "userReviewDate": "Apr 05, 2017", "userURL": "http://www.goodreads.com/user/show/31853583-megan-johnson", "userReview": "After reading Sarah Andersen's first book of comics, I couldn't resist checking this one out. Luckily, it was just as cute as the first one and just as enjoyable. If you enjoy those cute, relatable comics that everyone seems to enjoy sharing on social media - you MUST check this out. Every one of these had me giggling and appreciating Sarah Andersen's humor. Not to mention, the artwork is so well done in it's simplicity and there's really something for everyone to enjoy. I mentioned in my review of her first collection that these comics seemed unrelated to one another and that there wasn't a cohesive story told. In this one, that's mostly still the case with the exception of a few towards the end where a few of them are grouped with an additional text to tell a short story that reads like it's a personal account from the author. Even in this different formatting, the comics are relevant and enjoyable. What did I think?: I enjoyed this collection of comics just as much as the first, and as a new Sarah Andersen fan I am excited about seeing more of what she creates and shares with her audience in the future. Who should read it?: If you've enjoyed other work by Sarah Andersen or are looking for a fun, easy read then I highly recommend you check this out. I read this in one sitting and then flipped back through several times and shared my favorites with friends - there's something for everyone and this is one I can see picking back up on occasion for years to come. WEBSITE | TWITTER | FACEBOOK | INSTAGRAM"}, {"userName": "Ahmed  Ejaz", "userReviewDate": "Nov 14, 2017", "userURL": "http://www.goodreads.com/user/show/53694260-ahmed-ejaz", "userReview": "WOW! Again I am amazed how she has created humor out of real life situations. Adulthood is a Myth was also a relatable and humorous read. And so was this one. Another thing I liked about this comic is that, this time Sarah wrote personal essays on 'mostly she doesn't like popular things' and 'how she came to love cats' and 'her being a sweater theif'. Last one was uniquely weird. But I liked that too. :pAll in all, I highly recommend both, this one and Adulthood is a Myth. You will love them because they both are very relatable in a humorous way. \nMY FAVOURITE PARTS\n...There are more, but I am too lazy to upload all of them. 14 November, 2017"}, {"userName": "Maede", "userReviewDate": "Oct 20, 2017", "userURL": "http://www.goodreads.com/user/show/28210578-maede", "userReview": "سارا اندرسن عزیز؛ تو هیچوقت این ریویو رو نمی خونی ولی کتاب کوچکت منو تو یکی از سخت ترین و دردناک ترین هفته های زندگیم خندوند و باعث شد برای چند لحظه فراموش کنم و تو دنیای ساده ی گربه و سویشرت و درگیری های روزمره غرق شمو فکر می کنم این انتهای رسالت بعضی کتاب هاستازت ممنونم 96.7.26"}, {"userName": "Nazanin", "userReviewDate": "Jan 02, 2018", "userURL": "http://www.goodreads.com/user/show/39893246-nazanin", "userReview": "3.5 StarsNot as funny as the first book, but wasn’t that bad. Just wasn’t really great like the first one!"}, {"userName": "Nenia ✨ Queen of Literary Trash, Protector of Out-of-Print Gems, Khaleesi of Bodice Rippers, Mother of Smut, the Unrepentant, Breaker of Convention ✨ Campbell", "userReviewDate": "Mar 25, 2017", "userURL": "http://www.goodreads.com/user/show/2190064-nenia-queen-of-literary-trash-protector-of-out-of-print-gems-khalees", "userReview": "Instagram || Twitter || Facebook || Amazon || PinterestOh, Sarah Andersen. I love you the way Californians love avocados.I've been purposely putting off reading my ARC of this book. Not because I thought it was going to be bad, mind, but because I enjoyed ADULTHOOD IS A MYTH so much that I wanted to savor the anticipation of reading this book because I knew it would be at least another year or more until Andersen published a new one. That can't be too weird, right? Surely I'm not the only person who avoids reading books they're excited about...right?Like ADULTHOOD IS A MYTH and HYPERBOLE AND A HALF, BIG MUSHY HAPPY LUMP explores many common problems that introverts, millennials, women, and book lovers will be able to relate to.For example:Why does puberty suck for women so much more than it does for men?Why are periods so damn inconvenient, not to mention inconsiderate?Why is talking to people so hard?Why do we all love cats so obsessively?Why do we throw so much money away on books?Why are we cold all the time, even with a sweater?Why do we like this thing?There isn't a lot to say. I liked ADULTHOOD IS A MYTH and I liked BIG MUSHY HAPPY LUMP. My fear was that LUMP might be nothing more than a reprisal of ADULTHOOD and I am happy to say that my fears were misguided. LUMP stands on its own, and it is both endearing and hilarious.Thanks to the publisher/Netgalley for the review copy! 5 stars!"}, {"userName": "April (Aprilius Maximus)", "userReviewDate": "Mar 14, 2018", "userURL": "http://www.goodreads.com/user/show/20658145-april-aprilius-maximus", "userReview": "I freaking love these books"}, {"userName": "Erin", "userReviewDate": "Mar 15, 2017", "userURL": "http://www.goodreads.com/user/show/32799998-erin", "userReview": "I love these books. Sarah's Scribbles are short, witty, and hilarious. While I don't have social anxiety ( I just hate people and enjoy solitude) I do understand her battle with over thinking everything and her epic battle against her ovaries. While not as great as book 1 I still found myself giggling and nodding in agreement. Plus boyfriend sweaters are way more comfortable than your own. Highly recommend The Sarah's Scribbles collection. Popsugar 2017 Reading Challenge: Book with an Eccentric Character."}, {"userName": "Scarlet Cameo", "userReviewDate": "Dec 23, 2016", "userURL": "http://www.goodreads.com/user/show/19169870-scarlet-cameo", "userReview": "English review at the bottomCuando leí Adulthood Is a Myth nunca había visto nada creado por Sarah Andersen, ese fue mi primer acercamiento con su obra y puedo decir que me gustó mucho y continué, de vez en cuando, siguiéndole la pista a los post en Facebook que ella realiza, es por ello que para este libro muchos de los cuadros ya no se me hicieron novedosos o fascinantes, de hecho conforme conocí un poco más el trabajo de Andersen muchos de ellos terminaron cayendo de mi encantó, no obstante hay un aspecto que hace que se me haga al mismo nivel que el anterior y es la narración de la autora acerca de cómo estas tiras le han ayudado a crecer y mejorar como persona, más allá de la fama o el reconocimiento que le han traído. Para mi ese aspecto le da un poco más de interés a los dibujos, que por demás siempre han sido autobiográficos. No puedo decir que es la mejor tira cómica que he leído (Mafalda sigue y seguirá teniendo ese trono) pero se mantiene entretenido, no obstante siento que deberían espaciar las salidas de estos libros, no tanto del web cómic, para no morir de éxito, dado que se nota la reiteración de varias ideas y chistes, lograr la \"formula simpson\" (repetir un chiste una y otra y otra y otra vez hasta que te canse y repetirlo nuevamente hasta que vuelva a gustarte) es bastante complicado especialmente en espacio tan limitado por lo que lo mejor sería no sobreexplotar a este simpático personaje.A digital copy of this book was provided by NetGalley______________________________________When I read  Adulthood Is a Myth I had never seen anything created by Sarah Andersen, that was my first approach to her work and I can say that I liked it a lot and continued, from time to time, following the post that she puts at Facebook, is why for this book many of the strips were no longer new or fascinating, in fact as I knew a little more Andersen's work many of them ended up been kind of disappointed, however there is an aspect that makes me put this but at the same level as the previous one and is the author's narration about how these strips have helped to grow and improve as a person, beyond the fame or the recognition that they have brought her. For me that aspect gives a little more interest to the drawings, which have always been autobiographical.I cannot say that it is the best comic strip I have ever read (Mafalda continues and will continue having that throne) but remains entertained, however I feel that they should space the releases of these books, not need it for the comic web, to avoid die of success, since you can see the repetition of several ideas and jokes, achieve the \"simpson's formula \" (repeating a joke over and over and over and over again until you get tired of it and repeat it again until you like again) Is quite complicated especially in space so limited so it would be best not to overexploit this nice character.A digital copy of this book was provided by NetGalley"}, {"userName": "Montzalee Wittmann", "userReviewDate": "Jan 10, 2018", "userURL": "http://www.goodreads.com/user/show/32532051-montzalee-wittmann", "userReview": "A book to bring a smile to my heartSarah knows how to make her art express the everyday life trials in a funny way yet with truth! Her art is fun and heartwarming and I can't help smile at the crazy antics she draws. Another winner of a book! Loved it. Will read it again before returning it to the library. Great fun!"}, {"userName": "Jessi ♥️ H. Vojsk", "userReviewDate": "Dec 04, 2017", "userURL": "http://www.goodreads.com/user/show/66224803-jessi-h-vojsk", "userReview": "Again, a super early christmas present from my wonderful boyfriend. I loved her frist book and I'm also in love with her second book. I will continue reading every comic she makes. You can't stop me! :D"}, {"userName": "Sara Kamjou", "userReviewDate": "Oct 19, 2017", "userURL": "http://www.goodreads.com/user/show/31254457-sara-kamjou", "userReview": "جلد یکش رو بیشتر دوست داشتم شاید چون محوریت بیشتری داشت موضوعاتش.خیلی لذت بردم از خوندن اکثر صفحاتش. بعضی بخش‌هاش نکته‌ش رو نمی‌گرفتم ولی در کل خیلی احساس خوبی بود و بعضی صفحاتش رو برای بقیه به اشتراک می‌ذاشتم تا از این درک مشترک نهایت لذت رو ببریم!"}, {"userName": "Sam Quixote", "userReviewDate": "Dec 29, 2016", "userURL": "http://www.goodreads.com/user/show/5759543-sam-quixote", "userReview": "Sarah Andersen follows up her Goodreads Choice Award-winning book Adulthood is a Myth with Big Mushy Happy Lump, which is essentially more of the same - if it ain’t broke, eh? Andersen’s strips are humorous and self-deprecating snapshots focusing on her insecurities, low self-esteem, lack of confidence, social awkwardness, period pains, and general self-loathing (procrastination) couched within drawings of cute big-eyed/small-bodied figures. That might sound a bit too neurotic but Andersen turns her public therapy into really funny strips. I laughed at the feline Paris Hilton (that vapid face was dead on!) and Sarah’s expression at seeing a puppy in a sweater, and her observations on tattoos and the differences between men/women’s fashion were insightful and clever. She’s doing something different from her first book in the second half of this book by branching out into longer-form narratives. Included are stories on learning to overthink less, the Saga of Sadie (a cute kitty who helped solve her mouse problem and showed her why people love cats), and The Sweater Thief, which was adorable. I can see her maybe moving away from strips soon and building up to a book length-narrative - these encouraging longer pieces definitely show she’s got the storytelling rhythm down. Andersen’s strips are charming and easily accessible and, like many other readers I expect, I identified with her anti-social tendencies to be alone, watching Netflix or reading, over mingling with real people in the real world - blech! Combine that with self-awareness, imagination, comedic timing and wit and it’s not hard to see why people respond to her books. Not all the strips are home-runs and a few feel like retreads of similar strips from the first book, but Big Mushy Happy Lump is still a very enjoyable, fun read - fans of Sarah’s Scribbles will love this!"}, {"userName": "Korrina  (OwlCrate)", "userReviewDate": "Mar 27, 2017", "userURL": "http://www.goodreads.com/user/show/37437502-korrina-owlcrate", "userReview": "I love Sarah's comics so much and have read them for ages. Finally convinced myself to buy her new book and I'm so happy I did. I laughed out loud so many times, and so strongly relate to everything she does. I know I'll pick this book up and flick through it whenever I need a smile. If you're introverted, shy or deal with anxiety, I think you'll find a lot to relate with here."}, {"userName": "Cyndi", "userReviewDate": "Dec 09, 2017", "userURL": "http://www.goodreads.com/user/show/7132123-cyndi", "userReview": "This book has gotten a lot of hype and I wondered if any of it was justified. It is. The art is simple and adorable while hitting so many issues right on the head. Of course I loved the panels we’ve all seen so many times of the heroine spending conservatively everywhere but the book store. Most of us readers would happily spend more money on books. But there are also excellent panels on puberty, college debt, and periods. Definitely worth reading for a few chances to get a chuckle at real life. 😊"}, {"userName": "Fatima", "userReviewDate": "Nov 08, 2017", "userURL": "http://www.goodreads.com/user/show/48234354-fatima", "userReview": "جالبه برام که من هر کمیکی رو به خودم زحمت ورق زدنش رو هم نمیدم ولی کمیک های سارا اندرسن رو حتی تو اینستاگرامم هم اعلان پستش رو روشن گذاشتم تا کارای جدیدش رو به موقع ببینم .شخصیتی که سارا کمیک هاشو میکشه گاهی فقط شبیه خودم هست اما بیشتر اوقات منو یاد یه دوستی میندازه که ۸۰ درصد کاراش همیشه تو کمیک های سارا برام زنده میشه و یه جورایی کیوته و برای خودشم میفرستم و میگه این که منم ! جالب و بانمکه و فرصت خوبی برای شیرین شدن مون بعد خوندن کتاب هایی جدی و پر صفحه و گیج کننده میتونه باشه ..."}, {"userName": "Mollyvknize", "userReviewDate": "Oct 18, 2017", "userURL": "http://www.goodreads.com/user/show/60324595-mollyvknize", "userReview": "Sarah první knize Dospělost je mýtus jsem dala 4*, protože jsem si říkala ,,Ty jo, přece nemůžu dát 5* komiksu s vtípky a pak 5* nějakému propracovanému románu... To by bylo divný, ne ...?\" A víte co, kašlu na tooooo!!! Dám tomu 5*, protože to bylo božíííííí a já jsem se řáchala doma na celý kolo! Miluju Tě, Sarah (ale svetr Ti nepůjčím, ty zlodějko!)."}, {"userName": "Jilly", "userReviewDate": "Dec 25, 2017", "userURL": "http://www.goodreads.com/user/show/25894509-jilly", "userReview": "For what it is, this is cute and relatable."}, {"userName": "Omnya", "userReviewDate": "Mar 08, 2017", "userURL": "http://www.goodreads.com/user/show/28999438-omnya", "userReview": "4.5this book is even better than the first onestill awesome and hilarious but this one was so relatable to meespecially the chapter named \" i don't know how to be a person\"it was a really fun reading"}, {"userName": "Arezu Wishka", "userReviewDate": "Aug 07, 2017", "userURL": "http://www.goodreads.com/user/show/11570887-arezu-wishka", "userReview": "من متوجه شدم که ما یه سری کتاب ها رو برای این می خونیم که حس کنیم درک می شیم و کتاب های تصویری سارا اندرسون دقیقا این حس درک شدن رو به دوست داشتنی ترین شکل به آدم می ده و به خاطر همین از لحظه ای که شروعش می کنی نمی تونی زمینش بذاری."}, {"userName": "Sarah", "userReviewDate": "Apr 07, 2017", "userURL": "http://www.goodreads.com/user/show/49360584-sarah", "userReview": "I relate to this comic book on a spiritual level.It was very funny, awfully adorable and really enjoyable."}], "description": "Sarah Andersen's second comics collection picks up right where the first left off - huddled under a pile of blankets avoiding the responsibilities of the real world. These new comics (and illustrated personal essays!) follow the ups and downs of the unrelenting self-esteem roller coaster that is young adult life: budgeting woes, cramps, the nuances of sweater theft, and the joy of staying home all day with a box of pizza. All aboard.", "title": "Big Mushy Happy Lump\n      \n          (Sarah's Scribbles #2)", "url": "http://www.goodreads.com/book/show/30754980-big-mushy-happy-lump", "average": 4.31, "cover": "https://images.gr-assets.com/books/1490071048l/30754980.jpg", "reviews": 1785, "authors": [{"url": "https://www.goodreads.com/author/show/14144506.Sarah_Andersen", "name": "Sarah Andersen"}], "type": ["Sequential Art", "Sequential Art", "Humor", "Nonfiction"], "outlinks": ["http://www.goodreads.com/book/show/30754980-big-mushy-happy-lump", "http://www.goodreads.com/book/show/31825555-big-mushy-happy-lump", "http://www.goodreads.com/book/show/35954910-ubulen-hrom-dka-t-st", "http://www.goodreads.com/book/show/25855506-adulthood-is-a-myth", "http://www.goodreads.com/book/show/35924705-herding-cats", "http://www.goodreads.com/book/show/28177884-sarah-s-scribbles", "http://www.goodreads.com/book/show/34383825-sarah-s-scribbles-2017-2018-16-month-weekly-monthly-planner", "http://www.goodreads.com/book/show/38897088-sarah-s-scribbles-2018-2019-16-month-monthly-weekly-planner-calendar"]}