{"ratings": 1033, "userreviews": [{"userName": "Jeanette  \"Astute Crabbist\"", "userReviewDate": "Mar 09, 2009", "userURL": "http://www.goodreads.com/user/show/796425-jeanette-astute-crabbist", "userReview": "This is an original, unsentimental way of dealing with the subject of loss and grief. I ended up really liking it. I generally avoid books about grieving because they're so fraught with weeping and wailing and heaviness and drama. I don't even have a shelf here for that topic because I just don't gravitate to those books. Sneaky Brad Kessler. He made me want to read it by making it about birds---one of my most loved topics. He weaves in bits about birds, nature, music, poetry, and myth as tools the various characters use while coming to terms with the loss of loved ones in a plane crash off a small island in Nova Scotia. This was hard to pull off and very well done. He leaves you to draw your own conclusions about certain things, but there's a feeling of completeness even if you choose to draw no conclusions at all. I love the cover of this book. It has postage stamps of exotic birds from all over the world."}, {"userName": "Amir", "userReviewDate": "Jan 25, 2012", "userURL": "http://www.goodreads.com/user/show/2090-amir", "userReview": "شاید خیلی موقعیت‌های کتاب آشنا و حتا تکراری باشند و مشابه آنها را پیش‌تر، به‌خصوص در فیلم‌ها، دیده باشیم، اما کتاب لحظه‌ها و حال-و-هوای خوب کم ندارد. بعضی لایه‌های فرعی و اسطوره‌ای هم در طول رمان پیوند و تنیدگی خیل خوبی با خط اصلی داستان پیدا می‌کنند. درنهایت کتابی است که فکر می‌کنم در روایت و تقطیع‌ها خیلی‌ وام‌دار سینماست و اتفاقن نه سینمای خیلی هنری اروپا، بلکه به‌نوعی سینمای خوب امریکایی."}, {"userName": "Pooriya", "userReviewDate": "Sep 28, 2012", "userURL": "http://www.goodreads.com/user/show/1454259-pooriya", "userReview": "کسلر با دیدی هوشمندانه سعی دارد از دگردیسی در دنیای ما سخن بگوید. همان‌طور که در ابتدای کتاب از اووید نقل می‌کند «اکنون آماده‌ام بگویم چه‌گونه اجسام به‌صورت اجسام دیگری درمی‌آیند.» کسلر آمده تا از دگردیسی انسان‌ها، روابط، جایگاه‌ها و اتفاقات نه به‌شکل متافیزیکی، که دگردیسی‌های کاملا ملموس سخن بگوید. مهاجرت انسان‌ها، عشق، تغییر رفتار و رویه زندگی افراد، مرگ و... چیزهایی هستند که برای کسلر نوعی دگردیسی محسوب می‌شوند و او با زبانی بسیار زیبا ایده‌ی نیچه‌ای همه‌چیز همواره درحال شدن است را در سرتاسر کتاب برای ما به تصویر درمی‌آورد. در این بین کسلر از نقد جامعه مدرن ما و به‌خصوص جامعه‌‌ی نوین آمریکا و دگردیسی‌اش از شکل انسانی به شکل یک ماشین سخن می‌گوید. مرگ چندصد نفر مسافر بر اثر سقوط هواپیما، زنی که همسرش را از دست داده، همان زن که حالا می‌خواهد رابطه‌ی جدیدی داشته باشد اما نمی‌تواند، مرد ایرانی مهاجر، مردی که در روابطش با دوست‌پسرش به مشکل برخورده، دختر چینی که فرهنگش تغییر کرده و جرات گفتنش به خانواده را ندارد، غم مردی که به شکل نُت‌های موسیقی از پیانو تبدیل می‌شود و... همه بازگو کننده‌ی تغییر شکلند، تغییر شکل با بالاترین سرعت ممکن، تغییر شکلی که نه می‌توان گفت خوب است نه بد و صرفا باید پذیرفتش، شدن وهمواره شدن به‌مثابه‌ی یک اصل! بسیار این رمان را دوست داشتم با ترجمه خوب شمیم هدایتی که متاسفانه دیگر در بین ما نیست.‏"}, {"userName": "Manik Sukoco", "userReviewDate": "Dec 24, 2015", "userURL": "http://www.goodreads.com/user/show/44105134-manik-sukoco", "userReview": "This novel is undeniably well-written. The description in the opening chapter of the airplane crash, the event that rests at the center of the book, is stunning. Funny, but I feel I got to know Russell better in that one chapter than some of the other characters who stuck around a lot longer. I can't say I disliked any of the characters, except perhaps Pars just a little, but except for Kevin, I wasn't particularly moved by any of them either. If any of the other characters had been featured in the lead role, I might not have finished the book.This is a literary novel. Instead of trotting out an official definition, which vary wildly, I will say that to me, a literary novel cares more about how people and events are described than about what happens. You will hear reviewers use words like poetic, lyrical or elegant. I am not being critical - I wish I could write a literary novel! In my books I tend to drop my characters into a plot and let them go. One reviewer pointed out stuff I didn't see: that the book had x number of chapters to match the number of movements in a piece of classical music, that it is a modern retelling of a specific myth (which is told in the book - see, I caught that!). That is cool, though obviously it didn't increase my enjoyment. Maybe it is like the weird stuff the Beatles started inserting into their songs - imaginative, but not why I love their music.So anyway, I felt a little separated from the characters. Even the dialogue was presented without quotation marks, which gives it - to me - a more passive quality. I use a lot of dialogue in my books, and I think it might be fun to rewrite some of the dialogue to see what I could make of it. I'm not saying it would be better, just different, closer to how I would see them grieving.There is some interesting information about birds and migration to be found here, running as it does through the story, due to the occupation of one of the main narrators of the book. Sometimes fiction is a cool way to learn stuff you might not have the patience to pick up in a dry non-fiction book.So I thought the book was okay. The descriptions at time are vibrant and beautiful, even if I felt the interactions between characters, or even their interactions with their own feelings, could have been more vibrant. Too subtle, maybe?"}, {"userName": "thewanderingjew", "userReviewDate": "May 24, 2009", "userURL": "http://www.goodreads.com/user/show/2309191-thewanderingjew", "userReview": "This is a wonderful book about how people react when faced with unspeakable tragedy. Some join together to help while some hinder the effort. Others remain unflappable while some fall totally apart and cannot cope. Sadness, anger, disbelief, withdrawal, all are parts of the grief process. This book is about an air disaster. It takes you into the lives of several of the lost passengers and shows how their survivors interact with and influence each other. Each deals with the tragedy in his own way, influenced by background and constitution. The search for survivors and the discovery of their belongings has a unique effect on each of them. Some find a greater purpose in their lives and some lose it. Their exploration and development make them truly human rather than mere descriptive words on paper. I would not have chosen this book if it was not on my book club's reading list, because of the subject matter, but I thought it was really good and I am glad I read it. Because I do not like flying, I was very leary about reading the book but it did not inhibit me further nor did it encourage me to go running off on a trip."}, {"userName": "Bobby", "userReviewDate": "Mar 03, 2013", "userURL": "http://www.goodreads.com/user/show/13564460-bobby", "userReview": "Almost 5 stars -- I really mostly enjoyed this book very much. Heartbreaking, yes, but an interesting study of dealing with tragedy & grief. The author portrayed the characters very well."}, {"userName": "Robin", "userReviewDate": "Jul 15, 2017", "userURL": "http://www.goodreads.com/user/show/2935065-robin", "userReview": "Disclaimer...I really liked this book therefore the rating of 4 however the beginning was hard to read. The rest was well worth it."}, {"userName": "Bobby  Title", "userReviewDate": "Mar 20, 2016", "userURL": "http://www.goodreads.com/user/show/4161005-bobby-title", "userReview": "A book club friend handed me this book as our last meeting ended. She said I'd like it. I'd never heard of it.I started it early this morning, a quiet Sunday, and finished it before sunset. To say I couldn't put it down is an understatement. The writing is superb. The story itself keeps softly and steadily encouraging the reader to come along. The characters, every single one of them, are good people. An airline crash is tastefully done and doesn't need a whole lot of intricate and distressing detail to be the reason why all these people are drawn to a tiny island in Nova Scotia. The story encompasses a five-year period. As it heads toward the end, I was so glad the author avoided a trite wrap-up; instead it was beautifully done. And on the way to the ending he writes: \"Diane Olmstead sat nearby in her chair and observed them all lying on the lawn, staring at the sky. She fingered her prayer beads in the dark and gazed up as the moon as well. She needed no binoculars. She felt no need to actually to see the birds. She knew they were there. Just because you couldn't see something didn't mean it wasn't there. She fingered each bead between her thumb and forefinger. The night smelled of jasmine, of musk roses. She looked up at the platinum moon and knew they were out there -- all of them -- between the sea and the earth and the sky.\"I found it a beautifully written book and a lovely story. I am so glad someone brought it to my attention."}, {"userName": "Jessica Sullivan", "userReviewDate": "Sep 24, 2015", "userURL": "http://www.goodreads.com/user/show/1246157-jessica-sullivan", "userReview": "At one point in the novel, Ana Gathreaux, an ornithologist whose husband recently died in a plane crash, describes the kingfisher’s migration: Unlike the other bird species that begin migrating earlier in the fall, the kingfisher lingers for as long as it can. The rivers begin to freeze, and then finally, it too must go.Birds of Fall is a powerful yet subtle story about grief. About a group of mourning strangers who gather at a remote inn after the plane carrying their loved ones crashes into the nearby sea. Together, they form a unique and impenetrable bond, united by their sorrow. They grieve for as long as they can until, like the kingfisher, the time comes for them to move on.Appropriately melancholy without feeling melodramatic or twee, this is a moving story about people helping each other through grief and piecing their lives back together in the wake of tragedy."}, {"userName": "Jessica Trujillo", "userReviewDate": "Jun 01, 2007", "userURL": "http://www.goodreads.com/user/show/87939-jessica-trujillo", "userReview": "This is a beautiful, well-written book. The author floats about from character to character just like the birds that are so significant to making the point of the novel. But it isn't in a confusing, maddening, stream-of-consciousness kind of way. It is easy to follow and a pretty fast read. There isn't a lot of time spent on heavy character development, which normally bothers me in a novel, but it's written in a way that managed to hold my interest in the characters and hope for the best for all of them."}, {"userName": "Helen", "userReviewDate": "Oct 20, 2011", "userURL": "http://www.goodreads.com/user/show/5410854-helen", "userReview": "Beautiful story. Handled emotional storyline without getting overly sentimental, and had wonderful, real characters. I always love stories where people forge bonds or create \"families\" from disjointed groups of people or unlikely circumstances. Interesting imagery and themes around metamorphasis, although sometimes the bird references got a bit strained (\"Russell. His name was the sound birds make in the night...\")"}, {"userName": "Vicki", "userReviewDate": "Aug 26, 2007", "userURL": "http://www.goodreads.com/user/show/142188-vicki", "userReview": "Have you ever read a book, and rather than the plot or characters or style jumping out at you, all you can see is the research that the author did for the book? That was this one for me. I liked it fine, but Kessler couldn't help but throw in every interesting fact he'd learned about birds. Or planes. Or Iran. It was distracting. Or maybe I was just in a mood."}, {"userName": "Amber", "userReviewDate": "May 17, 2009", "userURL": "http://www.goodreads.com/user/show/182082-amber", "userReview": "I tried really hard to love this book but I kept falling asleep every time I read it. I didn't become attached to any of the characters, there were so many I feel like the author didn't have time to explore any of them deeply enough."}, {"userName": "Steve Williams", "userReviewDate": "Sep 28, 2015", "userURL": "http://www.goodreads.com/user/show/7549339-steve-williams", "userReview": "hmm... 3.5 stars. this is a quiet, contemplative novel, and though it sometimes was too uneventful for me, for the most part i found it immersive and enjoyable."}, {"userName": "Ellen", "userReviewDate": "Oct 25, 2010", "userURL": "http://www.goodreads.com/user/show/3798962-ellen", "userReview": "One of my all time favorite books. Beautifully written."}, {"userName": "Revivre le Livre", "userReviewDate": "Jul 23, 2017", "userURL": "http://www.goodreads.com/user/show/66514923-revivre-le-livre", "userReview": "Birds in Fall is a short novel rounding out at 238 pages, shifting point of view from one cast member to next every chapter or so. With the majority laying on Ana, the ornithologist. However, by no means would I say her character is any more important than the next. It through her however, that supplies the bird references, stories, and analogies which so aptly create the reason for the title of this novel and it also creates a plethora of metaphors for life.What can I say plot wise about this novel though that won’t give everything away and that isn’t just a reiteration of the synopsis? Well, first off, do not read this book if you are about to board a plane. The very first chapter is the destruction and crash of a commercial jet. Following that, the rest of this novel will probably make you cry. It is extremely sad. It’s all about death, and the grieving processes that comes with it. It highlights how no matter what our backgrounds are, we are all human. We all grieve. Yet, no two process are the same. That tragedy can afflict us all and some may take different path to recovery. Kessler’s unique cast of characters from all over the globe, showcase not only the cultural and religious differences of people in grief, but the grief that people of all ages, genders and relationships experience. Shifting point of view between all the characters each time rips another hole in your heart as you learn about the lives of the lost ones; what those who are dead truly meant to those who survive in their stead.Yet as the novel continues, glimmers of hope do appear. New relationships are formed and slowly the loves ones learn how live without their wives, husbands, daughters, sons, nieces, nephews and more. Not to say that each day is not a struggle, but the authors tries to emphasis how there are still beautiful things left in the word that are worth living for.Each character we get to be inside is a great reflection of how different we all are. Yet again, how similar we are. Brad Kessler, expertly researched the appropriate avenues to make each character as authentic to their roots and their fabricated history as possible. When we are in Ana’s mind, the book is replete with bird references. The Bulgarian man is filled with knowledge about music. Our Iranian exile tells about the nature of his culture, in a way that is very accurate and could be any person from that regions upbringing. And so forth follows for the the rest of the cast.My only complaint about the end of the novel, was that it ended. See the last few chapters of the book include a time big time jump from when the event happened to five years later. I wish we would have been able to see more into the lives of the family members who were left behind, during the ending time jump. For its only the last few chapters, you get to truly see the spark of life in these beings again.Now, I cannot lie to you guys, my initial recreation to said book, was “meh.” The summary and recommendation did captivated me. Yet as I read, something seemed amiss. I realized, I wasn’t connected to the characters. I didn’t share their sense of forlorn. Now at first, I thought it might be because I haven’t experienced much death in my life, but when I was about halfway through the book, at a particular scene, that’s where it [the connection, the sadness] hit me.It was up to that point - I wasn’t really jiving with the writing style. It wasn’t what I was typically used to. It was free, like prose. Everything swirling together. (Which makes perfect sense considering what the characters are facing at this point.) On top of that I wasn’t connected to any character because we were still learning about all of them and their connections to those on the plane.Once we got past this point however, when the characters really started interacting with each other because of a terrible storm on the island. That’s when I began to see how powerful of novel this can be. How sharing your grief, and life experiences with people from all walks of life can change you. For its only when you meet people that are different than you, can you really grow. It was then I began to truly feel connected to each character in the book.Finally, only paragraphs later there would be a scene where the Bulgarian man is playing piano in the dead of night; slowly and quietly the others would slip into the room and that’s where my heart burst into pieces. From that point on I was connected. I felt their pain. Their loss. Their hope that that their loved ones might somehow be alive. I felt it all. It was beautiful. Birds in Fall, is masterpiece, in which Brad Kessler’s cast of diverse characters will stay with you many years from now."}, {"userName": "Silverdoula", "userReviewDate": "May 25, 2018", "userURL": "http://www.goodreads.com/user/show/520419-silverdoula", "userReview": "I adored this book, which was principally about grief and also about migratory birds. The author was an absolute poet and the natural imagery, paired with the grief experienced by all the characters, was beautiful and sad simultaneously. I love books set in Nova Scotia and this one was no exception. (Others include the shipping need, the bird artist and the weight of water if memory serves me correctly.) This book reminded me a bit of Bel Canto in that the group of characters was a character itself. I really enjoyed reading this and think I would enjoy re-reading it down the road. Recommend."}, {"userName": "Violeta", "userReviewDate": "Sep 25, 2017", "userURL": "http://www.goodreads.com/user/show/2735242-violeta", "userReview": "Beautifully written novel about grief and community forged through tragedy. Bird migration is a metaphor and motif that weaves in and out throughout the book, and the science writing is nicely lyrical.I also loved the food and place writing. This was a perfect novel to read (by coincidence) late September, as that's when much of the action takes place, and it added to the ambience. My only small complaint is that I wish it had ended with either the 3rd chapter from last, or kept the ending but skipped the penultimate chapter.Definitely recommend!"}, {"userName": "Katherine Pederson", "userReviewDate": "Sep 09, 2017", "userURL": "http://www.goodreads.com/user/show/69445980-katherine-pederson", "userReview": "This book started out well written; thoughtfully descriptive (I WAS there! on Trachis Island) but the last quarter of the book seemed almost like it was written by a different author. The tone changed, the writing became rushed and (almost) solely plot-driven. I found myself resigned to finishing it even though it became clear that the characters stories were going to be wrapped up all neat and tidy (boring...). I feel cheated."}, {"userName": "Arlitia Jones", "userReviewDate": "Aug 22, 2017", "userURL": "http://www.goodreads.com/user/show/1869924-arlitia-jones", "userReview": "I love this book. It's filled with quiet and grace. The language is poetic and freighted with pain and loss and the expansive human capacity to long for another. Everything about this story, the characters, the setting, the structure, make it a memorable novel. If anything, you must read it to learn about the kingfishers."}, {"userName": "Bobby", "userReviewDate": "May 27, 2018", "userURL": "http://www.goodreads.com/user/show/4261162-bobby", "userReview": "Beautifully written, tragic tale of the families of people that supposedly perished in a plane crash. The plane ends up in the Atlantic Ocean off the coast of Eastern Canada and the ensuing search and relationships are so very well done"}, {"userName": "Barbara", "userReviewDate": "Sep 04, 2017", "userURL": "http://www.goodreads.com/user/show/2135077-barbara", "userReview": "Well written - setting was easy to picture given the author's ability to write descriptions. Characters were intriguing and I learned a lot about birds. A story of grief and the power of community."}, {"userName": "Katrin V", "userReviewDate": "Jun 13, 2017", "userURL": "http://www.goodreads.com/user/show/47772132-katrin-v", "userReview": "I started reading enthusiastically and did enjoy all the bird science he managed to weave in, but in other ways the novel as like one of those bumper stickers that say 'Co-exist'."}, {"userName": "Mark", "userReviewDate": "Mar 10, 2016", "userURL": "http://www.goodreads.com/user/show/31268163-mark", "userReview": "Life is as Fragile and Precarious as FlightThis novel is one of those surprise discoveries. My wife brought it home for me on a whim with some journals. I read the opening sentence and sensed immediately that my priorities for the weekend had shifted.It’s true: a few of us slept through the entire ordeal, but others sensed something wrong right away.The voice possessed a sense of moment, a texture of imminent tragedy that gripped me and wouldn’t let me go. The first chapter transported me to far away Nova Scotia and continues to resonate in unexpected ways after the final page of the novel 238 pages later.BIRDS IN FALL was a critical and popular success. An excerpt was published in The Kenyon Review in the spring of 2006. It won the Dayton Literary Peace Prize. And the Los Angeles Times named it one of the ten best books of 2006.A Novel for NovelistsThe story begins aboard a transatlantic flight from New York City bound for Amsterdam. The style is contemporary, spare in setting, and emphasizes action. It is told in the first person voice of Russell, Ana’s husband. The action is carefully and effectively modulated as he takes up conversation with the woman seated next to him, a concert cellist who is stressed by the airplane’s bumpy ride through increasingly violent stormy night skies.For example, one of the most visually compelling moments is Russell’s presence of mind in writing his NY address on his forearm with the cellist’s Japanese Maple lipstick. He shows it to her and encourages her to do the same. Ironically, she encourages Russell to include his name in his message to his rescuers, yet he cannot bring himself to do so. This foreshadows his fate as another anonymous casualty of tragedy, vanished, forever lost at sea. Indeed, eighty minutes into its flight, the aircraft ‘enters the sea.’From there we shift to a small community setting on Trachis Island off the coast of Nova Scotia and the events following the crash. The narrator’s voice changes to third person omniscient and never returns to Ana’s husband in any meaningful way. Despite several telling details set up in the first chapter, few are referenced later in the narrative in which bits and pieces of airplane, passengers, and luggage debris are recovered.From chapter two onward we follow the innkeepers Kevin and Douglas on Trachis Island and Ana Gathreaux, Russell’s ornithologist wife, who travels from New York City to the inn to visit the site of the catastrophe and learn something more about Russell’s fate. Other victims’ families travel to the island from all over the world for the same purpose. Over time, they each experience punishing, withering grief, hope, frustration, abandonment, and transformation into new lives without their loved ones.The writing improves in this second voice and occasionally soars like the migrating birds that serve as such an apt metaphor for the flight of time, events, and souls. On more than one occasion, I was reminded of Michael Ondaatje’s poetic prose. That’s profound praise for how deft many of Brad Kessler’s passages are.RecommendedBirds In Fall is remarkable. It is rich with masterful writing and compelling insights into the lives, drives, and lessons that shape us as our migrations intersect across time, place and circumstance."}, {"userName": "Kathleen", "userReviewDate": "May 23, 2012", "userURL": "http://www.goodreads.com/user/show/2944050-kathleen", "userReview": "First of all, this is not a book to read on an airplane. The first chapter sets the plot in motion--passengers on a plane about to crash. The rest of the novel is about the aftermath of the disaster and why we react and grieve so differently from others.There are two main characters, Kevin Gearns and Ana Gathreaux. Kevin owns and runs the Trachis Inn, on an island off the coast of Nova Scotia, with his partner Doug. Ana is an ornithologist in New York City. Her husband was on his way to deliver a lecture in Amsterdam, but of course never makes it. Kevin begins immediately to prepare for the grieving family members who arrive to be close as the search for the plane takes place. It is a multinational group that assembles and then disperses. His central question is \"Why all thus fuss for people who'd died so publicly--so spectacularly--in a flash, when there was nothing for the thousands who died agonizingly slow, alone, shunned inside their rooms?...All the friends in New York City he'd watched die and no one cared?\" (179) He had been his friends' caregiver during the AIDs epidemic--exhausted from that life, he had become in innkeeper on Trachis Island. He becomes a huge part of the healing process for many of his guests.Ana comes to the inn and almost nothing of her husband is found until much later. Her grief is profound; her father died suddenly, too, when Ana was only 19. Her area of expertise is bird migration, \"To remove, to leave, to abandon one region for another.\" (119) It takes her years to absorb her abandonment, to begin to heal. Some characters leave the inn immediately, caught in their private grief. One character responds through music: his wife had been headed to Amsterdam to play in a concert of Richard Strauss's Metamorphoses. And speaking of meamorphoses, Brad Kessler, the author, incorporates, many classical allusions in the novel, none more important that the story of Alcyone and Ceyx, who for boasting of their perfect love, were changed into kingfishers (Ana's favorite birds from childhood). And the story of Icarus figures, as does the Bruegel painting and Auden's poem about the painting. The final chapter also takes plane in the air, like the first, but with a much happier resolution."}, {"userName": "Esther", "userReviewDate": "May 13, 2013", "userURL": "http://www.goodreads.com/user/show/7369272-esther", "userReview": "Cindy Mangsen performing \"Rudy's Big Adventure\" seemed in order, so I searched for and found the song on YouTube. I have been weeping my way through Birds in Fall by Brad Kessler, which is ALL CINDY'S FAULT (and her husband, Steve Gillette's, too), and I needed a picker-upper. Last time they were in our area to perform at the Old Lynn Concerts series, they told us that because we have goats, we must read Goat Song by Brad Kessler, a writer and fellow resident of their Bennington, VT area. It seemed they'd just left us when a parcel arrived from them in the mail, the book, Goat Song. I enjoyed it, I did, though I couldn't agree with Brad that a fence that may be sufficient to keep goats IN will necessarily keep coyotes OUT. He is a very fine writer so I asked our library to locate another of his books for me...Birds in Fall. It is killing me. If I'm reading it, I'm crying. In the book Sept. 2, 1998, the night Swissair Flight 111 crashed into the ocean off Peggy's Cove, Nova Scotia, killing all 229 multi-national passengers aboard, becomes mid-September of an unnamed year. In Birds in Fall, the doomed aircraft is Dutch rather than Swiss. St. Margarets Bay becomes Trachis Bay. Trachis Island and the fishing village of Trachis stand in for Peggy's Cove and Bayswater and the many coastal communities whose fishing boats rushed to help in the vain search for survivors, and whose residents, in the days that followed, opened their hearts and homes to the families of the dead. Rudy the cat and his misadventure with a garbage disposal was good for a smile, and then it was back to Birds in Fall. http://www.youtube.com/watch?v=w5FCOu..."}, {"userName": "Emily Crow", "userReviewDate": "Oct 09, 2013", "userURL": "http://www.goodreads.com/user/show/23080450-emily-crow", "userReview": "After a plane crashes off the coast of Nova Scotia, the families of several of the passengers gather at a remote island inn. One, Ana, is an ornithologist specializing in migration; another, Pars, is an Iranian exile full of tales and poetry. A Taiwanese couple perform a ceremony for their daughter, while an American Buddhist prays for the dead souls to pass over.Birds in Fall is beautifully written and rather sad, although it ends with hope. The descriptions of nature and the island are a vivid, creating a nice sense of place. The analogy of migrating birds, especially in the fall, is perfect -- as a birder, I find there is something so fragile, beautiful and even sad about the these journeys.The writing is full of small insights about the characters' lives and memorable images, such as when one of the innkeepers, Kevin, thinks of his time in New York City as being like \"the tail end of an imaginary tea party where all the guests were now gone.\" The call of a belted kingfisher is \"like a bird who'd lost its voice and was left with only a rattle, an unlovely staccato, harsh and insistent.\" When it really sinks in for Ana that her husband is dead, she feels something crack: \"A tiny twig, a bird bone, toothpick-thin: and it was as if just then, standing on the boulders, she heard it snap.\"A few passages were a bit too sentimental, but overall, Kessler hit the notes just right. Highly recommended. (And the very end, about the kingfisher, was so perfect it almost made me cry.)"}, {"userName": "Jan", "userReviewDate": "Jun 21, 2009", "userURL": "http://www.goodreads.com/user/show/2073876-jan", "userReview": "Birds in Fall begins with a plane crash off the eastern coast of Canada that takes the lives of all on board. In the days immediately following the tragedy, family members of the victims begin to gather at the only inn on the tiny island closest to where the tragedy occurred. The book slowly paints the portraits of some of these family members' lives, as they spend time at the inn, hope slowly dwindling that they will ever see their loved ones again.I felt that Kessler did a good job of capturing the energy following a disaster - how people respond to tragedy in different ways. Some close up entirely inside of themselves; some fall apart; others turn their grief to greed; and many turn to other human beings for comfort. I felt that Kessler really cared for all of his characters, and did his best to show readers their painful journey through grief, some eventually back to hope and life. It was a very realistic book. I never found myself thinking, \"Now why would this character do THAT?\"However, there was something that I didn't quite connect with in the book. Perhaps it is just the fact that I've never experienced grief like this. The book didn't resonate with me on a deep level. I also found the lengthy tracts on ornithology tedious, but then, it's not a subject in which I'm particularly interested.All in all, however, I did think it was an interesting character study."}, {"userName": "Barb", "userReviewDate": "Jul 07, 2016", "userURL": "http://www.goodreads.com/user/show/6722693-barb", "userReview": "This book was chosen by our bookclub and I was asked to lead it. The story centers around the aftermath of a plane crash in Nova Scotia. The caretakers of an inn on the remote island, where the crash took place, take in families of the victims. The story describes families who come from all over the world, to deal with their loss and come together to connect or remember their lost family members. Update: After having read this the second time, I liked the book even more. The book is beautifully written and deals with tragedy, death, grief, loss, and the healing process. The book received the 2006 Dayton Literary Peace Prize because of the understated way in which the author writes about how the families' grief unites them in spite of their international and cultural differences. The author began writing this novel after a friend perished in the real life Swissair Flight 111 on 9/2/1998 that killed all 229 on board. For book clubs, this book will generate great discussions. Our discussion included ornithology, tragedy, grief, Greek mythology, and the symbolism of each. The research I did of the author portrays a very talented and diverse person. The book club gave this high marks and at least one member said it was the best book she has read. It made us wonder why this book hasn't been on more book lists and sold many more copies."}, {"userName": "Victoria", "userReviewDate": "Apr 06, 2012", "userURL": "http://www.goodreads.com/user/show/8177597-victoria", "userReview": "Brad Kessler writes so beautifully. The first of his books I read was \"Goat Song,\" but \"Birds in Fall\" was actually his first book, and I was so impressed with his writing that I decided to read it.I found it at a really difficult time for our family. My husband's brother had just died of a heart attack, and the book's theme - dealing with personal loss - sparked a good deal of reflection. I wanted to recommend it to my mother-in-law, but she was reeling from the death of her son and wasn't really in the frame of mind for it to speak to her. I waited a few months, when things were a little less raw, and recommended it. The books is very sad, but also very comforting. It takes place on a small island off the coast of British Columbia, where a group of family members gather as a recovery operation takes place following a plane crash that killed their loved ones. The key character is an ornithologist who lost her husband, also an ornithologist. She weaves a narrative comparing the travels of birds to her own personal journey. Other characters are an Asian couple who has lost their daughter and a musician who lost his wife. Even though the book is somber, I urge you to read it. My uncle is close to death and I've started to read it again since it speaks so eloquently to the transience of life, and what is left behind.."}], "description": "One fall night off the coast of a remote island in Nova Scotia, an airplane plummets to the sea as an innkeeper watches from the shore. Miles away in New York City, ornithologist Ana Gathreaux works in a darkened room full of sparrows, testing their migratory instincts. Soon, Ana will be bound for Trachis Island, along with other relatives of victims who converge on the site of the tragedy.  As the search for survivors envelops the island, the mourning families gather at the inn, waiting for news of those they have lost. Here among strangers, and watched over by innkeeper Kevin Gearns, they form an unusual community, struggling for comfort and consolation. A Taiwanese couple sets out fruit for their daughter's ghost. A Bulgarian man plays piano in the dark, sending the music to his lost wife, a cellist. Two Dutch teenagers, a brother and sister, rage against their parents' death. An Iranian exile, mourning his niece, recites the Persian tales that carry the wisdom of centuries.  At the center of Birds in Fall lies Ana Gathreaux, whose story Brad Kessler tells with deep compassion: from her days in the field with her husband, observing and banding migratory birds, to her enduring grief and gradual reengagement with life.  Kessler's knowledge of the natural world, music, and myth enriches every page of this hauntingly beautiful and moving novel about solitude, love, losing your way, and finding something like home.", "title": "Birds in Fall", "url": "https://www.goodreads.com/book/show/365179.Birds_in_Fall", "average": 3.91, "cover": "https://images.gr-assets.com/books/1410170374l/365179.jpg", "reviews": 188, "authors": [{"url": "https://www.goodreads.com/author/show/208752.Brad_Kessler", "name": "Brad Kessler"}], "type": ["Fiction", "Contemporary", "Novels"], "outlinks": ["http://www.goodreads.com/book/show/365179.Birds_in_Fall", "http://www.goodreads.com/book/show/1292292.Birds_In_Fall", "http://www.goodreads.com/book/show/13424303", "http://www.goodreads.com/book/show/8242869-birds-in-fall", "http://www.goodreads.com/book/show/5975656-goat-song", "http://www.goodreads.com/book/show/1085403.Lick_Creek", "http://www.goodreads.com/book/show/3891822-john-henry", "http://www.goodreads.com/book/show/3319807-brer-rabbit-and-boss-lion", "http://www.goodreads.com/book/show/652174.The_Woodcutter_s_Christmas"]}