{"ratings": 42240, "userreviews": [{"userName": "karen", "userReviewDate": "Sep 05, 2011", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "the fact that i can't think of a single thing to say about this book should be review enough, right? and yet, that could be misconstrued as one of those \"if you don't have anything nice to say\" remarks. and that's not it. it was a \"good\" \"read,\" i am just having difficulty saying anything interesting tonight.i will just sit here and hope the votes pour in without any effort on my part...yes??no??okay, i will give it a go. yes, yes, it is another YA dystopia. (half of you have officially tuned out) and the idea has potential, but it is another construct that collapses if you start to scrutinize it. if you play the \"this is the way it is and just shut up and read it\" game, it is a fine story. (i have lost half of the remaining half.)and it won a \"rhode island teen book award\", which is extremely prestigious. shhhh them's my people!http://www.goodreads.com/award/show/4...now i am just grasping at straws. i don't know, man, it isn't terrible, but if you have other things to read, i would read those things first. \"some dude\" let me borrow this, and even though he hasn't read it and i shouldn't feel guilty, i do. thanks for the candy, though!and i am still interested in reading the continuation - like i said, it has potential, and there are at least two major questions left unanswered. and i have curiosities.i think i am probably just not in the review-writing mood, but a lot of it is how little impression this book left upon me. so we are both to blame.fin."}, {"userName": "Clare Cannon", "userReviewDate": "Jan 24, 2011", "userURL": "http://www.goodreads.com/user/show/3655732-clare-cannon", "userReview": "*Read my review of all 3 books in the series before deciding whether to read this!I cannot wait for the sequel! I thought this would be a heavy read, but I was so wrong. It is everything a gripping dystopian should be, but has wonderful characters who grow through adversity and whose experiences afford powerful insights into what is most important in life.A dark future world is divided between those who live inside the wall, and those - like sixteen year old Gaia Stone - who live outside. Gaia was trained as a midwife by her mother, and it's now her job to \"advance\" a quota of infants from poverty into the walled Enclave. Gaia has always been an obedient citizen, but when events reveal new information about the Enclave Gaia is determined to find out the truth and protect those she loves.Gaia had a wonderful upbringing; her parents' depth and wisdom nourished her character so that she was ready to face difficulties with courage and selflessness. I loved the flash-backs to her childhood which show a beautiful relationship with both parents and the profound moral wisdom they passed on to her. On one occasion someone has stolen their animals, and her father surprises her by not being angry but forgiving the thieves, who \"must have been very hungry\". On another Gaia's mother is regretting having given her first two children to the Enclave as required by law; Gaia would excuse her for not having had a choice but her father corrects her: \"You always have a choice, Gaia, you can always say no.\"After ploughing through the self-serving false heroism of The Hunger Games series I felt like shouting this advice to the four winds. If only we heard it more often.With a bad physical scar from a childhood accident, Gaia struggles to not only accept her appearance, but to acknowledge that the pity she loathes in others' eyes may in fact be sympathy; she sees she must learn to trust herself to others and not keep a barrier around herself.There's a beautiful respect for life, maternity, newborn babies and children, and for so many other qualities like the dignity of work, of relationships, and the rich beauty of a multitude of characters choosing what is right.The relationship between Leon and Gaia is realistic but perfect: their love grows for all the right reasons, they learn so much about each other and their flawed but earnest characters are the antithesis of Edward/Bella sentimentalism and Katniss/Peeta falseness. These two truly demonstrate sacrifice.Younger readers should be aware of a few slightly confronting birth scenes (one right at the start), though I considered the realism a fitting setting for the weighty themes, giving life-like depth to the characters. There are also references to a serious occurrence in Leon's past that requires maturity and objectivity and may be misunderstood by younger readers. The context shows that Leon's actions were not culpable but there were still serious consequences including the suicide of a mentally ill young teen. Yet I thought even this event was treated with delicacy and dignity, and stimulated further growth in the characters.The story itself is original, tightly written and moves at a fast pace, and truth be told it's impossible to put down. Once finished, the long wait for the sequel begins. What a surprise to find a contemporary dystopian that's rich and deep and inspires such hope in adversity.www.GoodReadingGuide.com"}, {"userName": "Melissa", "userReviewDate": "Dec 15, 2011", "userURL": "http://www.goodreads.com/user/show/1063089-melissa", "userReview": "I wanted to like this book, I really did. The premise seemed really interesting, but the book just fell flat. Gaia was just boring and the rest of the characters were flat and underdeveloped. I honestly didn't understand why everyone was risking their life to help her because she wasn't inspiring and her cause for the most part helped only her, no one else (saving her parents). I also didn't understand the need to separate the people from the Enclave and those outside the wall, since the Enclave readily accepted babies from outside the wall and the Enclave wanted to diversify their genetics. None of the choices made by the Enclave or any of the characters made any sense at all - it was like everyone walked around with blinders on. I didn't even understand the need for the secret notes on the babies' births since the Enclave had the technology for genetic testing. Why would the Enclave care if people kept notes on who the babies' parents were if none of those children wanted to leave the Enclave anyway? Also, the people inside the Enclave wanted to have children together knowing they are related and they have a high chance of having a baby that will die at a young age? Why? I couldn't even believe the actions of people who weren't even main characters, that's how weak this book was."}, {"userName": "Ninoska Goris", "userReviewDate": "Feb 28, 2017", "userURL": "http://www.goodreads.com/user/show/52598215-ninoska-goris", "userReview": "\"Esta quemadura no era peligrosa. Solo me hizo fea e indigna del Enclave.\"Marca de Nacimiento es una distopía en donde se ven las consecuencias del cambio climático. Se vive de una de dos maneras: o en el Enclave en donde viven los privilegiados o extramuros en donde a cambio de agua y micoproteína (una proteína en polvo de origen vegetal) deben entregar al Enclave una cuota de bebés recién nacidos. Todo cambia cuando encarcelan a los padres de Gaia, una chica de 16 años que es comadrona y esta entra al Enclave a rescatarlos. Es una novela buena por momentos, predecible en otros y la mayor parte del tiempo poco mas que entretenida."}, {"userName": "Caragh", "userReviewDate": "Sep 29, 2009", "userURL": "http://www.goodreads.com/user/show/2319843-caragh", "userReview": "I've read it a few times already. *smile!*"}, {"userName": "Tatiana", "userReviewDate": "Feb 26, 2010", "userURL": "http://www.goodreads.com/user/show/2250020-tatiana", "userReview": "An ARC of \"Birthmarked\" was gifted to me by my friend, so I feel kind of bad for giving this book such a low rating, but at the same time I don't want to sugar coat it either. The thing is, \"Birthmarked\" is not one of those horrid books that I despise for awful writing or atrocious characters (\"Evermore\" and \"Hush, Hush\" come to mind). It is not bad, but it is simply boring and unremarkable. To be honest, only a marginally interesting premise kept me skimming last 200 pages of the book instead of giving up on it completely.Gaia Stone is a 16-year old midwife in training in a small village near a walled city called Enclave. At the beginning of the book Gaia assists in birthing a baby and an hour later \"advances\" it, meaning she takes the baby from its mother and gives it over to the Enclave guards to be raised inside the city walls. Even though the mother of the child is in tears, Gaia advances the baby without any hesitation, this is a part of her job and she knows it's a right thing to do. When later that night Gaia reaches her home, she is told that her parents were arrested and are now imprisoned within the city. The girl doesn't understand why it happened, the only clue to their possible discretion is a hair ribbon covered in mysterious symbols that Gaia'a parents left behind. What follows is Gaia's quest to find her parents and uncover the importance of the ribbon.I think the first major mistake the publisher of \"Birthmarked\" makes is that it markets it as a cross between \"The Handmaid's Tale\" and \"The Hunger Games\" which happen to be two of my favorites. Trust me, it not even close to either of these books. It lacks the depth and emotional impact of the first and non-stop action and hot teenage romance of the second. Even more, both the characters and the dystopian world are not sufficiently developed. Gaia is a very flat heroine. Her main characteristics are: a huge burn scar on her face (the emotional implications are explored only superficially), her ability to get various people to help her by simply asking (even prison guards are always willing to answer her questions and demands, imagine that!) and naivete akin to that of a 10-year old. How this girl ends up getting a mature guy by the end of the story is a mystery to me. The world of Enclave misses the mark too. I recognized many aspects \"borrowed\" from \"The Handmaid's Tale\" (the colored uniforms based on the professional occupation, the titles - Masister, genetic and ecological problems, etc.), but even that is not enough to create a convincing dystopian reality. For a regime that is supposedly totalitarian and oppressive, the Enclave comes off as rather nonthreatening and lax.All this combined with the general slowness of the story, uninteresting characters, lack of convincing action, conflict, or romance, and absence of any kind of emotional impact that dystopias are known and lauded for, make \"Birthmarked\" a pretty mediocre read. I might be in minority in my assessment of this book, as there are many 5-star reviews of it, but I am quite positive that even though some fans of sci-fi/dystopian YA might enjoy this novel, it is definitely not the next big thing. P.S. Almost forgot, the book has an ending, but it is extremely open for a sequel."}, {"userName": "Penny", "userReviewDate": "Jun 05, 2017", "userURL": "http://www.goodreads.com/user/show/7463065-penny", "userReview": "Actual Rating: 3.5 stars.It is somewhat different to other novels of this genre, due mostly to the heroin being a midwife.I enjoyed it, but it does have different moments of intensity. It engaged me more at some times than others, however, there are some situations that are definitely memorable. This book could work just as well if the characters were older.I´ll keep reading this series.Book 2: Prized - 4.5 starsBook 3: Promised - 2.5 stars"}, {"userName": "Reynje", "userReviewDate": "Jul 07, 2011", "userURL": "http://www.goodreads.com/user/show/5590906-reynje", "userReview": "[and.. er.. wearing a crepe on her face... (hide spoiler)]"}, {"userName": "Steph Su", "userReviewDate": "Sep 30, 2009", "userURL": "http://www.goodreads.com/user/show/2010935-steph-su", "userReview": "Words fail to adequately describe how astonishingly completely Caragh O’Brien drew me into Gaia’s dystopian world in this debut YA novel. Holy cow! BIRTHMARKED is a layered and action-packed dystopian treat that just might satisfy readers eagerly awaiting the third and final installment of The Hunger Games series.I am absolutely bowled over by how well-written this book is. Caragh O’Brien presents us with interesting characters that we want to follow through all their suspenseful adventures and encounters. From Gaia, the determined “everywoman” protagonist, to the alluring and quietly troubled Captain Gray, to everyone who helps or harms Gaia along the way…all are engaging and three-dimensional to capture our attention from the start and hold on throughout.A dystopian novel is nothing without a well executed and faithfully imagined world-gone-wrong. Luckily, Gaia’s world is one of the best I’ve read about in a long time, high up there with Suzanne Collins’ The Hunger Games and Maria Snyder’s Poison Study. BIRTHMARKED starts with a bang in the first chapter and never lets up. There’s plenty of mystery, code-breaking, narrow escapes, and running to satisfy fans of action and adventure, and it’s all wrapped within a fully realized dystopia.I don’t think my review was enough to express my admiration of and love for this book, but rest assured that if this sounds even mildly interesting to you, then you will NOT be able to put it down!"}, {"userName": "Larnacouer  de SH", "userReviewDate": "Aug 12, 2017", "userURL": "http://www.goodreads.com/user/show/24402798-larnacouer-de-sh", "userReview": "Kötü, kötü, kötü, kötü, kötü bi' distopyaydı. Kitabı gördüğünüz an yolunuzu değiştirin derim.😒😒"}, {"userName": "Giselle (Book Nerd Canada)", "userReviewDate": "Jul 16, 2012", "userURL": "http://www.goodreads.com/user/show/5789353-giselle-book-nerd-canada", "userReview": "Such a good dystopian book!I love the world that was created. It seemed so realistic and could even be true. I wanted to know more about the mycroprotein though. The different societies and how each are vastly different but also not free. I pretty much devoured this in two sittings. Especially with that ending, reminding me so much of Delirium's ending. Also I like how there wasn't a focus on romance. She was very set on helping her parents until the very end, love her growth. Started out as timid, but later on she's the opposite of that. Get this one of you enjoy a dystopian that's written well with a likable character who will stop at nothing to help her own family. I couldn't put it down!Rating 4/5Quotes\"You always have. Choice, Gaia. You can always say no. They might kill you for it, but you can always say no.\" (112)\"Give it enough time, and this place will destroy even you.\" (166)\"Hen you decide something's right, there's nothing that can stop you from doing it.\" (340)"}, {"userName": "Renata", "userReviewDate": "May 16, 2016", "userURL": "http://www.goodreads.com/user/show/45587823-renata", "userReview": "Sinceramente este libro lo cogí de la biblioteca la semana pasada por que me llamaba bastante la atención y estuvo bien, sí, pero no la gran cosa. En un principio la historia es muy lenta pero como empieza explicando las cosas va bien para situarte, pero llega cierto punto donde cansa mucho. Hacía mitad-final del libro hay bastante acción y fue eso lo que más me enganchó e hizo que no dejara el libro en la página que me había quedado. Realmente no pensaba que me iba a encantar ni que lo iba a odiar y así estoy ahora, no es un libro que me marcará pero me gustaría seguir leyendo los otros para saber qué pasará con la protagonista y hasta donde llevará la autora esta trama."}, {"userName": "Katherine C.", "userReviewDate": "May 10, 2011", "userURL": "http://www.goodreads.com/user/show/5413665-katherine-c", "userReview": "Birthmarked by Caragh M. O’Brien was an extremely disappointing and disorganized novel. The book introduces the protagonist, Gaia Stone, and incorporates a gripping idea of a dystopia in which the wealthy have all come down with a disease called hemophilia, which prevents them from giving birth to healthy babies. Gaia is a midwife and helps deliver the healthy babies to the “Enclave”, which is the higher society. But after Gaia’s parents are arrested, Gaia goes on an extremely unthrilling, unclimactic and predictable journey. Gaia is one of the only characters that are prominent in the book, and O’Brien failed to develop her character. Therefore readers were unable to analyze and understand her. Gaia is a very weak protagonist, and is also very rash. Her actions are never fully explained, nor do they play a big part in the direction or flow of the book. And as O’Brien never fully includes secondary characters, Gaia fails to play the heroine and is too weak to carry the entire book. The book is especially disorganized and unfocused as the text tries to hard to relate back to the overall theme, which is a dystopian world. The storyline bounces between background stories, and Gaia’s full mission is never really carried out or explained. O’Brien also fails to use her literary devices to her advantage when she starts to explain why she used the particular device like: “…Gaia had the impression the Bastion had two distinct functions: the beautiful, gracious home that Genevieve and the children inhabited, and the no-nonsense part that she was entering as a bound prisoner. In a way, it's only a more extreme version of the society I already live in, Gaia thought, another division, like the one that separates those who live inside and outside the wall. She had just seen where the worlds collided.” –Pg. 237\tO’Brien’s writing is also hard to follow as her language is repetitive and she uses random and excessive amounts of literary devices in order to “color her writing”. It also feels as though O’Brien uses to many words that are just not suitable for the context of the writing, and her random vocabulary makes it seems like she is trying to make her writing more complex, but to no avail: \t“The air had a putrid stink of garbage and urine, much like the cattle in the fields, but as she hurried behind the man, she could see a warm, yellow light ahead of her, that reminded her of the fires her father used for his dyes. He pulled her through another wide door and closed it tightly, sliding a thick wooden bolt across it. Gaia had never beet so happy and euphoric in her life. Before her, warm and exponentially massive, stood the broad hearth of the much-used, black-ovened bakery.” –Pg. 207\tTherefore in the end, my poor rating and review of this book is due to O’Brien’s use of messy language and literary devices, her disorganized and unfocused writing, her poor pacing of her story lines, and her failure of introducing more supportive characters and making her weak protagonist carry the whole book. If O’Brien had revised her book more, I believe that the book would have played out much better. In the end, this idea was excellent, but the development was disappointing."}, {"userName": "Stacey (prettybooks)", "userReviewDate": "Feb 17, 2011", "userURL": "http://www.goodreads.com/user/show/3533262-stacey-prettybooks", "userReview": "Gaia Stone lives in a dystopian society that's split in two: the rich, privileged members live inside the walled Enclave while the rest, including Gaia, live in poverty Outside. It is an acquiesced law that the first three babies born every month will be \"advanced\" into the Enclave to be brought up by the elite. Gaia happily serves the Enclave as a midwife, alongside her mother, until she comes home one night to find that her mother and father have been arrested. Gaia has been told that her parents have been hiding something that the Enclave desperately wants and it's up to Gaia to decide whether to give up the information or rebel against authority and rescue her parents.The story begins with a dramatic and heartbreaking scene; Gaia is in the middle of helping a young woman deliver her baby. This newborn is the first baby quota of the month, unbeknown to the mother who is under the impression that the quota has already been filled and she can keep her baby. We're instantly introduced to the harsh and unthinkable laws that the Enclave enforce. Caragh M. O’Brien's world-building is brilliant. There is a scientific basis behind the Enclave's laws, which makes the society more believable and terrifying. There's also a surprise for Gaia once she enters the Enclave - she realises that the split society isn't as simple as she first thought and she's faced with shocking reality.Birthmarked has everything I could want in a young adult dystopian novel, including the inevitable romance. Gaia begins to develop a relationship with Leon, an Enclave guard. However, the romance is understandable, natural, and not at all contrived. Leon has his own back story, which isn't as desirable as Gaia first thought.Birthmarked is an epic, thought-provoking dystopian novel. I've already picked up the sequel, Prized, and I'll be rooting for Gaia Stone all the way.Dystopian or Not Dystopian? DystopianI also reviewed this book over on Pretty Books."}, {"userName": "AH", "userReviewDate": "Oct 07, 2010", "userURL": "http://www.goodreads.com/user/show/3255548-ah", "userReview": "Caragh O’Brien’s book Birthmarked tells the story of a world where the state is able to take infants away from their mothers by quota. Set approximately 300 years into the future, the world is a bleak place. Resources have dwindled, lakes have dried up and become “unlakes,” and a portion of the population has difficulty conceiving. The Enclave is a walled city where its citizens enjoy many of the better things in life – food, running water, motion sensing lights, and an education. The Enclave is ruled by the Protectorat, a kind of dictator. Outside the Enclave, people live in Sectors. They go to the Tvaltar and watch films about life inside the Enclave. The population of the Sectors are obligated by law to advance the first three babies born each month to the Enclave. It is both an honor and a duty to do so. These babies are then raised by adoptive parents in the Enclave. Birthmarked focuses on Gaia Stone, a 16 year old girl and midwife. As the story begins, Gaia attends her first solo birth. She removes the infant and advances it to the authorities at the Enclave. Gaia is proud to be doing her civic duty. She returns home, eager to share her experiences with her parents but they have been arrested. Gaia is a very determined young lady. She begins a quest to find her parents and reunite her family. She manages to sneak into the Enclave. She watches the execution of a young couple and draws attention to herself when she rescues the woman’s unborn child. Gaia is held by the authorities and forced to cooperate as they threaten her family and friends. Gaia’s parents had been marking the advanced children with small freckle tattoos. They had also kept a list of names of all of the parents and birthdates of the advanced children. The list was hidden and in code.Throughout the book, Gaia’s memories of her childhood are told in flashback. Gaia reaches into her memories to see if she can figure out her father’s code. As a mother, I found this book difficult to read. What kind of society creates a quota for newborns and wrenches them away from their mothers’ arms minutes after their birth? What kind of mother would not move heaven and earth to get her child back? What made this population so complacent? This book managed to make my momma bear impulses come out. The idea of taking newborns away from their mothers is reprehensible to me. I could not put this book down. I find dystopian worlds fascinating, but disturbing at the same time. Here was a world where babies are removed from their birth mothers and given to adoptive parents but no official documentation of the birth parents was kept. As a result, a person could marry a sibling or a cousin. Genetic defects were on the increase. People can be accused of genetic crimes. As advanced as the Enclave was, the Protectorat did not believe in clinics or hospitals because they catered to the weak and used up resources. Doctors are kept in prisons because they cater to the weak.I really liked Gaia’s character. It is refreshing to see a young adult character who is so well balanced. At first, she is so idealistic and proud of her work. As the book progresses, Gaia’s character realizes that the people outside the Enclave are basically reproductive slaves. She questions authority and seems to get away with it. Gaia has a strong sense of justice. Gaia is a loyal daughter, putting her family’s welfare ahead of her own. I think that Gaia’s character inspired many of the characters in the book to rally around her. I know I was cheering her on. Check out my review on Badass Book Reviews"}, {"userName": "Jennifer Wardrip", "userReviewDate": "Nov 02, 2009", "userURL": "http://www.goodreads.com/user/show/1125613-jennifer-wardrip", "userReview": "Reviewed by Karin Librarian for TeensReadToo.comGaia (Guy-ya) Stone is following in her mother's footsteps. She has been training to be a midwife for years and is ready to accept her role in the community. For as long as she can remember, life on the outside of the wall has been this way.The first three babies of the month are advanced to the Enclave to be adopted and live their life inside the wall. While the pain of losing a child is great, the mothers know that their baby will be living in a community with conveniences not available to the people living in Wharfton, like electricity and running water.Gaia doesn't know what to do when her parents are arrested and taken by the Guard of the Protectorat. She finds it hard to believe that her parents know anything the Enclave would want to know, but by the questions they ask her when she comes home to find them gone, they think her parents have important information. Gaia is completely in the dark. The only thing she has to go on is the long piece of ribbon with a strange code sewn in it that her mother's assistant gave her and told her to keep secret at all cost.Gaia's life becomes a complicated game of cat and mouse as she attempts to get inside the wall, find her parents, and solve the mystery of the coded ribbon.Caragh M. O'Brien has written a wonderful addition to the dystopian genre. Readers get a glimpse of life in the 2400's after a drastic weather change has dramatically reduced the human population. Even though the world is completely different than the one we live in, the problems Gaia encounters are very similar - she enjoys time with her family, likes socializing with friends, and is insecure when it comes to love.BIRTHMARKED is fantastic. I loved it and stayed up much too late because I couldn't put it down. It definitely deserves the Gold Star Award. The author leaves the ending open for a sequel, and I for one can't wait to see what happens next."}, {"userName": "Michelle, the Bookshelf Stalker  Queen of the Undead", "userReviewDate": "Jul 29, 2010", "userURL": "http://www.goodreads.com/user/show/3039709-michelle-the-bookshelf-stalker-queen-of-the-undead", "userReview": "I went into this book with a bad attitude. I seriously did not want to like it (yeah, I know why the heck did I have the book and why was I reading it if I had a bad attitude...long story). Anyways, I was ready and willing to compare every part of this book to The Hunger Games, which I did. I couldn't help it. I automatically assume that O'Brien wrote this book due to the success of The Hunger Games and Catching Fire. Even if O'Brien wrote the book without thinking of The Hunger Games, in my narrow-minded brain, I believed that was the reason.So, here I am ready to hate this book, comparing it to one of my all time favorite books (The Hunger Games) and to my utter shock, I find myself completely engrossed in Birthmarked. Ok, I still had issues with the beginning and the end but the \"meat\" of the book, the story, was wonderful.My problems with the book-In the beginning of the book Gaia is very ignorant of what is really going on around her. Not just ignorant, but painfully ignorant. There is trust, and then there is dumb blind trust and Gaia was ignorant and blindly trusting. She annoyed me because she didn't question what was around her. At some point she makes a switch but it almost was a case of too little too late for me.At the end, we have stuff that isn't making sense. I can't really explain or I'd have to hit the \"this review contains spoilers\" and frankly, I don't want to. There just seemed to be missing pieces of information that either I missed or the author failed to put in.Will I read the next book ?-I will, I won't pre-order it but when it comes out, I'll try to get my hands on it. Overall, I found the story interesting, and entertaining."}, {"userName": "Arielle Walker", "userReviewDate": "Dec 08, 2012", "userURL": "http://www.goodreads.com/user/show/6762949-arielle-walker", "userReview": "[Not only that, but when she discovers that her parents burned her intentionally so they would not have to give her up, she is shocked, hurt and angry, then weighs it up in her mind a realises that she would rather have had her parents love and support and so can forgive and understand why they felt the need to do it. She then gets on with surviving. (hide spoiler)]"}, {"userName": "Lucy", "userReviewDate": "Apr 15, 2010", "userURL": "http://www.goodreads.com/user/show/2644305-lucy", "userReview": "Birthmarked is a thrilling, action-packed dystopian by 2010 YA debut author Caragh O’Brien. I was in the mood to read a good, satisfying dystopian and Birthmarked really fit the bill. This book should satisfy those looking for something similar to the Hunger Games with its intrigue, mystery and suspense.The dystopian world is set up very well, with a plausible concept, and the characters are compelling. The protagonist, midwife Gaia Stone, is brave and faces danger at every turn. Her parents kept some secrets from her to keep her safe. However, now that they have been captured Gaia must use her wits and code-solving skills to help save them. I have not read a book with codes before and thought that was an interesting element.The plot is thought provoking regarding the midwives and ethical dilemmas. The midwives have a monthly baby quota to fulfill for the Enclave. I was not sure of the Enclave’s intentions regarding the birth records. It seemed sometimes that their intentions were good in that they wanted to look for a suppressor gene to combat the health concerns plaguing the Enclave. However, their methods were suspect and their jump to imprison the midwives and doctors made them even more suspicious.In addition to the code solving mystery and action, there is a little romance thrown into the mix. Gaia has great chemistry with Captain Leon Grey. Their relationship begins slowly and believably as they learn to trust each other. It is nice to see someone who can look past Gaia’s scars and believe in her.The book is paced very well, and held my interest from beginning to end. The suspense ramps up toward the end and I couldn’t put the book down. There are some surprising twists along the way. The ending is sudden and intense, and sets up a whole new story for Gaia. I can’t wait to read what happens next. Those looking for a satisfying dystopian after finishing the Hunger Games should enjoy this series. Recommended also for fans of YA, dystopian, and sci-fi.Birthmarked is the first book in a trilogy. The sequel, Prized, comes out in November 2011, which is entirely too far away."}, {"userName": "Thomas", "userReviewDate": "Apr 10, 2010", "userURL": "http://www.goodreads.com/user/show/2018505-thomas", "userReview": "Gaia Stone's family has always faithfully served the Enclave. Her father makes his living as a simple tailor, and her mother is a midwife, delivering the first three babies of every month to the Enclave for compensation. Now sixteen-years-old, Gaia is finally able to step into her mother's lead and deliver babies on her own. There isn't any tension between her family and the Enclave until one night Gaia's parents are arrested without any explanation. Gaia learns more about what really goes on inside the walls of the Enclave, and slowly her once unalterable devotion disintegrates into mistrust and anger. Now she must do whatever it takes to save her parents from danger, even if it means becoming a fugitive herself. Birthmarked was a solid debut novel, although there were a couple of things that could have been done differently. Gaia was a strong female lead, but there almost seemed to be no development at all from any of the other characters. Also, the antagonist of the novel was rather dull, and the climax of the story - lets just say it was rather... anticlimactic.Still, the nonstop action and overall excitement created by this novel had me in a rush to see what happened next. The plot was layered and the pace pitch perfect. The ending was a satisfying stopping point in the story, but it also could give way to a sequel.I would recommend this to those who are interested in genetics, dystopia, or fans of The Hunger Games."}, {"userName": "BriaKnits & Reads", "userReviewDate": "Mar 11, 2018", "userURL": "http://www.goodreads.com/user/show/32860882-briaknits-reads", "userReview": "From the beginning, this book had me on my toes. I love the way the author really drew you in from the first page with intrigue and the thrill of walking in the same footsteps as our main character, Gaia, a young woman who grows up in a world thinking that life is just black and white. As the story progresses, Gaia slowly begins to discover that the black and white world she felt comfortable in, was in fact filled with many gray areas and it was just really exciting to go on the adventure with Gaia on her path of discovery of this new world. I really couldn't put it down and was highly disappointed that I had already reached the end of the book. So much so, that I immediately went online to purchase the second and third book in this series in hardcover. I refuse to read this series as an ebook because this story deserves to be read as a tangible copy. If you like stories shrouded in mystery, a whole new world filled with different laws and customs, weak characters that blossom into heroes and heroines, then this story is definitely for you. I highly recommend this book and I can't wait until I get the second and third copy soon so that I can delve into those as I did the first book. I don't think I will be disappointed because the first book was so very well written. Happy Reading!!!"}, {"userName": "elissa", "userReviewDate": "May 23, 2010", "userURL": "http://www.goodreads.com/user/show/395578-elissa", "userReview": "Definitely had a good start, but I found it to be slightly uneven. Dystopic futuristic atmosphere was very good, and reminded me of Handmaid's Tale, partly because of the reproductive aspects involved in the plot. World building good, characters interesting, plot was compelling and moved the reader along. I guess sometimes the coincidences didn't always work for me (like when the main character meets just the person who can help her in an alley--a man who she's never met before--right when she needs help), and sometimes the writing pulled me out of the story, especially near the end. Ending is one of those very ambigious ones that often annoys readers. I usually just choose to be hopeful, but I really would have liked to see what would happen next to Gaia and the baby, and also how things turned out for Leon. There's definitely room for a sequel here! I'd probably read something else of O'Brien's. 3 1/2 stars, and since I still don't have 12 books on my 2010favorites, this can sit there for awhile. Love the colored stringy lines on the cover!12/8: I keep not wanting to take this off of my 2010favorites shelf, so I guess it's a true 4 stars. Not sure what about it is staying with me better than I thought it would. It is well done dystopian SF, so it may just be that."}, {"userName": "Carla", "userReviewDate": "Oct 06, 2016", "userURL": "http://www.goodreads.com/user/show/46808282-carla", "userReview": "Something between 3/4 stars...I liked some things and I didn't like other things and I don't want to spoil anything so I'll talk about this later :)"}, {"userName": "Karen", "userReviewDate": "Mar 27, 2017", "userURL": "http://www.goodreads.com/user/show/7788355-karen", "userReview": "Birthmarked pretty much had me from the first few pages! My friends have been telling me that I'd enjoy these books and, as usual, they're right. I started and finished this one in one day and it's been a very long time since that's happened.Gaia is a midwife in a society where the people who live on the outside of the wall are willing to give their newborns up so they will be raised in better circumstances on the inside of the wall. This story was very gripping and full of discoveries with non-stop action. I had a hard time putting it down. Gaia was a strong heroine, nothing wishy washy about her. I can't wait to see what she does next. I have Prized out already because this is definitely a series I need to binge-read!"}, {"userName": "Aa'Ishah", "userReviewDate": "Dec 27, 2011", "userURL": "http://www.goodreads.com/user/show/7189585-aa-ishah", "userReview": "4.5 starsThis book should come with a warning: Heartbreak aheadBirthmarked was a book I had been thinking about since I first knew it existed several months ago, so I was pleased to get hold of a copy. I was even more pleased to find this was a book I enjoyed hugely. Injecting the dystopian genre with some new ideas, it definitely had me glued to the pages.Society is divided between those who live inside the wall and those who live outside. Those inside enjoy a life of luxury and privilege, while those outside have to fend for themselves. Each month the first three babies born must be delivered to the Enclave, for which their mothers get compensation in return. Gaia Stone has always accepted this way of life until, on the day of her first delivery as midwife, she reaches home to find her parents arrested. Mystified as to why this could be, she becomes determined to reverse this injustice and get her parents back. She becomes doubly resolved when she learns that the quota of babies is to be raised. She breaks into the Enclave only to realise it’s not the perfect world she’s always thought it was, and that rescuing her parents may be more dangerous than it first seemed.This was another book where I was pulled in right from the beginning. The first chapter immediately acquaints us with the laws of the Enclave and it quickly got an emotional reaction from me. I was pained to see a baby taken away from its mother and each protest from the helpless mother made me wince. What was sadder was that later on, it mentions how one mother Gaia attended was simply passive, knowing that her baby was not hers to keep. It showed that people were accepting of society and without fighting spirit, more a sense of hopelessness and resignation. The bond between mother and child is supposed to be the strongest of them all, yet here were the Enclave destroying that bond before it had even begun.The idea of a baby quota, however, while painful, is still not one I have ever come across. I like that the book has some original ideas. It has that social division, yes, and that physical division to establish and emphasise it. What O’Brien has done is develop it so that the plotline takes on a scientific edge. Nor is it a far-fetched one. The author details well the consequences of having such a closed-off section of society; I was amused at how the undesirables turned out to be the ones that mattered most. It was interesting to see how, with all our knowledge of DNA now, the 24th century is only just reclaiming it.You’d think it would be hard to like a character like Gaia Stone – someone who takes away people’s babies, naive in her youth of what she’s doing. But it was relatively easy to see where she was coming from; she, like many others, believed that the babies would have better lives inside the wall. But aside from that, even in the first chapter she had that little voice inside of her head, questioning and doubting. I liked that she was fierce, strong and independent. If she decided something was right or had to be done, she went ahead and did it regardless of the risk. She never gave up, instead bringing hope to others. Reading about her inquisitiveness at a young age made me laugh, but I was also admiring and respectful because it showed her to be perceptive and intelligent. I felt bad for her when she had to deal with reactions to her scar, and the relationship she had with her parents was heart-rendering. When I found out that the story behind her scar perhaps wasn’t what she thought, I immediately guessed the truth and gasped. I grieved with her over her parents. I feel like I’ve read too many books where one or both of the parents don’t live up to their role, so it was a joy to see it was not the case here. Nor were here parents ignorant or conforming – quite the contrary.I loved how O’Brien created characters who really weren’t what they seemed, or even the Enclave, society inside the wall. Sephie surprised me, and I was particularly frustrated with Mace and Pearl because I didn’t understand why they were helping Gaia when they weren’t prepared to believe reality or act on what was happening. Leon...Leon. What can I say? He starts off as Sergeant Grey. When Gaia first meets him his eyes are hidden by the shadows, but ’she sensed an emptiness there that matched the controlled composure of his other features’. Yet I also sensed an edge to him that suggested he wasn’t so empty as he seemed. Leon is a complex mix of ruthlessness and gentility, coldness and compassion. He is haunted and bitter and in no way does he shy away from sacrifice. Granted, he was a bit foolish at times in his obvious behaviour, but this was a comparatively minor detail. My heart broke for him. For him and for Gaia. And for myself. Because this book does not have a happy ending.If you like dystopia, this is for you. If you like a strong MC, this is for you. If you like relationships that are slow and subtle, this is definitely for you. Birthmarked has an engaging plotline that signals the problems of having too divided a society and the lengths an authoritative power might go to to maintain that division. Gaia’s journey had me caught alongside her, leaving me with no choice but to feel exactly what she felt and to learn who was reliable and who was not. And now I need to get down to the task of obtaining the second book. In the meantime, excuse me while I go anguish over the ending.This review is also posted on my blog."}, {"userName": "Laura", "userReviewDate": "Jul 17, 2013", "userURL": "http://www.goodreads.com/user/show/22287018-laura", "userReview": "If I remember correctly, and I am 99.9% sure, I read this book during my exchange year in the US. For my English 12 class we were required to read at least 3 books per semester for further analysis, presentations, homework, etc about them. Now, 3 books per semester? 6 books per year? ARE YOU KIDDING ME? I read over 35 books that year even though I had to study hard for my Spanish A-Levels (we call it Selectividad). Anyway I had just finished reading The Hunger Games trilogy and I was looking for some other dystopian books when I found Birthmarked. I was immediately drawn to the cover, such gorgeous and mysterious cover, but I decided to read it when I reach the part of the plot summary where it says \"enter the world of the Enclave to rescue her parents, or die trying\" because I do not often encounter characters who persevere through think and thin to rescue their parents. Boyfriend/girlfriend? yeah, brother/sister? yeah, but parents? never before.THE WORLD: It introduces us to the dystopian world of the Enclave. The Enclave is a walled town, much like castles in the Middle Ages, where the rich people live and of course they have access to the best water quality, food, nice clothing, education, etc. while outside of the Enclave the poor people live with barely anything (it really reminds me of the Middles Ages). The only problem that the Enclave encounters after some years is that suddenly all the babies and kids inside the wall start dying. In order to solve this problem the Enclave established a \"quota\" of babies each month, meaning that every midwife outside the wall had to take the first 3 newborns they attended and give them to the families inside so they can be adopted and raised with all the privileges. By the way, the Enclave is ruled by a Protectorat and works like a dictatorship. What he says is law.CHARACTERS: Gaia Stone is a 16 year old girl and one of those poor people living outside the Enclave with her parents, she has been trained to be a midwife just like her mother and in this context is where the book begins. Gaia is out of her home attending a woman in labour when all the bad news come, her parents have been arrested and taken inside the Enclave. Here is when Gaia can't believe what the Enclave has done because her family has always followed the rules, they have been loyal and always paid the quota. You may think \"oh well but they will be raised properly and they won't lack nutrition\" that is true but the story here is HOW and WHY the Enclave does such an evil thing like taking the babies away from their parents.Moving on. Gaia decides to break into the Enclave and rescue her parents but in her attempt she gets imprisoned as well (good job Gaia). While she is in jail she is brought to the Protectorat for interrogation and that's when the mystery starts. She discovers a series of secret messages her parents left for her but she has to solve their riddles and codes in order to decipher it. Meanwhile she meets Leon Grey, a good-looking soldier of the wall's army who decides to help her.LOVE: For those of you who were wondering if there is any romance... yes, but the story doesn't focus on it too much. Romance gets deeper in the following books nonetheless.PLUS: I won't tell any spoilers of course but it was very very interesting to read the whole story which by the way is not complete until you read all the trilogy. I specially loved one part involving riddles and codes *wink wink* and I felt like the world of Gaia was very well described and complete.MINUS: I didn't have any problems with this first book. I had some issues with the next books but this one was fantastic!OVERALL: I loved this book so much. It is on my favourites list. It has a deep meaning behind that sometimes we don't think about when it comes to YA or dystopian books but it is actually there, we just have to search for it. I enjoyed being inside Gaia's head and I almost never felt like I disagreed with her decisions, she had good reasons to do what she did everytime. I recommend this trilogy to anyone who enjoys reading about dystopian, a bit mystery, some romance but not too cheesy romance and YA. Even if you're not into any of those genres... I still recommend it, give it a chance!EXTRA: I once emailed Caragh to express my love for these books and a fanmade poster I thought was brilliant and she replied back! It is always nice when your favorite authors reply to your messages.—P.S. I Love That Book!"}, {"userName": "Shelli", "userReviewDate": "Sep 07, 2011", "userURL": "http://www.goodreads.com/user/show/1561203-shelli", "userReview": "I would give this 2.5 stars. It wasn't terrible and would probably appeal and be good for a younger audience.For me however, I seriously wasn't even very interested until page 180! This book fit a spot in a challenge, so I was determined to finish. I started out with the audio, and the narrator did a big injustice to an already slow moving storyline. The main character was supposed to be a strong resourceful heroine but the narrator made her seem timid and flat. Her voice inflections were off and she was actually rather boring. I started reading the book about halfway through and it was much better, but overall I was completely underwhelmed. Somewhere I read the book was compared to The Hunger Games(or at least the Capitol therein) and The Handmaid's Tale. Not even close to either one. It lacked both the intensity and disturbing yet captivating subject matter. I\"m not even sure I get what all the struggle was about in this book. It certainly seemed like the two sides could have easily worked together to solve a lot of issues. The separation just didn't feel strong enough to be believable. Even though the second half was more exciting, the ending was quite typical and predictable for YA…and for me…ended with the most common and annoying cliffhanger. It seems to me that a really good writer could come up with a better way to end books like these and yet still leave them open for a sequel."}, {"userName": "Laura", "userReviewDate": "Nov 07, 2009", "userURL": "http://www.goodreads.com/user/show/170420-laura", "userReview": "Set about 300 years in the future, after the \"cool age\" (which seems to represent both the time during which we were dependent on oil and possibly pre-serious global warming), this dystopian novel hits all the usual notes: babies born with genetic problems (here, due to inbreeding), a division between the haves and have-nots, babies taken from families are reared elsewhere, etc.. The Enclave's insistence on perfection is what ultimately saves Gaia (yep, the name is significant), who has a disfiguring scar on her face. She's also saved by her naivete and intelligence, and by her non-unexpected knack for getting people to help her (even when they'd be at risk for doing so). None of the characters feel real, they're more like character sketches that still need to be filled in. While the ending, and the uncertainty of what the rest of America is like at this time, lends itself to a series, my hope is that this is a one-off.ARC provided by publisher"}, {"userName": "Steph Sinclair", "userReviewDate": "Mar 13, 2011", "userURL": "http://www.goodreads.com/user/show/4642710-steph-sinclair", "userReview": "I really wanted to love this book, but sadly I did not. I felt that it just dragged on and was a bit anti-climatic for me. I tried to connect with the characters and I just couldn't. Another reviewer mentioned the characters seemed more like rough sketches and I have to agree. In the end, I had to force myself to finish the book. It seems like there will be a sequel and I'll think I'll give it another shot. But for now it's pretty far down on my list. :("}, {"userName": "Emily", "userReviewDate": "May 23, 2010", "userURL": "http://www.goodreads.com/user/show/2701111-emily", "userReview": "Sigh. I love dystopian novels. I mean really love them. The worldbuilding is so intricate and unique, the struggles are so real, and the power of the human spirit is all over every page. I'd heard great things about this book before it was picked as a May Blog With Bite selection; pretty much across the board, the book didn't really live up to my expectations. Set phasers to stun, then, and read on.Birthmarked took a long time to get going. I was totally okay with there being a lot of lead in because it's important for me, when I read a book, to really buy into the rules of the world in the story. This is especially true of dystopian novels; if I don't feel how monstrous the world truly is, then it's hard for me to connect to the characters and understand their plight or root for their cause.This is pretty much what happened for me when I was reading Birthmarked. I felt like the divided society, the weird laws, the genetics, all of that, were described in an almost clinical fashion, as if by someone who was observing the society from afar or watching about it in a movie. I had an abstract idea of what people's lives were like, but no real connection to any of the characters.The same thing extends to Gaia herself as a narrator. While one common trait of young adult dystopian novels is that the narrator is almost always wise beyond his or her years and has unusual skills or abilities, usually focused on surviving, I felt that, as informed as Gaia was sometimes, she was remarkably ignorant at others, and in ways she shouldn't have been. Gaia transformed immediately from someone who was obedient to the society in which she lived, to a rebel who was incredibly well-informed about people in power and their motives. Where did these sudden flashes of insight come from? The disjointed, sometimes lecturing narrative made it hard to really immerse myself in the story.There were a lot of other disjointed elements that prevented me from fully enjoying the story as well. Some of this was purely a lack of relevant details. For example, for the outsiders, they were remarkably complacent in the whole infant advancement in exchange for pitiful rations. Nobody except the mothers whose babies were being taken seemed to really have an issue with this and we never really get an understanding of why. There are a few scenes where someone tries to explain why the community ended up the way it is, but they were very thinly sketched and abstract. I just didn't buy that everyone in these communities was cowed enough, or brainwashed enough, to just stand by and be like, well, that's that. Where was the history? Where was the development? We got plenty of tender vignettes of Gaia with her parents, but nothing that really explained anything.I thought most of the secondary characters were pretty forgettable, for the most part, or were introduced only so Gaia wouldn't be talking to herself when some plot point was revealed. The setup for a sequel was apparent, so maybe the secondary characters will get more development there, but frankly I don't really want to wait- we met these people now, we should be learning something about these people now. Even the supposed bad guy, Mabrother Iris, was two-dimensional and frankly kind of reminded me of Mr. Burns from the Simpsons more than anything else.There were some parts of this book that shone, that's for sure- I thought the bit on cooperation versus complacency was well done, and I enjoyed the evolution of the relationship between Gaia and Leon. I was left with lots of questions about the setting of the story and how the events of the book would affect the other players. I was curious about the wider world of the novel- what other communities exist, and are they all as strange as this one? The structure was here for this to be a really great story, but at the end of the day I felt like the focus was on being plausible instead of being vivid and the story as a whole suffered for it. I'm totally on board with setting up a series if the story merits it, but I personally didn't find enough in this book to make me want to read subsequent ones. Many other folks are over the moon about this title, though, so if you're into dystopian novels or want to explore a debut novel for 2010 it might be worth checking out still.Overall Grade: C-Blog with Bite Rating: 2/4Check out more reviews at What Book is That?"}], "description": "In the future, in a world baked dry by the harsh sun, there are those who live inside the walled Enclave and those, like sixteen-year-old Gaia Stone, who live outside. Following in her mother's footsteps Gaia has become a midwife, delivering babies in the world outside the wall and handing a quota over to be \"advanced\" into the privileged society of the Enclave. Gaia has always believed this is her duty, until the night her mother and father are arrested by the very people they so loyally serve. Now Gaia is forced to question everything she has been taught, but her choice is simple: enter the world of the Enclave to rescue her parents, or die trying.", "title": "Birthmarked\n      \n          (Birthmarked #1)", "url": "https://www.goodreads.com/book/show/6909544.Birthmarked__Birthmarked___1_", "average": 3.89, "cover": "https://images.gr-assets.com/books/1442562480l/6909544.jpg", "reviews": 3540, "authors": [{"url": "https://www.goodreads.com/author/show/3036304.Caragh_M_O_Brien", "name": "Caragh M. O'Brien"}], "type": ["Young Adult", "Science Fiction", "Fantasy", "Science Fiction"], "outlinks": ["http://www.goodreads.com/book/show/6909544-birthmarked", "http://www.goodreads.com/book/show/8763666-birthmarked", "http://www.goodreads.com/book/show/12793197-marca-de-nacimiento", "http://www.goodreads.com/book/show/17972265-do-um-lekesi", "http://www.goodreads.com/book/show/10368172-birthmarked", "http://www.goodreads.com/book/show/17567383-die-stadt-der-verschwundenen-kinder", "http://www.goodreads.com/book/show/9424367-prized", "http://www.goodreads.com/book/show/13010211-promised", "http://www.goodreads.com/book/show/13013051-tortured", "http://www.goodreads.com/book/show/20518838-the-vault-of-dreamers", "http://www.goodreads.com/book/show/15817997-ruled", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies"]}