{"ratings": 142, "userreviews": [{"userName": "Ryan Dejonghe", "userReviewDate": "Oct 31, 2013", "userURL": "http://www.goodreads.com/user/show/21649558-ryan-dejonghe", "userReview": "If you love the 80s, you’ll love this book. 8-BIT CHRISTMAS fondly reminds me of A CHRISTMAS STORY, but instead of Ralphie asking for a Red Ryder BB gun, Jake Doyle wants a Nintendo NES (and his sister wants a red-headed Cabbage Patch Doll). References from the 80s abound: Garbage Pail Kids, Inspector Gadget (and Dr. Claw), Muppet Babies, Cindy Lopper, Care Bears, GI Joe, the Pizza Hut BOOK IT! program, and even the Power Glove! And this is only a fraction of 80s references included.As with A CHRISTSMAS STORY, this story is narrated in the first person perspective of a grown-up protagonist reflecting upon his childhood Christmas memories. The book kicks off with Jake’s rich family friend Timmy Kleen receiving a Nintendo NES. Soon, every boy in the third grade begins clamoring for their very own NES. As with A CHRISTMAS STORY, familiar hilarity ensues.Humor is the thing that keeps this book going strong until the end. I noticed a few small nitpicks: the congruency of 80s releases; first person descriptions when the protagonist isn’t in the room; and pausing the plot progression. But really, it all boils down to one thing: humor. For instance, it’s okay when the protagonist pauses the plot as he escapes into his imagination of competing for an NES on Double Dare, or when two there’s a page of bantering “yes, huhs”—because it’s delightfully funny (and it brings back fond memories).I was pleasantly surprised by how sentimental and warm the book concluded. There were hints of this while the protagonist was running around the streets of Chicago, but everything wrapped up pleasingly well at the end. Kudos to the author for giving such a satisfying conclusion. Be sure to keep an eye out for the future works of this book’s author, Kevin Jakubowski. He has a movie and some Comedy Central credits to his name, but there is also an unnamed upcoming series on Nickelodeon in the works that hopefully will be as funny as the book. For fans of the 80s, you may want to check out READY PLAYER ONE; it’s Science Fiction, but has a slew of 80s throwbacks. Special Thanks to DB Press for providing me with a review copy of this book."}, {"userName": "Wendi Palasak", "userReviewDate": "Dec 20, 2015", "userURL": "http://www.goodreads.com/user/show/19038513-wendi-palasak", "userReview": "Excellent Book!Very nostalgic! As a child of the 1980s, the whole book was a trip down memory lane. Engaging and fun. I thoroughly enjoyed it. For those who were there, this book is an experience, and reminds us of a simpler time when video games were still new and kids played outside. Magnificent ending! Definitely recommend this book to anyone who grew up in the 80s, especially those who caught Nintendo fever!"}, {"userName": "Bean", "userReviewDate": "Dec 13, 2015", "userURL": "http://www.goodreads.com/user/show/5186192-bean", "userReview": "3.5, A Christmas Story for the child of the 80s. It was warm nostalgia, had holiday spirit without being sickly sweet. Fast fun read."}, {"userName": "Trisha", "userReviewDate": "Nov 05, 2013", "userURL": "http://www.goodreads.com/user/show/997681-trisha", "userReview": "***Thank you to NetGalley for providing this free ARC copy.I put this on the \"children's literature\" shelf, even though it's narrated by an adult looking back on his Nintento-crazed childhood. But really I think it's a book adults would love more - particularly adults who were children of the '80s, like I was.Story:Narrator Jake is 9 years old when the first glorious grey Nintendo Entertainment System hits the market. The richest and most spoiled kid in town gets a Nintendo and all the other kids are suddenly swarming onto his front lawn, looking for new ways to suck up to him so they can have a turn on his NES. He only lets 10 kids in at a time on weekends, so the stakes are high and the competition fierce. Kids even go so far as to surrender some of their best toys just so they can go down to the basement and Nintendo-land.All over town, kids are plotting how to get their parents to give them Nintendos for Christmas. But when disaster strikes - starting with a kid's tantrum, and leading to a falling TV and ultimately a squashed dog - the town's parents are up in arms about the evils of Nintendo. The only NES in town is no longer available for weekend tournaments, and the kids are getting desperate. The parents even go so nuts they arrange for local stores to stop stocking NESes on their shelves. All the kids in Jake's class are now kissing their dreams of owning a NES of their own goodbye. But Jake isn't giving up on his dream. A stroke of inspiration gives him a new plan for how to save the town from being Nintendoless forever.My thoughts:I LOVED this book. As a child of the '80s, but also has someone who can apparently appreciate Kevin Jakubowski's sense of humour, I was snorting with laughter at almost every turn of a page (so to speak, as I read this on Kindle). Some parts of the book seemed a bit odd to me, like some of the dialogue used - I'm not sure that today's slang was used back in the '80s, even though I was there at the time. I guess my memory is a bit rusty by now. But there were a few occasions when I frowned over a certain choice of word that seemed more suited to the current day than to the '80s. I also found myself disappointed with the fact that Jake didn't get a NES for Christmas - even though he got something seriously awesome instead (and no, I don't mean the Lite Brite. haha). But yeah, all in all I thought this was a hilarious read and I would recommend it to anyone who a) can relate to an obsessive love/fondness for Nintendo (I myself had a Super NES, and it was still beautifully lumpy and grey), b) loves the '80s, or c) wants to enjoy a large number of laughs (it's the best medicine after all)."}, {"userName": "Desiree", "userReviewDate": "Nov 01, 2013", "userURL": "http://www.goodreads.com/user/show/1332847-desiree", "userReview": "A very funny story! At one point, I was laughing so hard that I had tears running down my cheeks! In fact, it is still making me laugh!The author takes us back to the 1980's and tells the story of a nine year old boy whose only goal in life is to score a Nintendo Entertainment System. Sure, he likes his baseball cards, his teacher and other things, but nothing else comes close to the Nintendo. When the rich kid in town is the only owner of the brand new system, he lords it over the rest of the boys. They will do just about anything to play with him, or even watch him play. After things turn tragic, all the adults end up hating the system, which only makes it worse. Nintendo-no-friendo! lol! Planning, scheming, bargaining and begging Santa are just some of the ways he thinks of to get his very own gaming machine!I definitely recommend this lighthearted, fun and immensely enjoyable read, even if it is not Christmas time!"}, {"userName": "Hannah", "userReviewDate": "Oct 31, 2013", "userURL": "http://www.goodreads.com/user/show/12429201-hannah", "userReview": "A flashback in a book. I guess this is what our parents felt like when they watched A Christmas Story for the first time. All the little pop culture things that make you say \"I remember that\". This book was great, the banning of The Nintendo Entertainment System county wide, and all he wants for Christmas is a Nintendo. The schemes and the hijinks are hilarious, I hope they make a movie of this so I can watch A Christmas Story and this back to back."}, {"userName": "Robert", "userReviewDate": "Jul 03, 2016", "userURL": "http://www.goodreads.com/user/show/13825156-robert", "userReview": "While this book is certainly not the next 'A Christmas Carol,' it is definitely a unique work which manages to capture the spirit of the season. The characters are lovable, with all their quirks and are surely destined to bring back great memories from an era just as classic as Christmas itself."}, {"userName": "Lisa", "userReviewDate": "Dec 13, 2013", "userURL": "http://www.goodreads.com/user/show/12249701-lisa", "userReview": "Super fun fast read. Especially meaningful to Batavians as there are numerous references to our town. Between all the town references and all of the 80's references it was super fun."}, {"userName": "Zach Koenig", "userReviewDate": "Mar 06, 2017", "userURL": "http://www.goodreads.com/user/show/34303877-zach-koenig", "userReview": "Pretty much everyone has seen \"A Christmas Story\", right? Well, swap out Ralphie's Red Ryder BB gun (1950s) for a Nintendo Entertainment System (1980s), and that is the gist of \"8-Bit Christmas\".For a basic plot summary, this book tells the story of Jake Doyle a mid-80s grade schooler who wants a Nintendo more than anything else in the world. Of course, a series of events transpire against his one Christmas wish, leaving the fate of his NES quest undecided until the final pages.Though I am actually \"a bit old\" for this novel (I was more of a \"90s kid\" than an \"80s kid\"), I was able to easily relate to its theme. I was a \"Nintendo kid\" growing up (NES, SNES, N64...you name it!), so I could sympathize with young Jake's plight! Author Kevin Jakubowski really is able to get inside the head of what it is like to be a grade school child.Is \"8-Bit Christmas\" an all-time classic? Probably not. In all honesty, it is a bit too derivative of \"A Christmas Story\" to carve its own niche in holiday literature. Plus, I think Jakubowski made a couple of little blunders (3rd graders still potentially believing in Santa Claus?!) that sometimes strained credibility.Overall, though, this was just a really fun read that brought me back to childhood. Isn't that what the Christmas season is all about?"}, {"userName": "Slytano", "userReviewDate": "Feb 21, 2018", "userURL": "http://www.goodreads.com/user/show/11955843-slytano", "userReview": "I'm not sure what happened at the end of this book."}, {"userName": "Amanda G. (Nellie and Co.", "userReviewDate": "Nov 09, 2013", "userURL": "http://www.goodreads.com/user/show/11942698-amanda-g-nellie-and-co", "userReview": "I think when it comes down to Christmas themed books, you either love them, or you hate them, and for me, it's almost always a love. I can't help it. I love reading about other peoples family festivities, and their collapsing trees, and the presents they receive; it makes me feel warm and fuzzy inside and that's exactly how 8-Bit Christmas made me feel. And fear not my fellow 90's friends, just because it's an 80's styled nostalgic trip down memory lane, doesn't mean you won't find things to easily relate to. You'd be surprised how much the 80's and the 90's had in common. Lets start with the nostalgia, as I fear that may be what puts people off, especially young adults, like myself. As you can in the description, it focuses a lot on an adults perspective on his life as a child, and while it is unknown whether it is in fact a true story that happened to the author, or whether it's entirely fictitious, there is a lot of trips down memory lane in this book, and trust me, I was pretty nervous to pick this book up myself, having just missed out on the 80's by around 5 years, however, I was amazed, and pleasantly surprised to find that a lot of the phrases, quotes, sayings and attitudes were the exact same as they were when I was child. I was always being told that 'fresh air was good for you' and big gatherings with family were big while I was a young minion, but don't be fooled, there's more to this book that a sticky and messy reminiscing session. If the constant reminders of my own childhood weren't enough, I would have through this book was written for me. I could easily relate to problems such as Christmas Birthdays, and double presents, talking intently to Father Christmas in grotto's and emotionally demanding specific presents, it was all a great childhood dream, and reading 8-Bit Christmas, I was transported to an age when Christmas was much less stressful, when I didn't know what my presents were, and when putting mince pies out for Santa were in fact eaten by Santa and weren't eaten by my Mum before she went to bed. I was in a void of Christmas memories throughout this book, it was fantastic.The plot itself didn't feel defined however, and for once, that didn't bother me. I'm usually really looking for a well developed, well written and interesting plot, and this book felt more like a conversation, one sided of course, or a diary; I was looking into this mans childhood, into his memories, and laughing at his mistakes, or his silly ideas, or commending his bravery of escaping a school trip, or completely sympathising with his endurance of a very mature younger sister. Sometimes, I felt like it was wrong to laugh at this boys adventures, and his friendships, and his strops, and other times, it felt so natural, like I was laughing with him. I understand this is starting to sound like this book sucked me, and damn I'll admit, it really did. It was utterly wonderful, and I can definitely say, this book will, at some point, have a nice little spot on my shelves, and I'll read this wonder over and over again. 8-Bit Christmas isn't about a dead dog, or about begging constantly for a game console, it's about growing as a person over the season, about doing things for others. It's about seeing your priorities correctly, and seeing that there's more to life than what you once thought. It's about considering your family, and appreciating the gifts you receive every day of the year, not just at Christmas. It's a lesson, a life lesson. A lesson that's very worth learning.5 StarsFor more reviews and book news, check out my blog Book Badger"}, {"userName": "Sara", "userReviewDate": "Nov 22, 2013", "userURL": "http://www.goodreads.com/user/show/10135806-sara", "userReview": "First, I'd like to thank Netgalley for the ARC.8-Bit Christmas follows nine-year-old Jake, who just really wants a Nintendo for Christmas. It's the 80's, it's the cool new thing, and only the richest, most annoying kid in town has one. There's a fierce competition to use his Nintendo, culminating in children trading in their favorite toys for just a few minutes or hours of play. Jake's had enough of this nonsense and decides he's going to get his own Nintendo by whatever means necessary. He participates in a Cub Scout wreath-selling competition, teams up with his little sister to convince their parents to buy their most-desired presents, asks his relatives and Santa for a NES, and even resolves to buy his own if it comes to that. But after a disaster involving a dead dog, Nintendo is banned in the county where Jake lives and suddenly it doesn't look like a very likely Christmas present. Will Jake end up with the NES, or will he end up with something even better?8-Bit Christmas is entertaining. I'll give it that. It's a quick read and I enjoyed the pop culture references, although some of them are a bit before my time. What it lacks, however, is a cohesive plot. It often feels like a bunch of funny anecdotes about Nintendo linked together with other funny anecdotes about unrelated things, with a He-Man or Cabbage Patch Doll reference thrown in for good measure. The author will go on about Jake's latest scheme to procure a Nintendo, only to philosophize about midwest winters for several pages. Then we're back to the Nintendo for awhile before switching gears entirely and hearing about Jake's obsession with crush on his art teacher. I feel like 8-Bit Christmas might make a better film than a book - after all, I did enjoy Assassination of a High School President, a film written by Jakubowski.Still, it's not all bad. I laughed out loud on several occasions and read the majority of the book over about three days. I probably would have enjoyed it more if I were about ten years older, or if video games had been a big part of my childhood. If you were in elementary school during the mid-80's and got caught up in the Nintendo whirlwind, you'll probably enjoy it more than I did."}, {"userName": "Romancing the Book", "userReviewDate": "Feb 16, 2014", "userURL": "http://www.goodreads.com/user/show/5328566-romancing-the-book", "userReview": "Reviewed by MarissaBook provided by NetGalley for reviewReview originally posted at Romancing the BookReminiscent of the movie A Christmas Story, 8-Bit Christmas is an up-dated version for the (almost) computer age as 8 year old Jake plots and schemes to get the brand new Nintendo Entertainment System for Christmas. By the time Nintendos came out in the early 1980′s I was a new mother so I bypassed that era altogether; however, I related to being a kid and wanting something so badly that I thought I would literally die if I didn’t get it.While most books about bygone generations seem to concentrate on the music and fashion of the era, Jakubowski gives us the 8-year-old version – toys and sports. Some I remember fondly (LiteBrite, The Goonies, Darryl Strawberry) while others I had to look up to see if they honestly existed. I was greatly amused to find out the story behind the Ripken baseball card was, in fact, true. Also true is the Frank Lloyd Wright House in Batavia, Illinois.The book is a sort of mish-mash of memories taking place between 1982 and 1989 with events out of order. For instance, the book begins in 1982 and one of the first things going on is Jake’s mom and sister working out to Jane Fonda. The Domino’s Noid is mentioned (according to Wikipedia, the Noid was created in 1986), Max Headroom (1984), the Chrysler Dodge Grand Caravan (1987, specifically), Ferris Bueller(1986)… You get the idea. And somehow all of these prime events occur while Jake is in third grade.While my methodical mind is saying “WTF?”, the rest of me is laughing and thinking, “I remember getting french fries in miniature batting helmets!” If you were alive at all during the 1980′s, you will enjoy this book. If you were ever in the third grade, you will enjoy this book. And my guess is, if you were ever a third grade boy with a crush on your teacher, you will really enjoy this book. I hope they make the movie – I know it will be another Christmas classic."}, {"userName": "Chris N", "userReviewDate": "Nov 04, 2013", "userURL": "http://www.goodreads.com/user/show/1401994-chris-n", "userReview": "Timmy Kleen is the neighborhood rich kid. He gets what he wants and one day for his birthday he strikes kid gold, the newest thing around, a Nintendo Entertainment system.It’s the late 80’s and Jack Doyle is 9 and his jaw drops, along with most of the neighborhood boys, when he sees what Timmy got for his birthday. Timmy announces that on Saturday mornings 10 boys, only 10, will be picked to spend the day with him playing with his new Nintendo. So starts the jockeying for prime positions in Timmy’s lineup.For those who haven’t made the cut each Saturday, the rest would meet at the local trading card store to buy and barter baseball cards, the staple of most boys childhood. Even this activity pales to the quest to get a Nintendo of their own. A rumor goes around that the cub scout who sells the most Christmas wreaths will win a coveted game system. Mayhem ensues as each boy tries every trick in the book to win that prize.It all seems so close and with Christmas coming every boy is praying and begging Santa for a system of their own under the tree until something happens and parents rally to ban the sale of the gaming system and Jack, who had been obsessing about getting one, tries everything to get one. He even enlists his friends to sell their cards, pool the money together and buy one out of town.I really enjoyed this book, it brought back so many childhood memories about trying to get THE must have toy of the year and being jealous of those who have IT. For me it was an Atari. My little cousin would get all the newest electronic stuff and I wanted that Atari so bad I could taste it! This is a great read for Christmas!I received this as an ARC in exchange for a fair and honest review."}, {"userName": "Josh", "userReviewDate": "Dec 16, 2013", "userURL": "http://www.goodreads.com/user/show/7819730-josh", "userReview": "It can be hard to write a good Christmas book. There are already plenty of classic stories, not mention having to try and avoid classic Christmas story tropes that could relegate the book to being considered Christmas white noise. Couple these challenges with tackling your first book, and one begins to admire what Kevin Jakubowski accomplished with his debut novel, \"8-Bit Christmas,\" a fun, nostalgic romp through days of Christmas past.The story follows Jake Doyle's quest to get a Nintendo for Christmas. Along the way he has to contend with a little sister who has a Christmas agenda of her own, a greedy bully, and an entire county (among other obstacles).Going into \"8-Bit Christmas,\" I was definitely hesitant. I was definitely worried it could possibly end up being either very generic, or just a role call of everything nostalgic about the 80s shoehorned into a Christmas story. Luckily, I was pleasantly surprised by what I found. The story ended up being a good mix of story, humor, pop culture references, and a very good Christmas themed story. It is definitely a page turner due to this formula.The story does owe some of its moments to the perennial Christmas classic, \"A Christmas Story\" and its book counterpart \"In God We Trust; All Others Pay Cash.\" It shares a similar moment here and there, but more as an homage than anything. Overall, the story is quite different and is a great addition to Christmas stories that has plenty of nostalgia for those growing up in the 80s and of course plenty of Christmas spirit and quite the satisfying ending. Note: I received a free digital copy through NetGalley."}, {"userName": "Michelle", "userReviewDate": "Nov 17, 2013", "userURL": "http://www.goodreads.com/user/show/11008671-michelle", "userReview": "With the announcement of the release of the BRAND NEW Nintendo 8-bit Entertainment System, Jake begins a quest to obtain this highly coveted game system and become the envy of his friends and neighbors. But, the arrival of the game at the home of another boy in town has unintended consequences, and Jake finds that his quest is being thwarted by not only his own parents, but by all of the adults in town! In the process, Jake must deal with everything from school bullies to an incredibly competitive Cub Scout wreath sale. This is an incredibly charming book. As a child of the 80's (although, slightly older than the protagonist), I experienced a great deal of nostalgia while reading this book - Jakubowski manages to invoke almost every 80's icon from leg warmers to Max Headroom. The characters were interesting and believable, and the situations were amusing at worst - laugh out loud funny at best. At one point, I was laughing and crying at the SAME TIME. Mind you, I do not mean I was laughing so hard I was crying - I mean Jakubowski masterfully managed to write a scene that was both hilarious and touching at the same time. He is definitely a master storyteller. If the book has a major flaw it is that it might be a bit too reminiscent of \"A Christmas Story\", although the different time settings provide ample variety. In any case, it is a truly fun and clever story that is destined to become a Christmas classic. I received an advance copy of this title to review from NetGalley and DB Press, but my opinions are my own."}, {"userName": "Ramie", "userReviewDate": "Dec 09, 2013", "userURL": "http://www.goodreads.com/user/show/2406663-ramie", "userReview": "8-Bit Christmas is to children of the 80s what \"A Christmas Story\" was to children of the whatever decade that was (30s, 40s?). This time though there’s no Red Ryder BB gun. The only gun that any kid cares about is the one that allows you to play Duck Hunt on the Nintendo. Timmy Kleen is the only kid in all of Batavia to have a Nintendo. One kid. No one really likes Timmy and yet here they find themselves begging to get inside his house. Jake Doyle doesn’t want to spend his life waiting in a line to get into someone else’s house. Not when there must be some way to get his own system. Hints to the family. Who knows whether or not Santa is real, but asking him might not hurt, just in case. Same with God, real or not, who knows but you better ask him too. Maybe you can save up enough money to buy your own. Somehow, some way you must end up with your own Nintendo. Jake tries it all. Finally when Christmas hits and you still don’t have a Nintendo? All you can do it hope that the parents of Santa (if he’s even real) will make your dreams come true. The story is a trip down memory lane filled with Cabbage Patch Kids, baseball cards, and Saturday morning cartoons. I’d recommend it to anyone who likes “A Christmas Story” or who just wants to be reminded of life in the 80s.* Disclaimer: I received this book at no cost in order to review it. I offered no guarantee of a positive review, though I only request books I think I'll like because why read a book you think you’ll hate?"}, {"userName": "Bruce Gargoyle", "userReviewDate": "Dec 29, 2013", "userURL": "http://www.goodreads.com/user/show/22648121-bruce-gargoyle", "userReview": "Full review at http://thebookshelfgargoyle.wordpress...I received an ecopy of this book from the publisher via NetGalley, in exchange for an honest review.Ten Second Synopsis:Go on a journey with Jake Doyle, nine-year-old of the 80s, as he struggles to attain for Christmas the apparently unattainable and most desirable product of his life so far...the Nintendo Entertainment System.This was bordering on a six-star read for me. Jakubowski has created a story that perfectly captures what it is to be a kid and to have a desperate want for some toy or gadget that is unattainable by any reasonable means. He has accurately scripted the melodrama that accompanies the pinning of a kid's last hope on the gamble that Santa will provide. He has unwaveringly documented the lengths to which a kid will go (including enlisting a younger, more wiley sibling) to tip the odds in their favour.He's also created a mind-blowingly good ending that puts the whole story in a new light and perfectly reflects all that is good about being a kid - without any sentimentality or sap.This book will be snapped up by big kids who were the Jake Doyle of their era and/or neighbourhood. I think there's a definite market here for savvy readers of YA who are happy to hop on the historical pop culture period of the moment. Highly, highly recommended."}, {"userName": "Medeia Sharif", "userReviewDate": "Jan 20, 2014", "userURL": "http://www.goodreads.com/user/show/2533986-medeia-sharif", "userReview": "Jake Doyle wants a Nintendo for Christmas. It’s the 80’s and all his friends have to line up outside Timmy Kleen’s house, fawning over and bribing him to be let inside since he has the neighborhood's only Nintendo. The game system is hypnotic. But when something wacky, unexpected, and dangerous happens, Nintendo is banned in their small town of Batavia, Illinois.There’s no stopping Jake from trying to get his own system, though. He’ll help his sister get a Cabbage Patch Kid if she helps him get a Nintendo. He’ll attempt to sell the most Cub Scout wreaths for the chance to win the prize of a gaming system. He and his friends will make the utmost sacrifice to pool their money together to buy their own. Time after time, Jake and his friends face the frustrations of not being able to acquire a Nintendo. Christmas is nearing. Maybe Santa will grant Jake’s wish. This book was laugh out loud funny. Also, I loved the suburban setting, Jake’s parents and other secondary characters, the nostalgia, and all the names of the candy, toys, and shows of the 80s. I recall many of the games mentioned, and yes they were addictive, so I completely understood where Jake was coming from. Great writing and a trip back in time made this a delight to read. I read this via NetGalley, courtesy of the publisher."}, {"userName": "Kathy ", "userReviewDate": "Nov 24, 2013", "userURL": "http://www.goodreads.com/user/show/8254902-kathy", "userReview": "When you’re nine, in the 80’s, you want nothing more than the brand new Nintendo 8-Bit Entertainment System, and nothing will stand in your way of getting it for Christmas. Jake, like every other 9-year old, wants this present under the tree so bad that he can hardly contain his desire. Shortly before Christmas season one of the richer boys in town gets a Nintendo, and Jake and his whole crowd line up each Saturday to see who will be one of the lucky ones chosen to play on the system that day. However, due to one over-eager and boy and his dog, things go awry on Saturday. Now, Jake and his friends have their parents and the whole town to convince they need and want the Nintendo. When things get even tougher, Jake and his friends develop a fool-proof scheme to pick one up while on a class trip to the city—which ends in total failure. How everyone, and Jake in particular, get through this Christmas season is a fascinating story. The humor throughout kept me chuckling to myself throughout the entire read. I had forgotten just how far some people will go to get what they must have, and how fast a new gizmo like the Nintendo will catch on. I was a bit surprised at the nostalgic ending, however. If you have memories of the 80’s and how life was provide you a good trip down memory lane and will bring home how things used to be. I received this from NetGalley to read and review."}, {"userName": "Kandace", "userReviewDate": "Nov 05, 2013", "userURL": "http://www.goodreads.com/user/show/2838969-kandace", "userReview": "It's 1980-something and THE hot item for Christmas is the Nintendo Entertainment System. Jake Doyle is willing to forgo all the baseball cards in the world and hawk as many Christmas wreaths it takes to get a Nintendo. But a freak accident has all the parents decrying the violence of video games. Will Jake's quest for his dream gift be successful? Or will the princess be in another castle?Typically I don't read seasonal novels. They tend to be a little too sentimental for my taste. However, as a child of the eighties, the cover sold me. I can clearly remember the Christmas I got my NES, because, really, it was the Holy Grail of presents in the eighties. Jakubowski took me back to the days I spend hand-drawing maps for The Legend of Zelda. It is a beautiful balance of nostalgia and humor. While the premise was fun, I felt like this was just a modern retelling of something I have seen before. If A Christmas Story was set in the 1980's, you'd have 8-Bit Christmas. Still entertaining, but not really fresh. Also, I felt some of the cultural references were not chronologically accurate, but it didn't distract me from the story enough to fact-check. For more reviews by The Readist, visit www.thereadist.com"}, {"userName": "John", "userReviewDate": "Jul 18, 2014", "userURL": "http://www.goodreads.com/user/show/14628725-john", "userReview": "Having been a kid that grew up in the 80's, I definitely appreciated all of the nostalgic references in this book from the era as seen from the point of a view of a grade schooler. Those pop culture nods and the discussion of being an NES fanatic specifically are what carried the book in my opinion. For me though, the book is too much of a direct ripoff of the classic movie \"A Christmas Story\". To say that \"8-Bit Christmas\" was inspired by \"A Christmas Story\" is not putting it strongly enough. I often felt like Jakubowski took the movie script, renamed the characters, and anytime a 1940's reference was made, replaced it with an equivalent 1980's reference. Otherwise, the plot, character traits, etc are a direct match. If you are an 80's kid AND a fan of \"A Christmas Story\", you will still probably find this to be an enjoyable read.I found a much more detailed treatment of the parallels between \"A Christmas Story\" and \"8-Bit Christmas\", along with a wonkish delve into historical timeline issues in \"8-Bit\" on Amazon, which I have linked below.http://www.amazon.com/review/RIUYVT8X..."}, {"userName": "Anastacia ", "userReviewDate": "Dec 05, 2013", "userURL": "http://www.goodreads.com/user/show/1259503-anastacia", "userReview": "This book is about Jake, a 9 year old boy who wants a Nintendo. I was a kid (though a girl) in the 80s and couldn't resist reading this book for the memories. There's a lot - and I mean a LOT - of pop culture references in the book (and not all of them were accurate, at least I didn't feel like they were really 80s pop culture references), from Cabbage Patch kids to He-Man, and it's a fun romp through memory lane.That being said - I had to rate the book 3 stars because I didn't feel like there was any plot at all. Yes, certain things happen in Jake's quest to own a Nintendo, and the book certainly has a lot of funny moments (and a part where I bawled my eyes out hysterically, which may add to my 3-star feelings for this book) but I just felt like every scene was strung together mostly to lead the reader through memory lane and to the end of the book, more so then to actually tell a story of one young boy.In other words, the book was fun to read, without any meat on the bones."}, {"userName": "Shawn", "userReviewDate": "Jan 10, 2015", "userURL": "http://www.goodreads.com/user/show/2596615-shawn", "userReview": "This book totally describes how I felt about the NES during the late 80s. Of course it follows a formula that is similar to A Christmas Story but that's okay because it perfectly captures the same passion Ralphie felt towards obtaining a Red Ryder BB gun as the kid in this story felt about getting an NES. It's funny because I had friends/acquaintances that were very similar to some of the characters in this story; like the kid who had all the newest games and held a sort of lottery to determine who would get to play them. There was a kid just like that, in my version of a neighborhood, in Alaska that had Super Mario Bros. 3 and Double Dragon II. I remember dying to get home from school every day so I could go over to his house and talk him into letting me play those games. Highly recommended to anyone who loves Nintendo:)"}, {"userName": "Lindsey", "userReviewDate": "Nov 13, 2013", "userURL": "http://www.goodreads.com/user/show/1909877-lindsey", "userReview": "I have two \"people\" to thank for my reading 8-Bit Christmas by Kevin Jakubowski. One is my friend Jenni for the recommendation because I never would have requested this book on my own and the other is NetGalley for the book itself. This book was thoroughly delightful and everything you could hope for in a book about growing up in the '80s and that desperate Christmas wish for a Nintendo. I loved the cultural references to the time and all I could picture was my husband and brother when reading about Jake Doyle. It felt like you were reading your favorite Christmas movie. This book just put a smile on my face and had a perfect ending. Merry Christmas!http://thisismybookblog.blogspot.com/..."}, {"userName": "Angypants", "userReviewDate": "Dec 05, 2013", "userURL": "http://www.goodreads.com/user/show/2257569-angypants", "userReview": "I really enjoyed \"8-Bit Christmas\". Like the title suggests, this is about one boy's attempts to acquire, by almost any means possible, a Nintendo Entertainment System for Christmas. If you enjoyed \"Ready Player One\" and all it's 80's nostalgia, and are a fan of \"The Christmas Story\", than I think you will enjoy this. If you aren't familiar with either, this still stands on its own, as a hilarious Christmas tale. As someone who grew up in the suburbs of Chicago, I also enjoyed the local references and the author's ability to capture what it meant to be a kid in the 80's, in all the glory that is suburban Illinois."}, {"userName": "Obadiah", "userReviewDate": "Oct 31, 2013", "userURL": "http://www.goodreads.com/user/show/40656-obadiah", "userReview": "I grabbed this book on a total whim and I'm overwhelmingly glad that I did. I cannot believe how much I laughed and smiled while I read it! Jukabowski really nails the essence of being a 9 year old kid yearning for \"that\" Christmas present. He is definitely going for a \"Christmas Story\"-for-the-Nintendo-generation vibe and he mostly nails it. From time to time the book feels little bit too much like a collection of short blogs on 80s culture but this is a minor quibble. The story was a warm blanket of nostalgia and I felt great snuggling up under i. It's a fun read and made me wish for more like it. I may actually read it again closer to Christmas."}, {"userName": "Kathryn", "userReviewDate": "Nov 12, 2013", "userURL": "http://www.goodreads.com/user/show/5652240-kathryn", "userReview": "I received this book as an ARC from the publisher through NetGalley, in exchange for an honest review. II truly wanted to love this book or at least enjoy it. One, there is very little plot or other elements that make a good story. It seems the book mainly was written for nostalgia's sake. If you are a fan of the movie, A Christmas Story, this could be enjoyable, but I for one have not ever enjoted that movie and I as well as many other reviewers find a parallel between this and A Christmas Story, a la 1980's. Some of the 80s references brought back memories, but as a whole I did not enjoy the story and feel that I could have chosen a much better book to read during those 6 days."}, {"userName": "Mandi", "userReviewDate": "Dec 01, 2013", "userURL": "http://www.goodreads.com/user/show/6077337-mandi", "userReview": "This book is mildly reminiscent of the movie \"A Christmas Story\", only taking place in the 80's. The author takes his memories of childhood and spins them into a humourous tale that all children, regardless of generation, can relate to- bullies that only become bigger with memory, parents who could be firm but also incredibly loving and teachers whom you still love or hate all these years later. This book is especially lovely for those of us(yes, this includes me, friends) who actually grew up in the 80s and remember the era with equal fondness and loathing. Full review here: http://theinsomniacbibliophile.blogsp..."}, {"userName": "Jenni V.", "userReviewDate": "Oct 30, 2013", "userURL": "http://www.goodreads.com/user/show/7763278-jenni-v", "userReview": "It feels weird to give five stars to such a \"light\" book, but I'm doing it because it made me happy while I was reading it and when I was finished my first thoughts were who else I could recommend it to (answer: fellow children of the 1980's).**Thanks to NetGalley and DB Press for the opportunity to read and honestly review this book.**Find my full review at:http://readingatrandom.blogspot.com/2..."}], "description": "It's 1980-something and all nine-year-old Jake Doyle wants for Christmas is a Nintendo Entertainment System. No Jose Canseco rookie card, no GI Joe hovercraft, no Teddy friggin' Ruxpin--just Nintendo. But when a hyperactive Shih Tzu is accidentally crushed to death by a forty-two-inch television set and every parent in town blames Nintendo, it's up to Jake to take matters into his own hands. The result is a Christmas quest of Super Mario Bros. proportions, filled with flaming wreaths, speeding minivans, lost retainers, fake Santas, hot teachers, snotty sisters, \"Super Bowl Shuffles\" and one very naked Cabbage Patch Kid. Told from a nostalgic adult perspective, 8-Bit Christmas is a hilarious and heartfelt look back at the kid pop culture of the 1980s.", "title": "8-Bit Christmas", "url": "https://www.goodreads.com/book/show/18730452-8-bit-christmas", "average": 4.0, "cover": "https://images.gr-assets.com/books/1382995623l/18730452.jpg", "reviews": 50, "authors": [{"url": "https://www.goodreads.com/author/show/7365734.Kevin_Jakubowski", "name": "Kevin Jakubowski"}], "type": ["Fiction", "Humor", "Contemporary", "Holiday"], "outlinks": ["http://www.goodreads.com/book/show/18730452-8-bit-christmas", "http://www.goodreads.com/book/show/20922925-8-bit-christmas", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/26583370-life-and-other-near-death-experiences", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/20552595-how-i-became-a-famous-novelist", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/36004055-not-perfect"]}