{"ratings": 27926, "userreviews": [{"userName": "Jessica", "userReviewDate": "Sep 23, 2010", "userURL": "http://www.goodreads.com/user/show/3283298-jessica", "userReview": "02.05.2011 PRE-RELEASE SELF-HYPING UP ---> WARNING WARNING WARNING <---Dear friends,With the release date of the 10th Morganville installment coming up, I’d like to take this opportunity to apologize officially – in advance – to all of you for my upcoming behavior during the next few days. With a probability bordering on certainty, Bite Club will turn me into a total fangirl. There will be squealing, there will be flailing, there will be lots of Oh-My-Gawds and sexual innuendos concerning the male characters. Consider yourself warned.Love,Jess_________________________________________________05.05.2011: REVIEW Hmm, I will have to think about this. Bite Club definitely felt different from the rest of the series and I’m not quite sure whether or not I’m happy about this change and there wasn’t nearly enough Nekkid Shane time but still, it’s Morganville. I just love those books! Don’t think I can be trusted to come up with an objective review but I’ll try ;)"}, {"userName": "Nic", "userReviewDate": "Aug 12, 2010", "userURL": "http://www.goodreads.com/user/show/2813423-nic", "userReview": "I wonder if this would work?Dear Rachel Caine,I really loved Bite Club but I notice an error (or rather a few) in it. I don't know if you did it or some out of their mind editor but there was only one nekkid Shane scene and by that I mean Shane getting nekkid scene. How could that happen? Are you trying to drive us crazy? Now I know how much you love your fans and hate to see them unhappy so I thought of a solution to make it all better. In Last Breath you should include a nekkid Shane scene in each chapter (and yes I mean Shane getting nekkid) and then I think we will be okay and I will let the whole Bite Club thing slide. I am also pretty sure me and my friends would buy ten copies each if you did that.Yours faithfullyNic"}, {"userName": "Anzu The Great Destroyer", "userReviewDate": "Jun 19, 2013", "userURL": "http://www.goodreads.com/user/show/2278800-anzu-the-great-destroyer", "userReview": "***SPOILERS AHEAD. YOU HAVE BEEN WARNED.***Ok people, rant time.So I managed to go through 9 books (plus many other short stories) of MV without even getting remotely bored. Do you have any idea how big that is to me? I cannot start a series that has over 10 books. It terrifies me. I know that I will end up being bored, it’s just my nature. MV, on the other side, is extremely special. The books are short, to the point and super-fast to read. That’s why I love them so much.And then something had to happen. Why would things be good till the end? Why? They can’t. Life’s too much of a bitch to allow this to happen. Oh yes.So, Bite Club. Cool name. Says it all. Fight Club in Morganville. Should be awesome.Yeah. Awesome.:sigh:I was expecting Shane to be the center of attention. Why? Because a Fight Club theme couldn’t fit anyone but him. He’s an angry teenager who needs to let out some steam. He has it in him. I just had no idea that things will go so bad.Bite Club has an alternating POV. Ok, not really one chapter Claire one chapter Shane, but a Shane insight from time to time. I was kind of glad to have this since I :cough: used to :cough: like Shane. MV has a bunch of short stories from his POV. I didn’t mind it. And I thought maybe a Shane POV from time to time would be nice for a change. You know, keep it from getting boring and so on.The only thing that Shane’s POV managed to do it get me even angrier and made me hate the dude. Lemme explain why.So, dearest Shane is super excited to attend the newest gym in Morganville. Of course nothing can go right in this town, so by now you should suspect the new gym to be some kind of evil pit of doom. I know I did. So this gym has a self-defense program. As one would expect, our dearest group of four vampire slaying teenagers can’t keep themselves from attending this course. Needless to say that Shane is the happiest between them. As I said, anger issues.Blah blah blah drama drama drama Shane gets mindcontrolled by a hottie vamp chick. And she makes him be a total douche to everyone, especially Claire and Michael.Quotes like\n\nAnd if Myrnin had taken her somewhere, from my territory…\n\nAnd[over the hottie vamp bitch]I felt hot all over, and, yeah, again, I’m a guy—don’t judge. I love Claire, I do, but this was a dream. And besides, Claire had just ditched me to run off on her own when I needed her. \nhappened.He was drooling over the vamp chick while remembering Claire and comparing their looks. The vamp chick won of course. He verbally and physically hurt Claire. He beat up Michael. He insulted Eve.And I can’t handle this. I can’t go back to seeing Shane the same way I did before Bite Club. I just can’t. I know that he was being controlled by the evil hottie vamp chick but I can’t help but feel that part of his thoughts and feelings were his own. He wanted to do these horrible things. The angry thoughts and doubts were always there. And this was confirmed when I read Anger Management. He still has those lingering thoughts.No, Shane. Just no. We are done.And you know what gets me even angrier? How easy everyone forgave him. I knew the “I’m so sorry I hurt you” and “It’s ok bro, we love you” ending was coming. And it did. Everyone forgave him just like that. Especially Claire. I mean he broke up with her in the most horrible way and once he got all puppy-eyed with her she just jumped his bones without a second thought.I refuse to acknowledge this relationship.The only thing that kept me from giving Bite Club the fuck-you-one-star rating was Myrnin, my steampunk vampire hero.Myrnin’s character keeps on growing on me, and I absolutely love him by now. He is funny, crazy, charming and badass. I just keep on reading these books wishing to get another glimpse of him and his crazy world.\n\n “I so rarely have the chance to field-test anything. Amelie is so conservative about these things.” “No kidding,” Eve said. “Holla.” Myrnin’s eyes widened. He looked at Claire, who shrugged. “She agrees,” she said. \n\nEve and Michael were as awesome as ever. Claire sucked for how weak she was, and is, towards Shane. I feel bad for saying this, but I wish they break up. I really do. I see many girls wishing Claire will hook up with Myrnin but I can’t imagine this. It doesn’t feel natural. I feel like Myrnin’s love for Claire is paternal, nothing more. And duuudes, he’s like ancient and shit. Ew. Cmon. It’s like Ryodan all over again.But maybe if this hookup happens it won’t be bad.Oh, who am I kidding? I’d love it. I’m sick in the head. Don’t judge me."}, {"userName": "Dawn", "userReviewDate": "Nov 21, 2010", "userURL": "http://www.goodreads.com/user/show/4434838-dawn", "userReview": "I just finished Ghost Town, did NOT want it to end. This is by far my favourite series, can't wait for this one! Sooo far away."}, {"userName": "Jamie", "userReviewDate": "Feb 17, 2014", "userURL": "http://www.goodreads.com/user/show/4605519-jamie", "userReview": "3 1/2 stars for this one. I love this series but this book really showed me some points I liked more than previous books and some I liked less. The drama within the Glass house reaches all new heights in this book. Everyone has secrets from one another and not all of them are good!In this book a new gym has opened up where a vampire is training humans and vampires alike. One thing I must say is that it must be HUGE. We get all the standard gym setups for weights, cardio, etc. We have boxing areas, ratchet ball, karate mats and even a fencing room and more! I would love to have a gym like how this appears in my city (less the vampires). Shane is one of the first to check it out and gets really into the fighting there but when one fights under vampires, bad things can follow. Claire is told some startling information but is heavily threatened to keep quite about it. Frank Collins is still being kept a secret, Shane is drifting away and even Eve and Micheal have a secret! All this adds up to lots of drama and home intrigue as a I wonder how it is all going to come out.While this book is mostly focused on Claire (as all past books have been), we get something new that I loved. We get a first perspective look into Shane's thoughts! While they are very warped in this book due to other factors I won't give away, it was an interesting new aspect to the series I highly enjoyed and hope to see again in future books of the series.One thing that is really being to annoy me are the idioms and text speak being used on a regular basis. I loved how the earlier books had a more mature aspect to how they spoke but now its getting annoying with the slang used. I used to love Eve but with how she was talking in this book, she is now the type of person I would avoid hanging out with. She is not 14-16 years old yet acting like one. It is annoying when a character changes like that and this in one change I do not like at all and cost a fair bit of enjoyment for reading this.With all the tension from the secrets I was expecting some interesting scenarios later in the book but i felt a bit let down in the end. The grand show was lackluster, Claire didn't seem to learn anything and no one asked questions about things that did not add up, they all just went along with whatever was going on! Grr!So overall, good story with fun potential. Some interesting character comebacks. Drama-filled but the last 20% of the book could have been better. Here's hoping the next book is better and Eve goes back to her old kick-but, goth self!"}, {"userName": "Penny", "userReviewDate": "Jan 18, 2012", "userURL": "http://www.goodreads.com/user/show/7463065-penny", "userReview": "Actual Rating 1.5 stars.This books is different from the ones before.I was not interested in this new story at all."}, {"userName": "kitty cué", "userReviewDate": "Nov 05, 2010", "userURL": "http://www.goodreads.com/user/show/4222059-kitty-cu", "userReview": "You're killing me here! I don't want it to end! :'("}, {"userName": "Lora", "userReviewDate": "Dec 08, 2010", "userURL": "http://www.goodreads.com/user/show/4632071-lora", "userReview": "Actual rating: 4.5 starsNotice: This review is completely subjective, bias, and is written by a total Morganville fangirl.There's trouble in paradise - or rather, Morganville - which is just about as far from paradise as you can get. Nevertheless, things have been going well for Claire and her housemates. Sure, Frank, her boyfriend Shane's once thought dead father is really alive - and Claire's forced to keep the secret from Shane by none other than Frank himself. But things could be worse, in a town like Morganville. But as Claire knows all too well, things are never easy going in Morganville for very long. Everything starts getting shaky again when a boy from her science class is found murdered, Shane starts acting strangely violent and aggressive, and a new pay-per-view internet show featuring vampires vs. humans in extreme fighting hits the Web - and Shane is one of the humans.I'll admit that it was hard reading about Shane getting lost in the fights and in Glory's eyes. That bitch. I apologize for the language, but there really is no other way to describe Glory. My homicidal tendencies always come out when a female character comes into the picture in a series only to screw up everything between one of my favorite couples. And that's exactly what Shane & Claire are - a favorite couple. I've been rooting for their relationship since Shane called Claire a \"kid\" in chapter 4 in Glass Houses. (Yes, I remember that far back.) (Okay, fine - I looked it up. BUT, I still remembered him calling her that. ;)) The thing is, I was really anticipating reading from Shane's POV because I expected a lot of sweet, awww-worthy thoughts about Claire. But Shane's head is in such a bad place through the majority of this installment that it ended up being a lot of resentful, cruel thoughts and there were even some instances where he was verbally mean to Claire.A lot of it is glamour-induced, but Shane does seem to have some issues with Claire and her relationship with Myrnin. He isn't buying that it is strictly platonic and therefore he has doubts - and everyone knows that doubt is the #1 relationship killer (that and financial problems - but that's only if you're married). I just hope that his issues don't ruin things for the next two installments.The thing that really pleases me about this series is the characters; I love 'em. They're characters that I can imagine myself being friends with in real life (Clare). They're ones I can imagine doing unspeakably naughty things to that are too inappropriate to list in this review for fear that a child might happen upon it and get a much too early education in the fine arts of naughtiness (e.g. Shane, Michael, Myrnin, and, yes, even Oliver. Oh, don't look at me like that - I realize that he was turned in his fifties but I still love him). They're ones that make me laugh and cry (yes, I am sappy) at the most unexpected times.FAVORITE QUOTES:\"We're getting married!\"\"Are you in the car that's almost caused three accidents on North Vance?\" Hannah asked. \"Because I'm following you with my lights flashing, and whoever's driving isn't pulling over.\"\"Let him go,\" Claire said. \"Trust me. You aren't going to get him to stop.\"\"Oh, God. It's Myrnin, isn't it?\"\"Tell that police lady to stop chasing me,\" Myrnin said, annoyed, from the front seat. \"Really, I'm not that bad at this.\"(The scene where Myrnin drives is HILARIOUS.)\"I pulled back my fist for another punch, and he didn't flinch. He didn't look away, either. He just said, \"It's not your fault, man. I don't blame you.\"So you see, my friend, this series is definitely a favorite of mine. And when it eventually ends, like all good things do, I will be heart broken. But that's all right. Much like watching reruns of your favorite shows after they've left the air (Buffy, Friends, Moonlight, etcetera, etcetera), I'll reread this wonderful series time and again.And for those who've been living on another planet, Last Breath comes out later this year in Nov and what is expected to be the last installment (*sobs*) is set to come out in April of next year. It is currently Untitled.I ♥ Nekkid Shane"}, {"userName": "~Tina~", "userReviewDate": "Aug 12, 2010", "userURL": "http://www.goodreads.com/user/show/2594672-tina", "userReview": ":Spoilers:You know, every time I read one of these books, I never know what to say that I haven't said before. I feel like a broken record. Morganville Rocks. Morganville Rules. Rachel Caine is a freaken genius. I love, adore and worship this series etc etc etc...Broken record right?So, since I've said it before, I guess I'll just say it again. I love.this.series!!!Bite Club is another mind boggling installment! I don't know how Caine does it, but her story-lines are so freaken fun and brilliant. This is book ten and we have two more on the way and I still don't want it to ever end.For this round of recent madness in Morganville, our favorite gang is up against an old enemy while his pawns are plotting and pounding away. They designed a fight club for humans to learn to defend themselves against the evil that lives in town, only evil is in the very ring they train in. Vampire vs Human. The Immortal Battles are viewed by millions of paying customers to watch the ultimate fight. But one of our humans just happens to be our very own Shane Collins. Not good. Not good at all. See, Shane is seeing red and not acting like himself. Fueled by rage and memories Shane's not in his happy place anymore, and it's up to Claire, Michael and Eve with the help of our favorite crazy-man to find a way to save Shane from himself, destroy there enemy and do it before Amelie takes down the house.Well...one things for sure, you can't ever say that this town is ever dull....I don't know about any of you, but this book felt very different from all the rest of them. Maybe it was the lack of tacos and chili or not enough zombie games being played or the fact that there wasn't nearly enough banter and snark. But this book definally felt very serious. There is always a dark and dangerous feel to every single one of these books, yes, but I guess this felt more...heavy amongst the rest. And I think the reason was Shane. Not that we need another reason for these books to standout more then they already do, but I really got a huge kick out of Shane's point of view. Only I think I was expecting it to be in that Shane-funny-fashion instead of the inner-turmoil of a man who's lost control of everything around him and skipped over to the dark side for a spell. Don't get me wrong here, it worked a lot better then I ever thought it would, making a huge impact on an already successful series, so what I'm getting at is, even though I was expecting something different, It was really good to understand Shane on a whole new emotional level. I still missed the funny mind you, but...it worked.There was lots of angst and relationship drama to get us readers worked up into knots. I was pretty nervous throughout the whole book and wished it had more of those delicious moments, I mean Nekkid  Shane was only shirtless once in the entire book. Tsk! Caine, your slipping. But I have faith she'll make it up to us in the next book (hint hint nudge nudge). As for Myrnin, If I didn't properly adore him before, well, I certainly do now. Not only was he freaken hilarious and had some of thee best one liners and totally took over as comic-relief in Shane's absence, but he also really kicked ass in this book. Without a doubt, he's my all time favorite psychopath!Bottom line, These books are crazy and such an absolute blast. These characters are seriously like reading about friends and the storyline are fast paced, heart pounding and then neatly cleaned up and settled down and all ready for the next epic disaster. I love how Caine does it and again, I will never get tired of this escape and always be begging for more. This book was such a rush! Loved. It!Next!!"}, {"userName": "Maria V. Snyder", "userReviewDate": "Jun 11, 2011", "userURL": "http://www.goodreads.com/user/show/1629797-maria-v-snyder", "userReview": "Still loving the series and characters in Morganville. I didn't give 5 starts because it seems this book was hastily written - there were a number of plot holes and mistakes. However that didn't stop me from finishing the book in a couple days. I did like seeing the world from Shane's POV, but I think Rachel did that so the readers wouldn't hate him. I wouldn't have minded hating him for a couple chapters - I think it would have added more conflict and tension overall. I do hope she continues this and we can see the world through Eve and Michael's POV as well."}, {"userName": "ReadingRoxy", "userReviewDate": "Apr 26, 2011", "userURL": "http://www.goodreads.com/user/show/3962632-readingroxy", "userReview": "[ who else was soooo excited for them getting married?!?! Amelie better not mess that up >.< OH and I can't believe Claire's not going to MIT because of Shane...UGH at least do it for Myrnin! (hide spoiler)]"}, {"userName": "Arlene", "userReviewDate": "Aug 12, 2010", "userURL": "http://www.goodreads.com/user/show/1746727-arlene", "userReview": "After ten Morganville installments, I’ve yet to be disappointed with any of these books by Rachel Caine. Quite the opposite actually, I get more and more hooked with every book, and I end up kicking myself for burning through them so quickly because the wait is pretty painful, hence the intense fangurling that precedes each release.There’s so much I adore about these books including the friendship between the Glass House residents Claire, Shane, Eve and Michael; the twists and turns each book takes; and the dialog between the main characters that has me laughing, sighing and gasping EVERY.SINGLE.TIME!In Bite Club, Caine gives us a little bonus in the form of Shane’s POV and even though I was expecting a little different insight into his brain, it was still heartbreaking to witness him fighting the nightmares and his own hatred of Morganville. In this book, the big ole baddie Bishop rears his ugly mug and spear heads Immortal Battles which is an ultimate fighting sport that pits humans against vampires and broadcasts the fights, once again threatening Morganville's secret. Eventually, Shane gets lured into the ring to face off against his best friend Michael and the Glass House comes together to help Shane from self destruction and the town from exposure. This book was intense, action packed and full of those moments that remind me how much I adore these characters. Overall, it was worth the wait and I want more NOW! Loved it!Song Choice – Shane: Three Days Grace-Animal I Have Become"}, {"userName": "Amber", "userReviewDate": "May 02, 2011", "userURL": "http://www.goodreads.com/user/show/3603005-amber", "userReview": "Another fantastic addition to The Morganville Vampire series. I say that over and over as I have gotten through each book, but they are so fun to read. They are so different from other \"vampire\" books. They set a new standard in the vampire book world and I can't tell you enough how AWESOME they are.Once again Caine has made this story come alive with new developing drama, a few new characters and unexpected turns that will make you ask yourself how in the world did I not see that coming! It's brilliant!This being the 10th book in the series I have to say that I am even more in love with the \"Glass House Four\" as I call them; Shane, Michael, Eve and of course our awesome protag Claire. I also liked how Caine added Shanes POV. It was somewhat refreshing to be able to read his thoughts and where his actions came from. He was really facing his own personal demons as well as being charmed by an evil vampire who drove him to be a rather aggressive force, but not for the good.I'm not going to go into a long drawn out review about this book as I feel that it's a book you need to discover your own personal thoughts on. Let me just say though, that this series is highly recommended and I can't wait for the next installment!!"}, {"userName": "Kt", "userReviewDate": "May 10, 2011", "userURL": "http://www.goodreads.com/user/show/3681846-kt", "userReview": "Even vampires make mistakes. This is a lesson everyone in Morganville learns hard in this latest installment. Past decisions come back to bite them all in the rear end, as issues that should have been resolved have not been. Someone has started a new extreme fighting ring, pitting humans against vampires in the ultimate bloody showdown. Things hit closer to home than Claire could have ever realized when Shane starts slipping through her fingers and becomes the latest target. She'll have to convince him to get out before it's too late, or not even her status with the founder will be able to save him.I cannot count the number of times I wanted to reach into this book and strangle Shane. I had always thought he and Claire made a really great couple as they seemed to balance each other out. In Ghost Town due to some crazy circumstances, he forgot who she was, and while that almost broke my heart, it didn't make me want to lose my faith in them. However, In Bite Club, while not all of Shane's actions are under his control, he still makes some really horrible choices that could ruin things permanently. I would find it a whole lot easier to forgive and forget if we weren't shown the scenes from his perspective at times. These sections showed him being aware of his actions and yet continuing to make those horrible choices. It really is going to take a whole lot for me to have faith in him again, yet I still hope he can somehow redeem himself in future books.I was more than a little annoyed at how slow on the uptake everyone was in this book. I do realize the reader was given more information than the characters were, but it still took much too long for everyone to realize something was seriously wrong with Shane. Then, it took even longer to put everything together and realize that it was so much bigger than just the problems with him. A lot of the events in this book could have been easily prevented if the vampires were even just slightly less arrogant. At this point the only one other than Michael that is worth even remotely trusting at all is Myrnin, and that is saying a whole lot, as you are putting your life in his hands anytime you get near him. You really have to be careful around that fun, but seriously crazy vampire.I couldn't help but to be a little disappointed with this latest installment in the Morganvile Vampires series. Don't get me wrong, the writing was still superb, and the pacing was great. However I was so frustrated at all of the characters that I just couldn't get into it as much as I have in the previous books. With the mess that Shane is in, and the rest of the gang's cluelessness, as well as the vampire's general arrogance and I found myself more frustrated then the enthralled I normally am while reading books in this series. That being said, the book is still pretty good, and fans won't want to miss it as some pretty big revelations and decisions are made that have me very much looking forward to the next installment."}, {"userName": "Lucy", "userReviewDate": "Aug 14, 2010", "userURL": "http://www.goodreads.com/user/show/2644305-lucy", "userReview": "In this tenth installment of the Morganville Vampire series, Shane gets himself into a heap of trouble. He joins the new gym in town and gets involved in a human/vampire fight club. Shane is glamored into joining the fight club, but his vampire killing impulses make him an easy recruit. He alienates himself from his friends as he gets sucked into fighting these high stakes matches. The baddies behind these Immortal Battles need to be taken down in order to save the town and Shane’s life.The Morganville vampire series always delivers a new fun adventure in a town where humans and vampires coexist. There is always a new villain to kill or problem to solve for Claire Danvers and her friends. We are near the end of the series, with only two more books planned. While I enjoyed the perfectly titled Bite Club, it was not my favorite of the series, and I did not like it as well as the last book, Ghost Town. The tone is a bit darker this time around and did not have the familiar blend of humor, fun and action as in previous books.Shane’s journey to the dark side and separation from the group dragged down the first half of the book for me. Shane does get a chance to share his POV in this book, and it is obvious he is suffering a lot as he battles his internal demons. It’s interesting to get Shane’s POV, but in a way I think the book would have worked just as well without it.On the bright side, Myrnin, the eccentric vampire, really shines in this book. He plays a bigger role and is protective of Claire as she tries to solve the latest crisis in Morganville. The characters really make this series, and I’m still enjoying following Claire and her friends Michael, Eve and Shane on their crazy adventures. Along with Myrnin, Amelie, Oliver, the dreaded Monica Morrell, and other familiar characters make an appearance in the book.Bite Club delivers a different side of Shane along with some insight into other favorite characters. Fans of the series will want to read Bite Club to get the latest Morganville fix and dose of Myrnin. Even though this wasn’t my favorite of the series, there are still many hints and questions in this book that gave me pause to consider where the series may be headed. I’m in it until the end and anxious to read the next book, Last Breath, due out November 1 2011.I listened to this book in audio format, and the narrator Cynthia Holloway does a great job as always nailing the voice of the characters. If you haven’t listened to this series in audio format, give it a try sometime."}, {"userName": "Alaina Meserole", "userReviewDate": "Nov 05, 2017", "userURL": "http://www.goodreads.com/user/show/50620706-alaina-meserole", "userReview": "[So Shane is even more of an asshole. Claire, who I started to like a little bit from the past book has now become an annoyance and I just don't care for her. Eve will be forever awesome in my eyes. Then there's Michael who was just meh. (hide spoiler)]"}, {"userName": "Andrea", "userReviewDate": "Oct 26, 2017", "userURL": "http://www.goodreads.com/user/show/5841469-andrea", "userReview": "All I have to say is Shane is an asshole and he doesn't deserve Claire. Honestly he never will."}, {"userName": "Skye", "userReviewDate": "May 07, 2011", "userURL": "http://www.goodreads.com/user/show/4054250-skye", "userReview": "I’ve always been a big fan of the Morganville Vampire series because I happen to live in a middle-of-nowhere Texas town. I can relate, I practically live in Morganville, my town even has the “-ville” ending in it.Basically the scenario in this book is pretty fierce, a fight club between vampires and humans–friends are put against friends. And who do you think gets recruited into this club?After reading the tenth installment in this series, I feel this book is my least favorite. Not, just because Shane goes psycho and starts abusing everyone he cares for. It just doesn’t have that pizzazz the prior books have.Before we would see glimpses of kick-ass Claire making her way in this weird town, but in this book she was strangely lack luster and a bit short-sighted in regards to her future. I mean what happened to the wicked awesome Claire from Kiss of Death? I felt like Caine tried to showcase more of Eve in this book with her sudden fencing skills, but I’m so used to people always rushing to her aid, that her sudden ability to protect herself seemed odd. I mean she has a mouth on her, but she really couldn’t do anything beside bedazzle her weapons. Now she’s fighting against the founders of Morganville. Yeah, okay…Bite Club was definitely about Shane though, and we even get to see some chapters in his point-of-view. I guess this is so we can see how his thoughts and temper quickly transform into something that is not usually himself— so we don’t hate him as much and see he is under the influence of someone else. It worked, I mean I don’t hate him, but I don’t love him either.Don’t get me wrong I still love this series, but this book was just blah. It just felt like a filler book. I assume if you’ve read this far into the series, you’re in it for the long haul. I am. I’m still going to read the next book, and apparently the one after that. It’s just that this one didn’t shine, but at least this one didn’t end on a cliff hanger either.I’m really just in it for Myrnin."}, {"userName": "Hannah-Linn", "userReviewDate": "Sep 22, 2010", "userURL": "http://www.goodreads.com/user/show/4102915-hannah-linn", "userReview": "urg! I love these books so much!! They're just so short. At least they come out every six months.I want more of Shane and Claire! I really actually hate the idea of Myrnin and Claire together and everyone seems to be saying that they're going to end up together. No. Bad.I really love that these books are nothing like the standard young adult vampire book. And they're so...actiony. Love it.I also really love Claire, in all the books. This book seemed to have less Shane and Claire, together, than the other books have. Understandable, however, considering he's like possesed, or whatever.I just don't ever get tired of these books. Whenever I really love a book, i read it as fast as i porribly can. I know crazy. I finished this book in about twelve hours. a lot of times when a book doesnt come out for a few months i dont really like it when it finally comes out, but that doesn't really happen with these books.ah-maz-ing."}, {"userName": "Terri ♥ (aka Mrs. Christian Grey)", "userReviewDate": "Apr 25, 2013", "userURL": "http://www.goodreads.com/user/show/6014919-terri-aka-mrs-christian-grey", "userReview": "Quick review:Cover: Okay Rating:  R Thumbs Up:  4Overall: Man if they keep staying this good I might fall in loveCharacters: Well DonePlot: So much pent up anger why not brawlPage Turner: Yes Series Cont.? Yes Recommend:  YesBook Boyfriend: MichaelSUMMARY (50 words or less)This book takes us back. Shane’s old fears surface in the most unhealthy of way. Unfortunately, Claire is the one to suffer. Now it takes Claire and her band of friends to save Shane from death and himself. This story was another engaging tale I was happy to have read.For a full review and yummy pic, see my blog post at:http://mybookboyfriend.blogspot.com/2...Audio ReviewCynthia Holloway continues to do a good job with this series."}, {"userName": "Sarah", "userReviewDate": "Jun 12, 2011", "userURL": "http://www.goodreads.com/user/show/4865462-sarah", "userReview": "I finished this book last night, whilst I was in bed. Usually if I finish a book in bed, I find it difficult to sleep, because the plot is whizzing through my head! But sadly not so much with this book. Don't get me wrong, I enjoyed it, but I can't help to think that if I'd read all the Morganvilles 1-10 straight I'd be disappointed by this one. About half way through I feared the plot was unusally predictable, and my fears we right. I love this series, but in my opinion, this book fell flat in comparion. Also, I'm not so sure I liked the Shane perspective. It didn't... flow right for me. I realise all this sounds so negative for the book, but I assure you I did enjoy it! I absolutely LOVE Myrnin- and his vampire bunny slippers! I cannot WAIT until Last Breath comes out in Novemeber!"}, {"userName": "Sonja", "userReviewDate": "May 04, 2011", "userURL": "http://www.goodreads.com/user/show/4422772-sonja", "userReview": "RantFrom the beginning of the series I had a love/hate relationship with Shane and was certain that this book would finally push me one way or the other, and I have to say, I hate that guy. Yeah I get it, his life sucks, everyone he loves is dead, his dad was an abusive jerk, etc, etc. This does not excuse him for being an idiot and treating Claire the way he did, or Eve and Michael for that matter! Yes he was glamoured, but he was also self aware, he knew what he was doing the whole time. Claire should have rightfully dumped his ass and I don’t understand why she didn’t! I’m not really sure what to take away from this…If Ms. Caine wanted to take Shane in this direction, that’s great, it was entertaining to read, I thoroughly enjoyed it, but she should have taken Claire in the appropriate direction as well. To make Shane such a jerk throughout the whole book and still have Claire respond with fluffy bunny feelings at the end seems so wrong, and it makes her seem very weak, the complete opposite of what I’ve come to expect from Claire at this point. I don’t buy the glamour thing as a good enough excuse for letting him get off so easily, and he did get off easy. Shane even admitted that he was the way he was because Glory had something to work with.I would probably feel differently about Shane if from here on out he is consistently “douchy” (because characters who are jerks with anger issues actually tend to be my favorite), but if I’m suppose to find his “Hey bro, let’s have some barbeque, nothing bad is going to happen to us today dude” personality endearing, it’s just not possible anymore. While I was never a fan of Shane and Claire’s relationship to begin with, it was tolerable, now it’s just…stupid and irritating. It’s depressing because Claire deserves so much better than him but there’s no question that Shane is Claire’s endgame. Perhaps I’m overreacting, maybe their relationship will be properly rocky for the next few books in or maybe Shane will die or something.Sometimes I think I over analyze this series a little more than I actually should, but I can’t help it.--------------------------------------------------------------------------------------------Okay, now that that rambly thing is out of the way, I can finally move on to what I loved about the book. Where I feel the book failed in the character development of Shane and Claire, it made up for with Eve and Myrnin. When Claire seemed to break down, Eve took charge and that was awesome. Eve is usually the type of girl to act tough, talk tough, and then run to her room crying, and sometimes her personality can be a bit grating as well. In Bite Club I found Eve to be delightful and strong the entire time and it was a nice change. I really want everything to work out between her and Michael. I’m hoping that since their relationship appears to be the most likely to fail, it is actually the one that succeeds. That being said, I hope that their success is not the result of Eve becoming a vampire in the next book, ominously titled, Last Breath. If she does it would feel too convenient and if just one more person was to become a vampire out of the three remaining humans, it would be more interesting if it was Shane or Claire.Myrnin is always fun to read about, even in this book where he was more sane and rational rather than his wonderful wacky self. This book made it very obvious that he does care for Claire, but in what way is still a mystery. I have a very bad feeling that this might lead to his unfortunate death in one of the future books though. Even though I wasn’t happy with Shane’s entire character change, I did like his anger and violence. It brought back a much needed sense of darkness and the fight scenes were fun to read, especially if you tend to enjoy that sort of thing. While the plot seemed a little ridiculous at times, the idea of a vampire/human fight club was done quite well. There were a few things that bugged me, but I quickly became absorbed in the action and found myself liking the book overall. Based on the action alone I give this book a solid four stars and I’ll overlook the character development for sake that it might improve in the latter books."}, {"userName": "Lorna", "userReviewDate": "Sep 07, 2015", "userURL": "http://www.goodreads.com/user/show/10620039-lorna", "userReview": "(RabidReads.com)Another day, another Morganville Vampire book. Or I should say, another day in the life of Morganville and Claire. And the vampires. What a series this has been, and I am not even close to the end yet!Out of the blue, a gym has opened up in Morganville. Not just any gym, but one that is run by vampires. Shane is all about working out and learning new ways to fight the vampires, and if he can learn to fight from an actual vampire, then even better. Since nothing much fun happens in Morganville, the four housemates, Claire, Shane, Eve, and Michael, don’t waste any time checking out the gym. Shane immediately gets sucked into a secret fight club, one that puts him up against vampire fighters. He tells no one, but when he starts acting weird and aggressive, especially to vampire Michael, the rest of the foursome are immediately concerned. I do have to say that fight clubs are not my favorite thing to read about, but since this was Morganville, it was okay. Meanwhile, Claire is up to her eyeballs with the mysterious murder of one of her classmates, one whose body she finds, along with her friends. If any of that sounds like a simple premise, not even close.Claire is eighteen now and a genius. Her dream is to go to MIT, and she only ended up in Morganville to go to college because she was underage at the time and her parents wanted her closer to home. What a horrible decision that ultimately was! Claire has gone through a lifetime and then some, of horrible situations, and near death more times than she can count, and she still bounces back. She’s spunky as they come and totally fearless at times. Or seems that way anyway, as she usually is scared to death, but she hangs in there and perseveres. She is the perfect YA heroine for this excellent urban fantasy. Although now the book is veering a bit into new adult territory because of her relationship with Shane, one of her housemates. There’s sex going on, but not shown. They’ve had a very sweet romance starting from book one. Shane has always had aggression tendencies thanks to the father from hell and a childhood to match. None of this has ever touched Claire directly though. Until now. And of course Michael and Eve are in a loving and sexual relationship as well, and are older than Claire. It’s for this reason I have never understood why these books are suggested for 7th grade and up. Really?As usual with these books, this one was a page turner from almost page one. Nothing is ever simple in a town ran by vampires. Myrnin, the mad scientist vampire and Claire’s boss, is of course involved in everything, as well as Amelie, the founder of Morganville and Claire’s vampire protector. An old enemy is back in town and stirring up even more trouble. And a new enemy with special abilities also comes in, front and center. Is it any wonder that I continue to read these books and enjoy each just as much as the previous one?Feisty main character, swoon worthy boyfriend, great, completely realized secondary characters, a town full of vampires, plenty of action, and a new, intricate, as usual, premise, all make for a fun read by an author that hasn’t failed to entertain me yet. I recommend this whole series to teens 15+ to adult."}, {"userName": "All Things Urban Fantasy", "userReviewDate": "Feb 08, 2011", "userURL": "http://www.goodreads.com/user/show/2732683-all-things-urban-fantasy", "userReview": "Review courtesy of All Things Urban FantasyIt’s always a blast visiting Morganville. After ten books, BITE CLUB is still as fresh and fun as the first, maybe even more so. The potential for new stories in this vampire run college town is apparently limitless. The cast of characters is quite large by now, but the story never feels cluttered. I think that’s largely due to Caine’s deft dialogue which is not only funny, but functionally moves the story along as well. The plot never comes close to dragging, and best of all, I can never predict what’s going to happen from chapter to chapter. The element of surprise is rare in paranormal YA books these days and yet that’s what this series consistently delivers.All the Morganville residents are in fine form in BITE CLUB. Claire is the straight man surrounded by extreme personalities. Eve, once again full of snark, gets all the best lines. Lots of villains from the past reemerge with new sinister ways to torture Claire and Co. And Myrnin, always my personal favorite, is perhaps more sane than we’ve ever seen him—which is still mad as a hatter by anyone’s standards—and there’s a sweetness in him that I’ve never really seen before. Makes me very curious about what Caine has planned for him in the next book. I’m curious about Michael’s future as well since he was much more low key this time, but given what is revealed in this book, he’s going to be a HUGE part of the next one.Which leaves Claire’s boyfriend. I never feel neutral about Shane. I either love him or hate him, and Rachel Caine’s gift is making us feel both emotions in a single book. Although I think I might have hated him a little more than usual in BITE CLUB, despite the fact that there are numerous passages written, for the first time, from his 1st person POV. Given the nature of this story, it was vital to know what was going on in Shane’s head, otherwise I think it was have been easy to hate him completely. Shane still has a lot of growing up to do. For now, Claire seems willing to let him, I just don’t know how many more second chances we can expect her to give him. I’m really hoping the next book keeps him from falling back into his hothead persona.Overall, there is a reason this series has gone on this long: It’s fantastic. The characters, the romance, the world and especially the dialogue. I even love the villains. The next book in the Morganville Vampire series is called LAST BREATH and will be released on November 1, 2011. Rachel Caine has said that the series is currently contracted through book 12 (due April 2012), and hopefully many more after that. The TV show possibilities remain very real. Honestly, I can’t think of a better YA vampire series better suited to the small screen right now.Sexual Content:Kissing. References to sex."}, {"userName": "Jelena Bosh", "userReviewDate": "Feb 12, 2014", "userURL": "http://www.goodreads.com/user/show/5609878-jelena-bosh", "userReview": "Finally, another book in the series DONE! :)I can't say that it didn't take me longer to read it than I would usually read a Morganville vampire book, but there were a few other books I was reading at the same time. Yet I couldn't stop wanting to know what will happen next in this one. Every page and I mean EVERY single page was a question of Why? Who? How?... Even after reading the first 9 books in this series, I'm always surprised by how different but interconnected each books is. Not many can say that the 10th book in a series was unpredictable and this one? In most of the moments, it sure was and I loved it.The characters are even more developed - absolutely love Clare's and Shane's relationship now. She might be younger than him and they might both be teenagers but gosh, do they go through hell and back! I wasn't too fond of Clare in the first few books (even though the books are mainly from her point of view) but ever since she started changing into a tough and unbelievable strong individual, I absolutely couldn't stop reading what happens next in her life. Don't get me wrong, my favourite character would still have to be Shane (yes I did just chose a favourite, but don't judge ok? It was a VERY tough decision...) but I felt like as I kept reading more into this book, I finally started to understand why Shane has been acting the way he has. I mean, he was a total jerk to not only Clare but Michael and Eve too so to see the ending turn out the way that it did? It makes me frustrated that I don't have the next books in my hands...right now....I NEED IT!!!It's kind of hard to review a book in a series especially when its Book number ten, but I hope that this simple review gives you at least some idea that you should READ this series! If you haven't read the first books, what the hell is wrong with you? Hahah It's one of those series that you might think \"Oh it's just another stupid teen vampire book. Like what's that one called? The one that's was turned into a movie?...\" BUT you would be anything but right on that note. It's my all time favourite vampire series for a VERY GOOD REASON - trust me :)Now, time to do some series healing since my mind wont be able to absorb the fact that I can't get book 11 until tomorrow - NOOO!! There are 24-hour book stores right? I mean there has to be...somewhere..no? Ok :(Hope you like this review!"}, {"userName": "Amy Jacobs", "userReviewDate": "Aug 12, 2010", "userURL": "http://www.goodreads.com/user/show/2682353-amy-jacobs", "userReview": "After my excitement of receiving this book in the mail died down from an extreme happy dance, I quickly started devouring the latest installment in the Morganville Vampire series. I wanted -- no needed-- more of the cast of characters and their constant struggle of vampires and humans coexisting together in one town. In Bite Club, we get to see previous characters reappear, a new setting for the characters to immerse themselves in, and more obstacles for them to overcome. What I absolutely loved more than anything in this book is how the author took a chance and changed the POV through out the book. This series has been in Claire's POV the entire ride, and in Bite Club we get to peek into Shane's head as well. Not only is Shane sexy, sweet, funny and charming at times, but now we actually get to read about his feelings and past events that shaped him into the guy he is. When Shane joins a new self defense class taught by a vampire, Claire starts to notice Shane changing. He is angry at everything, starting to pick fights with Michael, and even goes as far as hurting Claire emotionally. What he does to Claire was not only heartbreaking and had me mad, but it was torture now knowing if Claire was going to be able to pull him back from the dark place he was in mentally. Moving on to my next favorite character of the series, we get to see a lot more of Myrnin in this book. I just love this crazy vampire! The scenes where he is driving Claire and Eve around town was one of my favorites parts of the book. Even though Myrnin is in typical better-than-humans form, I felt the author showed more of his compassion and fondness for Claire in this book. Then as the ending approached and previous enemies were dealt with, Shane finds out the secret that Claire has been hiding from him about his Father. His reaction was perfect and fit with what has happened through out the entire book. Plus we even get a few surprises involving Eve and Michael that I have been waiting forever for!Not only do I love this series and adore the wonderful author, but I must say that Bite Club is probably one of my favorites of the whole series! If you are a fan of the Morganville Vampire series, this is going to be one book you are going to want to read!"}, {"userName": "Patti TheLoveJunkee", "userReviewDate": "Oct 26, 2010", "userURL": "http://www.goodreads.com/user/show/3010365-patti-thelovejunkee", "userReview": "When Bite Club opens, the guys are excited about the new gym opening in Morganville, Shane especially, since they’re offering martial arts. It’s vampire owned, with vamp and human members. Shane loves it and starts spending more and more time there. He’s also getting angry – fast and mean. He’s picking fights with Michael, Eve, and even Claire. The angrier he gets, the more time he spends at the gym, where Gloriana’s been hanging out. It doesn’t seem to matter that she’s a vampire, Shane can’t seem to get mad at her.Claire has her own problems – Bishop is back, MIT is calling, and she’s still keeping the secret about Shane’s father from Shane. Then, she gets a phone call from a strange female telling her Shane is hot and out of Claire’s league. She comments she’s “watching it again” and Claire gets suspicious. After a bit of investigating, it turns out the gym is running an online human vs. vamp “fight club” where paying viewers can place bets on the outcome of the fights, and Shane is a participant.My Thoughts:Bite Club is definitely Shane’s book. We get a lot of what’s going on in his head, and it’s angry and confused. We see his deepest hopes and doubts and watch as they morph into something unrecognizable. The vampires in Bite Club are badder than ever, more so because they don’t seem all that bad… until it’s too late. Aside from Shane’s issues, Claire still has a lot going on. Some old “friends” from previous books come back and surprise me, and just when I think it’s all over Ms. Caine throws another twist into the plot. I get enough Myrnin-time to keep me satisfied, and, just to tease us, there is some unfinished business between Eve, Michael, and Amelie. Bite Club is an action-packed, no-punches-pulled installment in the Morganville series!Favorite Quotes:(between Claire and Eve) “I have no idea what that is, but yawn, anyway, just on principle. Eat up. Pancakes is brain food.” “Apparently not grammar food.” “Wow. You college girls are mean.” ~Bite Club, page 116(by Myrnin) “Follow me,” Myrnin said. “And do stay together. And by the way, this is the last time I go anywhere with you people. You are all insane.” ~Bite Club, page 318My rating:4 stars – I really enjoyed Bite Club; Claire is still as smart and loyal as ever and I loved the glimpses into Shane’s head throughout the book."}, {"userName": "Mina Burrows", "userReviewDate": "Mar 13, 2011", "userURL": "http://www.goodreads.com/user/show/3464814-mina-burrows", "userReview": "Some spoilers mentioned...Something is always brewing in Morganville or Nowhere, Texas. In Bite Club, Claire’s having an unusually ordinary day on campus until she witnesses her lab partner steal vials of vampire blood and then later finds him dead. The mystery starts there and then quickly unravels into chaos. Bite Club delves wonderfully into Claire’s Boyfriend, Shane Collins, and all his dark, misunderstood and repressed tendencies. He’s a bit of ticking time bomb and woven brilliantly into the plot, Caine –who normally writes in third person– switched over and wrote first person, from Shanes’s perspective. And it was awesome! I know some people don’t like this. But I did. I loved getting a glimpse inside Shane’s head. On the surface, he comes off as a total slacker, but if you’re a fan, then you know he’s far more complex and smarter than that. And reading his voice, you know he’s all heart. In Bite Club, Shane’s thinks he’s found his calling when he signs up for martial arts classes. While Shane hones his fighting skills, things in Morganville start to change including Shane. Claire does her best to support him plus meet the demands of Amelie and Myrnin. Amelie, whose constantly under the threat of vampires –possibly even humans– revolting against her, remains the ice queen when it comes to ruling Morganville. And Myrnin gets in on the action which I found thoroughly entertaining. There were so many laugh out loud moments in this book with Myrnin, especially since Frank Collins– Shane’s Dad –is now literally hard-wired to Myrnin’s mystical computer. I think Frank and Myrnin are the new dynamic duo, they were so hilarious. Caine’s a genius at creating loveable characters, even when their menacing. A genius! The plot has so many twists that guess what…even ol’ *bleep* is back. I won’t tell you who, but I can tell you I nearly dropped the book. Our young hero, Claire, is forever the driving force behind these perilous plots. And in Bite Club, with all the dead bodies, exploding tempers, brutalizing fights and impending hostile take-overs, Claire’s got her work cut out for her. Again. Bite Club was a 4.5 for me. I loved it and I have no doubt you will too. My blog review: http://bit.ly/g3pc3m"}, {"userName": "Jess - The Tales Compendium", "userReviewDate": "Apr 25, 2011", "userURL": "http://www.goodreads.com/user/show/5314644-jess---the-tales-compendium", "userReview": "In the latest instalment in the Morganville vampires series, trouble is afoot yet again but this time, we experience far more than the normal struggles of Morganville. Unlike all the previous books, the tight-knit Glass house occupants are suffering; the danger is coming from one of their own. Whenever there has been trouble in the past, they have always fought it together, but this time, it's up to the girls to try and save not just Morganville, but Shane and Michael too.Bite Club mostly focuses around Shane. We actually get to see some of the events that unfold through his eyes which is unprecedented throughout the series. It also focuses a lot on his relationship with Claire and his conflicting feelings concerning Michael's vampire-ness. We see what really drives Shane and how his character has been influenced throughout his life by his father, and also the vampires he is forced to live side by side with. We really get to see the effect this has been having on his psyche, especially recently. After a little persuading from a vixen vamp (who could have given Ysandre from the days of Bishop a run for her money), Shane's past and present come crashing together to create a jealous, paranoid and anger-filled Shane. Oh so much anger!Being book ten, we are already strongly connected to many of the characters and it is actually sometimes painful to read about all the things Shane is experiencing, as well as the hurt he inflicts on those around him, especially those he loves the most. Could this be the end of Shane's friendship with Michael? And what about his future with Claire?There is less involvement from Eve, Michael, Oliver, Amelie, Monica, Richard and the local police. Claire, Shane and Myrnin make up most of the story, which is mostly fine with me. Oh how I love Myrnin :DBite Club returns to the darkness and brutality we had in Lord of Misrule. Some unexpected old foes return, Claire receives some surprising news, and there is major doubt as to what the future holds for Claire, Eve, Michael and Shane. Faced paced, surprising and satisfying. And no cliff-hanger!"}, {"userName": " Lissa Smith Reads'~Bookaholics Bookshelf Reviews", "userReviewDate": "Apr 03, 2012", "userURL": "http://www.goodreads.com/user/show/5324453-lissa-smith-reads-bookaholics-bookshelf-reviews", "userReview": "Rachel Caine continues to floor me with this amazing series.”Bite club” is the tenth installment in the Morganville Vampire Series and true to the rest of the series it does not disappoint. The scenarios that Caine creates for this band of friends, well some are not so friendly, keeps me interested and invested to the very last page. Are their grammar issues? Well some would say “yes” but, who am I to judge when I use spell check. Does it create major issues with the storyline? I say “hell no!” but other would beg to differ. I just say, “Let’s all agree to disagree, the series as a whole is fabulous!” Fans of Shane will be on the edge of their chairs throughout the whole book. Right before our very eyes Shane is morphed from the loving, protective boyfriend to an angry and vengeful— almost unrecognizable human vampire killing machine. Fans of Claire will be just a little disappointed in her actions in the beginning. However, mid way through the reader is rewarded with Claire getting her groove back on. Yes, I saved the best for last… there is plenty of Myrnin to go around. I smell spin-off or a trip through Morganville through his eyes. What a fun yet dark read that would be… What that doesn’t make me twisted somehow. You know you were thinking the same thing…. Admit it. Lots of fans were put-off by the switch of POV. However, I enjoyed it. It opens up an avenue for Caine to continue The Morganville Vampire Series as she can dive deeper into other characters. Think about it for a minute!!! You never asked yourself what is running through the minds of all the other major players…. I know I have. It’s brilliant for Caine to open the series so the well doesn’t run dry for the fans. Final thoughts…. A good book added to a great series. A must read to find out what is taking place in the lives of Claire’s circle of friends."}], "description": "New York Times bestselling author Rachel Caine is \"a first-class storyteller\" (#1 New York Times bestselling author Charlaine Harris).   After discovering that vampires populate her town, college student Claire Danvers knows that the undead just want to live their lives. But someone else wants them to get ready to rumble.  There's a new extreme sport getting picked up on the Internet: bare—knuckle fights pitting captured vampires against each other—or humans. Tracking the remote signal leads Claire—accompanied by her friends and frenemies—to discover that what started as an online brawl will soon threaten everyone in Morganville...", "title": "Bite Club\n      \n          (The Morganville Vampires #10)", "url": "https://www.goodreads.com/book/show/9376345-bite-club", "average": 4.23, "cover": "https://images.gr-assets.com/books/1388177342l/9376345.jpg", "reviews": 1170, "authors": [{"url": "https://www.goodreads.com/author/show/15292.Rachel_Caine", "name": "Rachel Caine"}], "type": ["Young Adult", "Paranormal", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/9376345-bite-club", "http://www.goodreads.com/book/show/10806233-bite-club", "http://www.goodreads.com/book/show/9931502-bite-club", "http://www.goodreads.com/book/show/9689150-bite-club", "http://www.goodreads.com/book/show/27266.Glass_Houses", "http://www.goodreads.com/book/show/33128934-stillhouse-lake", "http://www.goodreads.com/book/show/544257.Midnight_Alley", "http://www.goodreads.com/book/show/261122.The_Dead_Girls_Dance", "http://www.goodreads.com/book/show/2295829.Feast_of_Fools", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies"]}