{"ratings": 85687, "userreviews": [{"userName": "M—", "userReviewDate": "Nov 04, 2009", "userURL": "http://www.goodreads.com/user/show/1353617-m", "userReview": "review in progressReview (May 2012)Five stars? Four and half? Quite possibly my favorite of the trilogy.In running for best read of 2012.Original Thoughts (November 2009)I am so surprised by the tremendous backlash against this series' arguably non-traditional romantic direction. And yet the backlash is fascinating. I see Katsa painted by some reviewers as 'man hating' because she doesn't want to get married or to have children, which is an interpretation that never dawned on me when I read the book, and I see backlash very vocally continuing with Fire, and this because while Fire wanted to have children desperately, she decided the lineage of human monsters was too dangerous to continue. There's backlash for this? Really? WTF? Is it so ingrained in our culture that 'happy future' equals 'wedding ring + pregnancy' that a mere story involving a happy future that resulted somewhat differently genuinely makes people angry? Well, that reaction to that presentation makes me genuinely angry. /fix or clarifyI can't believe Katsa's desire not to wed is being interpreted by some as 'man hating'. Katsa comes from a society where woman are the legal possessions (/check on this and confirm; reread Graceling) of their husbands and fathers, and Katsa herself is the legal possession of the king and has been her whole life. Katsa spends a significant part of novel working to gain emancipation and, having gained it, is entirely justified not to wish to put herself back into position of a legal possession under a husband. The end of the novel has Katsa inundated with positive relationship with men ... she actively in love with a man, men are her best and closest friends, and she counts and is counted by men as her strongest allies... and yet, because she doesn't want to be a wife and mother, Katsa is 'man hating'? Ridiculous.Man, I want to reread Tamora Pierce's Alana books now just for the refreshing taste of having multiple lovers before choosing one to settle down with without shame or backlash.(House Like a Lotus, first experience of the concept of premarital sex.)That said, I think that Bitterblue will be obligated to both marry and have children and she does head a kingdom and generally one of the responsibilities of a ruler is to produce an heir."}, {"userName": "Tatiana", "userReviewDate": "Jun 05, 2009", "userURL": "http://www.goodreads.com/user/show/2250020-tatiana", "userReview": "As seen on The ReadventurerIt's with a heavy heart that I'm giving Bitterblue only 2 stars. This book was one of the most anticipated reads of the year for me and will go down my personal history as one of the most massive disappointments. It has to be acknowledged, though, that most of the reviews of Bitterblue so far have been very positive and contained words like \"genius\" and \"masterpiece\" in them. My opinion appears to be out of norm.After recently rereading both Kristin Cashore's earlier books, I feel that with each new one she moves away from the simplicity of her debut Graceling (and what I personally like to read) and in a direction that I can't follow. I enjoyed the action/romance/magic mixture of Graceling and mostly liked Fire, even though some of it was boring and over-complicated (I'm talking about the ball conspiracy scene), but Bitterblue is a completely different beast, a story that is confusing and indulgently long.I've always felt after finishing Graceling that Bitterblue's story had to be told. She carries such a dreadful legacy - a deranged, mind-manipulating father, a country damaged by the 35-year long abuse by Leck's twisted magic, Bitterblue's own childhood traumas. All of this is in the novel.Bitterblue is 18 now, a rightful queen of Monsea, running her kingdom efficiently enough with the help of her advisers who urge her to forget the horrors of the past and look forward. But then she starts noticing that there is something really wrong going on around her. People act irrationally, they lie about the smallest things, they make no sense. She ventures outside the walls of her castle, to meet regular people and to find out the real state of things in her country. Bitterblue comes across even more odd behaviors and crimes. She does her best to untangle the web of lies, puzzles and madness...The truths Bitterblue uncovers are powerful, and they have to be explored. But I feel like Cashore arrives at those truths by a route that is too complicated, convoluted and scattered. Too many side plots, too much talk of ciphers and codes, too many characters coming and going, too many illogical occurrences that instead of making the story more intricate, end up making it too busy and messy.I am definitely a fan of twisty, complicated plots. Bitterblue has that, it strives to be something akin to Megan Whalen Turner's and Melina Marchetta's fantasy novels (these three authors appear to draw inspiration from each other's works). But whereas I was consumed by Turner's and Marchetta's mysteries, trying to spot what was wrong and who was lying and why and guessing the connections among the characters, reading Bitterblue was mostly a confusing and irritating experience. Events and characters in this novel are completely insane. They make no sense, they defy logic, they stand out to any person as odd. Most of the book I spent repeating Bitterblue's own thoughts: What is going on? And why is everyone acting so crazy? As a mystery, Bitterblue did not work for me at all. Untangling a mystery in which no one even makes an effort to pretend to act normally is too much a challenge for me.There are things I did like in Bitterblue. The prologue, containing a scene of Leck mind-raping Bitterblue and her mother is, in my opinion, the best piece of Cashore's writing, horrifying and affecting.We also meet quite a few characters from the author's prior novels. Many I am sure will be happy to see Po and Katsa again (although they seem to be a lot more... animated than they were in Graceling).And the last hundred pages, where some secrets are uncovered and things start coming together, are much more pleasurable to read.But even keeping the positives in mind, I can't say I enjoyed reading Bitterblue. It was a challenge, it was a struggle.I am waiting for more readers to review the novel to see if there are people out there who share my assessment of it or my reaction to Bitterblue is just a result of a severe case of reader/book incompatibility."}, {"userName": "Mitch", "userReviewDate": "Apr 13, 2012", "userURL": "http://www.goodreads.com/user/show/8170554-mitch", "userReview": "[Full disclosure, I'm one of the Fire fans who liked it more than Graceling. (hide spoiler)]"}, {"userName": "Melissa ♥ Dog/Wolf Lover ♥ Martin", "userReviewDate": "Mar 21, 2017", "userURL": "http://www.goodreads.com/user/show/17438949-melissa-dog-wolf-lover-martin", "userReview": "This book! It was so wonderful and so sad at the same time! The feels.....................I love this book so much! Bitterblue got to meet Fire. OMG! ❤This is going to be one of my crazy reviews! I am all over the place with my feels. I love Queen Bitterblue so much! And her father was that horrible man from the second book that I wanted a giant to stomp him into the ground. He tortured animals, people and woman. I can't even people! I. CAN'T. EVEN. And at one point Bitterblue and her crew find some journals they have to decipher from old King Leck and it was not good, not good, not good. Let me list my favorites. 1) Bitterblue2) PO 3) Giddon4) Teddy5) Saf6) Helda7) Teddy8) Katsa9) Deathyou know what? there are too many, just too many. PO is Bitterblue's cousin and he can talk to you in your mind and he can read minds so to speak and he's blind as a bat but no one knows about it. You have to read the book to find out about all of that. There is so much going on in this book I'm not sure I can give it a proper review as I don't write proper reviews in the first place. Bitterblue starts sneaking out at night and going to bars to listen to stories and such. She hates being stuck in the castle all of the time. Well, she runs into Saf and Teddy. They are thieves and Teddy is a sweetheart, he gets hurt in the book and all of this stuff. And Bitterblue falls in love with Saf and there are all kinds of problems when he finds out she's the Queen. I mean you can't keep something like that from a handsome thief right? Wait, that ending, I just realized. No, I need another book to find out. Is there a novella. Oh Lord! Anyway, there are all kinds of conspiracies going on in the kingdom and people trying to kill Bitterblue and people killing other people and going crazy and committing suicide and it's just cray. There are some really messed up and sad reasons for all of that though. I mean this book =( Katsa and PO are together and they both love Bitterblue so much and she them. They protect her and Katsa has taught her to fight and that helped since she had to kill a man trying to kidnap her. Then they have this council that is going to go around and take out some miserable kings. I told you there is soooooo much going on. It's not confusing, just to someone like me trying to write a review!There is a man named Death that is Bitterblue's librarian. He's actually been around for many years and he was there when Leck was King until the King was killed. Heh =) Anyway, I love ole Death, he's funny without meaning to be and I had the perfect picture of what I thought of as him but can't find it. But I digress. Death's grace was that he could remember every book or anything he ever read and he was in the process of restoring books from his mind! HIS MIND PEOPLE! Can you even imagine. I loved his and Bitterblue's talks together though. And then later on they made me cry. Thiel and heck I can't think of all their names are assistants to Bitterblue and they were to Leck too so they are not right in the head. Once again you have to read the book =( I loved Madlen, she's a healer and she has a secret =) There are Hold and Hava, they both have different graces. You know, I'm done trying to tell you all about the people in the book. There are so many and it's just so good and they all play so many parts! Let me throw in a few excerpts just because. \n\"Holt,\" said Bitterblue through gritted teeth. \"I forbid you, absolutely forbid you, to climb into any more window frames and look down, wondering what would happen. Do you understand me?\"\"Honestly,\" said Thiel, going to Holt and grabbing his collar, then pushing Holt to the door in a manner that was almost comical, as Holt was bigger than Thiel, almost twenty years younger, and enormously stronger. But Hold just shrugged again, making no protest. \"Pull yourself together, man\" said Thiel. \"Stop giving the queen frights.\" Then he opened the door and shoved Holt through it. \"Are you all right, Lady Queen? said Thiel slamming the door shut, turning back to her. \"I don't understand anyone,\" Bitterblue said miserably, \"or anything. Thiel, how am I to be queen in a kingdom of crackpots?\"\n•••••••••••\nBitterblue slapped him, as hard as she could. When he grabbed her wrists, she kicked him in the shin, then kicked him again, until finally, swearing, he let her go. \"You're a bully,\" he spat out. \"You're a brat,\" she said\nI can't find the stuff I wanted to write about Death. <--- not real Death, Death the librarian. I didn't write down the page numbers. There are more things I want to add to the review anyway later on. It's storming here so I'm just doing a quick crazy review in case I lose power again! To be continued.......PS ~ I love this book ♥MY BLOG: Melissa Martin's Reading List"}, {"userName": "Erica (daydreamer)", "userReviewDate": "Dec 31, 2009", "userURL": "http://www.goodreads.com/user/show/2835464-erica-daydreamer", "userReview": "If you know me at all, then you know I have been DYING to read Bitterblue when I first heard about it. I honestly couldn’t bear the wait. This book was first slated to come out one year ago, in April, 2011. Then it got pushed to September. Then! The publishers pushed it even farther to 2012! I was seriously this close to exploding\nBut it was okay. I’m a patient person. No really, I am! I’m no stranger to the agony a reader goes through when they’re literally shaking with excitement and anxiousness for a book that isn’t out yet, and every day just feels like an eternity. The only books that have trumped my feelings of agony for needing Bitterblue were the Harry Potter books. But the Harry Potter books, and Graceling and Fire, don’t even have cliffhangers. Each book wraps up rather nicely, with just the promise of a new, fantastic adventure in the future. I’ve read books that have unbearable cliffhangers and I have to wait a year or more to read the next book. And that is pure torture. You’ve all felt that. But there are some books that I read, like Graceling and Fire, that have no cliffhangers, but are just so dang good that my thirst for more is fueled, and every passing day feeds more and more fire to it until I’m nearly busting with it all! So, imagine my pure excitement when May 1 FINALLY was upon me, and I was FINALLY holding my most highly anticipated novel since Harry Potter in my hands. I’m sure I did a happy dance. Accompanied with squealing (mind, once I was out of earshot of the bookstore). \nIt was a glorious feeling. A feeling of pure joy. I’m sure you’ve all felt that with a certain book, and so you know what I was feeling. Right then, my world was perfect. If I could just read the book, I could die happy. Then, I started reading the book. And, as happened with Graceling and Fire, Cashore and her witchery ways cast a spell over me, and I became absolutely riveted, my eyes gazing into the book, the words wrapping around me with their magic, and taking me captive. \nNow onto my review, which, as always with books I love so incredibly much, is overlong, because I just can’t reign in my love!Bitterblue spoke of so many promises to me, whispering to me, beckoning me into Bitterblue’s strange world full of secrets and lies and hidden truths. This book was one big puzzle, with each chapter or scene giving me a piece to the puzzle. I love puzzles, and so when I find a book that has mystery, and lots of questions, and gives me little by little, bits of information, and I wonder what it could mean, and my brain is trying to figure it out, I become excited at the prospect of putting together a puzzle that the author has pieced together, then broken apart, and spread the puzzle pieces sporadically, (or strategically) throughout the book, so that I can put the puzzle together for myself. Cashore doesn’t give you all the pieces at once and then puts them together for you. She spreads them out to the very end, and leaves it up to the reader to piece together the puzzle in your own time, to find the connections if you’re looking closely enough. The continual wondering, and questioning, kept me interested and on my toes. CharactersBitterblue was a wonderful, incredible heroine. She’s not a fighter like Katsa and Fire. She’s quieter, and does more thinking before she acts. She can certainly hold her own. She was trained by Katsa, of course she can. But fighting isn’t how she takes care of her problems. She’s a truthseeker. She fights her demons by seeking the truth through reading, and remembering, and putting together her own scattered puzzle. I loved the strength she had when remembering her father, and discovering the things he did which threatened to tear her down. She didn’t let that happen though, and neither did her friends. That’s one thing I loved. Bitterblue’s friends who stood by her, and lifted her up. I loved her determination to save her kingdom from Leck’s influence. Even eight years after his death, his presence still lingers in the people’s minds and hearts. He rooted himself so deeply that for some people, it is impossible to root him out and be free from their inner torment. Bitterblue believes that everyone in her kingdom is going mad, or spreading lies, keeping secrets. She begins to feel that she can trust no one. When bad things start to happen to truthseekers- people who are searching for the truth about what happened during Leck’s reign, and trying to right the wrongs he committed, including the wrong’s done by people under Leck’s mind control- Bitterblue puts all her effort into finding the answers, finding the perpetrators and understand why they are trying to stop the truthseekers from doing their work.Cashore created the perfect bad guy. I really, really detest Leck. But that is the point. We’re supposed to hate Leck. And we’re supposed to want to know what he did, but at the same time, shudder at and fear the truth. That one part, when Bitterblue finally realizes what her father did to gracelings and young girls, I was shocked. Disgusted. Furious at this terrible man and his maniacal, horrendous mind. WorldbuildingCashore built a beautiful, incredible world. And though it all takes place in Bitterblue City, the reader see’s the city through Bitterblue’s eager eyes. We see the castle and the city come to life as Bitterblue discovers new things each day, things she was too busy to notice. We’re shown a world of magic, and enchantment, and wonder, and stories. A world of intrigue, and deceit, and lies, and locked doors and keys leading into shocking truths, and bright spots of realization. We see how a mentally and physically destroyed city, reigned by a tyrant who could, and did, whatsoever he pleased, is struggling to pull itself out of its stupor, and captivity, trying to bring life and lucidness back into the minds of the people. In the beginning, Bitterblue spends so much time in the castle. But then she starts to venture out into her city. She sneaks out of her castle and starts to roam the streets, and begins to discover secrets about her city that she never would have known about while secluded in her castle. Wandering the streets, she finds storyrooms. Magical rooms hidden in the city where people tell stories and enchant the listeners. Fantastical stories, stories of Leck and Bitterblue and Katsa. Tales of their adventures, tales of Leck’s hideous nature. Love StoryI enjoyed the little romance between Saf and Bitterblue. It was slow growing, and was beautiful, but also burdened with lies and secrets. Their romance takes a backseat to the plot. The focus is not on the romance. I love books that do that. Where authors don’t put so much attention on the love story and then forget the point of the novel, leaving the reader with an angsty romance, and little to no plot. I would much rather read a fantastic fantasy story with a stupendous plot, and a little bit of romance, then a novel that has the romance as the center, and tries (and usually fails) to form a plot around that romance. The romance in Bitterblue was done very well. It added that perfect touch of romance that delights those readers who love romance in the books they read, but Cashore put more emphasis on the actual plot, so those readers who aren’t quite romance fans will still enjoy the book. I do think, though, that a little more romance would have been nice. I would seriously be overjoyed if Cashore wrote another book about Bitterblue and Saf.Cashore did a brilliant job at connecting Graceling and Fire to Bitterblue. As you read this novel, you start to see and understand things you didn’t in the previous novels. You see how Bitterblue has grown since Graceling, and how what has happened in her life helps her as she strives to save her kingdom. And Fire even comes to play a part. Which I thought was fantastic. So, Bitterblue met all of my hopes and expectations (and they were high, let me tell you). And now that I’ve read it, the wait wasn’t that bad. It could have been worse, I suppose. I guess I can forgive Cashore for giving me so much anxiety. She certainly made up for it. I can truthfully say Kristin Cashore is one of my favorite authors ever, and I will wholeheartedly devour anything she writes. (Dare I hope there will be more in the Graceling Realm?)"}, {"userName": "Crowinator", "userReviewDate": "Oct 10, 2009", "userURL": "http://www.goodreads.com/user/show/283407-crowinator", "userReview": "[Po’s brother Skye (hide spoiler)]"}, {"userName": "~♥*Marianna*♥~", "userReviewDate": "Feb 06, 2010", "userURL": "http://www.goodreads.com/user/show/3236234-marianna", "userReview": "Whatever this book is about I want to read it! Kristin Cashore has won my trust."}, {"userName": "Elise (TheBookishActress)", "userReviewDate": "Sep 07, 2016", "userURL": "http://www.goodreads.com/user/show/52545435-elise-thebookishactress", "userReview": "I've been sitting in front of a computer screen for around ten minutes because I truly do not know how to begin this review. This book is incredible, and I want to do it justice– but at the same time, I don't know if I can give it the objectivity it needs. This book is so, so deeply important to me, in so many ways. I've read very few books in my life that made me feel every emotion on the spectrum, and this is perhaps one of the best. This book is many things, but above all, it's a story of hope; a story of joy in the face of so much pain. So, what is Bitterblue about? Because I don't think it can be fully summed up. In one way, it's a mystery. Bitterblue spends this book trying to discover what really happened during her father's reign– to both her people AND herself. In one way, it's the journey of a world. It's a story of an entire country's journey to free itself from a legacy of colonialism and brutality. In one way, it's a character journey– Bitterblue's journey of agency and growing up. I've seen many say they had trouble with this book due to boredom. While I found this story incredibly compelling, it should be said that the first half is somewhat slow. While there are a multitude of sideplots in Bitterblue, here's the thing: I think the book works because of the pace. I'd say Cashore should've cut some plots, but all the sideplots are so well-executed and all add to the general brilliance of the book. The slightly slow beginning of the first half is nicely offset by the dramatic tension and slow-build mystery of the book, and it utterly pays off. Yet with all these different interlocking plots, the book still feels tied together and coherent. Why? Primarily because of Bitterblue's character. Bitterblue is one of the realest characters I've ever come across. She's not the type of fighter we tend to see in \"strong female characters\", but also not the type of sweet and simpering character we tend to see. I especially love how her teenagehood is depicted; she's clever, manipulative, and brave, yet is given moments of being reckless, underconfident, and petty. This isn't a simple plot device; she's sixteen, and the narrative both explores that and lets her be a character beyond it. I also adore how her character connects the narrative; her inner conflict and outer conflict form a gorgeous map.There's so much that's creative and interesting about this book, and I'm not quite sure where to get started. Unless you're truly interested, you can end the review here- just know that this book will always have a special place in my heart, one I don't expect I'll live down. With a cast of well-written, compelling side characters, some of the most clever worldbuilding I've seen, complete with a hilarious appendix written by an actual character, and a 70% queer cast, this book stands out in my mind to this day. Blog | Goodreads | Twitter | Youtube"}, {"userName": "Carys", "userReviewDate": "May 24, 2010", "userURL": "http://www.goodreads.com/user/show/2184813-carys", "userReview": "For those who don't know. This takes place 6 years AFTER Graceling's time. And Bitterblue was 10 or 11 then, so she's date-able age now. I betcha there will be romance. And just to throw this out there, because I JUST finished Graceling and the feeling is still strong. I HATE THIS BOOK!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!Not really, it was fantastically written. I just wish the author would continue on with Katsa and Po, the fact she's leaving us hanging over a freaking cliff pisses me off. I've heard of cliffhangers, but at least the author is KIND enough to finish and relieve us. But Cashore continues with another person's point of view, and we probably will end up hearing bits and pieces about Po and Katsa's relationship....but not enough. I haven't read Fire, and plan on not reading anymore of this author's books. If they are going to leave me this distraught, ready to cry, then I'd rather not. Some may consider it good when a book makes them cry, but I do not. It makes me angry that I could cry over a book, and a tad bit confuzzled.^ Srry 'bout that. Just me raging, please don't take offense or get angry with me if this is your favorite book. I'm just telling my opinion. Thanks ^.^UPDATE June 15, 2012: Oh my, I got sooo mad ^.^ By now I've read a TON of books where they just dedicate one book to one relationship and move on to another just as quickly. So I understand how awesome it is now, because I see some people mentioned in one book and wish the author does a book from their perspective. I'm not going to read any more of this series just because I'm not so much into this author anymore, but I just wanted to point out to those who like romance and will get into those sort of novels, that this happens quite a bit. But, when you see them mentioned from another character's POV, you see a sweet couple and it really does them justice. REMEMBER: this happens quite a bit in romance series. Anyways, thanks for those who supported me, it helped me get over the ending(which I don't really remember, but I do vaguely recall no marriage..pretty sure.)and DO NOT get me started on MOCKINGJAY's ending."}, {"userName": "Amanda", "userReviewDate": "Mar 08, 2010", "userURL": "http://www.goodreads.com/user/show/2696397-amanda", "userReview": "I really wanted to love this book. It started out really good, but half-way through I was ready for this book to start rapping up. When it did finally start rapping up, it just ended with ZERO resolution. There has to be another book coming or this will be a major flop. The only thing I got from it was the extent of Leck's evil doing. We finally see how truly twisted and royally f-ed up he was. And that was pretty much the story. Bitterblue does do a little self-exploration, but we just barely see the beginning of it and the book abruptly ends. I’m sorry to say that I could have totally passed on this book."}, {"userName": "Nasom", "userReviewDate": "Jul 15, 2017", "userURL": "http://www.goodreads.com/user/show/67824881-nasom", "userReview": "Although this is the third book of the Graceling Realm series. This is the sequel to “Graceling” and is set 8 years after events that happened in Graceling.This book is about Bitterblue now 18 and is Queen. She is trying to find a way to help her kingdom move forward after the manipulation it was under during the reign of a mad king for over 30 years. There are people in the kingdom who want to know what really happened in those years and there are some that want to make sure the truth doesn’t come out by killing the truth seekers. Bitterblue is trying to investigate what the truth is and who the people doing the killing are. This book had potentials especially with the mystery but then things got confusing. Two more plots were added and they had nothing to do with the main plot which made the book more complicated. Also, the unsolved mysteries kept growing to a point where it because ridiculous and when the truth came out, it was anti-climatic. I was hoping the romance would at least be good but that was also disappointing. Bitterblue decides to sneak away from her castle at night to see her city and then she meets a handsome intriguing thief ‘Saf’ who don’t know bitterblue is the queen (reminded me of Aladdin). Unfortunately, their “romance” was barely one seeing as he was hardly in the book.I did enjoy seeing the characters from graceling such as po (my fave), Raffin and Katsa but that was about it."}, {"userName": "Isabel", "userReviewDate": "Nov 02, 2010", "userURL": "http://www.goodreads.com/user/show/3959657-isabel", "userReview": "I cannot wait for this book to come out! Contrary to popular feeling, I am happy Fire and Graceling ended the way they did; it leaves readers with the satisfaction that the romance wasn't for nothing and the character's feelings were real, and a sense of reality, of not know how each ended. Most of the reviews I've read that have been against Bitterblue being the main character, I have found that almost all of the readers feel this way because they want to know how Po and Katsa ended. Newsflash:THAT WOULD RUIN THE BOOK'S PURPOSE!Katsa's whole character was against getting married, because in the world Katsa lives in being married gives your husband all the power, which she definitely does not like. It was clearly stated in the book that Katsa knew Po would give her what she wanted and all the freedom she wanted, but she still knew it was given to her, not fully her own. PO ACCEPTED THIS AND SO SHOULD YOU.If Cashore went on to write that Katsa got married and had babies I would be hugely disappointed and aggravated, for, like I said, that is not Katsa's character at all. Cashore did a superb job with developing all her characters, and I am glad that is so, even if the romantic in me would have loved Katsa to be more open and lovable, almost like Fire. Again, I cannot stress enough that I love where the new book is heading. If it has Katsa and Po in it, even better. I trust Cashore to do a wonderful job with this book.EDIT: Now that the cover has come out, I have to say, it is beautiful! I'm looking forward to it even more!"}, {"userName": "Anja", "userReviewDate": "Nov 26, 2016", "userURL": "http://www.goodreads.com/user/show/6054186-anja", "userReview": "*4 MINDBENDING STARS*\n“The more I see and hear, the more I realize how much I don't know.”\nOh my god, I love how this book brings the two previous ones together so perfectly!It's been several years since I read the other books in this trilogy so it took me a while to get back into this whole world. Graceling and Fire were among my favorite books about 5 years ago, but sadly I didn't remember a lot about them when I started this one. Once I did though, I just couldn't stop reading and I HAD to finish it as soon as possible! This whole story was so mindbending and unique! At first I didn't know where this story was going at all, the whole thing was pretty strange and twisted, but I ended up liking it anyway! This also involved some Katsa, Po and even a little Fire from the first two books and I loved it! I didn't know how much I missed these characters until I started reading about them again.Full review coming soon!"}, {"userName": "Meredith Holley", "userReviewDate": "Oct 17, 2012", "userURL": "http://www.goodreads.com/user/show/1302775-meredith-holley", "userReview": "Oh, Kristin Cashore, I would trust you with my life. This series breaks my heart and patches it all back together again. This book was so different from the first two in pace, but somehow, and I say this almost reluctantly, that made the end more meaningful to me. I am all about editing in stories, and for the first half of this book, the redundancies seemed unnecessary and boring. But, I don’t actually think they are now. I think they had some purpose, though I don’t know that I could articulate it for you. I was wrong in what I thought this ending would be, and I’m glad I was wrong. It was so much more brutal than I expected, but more meaningful in that way. Are there more of these? Are you going to write more books for me, Kristin Cashore? I love your people, the evil and the good, the sins of our fathers and frailty of our mothers. I love them.This story picks up with little Bitterblue, now the queen of her empire. If Graceling borrows somewhat in spirit from Aliens, Katsa is our Ripley and Bitterblue is Newt. And now Newt comes into her own with the responsibility for a nation that was totally fucked by her father, by the lies he told and his control and manipulation. She doesn’t even know how fucked her nation is because after you’ve lived in lies for so long, how does anyone know what the truth is? And is the truth more dangerous that willful ignorance if what you’re ignoring is an abomination? Ugh. Beautiful, awful choices. And forgiveness! And stories! Oh man, beautiful. Just the idea of figuring out how to repair a nation from violence and lies is beautiful.But, anyway, and Katsa/Ripley has taught Bitterblue/Newt how to fight and protect herself, and where Graceling pointedly tells the story of a woman fighter, a survivor, Bitterblue makes no point of Bitterblue’s completely human, normal ability to defend herself. She just can kick an ass if she needs to, and other times she can’t. Her strength is not a super power, it’s just human power.This book, in contrast to the first two, felt more high-fantasy to me. It uses the conventions of alternate languages, involved descriptions of coded communication, and a lot of walking (which, to be fair, the walking is in the other two as well. Fantasy, man – bring your Nikes). It is not actually high fantasy, I’m sure, so don’t get all excited if that’s your thing. It is not my thing, but the incorporation of those conventions seemed fun to me, not annoying. It kept enough of a super-hero feel that I tracked.Now I’m going to talk about where this series really resonates with me. I always think, you know, women are raised that a man on a white horse will come, swoop us up, marry us, and that marriage will magically solve all of our problems. When that doesn’t actually happen, we think, Oh, it’s because if we have children, that will actually solve all of our problems. When having children doesn’t solve all of our problems, we think, Oh, if we run off to an exotic island and have a romantic Eat Pray Love affair, that will solve all of our problems. I think men are in basically the same position – if he finds the right girl and marries her, she will decorate his house, and always be there with a smile, a hug, and a plate of cookies, and that will solve the problems. Then, when that doesn’t work, it’s basically the same with the children and the affair. But, in the end, we are always left with ourselves. Marriage and children and lovers don’t take us away from ourselves and fix us the way the stories promised.I love the way the Twilight saga exaggerates those promises to the point of absolute absurdity, but I love even more the way this series exists entirely outside of those promises. This series doesn’t try to deus ex machina our guilts, doubts, and shame away, but it presents characters working through them, living with grief, and learning about their power.I think it is a second-wave feminism phrase to say a woman is empowered or disempowered, and I’ve been thinking about the use of that word lately because someone I’ve been around a lot routinely uses it. I kind of don’t like the word “empowerment,” I think. It seems somewhat inaccurate to me, even along the lines of the promise that our problems can be magically solved by some kind of social convention. “Marriage didn’t magically solve your problems? Well, then, empowerment will magically solve them.” I don’t think everyone means that when they use the word “empowerment,” just like I don’t think everyone who gets married or has kids thinks that will magically solve their problems, but I think both avenues can lead to that expectation. The idea of empowerment or disempowerment just sounds to me like somehow you can subscribe to something outside of yourself that will magically take away your problems. It indicates that the power wasn't there all along, but if you follow the treasure map right, you'll find the magic problem-solving solution.But, along those lines, I love the message in this book, like in The Hunger Games series, that we need to discover our own power - that it was there all along, and that life was never about finding a magic that lets us take the easy way out. In Mockingjay, everyone around Katniss reminds her of her power until she recognizes it. Here, similarly, this story is a journey of Bitterblue realizing her power. It is beautiful. It is the work that we all face that is bigger than marriage or children or politics or career. It’s the self that we are left with when the world is on our shoulders and we have no shoulder to lean on ourselves. This story is full of so much hope and so many dreams. I love it."}, {"userName": "Dannii Elle", "userReviewDate": "Jan 18, 2017", "userURL": "http://www.goodreads.com/user/show/44487975-dannii-elle", "userReview": "Actual rating 3.5 stars.This is the third book in the Graceling trilogy and focuses on Queen Bitterblue, who was just a child when the reader last encountered her, in the first book. Now she is ruling in her father's place and attempting to right the wrongs of her country's past. This proves a more difficult task than previously thought when even her most trusted advisers appear to be keeping secrets from her. Bitterblue realises just how out-of-touch she is with her people and how deeply their mistrust runs and how far the mistreatment has spread.Upon opening this I was pleased at being reunited with the characters of the first book. This soon changed, however, when I realised the discontent now plaguing the once-happy characters. It made for hard reading much of the time knowing their have already faced so much. And the last portion of the book was even more difficult and poignant. It touched on distressing subject matters in harrowing detail but I thought Cashore dealt with them gracefully and appropriately.My main dislike of this book lay with some of the newer characters. I found Bitterblue's possible love interest, Saf, unlikable and petulant and his part in the plot's trajectory irritated me. I found the ending to his portion of the tale not what I had anticipated and I was constantly angered by his attitude and actions. This one character was possible for this becoming my least favourite book in the trilogy.That being said, this was an overall enjoyable an fitting end to the series and I am sad to be saying goodbye to this world."}, {"userName": "Scrill", "userReviewDate": "Jul 14, 2017", "userURL": "http://www.goodreads.com/user/show/418203-scrill", "userReview": "8 years after the story of Graceling, Bitterblue is queen and things are just not adding up in her kingdom and she is determined to understand would make her a better ruler.The Story-What I felt when I finished book was that I spent the entire time under King Leck’s rule and couldn’t really understand what was happening. The resolution of all the problems was really underwhelming and I thought the length of the book was unnecessary for the end result. The book really could have just been a novella. The World Building-This was the hardest part about this book. All the lies and uncovering of the lies really made this book really obscure. As the two worlds of Graceling and Fire were interwoven it made for a really confusing book.The Characters-Bitterblue and Saf and was happy that the book didn’t revolve around the romance aspect of the book.The Soundtrack- Jhene Aiko ft Ab-Soul - WTHBlog |Bookstagram | Instagram | Twitter"}, {"userName": "Katy", "userReviewDate": "May 01, 2012", "userURL": "http://www.goodreads.com/user/show/4572741-katy", "userReview": "[For example, when she reading on Leck's history books, and she realized Thiel betrayed her. I realized later that she had meant that she found out what really happened during Leck's reign, and Thiel had been hiding this from her the whole time she was queen. But I remember reading that part about her reading to her accusing of Thiel betraying her, and I remember thinking, \"What did he do?\" (hide spoiler)]"}, {"userName": "Anniebananie", "userReviewDate": "May 08, 2016", "userURL": "http://www.goodreads.com/user/show/47587994-anniebananie", "userReview": "So eine geniale Trilogie! Lest sie einfach alle wenn ihr das noch nicht getan habt! Ich liebe das historische Setting, die besonderen Charaktere und einfach die geniale Auflösung und auch die Zusammenführung der ersten beiden Bände hier im letzten Teil. In jedem Band kamen bekannte Akteure wieder vor aber es tauchten auch jedes Mal viele neue auf. Außerdem sind die Bücher so liebevoll gestaltet, vor allem dieses hier. Mit Landkarten, Glossar und Zeichnungen. Hach so eine tolle Trilogie einfach! Komplex aber genial! :)"}, {"userName": "Adrienne Young", "userReviewDate": "Apr 26, 2012", "userURL": "http://www.goodreads.com/user/show/9076893-adrienne-young", "userReview": "I was so surprised when I started reading this book. I liked Graceling and liked Fire even more. I expected to like Bitterblue but I couldn't force myself. It seemed like Kristin Cashore took steps backward. It was jumbled, disorganized, and scatterbrained in the plot and I found most of the characters grossly underdeveloped. The romantic relationship should have just been left out because it was paid so little attention and it seemed so insignificant. It was not essential to any character's experience or growth unlike Graceling and Fire. I wanted to love Saf but he was completely obnoxious for the first three quarters of the book. The reason it caught me so off guard from the beginning is that the sarcasm and silliness is completely over the top. The decorum and language that made the culture and setting believable was lost. There was a lot of slang and it didn't match up. The fact that no one had respect for the queen and there was basically no court really bothered me. Honestly the book as a whole felt really immature compared to the first two books. Edit: forgot something important. Note to all authors - you can only use a word like elucidate so many times. Diction, people! Diction!"}, {"userName": "Eric Boot", "userReviewDate": "Nov 07, 2015", "userURL": "http://www.goodreads.com/user/show/33117741-eric-boot", "userReview": "And now it's over :( I think this was my favourite book in this series. I was so intrigued by the plot and this book raised SO MANY QUESTIONS! There were like a million plottwists (: Bitterblue was kicking ass and I just liked it more than the other two (although they were really good too). I think I'm going to miss this world so badly! And OMG THE ENDING! I WANT MORE WHAT THE F HAPPENS?! Only, I felt like it could have been 200 pages shorter (but that's the case with all of Kristin Cashore's books) It was pretty slow :("}, {"userName": "Sara Grochowski", "userReviewDate": "Jul 27, 2009", "userURL": "http://www.goodreads.com/user/show/2530658-sara-grochowski", "userReview": "I'll start by saying I'm a huge fan of Kristin Cashore's novels. I was completely in awe of Graceling and Fire and can honestly say that there isn't anything I'd change about them. I'm sure they have their flaws, but I enjoyed every last bit of each page, line, and paragraph. That said, my expectations for Bitterblue were ridiculously high. Sometimes, I'm worried to read highly anticipated novels: I don't want to be let down after all the buildup. Bitterblue, however, didn't worry me one bit... Cashore took her time with this novel and I had a feeling she wouldn't send anything less than her best out into the hands of her fans.I'm a long time lover of fantasy, but, too often, YA lacks the epic scope that first called me to the fantasy genre. This is definitely not the case with any of Cashore's novels. She's skilled at fitting an epic story line into a relatively small amount of pages (compared to, for example, the many, many volumes Robert Jordan and Terry Brooks employ). Perhaps it's wrong of me to compare these three authors - they are definitely all very different - but the world building and character development of epic fantasy is wonderfully present in each of these authors' novels and it continually surprises me that Cashore is able to do it so succinctly.I adored Cashore's first two heroines, but I think Bitterblue is, ultimately, my favorite. I love her quiet, unexpected strength. I respect Katsa, but she's quite forceful... Bitterblue is exactly what Monsea needed to heal after the tyrannical reign of her father.Like Fire and Graceling, Bitterblue also has a romance element. I'm always head over heels for the men in these novels... but Cashore never makes these love stories easy. And, though I yearn for happily ever after in every love story I read, I respect Cashore for creating and maintaining a necessary obstacles. In this way, despite the fantastical elements of these novels, they still feel real.And it isn't just the romance that lends itself to realism. It's present in the growth and maturation of Bitterblue, the betrayal of those who promised trustworthiness, and the loss and suffering experienced while a country is at war. Cashore manages to offer her readers a place to slip away from everyday life, while still keeping their eyes open. It's escapism with a very real message. It's quite wonderful.I'm forever recommending Cashore's novels and Bitterblue will be no exception. I seriously cannot wait to see what Cashore offers readers next. In the meantime, I'll happily revisit Graceling, Fire, and Bitterblue."}, {"userName": "Keertana", "userReviewDate": "Jan 31, 2012", "userURL": "http://www.goodreads.com/user/show/7584700-keertana", "userReview": "[ Personally, I’m kind of hoping that the friendship between Giddon and Bitterblue evolves into something more. I love their friendship as it is, but I can definitely see potential for more between them, despite the fact that he is nearly a decade older than her.  (hide spoiler)]"}, {"userName": "tonya.", "userReviewDate": "Feb 18, 2012", "userURL": "http://www.goodreads.com/user/show/4358824-tonya", "userReview": "I should have done my reviews for Graceling and Fire right after finishing them, because now all I can think to write about them is I LOVE THEM SO MUCH, and WHAT THE HELL HAPPENED TO BITTERBLUE?Bitterblue picks up (after a very creepy prologue) ten years after Graceling, when Bitterblue is 18 and fully stationed as queen of Monsea, struggling to find her place amid a kingdom just waking up from a 35-year sleep under Leck's rule. She is trapped under mountains of paper and the thumb of her advisors, who preach forward-thinking and the need to forget the atrocities of Leck and move on. Bitterblue wants to be an asset to her Kingdom and help repair the damage her father did, but she is has no understanding of her peoples' lives, wearing castle blinders and never allowed to see her kingdom for herself.One night, Bitterblue sneaks out of the castle and explores the streets of Monsea on her own. She sees the poverty, the disrepair, and the yearning of her people to remember the time they lost under Leck, and rebuild. She realizes all the information she'd been given about her kingdom has been false. But is she being lied to by the ones she trusts most, or is there some other explanation? And if she is being kept purposely in the dark, to what end? You know, after 550 pages, I still can't answer that last question. Bitterblue was as complicated and convoluted as any story I've ever read--unnecessarily, indulgently so. Just when I thought I was getting a handle on ONE of the mysterious elements, another layer was added, complicating it further. It was a neverending maze of mysteries to unravel, when really the story at the core would have been very simple to tell. The simplicity that made Graceling and Fire so lovely, giving the characters freedom to be complex and grow into their full potential, was completely absent in Bitterblue. While I had sympathy for the position she was in and what she was trying to do, mostly I found Bitterblue obtuse and gullible--maybe because I was adrift in a sea of WHAT THE HELL IS EVEN HAPPENING RIGHT NOW?! and was looking to her for insight.I don't claim to be any expert on writing mysteries, but I think there is a fine line between keeping the characters in the dark and keeping the reader in the dark. The most satisfying mysteries I've read have been those where I was given just enough clues to begin to form my own theories, but not necessarily enough that I expect the main character to develop the same. In Bitterblue there was too much happening for either me as the reader or Bitterblue to untangle all the threads and form a coherent theory.I don't know if all questions posed were answered. I can tell you I won't be rereading to find out. Lastly, while I did enjoy seeing more of Po and Katsa, much of it rang false for me. They seemed very different people. And while I understand how Cashore was attempting to tie all three novels together, Fire's introduction felt a little reaching to me. Another layer upon layers and layers of information. Despite all my rants above, I did mostly enjoy reading this. But reading it directly after finishing Graceling and Fire set expectations that were not met. Perhaps readers who have a greater length of time between reading will enjoy this more."}, {"userName": "Cinda", "userReviewDate": "Mar 06, 2011", "userURL": "http://www.goodreads.com/user/show/1258344-cinda", "userReview": "I read for an hour each morning while I work out. This was one of those books that made me forget I was exercising--and that's high praise. The author, Kristin Cashore, said she had trouble letting go of Bitterblue. I did, too."}, {"userName": "Reading Teen", "userReviewDate": "Mar 31, 2011", "userURL": "http://www.goodreads.com/user/show/3329955-reading-teen", "userReview": "I've been waiting forever! I read Graceling and Fire before I ever started blogging. I fell in love with the world that Kristin Cashore created. Graceling and Fire are two of the very few books that I've ever read more than once. That list consists of Harry Potter, Twilight, Wicked Lovely, Graceling and Fire. That's how much I loved them. So, as you can imagine, I had high expectations for Bitterblue.Bitterblue was a much different book than the other two. While Graceling and Fire are full of action and adventure, and focus on two women with extraordinary abilities, Bitterblue is much more reflective and mysterical (yeah...I just made that word up), and focuses on an ordinary girl thrust into an extraordinary situation.Often in this book, and especially in the beginning, I felt that things were progressing very slowly. I think that this is probably going to be an issue for some, who like books that have a different pace to them. For me, I just enjoyed being back in this world. I actually took over a week to read it because I just wanted to soak it all in. But even though the beginning was slower, when it gets into the meat of things, this book is intense. Bitterblue is faced with the aftermath of the havoc that Leck wreaked on her country. She is left with a country waking up from a fog, and stumbling every step of the way.I really like Bitterblue a lot. I love her strength and determination. I love how she grows in this book, and takes ownership of her people and her role as queen. I love the supporting characters. There are so many different characters who each have such distinctive personalities. One of the things I was most happy with was how much Po was a part of the story. I didn't realize he'd have such a huge role. It made me fall in love with him even more. I also fell in love with Giddon, Saf, Teddy and even Death.The romance in the book is slow moving and full of tension. And there is so much mystery, betrayal, and heartbreak. Kristin Cashore pulled out some seriously genius material, with cyphers and codes and mazes and plot twists. There were so many times when my mouth literally dropped open and I was floored. Especially when it came to learning about Leck.Diving into the mind of Leck was seriously intense. At points it was emotionally draining. I think there will be people who have a really hard time reading parts of this book. While reading it, I wanted to resurrect Leck just so I could kill him again. He might possibly be the most evil, sadistic, narcissistic character I've ever read about. I could seriously go on and on and on about all the amazingness that is this book. If you are a fan of her other books, and enjoy a more in-depth high fantasy, you will not be disappointed in this book. It isn't as action packed as the other two, but it is much more though-provoking. Honestly, I thought it was brilliant!Book Doppelgangers:The Seven Realms Series by Cinda Williams-ChimaWill I buy it?YES! Already pre-ordered!-AndyeReading TeenContent: Profanity: Mild Sexual Content: Heavy Violence: Heavy Other Nothables: Difficult issues including harm to children and rape."}, {"userName": "Arielle Walker", "userReviewDate": "Feb 07, 2016", "userURL": "http://www.goodreads.com/user/show/6762949-arielle-walker", "userReview": "[When she does find her strength and power in the book it comes from her and it isn't magic, its simply strength of mind and will and all that is possible to find in any world. (hide spoiler)]"}, {"userName": "Kellyflower", "userReviewDate": "Dec 07, 2009", "userURL": "http://www.goodreads.com/user/show/2484776-kellyflower", "userReview": "Well I've finished it up and yes I'm disappointed. I think the readers that gave it the low ratings are right.This was her weakest book.Let me start off with things I liked:- The drawings before each section & at the end of the book.- The A Who's Who of the World As We Know It\" section.- Giddon- PoHere's what I had trouble with: **Spoilers**- Bitterblue. In the first half of the book her actions and personality seemed very young. By the second half of the book she seemed bossy and I really wanted to slap her.I mean how many things could she possible make Po do. SHe began acting like a spoiled Queen. I know characters will grow, but it didn't seem like a character growing. It felt like I had put the book down and started reading someone elses. - The whole mystery about what Leck did. Why was it so damn important? Why not just deal with what you have? What did knowing accomplish? Nothing for me the reader. I was bored and wished something would happen. Anything!- Po & Katsa acting like a bunch of teenagers. I can't imagine how they would be rolling around and fighting like they're ten years old. I mean it is 9 YEARS later. Kat is what 26?- the purpose of Bann & Raffin in the story?- the purpose of now having a lesbian couple in the story (that was just thrown in there with no purpose)- Saf. So what about him? How is he attractive? He's rude and has no appeal for me, but I did feel some chemistry between Bitter and Giddon.Was it necessary for Bitter to sleep with Saf? No. It didn't move the story forward.- Saf's grace. Giving dreams? That seemed thrown in there. This book just doesn't compare to her other two books. Weak."}, {"userName": "Victoria", "userReviewDate": "Feb 19, 2011", "userURL": "http://www.goodreads.com/user/show/2808594-victoria", "userReview": "I am lucky to have a good friend who is a bookseller who received an advance reader's copy of Bitterblue and gave it to me. Graceling was really good. Fire was magical and still my favorite. But Bitterblue...Bitterblue is practically transcendant. I wish I could find the words to describe how it really made me feel. Cashore has developed into an author who is able to imbue so much character, feeling, and personality into her characters that I felt I was experiencing what Bitterblue was experiencing; it was that mesmerizing. It's just an unbelievably written book to the point where I found myself re-reading parts over and over.If I had one word for Bitterblue, it would be powerful. Bitterblue begins eight years after Graceling ended when she was 10 and suddenly queen. Now Bitterblue is 18 and starting to struggle with the idea that she needs to be a good queen but has no idea how. She is also starting to feel like her advisors are hiding something, and they are indeed. The legacy of Leck's mind-altering rule isn't over and the reality of what happened during his reign is more horrific than anyone can imagine. The ensuing struggle to find the truth, the newness of falling in love, and ultimately enduring a painful betrayal make for an incomparably compelling read. Bitterblue transforms from a girl to a young woman as she begins to find her way. I've heard this book described as a love story. It really isn't. Yes, Bitterblue falls in love, but it is not by any means the main factor of the story. I can't say enough about how much I loved this book. I literally carried it around with me just so I had it close by. I wanted to immerse myself in it. I wanted to read it so slowly that I practically drowned in it. I wanted to immediately read it again when I finished. If it takes Cashore years again to write her next book, I will happily wait if it's anywhere near as good as Bitterblue is.It was also beyond wonderful to see Fire again."}, {"userName": "Kyla Harris", "userReviewDate": "Dec 14, 2016", "userURL": "http://www.goodreads.com/user/show/27881731-kyla-harris", "userReview": "Plot - 16/20 Characters - 15/20 Creativity - 15/20Writing - 18/20 Pace - 7/10Ending - 7/103.5/5 stars78/100 = B-This book had so much potential! I loved the beginning, everything about it was so gripping and interesting but then it didn't go anywhere. I felt like there was no REAL plot. I also feel like there didn't have to be a third book in this series. Nothing extra ordinary happened. But if I was rating this series as a whole I'd have to give it 4/5 stars, I loved it:)"}, {"userName": "Christine Riccio", "userReviewDate": "Jan 06, 2013", "userURL": "http://www.goodreads.com/user/show/10093827-christine-riccio", "userReview": "Moved pretty slow, but I enjoyed seeing how the kingdom/Katsa and Po are doing post Graceling. I think some parts could have been shortened, lengthy sections about decoding and puzzle breaking dragged on. It was at those points that I would put down the book or struggle to keep going. I loved all the new characters though, Saf was great."}], "description": "Eight years have passed since the young Princess Bitterblue, and her country, were saved from the vicious King Leck. Now Bitterblue is the queen of Monsea, and her land is at peace.But the influence of her father, a violent psychopath with mind-altering abilities, lives on. Her advisers, who have run the country on her behalf since Leck's death, believe in a forward-thinking plan: to pardon all of those who committed terrible acts during Leck's reign; and to forget every dark event that ever happened. Monsea's past has become shrouded in mystery, and it's only when Bitterblue begins sneaking out of her castle - curious, disguised and alone - to walk the streets of her own city, that she begins to realise the truth. Her kingdom has been under the thirty-five-year long spell of a madman, and now their only chance to move forward is to revisit the past.Whatever that past holds.Two thieves, who have sworn only to steal what has already been stolen, change her life forever. They hold a key to the truth of Leck's reign. And one of them, who possesses an unidentified Grace, may also hold a key to her heart . . .", "title": "Bitterblue\n      \n          (Graceling Realm #3)", "url": "https://www.goodreads.com/book/show/12680907.Bitterblue__Graceling_Realm___3_", "average": 4.01, "cover": "https://images.gr-assets.com/books/1331532273l/12680907.jpg", "reviews": 7451, "authors": [{"url": "https://www.goodreads.com/author/show/1373880.Kristin_Cashore", "name": "Kristin Cashore"}], "type": ["Fantasy", "Young Adult", "Romance", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/12680907-bitterblue", "http://www.goodreads.com/book/show/17623976-bitterblue", "http://www.goodreads.com/book/show/13188729-bitterblue", "http://www.goodreads.com/book/show/13120551-die-k-nigliche", "http://www.goodreads.com/book/show/7962513-bitterblue", "http://www.goodreads.com/book/show/3236307-graceling", "http://www.goodreads.com/book/show/6137154-fire", "http://www.goodreads.com/book/show/32991569-jane-unlimited", "http://www.goodreads.com/book/show/13608416-kristin-cashore-esampler", "http://www.goodreads.com/book/show/25965415-die-sieben-k-nigreiche", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/25353286-provenance", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}