{"ratings": 22, "userreviews": [{"userName": "Susan Snodgrass", "userReviewDate": "Mar 22, 2017", "userURL": "http://www.goodreads.com/user/show/7103516-susan-snodgrass", "userReview": "When Karin Kaufman was recommended to me by an author fan whose opinion I trusted, I bought her first book. I have not looked back since. Anna Denning is a genealogist who solves crimes, an amateur sleuth, you might say. She lives in the Colorado mountains with her dog Jackson and various other characters, whom have certainly made the books better. Kaufman knows her stuff, people. She certainly knows how to write spooky mysteries that have you scared to look around. Granted, I'm a bit of a wuss regarding scary stories, but hers are awesome!This fifth book in the series finds Anna and her fiancé Gene stranded in a resort hotel with a murderer on the loose. This book brought back memories of Agatha Christie's 'And Then There Were None'. Seriously, it's that good. I never once figured out the culprit till the end, either. I love to read a mystery that keeps me guessing and Kaufman certainly fits the bill on that score. It's such great fun to see the wheels spinning in Anna Denning's head as she sorts out the crimes. And the relationship with her fiancé is so sweet. Gene is such a nice guy and I hope we, the readers, get to see them actually marry. So, there's a hint for another book from Karin Kaufman.Highly recommended. But if you read the Anna Denning mysteries, please start with the very first one. *I was given a preview copy of this book. All opinions are my own."}, {"userName": "Amanda", "userReviewDate": "Jun 14, 2017", "userURL": "http://www.goodreads.com/user/show/1884392-amanda", "userReview": "What happens when close to a dozen people are stranded at a luxury resort during a blizzard? If one of the guests is Anna Denning, you know there’ll be at least one murder and a tangled tale for the genealogist who’s now working with the Elk Park police department to resolve. Karin Kaufman gives the classic closed-room mystery a modern face with her cast of intriguing and suspicious characters. Don’t miss this latest entry in the Anna Denning cozy mystery series."}, {"userName": "Heather Gilbert", "userReviewDate": "Mar 21, 2017", "userURL": "http://www.goodreads.com/user/show/7169046-heather-gilbert", "userReview": "I had the privilege of early-reading and endorsing this one. I have read every Anna Denning mystery and this one might be my fave! This is a mystery that has a similar feel to Agatha Christie's And Then There were None. Captivating from page one, Bitter Roots is one of those mysteries you can't put down, yet hate to see end. Likeable sleuth Anna Denning takes us once again into the snowy Colorado landscape, where she's trapped in a remote lodge with a ruthless killer and an assembly of suspicious guests. Readers will enjoy seeing the healthy, loving relationship between Anna and her fiancé, Gene, as they work together to bring the clever murderer to justice. Mystery-writing at its finest!"}, {"userName": "Lina", "userReviewDate": "Jun 11, 2017", "userURL": "http://www.goodreads.com/user/show/47338623-lina", "userReview": "As usual, a very pleasant book - I enjoy imagining the people and the places. It seems that apart from an interesting story I get to learn something about how people think and live - it's fascinating for me, as I live in a different continent and sometimes it seems a different world... Afer a while I may forget the story, but the atmosphere will brighten my days for much longer."}, {"userName": "Cathy", "userReviewDate": "Sep 27, 2017", "userURL": "http://www.goodreads.com/user/show/9858008-cathy", "userReview": "Love AnnaLove this whole series. I liked the first few a bit better but this one set in a lodge was interesting!"}], "description": "Anna Denning and her fiancé are determined to spend a restful weekend at a mountain hotel. Sleeping late, reading books by a roaring fire. All they have to do is ignore the raging snowstorm outside and the hotel’s strange guests and surly staff inside.But when one of those guests, a newspaper reporter, tells Anna the police are investigating two of the other guests—and that she’s been sent to spy on them—Anna’s hopes for a quiet getaway begin to fade. They’re dashed altogether when she realizes she’s sharing her weekend with a cold-hearted killer.In order to survive, Anna must discover the truth about her fellow guests. Who are these people? And what has brought them together, to an isolated hotel, in the middle of a Colorado snowstorm?", "title": "Bitter Roots\n      \n          (Anna Denning Mystery)", "url": "https://www.goodreads.com/book/show/34532978-bitter-roots", "average": 4.55, "cover": "https://images.gr-assets.com/books/1489256861l/34532978.jpg", "reviews": 5, "authors": [{"url": "https://www.goodreads.com/author/show/5008708.Karin_Kaufman", "name": "Karin Kaufman"}], "type": ["Christian", "Fiction", "Thriller"], "outlinks": ["http://www.goodreads.com/book/show/34532978-bitter-roots", "http://www.goodreads.com/book/show/35478804-death-of-a-dead-man", "http://www.goodreads.com/book/show/16098304-the-witch-tree", "http://www.goodreads.com/book/show/35717614-death-of-a-scavenger", "http://www.goodreads.com/book/show/36069564-at-death-s-door", "http://www.goodreads.com/book/show/39731024-death-trap"]}