{"ratings": 343, "userreviews": [{"userName": "Lark Benobi", "userReviewDate": "Mar 01, 2016", "userURL": "http://www.goodreads.com/user/show/73768036-lark-benobi", "userReview": "Lyrical (gorgeous) and unapologetically intellectual, both at once, in a way that is almost nonexistent in modern american literature. I'm still steeped in the feeling the novel left me on the last pages. I feel as if I have spent a few hours with a person (narrator) (author) who thinks deeply about the world; someone who looks so closely at the human experience, and sees it clearly, and finds it beautiful. The rendering of Berlin in the late eighties is magnificent--the city Pinckney renders is a place where everything is both entirely artificial, and yet fundamentally true. As I read I felt as if Darryl Pinckney went on a journey himself when he wrote his story--that he entered into a conversation with a character, one he didn't know well himself in the beginning. It feels as if Pinckney wrote this novel to learn more about his narrator, a person who is living at a very unique time and place, and who sees things; a person who shares his life with just enough detail, just enough openness, to invite us readers to enter into the conversation, as well.One of the \"Berlins\" that Pinckney writes so well about is the experience of being an intellectually-inclined American expatriate with limited German skills, but with a yearning to express yourself in the native language fluently, and to discuss intellectual things with people you find interesting, or whom you want as friends. You grasp for ways to express deep thoughts, using the words you know, but all the time you're painfully aware that what you're saying is sounding unusual, vague, or at times even deep, in a metaphorical way at least, but also in a way that has nothing to do with what you meant to say. I've never read a book before now that captures this particular isolation so well.Pinckney also nails the expatriate experience in many other ways. He is writing about the specific experience of being a gay black American man in Berlin, but what he writes is representative more generally of what it's like to have the expectations and prejudices peculiar to German culture imposed on you--the way these expectations can limit you, but also, the temptation to exploit these same expectations for your own purposes and desires. The thrill of being different, and the loneliness of being different. A final thing I loved about the novel was the recurring, quiet theme of the narrator's books--a quiet, chance meeting with Susan Sontag who happens to mention her idea of \"home\" being where your books are...and then to notice when books are mentioned in the story. It's a small, lovely, thoughtful grace note throughout the novel to trace the journey of the narrator's books."}, {"userName": "Matt", "userReviewDate": "Mar 04, 2016", "userURL": "http://www.goodreads.com/user/show/1754119-matt", "userReview": "As Rome is the Eternal City, Black Deutschland, an exploration of race, identity and expectations in mid-80’s West Berlin, is the Eternal Novel. Weighing in at fewer than 300 pages, Darryl Pinkney’s story of a gay, African American ex-pat in West Berlin looking to live the “Isherwood promises” of the city, was one of the more laborious and disjointed reads I’ve ever experienced. I’d get lost—not in a good way—in every third sentence. Pronouns were used without antecedents. Sentences were sometimes jammed together in positively Moroccan bazaar fashion: crowded, clamorous, and sequenced in an ancient or alien logic. I did more re-reading—not in a good way—than any book I can recall.And yet…yet. Pinkney chocks Black Deutschland with so many hilarious, heartbreaking, trenchant and sharp-eyed observations about race in America and abroad, that it’s impossible to not admire and enjoy aspects of the novel. The scenes of Jed, Deutschland’s protagonist, with his upper middle class family in Chicago flow far more coherently than the portions abroad and better hit (what I believe to be) the mark for his wryly-observed, searching, self-critical and somewhat bitchy voice. I get what Pinkney is going for (it seems) with the more disjointed, illogical and distanced narrative in the West Berlin scenes (where Jed is uncomfortable and somewhat at sea). This understanding of the device doesn’t make the reading experience any less exhausting. I wouldn’t not recommend Black Deutschland; there’s so much here that’s well done. There’s also so much that’s, to me, overdone. In this case, I’ll cop to the possibility of user error without reservation.For me, I’ll most fondly look back on the ending of Black Deutschland for it being the end of my reading Black Deutschland."}, {"userName": "Sofia", "userReviewDate": "Mar 14, 2017", "userURL": "http://www.goodreads.com/user/show/14453898-sofia", "userReview": "DNF at 50%I found the premise of the book and some things Pinckney had to say interesting but my interest got lost among the buildings of Chicago and Berlin and unfortunately Boredom. I think this is because of how this book is written. Everything is reported so I get Jed's view only and it is a rather confused and disjointed one at that.Anyway life is too short - so I'm moving on.29th Annual Lambda Literary Award Finalist"}, {"userName": "Chris", "userReviewDate": "Apr 17, 2016", "userURL": "http://www.goodreads.com/user/show/2268905-chris", "userReview": "It's said that we should be careful what we wish for because we might get it. I've been made sick by gratuitous gore, and overcome by oceanic tears, from recent highly-touted misrepresented novels of gay literary fiction. In Black Deutschland I was hoping for something different.And, yes, thankfully there is no blood, and only a few dry tears! But, absent these plot elements, what does Darryl Pinckney replace them with? Only intellectual pretension and an awkwardly arranged story not matching too well with the publisher's book description. (Like those other recent novels).For readers wondering whether to read this book, I won't compare in detail (like I did with those other novels) the differences between the published descriptions (also the ethereal 5-star reviews) and the actual book content. Instead, this is what it's about. You might find it interesting to compare the list here with the jacket copy:1) Growing up in the city of Chicago, experiencing the terrible racism it afforded.2) Escaping to Berlin for sex, but in reality getting a job, and spending most of your time in your room alone, packing to return to Chicago an uncountable number of times. I lost count.3) An impressive, but confusingly disorganized tour of the author's intellect.4) The major theme of this book is race, not Berlin, not boys.5) What else? Oh yes, the Berlin Wall comes down at the end. That's not a spoiler, we know it happens from our own knowledge of history.That's it. I've omitted many forgettable subtleties, of course. I am weary of this book and this review. Need to get on with it. What about sex? Is there any in a book supposed to be about a young man looking for \"boys\" in Berlin? (This according to the book description and the very first paragraph of the book itself.) Why yes, you will be pleased to read of two kisses. There's also exactly one sex scene, entirely encapsulated, from start to finish, in the following two sentences on page 242, very nearly the end of the book: \"It was never less than wondrous that he consented. I'd just pulled off the condom, making it snap, when they knocked.\" Anyone wanting a literary, or even simply explicit, treatment of the \"boys of Berlin\" must look elsewhere. And…I can't ever remember, uh, \"snapping\" one, can you?Maybe the characters make up for the disappointing story. Here's a list of them, at least those I remember:1) Chicago, mostly (yes, I mean as a character--in default of interesting human characters, the cities fill the gap)2) Berlin, in a credited supporting role3) The Mercedes-Benz star revolving over the Europa center in West Berlin (similar symbolic function as the \"eyes\" in The Great Gatsby but not done as smartly)4) Cello, the narrator Jed's somewhat interesting sister (she played classical piano semi-professionally)Yes, there were more, again forgettable. What about Jed, the Narrator? Hmm…not on the list.Lovers of this book may take exception to this review by suggesting that I was expecting pornography, not the literary fiction Mr. Pinckney surely delivered. Not so. I really wanted a high-toned work examining the fabled Berlin scene of the 1980's. This would be linked with insightful comparisons to Christopher Isherwood's experiences in the 1920s and 1930s which that author has unforgettably recorded in his classic, genre-gender-bending The Berlin Stories: The Last of Mr Norris/Goodbye to Berlin and his later memoir of those times, Christopher and His Kind.Regrettably that's not what we get. Instead, we are served pompousness. That hefty indigestible meal is wrapped in a flailing timeframe which whips the wildly swinging reader to insensibility. The poor soul is beat up trying to follow the narrator's trips back and forth in space (Chicago-Berlin-Chicago) and in time (the narrator's 1960s childhood along with anecdotal African-American history snippets going back to the 1700s). To illustrate the author's eclectic knowledge, here are two quotes:Aunt Jemima was hired to cook pancakes and tell stories at the Chicago Exposition. Her booth was a giant flour barrel. They said she made more than a million instant pancakes at the fair that one summer. Buttons featured her image, the fat, shiny-cheeked, big-eyed black woman in a kerchief: \"I'se in town, honey.\" They called her the most famous colored woman in the world. Aunt Jemima liked to run her mouth, but black people didn't like her, because she told stories about how happy she'd been on the plantation. In one story, she cooked such delicious pancakes she saved her master's life. The Yankees decided to spare her master; or the Yankees were so enjoying their pancakes he had time to sneak away.The following anecdote is nice, linking my favorite type of music to a scientist I greatly admire. Surely you recognize the names and references:[W]hen Peter Serkin's father, Rudolf Serkin, made his debut in 1921, he played the fifth Brandenburg. He then asked Adolf Busch what he should play as an encore. The Goldberg Variations, the violinist who would be his father-in-law said. \"So Serkin did. All thirty. Busch had been joking. When Serkin finished, six people were left in the hall: Adolf and Frieda Busch and Mr. and Mrs. Artur Schnabel and Mr. and Mrs. Albert Einstein. We are now, finally, at the end of the book, and this review. After the Berlin Wall came down in the novel's final pages (not a spoiler, of course) it seemed to be a fitting dramatic close.Nope. He had to go on.I was floored by the self-important pretentiousness of the following passage at the very end. I remember Isherwood's moving scene referenced in the quote below very well. Pinckney now switches to the authorial \"I\". This is not necessarily a surprise: the line between the narrator \"Jed\" and Pinckney himself was always thin. Now it evaporates:I'd read Isherwood's novel so often I had no trouble inserting myself into its scene. I am the negro boxer—small n of the British 1930s—whom Isherwood sees at the far end of Potsdamerstrasse, working at a fairground, in an attraction of fixed boxing and wrestling matches. I take my turn knocking guys out and getting knocked out. And I, the black boxer in his stance, am going to meet Otto's brother, Lothar, a smoldering Nazi whose bed Isherwood was given when he moved in with the working-class Nowaks. I am going to guide him to the light and we will never age. [Italics mine.]No, you're not. It will take a far better writer to do that. Greatness cannot be assumed simply by association."}, {"userName": "Paul", "userReviewDate": "May 11, 2016", "userURL": "http://www.goodreads.com/user/show/9141677-paul", "userReview": "I can understand why this book has its champions. It's so defiantly dull that it might fool you into thinking it's a classic. Not only does Mr. Pickney manage to do everything wrong, like substituting caricatures for character, artiness for art, rehash for narration and believe me I could go on, but he gives the impression of having worked hard to be so incompetent. There is the occasional lyric passage in \"Black Deutschland\" but it's about as incongruous as finding a nightingale nesting in a junkyard. It's a waste of beauty. If you find novels about American expatriates in Europe to be inherently fascinating, then \"Black Deutschland\" might fit on your bookshelf between \"Tropic of Cancer\" and \"The Autobiography of Alice B. Toklas.\" Pickney lacks Miller's vitality or Stein's playfulness, but he's heir to the former's knack for self-indulgence and the latter's penchant for name-dropping (Susan Sontag makes a brief appearance in one chapter for no discernible purpose other than to be Susan Sontag). Pickney's narrator is a late 20-something gay black man named Jed who is so insecure about his status as an African-American intellectual that he needs to drop a high-culture reference into every other sentence (or maybe that's the author). Jed's experiences in Berlin might be interesting if someone else were having them. However, Pickney refuses to give his characters any dimension, and instead of evoking Berlin, he depends on allusions to other works of art (Isherwood is mentioned on every other page) to give readers a sense of the milieu, which makes \"Black Deutschland\" a 300-page exercise in Bohemian elitism (which is probably an oxymoron). I almost engaged with the book when Jed left Berlin to return to his native South Side of Chicago for a chapter or two and describes the aftermath of Mayor Harold Washington's death in 1987, most likely because I'm from Chicago and was able to bring my own history to the narrative, since Pickney can't or won't convey a sense of time or place. I hated this book. Jesus, did I hate this book."}, {"userName": "Kamil", "userReviewDate": "Apr 09, 2016", "userURL": "http://www.goodreads.com/user/show/23253765-kamil", "userReview": "DNFed, expected it to be a mixture of Baldwin and Isherwood and what I got was very fragmented, muddled and very uneven story... Some great, witty observation of race mixed with super boring visits to Berlin gay clubs and soul searching meanders. If he only got drunk and had some fuck in those clubs, that would be more interesting, but those were the old days, now he only refers to it being sober... way too long for such a short book."}, {"userName": "Rambling Reader", "userReviewDate": "Feb 02, 2016", "userURL": "http://www.goodreads.com/user/show/33854695-rambling-reader", "userReview": "4.5wow...nearly perfect"}, {"userName": "Aubrey", "userReviewDate": "Nov 26, 2017", "userURL": "http://www.goodreads.com/user/show/4119460-aubrey", "userReview": "2.5/5There's a lot I haven't gotten to yet or haven't done in a while. I still haven't read Isherwood, and the last book translated from German I read was by Zweig, and his was the world of turn of the century Austria, which mocked Weimar rather than finding refuge in it. I can't even remember the last history I read concerned with Germany, and the books I have are more likely than not obsessed with the Nazi issue, as most white non-Germans are. As such, I was woefully underprepared for reading his, leastwise on the national front. On the blackness front, though, I was surprisingly fit, and there was nothing I enjoyed more than the main character's meditations on black history in conjunction with both the US and Europe. Thus the rounding up, but I still wish I had appreciated this more.The last pre-Berlin Wall item I engaged with was 'Atomic Blonde', and I'm sure other readers were expecting something as slap dash sensationalized queering bang as that film was. Couple with gay and black and sober and freelance writing on the border of the more stable capitalistic machinations of small time drug dealing, and you have big heads, soft bodies, domestic drama, and not much resolution. I certainly learned a lot, and I'm sure much could be written about the main character's relationships with his composer-housewife cousin (alter ego? foil? reflections on sex/gender/blackness/talent/cultural contribution?), but it was a very forced engagement. THe work still doesn't deserve the average rating it has, but this is typical of the ivory tower sentiment on one end and the anti-ivory tower sentiment on the other. A cosmopolitan yet nonfetishizing work such as this takes far more effort to write than what's usually lauded, so my lack of interest is rather depressing. I can only hope readers who are more familiar with the cultural cues of Berlin can use them to center themselves in the narrative, rather than be bowled over by them.This year seems to be one of lackluster reads, whether new or revisited. This may pick up after grad school apps are through, but frankly, the discouragement I've had from even the people writing me rec letters is making me sick of it and all of its associated paraphernalia. Money is money, after all, and I need to move on."}, {"userName": "Lottekind", "userReviewDate": "Mar 27, 2017", "userURL": "http://www.goodreads.com/user/show/25096070-lottekind", "userReview": "2,5"}, {"userName": "Mel", "userReviewDate": "Mar 28, 2017", "userURL": "http://www.goodreads.com/user/show/16918039-mel", "userReview": "this sounds actually awesome and it's set in Berlin where I live, sothe negative reviews with their criticism of dullness and a protagonist they didn't know enough and care for nearly turned me offanother book where I have to pay more for the eBook than a paperback/hardcover? now that breaks the deal. call me petty..."}, {"userName": "Jason Pettus", "userReviewDate": "Jun 27, 2016", "userURL": "http://www.goodreads.com/user/show/147289-jason-pettus", "userReview": "(Reprinted from the Chicago Center for Literature and Photography [cclapcenter.com]. I am the original author of this essay, as well as the owner of CCLaP; it is not being reprinted illegally.)As regular readers know, I have mixed feelings about slow-moving, heavily character-based stories; but when they're done well, in a way that I can easily engage in, like is the case with Darryl Pinckney's Black Deutschland, such novels tend to be some of my favorite reading experiences of the entire year. A deliberately rambling tale that's presented much like how a person might tell a story over beers at a bar -- that is, in no particular order, with certain mentions triggering digressions from completely different periods of their lives -- this is the story of a young gay black intellectual in the 1980s, raised on Chicago's southside but who has a Romantic-with-a-capital-R fascination with pre-unified Berlin, basically because of falling in love with Christopher Isherwood's old '50s tales about debauchery there and mistakenly thinking that he's going to be able to find the same thing.Although never laid out explicitly, we get the sense over the course of this book that our hero Jed spent a whole series of summers in his youth traveling back and forth between the two cities, first as a genteel alcoholic (his drug of choice is white wine) who engages in a whole series of sloppily homosexual affairs; but then at a certain point he decides to dry up, at which point he accidentally falls in with a controversial architect from IIT who then pays him to travel to Berlin regularly, now sober and with his job being essentially to write articles that rationalize and justify this architect's sometimes hated plan to build a new \"anti-Bauhaus\" housing project in that city, where Jed is now forming a new relationship with a once estranged cousin who is a classical pianist in Germany and has her own complicated history with being a \"black nerd role model.\"The point of this book, though, is not to follow along with this timeline, but rather to sink luxuriously into the complex characterization and inner thoughts of all these people, and to lounge like a fellow intellectual in their high-minded conversations about art, love, post-war Europe and American urban blight. Granted, that's a slow and long process that will drive some people crazy -- for example, I usually burn through two to three books every week as a CCLaP reviewer, yet this 300-page book took me nearly a month of daily reading to get through, just because the story is so dense and rich and needs to be sipped rather than gulped. If you have the patience and inclination, though, you'll find an immensely rewarding tale that utterly transports you to a time and place most of us would never find ourselves in our own lives, giving us a look at brainy people of color as they flit and flirt their way as expats among a world of European artistes who treat them like sexy space aliens. For those like me who think they can get into a story like this, it comes strongly recommended, and will likely be making our best-of-the-year lists at the end of 2016.Out of 10: 9.7"}, {"userName": "Charlie Smith", "userReviewDate": "Mar 05, 2016", "userURL": "http://www.goodreads.com/user/show/2173050-charlie-smith", "userReview": "Complete, original review available here: https://herewearegoing.wordpress.com/...Not going to lie, I had a tough time getting through this. I got it because it was blurbed by Edmund White and compared to Isherwood. No. Aside from troublesome syntax and construction, it really didn’t have anything to say (to me) & far too much meandering detail, seeming — again — as if the narrative was interrupted with pieces from his journals about which Mr. Pinckney said, “Oh, this is lovely” and wanted to use but which added nothing. It needed to be better edited and the time jumping was unclear, a muddle. I kept falling asleep while I read it and wishing I had stopped early on. The last eighty pages were such a slog, but I was determined. Again, sorry to be negative, but Mr. Isherwood’s Berlin Stories is one of my favorite books and to compare this to that, well, no. Borrowed from library."}, {"userName": "Tereneh", "userReviewDate": "Apr 18, 2016", "userURL": "http://www.goodreads.com/user/show/695702-tereneh", "userReview": "I already know I am going to read this again, it is such a masterful work. Pinckney's ability to present so many vast characters with such complexity through the eyes of the main character is simply brilliant. The rhythm of Jed's thoughts changed depending on who he was interacting with or thinking about, his memories, feelings. Though it takes you to another time and place, the issues especially the struggle with human beings - yourself and others is a timeless story. I loved the juxtaposition of Jed's life and relationships in Chicago with those in Berlin. Oh how he struggles as we all do. The seemingly non sequitur were also enlightening, though I would by lying if I said I understood every reference, exploring was one of the most enjoyable part of reading this book. This is a beautiful work."}, {"userName": "Madeline", "userReviewDate": "Apr 12, 2016", "userURL": "http://www.goodreads.com/user/show/617334-madeline", "userReview": "This is a difficult book, and it's difficult on purpose, and it's so worth it.But, I bet that if you just sat down on Saturday morning and didn't have anything else to do that day, you could get through it. And I sort of think that is the way it ought to be read. The style is elliptical and challenging in a way that, I think, encourages moving through the book quickly rather than reading a chapter before bed. What I mean is something like this: there's enough fragmentation here that you don't want to introduce any of your own cracks if you don't have to."}, {"userName": "Andre", "userReviewDate": "Mar 16, 2016", "userURL": "http://www.goodreads.com/user/show/5321728-andre", "userReview": "This is an incoherent read with a muddled cast of characters that are not very interesting. Not sure what Mr. Pinckney was trying to accomplish here, but for this reader it all adds up to an epic fail.The grammatical construction leaves a lot to be desired, but there are moments of greatness, just not nearly enough to make up for the shortcomings. I struggled to get to the finish line, but I made it."}, {"userName": "Gavin Stephenson-Jackman", "userReviewDate": "Dec 07, 2016", "userURL": "http://www.goodreads.com/user/show/6186975-gavin-stephenson-jackman", "userReview": "I found this to be a most frustrating read. I can truthfully say that it never really captured my attention. I could never really follow, or find a story line."}, {"userName": "Andrew Chidzey", "userReviewDate": "May 29, 2018", "userURL": "http://www.goodreads.com/user/show/41412972-andrew-chidzey", "userReview": "I was disappointed by this book. I picked it up in Auckland, New Zealand - excited that it was set in two cities I plan to visit later this year for the first time (Berlin and Chicago). That said - from the moment I commenced this novel it was all down hill. There is no real plot - it rambles a lot and there is no genuine dialogue (rather we are subjected to the central characters internal musings and thoughts which are, at best, disjointed and hard to follow). I really didn't take away much from this experience - a book to shelve and move on."}, {"userName": "Collin Powell", "userReviewDate": "Apr 09, 2017", "userURL": "http://www.goodreads.com/user/show/52763595-collin-powell", "userReview": "Pinckney's \"Black Deutschland\" is an intriguing cross-section of race, place, and space set in West Berlin of the 1980s. It explores themes from architecture, racism, sexuality, and isolation. The book is loosely modeled off of Isherwood's \"The Berlin Stories\". At times, the reader must have background with German History, Black American History, and various other subjects. Although the backtracking and research may dissuade some, I found it almost to function as a \"suggested reading list\". To me, the book captures what it feels like to be caught between spaces, where you've removed yourself from one but aren't fully accepted or integrated into the other."}, {"userName": "Natalie", "userReviewDate": "Mar 09, 2016", "userURL": "http://www.goodreads.com/user/show/32883-natalie", "userReview": "It took me less time to finish  A Little Life which was 720+ pages than it did to get through Black Deutschland which was half that. The complexity in sentence structure and the author's unpacking a fictional life full of cultural and historical references made the wading a little deep but Jed's self-deprecation and charming wit made the slog worth it. Jed wasn't exactly a hot mess, but he was smart and awkward leaving you no choice but to feel for him. I was really rooting for Jed to find love, success, or at least get laid."}, {"userName": "Abby", "userReviewDate": "Mar 30, 2016", "userURL": "http://www.goodreads.com/user/show/638271-abby", "userReview": "I really wanted to like this book. The premise was intriguing -- a young black gay man in recovery who flees Chicago for West Berlin in 1980s. But ultimately I abandoned the book because after 155 pages in I realized I simply did not care at all about this character and couldn't be bothered to finish the book. He is such an opaque and distant narrator that it is hard to relate to him and the people in his life and maintain interest in his story. Such a disappointment."}, {"userName": "yb", "userReviewDate": "Apr 05, 2016", "userURL": "http://www.goodreads.com/user/show/84818-yb", "userReview": "Outstanding. This is disjointed and chaotic and tragic in many respects. I can understand why this novel would be unappealing to some and inaccessible to others, but I found it to be hilarious, insightful, and poignant. It is the universal tale of trying to forge/determine one's identity, set against the backdrop of a very specific time and place. Even if one is not a gay black man in 80s Berlin fleeing family, white wine, and AIDS, though, the tale has much wisdom amongst its asides. Lovely."}, {"userName": "Ed", "userReviewDate": "Jan 11, 2016", "userURL": "http://www.goodreads.com/user/show/630520-ed", "userReview": "A novel that goes back and forth between black Chicago and gay Berlin, Jed struggles with addiction, class, and race. He finds a commune and a community of black expats before he knows where home is. A little bit Christopher Isherwood and a little bit James Baldwin."}, {"userName": "Bob Quinney", "userReviewDate": "Dec 08, 2016", "userURL": "http://www.goodreads.com/user/show/15967427-bob-quinney", "userReview": "Could not get into this book. Too many complicated Berlin references for someone like me, whose historical knowledge of Berlin is lacking. Couldn't really care much about the characters either. Had to abandon it. I much prefer a more straight forward type of story telling."}, {"userName": "Walton", "userReviewDate": "Mar 07, 2016", "userURL": "http://www.goodreads.com/user/show/936824-walton", "userReview": "Read my review here: http://www.theatlantic.com/entertainm..."}, {"userName": "Amy", "userReviewDate": "Mar 18, 2016", "userURL": "http://www.goodreads.com/user/show/11209557-amy", "userReview": "Not very interesting...let's leave it at that."}, {"userName": "Aaron Talbot", "userReviewDate": "Feb 09, 2016", "userURL": "http://www.goodreads.com/user/show/593395-aaron-talbot", "userReview": "I really really wanted to like this book, but I don't, and the only reason I can offer is because I do not find it engaging or interesting...wish I did, but I don't"}, {"userName": "Peter Goers", "userReviewDate": "May 03, 2016", "userURL": "http://www.goodreads.com/user/show/46277442-peter-goers", "userReview": "Despite flashes of wit and observation this novel is boring."}, {"userName": "Ari", "userReviewDate": "Nov 08, 2017", "userURL": "http://www.goodreads.com/user/show/2519179-ari", "userReview": "IQ \"I was impressed with myself. I was not hinting that I was keeping the lid on something big: Cello was an Ibsen play in blackface. To lie and to keep my own secrets had been the chief strategy of my life, but complete discretion for someone else's sake was a new experience of maturity for me.\" (150)Jed's family offers a satisfying look at Black upper-class expectations (Black excellence), they were all raised with high expectations and Jed is suffering from the guilt of not meeting those (aka being the embodiment of a Black male stereotype). The book covers the usual issues with upper middle class Black people; the double standard, the obsession with lightness, the hint (or siren) of respectability politics, what happens when you don't fit a particular image (in Jed's case being gay and a recovering alcoholic/drug user). Although it is worth noting that Jed's mother is a much-derided activist in their community however this does not negate her middle class background, in fact it comes into play in interesting ways through her relationship with Cello and her children. In one particularly telling moment Jed describes his parents, \"they would always look like decent people, the right sort of black people, whereas I had to talk for a few minutes before white people decided not to throw me out of wherever I was\" and he's not talking about how he dresses for those slow on the uptake. But putting these quips and observations aside it's hard to get to know any of the characters. Jed remains out of reach to the reader except for when he's reflecting on his loneliness in West Berlin, it is only then that my heart truly ached for him.Jed may not have clear eyed view of being a Black expatriate, but it quickly becomes apparent that it's not all endless days crafting your art at cafes and living free from American racism for him although he did seemingly go in expecting that. Pinckney's characters also present frank reasons for being in Europe either by being honest themselves or from other characters' wry observations; \"No it was not that that black American poet was a bad man, she said, getting up to take Dram's cigarette from him to smoke herself-he kissed her-it was that he was second-rate, which was worse. Those were precisely the people to avoid in Berlin, Cello said. They were in hip Berlin because in what was actually a village they could have the careers they could not have in New York or Los Angeles or London. She switched to English. They were never-was performance artists, never-to-finish-dissertation affirmative-action parasites\" (223-224). In addition to this brutal commentary, the book acknowledges how difficult it can be to communicate when abroad. I think often in expat novels narrators act like it's so easy to pick up the language but Jed notes his frustration at only being able to speak basic German and not articulate more intellectual ideas and join in deep discussions with friends. I found this very relatable. There is also a good amount of time spent on the complexities of rehab/Alcoholics Anonymous when abroad. The descriptions of Berlin and Chicago are excellent, I've always heard people rave about Berlin and it was interesting to see that that was the case even when the Wall was there (the story takes place in West Berlin). There is a nice amount of German/European history mixed with cultural commentary and swipes at elitism, radicalism and the bohemian lifestyle. I enjoyed the Chicago sections immensely but it does get frustrating (and exhausting) trying to keep up with the constant switch from past to present. I'm still not sure I caught all the times when Jed was reminiscing versus living in the moment back home with his family. I also read most of the co-op descriptions in a daze, there are so many characters being thrown around and none of them turn out to be main ones.BLACK DEUTSCHLAND attempts to be daring and different with its disjointed focus ranging from flashbacks to history lessons (at times it reminded me of WHAT WE LOSE which I'd realized finished) but I'm not well versed enough in literary criticism to say if it worked. For me, it was unappealing although I desperately wanted to like it. There are some quietly poignant moments aspects, such as Jed's despair over ever finding love, and the complications of this universal fear when you're incredibly self-conscious and an addict. Additionally the constant self-doubt and paranoia that comes with being a person of color are accurately reflected here, providing another narrative for this novel to shine. And the descriptions of Berlin and Chicago are vivid, crackling with life. For example, ChiChi brought back fond memories of my own time abroad (Cafe Belga in Brussels), you can easily imagine all the bar's patrons and envision the adventures they up to. And I did learn a lot, such as the reverence Black gay men held for Berlin in the '80s. It has gotten plenty of rave reviews so if the premise sounds intriguing I do recommend picking it up and I still intend on reading Pinckney's first novel, HIGH COTTON."}, {"userName": "LaShawnda Jones", "userReviewDate": "Mar 20, 2017", "userURL": "http://www.goodreads.com/user/show/66094150-lashawnda-jones", "userReview": "I read this last year for my book club. I'm sharing my questions and comments in lieu of formatted review.LaCelia Book ClubJune 6 Discussion (rescheduled from May 2)Black DeutschlandBy Darryl PinckneyDiscussion Questions What did you like about the book?What didn't you like?What is your overall assessment? Takeaway?What was the story? It’s called Black Deutschland but what was Black Deutschland? We saw how Cello integrated into society via a wealthy, connected husband.We saw Jed’s watering hole, where he used to lose himself in alcohol, but returned to to score hash and reminisce about old times.We even heard about his AA group.We saw his co-workers and co-op members.He wrote about many communities, but I didn’t get a sense of a Black Germany – not in the way that we can sense a Chinatown or Little Italy or Harlem.What do you think Pinckney’s Black Deutschland is? Or what he means by the title?LaShawnda’s TakeawaysAdditional reviewsNothing redeeming or inherently loveable or likeable about Jed and his POV\tHe's dismissive\tUnfeeling\tJudgmental/hateful/jealous\tHe openly hates women and disrespects the women closest to him (Mom and cousin Cello) but then fantasizes about raping a crack head he was scoring from and who had robbed his mom after receiving help from her. p 173 most complementary terms toward a female-identifying character, appears to be a cross-dresser known as Lotte von der Pfalz.He resents his mother for helping the less fortunate \the cites this as her not being home for her family even though she was sharing her home with women in need\the's jealous if her attentive guidance of Cello and her musical career and jealous of Cello's ability to parlay her talents into an advantageous marriage with a wealthy German.\tcolor struckHe's pompous and elitist with no grounds (or background to be so)Character defining passages:P7 ...toddler with beautiful long curls in her arms as two other gorgeous honey-colored boys ...- she (Cello) was a throwback to our great-grandmother's locks, got from some slave master.... Otherwise Cello was the color of a Snickers bar and had a large nose and lips copied from Man Ray.... Men noticed her breasts..... But her eyes were two small for her face.P80 As a child, I knew my parents were laughed at... Mom was built like a fire hydrant and though Dad was tall, his caboose was enormous.... They walked like two bears in love. They couldn't dance. Neither wore clothes well.His transitions are jarring. Sometimes incoherently so.\tHe name drops, mostly using one name and does this even with his fictional characters. \tMakes for a confusing read because he writes as if the reader is aware of who and what he is talking about, even without any prior set-up (Rosen-Montag, intro neighborhood)Characters are one dimensional\tbarely there, not fully formed \toutlined as if from partial memories of interactions\tperhaps a product of Jed's (or the author's) inability/lack of interest in connecting with ppl intimately. I.e. he only reports the surface character because that's all he knows.\tp 63 [Manfred] loved her, but she was bulimic, and he could not get along with her mother.\tHis most crass lines do not add to the story or to Jed's appeal/edginess.Summary of his self-image (p 96): the low point of my drug life was… knowing what Dad and Mom thought of guys like me in our neighborhood. I think he projected his self-loathing into imaginary judgment from his parents… and interacted with the world with that bias and angst.Additional reviewsDarryl Pinckney’s ‘Black Deutschland’ by Adam Haslett : http://www.nytimes.com/2016/02/07/boo...Black Deutschland: A Melocomic Novel of Experience by Walton Muyumba: http://www.theatlantic.com/entertainm...Unsuitable Boys: Novels about Americans looking for love in Europe. By James Wood : http://www.newyorker.com/magazine/201..."}, {"userName": "Blue", "userReviewDate": "Sep 24, 2017", "userURL": "http://www.goodreads.com/user/show/3431713-blue", "userReview": "Some books, you flip through the pages to see if you will like it, read a paragraph or two and find yourself extremely confused, because you did not understand anything; no, the words themselves are known, but put together they make up a foreign language, like some un-heard-of world-building that you have to start reading from the very beginning to be able to even begin to understand. Black Deutschland is one of those books. Someone said, in their review of the book, that it is unapologetically intellectual, and that it wholly is, and that is part of what makes Black Deutschland difficult to grasp at times. But there is much more to it than that, in making one grasp it and in making one get completely lost, only to climb back of the murky waters with some profound, back-of-the-mind understanding that is surreal and clear at the same time.Spending the entire novel in Jed's mind, the world-building is complex, deep, confused, and total. Without getting to know Jed, the words that make up the novel are incomprehensible when strung together into sentences, though each one might be looked up in a dictionary to yield some undeterred meaning of its own. The amalgam that is the novel not only accomplishes to deliver the (sur)realities of the bohemian life in a divided country for expats, queers, Africans, African-Americans and artists, but also manages to tell the bleary post-rehab reality of Jed, the African-American gay man who uses the city to search for life without ever being with others, to learn to love alone, to grow up to find himself standing after everything that ever was is gone to dust and the world has moved on.Darryl Pinckney brings the race politics of America to the very nooks and crannies of Berlin shadowed by the tall wall. He digs in with intellectual relish the straddling of many marginalized identities, from the \"Negro Achiever\" to the black gay G.I., from black power to the drug-addicted failures of everyday life. Often, there is discourse that I would define as \"UN talk,\" meaning a bunch of serious sounding words that say nothing, especially when Jed is trying to justify his existence in the employ of the famous architect in Berlin, that is hilarious in its meandering lack of meaning for anyone, so much so that, at some point the said-architect has to throw up his hands and declare that he does not understand any of the words himself. Often, too, there are sentences that slap you in the face in their incisive brilliance, that crystallization of something so simple and true and usually very sad. Black Deutschland is not for everyone and is not an easy read. But it is well worth the time and effort for the astute reader. Recommended for those who like televisions, Susan Sontag, haircuts, shawls, ambitious architectural projects, Schwinn bicycles, Mercedes Benz, communes, and soccer."}], "description": "Jed--young, gay, black, out of rehab and out of prospects in his hometown of Chicago--flees to the city of his fantasies, a museum of modernism and decadence: Berlin. The paradise that tyranny created, the subsidized city isolated behind the Berlin Wall, is where he's chosen to become the figure that he so admires, the black American expatriate. Newly sober and nostalgic for the Weimar days of Isherwood and Auden, Jed arrives to chase boys and to escape from what it means to be a black male in America.But history, both personal and political, can't be avoided with time or distance. Whether it's the judgment of the cousin he grew up with and her husband's bourgeois German family, the lure of white wine in a down-and-out bar, a gang of racists looking for a brawl, or the ravaged visage of Rock Hudson flashing behind the face of every white boy he desperately longs for, the past never stays past even in faraway Berlin. In the age of Reagan and AIDS in a city on the verge of tearing down its walls, he clambers toward some semblance of adulthood amid the outcasts and expats, intellectuals and artists, queers and misfits. And, on occasion, the city keeps its Isherwood promises and the boy he kisses, incredibly, kisses him back.An intoxicating, provocative novel of appetite, identity, and self-construction, Darryl Pinckney's Black Deutschland tells the story of an outsider, trapped between a painful past and a tenebrous future, in Europe's brightest and darkest city.", "title": "Black Deutschland", "url": "https://www.goodreads.com/book/show/25664520-black-deutschland", "average": 2.9, "cover": "https://images.gr-assets.com/books/1452098769l/25664520.jpg", "reviews": 90, "authors": [{"url": "https://www.goodreads.com/author/show/173013.Darryl_Pinckney", "name": "Darryl Pinckney"}], "type": ["Fiction", "Glbt", "Lgbt", "Glbt", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/25664520-black-deutschland", "http://www.goodreads.com/book/show/29566059-black-deutschland", "http://www.goodreads.com/book/show/346965.High_Cotton", "http://www.goodreads.com/book/show/20447760-blackballed", "http://www.goodreads.com/book/show/961656.Out_There", "http://www.goodreads.com/book/show/6024498-time-rocker---od-on-th-tre-de-l-europe-7-19-janvier-1997", "http://www.goodreads.com/book/show/7943671-noir-marron-beige"]}