{"ratings": 7249, "userreviews": [{"userName": "karen", "userReviewDate": "May 11, 2011", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "this was recommended to me in the RA group when i was whining about wanting more books like winter's bone and dogs of god and gritty appalachia stuff like that. this is not as dark as either of those books, the stakes of survival are lower, but it is still a book i would recommend. as a readalike, it seems closer to Garden Spells, which i have not read, but have been assured is a contemporary magical realism masterpiece. there are definitely things that happen to characters in this novel that i do not wish to happen to me, but this is more like dark women's fiction than the soul-crushing despair of the stuff i have been craving.but again - i liked it - this will not be a negative review!! i particularly liked the structure of it; each section is narrated by one or two different characters whose stories, when pieced together, reveal all the secrets of several inhabitants of the lonely mountains of tennessee, most of which revolve around one girl, myra lamb. the story weaves through four generations of magic and violence and madness, and provides plenty of atmospheric detail of the land and the people's relationship to the land.some of the reviews on here complain that it is confusing. i don't know what to say to that. it's not really confusing at all. i shrug the same way i shrugged when oprah chose one hundred years of solitude for her book club. oprah - you are just gonna frustrate some people with that one. they have the same naaaames but they are different characters! it is not a mass-appeal book. it would be, if more people read more and were comfortable with the nonlinear and the trickery. but you can't go from recommending alice hoffman and bret lot and then go right into the marquez without pause. you are bound to lose a few along the way. there is some great storytelling in this book, some lovely incidents that are all pretty much tinged with sadness. i look forward to whatever her follow-up will be and maybe it will be more desperate and more heartbreaking, the way it needs to be for cold coldhearted me."}, {"userName": "DeB MaRtEnS", "userReviewDate": "Sep 21, 2016", "userURL": "http://www.goodreads.com/user/show/9827967-deb-martens", "userReview": "5 stars. It says something significant about this novel when I simply ignored time and gave myself to the story, reading it from beginning to end in a single mesmerized, urgent stretch. I snuggled into Amy Greene's gloriously descriptive prose, feeling instantly comfortable with the narrator grandmother Byrdie and her rambling family oral history. A healer, a water diviner and a spirit traveller - Granny women with extraordinary gifts- used to help others; the spiteful great-aunt who flung a curse upon them all - the grace and the downfall of family's touch: this was a bedtime story that I knew well...Throughout the saga of Byrdie Lamb's people, from the Bloodroot Mountain cabin she calls home and through to the journeys that her descendants follow, flashes of recognition and familiarity pushed me closer to them all. Innately, I knew the trajectory; the reality comforted me. This was family and this was life. Ah, the magic, the gifts... There is such ego to them if the self is involved. I read of Ford's visions with curiosity. The edges of future were there, the possibilities- the gift. The potential. The envy- his downfall. The sins of the father, John Ormand. Byrdie's daughter Clio, a tortured \"haint blue-eyed\" soul. Myra, Clio's daughter, constrained by the mountain... The saga. At its end, Bloodroot arrives at a resolution of sorts - not unlike life itself. This Appalachian tale leaves us with a wisp of peace, arms full of forgiveness and the knowledge that another generation is about to tangle, hopefully, with the future."}, {"userName": "Jeanette  \"Astute Crabbist\"", "userReviewDate": "Jan 03, 2010", "userURL": "http://www.goodreads.com/user/show/796425-jeanette-astute-crabbist", "userReview": "Very nearly five stars. This is a slightly less gritty variation on the traditional Southern novel. It follows four generations of women in a Tennessee family. They are supposedly cursed because one of them was born with \"haint blue\" eyes, but the real curse is poverty and ignorance. Limited opportunities for girls in the rural South made them throw away their lives on the first boy who paid them any attention. There are Southern traditions and superstitions aplenty here, mostly of dubious origin, but strongly adhered to nonetheless. If you swallow the heart of a freshly killed chicken, the man you desire will be yours. This is not necessarily a good thing, as some of the women in the story discover the hard way. The book has the authenticity of the snuff-dipping grandmas and hard-drinking violent rednecks, but it's tempered with beauty. Greene gives gorgeous descriptions of her native rural Tennessee in the various seasons. The small details about the natural surroundings really bring the reader into that place and time. There were a couple of things that prevented this from being a five-star book for me: 1)The character of Laura never really pops out. For most of the book, her \"voice\" is almost indistinguishable from Johnny's, except that he has better grammar. 2)There was one thing left murky at the end that really niggled at me. It was an important detail and should have been dealt with, at least cursorily. I got to the very end and gave a couple of big eye blinks and said, \"Wait! How did that happen?\" I try to avoid spoilers, so I won't say what it was, but don't let it deter you from reading the book. I'm eager to see another book from Amy Greene."}, {"userName": "Sarah", "userReviewDate": "May 09, 2011", "userURL": "http://www.goodreads.com/user/show/3223980-sarah", "userReview": "Wow. After the slightly mixed reviews from Goodreads and the kind of cheesy, vague (and somewhat misleading, I think) description on the front flap, I was expecting this to be a decent, folksy read. But I just finished it and I can't stop thinking about it.There's something haunting about the book. My heart just broke for all the characters. The writing was breathtakingly beautiful and the author even managed to weave in the accents and local ways of speaking without sounding contrived or making her characters sound like dimwitted hicks. The book dealt with horrifically sad stories about abuse and loss without seeming melodramatic or heavy-handed. The descriptions of the mountains made me want to go romp around in the woods on a sunny day. I guess the story and writing style reminded me a little bit of Alice Hoffman, but really this book had a style all its own.Fascinating story, hard to put down, wonderfully-written. If this author writes any more books, I will surely read them."}, {"userName": "Janelle", "userReviewDate": "Jun 01, 2010", "userURL": "http://www.goodreads.com/user/show/2409240-janelle", "userReview": "I can only think to classify this as a story-tellin' fictional read. There isn't a whole lot of dialogue but there is a whole lot of storytelling from six different perspectives. You can't call it a novel, you can't call it fantasy, certainly not chick-lit or magical. It's downright good story tellin'!It's a telling of people involved in the life of Myra Mayes-Odum. A wild and spirited mountain girl of the Appalachia region. We read about Myra from the perspective of a child hood friend who loves her with all his heart but the feelings are not mutual. We hear from Myra's granny who raises Myra and knows her wild spirit cannot be tamed much like Myra's mama who met her maker very early on in Myra's life. We skip around in time and hear the story from Myra's twin's and the hardship they endure when they are taken from their mama. We hear from Myra herself and what she went through and perhaps some closure on why she ended up where she did. And finally we hear from John Odum, Myra's husband who paid his dues with a violent incident that set a path for change in all their lives.I didn't really think the publishers book description was all that fitting to what the story actually was about. My own perception though. The jacket claims this book is about the magic \"touch\" that is in Myra's family. There really isn't much \"magic\" in this book. This book at times is depressing, moody and haunting. With that said, I couldn't put it down. Some things that bugged me were that the paragraphs were insanely long, often one or two paragraphs per page. There aren't chapters, there are books with all the different first person stories. It was hard to find a place to take a break for the night. Also, the \"Appalachia\" language was strange at first. I sure felt dumb-downed a bit! With the negatives I pointed out, I have to say the author is a fantastic teller of stories. I will be anxious to see what she may write for her next book. She certainly is unique."}, {"userName": "Djrmel", "userReviewDate": "Feb 18, 2010", "userURL": "http://www.goodreads.com/user/show/2076721-djrmel", "userReview": "This book brought an interesting question to my mind: Do you blame bland story telling on the writer or the character when the book is told in first person? Okay, so I only entertained the question as a way of explaining how the first part of this three sectioned book could be so engaging, so vivid, and the rest of the book almost mind numbing, even with a plot straight out of my favorite genre, Southern Gothic. Yes, it is the author's fault if four of her six characters almost ruin a great tale when they spend too much time retelling without bringing anything new to the story, develop and lose personal insight for no apparent reason other than ease of story telling, and worst of all, don't follow the beautiful rhythm set up by the first section of the book.Greene knows her setting and that is one of the saving graces of this book. The towns and isolated cabins of Bloodroot Mountain enliven the slowest moving parts of this book. The idea of weaving together each of the characters own narratives is intriguing, and the first third of the book shows that Greene knows how to tell a good Southern Gothic story without literally telling the story."}, {"userName": "Greg Zimmerman", "userReviewDate": "Mar 12, 2011", "userURL": "http://www.goodreads.com/user/show/41665-greg-zimmerman", "userReview": "Don't be surprised if you see Amy Greene's Bloodroot make its way onto several of the literary prize short lists later this year. It's that good; a wonderfully engrossing story by a debut novelist who writes with amazing clarity, emotion, authenticity and beauty.Bloodroot is a plant that has the power both to cure or kill; it's the central symbol throughout a novel rich with dichotomy (love and hate, life and death). Bloodroot is also the name of the mountain in dirt-poor East Tennessee where the novel takes place. Much like the Mississippi River in Mark Twain's works, Bloodroot Mountain stands as both the setting for the story and a \"thing\" with which the novel's characters have a real, tangible relationship. The mountain itself is a character.These tragic characters, all with an inseparable connection to Bloodroot, take turns telling this story about the importance of family heritage and the dangers of fate. Blue-eyed, beautiful Myra Lamb is the central character. She is her family's hope for breaking a century-old curse. But Myra herself seems also to be cursed, and marries an abusive jerk who does everything he can to sever her roots and destroy her sense of self. Her only saving grace is her hope of one day returning home to Bloodroot. \"You might leave one day,\" Myra says, \"but your blood will whisper to you.\"Bursting with symbolism and Biblical allusions, but maintaining a wonderful sense of \"country mysticism\" and superstition, this novel is about as literary as literary gets. That's not to say the book is difficult — it's actually one of the most brilliant types of literary novels: Even if you don't get all of it, you're still totally engaged in the story and the writing, because the story stands strongly on its own merit and the writing is so fantastic. Taking time to think through and understand the \"literary adornments\" only adds to the enjoyment of the novel.I'm not in a book club, but if you are, this would be a fantastic novel. It's one that begs to be discussed, and therefore, savored."}, {"userName": "Natalie", "userReviewDate": "May 27, 2010", "userURL": "http://www.goodreads.com/user/show/166632-natalie", "userReview": "There are parts of this book that are amazing. Greene's talent and ability are undeniable. There are some lines that are just stunning. I don't have a problem with the sequence or the multiple voices as other reviews do, and agree that this book is similar in structure (and sometimes voice) to those by Lee Smith. I was particularly reminded of Oral History.My problems are two fold. First, while I like how certain \"minor\" story lines from individual sections came back again in later sections, I'm still not sure how it all works together or what I was supposed to gain from the book. Ending with John Odom in some ways makes me angry (um, he abused his wife and locked her under the house...are we supposed to just forgive him that?). I also never really got why Doug was so important that he deserved a whole section, but then never really came back in any relevant way.Second, why does ever revered Apalachian book necessarily contain a \"wild\" and beautiful mountain girl who hooks her wagon to the star of a handsome yet mean man? There are so, so many books in which this is the main story line. If we were teaching an Ap. lit class, there could be a whole unit on the abused mountain woman. Granted, this is a real story. It happened. It happens. But not to everyone and the focus of this \"story\" in so many volumes makes it feel that way some times. Why must the girl always be broken?Finally, I would have liked for the \"modern\" sections (taking place in 2010 and a few years before) to feel a bit more modern. I'm a woman living in Apalachia. I know what it is to be born here, grow up here, live here still. Those sections felt so much like the Byrdie sections that it was like nothing ever changes.Okay, all that being said, I really did like the book. I'm interested to see what Greene puts out next."}, {"userName": "Cynthia", "userReviewDate": "Jan 27, 2010", "userURL": "http://www.goodreads.com/user/show/1802440-cynthia", "userReview": "In her debut novel set in East Tennessee Greene tells the story of an isolated mountain family who through many generations have gifts of healing, seeing into people’s hearts, soothing animals. At the center of the story is Myra, her grandmother and Myra’s boy and girl twins. After Myra’s grandfather dies she and her grandmother live on their mountain through their own wits and hard work and help from a few neighbors.Then Myra falls almost fatally in love with Johnny and he with her but their love is like something from a Greek tragedy. You just know it’s not going to turn out well though Myra’s survival streak re-emerges when she realizes she’s pregnant. She screws up enough courage to get away from her physically and mentally abusive husband and slink back home to Grandma. Time plays an odd role in this book. It’s hard to keep track of what century you’re in because the events and living conditions don’t jibe with modern existence. There isn’t any central heating, phones and TV’s are rare. Central plot elements are isolation, the dark and light sides of loving, blood ties, and tradition. What happens feels pre-ordained. The beauty and wildness of mountain living are reflected in the engrossing plot, in fact the plot and it’s pace are the best part of ‘Bloodroot’. (I'd actually rate this more like a 4.5 than a 5 because the plot and the unusual characters and setting are so engrossing.)"}, {"userName": "Chrissie", "userReviewDate": "Jan 21, 2010", "userURL": "http://www.goodreads.com/user/show/632247-chrissie", "userReview": "ETA: There is another theme central to this book – love. Love has violence imbedded in it. Love tears us apart. Each chapter is told from one character’s viewpoint. I gave this book three stars, yet it continues to occupy my thoughts.********************** I enjoyed this book for its ability to put me in in a place where I had never been before. It drew a picture of the South (Tennessee) during the 70s in a remote country town and in mountain-side communities. Superstition, belief in spirits and “mystical visions” were common place. I was drawn into the lives of people that are certainly foreign to my way of living and comprehension. I felt I was in another world. This world seemed, although very foreign to me, real. I was there and able to think as these people thought.What themes were focused upon? The first is a belief in magic and visions. I was tantalized. I tend to be very logical, and yet I was drawn to the possibility that sometimes strange things do happen. Is it correct to judge them nonsensical simply because we do not understand them? I am willing to believe that perhaps there is a dimension we today cannot fully comprehend. The book goes one step further. When are those who see visions actually crazy? When should they be put away in asylums? Of course if they hurt others that is a valid point supporting incarceration. When is it better for society to let them remain free and add to general group diversity? Such philosophical thoughts arise when reading this book.Another theme is that of how important it is to each of us to make an imprint after we die? Are their familial characteristics that we want to preserve, to remain after one individual dies? Is it important that these characteristics be carried on to further generations? I must admit, that sometimes when a grandchild does something that is typical of one’s own behavior, you do crack a smile! So if I state that continuation is not important to me, is that true? Am I kidding myself? So, I did enjoy being submerged in the “southern atmosphere”. I enjoyed the philosophical meanderings. BUT beware; the behavior of the characters was certainly extreme. Don’t think you will be served a typical southern family. Reading this book was for me a visit to a place “foreign” to my everyday life. It widened my perspectives on others’ lifestyles. The question is: should it? Are these characters too bizarre to draw any general conclusions? How many people chop off fingers? How many of us would really then save that finger in a box? There is rape and emotional abuse abundant in this book. Was it excessive? I wonder what the author was trying to say by including so much abuse and exaggeration. When you are reading you are drawn along with the events, but later one reflects – hey, aren’t those circumstances rather exaggerated?! Was this just a fun story? Should any real conclusions be drawn at all? But then maybe I have found an answer to my question. Look at the title and see what I have added at the start of this review."}, {"userName": "Carol", "userReviewDate": "Jun 09, 2010", "userURL": "http://www.goodreads.com/user/show/1166663-carol", "userReview": "Bloodroot s is a gut wrenching, raw, tense, exquisite debut. Bloodroot has been compared to The Color Purple or the Glass Castle. For me, it is more like She Walks These Hills by Sharyn McCrumb. It is the kind of book you need to read yourself, not easy to explain. Tense, taut; powerful storytelling. I wanted Bloodroot to end so I could breathe but when it was over I wanted to go back, to savor, to ponder, to enjoy the richness of the whole once again."}, {"userName": "Mauoijenn ~ *Mouthy Jenn* ~", "userReviewDate": "Sep 10, 2015", "userURL": "http://www.goodreads.com/user/show/2569271-mauoijenn-mouthy-jenn", "userReview": "Wow!!!I was really impressed with this one.I grabbed it off the shelf at the library because it looked interesting and right next to the book I was really looking for. I love when I find a great unexpected book. The story line between characters was written beautifully. I really felt the characters. Kudos!!"}, {"userName": "Josh", "userReviewDate": "Sep 03, 2013", "userURL": "http://www.goodreads.com/user/show/10773168-josh", "userReview": "For me to \"enjoy\" a book on CD takes pretty good story telling. This book meets that test. It was a 4.5 that I figure would make full 5 star status had I read it in print. It's a multi-generational story that meanders along the mountain paths and small town lives of a host of narrators who all get engulfed one way or another in the wild and wily life of the lead character. Myra Lamb is a girl with \"haint blue\" eyes that lives vicariously- drawn along her fate line by influence and intuition alike. The tone and dialect is almost perfect (although the in the audio CD version some readers were better than others). Gritty in places, gentle and kind in others. The same characters you are drawn to initially would repulse you later, but just when you decide to be done once and for all, you're fed another piece of their life which allows you to approach them again- albeit with a little more caution than before.The main question asked is whether we can rise above or escape our DNA destiny- which may be a question less of blood than circumstance, but the question for me is only partially answered. Should we run from those potentials or embrace them? My only hesitation in the 5 star status has to do with the final conclusions. I almost always LOVE when a book doesn't wrap it all up for the reader, but for some reason there were a few (one in particular) plot elements that I was left wishing I knew more about.I am hooked for sure, and will be adding Long Man very soon; this author hits my marks. Having heard her read a selection from this more recent novel last October I fully expect this author will soon command a great bit of attention (think the fan base Ron Rash has slowly developed). She's not at all pretentious, and despite liking some of the same authors I admire the most, she isn't a mimicker; finding ways to leverage those influences in ways that develop her writing but don't overpower. From a familiar part of my home state, I look forward to more to come!"}, {"userName": "Sarah Mac", "userReviewDate": "Oct 29, 2014", "userURL": "http://www.goodreads.com/user/show/4490376-sarah-mac", "userReview": "In a nutshell: the lit-fic version of a bizarro V.C. Andrews multi-generational saga. There's a lot of violence (particularly against womenfolk), a lot of backwoods superstition (or is that mysticism?), & a lot of unhappy, cyclical D00M.Stylistically, I can't give this book less than 4 stars. I loved the author's depiction of rural Appalachia, & she can definitely write. I really liked how she managed to give the narrators a regional twang without resorting to phonetic dialect & overpowering apostrophes. She penned some lovely turns of phrase re: objects, scenery, & emotion. As with most lit-fic, the plot is secondary to minutia of personality, & Greene really pushes her characters to the forefront. But I enjoyed hanging around with most of them, warts & all. She's not afraid to have you dislike their quirks, & I respect that. Like \nIn The Midst of Earth\n by Marilyn Harris (another excellently written, if depressing, exploration of sex & inescapable violence from the earlier days of post-modernism), the heart of Bloodroot revolves around a particular person within a particular family, & that person touches everyone else in ways that aren't usually positive. Also like ITMoE, the landscape itself becomes a symbolic character, a sort of three-dimensional Monopoly board on which the cast of family or close-like-family repeatedly blunder around being awful to each other (except the grandmother, Byrdie, who tries her best with what she's given). Sure, they had reasons behind what they did. But that doesn't mean you'll agree with their reasoning, or not want to punch them in the face for being idiots....Which brings me to the downside of such a well-written tome o' soul-searing gloom.It's the same problem I had with ITMoE -- i.e., everything is just too bloody depressing. There's no dark humor to lighten anything that goes on. Nothing. Nada. If you're going to offer verbal fare that's dark & moody & violent, you need to lighten the approach for the reader's sanity, even if it's nothing more than an occasional wry comment by the narrator or one-liner from someone else. Slapstick comedy isn't necessary -- just an occasional nod to that all-American trait of finding humor in life's bleakest splooge. To demand such a constant, unrelenting negativity from your story is just plain irksome. My other peeve is ending the novel with John Odom. Let's not mince words, y'all. John Odom is an irredeemable prick. His 15 pages of explanation don't make him any more tolerable, & the epilogue seemed like a clumsy attempt to manipulate the reader's forgiveness. More importantly, why would you want to end your novel with such an asswipe? The close of Myra's section is beautifully tied up -- yet John Odom becomes the last thing we remember as we close the book. That's an authorial choice I don't like, or even understand....So. There you go.Bloodroot is a heavy, complicated read with a non-linear plot -- but if you're in the mood for soul-crushing literary fiction, this is one of the better ones I've tried."}, {"userName": "Emily", "userReviewDate": "Oct 29, 2009", "userURL": "http://www.goodreads.com/user/show/88025-emily", "userReview": "Amy is an author from my hometown of Morristown, TN. Her book's already getting a lot of good press! I had the pleasure of meeting her at her first reading at Walters State. My friend won an ARC and I borrowed it from her.I grew up in Morristown, TN, which sounds an awful lot like Millertown, one of the settings in this book. So as I was entered this beautifully crafted novel, I felt like I was returning home again myself. The lives of the characters are not easy, and sometimes their story is hard to read. Further, their lives mirror some of the people I knew of in my hometown and still see around town. So this novel really strikes home for me. Greene really captures the intertwined sadness and beauty of East Tennessee. The characters are so vividly drawn, that I could see them plain as day. If they made this book into a movie, I could see a lot of famous actors wanting to portray the characters because they are so strongly written and memorable. I thought the dialect was spot on....for anyone who doubts if it's accurate or not. Trust me--people really do talk like that. My grandfather even used to say \"They laws\" just like Byrdie.I am eager to see the accolades and attention Amy will undoubtedly receive because she definitely deserves them. I am also eager to read whatever she has next."}, {"userName": "Elizabeth", "userReviewDate": "Jan 19, 2010", "userURL": "http://www.goodreads.com/user/show/2069203-elizabeth", "userReview": "I had such a hard time rating this book. If I were to rate it based on writing style alone, I would have given it five stars. I hesitate to give it more stars because of content. Generally, and on principle, I do not like to give five stars to books with an \"Oprah\" feel. And by that, I mean, books that are triumph over circumstance, all the while detailing the nitty, gritty details of abuse and depressing living conditions. That said, \"Bloodroot\" is a hugely atmospheric and intense read. Characters are closely knit together (read enmeshed) in their isolated world. Ms. Greene is able to place the reader in the middle of it all and though there is great beauty and lore, there is also much pain and ugliness. It is to the author's credit that, somehow, these characters emerge with their hearts intact. Unfortunately, this reader is a bit of a wreck having read it."}, {"userName": "Sarah", "userReviewDate": "Aug 30, 2009", "userURL": "http://www.goodreads.com/user/show/2524446-sarah", "userReview": "Wow. Really...wow. A dark and twisted fate of generations entangled together through a mountain that is enticing, yet incredibly haunting. Amy Greene had me so wrapped up in this magical and beautiful world of family legends and folklore that I was brought to tears (on the subway) when I realized it was going to fall to pieces. You weave in and out of past/present, magic/madness, hate/love, safety/danger. Within this back and forth construction, the utterly depressing present day reality for two individuals makes sense (and not in a settling way). When I shut the book, I felt satisfied, which was surprising - I expected to feel depressed. But, somehow Greene is able to put closure to a family's misfortune by revealing the ripples of past generations and manifesting their direct effect on the realities of the present day. Whew, is it good."}, {"userName": "Rabbit {Paint me like one of your 19th century gothic heroines!}", "userReviewDate": "Apr 28, 2013", "userURL": "http://www.goodreads.com/user/show/4709630-rabbit-paint-me-like-one-of-your-19th-century-gothic-heroines", "userReview": "Thank you, Sarah, for this awesome recc. This book was everything I wanted in a book.I have to echo Sarah and mention that this book reads like V.C. Andrews without all the cheese and camp. Also southern gothic needs to be more of a thing. I would eat up more books like this with a spoon. NOM.I'm having a fangirl moment. Perhaps a more in depth review later? I just don't want to give too much away."}, {"userName": "Amy", "userReviewDate": "Feb 08, 2010", "userURL": "http://www.goodreads.com/user/show/3096541-amy", "userReview": "“It doesn’t take as much to poison a horse as people think.”“I might have won her respect. Or maybe she smells my acceptance of the truth that she’s tried to tell me all along. Some creatures are just meant to be left alone. They can’t be held on to, even if we love them more than anything.”It is sentences like these that reach out and grab you , pulling you into this book, a stunning new novel by Amy Greene. The book is an epic story of several generations living near Bloodroot Mountain. It’s not a simple read, as you get acquainted with a large number of characters right away, and each of them has a compelling story. All the characters are complicated and deep, and at several points it’s difficult to know just how you are supposed to feel about them (Is this person a villain? Or just misunderstood?). Greene makes this draw you further into the book, because you never fully know as you read how you feel. One character may repel you and yet you feel drawn to them later. The landscape and the flora and fauna of Bloodroot Mountain, as well as the other locations, is as much a character as the people in the book. Descriptions of damp caves, briar covered paths, and the flowing wild herbs make you shiver with the realism. The isolation of the mountain community is at times comforting, and at other times chilling. The level of detail is intense, and you can tell that the author didn’t simply imagine this place. It has to really exist somewhere.Emotionally it’s a tough read. The characters suffer more pain than most, and at times I had to pause and stop because events unraveled so terribly. There’s also a high level of suspense, and at points I caught myself holding my breath as I turned the page to see what would happen next. Details of the poverty, mental illness and distress are laid out plainly and painfully.“I reckon I am ruint in a way. I can’t think straight no more. I forget the names of the craziest things, like flowers and biscuits and chairs. And you know I’ve buried five children and seen their dead bodies, watched them get sicker and sicker and not been able to help them a’tall, but the picture that vexes my mind the most is Myra when she opened the door of that house by the tracks. That’s the thing that’s done broke my heart in two, because she’s the one that saved me after all them others was gone. Myra’s the one I love the best of all, it doesn’t matter that I never bore her. She was mine anyhow.”This novel has several remarkable qualities that make it unique. One is that when describing successive generations of women, Greene manages to make them have similar traits and speech and they all flow together as truly related. It’s as if she somehow created their DNA and sprinkled familiar bits about, so that each woman is different but undeniably made of the same stock. Another feature is the use of foreshadowing. Some authors lay the groundwork for an important detail, then come back to it later and make the loop complete. But Greene lays down details that come up again, not once, but several times, making the details interlinked like a delicate chain."}, {"userName": "Sandra ", "userReviewDate": "Jan 18, 2010", "userURL": "http://www.goodreads.com/user/show/3080893-sandra", "userReview": "The audio version of this book is outstanding. The first part is read by Birdie and Doug. It mostly takes place on Bloodroot Mountain, a lovely, wild, Appalachian place. Birdie is a woman who becomes the mother of five children, and all of them die, three from diphtheria when they are small. A son born later dies in a fight. A girl who has a baby girl dies in a car hit by a train, leaving her baby to Birdie's care. In the beginning, we see the world from Birdie's point of view and she weaves a tale of her life leading to Myra, her baby granddaughter. Doug is a boy who loves Myra from the first time he saw her when they were children of 8 or 9. So the book in the beginning weaves back and forth around Birdie's granddaughter, Myra, with Birdie telling the story from the time she's a girl, and Doug telling the story from his point of view when Birdie is already past middle age and he and Myra grow up together on the mountain. The second part of the book is told from the point of view of Myra's twins, a boy John and a girl Laura. The story goes back and forth between the two with their lives beginning on Bloodroot Mountain and living there with their mother, Myra. Their story proceeds to tell of their mother going mad after a trip into town when she sees a man named Odom. After that encounter, she descends into madness and the twins nearly starve until the state sends the social workers and police to take the children and put them into foster care. Myra is hauled off to the state mental hospital in Nashville. The twins grow up in foster care, and John in a detention center after he sets fire to the hardware store that bears his family's name. While there he begins to write poetry. Laura meets a boy and falls in love. Tragedy ensues. Laura's husband drowns and a social worker comes to take her baby. She attacks the social worker and ends up in jail. Finally John comes and this part ends with Laura telling John that they need to get her baby back and go find their momma.The third part of the book is told by Myra. We finally find out what happened between her and John and how Birdie died after Myra returned to the mountain to have her babies where Birdie helps her birth and care for them.The epilogue is told by John Odom, Myra's husband who had abused her so badly that she returned to Bloodroot Mountain.The bloodroot plant is a theme throughout this story that is told with heart breaking beauty. I lived for twenty years on the Carolina side of the Appalachians and my sister lived and died there. She loved the mountain flora and acquainted me with many of the beautiful wild flowers there, including the bloodroot. It blooms in the spring with a beautiful little white flower that peeks up from the frozen earth, its root hidden beneath the ground, fleshy and red, and appearing to bleed if it's cut. For all the sadness in this story, it is also filled with hope and beauty. In the end, the shattered members of this tragic family find their way to each other and to new life. I loved the story deeply and highly recommend it."}, {"userName": "Suzanne Moore", "userReviewDate": "Mar 05, 2010", "userURL": "http://www.goodreads.com/user/show/2127114-suzanne-moore", "userReview": "The setting of the Appalachia Mountains is what drew me to this book. My family is from the Blue Ridge Mountains of North Carolina, and I spent most of my adult years in Tennessee. Amy Greene describes the scenery with flawless detail.From the days of the depression to present time, Greene’s characters endure many hardships. Myra is the central character whose past connects to her children’s future. The family seems to have been cursed, and Bertie, Myra’s grandmother, believes it may be related to the blood red ring she took from her former employer. The stone represents the dark passionate love Bertie had for her husband and she passes the ring on to Myra, her granddaughter when she marries John Odom. John, as Myra’s husband, wears the ring until Myra resorts to chopping off John’s finger while he is passed out drunk, to get the ring back. The book’s title, “Bloodroot” comes from the name of the mountain where Myra’s family traces its roots. The mountain is named for a wild plant … the bloodroot flower that grows there. This flower heals, but can also poison. After reading about the dysfunctional lifestyles of the characters in this book, I began thinking about bloodroot in a more symbolic way. The mountain held their heritage for generations and despite hateful actions, in the end, Myra’s children meet the father they never knew… family, blood, has deep roots.I hated some of the characters for the pain they inflicted, but later as I read about the pain they personally endured, I began to have soft feelings for them. Amy Greene has a way to make you connect with each character at some point in the book. I also thought it was interesting to read about Greene’s literary favorites in her website bio. (Website for Amy Greene) When I read the scene where Laura is cornered by the child protection officer, I almost thought she might take a drastic move like in Toni Morrison’s “Beloved.” Of course … Morrison is one of Greene’s major influences."}, {"userName": "Colleen", "userReviewDate": "May 12, 2010", "userURL": "http://www.goodreads.com/user/show/182405-colleen", "userReview": "I am very surprised that this book has an average rating of 3.89; apparently I am in the minority on my feelings about this book. I thought it was so boring. There was very little that actually happened in this book and other than Byrdie, none of the characters were really that likeable. I also didn’t care for the author’s use of the Appalachian vernacular (it didn’t bother me in The Help when the author wrote “black” but for some reason it bugged me in this book). There were so many questions that were never answered in this book; I felt like I was left hanging at the end of each section and figured that my questions would be answered at some later point but they never really were. The jumping back and forth between voices and time periods was distracting to me and I often had trouble keeping characters straight (especially Clio and Myra). And the worst was probably Myra’s section where there was no chapter or paragraph breaks; everything just flowed into the next thought. I’m sure this must have been a reflection of Myra’s state of mind but I just really disliked it. The description of this book makes it sound wonderful but it was far short of the “spellbinding tour de force” that it claimed to be."}, {"userName": "Lauren", "userReviewDate": "Dec 02, 2009", "userURL": "http://www.goodreads.com/user/show/6078-lauren", "userReview": "What a beautiful, transporting book. I lost track of subway stops today which is always the mark of an excellent book.Whenever a book is set in the South, I get anxious about the depiction of Southerners and I was a bit leery at first. Nevertheless, Greene is a remarkable storyteller and thanks to her terrific narration, her characters come to life in a rich, yet nuanced manner. I felt she had just the right touch, revealing in pieces and always leaving you aching for more. Like another reviewer, I had to remember to breathe as I raced toward the end of the novel. I also had to hold in my tears. I hope many people find this book and enjoy it as much as I did."}, {"userName": "Gina", "userReviewDate": "Jan 11, 2012", "userURL": "http://www.goodreads.com/user/show/5460575-gina", "userReview": "This novel made me feel. I don't know what else to say or how to describe it. I felt the characters' love, fear, desperation, and dirt. This was probably the most moving story I have read in quite awhile. It is the story of a family from Bloodroot Mountain in Tennessee. It begins with Granny's story of where she came from in Chickweed Holler, her marriage, and the birth and death of her daughter Clio. We learn of Clio's daughter, Myra, and her twin's Laura and John and how their lives intertwine right along with Bloodroot Mountain itself. I really can't put into words but this story haunts me. I definitely recommend it to anyone. 5 stars."}, {"userName": "Sara", "userReviewDate": "Sep 08, 2009", "userURL": "http://www.goodreads.com/user/show/2715191-sara", "userReview": "Bloodroot is a striking piece of contrast. Somehow, it manages to be dangerously dark and refreshingly light at the same time. It is a beautiful display of learning to both overcome and embrace your history. There were pages that I couldn't wait to turn...and others that I could barely bring myself to turn. I love this book."}, {"userName": "Pamela", "userReviewDate": "Jul 06, 2009", "userURL": "http://www.goodreads.com/user/show/124136-pamela", "userReview": "I was afraid Bloodroot would sentimentalize Appalachia for the refined reading palate, but Amy Greene does not (often) slip into this false romance. Don't let the jacket fool you—Bloodroot is vicious, and by the second half of the novel, I had to remind myself to breathe while reading. The Dorothy Allison comparisons, by the way, are perfectly apt."}, {"userName": "TheGirlBytheSeaofCortez", "userReviewDate": "Apr 27, 2011", "userURL": "http://www.goodreads.com/user/show/2634423-thegirlbytheseaofcortez", "userReview": "Despite the fact that the cover of Amy Greene’s debut novel, Bloodroot, is a dreamy, pastoral image, the story this book tells is dark, brooding, and at times, forbidding. Set in the Smoky Mountains of Tennessee, Greene shows us a side of Appalachia that many readers would rather forget – a side beset by poverty so pervasive that it begets violence, a violence that spills over from one generation into the next.Spanning three generations, Bloodroot centers around the high spirited, blue-eyed, black haired Myra Lamb, and Myra is one of the book’s six narrators. The other five are: Myra’s loving grandmother, Byrdie; Myra’s abusive husband, John Odom; Myra’s children, the quiet Laura and the bitter Johnny; and Doug Cotter, a neighbor of Myra’s who falls in love with her. In telling a story that moves from grandmother to mother to granddaughter to that granddaughter’s children, Greene is giving us a portrait of the bonds that children form with their mothers, and how both the good and bad in one generation is handed down to the next.And even though the book is, for the most part, dark, Bloodroot is filled with rapturous descriptions of the hills and hollows and the glorious, blossoming springs of Appalachia as well as the folk wisdom and “mountain magic” that permeates this isolated area of the world. Greene so obviously loves Appalachia, and that love shows in her book, so much so, that the setting almost functions as a character, itself. I can’t imagine BloodrootL taking place anywhere but where it does. But, as charming and gorgeous as some of Greene’s descriptive passages are, she doesn’t let her readers forget that Bloodroot’s primary concern is a dark one.We first meet Myra Lamb through the eyes of her grandmother, Byrdie, and through the recollections of Myra’s neighbor, Doug Cotter. It was Byrdie who raised Myra – on Bloodroot Mountain, of course – and it was Doug Cotter who fell in love with her as he and Myra roamed the mountain and the surrounding countryside. “The whole mountain belonged to us,” Doug tells the reader, “and we knew its terrain like our own bodies, every scar and cleft and fold.” Byrdie comes from a long line of women who have special powers – healers, though some called them witches. But Byrdie, even with her special powers, is powerless against Myra’s wild, untamed streak, and compares her to Wild Rose, a wild and untamed, but beautiful, horse. Shy and quiet Doug, too, is powerless against Myra’s wishes once she falls under the spell of the dark and unpredictable John Odom.Suffice to say that Myra follows her heart, and all does not go well for her. When she gives birth to twins, the above-mentioned Johnny and Laura, she does her best to be a loving mother, but she’s emotionally fragile, and eventually the children end up in the care of others. Laura really tries to keep a low profile and better her lot in life, but Johnny, who is bitter and resentful, acts out. At one point, Johnny hikes up Bloodroot Mountain with a friend who has promised to show him a witch’s house. They come upon a little, dilapidated house, hidden among the trees. Johnny says it looks “like a toy I could hold in both hands, a dirty white box with black window holes and the roof a flake of blood.” Turns out, it’s his childhood home, and the “witch” in question is Myra, his mother. Even though Johnny acts out, it’s easy enough to sympathize with his lot in life, to care about him, even if we don’t agree with his actions.Although Bloodroot’s primary character is Myra Lamb, we don’t hear from Myra directly until the book’s final section. In some ways, I liked this, and though it added an air of mystery to Myra’s character and to the book. In other ways, I didn’t like it at all. Maybe Greene waited a bit too long to let her readers “hear” from Myra directly. I haven’t decided. I do know Greene layered on the Gothic overtones in Myra’s section, perhaps a bit too heavily, and I like the Southern Gothic tradition of writing. I’m a great fan. I love the grotesque characters created by Flannery O’Conner and the mentally fragile ones created by Faulkner and Tennessee Williams.The problem for me is that I wanted to know more about Myra. She was captivating, but in my opinion, Greene didn’t allow the reader full enough access to her. Her impact seemed a little blunted by only allowing her to speak in the book’s final section.To be fair, Myra is mentioned, talked about, remembered, in the first sections by her grandmother, Byrdie, and by Doug Cotter, but since Myra, herself, isn’t permitted “onstage,” some readers won’t be able to really get involved with her. It’s easier to want to get involved with Byrdie or Doug, but the reader will know that’s fruitless, too, because the book isn’t “about” either of them.Like Byrdie, Myra is possessed of many supernatural abilities; she has “the touch.” I think this might have worked if Myra had been present throughout the entire book, but with her only making an appearance in the book’s last section, I felt this was so much ornamentation. I liked Myra a lot more when she was presented as an ordinary woman trying to escape an extraordinary situation. “It’s not right, what we’ve put on her,” one character says in reference to Myra. “She’s made out of flesh and blood, just like anybody else.” And it’s as a flesh and blood woman that the reader relates to Myra, not as a “witch,” not as someone possessed of magical spells like many of the characters in Alice Hoffman’s books. And while I’m at it, I did not think Bloodroot was reminiscent of Alice Hoffman. Bloodroot is darker and more claustrophobic than anything Hoffman ever wrote. Hoffman’s books have a charm and a much lighter touch than Bloodroot has, and that’s not a criticism of either Hoffman or Greene. I’m just saying that they are different.So, did I like the book or dislike it? I liked it. Very much so. In fact, I loved it, but then, I'm partial to novels set in Appalachia. No, I didn’t think it was perfect, but I thought it was far better than most of the debut novels out there, even those that are highly touted. Greene’s prose is unadorned, but I felt she wrote with great assurance. The reader, I think, feels he or she can trust the author. One thing that kind of annoyed me at times was the dialect. I know some people in Appalachia speak differently than educated people in cities do, but sometimes, when the dialect is too pronounced, I think it detracts from the story rather than adds to it. For example, Greene’s characters would pronounce “wash” like “worsh.” I grew up in Appalachia myself, and even after I moved away to go to school, I would still spend summers there. I heard some of my own relatives pronounce “wash” like “worsh,” so I knew immediately what Greene was talking about, but other readers, those who’ve spent their entire lives in cities, for example, might have to stop and puzzle over some of the words, and that’s never a good thing. Still, I thought the dialogue had a poetic, and very authentic, Tennessee cadence.Some readers have told me that they didn’t like the fact the Greene used six narrative voices. I can understand both this complaint and Greene’s use of multiple narrative voices. Most readers do respond best to books that contain only one or two narrators. Many times, the impact of a story is diluted through the use of multiple narrators. However, there are other stories, and I, personally, feel this is one, that demand multiple narrators in order to fully express the range of emotional and thematic material presented. I thought Greene did a good job moving back and forth among her narrators, however, I do have to agree with those readers who felt all six of the narrators sounded pretty much alike and that it was difficult to tell one from the other. In addition, this entire story is \"told\" rather then being dramatized in scenes. After a while, I started to feel I was being \"preached to\" and it got a little annoying.What I didn’t like, and this may be only personal preference, is the fact that in this book, it was only the women who were strong and independent. The men, for the most part, seemed to be jerks. I keep hoping one of them would be different, from the very beginning, but it was not to be. I don’t oppose strong, independent women, but I thought a kind, gentle man here and there would have balanced the book a bit more. Even one kind and gentle man would have sufficed.I’m not a fan of bleak lives, in real life, but I am a fan of bleak literature, and let’s be truthful, we all have to bear a bit of bleakness now and then. It’s just part of living. Bloodroot more than satisfied my love for bleak literature. The book is chock full of pain and suffering, but to Greene’s credit it’s never pain and suffering for the sake of pain and suffering. The consequences in this book all flow from character, as they should, and those characters are complex, rich, fully realized persons.I’m also a fan of claustrophobic literature, and I loved the way Greene set her story on Bloodroot Mountain, and in doing so, kept the world at bay. The enormous beauty of the setting was a joy to read, but it also served to highlight the poverty and the violence that was taking place.Bloodroot is a rather slow paced novel, but I think that fits well with its Southern setting. Not a tremendous lot happens; this is primarily a character driven novel, but I also enjoyed that. Even though I wanted to know more about Myra, I was still able to get totally drawn into the lives of the characters. This is a book that made me feel, rather than making me think, and for me, that’s the best kind of book.All in all, Bloodroot is a book that will stay with me for a long time to come, and I look forward to Amy Greene’s next novel. She has an amazing talent, and I just hope she continues to set her books in the beautiful Tennessee landscape.4/5Recommended: Definitely, for those readers who love character driven novels, and love a book with overtones of the Southern Gothic genre. You can read my reviews and writing tips at literarycornercafe.blogspot.com."}, {"userName": "Amy", "userReviewDate": "Jan 17, 2010", "userURL": "http://www.goodreads.com/user/show/727334-amy", "userReview": "I may well have found my favorite book of 2010 ... or at least one of my top 5! I love, love, love this book! First, let's do a quick overview of the book (from Goodreads) - Named for a flower whose blood-red sap possesses the power both to heal and poison, Bloodroot is a stunning fiction debut about the legacies—of magic and madness, faith and secrets, passion and loss—that haunt one family across the generations, from the Great Depression to today.The novel is told in a kaleidoscope of seamlessly woven voices and centers around an incendiary romance that consumes everyone in its path: Myra Lamb, a wild young girl with mysterious, haint blue eyes who grows up on remote Bloodroot Mountain; her grandmother Byrdie Lamb, who protects Myra fiercely and passes down “the touch” that bewitches people and animals alike; the neighbor boy who longs for Myra yet is destined never to have her; the twin children Myra is forced to abandon but who never forget their mother’s deep love; and John Odom, the man who tries to tame Myra and meets with shocking, violent disaster. Against the backdrop of a beautiful but often unforgiving country, these lives come together—only to be torn apart—as a dark, riveting mystery unfolds.I'm not even sure where to start except to say that this book spoke to me. It got into my head and wouldn't let go. It was one of the best books I've read in a long time. This is not a light, happy book. It's a dark, brooding, haunting book. Amy Greene creates a world of places and people that will stay with me for a long time. The novel has the feel of being an oral history. The interweaving voices of the characters gives the book an amazing fluidity that kept me from wanting to put the book down. This novel feels epic, almost like a saga. Yet, there is an intimacy to the novel that made it absolutely and utterly engrossing for me.The writing is so well done. The seamless way that Greene is able to weave together so many different first person voices into one narrative was nothing short of amazing. When I think of the novel as a whole, I can really see the genius in what Greene created in this novel. She was able to expertly foreshadow so many events without ever giving anything away or giving the reader even a sense of foreshadowing. It's as if she created an amazing intertwining chain of pieces and parts that ultimately come together as a whole. Yet, none of the elements alone would work. It is only by placing them so expertly together that they have the emotional impact that they ultimately do at the conclusion of the novel. The characters are drawn with such complexity that I was taken by each and every one of them. Good, bad, and indifferent. They were all compelling. Greene has an amazing ability to make you FEEL something for her characters, even the most unlikeable characters. Not only that, but she's able to make you change your feelings about them throughout the novel, as you learn more and more about the events of the plot. I was sure that I felt certain ways about certain characters and then suddenly I would find myself feeling something completely different than I'd expected to feel. I think this speaks volumes about how talented Amy Greene as a novelist. The geography and beauty of Bloodroot Mountain is so well drawn that the mountain becomes a critical character of the book. The sense of place in this novel is so expertly done that I truly felt as if I was there. There is a great deal of pain, suffering and sadness in this book. It's not an easy read. It's emotionally wrenching. There were moments that simply took my breath away. I had to put the book down and just breathe for a moment. But, to me, that is what makes this book so amazing. It's what has stayed with me and what will likely continue to stay with me. The emotional impact of this book will stay with me for some time. I could go on and on and on. But, I won't. I'm going to leave it at that. I recommend this novel wholeheartedly. It's certainly one of my favorite books this year. I cannot wait to see what Amy Greene has for us next! She is undoubtedly a talent to keep an eye on!"}, {"userName": "Donna", "userReviewDate": "Nov 22, 2014", "userURL": "http://www.goodreads.com/user/show/13244359-donna", "userReview": "I don't even know where to start. There are so many things rolling around in my head and my heart.I did the audio and it was great. The readers were amazing. They brought the characters to life that would have made the author swell with pride. This was told from several different points of view. I'm usually not a fan of that format, but it seemed to work in this book.The author breathed real life into her characters through such a strong descriptive style. Her descriptions were focused, vivid and specific, both physically and emotionally. I felt they were right there and I had a front row seat. As an avid reader and listener, I really like that. I will read more by this author. She has the type of writing talent that I typically rave about. The story was also well thought out and it, too, felt real. Sometimes when plots are extremely cultural, it can be heavy handed. I didn't get that feel, but the hillbilly/redneck mentality was quite jarring.So I am feeling conflicted here. I'm not sure I liked the story. Actually it wasn't even the story itself. It was the uneasiness I felt because of the fictional reality of the fictional characters. That is what I didn't like. It felt very personal, raw and revealing. It had me feeling like I was on high alert. I sometimes felt like I wanted to sound the warning bell and other times I wanted to be invisible. So how do I even rate that? If I could remove my gut reaction to this story, it would be 4 or 5 stars. Also, it made me feel something (even though it was not in a good way). All these things I tend to rate highly. But I just can't do it. I can only do 3 stars and that is for the writing."}, {"userName": "Nikki", "userReviewDate": "Mar 07, 2010", "userURL": "http://www.goodreads.com/user/show/1591542-nikki", "userReview": "I wish it was possible to give fractions of stars.There were things I liked about this book. At times, Amy Greene offered up a pretty turn of phrase; the dialogue is familiar to me, as a) I live in North Carolina and b) I have family in Tennessee, very close to where the story is set. I liked the descriptions of Bloodroot Mountain--in my mind, I pictured the mountains near where my dad grew up in northeast Tennessee--wild and dappled with sunlight and beautiful.That said, I was not in love with this book. The book is centered around Myra's character, but there's so much we never learn about Myra. There's so much we never see. I don't feel her impact is as strong as it should be, if she's the main character. In fact, I felt more for every other character BUT her. Was she crazy? Was she really just a free spirit? It's hard to say. There's a lot this book leaves unanswered, which may have been the point, but it doesn't carry an air of mystery--it carries an air of blandness, like perhaps the subject wasn't interesting enough to question in the first place."}], "description": "Named for a flower whose blood-red sap possesses the power both to heal and poison, Bloodroot is a stunning fiction debut about the legacies—of magic and madness, faith and secrets, passion and loss—that haunt one family across the generations, from the Great Depression to today.The novel is told in a kaleidoscope of seamlessly woven voices and centers around an incendiary romance that consumes everyone in its path: Myra Lamb, a wild young girl with mysterious, haint blue eyes who grows up on remote Bloodroot Mountain; her grandmother Byrdie Lamb, who protects Myra fiercely and passes down “the touch” that bewitches people and animals alike; the neighbor boy who longs for Myra yet is destined never to have her; the twin children Myra is forced to abandon but who never forget their mother’s deep love; and John Odom, the man who tries to tame Myra and meets with shocking, violent disaster. Against the backdrop of a beautiful but often unforgiving country, these lives come together—only to be torn apart—as a dark, riveting mystery unfolds.With grace and unflinching verisimilitude, Amy Greene brings her native Appalachia—and the faith and fury of its people—to rich and vivid life. Here is a spellbinding tour de force that announces a dazzlingly fresh, natural-born storyteller in our midst.From the Hardcover edition.", "title": "Bloodroot", "url": "https://www.goodreads.com/book/show/7079597-bloodroot", "average": 3.77, "cover": "https://images.gr-assets.com/books/1320450744l/7079597.jpg", "reviews": 1417, "authors": [{"url": "https://www.goodreads.com/author/show/1256071.Amy_Greene", "name": "Amy Greene"}], "type": ["Fiction", "Historical", "Magical Realism", "American"], "outlinks": ["http://www.goodreads.com/book/show/7079597-bloodroot", "http://www.goodreads.com/book/show/6595962-bloodroot", "http://www.goodreads.com/book/show/8241241-bloodroot", "http://www.goodreads.com/book/show/18007503-long-man", "http://www.goodreads.com/book/show/10676388-crush"]}