{"ratings": 83228, "userreviews": [{"userName": "Shannon", "userReviewDate": "Apr 29, 2009", "userURL": "http://www.goodreads.com/user/show/2016128-shannon", "userReview": "[Regarding the cars parked in the alley. Why leave them? Why not hire someone to come pick them up and dispose of them. Barrons has to be familiar with a chop shop or two. If a bunch of people were murdered and their cars were left behind my work and/or place of residence, I would find some way to get rid of them so I couldn't be interrogated about them. If the cars hadn't been there, O'Bannion's brother wouldn't have had a reason to grill Mac and be suspicious of the book store though. I hate when the plot is forced in this manner. (hide spoiler)]"}, {"userName": "Regan", "userReviewDate": "Aug 26, 2015", "userURL": "http://www.goodreads.com/user/show/19645927-regan", "userReview": "4.5"}, {"userName": "Shelby *trains flying monkeys*", "userReviewDate": "Oct 12, 2010", "userURL": "http://www.goodreads.com/user/show/1053760-shelby-trains-flying-monkeys", "userReview": "Mac Version 2.0Mac has started to change, she originally was that southern Barbie girl who loved pink, cute accessories and fab nail polish.\nThat girl is still inside her battling with the new Mac she is becoming. Why is she changing? Because every time she turns around someone is either lying to her or some Fae petunia-hole is trying to kill her.\nThen we have Jerrico Barrons. He tries my nerves a bit in this book...and then in the last 50 or so pages-I get hooked.\nThe tension between him and Mac finally really heats up. \nMoning really writes the sexual tension part very well. It's really not a cheesey as my barbies portray. It's fecking hawt.This book did start slowly because it contains a whole lot of filler for what is to come, and it's not the greatest series that ever lived...but it is one of the ones that are just pure fun. And what becomes of our girl Mac? She starts to grow some big ole balls."}, {"userName": "Sh3lly ⚔ tired of damaged heroines ⚔", "userReviewDate": "Sep 18, 2014", "userURL": "http://www.goodreads.com/user/show/25393430-sh3lly-tired-of-damaged-heroines", "userReview": "[ I love that Barrons tattooed Mac anyway because she should have let him and he proved that he knows what he's talking about. Loved the almost-sex scene in the Burren. Y-u-m. I totally forgot the reaper/specter Mac kept seeing was Malluce! So it was like reading it for the first time. I think he made a good villain.  (hide spoiler)]"}, {"userName": "Tatiana", "userReviewDate": "May 25, 2010", "userURL": "http://www.goodreads.com/user/show/2250020-tatiana", "userReview": "Updated 12/10/14Oh, poor me, drowning in mysteries. It's still fun to read, even knowing who is what and does what why. It actually shows how well planned this whole series had been.First I want to thank Kat for recommending this series to me. So far it's been exceeding my expectations and I hope it will continue doing so. In this installment MacKayla Lane continues her search for Sinsar Dubh, a powerful Unseelie artifact containing the deadliest Fae magic. She is recovering from the ordeal she experienced at the end of the previous book and at the same time has to face the aftermath of her actions - Inspector O'Daffy is getting very interested in finding out more about the Dark Zone and why Mac is not going back home; Malluce's death is still uncertain; Rocky O'Bannion's brother, Derek, surfaces to poke around in Mac's business; and finally, a mysterious specter keeps following MacKayla around giving her creeps...In my opinion, Bloodfever is even better than Darkfever. The Fae world is getting wider, Moning gets us deeper into the lore which is very exciting. We get to know Mac much better and I like her quite a bit. I like her humor and her upbeat personality, I enjoy seeing her grow and change and learn about her abilities. Death-by-sex Fae Prince V'lane is even more mysterious and his intentions toward Mac are unclear. Same applies to Barrons, who is a total enigma. The Mac/Jericho chemistry is off the charts! I simply LOVE these two. Jericho is slowly but surely climbing up the list of my favorite fictional hunks, but he'd better stop roughing up Mac if he ever wants to get to the top of it, because I don't care for this kind of thing. All in all, a great book. It doesn't have much of a resolution in terms of the main story arc (which is not a problem for me), but the minor story arc is as interesting, intense, dark and edgy. I am planning to get my hands on Faefever very soon."}, {"userName": "Natasha Polis", "userReviewDate": "Jan 15, 2016", "userURL": "http://www.goodreads.com/user/show/19208239-natasha-polis", "userReview": "4.5!!Done! I'm just ripping through this series, it's quite addicting! This one was just a little better than the fist book, they both ended too soon, but I like how satisfying it is to finish these short books. I'm having a lot of fun with this, just the right amount of action and plot but the romance is one slowwwwwww burn."}, {"userName": "Kat Kennedy", "userReviewDate": "Mar 13, 2010", "userURL": "http://www.goodreads.com/user/show/3270188-kat-kennedy", "userReview": "The second installment of Bloodfever is intense, powerful, dramatic and clever.We see a great deal of character growth from out favorite characters as well as a progression in the plot, albeit a small one.The writing is, as always, stylish and immersive. The world is complicated, mysterious and intriguing.Overall, this book is a fantastic second installment in what is an amazing, refreshing and enjoyable series.PS. I'm either going to kill Barrons sooner or later, or do very, very, very naughty things to him."}, {"userName": "Lyndsey", "userReviewDate": "Jan 08, 2011", "userURL": "http://www.goodreads.com/user/show/4224396-lyndsey", "userReview": "Possible minor spoilers if you haven't read the first book and if any of my random ramblings turn out to be true...At the beginning of the book, we join Mac just after she finds out that she was adopted. Immediately, she begins to act like her parents just dropped off the face of the earth, and she starts referring to her sister as her only real family. Her attitude instantly turned ungrateful. Yes, she was just being a drama queen, but I know for a fact that you can love someone who isn't related to you just as much as someone who is. The fact that she is not technically related to them doesn't mean that they are no longer her family. That's really my only gripe about Mac in this book. I still think she kicks ass, just give your parents some credit! She actually had the guts to say \"He was lucky I was even calling him Dad at all!\" Really? At least she recanted it fairly quickly when he shows up all worried about her. After that, she seems mostly back to normal with them again.I'm starting to feel bad for Mac, though. I mean she's been mystically undressed and nearly performing involuntary sex acts in public (who hasn't?), rape-kissed by a drunken Irish man (uh, ditto), hit on by two seemingly normal history nerds (I persist, who hasn't?) and she's also teased inexorably, and now kissed and dry-humped, by the hot man she spends 90% of her time with (who wouldn't want to be?) yet she STILL isn't getting any.I'll warn you now that when i start to think about Jericho, my mind goes into a mixed state of paranoia and reckless abandon. It's no secret how I feel about Barron's name. But the way I feel in general about Jericho Zigor Barrons, or as I like to call him, J-Ziggy, is best summed up with this redonkulously articulate rant: love love loooooove adore gaaaaawd hellaluyah ahgagwhjrhfjfjkd mothreffenyes ahhhhhhhh!! !#%@?!/%#+!)$: *confetti popping out of head*Barrons is standoff-ish, confident and snarky, yet endlessly intriguing. He is the kind of guy who can make you feel everything and nothing at the same damn time. Not to mention, he likes to chain up women while they are wearing skimpy bikinis. Cough*jabbathehutt*Cough. Except, I probably wouldn't mind being chained up by him. Barrons, I mean, not Jabba. Obviously.Oh shiz! Why does Barrons have chains readily available in his basement???? For chaining up people as he feeds on them? For chaining up the Seelie? What-the-fa??? Fuuuuuudgin Fudge! He's Unseelie, isn't he?!?! It's a rhetorical question! Dang it! I don't want to know, wait, yeah I do. No. No, I don't.Yeah, I'm going crazy and I tried to warn you. Uh. Now I'm freaked out. Anyway, sooooo, I was thinking about who could pull off playing him in a movie. It would have to be someone very good with the eyes. Jeric-- er, Barrons uses a lot of non-verbal communication, which I find very sexy. So it would have to be someone like Ian Somerhalder AKA 'Smolder'holder. He is really very good with the \"looks\" but I'm not sure he could pull off the really long hair that Barrons has. And he's awfully pale, so not necessarily him. Ideas, anyone? Ah who cares, I just wanted to think about him. *sigh*I also have to give a big \"hell yeah\" to Mac for not caving to the demands of any of the several groups of people vying for her servitude. She refuses to take the easy way out and be ordered around blindly for each one's \"higher\" purpose. Not even with Barrons. Proudly and unbiasedly, she chooses her own higher purpose, and I have to applaud her for that. Like she herself says, she is no one's puppet, which cannot be said for many heroes or heroines in fantasy novels. Normally, someone discovers them, tells them about their abilities, teaches them to harness their powers, and then tells them exactly what to do with them. She does her best to not let that happen and chooses what she thinks is best, not what the others tell her is.The author's knack for introducing small amounts of information at a time, interspersed amongst the action, leads to a captivating experience. Too much information is never given up. We the readers, like Mac, have to earn the privilege of learning more about this strange world. There are no info-dumps in this series. And I appreciate it.In short, I loved it. And Eeeep! There's the next one sitting on my shelf!! This one ends on a bit of a cliffhanger, so I think I have to go now... Can't wait to get back to Barrons. *sigh*My review for the first book, Darkfever. Spoiler FREE.For the third book, Faefever. Spoiler FREE.The fourth book, Dreamfever. Spoiler FREE.The fifth and final book, Shadowfever. Spoiler alert!!!"}, {"userName": "Navessa", "userReviewDate": "Mar 06, 2013", "userURL": "http://www.goodreads.com/user/show/18104163-navessa", "userReview": "WARNING: Every quote in this review is a spoiler or a mindfuck.UN-WARNING: If you haven’t read the entire series, you won’t understand a single one and nothing will be spoiled for you.“Barrons has something the rest of us don’t have…there’s something that never crawled all the way out of the swamp. It didn’t want to. It likes it there.”“Far beneath me, in the marrow of the ground, something bayed.”“American?”I nodded. “You?” He didn’t sound Irish.“Little of this, little of that. Nothing special.” He smiled and winked. Dreamy eyes, long dark lashes. “Alina was wearing this yellow skirt and sweater set, and you were dressed from head to toe in pink, Mac, with a little rainbow ribbon tied around a blond wisp of your hair.”“If I was a minnow and they were sharks, he (Barrons) was one of those yet undiscovered fish that lurk in the deepest, darkest reaches of the ocean where sunlight and man never go.”“Never believe anything’s dead until you’ve burned it, poked around in its ashes, and then waited a day or two to see if anything rises from them.”“He’s dying, you know.” - Mac“Good for him.” – Barrons“I played volleyball with my sister. We drank Coronas in the sun.”“…we’d paid a terrible price…it had been our greatest shame…we’d made ourselves forget.”“I used to have a recurring nightmare when I was a child. A dream of four distinct, subtly varied tastes…I tasted one of the vile ones now…regret.”"}, {"userName": "Alex is The Romance Fox", "userReviewDate": "Dec 04, 2011", "userURL": "http://www.goodreads.com/user/show/6663962-alex-is-the-romance-fox", "userReview": "Did I ever think I would get into reading urban fantasy?? Before Fever Series….absolutely NO….and now here I am ….unable to stop reading a genre I have not had much interest….apart from the Lord of the Rings books (which blew me away!!!). I immediately started reading Bloodfever, the 2nd book of Karen Marie Moning’s Fever Series after turning the last page of the 1st book, Darkfever,which I reviewed, http://www.goodreads.com/book/show/11... I am back into the dark world of the Fae,….. MacKayla Lane has discovered and accepted and come to terms of the gift of being a sidhe seer, with special powers, one of these being the ability to sense the Sinsar Dubh, an ancient book of the blackest magic even seen, which holds the key to the balance of power between the Fae and humans. It’s the only thing that will save humanity from being destroyed by the Fae.I am so totally crazy about Mac. I love her view of her world…she’s lost a bit of that “I’m so into pink”…not totally at this point. She realizes that she will do anything to survive..she will bend the any rules, make alliances with anyone who can help her find her sister’s killer, fulfill Alina’s last request before she died and the answer to what her role is in this power struggle between humans and fae? You can still feel her vulnerability, her insecurities but as she discovers more about herself, the stronger and more determined she becomes. When she says “What had changed was me” at the end, I realized how far she has come and how much more she will have to go through before finding all the answers. I loved Mac’s optimism…even when things look dark and scary she still tries to see a bit of “sun, pink” ahead of her. She has such an amazing way of analyzing things that are happening in her life…and wow….it’s like going on a rollercoaster ride. Non-stop action!!!!!!!!!She is still living at Barron’s Books & Baubles..I love this bookstore…I could live there forever, surrounded by books and nothing else…no wait…I would want Jericho Barrons with me there with me!!!!!!! Jericho Z Barrons – I AM SO TOTALLY INTO HIM!!!!! He’s one of the most exciting heroes’ in a book, EVER…amazing, mysterious, secretive, gorgeous, sexy, stylish, rich, classy….I could go on and on…but u get the idea ……he’s beyond HOT…he’s the kind of man any woman would be dazzled, fascinated and…enthralled by!!!!!!!! This is not a romance series, has no or very few sex scenes but you can certainly feel the chemistry, the heat, the sizzle between him and Mac..of course both try to fight it and I can’t wait to see what happens between the two. Jericho is very protective over Mac but does he have an ulterior motive? What is he? A seelie, unseelie, druid, fae…how old is this guy…is he immortal ……she can feel something in him that is not totally human. Can she trust him? What does he want from her?And then, there’s V’lane….I keep thinking…lane, lane…is there any connection or meaning to Mac’s family name Lane???? The Seelie Prince who also wants something from her…but is he really who he says he is???? What does he want from Mac? She knows he is not telling her everything but she decides to forge an alliance with him as well…which drives Jericho crazy of course!!!!! In the growing darkness, V’lane is the one who takes her to the Faery world …..where she spends time in the sun…..loved the scene on the beach in Cancun…really funny….and when Mac spends time with her sister…that was so poignant.Mac discovers she is not the only sidhe seer and tries to link up with them but their Mistress, Rowena, who Mac first met in Darkfever, is not prepared to have her join the group unless she agrees to obey her..which of course Mac is so just not going to do!!!!!!!! What give up her spear??? Rowena is such a wicked character…I so hate her and hope she comes to a really gruesome ending!!!!!!!! Her characters are so vivid, so real, so believable. Fast story pacing made me at times so breathless like I had was running a marathon!!!!! Dani, the teenage sidhe seer with her sword and “speed”, Malluce…we discover what happens to this vampire…and what evil he does to Mac…shiver……the Lord Master, who Mac still believes killer her sister (imo…he didn’t) but he’s definitely dark….and evil…I mean bringing the evil and ugly unseelie into the human world…. Christian…loved how the author brings in a bit from her Highlander Series….The more we learn about Mac’s world, the more questions come up. You think you know something…and then…wam…so totally different to what you thought!!!!!!!This is such a compelling series…I just can’t get enough. Non-stop reading……Can’t wait to start book 3 next. Karen Marie Moning is an incredible writer and I can’t get enough of her stories.I liked the Glossary at the back of the book…explains Mac’s World and also you get to know how to pronounce all those Celtic words!!!!!!!"}, {"userName": "Mo", "userReviewDate": "Nov 08, 2013", "userURL": "http://www.goodreads.com/user/show/11856352-mo", "userReview": "4.5 stars.This one starts off where Darkfever finished. Mac is still in Dublin, trying to find out who killed her sister and why she was killed.She is still living in Barron's house. Her parents are not happy and they want her home pronto. “One day you may kiss a man you can’t breathe without, and find breadth is of little consequence.”\nThey are still on the lookout for the Sinsar Dubh.Who can she trust? The strange creatures are still everywhere. “The first promise we had to make ….. was that under no circumstances would we ever let either of you set foot in Ireland.”\n ”You don’t sound Scottish.”“You don’t sound Irish. Yet here you are, policing Ireland. But then the English have been trying to cram their laws down their neighbour’s throats for centuries, haven’t they inspector.”\nYeah, fecking Bloody Brits!!! She’s my daughter, you prick and if you’re thinking about your prick when you’re looking at her, I’ll rip it off and hang you by it.”\nGotta love an over protective Dad! If he’d been any other man and I’d been any other girl, I’d have called the narrowing of his heavy-lidded eyes lust. But he was Barrons and I was Mac, and a blossoming of lust was about as likely as orchids blooming in Antartica.\nStill nothing going on between Mac and Barrons so I am guessing it will be pretty explosive when it does happen. It does happen???? Doesn’t it??C’mon guys, I am getting Blue Balls here with you two!!!And we are off to the Burren, I grew up beside this area …..I seriously was never into Hocus Pocus and Gobbeldygook but this book just pulls me in with its, faries, boogeymen, monsters….. loving it. Maybe it has something to do with the fact that it is partly set in the part of Ireland that I lived for nearly 25 years…. Maybe not. I almost broke into a rousing, emotional “Danny Boy” and I didn’t even know the words.\nI’ll give you a hand there, Mac… all together now … Oh Danny boy, the pipes, the pipes are callingFrom glen to glen, and down the mountain sideThe summer's gone, and all the flowers are dying'Tis you, 'tis you must go and I must bide.Oh Danny boy, the pipes, the pipes are callingFrom glen to glen, and down the mountain sideThe summer's gone, and all the flowers are dying'Tis you, 'tis you must go and I must bide.\n YOUR JOY CAN FILL YOU ONLY AS DEEPLY AS YOUR SORROW HAS CARVED YOU\nAnd off we go to discover …"}, {"userName": "Emily May", "userReviewDate": "Feb 12, 2011", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "Plot: 5 starsCharacters: 5 starsWriting: 5 starsSexiness: 5 starsEnding: 5 starsOverall: 5 stars"}, {"userName": "Helen 2.0", "userReviewDate": "Feb 23, 2015", "userURL": "http://www.goodreads.com/user/show/39575951-helen-2-0", "userReview": "Fever is my all-time favorite UF series, so of course this casual reread with the MacHalos has caused me all kinds of crippling, nagging worries and unending anxiety as usual. All these questions keep running through my mind - What if the series isn't as good as I remember?What if it's better than I remember and I spend the rest of my life in bed, rereading for eternity?What if a meteor crashes into KMM's house tomorrow and she never writes another word?Most worrying of all, what if I meet an actual, real-life V'lane/Mac shipper?!But so far, so good. We're already past book 2 and the unspeakable has yet to happen. Even though the breaks between installment BRs are of ungodly length and Mac is still on her way to becoming Mac 2.0, I'm hanging in there. Barely."}, {"userName": "Julio Genao", "userReviewDate": "Nov 16, 2012", "userURL": "http://www.goodreads.com/user/show/3977017-julio-genao", "userReview": "no. just—fucking no, people.you read the blurbs of the books in this series and you think you're getting a sexy PNR but what you're actually getting is like six distinct buckets of cray.it's fun, it really is, until you make the mistake of thinking about what you just read. you follow along, making assumptions about what to expect based on all the other sane and non-rapey paranormal sexromanze series you've read and then you realize that you should have tapped-out in book one when the heroine was still acting like a deranged barbie with the values of a 17yo american girl in the mall of america with her daddy's american express black card.don't be fooled.i climbed rapunzel's hair, and when i got to her room i saw things i wish i could unsee but cannot.so much no in this book—and all the others.so. much. no.i said NO....except for JZB.no, JZB's penis.ok, fine, his penis and his penis life-support system.the answer is always 'yes' for it/him/those/them.bcuz i am a shallow slut and yucky internalized gender roles that are 300 years old don't bother me so much when the romantic lead has an enormous dick and the stamina of a prius.BUT OTHERWISE NO"}, {"userName": "Maria Clara", "userReviewDate": "Nov 25, 2017", "userURL": "http://www.goodreads.com/user/show/46308842-maria-clara", "userReview": "Sencillamente me ha encantado."}, {"userName": "✘✘ Sarah ✘✘ (former Nefarious Breeder of Murderous Crustaceans)", "userReviewDate": "Nov 12, 2014", "userURL": "http://www.goodreads.com/user/show/7298986-sarah-former-nefarious-breeder-of-murderous-crustaceans", "userReview": "[tattoo scene + lusty Burren = yum (hide spoiler)]"}, {"userName": "Shurrn", "userReviewDate": "Jan 08, 2014", "userURL": "http://www.goodreads.com/user/show/22115857-shurrn", "userReview": "Things are heating up for the Fever series!No sophomore slump here!\n\nIt's a strange new world out there and the rules have changed: It's every princess for herself.\n\n Ive discovered why I've been sucked into this series. I can't predict or classify the characters. In a world where literary characters are painfully formulaic, Karen Marie Moning is blazing her own wild road with this series and I'm just happy to be taken along for the ride.I read this entire book cover-to-cover in a single day... I STILL have questions. I'm making predictions about characters and wondering about outcomes... The reader can never really be sure who is a \"good guy\" and who is a \"bad guy\" in this urban fantasy adventure on the dark streets of Dublin.I'm beginning to think that no character is exclusively \"good\" or \"bad\" - I'm starting to believe that everyone's motives exist in a shade of grey.MAC\n\nI would wear pink because I knew my future was anything but rosy. I would accessorize myself to the hilt, and I would wear flirty shoes because my world needed more beauty to counter all the ugliness in it. I would wear pink because I hated gray, I didn’t deserve white, and I was sick of black.\n\n Mac is beginning to undergo a through mental and physical transformation. On the physical side, she's turned into black-ops Barbie by her handler.It seems everyone wants Mac on their side, but she's learning her lesson about attracting attention... She's learning that she can't trust anybody, but she must attempt to gain information from any source possible. She's developing a set of wonderfully lethal skills and a hard shell. BARRONS\n\nBarrons has something the rest of us don't have. I don't know what it is, but I feel it all the time, especially when we're standing close. Beneath the expensive clothes, unplaceable accent, and cultured veneer, there's something that never crawled all the way out of the swamp. It didn't want to. It likes it there.\n\n I have my predictions about who and what I think Barrons is, but I won't post them here because I don't want any of you lovely readers to confirm or deny my suspicions. I'd like for the reveal of Barrons to play out naturally as the author intended.Barrons remains secrative, dark, and absurdly sexy... But he's damn fascinating! I'm way more interested in unraveling the mystery of Jericho Barrons than I am about anything else in this series...That's saying an awful lot, because this book ramped up everything:More interesting secondary-charactersMore weird monsters roaming the streetsMore Action and suspenseMore blood and goreMore sexytimes...But get this:NOBODY HAS HAD SEX IN THIS SERIES YET!I can't call it Erotica...I can't call it a romance...This is simply one of a kind...Unfortunately, I'll have to pause for a bit before reading the rest of the series. I received paperbacks of the first two books in this seres from my friend Terry as a Christmas gift, and now I must set out to buy the rest of the Fever Series!\nMy other reviews in the Fever series:\n1 - Darkfever - Read my Review Here.2 - Bloodfever - You're Reading It3 - Faefever - Read my Review Here.4 - Dreamfever - Read my Review Here.5 - Shadowfever - Read my Review Here.6 - Iced - Read my Review Here.7 - Burned - Awaiting Publication8 - Feverborn - Awaiting Publication9 - Feversong - Awaiting Publication10 - Untitled - Awaiting Publication"}, {"userName": "Liz* Fashionably Late", "userReviewDate": "Oct 14, 2013", "userURL": "http://www.goodreads.com/user/show/8191214-liz-fashionably-late", "userReview": "Second Re-read: November 2015.It dragged a little in the middle but the CAVE SCENE IS PERFECTION.First Re-read: November 2014 I'm still giving it 4 stars. \n\"One day you may kiss a man you cant breathe without, and find breath is of little consequence.\"\n\n\nBuddy Read\n\n with a bunch of weirdos. Couldn't find better people to do it.Mac is growing and learning. Never forget she has not only lost her sister but every certainty about pretty much everything since she came to Dublin and somehow she hasn't break yet. If anything, she's getting smarter, stronger. As the smart Tanya said \"she's mourning over the loss of her safe, sheltered self\".\n\"I missed her hair. I missed mine. I missed my her. I missed me.\"\nBut that doesn't mean she won't fight. Barrons himself said when he thought she was all useless fluff and nails, she showed some teeth. And Barrons is, in my opinion, one of the best male characters ever written in the genre.. He's enigmatic, he's complex, he's nothing you've ever seen and at the same time he's simple. He's exactly what he shows you. And sometimes, he let himself go and say things like this:\n\"This wasn't what I wanted,\" Barrons was saying. \"This isn't what I would have chosen. You must know that. It's important that you know that.\" \nThere's this moment when I think they've found themselves in common ground. They both have been broken and survived it. I think this is the moment when he sees her. And starts losing the war against himself.\n\"Did you break once?\"\"Yes,\" he said finally. \"Did you kill the bastard?\"\"With my bare hands. After I kill his wife.\" He waved his hand at the door of the cell. \"You lead, Ms. Lane. I've got your back.\"\n* CAVE SCENE. CAVE SCENE *Cave Scene.cave scene.cave scene.cave scene.Finally, I love how Mac just does what it takes in order to survive. She said it herself. There's no black and white. \n\"There are only shades of gray. Black and white are nothing more than lofty ideals in our minds, the standards by which we try to judge things, and map out our place in the world in relevance to them.\"\nSo, she'll eat whatever she has to, she'll hang up with whoever she has to and she will accept whatever the night brings because she's changed too.__________________________First read: October 20134 *freaking solid* stars\nIt's our action that defines us. What we choose. What we resist. What we're willing to die for.\nI think I could describe Bloodfever as intense, fearless, brilliant, addictive, unputdownable and even then you wouldn't know how awesome this book is. The writing is addictive. Karen Marie Moning is a genius. The plot is there, I know it is, there must be... but here's the crazy thing: I have no fucking idea what the hell is going on and I don't feel betrayed at all, actually I'm so into this. I mean, she managed to capture my attention from chapter one and I just couldn't stop reading it. The best part? I'm satisfied. No complains about the lack of answers at all. The characters are incredibly complex and their development is amazing. Mac, once spoiled and annoying, is a total badass, funny, witty, flawed, resolved and so realistic I had to check twice if this was indeed UF material. Barrons is everything I want you'd ever wanted in a man if you liked incredibly strong, frustratingly enigmatic, impossible and dominating men. God, I do have issues... And this:\n\"Yes, I have loved, Ms. Lane, and although it‘s none of your business, I have lost. Many things. And no, I am not like any other player in this game and I will never be like V‘lane, and I get a hard-on a great deal more often than occasionally.\" He leaned fully against me and I gasped. \"Sometimes it‘s over a spoiled little girl, not a woman at all.” \nYes, the emotional and intense Jericho moment when you just know there's no hope for you. I'm fascinated by Fever. \n“The wisest man is the silent one. Examine his actions. Judge him by them.” \nOh, I'm judging you, Barrons... and I have some crazy theories about what you are, you sexy bastard."}, {"userName": "Georgia ♥ Team Dex ♥", "userReviewDate": "Nov 25, 2013", "userURL": "http://www.goodreads.com/user/show/9138738-georgia-team-dex", "userReview": "4 What-the-BLOODY-Hell Stars\"It’s our actions that define us. What we choose. What we resist. What we’re willing to die for.[...]There are only shades of gray. Black and white are nothing more than lofty ideals in our minds, the standards by which we try to judge things, and map out our place in the world in relevance to them.\"An obsessed man(?) with dangerous secrets.A seductive prince with his own agenda.A ruthless Grand Mistress.And in the middle of this deadly game of chess where the lives of the pawns are insignificant, a no-longer innocent girl who was forced to be a woman that survives but she no longer recognizes.When Mac traveled to Ireland to solve the mystery of her sister's brutal murder, she wasn't expecting a book to be responsible of the end of the world.Sinsar Dubh the long lost Fae book, written by the Unseelie King himself. A book wated by many and fatal as it is mysterious.Thrust in a world of growing darkness and shadows, Mac is forced to build uneasy alliances and trust 2 men that they may be using her for their own purposes but somehow they keep saving her life.\n“If you think to stand between V’lane and me, and play both ends against the middle, you’ll get ripped to pieces. If I were you, Ms. Lane, I’d choose a side, and fast.”\nV'lane is the Fae, but Jericho Barrons holds all the secrets and is more dangerous to the the senses of the woman inside of the two.With no idea of the grand scheme of things, forced to see the events unfolding while Mac is narrating her story by memories tainted of blood and pain, this book held me transfixed. Dark, emotional and passionate, I couldn't put it down until the nail-biting end end even then I immediately started the next...WHY on earth haven't I started this series sooner???I claim sheer stupidity.... Don't make the same mistake!!"}, {"userName": "Debra", "userReviewDate": "Dec 27, 2012", "userURL": "http://www.goodreads.com/user/show/13247178-debra", "userReview": "4.5 *I LOVE THIS SERIES, AND BARRONS, AND MAYBE V'LANE A LITTLE TOO* STARS.More action, more suspense, more fear, more doubt, more evil, more darkness; all of these elements sure don't make Mac's life any easier. But while the world is turning more evil, she is gaining more knowledge and strength and one thing she makes sure to never lose is: hope.\n\n\"Hope is a critical thing. Without it, we are nothing. Hope shapes the will. The will shapes the world. I might have been suffering a dearth of hope but I had a few things left: will, desperation in spades, and a chance.\"\n\n\n\n\"Being touched by Jericho Barrons with kindness makes you feel like you must be the most special person in the world. It's like walking up to the biggest, most savage lion in the jungle, lying down, placing your head in its mouth and, rather than taking your life, it licks you and purrs.\"\n\n\n\n\"Question: When you're one of the few people who can do something to fix a problem, just how responsible does that make you for it?Answer: It's how you choose to answer that question that defines you.\"\n\nThis second part of the series managed to captivate me once again from beginning to end, and it made me an even bigger fan of KMM and the brilliantly created world and characters in this series. It also left me with even MORE questions that I need answers to, so I'm moving on to the next part, Faefever, ASAP!!~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*"}, {"userName": "Jilly", "userReviewDate": "Sep 28, 2014", "userURL": "http://www.goodreads.com/user/show/25894509-jilly", "userReview": "Rereading with my buddies, edgy and sleepless. Bring on the Barrons!!New thoughts after reread: I was actually thinking that Mac was growing a bit in this story, and I was really proud of her for standing up to the Mob-guy... until she utters this ridiculousness:\n\"Go ahead, O'Bannion, come and get it. I'm fed up with jack-petunias like you.\"\nOriginal review from 2014:So, in Georgia they call the hot lava game \"don't touch the alligator\"? That's just weird! Everyone knows that when you are kids, you pretend the floor is covered in HOT LAVA, and that is why you jump from beds to dressers to couches to tables, etc... There was even an epic episode of Community where Abed and Troy start a giant hot lava game at the school for Troy's last day. It was dean-tastic!But, it figures that Mac would have a stupid name for the game. She can't even swear like a normal person. Idiot!The action in this book does get better than the last and the dark characters are really interesting. I like the complexity of the story, and how it keeps growing as time goes on. Nothing ends too quickly or neatly, which is nice. And, Mac has gotten a tiny bit smarter, more so in the beginning of the book, but she has a long way to go to get to your average person's start point.It seems pretty obvious, though, that Mac is still making way too many stupid assumptions. And, her stubbornness combined with her stupidly false bravado is going to keep getting her almost killed and waiting for Jericho to save her every book."}, {"userName": "Princess under cover", "userReviewDate": "May 01, 2018", "userURL": "http://www.goodreads.com/user/show/9604542-princess-under-cover", "userReview": "I am speechless. Where do I begin?It was sort of good, I was even heading toward 4 stars when I started the book, giving me interesting, emotionally connective banter (see my notes) that I was starting to feel glad I continued with Book 2. But right now, unless my reading buddy group dragged me or persuaded me with arguments too powerful to resist, I am NOT getting Book 3 or any other book in the series. Where to begin with the disappointment? I will preface by saying that maybe my expectations about the book/ series is just wrong. And if so, I feel kind of bad about giving a low rating because of my own misaligned expectations. Nevertheless, I paid for the books and read them. So the low rating stands.My review of Book 1 is still how I feel about Book 2. With the following adds:* Events that happen in this series seem to be planned so that the reader can slowly discover the various powers of the various characters, and the ultimate mystery that keeps people going - who is Jericho Barrons? What does he want with the book? What do the other characters want with the book? (but the other characters are secondary.) The most compelling character in this series for me is not the heroine, I honestly couldn't care less for her. The only compelling character is JB. And if I'm in a better mood I might pick up Book 3 just to see where JB is headed. OR, I might just read other people's reviews and save myself the $ and time.* Given above, events in this series don't seem to follow much plot or evolution. They're just devices to pepper in more mystery and pseudo discovery - Oh, Malluce isn't really who we thought. He's just weirder and scarier. And the twenty odd pages of torture was for... what purpose exactly?* There's no real emotional connection between the characters. I said this already for Book 1 and I was hoping things would change in Book 2 and was almost optimistic they would, and then we're back to flatness. There's a pseudo sex scene that is extremely weird and displaced given the situation and did nothing to further the relationship between the two main characters. I am left deeply unsatisfied after reading it.I don't get it. Is this a paranormal thriller? paranormal horror book? certainly not a paranormal romance, nor really all that fantasy like. But maybe I haven't read enough fantasy books to judge. It's just weird.I'm stumped."}, {"userName": "edge of bubble", "userReviewDate": "Dec 28, 2016", "userURL": "http://www.goodreads.com/user/show/55519430-edge-of-bubble", "userReview": "Mac makes me think of an ostrich who buries her moronic little head to the sand right after painting a target line in pink on her ass. She still is delusional, too stupid to live, yappy about clothing. But she changed a little bit. That's all I'm giving to her.Barrons is ... sigh... MINE!!!Story line got really interesting and there were twists I wouldn't expect from Mac. The author had little spasms of little did she know moments here and there but they were barely there, compared to the first book. Buddy read with my awesome ladies Jill and Sleepless."}, {"userName": "Karlyflower *The Vampire Ninja, Luminescent Monster & Wendigo Nerd Goddess of Canada (according to The Hulk)*", "userReviewDate": "Nov 05, 2015", "userURL": "http://www.goodreads.com/user/show/17243568-karlyflower-the-vampire-ninja-luminescent-monster-wendigo-nerd-godde", "userReview": "[Don’t act all fucking incredulous when she suggests a way for her to survive that you wouldn't think of. Don’t think I don’t know you were aware of the properties of digested Unseelie flesh. Would you really rather of had her DIE? There’s a special place in hell for heathens like you. (hide spoiler)]"}, {"userName": "Lindsey Rey", "userReviewDate": "Jun 19, 2015", "userURL": "http://www.goodreads.com/user/show/5436213-lindsey-rey", "userReview": "[4.5 Stars]"}, {"userName": "Jo", "userReviewDate": "Nov 30, 2011", "userURL": "http://www.goodreads.com/user/show/2467655-jo", "userReview": "[You were winning in this book until you went and ruined it.Let’s have a look. You didn’t try and rape our heroine in this book: Always a plus.You didn’t punch our heroine in the face: Again, a plus.You took her to a beach and let her see her sister: Lovely.You were a bit sneaky in keeping her for a month and you made Barrons get all sexyangry: Funny.But then you just let our heroine get stolen by a vampire and punched by a werewolf , shape-shifter, FAE?!?! brooding man: Not so good. (hide spoiler)]"}, {"userName": "Fareya", "userReviewDate": "May 06, 2017", "userURL": "http://www.goodreads.com/user/show/22583912-fareya", "userReview": "\"Question: When you're one of the few people who can do something to fix a problem, just how responsible does that make you for it?Answer: It's how you choose to answer that question that defines you.\"This sure is one crazy, kickass series. The second installment, Bloodfever flawlessly retains the addictive nature of the story. The plot is getting edgier, more dramatic and intense. With every page we get immersed deeper into the powerful and deadly world of Fae. I used to think Darkfever was fast paced, but in comparison, Bloodfever is a total rush. Oh, don't get me wrong, in no way is this hurried, but the sheer number of events that take place in such a narrow timeframe is absolutely appalling. Even though we are supplied with plenty of new information, much is left unanswered leaving the reader delirious with anticipation. Action-packed and jammed with suspense, this second book in the Fever series is an insane, wild ride that filled me with doubts and left me craving for more.“It's a strange new world out there and the rules have changed: It's every princess for herself.” Alongside the plot, the character development is progressing just right. Mac has come a long way in a short time. Accepting her gift as a sidhe-seer, she has grown into a stronger, more mature and determined young woman who can stand her ground. She is learning the ways of this world, getting smarter and coming out of her pink and pastel cocoon. Barrons, on the other hand remains an enigma. Dark and secretive, he still manages to be exasperatingly irresistible. Won't we all love to get more insight on this brooding, dangerous, antagonizing character of all times. Here's hoping in the next book maybe. At least we had a few intense, emotional scenes with Barrons and Mac. Talk about slow burn romance! \"One day you will kiss a man you can’t breathe without, and find breath is of little consequence.\"The Fae Prince, V'lane and his intentions are still a complete mystery to me. Manipulation is in his nature, he does not play fair and is extremely sly. I didn't like him anymore than I did in Darkfever. Let's see what the future holds for him. As for secondary characters, Bloodfever has a fair share of some great ones. I particularly liked Dani. She has sass and exactly the right attitude towards life. I'd like to get to know her better. Same with Ryodan. Rowena, on the other hand seems like a ruthless and cunning person with her own agenda. I wonder what that is! Questions, questions!! And as if we didn't have enough questions, the ending too is a cliffhanger!Karen Marie Moning has done a brilliant job of weaving an intricate, enticing story that is getting better and more convoluted with every installment. On to Faefever now, in hopes of getting some of those answers and uncovering a few mysteries. \"Hope is a critical thing. Without it, we are nothing. Hope shapes the will. The will shapes the world\""}, {"userName": "Anne", "userReviewDate": "Oct 11, 2009", "userURL": "http://www.goodreads.com/user/show/1720620-anne", "userReview": "Re-read: 2014Things happen in Bloodfever. Interesting things. But none of them matter.The only thing that matters is that Mac And Barrons finally have a hot Angry Make-out session.Yep.That's what I took away from a 300 page book.*shrugs*Original review: 2009This book is even better than the first book in the series, Darkfever. I can't wait to read the next one! A big \"Thank You\" goes out to Jill for telling me to get all of the books at once, 'cause these cliffhanger endings would have killed me otherwise!"}, {"userName": "♥Rachel♥", "userReviewDate": "Sep 18, 2012", "userURL": "http://www.goodreads.com/user/show/5481477-rachel", "userReview": "It’s a little hard for me to write a review for Bloodfever, because I finished it and immediately started the audio of Faefever. I think I might confuse some of both books together if I try to summarize it for anyone. Suffice it to say that I’m hooked! In Darkfever, Mac was a spoiled, naïve, and innocent young woman out to find her sister, Alina’s murderer. In Bloodfever, Mac has grown up a bit, whether she wanted to or not. She’s still the old-fashioned southern, pink, and sparkle clad woman when she can be, but she’s no longer as innocent as she was. \nMac: “I would wear pink because I knew my future was anything but rosy. I would accessorize myself to the hilt, and I would wear flirty shoes because my world needed more beauty to counter all the ugliness in it. I would wear pink because I hated gray, I didn’t deserve white, and I was sick of black.”\nBloodfever follows Mac in her quest to find the Unseelie book, the Sinsar Dubh, her dying sister’s last wish, with Barrons. She still has no idea what Barrons motives are in finding the ancient and powerful book, but at the moment he’s been the most helpful of all the big players, saving her life a couple of times. She still keeps V’lane in her back pocket, but at arms length because he’s a death-by-sex Fae prince (not a horrible way to go, IMO, but still), and she’s not about to trust him fully. I, like Mac wouldn’t trust Rowena any farther than I could throw that old witch! She’s left her high and dry too many times for my liking! I like the direction Mac and Barron’s relationship is taking, and whether they admit it to each other or themselves, you can tell they’re beginning to matter to one another. Love this quote because it’s so no-nonsense and oh-so-Barrons:\n “What are you Barrons?”“The one who will never let you die, and that’s more, Ms. Lane, than anyone in your life has been able to say to you. More than anyone else can do.” \nThis is like a love letter from Barrons. He may not utter words of endearment to Mac, but you can tell she’s burrowed a way into his heart. I just know it. Mac goes through a lot in this installment. Thankfully it’s not detailed bit by bit, because I can’t take that sort of thing. At the end of Bloodfever there’s a lot of unanswered questions but I was able to pop in the next book, Faefever, right after finishing, so I’m not going to complain! I have to say, when I first started listening to this audio I wasn’t pleased that it was a woman narrating every voice, even Barrons, but now that I’ve been listening to it, I don’t mind. I love the southern voice for Mac, it’s pitch perfect. Faefever is the same narrator, Joyce Bean, and I love it already. I’m curious how the last two are going to sound. There is a switch to a male and female narrator and I’m excited! I’ve heard only good things about the male narrator. Can’t wait! I've been listening to the audio CD's to and from work. Finally, my commute time doesn't seem like such a waste. You can find this review and more at The Readers Den."}, {"userName": "Giselle", "userReviewDate": "Aug 29, 2011", "userURL": "http://www.goodreads.com/user/show/4800103-giselle", "userReview": "Ok ok… I'm starting to get it. This second installment was Much better than the first. It has lots of action and with all the mayhem it gets pretty hard to put down. The mystery, though, is still there picking away at my brain cells. We got no real answers in this one, especially from Barrons. Only more questions. Which ended up being ok because the book is fully loaded and it couldn't possibly all fit in here. Plus the anticipation is kind of fun.Mac is becoming more independent and grown up which is great. I think she kind of has to with this new world she's been thrown in. I like how she herself knows there are \"two\" Macs and she refers to them both. She acknowledges that her Barbie doll side does not mix well with the Unseelie and especially not Barrons. And talking about the devil… what can I say Barrons? I love you! You are probably the most antagonizing son of a bitch I have ever encountered. There are so many questions about this guy that it's almost a torture. Damn you Karen!There are also new characters added to the storyline - but who cares about them? Moving on..Like any other UF novel, there are a few twists, and most of them just add to the questions already in the air. I didn't see them coming either. Although who/what the spectre was did cross my mind, but even the small stuff all went over my head. It may just be because I was too busy inside the story to ponder anything. But I never figured out what was eating the Rhino-boys, or Mallucé's power source. Even though we aren't given answers to any of the big mysteries, we do find out little snippets. Just enough to keep us fed and craving for more.I did enjoy the plot quite a bit. I like lots of action, I like mystery and I love a well built world; believe me, this novel delivers. The world building was formed in the first book, but it's deepened and I enjoy the vivid descriptions of everything. It's all very nerve wracking. There is quite a bit of gore but there is also humor thrown in there to balance it out a bit. I especially liked when the Shade flipped Mac off. >.< So all in all the writing is pretty good, I would even say improved from book #1. I think the constant and sometimes weird metaphors could be cut out. But that and maybe a few little quirks here and there can be overlooked if you even notice at all."}], "description": "Librarian's Note: Alternate-cover edition for ISBN10:  0440240999 / ISBN13: 9780440240990I used to be your average, everyday girl but all that changed one night in Dublin when I saw my first Fae, and got dragged into a world of deadly immortals and ancient secrets...In her fight to stay alive, MacKayla must find the Sinsar Dubh—a million-year-old book of the blackest magic imaginable, which holds the key to power over the worlds of both the Fae and Man. Pursued by assassins, surrounded by mysterious figures she knows she can’t trust, Mac finds herself torn between two deadly and powerful men: V’lane, the immortal Fae Prince, and Jericho Barrons, a man as irresistible as he is dangerous.For centuries the shadowy realm of the Fae has coexisted with that of humans. Now the walls between the two are coming down, and Mac is the only thing that stands between them.", "title": "Bloodfever\n      \n          (Fever #2)", "url": "http://www.goodreads.com/book/show/2705590-bloodfever", "average": 4.3, "cover": "https://images.gr-assets.com/books/1295997288l/2705590.jpg", "reviews": 4634, "authors": [{"url": "https://www.goodreads.com/author/show/48206.Karen_Marie_Moning", "name": "Karen Marie Moning"}], "type": ["Fantasy", "Fantasy", "Fantasy", "Romance", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/2705590-bloodfever", "http://www.goodreads.com/book/show/344262.Bloodfever", "http://www.goodreads.com/book/show/6999708-bloodfever", "http://www.goodreads.com/book/show/10335072-bloodfever", "http://www.goodreads.com/book/show/6283277-bloodfever", "http://www.goodreads.com/book/show/6308197-fiebre-sangrienta", "http://www.goodreads.com/book/show/6695174-bloodfever", "http://www.goodreads.com/book/show/112750.Darkfever", "http://www.goodreads.com/book/show/7304203-shadowfever", "http://www.goodreads.com/book/show/6050298-dreamfever", "http://www.goodreads.com/book/show/2702704-faefever", "http://www.goodreads.com/book/show/743599.Beyond_the_Highland_Mist", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/25353286-provenance", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}