{"ratings": 92112, "userreviews": [{"userName": "Stephen", "userReviewDate": "Dec 06, 2010", "userURL": "http://www.goodreads.com/user/show/1413439-stephen", "userReview": "Stick a fork in me, folks…I’m done. My relationship with the Dresden Files has officially hit rock bottom.\nThis is one review I've been dreading to write, both because A LOT of my friends passionately love these books, and because there are so many aspects of the series that are praise-worthy and enjoyable. The world-building is terrific, the magic system is well constructed, and there are host of likeable supporting characters, such as Thomas, Kincaid, Bob, Michael, Ebenezer...just to name a few. All of these are people I like hanging out with.It's just...well, let me finish first with the positives.In each of the previous 5 books, Butcher concocted a quality supernatural mysteries that, for lack of a better word, worked. This one is no exception. It’s clever, fast-paced, and generally makes sense enough to keep the reader engaged. Plus, Butcher has a knack for great opening scenes and this may be the best one yet, with Harry going toe to furry toe with a pack of demon monkeys flinging steaming hell poo, while Dresden fights back with magic and witty one-liners. That kind of shit (no pun) is what makes this series fun.Okay...*Big sigh*...here's the PROBLEM. I…just…HATE…Harry.The guy drives me seven different kinds of crazy. In this one, he finally found my last nerve, at which point he proceeded to twist it, strip it, soak it in lighter fluid, and set it ablaze. This blossoming Harry issue stems from two main sources.First, I don’t find Harry’s pathological protectiveness of women to be ingratiating or chivalrous. Quite the oppostive, I find it irritating, self-aggrandizing and chauvinistic...in the EXTREME. “Call me a Neanderthal if you like, but I get real irrational about bad things happening to women.” If he were to have said something like that once or twice in the earlier novels, and then let it go, I think I would have been okay with it. But it's a message repeated ad nauseam in each book and delivered with a shout IN YOUR FACE.\nNo matter what the rational part of my head thinks, when I see someone hurt a woman my inner gigantopithicus wants to reach for the nearest bone and go Kubrickian on someone’s head.\n\nBeyond his attitude towards women, the other burr in my tuckus is Harry’s holier-than-thouness and his condescending moral superiority. Over time, this has bothered me more and more and has finally reached the point of “too much.” On at least two occasions in this novel (once with Thomas and once with Ebenezer), Harry gets a major judgmental on when someone reveals themselves to be less than stainless in the virtue department. His over-the-top reactions, especially with Ebenezer, made me irk all over. Now, there’s nothing wrong with white hat heroes fighting the good fight, but I guess I like my good guys with a little more edge and a few more warts. That’s just a personal preference, but I like a little more “anti” with my hero. Give me Batman over Superman, Clint Eastwood over Roy Rogers, and Snake Plissken over Robin Hood.In the end, I just started experiencing diminishing returns when comparing the things I liked about the series with my growing disenchantment/irritation with Harry. Thus, as much as I regret all of the clever, interesting world-building and magical marvels I’ll be missing in the subsequent Dresden books, I just think the hurdles to my enjoyment have become too high….and too mighty.2.5 stars."}, {"userName": "Will M.", "userReviewDate": "Dec 13, 2014", "userURL": "http://www.goodreads.com/user/show/20408288-will-m", "userReview": "Urban Fantasy is the genre I choose when I'm in the mood for a light read, and The Dresden Files is my number 1 choice in that particular genre. I like the characters, plot, and writing. This series keeps getting better along the way, but sometimes it tends to feel like it has a routine.No money. New enemies. Girl problem. New job. Almost died. Didn't die. Saved the day.That's the particular routine of The Dresden Files, and it's slowly starting to get boring. Sure I like reading about Dresden, but I also need something huge that would make me want to read on. That was my problem with the fifth book, but this one had a few great moments.We all love a good plot twist, or a revelation that we didn't see coming. Blood Rites had that, and I'm really glad. If it didn't have those moments then I would've rated this a 3. When people tell you that the series gets better along the way, sometimes it doesn't hurt to trust them. I bought the next 13 books in the series after reading book 1. Sometimes I feel like I'm obligated to read all of them, but while reading them I feel the sense of enjoyment. The novels are relatively short, so it's not much of a chore to finish it. Add in the fact that you'd be finished by day 2 because you just have to know what happens next. Let's just call these books as page turners.4/5 stars. While this one is among the good ones of the series, it was still a bit underwhelming. It needs a bit more tricks up Butcher's sleeves."}, {"userName": "Heidi The Hippie Reader", "userReviewDate": "Mar 03, 2018", "userURL": "http://www.goodreads.com/user/show/7986781-heidi-the-hippie-reader", "userReview": "In this entry in The Dresden Files, the vampire Thomas asks Harry to help his friend, an adult film maker. People keep dying on set and Thomas thinks its magic-related.Part-mystery, part-comedy and 100 percent wizard, I think Blood Rites is one of the best in the series so far.\"I was agreeing to help him and taking a job, just as though Thomas were any other client. It probably wasn't the smartest thing I'd ever done. It had the potential to lead to lethally unhealthy decisions.\" pg 17As usual, Harry can't seem to get his life together long enough to get anything done. He runs from crisis to crisis. But, he's become self-aware enough to realize what he's doing.\"My worry and tension slowly grew, and as they did I took a perverse comfort in the familiar emotions. It actually felt good to feel my survival instincts put me on guard against premature mortality. Hell's bells. Is that insane or what?\" pg 93We learn a lot more about Harry's personal life in this story.\"The hardest lesson a wizard has to learn is that even with so much power, there are some things you can't control. No matter how much you want to.\" pg 353.And we also get to meet a shady character or two from his past.Highly recommended for urban fiction fans."}, {"userName": "Lyn", "userReviewDate": "Mar 06, 2018", "userURL": "http://www.goodreads.com/user/show/5253785-lyn", "userReview": "BROWN CHICKEN, BROWN COW!(Sleazy saxophone riff)Dresden magic on a porn movie set.I have to admit that when I read the trailers for this, I smiled to myself but did not expect much. Oh, I knew I’d probably like it, it’s Jim Butcher’s wise cracking wizard for hire after all, but the premise seemed off. I imagined Burt Reynolds and Heather Graham in Boogie Nights doing magic; Jackie Treehorn producing Log Jammin’ with werewolves fixing the cable.But I was very pleasantly surprised. I think this is one of his better books.Butcher builds and expands his vision of the world Harry lives in, where he’s in the Chicago Yellow Pages and there be boogeymen afoot if not altogether in plain sight. What is particularly engrossing was his further description and explanation of the different courts of vampires. The Black Court are the ones Bram Stoker described (at the behest of the Wizards White Council) and all the normal rules apply, except Butcher’s Black Court vamps are more stinkingly undead, almost a cross with a zombie or ghoul. The Red Court are the more demon like, less human in reality but powerful and able to disguise themselves. We learned about them in Grave Peril and Death Masks.Then there are the adult entertainment side of the house, the White Court. These are the succubi and incubi, the most human like and the ones who feed off emotions and life force.And can party like porn stars.Besides these fun descriptions and some cool recurring characters and some amusing new ones, Butcher also adds depth to his characterizations and further develops the characters, particularly Harry, Thomas and Karrin Murphy. Like any dynamic grouping, theirs is a complicated one and made all the more dramatic by the realization of some Jerry Springer show family dynamics.Blood Rites, escapist and fun urban fantasy that it is, also is good enough to explore themes of family, love, relationships and the primal need we have for one another.So not just another magic wielding shoot ‘em up; an honest to God, I’ll be damned, good book."}, {"userName": "Celeste", "userReviewDate": "Jan 08, 2017", "userURL": "http://www.goodreads.com/user/show/7317186-celeste", "userReview": "Full review now posted!It’s a thankless job, being Chicago’s only professional wizard. But it’s what Harry Dresden signed up for, and he is up to the challenge. Usually. But for someone always so swamped with work, the poor man never has two quarters to rub together. That lack of funds always ends up getting him in trouble, whether because of the jobs he takes to get some cash or because he ends up owing some sketchy people money.This book opens with Dresden rescuing puppies from demonic purple flying monkeys. No, really. Demonic purple flying monkeys that hurl incendiary poo. And can join forces to create one giant purple King Kong demon. Needless to say, the beginning was hilarious. One of the puppies, the one that manages to sneak his way into Dresden’s life, is the cutest thing ever. I can’t wait to get more of him in future books!Later in the book, Dresden helps an adult film maker dodge a curse targeting the women on set as a favor to Thomas, the sexy White Court vampire that always has his back for some unexplained reason. The curse is completely wonky. Seriously, someone got taken out by a frozen turkey that fell out of an airplane. There are freaky Black Court vampires on the hunt for Dresden, and during all of this other craziness Harry gets some family bombshells dropped on him. Lots of stuff goes down.Here is my problem with the Dresden Files; the writing is just so scattered. Butcher writes an entertaining story, but when he’s trying to bring plot points together things just fall apart for some reason. I can see where Butcher is trying to go with the story, and I can follow what he’s getting at, but the writing itself doesn’t convey the plot twists in any kind of concise manner. Are these five-star quality books? No. Will I continue to read them when I need a break from denser, better written books? Yes. Because Dresden might not be the best written book series on the market, but it sure is fun."}, {"userName": "seak", "userReviewDate": "Jan 11, 2017", "userURL": "http://www.goodreads.com/user/show/1805180-seak", "userReview": "I can honestly say, Blood Rites is my favorite in the series so far. Now, this was also my first audiobook of the series so that could have something to do with it. It's hard to tell at this point, but either way, I highly enjoyed Bood Rites.At first, I thought Marsters was a bit too serious for Harry, at least the Harry I had in my head, but the more I read, the more I realized Marsters is pretty much as perfect as you can get. Harry's wit and constant one-liners were actually made more hilarious by this narrator who is serious for the majority of the time. I think the heightened seriousness really works better for these books because it gives you a sense of this highly dangerous world where Harry works on a daily basis.It's hard to separate the story from Harry himself because it's told in first person so you're in Harry's head the entire time (outside of dialogue from other characters). I thought this was a brilliant way to handle it though, where you get Harry's sense of humor through his dialogue mostly, his thoughts as well of course, but a seriousness that anchors the narrative because Harry still lives in a world of scary monsters.I hope any of that made some remote bit of sense.Anyhow, Blood Rites gets back into the vampires (they seem to be a pretty regular fall back for Butcher) and that makes sense because the set up has been an all-out war between vampires and wizards. Someone's taking out people on an adult film set and Harry has to go undercover to discover who's behind it. Of course, it goes deeper than he imagined at first and there's where the money is for this series... Harry getting into stuff only to get beaten down and beaten on ... a lot.I struggled a slight bit with the first books in the series, but they have really hit their stride now. I didn't even notice the typical repetitions this time (Harry disrupts electricity, Harry gets really protective of women, etc. etc.) that are explained in each volume as if no one's ever heard about them before. It probably helps that it's been a year or so since I last read in the series. Blood Rites was excellent. James Marsters is so perfectly Harry Dresden it's almost scary. What a great combination. I've already broken my rule of leaving a year between each Dresden file read and started on Dead Beat. 4.5 out of 5 Stars (highly recommended)"}, {"userName": "Rick Riordan", "userReviewDate": "Nov 08, 2013", "userURL": "http://www.goodreads.com/user/show/25375513-rick-riordan", "userReview": "My guilty pleasure reading is the Harry Dresden series, featuring Chicago’s only professional wizard. Butcher has the first-person hardboiled narrator voice down pat, and throws out one-liners and rock ‘em sock ‘em action with equal abandon. Harry Dresden’s world gets increasingly complicated in this book with new allies and new enemies, and I’m glad I went back and started at the beginning of the series. This book, like the rest of the series, offers a wild ride and lots of fun."}, {"userName": "Steven", "userReviewDate": "Jan 12, 2017", "userURL": "http://www.goodreads.com/user/show/11855472-steven", "userReview": "Rereading with the Lobster. :)"}, {"userName": "Lindsey Rey", "userReviewDate": "Jul 26, 2015", "userURL": "http://www.goodreads.com/user/show/5436213-lindsey-rey", "userReview": "[4.5 Stars]"}, {"userName": "Chris", "userReviewDate": "May 04, 2008", "userURL": "http://www.goodreads.com/user/show/858949-chris", "userReview": "[image error]"}, {"userName": "Gergana", "userReviewDate": "Nov 17, 2017", "userURL": "http://www.goodreads.com/user/show/5312798-gergana", "userReview": "[(Book 4 - Harry still owes the Winter Queen two more favors, Book 5 - Harry picks up the fallen angel's coin, Book 6 - the walker-demon-thingy is back and has his eyes on Harry)  (hide spoiler)]"}, {"userName": "Carmel (Rabid Reads)", "userReviewDate": "Apr 26, 2015", "userURL": "http://www.goodreads.com/user/show/4561998-carmel-rabid-reads", "userReview": "I've been enjoying this series thus far, but this installment really brought it! The porn star murder mystery had barrel-of-laughs written all over it, doubly so with Harry Dresden on the case. BLOOD RITES put a lot of the characters' roles into perspective; Murphy tries being a vigilante on for size, Ebenezar is not what he seems, and Thomas—I did NOT see that one coming. This book was a turning point for THE DRESDEN FILES, and... PUPPIES!"}, {"userName": "Ashley", "userReviewDate": "Oct 16, 2010", "userURL": "http://www.goodreads.com/user/show/1343864-ashley", "userReview": "[(who turns out to be his half-brother) (hide spoiler)]"}, {"userName": "Tosh", "userReviewDate": "Aug 07, 2017", "userURL": "http://www.goodreads.com/user/show/43670791-tosh", "userReview": "Best of the series so far!rtc"}, {"userName": "Kelly H. (Maybedog)", "userReviewDate": "Oct 19, 2010", "userURL": "http://www.goodreads.com/user/show/1059653-kelly-h-maybedog", "userReview": "Despite the fact that this book needed an editor to point out places where the character gets up from a chair twice in the same paragraph without ever sitting down again or when he eats 3 breakfasts at three different places while seeing a doctor at the last minute between the last two (er, what time is breakfast at the last place?) without ever even mentioning he was full... Okay I'm going to pause there and add a period because even though that isn't a complete sentence, it's too dang long.Anyway, despite that, Blood Rites is another great tale from Butcher. It's fast paced adventure, starting with page one and leaving with not a cliffhanger exactly but a desire to read the next book RIGHT NOW. He's great at doing that with his chapters, too. I'd promise myself I'd stop reading at the end of the chapter but almost always it ends with something that made me want to keep reading. The characters are likable, with strong interesting women (no more wilting flower girlfriend), and believable actions and emotions. I love his concept and development of the emotion vampire. Although at times certain plot devices seemed rather convenient, the book had two equally strong narratives through out that co-mingled nicely, twists and turns and loads of surprises and revelations about series characters. At times funny, at times tragic, in all, Blood Rites is a good, solid read for those looking for a fun urban fantasy. Oh, and a puppy! Dresden + puppy = Kelly happy place."}, {"userName": "Jim", "userReviewDate": "Oct 26, 2010", "userURL": "http://www.goodreads.com/user/show/695116-jim", "userReview": "It was a pretty good romp in many ways, but I was highly ticked off my numerous logical flaws, especially around the middle of the book. Harry's staff is very important, but through sheer sloppiness, Butcher manages to have it in two places. He also puts a manual car - one that has been a stick throughout the series & we just read was hard for Harry to drive due to a wounded leg - into 'drive' instead of first. A sentence or two later, he shifts into second. Power is out in the city - a big deal is made out of this & the plot is hinging on it - but Harry & Billy take the elevator. A few paragraphs later, a big deal is made out of Harry having to walk up steps due to no power. Please!!! These are major logical flaws that just slam an otherwise decent book & they're nothing but sloppy. There's no excuse for them. A bit of free proofreading or a decent editor would easily have caught them.As interesting as the series is in other ways, I just can't stand the sloppiness & have to take a break."}, {"userName": "Joseph", "userReviewDate": "Dec 03, 2017", "userURL": "http://www.goodreads.com/user/show/1281880-joseph", "userReview": "Chicago's favorite wizard is on another case. This time he helps out a white vampire \"friend,\" Thomas, after saving a bunch of puppies, Tibetian temple dogs, for a Tibetian monk. There seems to be some problems in the adult film industry. Someone is trying to kill Arturo Genosa's stars and Dresden is hired to find out who is doing the killing and stop it. Also in this story, the Red Court vampires still want Dresden dead. The Black Court is actively working to kill him and although Thomas is his friend sometimes, the White Court isn't really too friendly either. Perhaps not the book to jump into first. It is one that relies on the previous books to establish much of the story. A well-done book in the series."}, {"userName": "Israt Zaman Disha", "userReviewDate": "Feb 21, 2017", "userURL": "http://www.goodreads.com/user/show/45341691-israt-zaman-disha", "userReview": "Like the previous books of the series it's pretty exciting. Dresden gets tangled in several threatening problems. I was wondering, why does all the problems have to fall on him at the same time? He gets really beat up and I feel bad for him. This book is a little off than the previous three books of the series. I feel that it's too melodramatic. At one point Harry himself admits that it's more melodramatic than a Hollywood film. But when I see some possibilities between the most badass man and woman of the series I get really excited. And at the end there is a very clear indication of several haunting past coming back and it will get a Dresden fan excited to continue the series."}, {"userName": "Richard", "userReviewDate": "Nov 09, 2014", "userURL": "http://www.goodreads.com/user/show/8386404-richard", "userReview": "9/10This was probably the best outing in the Dresden world for me to date. The series could have gone one of two ways really; tedious and repetitive with stale characters with a too jokey style or an ever increasing amount of world building with entertaining characters with a whimsical style that amused. Luckily, the later seems to be more apt for me and I love that with each novel there is more information provided, like a slow drip feeding, about the world and characters to draw you in further.There is a term for how this book starts, I can’t recall it now, but it starts in the thick of Harry in some action with one of his ever growing list of (sort of) sidekicks. This has been used a couple of times in the series and I have to applaud it as it gets you deep into the book without realising. By the time you come up for breath you realise you’ve read a massive chunk of the book and the story is well on the way.Harry is drawn into an investigation onto an adult film set to try and work out why certain women are being targeted and killed on the set. There are plenty of humorous jokes throughout this part and it is quite the light read. The second half of the book is more complex and draws on the previous novels for back-story and gives Harry a different kind of enemy to battle and adds further layers to the world and characters in it. Both contrasting styles helped shape the overall book and it worked well.As I mentioned, this was my favourite book in the series to date. I look forward to reading the rest and think this series will be one of those that when all is said and done I will re-read from the start. I’ve noticed in a couple of reviews there were people who got annoyed at certain things about the series but these have completely passed me by. Now if you excuse me, the band wagon is driving by and I must jump on it.If you enjoy this try: “Going Postal” by Terry Pratchett"}, {"userName": "Steven", "userReviewDate": "Jul 15, 2013", "userURL": "http://www.goodreads.com/user/show/11855472-steven", "userReview": "I fricking love Jim Butcher. I love Harry Dresden, I love Karrin Murphy, I love Thomas Raith. I love Mister and Mouse, Bob and Ebenezer, and every single thing about this series!:)"}, {"userName": "Nicole", "userReviewDate": "May 25, 2009", "userURL": "http://www.goodreads.com/user/show/163750-nicole", "userReview": "Plenty of wonderful Harry lines, as well as great interaction between Harry and Murphy and Harry and Thomas, plus now there’s a puppy (!). I look forward to seeing what Mouse can do when he grows up. I like how Murphy has grown as a character. She’s so much better now that she knows more about the supernatural world. I wasn’t crazy about certain elements of the setting and plot (the porn industry stuff), yet they make sense in terms of the big picture. I like Thomas more with each book; he’s becoming increasingly complex. I like the suggestion that Thomas may be able to overcome the dark side of his nature; as it is, he can control himself better than other members of the White Court. It’s clear that Butcher is fully aware of what he’s doing, what conventions he’s tweaking; he even uses a line from Empire Strikes Back when Harry is accusing Thomas of lying about the family connection. And there’s a definite Luke-Obi-Wan dynamic going on with Harry and Ebenezer now; although Ebenezer’s situation is significantly different from Obi-Wan’s in that Obi-Wan was never an assassin."}, {"userName": "Karla", "userReviewDate": "Feb 27, 2015", "userURL": "http://www.goodreads.com/user/show/3024056-karla", "userReview": "5 Stars!Loved this one! Lots of Lt. Murphy, which is always a plus, there's plenty of action, humor and secrets about Harry's family are revealed. It was emotional for him and for me. This wizard has captured my heart! James Marsters...delicious narration!"}, {"userName": "Jilly", "userReviewDate": "Jul 05, 2015", "userURL": "http://www.goodreads.com/user/show/25894509-jilly", "userReview": "Have you ever seen the famous Leeroy Jenkins youtube video? There is a group of gamers getting ready to do a quest in World of Warcraft and they are standing outside the gates and talking on their headsets, coming up with a complex gameplan on how to get in there and beat all of these monsters. But, suddenly, in the middle of the discussion, Leeroy decides that he's had enough talk and just takes off, charging into the city gates, screaming his name, \"Leeroy Jenkins!!!!\". The rest of the group is stunned for a minute, but have no choice but to follow him. They are massacred and all proceed to tell Leeroy how stupid he is for messing up their game. Leeroy was definitely not on the same page as his team.Why the extremely long story, that you probably have heard of anyway? Because there is a scene in this book that cracked me up so much that I was walking around the house chuckling over it for about 30 minutes afterward. And, it kind of reminded me of the Leeroy Jenkins story, but better.There are some vampires from the black court and they are nasty killers who will take Harry out and kill a lot of innocent people. So, Harry decides to get Murphy and that scary mercenary guy, Kincaid, from the last book, and the three of them will go into the vampire nest during the day and kill them all. But, they know there will be human bodyguards, hellhounds, booby traps, along with human hostages. It's going to be tricky. They have a huge arsenal of weapons, and Murphy and Kincaid are total badasses with weapons, along with Harry's magic skills, so they come up with a well-planned out game plan on how they will sweep through the building. Tensions are high, the situation is dangerous, but they are ready, and Kincaid is setting them up with their weapons and giving them last minute instructions when this exchange comes up:\n\"Okay, Kincaid said. \"Anyone have any questions?\"\"Why do they sell hot dogs in packages of ten but hot dog buns in packages of eight?\" I said.Everyone glared at me.\nTHAT!! That is why I love Harry! He will make jokes at any time - appropriate or not. If you knew my husband, you would see that this is a very important quality to me. I spend all of our time out together in public translating his British accent into English, and then apologizing for his insane jokes once they understand what he is saying. I literally forbid him from flying after 9/11 because beforehand, he always, I mean always told the ticket person that someone had handed us a package and asked us to take it on the plane for them. There is no way he wouldn't have had his ass thrown in Guantanamo and been making wiseass jokes to the guys who were waterboarding him if he had tried to travel at that time.I really appreciate a man who can make me laugh.So, about the book! In this story, Harry is asked to take a job doing bodyguard work on the set of a porn movie. My ick factor meter was high and I almost decided to skip it because, well, ick. But, luckily, there is no porn-stuff. These books are clean for the most part. The job comes through Thomas, who we met in the last book or two, and who is absolutely awesome. Who could resist a vampire who wears jeans, combat boots, and a Buffy, the Vampire Slayer t-shirt? And, there is a Thomas side-story here too.The good news is that Murphy is pretty prominent in this story. She is very involved with Harry's life, and is helping him with his vampire-killing mission. We also get to see a glimpse of her personal life and feelings when she freaks out over having to attend a family reunion and wants Harry to schedule the vampire murders for that day so she can get out of it. I think we can all relate to that. I would sometimes be willing to schedule my own murder to get out of a family function.All in all, another fun and exciting story."}, {"userName": "Jason", "userReviewDate": "Mar 24, 2015", "userURL": "http://www.goodreads.com/user/show/2613919-jason", "userReview": "4.5 Stars Blood Rites is the best Harry Dresden book so far. I have pushed the Dresden Files series to the side since I have found a new love in everything Urban Fantasy, mostly due to it's PG nature. Harry is simply too good of a guy bordering on goodie goodie. I have really enjoyed the series up to this point and let it be known that Butcher and Dresden were the only ones keeping me even the slightest bit interested in the Urban Fantasy genre.This book is a book about curses, vampires, and blood lines. Blood Rites is really a story on family revelations. There are several major plot twists, series and game changers, and opened up secrets. These surprises are incredible and they are the best thing about the series to date. Blood Rites is a simple story about Harry trying to protect a movie studio from a series of deadly curses. As with all of the Dresden Files it is the magic of Butcher's story telling that make these must reads. He makes each of them fast paced and action packed with very little down time. They all add back story to our hero wizard and develop the world even more. Butcher writes these books flavored with humor and wit and one liners. This was an easy read that I loved from the first page. The following passage will give you a feel of the writing style and the humor of these books.\"Which made it a complete surprise when somethingslammed into the vampire from directly overhead, too quickly to be seen. There was a sound of impact, a raspy, dry scream, and the vampire went down hard.It lay on the ground like a butterfly pinned to a card, arms and legs thrashing uselessly. Its chest and collarbone had been crushed.By an entire frozen turkey. A twenty-pounder.The plucked bird must have fallen from an airplane overhead, doubtlessly manipulated by the curse. By the time it got to the ground, the turkey had already reached its terminal velocity, and was still hard as a brick. The drumsticks poked up above the vampire’s crushed chest, their ends wrapped in red tinfoil.The vampire gasped and writhed a little more.The timer popped out of the turkey.Everyone stopped to blink at that for a second. I mean, come on. Impaled by a guided frozen turkey missile. Even by the standards of the quasi-immortal creatures of the night, that ain’t something you see twice.“For my next trick,” I panted into the startled silence, “anvils.””Blood Rites is my favorite to date and a real game changers. I highly recommend this series to fans of the genre."}, {"userName": "Rob", "userReviewDate": "Jul 06, 2012", "userURL": "http://www.goodreads.com/user/show/10743961-rob", "userReview": "Executive Summary: Mr. Butcher ramps things up with this story, and continues to break away from the formulaic style of the previous novels.Audio book: Nothing really of note for this book, although James Marsters does get to try his hand at a Greek accent, which to me sounded pretty good. At this point in the series, I can't imagine anyone else reading it.\nFull Review\nSo for me, the turning point for the series starts with the last book Death Masks, but if that one didn't impress you, this one should. Otherwise, why exactly are you still reading the series?Gone are the mysterious and attractive females that bring Harry's sense of chivalry to override his better judgement. That doesn't mean he's still not taking cases, or working as a Wizard for hire, but he's tackling bigger problems, with larger implications than he once was.Thomas has come to Harry to call in a favor for helping him in the past and help a friend of his who appears to be under attack from dark magic.The underlying plot of the last few books takes a bit of a break with novel with the return of other baddies, along with introducing some excellent new ones.We see the return of what are becoming the main stay supporting characters of Thomas and of course Murphy, as well as Ebeneezer.This book has several very large revelations that have a major impact on the course of the story in futures novels.The humor gets better with each book, although Harry's smart mouth in the face of mortal danger can get a bit tiring at times.Also, Mouse! (Any of you who have read past this book, should understand that, any of you haven't will just have to scratch your heads).It's getting harder to write these reviews in my normal spoiler-free fashion, or at least without discussing spoilers from previous books. This may be the last book that I can manage that.This is another fast and fun read, and I can't wait to jump into Dead Beat, which probably sealed this as one of my favorite series."}, {"userName": "Shari Kay", "userReviewDate": "Oct 16, 2017", "userURL": "http://www.goodreads.com/user/show/12496588-shari-kay", "userReview": "3.25 ✭ I just can't go higher for a book/series that continues to depress me. It's not really Grimdark, but it's always grim. Dresden is broke...as always...gets in over his head magically and fails to save good people...as always...fumbles and bumbles around...as always...gets betrayed...as always...gets the shit beat of him... etc. etc.In BR, his semi-friend/white vampire, Thomas, asks him for a favor; there is a death curse involved. Being broke and all...Harry takes the job and ends up undercover on an adult movie set. Right? He's not thrilled about it either. Beyond stopping a nasty curse that has killed more than once, he's decided to go on the offensive with the Black vampire Mavra (from previous book). To accomplish this, he needs help and hires the mercenary Kincaid, whom he can't afford and ultimately costs him more than just money. Murphy is front and center in this installment...and can I just say I don't get her mother? Like at all. How can she be okay with what her other daughter has done? Murphy's big, supposedly loving family--sucks. Thomas makes me sad too in BR...the whole culture makes me sad. And angry. Butcher's world is written to be brutal and callous and unfair and cutthroat and...depressing. Maybe too much so. Where is the hope? I don't see happiness in Harry's future and neither does he. I haven't decided if I'm continuing with the series. I like UF, I like Harry and I like Butcher's writing, but I don’t like when the reads are such a downer."}, {"userName": "Jody McGrath", "userReviewDate": "May 24, 2017", "userURL": "http://www.goodreads.com/user/show/31857555-jody-mcgrath", "userReview": "This was wonderful as usual, but for some reason I felt like I was missing something. Like their was a short story or something that they kept alluding to. It was pretty annoying. I usually don't read the short stories in series, I only read the main books. It seems like major stuff happens in these short stories though. I hate buying a book, when I only want to read a third or a fourth of it.The story was great though. It seemed like although it had a happy ending, there was also an air of sadness. Amazing writing."}, {"userName": "Martha", "userReviewDate": "Jul 16, 2008", "userURL": "http://www.goodreads.com/user/show/1206128-martha", "userReview": "I first heard of the Dresden Files when the Sci Fi Channel made a show about it. I watched all the episodes, and no, it wasn't the greatest show, but I was intrigued and hoped that it would come back a little cleaned up (I believe it's been canceled.) It turns out my parents are big fans of the books, so I thought I'd give them a try.I should say that I read a couple of the books already, I think #1 and #3, both of which I thought were decent. Not great, but not bad either. This is not a series that you truly have to read in order, so I had no qualms about reading #6 next.Sadly I found Blood Rites to be quite disappointing. One of the main problems I had was with the main character, Harry Dresden. At this point I'm already familiar with Dresden's back story and his general demeanor, so I was quite surprised to find him doing and saying a lot of things that just didn't make sense. Ultimately I found him unbelievable as a real person -- he had a lot of dialogue that was overly simplistic and clichéd, and often behaved contrary to someone with his upbringing.But the worst part was all the gratuitous reference to sex and sexy women. Now this particular book is about vampires, and porn star vampires at that. Naturally that means very sexy and beautiful people, often barely dressed. But every single time one of the women vampires came in to the room, the author felt obliged to give a 1-2 paragraph description of her body, what she was wearing, and the fact that she exuded sex. Dresden's cohort, a petit barely 5 foot tall cop (I know, I know) wasn't spared. It got to the point where it was just plain icky and I had to skip over a number of scenes, particularly the one where the cop, due to completely silly circumstances, is forced to take off her pants during a fight and phrases such as 'standing in her panties holding a shotgun' are used over and over and over.Frankly, most of this book read like the author's unusually detailed wet dream. It saddened me because I thought the overall concept of the books, a modern day wizard who solves crimes and fights the super natural in Chicago, has a lot of potential. But if you're a fan of the Dresden Files, I highly recommend skipping this particular entry."}, {"userName": "David Sven", "userReviewDate": "May 31, 2013", "userURL": "http://www.goodreads.com/user/show/8802423-david-sven", "userReview": "This is probably my favourite Dresden novel so far. The plot was tight and well paced. The sub plot/side story enhanced the main story instead of competing with it (like the last book instalment). The story just flowed smoothly and James Marsters has the audio narration down pat making for an overall enjoyable reading/listening experience.This book we learn more about Harry’s past and more about his family, his mother in particular. There are some juicy revelations that continue to build Harry’s Legend. Kincaid returns as gun for hire and plays a somewhat larger role than he did last book making for some badass action sequences. Thomas of the Vampire White Court plays a major role. Harry’s mentor, Ebnezer McCoy is back. And I hadn’t realised how much I missed Murphy since the first two books until now where she gets a lot more air time since then.Anyway, this story, Harry takes on a case for Thomas that sees him go undercover in a porno shoot. Yeah, tough gig. Ironically this story rarely goes beyond a PG rating as far as skin goes. What we do get is Vampires, zombified thralls, ancient curses, lots of action and probably one of the best dungeon crawl/Vampire lair sequences I’ve read for a while.So grab your garlic and holy water...and paint ball shooter- because its guns and magic, Kevlar and panties all the way.4.5 stars"}, {"userName": "Skylar Phelps", "userReviewDate": "Dec 04, 2017", "userURL": "http://www.goodreads.com/user/show/41541918-skylar-phelps", "userReview": "3.5 Stars Apart from a few awesome events and revelations, I feel like Blood Rites was a small step backwards for the series. The plot failed to ensnare me like the past couple of novels and it seemed like Harry’s handling of the conflict was a bit sloppy. Dumb luck seemed to pull him through too many of the plot twists instead of good planning or the quick thinking I would expect from him. The humor also suffered somewhat. It was less witty and more sexually thematic, making it feel cheap.Now, with all of that off my chest, the book was good. As I said before there are some game changing things that come up and we’re left with a couple of question marks for how Harry is going to deal with these changes and how they will affect the series in future books. Not just for him, but for other major characters as well.Not my favorite Desden novel but I enjoyed it and do recommend the series if you are looking for quality urban fantasy. Harry has become a favorite character of mine and the narration by James Marsters is fantastic."}], "description": "For Harry Dresden, Chicago's only professional wizard, there have been worse assignments than going undercover on the set of an adult film. Dodging flaming monkey poo, for instance. Or going toe-to-leaf with a walking plant monster. Still, there is something more troubling than usual about his newest case. The film's producer believes he's the target of a sinister entropy curse, but it's the women around him who are dying, in increasingly spectacular ways.Harry is doubly frustrated because he got involved with this bizarre mystery only as a favor to Thomas, his flirtatious, self-absorbed vampire acquaintance of dubious integrity. Thomas has a personal stake in the case Harry can't quite figure out, until his investigation leads him straight to Thomas' oversexed vampire family. Harry is about to discover that Thomas' family tree has been hiding a shocking secret; a revelation that will change Harry's life forever.", "title": "Blood Rites\n      \n          (The Dresden Files #6)", "url": "http://www.goodreads.com/book/show/99383.Blood_Rites", "average": 4.33, "cover": "https://images.gr-assets.com/books/1345557965l/99383.jpg", "reviews": 2487, "authors": [{"url": "https://www.goodreads.com/author/show/10746.Jim_Butcher", "name": "Jim Butcher"}], "type": ["Fantasy", "Fantasy", "Mystery", "Fiction", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/99383.Blood_Rites", "http://www.goodreads.com/book/show/7116897-blood-rites", "http://www.goodreads.com/book/show/7989720-blood-rites", "http://www.goodreads.com/book/show/10318435-blood-rites", "http://www.goodreads.com/book/show/234553.Blood_Rites", "http://www.goodreads.com/book/show/8176978-blood-rites", "http://www.goodreads.com/book/show/47212.Storm_Front", "http://www.goodreads.com/book/show/91477.Fool_Moon", "http://www.goodreads.com/book/show/91476.Grave_Peril", "http://www.goodreads.com/book/show/91478.Summer_Knight", "http://www.goodreads.com/book/show/91479.Death_Masks", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/25353286-provenance", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}