{"ratings": 20, "userreviews": [{"userName": "Richard Derus", "userReviewDate": "Apr 29, 2013", "userURL": "http://www.goodreads.com/user/show/3920693-richard-derus", "userReview": "***UPDATE 1 SEP 2013*** The new Salinger documentary and a biography come out this month! Read \"Calliope\" from this collection first, gives you a flavor of Salinger to whet your appetite.Rating: 4* of fiveThe Publisher Says: How would our social relationships change if we could inhabit online personas indefinitely? How would a piano virtuoso adapt when called upon to serve his country on the field of battle? The stories of Blue Ice take the reader to both recognizable places in the world and new locales of the mind to explore the triumphs and heartbreaks of humanity.My Review: I am acquainted with Brian Dice through Goodreads, though it took me a year of chatting back and forth to realize that Brian-the-Avatar-on-my-feed was author of a story collection. Shameful! When I did realize this, I asked Brian to send me a copy of his book.When it came, I was duly impressed. He's published the book himself, and hasn't stinted or cheapied anywhere. *Lovely* jacket design. Handsome cloth--cloth!--binding. A top-notch job.And then I read the stories. More accurately, I shouted imprecations at Brian as I headached my way through the SANS-SERIF TYPE he's set the stories in. Seriously! Sans serif. Miserable to read more than 500 words in sans serif. The typos (all books have 'em now) are reasonably minor...I for one don't care if the whole world misspells \"Hemmingway\" forever after...and the homonym-switching isn't up to the flinch-and-wince level...\"veil of tears\" is in place of \"vale of tears,\" inducing only a sigh. I did get thin-lipped over \"$250 dollars\" because, damn. That little dingus in front of the numeral? That's a dollar sign and that means dollars so don't say it again.So knowing that, please understand the full import of the four-star rating I've given the book.\"Calliope,\" a wonderful caprice about Salinger's real reason for not publishing anymore, returns the authentic Greek meaning of A Muse to the modern world. Darkly funny. One doesn't mess with a divine being. There is no way to win.\"Blue Ice,\" the title story, is also darkly funny...a second-rate academic, his low-class harridan of a wife, and his snot-nosed kid are invited into a gracious Japanese businessman's home during a vacation there, and despite their horrible manners they're presented with a rare and valuable gift: A piece of blue ice. Antarctic glacial blue ice? Maybe. Maybe not. Heh.\"Concert Pianist\" sets the man of the title in a jungle in Viet Nam. A soldier who is about as poorly suited for the job as anyone in military history, Dub (no one calls him Milton Parker any more, but they don't remember how he came to be called Dub either) was on his way to a real career when he got drafted and refused to evade the sentence. More's the pity, it's the real Viet Nam he is sent to. War wastes lives, talents, brains, and it's always been that way.Those three are the stand-out stories among the ten here. A slim 140 pages, the stories are models of concise tale-telling, and all are worth reading. A lot of pleasures are to be had here."}, {"userName": "Brian", "userReviewDate": "Oct 12, 2013", "userURL": "http://www.goodreads.com/user/show/1938805-brian", "userReview": "I know, by way of excellent and reputable first-hand sources, that author Brian Dice is an execrable human being. Real scum. A waste of carbon. The type of person that, should you be unfortunate enough to ever have to meet in the flesh, you would want to poleax just as soon as shake his hand. What kind of an asshole self publishes a book of short stories and titles it in a sing-songy shit rhyme: Blue Ice, Brian Dice? I’ll tell you what kind of asshole. An asshole like Brian Dice, that’s who.So yeah, Goodreads, you go ahead and do your worst. Delete my reviews, my shelves (oops, don’t have any left for you to delete), email all my Goodreads friends and tell them I’m a little “off”, but you can’t change my opinion. No sir. And you can’t make me read anything by Brian Dice. Your censorship only works one way."}, {"userName": "Kris", "userReviewDate": "Dec 26, 2012", "userURL": "http://www.goodreads.com/user/show/5974610-kris", "userReview": "Brian is a GR friend of mine who was caught by surprise when I quietly bought a copy of his short story collection Blue Ice. After sharing our love of books (and some cat stories), I was intrigued to read his fiction. Life intervened for a while, but in March, when I was still recovering from surgery, I decided to pick up the volume. I had been having problems focusing on reading since the surgery, and although that was improving somewhat, I was still having problems focusing or being engaged for long.I don't want to suggest that Blue Ice is a miracle cure, but I do think it's something even better -- a collection of stories, vividly imagined, covering an impressive range of themes, settings and characters. As I read further into it, I had more and more difficulty putting it down. The stories include \"Meeting Burwell,\" about a touching encounter with the Cleveland Browns' biggest fan; \"Concert Pianist,\" an exploration of the power and limits of music in wartime; \"A Perfect 10,\" which reminded me of Daphne Du Maurier's \"The Birds,\" only set in San Francisco after an earthquake; and the title story \"Blue Ice,\" in which an unforgettable encounter with a Japanese question makes us question how and where we assign value. Some stories, like \"The Smokescripter\" and \"Realworld,\" have a touch of fantasy and science fiction in them. This collection is recommended for anyone who loves engaging short fiction."}, {"userName": "Lynne King", "userReviewDate": "Apr 29, 2013", "userURL": "http://www.goodreads.com/user/show/15736557-lynne-king", "userReview": "This is an update on my earlier review when I gave this book by Brian Dice four stars. Looking at it again this morning, whilst having my breakfast, I have raised this to five as this author has a quality about him, \"je ne sais quoi\", that I need to express for all to read and who especially like short stories. For after all, we're all here to meet authors, either new or old to the world of writing. That's what it is all about surely?* * * * * * * * * First of all, it was both the title and the author’s name that caught my attention. How could one possibly forget a book with the rhythmic “Blue Ice” by Brian Dice?The first collection of short stories I ever read were by Maupassant. I remember thinking at the time how difficult it must be and also quite an art to be able to write these kinds of stories. I think the following describes that idea:“A short story is, in some ways, like a photograph - a captured moment of time that is crystalline, though sometimes mysterious, arresting, though perhaps delicate. But while a photo may or may not suggest consequences, a short story always does. In the story's moment of time something important, something irrevocable has occurred. The change may be subtle or obvious, but it is definite and definitive.”Brian Dice has certainly achieved this in his nine short stories but my favourite definitely has to be “Blue Ice”. I felt that I was included with the family (Rebecca, Sidney, and their son Joshua) when they all fly from Israel through to Tokyo, where they had decided to split their time between that city and Hiroshima. I also loved the writing style that I’ve always referred to as “New York Jewish humour” that is shown here.What starts as a casual encounter on a train with Jiro, a wealthy Japanese, ends up with an invitation to dinner and an overnight stay at his home in Hiroshima. Purely the mention of Hiroshima shows where east meets west many years after that event. That part of history is just engrained in my soul and I feel such shame at what happened then.“This man has a lot of money. His family rebuilt Hiroshima after the end of the war”, and the poignant statement I read elsewhere that “The oleander is the official flower of the city of Hiroshima because it was the first to bloom again after the explosion of the atomic bomb in 1945” does indeed pull at my heart strings.However, events get underway and Sidney then sees something extraordinary in Jiro’s library, and upon returning home, he finds there’s a large package awaiting him in his office at the university. Well the ending was just beautiful! I just wouldn't have the imagination to think of anything like that.Now “Realworld” was a close second, and yet rather alarmed me because this scenario could perhaps come about in the future.“Dear Mom and Dad – Forgive my handwriting. I undocked four hours ago and it feels like the worst alcohol hangover I’ve ever had”.“Undocked” what is going on here?I soon realized that we’re talking about “inline docking” and “Inline Pod technology” here and the son’s experiences. I was amazed by this story as it is so feasible for the future. With the rapid pace of technology nowadays, well anything is possible.Also another excellent short story, and also for the sheer beauty of the writing, was the “Concert Pianist”, in which a pianist, Milton, has to join the United States Armed Force, where he’s soon nicknamed Dub and found to be a perfectly inept soldier. You would think after the experience of being sent to Vietnam, he would never play again, but we have a skilful person here who gets around this problem in a unique way, and brings such pleasure to a dreadful part of history. I found this story so poignant.“Eric Kohler” is about a coal-mining family where the father Carl wants the family tradition to be carried on by his son Eric, who has other ideas.And as for “Calliope” – well a tale of inspiration and muses with Salinger, the reclusive writer, thrown in for good measure. It makes for a thoroughly good mix.All of the other short stories are a delightful read and I’m so pleased that I serendipitously came across this book. I highly recommend this book to anyone who appreciates a skilful and artistic writer, and I look forward to reading more of the author’s works."}, {"userName": "Arthur Graham", "userReviewDate": "May 04, 2013", "userURL": "http://www.goodreads.com/user/show/8050734-arthur-graham", "userReview": "For all the variety to be found across these nine fantastic shorts, they all share a refined style of storytelling that is at once richly descriptive and economical in its prose, never overwrought yet well-wrought just the same.Favorites included \"No Mid-Shoe Entry\", chronicling the upbringing and undoing of a high-stakes Vegas player, \"Concert Pianist\", a brilliantly ironic war story, \"Calliope\", quite possibly the best excuse for the 'this book is a work of fiction' disclaimer I've ever read, and \"Realworld\", which just might make you reconsider all the ridicule you've thrown at WoWers over the years.Common is the idea of the surrogate—the stand-in for whatever's missing in our lives—ranging from the genuine to the counterfeit, with neither opposite carrying any more weight than we invest in it. Often are we left with the impression that reality is really only what we can convince ourselves of, with the counterfeit being every bit as dangerous, convincing, and potentially fulfilling as the genuine article. I would also like to add that the author has a real knack for endings, arguably the hardest thing to nail in any story. Readers should expect the unexpected, and if there's one thing they shouldn't expect, it's that these tales will either fizzle out or crash and burn.Quite nice, Mr. Dice, this splendid blue ice."}, {"userName": "Nathan \"N.R.\" Gaddis", "userReviewDate": "Aug 12, 2013", "userURL": "http://www.goodreads.com/user/show/7607437-nathan-n-r-gaddis", "userReview": "[ There is a double problem here which only becomes apparent having read the story “Blue Ice.” What is blue ice? Not something I’m familiar with; it’s a bit of ice arcana. You’ll want to reread this story after the big reveal; allow blue ice to retroactively reassemble the story you just read; and then perhaps have my following comments finally make some sense. But what does it say about Brian Dice’s ego that he called his collection Blue Ice, after the object (blue ice) at the center of the story called “Blue Ice”? I don’t mean the ego of that flesh=man whose fingers work the keyboard; I mean the ego of the “author” whose name decorates this book. Why call it Blue Ice? Does the author mean to call it blue ice because he believes that these stories are nothing but a lot of blue ice? Or does he call this collection Blue Ice because he has the audacity to think of these stories as constituting real blue ice? The spoiler involved here is that the meaning of ‘blue ice’ is twofold; and the circumlocuting and the peripateting involved here is the dance around what exactly that twofold meaning is. On the one hand is what the scientist will tell us blue ice is; and so, should we care to believe that what the scientist tells us is in fact the last word in regard to the truth of blue ice? Or--other hand--there is the blue ice which is that particular blue ice which the giver of blue ice informed us it is; and this meaning of blue ice simply means more to us; we want our blue ice to be this second kind of blue ice simply because it is meaningful to do so, even if untrue; while what the scientist tells us blue ice is makes blue ice simply meaningless. So but my first question ;; why did Dice call his collection Blue Ice? If we take ‘blue ice’ to mean what the scientist tells us that blue ice is, then we have this man, this author, Brian Dice, performing a massive feat of ironic self-deprecation; and if so, then we don’t like him, because ironic self-deprecation is so passé. And there are enough story collections which truly are this kind of blue ice; Dice’s collection is not; but I understand the lure of the strategies of undermining the fall which comes after pride. But should we take the second side of the meaning of ‘blue ice,’ then we wonder if perhaps our author thinks too much of himself. We know that that is not the case. But when an author puts down words on a page and presents them to you as ‘blue ice’ we understand the ambiguity and we treasure that blue ice because it was given us from the freedom of his pen; and we won’t believe anyone who wants to tell us that what we read, these words, these sentences, these stories, are in truth (so our scientist would tell us) nothing but ink on pulped trees and nothing is really there. Oh no! What is really there is not ink on tree pulp, but arctic blue ice. Dice’s stories are such. (hide spoiler)]"}, {"userName": "Richard", "userReviewDate": "Feb 19, 2013", "userURL": "http://www.goodreads.com/user/show/6014887-richard", "userReview": "Autographed gift copy kindly sent by GR author and friend Brian Dice.What delighted me was the variety of characters and voices that emerge from these stories. We get gamblers, gamers, travelling businessmen and a bewildered Jewish family adrift in a foreign culture.Brian Dice's stories introduce us to a number of protagonists who are faced with unexpected situations and hard choices. They confront things like war, the generation gap, or basic survival. How they solve their problems may surprise, amuse, or horrify. I found myself pondering questions such as: What kind of world do we live in anyway? Or: Could something like that ever really happen in the future?"}, {"userName": "Scribble Orca", "userReviewDate": "Apr 22, 2013", "userURL": "http://www.goodreads.com/user/show/4402387-scribble-orca", "userReview": "So. There's a lot you can really HATE about this book. Like the fact that Brian DICE is a Goodreads AUTHOR. And a humble gentle guy who rarely says very much about comments...[...but the book is brilliant....]"}, {"userName": "Cody", "userReviewDate": "Jun 06, 2017", "userURL": "http://www.goodreads.com/user/show/48027559-cody", "userReview": "(TORNADO REVIEW/San Francisco in B-maj style)So you wake up one day and find that you're Brian Dice. What to do? You're already the nicest guy on Goodreads, likely the entire Internet, so you got that going for you. From there I assume you just go around righting the injustices of the world; dash into McSweeney's for lunch with Bill Vollmann (who takes notes); and wind-down your day by putting the kid to sleep and then absolutely BRINGING THE FUNK to the wife, your every cell deeply attenuated to her needs first and who cares about your own. Withstanding the occasional Dice-Signal in the fogged night sky pleading for Diceman's help to save a burning orphanage for handicapped cancer-kids from an impending meteorite collision, you call it a day. Tomorrow: Rinse, Wash, Repeat.I'm not going to say that every story worked for me in Blue Ice, and too long has passed to give specific examples as to why. A crib sheet would say something like, 'the sci-fi ones didn't work as well as the others.' Or something. The reason for the 4-stars comes from what I regarded as the centerpiece of the collection. It is the story of a prodigiously-brilliant and budding concert pianist (\"pronounced 'penis'\") who gets sent to Vietnam instead of the Perpetual Carnegie Hall he has worked toward his entire life. Things, um, don't go well. The last page, especially the last few paragraphs, are lovely, and I still have the final image tattooed on my minds' retina. That's saying something. My fingers key the dirt, BD.Tornado Ephemera: you would be proud, Brian. After finishing your book I immediately began The Rifles. Somewhere, somehow there is a connection there. Please still love me.XO,Concerned in California"}, {"userName": "Tony", "userReviewDate": "Jun 16, 2013", "userURL": "http://www.goodreads.com/user/show/33771-tony", "userReview": "These are engaging stories although I found the ideas better than the execution. In particular, dialogue was the weakest part of the skill set, moving the story onward but often uncomfortably banal.That said, these are wonderful works of imagination. This is a fascinating mind at work.I typically do not read short stories in order according to the author's sequence. This isn't to be contrary. Sometimes I pick a story by its length, for example, seeing what might fit into my schedule. Here, I passed over Realworld because it looked Sci-Fi-y, not my favorite genre. I wound up reading it last. In some ways it was my favorite piece. It was an epistolary story set 40 years in the future, but it was mostly about parents and children and the prism of generations. Of all the stories, it had, I think, the most profound message:Granddad claimed he became a man that day. Not because he got whipped, but because he realized that adults were full of shit -- that the things they told their kids not to do they went ahead and did anyway. He said that playing D & D would have been the greatest training on how to manage in an adult world, where everything from major appliances to spouses are disposable, and that at the end of the day all any adult is trying to do is upgrade their junk to newer, slightly nicer junk and not get killed in the process.Oh, and Brian Dice is a really good guy."}, {"userName": "Traveller", "userReviewDate": "Sep 27, 2013", "userURL": "http://www.goodreads.com/user/show/3145526-traveller", "userReview": "The author of this book is pretty cool!I can't wait to read this!!!Yaye!WHOOO-HOO!!! WHOOOPPPEEE!!!"}, {"userName": "BrokenTune", "userReviewDate": "Oct 13, 2013", "userURL": "http://www.goodreads.com/user/show/10592271-brokentune", "userReview": "Review posted on BookLikes:http://brokentune.booklikes.com/post/..."}, {"userName": "David Bruns", "userReviewDate": "Sep 06, 2013", "userURL": "http://www.goodreads.com/user/show/11890949-david-bruns", "userReview": "Blue Ice, the short story collection by Brian Dice, is a fascinating kaleidoscope of tales. From the gambling addict to the Cleveland Browns uber-fan to the smokescripter who makes attachments for—well, let’s not give away the ending to that one—Dice creates a stable of compelling characters in life-changing situations. I love it when a short story is able to deliver an O. Henry moment on the reader and Dice manages to pull it off more than few times in this collection. The title story, Blue Ice is just such a gem with a wonderful twisted ending that I did not see coming.Dice writes with literary skill and a flowing style that draws you in and holds you for the duration. My all-time favorite of the collection was “Concert Pianist,” a heart-breaking story of a young virtuoso who is drafted into the Army during the Vietnam War. Dice’s musical descriptions soar above the barrack crudity and the horror of war. Finding Blue Ice makes me glad there is a community like Goodreads where promising talent like Brian Dice can meet new readers."}, {"userName": "JK", "userReviewDate": "Oct 13, 2013", "userURL": "http://www.goodreads.com/user/show/2950816-jk", "userReview": "I'm glad for the extended work hours I had when I decided to start this, it gave me time to really savor each story. More thoughts later."}, {"userName": "Sharon", "userReviewDate": "Oct 11, 2013", "userURL": "http://www.goodreads.com/user/show/17881294-sharon", "userReview": "I thought the book was clever with unique and creative stories but I am resistant to give it a high rating. The book definitely has a hard edge to it. In the end it had the potential to be a really cool collection of cleverly written stories but they just did not feed my soul."}, {"userName": "!Tæmbuŝu", "userReviewDate": "Jul 07, 2013", "userURL": "http://www.goodreads.com/user/show/2932502-t-mbu-u", "userReview": "eBook link"}, {"userName": "I Hate", "userReviewDate": "Nov 27, 2016", "userURL": "http://www.goodreads.com/user/show/61973100-i-hate", "userReview": "Do you really think you can get away with being extremely humble and rage-inducing!!!!!!!!!!!!!!!!!!!!I hate Blue Ice! There is no such thing as it!!!!!!!! There is only White Ice, Black, And Yellow.Is that like the Blue men from Ice Ice BAIBY.PSSSSS: why is there no 0 stars! CMON Man!"}], "description": "How would our social relationships change if we could inhabit online personas indefinitely? How would a piano virtuoso adapt when called upon to serve his country on the field of battle? The stories of Blue Ice take the reader to both recognizable places in the world and new locales of the mind to explore the triumphs and heartbreaks of humanity.", "title": "Blue Ice", "url": "http://www.goodreads.com/book/show/12960389-blue-ice", "average": 3.85, "cover": "https://images.gr-assets.com/books/1319735496l/12960389.jpg", "reviews": 17, "authors": [{"url": "https://www.goodreads.com/author/show/5297310.Brian_Dice", "name": "Brian Dice"}], "type": ["Short Stories", "Fiction", "Literature"], "outlinks": ["http://www.goodreads.com/book/show/12960389-blue-ice", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/26583370-life-and-other-near-death-experiences", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/20552595-how-i-became-a-famous-novelist", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/36004055-not-perfect"]}