{"ratings": 232, "userreviews": [{"userName": "Abbey", "userReviewDate": "Oct 21, 2012", "userURL": "http://www.goodreads.com/user/show/4437424-abbey", "userReview": "1995, Jim Messenger, CPA, San Francisco, and Beulah, NV; amateur sleuth as PI. Mild-mannered number cruncher gets a life, as he tracks down the history of an elusive acquaintance. His search leads him to a small town with loads of secrets, lots of men with muscles and bad tempers, and A Strong Woman. What could have been almost farcical in another’s hands, works out to be a good, quick read in Pronzini’s. Smoothly descriptive, not too much navel-gazing but enough to understand the protagonist, good pacing and a nicely gruesome murder plot to chew upon, makes this quite enjoyable even to someone who doesn’t usually like westerns. And that’s essentially what this is: a coming-of-age western, a High Noon variant that’s rather more pastel than Technicolor, but entertaining just the same."}, {"userName": "Karen", "userReviewDate": "Sep 26, 2016", "userURL": "http://www.goodreads.com/user/show/1006779-karen", "userReview": "Jim Messenger is a CPA living a dull existence in San Francisco, when he notices a woman in the cafe that he frequents. The woman appears to be as lonely and alone as Jim is, so he works up the courage to speak with her after he notices that she comes in the same time every night. He works up the courage to speak with her, but she makes it clear she wants nothing to do with him. Then she stops coming into the cafe, and Jim is worried about her. Jim Messenger's life is no longer dull."}, {"userName": "Harry Shannon", "userReviewDate": "May 25, 2008", "userURL": "http://www.goodreads.com/user/show/1172628-harry-shannon", "userReview": "Atmopsheric, tense, touching and for the most part strikingly original. In my opinion, this is the gifted & prolific Pronzini's true masterpiece. It's been optioned repeatedly but not yet made into a film. Hope that changes soon."}, {"userName": "Julie Matson", "userReviewDate": "May 11, 2017", "userURL": "http://www.goodreads.com/user/show/55649851-julie-matson", "userReview": "Loved it!!!I rated it a 5 because it seemed so real. So believable. I could identify with the Messenger. Although he's male and I'm female. I suspect many can say the same. It gave me hope. I will seek out other books by the author."}, {"userName": "Ric Parks", "userReviewDate": "May 21, 2017", "userURL": "http://www.goodreads.com/user/show/23517082-ric-parks", "userReview": "Mystery in San Francisco and a small desert town in Nevada. Short, compelling mystery with competence across the board: theme, character, story, engagement. Pronzini deserves so much more recognition than he gets."}, {"userName": "Billie Raven", "userReviewDate": "Nov 20, 2017", "userURL": "http://www.goodreads.com/user/show/31687440-billie-raven", "userReview": "Didn't strike me as believable or hold my interest"}, {"userName": "Glen J", "userReviewDate": "Nov 10, 2017", "userURL": "http://www.goodreads.com/user/show/41804365-glen-j", "userReview": "Beulah, NV or bustA mild mannered CPA goes to extreme lengths to find truth...he finds snakes, small town America, guns, death, violence...but most of all himself."}, {"userName": "Peter", "userReviewDate": "Sep 12, 2016", "userURL": "http://www.goodreads.com/user/show/3587142-peter", "userReview": "When I was a kid, there was a local UHF channel that would play movies non-stop on the Saturdays. They would often have a 'theme', such as 'Horror Saturday', 'Audrey Hepburn Saturday', or 'Jack Lemmon Saturday' or 'Mystery Saturday'. The channel would start off with their movie marathons at 10:00 am Saturday morning and finish up on 8:00 pm. All the kids in the neighborhood would look forward to finding out what theme was going to be coming up next weekend, this was years before cable TV, so we were limited in our choices back then. The first movie would always be an older one, 'B' movie from the 1950's, they would then improve in quality as the day wore on, to the 'B' movie from the 1960's, to vaguely remembered movie from the 1970's, to the more recent movie that didn't perform well at the box office, until they would get to the headliner movie at 8:00 pm, which would usually be a movie that had been first released in theaters four or five years ago. Again, this is before cable. Anyway, this book reminded me of those old movies that this channel would show in the middle of a Saturday afternoon on a 'Mystery Weekend'. These wouldn't be bad movies at all, maybe they'd star someone like William Bendix instead of an 'A' list star like Kirk Douglas, but they'd be entertaining and be well made. So this is a solid, entertaining book with a twisty ending that I kind of saw coming, but Pronzini did such a good job of setting the scene with his description of this rural Nevada town that it didn't really matter much that the story is a bit far fetched. The setting and characters are worthwhile enough to hold interest with this one."}, {"userName": "Kathleen Hagen", "userReviewDate": "Jan 11, 2009", "userURL": "http://www.goodreads.com/user/show/1291703-kathleen-hagen", "userReview": "Blue Lonesome, by Bill Pronzini. B-plus.Cassette book borrowed from Library for the BlindJim Messenger, is a CPA in San Francisco with a very ordinary life. He eats his meals most nights in a particular restaurant. He starts seeing a woman always by herself at another table. She looks so tortured and depressed that he privately starts calling her “blue Lonesome”. He tries to talk to her but she makes it clear to him that she doesn’t want a friend. Then she kills herself. Jim Messenger decides he must track down her family. No one seems to have any knowledge of her, even her real name, and she has left an inheritance which should go to her family. He gets into her room and finds an old library book from “The Bulahe Public Library.” He figures out that it is a town in Nevada, and he goes there to find out about this woman. He finds out a great deal, is put in danger himself, is disliked by the whole town who didn’t like the woman he came to find out about. He finds that the woman is hated by the town because she is thought to have murdered her little girl and her brother-in-law. Ultimately his life is changed forever by his visit to this town. Pronzini is a good storyteller, and it’s a good blessedly short read."}, {"userName": "Susan Johnston", "userReviewDate": "Apr 29, 2014", "userURL": "http://www.goodreads.com/user/show/30738760-susan-johnston", "userReview": "Although this is the first full length novel of Mr. Pronzini that I have read (having read several shorts stories in anthologies), it will not be the last. The book starts out with Jim Messenger, our protagonist, spying a sad looking woman in the diner where he eats. He names her Ms. Lonesome as he recognizes the abject sadness of someone cut off from others and life. He recognizes it because he sees a kindred spirit.He attempts to befriend her, is shut down and then becomes slightly creepy in his obsession with her from a distance. His obsession blossoms after she commits suicide so much that he needs to find out what happened to her to make her so \"blue lonesome\".In the process, he goes through a transformation that elevates him from an insignificant colourless slug to a strong and passionate hero.The mystery of Ms. Lonesome involves some pretty shady characters who deal in child abuse and incest, murder, religion and other small town shenanigans. While the final resolution of the mystery was unpredicatable and its unveiling carried me along page to page, the actual final outcome of the book was not. I didn't mind though. I was kind of hoping it would end like that.Good book filled with damaged but decent characters and a fast paced story. I highly recommend it."}, {"userName": "Bill", "userReviewDate": "Apr 29, 2014", "userURL": "http://www.goodreads.com/user/show/4107148-bill", "userReview": "You’ve felt it – I’ve felt it – we all have felt that deep loneliness from time to time – we have felt, well, lonesome blue, and that’s what the woman Jim Messenger notices and then sees every night at the restaurant where he has dinner is feeling deeply.He sit down with her, but she tells him she won’t speak with him, and he leaves. Weeks later, she doesn’t appear – she has killed herself – the last resort of blue lonesome.But he’s intrigued, wants to find out more, finds out she may be from a small town in Nevada, takes his vacation early from his CPA job, and drives out to find out who she was.What he finds is a small town that blames her for her husbands murder and for the murder of her little girl.Messenger doesn’t believe it, and as he asks questions and digs around he encounters such angry hostility that his life might in danger.Is he right? Or did the woman – Ana – really kill her little girl and husband?Join Messenger as he moves from a dead end job in the city to a new life as he uncovers the truth behind the blue lonesome's suicide."}, {"userName": "Jordan McPeek", "userReviewDate": "Jul 17, 2010", "userURL": "http://www.goodreads.com/user/show/3310060-jordan-mcpeek", "userReview": "The desert setting was so sharp and perfect for the mood of the story. Thoroughly enjoyed getting wrapped up in the main character's head, all that loneliness and alienation. I'm sure the fact that I am a mid-career accountant like the main character has nothing to do with it. Seems to me the last Pronzini I read, The Crimes of Jordan Wise, which was fantastic, was also about an accountant who makes some big life choices. Years ago I read a Nameless book of Pronzini's and didn't think much of it. But now after two really good ones, I may have to try Nameless again, or whatever other Pronzini I can find."}, {"userName": "Littoface", "userReviewDate": "Apr 01, 2012", "userURL": "http://www.goodreads.com/user/show/2492515-littoface", "userReview": "Have you ever seen someone who looked so lonely that you were compelled to approach them? Jim Messenger has. In fact, he was so intrigued by a lonely looking woman at a diner that he follows her home... then embarks on a soul-searching journey across the desert to a town where he's not welcome. And all just to solve the mystery of the lonely woman. This book might be labeled a mystery, but it's more of a relationship book. As in, the relationships we form with strangers and our own loneliness."}, {"userName": "Pat", "userReviewDate": "Nov 03, 2014", "userURL": "http://www.goodreads.com/user/show/10656565-pat", "userReview": "Wasn't sure at first, but this novel grew on me.Lonely man sees and becomes interested in a lonely woman. After she commits suicide he traces her. She was accused of killing her husband and daughter. He solves who really killed them and falls in love with her sister.Good and well written."}, {"userName": "Judy", "userReviewDate": "Feb 15, 2016", "userURL": "http://www.goodreads.com/user/show/2328768-judy", "userReview": "Very good book - primarily because it does point out that if one finds their life to be less than satisfying, one probably needs to make some changes in their own behavior. Certainly not an easy thing to do but quite possibly helpful."}, {"userName": "La'Jacinth", "userReviewDate": "Jan 21, 2016", "userURL": "http://www.goodreads.com/user/show/15268012-la-jacinth", "userReview": "Interesting read!!!! Although I am not a fan of too many details, Pronzini is changing my mind....This is not a Nameless Detective book but Jim Messenger would make a great detective but he chose to become a ranch hand and that is just as breast!!!!!"}, {"userName": "Maddy", "userReviewDate": "May 20, 2010", "userURL": "http://www.goodreads.com/user/show/1298544-maddy", "userReview": "RATING: 3.75"}, {"userName": "Annie", "userReviewDate": "May 06, 2012", "userURL": "http://www.goodreads.com/user/show/979273-annie", "userReview": "a great read, read this one b4 2000, so I have no date as to when I read it"}, {"userName": "Country", "userReviewDate": "Oct 25, 2012", "userURL": "http://www.goodreads.com/user/show/12316073-country", "userReview": "I don't read a lot of murder mysteries, but this was a great one. I lucked out. I picked it initially, simply because I liked the title."}, {"userName": "Susan", "userReviewDate": "Feb 20, 2010", "userURL": "http://www.goodreads.com/user/show/2729239-susan", "userReview": "Entertaining mystery but a bit pedestrian."}, {"userName": "Kirsty Darbyshire", "userReviewDate": "Dec 07, 2010", "userURL": "http://www.goodreads.com/user/show/4631512-kirsty-darbyshire", "userReview": "Whilst definitely on the better side of good, I was kind of expecting this to be terrific so I was a tad disappointed. It was well worth reading but left me a bit cold."}], "description": "Shamus Award-winner Bill Pronzini presents a stunning psychological study of one man's obsession and search for truth. Jim Messenger is a CPA who hates his job, loves jazz and can't forget the woman he saw eating at the Harmony Cafe. When the woman commits suicide, Messenger has to learn why, and begins a search that is both a hunt for answers and a rite of passage.", "title": "Blue Lonesome", "url": "https://www.goodreads.com/book/show/298636.Blue_Lonesome", "average": 3.87, "cover": "https://images.gr-assets.com/books/1490514170l/298636.jpg", "reviews": 25, "authors": [{"url": "https://www.goodreads.com/author/show/22880.Bill_Pronzini", "name": "Bill Pronzini"}], "type": ["Mystery", "Fiction", "Mystery", "Thriller"], "outlinks": ["http://www.goodreads.com/book/show/298636.Blue_Lonesome", "http://www.goodreads.com/book/show/22216822-blue-lonesome", "http://www.goodreads.com/book/show/2818998-blue-lonesome", "http://www.goodreads.com/book/show/8675181-the-hidden", "http://www.goodreads.com/book/show/1985364.The_Snatch", "http://www.goodreads.com/book/show/3401232-the-other-side-of-silence", "http://www.goodreads.com/book/show/9653362-camouflage", "http://www.goodreads.com/book/show/5284143-schemers"]}