{"ratings": 941, "userreviews": [{"userName": "Pamela", "userReviewDate": "Jul 29, 2017", "userURL": "http://www.goodreads.com/user/show/20048096-pamela", "userReview": "Oh my goodness​. . . WOW!!! If you only budgeted your money for a few high-quality children's books this year, you might want to consider putting Blue Sky White Stars at the top of the list. Absolutely Breathtaking! Gorgeous and intricate, emotive artwork. Profoundly moving, sparse yet powerful text. This stunning book drew tears to my eyes, and swelled my heart with pride. United - ONE NATION - yet beautifully diverse. Indeed, \"Land that I love . . . \"With each painting, I was inspired to remind readers of the resilience of American principles . . . our strength lies in our willingness to embrace our differences. I hope this work will always remind us that our ever evolving country was forged by - and for - people from all walks of life and every background . . . \" ~ Kadir Nelson, Illustrator FIVE ***** Powerfully Stunning, Gorgeously Rendered, Children's Picture Book Worthy of Accolades and Praise ***** STARS"}, {"userName": "Beth", "userReviewDate": "May 28, 2017", "userURL": "http://www.goodreads.com/user/show/1434969-beth", "userReview": "Kadir Nelson's illustrations always stir my soul and move me to near tears. This book is no different. A lovely, spare, and inclusive tribute to our flag."}, {"userName": "Melle", "userReviewDate": "Jun 29, 2017", "userURL": "http://www.goodreads.com/user/show/85352-melle", "userReview": "Few things in the past six-plus months have been able to rouse any sort of patriotism in me, apart from Hamilton: An American Musical, veterans' honor songs at powwows, and speeches from Representative John Lewis. But this . . . Kadir Nelson's illustrations are always, always perfect, but even he outdid himself on this one -- inclusive, breathtakingly brilliant and beautiful, and full of emotion. Sarvinder Naberhaus's simple but powerful text plays on words and the concept of America. My one gripe is that I wish there were a more clear nod to our Indigenous brothers and sisters, but this book . . . Wow. Stellar. Stunning. And this is coming from a crusty, cynical, icy-cold heart."}, {"userName": "Keeley", "userReviewDate": "Dec 26, 2017", "userURL": "http://www.goodreads.com/user/show/5158135-keeley", "userReview": "Caldecott Read! This book is simply wonderful. The beautiful poetry of it, the illustrations, the meaning... I love it. In these divisive, unsettling times, this book is a wonderful, hopeful reminder."}, {"userName": "Jae", "userReviewDate": "Jan 26, 2018", "userURL": "http://www.goodreads.com/user/show/10514132-jae", "userReview": "Such complicated feelings. I went into this knowing nothing other than it's getting Caldecott buzz. So first few pages I'm like, \"oh ok, this is kind of nice.\" Making me feel kind of good about the flag, which is unusual. Then it goes on and I'm feeling kind of good about being American, like maybe not the entire country is a big garbage fire, which is very unusual. Especially in the \"All American\" and \"Stand Proud\" spreads, especially the Doctoral graduate. But then they hit you with the eagle/flag/fiery rocket cloud spread, and the good feelings start to waver. And THEN your whole situation is totally unseated by the astronaut staking claim to the moon in the name of \"FREEDOM\" \"FOREVER,\" reminding you that what America is most about is moon imperialism."}, {"userName": "Amanda", "userReviewDate": "Aug 09, 2017", "userURL": "http://www.goodreads.com/user/show/1753322-amanda", "userReview": "Oh the illustrations. Oh the parallels. Oh the feels. Amazing."}, {"userName": "Allie", "userReviewDate": "Nov 09, 2017", "userURL": "http://www.goodreads.com/user/show/310857-allie", "userReview": "Read for the annual mock Caldecott awards. Of course I love Kadir Nelson's incredible paintings, but it's the combination of the poetic text with this images that makes for a really remarkable book."}, {"userName": "Liza Wiemer", "userReviewDate": "Dec 03, 2017", "userURL": "http://www.goodreads.com/user/show/3152001-liza-wiemer", "userReview": "Spectacular, patriotic, and magnificent illustrations that will keep everyone's attention."}, {"userName": "Bill", "userReviewDate": "May 26, 2017", "userURL": "http://www.goodreads.com/user/show/703807-bill", "userReview": "Text/illustration synergy at a high level. And Kadir doing what Kadir does."}, {"userName": "Xanthe", "userReviewDate": "Nov 14, 2017", "userURL": "http://www.goodreads.com/user/show/36929-xanthe", "userReview": "I’ve had an uneasy relationship with my patriotism these recent months. I love my country and I love the possibilities it represents, the ideals that it strives for but never quite seems to meet. But I’m terrified of the people who use their own patriotism as a bludgeon to hurt others, as a weapon to keep their fellow Americans down instead of lifting them up. Blue Skies, White Stars,/i> brought me to tears as I read it, its few words paired with pictures that reminded me of the best of our country and of the truest distillation of what we can be. Perhaps this picture book just hit me at a very susceptible moment (year) when I’m especially vulnerable to the simple emotions that it inspires. Certainly, my kids were not nearly so moved. Sure, they liked it, but didn’t get mommy’s overreaction to its simplicity; its few carefully chosen words evoking so many interconnected feelings paired with the faces of Americans that represent all of us. And that’s okay. I’d rather they not share my manic highs and lows and just take away the beautiful images of the many, many different people and places that our country contains. I’m glad that they can see this book as simply an amazing depiction of beauty. In conclusion, Kadir Nelson is a goddamn national treasure and I’m grateful this book exists."}, {"userName": "Lorie Barber", "userReviewDate": "Oct 27, 2017", "userURL": "http://www.goodreads.com/user/show/367437-lorie-barber", "userReview": "GORGEOUS. Thematically and visually stunning representation of America and what really makes us a country: being united in our diversity. I can’t wait to share this with my students. SO MUCH to talk about."}, {"userName": "Linda ", "userReviewDate": "Jun 30, 2017", "userURL": "http://www.goodreads.com/user/show/5574951-linda", "userReview": "This tribute to America holds a few lovely and poetic words by Sarvender Naberhaus, sumptuously illustrated by Kadir Nelson. The double pages pair with each other, sometimes with the same words, sometimes with clever wordplay. For example, it begins with the title words, \"blue sky white stars\" with an illustration on the left of the Statue of Liberty shown against an evening sky, and a close up of blue sky, white stars in folded fabric with the same words. \"White rows\", also repeated shows covered wagons in a row, with the white rows of the flag on the opposite page. My favorite page, \"sea waves\" is a lovely ocean, but the companion page is of the flag waving, illustrating the words, \"see waves\". From Civil Rights' Marchers to a raised flag, from a flying eagle to the moon landing, the words and images bring forth the best of patriotic feelings, and for younger readers, topic sparks for more questions. It's a wonderful new book. Included are author and illustrator notes, plus another that added information can be found on the author's website, although in a search, I could not find her site. She does have a short blog post she's written showing some other of the book's pages, and you can see more pages on Google."}, {"userName": "Tiffany", "userReviewDate": "Feb 15, 2018", "userURL": "http://www.goodreads.com/user/show/6509032-tiffany", "userReview": "Kadir Nelson’s illustrations are breathtaking."}, {"userName": "Kristin", "userReviewDate": "Jun 27, 2017", "userURL": "http://www.goodreads.com/user/show/10381638-kristin", "userReview": "WOW! This book blew me away! This book must be shared with children young and old."}, {"userName": "Beth Parmer", "userReviewDate": "Jun 27, 2017", "userURL": "http://www.goodreads.com/user/show/43129051-beth-parmer", "userReview": "Stunning"}, {"userName": "E", "userReviewDate": "Jun 24, 2017", "userURL": "http://www.goodreads.com/user/show/10125291-e", "userReview": "Phenomenal. A love letter to the country America can still be."}, {"userName": "Emily Walsh", "userReviewDate": "Mar 10, 2018", "userURL": "http://www.goodreads.com/user/show/76668397-emily-walsh", "userReview": "Sarvinder Naberhaus’ book, Blue Sky White Stars, is a wonderfully written informational text that sheds light on the meaning of patriotic phrases and ideas through features of the American flag. Illustrated by award winning Kadir Nelson, this story highlights the various features of the flag in a unique and beautiful way. From looking at the front cover, you see a multiracial crowd, both young and old, gazing up at the night sky. One should not dismiss the little boy that’s sitting up on his father’s shoulders holding a small American flag. As you flip to the back cover, you can see how it highlights the same flag while you see the silhouettes of the entire crows looking at a beautiful fireworks display. One could think that this book is solely about the fourth of July. In actuality, the book encompasses the many ways the American flag has been and continues to be such an important symbol in our nation. Although there’s not a great amount of written text, the story and its wonderfully illustrated pictures make strong connections between the colors and elements of the flag. I love how the words on the left-hand page of the book connect to those on the right page by using features of the flag. For example, on the first two pages of the book, the words “Blue Sky, White Stars” are displayed, but the left-hand page shows Lady Liberty and a starry night sky. The right-hand page shows the blue fabric and white stars of the flag billowing in the wind. Even though there are only 28 words in the entire book, Naberhaus does a great job highlighting important settings and subjects that represent the United States of America. This book would be great in a K-5 classroom setting, as this book lends itself to a number of great instructional opportunities. Research Project 1: Students could take one setting from the book (Statue of Liberty, NASA, the Civil War) and write a short paper about their findings, connecting the importance of the American flag into the paper. Students would then highlight their findings on chart paper and would create a class book about the flag and its connections to these settings. Research Project 2: Students could research the meaning behind the thirteen stripes and fifty stars and write a paper on their findings, incorporating features of the book, including our independence. They would then present their findings to the class. Read Aloud/Jot a Thought: I would hand out copies of the Pledge of Allegiance and would read this as a whole group. I would pick out key words and ask students what they thought they meant, writing key words on the board. We would read the book together and the students would then jot a thought about one takeaway from the book on a post-it note after the reading. I would then have a group activity where we would create an American Flag out of cut out stars, red and white stripes, and a large piece of blue cloth. I would then invite the students to say the Pledge of Allegiance to connect the importance of the flag and the Pledge.This was a WOW book for me because the text and pictures cover so many important aspects of not only the American flag, but the history of how our freedom came to be. I don’t think the curriculum (for lower grades at least) covers such important topics these days. You could use this book to teach so many valuable lessons (freedom, ethnicity, gender, symbolism, history) to a variety of grades."}, {"userName": "Katie", "userReviewDate": "Aug 15, 2017", "userURL": "http://www.goodreads.com/user/show/3539261-katie", "userReview": "Fabulous new patriotic picture book, written in simple parallel text describing both our great nation and Old Glory. This story, even with it's spare text, holds so much within its pages and is a wonderful tribute to all who have helped build this country. Nelson's illustrations are absolutely breathtaking.Certainly a timely book as well and an important one to share with the little ones. :)"}, {"userName": "Amy", "userReviewDate": "Jan 14, 2018", "userURL": "http://www.goodreads.com/user/show/217090-amy", "userReview": "This is a beautiful book!Using simple words and phrases, that pack a powerful punch, along with big, bold pictures, this story illustrates a distinct parallel between America and her flag. Phrases included are: Blue Sky White Stars, Red Rows, White Rows, Old Glory, Sea Waves, Sew Together Won Nation and So Together One Nation, Woven Together, Stand Proud, Fly High, Freedom, and more!As mentioned earlier, the pictures are big and bold. They beautifully illustrate the words used by the author.Outstanding!"}, {"userName": "Bkrieth", "userReviewDate": "Sep 13, 2017", "userURL": "http://www.goodreads.com/user/show/3085600-bkrieth", "userReview": "Truly lovely in both text and visuals. Powerful portrait of the sort of country we can become. I look forward to sharing this with my class."}, {"userName": "CharityJ", "userReviewDate": "Jan 29, 2018", "userURL": "http://www.goodreads.com/user/show/1449396-charityj", "userReview": "Inspiring text matched by expansive and beautiful illustrations full of diversity and detail in true Kadir Nelson style. Once again outdoing himself."}, {"userName": "Melissa Carroll", "userReviewDate": "Jan 22, 2018", "userURL": "http://www.goodreads.com/user/show/23186302-melissa-carroll", "userReview": "This would be a good storytime book. (b/c the pages are large and vibrant, flows nicely with rhythm--would pair well with \"I too am America\")."}, {"userName": "Tasha", "userReviewDate": "Jul 20, 2017", "userURL": "http://www.goodreads.com/user/show/929521-tasha", "userReview": "Very simple patriotic text allows the illustrations by Nelson to shine on the page. The text moves from describing the nation and its flag to the various natural beauties of its land. The people of the nation come next. A well-worn face of Lincoln next to the well-worn flag that is tattered. People march on the streets, other attend a baseball game and still others are the face of America on its porches. Faces of all colors and creeds fill the pages until they return to the flag, our shared purpose and freedom itself.This is one of the most patriotic picture books I have ever seen. The words are so simple and yet speak so profoundly of all that the United States holds dear. The illustrations for these words are truly exceptional. Each page is a wonder, and turning the pages is like visiting a gallery of Nelson’s work. They are filled with the faces of America, symbols of our nation, and the beauty of the land.Awe inspiring, patriotic and grand, this picture book is superb. Appropriate for ages 3-7."}, {"userName": "Kelly", "userReviewDate": "Jul 18, 2017", "userURL": "http://www.goodreads.com/user/show/4644703-kelly", "userReview": "Um, beautiful, obviously! Maybe Kadir can finally win a medal."}, {"userName": "Mary Ann", "userReviewDate": "Jul 02, 2017", "userURL": "http://www.goodreads.com/user/show/1610575-mary-ann", "userReview": "Inspiring paintings complement spare text perfectly, creating a stirring portrait of America. Naberhaus, an Indian American immigrant, and Nelson, an African American illustrator, begin with iconic images of our country, showing how elements of the American flag resonate today. Paired images make clear associations between America's values and the diversity of our people, honoring all who have helped shaped our country. The layered meanings of the text and images will lead to interesting conversations--about why the artist chose these images, and how they show our country changing and evolving. Sarvinder Naberhaus has put together a wonderful collection of resources to complement this beautiful book: Blue Sky White Stars website. Teachers will especially enjoy using this to deepen conversations with students. I especially appreciate this beautiful book's message of unity and diversity, together as one country."}, {"userName": "Angela", "userReviewDate": "Aug 16, 2017", "userURL": "http://www.goodreads.com/user/show/4931336-angela", "userReview": "Spare but powerful text, with gorgeous illustrations by Kadir Nelson. A great book for a trying time in this country."}, {"userName": "Inge", "userReviewDate": "Dec 15, 2017", "userURL": "http://www.goodreads.com/user/show/1298254-inge", "userReview": "Drop dead gorgeous, poignant."}, {"userName": "Deana Metzke", "userReviewDate": "Jul 05, 2017", "userURL": "http://www.goodreads.com/user/show/10479125-deana-metzke", "userReview": "Although this was the perfect book to read on Independence day, it is a great book for any day. I already adore Kadir Nelson's illustrations, and these are definitely some of his best. There are not many words to this book, but the ones there are powerful. This book would be great for class discussions on poetry, word choice, and illustrations at any grade level."}, {"userName": "Erin", "userReviewDate": "Jul 05, 2017", "userURL": "http://www.goodreads.com/user/show/3561481-erin", "userReview": "A stunning tribute to the United States flag and to the United States of America itself. Aspirational."}, {"userName": "Karen", "userReviewDate": "Dec 29, 2017", "userURL": "http://www.goodreads.com/user/show/4794147-karen", "userReview": "Struck me as simply beautiful!"}], "description": "An inspiring and patriotic tribute to the beauty of the American flag, a symbol of America's history, landscape, and people, illustrated by New York Times bestselling and Caldecott-honor winning artist Kadir Nelson Wonderfully spare, deceptively simple verses pair with richly evocative paintings to celebrate the iconic imagery of our nation, beginning with the American flag. Each spread, sumptuously illustrated by award-winning artist Kadir Nelson, depicts a stirring tableau, from the view of the Statue of Library at Ellis Island to civil rights marchers shoulder to shoulder, to a spacecraft at Cape Canaveral blasting off. This book is an ode to America then and now, from sea to shining sea.", "title": "Blue Sky White Stars", "url": "http://www.goodreads.com/book/show/31626023-blue-sky-white-stars", "average": 4.46, "cover": "https://images.gr-assets.com/books/1482887688l/31626023.jpg", "reviews": 292, "authors": [{"url": "https://www.goodreads.com/author/show/6910732.Sarvinder_Naberhaus", "name": "Sarvinder Naberhaus"}, {"url": "https://www.goodreads.com/author/show/21345.Kadir_Nelson", "name": "Kadir Nelson"}], "type": ["Childrens", "Poetry", "Childrens", "History"], "outlinks": ["http://www.goodreads.com/book/show/31626023-blue-sky-white-stars", "http://www.goodreads.com/book/show/17299263-boom-boom", "http://www.goodreads.com/book/show/32333143-lines", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}