{"ratings": 29236, "userreviews": [{"userName": " Danielle The Book Huntress (Back to the Books)", "userReviewDate": "Feb 08, 2009", "userURL": "http://www.goodreads.com/user/show/1570669-danielle-the-book-huntress-back-to-the-books", "userReview": "[ The fact that she calls him when she's stuck in the elevator when she could only call one person is very telling.  (hide spoiler)]"}, {"userName": "Baba  ", "userReviewDate": "May 27, 2012", "userURL": "http://www.goodreads.com/user/show/4669232-baba", "userReview": "\"Haven, you know I'm right. Let's talk about this.\"\"If you don't want to have sex, I don't want to talk about our feelings.\"He scrubbed his hand through his hair, looking confused. \"Well, that's for damn sure the first time a woman's ever said that to me.\"\"I don't take rejection well,\" I muttered.\"It's not rejection, it's a postponement. And if Jack Daniel's makes you this ornery, I'm never pouring you another shot.\"\"It has nothing to do with the whiskey. I'm this ornery all on my own.\"\"Hardy,\" I said tentatively, \"would you…indulge me a little?\"A smile touched his mouth. He reached out and pulled the sides of the shirt closed, an used the backs of his fingers to stroke my cheek. \"A little,\" he said, \"or a lot. Just tell me what you want.\"\nAfter reading Brown-Eyed Girl, I feel I should be doing a reread of Blue-Eyed Devil.Will be editing my review."}, {"userName": "Geri Reads", "userReviewDate": "Sep 09, 2015", "userURL": "http://www.goodreads.com/user/show/11757728-geri-reads", "userReview": "I've been in a massive book hangover this week and I couldn't read anything new. Fortunately, this book got me out of my slump. Hardy Cates...\nHe's everything that a bad boy hero should be. He's gorgeous, rich, charming with enough vulnerability to make you fall in love with his character. He's strong and heroic and there's no doubt to his love and devotion for Haven. \nHaven Travis...\nDespite growing up rich and privileged, Haven's life is far from perfect. She made a really bad decision of marrying Nick who ended up abusing her physically and emotionally. My heart went out to her. I was kind of mad at her father for being so overbearing towards her. I honestly didn't feel that he loves her at all. Her dad had more time and love for Liberty and Carrington than Haven and that really upset me because she tried so hard to become the daughter he wants. I loved how her character evolved from being a frightened young woman to become a force in her own right. \nI loved all the side characters; Gage, Liberty, Jack, Joe...and Todd. Ms. Kleypas' writing is stellar as always. I mean, apart from not having Hardy's POV, this book is perfect. Loved it."}, {"userName": "♥Sharon♥", "userReviewDate": "Mar 23, 2015", "userURL": "http://www.goodreads.com/user/show/12125670-sharon", "userReview": "This is only my second book by Lisa Kleypas but I am here to say that I am really enjoying her books and I’ll be reading many more. I’m finding her writing to be so genuine. I don’t always end up loving stories that are told in the first person’s point of view but LK gives such a strong delivery and her stories are enticing and engaging. Blue-Eyed Devil was a bit of a surprise to me. I was preparing myself for all things Hardy Cates and yes I got that, but it was as much a story about Haven Travis too. When these two meet it was electrifying to say the least.\nIt was within the first 5% of the book that I fell in love with Hardy. Well if I have to be honest I fell in love with the guy in Sugar Daddy. He is sexy, sweet, a tad alpha and incredibly hot. He wasn’t an open book and I loved that. He brought the unexpected to the story.\nI wasn’t certain what to expect from Haven. Instantly I got this strong vibe from her. She was sassy, independent and beautiful. She was a Travis so there were certain things you assumed about her. This was something that she worked hard at keeping in check. \nHaven worked hard at being independent and more importantly independent of what her family represents. It isn’t that she doesn’t love them. She does. But her relationships with her mom and her dad were lacking of some the most fundamental things when it comes to parents. And when the life she had chosen begins to crumble and her marriage had became a dark place to be she found herself a completely broken person.\nIt took every last thread of strength that Haven had within her to reach out to her family. Gage was always the one she could turn to when she was growing up. He would be that person yet again. Gage and Liberty offered her that abiding love. And her brother Jack was so sweet too. But the one who breathed life back into her was Hardy.\nI absolutely loved Hardy and Haven together. There were so many sweet and tender moments. Their chemistry starts off strong, then lulls, then comes back full force. Hardy became Haven’s rock but I have to say Haven gave as good as she got. Hardy leaned on her for strength too. ❤\nThe Travis Family Series is pretty fantastic. I’ve already started Smooth Talking Stranger and I am enjoying it as well. If you haven’t read anything by Lisa Kleypas give this series a try. You will not be disappointed."}, {"userName": "Annie (Under the Covers Book Blog)", "userReviewDate": "Dec 30, 2010", "userURL": "http://www.goodreads.com/user/show/2489554-annie-under-the-covers-book-blog", "userReview": "Posted at  Under the CoversHer name is Haven. But it’s her last name that gets her noticed. Being the only girl in a family of men can be tough sometimes. With three overprotective brothers plus a meddling father, Haven has a difficult time finding a guy who can stand up to her family name, let alone her family. Haven falls in love quickly with a man who she thinks she knows. But, in the end, being married to Nick isn’t what she thought it would be.Blue-Eyed Devil  made me bawl like a baby. I’m not ashamed to admit it because it was such a rollercoaster ride. The events of this book shocked me and I couldn’t help but sympathize and go through various emotions. It was this part that seriously broke my heart:His arms closed around me tentatively, unlike his usual firm grip, and I realized he was trying to keep from hurting me. I felt the trembling beneath his stillness.Overwhelmed with relief I laid my good cheek on his shoulder.“Gage,” I whispered. “Love you more than anybody.”He had to clear his throat before he could speak. “Love you too, baby girl.”Haven was an amazing character. I loved her strength and courage throughout this entire book. Writing her character must have been difficult. Kleypas had to make her vulnerable and show her fear without making her become a spineless woman. In the end, I thought Haven still possessed that fire she had before she was with Nick and perhaps even more so when she was with Hardy.Hardy Cates is pure, undiluted lust. He’s just so masculine and sexually potent, it was no wonder Haven pounced on him when she got the chance! I don’t blame her. I liked that Kleypas kept his hell-rising personality. She’s good in that she doesn’t suddenly change a character’s personality now that he’s the hero of the book. Hardy is ambitious and he would do anything in his power to achieve what he wants, even it means selling people out. Kleypas didn’t erase his determination in this book and I’m glad for it. In fact, I think it made Hardy even more appealing, more sexy if that was even possible. The fact that he was so keen on having Haven, no questions asked, was a turn-on. Is it just me or does anyone else think that Kleypas writes the best heroes?I’m not sure if it’s the change in genre or if it’s the hero’s personality, but I find the sex scenes in her contemporary series a lot hotter than in her historical romance novels. My palms got sweaty a couple of times while reading this!A few friends have mentioned their everlasting love for this book, being one of their all-time favourites and I think that  Blue-Eyed Devil will be one of those books on my keeper shelf that will be bent and ripped from so many rereads. It was that good! I always fall in love with Kleypas’ books and this one was no exception."}, {"userName": "Shawna", "userReviewDate": "Mar 22, 2009", "userURL": "http://www.goodreads.com/user/show/1802746-shawna", "userReview": "5+ stars – Contemporary RomanceI wanted to read “Blue-Eyed Devil” because Hardy Cates seemed like such a sexy and magnetic bad-boy character. I mainly read “Sugar Daddy” in order to have the necessary background on him to read this, so color me surprised that I wound up not liking this as much as “Sugar Daddy”. Don’t get me wrong, Hardy Cates is everything I thought he would be and then some, but to me, this book is seriously inhibited by not having his point of view. It’s told strictly from the first person point of view of heroine Haven Travis, and she’s just no Liberty Jones folks. I thought this was Hardy’s story (I mean the title refers to him after all), but it’s actually Haven’s, and I just couldn’t get over being somewhat disappointed about that.I empathized with Haven’s painful ordeal: she endures domestic violence by her narcissistic husband, including a brutal rape (thank you Tammy and Kim for the warning), and I was moved by her struggle to survive the aftermath and to build a new life for herself. I just couldn’t relate to her, and the first part of the book was difficult for me to get through. When Hardy finally enters the picture and the sparks fly between him and Haven, that’s when things get interesting. Hardy is the ultimate bad-boy hero and impossible to encapsulate: he’s sexy-as-sin, devilishly charming, crude, arrogant, self-built and self-reliant, bold, flirtatious, and volatile. He’s so complex, and unfortunately without having his point of view, we never get enough insight into his thoughts, emotions, motives, and struggles and are left to wonder what’s really lurking behind his haunting blue eyes. Also, the story ended way too abruptly for me and when things were finally coming together, felt rushed and left me wanting more of Hardy and Haven, especially more Hardy! When reading about Hardy, I couldn’t help but daydream and do some imaginary casting. I kept picturing actor Josh Lucas from the movie Sweet Home Alabama or actor Josh Holloway, Sawyer from LOST, because both of them have the cocky swagger and sexy blue eyes.Overall, “Blue-Eyed Devil” is a great read and saved by Lisa Kleypas’s masterful writing. I just can’t help being a little disappointed because it had the potential to be even better with a beguiling character like Hardy Cates, but just doesn’t fully deliver without giving us his side of the story. We are left to ponder too much and he remains an elusive mystery, which is just a shame because damn, the boy is smoking H-O-T! Even so, it's a terrific story, and I can’t seem to rate it less than 5 stars.******Revised after finishing the series and completing a reread******After reading so many contemporary romances, this is still a favorite keeper and definitely worth a 5+ rating!"}, {"userName": "Alienor ✘ French Frowner ✘", "userReviewDate": "Feb 14, 2015", "userURL": "http://www.goodreads.com/user/show/31461418-alienor-french-frowner", "userReview": "•● I'm on the fence with this one, and I don't know what to do with my rating. I'm leaving at 2, because while the first part did a very good job at portraying home life abuse, I wanted to slap the men more often than not and the romance didn't work for me. That's going to be long, and it might involve a lot of cursing. Sorry about that.●•This book starts like a cheesy tale - Haven Travis, spoiled daughter of a Texan millionaire, marries the guy she loves more than anything, against the will of her powerful father. I know what you think, because I thought it too. How could this story start more cliché and cheesy? I trusted Lisa Kleypas. I was right, to a certain extend. ➸ Why? ▧ Because these days, when people tend to mistake a fucking controlling bastard for a protective guy, I want to throw this books into all my friends hands because that's one of the best portray of marital abuse I read in a contemporary romance. The first part of this book drove me mad - sick, even. I was so pissed - pissed as I WANT TO PUNCH THE FUCKING WALL. And the worst - do you want to know what the worst is? That's the fact I could almost UNDERSTAND why Haven could let her husband abuse her like this. No, that's not right, I rephrase : I could see how her mind was leading her this way, to fucking PLEASE him, the sick asshole.Yes, girls. Someone who wants to control you or hit you will say that's it's YOUR fucking fault. Because you're not beautiful enough. Careful enough. Skilled enough. There's a scene where he loses his shit because she didn't fucking IRONED her shirt well. Fortunately I have never experienced such awful relationship myself, but someone I care about had, and let me tell you, all starts with \nnothing\n. An event so unimportant you don't even realize that you have accepted something you didn't want too. You want to be loved but control isn't love. That's the OPPOSITE of it.▧ Apart from that? Why, wonderful story of lust between Haven and Hardy Cates after her divorce. As for big strong guy me want you, honey. Come in my cavern and I will protect and feed you. Okay, so as you guessed, I wasn't a fan of the romance between them because surprise!! THAT'S NOT A ROMANCE THAT'S SEXUAL TENSION UNDERLINED WITH SAVIOR COMPLEX.Oh, and casual sexism. Hardy, Hardy, Hardy. How could you disappoint me like this? I'm not gonna lie, I read this book for him. Why? Because I fell for his youngself in the beginning of Sugar Daddy, literally stopped reading it to discover his story while here, without being a bad guy, he failed to move me and made me cringe because SEXISM EVERYWHERE, INSTALUST, NEVER LOVE. Seriously, sometimes I feel like I'm an alien somehow, because I just can't take how men's behavior is portrayed. I mean, if I were a man, especially a Texan, I would be fucking pissed to see how sexist I'm shown. I MEAN GUYS ARE THEY REALLY LIKE THAT? JUST TELL ME. I'm starting to wondering but it must be freaking stereotypes, right? RIGHT? That's a shame because I love reading about love stories setting in different places and I consider myself as open-minded, but sometimes it seems that all that is throwing at me are stereotypes. That's so exhausting. I'm well-aware that stereotypes about men's behavior are everywhere, damn, I'm living in a country where men are supposed to be all players and romantic. Please.I guess I'm pissed on men's behalf here. And on Texan's behalf too. Because do you realize what 90% of my fellows know about Texas? 1) Walter fucking ranger and his commando2) Men are sexists and old-fashioned3) Georges BushYIKES. I'm sure there's more to know about Texas, no? Because sentences like that : \"Yes you are [brave]. Most women would be in hysterics by now.\" OH HELL. She was about to drown in an elevator for Pete's sake. Sorry to disappoint you, but most of men would be pretty hysterics too. Well, sentences like that piss me off. Of course he has his moments (a certain gift was adorable) and I don't hate him, far from it, but for me that seemed too similar to a New Adult book : the woman just lived hell and needs a big, strong, former manwhore man to save her? Hell no. Actually, Haven tries to stand for herself during the whole book, to emancipate from all the male figures who try to control her (her husband), to disrespect her personal boundaries (her brothers - of course, in order to help her, but still) and she falls in love with a guy like Hardy? Oh, give the girl a break. If their love story had been an actual love story, if they had done things together, learnt to know each other, I might have overtaken the full Texan mode but as it was, aka lust lust lust luuuuuust only I couldn't.There's only so much \"Oh. My. I want sex sex sex with Hardy\" I can take.Now, I didn't like Barrons you know, so maybe you won't agree with me ;)For more of my reviews, please visit:"}, {"userName": "Tammy", "userReviewDate": "Apr 13, 2009", "userURL": "http://www.goodreads.com/user/show/785960-tammy", "userReview": "Blue-Eyed Devil would have earned a solid 5-star rating from me if it had been written from Hardy Cate's point of view. Don't get me wrong - I liked Haven Travis. I sympathized with her during the abuse scenes with her narcissistic, whack-job of a husband. But Haven was not the sort of person I could see myself becoming friends with. In spite of all the horrible things that happened to her and the way she started to turn her life around, her character still smacked of the poor little rich girl cliche'. This chick had serious issues and needed more than a few months of therapy. I couldn't help thinking that her relationship with Hardy felt more like a rebound than happily ever after. The intensity and emotions packed into this book hit a little close to home and left me in tears at one point. Be forewarned that a rape takes place in this book (thanks Kim for telling me in advance!) I have worked closely with DV and rape victims - Kleypas seems to understand these issues almost too well and the feelings/thoughts associated with them. She is definitely the queen of evoking emotions. Great opening scene between Hardy and Haven tho. Loved it! Funny dialogue and a risque' situation that most girls dream of being caught in! (Or maybe it's just me?!) I only wish the next chapter had carried on this light-hearted romantic theme.I've said it before and I'll say it again - Hardy Cates is Kleypas's contemporary romance version of St. Vincent (Devil in Winter). Hardy does something absolutely rotten at the end of Sugar Daddy, but he manages to redeem himself in Blue-Eyed Devil. He is an uber bad-boy all the way and VERY HOT! I would have given anything to hop into this man's head. So in essence, the first person voice ruined this book for me. Now if only Lisa Kleypas would pull a Stephenie Meyer and re-write this book from the hero's perspective..."}, {"userName": "Carole (Carole's Random Life in Books)", "userReviewDate": "Apr 06, 2015", "userURL": "http://www.goodreads.com/user/show/5892196-carole-carole-s-random-life-in-books", "userReview": "This review can also be found at Carole's Random Life.5 Stars!I have been in love with Hardy Cates since I first met him way back in 2007 when I first read Sugar Daddy. The teenage girl that now occupies this old ladies body still swoons a little bit every time I even think about Hardy Cates as a teenager. Where were the boys like Hardy back when I actually was a teenager? Even when Hardy does something a little wrong, I can forgive him. When this book came out in 2008, I drove to my local Borders and grabbed a copy just as soon as they opened for the day. I loved it then and I still love it today. Just be aware that this review is not unbiased because it is nearly impossible to be unbiased when you are in love. Haven first meets Hardy at her brother Gage's wedding when she slips into the wine cellar. Haven thinks she has found her boyfriend, Nick, and things heat up really quickly. Once she realizes her mistake, they both move on with their lives. Haven knows that Nick is her future and she is willing to do whatever it takes to be with him...even if it means she is cut off financially from her wealthy father. The lack of money doesn't bother Haven as she tries to be a good wife to Nick. Nick becomes increasingly resentful and angry. Nothing Haven does is good enough for Nick. He doesn't care what Haven wants or what she thinks because the only thing that matters to him is himself. Haven eventually leaves Nick after he becomes abusive. She starts a new life with the help of her family. She starts working at a property management office for her brother, Jack. She soon crosses paths with Hardy once again. Her family warns her against Hardy but she takes a chance anyway.I was just as moved by Kleypas's description of the abuse that Haven endured as I was the first time I read the book. I think that she did a remarkable job of demonstrating how out of control Nick had become. I was frightened for Haven and wanted to take her away and protect her just like her brothers wanted to. Haven is strong. She asks for help when she knows that she needs it and then works to change the things in her life that she can change. Would I love Hardy as much as I do if I hadn't already read the first book in this series? I don't know and it is really hard to guess because I was already in love with him before this book started. Hardy listened to Haven and tried to be what she needed. The chemistry between Haven and Hardy is phenomenal. I am still trying to figure out how Haven ever pulled herself out of the wine cellar at the very beginning of the book. I like Haven and Hardy as a couple.I listened to the audiobook on this read through and I have to admit I had a hard time with the narration at the beginning of the story. I kept listening and starting liking the narration more and more and by the end of the book I didn't notice the narrator anymore because all I could think about was the story. I got lost in the story which is exactly what I look for in an audiobook.I would highly recommend this book to others. I would suggest that readers start with the first book in the series, Sugar Daddy, because it really gives a lot of background, not to mention it is an excellent book. I am planning to re-read the next book in this series very soon and can't wait to get my hands on a new book by Lisa Kleypas."}, {"userName": "Marisa Sauco", "userReviewDate": "Dec 12, 2016", "userURL": "http://www.goodreads.com/user/show/38002598-marisa-sauco", "userReview": "¡Me encantó la historia de Haven y Hardy! ❤️Los primeros capítulos son durísimos, pero me pareció impecable la manera en que la autora abordó la situación de Haven, con mucha altura y sensibilidad. Adoré a esta pareja, y a toda la familia Travis. ❤️"}, {"userName": "Brandi", "userReviewDate": "Apr 30, 2015", "userURL": "http://www.goodreads.com/user/show/5494655-brandi", "userReview": "4.25 Stars"}, {"userName": "Auntee", "userReviewDate": "Mar 27, 2008", "userURL": "http://www.goodreads.com/user/show/886675-auntee", "userReview": "[ (although I was a bit surprised that he paid his father to stay away from the family--I wouldn't have given him a dime). (hide spoiler)]"}, {"userName": "Didi", "userReviewDate": "Jun 26, 2013", "userURL": "http://www.goodreads.com/user/show/6082482-didi", "userReview": "Sometimes you come across a book that leaves you speechless. It leaves you empty upon finishing it because it was such a pleasure reading it.THIS WAS ONE OF THOSE BOOKS!Blue-Eyed Devil was my first LK novel and it left me wondering, agonizing, why it took me so damn long to read her work. She is a brilliant writer. BRILLIANT.She tells a story so evocatively, so intelligently it makes you wonder about other books you've read. I was amazed by LK's ability to use such descriptive language and witty dialogue in her writing.And for something so smartly written it was equally engrossing. Many people have read this book so I won't go into the plot, but I absolutely fell in love with it and the characters.The first half of the book dedicated to Haven's disaster of a marriage to an abusive brute was very frightening. The trauma and eventual erosion of Haven's self worth was felt so acutely by me it was scary. The breakdown of a marriage is something, but the breakdown of one's spirit in the face of the ultimate betrayal was something else entirely.I couldn't believe the experience Haven went through, always doubting her self and her mind. Nick was the definition of monster. He was brutal and savage in his treatment of her and I was hoping against everything she'd get out.The second half of the book we saw Haven healing and leaning on her family for support. That same support from Gabe and Jack even Liberty was astounding. Despite being cut off from them they were there when it counted and I loved seeing that.Now on to the good stuff! Hardy, Hardy, Hardy!!! The alpha male accentuated by being raised a Texan was incredible! He was the man of men, the alpha of the pack and I LOVED HIM.The opening scene at Gabe's and Liberty's wedding was so sensually raw and hot, it set a precident for both of them that finally came to fruition years later.I loved the excrutiating sexual chemistry, the no-holds-barred attitude of Hardy and their eventual coming together. Hardy's characterization was spot on as the blue-collar kid from the wrong side of the tracks that fed off ambition. He was the perfect man for Haven and she was the perfect woman for him.I can't express how much I loved this book! It had all the elements of a wonderful story without the plot being riddled with useless filler. That is the benchmark of a fabulous writer. LOVED IT!!Looking forward to the rest of this series and LK's other works!GENRE: Contemporary RomanceSTEAM: HighPOV: 1st person, HavenCLIFFY: HEA with Jack's story for the next book"}, {"userName": "Liz* Fashionably Late", "userReviewDate": "Jul 28, 2015", "userURL": "http://www.goodreads.com/user/show/8191214-liz-fashionably-late", "userReview": "*Unpopular Opinion Time*I find it hard to believe this was written by the same author, guys. Kleypas is a goddess, she knows how to write sexy times scenes and how to make you fall in love with her characters. Why one of those things was missing, escapes me completely.While Sugar Daddy was tragic and emotional, Blue-Eyed Devil is too predictable and beyond belief at the same time. It suffered from Tell, Don't Show syndrome. We read a lot about how amazing Hardy and Haven are together, but we don't get to actually see it. At least, not outside the bedroom. The dialogs seemed phony and if I read the word narcissistic one more time, I was gonna throw myself on a trap.The first half of this book was good enough, domestic violence was really well portrayed, not to mention the abuse and yet, I couldn't connect with Haven. Instead of a romance, you get a story of instalust, possessiveness and just two plain horny young people with daddy issues and a lot of money. Plot devices, elevator rescues, mistaking a stranger for your boyfriend, evil people with evil plans, the world against poor Haven!! Even the good 'ol Churchill was a total jackass. All it was missing was a big muajaja, seriously.And don't get me started on the healing sex! Barrons would be proud, ladies."}, {"userName": "Miss Kim", "userReviewDate": "Dec 21, 2008", "userURL": "http://www.goodreads.com/user/show/925549-miss-kim", "userReview": "Blue Eyed Devil was an awesome follow up to Sugar Daddy. I was disappointed that Hardy didn’t end up with Liberty in that one, especially after all of the background we get on him. Then he just leaves town, and comes back to pull a total a-hole move in order to get Liberty back. In BED, we get to know Haven, the youngest daughter of the Sugar Daddy, Churchill. She first meets Hardy at Liberty and Gage’s wedding and they have the classic moment. “Their eyes meet across a crowded room….causing heart palpitations and damp undergarments”. Later she follows a guy who she thinks is her boyfriend into a wine closet and makes out with him, and gets pretty darn close to closing the deal. Suddenly she realizes its not her boyfriend, Nick, but Hardy instead. I do find it hard to believe you can be making out heavily with someone and not know its not your intimate partner. Not by his smell, the way he kisses, the size of certain things? But it’s a novel, and I chose to believe it at this moment, anyway. She leaves the closet and doesn’t see him for a few years.She marries, Nick, a total a-hole who abuses her progressively until he ends up beating the shit out of her and then eventually raping her and leaving her to die. It’s pretty brutal.She gets away from Nick and reconnects with her family, and ends up running into Hardy again. He remembers her too, and starts to pursue. He has no idea what she’s been through. She’s very attracted to him, but doesn’t want a relationship. She’s trying to change herself, and not let her brothers, father, boss, run her life and make decisions for her. I felt Haven grew throughout the book, and of course fell for Hardy big time. His eyes are mentioned so much, I started to picture his eyes like young Paul Newman. Her ex shows up the picture again creating added strain and danger. I don't want to give anything else away. I was happy with the HEA, and I know you will be too.Warning: There is spousal abuse, and a rape scene that may be uncomfortable for some readers."}, {"userName": "Ronyell", "userReviewDate": "Sep 02, 2012", "userURL": "http://www.goodreads.com/user/show/1169488-ronyell", "userReview": "Wow! Can I officially say that “Blue-Eyed Devil” by Lisa Kleypas has now become one of my top contemporary romance novels of all time next to “Kiss An Angel?” “Blue-Eyed Devil” is the second book in Lisa Kleypas popular “Travises” series and this time, it stars the sister in the family, Haven Travis and the former bad-boy, Hardy Cates! “Blue-Eyed Devil” is a truly mesmerizing book that has drama, secrets and forbidden love rolled into one novel!Haven Travis is the only sister in the famous and filthy rich Travis family and she is known to have a mind of her own. However, when Haven ends up marrying a man named Nick who she believed was her true love only to discover too late about his abusive ways, she believes that she may never find true love ever again. However years later, Haven meets Hardy Cates, her sister in law Liberty’s former love interest and enemy of her family and she will soon discover that not only does she start developing feelings for him, but she will soon uncover his dark past that will change her world forever.Oh my goodness! This book really set my heart up in flames! “Blue-Eyed Devil” is certainly a huge improvement from the first book Sugar Daddy as we get to learn more about the characters in this book (especially about Haven Travis!) Lisa Kleypas has done a brilliant job at developing a story that was quite unusual for any romance novel, but was still able to produce enough drama and romance that really made my heart flutter! What I mean by how this novel was quite unusual for a romance novel is that the story starts off with Haven being abused by her former husband Nick and this was the first romance novel that I had read that dealt with the subject matter of domestic abuse and it really made this story much more relatable to any reader who had also suffered through domestic abuse. I also loved the fact that Lisa Kleypas provided facts and helpful websites that would help the reader really understand the nature of domestic abuse and how to deal with them, which really helped me understand more about domestic violence. Now, onto the characters of this book! Haven Travis was just an amazing heroine throughout this book as she had to go through domestic abuse caused by her former husband and for awhile, she could not trust anyone with her issues and was afraid to get close to any man she had contact with. I actually found myself sympathizing so much with Haven’s situation as domestic abuse happens so much in real life and I was hoping throughout this story that she would find someone who can truly understand the horror she been through and be able to heal her pain. I also loved the way that Lisa Kleypas made Haven Travis into a strong and independent woman as she may have suffered through a terrible ordeal, but she still tries to move on with her life. Now, I am going to start getting all flirty whenever I am talking about Hardy Cates, the hero of the story, since he has become one of my most favorite romance heroes of all time! Hardy Cates has come a long way from the first book “Sugar Daddy” as he was Liberty’s former love interest and had become an enemy of the Travis family after his stunt in “Sugar Daddy.” However, Hardy Cates was probably the best character in this book as he may be the dangerous and sexy bad-boy that people would warn you to not get near, but he truly shows how much he cared about Haven and how he tries to help her through the ordeal she went through. Also, it would not hurt to mention that the fact that Hardy Cates is muscular, large and sexy all around just really makes me feel all giddy inside!Since this novel discusses about domestic abuse and gives vivid detail about the abuse that Haven has suffered at the hands of her former husband, some readers who do not like reading about such subject matter might feel a bit uncomfortable reading this novel and they might want to see if they can handle such subject matter before reading this book. Also, this book has many scenes that detail explicit sex and they might want to skim over these sex scenes if they feel uncomfortable about them.Overall, “Blue-Eyed Devil” is definitely one romance novel that you have to check out and I am definitely looking forward to the next book in the “Travis” series Smooth Talking Stranger! Review is also on: Rabbit Ears Book Blog"}, {"userName": "Amy (Foxy)", "userReviewDate": "Dec 10, 2013", "userURL": "http://www.goodreads.com/user/show/9955253-amy-foxy", "userReview": "♦ ALL I WANT IS YOU ♦ JUST ONE LITTLE TRAVIS ♦Blue Eyed Devil starts off with Liberty and Gage’s (Sugar Daddy) wedding.  Hardy party crashes the wedding where he and Haven notice each other and their attraction is undeniable. \nThis is Haven and Hardy's love story.\n It wasn't an easy relationship because Haven makes a mistake by marrying Nick. Nick's true colors show once he is married. He inflicts spousal abuse upon Haven. After one horrible event Haven escapes back to her family. In the beginning of Sugar Daddy Hardy was a sweetheart but by the end of the book I didn't care for him. I wasn't sure I would like this story because of Hardy. I was pleasantly surprised that I loved it. Hardy really steps up and redeems himself. He is just what Haven needs to get on with her life. SERIES:\n\n\n\nContinuing story where secondary characters from the first book become the main focus in subsequent books. Book 1 - Gage Travis | Book 2 - Haven Travis | Book 3 - Jack Travis | Book 4 - Joe Travis"}, {"userName": "Stacey is Sassy", "userReviewDate": "Jun 06, 2018", "userURL": "http://www.goodreads.com/user/show/12062194-stacey-is-sassy", "userReview": "Hardy...a Devil???It's not too often that you come across a contemporary romance author that can write a timeless book. Now, 2008 probably doesn't seem that long ago, but you would be surprised how quickly a book can seem out of date. Terminology, slang and modern technology changes quickly, daily even. I know in my own experience that my teen boys seem to even speak a different language to me. I've even had to translate hand-written notes for workmates because the cursive has changed so much in the twenty years between our schooling. Sure, some of the things we witness in Blue-Eyed Devil seem a little behind the times, but I think it had more to do with the characters than the times.Haven was a bloody idiot. OK, that's probably a little harsh. I just found myself completely frustrated with her when she allowed herself to be mentally and physically abused. I know, I know, bad Sassy for being so judgemental and narrow-minded. I just can't see myself EVER putting up with what she dealt with and it wasn't just at the hands of her despicable husband. I could write a list and a ten-page essay on all the douchewaffles she's faced in her life. I guess those little hits to the self-esteem in your childhood really do leave you with permanent scars.I have to admit that this was a LOT more emotional than I expected. I kind of wish I'd known how much before I decided to listen to the audio on public transport. No sunglasses, a train carriage full of blokes...it was not a pretty sight. There were plenty of highs and lows that kept me a bit of an emotional wreck through this one. Mind you, it was never OTT or made me want to discontinue. It was just a wee bit confronting. I felt like I was there, with my hands tied behind my back and my screams of warning falling on deaf ears. I sometimes hate feeling helpless...I get way too \"into\" my books.Now, the narrator, she does a very...ah...Southern accent with a twist (quoting Wikipedia). I almost needed an interpreter at times and even had to replay it to catch the meaning. As I'm not from Texas or even America, it took a little more effort listening. Please excuse my ignorance if I got that all wrong. Let's just say that I knew it was a Southern accent, I'm just guessing that it was Texan.After all that, the highlight for me was Hardy Cates. Oh boy, he made my heart flutter. A bad boy who was just waiting for the right woman to come into his life. Sure, he had his fun until she was ready, but boy does he use his experience well. Honestly, considering the characters in his midst, he was far from a devil. I think this story should have been called - Blue-Eyed...Sexy, Bossy, Dirty-talking, Bad Boy, with a heart of gold and a magic touch. But, obviously, that's a wee bit too long.Lisa Kleypas is a bit of a legend. I am a HUGE fan of her historical romances but her contemporary romances are nothing to laugh at. If I had my way, she would write morning, noon and night and alternate between the two. Pretty please with sugar on the top.I highly recommend Blue-Eyed Devil and will definitely be going on in the series."}, {"userName": "Sam (AMNReader)", "userReviewDate": "Nov 04, 2017", "userURL": "http://www.goodreads.com/user/show/67310619-sam-amnreader", "userReview": "[ Or there is the scene where she's drowning in an elevator and Hardy comments no woman would handle it like she did without being hysterical. Oh, swoon. No woman huh?  (hide spoiler)]"}, {"userName": "Irene Sim", "userReviewDate": "Feb 20, 2017", "userURL": "http://www.goodreads.com/user/show/31914348-irene-sim", "userReview": "The second time reading this story I enjoyed it even more. Somehow I noticed more details about the two protagonists, Hardy and Haven, that I missed the first time. This story is about two people who don't know their designated place in life, so they drift wherever the wind takes them, persuing random avenues and finally finding their place in it's other's arms.Hardy Cates is for me (and I guess for whichever read Sugar Daddy) a repressed desire. He may acted like an asshole in the end of that book but I deffinitely wanted a HEA for him. Maybe Liberty wasn't his destiny but Haven surely is. What did the trick for me was the first scene of them in the wine cellar. This intimate meeting of them, without knowing each other, extricated any doupts I might have about Hardy's intentions or emotions for Haven, after he learned her name and who her family is. Their journey to each other isn't an easy one, Haven has made some bad choices in her life for which she paid in tears and blood, but I think it was necessary for her to become the strong woman she is in the end of the book.In the other hand, we witness Hardy becoming as uncertain about himself as any man can be when he finaly finds the person that matters the most in his life, and that weakness made him even more perfect for me.This series is so far great, Lisa Kleypa's writing is impecable as always, drawing all kind of emotions from the reader and if you love contemporary romance then these books is a must-read."}, {"userName": "Wendy", "userReviewDate": "Aug 31, 2011", "userURL": "http://www.goodreads.com/user/show/4485620-wendy", "userReview": "What can I say? I've been sucked in, into the wonderful world of the pure bliss that LK has created. Alpha males that are just too good to be true and wonderful heroines. This is my favorite, so far. Hardy you are a gem and you have found a beautiful heroine in Haven, who is such a sweetheart. A special thanks to Karla, for providing this wonderful image of Hardy, that is just sublime. Thank you my friend, it really enhanced my reading experience. *waggles eyebrows*Hardy Cates\nThanks again Karla, for letting me borrow your husband's pic! *giggles*All in all this is a series, that has me besotted! Love it!"}, {"userName": "Eliza", "userReviewDate": "Sep 12, 2015", "userURL": "http://www.goodreads.com/user/show/15220898-eliza", "userReview": "Rather than berate myself for taking so long to read this, I'm glad to have finally succumbed to the awesomeness that is Lisa Kleypas."}, {"userName": "MelissaB", "userReviewDate": "Apr 14, 2009", "userURL": "http://www.goodreads.com/user/show/1320046-melissab", "userReview": "Loved it! The story just grabbed me from the beginning and kept me entertained the entire time. Hardy Cates is such a hot, sexy hero! Haven was a bit harder for me to identify with than Liberty was but I still liked her. Her horrible relationship with her ex-husband was hard to see but at least she was able to get out with the help of Her brother Gage who was wonderful in this book too. I enjoyed seeing more of Liberty, Gage and Carrington.Hardy was a wonderful hero, he was very patient and kind to Haven with her lingering issues. I wouldn't have minded seeing even more of their relationship but at least this book had a lot more romance than Sugar Daddy. Blue Eyed Devil is getting five stars from me for a great story, a good romance and one of the sexiest, most wonderful heroes I have read about!"}, {"userName": "Jill", "userReviewDate": "Nov 23, 2011", "userURL": "http://www.goodreads.com/user/show/3820197-jill", "userReview": "4.5 starsSugar Daddy the first book in the Travis series is great and 4 stars for me. But Blue-Eyed Devil book #2 is brilliant. The first-person narrative from heroine Haven's point-of-view works well here, as it did in Sugar Daddy from Liberty's pov. Although I loved this story a little more, it's still a toss-up as to my favourite hero - Gage or Hardy - and my favourite heroine - Liberty or Haven.One thing that Lisa Kleypas manages better than almost any other author, is an authentic, completely believable male voice. I love her men that she creates. Real men who can, and do say some incredibly sweet things, yet remain definitively, unmistakeably male. As Todd says of Hardy -“You know what it is you smell on him, Haven? Testosterone. It's leaking out of his pores.”4.5 stars"}, {"userName": "Chan", "userReviewDate": "Apr 02, 2018", "userURL": "http://www.goodreads.com/user/show/48867675-chan", "userReview": "Guess what my Dear GR Friends. I skipped book 1Shocking, I know. BUT I HAD TO. I was prepared to read Sugar Daddy. I ordered the book and was excited when it came in the mailBut then one of you posted a review and mentioned an in depth love triangle. I’ve been trying to read it for months, but I haven’t even parted the pages. So, I’m giving the book away. That brings us to book 2 Blue-Eyed Devil.It was clear from the outset that I was missing something, but whatever. It was a decent read. I think Haven was suffering from Savior Complex syndrome because the romance felt forced. Also, the intimacy was uncomfortable to read in some sections. And then Haven’s job stuff was too much. Hardy might as well wrap her in bubble wrap and lock her in a padded room so nothing else bad can happen to her.I’m glad I finally read a Travis book, but I won’t continue with the series."}, {"userName": "Jo", "userReviewDate": "Nov 06, 2012", "userURL": "http://www.goodreads.com/user/show/14323468-jo", "userReview": "“Who are you?\"\"For you, honey . . . I'm trouble.\"\n Haven Travis comes from money, but she refuses to let it dictate her life. She’s never been the daughter her parents wanted, no matter how hard she tried to be, so she stopped trying. And when her family disapproves of the man she loves, she marries him despite her father’s ultimatum. Unfortunately her family was right, and the man she married was not who she thought he was. And now it’s two years later, and Haven has finally escaped and divorced her monster of a husband, and she’s determined to get her life back on track, and to never again trust her heart to any man, especially not to the enemy of her family, Hardy Gates.  Hardy Gates comes from the wrong side of the tracks. With ambition and determination he has become a millionaire and made a name for himself in the oil industry. Nothing stops him from getting what he wants. And when he sees Haven again after two years, and realises she’s finally single again, he makes his move, determined to have her in his bed.  \n\n\"I'm not a gentleman,\" he went on, gripping my body, his breath hot on my skin. \"I can't get you into bed with fancy words or nice manners. All I can tell you is that I want you more than I've ever wanted a woman. I'd break any law to have you. If you'd gone with me that night we met, I would have taken you to Galveston and kept you there for a week. And I'd have made sure you never wanted to leave.\" \n\n Is Haven doomed to trust the wrong man again, or has fate given her a second chance with the right man?  \nBut everything was different with Hardy. His love came with no strings attached, which I thought was the greatest gift one human being could give to another. \n Haven is kind, stubborn and sweet. Her gentle nature made her easy prey for bullies and narcissists, just like her ex-husband. My heart broke for the awful things she endured at his hands, and how much damage he did to her esteem. She thought she was broken, but instead she was so very brave by getting help, learning to put boundaries in place with her over-powering family and standing up for herself. Brave enough to take a risk again by being with Hardy.  \n “I love you enough to try and deserve you. I would do anything, be anything, for you.” \n Of course I loved the sexy Hardy. I loved how different he was with Haven, so sweet, patient and lustful ;-D I loved how hard he pursued her, and how he had never felt about any woman the way he felt about Haven. And how protective and possessive he was over her!  \n\"What do you want, Haven?\"\"I want you,\" I burst out, and the tears spilled over again. \"But I can't have you.\"Hardy moved closer, gripping my head in his hands, forcing me to look at him. \"Haven, sweetheart ... you've already got me.\" \n The romance was so wonderful. I loved their intense chemistry, now and two years ago, and how good they were together. He made her stronger and feel safe and desirable, and she gave him peace like he’s never been able to achieve before. The sexy times were very hot, and I adore that he’s a face-holder while kissing, that is like catnip to me ;-) Both have survived such terrible things, and it was wonderful to see them get their HEA together.  \nNo person has the right to bully, slander, or control someone else. No person has the right to diminish or harm another person in any way. \n I’m such a huge fan of this author. She’s my favorite HR author, but her contemporaries are equally wonderful. And I loved this book, the wonderful romance, but also the deeper issues she touched upon. A must read for all romance lovers."}, {"userName": "Leah", "userReviewDate": "Mar 28, 2010", "userURL": "http://www.goodreads.com/user/show/3050338-leah", "userReview": "As far as Lisa Kleypas's contemporary romance series goes, Blue-Eyed Devil was much better than Sugar Daddy. You can tell with this book that LK was starting to get used to writing contemporary romance, as opposed to historical romance; BED was less a coming of age story and more a centered on the romance. I still can't definitively come to terms with the fact that the book is in first person as I wish that I could have seen some of the story from Hardy's point of view (perhaps his encounter with his father, please?), but this was still a fantastic book.After a one-time erotic encounter with Hardy Cates at Liberty and Gage's wedding, Haven Travis runs off with her boyfriend, Nick, to get married. What she didn't know when she committed to the relationship was that Nick had narcissistic disorder and was verbally, mentally, and physically abusive, including rape. When he throws her out after a particularly abusive night, Haven has finally had enough and walks to the nearest grocery store where she calls her oldest brother, Gage, to come get her. With the help of Gage, Liberty, and her brother Jack, Haven starts getting her life together again.When she meets Hardy Cates again, she is pulled again into his snare once more. He does everything he can to get close to her and eventually succeeds, at first becoming friends and then lovers...well, almost lovers. Turns out, she gets freaked out when she can feel Hardy's hard-on because it makes her think of that last night when Nick brutally raped her. After an uncomfortable encounter with Nick in her apartment, Haven finally tells Hardy everything about her abusive marriage and he helps her discover the joys of sex. From then on, they are together.At least until Hardy has an \"enlightening\" encounter with his father and takes a deal that Churchill Travis and his friend with him, meaning he had to cut off all contact with Haven. A few days later, though, he sees the errors of his way and backs out of the deal, saying that Haven is more important to him. When he comes to Haven's apartment to talk to her, he walks in on Nick holding a gun on her and trying to rape her again. When Nick notices Hardy, he shoots him but Hardy is running on adrenaline and beats Nick to a pulp. Haven calls 911 and Hardy is taken the hospital; when he wakes up later, they are finally able to express their love to each other and Hardy proposes. A year later, Hardy and Haven are still blissfully happy together and trying for a baby...Honestly, in the beginning, I was completely irritated by Haven; I know I'm might come off as a bitch for saying this, but I couldn't believe that she was so clueless that there was something wrong with Nick, not herself. However, I later felt bad for that feeling because I know that the victims often blame themselves in situations of abuse, and Haven probably couldn't help it. I was ecstatic, though, when she finally got up the nerve to leave the fucker and call Gage to get her. Aside from that, I really liked Haven. She was a caring person who went after what she wanted, despite her family's disapproval. I thoroughly enjoyed her relationship with Hardy and I was glad when she finally overcame her jealousy towards Liberty. Of the two girls, though, Haven is probably my favorite.I already loved Hardy when I started this book, but by the end I was in love with him. My life will never be the same without him. I liked that he was ambitious but I loved that he was able to apologize to Gage for how he ruined Gage's biofuel deal in the previous book. I loved his relentless pursuit of Haven and it made me wish I was her (without all the abuse, of course). I was heartbroken when he believed that he could be like his father, a serial rapist, and when he \"broke up\" with Haven, but the break was mended a bit when he realized that Haven was more important to him than anything else. Needless to say, I look forward to hopefully seeing more of Hardy in Smooth Talking Stranger.I loved the way Blue-Eyed Devil sort of set up the scene for the next book about Jack. Because, while I liked him in Sugar Daddy, I actually became interested in his life in this book. I look forward to reading Smooth Talking Stranger and reading more about this bad boy player being brought to his knees.Oh! And another person besides Nick who drove me absolutely insane? Vanessa! The conniving bitch! I was so glad when Haven finally stood up to her and that Jack heard the whole conversation and fired her ass!As per usual, Lisa Kleypas has produced a wonderful read, and I cannot wait to continue the series with Smooth Talking Stranger."}, {"userName": "Beanbag Love", "userReviewDate": "Feb 13, 2011", "userURL": "http://www.goodreads.com/user/show/2598237-beanbag-love", "userReview": "Four and a half but rounded up for making me cry. This definitely has a better, more organic through line and ending than Sugar Daddy. It didn't start out as wonderfully (I really loved Liberty's coming-of-age in SD), but the story was engaging throughout. I loved Hardy and Haven as a couple. I thought their chemistry was great. I was plagued slightly with doubts by the way SD made Hardy so smarmy at the end, but he redeems himself well here. I wasn't sure I was going to like Haven as a romantic lead after being introduced to her in Sugar Daddy, but her story is very poignant and absorbing. Yes, it was a bit didactic, which seems to be a theme for these contemporaries. I'm not a fan of that particular trend, which is why it loses a half star, but she's a little better at it than most. While it's \"in your face\" it's at least more of a throw pillow effect than a sledge hammer, so it's forgivable.I've seen mixed reviews of Kleypas's contemporaries which is probably why I put off reading them for so long (that and the HC/Kindle ripoff price tag). But I bought these at the UBS and I'm so glad I dove in. As always, Kleypas delivers a romance that's satisfying and lovely and leaves me with a smile."}, {"userName": "Nat O", "userReviewDate": "Apr 29, 2012", "userURL": "http://www.goodreads.com/user/show/9151051-nat-o", "userReview": "ALL-TIME FAVORITE!!! Prepare yourself for one of the best books you will *ever* read. This story has the most memorable opening scenes. There are so many facets to this treasure of a novel. You really feel the heroine's struggle with abuse & trust. This book made my heart race, made me cry and definitely made me smile. This is hands down one of my all time faves. Haven Travis & Hardy Cates first meet each other at her brother Gage's wedding on the grounds of her ultra-wealthy family's Texas estate. A mistaken kiss in a wine cellar throws Haven for a loop.Despite the mind-blowing kiss, Haven Travis is an engaged girl determined to marry her college love & fiancé Nick--despite her father's disapproval. But this marriage takes a dramatic turn.Almost 2-years later, she finds herself back in her hometown and faces the one man who's never left her mind, who's just so happens to be her family's enemy.Hardy Cates,  The Blue-eyed Devil, is a self-made oil mogol. Growing up in a trailer park, he has always been determined to succeed. His childhood friend & once love interest, Liberty is now married to one of his oil rivals Gage Travis. But it's Gage's little sister who has now captured his attention. But Haven's scarred past just maybe too much for her to open herself up & trust once again. LOVE, Love Hardy!  He IS the *ultimate* hero. *This is my most re-read book.* As a major Kleypas fan, she truly outdid herself with this one!**Updated review, read April 27, 2012***"}, {"userName": "Diana~ (Kiss Me Books)", "userReviewDate": "Aug 02, 2010", "userURL": "http://www.goodreads.com/user/show/3809774-diana-kiss-me-books", "userReview": "If you must know, there were quite a few people that I wanted to strangle while reading this book. Two of these people were Nick, Haven's ex husband, and Vanessa, Haven's boss. God, these two people made me so mad because they kept on abusing Haven in every single way. But nonetheless, they both got the ending that they deserved and I am happy for that! It definitely took me awhile to finally read Blue-Eyed Devil by Lisa Kleypas, and I'm really glad that I did. Even if I did read the series out of order... meh. I must agree with other reviewers that this book seems to be more of a chick-lit then a contemporary romance; but it's all good. Although I didn't exactly find the first person POV comforting at all, sadly. I think the book would have been better if it was either from Hardy's POV or even third person.Let's talk about the situation that happened to Haven that made me cringe, shall we? Wow, it was definitely one emotional roller coaster of a ride and I congratulate Lisa Kleypas for pulling it off. Throughout the entire book, I kept on thinking that Hardy had some kind of ulterior motive... but apparently that wasn't the case so I was slightly a bit disappointed. Don't get me wrong, I liked him but the relationship between he and Haven just clicked too fast and easy? At times, I felt that Haven was just too innocent and it was frustrating. Their relationship wasn't exactly realistic in my opinion, but I did like the outcome of it because they both had great sparks with each other!Overall, I did like this book but it wasn't exactly my favorite from Lisa Kleypas-- even if I did give it a 5 star. Sure, the making love scenes were hot and the sexual tension was off the charts... but I loved Smooth Talking Stranger even more. Either way, it was still another great book by this amazing author!"}], "description": "MEET THE BLUE-EYED DEVIL - His name is Hardy Cates. He's a self-made millionaire who comes from the wrong side of the tracks. He's made enemies in the rough-and-tumble ride to the top of Houston's oil industry. He's got hot blood in his veins. And vengeance on his mind.MEET THE HEIRESS - She's Haven Travis. Despite her family's money, she refuses to set out on the path they've chosen for her. But when Haven marries a man her family disapproves of, her life is set on a new and dangerous course. Two years later, Haven comes home, determined to guard her heart. And Hardy Cates, a family enemy, is the last person she needs darkening her door or setting her soul on fire.WATCH THE SPARKS FLY....Filled with Lisa Kleypas's trademark sensuality, filled with characters you love to hate and men you love to love, Blue-Eyed Devil will hold you captive in its storytelling power as the destiny of two people unfolds with every magical word.", "title": "Blue-Eyed Devil\n      \n          (Travises #2)", "url": "http://www.goodreads.com/book/show/1756703.Blue_Eyed_Devil", "average": 4.21, "cover": "https://images.gr-assets.com/books/1311990880l/1756703.jpg", "reviews": 1583, "authors": [{"url": "https://www.goodreads.com/author/show/27847.Lisa_Kleypas", "name": "Lisa Kleypas"}], "type": ["Romance", "Romance", "Contemporary", "Womens Fiction", "Adult"], "outlinks": ["http://www.goodreads.com/book/show/1756703.Blue_Eyed_Devil", "http://www.goodreads.com/book/show/8121949-blue-eyed-devil", "http://www.goodreads.com/book/show/6241533-blue-eyed-devil", "http://www.goodreads.com/book/show/11099099-blue-eyed-devil", "http://www.goodreads.com/book/show/2317267.Blue_Eyed_Devil", "http://www.goodreads.com/book/show/7843590-el-diablo-tiene-ojos-azules", "http://www.goodreads.com/book/show/7174378-blue-eyed-devil", "http://www.goodreads.com/book/show/7113370-blue-eyed-devil", "http://www.goodreads.com/book/show/6376291-blue-eyed-devil", "http://www.goodreads.com/book/show/693016.Mine_Till_Midnight", "http://www.goodreads.com/book/show/114166.Devil_in_Winter", "http://www.goodreads.com/book/show/114162.Secrets_of_a_Summer_Night", "http://www.goodreads.com/book/show/827412.It_Happened_One_Autumn", "http://www.goodreads.com/book/show/306364.Sugar_Daddy"]}