{"ratings": 1273, "userreviews": [{"userName": ".Under the pages", "userReviewDate": "Oct 24, 2017", "userURL": "http://www.goodreads.com/user/show/40494464-under-the-pages", "userReview": "Review available at Under the Pages."}, {"userName": "SueBee★bring me an alpha!★", "userReviewDate": "Aug 06, 2017", "userURL": "http://www.goodreads.com/user/show/15735368-suebee-bring-me-an-alpha", "userReview": "LIVE! | AMZ US | AMZ UK |CARTER KINCAID WILL PROTECT RAVISH HER BODY!Stand-aloneLIVE! | AMZ US | AMZ UK |Blurb: Emily enjoys all the perks of fame—the parties, the glamour, the tours—but they’ve brought her back to the attention of a dangerous ex-boyfriend hell bent on getting her back.Enter Carter Kincaid, a bodyguard so crushingly sexy he takes her breath away.Carter’s the best in the business and Emily is—professionally speaking—off-limits. But when it comes to stirring his desires, she’s hitting all the right notes. What’s happening between them is so hot it could get both of them burned. As Emily’s past gets closer, Carter is willing to break every rule of the job to save her. But letting Emily into his life also means letting her in on the secrets of his own past. For both of them, falling in love could be the greatest risk of all.Books in the Hollywood A-List series are stand-alones:Book 1: BombshellBook 2: Bodyguard"}, {"userName": "Sabrina", "userReviewDate": "Nov 02, 2017", "userURL": "http://www.goodreads.com/user/show/18085807-sabrina", "userReview": "NOW LIVE!Amazon US * Amazon UK 3.5 StarsBodyguard is the second book in C.D Reiss' Hollywood A-List series but can be read as a complete standalone. The book follows Emily, a choreographer for her best friend, and the bodyguard assigned to her when it becomes apparent that her ex isn't going to leave her alone. Carter is all about the job, focused and hardworking he's not one to fool around when he's protecting someone. But when he's with Emily she's the only thing on his mind and makes him want to break all the rules.Carter was the most intriguing character from this book for me. We learn early on that his life isn't as carefree as he wants people to believe. His life wasn't a secret exactly but there were a lot of unknowns about him that had me itching to get more. I liked that he brought some mystery to the story that held my attention. What brought my rating down to 3.5 was the fact that we had Carter's mystery life going on, mixed with Emily's ex and it all got to be a little too much for me. I didn't get a feeling of satisfaction with either by the end of the book and I felt like some things should have been focused on at least a little more than they were.Overall though I did enjoy the chemistry between Emily and Carter, and that hint of mystery really had me captivated by these characters. I would definitely recommend this book and can definitely be read without reading the first in the series. ARC kindly provided in exchange for an honest review."}, {"userName": "Megan✦❋Steamy Reads Blog❋✦", "userReviewDate": "Oct 24, 2017", "userURL": "http://www.goodreads.com/user/show/25781525-megan-steamy-reads-blog", "userReview": "“He appeared like a white knight, unshaven, unshowered, ready to do battle for the people he loved. He exuded manliness and safety, like a king swearing to protect the realm.It was a beautiful thing and yet, troubling. I didn’t know where my place was in his kingdom, or if I wanted a place in it at all.”\n\n CD Reiss is one author I have been meaning to read for a while now. I generally enjoy my Hollywood based love stories and the synopsis sounded really interesting with the whole stalker aspect and the bodyguard, who would risk his life to save hers… how could I not jump on this bandwagon? Emily and Darlene are the ultimate BFF’s and have been since childhood; they met during gymnastics camp and bonded over their love of singing and dancing instantly. They both had the same dream, being a singing and dancing superstar. They both moved to LA to ‘make it’ and had the same auditions, the same agent and also were a duet at one point. Unfortunately for Emily stardom was not to be. When she started a relationship with a really possessive and jealous guy, she decided to give up her dreams, as he didn’t like people staring at her and did not like her in the spotlight. She made the hard decision to move behind the scenes and use her talent to choreograph dance routines for Darlene instead. Sick and tired of being weak and insecure Emily ended the relationship. Ending the relationship was just the start of Emily’s problems as he became a crazy stalker. Darlene is about to go on tour and everyone, including Emily, is busy preparing for the upcoming shows, so they have decided to hire added security… Enter sexy as sin bodyguard Carter. Carter is an ex-LAPD, tall, dark, handsome and mysterious guy and is the most beautiful man Emily has ever laid eyes on. Their connection and attraction towards each other was instantaneous and they literally could not keep their eyes off each other. The way the two would steal glances of each other across the room was too cute and they seemed to quickly understand each other. I knew it was only a matter of time for Emily and Carter to give in the growing attraction. The mystery and anticipation of the crazy stalker ex kept me on the edge of seat along with the man who was hired to protect her made me positively swoon. The story was fast-paced and well written with interesting characters, secrets, twists and turns that will keep you enthralled, entertained and flipping those pages as quick as humanly possible. I absolutely recommend you one click this one if you love your hot, single dad, protective heroes and you’re heroines who find their way and become stronger when you least expect it."}, {"userName": "Wendy'sThoughts", "userReviewDate": "Sep 26, 2017", "userURL": "http://www.goodreads.com/user/show/17755575-wendy-sthoughts", "userReview": "4.5 Needing to Break Free Stars* * * * 1/2 Spoiler FreeOk, Stop Right There...Yes, it is hard not to breakout in song and sing the chorus of the Dolly Parton/ Whitney Houston theme...But Don't! This book is not your average Bodyguard deal. There are twists which start from the beginning and continue throughout. The main theme, in my mind, is not the obvious... There is more than the watching out for the \"Target\" and then getting involved with said Target. No... there is the close inspection of what is taken from people when they have the intrusion of the loss of freedom...Freedom to go for a walk...Freedom to pursue a career you were meant to have...Freedom to just breathe and not be concerned of what others are doing around you....And what is very interesting in this tale is the fact that the desire for freedom and norm of privacy is coveted by both the Target and Bodyguard...and we see the impact of this need and how it plays out for the both of them. So, if you love a romance against all odds...and the layering of what is right and wrong, some major suspense and secondary characters who deserve their own stories...then this is for you. I'll even let you sing that song, too....  Bombshell (Hollywood A-List, #1) https://www.goodreads.com/review/show...~~~~~ Before Reading ~~~~~ \nLike a Moth to the Flame...Attention cannot be turned off...Even when it should...In order to Protect the Target of this Threat...The Best is brought in...A Man who is too sexy for his own good..A Man who takes one look at his reason for concern...And He loses his distance...Needs to be closer to her...After all he is to be her...BODYGUARD (Hollywood A-List #2) - November 14, 2017A gifted copy was provided by Montlake Publishing via NetGalley for an honest review.For more Reviews, Free E-books and Giveaways"}, {"userName": "Astrid - ☆Vanilla & Spice Books☆ ", "userReviewDate": "Nov 14, 2017", "userURL": "http://www.goodreads.com/user/show/7420520-astrid---vanilla-spice-books", "userReview": "✮ ✮ ✮ 4 STARS ✮ ✮ ✮Review @ Vanilla & Spice Books\nI have been a fan of CD Reiss' storytelling since her Song of Submission series. This series is a lot less angsty than SOS but not less captivating. I adored the first, Bombshell, in this series and though we always compare books to previous works and this one wasn't a five star book for me Bodyguard was still highly entertaining.Emily is a choreographer for her best friend and superstar. She has given up her career for her then-boyfriend who couldn't handle other people touching her on-stage. Said boyfriend has turned into a stalker after she broke up with him when she realized that their relationship was toxic. She has since been living in a golden cage, surrounded by the newest tech guarding her. She feels trapped, her life isn't a life any longer but existing on a daily basis. She has nothing to look forward to, survival always in the forefront of her mind.What a sad life it must be, living locked up, not having the freedom to go wherever and whenever you want to. You don't know how good your life is until this freedom has been taken from you. In that regard I admired Emily for her patience and courage. She is a sweet heroine with a vulnerability about her that completely endeared her to me. Her insecurities were so relatable. Her self-confidence had been crushed by her ex.Carter Kincaid, bodyguard and all around hot guy, is insanely private, mysterious, yet sweet and protective. When he meets Emily he is drawn to her. At first his excuse to keep her at arm's length is her being his principal making it impossible for him to do his job. His first-hand experience with stalkers make him perfect for the job to protect the graceful dancer.\nStalkers had a special place in my heart. The place where I kept violence and foul language.\nCarter was delicious. Hot, protective and very clear what he wants from Emily. There is a bit of a push and pull going on which made me a little impatient with him but in the end he was a wonderful hero who couldn't hide how much he adored his Tiny Dancer, even when she messed up. I also LOVED Carter's relationship with his son Phin. The way they reassured each other their love was adorable and all kinds of touching, especially in the light of the truth.\n“Hey, Dad. Size of my heart.”We fist-bumped. “Size of mine.\"\nThere is always a sense of doubting himself, second-guessing his decisions, which made him feel real, authentic. He wasn't cocky, he knew he was a capable man but he knew his limits.Both of them have to break out of their personal prisons. While Carter's is self-imposed, Emily's is out of necessity to survive. They also have some letting go of the past to do.Their relationship changes everything and both of them find strength in their feelings and start to make room for the other one in their life.\nYou are under my protection. Let me say it again so you understand what it means when I say that. There’s Phin, and there’s you. You are my business. Your safety and . . . no, not just your safety. Your happiness, your comfort, your well-being . . . I’m taking the responsibility for those things off your plate. It’s all on me.”\nI loved the spark they had, their chemistry. Carter just couldn't stay away or keep his hands off of Emily. And that those sexy times?Another highlight was Darlene's and Emily's friendship. Darlene really took care of her best friend, securing her safety, always offering a haven. There is also a little twist that might come as a surprise.CD Reiss Hollywood A-List series is sexy and light-hearted compared to some of her other series and Bodyguard checked all my boxes. It puts you right into tinseltown and makes you a part of it. I thoroughly enjoyed myself reading Bodyguard. Now I'm looking forward to the next in the series and can't wait to find out who it will be about!"}, {"userName": "♥ Jx PinkLady Reviews ♥ ", "userReviewDate": "Nov 09, 2017", "userURL": "http://www.goodreads.com/user/show/16496589-jx-pinklady-reviews", "userReview": "*LIVE!‘Bodyguard,’ is the latest STANDALONE story from the, ‘Hollywood A-list,’ series of CD Reiss. It’s everything I wanted it to be and so much more all exposed in a beautiful first-person narrative that toggles between the perspective of the hero and heroine. Full of swoon and magic, heart and soul. It captures the contemporary romance trope to absolute and stunning perfection and totally pulled me into the romance of the protagonists who both have rich, engaging histories that authentically shape their character's thoughts, words and feelings. Beautiful, kind and caring girl, Emily is choreographer to her best friend superstar, a relationship that I found touching and resonated from an experience of a personal friendship. With a stalker ex, Emily needs protection from the best protector in town and that man is sexy and super charismatic Carter Kincaid. Their on-page chemistry sizzles from the start, a relationship that feels totally organic as it develops and the layers of the story are unveiled to uncover secrets and truths with romance and very sexy scenes at the heart of the narrative. Oh, how I fell in love with Carter Kincaid, the way he behaves with Emily and the dynamic of his relationship with his family members, one of whom may have stolen the show but I think that character and their significance to the plot needs to be experienced by the reader organically and in conjunction with the story.CD Reiss always hits the spot with her writing powers and delighted me with Bodyguard, a story that comes vibrantly to life, has complexity of plot and emotion with totally plausible motivation at all times. I LOVED every word, thought, and feeling depicted and recommend to all romance readers. Available here-->KINDLE ➜ https://cdreiss.com/BGaAUDIO ➜ https://cdreiss.com/BGaudPRINT➜ https://cdreiss.com/BGprAdvance copy provided, via NetGalley, for my honest review thoughts *"}, {"userName": "Deanna❤Pink Lady❤️", "userReviewDate": "Nov 17, 2017", "userURL": "http://www.goodreads.com/user/show/14351108-deanna-pink-lady", "userReview": "5 “Tiny Dancer” StarsA perfect stand-alone contemporary romance. The right mix of angst, sexual tension, and romance. A story that brings two people together whose life isn’t perfect. A Bodyguard who never mixes business with pleasure and a choreographer whose life got derailed by her crazy ex. When these two meet, can they risk the feelings they feel or will the risk of their feelings be their undoing?Carter Kincaid, the sexy, brooding, professional bodyguard whose assignment becomes Emily Barrett, choreographer and best friend to the famous pop star, Darlene McKenna. This story involves several relationships. It’s just not the developing romance between Carter and Emily, there is BFF’s Emily and Darlene, Emily and Vince, and Carter and Phin. All these characters weave themselves into each other’s lives and creates a family of people whom you can’t get enough of. Carter and Emily are electric, sizzling and safe. The banter between the two is spot on and their connection drives the story of feeling safe with one another. There is angst coming from both sides of the relationships including danger, a sense of keeping someone safe at all cost, and the thought that maybe love could be in the cards. CD Reiss has magical talents for storytelling. These characters embedded themselves in me and I literally couldn’t put the book down. It’s contemporary romance at its finest. The perfect weave of romance, angst and happily ever after. Two strong individuals in their own rights but missing that someone in their life. Each learning to trust the other and opening up their hearts. If you love outstanding writing, beautiful storytelling, strong and fierce characters, romance and sexiness.......BODYGUARD checks all those boxes. #WonderfulContemporaryRomance #MustOneClick #Standalone #CarterKincaid🔥❤️🔥❤️*advanced copy provided in exchange for an honest review*"}, {"userName": "C.D. Reiss", "userReviewDate": "Mar 05, 2018", "userURL": "http://www.goodreads.com/user/show/16478256-c-d-reiss", "userReview": "My book, my stars :)I hope you like it too"}, {"userName": "Jacqueline's Reads", "userReviewDate": "Oct 09, 2017", "userURL": "http://www.goodreads.com/user/show/4197769-jacqueline-s-reads", "userReview": "[Carter’s reason for not wanting a relationship and Emily being attacked (hide spoiler)]"}, {"userName": "Susan ", "userReviewDate": "Nov 18, 2017", "userURL": "http://www.goodreads.com/user/show/47515935-susan", "userReview": "\"Hold me closer tiny dancer\" Elton John, \"Tiny Dancer\"The first thing I must make clear from the outset of my review is that I am an unabashed, complete and utter fan of C. D. Reiss. While \"Bodyguard\" can be appreciated at face value for its enticing and well developed characters, steamy romance delivering all the lovely \"feels\" and of course an interesting story that simply would not let me go until I finished the book....The reader can also find the difference between good writing and \"inspired\" writing in Ms. Reiss' language, themes, subtle allusions and quiet references that create a soul stirring experience.She begins by bringing the reader inside the \"gilded cage\" of a talented superstar singer, Darlene, whose whole life is the focus of many adoring fans and some dangerous \"twisted\" fans. She, however, is not in the most danger presently, it is her equally talented forever \"bestie\" since childhood, Emily, who is dangerously stalked by an ex-boyfriend who will not let her go.With a \"breathtaking thud\" our Hero, Carter Kincaid makes his introduction to Emily and it is that delicious tingle a reader gets when the heroine gets (in this case Emily) aroused at the touch, voice and smell of this man. Of course Carter Kincaid is \" the most gorgeous man\" Emily has ever seen with \"blinding blue eyes\". He is also a \"world-class security system\". Fearing for the welfare and safety of her best friend, Darlene selects Carter to be Emily's principal bodyguard from among her security team.Emily is Darlene's choreographer/dancer in the stage production of her new tour show. Emily is a talented dancer and she is even a singer in her own right. She gave up her singing and even most of her dancing on stage because of the relationship she had with her former boyfriend. He did not like sharing her with the world. In a real way she lost of part of herself for the seemingly \"focused\" attention of this man. He was not even \"in her league\", yet he fulfilled something she needed inside of herself until he became insanely, intolerably and dangerously jealous.With language that pushes, pulls and dances itself using words and phrases such as \"gravitational pull\", \"centripetal force\" and \"torque\" sprinkled in the narrative...the love story of Carter and Emily is brought to life for us. Beginning with the intense furtive looks that Emily and Carter share. Each of them trying to play it cool. Carter desperately trying to remain professional to insure Emily is secure at all times. I just love it when I know how a hero and heroine smell. Carter smelled like the 5th of July to Emily...the day after the 4th when the smell of fireworks and gunpowder linger in the air. Emily smelled like lemongrass to Carter, so much so that a visit to a Thai restaurant brought her to mind. Interestingly enough Emily also reminded Carter of the 4th of July. The bang (Emily) the aftermath (Carter). Something interesting to think about...Of course the \"tiny dancer\" as Carter has named her, brings with her too much that he desires for Carter to ignore his impulse to kiss her, hold her, possess her. The more he indulges the more he wants. Yet, for all of his desire, he retreats at times. He is like a wave coming to shore than going out again. He has his reasons and one of his reasons is the protection his very \"unique\" son that he is raising by himself. Emily is unaware of Carter's life circumstance apart from when he is with her and the plot climax that begins to build with her discovery and subsequent errors surrounding this situation is masterful writing. Woven in the drama is this adorable adolescent boy, Phinneaus (Phin), Carter's son. While \"Dad\" is trying to raise him well; Phin has much to offer Dad in that sweet, down-to- earth awareness of a child that wants the best for his Dad. The reader will love the way this boy is taking steps into manhood. The author captured in the narrative, the emerging goodness of a boy growing into manhood...the reward in watching this growth. In the end it was the in the infinite spectrum of love itself that was the final answer to every question and solution to every dilemma. Could it just be that the love of your own person and the care you take with this person may be the starting point for real deep and true love as it was for Emily to sing again and for Carter to finally make his life complete with Emily? One click to read about the answers Emily and Carter found in love."}, {"userName": "Coco.V", "userReviewDate": "Oct 04, 2017", "userURL": "http://www.goodreads.com/user/show/42214962-coco-v", "userReview": "💃🏻💃🏻"}, {"userName": "Shayna", "userReviewDate": "Nov 03, 2017", "userURL": "http://www.goodreads.com/user/show/7305727-shayna", "userReview": "Oh, who doesn’t love the whole ‘bodyguard falling in love with his charge’ trope? And when CD Reiss is behind it all…HELL YES, it’s going to be FAN-FREAKING-TASTIC! AND with a setting like Hollywood…there is nothing that could have kept me away! Emily and Carter’s romance took me to heaven and back, and I just want to experience it over and over again. Not only did I absolutely DEVOUR this read, I don’t think I’ve read so fast in my life! I just wanted to take it all in as fast I could because it’s CD ‘fucking’ Reiss!A CRAZY ex-boyfriend, a SEXY and STUBBORN bodyguard, a SIZZLING chemistry that just won’t quit, and a secret that could change everything - BODYGUARD was one HELL of an entertaining and sexy rollercoaster ride of emotion and suspense. My anticipation deepened with every turn of the page and by the very end, when my heart finally stopped trying to beat out of my chest, I let it all sink in and fell in LOVE with Reiss’ writing ALL OVER AGAIN! Her Hollywood based romances have charmed me from head to toe and I can only hope there is more where that came from.BODYGUARD is book #2 in CD Reiss’ Hollywood A-List Series but it can be read as a complete standalone. But keep in mind, you are going to want to scoop up BOMBSHELL, book #1 because it’s just as FANTASTIC as this one. Solid writing, a beautiful romance, and imagery and prose like you won’t believe! I absolutely ADORED this book and its characters and I just KNOW that you will fall HARD just like I did."}, {"userName": "TeriLyn", "userReviewDate": "Nov 16, 2017", "userURL": "http://www.goodreads.com/user/show/1459307-terilyn", "userReview": "**Bodyguard generously provided by the publisher via Netgalley in exchange for an honest review.**5 \"You are under my protection.\" StarsThis book showcases everything I love most about the stories of C.D. Reiss. A standalone, contemporary romance qualifying as one of her best romances to date. There wasn't a single part of the book I didn't absolutely adore. From her construction of the plot arc blended with her astute settings, to her development of engaging characters, to the sharp focus of her tight, concise writing, Bodyguard truly highlights the phenomenal penchant for story telling this author beholds.I got lost in these characters both as individuals and in their relationship. I wanted to be a part of their world for the totality of this book. I understood them, sympathized with them, and felt like a welcome bystander to their journey's. Carter Kincaid and Emily Barrett are strong mains for individual reasons. Together, they create a maelstrom of feelings for the reader. A hero you'll want for yourself paired with a heroine you want to be. Perfect combination. \n\n\"I was who I was, and I was okay.\"\n\nI loved how Reiss made their individual stories collide. I loved the discoveries and growing pains both went through throughout the book. I love the strength with which Reiss built each character and how she didn't fit them into certain molds but them precisely unique in their own ways. And I love how I felt the passion in the writing, not only for the romance, but for each event (big and small) that happened throughout the story. And I loved how their romance didn't fit into the typical constructs of the genre but rather ebbed and flowed perfectly from beginning to end. \n\n\"Sometime. Not today. But not never.\"\n\nBodyguard is a book for established C.D. Reiss fans to salivate over. It's also a book where new Reiss readers can fall in love with her unique style. It's a story that reminds all romance readers why exactly we love to read romance in the first place and how Reiss is a force in this realm of the book world. A highly recommended must read."}, {"userName": "Shabby  -BookBistroBlog", "userReviewDate": "Nov 07, 2017", "userURL": "http://www.goodreads.com/user/show/26191846-shabby--bookbistroblog", "userReview": "Its no secret that we, at BookBistroBlog utterly adore CD reiss's writing. Her books are a promise of excellent stories, very detailed and thoroughly researched plot and a new outlook to same old emotions of love and heartbreak. We get a ringside seat to Hollywood Circus in her new standalone series of Hollywood A-list in book 2. Every celebrity has a bodyguard to protect themselves from stalkers, haters, crazy fans, groupies, clingy autograph seekers, lurkers, paparazzi, you name it, they have it. Beyond all the glitz and glamour, they are practically prisoners in a golden cage, a downside to fame and wealth.Darlene is a Rockstar singer & performer. She employs a bodyguard -Carter Kincaid , and her choreographer/best friend/ Sister from another mister -Emily Barett bumps into him and the moment their eyes lock, its instant Nervicitement for Emily. She's stalked and she needs protection and Carter protects like nobody can . Shes an excellent dancer and a singer too, her art just seeping from her every poreIf there was ever a world-class security system, Carter Kincaid was it.“Memorize the following . . . Carter can handle himself.”But who protects Emily's heart from Carter. Cause he carries baggage . Yes , in plural ! He keeps his private life separate from business and they never meet. Although Emily somehow falls in the crack and is stuck there !!!!Emily is a lost soul. Alone , scared and living on the edge . Edge of fear because she has to look over her shoulders forever for her violently crazy ex. She finds solace in the arms of Carter but since she's his \"Principal \" professional conflict drops a barrier between them. And insurmountable wall which isolates Emily even more I imagined a life with people around me. People who loved me. Noise. Talking. Plans and preparations around each other. A life that buzzed with love. I didn’t picture it as unsafe. I didn’t feel the lockdown. Didn’t make sure the imaginary doors were locked. The safety didn’t come from dead bolts, alarms, and closed-circuit monitors. The safety came from family.The story is obviously fantastic, its Christine's treatment that takes it to a mercurial high note. The sexual connection between them so scorching hot , you can feel the pages burn. I could feel and taste the passion so thick , craving so deep, it was a bummer they couldnt be tigether & had to go back to their corners. Lovely book, couldn't stop reading it. The FEELS got stronger as the story progresses. Phinneus was adorable and perceptive and stole my heart. The Little Naked Dancer and the Big Hulky Bodyguard love is stuff Hollywood legends are made ofCD is so besotted with L.A. , her obsession drips from her writings. Is that why she never visits NYC🤔. Although her fans East side (moi) are starving to meet her !!( I lost 100 lbs by starvation. JK😜) On a sombre note, I lost a Facebook friend yesterday -Sara Burch , a Beautiful soul and a fun filled human being. And this brought Christine's words even more protrusive  Nothing was guaranteed. Life wasn’t sure, protected, or secure. But he made love feel as if it wasn’t a risk. Love was the good part. The joy. The reason. Love was the one thing worth protecting.Hug your loved ones hard and tight from tonight on.5 Fist size of my heart stars 👊👊👊👊👊#BookBistroBlogApproved Follow us onFB - https://www.facebook.com/groups/BookB...Blog -https://bookbistroblogcom.wordpress.comBlog -https://bookbistroblogger.blogspot.comTwitter - https://www.twitter.com/BookBistroInstagram - https://www.instagram.com/BookBistroBlog"}, {"userName": "maggieandteddy", "userReviewDate": "Nov 23, 2017", "userURL": "http://www.goodreads.com/user/show/15076466-maggieandteddy", "userReview": "Here's my review:I had started this book and then had to stop (pause) when I received a library book with a short period of time left. I don't like starting/stopping/switching books midstream. I like to stay in the same world-until I'm finished.I went right back to the story and continued to enjoy it.This is first person POV alternating between Carter & Emily. (Slightly more of Emily's POV)Emily is a choreographer for singer/dancer Darlene. Emily and Darlene are BFFs since childhood. Emily chose to quit her own singing/dancing star aspirations to keep her crazy-possessive (now ex) happy. Emily has settled into life behind the scenes-as far as the public can tell (and her crazy ex).Carter is hired to protect Emily. They have instant sparks. I felt their mutual attraction. Carter is a big burly teddy bear of a hunky guy. He has some issues in his personal life that are gradually revealed. Carter lives in LA and works around the media, show biz and all other kinds of riff raff (am I being redundant?) LOL. How does he expect to keep under the radar- out of the spotlight?I liked how Carter's personal life is revealed. Emily is emotional supportive of him. Emily has her own issues with her personal life. If/when will her crazy ex show up? How can he be stopped? Carter and Emily find a way to be together intimately. Their scenes together are pretty hot. I liked how the suspense didn't get in the way of the love scenes and the suspenseful parts didn't take away from the sexy times. There are light moments too. Carter is a very loving guy. He really does put his family first . Way ahead of his career or personal life. Carter's mom seemed a little out of place for me-but she had her funny moments too.I read book 1 \"Bombshell\". Both of these books are standalone stories. I loved Carter's protective way with Emily. Emily sometimes got in her own way, but I liked her too. Thanks for the ARC Netgalley. I enjoy Ms Reiss' writing style and her dry sense of humor.4 Tiny Dancer Stars."}, {"userName": "J. Grayland", "userReviewDate": "Jan 23, 2018", "userURL": "http://www.goodreads.com/user/show/28558514-j-grayland", "userReview": "Carter Kincaid is a bodyguard to pop diva Darlene McKenna and her best friend Emily is her choreographer, Emily once herself a raising star gave it all away for a boyfriend who turned out to be a total nightmare and now Emily's ex has become her stalker and the very private life of Carter Kincaid is going to get turned upside down when he feels the need to protect Emily. Carter has a hard time trying to separate business from pleasure because he has a secret life that he's having a hard time sharing with Emily causing more problems between the two. I am a huge CD Reiss fan and I did like this book although for me the instant attraction and the story line was very predictable. I loved Carter's character of being the strong, protective family man that he was, unfortunately I just couldn't connect with Emily's character she was very needy and had it all but thought she had nothing, great hot sex scenes."}, {"userName": "Tijuana *BookTwinsReviews*", "userReviewDate": "Nov 20, 2017", "userURL": "http://www.goodreads.com/user/show/33488158-tijuana-booktwinsreviews", "userReview": "Here’s what you get when you pick up a novel by CD Reiss: A book that is well researched and planned. A sexy and emotional story that will hit you right in the feels. But most of all, a book that is well written! Bodyguard is just that!Here’s the breakdown: Emily is best friends and choreographer to a huge star. Her glamorous lifestyle leads to a her having a stalker ex-boyfriend who refuses to take no for an answer. Enter Carter Kincaid, the best security system money can buy. He’s the best in the business, but also happens to be breathtakingly beautiful. Can he protect Emily if their attraction becomes too strong?Here's what I loved: Where Bodyguard excels is in the character development and interpersonal relationships. Not only are Carter and Emily great together, but his familial relations and her friendship with Darlene are spectacular. I particularly loved the friendship between Darlene and Emily.Other highlights are the plot. This story kept me on my toes and completely engaged the entire time. Every time I thought I had things figured out, I was wrong. LOL I love that. Originality and unpredictability are paramount to my enjoyment.The emotional scenes between Carter and Emily are so good. Oh man there’s a scene where she breaks down after an altercation and it was so heart-breaking. She’s vulnerable and he feels so bad that he wasn’t there and didn’t see what happened. My heart beat so fast! And Carter and his family were so great to see. A real highlight.Overall, this is another winner from a great author. CD Reiss has another superstar on her hands! Recommend for romance lovers who enjoy a bit of action and intrigue, sexy AF alphas, and sweet but strong heroines."}, {"userName": "Kelly", "userReviewDate": "Nov 06, 2017", "userURL": "http://www.goodreads.com/user/show/22578365-kelly", "userReview": "ABSOLUTELY LOVED THIS!!! CD Reiss is one of my favorite writers!!! This book had all the feels! It’s the deeper meaning behind what appear to be simple interactions b/t the characters, that actually make you feel SO much more!! I devoured this book! It was funny, emotional, suspenseful, sexy, and a bit angsty, which I love and hate simultaneously! Carter and Emily were perfect for each other, & a certain boy stole the scenes for me making me laugh & cry! I will recommend this book and her other books without hesitation! Some of my fav quotes (there are a ton more!!):“He kissed as if he were listening to me tell a story, and I kissed him back as if I was”“I’ll see you tomorrow, tiny dancer”“But for now, I wanted to be her crutch and her cast. Her splint and tourniquet. I was going to be the bandage over her shame...”“I found strength in his eyes. A calm in the storm. A stability when everything around me was unsure and dangerous”“I knew she was the size, shape, and intention of my heart whether I liked it or not” “The traffic in my brain stopped short, creating a ten-car pileup of reactions”“She was beauty and movement”“They always said we both had talent, but she was the star.” “It’s a big sky”***ARC received via Net Galley for an honest review***"}, {"userName": "Beneath The Covers Blog", "userReviewDate": "Nov 21, 2017", "userURL": "http://www.goodreads.com/user/show/44387886-beneath-the-covers-blog", "userReview": "Full review can be found HERE --> https://www.goodreads.com/review/show...*ARC provided in exchange for an honest review.* ~Sonal"}, {"userName": "Mindy Lou's Book Review", "userReviewDate": "Nov 13, 2017", "userURL": "http://www.goodreads.com/user/show/44132489-mindy-lou-s-book-review", "userReview": "I love when I don’t know where a book is going to take me. Bodyguard was not at all what I was expecting. These two have so much baggage in their life. This book was all about seeing them struggle to be normal when neither of their situations were, all the while trying to act on the attraction they have for each other. This is one of those books that will make you laugh, cringe and maybe even cry a little. It was life. Hero: Carter is the bodyguard to the heroines best friend and then becomes heroines bodyguard. He’s ex-LAPD. Lives with his mom and son. Carter was instantly drawn to heroine but kept her at arms length due to home life. His character is an Alpha but comes off Beta as he tries to stay away from heroine.Heroine: Emily is a dancer and singer. She blew out her knee but attempted to reach fame with her best friend, Darlene. Due to a bad relationship that turned into a stalker, Emily stopped trying for fame and became Darlene’s choreographer. Emily is hiding from life because of her stalker. She’s instantly drawn to Carter. She seems shy at first but starts to show a backbone. She calls Carter on his wish washy behavior.Heat Factor: starts off low and builds with the storySafety: heroine has a stalker, but it doesn’t get too violentPredictability: unpredictable. Angst Level: mid level***ARC provided by NetGalley."}, {"userName": "Jo - *✽*•.★Reading Is My Bliss★.•*✽*", "userReviewDate": "Oct 10, 2017", "userURL": "http://www.goodreads.com/user/show/14742654-jo---reading-is-my-bliss", "userReview": "Emily and Darlene have been friends since they were in 3rd grade and have always had a shared love of dancing and singing. This is what led them to LA, where Darlene is now a very successful pop star. Emily is her choreographer but tends to shy away from the limelight after an awful relationship break up with a possessive guy who has now morphed into her crazy personal stalker.Darlene is about to go on tour so they are really busy preparing the for the shows and because of the stalker issues seem to be getting worse they have employed another security guy, Carter Kincaid who will pretty much be looking after Emily, keeping her safe from her crazy ex.\n‘He appeared like a white knight, unshaven, unshowered, ready to do battle for the people he loved. He exuded manliness and safety, like a king swearing to protect the realm.’\nCarter is ex-police and has a bit of mystery about him. However, his attractiveness is not lost on Emily, OMG the man is gorgeous! Carter has also noticed how beautiful Emily is too, in fact he hasn’t really been interested in anyone the way he seems to be with Emily, who he has now nick named Tiny Dancer. The lines between protecting her in a professional capacity and wanting to look after her and keep her safe are a bit blurred. \n'I hadn’t kissed a woman in a long time. I wanted to eat her alive. Put my hands on every inch of her. Take her body on the hardwood. Everything.'\nCarter is very aware that crossing this line with her could lead her into danger, if his mind is on her and not on the job then he won’t be able to do what he has been employed for. Resisting each other seems futile though and pretty soon things change to a more intimate relationship between them. \n'My body overrode my common sense. I had to have her. I’d never been addicted to anything, so I was unprepared for what an addiction did to a guy.’\nCarter feels sad and angry that the stalker has affected Emily’s life so much. She is always fearful of her safety and looking over her shoulder. Her light has been dimmed by this fear. Carter has his own stuff going on to, he has a gorgeous son, Phin, who I absolutely loved! He balances taking care of him, being a ‘present’ father, working and sneaking in time with Emily. His focus has been on Phin for so long that he is reluctant to overlap his home life with his relationship with Emily. It is important to him that Phin is not affected by anything he does outside their home. I think he completely underestimates how clever and intuitive kids can be and this is proven when Phin meets finally Emily.However, let’s not forget that there is a crazy dude out there lurking and looking for an opportunity to get closer to Emily. There is also a stray cat called Gray and a massive secret in Carter’s household that, when revealed, will shock everyone. This story had a bit of everything really, suspense, romance, mystery, ansgt, sexiness and a whole lot of love ☺"}, {"userName": "Eva LeNoir", "userReviewDate": "Nov 15, 2017", "userURL": "http://www.goodreads.com/user/show/13819126-eva-lenoir", "userReview": "Let's be clear about something.I call dibs on Carter.End of.Let me tell you why.Fiction is about losing yourself in a story, living vicariously through characters and fitting yourself inside somehow. We want to see our characters evolve and reach new, more promising heights. We want them to suffer a little in order to appreciate the HEA that authors give them. Sometimes, characters start out less than stellar. A bit aloof or downright insuffrerable. Carter is a man's man. The kind of man every parent wants their child to meet and love. He's almost too perfect for his own good and perfection is a fault by any standards. Emily is his breath of chaotic fresh air. His downtime. His chance to let go of his tight ship.Why did I love this story? Simple...Bodyguard is the reason we love romance. This story is the perfect example of why I love to read.MUST READ"}, {"userName": "Laura- BookBistroBlog", "userReviewDate": "Nov 12, 2017", "userURL": "http://www.goodreads.com/user/show/28116363-laura--bookbistroblog", "userReview": "Bodyguard (Hollywood A-List #2)By: C.D. Reiss4.5 StarsIf there is one thing about C.D. Reiss books, her words are unlike any other. Something about her writing style, it pulls you in from the get go. Bodyguard is no exception. Here we have 2 best friends who moved to California to live the dream. The dream that so many head out to California for. While Darlene is a Rockstar, Emily is her choreographer. Being in the spotlight, security is mandatory. Carter is that bodyguard with baggage. Like bigtime baggage… He chose the security field after leaving the police department so that he could handle his baggage on his terms. When Carter and Emily meet, they both feel the sparks. But neither one is in the right frame of mind to be in a relationship. As we travel through their back and forth of wanting a relationship, to denying the relationship, the story unfolds and we learn what is included in their baggage. Follow us on:FB – https://www.facebook.com/groups/BookB...Blog -https://bookbistroblogcom.wordpress.comBlog -https://bookbistroblogger.blogspot.comTwitter - https://www.twitter.com/BookBistroInstagram - https://www.instagram.com/BookBistroBlog"}, {"userName": "Jean", "userReviewDate": "Nov 14, 2017", "userURL": "http://www.goodreads.com/user/show/25860981-jean", "userReview": "First, let me say, I love the covers of the books in this series!Emily is the choreographer for her best friend and trying to stay out of the limelight as much as possible even though she had always dreamed of singing and dancing and being center stage. However, a past relationship with a possessive arrogant idiot has left her hiding in the background in fear. Enter Carter Kincaid......OMG, could he have a sexier name!! I loved it!Her friend assigns Carter to protect her after her ex continues to taunt her. And that's where the sparks start to fly. I loved how sexually aggressive Emily was with him, when in a crowd she seemed somewhat shy. The sexual tension was growing and it was only a matter of time. That dance between them....smoking hot!!But of course, Carter has a secret which is his number one priority.......and of course there was the whole professional aspect of not fooling around with the person who you are supposed to be guarding. He was adamant that nothing could or should happen between them or he would be distracted. So much for that! Haha!I loved this book, and I especially loved Phin! Phin was a quirky, smart character!Looking forward to the next in the series if there is one!I received an ARC of this book through NetGalley for an honest review."}, {"userName": "Courtney", "userReviewDate": "Nov 22, 2017", "userURL": "http://www.goodreads.com/user/show/13045881-courtney", "userReview": "So I am either really becoming super picky over what I am reading anymore or I am just finding books to be just ok for me lately. And that is not good, at all.I did not read the first book in this series (you do not need to) but I did read her other previous release, King of Code, and I really enjoyed that book. But I found myself struggling to get into the Bodyguard. And I can't pinpoint any one thing, I think it was a bunch of things for me.The story line was nice. While I enjoyed the push and pull between Emily and Carter, it started to grate on my nerves at times. I enjoyed the tension and the chemistry between the two but the constant battle was drawn out for me. I loved the single dad portion of this book. And what made it unique was the age of the child - he was a teenager. I just wished I saw more interactions between these two and I think that's where I missed the connection on that. Fist-bump. \"Size of my heart.\"   - yea, this got me. Read the book and find out and what I mean.Overall, is was just a nice read. Because it felt very slow to me, it took longer for me to get through because I felt no urgency to see what would happen or how things panned out. If you are a fan of CD Reiss, you will enjoy this book a lot."}, {"userName": "Jean", "userReviewDate": "Nov 14, 2017", "userURL": "http://www.goodreads.com/user/show/10480943-jean", "userReview": "I love CD Reiss' Hollywood A listers. It's a place populated by stars and everyone it takes to make us love them. Bodyguard is all about Carter, the best of the best when it comes to celebrity bodyguards, and, in a great little twist, Emily, a choreographer who could've made it as big as her best friend Darlene McKenna, a superstar singer modeled after every diva singer turned actress minus the drug use and bad behavior, turns out to be his assignment. The roadblock in Emily's career wasn't a lack of talent or drive. It was a controlling boyfriend, now ex, who continues to try to force his way back into her life despite flimsy restraining orders and Emily's now locked down life of work behind the scenes and out of the spotlight. It's Carters job to make sure the ex doesn't make his way back.It's a story as old as time - two people thrown together by circumstances (with some help from a meddling best friend in this case) who end up fighting an attraction neither feel they can afford to have - made fresh and new thanks to the magic of CD Reiss and her gift with words. The story sings with a gritty, sweet emotional tension that gets under your skin as the story unfolds. Carter is a man full of secrets with a past colored by an event he can't bear to see repeated, and Emily is a woman who has let her past haunt her future. It's like a rose, sweet and spicy, full of promise.I can't say enough great things about this story. It hits my sweet spot like a classic movie. Even if you know how it ends, the telling of the story and the depth of the characters is so vivid that the journey sweeps you away every single time. Carter and Emily finding their way to each other will never get old for me. Carter's a capital \"H\" heart throb and an unabashedly Good Man. I adore him with his buttoned up, stoic professionalism and sly sense of humor. The scenes with his family are bubbly and fun especially in the way they call him on his \"strong silent type\" behavior. Emily is one of Ms. Reiss' feisty, independent \"every girls\" and gives this story one of my favorite twists - the hero doesn't fall for the star. I really connected with her self doubt and need to put up barriers after her disastrous love affair with Vince - she was reserved and prickly without being whiny. In the hands of a lesser storyteller she could have easily become unlikable, but I took her to my heart, baggage and all, because the restoration of her faith in her own judgment and faith in love was told with such vibrancy, with just the right amount of swoony fantasy. This is definitely a story I will revisit again and again because it makes my heart feel light and bright and bursting with happiness.5 swoony stars"}, {"userName": "Jennifer", "userReviewDate": "Sep 28, 2017", "userURL": "http://www.goodreads.com/user/show/3956348-jennifer", "userReview": "3.5/5 starsBodyguard is book two in the Hollywood A-List series. However this book is a complete standalone. There is only one small mention of a character from book 1 (Bombshell). But it is completely not relevant to the story at all.Bodyguard is an adult contemporary romance. It is my first book by this author.The narrators are Emily and Carter (1st person POVs).Emily is a choreographer for her best friend mega-star Darlene. Carter works as a bodyguard.I absolutely loved Emily and Darlene's friendship. And I really enjoyed Carter's family.There was nothing wrong with this book. It kept my interest. Both main characters were appealing. There was a great female friendship. There were even a couple of interesting twists. However I think I just wanted to feel more. I liked the story. I liked the characters. But I just wanted to love them.Thanks to netgalley and Montlake Romance for allowing me to read this book."}, {"userName": "Sarah - Musings of the Modern Belle", "userReviewDate": "Nov 28, 2017", "userURL": "http://www.goodreads.com/user/show/8648577-sarah---musings-of-the-modern-belle", "userReview": "***AVAILABLE NOW - FULL REVIEW***4.5 Size of My Fist CROWNS With the many different elements of sexual chemistry, romance, and suspense, Bodyguard by CD Reiss had me not only enamored with Carter and Emily but flipping the pages in anticipation of how their story would end. Boy, oh, boy. I’m not sure I have loved a CD Reiss hero this much since Dash Wallace. Carter Kincaid is EVERYTHING!! The protective nature of being a bodyguard makes him uber-sexy, like he emits strip down in front of him, I need you now kind of pheromones. I found this aspect of his personality completely irresistible, especially when readers realize how far his protectiveness extends. The secret he is keeping will only serve to make readers love him more. Unlike other male characters in the story, Carter seems to balance that line between being assertive with a woman and respecting her space and wishes. His character is one of the many reasons I love this book.Emily’s character is stuck in a life of isolation and fear after escaping a rather abusive relationship, which she is still dealing with. While she doesn’t seem to really be really living, readers cannot really blame her. What will make readers love her character is how she evolves and truly starts to take control of her life. More than anything, though, readers will respect her for her choices and her ability to take be her own life and save herself. This story from the very beginning has intense sexual chemistry between the two characters. It is very much insta-lust that develops into insta-love. Even though the pacing of the relationship to be fast, the circumstances in which they meet lends itself to the believability of it all. What enticed me additionally is the stalker story-line, as it is clear that this will be a contributing factory in the development of the story and their relationship. What I would have loved is to see a bigger explosion when the inevitable occurs. If this would have happened, Bodyguard would have been a 5 CROWN read, without a doubt. Love the Bodyguard, love CD Reiss’s story-telling, and love the journey of these two characters as they find their HEA! Bodyguard is definitely another one-click must read from this author.————ARC received in exchange for an honest review."}, {"userName": "-S♡", "userReviewDate": "Nov 14, 2017", "userURL": "http://www.goodreads.com/user/show/38909135--s", "userReview": "★4 Stars! Bodyguard... “I wanted to hear her sing more than anything. I wanted to hear her open up her soul, then tell her she was a star. I wanted to be the one to heal what he’d broken”She was special. A million pretty girls in Los Angeles, but the tiny dancer was something else."}], "description": "Protecting a celebrity in Hollywood isn’t easy, but protecting Emily could break his heart.Emily enjoys all the perks of fame—the parties, the glamour, the tours—but they’ve brought her back to the attention of a dangerous ex-boyfriend hell bent on getting her back.Enter Carter Kincaid, a bodyguard so crushingly sexy he takes her breath away.Carter’s the best in the business and Emily is—professionally speaking—off-limits. But when it comes to stirring his desires, she’s hitting all the right notes. What’s happening between them is so hot it could get both of them burned. As Emily’s past gets closer, Carter is willing to break every rule of the job to save her. But letting Emily into his life also means letting her in on the secrets of his own past. For both of them, falling in love could be the greatest risk of all.", "title": "Bodyguard\n      \n          (Hollywood A-List #2)", "url": "http://www.goodreads.com/book/show/35708042-bodyguard?rto=x_gr_w_carousel_bp", "average": 4.1, "cover": "https://images.gr-assets.com/books/1501878314l/35708042.jpg", "reviews": 325, "authors": [{"url": "https://www.goodreads.com/author/show/6896405.C_D_Reiss", "name": "C.D. Reiss"}], "type": ["Romance", "Romance", "Contemporary", "Did Not Finish"], "outlinks": ["http://www.goodreads.com/book/show/35708042-bodyguard", "http://www.goodreads.com/book/show/35889199-bodyguard", "http://www.goodreads.com/book/show/17258795-beg", "http://www.goodreads.com/book/show/17641484-submit", "http://www.goodreads.com/book/show/17372058-tease", "http://www.goodreads.com/book/show/17833834-control", "http://www.goodreads.com/book/show/17909617-burn"]}