{"ratings": 6929, "userreviews": [{"userName": "Paromjit", "userReviewDate": "Nov 12, 2016", "userURL": "http://www.goodreads.com/user/show/38610813-paromjit", "userReview": "This is an unforgettable crime thriller that you do not want to miss. It is packed with the darkest of humour with grotesque and gory crimes. It begins with scenes from the Old Bailey on the trial of the Cremation Killer, Naguib Khaled. The jury has arrived at its verdict and Detective William Fawkes (Wolf) loses it big time with his violent attack on Khaled. Wolf pays by being incarcerated at St Anne's mental hospital. Wolf is vindicated when Khaled is discovered with the burnt body of a young girl, is released and back working as a police officer. He is a troubled man who lost his wife, Andrea, in a divorce in the aftermath of the Old Bailey incident. He is about to find himself on a sensational case that has the eyes of the media, and the whole country on him and the police. In a flat opposite to where Wolf lives, a repulsive 'ragdoll' is discovered pointing a finger into Wolf's apartment. It comprises the body parts of 6 victims sewn together to form one person. The media has a inside line into the story when Andrea, a reporter, is sent pictures of the ragdoll along with names and dates of the future murders of 6 other people, the last of whom is Wolf. Wolf and the police have the unenviable task of identifying the 6 dead people and protecting the people on the list amidst the amoral media frenzy. Time is running out fast whilst the police flounder in this twisted investigation. DS Emily Baxter, Edmunds, and DCI Simmons face added political pressure from the police hierarchy. This is an exceptionally twisted tale where the truth is hard to discern and eventually comes as a shock.This novel was originally a rejected screenplay for the author. He has successfully turned it into a tense and gripping novel that will not let you go until you read the last page. The writing and descriptions are gloriously visual. The characters are larger than life, complex, flawed, well developed and make an impression. It would not surprise me in the least if a tv series does now get made, it has such a compelling narrative and an intricate and complex plot. I particularly like the way the media turn the whole investigation into a reality television affair. There is light and shade with the dark horror of the acts committed amidst the mordant wit and comic humour. This novel comes highly recommended. Many thanks to Orion for an ARC."}, {"userName": "Mary Beth *Traveling Sister*", "userReviewDate": "Jun 24, 2017", "userURL": "http://www.goodreads.com/user/show/14233569-mary-beth-traveling-sister", "userReview": "I can't stop thinking about this book, I have a severe book hangover, I just loved everything about it. I found it to be very addicting. This book is incredible! It is complex, thrilling, gripping, exciting and horrendous, all at the same time.Ragdoll opens four years prior to the events of the ‘Ragdoll-Killer’ with a prologue surrounding another investigation which should have been a foregone conclusion. We are then thrown in at the deep end with Wolf being called to a crime scene whereby the body parts of six victims have been se wn together and posed into a macabre ragdoll – but who are the victims, what’s the connection behind the stitching together and why is it pointing towards Wolf’s apartment?! – gruesome and completely creepy! If that’s not enough, Andrea, Wolf’s ex-wife and journalist, receives a letter containing a list of the next victims and the dates they are due to die. What ensues is a race against time not only to protect the individuals on the list but to also understand who the parts of the ragdoll belong to and why the killer has chosen these individuals.I thought the character development was done very well. Wolf is the troubled detective with his own sense of justice, one which has had serious consequences in his past. He is the lone wolf, working with others when he must, but believing he must sometime act alone for the greater good. Baxter is taciturn, hiding a secret that controls her and unsure of her relationship with Wolf. The interaction she has with her colleagues is great to read, as is the working relationship that develops between her and Edwards, her trainee. Edwards, keen to do well since his transfer from Fraud, is initially naïve but grows as the story develops. Driven, focussed and impassioned he is a great counter-balance to the others. Finlay and Simmons, both older officers add comedy to the story and balance out the team.I really am looking forward to book 2 to come out. I think this series is going to be very addictive like this one. The plot was very intriguing!I recommend this book to those that like a dark gritty thriller. Not for the faint of heart."}, {"userName": "Dana Ilie", "userReviewDate": "Apr 16, 2018", "userURL": "http://www.goodreads.com/user/show/21690081-dana-ilie", "userReview": "Ragdoll is a gritty story that draws comparisons to David Fincher’s superb neo-noir thriller, Se7en. Wolf is the broken lead, propelling the tale forward with his hidden link to the killer, but the viewpoint switches between the various unwitting players in the Ragdoll Killer’s sick game – the future victims trying to outrun their demise, and the police struggling to contain the spiralling situation. Through all this horror though, there’s a streak of typical British humour that Cole shrewdly weaves into his characters’ dialogue. Whether it’s Baxter’s blunt sarcasm or Wolf’s blatant disregard for his impending doom, the characters can and do find the light when faced with the darkest of situations. It makes catching the killer as important to the reader as it is to the police in the book, and when the assassin does finally reveal himself in the heart-racing climax, it’s a scene that you won’t forget in a hurry."}, {"userName": "Larry H", "userReviewDate": "Apr 30, 2017", "userURL": "http://www.goodreads.com/user/show/5872506-larry-h", "userReview": "I'd rate this 4.5 stars.Despite the fact that I had a medley of Aerosmith's Rag Doll and Rag Doll by The Four Seasons running through my head while reading this book (not because of any plot points, just because my head is full of musical earworms), Daniel Cole's \nRagdoll\n was a pretty fantastic, page-turning crime novel. It's a rarity when a book like this can surprise me, when my habit of suspecting nearly every single character introduced doesn't irritate me when the crime is solved, but Cole did a great job with this book.Dogged police detective William Oliver Layton-Fawkes, nicknamed Wolf, has received more than his share of notoriety, most of it more negative than anything else. After catching the suspected \"Cremation Killer,\" London's most prolific serial killer in its history, his reputation went from hero to villain as the trial highlighted manipulation of evidence, police brutality, and suspicions of abuse in his own marriage. When the suspect was acquitted, Wolf's actions wind up getting him suspended and hospitalized in a mental institution, his life a shambles.When the killer acts again, and Wolf is proven to have been correct all along, he returns to the police force under psychological evaluation and more supervision than he has had in the past. But it's not long after he's handed his most grisly murder case, which the press has labeled \"The Ragdoll Murder\"—the body is made of the dismembered parts of six victims, sewn together like a puppet. As Wolf and his colleagues set out to identify the victims and find the killer, but their work is foiled by the press, particularly Wolf's ex-wife, Andrea, a ruthlessly ambitious reporter. Andrea anonymously receives photographs of the crime scene as well as a purported list of the killer's next six targets, with the dates he plans to kill them. Last on the list: Wolf.The police force finds themselves in a race to protect the people on the killer's list, but realize they are dealing with a more ingenious and dangerous nemesis than they originally believed, not to mention one willing to use the media to help pressure the police into making mistakes. At the same time, the intensity with which Wolf throws himself into this case threatens to reopen the emotional wounds he suffered during the Cremation Killer case, and has the potential to pit colleagues against colleagues in solving the crime.Cole balances the crime-solving in this book with a great deal of character development as well as suspense, action, and emotion. Wolf is a fascinating, flawed character I hope to see again, and the relationships with his colleagues which Cole explored were complex and compelling. This is a book which works on all levels, which is often a rarity with crime novels.It's amazing to think that this is Cole's debut novel, because his storytelling is tremendously focused and on-point. While there was one plot point I didn't love, I enjoyed this book immensely, and if I were anywhere other than my association's annual conference I would have devoured it in a second. Don't be swayed by the unusual musical earworms it spawned in my head—pick up \nRagdoll\n if you're a fan of crime novels, because this is one not to be missed.See all of my reviews at http://itseithersadnessoreuphoria.blo...."}, {"userName": "Kaceey - Traveling Sister", "userReviewDate": "Aug 09, 2017", "userURL": "http://www.goodreads.com/user/show/13442817-kaceey---traveling-sister", "userReview": "A Traveling Sister read with Norma, Brenda and Kendall!!3.5*The premise for this book was great! One body - six victims. So you ask how does that add up? Well, it goes like this. Appendages from six separate people sewn together to create one gruesome body. Then left hanging like a hideous “ragdoll” for the police to find. This sounded super creepy (which I love)! But for me it just wasn't coming together. (I know, bad pun.) Too many characters that I had difficulty following, and just couldn't connect with them. Through the first half of the book I kept thinking that I was missing something. I was ready to call it quits!!!With the support and encouragement of my sisters I kept reading and everything changed! I was back in full thriller mode pointing my finger at everyone! So utterly confident that I had it all wrapped up! The pace intensifies as the clock runs down on finding the killer. Then it all started to fall apart for me again. (Boo!) Sad to say the ending didn't work for me. I won’t reveal why or how as to give anything away. But once again, just like the start of this book I was left unsatisfied. Too much of a roller coaster ride for me - and not in a good way! This is book one of a new series but truthfully, I don't think I'll be picking up book two. For our full Traveling Sister review please visit Norma and Brenda's fantastic book blog: http://www.twogirlslostinacouleereadi..."}, {"userName": "Norma * Traveling Sister", "userReviewDate": "Aug 08, 2017", "userURL": "http://www.goodreads.com/user/show/41400192-norma-traveling-sister", "userReview": "Traveling Sisters Group Review by NORMA, BRENDA, KACEEY and KENDALL!!Norma’s rating:  4 stars!Our second pick for our Traveling Sisters Group Read was RAGDOLL by DANIEL COLE and we all had varying thoughts on the ending with this one.RAGDOLL (Detective William Fawkes #1) by DANIEL COLE is a clever, gripping, dark, and an action-packed crime thriller novel that was gory, thrilling, and exciting which moved along at a breakneck speed leaving us feeling a little spent after finishing this novel.DANIEL COLE delivers a fast-paced story here revealing shocking and gruesome scenes to drive the plot instead of adding layers to the plot and the characters. This left some of us a bit confused and needing more juice to grasp some of the happenings within the storyline and at times we felt like we missed something.    Daniel Cole does a great job adding some humor within the dialogue here between our team of detectives taking away some of the tension from the story and had us laughing out loud.  We all loved Edmunds and his character quickly became the favorite part of the story for Kaceey and Kendall.This was an extremely challenging read for us and we were conflicted with the ending.  The story falls apart at the ending for Kaceey and Kendall and they found some things just didn’t add up for them. Driving their rating down. However, for Norma and Brenda it did work for them.  The more Norma thought about this one the more brilliant she thought this novel was.  Would recommend! All of our Traveling Sisters Reviews can be found on our sister blog:http://www.twogirlslostinacouleereadi..."}, {"userName": "Kendall ", "userReviewDate": "Aug 10, 2017", "userURL": "http://www.goodreads.com/user/show/42327848-kendall", "userReview": "First off, yay to my first traveling sister read with Norma, Brenda, and Kaceey! This was so much fun to read alongside some lovely ladies! <3 <3Ok... now to get down to business. I was uber excited to read Ragdoll. A body that is found with the dismembered parts of six victims sewn together like a doll? Different arms, legs, and even finger sizes?! I was totally in! But, unfortunately this one just didn't have enough juice and punch to the storyline.So many characters in this one that came flying at you. Literally I felt like I was hit in the head with a frisbee. Daniel Cole delivers an action packed thriller at all times, but unfortunately it left me confused. I was having a difficult time of how the actual storyline connected to each and every character. And... the ending was a serious let down for me. I couldn't wrap my head around how the killer made sense to the story? I think I was out of the norm with this one compared to the other sisters since my rating was a tad lower.I find this is actually book one of a new series but I don't think I'll be continuing based on the experience I had with this one.Overall, 3 stars for this one! For our full Traveling Sister review please visit Norma and Brenda's wonderful blog!!! :)http://www.twogirlslostinacouleereadi..."}, {"userName": "Phrynne", "userReviewDate": "Feb 25, 2017", "userURL": "http://www.goodreads.com/user/show/8655084-phrynne", "userReview": "This one was so good I found myself reading bits of it out loud to anyone who wanted to listen. It is a very gory thriller and yet the humour in much of the dialogue made me laugh out loud! The characters too are charming especially the main character, William Fawkes or Wolf as he is better known. He is certainly someone I wish to know better so I am keen to read a book 2 as soon as possible.The story is fast paced and full of action. There are murders galore with a disproportionate number of body parts and some very weird things happening along the way. I liked watching all the police work and the acknowledgement that most of the job is tedious and boring. Wolf is one of those characters that crime writers love best, the one who prefers to work alone, never cooperates with the team yet always comes out on top (shades of Harry Bosch). It works for Harry and it works here for Wolf as well. So glad this book was recommended to me and I will continue to recommend it to anyone who enjoys a good thriller."}, {"userName": "Matt", "userReviewDate": "Mar 25, 2018", "userURL": "http://www.goodreads.com/user/show/5903843-matt", "userReview": "Daniel Cole emerges on the scene with this thought-provoking debut thriller that will have readers wondering until the very end. Detective Sergeant William Fawkes has recently returned to the Metropolitan Police Force after a significant absence. After one of his cases—the Cremation Killer—went to trial and the accused was found not guilty, Fawkes took measures into his own hands. The loss still haunts him and he feels the pain of it every day. When his colleagues are called to a murder scene close to his home, Fawkes is curious what’s turned up. What they discover is as sadistic as it is curious; a body of parts sewn together to create a single whole. Fawkes is pulled into the middle, hoping to identify the various parts and discover if they are other murder victims. When Fawkes’ ex-wife, a journalist, receives a list of future murders and dates they will be completed, everyone takes notice. Most interesting of all, Fawkes is listed as the final victim, a fortnight away. The team rushes to locate the potential victims and provide protection, though this killer is conniving and has a way around all the usual measures that are taken. With each passing day, another victim is that much closer to being crossed off the list, including Fawkes, who has no clear idea what awaits him. This might be one killer who cannot be stopped until the ultimate revenge has been accomplished. Cole offers up a wonderful story that keeps the reader’s attention throughout. Solving the crime is only half the battle and those who enjoy the genre ought to give this one a try.I enjoy new authors who wish to elbow their way onto the scene in sensational fashion. Daniel Cole does just that, though there are some who surely cannot stomach his work. I’ve always said that not all books are to the liking of everyone, which does not diminish either the book or the reader. In this instance, Cole seeks to pull William Fawkes into the middle of this story and show his merit. Fawkes is a man who is addled with guilt for past failures while also being determined to get to the root of the case, no matter its level of difficulty. He does not like to ‘colour in the lines’, but does seem to get results, even when things seem hopeless. This could be both his greatest asset and most significant downfall. Others around him help create a tension-filled experience, working in unison at times or providing firm roadblocks around which Fawkes will have to navigate. Cases such as these require a strong villain, one who can fan the flames and keep the reader wondering what awaits them as the narrative continues. The sensational discovery of the ‘rag doll’ is surely something that hooked the reader, though it is the intricacies surrounding the various victims makes for an interesting sub-plot. The story is decent and flows well, though there are times when things become slow and some readers (mentioned above) may have chosen to bow out when the going got rough. Still, there is significant intrigue, which kept me wanting to push forward to discover how it all ‘stitched’ itself together. Cole has done well to lay the groundwork for an interesting series and I will read the follow-up novel to see how things progress with Fawkes and the rest of the Metropolitan crew. Kudos, Mr. Cole, for this wonderful debut. You’ve received a great deal of hype and I can see how many have come to love you work. I am eager to see if the second novel is as exciting as this one became. Love/hate the review? An ever-growing collection of others appears at: http://pecheyponderings.wordpress.com/A Book for All Seasons, a different sort of Book Challenge: https://www.goodreads.com/group/show/..."}, {"userName": "Sue", "userReviewDate": "Feb 08, 2017", "userURL": "http://www.goodreads.com/user/show/3908840-sue", "userReview": "RAGDOLL by Daniel Cole is a brilliant debut novel that began as a rejected TV screenplay, that was later adopted to a novel. I am so glad the story was told. This novel reminded me of SE7EN but with dark humour throughout. This novel is not for the squeamish.“The Cremation Killer”, as the press had dubbed him had become London’s most prolific serial killer in history…27 victims in 27 days…each a female prostitute between the ages of fourteen and sixteen.Then eighteen days after the final murder, Detective William Oliver Layton-Fawkes (Nicknamed WOLF) was the arresting officer of Naguib Khalid, a British Sunni Muslin of Pakistani origin, working as a taxi driver in the capital. But Wolf was accused of arresting Khalid, without reliable evidence as a means to close the case. At the end of the trial, the accused was found not guilty.Wolf knew that Khalid was the Cremation Killer. What Wolf did on the case, (planting evidence and assaulting the prisoner) while it was wrong…he did for the right reasons. No one stood by Wolf when he cracked under pressure. He lost everything including his marriage and went to rehab.Four years later, Detective William 'Wolf' Fawkes, recently reinstated to the London Met, and his former partner Detective Helen Baxter are assigned to a new horrific case. Baxter has inherited a 25 year old rookie, a transfer from Fraud, a trainee. Baxter was not impressed and was waiting for him to be transferred back to Fraud!“A body is discovered with the dismembered parts of six victims stitched together like a puppet, nicknamed by the press as the 'ragdoll'.” ONE DEAD BODY-6 VICTIMSThe victim is pointing in the direction of Wolf’s flat. What is the link to Wolf? Detective Sergeant William Hawkes and part of the team are assigned to investigate the multiple homicides and identify the victims.“The 'Ragdoll Killer' taunts the police by releasing a list of names to the media, and the dates on which he intends to murder them.”Will Fawkes and Baxter be able to save the victims on the list? Who is the Ragdoll Killer?I was so impressed with this debut novel with its fast-paced complex plot full of great characters with an abundance of black humour. Definitely one of the best crime books I’ve read in quite some time, a easy 5 Star Rating!Many thanks to Daniel Cole, Orion/Trapeze, and Netgalley for this ARC."}, {"userName": "Rachel Hall", "userReviewDate": "Dec 09, 2017", "userURL": "http://www.goodreads.com/user/show/28372189-rachel-hall", "userReview": "After all that hype surrounding Ragdoll, the debut release by Daniel Cole, the novel turned out to be ‘all fur coat and no knickers’, which for anyone not familiar with the idiom roughly translates as all style but very little substance. My two star rating reflects the tantalising premise which has such obvious potential and the unexpected finale, as in between this is all gimmick with one-dimensional flawed detectives, an uncoordinated plot and every crime fiction cliché in the book complete with woeful black humour that stopped raising a smile circa 1980! Admittedly I was expecting to read a dark and twisted serial killer hunt with some realistic insight into the police approach and credible characters, but sadly I found the tone of the novel rather off-putting. Despite a supposedly depraved serial killer on the loose, the narrative is rather jokey and far too breezy to sit well and the emphasis is largely on nailing another tired comedy routine, meaning that in terms of actual plot substance Ragdoll just doesn’t hang together very well with negligible character development throughout.Ragdoll opens with an ominous prologue when Naguib Khalid, the man whom the press have dubbed ‘The Cremation Killer’, is found not guilty of murdering twenty-seven prostitutes in twenty-seven days at the infamous Old Bailey. As controversial arresting officer Detective Sergeant William Oliver Layton-Fawkes (Wolf) watches a man he firmly believes to be guilty walk free, he throws himself into the dock and brutally assaults the defendant, taking the man to within an inch of his life. Given that the undoing of the case has much to do with allegations of police brutality and the media portrayal of Wolf as an ‘obsessed’ maniac with a chaotic lifestyle his behaviour should have earned him a one-way ticket out of the Met. In life, undoubtedly so, but in the world of crime fiction, not a cat in hell’s chance! Instead fast-forward four years and after a spell in a psychiatric hospital a vindicated DS Fawkes has been reinstated and for a detective sergeant with a chequered past he seems to wield a disproportionately large amount of power within the Homicide and Serious Crimes Unit at New Scotland Yard. At least his next case is close to home though, given that the corpse he is called out to is located in the block opposite his dismal newly rented flat. The corpse, consisting of one body but the parts of six victims is sewn together like a puppet and wired up with a finger pointing into the direction of Wolf’s window opposite. Sound personal?! Most definitely. For starters, the face appears be that of ‘The Cremation Killer’, but as far as Wolf knew he was behind bars and going nowhere.. As for identifying the rest of the appendages, a combination of patience and luck are required. Hindered by an obnoxious sidekick, DS Emily Baxter, Wolf seems to be lacking in knowledge of police procedures because there seems to be no plan of action or rationale to an uncoordinated campaign. It comes to something when the new recruit to the team, DC Alex Edmunds (ludicrously temporarily promoted to criminal profiler), seems to have more idea that DCI Simmons, Wolf and DS Baxter put together. As if this wasn’t enough Wolf’s ex-wife, journalist Andrea Hall is on hand to derail things even further when the killer starts sending sending her missives, the most incendiary of which are the crime scene photos and the list of the next six victims with the dates on which that the ‘Ragdoll Killer’ intends them to die, all of which seamlessly flows into the public eye. Last on the list is Wolf and despite the obvious links to ‘The Cremation Killer’, the team struggle to identify what specifically connects the group of unfortunate victims together, further still, how does it all lead back to Wolf? The police response is very haphazard and it is obvious from reading Ragdoll that Daniel Cole’s knowledge has been cobbled together from simply reading crime fiction as there is no structured plan of attack whatsoever. From trying to identify a shade of nail varnish at beauty counters to sending X-rays to hospitals to identify a possible patient, much of the investigation comes across as tongue in cheek teenage humour going from one development to the next without any sense of logic or joining of dots. With the plot so disorganised, suspense never even featured for me because I had no idea which left field direction Daniel Cole’s attention would wander to next. Some might view this as audacious twists, but for me it just felt incoherent and like an author grasping at straws to hold the readers attention. With the next six victims publicly named the whole investigation descends into a media frenzy with all eyes on Wolf and him doing very little, apart from behaving like the damaged maverick trope he is no doubt intended to be. After just three months out of Fraud it is a relief that new boy DC Edmunds shows some nous and does something other than being rude, endangering lives or giving the press another expose and manages some investigative work. Sadly I just found Ragdoll a little fantastical for my liking given that the perpetrator is depicted as having an endless arsenal of resources and carefully times multiple incidents to perfection. I confess that I found lead protagonist, Wolf, like so many other boringly damaged detectives in crime fiction whose personality is singularly one-dimensional, although I believe the reader is supposed to interpret this as ‘complicated’ and be in awe of his struggles. Even with flashbacks to his experiences in St. Ann’s hospital for psychiatric assessment in 2010 it is hard to discern much about him other than he universally believes his own hype. DS Emily Baxter and ex-wife, Andrea, make much of lamenting on Wolf’s mental health and speculating that this could be the case that sees him self-destruct, but I think most readers would prefer to come to that judgement themselves and the old adage, show not tell, would do wonders to improve his characterisation. As for DS Emily Baxter, she is the epitome of a potty-mouthed stroppy young woman and performs not one iota of police work to justify her worth and clings to Wolf like a limpet. The prose is amateur and very clunky, the action sporadic and Cole’s banal attempt at irreverent black humour grates as he trots out every old gag under the sun, yet it can’t hide the fact that between an intriguing premise and a surprising conclusion there is little standout about this debut, excluding the Twitter campaign surrounding its publication. The action is fast moving but without much rationale to the investigation readers will need to pay attention to avoid confusion, and even then Ragdoll struggles to rise above anything but dull. I expect readers own moral compass will have some influence on how they enjoy this story and indeed the denouement, which will divide readers, but for me it was it was just another ridiculous occurrence is a novel which is littered with them and bears little relation to anything in real life.Needless to say, I shall not be sticking around for the second book, Hangman, and have no wish to encounter either Wolf or DS Emily Baxter again. Overall Ragdoll was far too much of a comedy crime caper to really hold my interest and I disagree with the comment that it is not for the faint-hearted because there is so little context to the body count that the reader might as well be perusing a grocery shopping list. Lacking in credibility and somewhat puerile, Ragdoll left me frustrated and dissatisfied."}, {"userName": "Carolyn", "userReviewDate": "Feb 13, 2017", "userURL": "http://www.goodreads.com/user/show/19559507-carolyn", "userReview": "I think this is going to be one of the most memorable crime novels of 2017. It is dark and gory but highly unforgetable with flashes of black humour. First there is the 'ragdoll', the body composed of the body parts of six different victims stitched together. Who are these victims and why were they killed? Then there is the hit list of six people with dates of when they will be killed. Why these people and is there a connection with the ragdoll? Thus starts a race against time to identify the body parts, discover why they were murdered and see if the killer can be found before the next six victims are killed. For Detective William Fawkes, otherwise known as Wolf, this is his first case back after being reinstated following his attempt to kill a man on trial in court who he passionately believed was a serial killer after the jury returned a not guilty verdict. Now the world and it's media is watching his every move and every mistake in this high powered, action packed case. So, never a dull moment in this clever plot. Lots of unexpected death scenes, unexpected humour and enough twists to satisfy most. Wolf is a great character, a flawed human being who cares about others including his ex wife, the gutsy journalist Andrea Fawkes as well as his ex partner Emily Baxter and her new partner, Edmunds recently transferred from Vice, who is smart and intuitive. Highly recommended!With thanks to NetGalley and Hachette Australia for a digital copy of the book to read and review and also for a copy of the book won in a Goodreads giveaway"}, {"userName": "PattyMacDotComma", "userReviewDate": "Apr 30, 2017", "userURL": "http://www.goodreads.com/user/show/1128612-pattymacdotcomma", "userReview": "4.5★Loved this one, and enjoyed the backstory from the author, who was inspired by the TV series 24 with the intrepid, indomitable, seemingly indestructible Jack Bauer, who dies, is resuscitated, etc. If you’ve seen it, you know.Cole wrote this originally as a screenplay (and it would make a GREAT one) and finally turned it into a novel. What a good idea that was! I still think it would make the first of many movies about Detective William Oliver Layton-Fawkes, known by his initials/nickname, Wolf.He’s a big, bloke, apparently attractive to women (some, anyway), and an impulsive, angry man who is driven to mete out violent punishment himself when the justice system fails. Andrea is his beautiful ex-wife, a well-known TV presenter with a new, rich partner, although she still considers Wolf her best friend and most trusted confidante. Their split is no surprise. As DS Baxter warns newcomer Edmunds, who has transferred from Fraud to this high-pressure squad:“‘Marriage. Detective. Divorce. Ask anyone in this room. Marriage. Detective. Divorce . . . Oh hello, this is Detective Sergeant Baxter with the . . .’”See? She didn’t even have time to finish talking to him before she was interrupted, and he discovers the reality of 24/7 policing when hunting a serial killer.I liked both Baxter and Edmunds. She’s got a longstanding police partnership with Wolf, which his wife always suspected was more, and in many ways it was. Edmunds comes across as a clean-cut straight-arrow with a perfectly nice fiancée who’s not happy about his transfer, so he ends up on the sofa a fair bit, no doubt thinking marriage, detective, divorce until he falls asleep, exhausted. They are all always exhausted.There are flashbacks to a few years earlier with a case where the killer went free, Wolf went a bit mad, and life took a turn for the worse for him. Now, several people have been murdered and stitched together to the killer’s head. ACK! When the killer gives the media a list of the next victims and the dates they will die, we meet Andrea. Everything she does seems to escalate the danger and the damage, and Wolf is the last name on the list. The hunt, the chase, the characters are engaging, and the repartee is fun. I’m quoting from my pre-publication copy, so quotes may have changed in the final version. Early in the piece, the cops tackle a man carrying a plain bag.“The DPG officer kept the gun trained on the man and backed towards the bag. He cautiously knelt down beside it and then very, very slowly peered inside. ‘We’ve got some sort of hot wrap,’ he told Wolf, as if identifying a suspicious-looking device. ‘What flavour?’ Wolf called back. ‘What flavour?’ the officer barked. ‘Ham and cheese!’ cried the man on the floor. Wolf grinned: ‘Confiscate it.’”Wolf is old-school, hard-core police, and sensitive, clever new Edmunds has given him a USB stick.“He was growing increasingly frustrated, stubbornly refusing to admit that he had no idea how to play the CCTV footage, trapped inside the stupid little USB stick, through the television. ‘There’s a hole on the side of the telly,’ said Finlay, over fifteen years his senior, as he entered the room. ‘No, on the, down – oh, let me do it.’ Finlay removed the USB drive from an air vent on the back of the television and plugged it in. A blue menu screen materialised containing a single file.But not all modern technology is what it’s cracked up to be when looking over CCTV footage (name omitted to prevent possible spoiler).“‘What about facial recognition?’ ‘You’re joking right?’ laughed Baxter. ‘So far, it’s flagged XX up three times. One was an old Chinese woman, the second was a puddle, and the third was a poster of Justin Bieber!’”Some black humour about a person in protection whom they don’t really like anyway, (name omitted again):“‘Sorry,’ said Edmunds. ‘I’ve got a Constable Castagna on the phone for you about XX.’ ‘I’ll call them back,’ said Wolf. ‘Apparently he’s threatening to jump out of the window.’ ‘Constable Castagna or XX?’ ‘XX.’ ‘To escape or kill himself?’ ‘Fourth floor, so fifty-fifty.’ Wolf smiled at this, and Baxter watched his transformation back into his normal, irreverent self.”But we never lose sight of what a serious business it really is, especially as the detectives rummage through old files in archives, trying to find links, with “the distressing realisation that each and every one of the uniform boxes represented a life lost, lives ruined, all lined up in a tidy row and enjoying the respectful silence like graves in a catacomb.”The plot is complicated, the murders are complex, and I admit I got a bit confused here and there, but I think that was my fault, not the author’s. It was terrific and the half-star missing is only because of some occasional lapses of style that probably won’t bother anybody else (and may even have changed in final editing), so I’m rounding it up. 😊And it would be remiss of me in the extreme not to say you really won't see this twist coming!Many thanks to NetGalley and Trapeze/Hachette Australia for the copy for review. The quotes I’ve used may have changed in the final version."}, {"userName": "Laura", "userReviewDate": "Mar 29, 2017", "userURL": "http://www.goodreads.com/user/show/31923026-laura", "userReview": "One body. Six victims. A body part from each sewn together making one complete body. It's a twisted crime, but there is more to it than Detective William Fawkes, also known as Wolf, initially thinks.Wolf was the arresting officer at the center of a controversy. This is his first case back after recently being reinstated. He was suspended and spent time in a mental hospital following his assault of the Cremation Killer (killed 27 girls in 27 days between the ages of 14 & 16) when the verdict was announced not guilty despite him knowing the guy was in fact guilty. Seems they don't take it too kindly when the arresting officer assaults a just recently announced as innocent man in court. He lost everything that day including his marriage and reputation.Now, the crime in question has odd ties to Wolf. The body publicly referred to as \"ragdoll\" was pointing in Wolf's apartment. And his reporter ex-wife was sent photos anonymously by the killer along with a hit list of six names with dates. The last name on the list is Wolf's. This case is more personal than anyone knows.This being the first in the series is exciting because the characters are fantastically flawed and complex. I enjoyed reading both Wolf and Baxter's perspectives, as well as Andrea and Edmunds. The writing is clever managing to blend the dark mystery with this nice layer of humor. It was all quite brilliant. Sometimes the POV changes within the chapter several times and can get confusing. The voices all felt pretty distinct which helps. I am excited that the sequel is supposed to focus on Baxter as I'd love to learn more about her. If you like engaging, unpredictable thrillers, you might really like this one."}, {"userName": "Sharon Bolton", "userReviewDate": "Mar 04, 2017", "userURL": "http://www.goodreads.com/user/show/6225577-sharon-bolton", "userReview": "Detective Sergeant William Oliver Layton Fawkes hasn’t long been reinstated in his job with the metropolitan police. After attacking and harming a suspect in the Old Bailey, seconds after a not-guilty verdict, Wolf and most of his friends understandably thought his career was over. Sectioned, losing his home and his wife, Wolf’s life had pretty much ground to a halt. But then the same suspect was caught red-handed, on the scene of another murder and Wolf was largely vindicated. He was allowed back, possibly hoping for a quieter life. Not a bit of it, because just across the street from his new flat, a gruesome stitched-together corpse is discovered hanging from the ceiling. At least one of the body parts, the head, belonged to the very man Wolf nearly served time for. Within hours a message is received by Wolf’s ex wife, a tv journalist, listing the next victims, starting with the mayor of London and culminating with Wolfe himself. The police investigation becomes some sort of bizarre reality TV show, all conducted in the public eye, with the world’s press running a grotesque live count down to the next murder. It’s not for the faint-hearted, but it is original, fast paced and full of surprises."}, {"userName": "Brenda", "userReviewDate": "Feb 18, 2017", "userURL": "http://www.goodreads.com/user/show/2337007-brenda", "userReview": "4.5★sThe recently reinstated Detective William Fawkes (known as Wolf by all) was thrust into what the media dubbed the Ragdoll murder – a “body” made up of six different body parts. The killer had dismembered his victims, roughly sewing them together to make one – a “ragdoll”. But that wasn’t the worst of it… Wolf’s ex-partner Detective Emily Baxter and her offsider, Detective Alex Edmunds worked the case, alongside Wolf and other team members. Finding who the six victims were was a priority; but it was when a list of names was released to the media - their murder dates written neatly alongside, that the race was on. Knowing they had to protect the people on the list at all cost meant the force was stretched to the limit. And in the meantime, Wolf was struggling – his temper; never the best to control – was on show often. Was Wolf losing control of the situation? Would the killer better the police? Not on Wolf and his diligent team’s watch – of that he was determined!Ragdoll is the debut novel by Daniel Cole and wow! The pace is electric; the tension gripping. The pages seemed to turn themselves – and I am so pleased to know this is book #1 in the new Detective William Fawkes series. Highly recommended.With thanks to NetGalley and the publisher for my copy to read and review."}, {"userName": "Emma", "userReviewDate": "Sep 02, 2016", "userURL": "http://www.goodreads.com/user/show/28602001-emma", "userReview": "This is one of those books you see all over social media with glowing reviews and all the stars.I have to say that they're right. Gory, inventive deaths that very much reminded me of Chris Carter, with a clever plot, and some properly 's**t this could go either way moments', this book is going to be HUGE.Loved the way it took turns I wasn't expecting and the last 10% was tense enough to bring on heart palpitations. This better be the first in a series Daniel Cole, I want to see Wolf again soon! I'll write a more in depth review closer to the release date, but if you're a blogger/reviewer, get your hands on this one if you can beg, borrow, or steal a copy.Massive thanks to Daniel Cole, Orion/Trapeze, and Netgalley for this copy in exchange for an honest review."}, {"userName": "Mackey St", "userReviewDate": "Nov 15, 2016", "userURL": "http://www.goodreads.com/user/show/28470777-mackey-st", "userReview": "Ragdoll is the debut book from author Daniel Cole and what a fabulous debut it is! I absolutely loved this book..... right up to nearly the end.  I easily could have given this book a 5Star rating but the ending was so drawn out that he quite literally lost me. I ended up skimming the last pages just to finish and I hate that because the rest of the book was brilliant. The story begins with the ending of the trial of the Cremation Killer, a serial killer that is thought to be wrongfully accused, is released only to kill again. The detective in charge attacks the killer, all hell breaks loose and the detective ends up in mental care. However, we don't get these flash back until the latter part of the book so consider yourself semi-spoiled at this point although knowing this only tells you what I wish I had known earlier on in the book! Once the detective is reinstated, a body is discovered in a flat across from the detective's own flat, pieced together from six dead bodies like a \"ragdoll.\" The media and ultimately the cops are given the names of six more \"victims to be\" all linked to the Cremation Killer - or to the detective - or BOTH. And the race is on to save the victims, to discover the killer, to help this detective keep his sanity. This book is fabulously written; the details and characters are beautifully drawn for you, the reader. If I had to write a review at the halfway point I would not have been able to sing its praises high enough. However, the flashbacks were added at three-quarters of the way through the book which was too late in opinion. The actual \"final scene\" was sooooooo detailed and drawn out that I just wanted to scream \"ENOUGH ALREADY,\" and I have no idea if there really will be more books to follow or not but I was left with a feeling of non-resolution. To be fair - I really do recommend this book and others have wildly adored it. I hope there is more to the series than this and the story of William Fawkes continues, but beware that the ending is unsatisfying."}, {"userName": "Lisa", "userReviewDate": "Jul 12, 2017", "userURL": "http://www.goodreads.com/user/show/32081931-lisa", "userReview": "I cant stop thinking about this book I just loved every delicious minute of Ragdoll by Daniel Cole I just could not get enough of Detective William Fawkes found him a well written character who was a bit on the dark side which made the premise roll along at a fast pace, its gritty, dark compelling & quite frightening at times.Ragdoll starts 4 years earlier with THE CREMATION KILLER it should have been an open & shut case but wasn't so in comes detective Fawkes ( AKA WOLF) to investigate a body found with 6 different body parts all six victims have been sewn together macabre I know but WHO ARE THE VICTIMS & WHAT IS THE CONNECTION TO THE CREMATION KILLINGS!!!!!As the investigation progresses all leads are pointing towards Wolf's apartment DOES HE HAVE A CONNECTION TO THE RADOLL KILLINGSOR DOES THE KILLER WANT TO GET INSIDE HIS HEAD SENDING HIM MAD??the ending was quite a manic read as Fawkes past came back to haunt him it was an awesome ending which sets the premise for the second ion the series which comes out next year,There is a lot more I want to tell you but I could be here all night this was a real page turner & a must for anyone who likes a dark gritty crime thriller that leaves you on the edge of your seat."}, {"userName": "Astrid Langeveld", "userReviewDate": "Feb 09, 2017", "userURL": "http://www.goodreads.com/user/show/31644674-astrid-langeveld", "userReview": "Ik mocht dit boek lezen voor de ls sterrenthriller leesclub in ruil voor een recensie. De omslagfoto is apart en past echt goed bij het verhaal. Het rode draad loopt ook door in het boek. Dit gaf een extra dimensie aan het verhaal. Iedere keer dat ik het draad zag zag ik de lappenpop voor mij. Het verhaal gaat over een omstreden rechercheur Wolf en zijn collega's Emily Baxter en Alex Edmunds die de meest bizarre zaak ooit moeten zien op te lossen. Een lijk dat aan elkaar is genaaid als een menselijke pop door middel van diverse lichaamsdelen van zes slachtoffers. Een lijk dat in de pers al snel 'de lappenpop' wordt genoemd. Het verhaal heeft vaart en je wil het echt in 1x uitlezen! Er zat ook een verrassende plotwending in. Ik kon echt niet raden wie de dader was. Ik vind het begrijpelijk dat dit verfilmd wordt. Ik kan mij niet voorstellen dat dit het eerste boek van deze schrijver is. Het is echt goed en spannend! Ik ben echt fan van deze schrijver! Wow echt een aanrader!"}, {"userName": "Louise Wilson", "userReviewDate": "Feb 14, 2017", "userURL": "http://www.goodreads.com/user/show/42343152-louise-wilson", "userReview": "A body has been found with the dismembered parts of 6 victims stitched together like a puppet. Detective William \"Wolf\" Fawkes is assigned to the case with his former partner Detective Emily Baxter.The killer taunts the police by releasing a list of names and dates that he intends to murder them to the media. Can the police catch the killer before they strike again?Wow. What a wonderful, fast paced, gory filled, well thought out plot. There is a lot of curve balls in this debut novel. Once I started reading, I knew I was not putting this one down until the end. And oh what an end it was. Can't wait to read more from this author.I would like to thank NetGalley, Orion Publishing Group and the author Daniel Cole for my ARC in exchange for an honest review."}, {"userName": "Liz Barnsley", "userReviewDate": "Aug 18, 2016", "userURL": "http://www.goodreads.com/user/show/16471876-liz-barnsley", "userReview": "Ha! Ragdoll is Fast, funny, brilliantly unpredictable and scarily horrific.Loved it.One of those books that a lot of people are talking about and you go hmm. Can it really be that good? Well if you like your crime novels to be indecently clever, terribly addictive, with a twist of horror and a huge dose of dark humour then yep it really can be that good.It was.ANYWAY characters? Yep got some of those in here, some utterly fantastic ones, none of whom seem to follow your usual tropes or if they do they do so in irregular and unlikely fashion. With style. Wolfe well, you never really know what he is going to do. It makes it beautifully engaging. Taking a cue from a note from the author , I thought Wolfe was a bit Jack Bauer on acid with better occasional wisecracks. I fell a little in love. Emily Baxter his one time sidekick is well, she just is. Then the whole police team around those two have their own little weather patterns and externally you have news people(including wife Andrea – oops I mean EX of course) and possible victims and what have you, all entirely fascinating. Even if some of them did make me want to hide under the bed never to emerge again.The dialogue crackles, the plot is beautifully woven to keep you guessing, although I gave up guessing around the middle of the book and just went along for the ride. It was a topsy turvy joy of a read that never once let up in quality or stimulation and it was a rocking rollercoaster from start to finish. With body parts. And blood. And death. And giggles. And Wolfe.And WHAT an ending.Ragdoll? Yep yep and yep. Is what I have to say. This time the hype for me was justified. Its just good fun people! Even if the subject matter is the stuff of nightmares. Oh and by the way, great take on human nature here. If you are thinking this is all popcorn no depth think again. Works on many levels. Many many levels. Can’t wait for more from Daniel Cole."}, {"userName": "Chloe", "userReviewDate": "Apr 12, 2017", "userURL": "http://www.goodreads.com/user/show/7825836-chloe", "userReview": "Detective William “Wolf” Fawkes gets a call about a stitched up corpse made up of six victims named the 'Ragdoll'. He has recently been reinstated at his job after attacking ‘The Cremation Killer” in court. Wolf is assigned this case with his old partner Emily Baxter . Within hours of Ragdoll murder the killer releases list of names and dates that he intends to murder to Wolf’s ex wife ,a T.V . journalist with Wolf’s name being last on the list. Will Wolf and Emily catch the killer on time before he gets any more victims and claims the final prize?I was approved for the Ragdoll sampler and had to buy it as soon as it was on sale. It is a dark book with satirical humor and great complex well developed flawed characters. A definite must read for all mystery lovers.Many thanks to the publisher & NetGalley for this sample copy in exchange for my honest and fair review.This and more reviews at https://chloesbooksblog.wordpress.com/"}, {"userName": "Melissa Souza", "userReviewDate": "Feb 12, 2017", "userURL": "http://www.goodreads.com/user/show/40579850-melissa-souza", "userReview": "**Thank you to Hachette Australia and Netgalley for providing me with an ARC of this book in return for an honest review.3 stars!!! When I first checked out the synopsis for this book, I was completely reeled in, I have to admit. I am a huge fan of British crime and I was sincerely looking forward to reading a novel about a serial killer. I truly wanted to add this book to my list of favourites. But, unfortunately, the story didn't live up to my expectations and the reasons are as follows.To give a brief outline of the novel, the story is centered around a prolific serial killer that murders 6 victims and their dismembered parts are grotesquely stitched together to create a puppet masterpiece. Thus, earning them the nickname the \"Ragdoll\" killer. It is up to Detective Fawkes aka Wolf to figure about who is behind this gruesome act before more bodies keep piling up. Sounds interesting right? Unfortunately that's where it ends.I have to admit there are parts to this book that I did like. I loved the plot twists a lot. The pace of the novel is brisk and each twist/turn left me gaping. I wanted to figure out who did it and how they would be caught. I also didn't mind the characters too much as I felt we get a good glimpse of who they are at work and we also get a glimpse of their personal lives. This helped in building well rounded people and we understood how each one functioned or thought. The dialogue in the novel was not too intense either. We get snippets of humour, sarcasm and as well intense moments. I especially loved the police procedural aspects of the story and liked seeing the point of view from the media. However, there were also major flaws because of this.One was that the story was way too focused on the detective work and the whodunnit parts that a major angle was neglected. The POV of the killer. So what we get is how the killer is caught and how he kills the victims. But we do not get the inner workings of the Unsub's mind. I really think that this would have elevated the novel further.Second was that there were constant POV shifts within a chapter which gets rather distracting after a while. I think one or two in each section is fine but sometimes you got 4 character shifts and then as a reader, you are trying to piece together the story without fully appreciating the plot. Thirdly, I found the ending a bit too far fetched and rushed. The ending was extremely unsatisfying. The reveal of the killer left me with a bleh feeling which is the only way I can describe it. It was not thrilling or intense. While his motive behind it wasn't even realistic. I was really expecting more. But, I wasn't blown away.All in all, I would say the book is a promising start to the series. But, I guess I am not a huge fan of DS Will Fawkes. I'd recommend the book, if you wish to pass the time, but then again some of you might enjoy it, if you are looking for a straightforward mystery."}, {"userName": "Susan", "userReviewDate": "Dec 04, 2016", "userURL": "http://www.goodreads.com/user/show/5837456-susan", "userReview": "This debut novel began life as an unproduced television pilot. However, as Daniel Cole was having no luck as a scriptwriter, he turned this script into a novel and I suspect it will soon see life in its original form, as this is a riveting, page turning, fast moving read – with great plot twists and lots of excitement. Although written originally for the screen though, Cole is an excellent author and this is a novel with depth and good characters. The story begins in 2010, when Detective William Oliver Layton-Fawkes (known as ‘Wolf’) is in court for the trial of ‘The Cremation Killer’ – London’s most prolific serial killer, Naguib Khalid. It was a case which appeared straightforward and then fell apart and, with it, so did Wolf’s career. When we catch up with him again, four years later, he has recently returned to work; although both his life and career fell apart in the fallout of the case. He is now divorced from beautiful newsreader, Andrea, and has relocated to a rundown block of flats. One evening, he is called to a murder opposite his own flat – where he finds six body pieces strung up in a bizarre, horrifying parody of a body, with the finger pointing at his window. Detective Sergeant Emily Baxter and new recruit, Edmunds, are in charge of the case. However, Emily and Wolf have a lot of history together and it seems that the ‘Ragdoll’ murder case and Wolf are also linked. Despite demotion, with his reputation ruined, it seems that only Wolf holds the key to the case and the lives that are at stake. For there is a list with names of future victims and even the dates on which they will be killed – and while Wolf’s ex-wife is ready to publicise the case and further her career, it seems that Wolf himself is on the list…This is a real roller coaster of a ride – with more and more imaginative deaths and some really gory scenes. However, despite all the violence, this is also a really darkly funny read. Wolf himself is a wonderful character and so are the other members of the squad. I particularly liked Edmunds; desperate to prove himself in homicide, while trying to appease his pregnant girlfriend, and the hard drinking Baxter. Andrea is also offers a different perspective, as she tries to balance a career in the beauty and youth obsessed media, with the feelings she still has for her ex-husband. If you like fast moving, intelligent thrillers, you will love this. I received a copy of this book from the publisher, via NetGalley, for review."}, {"userName": "Kate~Bibliophile Book Club", "userReviewDate": "Aug 08, 2016", "userURL": "http://www.goodreads.com/user/show/9841866-kate-bibliophile-book-club", "userReview": "I had seen Ragdoll on social media in recent weeks and immediately added it to my watch list, and I am so glad I did because it is absolutely brilliant!I love gory and gruesome in books, and I make no apologies for that, so to open with a body made up of different peoples body parts definitely grabbed my attention! So much so that I devoured Ragdoll in less than 24 hours, I just couldn’t put it down.When I was raving about it to my husband, he said it sounds like it could be a movie or a tv show, and that’s exactly where Ragdoll’s background is. Daniel Cole has effortlessly transformed his writing into a gripping, twisted game of cat and mouse between the pages.The characters are all really well written too. I am super excited to read more about Wolf because he is by far the most interesting and beautifully flawed Detective that I have encountered in a long time. And don’t even get me started on the Ragdoll Killer because that is one twisted antagonist, in the best possible way.I don’t want to give too much away about the story, but it went in directions that I just wasn’t expecting. I found myself questioning everyone’s motives and I’m pretty sure I got it wrong every time!To say I enjoyed Ragdoll would be an understatement! It consumed me while I read it. Definitely one of the best crime books I’ve read in quite some time, with an excellent premise and some darkly humorous moments I cannot recommend it highly enough! One to watch for certain!"}, {"userName": "Jules", "userReviewDate": "Feb 09, 2017", "userURL": "http://www.goodreads.com/user/show/4824134-jules", "userReview": "Ragdoll was an okay read for me, but I didn’t love it.I liked the 6-part victim, known as the ragdoll (shudder!), the fact that despite it being rather dark and gruesome in places, there was also some humour within the pages of this story. It made for an interesting mix. I also found Wolf (who is a man and not an actual wolf) to be an intriguing character. I saw Bon Jovi live in 1993, when I was just 15 years old, so Wolf’s t-shirt made me feel nostalgic.I read this book due to others loving it so much. However, I’m not really a crime fan, and I should really remember this when looking at reviews and being tempted by other people’s excitement, as this was far too police procedural for me, which generally makes me lose the will to live. Having said that, I’m convinced that many crime fiction fans out there will absolutely love this book, especially if you enjoy action packed police procedurals."}, {"userName": "Maxine (Booklover Catlady)", "userReviewDate": "Sep 09, 2016", "userURL": "http://www.goodreads.com/user/show/22943325-maxine-booklover-catlady", "userReview": "Brilliant, exceptionally good. Don't miss it. Full review to come."}, {"userName": "BookwormDH", "userReviewDate": "Feb 22, 2017", "userURL": "http://www.goodreads.com/user/show/4582587-bookwormdh", "userReview": "BLURBA body is discovered with the dismembered parts of six victims stitched together, nicknamed by the press as the 'Ragdoll'. Assigned to the shocking case are Detective William 'Wolf' Fawkes, recently reinstated to the London Met, and his former partner, Detective Emily Baxter.The 'Ragdoll Killer' taunts the police by releasing a list of names to the media, and the dates on which he intends to murder them. With six people to save, can Fawkes and Baxter catch a killer when the world is watching their every move?MY THOUGHTSThis is a great debut that throws a massive punch! An extremely fast-paced thriller that had me glued to the pages. A book that will definitely stay with me for a while.Detective William 'Wolf' Fawkes is re-instated to the London Met after his outlandish escapades have his colleagues and seniors seriously concerned about his state of mind. Wolf's methods have never been orthodox, but for him and the killer, this is personal, and Wolf has to be involved if they are going to catch the 'Ragdoll Killer'The writing is very clever and the characters in the main are developed. There is a great deal of humour thrown into the mix which works very well alongside a gritty storyline. It kind of reminded me of 'No Offence' a TV police drama with a quirky twist. There are very, very funny moments throughout the novel.Although the story is outlandishly unbelievable, this is a highly entertaining and fun read. It's massively addictive and I found it very hard to put down. It's rather astonishing that this is a debut and it reads like an established author.Overall, this is a book to read if you are looking for some high-octane, adrenaline-fueled, exciting, fun entertainment. I most definitely recommend this!!"}, {"userName": "Brenda", "userReviewDate": "May 15, 2017", "userURL": "http://www.goodreads.com/user/show/9339689-brenda", "userReview": "Impressive debut of what promises to be a terrific & addictive series. This author is worth keeping an eye on. I'm already anticipating book #2. Giving this 4.5 stars."}], "description": "William Fawkes, um controverso detective conhecido por Wolf, acabou de ser reintegrado no seu posto após ter sido suspenso por agressão a um suspeito.Quando um corpo formado pelos membros de seis vítimas, suturados de modo a formar uma marioneta, que ficou conhecida como Boneca de Trapos, Fawkes tem a certeza que aquele é o grande caso que aguardava.Boneca de Trapos é o mais promissor dos thrillers na literatura policial contemporânea.", "title": "Boneca de Trapos\n      \n          (Fawkes and Baxter #1)", "url": "http://www.goodreads.com/book/show/38719949-boneca-de-trapos", "average": 3.9, "cover": "https://images.gr-assets.com/books/1519299683l/38719949.jpg", "reviews": 1120, "authors": [{"url": "https://www.goodreads.com/author/show/7055351.Daniel_Cole", "name": "Daniel Cole"}], "type": ["Thriller", "Mystery", "Mystery", "Fiction", "Thriller"], "outlinks": ["http://www.goodreads.com/book/show/38719949-boneca-de-trapos", "http://www.goodreads.com/book/show/30259893-ragdoll", "http://www.goodreads.com/book/show/33223378-ragdoll", "http://www.goodreads.com/book/show/30259898-ragdoll", "http://www.goodreads.com/book/show/31673769-ragdoll", "http://www.goodreads.com/book/show/34253250-ragdoll", "http://www.goodreads.com/book/show/30653986-ragdoll", "http://www.goodreads.com/book/show/30988074-ragdoll", "http://www.goodreads.com/book/show/35098682-hangman", "http://www.goodreads.com/book/show/40235603-hangman-das-spiel-des-m-rders", "http://www.goodreads.com/book/show/36561795-untitled"]}