{"ratings": 179, "userreviews": [{"userName": "Emma", "userReviewDate": "May 21, 2018", "userURL": "http://www.goodreads.com/user/show/28602001-emma", "userReview": "Second in the Foundling series, Bone Driven picks up about a week after the violent and emotional finale of Bayou Born. There isn’t any kind of leisurely intro and if you haven’t read the first book, there’s no way you’ll get all the nuances of this one. Even if you have, initially there’s still that slight feeling of being lost, though that might be because I read the first book last year. After glancing at the initial page, I put the book right down and did a mini recap for myself so I could I got properly into it. And boy, did I ever. I love this Coterie and despite a few quibbles, I am all in to this series.Bayou Born was all about discovery as small town cop, Luce Boudreau, finds out just why she’s always been different. Now come the consequences. Trapped between two worlds, she struggles to do what she has to to survive, whilst keeping her newfound secrets from those she loves, especially once a new arson/murder case brings everything crashing together. What Hailey Edwards does so well here is this tension between human and supernatural worlds, and how that affects Luce and those around her. Edwards puts just as much effort and imagination into her normal, human characters as she does the demons. Luce’s cop partner, Rixton is a gem, with the kind of humour and quotable lines that had me highlighting like crazy and laughing out loud. And I don’t mean like when you text ‘lol’ but it reality you’re just sitting there with a slight smile, I mean the kind when you have to put the book down for a moment while you laugh to yourself, then read it again because you want to make sure it’s as funny as you thought- and it is. Their history and the work they do together is increasingly strained, and stained, by the lies Luce has to tell, and the resulting conflicts are rendered painfully real. Luce has such deep connections to her family and her community that when they are put under pressure by her new responsibilities, it wrenches the heart. Likewise, the individual fears of each Coterie member are gradually revealed in these delicate, personal scenes full of hope and trust that feel genuinely moving. Luce has so much to learn about her new position, but she tries so hard to give her Coterie what they need, whilst learning to take the support they offer. Even if she didn’t have a completely kickass personality and a serious dose of snark, you’d still have to respect her strength, loyalty, and honour. Her fight to remain herself, Luce, and not world destroying demon, Conquest, is easy to get behind as a reader and as it is increasingly threatened by outside forces, which grow ever more powerful and dangerous, she’s going to have to see just how close she can get to the monster inside her before it all goes to hell…My main quibble centres around the interaction between Luce and Cole. This may say more about me than anything else but I do not like the type of crowding and unnecessary leaning over Luce that happens in some scenes, the invasion of personal space, the physical trapping of one body by another makers me squirm. It doesn’t happen throughout, mostly just at the beginning, but there’s just something in it that makes me think: nope. That’s not love or protection, that’s creepy. It’s something that happens a lot in this type of book and though I see why authors use it, as some kind of enticing display of strength, but it’s the type of toxic power play I just can’t get behind. There are, at least, deeper levels here, as it represents an overturning of their relationship in previous incarnations, where Conquest literally chained Cole into a subordinate, desperate position, trapping him in every way someone can be. That would get equal rejection from me, either which way, it’s wrong. Thankfully, one of the main transitions of this book is the move towards more positive body contact and physical expression between Luce and the Coterie, as well as others- so much so that I felt the tenseness fade away. Now that i’m writing this, i’m wondering if Hailey Edwards did this on purpose and if she did, she’s even better a writer than I thought. There’s still some outrageously stalkerish behaviour by another male character as well as the usual overcrowding of supermen, which is typical for the genre, but there’s enough in this book to give these characters and relationships more validity than i’ve seen elsewhere. On top of that, it’s really fun, while retaining a true warmth that makes it stand out against the crowd.An inventive and multifaceted world with serious heart and one hell of an emotional kick, this is a series that needs to be on your TBR. (But Thom is mine…)ARC offered by publisher via Netgalley"}, {"userName": "Lady Heather ", "userReviewDate": "May 27, 2018", "userURL": "http://www.goodreads.com/user/show/2736715-lady-heather", "userReview": "***Happy Release Day!***Genre: Urban FantasyPublisher: PiatkusISBN: (ebook)ISBN: (print)eBook release: May 31, 2018Print release: May 31, 2018The Foundling, Book TwoLength: Novel\nI loved this book!This is the second book in \"The Foundling\" series.The first book is a must-read, as this story continues on from where the first book finishes.The story, characters, and writing are AMAZING!I love the world this author has created and I like where she's going with the series.The protagonist (Luce) is a complex character. I like her a lot, and I'm really enjoying reading her journey to discovering who and what she'll choose to be.I also really like the secondary characters, in particular, Luce's attraction to Cole and her relationship with her coterie.Wonderful story!Amazing series!I highly recommend this book!Buy Optionshttps://www.amazon.com/Bone-Driven-Ha...\"I voluntarily read an ARC of this book.\""}, {"userName": "Katie Michaels", "userReviewDate": "May 19, 2018", "userURL": "http://www.goodreads.com/user/show/4669344-katie-michaels", "userReview": "Loved. Review to come.*ARC provided by publisher"}, {"userName": "Michelle", "userReviewDate": "May 20, 2018", "userURL": "http://www.goodreads.com/user/show/5401664-michelle", "userReview": "Bone Driven takes Luce, the gang (coterie and Rixton), and her new NSB partner deep into a case of murder and mayhem as fires start taking lives, and they need to figure out whether Conquest and War were the only sisters who made it through to Earth. Edwards crafts some masterful character development, revealing layers to each of her characters as she builds up the mystery even more. In the midst of all of the mayhem, Luce has to figure out what role she plays in her own coterie. Despite others telling her (over and over) that deep inside she's Conquest, she recognizes herself as Luce Boudreau. How can she be who the coterie needs her to be when she's having trouble reconciling this past self? As her world literally starts to burn around her, Edwards pushes Luce closer to the unavoidable question- how can she take Conquest's strength and cold skills without falling over the edge and losing herself altogether?I'm loving Luce the more I read about her. She's driven, caring, loyal, and conflicted, which shows her character all the more. She's been dealt this crazy, enormous power that she doesn't even know how to access, and her utmost concern is just how to do right by everyone around her. Miller, Thom, Cole, and even Santiago are fabulous. Miller and Thom have an easy companionship with Luce, a warm bond that comforts her and pushes her to start changing her perspective. When dealing with demons, you can't keep looking at the world through a human lens.Cole is still complicated, but we get to see some of his broken pieces become a little less jagged. Edwards continues to feed us tiny morsels about why he's having such a hard time letting down his guard to connect with Luce. With each little snippet, the bond between them continues to develop, and I'm rooting so hard (yes, I know it's naive) that they'll get through all of this without much further trauma. Even Santiago, the most ornery of the bunch, has the chance to grow on you. Even though he's still a bit of a jerk, Luce (and us) become more familiar with the subtext that's so essential to understanding him. Honestly, he's a snarky ass, but he's our snarky ass, and I kind of love him a bit. Although some of the development is slow, it's realistic. Remember, the boys have been waiting for Luce for years, and they've prepared themselves to see the old face of Conquest. It's not just Luce's worldview that's been completely flipped around. Can the coterie dare to dream that they'll get to keep Luce?By the way, enter Adam Wu, Luce's new partner with the NSB. Wu is enigmatic & charismatic, and I found myself liking him even though my initial instinct was to hate this interloper who was daring to take Rixton's place. He's full of mysteries, and his connection to Ezra promises that we're going to have plenty of drama coming with the third book. Overall, I loved Bone Driven. It wasn't what I thought it was going to be; when the first book ended, I thought we might jump right into her NSB training/screening. However, since it takes place only about a week after the conclusion of the first book, we're still in this whole period where Luce hasn't fully moved onto the NSB.Sure, they need to solve the mystery of these fires, but I think the most important part about the plot is how it moves the characters' relationships and Luce's understanding of herself. There are triumphant moments, laugh-out-loud moments, and some moments that are going to break your heart. Edwards takes us exactly where we need to be, and I have no idea how I'm going to wait until the third book."}, {"userName": "Alison", "userReviewDate": "May 21, 2018", "userURL": "http://www.goodreads.com/user/show/9010166-alison", "userReview": "My ARC didn’t have a ‘previously on Foundling’ introduction and I really wish it had, because sooo much happened and I had forgotten so many of the plot twists.Anyhoo, Luce Boudreau lives in Canton Town, Mississippi. She was found in the swamp 15 years ago as a child, with no recollection of how she got there or her name. In the first book – spoiler alert – she found out that she was actually Conquest, a Charon from another dimension, one of the four horsemen of the Apocalypse but her breaking through the dimension somehow affected her memory. After 15 years of living in Mississippi Luce feels human, albeit she struggles to allow others to touch her and she fails to recognise her own face in the mirror. She has an old rotary phone in her bedroom and once a year, on her birthday, a mysterious man called Ezra calls her. At the end of the first book there is an epic showdown with her sister War, who has also broken through the dimension, in which Luce’s human father witnesses more than he should and has his mind wiped, her BFF Maggie is mortally wounded and Luce makes the decision to ask a skin-walker to merge with Maggie to save her life, Luce finds she ‘owns’ a coterie of Charon with various shape-shifting abilities who all loathe Conquest for enslaving them and killing their friends/ family etc but are starting to like Luce a little bit. Luce also has a soft spot for one of her coterie, Cole, a dragon-like shape-shifter, unfortunately Conquest has treated him as little more than a sex slave and he is conflicted as far as Luce is concerned. Oh, and a shadowy subset of the FBI, called the NSB, has recruited Luce to hunt Charon and sterilise them.This book opens shortly after the last book ended, Luce has two weeks before she needs to leave the Canton Town PD and join the NSB, her father is still in a zombie-like state, her BFF has gone missing to bond with the Charon who now shares her body, her coterie are still conflicted and War is on the loose. All she can do is watch and wait for Famine and Death to make an appearance and try to either neutralise them or persuade them not to colonise/ enslave the Earth.In her dual role as Charon hunter and police officer Luce is simultaneously investigating a series of horrific murder/ suicides by fire and a Charon who is killing and mummifying small household pets, whilst also looking after her father, rebuilding their home which was destroyed in the battle with War, and looking for Famine. Oh, and she needs to break the news to her old partner and get used to her new NSB partner, Adam Wu, who is also not what he seems.This is a great book which solidifies the world-building from the first book, Luce is still blundering about in the dark with regards to Conquest’s abilities which she cannot control/ use but she is starting to draw her own personal lines in the sand, her mantra, her code of ethics which sets her apart from most Charon. It’s clever, intriguing, confusing, grisly, scary, sexy and gross all at once and all the time. It was so good I want to go back and reread both books again just so I can spot the clever clues hidden in plain sight!I received a free copy of this book from the publisher via NetGalley in return for an honest review.Bumped for release."}, {"userName": "Kelly", "userReviewDate": "May 16, 2018", "userURL": "http://www.goodreads.com/user/show/251943-kelly", "userReview": "Full disclosure, I'm DEEPLY smitten with this series. Deeply. Like, I'm twitching for the next book already even though I just finished this one moments ago. There's something about Luce's messed up, complicated, dangerous world that works for me on so many levels.Frankly, she's a bit of a mess and she has no idea how, exactly, she fits into the information she's learning about herself because the Luce everybody expects to see isn't the Luce they've found and IT'S COMPLICATED. In the best way. Finding out you were (and possibly still are) a powerful demon hellbent on destruction and mayhem can mess with a person's head.Throw in the group who've bound themselves to her and the blistering attraction she has with their leader PLUS the realization that the other-her used her power to coerce and demand things that Luce is very uncomfortable with and she's floundering. She's trying, mind you, but everyone seems to need something a little different from her and it's a lot to take in.Things happen in this book and the complicated life of Luce Boudreau gets a little more complicated. Like I said, I'm already itching for the next book because I WANT TO KNOW what's coming. I have it bad for this series and I won't even apologize for my fangirling because it's just that good.-Kelly @ Reading the Paranormal"}, {"userName": "Sara Oxton", "userReviewDate": "May 27, 2018", "userURL": "http://www.goodreads.com/user/show/47206770-sara-oxton", "userReview": "Bone Driven by Hailey Edwards a five-star read that will drive you to read every page until the last. This is the second book in the Foundling series and if you haven’t read the first book go get it now and read it first, if you have read it, go back and read it now, as you will get so much more out of this book if you do. The love I have for this author is no small thing, I will admit that, but I enjoyed the first book in the series, but it wasn’t my all time favourite by the author, this one seems to have undone that, I don’t know if its that now we know everyone so much deeper and are more invested in the hurt and disappointment that some of the characters face in the story, but this book made it a much stronger series. Read this book get drawn into what has to be the opposite of typical small town life, every day is filled with adventure, I’m not sure I would be strong enough to live in Canton Town, Mississippi but I will tell you this life would never be boring. Luce Boudreau would make an awesome neighbour mind, can you imagine catching up over coffee or newspapers."}, {"userName": "Marthaamai", "userReviewDate": "Jun 05, 2018", "userURL": "http://www.goodreads.com/user/show/59294220-marthaamai", "userReview": "Hm nothing really happened I’m a bit let down"}, {"userName": "Eva Millien", "userReviewDate": "Jun 01, 2018", "userURL": "http://www.goodreads.com/user/show/6229658-eva-millien", "userReview": "Release Week Review! Bone Driven (Founding # 2) Hailey Edwards!   The bayou is burning, the battle is just beginning - and Luce Boudreau is smack in the middle of no-man's land . . .Life as a cop in Canton Town, Mississippi, is never dull - particularly when hiding deep within you is a demon bent on the apocalypse. Luce is doing her best to pretend her two worlds aren't crashing into each other, but what should be a routine arson investigation takes a shocking turn when Luce discovers a link between the suspects and her own dark secrets. There's no turning back, even though her search for the truth threatens to burn her old life down around her.Lines are being drawn in a war Luce barely understands, and she just might be on the wrong side of them. Now she must embrace her powerful destiny, or the ones she loves most will pay the ultimate price.Book Two in the powerfully addictive fantasy series The Foundling, perfect for fans of Ilona Andrews, Jenn Stark and Helen Harper The second book in the Foundling series, Bone Driven is a fascinating read that draws you in and refuses to let you go. The characters in this urban fantasy are strong, compelling and endlessly intriguing, about the time you think you have them figured out, they add something new to the mix and you have more facets of their characters that hooks into your curiosity gene and ensures that you are gonna come back for more. Luce Boudreau, the heroine of the series certainly pulls readers into the story as she some mysterious depths that appeal to readers… well I really have to be honest and say all the characters seem to be that way. There’s not a lot of romance in the book, just hints and some sizzling chemistry between Luce and of her guys but there are lots of bonds and connections that are intriguing and capture reader’s attention. The story is fast paced as there is never a dull moment to be found and there is lots of intrigue and surprises throughout the story to keep the readers on the edge of their seats and quite a few characters also add to the suspense as you try to determine if they are friend, foe or maybe they are sheep in wolf’s clothing and going to do a total about face one day in the future. The author made it easy to imagine each and every scene as they played out and brought them along with each of the characters to vivid life, so it was easy to become caught up in all the happenings and there was no way for me to put the book down, once I began. On a side note, I haven’t read the first book in the Foundling series yet (which I will be remedying soon) and while I had no trouble figuring things out, I feel that they should be read in sequence to have a complete understanding of this unique and fascinating world and the events that led up to this book. Bone DrivenGoodreads - https://www.goodreads.com/book/show/3... The 2nd book in the Foundling series which includes:http://haileyedwards.net/foundling/ Bayou Born #1 & #3 Death Knell (coming 12-4-18)Bone Driven is available in print or ebook at:Amazon - https://amzn.to/2HHHEOM B&N - https://www.barnesandnoble.com/w/bone... iBooks - https://itunes.apple.com/us/book/bone... GPlay - https://play.google.com/store/books/d... Kobo - https://www.kobo.com/us/en/ebook/bone... eBooks - https://www.ebooks.com/95940562/bone-... Little Brown - https://www.littlebrown.co.uk/books/d...   can be found at: Website - http://www.haileyedwards.net/ Goodreads - https://www.goodreads.com/author/show... Facebook - https://www.facebook.com/authorhailey... Twitter - https://twitter.com/HaileyEdwards InstaGram - https://instagram.com/hailey_writes/ BookBub - https://www.bookbub.com/authors/haile..."}, {"userName": "Amber at Fall Into Books", "userReviewDate": "May 26, 2018", "userURL": "http://www.goodreads.com/user/show/7247649-amber-at-fall-into-books", "userReview": "I absolutely love Hailey Edwards. I have ever since I read Everlong back in 2010. Her novels are steamy and sexy, but they also have heart. Her characters are real, and they are funny and heartbreaking and flawed and wonderful. The plots will always keep you on the edge of your seat, and the writing is wonderful. Bone Driven is no exception to this. I stayed up half the night reading this novel because I had to see what happened to Luce next. Edwards writes novels with heart, and that is so hard to come by, especially in the paranormal romance genre. Edwards excels in making you care about her characters. Luce may be a demon and she may be one of the four horsewomen of the apocalypse, more or less, but she is also so human. She's someone that anyone could relate to. She's such a strong character. She doesn't need any men to save her. I love how she makes the tough decisions, but they chip away at her soul, like they would anyone else's. The author does a terrific job of showing the inner struggle that Luce is feeling every second of her existence, and that's absolutely beautiful. Luce's coterie is also amazing. My favorite member is Thom, but that's because he shifts into a black Manx or bobtail, (or nubbin cat, as I call mine) and I have a black Manx, and it just made me picture my little Finnegan every time Thom shifted. All of the coterie members are extremely complicated, and their complex and evolving relationship with Luce is interesting to watch. Luce shows how a bit of kindness can soften even the harshest of \"monsters.\" The plot of this book is mysterious and thrilling, and at some points, heartbreaking. I could not put this novel down. The book is fast-paced, and Luce doesn't get a moment of peace in the entire thing. I was white knuckling my Kindle for the majority of this novel. It was one hell of a rollercoaster ride. The writing is wonderful. Edwards has a very strong voice, and I love how she explains things. There are moments of hilarity, and I found myself laughing out loud a few times while reading (which always alarms the cats). The world-building is done perfectly. I feel like I have a good grasp on the mythology of this universe that Edwards created. The mythology has some unique twists to it that I really enjoyed. It's not your typical angels/demons/good/evil/end of the world/save the world type of story. There are layers to it (and to the world itself), and it's fascinating. I absolutely can't wait until the third book. Overall, I'd recommend this book and series to anyone who is looking for a paranormal romance that has a lot of heart, some serious sexual tension, real and fully-developed characters, and a unique mythology. I think this is my favorite series that Edwards has written, and that says a lot. Do yourself a favor and give these books a try."}, {"userName": "Viktória Tóth", "userReviewDate": "May 21, 2018", "userURL": "http://www.goodreads.com/user/show/7044133-vikt-ria-t-th", "userReview": "I received a copy of this book via NetGalley in exchange of an honest review.I absolutely loved the first book so I was ecstatic when I got the opportunity to review this one as well. Unfortunately, this story only was a 4 star for me because I didn’t find it as captivating and intense as it was the case with the first book, but still an awesome story.The story continues a couple of weeks after the events of Bayou born and things are a bit tense all around Luce. Her relationship with her coterie is shaky, why they accepted her everybody has their own reservation especially due to Luce personality is nothing like they expected. Then there is the fact that she has to lie to everybody who she loves and she is not good at it. Also the threat of Luce sister is still looming in the air. While the first book was all about discovering Luce birthright and her past this one was more of an adjustment period. You could feel it, the first 3 quarter of the story is definitely slower, there are police cases and some investigating going on but for the most part the book is about how Luce is going to handle her new life as an FBI agent. She prepares herself to let go of her current life but has a hard time of it, she doesn’t know how to break the news to her family and even if she really wants to. I liked the book but the progression of it was pretty slow and in a couple of cases I felt that Luce and her team were overlooking obvious clues because they concentrated on the wrong things.There are a couple of new players in the game and they bound to bring some new issues in the oncoming stories. I still love Luce and she was even better around the end of the book where she started to tap into her powers more. She was a badass. Her relationships on the other hand are crumbling around her. Her family and friends are ‘disappearing’, her coterie has reservations regarding her true self, thou they like the new Luce but they don’t trust her. I especially love her tentative connection with Cole. Then there is her new partner who is the biggest mystery in this book, although at first I thought he is trouble I grown to like him.I enjoyed reading this book, it has a completely different feel to it than the first but the connection is clear. While we get to know some more about the charum world it is still less than I would have preferred. That side of the world building is kind of patchy and considering we are at book 2 I would have loved more insight. After how things ended in this story I expect a faster paced and action packed next book and personally can’t wait."}, {"userName": "Meg", "userReviewDate": "May 24, 2018", "userURL": "http://www.goodreads.com/user/show/17069967-meg", "userReview": "I got it! I got it! Whoop! I have been waiting with baited breath for the second book in this series since I read Bayou Born last year. This is my favorite Hailey Edwards series so far and this installment has been an important next step in the story.Luce Boudreau is trying to juggle her new found knowledge of being the demoness, Conquest, who came to Earth fifteen years ago with the intent of conquering it with her three other demonic sisters, War, Famine and Death, with the person she has been for the last fifteen years as a local cop's daughter and now a cop herself. She remembers nothing before she came to this planet and after backstories from her Coterie, four beings that she is meant to protect, and her battle with War that demolished her house and severely injured her father, she is pretty sure that she never wants those memories to surface. The NSB, a supernatural task force, is pushing Luce to join them and has given her three weeks to resign from the job she loves and leave her long time work partner, John Rixton. She knows Rixton will be devastated and is dreading leaving him. Unfortunately, with a new partner, Adam Wu stalking her and the imminent threat of Famine breaching the plane, Luce must break the rules and Rixton's trust in order to keep the truth from being exposed. The situation gets even more tense since local people start setting fires and Luce is being pulled in too many different directions. Who is she really? Where does her loyalties lie? The danger is just ramping up and people are GOING to get hurt...I love the story that Edwards has set up in these novels. I find the plot very unique and interesting! This novel introduces new characters, problems and we are getting steadily closer to finding out who the mysterious Ezra really is. The only issue I have with this book is it did not have as much of the romantic story line with Cole as I had hoped. They did make some progress, however slow but I was just hoping for more I guess! The action, drama, mystery and heartbreak was ever present and thriving however. It was overall a great read and I am incredibly excited for the next book! *I would like to thank Netgalley and Little Brown Book UK for the digital ARC of this novel in exchange for an honest review.xo Meggy"}, {"userName": "FV Angela", "userReviewDate": "May 21, 2018", "userURL": "http://www.goodreads.com/user/show/3846340-fv-angela", "userReview": "Review originally posted at http://fictionvixen.com/review-bone-d...The second book in Hailey Edwards Foundling series picks up right where the first book, Bayou Born, left readers hanging. Luce has just discovered who she is and where she comes from, and most importantly, who the mysterious men of White Horse security are to her. It’s a terrible revelation for a woman who has always felt different, but has made a comfortable home with her adoptive father and close group of friends and has a career that is quite important to her. Finding out you are literally a demon come to conquer the world is a bit messy, but Luce is determined to hold on to herself and not let her alter ego, Conquest, take over. Cleaning up the mess her sister, War, made of her home and her life will take some time. She also has to figure out a way to let her partner Rixton in on the fact that she is leaving the police force, and him, behind. In the midst of all this she and Rixton are called out to investigate a series of fires at several different locations. There seem to be some similarities and Luce is determined to find out if her murderous family members are responsible.Bone Driven is exactly what I expected in some ways, and completely fresh in others. While the first book set up the world-building and introduced readers to Luce and all the secondary characters that surround her, it wasn’t until the very end that the many, many loose plot threads started to weave together and reveal Luce’s background and identity. I was surprised and excited and couldn’t wait to find out more. The second book feels like more a of bridge between Luce’s life before and the one she is about to embark upon with her Coterie and the NSB. She is still processing the information of who she was before, and trying to rationalize that with who she knows herself to be. She’s loving, and feels deeply for her chosen family and friends. She is a loyal and protective. Luce struggles with connecting with the men who have come over with her as Conquest, but who also hope she will stay Luce. She is just starting to understand what her relationship with Thom, Santiago, Miller, and even Cole, means to each man. There is a lot of painful history between each of them, but she hopes to reestablish herself with them as a friend and protector.All through out this book Luce has to hide her newfound identity from the members of her old life. Her dad, Rixton, Nancy and Harold can’t know that of Luce’s demon side and that, Adam Wu, the man she’s suddenly hanging around with is actually her new partner. Ms. Edwards continues to develop her characters, dropping hints of their backstory and letting their relationships change and grow. Luce slowly starts to accept that her life is changing, and that she needs to embrace her new associations in order to keep her loved ones safe.Luce and Cole’s relationship is steadily evolving and I have hope that they will one day get to a place where they can be together. I know that Luce as Conquest was an evil being who did horrible things, but I think she is establishing that she is not the same person that she was before.Adam Wu is an enigma, and his connection to the mysterious Ezra, revealed at the very end of the book, has me excited for what is coming up next. I’m sure that book three will jump right into the next chapter in Luce’s life and her association with what amounts to the supernatural FBI. I can’t wait. Final Grade- BFavorite Quote:The two halves of me kept brushing up against each other these days, and the friction was brutal."}, {"userName": "Kat", "userReviewDate": "Jun 06, 2018", "userURL": "http://www.goodreads.com/user/show/14940365-kat", "userReview": "* Can't finish. Won't look at the author again. Ugh!** I finished, and probably skimmed most of it to get to the end.*** Pretty good, would read more, continue the series.**** Love, look forward to more books of this author.***** One of my all time favorite books. I rated this book four stars or \"Love, look forward to more books of this author.\"Reasons I liked it:1. Characters. The developments of each character are great. I think that Luce, is someone you can relate to, and you want to see how she copes with everything thrown at her.2. Mystery. There is always something that is left making me want more. I finished the first book in a few days, and was bummed to find out that I had to wait until June for book two. Unfortunately, it's worse now that I've finished book two and don't even know when book three is out!3. World building. It's a unique world to me, and I enjoy the concept of other worlds, and Conquest breaking through.Why should I read this? (I as in you, not me.)1.) If you enjoyed the first book. 2.) If you liked the How to save an undead etc series...I didn't quite enjoy some of Ms. Edwards books, but I think she has improved, and these are her most recent. It's worth a shot.3.) You're a fan of a spunky girl and want a face paced book you'll devour in hours.4.) You like books by authors such as Ilona Andrews, Karen Marie Moning, K. F. Breene, Faith Hunter and the like.Why shouldn't I read this book?1.) I didn't like the first book."}, {"userName": "Sue Plant", "userReviewDate": "May 25, 2018", "userURL": "http://www.goodreads.com/user/show/18898427-sue-plant", "userReview": "would like to thank netgalley and the publisher for letting me read this entertaining bookthe second book in this series and the fight is still onwe have demons and dragons and new things that hide in your bodies that take ownership and nobody realisesluce is still trying to figure things out with her coterie but also her job as police keeps her busy investigating the strange murders/fire and what their connections could be...strange flowers in her garden send them all doolally but there is a theme, one she just has to figure out..and also who is wu who has decided he wants to be her new partner regardless of her other partner, things are getting very difficult for lucea brilliant second book in this series and its well worth a read with some interesting developments all round"}, {"userName": "Denise Belt", "userReviewDate": "Jun 06, 2018", "userURL": "http://www.goodreads.com/user/show/14992013-denise-belt", "userReview": "Luce returns in the second installment of Edwards' new series The Foundling. Luce is trying to keep her two worlds apart; one is her nice quiet life of police and family, the other is her coterie, NSB and let’s not forget the demons trying to start the apocalypse. Luce is considered an anomaly in this war because she appears to be herself while keeping the demon buried deep inside of her which has never happened throughout time. Cole and Luce are drawn to each other in a very magnetic way but Cole has deep-seated issues with Luce’s demon and Luce is trying to juggle her role within her coterie. This is an original series with world dominance, demons, shifters and of course let’s not forget the measly humans. Edwards imagination is limitless and you will quickly be drawn into this story. Her writing is so easy to read and the love undertones of the story keep you wanting more"}, {"userName": "Alex", "userReviewDate": "Jun 06, 2018", "userURL": "http://www.goodreads.com/user/show/15796906-alex", "userReview": "Wow! If I had any doubts about this series book 2 knocked them all aside. This book pulled me in right from the get go and left me wanting more. Like book one there are SO many questions left unanswered and I was reading and re-reading between the lines to make sure I picked up every tidbit of information I could get my hands on. Truly the world that Edwards has build is so unique that I just wish there was more books I could get my hands on to stay in her universe. Cole and Luce continue to delight with their chemistry and their relationship is raking me over the emotional coals. At times this book reminds me of the demons Pippa DaCosta portrayed in her Veil series but with less angst and self loathing. I cannot wait for more in the Foundling series and may just have to check Edwards backlist to see if her past works can lessen the sting of waiting."}, {"userName": "Tammy", "userReviewDate": "May 28, 2018", "userURL": "http://www.goodreads.com/user/show/122617-tammy", "userReview": "I am heartbroken. Luce is heartbroken. People I cannot name for fear of spoiling you are heartbroken. This book was a knife to the heart and it was still so good. Luce knows some secrets now and she's prepared for some things. But she isn't prepared for any of this. Too bad the only thing she can do is keep going and do her best. Good thing she has people who support her in that.As with the first book this book had one hell of an epilogue that had me screaming for answers to the new questions it posed. And this book continues the tradition of tossing tropes on their head until they form something new. It lived up to the excellence of the first book and I'm so much looking forward to the next.#BoneDriven #NetGalley"}, {"userName": "Rebecca Goss", "userReviewDate": "May 29, 2018", "userURL": "http://www.goodreads.com/user/show/19028993-rebecca-goss", "userReview": "This book is more than it seems. Luce is a cop and enjoys her life and friendship with her partner. Apparently, she also houses a super demon that requires her to fight to maintain control. She has a group of protectors who slowly become her friends. Her relationship with her beloved partner is put at risk and she gets a new partner when she is forced to join a different division. All of the characters are multifaceted. I was saddened to see the book end and am looking forward to the next installment, which there must be because it really is that intriguing. I was given this ARC by Netgalley in exchange for an honest review."}, {"userName": "Helen Wawrejko", "userReviewDate": "May 23, 2018", "userURL": "http://www.goodreads.com/user/show/6181893-helen-wawrejko", "userReview": "This is a unique, action packed series. The characters are well defined, and the worldbuilding exceptional. Assigned an arson investigation with a strange death, she realizes it may be connected to her past. Luce is nothing like her demon other self, and forces of evil are determined to bring Conquest forth. As more of her past life is revealed, she makes horrific choices of life and death. As new characters step in to her life, they embark on an unknown future where the players hold secrets close to the vest. I voluntarily reviewed an ARC from Netgalley."}, {"userName": "Kia", "userReviewDate": "Jun 01, 2018", "userURL": "http://www.goodreads.com/user/show/5035426-kia", "userReview": "A solid follow up This book jumped right in where Bayou Born left off. I devoured the whole thing in one sitting and cant wait for the third book of the trilogy to release! There’s so much to cover and so many questions to still be answered. I thought I knew what would happen and I’m happy to say I was surprised I guessed wrong. I’m feeling really impatient 😉 and can’t wait to see where Ms. Edwards takes us, Luce and the gang."}, {"userName": "Suzanna", "userReviewDate": "Jun 06, 2018", "userURL": "http://www.goodreads.com/user/show/23664102-suzanna", "userReview": "Too much heartacheI really enjoyed the first book in this series, this one was a little too much heartbreak for me. The main character Luce just keeps getting hit with so many losses that I had to put this one down several times before I could complete it. I’m not giving up on the series my hope is the next one will give her a few wins, I hope."}, {"userName": "Jana Gundy", "userReviewDate": "Jun 07, 2018", "userURL": "http://www.goodreads.com/user/show/25334062-jana-gundy", "userReview": "Marvelous!Ms. Edwards can do no wrong. This series is so compelling and rich, the story just leaps out of the pages and grips you. Luce is full of tough choices and family love but the world is trying to beat her down. I love how the plot evolves and how she set up the end for the next book."}, {"userName": "Heather Henkel", "userReviewDate": "May 31, 2018", "userURL": "http://www.goodreads.com/user/show/9425389-heather-henkel", "userReview": "Great storyI really like this story. I really like how Luce has evolved through the books and how her coterie has evolved as well. I thought this was a well written story and hope the series keeps going!"}, {"userName": "Girlfred2", "userReviewDate": "Jun 05, 2018", "userURL": "http://www.goodreads.com/user/show/45752519-girlfred2", "userReview": "Exciting continuation of the founding series. As Luce is still trying to co e to terms with the fact that she is not human, mysterious and deadly fires keep happp. Is this a portent that Famine has arrived. Lots of build up in this one, many questions will arise. Look forward to the next book."}, {"userName": "Bonita B Ash", "userReviewDate": "Jun 07, 2018", "userURL": "http://www.goodreads.com/user/show/74212752-bonita-b-ash", "userReview": "Hailey can't write the next book fast enoughI don't break books down for reviews, so I'll just say this one was gripping from start to end. I, like many others,was crying close to the end. There are still so many questions....hurry with that writing Hailey."}, {"userName": "Shannon Heck", "userReviewDate": "Jun 02, 2018", "userURL": "http://www.goodreads.com/user/show/16159487-shannon-heck", "userReview": "Great bookThis is an original and interesting book. The mystery keeps unraveling, but the there are more layers underneath to uncover."}, {"userName": "Meredyth Winter", "userReviewDate": "Jun 02, 2018", "userURL": "http://www.goodreads.com/user/show/42803953-meredyth-winter", "userReview": "Better and BetterThis series gets better with every book. Hailey Edwards has knocked it out of the park with this one. I cannot wait for the next book!!"}, {"userName": "Dena", "userReviewDate": "Jun 06, 2018", "userURL": "http://www.goodreads.com/user/show/6931525-dena", "userReview": "audio"}, {"userName": "Sharon Sayegh", "userReviewDate": "Jun 03, 2018", "userURL": "http://www.goodreads.com/user/show/4863401-sharon-sayegh", "userReview": "More!!Gaah! I am SO hooked on this series, and desperately need the next book! I highly recommend readers buy all the series without waiting! Go! Now!! 💟"}], "description": "'Edwards creates amazing fantasy worlds that the reader becomes completely engrossed in.' (Goodreads)\nThe bayou is burning, the battle is just beginning - and Luce Boudreau is smack in the middle of no-man's land . . .\n Life as a cop in Canton Town, Mississippi, is never dull - particularly when hiding deep within you is a demon bent on the apocalypse. Luce is doing her best to pretend her two worlds aren't crashing into each other, but what should be a routine arson investigation takes a shocking turn when Luce discovers a link between the suspects and her own dark secrets. There's no turning back, even though her search for the truth threatens to burn her old life down around her. Lines are being drawn in a war Luce barely understands, and she just might be on the wrong side of them. Now she must embrace her powerful destiny, or the ones she loves most will pay the ultimate price.\nBook Two in the powerfully addictive fantasy series The Foundling, perfect for fans of Ilona Andrews, Jenn Stark and Helen Harper\n\nWhat readers are saying about Hailey Edwards:\n'A fantasy of a five-star read!' Amazon reviewer'This is a well written and entertaining story, full of humour and suspense, that I found to be a terrific read.''A fast-moving journey filled with the unexpected.' (RT Book Reviews)'Hailey Edwards has exceeded all expectations.' (Goodreads)'Well-plotted fantasy with intriguing characters, heart-pounding action, suspenseful intrigue and subtle romance. (RT Book Reviews)'Edwards has this way of writing that makes you feel like the narrator is talking to you and that you're old friends.' (Goodreads)'The world building is fresh . . . The characters are well-drawn and easy to root for. And the romance really hits the spot. '(Red Hot Books)'One of the most interesting books i have read in a long time, it starts off pretty normal but when the shocks start coming they don't stop and Luce ends up feeling from one revelation after another.' Amazon reviewer'One aspect of her writing I enjoy is her ability to take the mundane and with a few changes, turn it into something unique and unexpected. She builds dynamic character bases, using common mythology but takes it one step further using previously unseen species or imbibing currently known species with skills and know how that offers readers something new in the paranormal world.' (Smexybooks.com)", "title": "Bone Driven\n      \n          (Foundling #2)", "url": "http://www.goodreads.com/book/show/38315584-bone-driven", "average": 4.49, "cover": "https://images.gr-assets.com/books/1527798126l/38315584.jpg", "reviews": 34, "authors": [{"url": "https://www.goodreads.com/author/show/3345773.Hailey_Edwards", "name": "Hailey Edwards"}], "type": ["Fantasy", "Fantasy", "Fantasy", "Paranormal", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/38315584-bone-driven", "http://www.goodreads.com/book/show/38177521-bone-driven", "http://www.goodreads.com/book/show/24782164-lie-down-with-dogs", "http://www.goodreads.com/book/show/27409891-dead-in-the-water", "http://www.goodreads.com/book/show/23211040-dog-with-a-bone", "http://www.goodreads.com/book/show/28816542-head-above-water", "http://www.goodreads.com/book/show/13045039-a-hint-of-frost"]}