{"ratings": 2320, "userreviews": [{"userName": "Emily May", "userReviewDate": "Mar 27, 2011", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "I have never had a problem finding books to read.My whole life, I've never had a problem finding books to read and love. Of all kinds. Of all genres. I would seek them out, one way or another; they couldn't hide from me. From the Goosebumps books I found lying around on the shared shelves in the classrooms of my first school, to my pretentious swanning around my local library in search of those books called \"classics\" which meant you were totally smart if you read them (oh yes, I was a real delight as a child). I remember being about seven years old and asking my mum to get me a library card - I checked out the maximum of twelve each time, even though I could only read about one and a half back then before it was time to return them. Once, I even came to my mum in floods of tears because I'd let my books become overdue and thought I was going to prison.I would even find the books which people had gone to great lengths to hide from me. It's an odd memory that I doubt I'll ever forget. I must have been about eight or nine years old and my family were staying with friends in Holland. The house was beautiful. Huge. And most likely hiding a door that would lead me straight into another world if only I could find it. I stumbled through unused rooms on the third floor like a kid discovering Narnia until I found a box of books. I gravitated towards them. I can't quite tell you why, but goodreads is the sort of place where I might have a chance of finding someone who understands. I've just always read. I honestly can't remember a time before reading, when books weren't in my life. I don't know if I read as an escape or because of an interest in learning about other people or just to say I could and did. I read everything I could get my hands on. Including the books in this box, which were, shall we say, enlightening. I was appalled - appalled, I tell you! - at the things people are willing to put in their mouths. Needless to say, I read all of the book in question and instinctively never mentioned it to my parents. I'm sure some would like to think of me as a poor wee cherub whose innocence was stolen by evil books - maybe so, but I would put my money on Stine's chicken people being the real culprit rather than a bit of fellatio.No, I have never had a problem finding books to read.But I have had a problem finding people who understand what it's like to really LOVE reading. Maybe even need it. People who associate periods of their life with the kinds of things they were reading then, whether in school or in dusty old rooms of a house in Holland. The kind of people who take personal journeys into books and write responses that are part review, part stories in themselves. This is what goodreads has always given me. It's given me people who've loved a book so much that they've had to tell a story about a specific part of their life - that was the only way they could express the strength of their feeling. It's given me people who write poems for reviews or just post pictures because words aren't enough for what they want to say. A lot of these \"reviews\" don't help me decide whether I'll like a book or not. Many could be considered off-topic, not really about the book in question. And it amuses me how little the Goodreads moderators/managers/whoever actually understand: the books don't really matter.What Goodreads doesn't seem to understand is that the vast majority of their inactive members who created accounts, rated Lord of the Flies, and then quickly left - they came here because they like books. The others, the minority, who provide thousands of reviews, check the site religiously for friend updates, and are under direct attack by the new policies - they came here for the community. For the friends. For the memes. For the poems. For the rants. For the pointlessness. For the off-topic stories. For the ability to express themselves freely.Goodreads has done a truly fantastic job of not getting it. Of not getting why this site is successful. Goodreads thinks people come to this site for the books; they think they've reinvented the art of finding your next read. Oh, who are they kidding? There are a thousand other books like this and services and unused rooms in Holland that have been helping people find something to read for years. Most of them are quicker and more reliable, and all of them have fewer trolls. No. Goodreads is a long-forgotten URL in the internet history of millions of people but it means something important to only a few. I came to a site called \"Goodreads\" because I like books, but it was the people, the wonderful, off-topic people that gave me a reason to stay. You know why I'm still here after all this time? It's not the fucking books. It's the heartfelt expressions of utter delight and rage in the \"reviews\" of the friends I've made. Or it's the funny memes they post and the pictures of their cats. Or it's that teenage girl who emailed me after reading my pretty damn off-topic review of This Song Will Save Your Life and said she was going through the same thing but my review gave her encouragement to make it through each day. Goodreads, I don't need your help finding books to read.I can feel this site losing its value bit by bit. With every creative, talented and interesting person that leaves, goodreads loses more of my interest. I can honestly feel my interest waning each day. I used to keep goodreads open in a permanent tab that I would refresh a ridiculous number of times so I didn't miss anything. Now? I'm bored. This site now has more books than ever before and I'm bored. Because it was everything off-topic about Goodreads that gave the site its worth. I can find books elsewhere. Easily. Without issue. I've been doing it my whole life.This is not a protest review. For one thing, that would imply that I expect or hope it to have some kind of effect - I don't. This is not a review at all, actually. This is just a post of my thoughts for people to take as they wish. As I've always done on Goodreads and as I will continue to do. I'd say I don't care if someone deletes this, but that would be a lie. Because every deleted \"review\" is another piece of something I love being chipped away.\nThis work is licensed under a Creative Commons Attribution 3.0 Unported License."}, {"userName": "Ellen", "userReviewDate": "Jul 19, 2010", "userURL": "http://www.goodreads.com/user/show/2927182-ellen", "userReview": "Edited 8-11-2010 to add Comment no. 4 (below) in response to Paul's follow-up question.First of all, don't tell me what I \"must\" do before I die.Just fuck off. At Paul's behest, I'm writing my reactions to this list (not really the book, but give me a break - the book is just a bunch of pretty pictures and blurbs defending their idiotic choices). What's important is this shit-for-brains list.Comment no. 1: First, they need a subtitle for “1001 Books You Must Read Before You Die.” I’m thinking “Including Books That Will Make You Want to Die, Peel Your Skin Off, or Shoot Yourself in the Face” might do the trick. And who the hell just is this Dr. Peter Boxall? Does he know the definition of words like quiddity, esoteric, psychotic, random, fucking insane, etc.? I’m hoping he does because all would apply to this half-assed, biased list.Comment no. 2: I take immediate issue (no pun intended) to the word seminal, deriving from \"semen,\" and the whole stodgy, turgid prose describing the holiness of this craptastic list: \"Each work of literature listed here is a seminal work key to understanding and appreciating the written word. These works have been handpicked by a team of international critics and literary luminaries...\" \"a seminal work key to understanding the written word\" [like books?:] !! \"literary luminaries\" !? And I can just guess which ones they are given the disproportionate number of works by minor major authors. Hey, if someone is about to die, don't make them read every shithead book Ian McEwan or John Barth ever wrote. Do you really think Roth's very minor and miss-able The Breast is going to put someone in an orgasm over the \"written word\"?Comment no. 3: I sure hope this list isn’t in any particular order. I’d hate to think Franzen’s metaphorically and literally shit-impacted book, The Corrections is among the top 100. Oh, and nice coverage of lit before 19th century. There are a few stabs at SEVERAL CENTURIES at about book number 950 or so, but apparently we can just remain illiterate about Chaucer, Shakespeare, the Bible, Spenser, Donne, and the endless number of “SEMINAL” authors/books that are ignored completely. A medley of the books that are pleasant reads but hardly life changing: • The Life of Pi • Curious Incident of the Dog in Night • The Hours – how could Cunningham take such a good idea for a plot and screw it up so royally? • Surfacing – nearly anything by Margaret Atwood is worthy, but why pick one of her earliest novels, where her potential has not yet been realized? • One of Miller’s Tropic books would have been more than enough thank you. • Who the hell ever heard of Wharton’s Bunner Sisters? I need to read that before I die? Maybe I should read Ethan – this book sucks – Frome again too. No. For Wharton it is House of Mirth and The Age of Innocence. Colossally stupid list made into a giant and equally stupid book.AddendumComment no. 4:So Dr. Boxall/Boxass, to snatch a line from The Rainmaker, “you must be stupid, stupid, stupid.” You’ve now had three tries (2006, 2008, and 2010) to get this sorry ass list in shape, but you’ve fucked it up every time. In response to your smarmy introduction, which Paul describes: “…this is supposed to be a loose and baggy overview of The Novel, as opposed to drama or biography or history or biography,” I shout BULLSHIT! I’ll agree with the loose and baggy adjectives, but in no way is this list a representative listing of The Novel (and what’s with the reverential capital letters, asswipe?).For starters, your various lists have included short story collections (not a novel), a single short story (not a novel), autobiographies (not a novel), confessional memoirs (not a novel), histories (not a novel), creative nonfiction (not a novel) and nonfiction essay collections (not a novel). Is there something mysteriously complicated about a novel’s definition, basically, “an extended fictional narrative in prose containing a plot,” that eludes you? Do you find this definition hopelessly complex? There is a cure. Stop creating these inaccurate, nonrepresentational crap-ass lists that suggest you know something about The Novel. You don’t.Then, even if Boxass were able to plant the definition of a novel firmly into his not particularly fertile brain, he’d want to work on creating a list that’s representational. Let me explain. The good doctor has decided to use 1001 as the definitive number for our pre-death reading pleasure. Given the number of stellar novels produced, that is a tiny number. Logically, you’d accord an author no more than one book, unless there was an immensely compelling reason to do otherwise. Does Boxall do this? Noooooooooooooo!!!!!!!!In the list’s most recent incarnation (and this is attempt no. 3, Boxass), the good doctor still doesn’t grasp the idea of representation. In a list of only 1001 novels, should any author be accorded FIVE books? Apparently so. Boxall feels it imperative that we read, not one or two, but a whopping five novels each by J.M. Coetzee, Graham Greene, and Thomas Mann. In comparison, ground-breaking novelists like Mark Twain, Charlotte Brontë, Nathaniel Hawthorne are accorded respectively 1, 1, and 2 novels apiece. But hey! We need to save space so we’re able to read FOUR books by Georges Perec, two books by Dashiell Hammett, and two books by John Le Carré. Aaaaarrgggghhhhh!!!! I’m not even going to touch all the ESSENTIAL and IMPORTANT novelists you omitted altogether, dickhead, but too bad, so sad…Three strikes. You’re out..."}, {"userName": "Paul Bryant", "userReviewDate": "May 25, 2015", "userURL": "http://www.goodreads.com/user/show/416390-paul-bryant", "userReview": "There are so many literary awards these days but I think the following notable achievements have been TOTALLY MISSED. So here are the All Time Award winners :Best Keith Richard impersonation : W H AudenAward for the Best exotic dance : Colette and Diablo Cody (tie)Most transgendered author : Gustave Flaubert“Madame Bovary, c’est moi” - Ok, if you say soCreepiest family portrait : The FitzgeraldsMost ridiculous hats, if that’s what they are : Rebecca West :Author who most looked like their own books : Jean RhysAuthor who least looked like their own books : William BurroughsBest beard : Samuel R DelanyCraziest beard : Georges Perec Worst dancer : Truman CapoteMost awed by his own talent : Anthony BurgessBest fistfight between great authors : Vargas Llosa versus Gabriel Garcia Marquez. We give the award to the loser:Best calypso singer : Maya AngelouMost pretentious suit : Tom WolfeBest interviewees : Margaret Atwood and James Ellroy (tie)- invite them on your chat show, you'll get your money's worth. I must have missed out some awards.... any suggestions?"}, {"userName": "Paul Bryant", "userReviewDate": "Sep 26, 2007", "userURL": "http://www.goodreads.com/user/show/416390-paul-bryant", "userReview": "Has anyone thought of this already? Surely they have....I wonder if it would be possible here on Goodreads to have a page listing all the 1001 books and - here's the thing - links to our own reviews of them (maybe with a limit in the case of famous books with a zillion reviews). It would be an interesting resource and would encourage people to review those which haven't got any reviews at all - say, for instance, The Taebek Mountains by Jo Jung-rae or Nervous Conditions by Tsitsi Dangarembga. It would add to the GR fray, and that is what we are here for : the fray.**HISTORY OF THE THREE EDITIONS OF 1001 BOOKS, IN CASE YOU WERE WONDERING(if you weren’t wondering then move along, nothing to see here, this is for terminal list geeks only)The original edition came out in 2006 and got a lot of stick for its eurocentricity and eccentricity – what? 10 Coetzee novels and 8 McEwans? It looked a little like bribery and corruption, or maybe the editorial board had just gone mad. So in 2008 they rethought the whole list. 282 books were dumped and new ones added. 2008 additions1.\tHalf of a Yellow Sun - Chimamanda Ngozi Adichie 2.\tFalling Man – Don DeLillo 3.\tAnimal's People – Indra Sinha4.\tCarry Me Down - M.J. Hyland5.\tThe Kindly Ones - Jonathan Littell6.\tThe Inheritance of Loss - Kiran Desai7.\tThe Reluctant Fundamentalist - Mohsin Hamid8.\tAgainst the Day - Thomas Pynchon9.\tMother's Milk - Edward St Aubyn10.\tThe Accidental - Ali Smith11.\tMeasuring the World - Daniel Kehlmann12.\tA Short History of Tractors in Ukrainian - Marina Lewycka13.\tSuite Francaise - Irene Nemirovsky14.\t2666 - Roberto Bolano15.\tSmall Island - Andrea Levy16.\tThe Swarm - Frank Schatzing17.\tThe Book about Blanche and Marie - Per Olov Enquist18.\tThe Amazing Adventures of Kavalier & Clay - Michael Chabon19.\tThe Line of Beauty - Alan Hollinghurst20.\tVernon God Little - DBC Pierre21.\tThe Namesake - Jhumpa Lahiri22.\tA Tale of Love and Darkness - Amos Oz23.\tLady Number Thirteen - Jose Carlos Somoza24.\tThe Successor - Ismail Kadare25.\tSnow - Orhan Pamuk26.\tYour Face Tomorrow - Javier Marias27.\tI'm Not Scared - Niccolo Ammaniti28.\tSoldiers of Salamis - Javier Cercas29.\tBartleby and Co. - Enrique Vila-Matas30.\tIn Search of Klingsor - Jorge Volpi31.\tThe Museum of Unconditional Surrender - Dubravka Ugresic32.\tPavel's Letters - Monika Moron33.\tDirty Havana Trilogy - Pedro Juan Gutierrez34.\tSavage Detectives - Roberto Bolano35.\tThe Heretic - Miguel Delibes36.\tCrossfire - Miyuki Miyabe37.\tMargot and the Angels - Kristien Hemmerechts38.\tMoney to Burn - Ricardo Piglia39.\tFall on Your Knees - Ann-Marie MacDonald40.\tA Light Comedy - Eduardo Mendoza41.\tDemocracy - Joan Didion42.\tThe Late-Night News - Petros Markaris43.\tTroubling Love - Elena Ferrante44.\tSanta Evita - Tomas Eloy Martinez45.\tOur Lady of the Assassins - Fernando Vallejo46.\tThe Holder of the World - Bharati Mukherjee47.\tWaiting for the Dark, Waiting for the Light - Ivan Klima48.\tRemembering Babylon - David Malouf49.\tThe Twins - Tessa de Loo50.\tDeep Rivers - Shusaku Endo51.\tThe Adventures and Misadventures of Maqroll - Alvaro Mutis52.\tThe Dumas Club - Arturo Perez-Reverte53.\tThe Triple Mirror of Self - Zulfikar Ghose54.\tAll the Pretty Horses - Cormac McCarthy55.\tMemoirs of Rain - Sunetra Gupta56.\tUncle Petros and Goldbach's Conjecture - Apostolos Doxiadis57.\tBefore Night Falls - Reinaldo Arenas58.\tAstradeni - Eugenia Fakinou59.\tFaceless Killers - Henning Mankell60.\tThe Laws - Connie Palmen61.\tThe Daughter -Pavlos Matesis62.\tThe Shadow Lines - Amitav Ghosh63.\tThe Great Indian Novel - Shashi Tharoor64.\tGimmick! - Joost Zwagerman65.\tObabakoak - Bernardo Atxaga66.\tInland - Gerald Murnane67.\tThe First Garden - Anne Herbert68.\tThe Last World - Christoph Ransmayr69.\tParadise of the Blind - Duong Thu Huong70.\tAll Souls - Javier Marias71.\tBlack Box - Amos Oz72.\tBallad for Georg Henig - Viktor Paskov73.\tKitchen - Banana Yoshimoto74.\tOf Love and Shadows - Isabel Allende75.\tThe Beautiful Mrs. Seidenman - Andrzej Szczypiorski76.\tAncestral Voices - Etienne van Heerden77.\tBlood Meridian - Cormac McCarthy78.\tAnnie John - Jamaica Kincaid79.\tSimon and the Oak Trees - Marianne Fredriksson80.\tHalf of Man is Woman - Zhang Xianliang81.\tProfessor Martens' Departure - Jaan Kross82.\tThe Young Man - Botho Strauss83.\tLove Medicine - Louise Erdrich84.\tLarva: Midsummer Night's Babel - Julian Rios85.\tThe Witness - Juan Jose Saer86.\tThe Christmas Oratorio - Goran Tunstrom87.\tFado Alexandrino - Antonio Lobo Antunes88.\tThe Book of Disquiet - Fernando Pessoa89.\tBaltazar and Bleminda - Jose Saramago90.\tMemory of Fire - Eduardo Galeano91.\tCouples, Passerby - Botho Strauss92.\tThe House with the Blind Glass Windows - Herbjorg Wassmo93.\tThe War of the End of the World - Mario Vargas Llosa94.\tLeaden Wings - Zhang Jie95.\tClear Light of Day - Anita Desai96.\tSmell of Sadness - Alfred Kossmann97.\tSouthern Seas - Manuel Vazquez Montalban98.\tFool's Gold - Maro Douka99.\tSo Long a Letter - Mariama Ba100.\tA Dry White Season - Andre Brink101.\tThe Back Room - Carmen Martin Gaite 102.\tThe Beggar Maid - Alice Munro 103.\tRequiem for a Dream- Hubert Selby Jr. 104.\tThe Wars - Timothy Findley 105.\tQuartet in Autumn – Barbara Pym 106.\tThe Engineer of Human Souls – Josef Skvorecky 107.\tBlaming - Elizabeth Taylor 108.\tAlmost Transparent Blue – Ryu Murakami 109.\tKiss of the Spider Woman - Manuel Puig 110.\tWoman at Point Zero - Nawal El Saadawi 111.\tThe Commandant - Jessica Anderson 112.\tThe Year of the Hare - Arto Paasilinna 113.\tThe Port - Antun Šoljan 114.\tThe Dispossessed - Ursula K. Le Guin 115.\tThe Diviners - Margaret Laurence 116.\tDay of the Dolphin - Robert Merle 117.\tThe Optimist's Daughter - Eudora Welty 118.\tThe Twilight Years - Sawako Ariyoshi 119.\tLives of Girls and Women - Alice Munro 120.\tCataract – Mykhailo Osadchyi 121.\tA World for Julius - Alfredo Bryce Echenique 122.\tPlay It As It Lays - Joan Didion 123.\tFifth Business – Robertson Davies 124.\tJacob the Liar – Jurek Becker 125.\tHere's to You, Jesusa - Elena Poniatowska 126.\tSeason of Migration to the North - Tayeb Salih 127.\tThe Case Worker - Gyorgy Konrad 128.\tMoscow Stations - Venedikt Erofeyev 129.\tHeartbreak Tango - Manuel Puig 130.\tThe Cathedral – Oles Honchar 131.\tThe Manor - Isaac Bashevis Singer 132.\tZ – Vassilis Vassilikos 133.\tMiramar – Naguib Mahfouz 134.\tTo Each His Own - Leonardo Sciascia 135.\tMarks of Identity - Juan Goytisolo 136.\tSilence – Shusaku Endo 137.\tDeath and the Dervish - Mesa Selimovic 138.\tClosely Watched Trains - Bohumil Hrabal 139.\tBack to Oegstgeest - Jan Wolkers 140.\tGardens, Ashes – Danilo Kis 141.\tThree Trapped Tigers - Guillermo Cabrera Infante 142.\tDog Years – Gunter Grass 143.\tThe Third Wedding - Costas Taktsis 144.\tTime of Silence – Luis Martin Santos 145.\tThe Death of Artemio Cruz - Carlos Fuentes 146.\tThe Time of the Hero - Mario Vargas Llosa 147.\tMemoirs of a Peasant Boy - Xose Neira Vilas 148.\tNo One Writes to the Colonel - Gabriel García Márquez 149.\tThe Shipyard - Juan Carlos Onetti 150.\tBebo's Girl - Carlo Cassola 151.\tThe Magician of Lublin - Isaac Bashevis Singer 152.\tGod's Bits of Wood - Ousmane Sembene 153.\tHalftime – Martin Walser 154.\tDown Second Avenue - Es'kia Mphahlele 155.\tGabriela, Clove and Cinnamon - Jorge Amado 156.\tDeep Rivers - Jose Maria Arguedas 157.\tThe Guide - R.K. Narayan 158.\tThe Deadbeats - Ward Ruyslinck 159.\tThe Birds - Tarjei Vesaas 160.\tThe Glass Bees - Ernst Junger 161.\tThe Manila Rope - Veijo Meri 162.\tThe Devil to Pay in the Backlands - Joao Guimaraes Rosa 163.\tThe Burning Plain - Juan Rulfo 164.\tThe Tree of Man – Patrick White 165.\tThe Mandarins – Simone de Beauvoir 166.\tA Day in Spring – Ciril Kosmac 167.\tDeath in Rome – Wolfgang Koeppen 168.\tThe Sound of Waves - Yukio Mishima 169.\tThe Unknown Soldier - Vaino Linna 170.\tThe Hothouse – Wolfgang Koeppen 171.\tThe Lost Steps – Alejo Carpentier 172.\tThe Dark Child – Camara Laye 173.\tExcellent Women - Barbara Pym 174.\tA Thousand Cranes - Yasunari Kawabata 175.\tThe Hive - Camilo Jose Cela 176.\tBarabbas – Par Lagerkvist 177.\tThe Guiltless – Hermann Broch 178.\tAshes and Diamonds - Jerzy Andrzejewski 179.\tJourney to the Alcarria - Camilo Jose Cela 180.\tIn The Heart of the Sea - Shmuel Yosef Agnon 181.\tThis Way for the Gas, Ladies and Gentlemen - Tadeusz Borowski 182.\tFroth on the Daydream - Boris Vian 183.\tMidaq Alley - Naguib Mahfouz 184.\tZorba the Greek – Nikos Kazantzákis 185.\tHouse in the Uplands - Erskine Caldwell 186.\tAndrea – Carmen Laforet 187.\tBosnian Chronicle - Ivo Andrić 188.\tThe Death of Virgil - Hermann Broch 189.\tThe Tin Flute – Gabrielle Roy 190.\tPippi Longstocking - Astrid Lindgren 191.\tChess Story (Royal Game) - Stefan Zweig 192.\tBroad and Alien is the World - Ciro Alegria 193.\tThe Harvesters – Cesare Pavese 194.\tThe Man Who Loved Children - Christina Stead 195.\tAlamut – Vladimir Bartol 196.\tOn the Edge of Reason – Miroslav Krleza 197.\tThe Blind Owl – Sadegh Hedayat 198.\tFerdydurke – Witold Gombrowicz 199.\tWar with the Newts – Karel Capek 200.\tRicksaw Boy – Lao She201.\tUntouchable - Mulk Raj Anand 202.\tThe Bells of Basel – Louis Aragon 203.\tOn the Heights of Despair – Emil Cioran 204.\tThe Street of Crocodiles – Bruno Schulz 205.\tMan's Fate – André Malraux 206.\tCheese – Willem Elsschot 207.\tJoseph and His Brothers – Thomas Mann 208.\tViper's Tangle – Francois Mauriac 209.\tThe Return of Philip Latinowicz – Miroslav Krleza 210.\tThe Forbidden Realm - J. Slauerhoff 211.\tInsatiability - Stanislaw Ignacy Witkiewicz 212.\tMonica – Saunders Lewis 213.\tI Thought of Daisy - Edmund Wilson 214.\tRetreat Without Song - Shahan Shahnur 215.\tSome Prefer Nettles - Junichiro Tanizaki 216.\tThe Case of Sergeant Grischa - Arnold Zweig 217.\tAlberta and Jacob - Cora Sandel 218.\tUnder Satan's Sun - Georges Bernanos 219.\tThe New World - Henry Walda-Sellasse 220.\tChaka the Zulu - Thomas Mofolo 221.\tThe Forest and the Hanged - Liviu Rebreanu 222.\tClaudine's House - Colette 223.\tKristin Lavransdatter - Sigrid Undset 224.\tLife of Christ - Giovanni Papini 225.\tThe Storm of Steel - Ernst Junger 226.\tThe Underdogs - Mariano Azuela 227.\tPallieter - Felix Timmermans 228.\tThe Home and the World - Rabindranath Tagore 229.\tPlatero and I - Juan Ramon Jimenez 230.\tThe Notebooks of Malte Laurids Brigge - Rainer Maria Rilke 231.\tSolitude - Victor Catala 232.\tThe Way of All Flesh - Samuel Butler 233.\tThe Call of the Wild - Jack London 234.\tMemoirs of My Nervous Illness - Daniel Paul Schreber 235.\tNone But the Brave - Arthur Schnitzler 236.\tThe Tigers of Momopracem - Emilio Salgari 237.\tDom Casmurro - Joaquim Maria Machado de Assis 238.\tEclipse of the Crescent Moon - Geza Gardonyi 239.\tAs a Man Grows Older - Italo Svevo 240.\tThe Child of Pleasure - Gabriele D'Annunzio 241.\tPharaoh - Boleslaw Prus 242.\tCompassion - Benito Perez Galdos 243.\tThe Viceroys - Federico De Roberto 244.\tDown There - Joris-Karl Huysmans 245.\tThais - Anatole France 246.\tEline Vere - Louis Couperus 247.\tUnder the Yoke - Ivan Vazov 248.\tThe Manors of Ulloa - Emilia Pardo Bazan 249.\tThe Quest - Frederik van Eeden 250.\tThe Regent's Wife - Leopoldo Alas 251.\tThe Posthumous Memoirs of Bras Cubas - Joaquim Maria Machado de Assis 252.\tThe Crime of Father Amaro - Jose Maria Eca de Queiros 253.\tPepita Jimenez - Juan Valera 254.\tMartin Fierro - Jose Hernandez 255.\tIndian Summer - Adalbert Stifter 256.\tGreen Henry - Gottfried Keller 257.\tThe Devil's Pool - George Sand 258.\tFacundo - Domingo Faustino Sarmiento 259.\tA Hero of Our Times - Mikhail Yurevich Lermontov 260.\tCamera Obscura – Hildebrand (aka Nicolaas Beets) 261.\tThe Lion of Flanders - Hendrik Conscience 262.\tEugene Onegin - Alexander Pushkin 263.\tA Life of a Good-for-Nothing - Joseph von Eichendorff 264.\tThe Life and Opinions of Tomcat Murr - E.T.A. Hoffman 265.\tMichael Kohlhaas - Heinrich von Kleist 266.\tHenry von Ofterdingen - Novalis 267.\tA Dream of Red Mansions – Cao Xueqin 268.\tAnton Reiser - Karl Philipp Moritz 269.\tThe Adventures of Simplicissimus – Hans von Grimmelshausen 270.\tThe Conquest of New Spain – Bernal Diaz del Castillo 271.\tThe Travels of Persiles and Sigismunda – Miguel de Cervantes Saavedra 272.\tThomas of Reading – Thomas Deloney 273.\tMonkey: Journey to the West – Wu Cheng'en 274.\tThe Lusiad – Luis Vaz de Camoes 275.\tThe Life of Lazarillo de Tormes - Anonymous 276.\tAmadis of Gaul - Garci Rodriguez de Montalvo 277.\tLe Celestina – Fernando de Rojas 278.\tTirant lo Blanc – Joanot Martorell 279.\tRomance of the Three Kingdoms – Luo Guanzhong 280.\tThe Water Margin – Shi Nai'an 281.\tThe Tale of Genji – Murasaki Shikibu 282.\tThe Tale of the Bamboo Cutter - AnonymousThen, only two years later, a third edition, another revamp, but only ELEVEN titles were changed … that’s weird!IN1.\tElegance of the Hedgehog - Muriel Barbery 2.\tThe Children's Book - A.S. Byatt 3.\tInvisible - Paul Auster 4.\tAn American Rust - Philipp Meyer 5.\tCost - Roxana Robinson 6.\tThe White Tiger - Aravind Adiga 7.\tHome - Marilynne Robinson 8.\tKieron Smith, Boy - James Kelman 9.\tThe Gathering - Anne Enright 10.\tThe Blind Side of the Heart - Julia Franck 11.\tThe Brief and Wondrous Life of Oscar Wao - Junot DiazOUT1.\tThe Reluctant Fundamentalist - Mohsin Hamid2.\tAnimal's People - Indra Sinha 3.\tThe Kindly Ones - Jonathan Littell 4.\tA Short History of Tractors in Ukrainian - Marina Lewycka 5.\tSmall Island - Andrea Levy 6.\tThe Plot Against America - Philip Roth 7.\tThe Amazing Adventures of Kavalier & Clay - Michael Chabon8.\tThe Curious Incident of the Dog in the Night-Time - Mark Haddon 9.\tIslands - Dan Sleigh 10.\tThe Heart of Redness - Zakes Mda 11.\tSmall Remedies - Shashi Deshpande AND NOW A REVIEW OF THE ACTUAL BOOKThis is like porn for us book-geek types, it's so pretty and it's full of sexy pix of books in all states of dress, some with their jackets on, some off, some bound, some unbound. And lotsa pix of authors too, although, you know, authors are usually not the most gorgeous of people, and if you think that's stereotypical this book is here to prove it. (Exception : Edna O'Brien, total babe.)Anyway, this 1001 Books tome did turn my head when it was first published. It didn't, however, make me read anything I wasn't going to, which I guess is its point. Or maybe, its point is just to lie in the corner of your room and purr. Everybody will be shouting at this book before long as they look through it along the lines of \"what's this? You've got three in here by Douglas Adams, and NONE by Roddy Doyle? you arrant dunderheads!\" I mean, Douglas Adams is good for one, but not three... And if Douglas Adams, then Garrison Keillor... Each book gets about 300 words which editor Peter Boxall describes like this : \"What each entry does is to respond, with the cramped urgency of a deathbed confession, to what makes each novel compelling, to what it is about each novel that makes one absolutely need to read it.\" But, you know, they don't actually do that. It's just another pretty lie. 1001 books - it's a lot. If you had the time and money to read every one at a rate of one per week, you'd need 19 and a quarter years, so you better get going. But unless you're in a cult, you aren't going to do that. The pre-1700 section, in particular, is strictly for students of literature - I stick my neck out and say that very few will be reading \"Euphues : The Anatomy of Wit\" by John Lyly or \"Aithiopika\" by Heliodorus for fun. And then the dogged reader will be coming up against the rarely-scaled Everests of literature such as Dorothy Richardson's \"Pilgrimage\" (13 vols, thousands of pages) or Proust (likewise) or \"Infinite Jest\" (one volume, 1100 pages). Each of which are going to take you 3-6 months solid. Rules are broken randomly - the word \"books\" certainly appears to equate to \"novels\" in here, BUT \"Like Life\" by Lorrie Moore is included - a collection of short stories, not a novel. So okay - why no Raymond Carver, America's greatest short story writer? Stupid bastards. And sometimes it's hard to see that the reviewer even likes the book in question - \"The Secret History\" is described as \"quality trash for highbrows\"! Or take this: \"As with his other writing `The Book of Laughter and Forgetting' raises questions about the representation of female characters, and invites accusations of latent misogyny. These are valid objections that may engender fruitful considerations of this novel as a historical document as much as a work of experimental fiction.\" Well, that's hardly an enthusiastic endorsement.Some authors are wildly over-represented, such as J M Coatzee, Ian McEwan and Paul Auster, all of which have more titles in here than Henry James. It's interesting to check if the Booker Prizewinners are included - 20 are out of 37 and there are some strange omissions - no room for \"Vernon God Little\" (quite right too) or \"The True History of the Kelly Gang\", \"Sacred Hunger\" (nothing at all by Barry Unsworth in fact - what's wrong with him, he's great, you dunderheads!), \"The Famished Road\" or \"Hotel du Lac\". So this is a guide with enough in it to get everyone's backs up and please hardly anyone except Coatzee and McEwan fans. Therefore I recommend it for everyone, but particularly those who have just been sentenced to a long stretch of solitary confinement. Having said that, please check out my GR friend Ellen's fantastically vitriolic review - I don't agree with her but her views are BRACING http://www.goodreads.com/review/show/..."}, {"userName": "Manny", "userReviewDate": "May 07, 2015", "userURL": "http://www.goodreads.com/user/show/1713956-manny", "userReview": ""}, {"userName": "Jonathan", "userReviewDate": "Oct 08, 2013", "userURL": "http://www.goodreads.com/user/show/531153-jonathan", "userReview": "As a contributor to this, and having seen a few of the reviews, I thought I could clear a few things up: 1. The title – The publisher commissioned this book as part of its larger series of \"1001…before you die\". Having this \"before you die\" was a decision made in the publishing/marketing section as it was decided it would sell better/get more discussion going. It is also, obviously, a little tongue in cheek. \"books\" rather than \"novels\", as \"novels\" was seen as potentially turning people off as it sounds too \"literary\" and \"elitist\" (I know, I know…don't get me started). So, the title is pure marketing, and nothing to do with either Peter Boxall or anyone involved in either the selection of books or the reviews. 2. The list itself – Firstly, of course, it is impossible to make a \"perfect\" list. Secondly, there is author inflation due to financial and temporal pressures. This was fought by some, and the situation was improved in later editions, but I agree there is, for a start, way too much Rushdie! Boxall did the first draft of the list, which was discussed and edited and added to by us. It was, as all things done by committee, flawed. You must remember that the publishing industry is in dire straights, and simply getting this book done and out was a struggle. 3. The point of the book – the point is that it is a list of suggestions, a list of jumping off points, inspiration, ideas. Something to look through when stuck for what to read. It is not intended to be CANON."}, {"userName": "Inder", "userReviewDate": "Apr 18, 2008", "userURL": "http://www.goodreads.com/user/show/250817-inder", "userReview": "I joined the 1001 Books group here on Goodreads, thinking, \"What a great way to get exposed to a ton of books!\" so I thought I better take a look at the actual list.Pros: Little descriptions of a lot of classic books. Lots of books described here that I have never heard of, and that I might not have known about otherwise. In fact, I may discover some new favorites through this list. Also, it appeals to my 12-year-old self, who loved to write lists of books I wanted to read. Overall, inspiring, if seriously intimidating.Cons: 1001 books is actually a lot to read in a lifetime. You'd have to average about 25 books a year, if you start at my age and live according to actuarial projections, and keep in mind, there are books like Gravity's Rainbow and Ulysses lurking in there to seriously slow you down. I fancy myself quite well read (basically because I have read Middlemarch - ever since then, I've been quite full of myself), but I've read less than 5% of the books on this list - I have a ways to go. Also, since the list (naturally, because the book had to be published at some point) terminates in 2005, you'd be pretty behind the times if you decided to ONLY read books on this list, until you die. Also, many would argue with the actual list itself: Why so much contemporary (and thus, not tried and true) fiction? Why is it almost all fiction, for that matter? Shouldn't you read some nonfiction before you die? Also, three Burroughs novels? Doesn't that violate the Geneva Convention? Certainly the 8th Amendment.What I'm saying is that the premise of the book is obviously ridiculous. Plainly, this is not really a list of books you must read before you die - that was probably the publishers' catchy title, anyway. But if you don't take it too seriously, this is fun to read, fun to disagree with, and fun to ignore. I'm inspired to try to pry my psyche out of the pre-modern era, however painful, at least long enough to read one or two novels written post-1930. (I'm sure my psyche will scuttle back into its 19th century hole directly afterwards, but I really should try to participate in the 21st century at least now and then.)In short - a rolicking nerd-fest for bookish people."}, {"userName": "Lynda", "userReviewDate": "Aug 29, 2014", "userURL": "http://www.goodreads.com/user/show/13400128-lynda", "userReview": "Yeah, I know, we GR readers already have too many books on our To Reads list! :-)As I get older my literary tastes change. I've been a little disgruntled with reading lately and thought I'd check this reference guide out. The first thing I did was to go through my home library and check off how many of these books I actually had. I'm embarrassed to say less than 50! So I'm going to use this list as a guide to broadening my reading horizons, together with recommendations by GR friends.The 2013 edition is beautifully illustrated with concise insight into the novels. I've delved into the pages and have purchased a few so am ready to sit back and resume my reading with a little more joy."}, {"userName": "Lawyer", "userReviewDate": "Aug 01, 2016", "userURL": "http://www.goodreads.com/user/show/3025547-lawyer", "userReview": "1001 Books You Must Read Before You Die: An Indispensable GuideOf course, I didn't read this 960 page behemoth in one day. As a matter of fact, the selected edition is the second of two copies in my library, my personal one, and the one I share with my dearest reading friend and partner, Lynda.Rather, this is my indispensable guide to broadening my literary horizons. The pictured edition is that published by Cassell in 2012. However, my first edition was the first published in 2006.I emphasize that this is an evolving series. As such, as successive volumes have been published, some works have been removed while others have been added. My first edition was rather a comfort to me. For it reinforced my selection of books I had read over the course of my life. Let's say the initial volume was \"Anglo-centric.\" Here were the classics of American and English Literature on which I had cut my bookish teeth. The usual suspects are here. Jane Austen, Charles Dickens, Mark Twain, William FaulknerErnest Hemingway, and John Steinbeck.As the series has progressed, the 1001 have taken on a decidedly international flavor. That is an exceptionally good thing. For I have begun to read much further abroad than English and American Literature. These major revisions have occurred in the 2008 and 2014 editions.This series should not be dismissed as simply another \"List of Books.\" It is far more than that. This series comes with the Literary Chops of Editor Peter Boxall a professor of English in the Department of English at the University of Sussex. He works on contemporary literature, literary theory and literary modernism. The series is further advanced by the work of innumerable scholars, specializing in the works of included authors. Some readers may well be put off by a book of this scope. Many readers always take exception to works included and excluded. Yet, it must be accepted that Literature is a constantly changing way in which the world is viewed: historically, philosophically, politically, and socially. Otherwise Literature would not have the impact on us as readers it undeniably does.Those who may be dismayed by the exclusion of beloved works previously included in earlier editions should be assuaged by knowing that most works excluded in later editions are works by authors who have had multiple listings in previous editions. By example, at one time Charles Dickens and J.M. Coetzee were the writers with the most entries; ten for each. Those have been reduced to make room for authors of significant works from different cultures and eras. That suits the mission of this series.For the Bibliophile, each edition has been a treasure trove of artwork from contemporary editions of the works reviewed. The accompanying artwork for each entry makes this an entrancingly beautiful book on, well, the beauty of books and their wonderful graphic design.If one were to make a comparison of the various editions in this series, it actually lists in excess of 1300 Books You Must Read Before You Die. It is quite doubtful I will ever read each and every volume listed in this all encompassing series of books. However, it is a work I return to time and again in looking for that next book to be read. On the other hand, I have frequently said, tongue firmly planted in cheek, that the key to immortality is a stack of unread books. \"Wait, wait, Death. I'm not done here.\"Yet, this guide has led me to books I might not ever have read otherwise. This series has pushed me beyong the limits of my usual literary comfort zone. For that, I'm exceedingly grateful.Should you decide to embark on this magnificent Literary Exploration, you, too, may find this your guide for volumes to increase your library for years to come. Oh, I highly recommend delving into this series. It is a joy."}, {"userName": "Paul Bryant", "userReviewDate": "Oct 16, 2012", "userURL": "http://www.goodreads.com/user/show/416390-paul-bryant", "userReview": "[image error]"}, {"userName": "Manybooks", "userReviewDate": "Oct 07, 2017", "userURL": "http://www.goodreads.com/user/show/2970379-manybooks", "userReview": "While I of course have not in any way expected to agree with EVERY novel or novella that chief editor and book compiler Peter Boxall has considered worthy of inclusion in his 1001 Books You Must Read Before You Die (and although MANY of my personal favourites are indeed and happily present), I do have three main and very personally uncomfortable issues with this tome (which actually grate enough for me to only consider a two star rating at best, a decent enough compilation and certainly useful, but only to be recommended with major caveats and reservations). For one, and for me personally very much annoyingly, I actually consider the title 1001 Books You Must Read Before You Die rather majorly misleading (and the dictatorial tone a trifle off-putting as well), as ALL of the literary works listed (included) are novels or novellas. Now does this mean that Peter Boxall somehow does not consider dramatic works or poetry collections legitimate, bona fide books? I mean, sorry, but Johann Wolfgang von Goethe's Faust, William Shakespeare's Romeo and Juliet and Charles Baudelaire's Les Fleurs du Mal are if published in print format in every way as much a book as Jane Austen's Pride and Prejudice, Theodor Fontane's Effi Briest and Thomas Mann's Buddenbrooks. And thus, why this tome has NOT been titled something more akin to 1001 Works of Prose You Must Read Before You Die I really do not even remotely understand (for frankly, when I ordered my copy of the book, I originally and wrongly assumed that both poetry and dramas would also be included, the lack of which does rather majorly frustrate, as the title, as 1001 Books You Must Read Before You Die in no way makes it clear that ALL of the included literature offerings would be examples of prose, would be novels and longer short stories and novellas).Furthermore, for two, while 1001 Books You Must Read Before You Die claims to be international in scope, there is (at least in my opinion) most definitely a decidedly American and United Kingdom bias shown by Peter Boxall. And while with especially most of the United Kingdom, England, novel inclusions I actually and in fact heartily agree, I do think that especially earlier French and Spanish novels seem to have come a bit short (although I do have to admit that I am pleasantly surprised at how many German language novels/novellas are included, are featured, but be that as it may, I still strongly think that 1001 Books You Must Read Before You Die could be and really should be considerably more universal and international, for as it stands now, it really does seem as though Peter Boxall thinks that American and United Kingdom authors are by nature, somehow superior literature and culture wise, and even if this might never have been his intention, the feeling does permeate and remain).And finally, and I guess what actually has moved 1001 Books You Must Read Before You Die from a low three star to a high two star rating for me is the massively infuriating fact of the matter that aside from Margaret Atwood, Carol Shields, and Yann Martel (whose Life of Pi I personally in fact and indeed cannot stand, and I also have to wonder if Boxall even considers Martel Canadian since he was born in Spain), Canadian literature has been pretty well ignored. And honestly, why does Peter Boxall have to include SEVEN Margaret Atwood novels? Yes, she is a talented Canadian author, but there are so many other Canadian authors equally as talented. Where is Margaret Laurence? Where is Timothy Findley? Where is W.O. Mitchell? Where is Hugh McLennon? Where is Alice Munro? Where are the many excellent Quebecois Francophone authors? And I could go on, as Canada has a rich and varied literary tradition and that Peter Boxall obviously rather believes that only Margaret Atwood (and to a certain extend Carol Shields and perhaps Yann Martel) are worthy of inclusion in his 1001 Books You Must Read Before You Die, that they supposedly \"represent\" Canadian Literature, well, I find this both naively blinkered (rather ill read) as well as a bit insulting. And while I do in fact sometimes browse through 1001 Books You Must Read Before You Die, I actually and generally ONLY tend to make use of it to check information (and plot summaries) of books with which I am already familiar (that I have already read) and not so much for finding new reading material."}, {"userName": "Marius van Blerck", "userReviewDate": "Feb 26, 2011", "userURL": "http://www.goodreads.com/user/show/786611-marius-van-blerck", "userReview": "The secret to immortality is revealed ... read only 1000 of these. No more."}, {"userName": "notgettingenough ", "userReviewDate": "Aug 04, 2016", "userURL": "http://www.goodreads.com/user/show/2658311-notgettingenough", "userReview": "I find these lists loathsome, but have no need to go into that, since it has been done so meticulously by Ellen.However, I think this story may be recorded here. It may change your mind about whether hanging out on GR is what measures the importance of reading in your life. I wonder what these people, in peril every day, would think of this list, so much of which seems to comprise trivia. I wonder if it guides them as they make their life-endangering trips to this library. Or if they have better things to read.Syria's secret libraryWhen a place has been besieged for years and hunger stalks the streets, you might have thought people would have little interest in books. But enthusiasts have stocked an underground library in Syria with volumes rescued from bombed buildings - and users dodge shells and bullets to reach it.Down a flight of steep steps, as far as it's possible to go from the flying shrapnel, shelling and snipers' bullets above, is a large dimly lit room. Buried beneath a bomb-damaged building, it's home to a secret library that provides learning, hope and inspiration to many in the besieged Damascus suburb of Darayya.\"We saw that it was vital to create a new library so that we could continue our education. We put it in the basement to help stop it being destroyed by shells and bombs like so many other buildings here,\" says Anas Ahmad, a former civil engineering student who was one of the founders.The siege of Darayya by government and pro-Assad forces began nearly four years ago. Since then Anas and other volunteers, many of them also former students whose studies were brought to a halt by the war, have collected more than 14,000 books on just about every subject imaginable.Over the same period more than 2,000 people - many of them civilians - have been killed. But that has not stopped Anas and his friends scouring the devastated streets for more material to fill the library's shelves.\"In many cases we get books from bomb or shell-damaged homes. The majority of these places are near the front line, so collecting them is very dangerous,\" he says.\"We have to go through bombed-out buildings to hide ourselves from snipers. We have to be extremely careful because snipers sometimes follow us in their sights, anticipating the next step we'll take.\"At first glance the idea of people risking life and limb to collect books for a library seems bizarre. But Anas says it helps the community in all sorts of ways. Volunteers working at the hospital use the library's books to advise them on how to treat patients; untrained teachers use them to help them prepare classes; and aspiring dentists raid the shelves for advice on doing fillings and extracting teeth.About 8,000 of Darayya's population of 80,000 have fled. But nobody can leave now.Since a temporary truce broke down in May, shells and barrel bombs have fallen almost every day. For the same reason, it's long been impossible for journalists to enter Darayya, so I have been conducting interviews by Skype - my conversations repeatedly interrupted by shattering explosions, so loud that they distort the studio's speakers.The location of the library is secret because Anas and other users fear it would be targeted by Darayya's attackers if they knew where it was.As it is, the library is in an area considered too dangerous for children to approach. One young girl, Islam, tells me that she spends almost all her time indoors, playing games to help her ignore the gnawing pangs of hunger in her stomach and reading library books she is given by friends.She tells me she has no idea about the cause of the bloodshed around her.\"All I know is I'm just being fired at,\" she says.\"I'll be sitting by myself, watching some place being shelled and I'm thinking, 'Why are they bombing this place?' Sometimes I hear that someone has died because of their injuries and I ask myself, 'Why did he die, what did he do?' I don't know.\"There is one child who visits the library every day, however, because he lives next door. For 14-year-old Amjad it is safer there than being above ground, and over time his enthusiasm for the place has earned him the role of \"deputy librarian\".In one of our Skype conversations, Anas tells me that as well as aspiring teachers, doctors and dentists looking for technical or academic books, many still just read for the love of it. The majority of their most popular books are by well-known Arab writers such as the poet and playwright Ahmed Shawqi, known as the Prince of Poets, or Syrian author al-Tanawi, who chronicled rebellions in the Arab world. But he says there's also much enthusiasm for names that are more familiar in the West.\"I've read some books by French writers but I like Hamlet the best,\" says Abdulbaset Alahmar, another former student in his mid-20s.\"Shakespeare's style of writing is simply beautiful. He describes every single detail so vividly that it's like I'm in a cinema watching a film in front of me. To be honest I became so obsessed with Hamlet that I began reading it at work. In the end I had to tell myself to stop!\"But, I ask him, in a besieged town that has only had access to two aid convoys in nearly four years, wouldn't it make more sense for the library enthusiasts to spend their time looking for food rather than books?\"I believe the brain is like a muscle. And reading has definitely made mine stronger. My enlightened brain has now fed my soul too,\" he replies.\"In a sense the library gave me back my life. It's helped me to meet others more mature than me, people who I can discuss issues with and learn things from. I would say that just like the body needs food, the soul needs books. Abdulbaset Alahmar\"  It turns out that even the greatly out-gunned Free Syrian Army fighters, who have the daunting task of defending the town, are avid readers.\"Truly I swear the library holds a special place in all our hearts. And every time there's shelling near the library we pray for it,\" says Omar Abu Anas, a former engineering student now helping to defend his home town.Books motivate us to keep on going - we read how in the past everyone turned their backs on a particular nation, yet they still made it. Omar, library userEvery time he heads for the front line, he stocks up with books first. Once there he spends much of his time with a rifle in one hand and a book in the other.\"In the heart of the front line, I have what I'd call a mini library. So I bring a collection of books and I put them there. So I sit there for six or seven hours, reading.\"Many of his comrades also have their own mini front line libraries, he says, adding that at just about every defence point, which are spaced about 50m apart, you will find a collection of borrowed books.\"So, for example, when I have finished reading a book I go up to one of the others on the front line and exchange it for one he has just read. It's a great way of exchanging ideas as well as books.\"Unfortunately for Omar, his fellow fighters and the people of Darayya, they may soon have little time for reading. Over the past two weeks Syrian government forces and their Hezbollah allies have moved into all the farmland around the suburb and even some outlying residential areas.One man I spoke to predicted that after nearly four long years of siege Darayya could fall within days.For now though, Omar says the library is helping to strengthen the town's defences as well as its resolve.\"Books motivate us to keep on going. We read how in the past everyone turned their backs on a particular nation, yet they still made it. So we can be like that too. They help us plan for life once Assad is gone. We can only do that through the books we are reading. We want to be a free nation. And hopefully, by reading, we can achieve this.\"For those who need their reviews with pictures, go to the link: original story."}, {"userName": "Jeanette  \"Astute Crabbist\"", "userReviewDate": "Mar 05, 2008", "userURL": "http://www.goodreads.com/user/show/796425-jeanette-astute-crabbist", "userReview": "May 19, 2008After reading or attempting to read a fairly large number of books listed in this book, I have come back and removed two of the stars I originally gave it. Many of the books are terrible, and many of the ones that aren't terrible are not \"must reads\".Below is my original review from before I'd tried some of the suggested books._____________________________________________________________March 16, 2008I can't believe I read the WHOLE thing! I have it from the library, so I wanted to go through the whole thing before returning it.I enjoyed the format and artwork in this book. A half page discussion of each book and why it's worth reading, as well as some exceptional photos, movie posters, book covers, and other artwork.The book is essentially British, so the selections are somewhat weighted in favor of English, Irish, Scottish, and Welsh authors. That's their prerogative, but it means they left out some books others of us would consider essential.On the whole, well-done and inspiring."}, {"userName": "David", "userReviewDate": "Jun 25, 2013", "userURL": "http://www.goodreads.com/user/show/3335664-david", "userReview": "Peter Boxall and his panel of high-falutin' lit'ry types got together and made a list of 1001 books they think everyone should read before they die. Now the title might rub some folks the wrong way - hey, who are you, you high-falutin' lit'ry types, up in your academic towers, telling us what we must read? Ultimately this list is probably no better or worse than any other \"best books\" list compiled by literary scholars, though it's certainly longer than most. (I'd be amazed if any of Boxall's committee really has read every single one of these books.)The merits of the books chosen are of course open to considerable debate. They range from the big classics that every single list ever includes (Madame Bovary, Crime and Punishment, Moby-Dick, etc.) to a handful of modern genre classics (Neuromancer, Interview with the Vampire, The Spy Who Came in from the Cold) to some really obscure ones I have never heard of, nor met anyone who's read them (The Clay Machine Gun? Giles Goat-Boy? Yeah, I see some of you on my friends list are making a liar out of me...)There are two main criticisms people usually make of the list: one is that it's very Western-centric, with very few non-Western novels on the list, even going back to the 17th century. No Tale of Genji, no Water Margin, to say nothing of anything more modern.The other flaw is that it's pretty obvious that some of the literary panelists just stuck as many books by their favorite author as they could on the list. I mean, I like Charles Dickens, but I don't think he needs to be on the list 10 times. He does not make up 1% of the world's most important literature all by himself! Philip Roth: 7, Virginia Woolf: 9, Jane Austen: 6, etc. I know it's probably hard to choose which of Jane Austen's six novels are the best/most important, but come on — I'd agree everyone should read at least one or two of her books, but not all of them, unless you actually like Jane Austen (which I do, incidentally).So, anyway, I understand the revised 2010 edition has addressed this a bit, with fewer Dickens and more non-Western inclusions.The summary of each book is brief and not always very illuminating. None of them really argue passionately for why this particular book (especially if it's only one of many by the same author) deserves to be on your literary life list. However, in a brief allotment of words, each book gets a page on its qualities and what it has to offer.So, this is the sort of book that's interesting to have on your shelves and to page through. And I have been semi-randomly making my way through it, sometimes choosing books I would never otherwise have read. You can see my list here. Some have been delightful surprises, some were just an opportunity to read one of those books everyone is supposed to have read in high school but I never did (hence my finally getting around to Wuthering Heights and The Hitchhiker's Guide to the Galaxy), and some I do not think my life would have been diminished by missing.I still haven't read Moby-Dick or The Great Gatsby yet.Personally, I found Jane Smiley's 13 Ways of Looking at the Novel a more engaging and personal read, with her list of a 100 books which she personally read (or reread) for their importance. But 1001 Books You Must Read Before You Die is a hefty doorstopper worthy of any book-lover's collection, though I'd like to meet the person who's actually read all 1001. I seriously doubt I will get around to all of them."}, {"userName": "Lara", "userReviewDate": "Nov 05, 2007", "userURL": "http://www.goodreads.com/user/show/156859-lara", "userReview": "Of course I didn't read this front to back...it's a reference book, and a wonderful one at that. Besides, there are plot spoilers! The artwork from first and rare editions and photographs of authors are especially nice. This belongs on every bibliophile's shelf. My three complaints:1. The awful cover, which looks like a cross between a New Age pamphlet and a college text book. Why? 2. It seems as though every work by some authors is included, so that it could almost be condensed into \"500 Authors You Must Read Before You Die.\" 3. Major omissions include _Watership Down_ and anything by Cormac McCarthy."}, {"userName": "Luka Fadiurashvili", "userReviewDate": "Dec 13, 2016", "userURL": "http://www.goodreads.com/user/show/35419402-luka-fadiurashvili", "userReview": "პიტერ ბოქსალს უნდა დაახიო ლაყუჩები ;დ ერთი ქართველი მწერალი რომ არაა, გასაგებია ნაკითხი არ ხარ საკმარისად, აი ფოლკნერს რო მარტო ერთ რომანს აღირსებ და ისიც აბესალომ, აბესალომს იქ უკვე სერიოზულად იჭრები ; იტოკში არასწორი კაცია პიტერი, თუნდაც მარტო იმიტომ რომ კოელიო 1001 წიგნში შესაყვანად ჩათვალა."}, {"userName": "Nick", "userReviewDate": "Jan 03, 2017", "userURL": "http://www.goodreads.com/user/show/62648627-nick", "userReview": "Ah, the freedom to choose. I love this chunky volume, and one I return to for reading ideas. I have read about a quarter of the 1001, so a few more to go. One qualm about this: it focuses too much on very modern works, at the expense of some really excellent novels which are omitted."}, {"userName": "Skylar Burris", "userReviewDate": "Aug 23, 2008", "userURL": "http://www.goodreads.com/user/show/710201-skylar-burris", "userReview": "It's always fun to read some random academic's random list of the books one supposedly should read. It either bestows a sense of satisfaction in seeing one's tastes validated or inspires a pleasing self-righteous indignation at seeing certain books excluded; usually it does a little of both. \"1,000 Books You Must Read Before You Die\" includes contributions by over one hundred international critics, and, in addition to serving as an amusement, it also serves as a handy reference with summaries of 1,001 different books in 300 or words or less. I'm not quite sure what criteria was used to compile this list (here comes the pleasing indignation); it is heavily weighted toward the 1900's, giving barely a passing glance to classical world literature. In the pre-1700's section, which numbers a pathetic less-than-15 pages, there is no Iliad, no Odyssey, no Beowulf, no Canterbury Tales, no Decameron, no Inferno …but there is Chariton's Chaireas and Kallirhoe? Huh? I suppose the defense given for such omissions may be that these are not \"novels,\" and this is (I guess?) supposed to be a list of \"novels,\" but that is not in fact the case: the list includes numerous essays and individual short stories as well (since when did \"The Pit and the Pendulum\" or \"A Modest Proposal\" qualify as \"novels\"?) I think they would have done better to have begun with the 1700's, simply omitted the short stories and essays, and called it \"1001 novels,\" if a novel list was truly their goal. Because if we really want to talk about *books* to read before you *DIE*, the list is badly lacking. Aside from the classic omissions previously mentioned, why no Bible, no Bahagvad Gita, no Koran, no Tao Te Ching - nothing at all in that vein? But enough of the omissions; what of the inclusions? The \"MUST read\" portion of the title seems a bit hyperbolic to me. MUST I really read a *minimum* of half a dozen books that include *multiple* scenes of female rape and/or sexual degradation before I die? Surely I could live a fulfilling and educated life having read but one or two such books? Or perhaps I could make it through life, enlightened, informed, educated, moved, even inspired—without even reading one such book. Many of the descriptions seem to take relish in the anti-capitalist themes of many of the books, and I sometimes wondered if a book or two wasn't chosen precisely because of it's anti-capitalist bent. That might also help to explain that, among hundreds and hundreds of 20th century titles, not a single book by Ayn Rand was included: a rather glaring omission in 20th century literature when one considers her cultish following and impact. I'm still plodding through this, patting myself on the back at what I have read, and of the hundreds and hundreds of books I haven't read—trying to decide which might be worth the time. I will have read 1,001 books before I die, most likely (God willing and the creek don't rise)—but certainly not all or even most of these 1,001. I kept changing this back and forth between two and three stars, and I finally settled on three. I rate the selection poorly, but as a reference book, it's really quite good. The summaries are well written and concise and do, I think, a fairly good job of giving me a notion as to whether I would want to read the book or not. But once again I'm reverting to the lower score, because I'm sitting here thinking - come on now! Not a SINGLE work by Chaucer, Shakespeare, Marlowe, or Dante could manage to edge out even one of the 60 titles written after the year 2000?"}, {"userName": "Jennifer", "userReviewDate": "Dec 05, 2011", "userURL": "http://www.goodreads.com/user/show/6324268-jennifer", "userReview": "If you want a compact (well, 900+ page book) list of the books that many people consider to be \"classic literature,\" then sure! Check this book out. It gives a general synopsis of 1001 \"classic literature novels\" that \"you MUST read before you die\". For that, it is useful. But it is not even close to being complete.Surprisingly, the editor has organized the books by century, which I found encouraging, because at least I know they appreciate older literature for its value and influence over the formation of literature as we know it. I have flipped through every single one of those 1001 books (no, I did not count them, so for all I know there could be 1002 listed) and have counted 35 out of the 1001 that I have read in entirety. Add another 25 for the books I have at least attempted to read for school or the like, and that makes my total around 60. 60 out of 1001 (or about 6%). This raises the question of what constitutes a book as being worthy of being on this list? Because I have read a lot more than just 60 books in my life, so where are those? I recognize that this book was published in 2006, so any books written in the last 5 years would not be included. But there are a lot of books that are on my \"What I would recommend to anyone who reads\" list that are not included in this book. Does this make them not worthy? Now don't get me wrong, I assume that all of the books listed are worthy for one reason or another, but I wonder why you have to include all 6 novels by Jane Austen. Is it just because she is Jane Austen? Where are the books I fell in love with in high school? Where are the children's novels that introduce children to the wonderful world of the story? Why isn't children's literature worthy of being included in a list of books you MUST read before you die? Personally, I think this list is different for everyone. Yes, I believe that there are some staple novels that have been written since the beginning of the novel that I think everyone should read if they want to call themselves well-read. But to have a list of 1001 books, a list that includes all of the works by the great authors of literature rather than a collection of different types of books, by different authors, seems counter-productive. I mean, you read one Jane Austen, you read them all, right? (I deeply apologize to the Jane Austen fans out there, but you have to agree, they are very similarly structured in style, theme, and character development). So why not instead include stories like Beowulf, or Utopia by Sir Thomas More, or The Picture of Dorian Gray by Oscar Wilde, or The Kite Runner by Khaled Houssini, or Life of Pie by Yann Martel, or Harry Potter by J.K. Rowling, or Democracy by Joan Didion, or a Walker Percy novel. The list goes on and on. I am not complaining about books that make lists such as \"1001 books you must read before you die\" because I, for one, love making lists. But just be wary of the lack of complete comprehensiveness that one might expect in a huge book filled with over one thousand great books. Take it with a grain of salt, and keep reading what you love. Because it is not so important to read the best books according to the opinion of one editor and over 100 reviewers, but to just keep reading."}, {"userName": "Sassy Brit", "userReviewDate": "Jul 12, 2017", "userURL": "http://www.goodreads.com/user/show/1003021-sassy-brit", "userReview": "I did a very naughty thing today. In fact I'm still hiding the evidence from my husband. I bought a book. Not any old book. An expensive \"do I really need another?\" book, aptly named \"1001 books you must read before you die\" - Preface by Peter Ackroyd, and general editing by Peter Boxall. Advertised as a comprehensive reference source, chronicling the history of the novel and it's an absolute beauty.For a smallish book it's thick, weighing the equivalent to two, or three 1lb bags of sugar. (I don't know, I'm useless at things like that - they either heavy or they're not!) By the way, as it's so weighty it's definitely not for reading in bed when you are sleepy, unless you want to knock yourself out for a week!Not only does it look good with a cover designed (in primary colours) by David Pelham for A Clockwork Orange, written by Anthony Burgess (1972), it's smooth, shiny and smells good, too!I plan to go through the book and read every single novel the two Peter's recommend, and share my findings on my website. Starting from Aesop's Fables, (4BCE), which I own and have never read - to Never Let Me Go, by Kazuo Ishiguro (2005) that I admit to avoiding when it first came out because it sounded too pepped up by those wealthy critics I love to hate.It's going to cost a fortune if I can't these recommended books in any of my local libraries, however, I'm a bibliophilist and it's the price I'm (almost) willing to pay! Anyway, I'm a reviewer. It's my job!From what I have read so far, this is worth every penny.I'm not bothered if I do or don't agree with the two Pete's findings - it will be fun testing each and every book out.This book alone gives a bibliophile a sense of direction, a new chance to discover critically acclaimed masterpieces, cult classics, and an introduction to some contemporary fiction titles that may have passed you by.Featuring over 600 full-colour images of books covers and frontispieces, posters and other contextual images, this is a dream come true for me. It also supplies you with quotes from authors and their novels, which makes this even more of delight to read, considering this is a reference book. I gave this book five stars because just the thought of it gets me excited!Incidentally, as I rushed out of the shop with my book clutched tightly to my chest, scanning the car park for my car (wishing I'd taken more notice where I parked), I couldn't help but wonder how ironic it would be if I died in a car crash on the way home, and they discovered this book \"1001 books you must read before you die\" in the boot of my car..."}, {"userName": "Nicole", "userReviewDate": "Jan 03, 2008", "userURL": "http://www.goodreads.com/user/show/199446-nicole", "userReview": "3-3.5 stars. A great place to harvest fodder for your to-read list. The listings are organized by century of publication (the pre-1700s, 1700s, and 1800s sections are pretty skimpy compared to the 1900s). Each listing is accompanied by a synopsis and pretty pictures. 1001 Books introduced me to some authors and titles that I might not have stumbled upon on my own. It would have received more stars, too, if it presented a more balanced list. I just find it hard to believe that I \"must read\" TEN Ian McEwan novels before I die, but ZERO works by William Shakespeare. Really? Another caveat: this book (for the most part) does not include works of non-fiction, essays, plays, or poetry, even those that you probably should read before you die. Still worth having a copy on the shelf..."}, {"userName": "Eli Easton", "userReviewDate": "Mar 31, 2017", "userURL": "http://www.goodreads.com/user/show/14978908-eli-easton", "userReview": "I love lists. I particularly love book lists. For example, I've compiled in excel lists of horror, thriller, romance, and lit fit books with cross referenced awards and \"best of\" lists. I particularly like lists such as Mystery Writers of America's Top 100 mystery/thrillers of all time, or RWA's \"1001 Best Romance\" list. I also like to peruse the Goodread's Choice Awards (voted on by readers in the thousands), Amazon, Publisher's Weekly, and NPR's annual lists. It's certainly valuable to have recommendation lists from experts in their field and from readers en masse. So naturally, I was drawn to this book. I joined a challenge to read 25 titles from this list this year. Digging into it, I have to say the selection of books is very odd and disappointing. I've read the comments others have left, including one that appears to be from the publisher (aka \"a contributor\") saying the books were selected \"by committee\" and that it wasn't ever meant to be a true \"best of\" list and that yes, some books were added because \"the publishing industry is in dire straights\". (In other words, to sell copies of the books the publisher represents).Of course, anyone has a right to make a list, and the editor and publisher of this book likewise. I guess what's sad to me is that this list/book is one of the only of it's kind and very prominent, taken nearly as gospel, whereas the list itself is questionable at best. As other reviewers have pointed out, it reads like a bunch of \"literary fiction\" authors got together and nominated ALL of each other's books. There are books, year after year, by the same authors like Philip Roth and J.M. Coetzee, even though these books are clearly minor works. I tend to look at the goodreads reviews/rankings on each title to see if I really want to attempt them, and many times the blurb and reviews put me right off. Of course, there are some great books on the list like John Le Carre's \"The Spy Who Came In From The Cold\", \"The Bluest Eye\" by Toni Morrison, or Ira Levin's \"Rosemary's Baby\". And I found a few gems I never would have read like \"High Rise\" by J.G. Ballard and \"The Summer Book\" by Tove Jannson. However, there's also a lot of dross here, and it definitely skews towards supposedly high brow books that are obtuse, forgettable, and not especially readable.I would love to see a physical book like this, with the lovely pictures and write-ups, that represent that 1001 most readable and entertaining books from various genres and lit fic, as well as books that had a true impact and still have something to say like Toni Morrison's \"Beloved\" and \"To Kill a Mockingbird\". Now that would be a wonderful reference book to have! As for this list, take it for what it's worth--a publisher and a few authors marketing their own books. 3 stars just for being an interesting list to peruse, but DON'T take it as the be all and end all of great books. I advise reading reviews and opinions before starting any book on this list, because many are not worth reading. And mine your recs from other sources as well.Check out this review:https://www.goodreads.com/review/show...And this response from \"a contributor\":https://www.goodreads.com/review/show..."}, {"userName": "Diana", "userReviewDate": "Dec 04, 2009", "userURL": "http://www.goodreads.com/user/show/2655643-diana", "userReview": "This is a reference book on, as the title suggests, 1001 very important books. I have to admit, I was skeptical about this book. My first thought was, roughly, \"Why should I pay for a book that's just a big list of better books?\"Well, thanks to the Orange County public library system, I don't have to pay for it. So now I have it (for three weeks, anyway), and I'm actually enjoying it a lot.It's very browsable — it's easy to flip through and skim, and somehow it doesn't feel overwhelming. Each page has entries on one or two books, with generally just the right blend of objective plot description plus editorial opinion. (Amazon calls these \"authoritative yet opinionated\" critical essays.) Sometimes I'll skim the first descriptive paragraph and feel completely unmoved (e.g. \"cultural identity...slum...Jewish boy...urban...eh, probably won't bother reading this one\"), but then the next paragraph deems the book \"one of the most authentic, moving accounts of childhood terror in literature,\" and suddenly it feels worth reading. (That one was Call it Sleep by Henry Roth.) Some of them say things like, \"This is not one of his most popular novels, but here's why you should read it anyway.\" (I'm paraphrasing.)I appreciate the honesty and the overall mission of this book. I know I wasn’t directly quoting that \"here’s why you should read it anyway\" sentence, but that's one of the sentiments that the 1001 Books contributors express over and over again. \"Here is a barrier to reading this book, and here is why it's important to read anyway.\" Okay, how about an actual example. Finnegans Wake: \"Joyce's last book is perhaps the most daunting work of fiction ever written. Yet it is also one of the funniest...\" Maybe I don't really want to be bothered to work through the most daunting work of fiction in the history of fiction. But how can I pass up one of the funniest?One common barrier to reading many of the books compiled here is that they are, quite simply, enormous books. The writers of 1001 Books don't dance around that fact; they want readers to know what they're getting themselves into. But they also want readers to keep reading. On Clarissa: \"The sheer scale of Clarissa means that it can seem a novel that is more talked about than read. Yet for those readers who are prepared to spend time with it, Clarissa offers a proportionate amount of satisfaction.\" Or Moby-Dick: \"A huge, monstrous, and yet exquisitely refined creation . . . Just reading the novel constitutes an experience every bit as wondrous and exhausting as the journey it recounts.\" Of course these days I can't mention huge/monstrous/exquisite novels without thinking of Infinite Jest. Sure enough, it's in here. And how does the editor sell the reader on it? \"This text is the one you would take with you to a desert island.\" See that? THE one. The editor's basically saying, \"You know that list of books you always imagine you'd like to have with you on a desert island? Burn it. Take this book and only this book.\" How can you argue with that?Many people, not surprisingly, criticize this book. In my cursory Internet search, the broadest complaint I've found is, in the words of one reviewer, \"WHY MUST I READ THESE????\"I think this complaint can be broken down into two slightly different complaints: \"WHY must I read these?\" and \"Why must I read THESE?\"For answers, the reader need only look to the book's preface and introduction. In the preface, Peter Ackroyd lays out several reasons why we should read. Some books \"stand outside the currents of ordinary change and represent something close to enduring human value\" — they are timeless. Other books \"act as the symbol of an age or a period\" — they are important for understanding a piece of history. His overarching claim is that \"all of them invite the pleasure of reading.\"But why these? All of them invite the pleasure of reading. Okay. But all books do that, or they wouldn't get published, right? Why these 1001 books and not a different 1001? Peter Boxall tries to answer this in his introduction. He's quick to point out that this is not an exhaustive list of books we must read. Such a list would be impossible to create. Note that this is a collection of 1001 books to read before you die, not the 1001 books to read before you die. I think the lack of article before \"1001″ in the title means that, yes, you should read these books, but guess what? You should read other books too. You should read as many books as you can, probably. And then there will always be more books you should read. That's the main point of Boxall's introduction: there is no way on Earth to pin down a list of books that everybody should read. He even goes so far as to say that the novel (wait for it...) does not really exist. This time I am quoting, not paraphrasing: \"It might be argued that the novel, as a stable, recognizable object, does not really exist.\" The form or definition of a novel is incredibly hard to pin down — vaguer still is the delineation between good and bad, trashy and masterful.Honestly? You're not going to like every book in this book. I've done my fair share of eye-rolling at some of the choices. And I share other people's questions about some of the less obvious decisions (e.g. the fact that the second half of the selections are from the last 50 years). But I doubt you could write a list of 1001 anything that would please everybody. If I wrote a list of 1001 foods you must eat before you die, a lot of it would be pretty straightforward. And yet for every concurrence, there would undoubtedly be at least one criticism. Chocolate would rank pretty high on my list. But some people actually don't like chocolate! You wouldn't see soda anywhere on my list (not Coke or Pepsi or even Sprite), but some people can hardly envision a (Happy) meal without it.Actually, trying to think up a list of 1001 must-eat foods turns out to be very instructive. My first thought is to include things like pizza and ice cream, stuff that is totally obvious and totally delicious, and yes, almost everyone has already eaten these things, and everybody already knows they’re great, but that's why they need to be on the list. Or do they? In fact that’s one thing people criticized about 1001 Books — \"I don’t need to be TOLD to read Virginia Woolf; everybody KNOWS you’re supposed to read Virginia Woolf, and anyway I HATE Virginia Woolf and I’m never ever going to read anything she ever wrote. So there.\" Oookay, so maybe The List is supposed to be made up of things the average person wouldn’t necessarily know about or bother with, things like oysters or apple drinking vinegar. The problem is that if you populate the list too heavily with obscure items, you run out of room for the classics, and then you inevitably run into the opposing criticism: \"How can you write a list like this without including BACON? Or JELLO? Or BROCCOLI?!\"I guess all I'm trying to say is that you can't please everyone.One of the huffy criticisms I found went something like, \"Even if I read ONE of these books a WEEK, and NOTHING ELSE, it would take me, like, 20 YEARS to get through the list.\" Well, okay. It's called 1001 Books You Must Read Before You Die, not 1001 Books You Must Read Before Your 35th Birthday, or 1001 Books You Must Have Already Read or Else You're Definitely a Big Loser. The point is that these editors believe that if you were to devote a lifetime to reading fiction, you wouldn't go far wrong by sticking to this list. At least if your lifetime ended in 2005, I guess. But you get the point.I may never read all of these books. Certainly at the rate I'm going, I'd have to live for several hundred years to complete the task. But it's doable, if you set your mind to it, and even if you don't, it's an excellent resource. Every time I'm looking for something new to read, I can open 1001 Books at random and pick out something worthwhile. It might be something I've never heard of, or something I'm ashamed I've never read.I think it's cool. In fact, the next time I'm looking to spend $34.95, I just might spend it on this."}, {"userName": "Eℓℓis ♥", "userReviewDate": "May 29, 2018", "userURL": "http://www.goodreads.com/user/show/46838158-e-is", "userReview": "Da consultazione."}, {"userName": "Jennifer", "userReviewDate": "Feb 26, 2017", "userURL": "http://www.goodreads.com/user/show/3214774-jennifer", "userReview": "Obviously this \"list\" isn't perfect. No Shakespeare, no Homer, no Virgil, no Elie Wiesel, no Kent Haruf, no Herman Wouk, among many other favorites. But the managing editor specifically says he knows it's not perfect and that it couldn't possibly ever be perfect. This book about books is meant to spur discussion, and it does that well. I've discovered deeply compelling authors and works listed here that I'm sure I never would have heard of otherwise, and for that alone I'm thankful."}, {"userName": "Lisa Vegan", "userReviewDate": "Sep 20, 2007", "userURL": "http://www.goodreads.com/user/show/83445-lisa-vegan", "userReview": "There’s no question that this is a beautiful book. There are many wonderful photos, drawings, book covers, etc. that enhance the text/book descriptions. I had every intention of reading this book cover to cover, and some day I might do that; I do read many so-called reference books (such as cookbooks) 100%. But, it’s a 960 page book and I’ve decided I’d rather use this as a traditional reference book and read other books instead. If I refer to it too often I’m afraid my to-read list will get more unwieldy than it is now. I was pleased to see that I’ve read more of these than I would have guessed and that I already have some of them on my current to-read list. Makes me wish I wasn’t already so old! ;-)The problem I have with books such as this is that I always feel that worthy books are left out and I’m confused by certain ones that are included, which is true here too. Although the over one hundred international critics (that wrote this book) did do a good job here. I think I actually prefer the Book Lust books, even though they are not as comprehensive, because they’re great fun; this one takes itself completely seriously."}, {"userName": "Sara", "userReviewDate": "Oct 06, 2014", "userURL": "http://www.goodreads.com/user/show/10665178-sara", "userReview": "I just bought this book used for $2.99. It's the 2008 edition. I have read 67 of these books. I see there's a group out there on Goodreads reading through this, I am going to check them out.It's a surprising list. Some books are obviously on there. Other books - well? I can't give an opinion yet on some of those I've never heard of. It must all be ultimately subjective but some books have stood the test of time and some of the more recent ones - who knows? Will we be reading them 100 years from now?I'm counting this book as read because I've read bits and pieces. I read the entire articles on the books I've read and skimmed some of those I'm considering reading or was just curious about.One of the books I'm currently reading is in here (The Stone Diaries) so it's soon to be 68 for me."}, {"userName": "Pixelina", "userReviewDate": "Sep 17, 2012", "userURL": "http://www.goodreads.com/user/show/5366052-pixelina", "userReview": "Not read every word of the whole book but this is more the kind of book you keep on your coffee table to savor now and then. On the downside, they added not just one but 2 Coelho books *gasp* that is 2 too many if you ask me. And none of them is the 'best' one: The Alchemist. Oh well...Of course the point of this book is to make you want to do your own 1001 list. It begs to be challenged.(added from my update)I read some of the reviews here and people just need to chill out, they are taking the title too damn serious. I have had a great time with this one, looking at pictures, trying to recall if I read the books or not and check Goodreads for books to add (or remove) from the TBR pile."}, {"userName": "Chelsea", "userReviewDate": "Sep 20, 2007", "userURL": "http://www.goodreads.com/user/show/122606-chelsea", "userReview": "It's pretty, but... A list of the titles is more than sufficient for me. I got the impression that the titles were selected less because the author likes them and more because they're historically significant books. Which, believe me, is not a bad thing, and good tends to go hand in hand with significant. However, they're going to be the same titles you'd see on any other Must Read list, but compiled in one expensive book. I much preferred Nancy Pearl's Book Lust titles. Her suggestions are much more likely to be quirky or unsung."}], "description": "For discerning bibliophiles and readers who enjoy unforgettable classic literature, 1001 Books You Must Read Before You Die is a trove of reviews covering a century of memorable writing. Each work of literature featured here is a seminal work key to understanding and appreciating the written word.The featured works have been handpicked by a team of international critics and literary luminaries, including Derek Attridge (world expert on James Joyce), Cedric Watts (renowned authority on Joseph Conrad and Graham Greene), Laura Marcus (noted Virginia Woolf expert), and David Mariott (poet and expert on African-American literature), among some twenty others.Addictive, browsable, knowledgeable--1001 Books You Must Read Before You Die will be a boon companion for anyone who loves good writing and an inspiration for anyone who is just beginning to discover a love of books. Each entry is accompanied by an authoritative yet opinionated critical essay describing the importance and influence of the work in question. Also included are publishing history and career details about the authors, as well as reproductions of period dust jackets and book designs.", "title": "1001 Books You Must Read Before You Die\n      \n          (1001 Before You Die)", "url": "https://www.goodreads.com/book/show/452208.1001_Books_You_Must_Read_Before_You_Die", "average": 3.82, "cover": "https://images.gr-assets.com/books/1320483996l/452208.jpg", "reviews": 334, "authors": [{"url": "https://www.goodreads.com/author/show/30545.Peter_Boxall", "name": "Peter Boxall"}], "type": ["Nonfiction", "Reference", "Writing", "Literature"], "outlinks": ["http://www.goodreads.com/book/show/452208.1001_Books_You_Must_Read_Before_You_Die", "http://www.goodreads.com/book/show/16047158-1001-books-you-must-read-before-you-die", "http://www.goodreads.com/book/show/609527.1001_Books_You_Must_Read_Before_You_Die", "http://www.goodreads.com/book/show/13555059-1001-books-you-must-read-before-you-die", "http://www.goodreads.com/book/show/19735540-1001-books-you-must-read-before-you-die", "http://www.goodreads.com/book/show/28401752-1001", "http://www.goodreads.com/book/show/10333852-1001-libri-da-leggere-prima-di-morire", "http://www.goodreads.com/book/show/54032.Samuel_Beckett", "http://www.goodreads.com/book/show/17471285-twenty-first-century-fiction", "http://www.goodreads.com/book/show/432276.Strategy_and_Human_Resource_Management", "http://www.goodreads.com/book/show/33038.Don_Delillo", "http://www.goodreads.com/book/show/4335507-the-oxford-handbook-of-human-resource-management"]}