{"ratings": 30154, "userreviews": [{"userName": "Ana ", "userReviewDate": "Mar 29, 2016", "userURL": "http://www.goodreads.com/user/show/13346584-ana", "userReview": "This book turned me into a blubbering, weeping mess. Amazing, sad and uplifting at the same time.  For more on this matter check out my other review-https://www.goodreads.com/review/show..."}, {"userName": "Summer Lane", "userReviewDate": "Jun 24, 2012", "userURL": "http://www.goodreads.com/user/show/7318943-summer-lane", "userReview": "This is one of the best animal stories of all time. Why? Because it isn't just about a lion named Elsa, it is about a companion, a friend and a loving creature who shared in the lives of Joy and George Adamson when they lived in Kenya. Originally penned in 1960, it is the touching tale of how they raised an orphaned lion cub named Elsa and she grew to be their nearest and dearest friend - she was family. I have rarely read a book so heartwarming. Elsa was really very magical and unique, and after reading this book, having a lion around suddenly begins to sound much more enjoyable than a dog. The movie, Born Free, is of course based on this book, and it is one of my favorite movies of all time. The book encloses a lot more detailed information about Elsa, her habits and her charismatic personality. How lucky we are to be able to read about Elsa and appreciate a little slice of the African animal population through the eyes of two people who sincerely loved and understood these creatures better than most people could ever hope to. Everybody should read this book."}, {"userName": "Jami", "userReviewDate": "Jan 09, 2013", "userURL": "http://www.goodreads.com/user/show/5777523-jami", "userReview": "While I loved Elsa's story and enjoyed most of the pictures in the book, this was not the heartwarming story I remember from my childhood. I love Elsa, but I really didn't like the Adamsons. It may be because I keep comparing them to Lawrence Anthony, another conservationist, and I find that Mr. Anthony seemed to have more respect for the animals' right to exist in their environment. I couldn't lose sight of the fact that Elsa was orphaned because he killed her mother thinking she was a male lion, leaving the three cubs without a mother. I was confused at her reference to \"beating\" Elsa when she tracked a donkey, which was a purely natural instinct, and not three pages later, said that they never used force with her. In my opinion, a beating counts as force, but maybe that's just me. Finally, I can't help but think how cruel it was to Elsa to keep sneaking off and leaving her when she was sleeping. They keep reappearing and disappearing - I'm not sure that helped her adapt to the wild or simply increased her confusion about where she belonged. She didn't know why the people she loved kept abandoning her and then returning and then repeating the process. One thing I got a chuckle out of was when they returned to Elsa for a three day period several times, and when she got to know the signs they were preparing to leave, she turned her face away from them. My 16 yr old shih-tzu does the same thing when I leave for work! She'll give me kisses whenever I ask, as she is a kisser. But, when I'm off to work, she knows - when I go to kiss her, she whips her face away and refuses to kiss me. When I come home after work, well, that's a different story!"}, {"userName": "Noran Miss Pumkin", "userReviewDate": "Aug 26, 2008", "userURL": "http://www.goodreads.com/user/show/993934-noran-miss-pumkin", "userReview": "You saw the movie, you sang the song, you begged mother for the vinyl, and she bought you the book as a surprise. Elsa had all our hearts back then, and her was amazing and truly free in the end. It was the Feel Good story of the decade. so, I think it might be time to bring it back once again for the new generation. What better message to save the Earth?"}, {"userName": "Joanne Moyer", "userReviewDate": "Sep 18, 2012", "userURL": "http://www.goodreads.com/user/show/4939131-joanne-moyer", "userReview": "I saw the movie Born Free as a child and loved it. I probably read the book along the way too but as usual don't remember. The story of Elsa and the Adamsons is still an amazing one of love and devotion between a wild animal and her 'pride', George and Joy Adamson. The descriptions of where and how they lived is really interesting as it's a way of life not many will ever experience"}, {"userName": "Петър Панчев", "userReviewDate": "Jul 14, 2017", "userURL": "http://www.goodreads.com/user/show/28015127", "userReview": "Елза, която стана легенда(Цялото ревю е тук: https://knijenpetar.wordpress.com/201...)Една по една започнаха да се появяват книгите от детството ми. Новите издания отново ме върнаха в онези години, когато пътешествията на мисълта притежаваха наистина силна магия и нищо не можеше да ме откъсне от поредното приключение. За някои вече писах в блога, за други ще пиша след поредното препрочитане. По онова време претърсвах библиотеките и четях ненаситно какво ли не. Тогава попаднах на Джой Адамсън и нейните книги за дивата природа и, разбира се, бях неудържимо привлечен от тези реални истории. „Лъвицата Елза“ („Вакон“, 2017, с превод на Весела Илиева, Василка Шопова и Светлана Стефанова) отново може да се открие сред другите книги в книжарниците, което изключително много ме радва. Е, по онова време бях много впечатлителен – хлапашките мечти ме превъзбуждаха дотолкова, че не се интересувах особено от стилове на писане и подход към историята. Сега книгата ми се стори по-малко магическа и повече „земна“, ако мога така да се изразя. Ако описваш подробно поведението на едно животно, със сигурност ще видиш една леко досадна повторяемост, като дневник, в който всеки ден се опитваш да си отговориш на един и същи въпрос. Но това е нормално за научнопопулярните изследвания в дивата природа. Все пак завръщането ми към дивата Кения ми донесе удовлетворение, което трудно намирам в много от прочетените книги. Това е природата, това е реалността от която човечеството се опитва да избяга, изграждайки солидни прегради, без да осъзнава, че руши клона, на който е стъпило. Истории като тази събарят за кратко тези прегради и създават усещане за единение с природата, което изпитваме, когато изкачваме планина или се разхождаме по дивите пътища. Ето и самата история…(Продължава в блога: https://knijenpetar.wordpress.com/201...)"}, {"userName": "LibraryCin", "userReviewDate": "Jan 01, 2018", "userURL": "http://www.goodreads.com/user/show/12860715-librarycin", "userReview": "I love animals, and it would be a dream come true to bond with a wild animal like Joy and her husband George did. It was an easy read, and there were lots of wonderful photos. What a fabulous lion Elsa was - she learned to live with other wild lions, but at the same time, she was gentle and always careful around her human caretakers, who she seemed to love just as much as they loved her."}, {"userName": "Lisa (Harmonybites)", "userReviewDate": "Oct 15, 2012", "userURL": "http://www.goodreads.com/user/show/2596042-lisa-harmonybites", "userReview": "This is the book the film was based upon, the story of Elsa the lioness, hand raised by a Senior Game Warden and his wife, Joy Adamson, and later released into the wild. This would be rated five stars except that I really try to be stingy with those. The book didn't make me cry, laugh-out-loud or change my thinking, and Adamson, while she writes well and fluently, doesn't have the impressive, lyrical prose of Beryl Markham and Isak Dinesen, two other European women who wrote celebrated memoirs about their time in Kenya. But what this book does offer is what a friend of mine called a \"lost art:\" The ability to write about an animal without treacly sentimentality but rather with sharp and insightful observations that make their personality evident (and in this case lovable) without a narcissistic focus on the writer and without an evident heavy-handed political agenda. Not that it hasn't had such a political effect. A Foreword by George Page quoting Faith McNulty claimed Born Free \"may have done for the cause of wildlife what Uncle Tom's Cabin did for the antislavery crusade.\" Not only did the book gain support for the protection of habitat and endangered animals, but the Adamsons helped pioneer the technique of reintroducing animals raised in captivity back into the wild. Not that Elsa could ever be called a captive lion. That's what made her happy ending possible. She was never confined, never treated with brutality in an attempt to dominate. Even after successfully released into the wild, when the Adamsons came to visit her she'd recognize and greet them with affection. As Joy Adamson put it, their relationship continued \"to be one of absolute equality quite different from that between a dog and his master.\" This is a short book you can read in a few hours and filled with a multitude of photographs of Elsa. It was a pleasure to read and I highly recommend it--especially for lovers of animals and nature."}, {"userName": "Zoe", "userReviewDate": "Jun 22, 2008", "userURL": "http://www.goodreads.com/user/show/1261020-zoe", "userReview": "This is the inspiration, true story Elsa, a lioness, who is raised by the author Joy Adamson, and her husband George. When George must go on safari after a man-eating lion, his hunting party is attacked by a vicious lioness. She is shot in self-defense, but they realize later with remorse that she had been trying to protect her young, three cubs who George brings back to camp. Though Elsa’s sisters are sent to a zoo when they are still cubs, Elsa remains in Kenya with the intent of joining her sisters later. When she is nearly a full grown lioness, George & Joy no longer have the heart to place Elsa in captivity; not when she has grown up in her native environment. They begin the painful process of reintroducing her to the wild. Can a domesticated lioness survive in the wild? Will she still be accepted by her own kind? Read and find out. ;) This book is filled with rather adorable photographs. It is written from the point of view of a crazy cat lady/cat lover who truly loves her kitty."}, {"userName": "Kirsty Noah-whitlock", "userReviewDate": "Aug 12, 2015", "userURL": "http://www.goodreads.com/user/show/34299953-kirsty-noah-whitlock", "userReview": "Bit of a hard one to review. I love Elsas story but not entirely agreeable with Joy and George, just because of some of the animals they killed for no reason to be honest. At times I felt like giving up on the book for this reason but I'm going to continue the trilogy and try reading Living Free to see how Elsas journey continues. I may even get a liking for Joy and Else you never know, watch this space xx"}, {"userName": "Sally68", "userReviewDate": "Mar 04, 2017", "userURL": "http://www.goodreads.com/user/show/49358680-sally68", "userReview": "Ho un ricordo stupendo del telefilm tratto da questo libro...Allora ero una bambina, ma la vicenda di questa leonessa, di Joy e George che con cura allevarono questa cucciola mi ha emozionato nuovamente oggi, come lo fece allora.Per il grande rispetto e amore che avevano per Elsa e per la sua natura, riuscirono a rimetterla in libertà..\"\"Per quanto ci fossimo preparati al distacco e sperassimo di poter cosí dare a Elsa un avvenire migliore di quello che avrebbe avuto in cattività, il momento della separazione effettiva era una cosa molto diversa.\""}, {"userName": "L K Simonds", "userReviewDate": "Mar 15, 2018", "userURL": "http://www.goodreads.com/user/show/57210353-l-k-simonds", "userReview": "Long before Hemingway, Dinesen, and Markham shared their Africa with me, I knew Elsa's Africa. This was a memoir I read in my youth, perhaps the first, and it remains with me to this day.Joy Adamson's story of returning an orphaned lion who had been raised as a pet to the wild is heartbreaking, heartwarming, and hopeful. It's also a peek at East Africa in the 1950s. All around, a good and emotional read."}, {"userName": "Amalie ", "userReviewDate": "Oct 02, 2017", "userURL": "http://www.goodreads.com/user/show/4164661-amalie", "userReview": "Before this Elsa:ANDThat adorable Kiara:There was THIS Elsa. An orphaned lion cub, the weakest of the litter that grew up into a beautiful lioness named Elsa, who got involved in many adventures with her foster parents.Oh, my goodness, how did I forget this one!!!"}, {"userName": "Chloe Playle", "userReviewDate": "Apr 06, 2017", "userURL": "http://www.goodreads.com/user/show/65462033-chloe-playle", "userReview": "I read this when I was young, and made me cry my eyes out. I still think of this book."}, {"userName": "Христо Блажев", "userReviewDate": "Jul 03, 2017", "userURL": "http://www.goodreads.com/user/show/5091378", "userReview": "Лъвицата Елза още тича из саваните на Африка: http://knigolandia.info/book-review/l...Историята е добре позната, но все пак – едно семейство, Джой и Джордж Адамсън, което защитава дивите животни в Кения, приютява осиротяло лъвче, най-слабото от котилото си. Джой проследява почти ден по ден как лъвчето се превръща в горда и красива лъвица на име Елза, която се забърква в много приключения със своите приемни “родители”. Да се грижиш за лъвица не е никак лесна задача и има безброй дребни случки, които Адамсън проследява пунктуално – което всъщност ми досади, многобройните повтарящи се срещи с други животни и реакциите на Елза спрямо тях не се различават особено.Издателство Ваконhttp://knigolandia.info/book-review/l..."}, {"userName": "Carlissa", "userReviewDate": "May 23, 2018", "userURL": "http://www.goodreads.com/user/show/3096586-carlissa", "userReview": "I read this when I was a child and remember loving it. Would love to read it again someday."}, {"userName": "Robin Mayerhoefer / October Woman", "userReviewDate": "Apr 07, 2013", "userURL": "http://www.goodreads.com/user/show/1164958-robin-mayerhoefer-october-woman", "userReview": "The author’s husband, in his duties as a game warden, was forced to shoot a lioness as she attacked. He then found her three young cubs (and felt great remorse at having killed their mother) and took them home. Two of the cubs were eventually sent to a zoo, but the smallest, Elsa, stayed on as a member of the household. The bond between Elsa and the Adamsons is incredible. While raising Elsa as a pet, they rarely kept her penned up or chained and gave her a lot of freedom to still act like a lion. She was very loving and affectionate to them, and to other people who came into contact with her. You can almost feel the love that Joy and Elsa shared, and Elsa’s personality comes through very clearly. The descriptions of her playful antics are amusing, and it’s an interesting peek also at life in the bush. When the time inevitably came, Joy and George made the hard decision to release Elsa into the wild. After finding a suitable location, they spent a lot of time teaching Elsa to hunt for herself. They would make camp, spend time with Elsa, and then leave her on her own for a day, then a couple of days, then a week at a time. She was always happy to see them on their return, while at the same time growing more and more self-sufficient. Even after being in the wild on her own for several months, Elsa would still get very excited when George and Joy visited her, showing them much affection and wanting to play with them. But she also grew more independent, and began to show signs of wanting them to leave her alone, and her transition from family pet to wild lioness was successful. A heartwarming and well written story, with lots of pictures (in my edition of the book anyway), and now I want to watch the movie again."}, {"userName": "Lesle", "userReviewDate": "Apr 13, 2015", "userURL": "http://www.goodreads.com/user/show/28186136-lesle", "userReview": "A story of Elsa a lion cub raised and loved by Joy and George. A telling of the hardship for both Elsa and her human family. It seemed at times to be unattainable and a failure. The life for Elsa was torn between that of being a pet or living a free life in the wild as she was meant to have. The steps in her life are told in many fun and hard adventures. Elsa finally is her own lioness but she never forgets her human family. Elsa's story started the wild animal rights to live wild and free and ends in a very real legacy left by both Elsa and the Adamson's.Adamson's writing flows like a conversation between friends. The adventures with Elsa touch you in a very special way that true stories usually do. I had moments of laughter and smiles as well as tears.Side note: This was not their first and only encounter with lions. George brought the lion and Africa back into the life of Christian A Lion Called Christian: The True Story of the Remarkable Bond Between Two Friends and a Lion born in a pen and displayed at Harrod's until two men rescued Christian as a cub, kept him till he was too big and finally also returned him to live the life of freedom with the help of George Adamson's capable hands."}, {"userName": "Iskreads", "userReviewDate": "May 09, 2011", "userURL": "http://www.goodreads.com/user/show/5372842-iskreads", "userReview": "Born FreeBy Joy AdamsonReview by Graham WBorn Free is an amazing story, that is also true and is unlikely to happen to just anyone. One of the people lucky enough to experience this was Joy Adamson, the author of the book. Just being in a Safari car on a bumpy road is all worth it, even in tall grass never knowing what is coming around the corner. But as long as the truck is moving you can never take even a half decent picture, and when searching for lions, its just part of the adventure. But Joy Adamson never had to do that she could almost always walk out onto her porch and let her pet lion Elsa suck her thumb. This incredible story is of a lioness that starts with the very beginning of its life. I have lived in Africa for about 3 years and have never heard anything like it until reading this awe-inspiring book.Although she originally had three lions she gave the bigger two out into a zoo in London after they were old enough to care for themselves. The smaller one, Elsa, was too reliant on people for food so they kept her. When she was around two years old, they tried to release her gradually but failed. Could they do it and release her with ease? Read “Born Free” to find out. Graham W."}, {"userName": "Kiara", "userReviewDate": "Jul 03, 2017", "userURL": "http://www.goodreads.com/user/show/68822938-kiara", "userReview": "I'll start with what I liked about this book: the pictures.Now, I don't know what you're looking for in a book. But to warn you, this book is mildly racist, scatterbrained, and boring at some parts. One paragraph she'll be telling this one story and then she'll get off track and tell a different story without summing up the first one or giving the second relevance or importance. Some areas I zoomed through reading and others I practically fell asleep at. I thought it would be interesting because it was about a lion... I guess lions can be boring, too.My last issue with this book is when she beat Elsa for mauling the donkey and when she would say she \"didn't like to kill animals.\" Whenever she said she didn't like killing animals, she would follow it up with some story of why they 'had' to kill an animal. Her husband would randomly kill animals and she would talk about how it was 'necessary.'"}, {"userName": "g-na", "userReviewDate": "Feb 11, 2012", "userURL": "http://www.goodreads.com/user/show/7709596-g-na", "userReview": "This is the 40th anniversary edition of this classic book, and it contains a new forward. I remember seeing this movie as a child, and it had a very sad ending that made me cry. This book, however, did not end on a sad note; now I think the movie may have included part of the storyline from the book's sequels.Born Free is a cute, bittersweet story of a couple in Kenya and their lioness, raised from a cub and successfully returned to the wild. It took place in the late 50s and retains a tiny bit of the cultural attitude that was prevalent at the time. Nevertheless it is highly recommended for anyone who likes animals."}, {"userName": "Lisa Vegan", "userReviewDate": "May 13, 2007", "userURL": "http://www.goodreads.com/user/show/83445-lisa-vegan", "userReview": "I cannot remember how many times I reread this book; it was many. I also enjoyed Living Free and Forever Free although not quite as much, but it would have been impossible for me to not read those sequels as I would have been painfully curious about how the story continues.I’ve cried a lot each time I’ve read it because the book is so emotionally moving. The story of Elsa the lioness and her humans and Kenya was completely engrossing. I read it first when I was about 12 and it got me interested in Africa and conservation. And lions. Adamson does a terrific job of telling a very personal story and also educating about the bigger picture. A captivating read."}, {"userName": "Barbora Romanovská", "userReviewDate": "Jan 19, 2015", "userURL": "http://www.goodreads.com/user/show/21937088-barbora-romanovsk", "userReview": "Možná díky tomu, že je zima, jsem dostala chuť na četbu o černém kontinentu. A příběh lvice Elsy je vlastně hrozně dojemný (páč zvířátka, víme). V jednom kuse jsem googlila flóru i faunu safari, což všem čitatelům mohu jen doporučit. Afrika mne láká už dlouho, spaní v buši, hvězdné nebe, kůže Afričanů jemná jako papír, noční symfonie... Jo, zasáhla mne romantika a touha po dobrodružství.Tedy ani v nejmenším jsem netušila, že Joy Adamsonová byla Češka! Prý měla i poměrně pohnutý osud, takže se zkusím po něčem podívat."}, {"userName": "Eirian", "userReviewDate": "Apr 19, 2014", "userURL": "http://www.goodreads.com/user/show/30436705-eirian", "userReview": "I read this book fairly recently having adored the film as a child. I'm glad to say it quickly became one of my favourites. Although the story itself is obviously beautiful, and with the book including much more detail than the film which I was unaware of before, the really exciting part was the multitude of Elsa picture's which have been included! They are all black and white in my copy but to actually see Elsa grow up from a cub to a lioness alongside reading her tale was lovely. If you loved the film (or even if not) - get this book!"}, {"userName": "Kayla", "userReviewDate": "Oct 10, 2009", "userURL": "http://www.goodreads.com/user/show/712048-kayla", "userReview": "This was a nice read. I enjoyed the story and the pictures of Elsa. The author starts the book off when she and her husband first find the lion cubs. She talks about their playfulness, shyness, and intelligence. I thought it was amazing how intelligent Elsa was. In many ways she was smarter than the typical canine. Elsa must learn how to hunt and survive on her own with only her human parents to teach her. There were many skills that she picked up from instinct alone. Again great book! This is what \"Born Free\" the movie is based on."}, {"userName": "Fellini", "userReviewDate": "Apr 20, 2014", "userURL": "http://www.goodreads.com/user/show/6114479-fellini", "userReview": "Великолепная история! Впечатлилась ей ещё в детстве и вот недавно перечитала. С такой увлечённостью, с такой любовью к животным и наблюдательностью написано, что остаться равнодушным невозможно.==========Я убеждена, что, помогая животным, мы помогаем себе. Если мы их уничтожим, будет нарушено равновесие в мире, частицу которого мы составляем."}, {"userName": "Jen", "userReviewDate": "Mar 03, 2009", "userURL": "http://www.goodreads.com/user/show/1719442-jen", "userReview": "The mastercheese for lion lovers. Grab the hankies. Freedom!http://www.youtube.com/watch?v=53KwUm..."}, {"userName": "Katherine", "userReviewDate": "Jun 16, 2017", "userURL": "http://www.goodreads.com/user/show/22652505-katherine", "userReview": "Jsem to četla, když jsem byla pidi. Pohled mám tudíž možná trochu zkreslený, ale vím, že se mi to tenkrát šíleně líbilo. :D"}, {"userName": "Neve", "userReviewDate": "Nov 16, 2017", "userURL": "http://www.goodreads.com/user/show/73890624-neve", "userReview": "Born Free: A Lioness of Two Worlds By Joy Adamson Review by NeveLions have never been at my peak of interest, but the story of Joy Adamson and Elsa the lioness certainly did when I first came across this book. It retells the experience Joy and her husband George as they raised Elsa for three years. Throughout the story they travel on safaris and introduce Elsa to the natural world. Joy and Elsa develop a mother-daughter like relationship that lasts a lifetime.  I was not a fan of this story because it did not seem coherently written and if it was published now, it would look more like someone's blog rather than a story. Joy is both the author and one of the main characters, and she goes off on tangents about loosely relevant topics, such as a safari she once went on with (Pati the rock hyrax) before she found Elsa. The plot of the book seemed all over the place at times; it would just jump to an only slightly relevant topic. Additionally, often entire chapters seemed pointless and not relevant to the story. The most prominent example of this is the third chapter \"Elsa Goes to the Indian Ocean\" where Joy and George took Elsa to the beach when she turned a year old. This chapter adds nothing to the story except for a plot point that is quickly resolved in the next chapter and the fact that Elsa was playful with the other animals, which was already shown in the second chapter. I was not impressed. Despite the unfortunate writing style, Born Free echoes the theme of an unbreakable mother-daughter bond, which is displayed through the relationship between Joy and Elsa. This was highlighted when they were temporarily separated at various points throughout the story. Elsa cried when she missed Joy. Whereas, Joy couldn't keep Elsa and the safety of her well-being out of her thoughts. This theme is woven throughout the story and it's incredibly heartwarming to hear Joy and Elsa care for each other in their times of need.  Joy was not the worst narrator, but she frequently showed obvious bias throughout the story. Since she narrated with the perspective of herself as a main character, she constantly portrays herself and Elsa as perfect and omniscient and incapable of doing anything wrong, which can get slightly annoying. The only fault of Elsa that Joy recognizes is Elsa's lack of independence, but Joy would rather Elsa not be independent, and stay with her forever.  Finally, something I really liked and appreciated about this book was the abundance of pictures. They help clear things up in the story when Joy got distracted on a tangent. However, the pictures were not evenly distributed and a chapter could be six pages of no pictures, and then five pages where three and a half of the pages were pictures. This was only slightly bothersome as it is understandable for the pictures to be formatted this was as they were taken over fifty years ago. The pictures also made the book seem a lot shorter because half of every chapter is pictures and the book is only 220 pages in total.  Despite some annoyances in the writing, this book was still ok. The pictures of Elsa were very cute and the book wasn't too long to read."}, {"userName": "Andrew Ives", "userReviewDate": "Mar 18, 2018", "userURL": "http://www.goodreads.com/user/show/5949552-andrew-ives", "userReview": "(1st ed, 7th imp) Although I remembered not liking the film much at all, and knowing that the book would be without the Matt Monro music which was the best thing about the film, I hoped that somehow the book would be better than the film, as is often the case with adaptations.Alas, it was not to be. I expected a film/book about lions to be fairly red in tooth and claw, but basically this is a gruesome chronicle of shooting every kind of unfortunate gazelle, zebra, warthog, crocodile, guinea fowl, antelope, fish, buffalo that crosses the Adamsons' path. As well as taking sheep for a stroll with Elsa the lion 'for dinner later', having a pop at a rhino and hunting other 'trouble-making' lions (including Elsa's mother), the locals' traditions of spearing elephants, slitting buffalo throats and the lions themselves hunting the odd camel, person, monkey, cow and donkey adds to the unpleasantness. Coupled with plenty of unappealing b&w, not-particularly-well-taken photos (a few with the wrong captions) of corpses and carcasses being dismembered, I felt like some kind of butcher reading this and frequently came close to giving up. It's quite worrying to think this is about the 1950s not the 1750s.On the plus side, it's short and Joy's writing style is quite old-fashioned and matter-of-fact. The manuscript could benefit from some proofreading as she often spells 'carcass' and 'carcase' differently on the same page and the punctuation is rather sparse. The map on p42 looks lost there and might just as well be at the front somewhere where the reader can find it more easily. Most of all, I don't like how this is almost portrayed as a scientific experiment - not dissimilar to Project Nim - to see how lions adapt to being half-wild and half-tame, and the 'surprise' finding that lions have some intelligence. Of course they do! After reading this book, Elsa and the hyrax are the only ones who come out of it with respect, having done no wrong at all. The humans' behaviour is somewhere between stupid and disgusting. Leave the animals alone!"}], "description": "There have been many accounts of the return to the wild of tame animals, but since its original publication in 1960, when the New York Times hailed it as a \"fascinating and remarkable book,\" Born Free has stood alone in its power to move us.Joy Adamson's story of a lion cub in transition between the captivity in which she is raised and the fearsome wild to which she is returned captures the abilities of both humans and animals to cross the seemingly unbridgeable gap between their radically different worlds. Especially now, at a time when the sanctity of the wild and its inhabitants is increasingly threatened by human development and natural disaster, Adamson's remarkable tale is an idyll, and a model, to return to again and again.Illustrated with the same beautiful, evocative photographs that first enchanted the world forty years ago and updated with a new introduction by George Page, former host and executive editor of the PBS series Nature and author of Inside the Animal Mind,  this anniversary edition introduces to a new generation one of the most heartwarming associations between man and animal.", "title": "Born Free: A Lioness of Two Worlds\n      \n          (Story of Elsa #1)", "url": "http://www.goodreads.com/book/show/758153.Born_Free", "average": 4.17, "cover": "https://images.gr-assets.com/books/1406563918l/758153.jpg", "reviews": 281, "authors": [{"url": "https://www.goodreads.com/author/show/132350.Joy_Adamson", "name": "Joy Adamson"}], "type": ["Nonfiction", "Animals", "Cultural", "Biography", "Autobiography"], "outlinks": ["http://www.goodreads.com/book/show/758153.Born_Free", "http://www.goodreads.com/book/show/414777.Born_Free", "http://www.goodreads.com/book/show/34870216", "http://www.goodreads.com/book/show/13017331-nata-libera", "http://www.goodreads.com/book/show/34686723-born-free", "http://www.goodreads.com/book/show/3007344-born-free", "http://www.goodreads.com/book/show/30755202-born-free", "http://www.goodreads.com/book/show/21178259-born-free", "http://www.goodreads.com/book/show/24442708-p-b-h-lvice-elsy", "http://www.goodreads.com/book/show/13647143", "http://www.goodreads.com/book/show/16029315-p-b-h-lvice-elsy", "http://www.goodreads.com/book/show/798784.Living_Free", "http://www.goodreads.com/book/show/226126.Forever_Free", "http://www.goodreads.com/book/show/1893408.The_Spotted_Sphinx", "http://www.goodreads.com/book/show/798781.Pippa_s_Challenge", "http://www.goodreads.com/book/show/20524751-born-free"]}