{"ratings": 20436, "userreviews": [{"userName": "Char", "userReviewDate": "Oct 11, 2011", "userURL": "http://www.goodreads.com/user/show/6581119-char", "userReview": "There is no way that any review could live up to this book. It is utterly fabulous. It reels you in and never lets you go. It will bring back every good memory that you had while growing up. The feeling of freedom you experienced riding your bike, exploring wooded areas and just generally being a kid. One of my favorite quotes of all time comes from this book:  We are born able to sing to birds and read the clouds and see our destiny in grains of sand. But then we get the magic educated right out of our souls. We get it churched out, spanked out, washed out, and combed out. We get put on the straight and narrow and told to be responsible. Told to act our age. Told to grow up, for God's sake. And you know why we were told that? Because the people doing the telling were afraid of our wildness and youth, and because the magic we knew made them ashamed and sad of what they'd allowed to wither in themselves. Do yourself a favor. Read this book. Get a little of that magic back."}, {"userName": "Melissa ♥ Dog/Wolf Lover ♥ Martin", "userReviewDate": "Jan 13, 2015", "userURL": "http://www.goodreads.com/user/show/17438949-melissa-dog-wolf-lover-martin", "userReview": "Update: Kindle US for $1.99 today 11-27-17I am almost at a loss of words about this book. It is one of my favorites now. I thought it was going to be just about a mystery of who murdered someone and and father and son trying to find out the mystery! Even though it was a little before my time all of the things that happened in Corys childhood is so familiar growing up hearing all of the stories from family. Granted a lot of the same things were in my childhood but I digress. I loved the mystery that went on throughout the book and finally getting to the end game of it all.I have laughed and cried during this book. Some parts even made my heart soar and also plummet at the atrocities of evil people. This book has a little of so many things. I recommend it to every one."}, {"userName": "Shelby *trains flying monkeys*", "userReviewDate": "Jun 08, 2014", "userURL": "http://www.goodreads.com/user/show/1053760-shelby-trains-flying-monkeys", "userReview": "[The boys flying? I mean I know it was in their imagination but I did not feel that went with the rest of the story...and the dog? WTH? (hide spoiler)]"}, {"userName": "Dan Schwent", "userReviewDate": "Sep 28, 2015", "userURL": "http://www.goodreads.com/user/show/870755-dan-schwent", "userReview": "While riding with his father on the milk route, Cory Mackenson witnesses a car plunging into a bottomless lake with a dead man handcuffed to the steering wheel. Will they figure out who the man was before the memory destroys them?Yeah, that's not a great teaser for this. How do you summarize a couple years in the life of a young boy?I tried hard not to like this book. For the first quarter of it, it wasn't hard. Boy's Life feels overwritten for what it is and Robert McCammon was trying so hard to write like Stephen King that you could taste it. I thought about tossing it back on the to-read mountain. Then it grabbed me. I wolfed it down in less than 24 hours.While it has some crime and horror elements, Boy's Life is a coming of age tale more than anything else. It reminded me of Stephen King's The Body (aka Stand by Me) at first, but it's a lot more than that.Cory is eleven when the story begins, growing up in a small Alabama town called Zephyr. While the mysterious dead man in Saxon Lake kicks off the tale, it's really about Cory getting older and world-weary in Zephyr. Since the story takes place in the early 1960's, the civil rights movement and Vietnam are lurking in the background, as are the rise of corporations.Cory's adventures with his pals were a lot of fun but also harrowing at times. I loved the beast from the lost word and Nemo Curliss. For a twelve year old, Cory was sure in the middle of a lot of weirdness, though. The bit with Rebel added this book to my man-tears shelf. Was Vernon Thaxter a stand-in for McCammon himself?I thought about giving this a five but couldn't. While I enjoyed the book immensely, I felt like parts of it were cobbled together from various Stephen King tales, like The Body, Christine, Pet Semetery, and others. Also, it seemed excessively wordy for what it was at times, like I mentioned at the beginning.All things considered, Boy's Life was a great read. Four out of five stars."}, {"userName": "Elyse", "userReviewDate": "Nov 07, 2016", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "I QUIT!!!I can't stand this book any longer! I mean ....I REALLY can't stand it!!!!!After about 4 hours of my time listening to the Audiobook...I'm DONE!!!I don't care what the hell happens -- I can't remember when I've completely disliked a book moreThe guys voice on the Audiobook sounds condescending to me most of the time.Other times the writing itself is too syrupy sweet. I was bored to death -- I felt everything was OVER-DESCRIBED. My God....I didn't care if the door was shiny. If the damn door was dull it would have been ok with me. Better yet, I was getting resentful with all this boys interpretation about every piece of furniture-his mother's or father's differences.....( and his fricken wisdom about how his parents differences made for a good marriage).I could have cared less about the spots of turtles ( as a metaphor for the truth)....OMG.... and there were TOO MANY metaphors in this book. I was starting to get physically sick...and pissed off!!!I didn't care about his bike riding or his going to the movies to eat candy and popcorn...And I HATED the whimsical magical Philosophy of life from this 12-year-old kid. Boring - long- tedious - pretentious descriptions- NOT FOR ME!!!!"}, {"userName": "Matthew", "userReviewDate": "Oct 27, 2016", "userURL": "http://www.goodreads.com/user/show/16254355-matthew", "userReview": "This was a very good book with two main plot lines and a separate smaller plot in almost every chapter. It reminded me of, and I have read this comparison elsewhere as well, Different Seasons era Stephen King.One of the great things about this book is that it perfectly embodies pre-pubecent innocence and coming of age. I was discussing this in one of my book clubs and we talked about how the main characters had yet to reach the the point of disenchanted teenagers driven by angst and hormones while at the same time having to step up and accept the realities of adulthood.Another oddity of this book is that every few pages something mystical and wild happens and it is never hinted at as being part of the narrator's imagination; it is completely integrated into the story. It leads to some very interesting questions and blows the mind.While this is a long book, it may read quickly for some. If you are a fan of early King and/or character study books, this should be right up your alley."}, {"userName": "Alisa Kester", "userReviewDate": "Jul 23, 2008", "userURL": "http://www.goodreads.com/user/show/1090425-alisa-kester", "userReview": "If I had to pick JUST ONE book that was my favorite (with a gun to my head, obviously, which is the only way I could ever choose between my favorite books) I would choose this one. It blew me away the first time I read it, and it continues to blow me away each and every time I pick it up. I'm getting all shivery right now, just thinking of reading it.My favorite quote -- \"We all start out knowing magic. We are born with whirlwinds, forest fires, and comets inside us. We are born able to sing to birds and read the clouds and see our destiny in grains of sand. But then we get it the magic educated right out of our souls. We get it churched out, spanked out, washed out, and combed out. We get put on the straight and narrow and told to be responsible. Told to act our age. Told to grow up, for God's sake. And you know why we were told that? Because the people doing the telling were afraid of our wildness and youth, and because the magic we knew made them ashamed and sad of what they'd allowed to wither in themselves.\""}, {"userName": "Diane Barnes", "userReviewDate": "Oct 25, 2016", "userURL": "http://www.goodreads.com/user/show/7262060-diane-barnes", "userReview": "5 stars because nothing else will do. 5 stars for the writing, the characters, the plot, the magic. For letting me be inside the mind of a 12 year old boy who is all of us at 12. For the town of Zephyr, Alabama. For Old Moses, The Lady, Mona and Little Stevie Cauley. For 600 pages of sheer entertainment and good writing.I dedicate this review to Mike Sullivan, moderator of the group ON THE SOUTHERN LITERARY TRAIL. He assigned this one as his October moderator's choice, and I sighed and thought to myself: \"Well, I'll give it a try, but it is classified as science fiction, so probably not for me.\" That's the same thing I thought when other people recommended it over the years, when I saw it on lists of books one must read. So, forty lashes to me for being so stubborn and opinionated about genres. I should be thrown into the murky depths of Saxon's Lake, or, even worse, made to spend a week with Grandaddy Jaybird.In my defense, however, and for others who may be thinking the same thing, this book is NOT science fiction. Unless the magic in the world around us can be counted as such.Oh, and 5 stars for what has to be the best acknowledgments page I have ever read."}, {"userName": "Kelly (and the Book Boar)", "userReviewDate": "May 17, 2017", "userURL": "http://www.goodreads.com/user/show/11183856-kelly-and-the-book-boar", "userReview": "Find all of my reviews at: http://52bookminimum.blogspot.com/\n“Don’t be in a hurry to grow up. Hold on to being a boy as long as you can, because once you lose that magic, you’re always begging to find it again.”\nBoy’s Life is a selection I’ve actively avoided ever since it first popped up on my radar due to its unprecedented 4.55 rating amongst my Goodreads’ friends. (If you aren’t familiar with them, let’s just say they aren’t a real forgiving group of readers and leave it with that so they don’t slit my throat.) If you’re of the ilk to take a gander at shelf names, you’ll see this one now sits prominently on the “Like This Or We Can’t Be Friends” option. Approximately 99.999998% of the time that shelf title is for used merely for shits and giggles . . . . but this go ‘round it might be true. You see, I just can’t picture the person who couldn’t find a way to give this story at least 3 Stars and, although I'm well aware they are out there, I'm pretty confident I wouldn't want to associate with them. If you are someone who interacts with me regularly, you are well aware of the fact that I don’t fancy myself as any sort of wordsmith. I tend to ramble and meander around rather producing anything of actual substance in my review space quite regularly all the time. This time words fail me because there aren’t any that could even come close to describing this story. In fact, there’s only one that won’t leave my mind - MAGIC. Boy’s Life is a story about just that . . . . a boy’s life, told as a reflection by said boy who has since grown up. The boy in question is Corey Mackenson. The year? 1964. A new sound had just hit the radiowaves and Corey and his buddies were feeling the vibe of The Beach Boys and couldn’t wait to be old enough to “get a round round around I get around.” From here maybe I’ll let the book do the talking . . . . \n“He wrote this book about the town, and the people in it who made it what it was. And maybe there wasn’t a real plot to it, maybe there wasn’t anything that grabbed you by the throat and tried to shake you until your bones rattled, but the book was about life. It was the flow and the voices, the little day-to-day things that make up the memory of the living. It meandered like the river, and you never knew where you were going until you got there, but the journey was sweet and left you wishing for more.”\nBecause really, it’s all about the writing. Like when a young boy experiences his first crush . . . . . \n“If you were my girlfriend I would give you a hundred lightning bugs in a green glass jar, so you could always see your way. I would give you a meadow full of wildflowers, where no two blooms would ever be alike. I would give you my bicycle, with its golden eye to protect you. I would write a story for you, and make you a princess who lived in a white marble castle. If you would only like me, I would give you magic. If you would only like me. If you would only –”\nOr death . . . .\n“Death cannot be known. It cannot be befriended. If Death were a boy, he would be a lonely figure, standing at the playground’s edge while the air rippled with other children’s laughter. If Death were a boy, he would walk alone. He would speak in a whisper and his eyes would be haunted by knowledge no human can bear.”\nAs I said before - MAGIC.A little bit coming of age story like The Body, a little bit of learning the ugly truths of the civil rights era like To Kill A Mockingbird, a cast of eccentric townsfolk like Midnight in the Garden of Good and Evil with a touch of a “whodunit” thrown in for good measure, Boy’s Life is a true genre bender. If you’re a parent lucky enough to be raising a voracious reader, this one could be offered to those as young as middle-grade – and is one that should not be skipped by any adult if given the opportunity to read it. I recommend you experience Boy's Life during summertime if at all possible. Find a nice shady spot, preferably somewhere you can hear the wind blowing through the trees and, if you’re lucky, a little creek flowing in the background. Somewhere like my backyard. Grab a pitcher of tea, take a seat in an Adirondack chair and settle in for the day. You won’t regret it.Looky there. No gifs!"}, {"userName": "Janie C.", "userReviewDate": "Jun 07, 2015", "userURL": "http://www.goodreads.com/user/show/42838603-janie-c", "userReview": "Wow! To say that I loved this book is an understatement. I don't know why it took me so many years to decide to read it. Perhaps it was the length that put me off; the book is over 600 pages. I shouldn't have let that stop me. Once I got started, the story flowed and kept my attention until the very end.The book begins with the narrator prefacing his story as an adult. He tells us that he believes in magic, and then he proceeds to tell us about the year when he was twelve years old in a little town called Zephyr.It's the story of Zephyr and it's assortment of colorful characters. It's a murder mystery, a story about monsters (both human and otherwise), love and prejudice, ignorance and the grace of making good decisions. It's about a boy who can fly with his friends. It's about dreams that meld with life to provide answers. Most of all, it's about growing up and never losing the magic.Many thanks to the person who bought me this book. It's a treasure."}, {"userName": "Sadie Mother Horror", "userReviewDate": "Mar 07, 2018", "userURL": "http://www.goodreads.com/user/show/28225370-sadie-mother-horror", "userReview": "You know, it's a weighty thing when you've read as many books as I have over my 41 years of life and you finish a book that becomes your new favorite of all time.I never thought I'd read anything that impressed me as much as a Stephen King book. I mean, for a long time Salem's Lot was the gold standard, then it was The Shining, then IT. My favorite book for many, many years was IT. Until just now.Boy's Life is my new favorite, standalone novel.It's literally everything.It's an adventure, it's a mystery, it's a thriller, it's paranormal, it's supernatural, it's a coming of age tale, it's nostalgic and modern at the same time. It's personal and intimate but it's also a book for everyone. The protagonist, Cory and his dad, remind me of the father/son relationship in Roald Dahl's Danny, the Champion of the World, one of my most beloved stories.There are so many memorable scenes and lovable characters. There are quotes for DAYS! I couldn't keep up with them all. There were times when I laughed out loud and I'd tell my family what happened.There was one time where my hubby was making dinner in the kitchen and I was sobbing, reading a scene that near killed me--it just stopped my heart and I was bursting. My husband came in and was like, \"Oh no, what's wrong, what happened\"...I told him and he let me cry on his shoulder while he laughed at me for crying over fictional characters.I kept stopping after like 50 pages because I knew the more that I read, the closer I would be to finishing and I never wanted it to end. But it won't end will it? Not for me, because I'll read this one a dozen more times and cherish it always. A beloved favorite story of all time. Thank you Mr. McCammon."}, {"userName": "Cheri", "userReviewDate": "Apr 27, 2016", "userURL": "http://www.goodreads.com/user/show/106692-cheri", "userReview": "Edit: September 19th, Kindle version is available for $1.99It’s 1964 and Cory Mackenson is a 12-year old boy living in a town and time where boys that age are fairly free of supervision to wander about town together, playing freely through their summers and Saturdays – Sundays are for church. Aside from Cory’s Dad, a milkman, and his Mom, there are Cory’s buddies, his classmates, and a cast of characters in this town, including the neighboring town of Bruton, where The Lady lives. This captivating coming-of-age tale is magical work of art, a masterfully narrated glimpse into a different era through the eyes of Cory Mackenson. Robert McCammon doesn’t overlook the negatives of that time in a place like Zephyr, Alabama. There are so many wonderful things in this story, it’s beautifully written, brilliant, authentically narrated by a engaging young boy on the edge of maturity, learning some of life’s lessons. The only negative, for me, is that it had to end. Read this book, it is a treasure that will magically transport you to those years of wonder."}, {"userName": "Arah-Lynda", "userReviewDate": "Sep 04, 2014", "userURL": "http://www.goodreads.com/user/show/5859453-arah-lynda", "userReview": "[gasp----wasps! (hide spoiler)]"}, {"userName": "Jeff ", "userReviewDate": "Nov 28, 2017", "userURL": "http://www.goodreads.com/user/show/12618229-jeff", "userReview": "[ which is secretly three and a half stars  (hide spoiler)]"}, {"userName": "Agnieszka", "userReviewDate": "Feb 12, 2017", "userURL": "http://www.goodreads.com/user/show/2446508-agnieszka", "userReview": "Boy’s life  is like colorful, multilayered crazy patchwork woven from boyish dreams and desires, a dash of magic and forgotten long time ago by our adult self power to fly. It’s a dish compounded from carefully chosen ingredients that tastes of sweetness of children’s smiles and bitterness of their tears. It’s entering to our dreamed secret garden, realm inhabited both by bloodthirsty monsters and noble sheriffs, heroes that occupied our childish imagination. It’s a nostalgic journey into the past to pre-telly, computer and cell phone era, to the times when we really talked to each other, making stories and let our imagination run wild. Boy’s life  is a foray to place where we lost some illusions and innocence gaining in return awareness that life doesn’t remind a comic book at all, that even children may be injured or die in accidents and that our four-footed friends are not allowed to enter with us in adulthood. But who said everybody gets happy ending ? It’s a brutal lesson of life, clash with the world of stronger and bullies, unjust law and racial prejudices and knowledge that our neighbours now and then like to dress up with ridiculous white robes ( the whole thing spans a year on the cusp of 1963/1964 in some jerkwater town called Zephyr, Alabama ).Cory, sensitive and imaginative teenager is a wonderful narrator of the story and perfect guide to that world. He opens generously doors to the distant land of childhood to let us for some precious moments get rid of stiff corset of adulthood and responsibility, to see things that we crave to do but it wouldn’t be appropriate for us to do them anymore, and taking our hand smoothly brings us through that lost kingdom. In his person reader can embrace own younger self and immerse in these magic childlike years, different in details but as a wholeness perfectly apt.And the message that we can't let slip magic away from our life, in whole it naivety, is something I'll gladly carry for the days to come. I found Boy’s life  deprived of unnecessary didacticism or superfluous moralizing, the truth is that one can't protect kids from every evil of the world and what we really can is to listen to them, to what they are telling us and what's even more important what they're not telling. One can't wrap them in cotton wool, we have to let them learn from theirs own mistakes, gain cuts and bruises, sense of failure and broken hearts. But we may guard them and guide, lead them through life and one day just let them go to fly into the big wide world. And whether we send them into the world not breaking their wings is up to us.4.5/5"}, {"userName": "Bill Khaemba", "userReviewDate": "Jun 09, 2016", "userURL": "http://www.goodreads.com/user/show/41380936-bill-khaemba", "userReview": "\"No!!! Why did it end…I don’t want to close the book, I don’t want to leave Zephyr, Alabama.\" (Throws tantrum)\nThis was truly magical absolutely breathtaking & one of the best books I have ever read… So much life came out of this book, the author (\nbless him\n) managed to \ncapture the true essence of childhood, the beauty of imagination and the importance of naivety\n. The way most people describe the love for this book and the countless recommendation for this one, I can finally say I understand!!!! This is not only a book with pages but actual magic, the minute I closed the book after finishing I yearned for my childhood… From playing hide & seek to wake up early Saturday to catch up on my cartoons and to remember the time I still believed magic actually exist sighCory (\nThe main narrator\n) is a young lad living in Zephyr, Alabama in the 1960s, the small town is quite strange in a way. We see the beauty of being a child through his eyes and also the value of holding on to that inner innocence even as one grows up. One day as he accompanies his father in one of his milk deliveries an accident occurs that will take him into one interesting adventure with lots of unusual characters along the way.Honorable mention on one of the amazing passages…\n\n\n      “See, this is my opinion: we all start out knowing magic. We are born with whirlwinds, forest fires, and comets inside us. We are born able to sing to birds and read the clouds and see our destiny in grains of sand. But then we get the magic educated right out of our souls. We get it churched out, spanked out, washed out, and combed out. We get put on the straight and narrow and told to be responsible. Told to act our age. Told to grow up, for God's sake. And you know why we were told that? Because the people doing the telling were afraid of our wildness and youth, and because the magic we knew made them ashamed and sad of what they'd allowed to wither in themselves.”\n    \n\nI would honestly go into the book blind because you will watch the story unravel in a unique way, I will say that I expected more of a fantasy story but towards the end of the story I came to the realisation that the book in itself is magic. The way the character approached topics of death, love, religion, racism and other topics from his perspective was refreshing because he still kept asking certain questions a normal child would ask like “Why are black people and white people so distant if they all die and go to the same heaven?” or “Is faith real?” I found myself kind of relating to him on a whole other level. The way Robert presents the story through the eyes of a 12-year-old child who is filled with imagination and an eye for the unusual added weight to the story. He painted such vivid images with his description of certain scenes and each character drowned out even though the story was told by a 12-year-old. I normally don’t get child narrators in stories, they usually come off too naïve or too pretentious but on this occasion, it was executed flawlessly.\n\n“No one ever grows up. They may look grown-up, but it's just the clay of time. Men and women are still children deep in their hearts.\" Mrs Neville”\n\nI loved the writing style, it was so elegant with beautiful prose and so many moving quotes that broke me (I cried so freaking hard man) and discussions on\n   life after death, faith in religion, Racism in such a crucial time period, the simplicity of childhood\n etc. This book has completely altered my perspective on how I viewed the world … When I was a kid I always found solace in the little things like food, cartoons, road trips, Christmas mornings and so much. As I grew up society and adulthood came and fucked it up… expectations, adulthood, responsibility and all that evil stuff came to play but I always protected my inner childhood from that invasion. If I see a bouncing castle I would bloody jump on that shit, that first lick of a cold ice cream after a hot day is magic, Saturday cartoons are still my jam because If I don’t have those little things I would probably be in a mental institution.So if you want a book that will make you crave your childhood while altering your perspective as an adult pick this one up .P.S. The only flaw with the book is i need a beautiful edition :) This Edition  I just got this & I can't wait  Literally everyone loves this!!!"}, {"userName": "Heidi The Hippie Reader", "userReviewDate": "Jan 12, 2018", "userURL": "http://www.goodreads.com/user/show/7986781-heidi-the-hippie-reader", "userReview": "Boy's Life is about Cory Mackenson, the southern town of Zephyr and the magic of every day life.We had a monster in the river, and a secret in the lake. We had a ghost that haunted the road behind the wheel of a black dragster with flames on the hood. We had a Gabriel and a Lucifer, and a rebel that rose from the dead. We had an alien invader, a boy with a perfect arm, and we had a dinosaur loose on Merchants Street. It was a magic place.\" pg 10, ebook.The story begins with a death and a mystery. \"On that morning before the sun, as I sat eating my breakfast with my dad and mom in our house on Hilltop Street, the year was 1964. There were great changes in the winds of earth, things of which I was unaware.\" pg 15.After witnessing something terrible sinking into the lake, Cory sets about discovering what or who put it there.The trauma is almost too much for Cory's father to bear. \"Whoever did it had to be a local. Had to be. ... It might be somebody who sits on our pew at church. Somebody we buy groceries or clothes from. Somebody we've known all our lives... or thought we knew. That scares me like I've never been scared before.\" pg 35, ebook.But this book is about more than just the central mystery. It is also about the community of Zephyr and the relationships between the people who live there.There is a racial divide in the town. When the river overflows its banks, the white and black communities come together to prevent disaster. \"There is something about nature out of control that touches a primal terror. We are used to believing that we're the masters of our domain, and that God has given us this earth to rule over. ... The truth is more fearsome: we are as frail as young trees in tornadoes, and our beloved homes are one flood away from driftwood.\" pg 97, ebook.Boy's Life also examines coming-of-age issues like bullies, over-bearing parents, and accepting the realities of old age and death. \"But I'll tell you a secret, Cory. Want to hear it?\" I nodded. \"No one,\" Mrs. Neville whispered, \"ever grows up. ... They may look grown-up but it's a disguise. It's just the clay of time. Men and women are still children deep in their hearts.\" pg 221, ebook.I loved this book. It is a far-reaching tale made for winter nights, to be read with a hot drink in your hand and a warm blanket on your lap.It vaguely reminded me of The Help because of its southern location, the racial issues and some of the mystery elements. But really, Boy's Life stands on its own.Recommended for readers who enjoy historical fiction with a touch of magic and mystery."}, {"userName": "Maciek", "userReviewDate": "Jul 24, 2010", "userURL": "http://www.goodreads.com/user/show/2969647-maciek", "userReview": "Boy's Life is one of those books you do not want to end.A beautiful coming of age story that takes place in Zephyr, Alabama. The time is the early 60's; men still work as milkmen and women devote much of their time to baking, though it has its bad sides: racial prejudices and segregation are still actual problems. The protagonist is a 12 yar old boy, named Cory Mackenson. Cory doesn't have TV and video games; but he has no problem living to the fullest without these. After all, there are bikes, dogs and baseball; there is the theater, school and friends. And magic. Magic of childhood; Cory still has what most adult people have long lost. There is a monster in the river, an eldelry black lady who is more mysterious than she looks, and mr. Vernon Thaxter, a man of bizarre personal conduct. Boy's Life is an extremely bittersweet novel; it doesn't matter whether or not we were born in the 60's or later, in Alabama or someplace else. It reminds us of the wonders of youth; there is a certain poetic beauty in the sense of not understanding everything, of having missed a piece of the full meaning of things. There is great beauty not only in wisdom, but in this blissful, dazed ignorance, where summers are endless, bikes can take you anywhere, and there are always parents and home to return to.Boy's Life might have its problems, but it doesn't diminish the warm and fuzzy feeling that accompanies the reading. It's sad when we do see them, actually: McCammon's novel reminded me that we all lose a part of this dramatic ignoracne, the thing which made us children. What would you do to take seriously the science fiction movies seriously? To believe that the monster in the river might snatch you if you aren't careful? To know that your bike might take you anywhere...if you trust it?Just read the book. It's a great, gorgeous story. McCammon invites you on a journey which is worthwile and rewarding. And remember: the garden is infinitely more beautiful if there are fairies at the bottom of it."}, {"userName": "Lou", "userReviewDate": "May 08, 2010", "userURL": "http://www.goodreads.com/user/show/3699303-lou", "userReview": "This is a Magical story of a boy Cory, he narrates to us about his life in the year 1964 in a small town of Zephyr Alabama where anything and everything happens. His experiences and friendships want to make you tearful and joyful he is on a journey of self discovery and of mysteries that haunt his father and the lake. A highly recommended read one to make my list of must reads, Robert McCammon is a underrated writer a master craftsman storyteller. \n'Because Death cannot be known. It cannot be befriended. If death were a boy, he would be a lonely figure, standing at the playground's edge while the air rippled with other children's laughter. If death were a boy, he would walk alone. He would speak in a whisper and his eyes would be haunted by knowledge no human can bear. This is what tore at me in the quiet hours: We came from darkness, and to darkness we must return.'\nIn a re-read,(May 2012) this time round I felt i discovered more in this wonderful Story. The dead, The Lake, the Dog, the bicycle and the girl in the water are maybe parts that I remember well and loved to revisit.  There was also many things that I had forgotten and reliving it made it a joyful experience. It never tires to read those wonderful sentences that he puts together in this story.When an author writes a story of youth and coming of age they sometimes included their own experiences.In this novel we do see in parts a little peak into the writer Robert McCammon, for instance Golden apples of the Sun by Ray Brabury is mentioned in here as one of Cory's cherished reads and Robert McCammon has mentioned it as a book that he holds dear and recommends. There are other things I have picked up on and they add to just how much a respected and talented writer he is.This story hold a high place in my shelf in line withTo kill a mockingbird, The Bottoms by Joe Lansdale, Something wicked this way comes by Ray Bradbury and Stand by Me by Stephen King.As Robert McCammon says in the final pages of this novel, in the acknowledgments, I too bid you farewell in his words...Your lake will always be deeper and sweeter than mine, your jar hold greater mysteries, your rockets travel truer to the heart.These excerpts below are ones that I felt echoed a thousand heart felt feelings.\n\"In later years I would think that no woman's lips had ever been as red as that bike. No low-slung foreign sports car with wire wheels and purring engine would ever look as powerful or as capable as that bike. No chrome would ever gleam with such purity, like the silver moon on a summers night. I had a big round headlight and a horn with a rubber bulb, and its frame looked as strong and solid as the biceps of Hercules. But it looked fast, too; it's handlebars sloped forward like an invitation to taste the wind, it's black rubber pedals unscarred by any foot before mine. Dad ran his fingers along the headlight, and then picked the bike up with one hand.\"Boy, it hardly weighs anything!\" he marvelled.\"Lightest metal I've ever felt!\" He put it down again, and it settled on its kickstand like an obedient but barely tamed animal.\"(Boys toys)\"I looked out, across my hometown. I looked at the green hills and the blue sky, and the distant roofs of Burton. Beside me, Rebel whimpered in a dogs dreams. I never knew what hate really was until I thought of somebody wrapping up a bomb and putting it in a church on a Sunday morning to kill little girls.\"\"This was early summer in Zephyr: an awakening to hazy morning heat, the sun gradually burning the haze off and the air getting so humid your shirt stuck to your skin by the time you'd walked to the mailbox and back. At noon the world seemed to pause on its axis, and not a bird dared to wing through the steaming blue. As afternoon rambled on, a few clouds rimmed with rule might build up from the northwest. You could sit on the porch, a glass of lemonade at your side and the radio tuned to a baseball game, and watch the clouds slowly roll toward you. After a while you might hear a distant thunder, and a zigzag of lighting would make the radio crackle. It might shower for thirty minutes or so, but most times the clouds just marched past with a rumble and grunt and not a drop of rain. As evening cooled the earth, the cicadas droned in their hundreds from the woods and lighting bugs rose from the grass. They got up in the trees and blinked, and they lit up the branches like Christmas decorations here on the edge of July. The stars came out, and some phase of the moon. If I played my cards right, I could talk my folks into letting me stay up late, like until eleven or so, and I would sit in front yard watching the lights of Zephyr go out. When enough lights were extinguished, the stars became much brighter. You could look up into the heart of the universe, and see the swirls of glowing stars. A soft breeze blew, bringing with it the sweet perfume of earth, and the trees rustled quietly in its passage. It was very hard, at times like this, not to think that the world was as well-ordered and precise as the Cartwright ranch on \"Bonanza,\" or that in every house lived a \"My Three Sons\" family. I wished it were so, but I had seen pictures of a spreading dark, a burning man, and a bomb-wrecked church, and I was beginning to know the truth.\"(Wish i/you was here?)\"I had seen her naked. In all my life I had seen no female naked but my mother. I had been in the presence of Chile Willow only a short time, but what is time when a heart speaks? My heart was speaking to Chile Willow in that moment, as she bathed my cuts and gave me a smile. My heart was saying if you were my girlfriend I would give you a hundred lighting bugs in a green glass jar, so you could always see your way. I would give you a meadow full of wildflowers, where no two blooms would ever be alike. I would give you mu bicycle, with it's golden eye to protect you. I would write a story for you, and make you a princes who lived in a white marble castle. If you would only like me, I would give you magic. If you would only like me. If you would only-\"(Love)\"This was to be my first experiment with it, and like any first experience, the feeling stays with you forever. What this was exactly I can't say, but it drove into my soul and made a home there. Everyone was watching me; everyone was listening to me. The words coming out of my mouth-the words I'd conceived and give birth to- were making time null and void; they were bringing together a roomful of people into a journey of common sights, sounds, and thoughts; they were leaving me and travelling into the minds and memories of people who had never been at Saxons Lake that chill, early morning in March. I could tell when I looked at them that those people were following me. And the greatest thing- the very greatest thing-is that they wanted to go where I led them.\"(The joy of writing)\"I sat beside him as the chill wind moved around us. Rebel made little whining noises deep in his throat. He let me pat him, but he was somewhere else. I remembered him as a puppy, full of boundless energy, enthralled by a yellow ball with a little bell in it. I remember the times we had raced each other, and like a true Southern gentleman he had always let me win. I remembered when he flew, over the hills of summer. Even if that had only been in my imagination, it was truer than true. I cried some.More than some.\"\nVisit my webpage to read the interview during March 2012 >>>>http://more2read.com/review/interview-with-robert-r-mccammon/"}, {"userName": "Zoeytron", "userReviewDate": "May 25, 2014", "userURL": "http://www.goodreads.com/user/show/12656534-zoeytron", "userReview": "The year is 1964. The place, small town Zephyr, Alabama. Back when there was something magical about a summer just starting. Childhood buddies Cory, Davy Ray, Ben, and Johnny are twelve years old. It was impossible not to wax nostalgic while reading this coming of age story, as I, too, was twelve years old in the summer of 1964. No cell phones, no cable TV, no PCs. A simpler time, to be sure. Time was spent riding your bicycles, exploring, playing hard, and learning life's lessons, one by one. Milk was still delivered to your front porch in the wee small hours of the morning by the neighborhood milkman, oxygen tents were used in hospitals, and Moon Pies were the cat's pajamas. School teachers all seemed ancient, seating was boy, girl, boy, girl. Long division was being taught, with nary a calculator to be had. No superstores on the horizon, but there were Piggly-Wiggly grocery stores and Woolworth's 5 & 10 stores. Baseball games were broadcast on the radio. Love the parallel between youthful school yard bullies, Gordo and Gotha Branlin, who are simply mean-stupid, and the Blaylock clan, thugs who are said to be 'meaner 'n horny rattlers'. Nothing but grown-up bullies. Kid humor is spread throughout, including the observation of farts, silent but deadly. It was all right on the money, if my recollection is correct. I was struck by something that Cory's dad noted to his son, that being when it rains while the sun is shining, it means the devil is beating his wife. My very own father shared the same reference with me, the only variation being that the devil was spanking his wife when this phenomenon occurred. This is the first time I have read Robert McCammon. What a storyteller! Boy's Life is going on my top 10 all-time favorites shelf. Stellar read!"}, {"userName": "Perry", "userReviewDate": "Sep 14, 2016", "userURL": "http://www.goodreads.com/user/show/6354112-perry", "userReview": "Splendid Story of Southern BoyhoodAnybody who has survived his childhood has enough information to last him the rest of his days. Flannery O'ConnorA 4.4--almost a 5. This 1991 novel likely won't be on syllabi in university literature classes this fall. Nonetheless, it's one of the most entertaining and heartfelt stories I've read of Southern childhood, though I think Donna Tartt's The Little Friend is better. This novel stayed with me for a while. Sometimes, this is exactly the kind of affable fable that I want and need to read.The story's protagonist and narrator, Cory Mackenson narrates the story as a grownup looking back to the summer of 1964 when he was 12 years old in the little town of Zephyr, Alabama. Knowing the area, it seems the town is near Atmore and Brewton in Escambia County, Alabama at the upper part of Alabama's panhandle. The town is much like Maycomb (from To Kill A Mockingbird, the fictional Monroeville one county over) and Mayberry, N.C. (stomping grounds of Sheriff Andy Taylor, his son Opie and deputy Barney Fife). Both the town and the story have that folksy, haimish feel.The story's action begins when Cory and his father Tom (a milk deliveryman) nearly run into a car rolling into Saxon's Lake. Tom swims in after the car to save the driver, but finds he's handcuffed to the steering wheel and already dead. The local law enforcement cannot find the car or the corpse so its identity remains a mystery, but obviously a murder.Torn up about the dead body, Tom has a recurring lacustrine nightmare. His oneiric visions give him a continual presentiment of something awful, and he begins to suffer from depression, approaching suicidal at one point.The novel cannot be pigeonholed into one genre. It's parts literary, suspenseful mystery, coming of age. Its themes are related to family, two deaths of ones close (in addition to the murder), guns, race relations in the 1960s South, hatred in various forms, and bullying. McCammon infuses his primary characters with such a verisimilitude, grace and charm, you can hear the drawl as you read the dialogue. He creates a particularly memorable wicked antagonist and a few sideshow redneck scofflaws. The story enthralls the reader with everything from an elderly African American raconteuse, imprecator known as \"The Lady,\" who knows a bit of magic that seems a mixture of voodoo and morality, a variety of pals, moonshine, a pair of local bullies, a wayward grandpa, a backwoods brothel, baseball, an odd bird in a Dutch veterinarian who greets youngsters with nicknames such as \"hot shot,\" \"rocket rider,\" \"fighter pilot,\" a pair of local bullies, a revealing and educational field trip observation by 12-year-old Cory of a buxom blonde redneck goddess bathing nude in a local stream (\"love at first sight\"), and a very painful vespine occurrence during a church service.Absolutely enjoyable."}, {"userName": "Sue", "userReviewDate": "Sep 17, 2016", "userURL": "http://www.goodreads.com/user/show/3642045-sue", "userReview": "Great, enjoyable book that hits on so many different emotional levels, and does it so well. I also very much appreciate the author's acknowledgement section at the end as the various cultural references take me back to moments from my youth and their attendant memories. And all just a week before my high school reunion! What a perfect moment to read such a memory-laden book.As for the work itself, there is just so much here and I had so many different responses to it, all deftly drawn by McCammon's prose. Laughter to shivers to near tears. I truly loved Cory's family and his observations of his parents. The pictures of Zephyr are of Anytown, USA in 1964 but for the fact of being in the South and some of what that brings to the table and, of course, that sprinkling of \"the other\" that rides through the story along with Cory on his bike. There seem to be magical influences if not magic itself. And there is evil, if not the devil. There is also some really wonderful writing. One of my favorite sections describes the local movie theater, the Lyric. Cody just had to look up that word in his dictionary:\"Lyric,\" it said: \"Melodic. Suitable for singing. A lyric poem. Of the lyre.\" That didn't seem to make much sense in regards to a movie theater, until I continued following lyre in my dictionary. Lyre took me into the story-poems sung by traveling minstrels back when there castles and kings. Which took me back  to that wonderful word: story. It seemed to me at an early age that all human communication--whether it's TV, movies, or books--begins with somebody wanting to tell a story. That need to tell, to plug into a universal socket, is probably one of our  grandest desires. And the need to hear stories, to live lives other than our own for even the briefest moment, is the key to the magic that was born in our bones. (p 27)For, above all Boy's Life is a book of stories by a fictional boy who wants to be a storyteller. And the author is very likely in good part, Cory. And, I dare say, most, if not all of us want to hear these stories, join in them, become a part of them for a while.Now I haven't spoken to the plot of this book...that is summarized well on Goodreads book page. It is the story of an eleven year old boy confronting life in 1964 Zephyr, Alabama. Where life had previously been pretty much an idyll, one day he learns there is evil and then he learns there are different degrees of evil in his and our world. McCammon uses the culture of the 1960s so well in advancing the story (ah that magical word!)...and as a person who was a teenager in 1964, I recognized and responded to those mentions strongly.I also strongly recommend this book to all who enjoy well written stories. This is the real deal!"}, {"userName": "Carol", "userReviewDate": "May 10, 2013", "userURL": "http://www.goodreads.com/user/show/7668522-carol", "userReview": "\"You Don't Have To Leave What Is, To Visit What Was\"Revisit the past by taking this sentimental journey into the 1960's in Zephyr, Alabama. Eleven year old Corey Mackenson and a memorable cast of well-defined characters (OMG Vernon) will make you both laugh and cry many times throughout the book. From a shocking murder comes haunting dreams, and from boyhood friendships comes both happiness and sorrow. There are creatures and ghosts, floods and bullies, and you'll not forget the wasp's from hell or the magical \"Lady\" who can see that brings healing and wonder.This award winning novel of growing up in a small southern town is just plain entertainment at its best. Loved it! Highly recommend."}, {"userName": "Manju", "userReviewDate": "Oct 14, 2013", "userURL": "http://www.goodreads.com/user/show/11166121-manju", "userReview": "This was the monthly read of a group that I am a member of. This is also the first book that I completed under my resolution of reading atleast one book of the monthly read of my groups. I was a little hesitant reading it (specially after the disaster of The Ocean at the End of the Lane). But this book was nothing like that. In every sense it is better than that. It just left me spellbound.Story captures a whole year of a boy's life named Cory Mackerson. While reading the book I couldn't help but going back to my own memories of class room, stupid chatter with friends, that excitement before the summer vacations and bicycle adventures. If you'll read this I am sure you will relate yourself to Cory in one way or other. This story so beautifully shows emotions for a 12 year old. Be it love, happiness, elation, thrill, mystery, nightmares, pain or death. Even after all these beautiful things this book remains a murder mystery to be solved. Solving the mystery from a 12 year's POV was amazing. This sure is going to my favorite and re-read shelf.So just go ahead and read this beautiful story."}, {"userName": "Melanie", "userReviewDate": "Nov 13, 2016", "userURL": "http://www.goodreads.com/user/show/3195534-melanie", "userReview": "I enjoyed this story about Cory Mackenson very much. This is a tale of good vs evil, friendship, family, racism and small town life. There is a little smattering of fantasy as well. There are many wonderful characters living in Zephyr, Alabama as well as several unsavory ones. The main crux of the story revolves around Cory and his dad witnessing a horrible scene early one morning while out delivering milk. The experience haunts Cory's dad. Cory is determined to help solve this mystery as his dad's well being depends on it. Along the way we are treated to a wonderful tale. I look forward ro reading the other book I own by this author, Speaks The Nightbird."}, {"userName": "Mike (the Paladin)", "userReviewDate": "Oct 16, 2009", "userURL": "http://www.goodreads.com/user/show/2187043-mike-the-paladin", "userReview": "This is a surprising book. My brother and I (who mostly agree on absolutely nothing) both enjoyed this book. We came to the conclusion it might be a generational thing. I'm a \"Boomer\" while he would be on the tail end of that designation if not just after it. A boy and his bicycle...a bike meant freedom then. I grew up in the foothills of the Smokies (Smoky Mountains)till I was 13. I was all over two counties on that bike. Then we moved to Dayton Ohio. There I covered the entire area on my Bike, Back then you could (and I did) park your bike at a bus stop (no lock) ride down town (to hit the available book outlets) ride the bus back. Your bike would still be there and you'd ride it home.The \"paranormality\" underlying this little town, the poison of racism, the relationship of Cory with his dad...as well as with his dog and his bike are all part of this book's magic. Happy, sad, cheerful, and melancholy, it's all here. This is one of my all time favorites. MaCammon in my opinion runs hot and cold. He's written books I liked and books I disliked and books that fall anywhere in between, but this book I loved. It has unsuspected depths and I believe will stay with you."}, {"userName": "Frances", "userReviewDate": "Jan 12, 2016", "userURL": "http://www.goodreads.com/user/show/17651062-frances", "userReview": "This is what a novel should be; nostalgic, thrilling, and has tiny bits of magic.Not the abracadabra magic. But magic enough to amaze you, and still feel real. This a wonderful coming-of-age, fantasy, mystery story rolled into one. Reading this made me feel good about reading in general. That joy... almost magical feeling books give you? Ahh, best feeling in the world, man. Boy's Life will give you that. This is a story of a 12 year old Cory Mackenson in Zephyr, Alabama in the 1960s. There's monster in the river, that finesse Lady who do magic, the murdered man from Saxon's Lake, and people that do good things but were really bad underneath. I may not be from America but I've had my fair share of what living in a tiny suburb was like; where everyone was close enough to know everyone, whose child and parent was this, whose house was that, who lived there, their work and all that. My friends and I biked around, play games outside I can barely remember, and we did this kind of loud clap when wanted to call each other out of our houses without letting our parents know. We imagined things. We make up things and scenarios. We play act like we're different people. Boy's Life will take you there and it made me reminisced how beautiful those times were. That pre-technology time where everything is pure, innocent, and magical for a child.I'm always proud to say that I've lived the life of what a typical child should be. Like Cory and his friends, it was outside. And not in front of a cellphone or laptop. How lucky I was to have that childhood which I don't know if kids these days will still be able to have. Hmm, hello Internet? But you see, it was also from here that I learned about this hidden gem of a book so that's fair enough. This is probably one of those few books that'll stay on me for a long time.Yet again, a book found me at the time I thought magic didn't exist, but they do; in every book that touched us, precisely what Boy's Life did to me."}, {"userName": "Steph", "userReviewDate": "Aug 02, 2008", "userURL": "http://www.goodreads.com/user/show/1372682-steph", "userReview": "You know how you can read a book, and when you are finished, you weep because there is no more? Well, this is one of those books. The story, the characters, the descriptive passages...oh, man, the descriptive passages. Positively magical was the passage about the young boys onthe last day of school before summer break. I had to put the book down and savor that for a while before I continued. Read the passage to my husband (and anyone else who would listen). Ya gotta read this book!"}, {"userName": "Richard", "userReviewDate": "Dec 18, 2010", "userURL": "http://www.goodreads.com/user/show/4677640-richard", "userReview": "★★★1/2Robert McCammon's coming-of-age classic, Boy's Life, is almost universally loved. So when I started the book and got about 5 chapters in, I was initially horrified to find that I didn't have the same warm feeling in my stomach the way others seemed to have when reading it. Had I finally realized that my taste was in fact not as impeccable as I'd thought? Was I going to have to write an unfavorable review for a beloved book and get roasted and trolled for it and lose the respect of my internet friends? Or was I going to discover that all of my internet friends just had really bad taste? The book seemed to lack a momentum, or a real narrative thread and each day-in-the-life chapter, while okay on their own, had the weakest of connections. I knew that there was still about 600 pages to go, and I was losing interest.But then I quickly realized that I needed to start looking at the book as a collection of interlocked short stories detailing the eventful and magical year of 1964 in the life of our protagonist and hero, 12-year old Cory Mackenson, and his very special town of Zephyr, Alabama. A year when Cory transitions out of childhood and into adolescence. Every chapter stood on it's own at first, but the weak threads that connected each one got stronger and stronger as the book went on. Once I started looking at it as a story collection that built on itself like a snowball, I was charmed! Yep, that's the word for it! There's a charm in McCammon's writing that's present in all of his work but it is at it's strongest here. He has such a grasp of his material that he not only is able to command a great child's voice (which always seems terribly hard to do), but also a nostalgic one as well. And I love how these memories are all heightened in reality, the way lifelong memories always seem to be. Every time I revisit strong memories of my childhood, they're probably way more dramatic and romantic, or tragic as they were in reality. In the end, the book is very touching and I can see why it's such a classic. Another win for McCammon!"}, {"userName": "J.K. Grice", "userReviewDate": "Oct 03, 2017", "userURL": "http://www.goodreads.com/user/show/72137025-j-k-grice", "userReview": "I could go on and on about this book. Quite simply it's one of the best American stories ever written. Just amazing. If you've never read BOY'S LIFE, you are really missing out."}], "description": "In me are the memories of a boy's life, spent in that realm of enchantments. These are the things I want to tell you.... Robert McCammon delivers \"a tour de force of storytelling\" (BookPage) in his award-winning masterpiece, a novel of Southern boyhood, growing up in the 1960s, that reaches far beyond that evocative landscape to touch readers universally. Boy's Life is a richly imagined, spellbinding portrait of the magical worldview of the young -- and of innocence lost. Zephyr, Alabama, is an idyllic hometown for eleven-year-old Cory Mackenson -- a place where monsters swim the river deep and friends are forever. Then, one cold spring morning, Cory and his father witness a car plunge into a lake -- and a desperate rescue attempt brings his father face-to-face with a terrible, haunting vision of death. As Cory struggles to understand his father's pain, his eyes are slowly opened to the forces of good and evil that surround him. From an ancient mystic who can hear the dead and bewitch the living, to a violent clan of moonshiners, Cory must confront the secrets that hide in the shadows of his hometown -- for his father's sanity and his own life hang in the balance....", "title": "Boy's Life", "url": "http://www.goodreads.com/book/show/11553.Boy_s_Life", "average": 4.34, "cover": "https://images.gr-assets.com/books/1314302694l/11553.jpg", "reviews": 2090, "authors": [{"url": "https://www.goodreads.com/author/show/5244478.Robert_R_McCammon", "name": "Robert R. McCammon"}], "type": ["Horror", "Fiction", "Fantasy", "Mystery", "Young Adult"], "outlinks": ["http://www.goodreads.com/book/show/11553.Boy_s_Life", "http://www.goodreads.com/book/show/12923449-boy-s-life", "http://www.goodreads.com/book/show/970547.Boy_s_Life", "http://www.goodreads.com/book/show/6278121-boy-s-life", "http://www.goodreads.com/book/show/12455.Boy_s_Life", "http://www.goodreads.com/book/show/10371653-boy-s-life", "http://www.goodreads.com/book/show/11557.Swan_Song", "http://www.goodreads.com/book/show/462658.They_Thirst", "http://www.goodreads.com/book/show/11551.The_Wolf_s_Hour", "http://www.goodreads.com/book/show/11548.Mine", "http://www.goodreads.com/book/show/1525997.Speaks_the_Nightbird", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}