{"ratings": 206, "userreviews": [{"userName": "Jen Malone", "userReviewDate": "Jan 31, 2014", "userURL": "http://www.goodreads.com/user/show/9680498-jen-malone", "userReview": "I'm a lucky critique partner of Gail's and this book gets the gold medal! It's so much fun and Kaitlin is adorably flawed in a sport where perfection is demanded. I especially loved the insider glimpse into the world of figure skating, written by a former competitive skater, and I think girls will line up for this one!"}, {"userName": "Brooks Benjamin", "userReviewDate": "Jan 31, 2014", "userURL": "http://www.goodreads.com/user/show/13086075-brooks-benjamin", "userReview": "I know approximately this much *presses thumb and first finger together* about figure skating. Okay, fine. Maybe less than that.When I was given an ARC of Gail's book, I wasn't sure how much I was going to be able to understand about the moves and technical stuff that accompanies the sport. Worry set in. Before I even cracked open the cover, I wondered if I'd be doing myself and the author a huge disservice by reading it.So I tried the first chapter. The one where Kaitlin's just finished a routine and is waiting on her scores. And when the judges display them? Kaitlin loses it and pitches a Godzilla-sized fit in front of Mom, Dad, friends, and foes.I actually thought to myself, \"Okay, I have no idea what a double spin flipper doohickey move looks like, but I totally get the feeling of gut-wrenching regret that Kaitlin's feeling right now.\" And then Kaitlin's skate coach kicks her off the team and Kaitlin finds her gold-medal Olympic dreams melting right before her eyes. Kaitlin has no choice but to join the only club that'll take her: the bottom-of-the-barrel Falton Club. Sure, it's run down. Sure, the ice has potholes that a New York City taxi could get lost in. Sure, all the other skaters call it the \"Fall-Down\" Club. But Kaitlin doesn't have a choice. She's determined to make it to the Olympics, and if she has to do it through the biggest joke of a skate club around, then fine.That's when I realized that this book wasn't just about figure skating. It's about following your dreams. It's about learning to get back up when you fall. And as a writer (heck, as a human being) that's something I know P-L-E-N-T-Y about. That's why Breaking the Ice worked so well for me. Yeah, it had a ton of skating lingo that was completely foreign, but that gets explained throughout Kaitlin's journey. Gail made it so easy to put myself in Kaitlin's skates. She makes Kaitlin accessible for all of us because we've all seen our own dreams get a little fuzzy at times. We've all had those post-tantrum moments where we collapse into a puddle of misery, convinced that we'll never reach our goals.But we can get right back up. We can try again. Just like Kaitlin.And if we can do it with a double spin flipper doohickey move . . . even better."}, {"userName": "Jean", "userReviewDate": "Jan 31, 2014", "userURL": "http://www.goodreads.com/user/show/2893893-jean", "userReview": "I'm so excited for Gail's debut! Check out its great new title: BREAKING THE ICE."}, {"userName": "Ronni Arno", "userReviewDate": "Feb 02, 2014", "userURL": "http://www.goodreads.com/user/show/16010661-ronni-arno", "userReview": "Sassy, smart, and suspenseful! You'll route for Kaitlin every step (and toe jump) of the way. This book was a delight to read, for both myself and my 12-year-old daughter!"}, {"userName": "Swankivy", "userReviewDate": "Jan 14, 2015", "userURL": "http://www.goodreads.com/user/show/84660-swankivy", "userReview": "Cute--I've never read an ice-skating book before! And I tend to love what I call \"inspirational sports books\"--where people compete and learn life lessons. I love that books like this dive into the context in which these kids learn about friendship and honesty, so you can sort of get this individual sense of what they're doing in what environment, and you can sort of feel like you're there even if you know nothing about ice skating (like me).I think I'll start with what I liked less or thought could have been better about this book, and then I'll list my praise. First off, sometimes the present tense storytelling was really well-done and invisible, but other times it felt weird like the story hadn't completely settled into that tense, and I found myself wishing it was in past most of the time. And sometimes I truly forgot that it was a first-person story because I felt like it was more about Kaitlin than told by her. There were certain plot points that really, really felt contrived for plot purposes, which was interesting to me partly because Kaitlin herself would explicitly say she felt like someone who wasn't her was talking with her mouth or making decisions for her, and that was what it felt like sometimes, with her being puppeted by the plot so certain things would happen to, say, make her get in trouble for storytelling purposes. I thought that group of things was probably the book's biggest set of flaws, and it's why the book didn't get five stars from me.And this may have been because, well, Kaitlin is twelve, but I didn't feel much chemistry between her and Braedon. Their interaction was mostly \"ooh, he has cute hair\" and \"ooh, he's tempting me into doing things I know I shouldn't do over and over and over again even though we don't actually do much that I enjoy when I give in to him\" and \"ooh, he calls me cute nicknames and is a bad boy.\" There were a bunch of bits where Kaitlin has to interact with Braedon and there's some kind of embarrassing accident, some kind of interruption of her life so he can make her pay attention to him for no apparent reason, or some kind of unnecessarily bold action by him that leads to disaster and makes me think Kaitlin really shouldn't care about this person. I just didn't really \"get\" them, though probably braiding in a bunch of tingles and passion and hot-and-bothered-ness would have definitely been too explicit for the age group.Occasionally the narration was a bit blunt when I thought it could have been subtler. When I read children's literature I do usually read stuff that's more YA, less MG, so maybe the straightforwardness and reiteration is more common in that category, but I got a little weary sometimes when Kaitlin expressed at least half a dozen times that her initial outburst that basically wrecked her life \"just happened\"--that she didn't feel in control of her mouth. Same with very explicitly stated observations Kaitlin made about what it meant to switch to another club, which we probably would have felt more sympathetically if she had synthesized and expressed instead of just dropping her thoughts in a lump.And just a couple details that felt weird to me: I thought it was incredibly weird that Braedon interrupted Miyu's party just to \"talk to Kaitlin\" and she went climbing out of windows for him, but then THEY DIDN'T DO ANYTHING, like, why did he go there just to talk to her and then not really even talk? It felt like he was just trying to see what she would do for him, like he was trying to manipulate her and got some kind of thrill out of making her break rules for him. And there was an incident where a $500 fee for a party room made everyone lose their minds--like OMG WHERE ARE WE GOING TO GET THIS MONEY, THIS IS A CRISIS THAT WILL CAUSE US TO GET KICKED OUT OF SKATING but I'm pretty sure almost every pampered ice-skating student there MUST plunk that kind of cash down regularly for their multiple lessons and costumes and travel--I can't imagine that people with skates that cost more than a grand couldn't maybe talk for five minutes and have ten of those party people toss in fifty bucks. (Plus the $500 was supposed to cover not only the room but the use of the electronics and FOOD, and to be honest, that's cheap. I've spent half that to feed a dozen or so friends at a Halloween party, and I didn't have to pay for the use of my living room. Felt like a weird detail is all I'm saying.)And finally I didn't understand Addison's motivation. She was snotty pretty much the whole way through and immediately took a disliking to Kaitlin, going as far as to immediately target her and subtly (and aggressively) bully her. She was ostensibly motivated by the drive to be better than everyone else and didn't want any upstart to outdo her, but she consistently wore her \"antagonist\" face which made her feel like she was saying and doing these prickly things just to cause conflict to push the story's pacing.But now I should say all the things I really liked. Kaitlin was easy to root for . . . the fact that she was finally realizing that what SHE wanted mattered was a tiny bit heartbreaking after spending her life SINCE AGE THREE taking ice-skating lessons, being ordered around by her coach and her mother, not being able to go to regular school because homeschooling could accommodate her skating better, and spending her overscheduled life getting her computer privileges and phone privileges yanked away at the slightest hint of disobedience. But her mother, as a Skate Mom, was actually not completely unbelievable like most caricatures of pushy moms are in books like this. There was some subtlety to her, like how she would rephrase her desires as \"you don't want that to happen, DO YOU?\" to make Kaitlin feel that they were her own desires, and how if Kaitlin was, say, using a computer to look for new coaches, her mom would immediately appear and go OMG WHAT R U DOIN and sit down to take over and do it herself. Kaitlin wasn't being forced to skate--she legitimately loved it--so her mom just being very LOUD about it didn't cross the line into abusive, but she was appropriately grating and I liked how that manifested for Kaitlin's character.I love that there's such natural anticipation whenever Kaitlin has to skate in a competition. You're praying for her not to fall when she does her jumps and you're breathing faster in sympathy when that official wanders over and posts the scores. You can feel her frustration when she doesn't get what she wants and her desperation when she craves mastery, acceptance, attention, and friendship.I liked that Kaitlin was so sparkly. This is literal and figurative; you see quickly that she has a flashy style and likes glitter and sparkles on her accessories and that she has a flamboyant streak in her, which is why it's kind of funny that she insists she's more the balletic type for her program style even though everyone (including the reader) can see that she needs to be feistier. That sparkliness translated to her aesthetic in choosing and making gifts for others, and how doing something nice for other people was just natural for her even though some of the people she gave gifts to were still jerks to her. This was consistent throughout her character without being saccharine, and I loved that.I liked the glimpse into ice-skating culture and rules. Like when we understand that there will be multiple people on the ice even when a skater is practicing their routine, but that it's other people's job to get out of someone's way if it's their program music playing. (And how that sometimes figures in to show personality conflicts.) I was a little thrown by how aggressive the other skaters were in harassing the Fallton skaters (especially when someone CUT A HOLE in a character's skating outfit for no apparent reason), though I would expect some elitism. I was really invested in Kaitlin's personal growth. She's really just not allowed to ever just be a kid and other people control just about every second of her life, and her major skating issue in the book--not being emotionally connected to her technically near-perfect skating--reflects that. I loved that her new coach asked her what moves she wanted to put in her program and that she was so baffled by being asked for her opinion before reveling in it a while, and I was so irritated at her mom for giving her the \"WHAT'S GOTTEN INTO YOU, WHAT'S WRONG WITH YOU KAITLIN\" speech when Kaitlin is caught acting out after having her ENTIRE LIFE UPROOTED. She lost the coach she'd had for eight years. She'd been going to the same skate club since she was three. And suddenly she was being plopped into a new environment with new coaches who had new agendas AND she had lost contact with her so-called friends AND Fallton has a terrible reputation and substandard facilities AND she has to deal with making new friends. And her mom asks her why she isn't herself? My head would be spinning for months. It's like she thinks her daughter is a robot. I'm glad she reacted realistically to all the changes, and I loved that Miyu's easy friendship softened the blow.And finally, I appreciate that the book didn't fall into the inspirational-sports-story trap of connecting everyone's competition results to their character. In stories that do this wrong, bad guys and snotty people ALWAYS lose, people who were mean to the sympathetic main character ALWAYS experience a downfall, and the protagonist is ALWAYS rewarded with triumph at the end. And even though Kaitlin did eventually get what she was aiming for, there were two characters who were terrible to her who also did well in the competition, and Kaitlin had a moment of appreciably complex mixed feelings when she was annoyed at Addison but just couldn't bring herself to wish failure upon her. I like that Kaitlin could be given her own personal triumph without her enemies necessarily having to perish spectacularly on the ice."}, {"userName": "Rae Parker", "userReviewDate": "Feb 01, 2014", "userURL": "http://www.goodreads.com/user/show/19653649-rae-parker", "userReview": "Breaking the Ice takes readers inside the world of competitive ice skating. Kaitlin must start over at \"Fall Down Club\" after a major meltdown at an important competition. This book is full of humor as Kaitlin makes new friends, experiences her first crush, and faces unexpected challenges in this fun novel."}, {"userName": "Kimberly", "userReviewDate": "Apr 05, 2014", "userURL": "http://www.goodreads.com/user/show/2387729-kimberly", "userReview": "Sixth-grade skater Kaitlin Carter breaks a huge unwritten rule when she complains ever-so-loudly-and-rudely to the judges about her scores at a competition. Like a pressure cooker exploding, she can't help the frustration that spews forth when she fails to receive the place she knows she deserves. Her uncontrolled rant results in consequences that bring unexpected change to her life, a life that is focused on making it to Nationals, and eventually, the Olympics. I didn't know much about the world of competitive ice skating, but Gail Nall, herself a former skater, took me fully into Kaitlin's world. Nall also describes in vivid detail a world of mean girls, unreasonable coaches, and pushy moms. My heart broke several times for Kaitlin, who says at one point, \"...a lot of time it feels like no one knows you're alive.\" Kaitlin's story is about competition on the ice, but Nall's insightful book is about any kind of competition and the pressure that talented kids sometimes feel to make it to the top, whether it's cheerleading, dance, soccer, music, or academics. Breaking the Ice is a wonderful book to discuss when considering the balance between the sacrifice necessary to achieve great goals and a middle schooler's desire to be a kid and have a normal life. Fortunately for Kaitlin, she finds that balance in this rewarding MG novel!"}, {"userName": "Liralen", "userReviewDate": "Feb 18, 2016", "userURL": "http://www.goodreads.com/user/show/4089241-liralen", "userReview": "Cute. Deffo more middle-grade than I'm interested in (but I'm fond of gymnastics and skating books, and...they're easier to find at the middle-grade level than at higher levels), but with a nice emphasis on skating (skating! In a skating book! Miraculous!) and positive/platonic friendship. I found the romance quite tiresome (he's a thirteen-year-old rebel, man, who's been kicked out of more schools than he can count), but this is unsurprising considering that I find the romance in most MG/YA books tiresome. Not convinced that the ending was earned—kind of convenient for Kaitlin to only manage to translate emotion into her skating when it really counts—but it works.One thing, though, that seems to have less to do with this book than it does with...oh, expectation, I suppose, and what a 'good' girl does: There's a point when Kaitlin is involved in an accident, and although her role is secondary, she 'fesses up and is determined to take the fall solo. Okay. But later, when the (other) guilty party takes the fall for something Kaitlin was the leader for, she's really bothered by the idea of somebody else getting in trouble for something she did. I would have loved to see this explored further, because it calls to mind the ways in which girls are so often expected to be good, not get in trouble, sacrifice themselves as needed."}, {"userName": "Cindy Rodriguez", "userReviewDate": "Jan 31, 2014", "userURL": "http://www.goodreads.com/user/show/5164443-cindy-rodriguez", "userReview": "Remember Ashley Wagner's and McKayla Maroney's famous faces of athletic disappointment? Well, these moments are nothing compared to Kaitlin's tantrum after a skating competition that ends with medals on the floor and her expulsion from her training center. Kaitlin doesn't quit, though, and as she trains at the Falton Club, what's clear is she also doesn't want to be defined forever by a single moment. What's interesting, and often true, is that the trait that gets her intro trouble--her temper, passion, willingness to speak her mind--is the same trait that helps her later in the story on and off the rink. You don't have to be a skater or even an athlete to enjoy this book because it also weaves in funny, heartwarming threads about friendship, family, and first crushes. Nall totally gets middle school girl; Kaitlin makes mistakes but picks herself up time and again as she tries to find her voice while navigating expectations from those around her. As a middle school teacher, I'm always on the lookout for new titles to add to my classroom library. This is definitely one that my students will enjoy."}, {"userName": "Melanie", "userReviewDate": "Jan 31, 2014", "userURL": "http://www.goodreads.com/user/show/6483009-melanie", "userReview": "Kaitlin has always dreamed of being a champion figure skater, and she’s given up a lot to pursue her passion. But after having a totally uncharacteristic and decidedly NOT figure-skating-approved tantrum after getting her scores at a major competition she’s dropped by her coach and prestigious skating club.When no other club in town will have her, she's forced to join the ridiculed and rundown Fallton Club, jokingly referred to as the Fall Down Club. At first Kaitlin thinks this is a complete disaster, but after meeting some of the other skaters, including a boy (who happens to have the most perfect hair she’s ever seen) Kaitlin thinks it might actually not be so bad.But when she’s tasked with learning a whole new program right before Regionals and figures out that almost all the other skaters target Fallton, she thinks joining the Fall Down Club may just be the second biggest mistake she’s ever made.In this figure skating themed debut, Kaitlin learns that when you fall down, you have to pick yourself up – even if it’s in front of judges and a crowd."}, {"userName": "Kristy", "userReviewDate": "Jun 26, 2014", "userURL": "http://www.goodreads.com/user/show/7259203-kristy", "userReview": "A lot of MG books I read don't have enough stakes but not this book. From getting kicked out of her prestigious skating club, to getting ridiculed for joining the \"Fall Down\" club, to learning a whole new program right before Regionals, Kaitlin's problems just keep piling on and on. And with so much to deal with, you would've expected her to curl into a ball and turn into sobbing mess. But not Kaitlin. Instead, she pushes on through, proving to us, once and for all, that winners never quit and and quitters never win. She teaches us that when you fall down, you have to pick yourself up. LOVED this book and couldn't put it down! If you read it, I promise you won't be disappointed."}, {"userName": "Brandy Painter", "userReviewDate": "Nov 27, 2015", "userURL": "http://www.goodreads.com/user/show/2840210-brandy-painter", "userReview": "This is rather fun. It relies on familiar cliches and tropes, but it is engaging and all of those work together to tell a good story. It is a little too perfect and tidy in the end and there is a little too much technical detail about figure skating in it for those who don't really care about figure skating (me). It is a good one to add to a library or classroom collection that deals with friends, ambition, and working toward hard goals."}, {"userName": "Crystal", "userReviewDate": "Feb 01, 2014", "userURL": "http://www.goodreads.com/user/show/2530215-crystal", "userReview": "My cousin wrote this YA novel!"}, {"userName": "Julie Decker", "userReviewDate": "Jan 14, 2015", "userURL": "http://www.goodreads.com/user/show/24009998-julie-decker", "userReview": "Kaitlin is an up-and-coming preteen ice skater whose hopes and dreams of becoming Olympic-track come crashing down in one catastrophic moment of poorly chosen words. Now that Kaitlin has succumbed to an emotional outburst that led to her coach dropping her and getting kicked out of the skating club, she's forced to join the least prestigious club in the area and worries that she'll be a laughingstock. But the kids at Fallton teach her some important lessons about what friendship is, so she finds connection she wasn't expecting and never knew she needed . . . not to mention how cute that guy Braedon with the swishy hair happens to be, even if he has a bad-boy reputation. Plus her new coach encourages her to put more of herself into her program instead of just following choreographed skating moves, successfully addressing the problems that led to low scores with her last competition. If only Kaitlin could avoid getting harassed by prissy Addison, stop getting in trouble whenever she takes chances, and really learn to connect with her tango music maybe she'll be able to get a gold medal after all.Kaitlin is adorable and her loneliness and ambition are usually really relatable, and it's absolutely effortless to sympathize with her (even at the beginning when she has her life-altering outburst). I liked how readers don't have to have any special ice-skating knowledge to understand her issues even though there is a lot of technical talk--context is provided, in just the right amount--and even though some of the plot elements felt a little bit staged to push the conflicts forward (e.g., as soon as they get on the Zamboni when they're not supposed to, you KNOW it's going to become catastrophic), there are other elements that don't bend to cookie-cutter expectations (e.g., just because another girl in the competition is a huge jerk does not mean she will automatically \"learn her lesson\" by getting a lower score than the main character). I also was a little confused by Braedon's persistence in getting Kaitlin alone during times she was supposed to be elsewhere and then just plain not really doing anything significant with that time--it read almost like he WANTED to get her in trouble. I generally enjoyed the storytelling, too--easy to read, it just flew right by--but I did occasionally stumble over the present tense and the very slight distance from Kaitlin's perspective; sometimes I felt like the story was being told from outside her perspective even though it was supposed to be coming from inside her. Still, I was really rooting for Kaitlin, and loved how the story ended."}, {"userName": "Ms. Yingling", "userReviewDate": "Jul 24, 2014", "userURL": "http://www.goodreads.com/user/show/2636606-ms-yingling", "userReview": "Kaitlyn is dedicated to figure skating and to going to Nationals... until she does poorly at a competition and yells at the judges! Not the sort of behavior expected of skaters, so her club and her coach drop her. Since her mother has quite her job in order to home school Kaitlyn so she can devote time to skating, they find another club and coach, but since it is Fallton (aka \"fall down\"), they are less than thrilled. Once Kaitlyn gets used to the people, she finds that most of them are nice, with the exception of Addison, who is snotty and supercompetitive. Since her old friends don't want anything to do with her, she is glad to be able to hang out with Muri, who loves to skate but also goes to public school, and Braedon, who is cute but a little undisciplined. Kaitlyn would love to go to public school so she could make more friends, but her mother doesn't want her to. After some bad decisions on Kaitlyn's part, she is in trouble with her parents, but she is able to put more emotion into her skating program. What is the best way to balance skating with the general issues of being 12?Strengths: Both of Kaitlyn's parents are pleasant (if a little driven) and supportive. And alive! Her problems are real and very important to middle grade readers-- having friends, figuring out why people are mean, pushing boundaries, getting in trouble, being around cute boys and not knowing what to do. PEOPLE! We don't need horrifically depressing problems. When you're 12, the problems like the ones in this book are more than mortifying!Weaknesses: Little concerned about Braedon being a cute \"bad boy\", but Kaitlyn was leery enough of him that I wasn't as concerned as I would have been had one of my daughters been interested in him. I also was hugely relieved when Kaitlyn is allowed to go to public school: I know that homeschooling works for some people, but as a student and a parent it has NO appeal. It sounds horrific to me on so many levels!"}, {"userName": "Delanie", "userReviewDate": "Feb 18, 2015", "userURL": "http://www.goodreads.com/user/show/33650278-delanie", "userReview": "Summery- There is a girl named Kaitlin and she loves to skate. She always wanted to be in the Olympics. She was in a competing and she got made when she got in 11th place. Then she got kicked off the team and had to go to a guy named Greg. He didn’t know if she would be good. Then she was so good she got to pick her own reteam. Then at the end of the time they had practice they had to do a champion ship and then she WON. After they won Addison wanted to be her friend and became friends.Main characters- Kaitlin, she had red hair and she is really tall. Addison, she has blond hair and tall, Greg has brown hair and medium size.Setting- They are always at the skating place. They always practicing and they always spent 4 hours there a day. They had to be homeschooled. And stay home. They only have about 5 to 6 hours of school. They would have practice in the morning and in the night or after lunch. Conflict- Couldn’t find a good coach and had to do more to find him. She also had a hard time leaving her old coach named Karlee. Karlee was really tough on her. She kicked Kaitlin out of her group because she could mad at a competing. Resolution- She thought he was a good coach and picked him. She found a pretty good coach. She didn’t like him at first but then got used to him. He didn’t know if she was good then got better nice with her. He let her pick her own reteam. She got way better with him. She could understand him.Opinion- I think this is a good book if you like kind of mysteries. This is hard to find a great coach she went through that. So if you like mystery’s you should read this book. And it really isn’t confusing.Recombination- this is a great book. It is all about mystery. Like I said they are easy to understand. They make you feel good when the book is done. It makes you find out what the mystery was."}, {"userName": "Sarah", "userReviewDate": "Feb 01, 2014", "userURL": "http://www.goodreads.com/user/show/682661-sarah", "userReview": "I couldn't put this book down as a thirty-something, so I'm sure I would have been even more enraptured as a middle-schooler. Kaitlin is an ice skater coming of age and finding her own amidst the challenges of figuring out her own responsibilities and commitments, all while learning how to be a better competitor, friend, daughter and skater. She has an inner creativity and confidence that is inspiring. Many of Kaitlin's emotions and struggles brought me right back to my middle school years - her doubts and fears (and excitements and hopes) were incredibly realistic. The plot progresses in a way that the book is hard to put down, and I found that my thoughts drifted to Kaitlin and I hoped for her success even when I wasn't reading the book. I don't know much about figure skating, but the descriptions of her skating and passion for the sport made me long to strap on some skates. I would highly recommend this book to kids aged 9-14 and to anyone who likes an engaging plot with loveable characters. I am so proud to call this book's author my co-worker and friend. Way to go on your first novel, Gail!"}, {"userName": "Jen Brooks", "userReviewDate": "Sep 14, 2014", "userURL": "http://www.goodreads.com/user/show/18517811-jen-brooks", "userReview": "I read an ARC of this book as a member of the Fearless Fifteeners. Kaitlin is a promising figure skater with Olympic dreams threatened by an uncharacteristic outburst at a skating competition. The consequence is she must leave her skating club for Fallton (aka the “Fall Down” club). In her new skating home, she discovers things might not have been better in her old club after all. This charming book follows Kaitlin as she deepens her understanding of what it means to perform on the ice, to have true friends, and to behave like the young woman she wants to be."}, {"userName": "Ann Jacobus", "userReviewDate": "May 30, 2015", "userURL": "http://www.goodreads.com/user/show/3785873-ann-jacobus", "userReview": "Kaitlin suffers an unthinkable humiliation but through hard work, learning from yet more mistakes, and a little help from her friends, family and coaches, she proves what she's made of. A perfect, action-packed read for any middle grade kid (male or female!) who wants to experience the figure skating world in all it's glamour, grueling work, back biting, crushes, failures and triumphs."}, {"userName": "Karen Adams", "userReviewDate": "Jun 12, 2014", "userURL": "http://www.goodreads.com/user/show/31923844-karen-adams", "userReview": "WOW! What an awesome story! I honestly did not want it to end! I could see every young girl loving this book! I am so proud of my niece and can't wait to read more of her work! \"Tango on!\""}, {"userName": "Gemma", "userReviewDate": "Nov 11, 2014", "userURL": "http://www.goodreads.com/user/show/15057930-gemma", "userReview": "I didn't read it yet but I plan on it soon! Thank you so much for the book!!"}, {"userName": "Mia", "userReviewDate": "Jun 21, 2016", "userURL": "http://www.goodreads.com/user/show/40816448-mia", "userReview": "this book is really cute and it teaches people to give other people second chances"}, {"userName": "Sherry", "userReviewDate": "Sep 23, 2016", "userURL": "http://www.goodreads.com/user/show/37096094-sherry", "userReview": "This is a fun read for kids. Set at the ice rink for the most part, the action is centered around all of the things kids of that age struggle with: family, friends, competition, flirtations. I recommend this book!"}, {"userName": "Gabs {My Full Bookshelf Reviews}", "userReviewDate": "Aug 01, 2014", "userURL": "http://www.goodreads.com/user/show/13635411-gabs-my-full-bookshelf-reviews", "userReview": "I received a free copy of this book in exchange for an honest review.I love books about figure skating. It's odd, considering I don't do it, and probably never will, but for some reason these books just attract me over and over again. Chances are if I read a book about figure skating, I'll love it. And that's what happened with Breaking the Ice. I was immediately sucked in to Kaitlin's story. She's a likeable character, and realistic too. One big mistake she makes nearly ruins her, and she has to go do a club that is notorious for being the worst. Her experiences there are fun to read about, and the skaters there were really cool. I loved Miyu, she was the kind of friend that Kaitlin needed. She may have not been the most naturally gifted at skating, but I liked that she still worked hard to improve. I was rooting for Kaitlin the whole book to overcome the odds and get to nationals. It was relatable; even though I'm not a figure skater, I think that most girls, no matter what the age, can relate to overcoming obstacles and working hard to acheive their dreams.I did get mad when it came to Braedon. I just could not believe that Kaitlin liked him; he was obviously a horrible influence, and I can't stand characters that are total slackers. I liked that he became more bearable towards the end, though. I liked the ending of the story. In fact, I kind of wish it had gone on a bit longer so I could see how the rest of Kaitlin's journey played out. (Sequel, please?) It made me happy and basically all that I wanted to happen happened. This book was inspiring, believable, and most importantly, entertaining. I was sad to see it end. I could totally see this having a sequel, and in fact, I'm kind of crossing my fingers that it does! Definitely recommended."}, {"userName": "Corabel Shofner", "userReviewDate": "May 07, 2015", "userURL": "http://www.goodreads.com/user/show/15935269-corabel-shofner", "userReview": "Gail Nall Skates on Smooth IceOkay, admit it. When the winter olympics come on television we all race to the ice skating competition. The lovely skaters become national heros and the disappointments and even heartless scandals, such as Tonya Harding break our hearts. Skating is grace and strength on ice. We love it. BREAKING THE ICE takes us behind the scenes, to the lives of young people dreaming of becoming the next olympic gold medalist and Gail Nall has personal experience. She grew up skating and working at the local rink. Her details build an entirely believable world. And in this world skates twelve year old Kaitlin who, along with her mother, has given up so much to pursue her dream. Home schooling, hard work, discipline. She is the skater to beat’ at the prestigious Ridgeline Figure Skating Club. Her friends and top coach, HIldy, at Ridgeline are her world.\tAnd this is the perfect world that is shattered the day that Kaitlin loses control after getting poor grades. In an uncharacteristic explosion, Kaitlin makes a spectacle of herself berating skaters and judges and finally snagging a skate on the table cloth, she sends all the trophies flying. With every breath she knows that she must stop herself, but she can’t do it. She is sorry immediately, but there are no do overs. Kaitlin and her mother think an apology will get her back on the ice but Hildy drops Kaitlin and the skater is banned from Ridgeline. Even worse, no other coach or rink will have her. The only rink that will have her is Fallton, which is ridiculed by elite skaters as Fall Down.\tFall Down where everybody has a story where everybody is ‘just a little bit . . . weird” is where Kaitlin learns the greatest lessons in skating and life. This is a story about authentic performance and authentic friends.CorabelShofner.com"}, {"userName": "Katie Fitzgerald", "userReviewDate": "Oct 24, 2014", "userURL": "http://www.goodreads.com/user/show/2281988-katie-fitzgerald", "userReview": "Kaitlin longs to perfect her figure skating program and win a spot at Nationals. Unfortunately, she loses her temper at a competition and insults the judges, after which she is dropped by both her coach and her skating club. Now the only club that will take her on is Fallton, nicknamed Fall Down, which is home to a group of misfit skaters, known for blowing it at competitions. At Fallton, Mia's new coach encourages her to connect emotionally with a brand-new tango-inspired skating routine, while cute boy Braedon gets her into trouble and level-headed Miyu provides friendship and support. This book is different from a lot of other middle grade novels from Aladdin because the main character has an actual life-changing problem. Other books focus on friendship and boy troubles - and there is some of that here - but this story focuses mainly on how young girls can bounce back from mistakes through hard work and determination. Debut author Gail Nall does a wonderful job of helping the reader to feel the tremendous pressure Kaitlin is under. She resolves Kaitlin's problems realistically as well, without ever providing an easy way out. It's a little disappointing that this book portrays homeschooling in such a negative light, giving into stereotypes that homeschooled kids are lonely, but this is the only true flaw in an otherwise enjoyable read. Breaking the Ice is a relatable story that will engage many middle school girls who, like Kaitlin, are struggling to be themselves, do their best, and express their needs. Other figure skating stories for this age group include Sugar and Ice by Kate Messner, the Mia books from American Girl, and Gold Medal Winner by Donna Freitas."}, {"userName": "MIriam Spitzer Frankllin", "userReviewDate": "Mar 27, 2015", "userURL": "http://www.goodreads.com/user/show/41624754-miriam-spitzer-frankllin", "userReview": "I loved this book! Since I figure skated during my teen years, I'm always curious to see how accurate author's portrayals are, and this was the most authentic skating book I've read. The characters, places, and events all seemed very real to me and the descriptions of the rinks, right down to the ice bumps from condensation on the ceiling, reminded me of places where I've trained and competed. But you don't have to know a double axel from a triple salchow to find yourself invested in Kaitlin's story. From the very beginning, when Kaitlin does something unheard of in the ice skating community- openly complains about her scores--you know she's a character with a lot of spunk that will keep surprising you throughout the book.Then she accidentally pulls down the award table and finds herself banned from her rink, and before you know it you'll be cheering for her as she faces one challenge after another, showing perseverance and spirit and a good heart through it all. You'll also meet a great cast of characters from her crush (he can do double axels in his sleep-I've met kids like this), the coach who inspires her to find her inner tango, and the Mean Girl whose horrible skating mother helps you understand why she acts the way she does. This book kept me laughing and cheering right on to the end."}, {"userName": "Susan  Dunn", "userReviewDate": "Apr 10, 2015", "userURL": "http://www.goodreads.com/user/show/659923-susan-dunn", "userReview": "Competitive skater Kaitlin is homeschooled because she spends hours every day at the ice rink training for competitions. Her dream is to make it to the Olympics some day. But then she blows up at the judges after a competition, believing that her scores should have been higher. This kind of behavior just isn't tolerated, and as a result Kaitlin's coach releases her and she is kicked off her team. After approaching every other team in the area, the the only one that will take her is Fallton Club - the worst club in town. Everyone calls them the \"Fall Down\" club behind their backs and make fun of them at competitions. But Kaitlin is surprised to find that they're not so bad after all. She likes her new coach and makes some friends on the team. Her new coach suggests choosing new music and coming up with a new routine, but Kaitlin struggles with the artistic elements. As Regionals draw closer, will she be able to master the new routine and put up with the teasing now that she's one of the Fall Down skaters? For fans of sports novels and/or some minor romance, this book takes first place with readers in grades 4-6.Terrible, cartoonish cover though. Such a bummer, b/c the book is way better than the cover."}, {"userName": "K.L. Hallam", "userReviewDate": "Feb 02, 2014", "userURL": "http://www.goodreads.com/user/show/4834095-k-l-hallam", "userReview": "This book was so much fun! --and the suspense and the humour are layered throughout, it's just so naturally funny. The story begins with 12-year-old Kaitlin, future Olympic, or at least Nationals, Figure Skating champion--hopeful, saying things she wished she hadn't, to the judges of a skate competition! You cringe-- you wince, and you laugh! Who hasn't wanted to take something back they wished they hadn't said? Well, Kaitlin works very hard at changing her fate. And when she's kicked out of the only skate club she's ever known, and joins the \"Falldown\" skate club, not only does she work to change her fate, and learn how to incorporate more \"expressive\" routine, she works on changing everyone's perception of what kindness, respect, and sportsmanship look like, especially for the Fallton Skate club, who have been the butt of everyone's meanness for too long. Her new friend Miyu is so spot on, she reminded me of a dear friend, and Braedon, has some surprises. Great book for lovers of skating, competition, and fun, heartwarming stories. With a kick!"}, {"userName": "Lisa", "userReviewDate": "Apr 02, 2016", "userURL": "http://www.goodreads.com/user/show/2254832-lisa", "userReview": "12-year-old Kaitlin figure skates for the competitive Ridgeline club, but when a low score leads to Kaitlin yelling at the judges and subsequently pulling down the medals table, Kaitlin is kick off the team. As word spreads about her outburst, none of the other clubs in the area want her, so she joins the Fallton Club, the only rink and coach that will accept her. Can Kaitlin put together a different routine and get it ready in time for regionals? This book covers so many teen issues: making friends, dealing with mean people, finding your own voice, dating, doing the right thing (doing the wrong thing), working hard for something you really want. This well written clean read is a perfect middle school girl choice; authentic issues the girls can relate to, with practical solutions and outcomes. Cross posted to http://kissthebook.blogspot.com CHECK IT OUT!"}], "description": "Kaitlin has always dreamed of being a champion figure skater, and she’s given up a lot to pursue her passion. But after having a totally uncharacteristic and decidedly NOT figure-skating-approved tantrum after getting her scores at a major competition she’s dropped by her coach and prestigious skating club.When no other club in town will have her, she's forced to join the ridiculed and rundown Fallton Club, jokingly referred to as the Fall Down Club. At first Kaitlin thinks this is a complete disaster, but after meeting some of the other skaters, including a boy (who happens to have the most perfect hair she’s ever seen) Kaitlin thinks it might actually not be so bad.But when she’s tasked with learning a whole new program right before Regionals and figures out that almost all the other skaters target Fallton, she thinks joining the Fall Down Club may just be the second biggest mistake she’s ever made.In this figure skating themed debut, Kaitlin learns that when you fall down, you have to pick yourself up – even if it’s in front of judges and a crowd", "title": "Breaking the Ice", "url": "http://www.goodreads.com/book/show/20662374-breaking-the-ice", "average": 4.29, "cover": "https://images.gr-assets.com/books/1403101491l/20662374.jpg", "reviews": 60, "authors": [{"url": "https://www.goodreads.com/author/show/7801825.Gail_Nall", "name": "Gail Nall"}], "type": ["Childrens", "Childrens", "Sports and Games", "Contemporary", "Realistic Fiction"], "outlinks": ["http://www.goodreads.com/book/show/20662374-breaking-the-ice", "http://www.goodreads.com/book/show/24348648-exit-stage-left", "http://www.goodreads.com/book/show/25855604-out-of-tune", "http://www.goodreads.com/book/show/28899855-best-night-ever", "http://www.goodreads.com/book/show/21862595-you-re-invited-too", "http://www.goodreads.com/book/show/23255017-you-re-invited"]}