{"ratings": 87326, "userreviews": [{"userName": "Jennie", "userReviewDate": "Jan 20, 2013", "userURL": "http://www.goodreads.com/user/show/874959-jennie", "userReview": "Weight: 867 lbs (due to entire Chipotle burrito still sitting in belly), cigarettes 0 (as don’t smoke), alcohol units 1 (responsible glass of red wine, for heart), calories 1557 (if Chipotle nutrition calculator can be trusted)Have just finished reading Bridget Jones’s Diary: The Edge of Reason, aka BJD 2: THE DARCY STRIKES BACK. Still working out feelings re: sequel, as original was pure perfection, part of identity, Pride & Prejudice-related (so obviously superior to almost all other works of fiction), etc. Am having trouble reckoning feelings for this novel, as trainwreck of a movie is hanging over head in manner of pinata filled with poo or old, stinky cheeses.Shall not dwell on turd of a movie, however, flawed as it is, because love the lovely book! Like Bridget Jones’s Diary, sequel is based on Jane Austen novel, this time Persuasion. Had not read Persuasion until several years ago and ended up liking just as much (if not more? blasphemy!) as P&P. Naturally, Persuasion suffers from clear lack of Darcy, however Wentworth equally swoon-worthy, also Anne Elliot is obvious patron saint of Singletons everywhere, having been declared old spinster at virginal age of 27.Our little Bridget is still struggling with job, money, romance, family (overbearing mother, drunken father), blah dee blah LIFE in usual ridiculous and fun manner. All old friends are back, including urban family (Jude, Shazzer, Tom), Marrieds (Smug and Otherwise), insane boss Richard Finch, delightful mess Daniel Cleaver, and of course Mark Darcy, with whom Bridget is now deeply in love. New characters join Bridget’s world in form of odious Rebecca, a jellyfish (aka frenemy) on the prowl for Bridget’s boyfriend, and friend Magda’s adorable moppets, created to make Bridget look alternately crazy and competent.Do wish that book had not included any romantic turmoil for Bridget and Mark Darcy, however realize that there would have been conspicuous lack of plot otherwise. Could not even bring self to get worked up over ridiculousness of certain plotlines (Thai prison, hole in side of flat, stinky fish left in purse for weeks, what-have-you) because of love for all things Bridget and Darcy, also because of equally important happy ending (spoilers)! Suppose am typical girl that way, heart going all aflutter at any mention of Jones-Darcy reconciliation, evidence of Darcy-still-in-love, etc.Recommend this book for all who enjoyed Bridget Jones’s Diary, or like well-done chick lit (still hate that hateful phrase, should stop using immediately) in general. Especially worth reading for special treat in sequel (as all sequels must one-up original) in form of Colin Firth (aka THE Mr. Darcy) being interviewed by Bridget Jones, which unfolds exactly as one would expect.In short, sequel is v.g."}, {"userName": "Suzanne", "userReviewDate": "Nov 03, 2007", "userURL": "http://www.goodreads.com/user/show/513331-suzanne", "userReview": "The Colin Firth interview is hilarious! You just want to scream at Bridget to shut up and stop putting her foot in every time she opens her mouth! Just as wonderful as the first book!"}, {"userName": "Lisa", "userReviewDate": "Jun 28, 2008", "userURL": "http://www.goodreads.com/user/show/851951-lisa", "userReview": "This book should be retitled as Bridget Jones: The Unnecessary Sequel. Bridget returns as the hapless and can't-get-it-together heroine with plenty of love, work and weight troubles. The first book has a happy ending and I thought that was the end of it. Since it's so successful, of course the author cannot resist conjuring contrived plot lines for Bridget's second adventure. Bridget came across as charming and endearing in the first book but here she becomes annoying and irritating. I (or the readers) love her int he first book because Bridget is not flawless. This makes her a very accessible character. However, the contrived plot lines of this book has managed to create a gratingly stupid Bridget which I cannot empathise with anymore.This is what happens when authors go on beyond the 'happily ever after' last line."}, {"userName": "AMEERA ", "userReviewDate": "Sep 27, 2016", "userURL": "http://www.goodreads.com/user/show/32325414-ameera", "userReview": "I hate say this but I hate this book , can be much better if Helen fielding just wrote bridge Jones's diary and stop"}, {"userName": "Alaina Meserole", "userReviewDate": "Mar 18, 2018", "userURL": "http://www.goodreads.com/user/show/50620706-alaina-meserole", "userReview": "I don't really know why I still had this book on my TBR because I didn't really like the first book.. but oh well, I dove right into this one anyways.Okay, so in Bridget Jones: Edge of Reason Bridget starts to suspect that her boyfriend Mark is starting to develop feelings for one of his coworkers, Rebecca. Of course this was a huge misunderstanding on her part because he doesn’t have any feelings for her at all. However, it is Bridget and it wouldn’t be a book if she found out that she was wrong right away. Nope. In the end, she felt foolish for even thinking that and all is right in the world because Rebecca started dating someone else. Right? Wrong. I hated this book so much. LE SIGH!Like I said, I didn't like the first book.. so I definitely didn't like this book either. It wasn't funny at all to me. It's like I was fake laughing just to get out of this book faster. I just don't like Bridget at all. She was so annoying and frustrating throughout the whole book. I didn't care what she went through or said throughout the entire thing. I just wanted this book to be over as soon as I started it. Spoiler alert: wine helped me get through this book. A lot of wine.Overall, I hated this book. I will never ever reread this series. I will not continue this series - no matter what which makes me sad because I hate starting a series and not finishing it but I seriously can't stand Bridget as an MC. I'm done with this."}, {"userName": "Chevalier", "userReviewDate": "Jan 15, 2014", "userURL": "http://www.goodreads.com/user/show/8229778-chevalier", "userReview": "Sunday 26 January6 pm. My Bed. Writing critic on Goodreads Hurrah! Just finished quite good book. Will call friends and discuss about it. Now everyone can see how smart I am! Will write fantastic critic, one that will make everyone follow me, adore me, etc. Will be invited to review more books and will write for famous newspaper (Guardian or Times). Yes, will write not only funny review but insightful.Should have a little wine for to start creativity flowing. 6.01 Will go to shop and buy Silk Cut. In manner of every famous writer, must smoke and drink while writing.6.20 pm Should possible organize room first. Surely Woolf was v. organized and clean.6.25 pm Found lost pair of jeans under bed!7.00 pm Right, will start review now.7.02 pm Surely the internet will help.8.00 pm V. Tired and frustrated. Everyone seems to think it's a waste of time. Will prove them all wrong, as the \"Road Less Traveled\" says.9.05 pm Will start now. Oops Telephone. Must be friend!9.35 pm Going to 192. Surely pre-drinks and friends will help self. Will get new ideas discussing the book.9.36 pm Do not find a single pair of socks. Must buy more.3.00 am Greatz Night mith pals. Yad mure drinkz. Hair iz zpinning. Here's pen?"}, {"userName": "Chelsea (chelseadolling reads)", "userReviewDate": "Oct 03, 2016", "userURL": "http://www.goodreads.com/user/show/16219087-chelsea-chelseadolling-reads", "userReview": "What a fucking terrible book. My god."}, {"userName": "Jessica", "userReviewDate": "Aug 17, 2007", "userURL": "http://www.goodreads.com/user/show/186838-jessica", "userReview": "Not quite as good as the original, nonetheless, spending more time with Bridget and her friends as they count alcohol units and worry about what underpants to wear on a date is a pleasant diversion."}, {"userName": "Elizabeth", "userReviewDate": "Feb 10, 2018", "userURL": "http://www.goodreads.com/user/show/1762033-elizabeth", "userReview": "I desperately love Bridget, I really do, but the story just wasn't as funny the second time around. I never thought I would tire of British humour, but - while The Edge of Reason is still VERY FUNNY - the plot line relies a lot on miscommunication stemming from the characters bumbling about and being unable to speak candidly about a situation or say what they really mean. Gets a bit old.I don't think I'll carry on with the series. The original Bridget Jones Diary is absolute comedic and chick-lit gold and I'd recommend just sticking with that one."}, {"userName": "Manybooks", "userReviewDate": "Dec 30, 2009", "userURL": "http://www.goodreads.com/user/show/2970379-manybooks", "userReview": "Although Bridget Jones is still a fun and delightfully unpredictable character in this second instalment of Helen Fielding's series, there is simply too much presented, featured exaggeration and resulting disbelief for me to be able to totally and utterly (without reservations) enjoy The Edge of Reason. For while with the first book, with Bridget Jones's Diary, although Bridget often was indeed outrageous and even at times (and perhaps even rather regularly) inappropriate, she was still and usually engaged in antics that could easily and even normally happen (events, personal behaviours to which I could at least mildly and personally relate), whereas, at least for me, the majority of the scenarios presented, featured in The Edge of Reason, but especially the entire Thailand episode, simply feel a bit too strange, too over-the-top, interesting enough perhaps, but also somewhat alienating. And thus, while definitely still for the most part an enjoyable and entertainingly light romp, with The Edge of Reason, I sometimes and perhaps even more than sometimes do tend to feel more like a dispassionate and even analysing (coldly critical) observer and monitor of Bridget, while with the first book, with Bridget Jones's Diary, I very much and often felt like I was Bridget (or at least that I could be Bridget), actually experiencing her frustrations, her dietary faux pax, her searches for the perfect man (and I just cannot seem dispense with my personal sense of disbelief with much of the action featured and presented in The Edge of Reason, simply because much of it is so far beyond my own personal experiences that it feels strange, even at times rather majorly disconcerting and disconnecting). But all that being said and my issues with reality and exaggeration notwithstanding, The Edge of Reason does remain for me a generally enjoyable read and as such one which I do still heartily recommend for fans of Bridget Jones' Diary (but with the caveat that it is certainly nowhere near as good and as entertaining as the first book, and the additional personal warning to absolutely NOT bother with the second movie instalment, as it veers so far beyond the plot of the novel to be simply massively annoying and majorly frustrating)."}, {"userName": "Kimberly Carrington-Fox", "userReviewDate": "Oct 30, 2015", "userURL": "http://www.goodreads.com/user/show/33752173-kimberly-carrington-fox", "userReview": "La Fielding se saca de la manga una trama liosa y con muchos altibajos, perdiendo mucha de la gracia y frescura del pirmer libro. Mark Darcy y la madre de Bridget son lo mejor (por favor, la madre es ahostiablemente graciosa). A Bridget a veces la matabas, a veces le dabas un achuchón. Al menos te entretiene y, si lo comparas con la peli, es una maravilla (la peli es es-pan-to-sa -> salvo Colin Firth #AyOmá)"}, {"userName": "Amanda NEVER MANDY", "userReviewDate": "Oct 11, 2016", "userURL": "http://www.goodreads.com/user/show/36873041-amanda-never-mandy", "userReview": "This shall be short and sweet since it just continues on from the first. One of the issues I mentioned previously (love triangle) evaporated. The other issue (far-fetched plot) is still present so I knocked a star off for it. I have the next one in the series waiting on my nightstand so I am hoping this last little issue disappears.STILL LOVE ME SOME MARK DARCY!"}, {"userName": "Marina", "userReviewDate": "Oct 31, 2015", "userURL": "http://www.goodreads.com/user/show/32285434-marina", "userReview": "This story turned into love novel, but it's still great chick lit, great comedy and great story. Bridget is struggling with her relationship with Mark, had serious problems and struggling with her job. The end was satisfying and I was laughing out load during the feast."}, {"userName": "Joy", "userReviewDate": "Dec 07, 2008", "userURL": "http://www.goodreads.com/user/show/1694004-joy", "userReview": "This was not as good as the first one..."}, {"userName": "Stephanie", "userReviewDate": "Feb 19, 2009", "userURL": "http://www.goodreads.com/user/show/1132033-stephanie", "userReview": "After finishing Bridget Jones's Diary for the second time, I turned my attention to Bridge Jones: The Edge of Reason, by Helen Fielding, which I'd never read before. I have to say that with both books, there were definitely laugh-out-loud moments, although there were more with Edge of Reason than Diary.I'm embarrassed to admit it took me at least to the middle of the book to realize that this book was a take-off of Persuasion. And once again, I admire Ms. Fielding's facility in translating a classic to the modern age. Before I picked up this book, I wondered, idly, \"Pride and Prejudice ended with a marriage. What on earth is Helen Fielding going to do in her sequal?\" I assumed it would be one more of those books written by Jane Austen devotees who cannot stand not knowing what happens next, where Elizabeth and Darcy, happily married, turn detective, or where Elizabeth, happily married, works on getting Georgiana married off. Turning to Persuasion for inspiration was felicitous.In Persuasion, Anne Elliott and Captain Wentworth loved each other in their youth (fully ten years ago), but were driven apart by the machinations and bad advice of Anne's family. At the end of the book, happily, they have reconciled and their love is as strong as ever. In Edge of Reason, Bridget and Mark have been together for a full four weeks before they are driven apart by a series of misunderstandings, the machinations of vicious Rebecca (an exceedingly well-drawn character), and the bad advice (at least, in Mark's opinion) that Bridget has gleaned from the self-help books that comprise her library. Well done, Ms. Fielding -- I think that's a wonderful way to begin a sequal and also an inspired retelling of a classic.This book was great fun and brought me great joy reading it. I think Ms. Fielding's satirical pen has sharpened somewhat."}, {"userName": "Devon Hernandez", "userReviewDate": "Jun 19, 2010", "userURL": "http://www.goodreads.com/user/show/3719788-devon-hernandez", "userReview": "Fits of uncontrollable laughter. That would describe me reading this book. What a great followup to the first one! For those of you who have only seen the movie and not read the book, warning: the movie script cuts quite a bit out, and changes quite a bit. For instance, the whole lesbian thing in the movie? Never happened. The \"other woman\" who Bridget thought was after Mark really was after Mark in the book. Daniel Cleaver barely makes an appearance, just a brief few times, literally only 3 brief occasions. He was never in Thailand with Bridget and Shaz, as he was in the movie. Therefore, the fight scene with Mark and Daniel never happens...however, he does (Mark) punch him (Daniel) in a later scene, but nothing like the fight in the movie. Also, Mark doesn't go to Thailand to rescue Bridget - he did his work at home and in Dubai to catch Jed. The one thing that amuses me vastly about what they cut out was the fact that Bridget interviews Colin Firth for a freelance newspaper article!!! HA! For obvious reasons, that would have been impossible to have in the movie script, as Colin Firth ended up playing Mark Darcy in the movies. They really, really did leave out A LOT, and this is definitely one of many occasions where the book so surpasses the attempt at the movie. That being said, I love the movie and it's hilarious. It just doesn't match up with the book, and that always pisses me off. It's really too bad that Helen Fielding never came out with a trilogy for this. I would have loved to have had a third book detailing Mark and Bridget getting engaged and married and some crazy stuff happening amidst all of that (the book ends with no engagement). Love, love, love this book!"}, {"userName": "Charlotte May", "userReviewDate": "Mar 24, 2017", "userURL": "http://www.goodreads.com/user/show/14002983-charlotte-may", "userReview": "3.5 stars! I think I am either becoming more accustomed to the writing style or this one was just so much better than the first!I was actually interested in the characters and there was a definite storyline in this one, with more action and events to keep me hooked. What with Bridget's drug scandal in Thailand, the ongoing on-off relationship with Mark Darcy and the brief appearances of Daniel (though I can't help but imagine them as Colin Firth and Hugh Grant in my head)Still not a massive lover, think chick lit just isn't for me, but it is good honest fun and Bridget is the most relatable character ever!"}, {"userName": "Poonam", "userReviewDate": "Jul 06, 2016", "userURL": "http://www.goodreads.com/user/show/17656456-poonam", "userReview": "Fun read."}, {"userName": "María Pecero", "userReviewDate": "Nov 09, 2017", "userURL": "http://www.goodreads.com/user/show/71653367-mar-a-pecero", "userReview": "*Atención SPOILER si no te has leído el primer libro*Bridget Jones: Sobreviviré, es la segunda parte de la trilogía de Bridget Jones escrita por Helen Fielding. Todo parece irle bien a la protagonista. Está con el hombre al que ama, Mark Darcy, y su vida parece ir sobre ruedas. Sumergida en manuales de auto-ayuda, iremos descubriendo junto a ella su vida y sus andanzas. Para los fans de la película, lo cierto es que el libro no tiene absolutamente nada que ver con esta. En la cinta, se presenta un argumento mucho más dulce y edulcorado, mientras que en el libro, la historia es algo bastante más oscura. Aunque hay partes del diálogo que sí son exactamente las mismas. (Creo que es la primera vez que diré esto pero… Me gustó más la película).Si bien es un libro que me ha recordado muchísimo a la primera parte, en esta segunda entrega el personaje de Bridget resulta quizás más ridículo que en el primer libro. Tiene ciertos puntos en los que sentí verdadera vergüenza ajena. En cierto modo es bueno porque hace que te des cuenta de que realmente has empatizado con el personaje, pero creo que a veces la autora peca de ser muy malvada con su creación. El argumento del libro es más de lo mismo: Bridget intentando hacer cosas y fracasando en ellas. Al principio del libro vemos a una Bridget enamorada que poco a poco va entrando en una espiral de celos que hace temblar los tabiques de su relación. Sin embargo, creo que no aporta nada nuevo, ya que la protagonista siempre se encuentra ante los mismos problemas. Digamos que tropieza varias veces en la misma piedra.En lo que respecta al estilo de la autora, se mantiene la estructura del primer libro, esto es, está escrita en formato diario. He de puntualizar que he leído la versión traducida, por lo que es posible que se haya perdido originalidad en la traducción. Partiendo de esto, el lenguaje me ha resultado muy llano y simple. Esto por un lado, permite al lector seguir fácilmente el hilo argumental, pero por otro da la sensación de dejadez a la hora de escribir. Por último, decir que es un libro que ha perdido frescura con respecto al anterior y que peca de tener una trama muy repetitiva. A pesar de ello, lo recomiendo para aquellos que son fans de la primera película y también del primer libro, puesto que es imprescindible para seguir conociendo a Bridget Jones y para descubrir si finalmente es capaz de ser feliz, o si por el contrario, habrá que esperar al tercer libro."}, {"userName": "Miglė Keliotytė", "userReviewDate": "Aug 20, 2015", "userURL": "http://www.goodreads.com/user/show/32658387-migl-keliotyt", "userReview": "What a wonderful book. Found myself again laughing from Bridget so hard I couldn't breathe. This book really lightened up my days when I needed. So sad I finished it so fast."}, {"userName": "Jennifer", "userReviewDate": "Nov 21, 2008", "userURL": "http://www.goodreads.com/user/show/1578083-jennifer", "userReview": "Not as good as the first but still worthy of attention."}, {"userName": "Evelina", "userReviewDate": "Jan 28, 2017", "userURL": "http://www.goodreads.com/user/show/21638596-evelina", "userReview": "Rolig och underhållande och väldigt härligt att få återse Bridget Jones! Länk till recensionen: https://ewelinasbokblogg.blogspot.se/..."}, {"userName": "Kathrin", "userReviewDate": "Feb 20, 2018", "userURL": "http://www.goodreads.com/user/show/7359792-kathrin", "userReview": "This is certainly an entertaining read that comes with a few cringe-worthy downsides. I got the book from my local library which is why I probably don't mind some of its flaws and will continue to read the series. I love the fact that Colin Firth stars in the movies while Bridget swoons over him in the books. The character of Bridget seems to be the strength as well as the weakness of the novel. While I like her attitude sometimes and she is an easy-to-relate-to character (hello procrastination), other times she's plain annoying. It's also a bit scary to see how much some aspects of the genre changed since the turn of the millennium while other themes sadly stayed the same. I like to believe that the series wouldn't be that popular if it had been published recently. Nevertheless, looking forward to the next book. Never giving up the hope that it'll surprise me."}, {"userName": "Di'ana", "userReviewDate": "May 07, 2018", "userURL": "http://www.goodreads.com/user/show/15327189-di-ana", "userReview": "Bridžita, Bridžita... Nuotaikingas, kartais veikiantis depresuojančiai o kartais neįtikėtinas jos gyvenimas. Pripažinkime, juk kiekviena savyje turime savo Bridžę, kuri prisižada visko, prisigalvoja, netaip interpretuoja, laikosi dietų bei jaudinasi dėl svorio, būnam feministės, bet norime ir tobulų vyrų. Koncentruotas gyvenimo marazmas ir laiminga pabaiga :D"}, {"userName": "Ciarán West", "userReviewDate": "Aug 07, 2012", "userURL": "http://www.goodreads.com/user/show/9012856-ciar-n-west", "userReview": "Helen Fielding is basically the world's greatest feminist. In her first Bridget Jones book, she taught us that no woman is complete unless she has the love of a foppish, sub-Hugh Grant, barely heterosexual posh man to complete her. To add to the confusion, Bridget is in love with the actor Colin Firth, who they end up casting in the film as her actual love interest, Mark Darcy. If that wasn't confusing enough, they throw in Hugh actual Grant as the Bad Boy Whom All Women Are Attracted To In Spite Of Themselves. And he doesn't really play a Hugh Grant type either. Well, he does, but it's more like the Hugh Grant in About A Boy. Or the Hugh Grant in real life, who fucks crack whores in the mouth.This is a review of the book though, which is not a film. It's not the first book either, it's the sequel to the first book. And it's not the film which is a sequel to the first film. In this book, Bridget gets her dream job, interviewing Colin Firth for some magazine or TV show or whatever. This is very confusing if you've seen the first film, obviously. This is the book though, so we'll carry on.Does anything of note happen in this book? LOADS of stuff, but none that I can actually remember. There's a scene at the start of it which is funny because foreign people are hilarious, and gay people are icky. I think that's the point the author was trying to make, anyway. The key themes of the book are that women are useless without men, other women stab you in the back at every opportunity, and that no one thin or good looking can be a good person.Fielding's novels are loosely based on a couple of Jane Austen books, although they're not that much like them; well, except for the fact that their attitudes to women, men and relationships are two hundred years out of date.Can't wait for the third one!"}, {"userName": "Erica", "userReviewDate": "Jan 28, 2014", "userURL": "http://www.goodreads.com/user/show/2644090-erica", "userReview": "As I've mentioned, I'm relistening to the Bridget Jones books because the new one is out and I'll be reading/listening to it soon; I feel I need to brush up on what happened ten billion years ago.So.Bridget.I never liked this story as well as the first one, though time has mellowed my viewpoint a bit. I remember thinking that there is no way that much could happen to one person in the course of one year and not have more of an effect. I mean, hello! She got her boyfriend, she met Colin Firth, she hung out with her mother's African...um...what was he? Guest. We'll call him a guest. Because \"pet\" is demeaning. She got arrested coming home from Thailand, she got to experience The Fantasy that all people go through when someone breaks up with them (the whole crawling back/turns out he was pathetic thing) and she's still a flake after ALL THAT?But looking back, I have had lots of adventures, some scary moments, plus big events and small and if I were really honest with myself? I can't say I've grown much, either. I might be a little wiser but I think that comes more from winding down toward a sedentary lifestyle and less from learning things, meaning I'm too lazy to fight or care anymore and don't do as many crazy things as a result. So maybe her year wouldn't have changed me, either, despite what I'd self-righteously believed the first time I read this story.Still. I liked the first book better."}, {"userName": "Tatiana", "userReviewDate": "Apr 20, 2015", "userURL": "http://www.goodreads.com/user/show/22783852-tatiana", "userReview": "Вторая книга мне понравилась меньше первой. В целом мне понравилось, были действительно смешные, нелепые моменты.Меня совершенно не раздражали мысли о похудание, или такие та внутренние надуманные самокопания героини, это даже показалось мне забавным.Но вот я абсолютно полностью разочарована в Бриджит Джонс как личности - она глупа, эгоистична, автор очень многое удачно подстраивает под нее, что для меня не работало. Допустим момент с ее работой - на протяжение всей книги она несет бред, а в конце оказывается креативным кадром.Единственное интервью она не просто запорола, она опозорилась. Этот фрагмент мне было даже больно читать. Совершенно не смешно.Не ждала я , конечно, что Бриджит будет разбирать ядерные реакторы, скорее я ждала от нее некой женской смекалки, находчивости, что-то такое простое, женское, что есть в каждой из нас. К сожалению у Бриджит напрочь отсутствую даже банальные женские качества. Так я и не поняла, что за ее полюбил Дарси..."}, {"userName": "K.", "userReviewDate": "Jun 27, 2011", "userURL": "http://www.goodreads.com/user/show/5663034-k", "userReview": "[Bridget and Mark meet in the hallway at night, and he freaks out and they finally talk about their feelings (hide spoiler)]"}, {"userName": "Anne", "userReviewDate": "Oct 19, 2010", "userURL": "http://www.goodreads.com/user/show/1720620-anne", "userReview": "I enjoyed Edge of Reason a bit more than the original. I think it had a little more depth (and I use that term veeery loosely) than the first Bridget Jones book. She grows a tiny bit as a character, and finally seems to come to terms with what it means to be an adult in love. Again, she grows a tiny bit...we're not talking about any huge spiritual epiphany here. This is, after all, Bridget Jones we're talking about. As a big fan of the BBC version of Pride and Prejudice, I also found myself smiling quite a bit at the references to the movie...and the whole connection to Colin Firth in general. *sigh* I'm a little Bridget-ish about him, too."}, {"userName": "Ana Rînceanu", "userReviewDate": "Apr 11, 2014", "userURL": "http://www.goodreads.com/user/show/28781546-ana-r-nceanu", "userReview": "Disaster. This is what happens when you don't think on your own and just regurgitate a self-help book's or your biased friend's advise. Still, we've all been there in some form or other. Bridget's exploits are a frivolous, adorkable joy to read about while holding in giggles. Career wise, I can't say we see eye to eye to her, but I'd like to go out for her with a drink and discuss the Velveteen Rabbit."}], "description": "Lurching from the cappuccino bars of Notting Hill to the blissed-out shores of Thailand, Bridget Jones searches for The Truth in spite of pathetically unevolved men, insane dating theories, and Smug Married advice (\"'I'm just calling to say in the potty! In the potty! Well, do it in Daddy's hand, then!'\"). She experiences a zeitgeist-esque Spiritual Epiphany somewhere between the pages of \"How to Find the Love You Want Without Seeking It\" (\"can self-help books really self help?\"), protective custody, and a lightly chilled Chardonnay.", "title": "Bridget Jones: The Edge of Reason\n      \n          (Bridget Jones #2)", "url": "http://www.goodreads.com/book/show/363752.Bridget_Jones", "average": 3.55, "cover": "https://images.gr-assets.com/books/1395233618l/363752.jpg", "reviews": 2333, "authors": [{"url": "https://www.goodreads.com/author/show/3090.Helen_Fielding", "name": "Helen Fielding"}], "type": ["Womens Fiction", "Fiction", "Romance", "Humor", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/363752.Bridget_Jones", "http://www.goodreads.com/book/show/856712.Bridget_Jones", "http://www.goodreads.com/book/show/25985575-bridget-jones", "http://www.goodreads.com/book/show/578597.Bridget_Jones", "http://www.goodreads.com/book/show/9858287-bridget-jones", "http://www.goodreads.com/book/show/17338563-brid-ita-d-ouns-ties-proto-riba", "http://www.goodreads.com/book/show/25867619-p-spaning-med-bridget-jones", "http://www.goodreads.com/book/show/4494.Bridget_Jones", "http://www.goodreads.com/book/show/100972.Bridget_Jones", "http://www.goodreads.com/book/show/227443.Bridget_Jones_s_Diary", "http://www.goodreads.com/book/show/17262155-mad-about-the-boy", "http://www.goodreads.com/book/show/4530.Olivia_Joules_and_the_Overactive_Imagination", "http://www.goodreads.com/book/show/884776.Bridget_Jones_s_Diary_and_Bridget_Jones", "http://www.goodreads.com/book/show/31540109-bridget-jones-s-baby", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}