{"ratings": 54988, "userreviews": [{"userName": "David", "userReviewDate": "May 18, 2012", "userURL": "http://www.goodreads.com/user/show/166376-david", "userReview": "The normally flinty James Wood recently wrote what can only be characterized as an extended mash note to Hilary Mantel in the New Yorker, based on this book and its predecessor, Wolf Hall. I can only concur, and add a few observations of my own.How good is this book? It's so good that(i) I am trying to ration myself to only 50 pages a day, to spin out the experience of reading it just that little bit longer(ii) I am failing miserably in objective (i) above, because I am an undisciplined wretch, completely lacking in self-control, and I just can't help myself(iii) I call people up on the other side of the Atlantic, just to read them choice sentences(iv) I feel impelled to share a few of those sentences with youThomas Cromwell is attempting to sway the deposed queen Katherine of Aragon and says something to incite her displeasure:\"There is a pause, while she turns the great pages of her volume of rage, and puts her finger on just the right word\"of one of Anne Boleyn's ladies-in-waiting:\"If someone said to Lady Rochford, 'It's raining,' she would turn it into a conspiracy; as she passed the news on, she would make it sound somehow indecent, unlikely, but sadly true.\"I'm not sure if James Wood actually went as far as to say that he would be happy to read Hilary Mantel's grocery list. But, based on the quality of the writing in the \"Wolf Hall\" books, I would.You wouldn't think it possible to tell the story of the Tudors and make it fresh. But Mantel succeeds once again, brilliantly.Added on edit after finishing:The last 50 pages of this are frightening, and frighteningly good. James Wood offers far more insight into what he calls Mantel's \"novelistic intelligence\", also on the topic of \"authenticity\" (where he makes a compelling case that fiction can offer a kind of authenticity that actually surpasses historical accuracy) than I ever could (though I found myself agreeing with everything he wrote, and the examples he cites are the same ones I would cite), so here is a link to his review -- I think it is accessible even in you don't have a New Yorker subscription. Wood on Mantel And finally, a note from Hilary Mantel, promising future delights.\".... Thomas Cromwell, who is still in need of attention from biographers. Meanwhile, Mr Secretary remains sleek, plump and densely inaccessible, like a choice plum in a Christmas pie; but I hope to continue my efforts to dig him out\".Bonne continuation, Mme Mantel, bonne continuation !!"}, {"userName": "Bookdragon Sean ", "userReviewDate": "Jun 19, 2017", "userURL": "http://www.goodreads.com/user/show/27788046-bookdragon-sean", "userReview": "Mantel is such an excellent writer; her prose is eloquent and artistic, beautiful even.. Few writers have such skill. She uses every grammatical tool at her disposal to give her novel a strong individual sense of stylistic flair. And that’s just the surface level of her sentences; she also uses metaphor and constant allusions to take it to another level entirely. For example, my favourite passage in the book: “He looks around at his guests. All are prepared. A Latin grace; English would be his choice, but he will suit his company. Who cross themselves ostentatiously, in papist style. Who look at him, expectant. He shouts for the waiters. The doors burst open. Sweating men heave the platters to the table. It seems the meat is fresh, in fact not slaughtered yet. It is just a minor breach of etiquette. The company must sit and salivate. The Boleyns are laid at his hand to be carved.”This is so much stronger that its predecessor  Wolf Hall.  There is a stronger narrative drive and Cromwell has more momentum and enthusiasm for achieving his ambitions. He is also getting used to his power and his influence, testing them to see how far they can reach. A risky game, but we all know what came of it in the end. He is a very intelligent man, able to root out evidence for the king when there is none to be found. The Boleyn family, though politically smart, were vastly out matched by the cunning of Cromwell. When the king wanted them out, Cromwell didn’t have to work too hard to achieve it. Mantel has improved on her style so much here.  Wolf Hall was exceptionally good, but it did have many flaws. It was a hard book to read. My main problem with it was trying to discern who the “he” in question within the writing. For example Cromwell was referred to “he” whist talking to another “he” about a pair of “he’s” they were feared were scheming against them. Uncomfortable stuff, though she seems to have listened to the criticism her first book received and the result is a much stronger piece of writing.  So what’s it all about?Boredom. Boredom and anger. Henry VIII’s new wife Ann Boleyn has failed to give him a son, such a terrible thing. The entire situation is ridiculously ironic considering the one child she did give him, the future Elizabeth I, would become a much better monarch than he could ever be. The fat fool didn’t need a son! But his silly little masculine ego demanded one. Sure you could talk about the politics involved in having a male offspring, but, again, just look at what Elizabeth did by herself. She had no direct heir. When she died she gave the throne to the King of Scotland. Enough said. Cromwell has a large task on his hands, but he was more than capable of carving up the Boleyns. The only real complication was he had to do it within the limitations of the law. The king can’t be above his own mandates, and he has to be able to justify his brutal actions even if the entire world new he was full of rubbish and would bend the system to his own ends and act all innocent about it. Then blame his councillors’ years later for his own decisions. Cromwell, naturally, goes to work. But his day of reckoning draws very near. I can’t wait to read the final book in this series. It’s obvious how it will all end: the chopping block. It will be interesting to see how Mantel handles the fall of Cromwell. I also wonder if she will win the man booker prize again. I think she’s great, but I don’t think she deserves it again. The prize is for innovating, high quality writing. But her writing is no longer innovative. It’s a regurgitation of what she has already done (not a bad thing) but I don’t think she should win the prize multiple times for doing the same things. Still, I'm excited for the third book."}, {"userName": "Fionnuala", "userReviewDate": "Sep 08, 2012", "userURL": "http://www.goodreads.com/user/show/5498525-fionnuala", "userReview": "Most people in the English speaking world know the history of Henry VIII from their earliest school days or from the many books, films and TV series that the episode has inspired. Some of us cringe when we hear of yet another fictional version, yet another glittery effort to sensationalise the intrigue of the Tudor court and create even more farfetched scenarios around the details of the wooing and discarding of Henry’s wives. How then can Hilary Mantel’s series be of any interest? I would argue that her treatment of history does not belong in the historical fiction genre but rather in the field of historical analysis. Already, with her account of the French Revolution, A Place of Greater Safety (2006), she proved that she had found a new and unique way to analyse historical events. She combs all the available documentary evidence and from this wealth of detail she builds a living picture of the time and its chief players so that we feel, smell, touch, even inhabit their world. But she creates dialogue, you will point out, and imagines the players’ thoughts. This is true, but any historian who reads all the documents, all of the letters relating to historical personages can’t avoid interpreting their motivations. Mantel takes that interpretation a step further through dialogue, thereby making the reading of this familiar history, which otherwise holds little surprise or suspense, much more rewarding and entertaining. She succeeds because of her fine writing skills and her ability to choose the most suitable angle from which to view the events, in this case, Thomas Cromwell, the kings secretary; it is as if the reader is perched on his shoulder, seeing everything he sees and privy to about half of his thoughts. And we suspect that the other half of his thoughts are so secret that even he, Thomas Cromwell has little access to them. Mantel reveals him as neither hero nor villain, but simply a man who is good at his job. Being Henry’s secretary is like playing chess; the task is to destroy the opponent and the notion of the opposition of good and evil has no place on this board. Survival is the only rule. Let me give an example: on the first page of Bring Up the Bodies, Cromwell watches a hunting scene involving a pair of hawks: “Weightless, they glide on the upper currents of air. They pity no one. They answer to no one. Their lives are simple. When they look down they see nothing but their prey, and the borrowed plumes of the hunters: they see a flittering, flinching universe, a universe filled with their dinner. All summer has been like this, a riot of dismemberment, fur and feather flying...\"When we reach the last page of the book, we remember the pair of hawks and we are amazed. Thomas Cromwell has learned from those hawks. He too is silent when he takes his prey."}, {"userName": "Teresa", "userReviewDate": "Jun 02, 2012", "userURL": "http://www.goodreads.com/user/show/541416-teresa", "userReview": "I came to this sequel thinking it could not possibly stand up to the first installment. So, I was prepared to like this book, but not love it as much as I did Wolf Hall. But I was wrong: it does, and I did. It's one of those works that I lingered over the last pages of, not wanting it to end: the prose is that good. And it installed itself into my psyche. After putting it down at night and as I fell asleep, words, phrases, sentences rolled through my head. (This has happened to me before, but this time it felt different.) And though when I awoke, I couldn't remember any of what I'd dreamed (if dreaming is what it was), I knew the procession of words was due to this book. I also figured this is how the brain of Mantel's Cromwell must work, never stopping, except he does remember all. And when you see the culmination of his remembering all, it is chilling.Much of what I wrote in my review of Wolf Hall may be inserted here. Like the title of Wolf Hall, this title has a different meaning than you might think (unless you are exceptionally in-the-know). And as I also said about Wolf Hall, this is not your average, run-of-the-mill historical fiction: it is elevated. As I neared the end, I was starting to become resigned to the fact that I wouldn't be as excited by any particular passage as I had been with the one I quoted in my review of Wolf Hall (and that perhaps I was spoiled by what was so fresh in \"Wolf Hall\") but then I arrived at the final page ..."}, {"userName": "Annet", "userReviewDate": "Oct 17, 2012", "userURL": "http://www.goodreads.com/user/show/1166369-annet", "userReview": "There are no endings. If you think so you are deceived as to their nature. They are all beginnings. Here is one....The books of Hilary Mantel on Thomas Cromwell are superb, grande. We all know the history of Henry VIII but Wolfhall and Bring Up the Bodies are refreshing, sharp, intelligent, emotional...so much more than 'just' historic tales. I give a slight preference to Wolf Hall, because that book was groundbreaking, a new take on this famous piece of history, seen through the eyes of Thomas Cromwell. However, again Bring up the bodies is sublime and of course tells the dark tale of the fall of Anne Boleyn, fascinating. And Mantel is a great storyteller...Something happens to Anne then, which later he will not quite understand. She seems to dissolve and slip from their grasp, from Kingston's hands and his, she seems to liquefy and elude them, and when she resolves herself once more into woman's form she is on hands and knees on the cobbles, her head thrown back, wailing. Fitzwilliam, the Lord Chancellor, even her uncle, steps back; Kingston frowns, his deputy shakes his head, Richard Riche looks stricken. He, Cromwell, takes hold of her - since no one else will do it - and sets her back on her feet. She weighs nothing, and as he lifts her, her wail breaks off, as if her breath had been stopped. Silent, she steadies herself against his shoulder, leans into him: intent, complicit, read for the next thing they will do together, which is kill her.About Cromwell.... what a fascinating character, re. my review of Wolf Hall, on the one hand a warm family man, on the other hand iron-hard when it comes to dealing with all the so-called 'accomplices' in the Anne Boleyn case and ruthlessly sending a whole group of people to their death by axe... Revenge... or self preservation? or both.... One thing is for sure: Cromwell is always planning ahead. A true chess player. And so far, he does that pretty well. Also very interesting in this book, the developing relation/friendship with Chapuys, ambassador of emperor Charles V. 'All the players are gone', Wriothesley says. 'All four who carried the cardinal to Hell. And also the poor foul Mark who made a ballad of their exploits.' 'All four, he says. 'All five.' 'A gentleman asked me, if this is what Cromwell does to the cardinal's lesser enemies, what will he do by and by to the King himself?I am now watching the dvd of the BBC series that I was very careful not to touch while I was still reading the book... Very good as well. The part on Thomas More stands out in the series so far... for me. Highly recommended. I do hope Ms. Mantel continues the Cromwell / Henry VIII story until the very end.... Can't wait for the third book. <"}, {"userName": "Cheryl", "userReviewDate": "May 08, 2012", "userURL": "http://www.goodreads.com/user/show/2375838-cheryl", "userReview": "Aaaahhh. Fine, fine, fine. The final last paragraph -- perfect.Cromwell now to me will always be \"he, Cromwell\". This little stylistic flourish did add clarity, compared with Wolf Hall. To purposefully use just \"he\" in the first book was at times confusing, forcing one to stop and step out of the story to regain one's bearings. Sort of like breaking the fourth wall -- and perhaps that was the point then, a metafictional technique? but it was too intrusive. This book just sailed on from Wolf Hall. Immersion was swift and total.Another Booker winner, I hope."}, {"userName": "Diane", "userReviewDate": "May 04, 2012", "userURL": "http://www.goodreads.com/user/show/279256-diane", "userReview": "I loved this second book about Thomas Cromwell and King Henry VIII even more than the first one!I started reading Bring Up the Bodies as soon as I finished Wolf Hall, and I've enjoyed this series so much I'm excited for Mantel's third volume, whenever it's published. While Wolf Hall focused on the rise of Anne Boleyn and how she became Queen of England, Bring Up the Bodies is about how the King decides to leave Anne when she can't give him a son, and her subsequent downfall and execution. The story of her trial and beheading has been told many times, but I loved how Mantel chose to show us the scenes from Cromwell's perspective, and how he helped manipulate the proceedings. Cromwell even maneuvered to help the King find his next wife, Jane Seymour.This second book had good pacing and flowed more freely than the first one, perhaps because the first one had numerous flashbacks to Cromwell's childhood and the back-and-forth with Cardinal Wolsey. Taken together, they are a masterpiece of historical fiction, and I highly recommend this series. Favorite Quotes\"You can be merry with the king, you can share a joke with him. But as Thomas More used to say, it's like sporting with a tamed lion. You tousle its mane and pull its ears, but all the time you're thinking, those claws, those claws, those claws.\"\"What is the nature of the border between truth and lies? It is permeable and blurred because it is planted thick with rumour, confabulation, misunderstandings and twisted tales. Truth can break the gates down, truth can howl in the street; unless truth is pleasing, personable and easy to like, she is condemned to stay whimpering at the back door.\"\"He needs guilty men. So he has found men who are guilty. Though perhaps not guilty as charged.\" \"Sometimes peace looks like war, you cannot tell them apart.\"\"Erasmus says that you should praise a ruler even for qualities he does not have. For the flattery gives him to think. And the qualities he presently lacks, he might go to work on them.\" \"How many men can say, as I must, 'I am a man whose only friend is the King of England'? I have everything, you would think. And yet take Henry away, and I have nothing.\" \"We are not priests. We don’t want their sort of confession. We are lawyers. We want the truth little by little and only those parts of it we can use.\"\"You have always regarded women as disposable, my lord, and you cannot complain if in the end they think the same of you.\" \"Who can understand the lives of women?\""}, {"userName": "Will Byrnes", "userReviewDate": "May 03, 2015", "userURL": "http://www.goodreads.com/user/show/1526851-will-byrnes", "userReview": "His whole career has been an education in hypocrisy. Eyes that once skewered him now kindle with simulated regard. Hands that would like to knock his hat off now reach out to take his hand, sometimes in a crushing grip. He has spun his enemies to face him, to join him: as in a dance. He means to spin them away again, so they look down the long cold vista of their years: so they feel the wind, the wind of exposed places, that cuts to the bone: so they bed down in ruins, and wake up cold.\nBe careful what you wish for. Henry VIII was pining for the younger-than-his-current-wife Anne Boleyn. After getting his heart’s desire, which required him to take on the Catholic Church, one might imagine him speaking to Thomas Cromwell as Ollie might have said to Laurel, “Well, here’s another nice mess you’ve gotten me into!” nicely demonstrating an inability to accept any responsibility for his own actions. Of course, AB had gotten her heart’s desire as well, a nifty crown, plenty of staff, and she gets to headline at the palace. But pride, and not popping out a male heir, goeth before the fall, and well, the girl should have known. I mean H8 was not exactly a model hubby to his first wife. Why would she think he’d be any more loyal to her? Time for the head of household to summon Mister Fixit. Rafe Sadler and Stephen GardinerLooking for advice on ridding yourself of unwanted household pests? Running low on funds for your comfortable lifestyle? Need the occasional hard thump to the torso to get the old ticker restarted? Need to re-direct your reproductive efforts towards a more masculine outcome? Need to fend off potential assaults by enemies foreign and domestic? Why, call Mister Fixit (Yes, yes, I know there were no phones in 16th Century England, so summon Mr. Fixit. OK? Happy now? Jeez, some people). Thomas Cromwell, a man of modest origins who had risen to the highest position in the land, that did not absolutely require aristocratic genes, had already demonstrated a penchant for getting things done, by whatever means necessary. And so continues the tale, in book 2 of Hilary Mantel’s trilogy about Tudor England.Hilary MantelThe end of Wolf Hall (You read Wolf Hall, right? If you haven’t, stop reading this now, and go get a copy. Read that and when you are done, feel free to return. What are you waiting for? Go! Scat!) was H8’s marriage to AB. The quest had come to the desired conclusion, and now they’re gonna party like it’s 1533. Not only had H8 succeeded in flipping the bird (a falcon in this case – see the badges below) to the RC, but he was engaged in swiping their stuff as well. Pope? We doan need no steenking Pope. Cromwell was the guy who had done most of the fixing. So everything should be fine now, right? Not so fast.Dueling Badges – Anne Boleyn’s and Catherine of Aragon’s - in case any are neededAB is getting very full of herself but not, unfortunately full of a male heir, and there are younger ladies-in-waiting, you know, waiting. H8 has an eye problem. It wanders uncontrollably, in this instance to young, demure Jane Seymour. Of course there is the pesky business of clearing that obstruction from the royal path, and Mister Fixit is called in (sorry, summoned) to make it go away. Luckily for him he has his fingers in many administrative pies and is not shy about using his inside knowledge to achieve his boss’s goals. Cromwell also has an excellent network of spies sprinkled throughout the realm. Combine the two, make much of what was probably idle gossip, add a dollop or three of spite and voila. For good measure, TC takes particular pleasure in focusing his skills on those who had done dirt to his mentor, Cardinal Wolsey, ticking off each one as they succumb to his devilry. The once and future – Catherine of Aragon and Jane SeymourWas AB guilty of the crimes of which she was accused? Probably not. But as long as the folks in charge can get the people with weapons to do their bidding it does not much matter. There is no law, really, only power. Legal processes are often mere window dressing to the underlying exercise of big fish eating smaller fish, and sometimes spitting them out. The fiction of legality keeps the mass of smaller fish from chomping their much larger tormenters to bits. Sort of like now. See, people? It’s all perfectly legal.Bring Up the Bodies is a masterful achievement, showing, step-by-step, how dark aims are orchestrated and achieved. In laying this out, Hilary Mantel also offers us a look at how the reins of power can be abused by the unscrupulous, and Thomas Cromwell is shown in his full unscrupulousness in this volume. He was gonna get these guys and when he saw his chance, he took it. Where Wolf Hall presented a more removed Cromwell, Bring Up the Bodies shows us Cromwell as more than a fixer, more than a technocrat. We get to see him as a monster, despite his supposed desire to make England more equitable for working people. H8 is shown much more as a spoiled psycho-child in this volume. Whatever his intelligence, whatever his accomplishments, what we see of Henry here is primarily his boorishness, his childishness. I want what I want and I do not care who gets hurt, or even killed, so I can have it. I was reminded of the great Twilight Zone episode  It’s a Good Life.Mantel won a second Booker prize for this one, and it was well deserved. Not only do we get a very human look at a key period in Western history, but are blessed with Mantel’s amazing wit as manifested by her characters, and consideration of issues that transcend history, as well as a compelling episode of Survival: Tudor. It is an easier read than the first book, more engaging, if that is possible. If you have not seen the miniseries made from the combined volumes you really must. Hilary Mantel has brought out her best in Bring Up the Bodies, using her genius for historical fiction to make the old seem new again. You won’t lose your head if you don’t read this book, but you probably should.Review posted – 5/22/15Publication date – 5/8/2012=============================EXTRA STUFFMy review of Wolf HallLinks to the author’s personal, Twitter, Google + and FB pagesExcellent radio interview with Mantel by Leonard LopateA marvelous New Yorker magazine article looking at  Mantel’s careerGreat material here in another New Yorker article, Invitation to a Beheading, by James Wood Why isn't Henry VIII fat and other Wolf Hall mysteries explained"}, {"userName": "K.D. Absolutely", "userReviewDate": "Nov 20, 2012", "userURL": "http://www.goodreads.com/user/show/2156200-k-d-absolutely", "userReview": "I rarely give 5 stars but I can't help it with this 2012 Booker winner. I am still to read the last year's other Booker finalists but this book is one of the best among my recent reads. Hence, I think the Booker jurors made the right pick last year. Also, those friends of mine who already read this book and gave a 4 or 5 stars also made the right verdict: this book is exceptionally great!Prior to this book's prequel, Wolf Hall (4 stars), I knew nothing about Henry VIII. I am a Filipino who had my early school years in an island in the Pacific. Our teachers did not bother telling us the stories about British royalties. So, when I read Hilary Mantel's \"Wolf Hall\" two months ago, at first I struggled understanding that book's historical backdrop and I found myself Googling so many names and places. However, in the end, it was worth the effort. So, now I had an easier time reading Bring Up the Bodies. In fact, I resumed reading this two days ago and since we had a 4-day weekend (last day is today) due to the holidays, I had a busy New Year that I used mainly for finishing this book.The book is the continuation of Henry VIII's life story in the eyes of his chief minister Thomas Cromwell. If \"Wolf Hall\" is about dumping of Lady Catherine and Henry VIII's marriage to Anne Boleyn, \"Bring Up the Bodies\" is about the dumping of Anne Boleyn as the king has now a new apple of his eyes, the beautiful Jane Seymour. That seems like a simple retelling of a story contained in any history books about Tudors, right? Answer: yes. However, Hilary Mantel is a genius in storytelling. She researched thoroughly the many writings about the Tudors and life in England during that time. She meticulously injected what could have been the appropriate dialogues in the many delicate scenes. More importantly, her prose is extremely delightful to read. Reading the book is like ascending to heaven, it is like being blown away by sweeping wind while angels are sounding their trumpets and plucking the strings of their harps. I have never seen this kind of beautiful prose in any recent read or not even in any of the past Booker winning books. Hilary Mantel is one hell of a genius writer. What I particularly enjoyed was how Mantel made her characters interesting by baring to us both their internal struggles as well as their external issues. She seems do this by first second-guessing how her characters would react to a given situation. Then she followed this with the character giving us his/her stream-of-consciousness narration to reveal his/her inner thoughts. Mantel finished this off by allowing her characters in that situation their acute observations and incisive remarks. This cycle seems to have worked wonderfully by making each of her major characters like we are watching them in a 3D or IMAX theater. This style also made this historical fiction come alive by making the reader an active participant in the story. There were times when I'd like the character to tell the truth or to lie but the character did the opposite and so I was disappointed but later I saw the point for his/her decision.This book is just wonderful. My first book finished this year. What a way to start 2013! What a book!"}, {"userName": "Tim", "userReviewDate": "Mar 08, 2016", "userURL": "http://www.goodreads.com/user/show/45632570-tim", "userReview": "Of course if you loved Wolf Hall you’re going to love this too. It’s slightly different in tone and texture to Wolf Hall though. Less richly dense and intimate; quicker paced, covering as it does a much smaller time frame than Wolf Hall. I read somewhere Mantel heeded criticism of her excessive and confusing use of the pronoun he in Wolf Hall. And it’s true she is much clearer here, always referring to Cromwell by name whenever there might be confusion. What this does is remove some of the sympathetic intimacy we feel for Cromwell. In fact, you realise what a stroke of genius it was in Wolf Hall. For the first time there are moments when we see him as something of a calculating despot, we begin to have an inkling of why he was hated so much. We see the Michael Corleone in him. It’s fascinating that all the men eventually accused of sleeping with Ann are men against whom he has a long standing personal grudge. Men who were involved in Wolsey’s fall from grace. Cromwell becomes like Wolsey’s avenging angel, as if it’s been Wolsey all along he’s been working for and not the King. Reading between the lines you feel Mantel thinks these men were guilty but not guilty as charged. In other words, they all probably mocked the king while flirting with Ann but probably didn’t sleep with her. I’ve watched a few programmes asking the question whether or not Ann was guilty as charged. Those who are convinced she was innocent usually refer to her last will and testament in which she denied all charges. They say she would not lie, knowing she was about to die and about to meet her maker, that she would not risk an eternity in Hell by making a false statement. However Mantel states in the afterword that Ann’s testament didn’t survive and what we have is a fiction composed years later. Posing the likelihood that biographers, no less than novelists, take huge liberties with the truth.  I can’t wait for the third and final instalment of Cromwell’s story."}, {"userName": "Heidi The Hippie Reader", "userReviewDate": "Jun 02, 2018", "userURL": "http://www.goodreads.com/user/show/7986781-heidi-the-hippie-reader", "userReview": "Hilary Mantel's brilliant trilogy about Thomas Cromwell continues with Bring Up the Bodies.Cromwell is the right-hand man of Henry the VIII. His masterful manipulation of people and circumstances to make the world as Henry wants it has brought Cromwell wealth and power.Getting Anne Boleyn on the throne was a struggle. Now he has to get her off of it without losing his own head in the process.Mantel doesn't just tell history, she makes it come alive.In one scene I can't get out of my head: Henry has a temper tantrum because of the Spanish ambassador's continued disrespect towards his new wife, Anne, and the repeated requests from the Spanish crown for money owed. The king blows his top at Cromwell and screams in his face.He says he believes Cromwell has always manipulated him and laughed at him. But he is king and he will not be steered.And, even though I knew the history, I thought for a moment Cromwell was going to be taken to the Tower in that instant.Instead, he quietly apologizes to the king and dismisses himself, then goes to a different room to take a drink. With shaking hands, Cromwell spills a drop of the wine on himself and sits there, contemplating the small stain on his shirt.And I said to myself, \"Mantel is a genius.\"In that passage, it was as if I was in that room, living the moment. She makes you forget you're reading a book. It's so immersive. It's almost magical.Cromwell's efforts to collect evidence against Queen Anne fills much of this book. As he tightens his net around her, you can almost feel it tighten around yourself.Cromwell jokes with his sworn men to ease some of the tension, but it is always there, buzzing beneath the surface.Highly recommended for historical fiction readers. Bring Up the Bodies is one of the best books I've read this year."}, {"userName": "Darwin8u", "userReviewDate": "Nov 20, 2012", "userURL": "http://www.goodreads.com/user/show/2294090-darwin8u", "userReview": "“The things you think are the disasters in your life are not the disasters really. Almost anything can be turned around: out of every ditch, a path, if you can only see it.” ― Hilary Mantel, Bring Up the Bodies100 pages in and it is hard to miss that this isn't just a nominal sequel to Wolf Hall, but rather the first book's logical annex. There is no drop-off in complexity. No laxity of language. Again, Mantel manages to shift form, change structure and reinvent her style. She even manages to give the character of Thomas Cromwell more depth and complexity, a feat which seemed near impossible after finishing Wolf Hall. Anyway, Mantel is one of the finest writers of English prose living. Each sentence is crafted like a unique piece in an Italian inlaid music box. She has a purpose for each comma, and makes words seem to dance, fall and recover right off the page. She pulls the history out of the history and has written Tower interrogations so deft and chilling one is left afraid of both language and the law. As readers we watch Cromwell destroy men, overthrow queens and change history with words, paper and a sharp understanding of men's motives. We aren't afraid because Cromwell is a monster, but because he is so heroically human."}, {"userName": "Michael", "userReviewDate": "Apr 20, 2017", "userURL": "http://www.goodreads.com/user/show/65909643-michael", "userReview": "I began this with tremendous trepidation. I loved Wolf Hall and kept wondering if this could possibly hold up, thinking of all those times when a sequel didn't. For those of you wondering that too, let me assure you: this is a great novel in its own right, and a more-than-worthy sequel. Mantel is again at the top of her game, writing with the same incisiveness and the same narrative drive that made Wolf Hall so fantastic. You know from the opening pages that you're in the perfect hands to tell this story. Count me in to the Hilary Mantel fan club."}, {"userName": "Iset", "userReviewDate": "Jan 22, 2012", "userURL": "http://www.goodreads.com/user/show/4973578-iset", "userReview": "I jumped straight into Bring Up the Bodies after finishing Wolf Hall, such was my eagerness to dive back into Hilary Mantel’s Tudor England and, of course, sit on the shoulder of the inscrutable, enigmatic Thomas Cromwell as he led us through it. I’m afraid this review is much shorter than my review of Wolf Hall, because many of the points still apply from one to the other.Mantel still prefers to overuse her third person pronouns rather than use her main character’s name, which in the previous book could get considerably confusing, however, towards the end of Wolf Hall she begins using “he, Cromwell…” a lot more, and it’s that form that she utilises in Bring Up the Bodies. It admittedly clears up a lot of potential confusion, but I stick by what I said in my review of Wolf Hall, that it renders the “he” altogether redundant and it’s a clumsy solution compared to the simplicity and clarity of just using a character’s name where appropriate!Mantel’s strength is still her expansive knowledge of the English language, her storycraft in creating a compelling plot, and her attention to detail which bring the book alive. This attention to detail creates subtle characterisations, full of their own peculiar eccentricities and unique personalities. Mantel has show, don’t tell down to a fine art, letting her characters’ personalities grow and build up organically through their actions and speech – and, of course, Thomas Cromwell’s sardonic observations about them. My one disappointment with the characterisations has been that I think they could be even stronger, and that I feel Mantel adheres to stock stereotypes of the Boleyn family a little too much. Mantel had previously tempered her characterisations of the Boleyns by giving them a good dose of ambiguity, but now, in order to gear up for the big showdown, certain negative traits are exacerbated to adhere more closely to stereotype – such as Jane Parker’s unfeeling cruelty, and Anne Boleyn’s self-absorbed haughtiness. Mantel also omits the dispute between Anne and Cromwell over what should be done with the proceeds of the dissolution of the monasteries.Other than that, I felt that Mantel created the downfall tremendously well, getting into the nooks and crannies of just how it unfolded, dispelling certain myths about what happened, and, most importantly, leaving the truth ambiguous for the reader. Cromwell masterfully constructs his case against the Boleyns through hearsay and implication, and through his machinations weaves enough doubt to make it plausible that some of the other characters believe the truth of it. However, he never has any direct proof, and, tellingly, Cromwell himself studiously avoids answering a question put to him by his son about whether the people he arrests actually did what they are accused of. A whole dark undercurrent permeates proceedings, in which one feels that the truth is being meticulously suppressed, the accused damned if they speak out by Cromwell’s sharp wit turning against them anything that they might say. Though I would have wished for the Boleyn clan to have been characterised with more subtlety and humanity, Mantel treats their downfall with dignity, not only creating this masterful ambiguity, but striking the right balance of factors of those responsible between Cromwell, the king, and the conservative faction at court, and demonstrating the consequences through Cromwell himself. Two scenes were particularly striking – Cromwell’s conversation with Thomas Wyatt about justice in the realm, and Cromwell’s realisation of some change that has happened to him after all this. I thought this was a seminal moment, and moving – the spider caught in his own web; having constructed this mirage of half-truths and circumstantial interpretations, Cromwell can no longer cut to the truth like he used to, and finds his certainty obscured by the miasma he himself has created in the new climate in England.Bring Up the Bodies is transporting, seamlessly segueing between the tarnished glitter of the treacherous court and the busy-bee day-to-day life of London, creating characters who inhabit these worlds who break out of the two-dimensional confines of the page and appear three-dimensional in the mind’s eye. Lacking in one or two minor points, particularly the technical construction and the portrayal of the Boleyns, but otherwise written with skill, richly detailed, subtle characterisations, and a compelling plot that drove me onwards towards the dreadful conclusion.8 out of 10"}, {"userName": "Andrei Bădică", "userReviewDate": "Apr 10, 2018", "userURL": "http://www.goodreads.com/user/show/57321276-andrei-b-dic", "userReview": "\"Când se gândește la cum era el pe atunci, n-are nevoie să fie indulgent, dar nici vinovat nu se simte. Dintotdeauna a făcut tot ce-a fost în stare pentru a supraviețui, iar dacă a apreciat uneori de ce anume era nevoie pentru asta... ei bine, asta înseamnă să fii tânăr.\"\"Catastrofele din viața ta nu sunt de fapt catastrofe. Poți să profiți de aproape orice: de faptul că ai căzut într-un șanț, de orice potecă, doar s-o poți vedea.\""}, {"userName": "Heather", "userReviewDate": "Jul 12, 2012", "userURL": "http://www.goodreads.com/user/show/954812-heather", "userReview": "I feel stingy giving this only 3 stars, because it is a really excellent book in its own right. But it fell short of the wondrous originality and complexity of Wolf Hall... I missed the mythic-mystic dimension and the sense of a society on the cusp between \"medieval\" and \"Renaissance\". Thomas Cromwell doesn't have the same rich character arc that he had in Wolf Hall: he's on top and he stays on top. And King Henry doesn't struggle against the same array of opponents in this book, he just decides to do what most everybody has been wanting him to do all along.Above all I think I was frustrated that Mantel was so scrupulous about the historical record. She never takes a stand on any of the charges against Anne: did Anne ever love Henry? was she capable of love, or only ambition? did she sleep with other men? or was it just spiteful gossip exaggerating her narcissistic need for male attention? what happened between Anne and her brother? between her and Percy? between her and Mark Smeaton? Because the whole story is told from Cromwell's point of view, we can't know what Anne did, and to Cromwell it doesn't matter - it only matters what he can convict her of. So there's a coldness to it. I like that this isn't a sentimental \"Anne of the 1000 Days\" version, but it overcompensates and keeps Anne at too much of a distance.Honestly I wanted some more critical perspective on Anne's misery... even though she was a narcissistic bitch and a schemer, she was also a tragic vic tim of (dare I say) patriarchy... all her beauty and cunning and intelligence and ambition weren't worth a hill of beans when her body failed to produce a son. That she thought she had lots of cards in the game, but really only the ONE card mattered, and she didn't have it so she lost.I would have liked a richer and more imaginative portrait of Jane Seymour, too... Mantel presents her as almost asexual, which is fascinating, I've never seen it in a historical novel! But again, she is remote and pretty inscrutable to Cromwell, so she remains remote to the reader as well."}, {"userName": "B the BookAddict", "userReviewDate": "Jun 24, 2014", "userURL": "http://www.goodreads.com/user/show/19832827-b-the-bookaddict", "userReview": "In her Author’s Note, Hilary Mantel says: “This book is of course not about Anne Boleyn or about Henry VIII but about the career of Thomas Cromwell, who is still in need of attention from biographers. Meanwhile, Mr Secretary (Cromwell) remains sleek, plump and densely inaccessible, like a choice plum in a Christmas pie…” For me, Cromwell remains admirable, he had such exemplary hopes for England: one country, one coinage, one set of laws, one church albeit at Henry's bidding, good roads, good crops, good trade, good tax laws and care for the poor. He put the English Bible in every church. The events from September 1535 to April 1536 move with astonishing haste and Cromwell is recording them as they happen. Was it the miscarriage of Anne’s next baby, was it the court gossip, was it her constant maligning of his old friends, was it the prospect of the demure Jane Seymour or was it the death of Katherine, which hastened Anne's downfall? Whatever the reason, the thought is finally vocalized by Henry: \"What if there was some impediment to my marriage to Anne?\" You can almost hear the death knell sound for Anne... The next three weeks move very rapidly. Fault must be found and blame proportioned: “Weston because he is reckless, Brereton because he is old in sin, Mark because he is ambitious, Henry Norris because he is familiar, he is close, he has confused his own person with the person of the king; and George Boleyn, not despite being her brother, but because he is her brother.” Regardless of his own personal feelings in the matter, Cromwell seeks to fulfil the task which Henry has set him; present the guilty, not to Henry for he has absented himself, but to the court of England. In those same six months, Thomas More has continued to refuse to sign the oath required of him, even after Cromwell offers him ways out: \"Sign it but don't think it, sign it but don't feel it.\" But More is stubborn to the last and refuses. He finally talks his way into an admission of guilt and has been sent to the scaffold.The order goes up to the Tower: “Bring up the bodies”, Mark, Norris, Brereton, Weston and George are brought up for trial, charges read, sentences passed. The next day, Anne faces the court, a plethora of charges is read and she found guilty. A few days later, the executioner steps up to fulfil his task and heads roll. Cromwell is in Lambeth, he has no wish to watch the spectacle. But for Anne, Henry summons an expert executioner from Calais and she faces his well-honed sword; “a swish, a whisper through the air” and Anne \"the Most Happy” is no more. Ten days later, Henry quietly weds the demure and gentle Jane Seymour. The Boleyns are out and the Seymours are in. Cromwell is astute enough to realize that his newfound friends will just as quickly desert him when it suits them. The clock has started to wind down for ‘Master Secretary’. In a moment of reflection, I feel sorry for Anne Boleyn; she was never caught en flagrante and by today’s laws, her charges may well be considered hearsay. Only Anne herself could tell us the truth and the lady is long dead. While many detractors may saddle Cromwell with Anne’s downfall, read this book and then make up your own mind. Hilary Mantel presents us with a Cromwell sculptured with careful study and diligence. She shows you the man who still mourns his deceased wife and children, still misses The Cardinal Wolsey, becomes father/sponsor to many young men who come to live, learn and thrive in his household. She draws you through this novel at a breakneck speed. While you might have found Wolf Hall hard to follow in parts, this sequel moves like a fast moving river. It is engaging, riveting and all the while thoughtful. You cannot help but think at the novel’s end: ‘now I know and understand Thomas Cromwell a little better'. Most Highly Recommended 5★An interesting link titled Thomas Cromwell Controversies: http://www.thetudorswiki.com/page/Tho..."}, {"userName": "Sara", "userReviewDate": "Aug 25, 2017", "userURL": "http://www.goodreads.com/user/show/5512657-sara", "userReview": "The second book in Hilary Mantel’s amazing series on the life of Thomas Cromwell. I seem to have an unlimited capacity for viewing the Anne Boleyn story from different points of view. I know the details already, so you might think it would be boring, but it is anything but. I can never help trembling just a little when Anne is beheaded, and wondering, as we all must, what her state of mind must have been to go from queen to discard so quickly. This book has the more sensational part of Henry the Eighth’s story, but I will confess that I thought the first book had the better part of Thomas Cromwell’s. Even knowing all the historical details and knowing the part Cromwell played in it, Cromwell always seemed like a background figure to me. I’m not sure I even thought about what he must have been feeling or what kind of man he was before I encountered this series. Having read these two books, there is another historical figure who has come to life for me. I look forward to the third volume of this series. I want to know what happened to Cromwell, his family and associates after the death of Anne Boleyn. I do not know when it is due out, but it is high on my list of books to buy."}, {"userName": "Nancy", "userReviewDate": "May 12, 2012", "userURL": "http://www.goodreads.com/user/show/5672623-nancy", "userReview": "Brilliant, again. With sentences like this, as a candle is lit: The light shivers, then settles against dark wood like discs pared from a pearl. Everybody knows this story, of Catherine of Aragon, Henry the VIII, and Anne Boleyn, but that story has never been told like this before. And I don't just mean the obvious - that it's told from the perspective of Thomas Cromwell, who has come down in history as Henry's hatchet-man, but who here, in these pages, has wit and humanity as well as the shrewdness and intelligence we would expect from someone appointed to such high office who was so low-born. No, it's Mantel's ability to take us right inside the corridors and rooms, and up and down the staircases, of the royal Tudor court. The scene inside the tent where Henry is taken after he falls from his horse during a tournament is an amazing evocation of place and personality written in the most amazing prose. While you're reading it, you are completely transported, you are there. Afterwards, you can't stop wondering: How did Mantel do that, write that, conjure that up? I was astonished over and over again reading this book."}, {"userName": "·Karen·", "userReviewDate": "Jun 10, 2012", "userURL": "http://www.goodreads.com/user/show/1652898-karen", "userReview": "What sorcery is this?Cromwell plays good cop, bad cop. Surprisingly, he's the good cop.The King wants rid of Anne, so Cromwell finds men who are guilty, just not necessarily guilty as charged. That's about it really. Some professional reviewers have called this 'tauter' than part one, which must be review speak, like saying a house is \"conveniently placed for access to the city centre\", which means smack on the main thoroughfare with juggernauts hurtling past your windows. Taut = no subplots. Straight. There are also far fewer people, especially women. No, Harry hasn't killed them all off (yet), 'twas the sickness that took Cromwell's wife and two daughters. I wonder (she muses) - is there any way of knowing if women were more likely to get infectious diseases back in the early 16th century? I mean I know childbirth was a killer, but I have this theory that if women were kept at home more, didn't have as much contact as the men who were riding around in all weathers and meeting lots of people, then their immune system wouldn't have been up to much.Anyways: no Wolsey, no women. No-one to make Cromwell look better than the traditional image we have of him. But still a wondrous marvel. Mantel is a sorceress. Bring up part three!"}, {"userName": "Nandakishore Varma", "userReviewDate": "Nov 28, 2013", "userURL": "http://www.goodreads.com/user/show/6237864-nandakishore-varma", "userReview": "Hilary Mantel’s Booker-winning Wolf Hall, though fascinating, was a chore to get through – so it was with some misgivings that I picked up this book, the sequel; I was resigned to getting bored, but too entranced with Tudor England and Henry VIII’s court to leave the story. However, I was pleasantly surprised… no, that’s too mild a term, I was floored! Bring up the Bodies is one humdinger of a read. While Wolf Hall was ponderous, the sequel is breezy, without losing any of the beauty of the language. In cricketing parlance, Ms. Mantel is like a test batsman who, having negotiated a treacherous pitch, has got her eye in and is stroking beautifully. Read the full review on my \nBLOG\n."}, {"userName": "Gregory Baird", "userReviewDate": "Apr 03, 2012", "userURL": "http://www.goodreads.com/user/show/1067337-gregory-baird", "userReview": "\"Those who are made can be unmade.\"Let's begin with an admission: I have an extremely love-hate relationship with Wolf Hall, the Booker Prize-winning predecessor to this novel. I don't think anyone can deny that Hilary Mantel is a tremendously talented writer, but there were long segments of Hall that were deadly dull if I'm being honest. It's a sprawling novel that takes work to get through. Finishing a book that makes you work can feel thrilling, but not when the effort is born out of frustration.So it was with no small amount of trepidation that I picked up its sequel and plunged back into the world of Thomas Cromwell and the court of Henry VIII. You may wonder why I bothered, but the truth is that there is a great deal to love about Mantel's rich portrayal of the period. In its best moments Hall is absolutely enthralling, and the cool machinations of Cromwell make for the most layered, complex character fiction has seen in a long time. On top of all that, the focus of this installment is perhaps the most intriguing (and bloody) time in British history: the downfall and execution of Anne Boleyn. It has everything most readers dream of (love, sex, power, violence, and betrayal), plus the added bonus of a writer with serious literary heft. How could you resist?I was not disappointed. I expected to rely on the family trees and extensive character guides at the beginning of the novel (as I did with Hall), but I was pleasantly surprised to find that I fell back into the world of Henry VIII with ease and a great deal of familiarity. I already got to know everyone. I already knew their history, their alliances, and what skeletons they had hidden in their closets. A lot of Hall is dragged down by exposition but it really seems to have paid off in the end. You see, in the first novel we get the full introduction to Cromwell: his childhood, his years wandering abroad, his time working for Cardinal Wolsey, and his unexpected rise in Henry's favor following Wolsey's downfall. It's information that is vital to Mantel's recreation of Cromwell, but Bodies has the luxury of skimming over all the detail work. It makes for a significantly more focused story. Consider this: while Hall spanned decades, Bodies takes place in a scant nine month period. And what a nine months! Henry, already disillusioned with Anne at the close of Hall, begins to transfer his affections to Jane Seymour, making it necessary to undo a marriage he had moved Heaven and Earth to make possible in the first place. The characterizations of Cromwell, Anne, and Henry are where Mantel's writing shines the brightest for me. Anne's dark, glittery eyes are a descriptive quality that has stayed with me from the first book. But here they are all getting older. Henry is in middle age and desperate for a legitimate heir to the throne. Anne, who maneuvered so seductively into the throne, is losing her guile and her grip more and more. And Cromwell, also in middle age, is becoming so fixated on achieving revenge on those who have wronged him and his beloved Cardinal Wolsey that he is slowly sowing the seeds of his own eventual downfall. \"A queen, and [Anne] calls herself a queen, must live and suffer under the world's eye.\"But it's not just them changing. The entire world is shifting in a new direction--largely because of their actions. Henry's divorce from Katherine of Aragon has scandalized the world. His break from the Catholic church challenged the authority of an institution most people believed unassailable. Boleyn and, especially, Cromwell are eyed with suspicion because of their 'low birth.' Yet they have ruthlessly risen to two of the highest positions in their country. The classical orders aren't just being challenged, they're being ripped asunder. \"Chivalry's day is over. One day soon moss will grow in the tilt yard. The days of the moneylender have arrived, and the days of the swaggering privateer; banker sits down with banker, and kings are their waiting boys.\" The fact that this novel arrives on the heels of the Occupy Wall Street movement makes it all the more timely.We know that Anne's bloody end is approaching, that Henry will have two wives after Jane Seymour, and that Cromwell's own relationship with Henry will come to a bitter end. But watching it all unfold through Mantel's eyes is nothing short of fascinating. She still rambles a bit. At times her prose seems willfully opaque. She is defiantly not an author who spells it all out for the reader; indeed, one can never be quite certain which lines the characters speak are lies and which are true (particularly when it comes to Henry). But isn't that life for you? In the end, finishing Bring Up the Bodies gave me a charge the way Wolf Hall didn't. This one is work that is worth the effort."}, {"userName": "Sue", "userReviewDate": "Jan 17, 2013", "userURL": "http://www.goodreads.com/user/show/3642045-sue", "userReview": "Wonderful creation by Hilary Mantel and deserving of all the praise it has received. This is a novel more of action than description, though the action is often in dialogue, both external and internal. Cromwell is in charge, as much as anyone who is not the King or a member of the nobility can be. The inner workings at the various royal courts and Cromwell's now multiple homes are intense and exciting. As the royal times seem about to change, He (Cromwell--better identified in this book) looks to a changing future. \"But Cremuel remains a nobody. The King gives him titles that no one abroad understands, and jobs that no one at  home can do. He multiplies offices, duties pile on him:  plain Master Cromwell goes out at morning, plain Master  Cromwell comes in at night. Henry had offered him the Lord Chancellor's post; no don't disturb Lord Audley, he had said...Audley in fact does as he is told....You  cannot, surely, be Lord Chancellor and Master Secretary? And he will not give up that post. It doesn't matter if it  gives him a lesser status. It doesn't matter if the French don't comprehend. Let them judge by results....chivalry's day is over. One day soon moss will grow in the tilt yard.  the days of the moneylender have arrived, and the days of the swaggering privateer; banker sits down with banker,  and kings are their waiting boys.\" (p. 141)Mantel's Cromwell (sometimes also named Cremuel) is a complicated man, constantly thinking four or five --or a dozen--steps ahead, to protect himself, his family and his King. It appears to me in that order.I can hardly wait for the third installment of this series. No stronger 5 than this.Addendum: Mantel provides an interesting postscript on her thoughts about Cromwell."}, {"userName": "Bettie☯", "userReviewDate": "Nov 18, 2013", "userURL": "http://www.goodreads.com/user/show/1108123-bettie", "userReview": "Description: Though he battled for seven years to marry her, Henry is disenchanted with Anne Boleyn. She has failed to give him a son and her sharp intelligence and audacious will alienate his old friends and the noble families of England. When the discarded Katherine dies in exile from the court, Anne stands starkly exposed, the focus of gossip and malice.At a word from Henry, Thomas Cromwell is ready to bring her down. Over three terrifying weeks, Anne is ensnared in a web of conspiracy, while the demure Jane Seymour stands waiting her turn for the poisoned wedding ring. But Anne and her powerful family will not yield without a ferocious struggle. Hilary Mantel's \"Bring Up the Bodies\" follows the dramatic trial of the queen and her suitors for adultery and treason. To defeat the Boleyns, Cromwell must ally with his natural enemies, the papist aristocracy. What price will he pay for Anne's head? Opening: His children are falling from the sky. He watches from horseback, acres of England stretching behind him; they drop, gilt-winged, each with a blood-filled gaze. Grace Cromwell hovers in thin air. She is silent when she takes her prey, silent as she glides to his fist. But the sounds she makes then, the rustle of feathers and the creak, the sigh and riffle of pinion, the small cluck-cluck from her throat, these are sounds of recognition, intimate, daughterly, almost disapproving. Her breast is gore-streaked and flesh clings to her claws.It took me two stabs and a TV series to fully appreciate Wolf Hall and that perserverance stood as bedrock for this second book. I breezed through Bring Up the Bodies knowing the history and was pretty au fait with Mantel's style idiosyncrasies.Bring Up the TV series!"}, {"userName": "Jane", "userReviewDate": "Apr 10, 2012", "userURL": "http://www.goodreads.com/user/show/2679341-jane", "userReview": "[Spoiler: they snicked off her brainbox with a sharp pointy object. (hide spoiler)]"}, {"userName": "Paul", "userReviewDate": "Dec 01, 2014", "userURL": "http://www.goodreads.com/user/show/4643325-paul", "userReview": "4.5 starsIt’s a while since I read Wolf Hall, but Mantel does a good job of filling in gaps in my memory. This holds the attention as much as the first one does, but is narrower in focus, covering less than a year. Cromwell is as ruthless and manipulative as ever; but it is fascinating seeing things from his point of view. Being a bit of an old Tudor hack from my undergraduate days these books are a fascinating take on an era I know fairly well. For centuries Cromwell had been dismissed as just another political hack and it wasn’t until Geoffrey Elton’s revision of him in the 1950s that his significance in driving forward the English Reformation was articulated. Cromwell, it has been argued, was the developer of modern bureaucratic government (he has a good deal to answer for then!). Whilst I am no fan of Elton’s Rankian and empirical view of history, I think he was right about the importance of Cromwell. Mantel’s genius is the way she makes Cromwell understandable, even sympathetic. She fills in the historical gaps in Cromwell’s life and in the historical accounts in an intelligent and believable way. The brutality of daily life and the religious tension is well captured. The prose is wonderful, clever and very funny. She puts some depth into those who surround Cromwell. Henry himself remains a little elusive and unpredictable and Cromwell knows he is always walking on a tightrope dealing with him. It is a fascinating analysis of the use and misuse of power; but most of all a great story, well told. Historical fiction at its best."}, {"userName": "Michael", "userReviewDate": "May 04, 2013", "userURL": "http://www.goodreads.com/user/show/4086118-michael", "userReview": "I didn’t enjoy this as much as I’d hoped to. The writing is often brilliant, with the dialogue lively and apt in revealing the characters, but I came away with a hollow feeling with respect to emotional engagement. Only part of that has to do with the lack of focus on likable characters in the unlikeable times. The time is 1535, and the events concern the role of Thomas Cromwell in the downfall of Anne Boleyn in favor of Jane Seymour as Henry Tudor’s queen. As with the previous removal of Katherine of Aragorn from the throne in favor of Boleyn, features in Mantel’s “Wolf Hall”, there are a lot of nasty power plays and maneuverings that doesn’t favor liking anyone. Cromwell in most ways comes off in Mantel’s portrayal as the most human character in the tale. And that’s saying a lot given the historical outcome of the Queen’s execution and that of a number of formerly favored noblemen accused of being her lovers (and therefore treasonous). His path to becoming the indispensable right hand to the King as Master Secretary from humble origins as a scrappy blacksmith’s son garners sympathy points, as does his bereft status after losing a wife and son to disease. His pragmatic Machiavellian persona keeps him brutally cool and efficient on the outside, belying a more emotional self the reader is privy to. Cromwell’s scope of character and methods are well distilled in this paragraph early in the book:He never spares himself in the king’s service, he knows his worth and merits and makes sure of his reward: offices, perquisites and title deeds, manor houses and farms. He has a way of getting his way, he has a method; he will charm a man or bribe him, coax him or threaten him, he will explain to a man where his true interests lie, and he will introduce the same man to aspects of himself he didn’t know existed. Every day Master Secretary deals with grandees who, if they could, would destroy him with one vindictive swipe, as if he were a fly. Knowing this, he is distinguished by his courtesy, his calmness and his indefatigable attention to England’s business. He is not in the habit of explaining himself. He is not in the habit of discussing his successes. But whenever good fortune has called upon him, he has been there, planted on the threshold, ready to fling open the door to her timid scratch on the wood.In the early part of the book, the King’s lack of a surviving male heir and the impending death of Katherine brings the ambassadors from the courts of France and Spain to Cromwell’s door on the issue of which of Henry’s daughters is to be considered the true Princess, Katherine’s Mary or Anne’s Elizabeth. One of his negotiations makes the King so angry, even Cromwell has fears over his precarious position:Henry is convulsing with rage. ‘I really believe, Cromwell, that you think you are king, and I am the blacksmith’s boy.’He will never claim, later, that his heart did not turn over. He is not one to boast of a coolness no reasonable man would possess. Henry could, at any moment, gesture to his guards; he could find himself with cold metal at his ribs, and his day done.But he steps back; he knows his face shows nothing, neither repentance nor regret nor fear. He thinks, you could never be the blacksmith’s boy. Walter would not have had you in his forge. Brawn is not the whole story. In the flames you need a cool head, when sparks are flying to the rafters you must note when they fall on you and knock the fire away with one swat of your hard palm: a man who panics is no use in a shop full of molten metal.When Henry tasks Cromwell to find some way of dumping Boleyn and getting an annulment, he has a chance to become indispensable again. Cromwell confesses to a crony:He says softly, “I think I have been training all my years for this. I have served an apprenticeship to myself.” His whole career has been an education in hypocrisy.He is able to wangle a chain of witness statements and semi-confessions without torture that can serve the purpose. The complete truth is not the overall objective for him: we are not priests. We don’t want their sort of confession. We are lawyers. We want the truth little by little and only those parts of it we can use.Thus, we get a lot of cleverness in Mantel’s the vision of Cromwell as an almost modern political manipulator. Still he didn’t quite gel for me, and my heart rarely felt concerned for him. Likability is not the issue in that; it’s more his lack of gravitas. Shakespeare’s tragedies about royalty are full of characters driven by corruption, avarice, and lust, and I can still often care a lot about their fate, even if it is to see them meet their just or inevitable desserts. Cromwell’s internal monologues and fantasies make him human, but a cool and flip type of human that just doesn’t get under my skin. In the first book, I got tired of being in his mind and wasn’t able to finish. Others obviously felt differently, which is fine by me.I save my favorite line for the last, a response to negative rumors that illustrates both the high and low points of Mantel’s rendering of Cromwell’s humanity for me:‘You know young Francis Weston? He that waits on the king? His people are giving out that you’re a Hebrew’ He grunts; he’s heard that one before. ‘Next time you’re at court’, Thurston advises, ‘take your cock out and put it on the table and see what he says to that.’‘I do that anyway’, he says. ‘If the conversation flags.’"}, {"userName": "LeAnne", "userReviewDate": "Sep 26, 2017", "userURL": "http://www.goodreads.com/user/show/7862560-leanne", "userReview": "Phil Collins sings my theme song for this one: I don't care any moo-oo-oore. Just don't care no more. No more.It's not easy being the only dissenter, but despite her books' popularity, they do not include any characters I feel any connection to. Yes, I did read Wolf Hall (most of it, anyway), so it is not my ignorance of historical happenings or lack of appreciation for Cromwell's ability to overcome his shoddy youth. It is likely a style-preference plus my apathy for the role and impact of Cromwell on the Tudor monarchy.On language and style, I can certainly appreciate that many folks love her approach - look at the success of Game of Thrones (also something I've never been much tempted to read/watch). Obviously, she is not THAT author but the tone of the stories might be similar...dunno. Not going there. But this book and its preceding tome seemed like overblown window dressing with nothing but mannequins inhabiting the grandiosely staged pages. There was also an unusual narrative structure that popped from first person to third person that initially distracted me, but once I got comfortable with it, the author then kicked in daydream-narration. Cromwell would be sitting there having a conversation with someone and then suddenly think, huh - wouldn't it be great if we had a big feast where so-and-so would arrive with his doddering old mother and then Sir Something or Other would seat himself and his horrible wife. Yada, yada, yada. Look, I can manage small doses of fantasy or dreamworld stuff, but his daydreams went on for pages and pages, even describing the imagined attendees' clothing choice. This happened repeatedly, and while his flashbacks to his younger days happened pretty seamlessly, his fantasy life expounding upon his wishes was just screwy.As for my apathy, perhaps because I read The Other Boleyn Girl ages ago, I already knew the entire story line about deposing Anne Boleyn, excepting the minutia about Cromwell's role. The whole world was changed because of Henry VIII's vapid and childish libido - yes. I took World History in college as did most of you, and we know this already, Hilary. What I do wonder is this: did Hilary Mantel do her PhD dissertation on Cromwell and then decide to write these (ridiculously) long (and redundant) detailed (ostentatious)books? Pardon my French, but she appears to have a serious hard-on for the guy - notwithstanding the funny line she includes about him flopping his weenie on the dining table to show that while he might be a money-lender, he isn't a Jew. Yeah, while she eschews all the saints and relics the Catholics saw as holy, it appeared that she too has her own god. His name is Cromwell, the Master Puppeteer.Whatever she imagines him slapping on the dinner table, even in jest, I just don't care. Not my thing."}, {"userName": "Madeline", "userReviewDate": "Jan 30, 2013", "userURL": "http://www.goodreads.com/user/show/111921-madeline", "userReview": "Here is the genius of Hilary Mantel: she can take a story about the rise and fall of Anne Boleyn, a subject that I have been reading about since I was twelve, and make it new and fascinating to me. She does this mainly by focusing her story through the eyes of, not Anne or Mary Boleyn (as so many authors choose to do) but through the eyes of a relatively unknown and certainly mysterious person: Thomas Cromwell, Master Secretary and grand puppetmaster of all Tudor drama. Cromwell is, to this day, an enigmatic character, and most of his motivations and machinations remain a mystery to us. Which is what makes Mantel's Cromwell trilogy so great: she's showing us this common, well-known story and making it fresh by writing about it through a new perspective while also providing her own solutions to questions about Cromwell. Do I make it sound dull? Because it is the opposite of dull. Mantel's writing is funny (\"If someone said to Lady Rochford, 'It's raining,' she would turn it into a conspiracy; as she passed the news on, she would make it sound somehow indecent, unlikely, but sadly true.\") and smart: she doesn't spoon-feed you anything, and expects you to keep up with her characters' insinuations and hinted-at secrets, without explicitly spelling them out for you. And there's the story itself, which is full of fantastic characters and intrigue and gossip and beautiful, evocative, near-poetic lines like this: \"You can be merry with the king, you can share a joke with him. But as Thomas More used to say, it's like sporting with a tamed lion. You tousle its mane and pull its ears, but all the time you're thinking, those claws, those claws, those claws.\" (a line which is, incidentally, one of the most spot-on and perfect descriptions of Henry VIII's character I've ever read)And the man at the center of it all, Thomas Cromwell, is endlessly fascinating. When he investigates Anne Boleyn's suspected infidelities and arranges her trial, does he think she's actually guilty? No. Or, more accurately, Cromwell knows that Anne is dangerous and plotting his downfall, and makes a move to eliminate her before she can move against him. The trial is just a handy way for Cromwell to get rid of his enemies in one fell swoop - in Mantel's version of events, the men put on trial for having an affair with Anne Boleyn are the same men who celebrated when Cromwell's mentor, Cardinal Wolsey, was executed in the previous novel. It's a cruel move, but a shrewd one. As Cromwell says in his narration: \"He needs guilty men. So he has found men who are guilty. Though perhaps not guilty as charged.\"It would be easy for an author to portray Cromwell as the villain, but Mantel reminds us that he is only acting on Henry's orders. It's Henry who wants to get rid of Anne Boleyn, Henry who suggests that she might have used witchcraft against him, and Henry who is the engineer of all this injustice. In Wolf Hall, Wolsey's death taught Cromwell what happens when you don't do what the king wants; in Bring Up the Bodies, we see him put that lesson into practice (which will make the third book, which I assume will be about Cromwell's death after the Anne of Cleves disaster, all the more fascinating).Mantel's entire take on the Anne Boleyn trial is fantastic and, even if it's not all true, utterly believable (especially after reading The Lady in the Tower, Alison Weir's awesome nonfiction book about the fall of Anne Boleyn) - because the court documents from Anne's trial have been lost, Mantel skips over the trial scenes very quickly, which makes them all the more heartbreaking, because it only emphasizes how the trial was only for show anyway. Her version of Anne's execution (spoiler alert?) is heartwrenching and horrifying and made me short of breath, and I loved her take on some of Anne's strange behavior post-arrest. When Anne Boleyn was brought to the Tower, she asked if she would be put in a dungeon, and was told that she would be staying in her own royal rooms at the Tower. On hearing this, Anne Boleyn reportedly replied, \"It is too good for me. Jesus have mercy on me.\" Historians are confounded by this: was Anne admitting her guilt, or did it have another meaning? Here's Mantel's (speaking as Cromwell) take on it: \"He believes he understands Anne, as Wriothesley does not. When she said the queen's lodgings were too good for her, she did not mean to admit her guilt, but to say this truth: I am not worthy, and I am not worthy because I have failed. One thing she set out to do, this side of salvation: get Henry and keep him. She has lost him to Jane Seymour, and no court of law will judge her more harshly than she has judged herself. Since Henry rode away from her yesterday, she has been an imposter, like a child or a court fool, dressed in the costumes of a queen and now ordered to live in the queen's rooms. She knows that adultery is a sin and treason is a crime, but to be on the losing side is a greater fault that these.\"I can't wait for the third book in this series. If the first two are any indication, it's going to be incredible. Well done, Ms. Mantel. Well done indeed."}, {"userName": "Trish", "userReviewDate": "May 05, 2012", "userURL": "http://www.goodreads.com/user/show/1826682-trish", "userReview": "This second volume in Mantel’s proposed trilogy has fear and trepidation woven into the very sentences. Cromwell has moments of prescience when he can see that his tendency to go “all in” on support for the people he works for will bring him grief and destruction in the end. But, you know, I like him better for it. The man who could rewrite Machiavelli and teach him a thing or two has, at heart, a heart.In Mantel’s novel I often got the notion that Cromwell directed the King’s attention towards Jane Seymour. That Cromwell mistrusted Anne Boleyn, I don’t think there can be any doubt, though he supported her until her jealousies and scheming became too much for even Cromwell to stomach. It doesn’t make any sense for Cromwell to put Henry and Jane together unless he suspected all along Anne’s tendency to plot would be her epitaph.In the BBC production starring Mark Rylance, however, we get a slightly different interpretation: in Rylance’s performance we see Cromwell’s surprise, uncertainty, fear, and a growing knowledge that Henry would throw off the yoke of marriage once again, and entreat Cromwell to \"fix\" a divorce for him. Cromwell himself had always been attracted [either sexually or simply as a father figure] to the young, silent Jane Seymour and notes with consternation how Jane drew the King’s eye. With his knowledge of the King, he surely fears for anyone coming unprepared into the King's orbit.Either interpretation deepens the character of Cromwell, though one is far more scheming and less attractive. I think Mantel meant us to recognize the humanity in Cromwell, though she has him serving up the coldest dish of long-held revenge we have perhaps ever seen. Cromwell hates the young Master of the Privy Chamber Harry Norris for his role in a play which humiliated the memory of Cromwell’s beloved Cardinal Wolsey. Cromwell bides his time but eventually finds a way to unseat Norris. The title, Bring Up the Bodies, refers to the trial of five court regulars who were thought to be intimates of Anne Boleyn: Harry Norris, George Boleyn, Mark Smeaton, William Brereton, and Francis Weston. There is still an open question as to whether the queen slept with them while she reigned. Hard as it is to believe, it may not be out of place today, which is why we even entertain the notion. Anne Boleyn was married to King Henry only three years. It seemed to have been a trial for both of them.Mantel did meticulous research so we can assume the portrait of a petulant monarch who does not deal well with failure or challenges has basis in fact. Certainly looking at his decisions alone might lead one to think in that direction. But it is Cromwell that is the central character in this drama, and Mantel does not let our eyes or thoughts stray far from the man. Mantel's chapter headings toll the years, and if the reader already knows Cromwell lived only four years beyond the death of Anne Boleyn, each chapter heading rings sonorous, ominous.At the end of this novel we are treated to how his contemporaries view him, and it is not a flattering portrait. They wonder Cromwell won’t go after the King next. We’d like to be able to defend him, but know he is simply doing what is necessary for himself—he has an unquenchable appetite for the hand to hand combat that is his life. I look forward to how Mantel deals with the end of Cromwell and the story she has made her own."}], "description": "Alternate Cover Edition ISBN 0805090037 (ISBN13: 9780805090031)The sequel to Hilary Mantel's international bestseller and Man Booker Prize winner Wolf Hall explores one of the most mystifying and frightening episodes in English history: the downfall of Anne Boleyn....Though he battled for years to marry her, Henry VIII has become disenchanted with the audacious Anne Boleyn. She has failed to give him as son, and her sharp intelligence and strong will have alienated his old friends and the noble families of England.When the discarded Katherine, Henry's first wife, dies in exile from the court, Anne stands starkly exposed, the focus of gossip and malice, setting in motion a dramatic trial of the queen and her suitors for adultery and treason. At a word from Henry, Thomas Cromwell is ready to bring her down. Over a few terrifying weeks, Anne is ensnared in a web of conspiracy, while the demure Jane Seymour stands waiting her turn for the poisoned wedding ring. But Anne and her powerful family will not yield without a ferocious struggle. To defeat the Boleyns, Cromwell must ally himself with his enemies. What price will he pay for Annie's head? (front flap)", "title": "Bring Up the Bodies\n      \n          (Thomas Cromwell Trilogy #2)", "url": "https://www.goodreads.com/book/show/13507212.Bring_Up_the_Bodies__Wolf_Hall___2_", "average": 4.27, "cover": "https://images.gr-assets.com/books/1330649655l/13507212.jpg", "reviews": 6583, "authors": [{"url": "https://www.goodreads.com/author/show/58851.Hilary_Mantel", "name": "Hilary Mantel"}], "type": ["Historical", "Fiction", "Historical", "European Literature"], "outlinks": ["http://www.goodreads.com/book/show/13507212-bring-up-the-bodies", "http://www.goodreads.com/book/show/13644297-bring-up-the-bodies", "http://www.goodreads.com/book/show/13393094-bring-up-the-bodies", "http://www.goodreads.com/book/show/17899680-bring-up-the-bodies", "http://www.goodreads.com/book/show/13390681-bring-up-the-bodies", "http://www.goodreads.com/book/show/13722528-bring-up-the-bodies", "http://www.goodreads.com/book/show/24969745-o-regin-pe-e-afod", "http://www.goodreads.com/book/show/6101138-wolf-hall", "http://www.goodreads.com/book/show/101921.A_Place_of_Greater_Safety", "http://www.goodreads.com/book/show/20563988-the-assassination-of-margaret-thatcher", "http://www.goodreads.com/book/show/101923.Beyond_Black", "http://www.goodreads.com/book/show/16117978-wolf-hall-bring-up-the-bodies", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}