{"ratings": 2631, "userreviews": [{"userName": "Luís C.", "userReviewDate": "Sep 19, 2014", "userURL": "http://www.goodreads.com/user/show/34132356-lu-s-c", "userReview": "End of the Second World War, in a village, a foreigner is murdered. Brodeck writes nature notes for his administration. Asked by the villagers, he agrees to write a report on the facts that led to this tragedy. Meticulous, orderly, in search of truth, he embarks on this writing after having obtained the agreement of these fellow citizens, to make appear the truth even if this one disturbs. The gray souls have become black, very black, Claudel builds his novel as a puzzle, from one character to another, from one period to another, he does not judge, he describes what Brodeck discovers, no need to 'to bring judgment, the facts justify themselves,' the Anderer 'has paid with his life, cowardice, the fear of the unknown, intolerance in what he has most abject. The story in the end is timeless, the human stupidity brings its share of horrors at any time. Claudel succeeds in a novel that haunts, that ice. His writing is clear, precise, no frills and it's simply overwhelming. It also serves that literature. Lisbon Book-Fair 2016."}, {"userName": "Sawsan", "userReviewDate": "Aug 11, 2016", "userURL": "http://www.goodreads.com/user/show/11592808-sawsan", "userReview": "مع السطور الأولى تظهر قوة وتميز الرواية في الفكرة والأسلوب يكتب فيليب كلوديل الكاتب الفرنسي عن الطبيعة البشرية بمختلف أحوالهاتوحش وسادية البشر في الحروب, والقيم الانسانية التي لا تصمد أمام الكره والتعصب والعنصريةالنظرة للآخر المختلف, واختيارات الناس واختلاف تفكيرهم وتصرفاتهم في مواجهة الخوف والتهديد في قرية صغيرة منعزلة وبعد الحرب يروي بروديك قصته التي تبدأ بتكليفه بكتابة تقرير عن جريمة قتلومع كتابة التقرير يحكي عن تفاصيل حياته ما قبل وبعد الحرب, وداخل معسكر الاعتقال, وعن القرية وأهلها وأسرارهابروديك يُمثل الانسان بكل ما فيه من تخاذل وضعف وخوف, وكل ما بداخله أيضا من حب وأمل ورغبة في الحياةعدم تحديد كلوديل للحرب وجنسيات الشخصيات وبلادهم أضاف للرواية قيمة انسانية عامة أسلوب جميل ومميز في الوصف والتشبيه, والترجمة ممتازة وهي أول ترجمة أدبية للمترجم لطفي السيد"}, {"userName": "Jill", "userReviewDate": "Jul 09, 2010", "userURL": "http://www.goodreads.com/user/show/2228181-jill", "userReview": "There are many reasons we read: for enlightenment, escape, education, and in some rare instances, to confront ourselves with truths and insights we never would have encountered otherwise.Brodeck is one of those rare instances. It is, quite simply, one of the best contemporary books I have ever read. And I have read a lot.The book – which reads like an allegory or dark adult fairy tale – transcends those genres by strongly tethering itself to recognizable events and images. Brodeck, by many indications, appears to be Jewish, yet he served as an acolyte to a priest in his youth, implying that he isn’t. The locale appears to be in France’s Alsace-Lorraine, yet many of the geographical features do not fit. And the Nazis have wrecked havoc in the region, yet they are never mentioned by name.What we DO know is this: Brodeck has been taken prisoner of war and has scratched and scraped his way to survival, serving as “Broderick the Dog” to sadistic camp officials. Against all odds, he has returned to his insular village where he is greeted with less than 100% enthusiasm.And now, an elusive stranger referred to as the Anderer – the Other – has appeared in the village with his horse and donkey and sketch pads, serving as a mirror to the truth of the village’s betrayals….its cowardice dishonorable conduct, spinelessness and moral stain. Early on, we learn that the village participated in a mass murder of the Anderer and it falls upon Brodeck – a low-level bureaucrat who now makes his living cataloguing the area’s flora and fauna – to write a whitewashing report about the event.Brodeck himself is “the other”; he is an orphan, with only the sketchiest recollections of where he comes from and how he got to where he is. He knows that “each of us was a nothing. A nothing handed over to death. Its slave. Its toy. Waiting and resigned.” His survival has not changed that fact: “The others the ones who came out of it alive, like me – all of us still carry a part of it, deep down inside, like a stain. We can never again meet the eyes of other people without wondering whether they harbor the desire to hunt us down, to torture us, to kill us.”His quest to discover what really happened to the Anderer is also a personal quest; to find out his own back story. At the start, the reader knows little: we know he has a mute wife Amelie and a young baby daughter and that he is merely tolerated by the village. As the book progresses, the picture begins to fall more and more into focus.As he interacts with the various members of the community, he at one point meets with the village priest. In one of the most harrowing passages, the priest says, “Men are strange. They commit the worst crimes without question, but later they can’t live anymore with the memory of what they’ve done. They have to get rid of it. And so they come to me, because they know I’m the only person who can give them relief, and they tell me everything. I’m the sewer, Brodeck. I’m not the priest; I’m the sewer man.”This book achieves something I thought would be impossible in literature: it universalizes the Holocaust. It offers up Brodeck as “every man” and his tormenters as “every man” as well. It reveals mankind’s ability to perpetrate the worst deeds and to turn its collective eye elsewhere when heinous deeds are being perpetrated. It displays our fervent struggle to forget and to absolve ourselves in the worst of times.The prose is luminous and masterful. For that, I must partially give credit to the incredible translator, John Cullen. In reading international books, I’ve learned that a good translator can make or break a work of literature, and Cullen does Philippe Claudel proud. As for Claudel, his insights are astounding and his words are transformational. Some of the scenes are exquisitely painful to read; I gasped and shed tears on some of the more horrific. Some evocations to works such as Camus’ The Stranger and Ibsen’s Enemy of the People come to mind but make no mistake: this is a highly original work. In the end, I knew that I had read something fiercely important – a modern masterpiece."}, {"userName": "Orsodimondo", "userReviewDate": "Dec 21, 2012", "userURL": "http://www.goodreads.com/user/show/10490224-orsodimondo", "userReview": "DIE ANDERERIeri sera, gli uomini del paese hanno ucciso l’Anderer. È successo alla locanda di Schloss, semplicemente, come una partita a carte o la firma di un compromesso per la vendita. Era da un pezzo che covava. Io sono arrivato dopo, ero andato a comprare del burro, non ho partecipato al massacro. Io sono semplicemente incaricato di stendere il Rapporto. Devo spiegare cosa è successo dopo il suo arrivo e perché non si poteva fare a meno di ucciderlo. Tutto qua.“Fiaba per adulti” è una definizione che normalmente mi farebbe astenere dalla lettura, non sono mai stato in grande sintonia con le favole, a cominciare da quelle per bambini, figuriamoci quelle per i ‘grandi’: mi aspetto sempre che la Morale salti fuori ogni momento con vocina querula a reclamare la nostra attenzione e a darsi un sacco d’importanza, che sdolcinate principesse ci insegnino a vivere, e vecchi saggi re dalla barba canuta ne sappiano più di tutti su tutto... Ma questa volta l'artefice è Philippe Claudel, mi ha già regalato un libro molto bello, e almeno due regie notevoli, sono pronto a fidarmi. Il y a longtemps que je t'aime (Ti amerò sempre), 2008, film scritto e diretto da Philippe ClaudelE questa “fiaba per adulti” non mi delude: con incedere classico e senza nessuna semplificazione, affronta, come si addice al genere, il Bene e il Male, portati all’estremo. E sono il Bene e il Male del nostro tempo, soprattutto il Male che temiamo, che conosciamo e ancora cerchiamo di spiegare, quel Male che ha lasciato segni indelebili a Srebenica, a Murambi, ad Auschwitz…A volte, guardandolo, avevo pensato a qualche faccia di santo. È stranissima, la santità. Quando la si incontra, la si scambia spesso per qualcos’altro, per tutt’altro: indifferenza, derisione, presa in giro, freddezza o insolenza, magari disprezzo. Ci si inganna, e allora ci si adira. Si fanno le cose peggiori. Probabilmente è per questo che i santi finiscono sempre martiri. Tous les soleils (...Non ci posso credere), 2001, scritto e diretto da Philippe ClaudeUn uomo è stato assassinato: era uno straniero, l’Anderer, l’altro, come lo chiamavano nel villaggio in cui era giunto un giorno di maggio, subito dopo la fine di una guerra. Silenzioso e gentile, agli abitanti era comunque apparso strano e sospetto. Un diverso. Uno straniero. Generando un malessere collettivo che si trasforma in follia collettiva. Per far luce sui fatti, Brodeck – l’unico nel villaggio che ha studiato e sa scrivere – viene incaricato di redigere un rapporto dettagliato, affinché colui che un giorno leggerà capisca e perdoni.L’Anderer di Claudel mi ricorda l’ospite nel film \"Teorema\" di Pasolini, che arriva e sconvolge, niente rimane come prima. Ma PPP lo risparmia, è soprattutto interessato agli effetti del suo passaggio. Nel villaggio di Claudel, invece, non c’è spazio per il dopo, prima che la luce faccia sparire le ombre, il rito va consumato, lo straniero deve pagare il suo essere ‘altro’, diverso.Massimo Girotti in ‘Teorema’ di PierPaolo Pasolini, 1968Era come uno specchio, non aveva bisogno di dire niente. Rimandava a ciascuno la sua immagine. O forse era l’ultimo inviato di dio, prima che lui chiudesse bottega e buttasse via la chiave. Gli specchi possono soltanto rompersi. Dio non c’è più in questa parte del mondo che corrisponde al confine francotedesco, zona di vini pregiati: se mai è esistito, adesso non c’è più, è andato via, ha visto la Guerra e ha scelto di andarsene. Anche il prete non crede più alla sua esistenza. Dio non è degno della maggior parte degli uomini, perché se la creatura ha potuto generare l’orrore, è soltanto perché il suo Creatore gliene ha suggerito la formula. Claudel anche qui affronta una Guerra: dopo la carneficina della guerra di trincea nella Prima Mondiale in Le anime grigie, adesso siamo alla Seconda, ai lager, qui chiamato Campo. Brodeck, il protagonista, citato nel titolo originale, e cancellato nella traduzione in italiano (Le Rapport de Brodeck) il narratore, e colui che stenderà il Rapporto, è a sua volta un altro Anderer, è arrivato bambino non si da dove, ma tutti ricordano che viene da un altrove e questo basta, per lui si apre il cancello del Campo, dove imparerà che prezzo può avere la sopravvivenza, e cioè che l’unica morale vincente è la vita, soltanto i morti hanno sempre torto.Avant l'hiver, 2013, scritto e diretto da Philippe ClaudelEppure, sia l’Anderer che Brodeck sono anime gentili, dolci, sensibili: È sempre stato difficile per me parlare ed esprimere l’essenza del mio pensiero. Preferisco scrivere. Allora mi sembra che le parole diventano docilissime, tanto da venire a mangiare nella mia mano come uccellini, e ne faccio più o meno ciò che voglio, mentre quando cerco di riunirle nell’aria, mi sfuggono.Non è solo la piccola comunità (il villaggio ha circa quattrocento abitanti) che è incapace di accogliere e inglobare: anche la grande capitale reagisce allo stesso modo, è la folla in sé che nasconde il delitto, perché nella folla ognuno si cela dietro il vicino e perde individualità, può così dar corpo alla sua paura ed esprimere senza timore di punizione la sua viltà e ferocia.Il finale è un’altra immagine forte che emerge dalle pagine di Claudel: Brodeck prende i suoi cari e parte, se ne va, ed è impossibile non pensare a Enea col padre Anchise sulle spalle e il figlio Ascanio tenuto per mano che si allontanano da Troia in fiamme – qui non c’è il fuoco, ma probabilmente le stesse tenebre, anche se la scena è immersa in una luce così viva da sembrare quasi rassicurante.Gian Lorenzo Bernini: Enea, Anchise e Ascanio, 1619, Galleria Borghese di Roma"}, {"userName": "Ana", "userReviewDate": "Jan 02, 2018", "userURL": "http://www.goodreads.com/user/show/4796513-ana", "userReview": "A história narrada neste livro decorre numa aldeia remota, num tempo e lugar não definidos, mas que podemos situar no pós Segunda Guerra Mundial a talvez algures na região fronteiriça franco-alemã. Um dia, um estrangeiro de apresentação e hábitos singulares, todavia obsequioso e gentil, instala-se na aldeia. Inicialmente é recebido de forma pacífica mas, aos poucos, os habitantes locais começam a vê-lo como um corpo estranho - De Anderer, \"o outro\" - que desperta fantasmas adormecidos e esqueletos no armário, e acabam por proceder ao seu linchamento matando-o.Brodeck, um escrivão sobrevivente de um campo de concentração, é incumbido pelas autoridades de escrever um relatório sobre o incidente, em moldes que desresponsabilizem a população interveniente. Enquanto vai escrevendo esse relatório \"oficial\", escreve também um outro, mais secreto, em que não só dá conta do seu passado, como exibe um retrato da aldeia e dos seus habitantes, e expõe as suas próprias reflexões sobre o acontecido e aquilo que ele considera ser a verdade dos factos e das motivações que conduziram ao incidente.O Relatório de Brodeck é um livro soberbo, poderoso e terrivelmente actual, que, com recurso a uma escrita primorosa, nos fala da condição humana e do lado mais negro dos seres humanos, do preconceito, da amoralidade, da falta de empatia, do ódio gratuito, enfim, da desumanidade que neles pode grassar, sobretudo quando estes se podem esquivar à responsabilidade individual, acobertando-se sob o anonimato das massas e dos comportamentos colectivos. Imperdível."}, {"userName": "Bettie☯", "userReviewDate": "Oct 13, 2015", "userURL": "http://www.goodreads.com/user/show/1108123-bettie", "userReview": "Description: Forced into a brutal concentration camp during a great war, Brodeck returns to his village at the war’s end and takes up his old job of writing reports for a governmental bureau. One day a stranger comes to live in the village. His odd manner and habits arouse suspicions: His speech is formal, he takes long, solitary walks, and although he is unfailingly friendly and polite, he reveals nothing about himself. When the stranger produces drawings of the village and its inhabitants that are both unflattering and insightful, the villagers murder him. The authorities who witnessed the killing tell Brodeck to write a report that is essentially a whitewash of the incident.As Brodeck writes the official account, he sets down his version of the truth in a separate, parallel narrative. In measured, evocative prose, he weaves into the story of the stranger his own painful history and the dark secrets the villagers have fiercely kept hidden.Set in an unnamed time and place, Brodeck blends the familiar and unfamiliar, myth and history into a work of extraordinary power and resonance. Opening: My name is Brodeck and I had nothing to do with it.I insist on that. I want everyone to know.I had no part in it, and once I learned what happened, I would have preferred never to have spoken of it again, I would have liked to bind my memory fast and keep it that way, as subdued and still as a weasel in an iron trap.A parable of the illusionary rex flammae papillon.4* Brodeck's Report4* Grey Souls"}, {"userName": "Carmo", "userReviewDate": "Aug 12, 2014", "userURL": "http://www.goodreads.com/user/show/15850971-carmo", "userReview": "Hesitei em escrever alguma coisa sobre este livro. Pensei em dar-lhe 5* e ficar quieta. A razão é simples: com a minha queda para a lamechice corro o risco de dar uma conotação imerecida ao livro.Não me prendeu logo nas primeiras páginas, levei algum tempo a entrar na história e nas personagens, na verdade achei até um pouco confuso ao início.Porém aos poucos…...sabem como é estar a chapinhar na praia nos dias de mar calmo, quando repentinamente vem uma onda maior que vos apanha de surpresa e vos deita abaixo, vos arrasta pela areia e só vos resta esperar que recue para poderem levantar-se de novo? É o que acontece quando se lê Philippe Claudel.Não li a sinopse do livro, gosto de começar as leituras “às escuras” e deixar que a história me vá guiando, o que me levou à asneira de andar a pesquisar nomes de montes e regiões – aparentemente numa região nórdica – para vir a perceber que o local e a data dos acontecimentos são indeterminados. Adiante, que isso é o que menos importa, o homem é semelhante em toda a parte; tanto pode ser bom e generoso, como alimentar-se de um ódio profundo cujas raízes se desconhecem, cultivar o medo e a violência que se vai multiplicando e alimentando dela própria. Foi o que aconteceu naquela aldeia remota. O ódio gratuito, e os atos violentos são terreno fértil para a vingança. O protagonista, Brodeck, consigiu libertar-se dessa espiral e focar-se no essencial: no silêncio de um amor intenso, no riso da inocência, na segurança de uma mão sempre estendida e encontrada.Num ambiente paradisíaco são relatadas as maiores barbaridades que o ser humano pode cometer sobre o seu semelhante. Como consegue viver consigo mesmo é um mistério.Termina com uma mensagem de esperança e a certeza de que o nosso lugar no mundo pode ser em qualquer parte. A nossa casa, será sempre onde estiverem as pessoas que amamos."}, {"userName": "Azumi", "userReviewDate": "Mar 22, 2018", "userURL": "http://www.goodreads.com/user/show/14024451-azumi", "userReview": "Me ha hecho sufrir mucho, he sufrido por el Anderer, por la yegua y el asno, por Brodeck y su familia. Es una historia dolorosa y triste y da que pensar.Ilustra perfectamente lo que el hombre es capaz de hacer por miedo.Claudel se va a mi lista de favoritos a la de ya."}, {"userName": "Proustitute", "userReviewDate": "May 13, 2003", "userURL": "http://www.goodreads.com/user/show/33214699-proustitute", "userReview": "I am Brodeck, and I had nothing to do with it.\nSo begins Philippe Claudel's brilliant novel about xenophobia, narrated by the eponymous Brodeck. Of an ambiguous national identity, living in an unspecified country just on the heels of World War II, Brodeck is the outsider par excellence: a man who has spent time in the concentration camps to return home to the same villagers to find their attitudes toward him altered, his position always uncertain and unclear. This is also underscored by his changed familial relations upon returning from the camps.Brodeck begins post de facto: The \"it\" with which Brodeck claims emphatically that he has had nothing to do only becomes clear by the end of the text. An incident has occurred, and the villagers have unanimously enlisted Brodeck to write a report of the events leading up to it, an act of rhetorical self-defense for the village. The collective guilt and shame the villagers feel to make such a report necessary are juxtaposed in liquid prose with Brodeck's own individualized feelings of guilt and shame, a \"conflict between knowledge and ignorance, between solitude and numbers.\"As he undertakes to write this report (\"a cross which was not made for my shoulders and which didn't concern me\"), Claudel allows Brodeck to tap into questions of reality versus fiction, what makes something true or false (depending on the amount of people who claim something is true despite it being far from it), and also a kind of Freudian analysis of group psychology: the group's word is gospel, and Brodeck is being forced to write for a group of which he is not truly a part. How can a person speak for another, or for a group of others, when one's subjective truth is at variance with the account expected of those who hold and wield power?I thought about History, capitalized, and about my history, our history. Do those who write the first know anything about the second? Why do some people retain in their memory what others have forgotten or never seen? Which is right: he who can't reconcile himself to leaving the past in obscurity, or he who thrusts into darkness everything that doesn't suit him? Brodeck's work on the report dredges up memories of his past—not only are we privy to his pre-war memories, but we also experience along with him a resurgence of violence as his horrific piecing together of events at the camp which cause him to realize that he has been lying to himself: \"of all dangers, memory's one of the most terrible.\" As such, we see made manifest the latent and repressed content of an individual's life, brought to the level of consciousness, a task that is related to his vocation as a writer and one that requires Brodeck's narrative to follow no logical in the way of temporality, but one that also involved a kind of subterfuge (even from oneself):I keep going backward and forward, jumping over time like a hurdle, getting lost on tangents, and maybe even, without wishing to, concealing what's essential.While Brodeck becomes more conscious of his own life narrative, and his complicity, this is a self-awareness that Claudel develops alongside a group of others who are asking him to do the exact opposite—namely, to repress, to document falsities, to erase, to render into nothingness. Claudel's prose is fluid, brisk, and lucid as he allows the reader, by way of Brodeck, to experience revelation and annihilation, individual growth and group oppression:I think we've become, and will remain until the day we die, the memory of humanity destroyed. We're wounds that will never heal.I cannot recommend this book highly enough: it will stay with you long after you've finished journeying along with Brodeck, haunting you, making you ponder the nature of subjective truth as unwaveringly and as bravely as Brodeck does here, reconciling the horrific with the sublime: \"Sometimes you love your own scars.\""}, {"userName": "Philippe", "userReviewDate": "Mar 26, 2011", "userURL": "http://www.goodreads.com/user/show/4903281-philippe", "userReview": "Given the profusion of five star reviews, it seems I'm one of the very few people who have not fallen under the spell of Claudel's 'Brodeck'. Indeed, it seems to me Claudel set himself a hugely ambitious task in which he more or less failed.One element of that ambition is to want to write a book on the Holocaust which is, I think, always a very tricky proposition. Because how to speak of it without becoming crude or corny? How to cast a fresh light on this darkest of episodes? A tremendous amount has been told and shown about the Shoah. By now we - as citizens of the 21st century - have an inkling of the abysmal atrocities that have been committed. And looking at what has been happening for years in the Sudan, the Congo, and other places on this tormented planet one might indeed say that cold-blooded extermination is not a thing of the past.It seems to me Claudel uses Brodeck's camp experience and the war as a pretext to make his point that humans are a beastly species, governed by cowardice and fear. The worldview in 'Brodeck' is clad in a uniform dark grey. There is no innocence and heroism in his world. It's nowhere to be found. Even 'dog Brodeck' can't be absolved. Literally everyone is soiled. We all know it, so we might as well forget about it. Frankly, that's a crude message I'm not able to buy into. There are many important questions swirling around this moral indictment that Claudel evades or dismisses with an irritating sleight of hand.The other element where Claudel overstretches is in his literary approach. This is not a novel, but an allegory. There are no genuine human beings in this tale, but all characters, including most conspicuously the 'Anderer', stand for some kind of archetype. Their emotional and behavioral bandwith is very limited.It's obvious Claudel wanted to adapt his writing style to the exigencies of the genre: his language is rather plain, stilted almost; the book has more or less the same rhythm throughout; the metaphors and similes refer to very earthy, natural phenomena. It's almost like looking at a woodcut or one of those traditional papercuts ('scherenschnitte'). I think as a writer you are making your life very difficult by wanting to keep this interesting and lively for over 300 pages. At a certain point in time it tilts towards the sentimental.This combination of sentimentality on the one hand and crudeness on the other is what gave me such a hard time when reading the book. I'd recommend Ernst Juenger's On the Marble Cliffs as an alternative: another dark and violent allegory on the rise of brutal nazism, but more subtle and as a result more powerful."}, {"userName": "Carla", "userReviewDate": "Apr 08, 2014", "userURL": "http://www.goodreads.com/user/show/2007205-carla", "userReview": "Doloroso. Belo. Perfeito.Nem uma palavra sublinhada ao longo de todo o livro (não há frase que não mereça essa \"honra\"). É impossível olhar o mundo com os mesmos olhos depois deste livro.É ainda com o coração alvoroçado que assumo que a culpa é toda minha. Eu é que quis (muito) ler este livro."}, {"userName": "Teresa Proença", "userReviewDate": "Nov 22, 2011", "userURL": "http://www.goodreads.com/user/show/6923777-teresa-proen-a", "userReview": "“Acreditas realmente que os sonhos sejam mais preciosos do que a vida?”"}, {"userName": "Carla Soares", "userReviewDate": "Aug 11, 2015", "userURL": "http://www.goodreads.com/user/show/2184588-carla-soares", "userReview": "Brodeck, o escrivão, é encarregue de escrever um relatório terrível - o de um crime cometido pelo conjunto dos homens da aldeia. Ele não participou e sente, desde o início, que o relatório é uma rede para prendê-lo, mas não tem como recusar. Ao mesmo tempo, vai redigindo outro texto, o do livro que lemos, que nos vai revelando, em avanços e recuos, a sua história, a sua passagem pelo campo de concentração (certos excertos tiraram-me a respiração e são os meus favoritos), a história recente da aldeia, a da chegada do Anderer, o homem assassinado, e do como se foi construindo a situação que leva ao crime. Deste livro, muitíssimo bem escrito, tiro sobretudo a lição do medo. Não tanto o medo no campo de concentração, esse que leva um homem a morrer de pé, após uma só palavra proferida, o mesmo que se deixa entranhar do instinto de sobrevivência e cria o Cão Brodeck. Esse é terrível, mas expectável, Calo-me. Leiam. É na aldeia que ele me impressiona. Nada já os ameaça, os soldados partiram, a guerra terminou, e no entanto os tentáculos do medo continuam a prender os aldeãos. Esse pavor é uma coisa calada e insidiosa, invisível, mas cria ódios e desconfianças, deforma as mentes e os corações, deturpa a percepção dos actos próprios e alheios, eclipsa a moral, conduz os passos de todos até ao crime. Nós, os leitores, não o recebemos todo de uma assentada, mas vemo-lo com cada vez maior clareza, conforme Brodeck vai desenrolando o seu relatório pessoal, aquele que a aldeia não pode conhecer.É excelente, este livro.Um nadinha mais em: http://monsterblues-cms.blogspot.pt/2..."}, {"userName": "Hameed Younis", "userReviewDate": "May 17, 2018", "userURL": "http://www.goodreads.com/user/show/18612737-hameed-younis", "userReview": "تقرير بروديك، بروديك الكلب، بروديك الشاهد، جميلة جداً وجاءت في وقتها، أجدها أحد الصدف الجميلة التي ألتقط فيها رواية غزيرة ويعجبني معها السرد إلى هذه الدرجةعيبها الوحيد إنها فرنسية، نعم! إنها فرنسية، ولا أعرف لماذا؟ أجد أن الترجمات الفرنسية لا تنقل \"روح\" الكتاب إلى القارئ، لا أقصد أن لطفي السيد قد قصّر في الترجمة على الأطلاق، لكن هناك غشاوة بيني وبين النص منعتني من استساغته برمتهلأجل ذلك فقط أعطيها أربع نجمات لا خمس"}, {"userName": "Aba Mafalba", "userReviewDate": "Nov 17, 2016", "userURL": "http://www.goodreads.com/user/show/32713563-aba-mafalba", "userReview": "«Ο Θεός; Μα, αν λοιπόν υπάρχει, αν υπάρχει πραγματικά, ας κρυφτεί. Ας σκεπάσει με τα δυο Του χέρια το κεφάλι Του κι ας σκύψει. Μπορεί, όπως μας μάθαινε κάποτε ο Πάιπερ, πολλοί άνθρωποι να μην είναι αντάξιοί Του, αλλά σήμερα γνωρίζω επίσης ότι κι Αυτός δεν είναι αντάξιος των περισσότερων, κι αν το δημιούργημα μπόρεσε να γεννήσει τη φρίκη, αυτό οφείλεται αποκλειστικά στο ότι ο Δημιουργός τού σφύριξε τη συνταγή.»"}, {"userName": "Nora|KnyguDama", "userReviewDate": "Feb 15, 2018", "userURL": "http://www.goodreads.com/user/show/24881652-nora-knygudama", "userReview": "Vos paskaičius \"Brodeko\" anotaciją - iškart buvau suintriguota. Knygoje bus liečiamos Antro Pasaulinio karo, holokausto temos. Tiesa - įdomumas tas, kad nė vieno iš šių žodžių, kaip vokiečiai ar žydai - romane nėra. Viską nujauti ir suvoki pats. O šių temų aš savotiškai bijau. Žinot filmus \"Pianistas\", \"Gražus gyvenimas\" ar \"Berniukas dryžuota pižama\"? Nė vieno nesu mačiusi. Kodėl? Ogi todėl, kad kai man apie juos pasakodavo - ašaros upeliais tekėdavo. Tai kas būtų savom akim mačiusi ir dar labiau viską išjautus? Savaites būčiau nemiegojusi, o mintys būtų ramybę pražudžiusios. Bet aš mačiau pusę \"Šindlerio sąrašo\". Taip, tik pusę, nes mano ir taip jautri širdis nepakėlė tų siaubingų įvykių ir žiaurumo. Tikrai buvusio žiaurumo, o ne išgalvoto. Šiek tiek drebančia širdim kibau į \"Brodeką\" ir jau su pirmaisiais puslapiais giliai pasinėriau į jautrią, tylią ir skausmingą Brodeko gyvenimo istoriją.Čia neminimas nei kaimelio kur Brodekas gyvena, nei šalies pavadinimas. Kaimelyje Brodekas gyvena su dukrele Pupkete, žmona Emelija ir aukle Fedorina. Vyras - vienintelis išsimokslinęs žmogus kaime, kuriame gyvena paprasti, didelių vertybių nepuoselėjantys žmonės. Kartą, į jų kaimelį atvyksta pekeleivis, kurio vardo mes taip pat nežinome, o autorius jį vadina ANDERER (vert, Kitas). Ir jis tikrai kitoks - mandagus, protingas, daug šypsosi ir kiaurai permato gyventojų ydas. Pastarieji pradeda jo nemėgti, o gal bijoti ir jį nužudo. Žiauriose žudynėse dalyvauja visi tik ne Brodekas, kuris - savo nelaimei - užeina į smuklę kaip tik tada, kai vyrai ANDERER ir nužudė. Kaimo meras liepia Brodekui parašyti apie tai raportą. Brodekas sutinka, mat su ANDERER jį visgi siejo artimesnis ryšys. Rašydamas raportą, vyras pamažu skaitytoju įsileidžia į savo skaudžią patirtį. Tada mes ir suvokiame, jog vyko karas, o Brodekas buvo ištremtas į stovyklą, kur su juo elgėsi siaubingai. Brodekas buvo priverstas elgtis kaip šuo, miegoti būdoje, dėvėti antkaklį, laižyti prižiūrėtojams batus. Jis matė daug mirties, patyčių, žudynių ir apie tai itin jautriai mums pasakoja. Tačiau kartu mes matome koks stiprus ir protingas Brodekas - kaip atsitiesia po gniuždančios patirties, kaip meilė žmonai jį ne kartą išgelbėja, koks tapo jo požiūris į žmoniją po siaubingų karo padarinių.Tai neįtikėtinai emociškai stipri knyga. Brodekas pasakoja apie širdį veriančius dalykus su tokia ramybe, jog skaitant įsivaizdavau jį juos šnibždant. Jis neatpasakoja patirto siaubo kaip dramatiškų išgyvenimų, nenaudoja pompastiškų žodžių. Kalba apie tai kaip tiesiog apie savo gyvenimo etapą. Ta ramybė kartu ir keista, ir trikdanti ir ašarą spaudžianti. Ne kartą skaitydama apsiašarojau, mat knygą skaičiau itin susikaupusi , viską dėjausi širdin. Knygos rašymo stilius - vienas ypatingiausių romanų dalykų. Praeitis su dabartimi pinasi nejučia, kartas nuo karto įterpiami kitos kalbos žodžiai jų nė neverčiant. Skaitytojas pats turi rasti raktus į nežinomo kaimelio pasaulį. \"Brodekas\" man paliko labai stiprų įspūdį. Nujaučiu, jog knyga turi ne vieną paslėptą reikšmę, tad žinau, jog ją skaitysiu dar ne kartą ir atrasiu vis naujų minčių. Tai labai stiprus, intelektualus ir jautrus romanas skirtas skaitytojams ieškantiems kitokių knygų. Tai žvilgsnis į žiaurią pasaulio istoriją kitu kampu."}, {"userName": "Tânia Tanocas", "userReviewDate": "Mar 02, 2018", "userURL": "http://www.goodreads.com/user/show/27129200-t-nia-tanocas", "userReview": "\"Chamo-me Brodeck e não tive culpa de nada. O meu nome é Brodeck. Brodeck. Por favor, lembrem-se. Brodeck.\"Brodeck, certamente ficará na minha memória, não porque ele implora ou se justifica, muito menos por piedade, mas porque realmente ele merece jamais ser esquecido. É complicado escrever sobre este livro, acho que nada conseguirá fazer justiça ao seu conteúdo. Só lendo \"O Relatório de Brodeck\" teremos realmente a noção de que este é mais um livro (injustamente) perdido, sem lhe darem o devido valor...Opinião completa em breve... :)"}, {"userName": "Marc", "userReviewDate": "Jan 22, 2018", "userURL": "http://www.goodreads.com/user/show/2876105-marc", "userReview": "Formally, this book is a report, which is also the title of the novel, and it is also the task that the main character Brodeck receives from his fellow villagers: make a report of what has happened here, so that we have a chance at forgiveness. Also the opening words of the book, \"my name is Brodeck and I have nothing to do with it. I have not done anything\", suggest that something bad has happened. And soon we know that it is a murder, a murder committed by several perpetrators, on an exotic looking stranger who came into the mountain village, but who never said his name and is therefore called Anderer (the Other).But Brodeck does not make a report, he actually writes a confession. And with that, this book puts itself in the tradition of Italo Svevo (\"The confessions of Zeno\"), Max Frisch (\"Stiller\") and also Albert Camus (\"l'Etranger\"). Claudel has made an ingenious construction of this confession, with constant jumps in time and only piece meal more information. The whole also bathes in a somewhat dreamy, fairytale atmosphere, with vague (German-french) place names, and with a main figure - Brodeck - whose identity is also very vague, just like that of the Anderer. That style and way of writing is also very reminiscent of \"The Castle\" by Franz Kafka (perhaps not accidentally the innkeeper of the village is called Schloss). And the feeling of oppression that is so specific to the Kafka novel, is reinforced by Claudel with constant references to what cannot be interpreted differently as references to the Nazis, the Second World War and the Holocaust.In short, Claudel has made an intriguing cocktail of this novel. But, I'm very sorry, the mix did not work for me. At no time did I really fall under the spell of the story, I was constantly wondering what Claudel was actually aiming at with Brodeck. This is clearly NOT a book about the Holocaust (as so many reviewer seem to see); the so-called holocaust memories of Brodeck are completely distorted (in the camp, for example, he was chained, and he had to walk around with his boss like a dog). So, perhaps this is rather a book about evil in humans, and especially the xenophobia (both Brodeck and the Anderer are intruders in the remote mountain village). Certain passages clearly indicate that Claudel particularly wanted to point at the beast that sits in each of us, because in his confession Brodeck depicts himself as at least as guilty as his fellow villagers-murderers and camp guardsmen-executioners. And in that sense, I must say: the reference to the Holocaust seems a very bad choice by Claudel, suggesting the victims were at least as guilty as the perpetrators. This book is an intriguing read, but no, it did not convince me. I think Claudel has aimed too high and his vague, dreamy, oppressive narrative style enervated me by its rather cheap effect. I have to say that I find \"Le roi des Aulnes (The Ogre)\" by Michel Tournier, - also a very strange novel, a much more captivating book."}, {"userName": "Ana Lúcia", "userReviewDate": "Nov 08, 2014", "userURL": "http://www.goodreads.com/user/show/21720745-ana-l-cia", "userReview": "Inexplicavelmente, algumas vezes, sabemos que vamos amar um livro, mesmo antes de o ler.Este é um destes livros…Acabei de o ler ontem à noite e ainda sinto a alma e o coração atordoados.Nada me poderia ter preparado para tamanho abanão emocional e deslumbramento.Nada do que possa escrever fará justiça a tamanha perfeição."}, {"userName": "Victoria Mars", "userReviewDate": "Mar 10, 2018", "userURL": "http://www.goodreads.com/user/show/3999864-victoria-mars", "userReview": "Primero que todo, este libro hay que leerlo muchas veces. Tantas como sea necesario. No olvidar.Segundo, hace tiempo que no leía un libro en donde cada dos o tres página debía tomar distancia, respirar hondo y mentalizarme para seguir leyendo. Quizá por eso me costó casi dos años en acabarlo. Tercero, Claudel, te amo.Aquí, si para la mayoría, Dios es un ser lejano que vive en los libros y entre el incienso, el Diablo es un vecino al que muchos creen haber visto un día u otro.No creo que los sueños anuncien nada, como aseguran algunos. Pero pienso que llegan en el momento justo y, en el secreto de la noche, nos dicen lo que quizá no nos atrevamos a confesarnos a la luz del día. PD: Quedé pegada en el techo con la historia de Bilissi. Tendré pesadillas seguro."}, {"userName": "AdiTurbo", "userReviewDate": "Jun 04, 2017", "userURL": "http://www.goodreads.com/user/show/2199883-aditurbo", "userReview": "Fiction about the Holocaust is problematic, but this novel proves that there is room for it, if it's done right. This is no pointless tear-jerker, sentimentalist bestseller like the ones we've recently seen (The Nightingale, All the Light we Cannot See, etc.). It is a highly sophisticated piece of writing that aims to give you the full scope of the horror. The evil lurking behind everyday living, apparent normality and what looks like normative human beings. As in the Picture of Dorian Grey, here, too, you gradually find out the immensity of the moral depravity. Little by little, Claudel reveals the terrible things people are capable of inflicting on their kind, what they look like from the inside, as opposed to the pastoral and beautiful external appearances. Never have I felt more the depth and truth in Holocaust survivor and writer Yehiel Di-Nur's famous sentence, \"The Holocaust is another planet.\" Claudel clearly wishes us to experience this in full, never giving us any details that we don't have to know. We never know where exactly the story takes place. All place and time details are only hinted at. Even the protagonist, Brodeck's, neighbors treat what happened to him in the concentration camp he was sent to as if it happened on a different world, though it happened not that far from their doorsteps. Claudel shows us how on the one hand, they want to understand what happened in their village better, asking Brodeck to collect information and write a report about it. But on the other hand, they manage to continue living their lives only with the help of almost all of the psychological defense mechanisms available, such as denial, repression, rationalization, social comparison, distancing, to acting out - a mechanism which causes them to commit a most heinous crime against an innocent man.This novel is so intense, that I had to take a few breaks from it now and then and come up for air. It wasn't easy to get into, but once I did, I realized it was unique and important. I'm so glad I've read it."}, {"userName": "Karine", "userReviewDate": "Sep 07, 2012", "userURL": "http://www.goodreads.com/user/show/5606454-karine", "userReview": "Ik sla al heel lang voor menigtes op de vlucht. Ik ontloop ze. Ik weet dat ze de oorsprong zijn van alles, of bijna alles. Je kunt jezelf altijd wijsmaken dat het de schuld is van degene die de menigte opjut, meesleept, laat dansen als een hazelworm om een stok, en dat de menigte zelf geen weet heeft van haar daden, haar toekomst en haar pad. Maar zo is het niet. In werkelijkheid is de menigte zelf het monster. (p181)"}, {"userName": "Gala", "userReviewDate": "Feb 26, 2017", "userURL": "http://www.goodreads.com/user/show/18070164-gala", "userReview": "Podés leer esta y otras reseñas también en mi blog: http://ceresplaneta.blogspot.com.ar/2...Un visitante inesperado llega al pueblo: el Anderer, como los llaman los habitantes, que se podría traducir como “el Otro”. El nudo de la cuestión empieza cuando el Anderer es asesinado y todos los lugareños se hacen cargo del crimen. El alcalde del pueblo le encarga a Brodeck, el protagonista, redactar un informe contando lo sucedido. Este trabajo lo obligará a hablar con los autores del crimen, llevando que él se interrogue a sí mismo sobre distintas cuestiones que requieren una profunda reflexión. “Acabo de releer mi historia desde el principio. No me refiero al informe oficial, sino a esta confesión. Le falta orden. No ceso de divagar. Pero no tengo por qué justificarme. Las palabras acuden a mi cabeza como las limaduras de hierro a un imán, y las vierto en la hoja sin preocuparme por nada. Si esta historia se parece a un cuerpo monstruoso, se debe a que es la imagen de mi vida, que va a la deriva, que no he podido encauzar”. Este es el agudo análisis que hace el protagonista de su narración en la página 179, y también es el que uno puede llegar a pensar cuando lee una novela tan particular como El informe de Brodeck. Hay novelas que, por su trama, el estilo del autor o por los propios gustos del lector, permiten que uno se meta de lleno en ellas desde la primera páginas. Otras, en cambio, requieren de paciencia, de leer un tramo inicial en el que se introduzca más la trama, y a partir de ahí sí, compenetrarse más con ella y poder disfrutarla más y mejor. Este es el caso de la novela de Claudel. Las primeras 80 páginas, aproximadamente, son bastante pesadas; no por el hecho de que lo narrado no sea interesante, sino porque el autor plantea las situaciones de manera que es difícil seguirle el hilo. Al narrador, Brodeck, le encargan redactar un informe que narre las situaciones del asesinato del Anderer. Sin embargo, y por su interés por las letras, decide hacer, aparte del encargo oficial, un escrito que sirve como suerte de catarsis, o de confesión, como él mismo lo dice. Entonces, Brodeck va narrando toda su vida, su infancia, su experiencia en un campo de concentración, su relación con Emelia y Fedorine, su vida en el pueblo, las personas que allí viven, etc. Así, la narración no duda a la hora de alterar la cronología, de saltar temporalmente en relación a sucesos antes y después del crimen. De ahí que Brodeck llame a su historia un “cuerpo monstruoso”. Philippe Claudel parece conocer muy bien la condición humana. En la novela, a partir de un hecho central, que podría ser el asesinato del Anderer, se disparan muchas cuestiones sobre las que Brodeck reflexiona e incorpora a su escrito. Otro de los factores que hace que en un principio sea complicado engancharse bien a la historia es que el narrador nunca sitúa al lector en tiempo y espacio. No se sabe en qué lugar ocurren los hechos, ni en qué época. Sin embargo, esto no significa que la historia se desarrolle en un espacio lejano a nuestra cultura o a nuestra sociedad. En El informe de Brodeck se ven todas las desgracias y miserias del hombre: guerras, violencia, conflictos de intereses, egoísmo, tiranía, xenofobia, etc. Es una suerte de metáfora para mostrar que, más allá del lugar, tiempo o espacio en el que sucedan las cosas, siempre que haya hombres, muchas cuestiones se repiten (y sobre todo las malas), por el solo hecho de que el que el autor de las mismas es el propio ser humano. En la contratapa de la novela, France Inter manifiesta que El informe de Brodeck es “Una gran novela épica y contemporánea sobre la inhumanidad”. En la contratapa de la novela, France Inter manifiesta que El informe de Brodeck es “Una gran novela épica y contemporánea sobre la inhumanidad”. En la novela, Brodeck cuenta bastante sobre las miserias que vivió en su estadía en el campo. Eso podría ser el exponente principal de la inhumanidad, pero somos los propios humanos los que lideramos esas cosas, por lo que en cierto sentido lo inhumano también forma parte de nuestra propia humanidad. De esta forma, también podríamos considerar a El informe de Brodeck como una novela no solamente sobre la inhumanidad, sino sobre la propia humanidad. Si una novela dispara estas reflexiones, entonces ya de por sí vale muchísimo, más allá de que tenga algún que otro punto flojo, como podría serlo, por ejemplo, el inicio. Para que la novela vaya ganando ritmo, a medida que también uno va entendiendo más las cosas que suceden, la prosa del autor juega un rol muy importante. Es una narración muy clara, pero tiene algunos tintes poéticos que le dan un salto de calidad, algo por lo que distinguirse. El autor recurre, no siempre, a las metáforas para ilustrar algunas situaciones o condiciones de las cosas, como en el caso del “cuerpo monstruoso” refiriéndose al escrito de Brodeck. El hecho de que la metáfora se utilice en contadas ocasiones es una buena decisión por parte del autor, porque cuando se utilizan excesivamente, se corre el riesgo de que la narracón empiece a resultar cansina y exagerada. Sin embargo, Claudel dosifica su uso a la perfección, de tal forma de que su prosa resulte clara y directa, pero a la vez poética y elegante. A medida que avanza El informe de Brodeck, la cuestión del crimen del Anderer deja de hacerse eje principal de la novela, siendo reemplazado por la cantidad (y calidad) de reflexiones a las que llega el narrador. Lo interesante que estas tienen es que también alientan a que sea el propio lector el que empiece a cuestionárselas. Más allá de que las primeras páginas resulten un poco densas, con el correr de las páginas, el autor consigue construir una ambientación propicia para que se desarrollen los hechos más importantes de la novela. Una historia muy particular que, aunque en un principio puede parecer poco atrayente, esconde una profundidad pocas veces vista."}, {"userName": "Ahmed EL-komy", "userReviewDate": "Mar 27, 2017", "userURL": "http://www.goodreads.com/user/show/16751183-ahmed-el-komy", "userReview": "كانت جيدة هذه الرواية ، ولكنها أرهقتنى كثيراً .. القصة والحبكة الدرامية جيدة ولكن طريقة السرد كانت مُربكة بعض الشئ بالإضافة إلى غموض الشخصيات، هناك شخصيات لم تأخذ حقها أبداً فى السرد والوصف .. كذلك قلة المعلومات عن الفترة التاريخية التى تتحدث عنها الرواية .. فى المجمل كانت أقل من توقعاتى كثيراً .."}, {"userName": "Dovilė", "userReviewDate": "Mar 10, 2018", "userURL": "http://www.goodreads.com/user/show/3786153-dovil", "userReview": "Vis tie lūkesčiai. https://perskaiciau.wordpress.com/2018/03/10/9-11-philippe-claudel-brodekas/"}, {"userName": "João Carlos", "userReviewDate": "Feb 21, 2013", "userURL": "http://www.goodreads.com/user/show/17544299-jo-o-carlos", "userReview": "Há livros que nos atropelam e destroem as nossas convicções. Não sei se os devemos ler.."}, {"userName": "رغد قاسم", "userReviewDate": "Dec 21, 2017", "userURL": "http://www.goodreads.com/user/show/14226705", "userReview": "رواية رائعة وبعمق فلسفي بعيد شكري للصديق أحمد سامي الذي قدم لنا قراءة رائعة حول الرواية، و حفزنا للاطلاع عليها."}, {"userName": "Racheli Zusiman", "userReviewDate": "May 16, 2018", "userURL": "http://www.goodreads.com/user/show/30958385-racheli-zusiman", "userReview": "אני מאוד אוהבת לקרוא ספרים שהייתי מגדירה אותם כ-מדויקים: ספרים שניכר שיש בהם מחשבה מאחורי כל מילה, וכל מילה נכתבה על מנת לשרת את המסר של הסופר; ספרים מלאי הטרמות, שמהבהבות בשולי הראייה והמחשבה במהלך הקריאה ורומזות לעתיד לבוא בספר. הספר הזה הוא בדיוק כזה. ספר מטלטל, מצמרר. הקריאה שלי היא מהירה, אבל הפעם היה לי חשוב לחזור כל הזמן ולקרוא כל משפט שוב ושוב בעיון. ספר טרגי, שהאימה בו מתגלגלת ומתפתחת לאיטה, תוך כדי שהיא תופסת אותך בגרון, טיפין טיפין. מבחינתי - ספר חובה. הוא השאיר עליי רושם עצום.קיטלגתי את הספר הזה על מדף ספרי השואה ומלחמת העולם השנייה, אבל למעשה אלו לא מוזכרות בו באופן מפורש, אלא רק נרמזות, מה שגורם לספר הזה להיות מעבר לזמן ולמקום, ובעל חשיבות אוניברסלית."}, {"userName": "Helen", "userReviewDate": "Oct 06, 2009", "userURL": "http://www.goodreads.com/user/show/2429268-helen", "userReview": "The power of this book--and it is very powerful--lies in the use of unexpected words to describe a time, and events, that are terribly familiar to us. World War II, Germany, Eastern Europe, the Holocaust--they are recent history, and every schoolchild knows what happened in that place, in that time. You will not find any of these names in this beautifully written poem of a book. The magic lies in the way Mr. Claudel finds new language to describe who and what he is talking about. Every time a figure or event from this well-traveled landscape of history arrives, it strikes at the heart all over again, as if you've never heard it before.In a small town in a nameless country, a stranger has been murdered by a mob consisting of every man in the village. The stranger is known only as the Anderer, the Other. Brodeck, a man who has recently returned from a place that sounds very much like a concentration camp, is ordered to write an official report of what happened. As Brodeck investigates the murder, we learn the tragedy of his own history, the awful secret of why he was sent to the camp, and the horror of what individuals are capable of doing once they combine into a faceless mob."}, {"userName": "Roger Brunyate", "userReviewDate": "May 08, 2016", "userURL": "http://www.goodreads.com/user/show/42294189-roger-brunyate", "userReview": "The StrangerImagine a region on the border between two powers, its nominal sovereignty shuffled between them with the ebb and flow of history. Imagine a place whose personal and place names belong to one country, but whose official language is that of the other, and whose local dialect is a hybrid known only to its inhabitants. Imagine a land of mountains and forests, where individual villages are isolated \"like eggs in nests,\" and where even somebody arriving from three hours' walk away will seem a stranger. Philippe Claudel was born in Lorraine, parts of which have shifted between France and Germany, but the setting of his novel is left deliberately vague. The country borders on Germany, of that there is no doubt, but the mountains seem a lot higher than the Vosges, and the isolation is more complete.I read the book in French (as Le rapport de Brodeck), to find that Claudel does something similar with language. The French (sometimes elevated, sometimes down to earth, always brilliant) is sewn with numerous German words in italics. But they are German with a French accent, German in a dialect, words which may mean one thing but suggest others. The word for their neighbors over the border, for instance: Fratergekeime, with its suggestion of both brother and stranger. Added to the mostly-Germanic proper names and the vagueness about place and time, Claudel creates a kind of fog with his writing, despite the clarity of his actual descriptions. It made a doubly interesting experience for me, to add that extra layer of a foreign language not my own to a book where foreignness is a major subject.For Claudel's fog parallels a moral miasma, where nothing is as it seems. There is absolute evil, certainly, and at least one radiant touch of absolute good, but for the most part the moral lines are not so clearly drawn. Brodeck, who admits to being a nobody, stumbles into the village inn to find all the men of the village there, following the murder of a visitor from outside, a man known only as the Anderer (the Other). This stranger, oddly dressed, smiling but saying little, came to them three months earlier, riding a horse and leading a donkey, and has stayed to make sketches of people and places around the village. We know nothing else about him, and only gradually realize that he is dead. Brodeck, who has had some university education, is asked to write a report that will exculpate them all for their actions. As the period appears to be just after the Second World War, there are obviously many reasons why the villagers might decide to take justice into their own hands. Brodeck writes his report at the behest of the mayor, a huge pig-farmer named Orschwir, but he feels increasingly uneasy in doing so, and simultaneously tells his own story in a separate document.Brodeck apologizes for telling his story out of sequence, but really this is one of Claudel's greatest technical achievements. It soon becomes clear that we are dealing with a Holocaust narrative, and that Brodeck is one of the very few who have survived the camp and returned. The horror is simply there as a fact, a touchstone of absolute evil among so much moral uncertainty. Much as Styron did in Sophie's Choice, Claudel takes us there, then pulls away, only to return with further details later. So Brodeck's story is layered like sheets of paper cut up and folded together. It is also compressed in time; we recognize the events, but they do not fit the normal timeline. Similarly, Claudel avoids any facile type-casting. Brodeck, for instance, might be Jewish, but he might equally be Romany; at any rate, he was brought to the village as an orphan child, a stranger from far away. And the confused nationality of the villagers themselves also precludes easy classification, as friends, collaborators, or even enemies.Claudel has a way of introducing major plot points in almost casual throwaways, but with each revelation we learn more about the other people in the story, whether these be Brodeck's immediate family (his wife Emélia, his infant daughter Poupchette—an especially tender creation—or his adopted mother Fédorine) or the various inhabitants of the village. One by one, we meet the drunken priest, the old schoolmaster, the frightened innkeeper, the nosy neighbor Göbbler (another wonderfully evocative name), and many others. We also get many different views of the Anderer, who says little but seems to have the power to reflect each person's character back on themselves, like a mirror. The curious thing is that the more we see the villagers as individuals, the more they seem to coalesce into a group, joining forces against all outsiders. They are shut in as much by the narrowness of their own minds as by their mountains. Much evil in those years was the result of group pathology, yet Claudel also shows us why, in certain circumstances, group solidarity is necessary.Grim though this story is, Claudel lightens it with almost ecstatic descriptions of the mountain countryside. Its harsh facts are offset by rays of unexpected grace, unexplained events, and persistent Biblical overtones. As a novel, it is impossible to pin down, and deliberately so. It is all too easy to take a Holocaust story and tell it in the past; it happened, but it is over, and the people responsible were not ourselves. By refusing to pin people down with places, dates, and nationalities, Claudel avoids the easy distinction of Them and Us, and suggests that something very similar might happen now. Focusing on what happens when the survivors come home is a brave and powerful approach. I can think of only two other examples: \nDawn\n by Elie Wiesel and \nWandering Star\n by JMG LeClézio. Both these authors are winners of the Nobel Prize; from the evidence of this novel, Philippe Claudel might well enter their company."}], "description": "Set in an unnamed time and place, Brodeck blends the familiar and unfamiliar, myth and history into a work of extraordinary power and resonance. Readers of J. M. Coetzee's Disgrace, Bernhard Schlink's The Reader and Kafka will be captivated by Brodeck.Forced into a brutal concentration camp during a great war, Brodeck returns to his village at the war’s end and takes up his old job of writing reports for a governmental bureau. One day a stranger comes to live in the village. His odd manner and habits arouse suspicions: His speech is formal, he takes long, solitary walks, and although he is unfailingly friendly and polite, he reveals nothing about himself. When the stranger produces drawings of the village and its inhabitants that are both unflattering and insightful, the villagers murder him. The authorities who witnessed the killing tell Brodeck to write a report that is essentially a whitewash of the incident. As Brodeck writes the official account, he sets down his version of the truth in a separate, parallel narrative. In measured, evocative prose, he weaves into the story of the stranger his own painful history and the dark secrets the villagers have fiercely kept hidden. Set in an unnamed time and place, Brodeck blends the familiar and unfamiliar, myth and history into a work of extraordinary power and resonance. Readers of J. M. Coetzee’s Disgrace, Bernhard Schlink’s The Reader and Kafka will be captivated by Brodeck.", "title": "Brodeck", "url": "https://www.goodreads.com/book/show/5983996-brodeck", "average": 4.06, "cover": "https://images.gr-assets.com/books/1320521686l/5983996.jpg", "reviews": 340, "authors": [{"url": "https://www.goodreads.com/author/show/45542.Philippe_Claudel", "name": "Philippe Claudel"}, {"url": "https://www.goodreads.com/author/show/8166829.John_Cullen", "name": "John Cullen"}], "type": ["Cultural", "Contemporary", "War", "Roman", "European Literature"], "outlinks": ["http://www.goodreads.com/book/show/5983996-brodeck", "http://www.goodreads.com/book/show/13096584-o-relat-rio-de-brodeck", "http://www.goodreads.com/book/show/30089317", "http://www.goodreads.com/book/show/9760142-il-rapporto", "http://www.goodreads.com/book/show/4025835-brodeck-s-report", "http://www.goodreads.com/book/show/6731958-el-informe-de-brodeck", "http://www.goodreads.com/book/show/22930564", "http://www.goodreads.com/book/show/38446913-brodekas", "http://www.goodreads.com/book/show/4764178-het-verslag-van-brodeck", "http://www.goodreads.com/book/show/35401512", "http://www.goodreads.com/book/show/6479584-le-rapport-de-brodeck", "http://www.goodreads.com/book/show/1071035.La_petite_fille_de_Monsieur_Linh", "http://www.goodreads.com/book/show/119526.Grey_Souls", "http://www.goodreads.com/book/show/13033956-the-investigation", "http://www.goodreads.com/book/show/8547737-alles-waar-ik-spijt-van-heb", "http://www.goodreads.com/book/show/6225338-zonder-mij"]}