{"ratings": 1193, "userreviews": [{"userName": "Elyse", "userReviewDate": "Apr 29, 2018", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "I had no idea what I was in for when Nicole at Bloomsbury Publishing recommended this book to me. I can’t thank her enough. I went in completely blind. Literally seconds ago I read the blurb. I read it twice. Having read the book myself, this ‘blurb’, made me cry. I know it wouldn’t have without reading the book. But given what I just ‘experienced’ those words penetrate so much deeper.Kudos to whomever wrote it...and thank you! Agree- agree- agree with the blurb: it’s “INTENSELY BEAUTIFUL....searingly powerful, tightly constructed”. It’s also exquisitely excruciating painful. It knocked the wind out of me. For a short novel - it packs a DEPTH-PUNCH!! Tears in a scene too! Read the Blurb - No need to repeat what’s already perfectly written. Frances Joseph is “Brother”. His character shows up as a guy to reckoned with at a very young age. I mean this in the best of ways. As first born son - he didn’t just take on the role of adult child - living with his mother and younger brother Michael - he tried to hide his contributions. He was aware of people’s pride. His mother’s in particular. I absolutely fell in love with him right away. He was loyal - but he also ran away - he loved deeply - cared deeply - but not in a sugar- coating style: the opposite. Yet ... we felt him so profoundly. The authors talent shines through his character development. Frances loved his family. He loved his friends - especially his friend Jelly. He loved music - understood old music - ( that heritage of love)....He enjoyed listening to Nina Simone, Otis Redding, and Sam Cooke. Frances had no intention of having poverty define him. He says: “You’ve got to be cooler about things, and not put everything out on your face all the time. You’ve got to carry yourself better and think about your look. Doesn’t matter how poor you are. You can always turn up the edge of a collar to style a bit, little things like that. You can always do things to let the world know you’re not nobody. You never know when your break is coming”. Frances had one of those devastating experiences of just the opposite of the above quote. He says: “We were losers and neighborhood schemers. We were the children of the help, without futures. We were, none of us, what our parents wanted us to be. We were not what any other adults wanted us to be. We were nobodies, or else, somehow, a city. We’re all just dreaming”. We were putty in the hands of younger brother, Michael as the voice for this story. I loved him as much as Frances too. We feel, sense, touch, hear, and smell everything through him. From children playing in the neighborhood, to foods, music, dialogues, strangers, murder, racial and immigrant prejudice, poverty, the police, to all out violence....and devastating loss and sadness. Michael’s storytelling is as personal as personal is. Mrs. Joseph- Mother - brought her sons to Canada - ( the Scarbrough housing complex), leaving her village - Ste.Madeleine in the middle of the island - in Trinidad..........leaving her sister and relatives behind....people she loved...leaving slavery, indenture, murder, disease, dirt pot holes, yet love and beauty too, for a better - safer place with more opportunities. As you read the story - one wonders was the REALLY HARD HARD HARDSHIPS worth it? She never told her family the truth about her life in Canada or that her husband was out of the picture. Even the minor characters are bigger than life - in some cases with only the smallest scenes. - Aisha, Dru, Professor, Aunt Beulah, Jelly....and *Desirea’s*, the Barbershop takes on a character in its own rite.Everything about this book felt authentic to me —-although —- I did ‘question’ one scene. But? Simply questioned it. My final thoughts.......”This book must be read”!!!"}, {"userName": "PattyMacDotComma", "userReviewDate": "Jan 03, 2018", "userURL": "http://www.goodreads.com/user/show/1128612-pattymacdotcomma", "userReview": "4.5★“You’ve got to be cooler about things, and not put everything out on your face all the time. You’ve got to carry yourself better and think about your look. Doesn’t matter how poor you are. You can always turn up the edge of a collar to style a bit, little things like that. You can always do things to let the world know you’re not nobody. You never know when your break is coming.”Brother. Big brother to little brother. This could have been a quote from “Grease”, couldn’t it? But these brothers are immigrants from Trinidad, trying to fit in in Canada, specifically the Park in Scarborough, on the outskirts of Toronto. Multi-cultural doesn’t begin to describe the community here. Nobody belongs. Everybody belongs.Michael tells us his story himself, which makes it very personal and made me feel like apologising for the dreadful treatment so many migrants face.“The world around us was named Scarborough. It had once been called “Scarberia,” a wasteland on the outskirts of a sprawling city. But now, as we were growing up in the early ’80s, in the heated language of a changing nation, we heard it called other names: Scarlem, Scarbistan. We lived in Scarbro, a suburb that had mushroomed up and yellowed, browned, and blackened into life.”We learn right away that something happened to the older brother ten years earlier and that Mother has never really recovered. The story moves back and forth between today and childhood and youth. The boys’ father left the picture early, and Mother is sadly familiar from other migrant stories.“All around us in the Park were mothers who had journeyed far beyond what they knew, who took day courses and worked nights, who dreamed of raising children who might have just a little more than they did, children who might reward sacrifice and redeem a past.”When the boys were still young, she left them home alone with strict instructions while she went to work the night shift. ‘Just answer that front door once. I will string you up by your thumbnails from the ceiling. I will skin you alive and screaming. I will beat you so hard your children will bear scars. Your children’s children will feel!’”They ate their food after she left and then . . . went wandering. Freedom!I know an old Croatian lady where I live in regional Australia, and she tells me proudly how when she was a young refugee widow here, she worked three different cooking jobs to raise her two little girls. She criticises today’s young people for wanting welfare because she got off her backside and managed without it. They are lazy. There are jobs there if they’re willing to work. Sound familiar?But, she left the girls home alone, at night, while she went to work, and when I told her that you’re not allowed to do that today, she basically scoffed. I have a feeling she would do the same thing today despite the law if she were in the same circumstances. I do think that’s a lot of the problem regarding welfare and equality and the common complaint of older people that anyone can get a job if they just try hard enough. Not alone with little kids, you can’t. Mostly, we’re expected to be with our children whenever they aren’t in school or some kind of care. And of course all parents aren’t equally intelligent and resourceful either.But I digress. Francis was the old brother who loved music and hanging out with mates from many countries at Desirea’s, a local barber shop. This reminded me strongly of the classic Jayber Crow, where the men gathered in exactly the same way, to be part of a “family”. The more we think cultures are different, the more they are the same (a slight alteration of the French saying).“Our parents had come from Trinidad and Jamaica and Barbados, from Sri Lanka and Poland and Somalia and Vietnam. They worked s**t jobs, struggled with rent, were chronically tired, and often pushed just as chronically tired notions about identity and respectability. But in Desirea’s, different styles and kinships were possible. You found new language, you caught the gestures, you kept the meanings close as skin.”Mother was told that Desirea’s is where the undesirables and law-breakers hang out and had plenty to say about it.“‘You don’t listen!’ she might shout at us. ‘You all don’t pay attention to what I tell you. You all is HARDEN! Too too HARDEN.’ If we ever hurt ourselves, she would promise to ‘corn our backsides.’ She vowed to whip the life force back into us if ever through sheer foolishness we cut ourselves and shamefully bled our lives away.”Also sound familiar? Parents everywhere swear that if you break your neck on that bike/horse/mountain I’ll KILL you!Unfortunately, Mother was right, and they should have stayed away from Desirea’s. There was one place where they enjoyed some peace and nature, The Rouge. This is a big conservation area, and the boys and even Mother used to wander down the valley to cool off. The boys played and built things with sticks, as kids do. Michael makes a point of saying it’s not David Attenborough country, but it served them well.“The Rouge Valley. It was a wound in the earth. A scar of green running through our neighbourhood, hundreds of feet deep in some places, a glacial valley that existed long before anything called Scarborough.”The story of the boys, Mother, Aisha and the other kids is hauntingly real and the author tells it well. It may not be new, but it sounds personal, sad, and angry.Thanks to NetGalley and Bloomsbury for the preview copy from which I’ve quote so much. It’s well worth reading, and if you want a first-hand opinion, read some reviews by people who have lived there themselves.P.S. To get an idea of the Rouge Valley, see this page (among others). https://en.wikipedia.org/wiki/Rouge_N..."}, {"userName": "Rob", "userReviewDate": "Jul 14, 2017", "userURL": "http://www.goodreads.com/user/show/63483711-rob", "userReview": "I grew up in the neighbourhood this novel is set in, and am also a child of West Indian immigrants, so this book really resonated with me. The familiarity of the settings, along with the realistic story of living in a low-income suburb, made this all too relatable. I particularly identified with Michael, as he navigated violence, and rumours of violence, that ran rampant within this community, while also trying to hold the best interests of his too-hard worked, sometimes absent, mother at heart. Harsh truths are confronted, and issues of masculinity, and prejudice are accurately conveyed. I would definitely recommend this book, and I hope it becomes a staple in Toronto literature."}, {"userName": "Khashayar Mohammadi", "userReviewDate": "Dec 12, 2017", "userURL": "http://www.goodreads.com/user/show/32374363-khashayar-mohammadi", "userReview": "Absolutely blew me away. From the first page I just knew I'd be utterly destroyed by the end. It just takes a while to get used to the sudden jumps in timeline. Chapters have no headings or identifiable differences from one another to mark whether the new chapter exists in the past or present, so one must read a few pages of each chapter to reorient oneself in terms of plot and storyline.ABsolutely incredible. one of my all time canadian favorites. I highly recommend it."}, {"userName": "Sarah", "userReviewDate": "Nov 11, 2017", "userURL": "http://www.goodreads.com/user/show/7477266-sarah", "userReview": "3.5ish/4 stars. I thought that this was quite good. I loved how it focused on not only a family, but a community too. The area where this is set is inhabited by a lot of immigrants from different places and their children. They come from all parts of the world but they all make up one community now. What I loved was that sense of lots of different cultures being integrated into the community. I'm from a rural Irish town so everyone I know here is Irish and there aren't other cultures celebrated around here. I think that's why I loved that aspect so much. A bit I found really beautiful was quite a simple thing; when the family are grieving, dishes are left at their front door for them and Michael mentions how some of the dishes are unfamiliar to him. I just thought that that really reiterated how there were all these different cultures at work in this one community. I also loved that sense of community Chariandy created. It highlighted that it doesn't matter where you're from or what race you are, we are all human, we are all the same and we all deserve to be treated accordingly.I liked the family dynamic that was at play. I thought that it was so authentic, the family and each individual character seemed so real to me. I also really liked the writing and the tone of the book. It was very refreshing and it was felt quite unique. The only problems I had was that it didn't completely reel me in and I just don't think it's will end up being very memorable for me. I would recommend this & I would read more by David Chariandy. * I received a copy from NetGalley in exchange for an honest review."}, {"userName": "Cathy", "userReviewDate": "Feb 11, 2018", "userURL": "http://www.goodreads.com/user/show/7510544-cathy", "userReview": "Brother is an emotional read, not least because, from the outset, the reader has a sense of inevitability that promising lives will be unfulfilled or end tragically. Danger seems always close at hand in the area where the family live. ‘Always, there were stories on TV and in the papers of gangs, killings in bad neighbourhoods, predators roaming close.’ The relationship between the two brothers is beautifully rendered, with Francis acting as protector and guide to his younger brother. There is also a strong sense of the bonds of loyalty to your family, your friends - your 'group', as it were. Ultimately the latter will lead to tragedy.The book evokes a believable picture of the immigrant experience in Canada (and I suspect many other places). It’s a world of poor housing and low level, insecure jobs where multiple jobs may be needed to make ends meet. However, there is comfort to be found in cultural reminders (food, music, etc.) and in community support in times of crisis. ‘To this very day, trays of food will sometimes appear at our front door. A pilau with okra, a stew chicken unmistakably Caribbean.’Like many others, Michael’s and Francis’s mother dreams of a better future for her children, fighting prejudice, social inequality and low expectations. ‘All around us in the Park were mothers who had journeyed far beyond what they knew, who took day courses and worked nights, who dreamed of raising children who might just have a little more than they did, children who might reward sacrifice and redeem a past....Fears were banished by the scents from simmering pots, denigration countered by a freshly laundered tablecloth. History beaten back by the provision of clothes and yearly school supplies. “Examples” were raised.’ Brother – sadly - tells a story that is probably being played out in many of our communities right now. It’s a relatively short book but one that packs an emotional punch. I received an advance reader copy courtesy of NetGalley and publishers, Bloomsbury, in return for an honest and unbiased review."}, {"userName": "Leah", "userReviewDate": "Apr 09, 2018", "userURL": "http://www.goodreads.com/user/show/17629329-leah", "userReview": "The failure of the dream...A young man goes to meet an old friend who is returning to visit the neighbourhood where she grew up and he still lives. Aisha's visit prompts Michael to think back to his childhood and teen years in the 1980s, when he and his older brother Francis were being brought up by their mother, an immigrant to Canada from Trinidad whose husband had deserted her when the boys were young. She is strict with the boys, with the usual immigrant dream that they will make successful lives in this society that is new to her. But she has to struggle hard to make ends meet, working several jobs, often having to leave the boys alone and usually exhausted when she finally gets home. So the boys, good at heart, have too many opportunities to drift into the 'wrong' crowd. When they are caught up in an incident of street violence, it begins a chain of events that will ultimately lead to tragedy.This is a short book with no unnecessary padding, and its brevity makes it all the more powerful. It's a story of how the immigrant dream can go wrong, but it's not overtly hammering polemics at the reader nor too heavily making a 'point'. I found it eye-opening, though, because I'd never really thought of Canada as having the kind of immigrant neighbourhoods described so vividly in the book.\nSome of our neighbours have memories of the events that began with the shootings that hot summer. But new people are always arriving in the Park. And they often come under challenging circumstances, from the Caribbean, from South Asia and Africa and the Middle East, from places like Jaffna and Mogadishu. For these newer neighbours, there is always a story connected to Mother and me, a story made all the more frightening through each inventive retelling among neighbours. It is a story, effectively vague, of a young man deeply “troubled” and of a younger brother carrying “history,” and of a mother showing now the creep of “madness.”\nChariandy brings the neighbourhood of Scarborough to life, showing it as a place where a constant influx of immigrants from different countries around the world first settle when they arrive in Canada, seeing their life there as a stage on the road to either them or their children one day making it in their new world and moving on to more desirable areas. The city of which the neighbourhood is a suburb is, I think, Toronto, but really it could be any big city, in almost any Western country. There is poverty here, both financial and of expectations, and there's the violence and insecurity that usually goes with that; and the exploitation of these incomers as a ready supply of cheap and disposable labour by unscrupulous employers. But Chariandy also shows the kindness that can exist among people when they all face the same problems and share the same dreams. I found the portrait of the neighbourhood utterly believable, drawn without the exaggerated over-dramatisation that often infests books about the failure of the immigrant dream, making them feel like an unnuanced and often unfair condemnation of the host nation. Although this book centres on a tragedy, Chariandy also allows the reader to see hope – to believe that for some, the dream is indeed possible to attain; and this has a double effect – it stops the book from presenting a picture of unrelenting despair, and it makes the events even more tragic because they don't feel as if they were inevitable.There's also a short section of the boys and their mother visiting Trinidad – her home, but a new country to them, full of relatives they've never met and a lifestyle that is as foreign to them as Canada is to their mother. Again beautifully done, Chariandy shows the freshness of the immigrant dream through the eyes of the Trinidadian relatives, who assume that the mother's life in Canada is one of comfort and ease in comparison to their own, while the reader has seen the reality of constant days of struggle, hard, poorly-paid work and exhaustion.\nWe brushed our teeth at a pipe outdoors that offered only cold water. And trying to pee one last time before bed, I stepped on something hard but moving, an insect, prehistoric big it seemed to me, that clicked angrily and flapped away.Francis and I lay down on our mat, but when the lights were turned off, we couldn't sleep. Wild creatures called in the dark, and the air was filled with the hum of insects, louder than any traffic we heard at home. The living room window framed a full moon that shone like a cool white sun, and billions of stars, a universe we had never even imagined.\nAn excellent novel, insightful, beautifully written, and with some wonderfully believable characterisation. And happily, unlike too much Canadian literature, available in the UK! Highly recommended.NB This book was provided for review by the publisher, Bloomsbury Publishing.www.fictionfanblog.wordpress.com"}, {"userName": "Krista", "userReviewDate": "Sep 25, 2017", "userURL": "http://www.goodreads.com/user/show/4729639-krista", "userReview": "There is always a story connected to Mother and me, a story made all the more frightening through each inventive retelling among neighbours. It is a story, effectively vague, of a young man deeply “troubled”, and of a younger brother carrying “history”, and of a mother showing now the creep of “madness”.\nHere's my awful confession: Whenever I hear that there's been some gang-related shooting in Scarborough, it doesn't feel like a full-blown tragedy to me; you run with gangs, you run those risks (naturally, I do empathise with the families who lose their sons; with the neighbourhoods terrorised by drive-by shootings; the unintended victims). And note: Just because the Scarborough gangs tend to be made up of young men of colour, my reaction isn't race-related; I am also emotionally unaffected by white bikers or mafiosi gunning each other down, blowing each other up; this is a them thing that feels unrelated to me. So what author David Chariandy does in Brother feels important and overdue – by giving voice to these young men of colour and exposing the reality of what a newspaper might label their “gang”, I was given that one person to identify with that removes the barrier between “them” and “me”; I felt and personalised the tragedy. This is what good books do. \n“I still think of Francis,” she says.\nBrother opens ten years after an unnamed event in which the main character, Michael's, older brother Francis has apparently died. Raised by a single mother – a Trinidadian emigrant who is now confounded by “complicated grief” – Michael still lives in that same apartment in the same run-down housing complex in Scarborough, now taking care of the mother who did her best to care for her two sons. Although Michael has tried to shield his mother from the sadness of being reminded of Francis over the years, when people from their past begin showing up in the present, it's unclear which one of them is too fragile to confront the memories. In each chapter, the narrative shifts between the present, the childhood of the brothers, and the events that led directly to Francis' death in 1991; each stream adding vital information to the whole picture. \nHad I recognized it only then? We were losers and neighbourhood schemers. We were the children of the help, without futures. We were, none of us, what our parents wanted us to be. We were not what any other adults wanted us to be. We were nobodies, or else, somehow, a city. \nFor a rather short book, Chariandy includes just enough scenes in each time stream to show who these brothers are: Their mother locking them in the apartment as young children so she could go to cleaning jobs, hoping for double shifts and overtime just to fill the fridge; the boys sneaking out to explore the Rouge Valley (a garbage-strewn rift of green that runs through the neighbourhood); their mother stressing education (despite teachers recommending that the bright brothers be lowered from the academic level to the basic; apparently this happened to Chariandy – now a PhD and professor at Simon Fraser – at a school in the same neighbourhood). These are good boys, even if shopkeepers watch them warily; even if they must stand by raging impotently as strangers hurl racial slurs at their mother; even if the nightly news has conditioned them to be scared of “black criminals”. When, in the stream leading up to Francis' death, they witness the murder of Anton – a neighbourhood acquaintance and the kind of low-level criminal that I generally find it hard to empathise with – the brothers are cuffed and roughed up by the police in a “round up everyone and sort it out later” operation. Francis is angered by this emasculation and starts spending more time with his “gang”: a group of boys who are experimenting with vinyl and turntables, exploring the musical possibilities at the dawn of hip hop. These are good boys, but in the atmosphere following Anton's death, compounded by further injustice, Francis starts to push back.Brother explores many issues – masculinity, race relations, police brutality, poverty – and lays bare the challenging immigrant experience. I loved the spicy meals that the boys' mother would fry up, empathised with her need to work constantly as menial help to provide her sons with the bare necessities, and respected the dignity that she brought to her life; wearing thin and never complaining. The family makes one trip back to Trinidad when the brothers are young, and they know better than to speak up when their aunt says that she is jealous of the “perfect life” her older sister had found in Canada:\nMother stayed quiet. She did not say that our father had left us years before. She did not admit that she had not had the time or money to complete her studies to become a nurse. She did not hint at the debt or struggles or the aches she often felt. As we headed to the airport, she just nodded and looked out the window at the coconut trees towering black against the evening sky, and the old untended fields of cane stretching out like a sea.\nAnd after the racism – subtle and overt – that she experiences in Canada, the abandonment, lack of real opportunity and social mobility, and most tragically, the loss of her eldest son, I have to wonder if this stoic character thinks the move away from her large, loving family and community had been worth it. There's just so much to think about with this book.Again, this is a short book, and if I had a complaint it would be that it could be longer – and especially in the present stream, which never felt completely developed – but Chariandy does include enough narrative to give a voice and presence to these youth of Scarborough; he makes them people and that challenges me in a good way. This is what good books do and I hope that Brother's appearance on the Giller Prize longlist gets it the readership that it deserves."}, {"userName": "Ron S", "userReviewDate": "Jun 22, 2017", "userURL": "http://www.goodreads.com/user/show/4714060-ron-s", "userReview": "A short novel without a wasted word that packs a powerful punch, exploring issues of immigration, poverty, masculinity. family and racism, set in a Scarborough housing complex. A novel set in the same location, exploring the same themes, that I read earlier this year read like it was written by someone that took a creative writing class (albeit, still a worthy debut). In comparison, Chariandy writes like someone that could be teaching master classes. A great addition to Canadian urban grit-lit."}, {"userName": "Eric Anderson", "userReviewDate": "May 12, 2018", "userURL": "http://www.goodreads.com/user/show/28819314-eric-anderson", "userReview": "It's difficult to capture the slow-burning sense of alienation that someone can feel within family life, but in “Brother” David Chariandy powerfully depicts the story of a working class mother and her two sons in a way that gives a fully rounded sense of this. Michael lives with his grieving and fragile mother in a tower block in Scarborough, a district of Toronto with a high immigrant population. He still sleeps in the bunk bed of his childhood, but now the top bunk is empty and gradually we discover what happened to his absent brother Francis over the course of the novel. Michael struggles to get enough shift work at his low-paid job and spends the bulk of his time caring for his mentally-precarious mother. They are both haunted by a sense of loss and penned in by their circumstances. What's so beautiful about Chariandy's narrative is how he subtly captures the sense of a family who essentially loves and cares for each other, but whose status as West Indian immigrants has made them into perpetual outsiders and these internalized feelings make them unknown even to each other.Read my full review of Brother by David Chariandy on LonesomeReader"}, {"userName": "Shan", "userReviewDate": "Aug 09, 2017", "userURL": "http://www.goodreads.com/user/show/3268736-shan", "userReview": "I better see this book on ALL the awards lists this fall. Read my friend Robert's review to understand why this book is so incredible."}, {"userName": "Lashaan Balasingam (Bookidote)", "userReviewDate": "Sep 28, 2017", "userURL": "http://www.goodreads.com/user/show/43439266-lashaan-balasingam-bookidote", "userReview": "You can find my review on my blog by clicking here.There are novels out there that are strangely tagged fiction for simply being the result of someone’s imagination. This one however strives to show you that even fiction can break through its walls, goad its readers, and make us wonder if it isn't a true story. Brother tackles on the story of Michael and Francis, two kids living in a Scarborough housing complex right in the heart of Toronto, Canada, in 1991. Weighed down by the expectations of their Trinidadian immigrant mother, these kids face countless obstacles in various forms and come to see the struggles they live with amplified by their cultural background. Their lives however bifurcate as they each find their own ways to get by under the pressure of their situation. Veiled in a stunning prose that sticks to the necessary details, Brother succeeds in telling a moving story about immigration, family, identity and society.Short and sweet, Brother delivers its story in the most efficient way possible, seamlessly interspersing its plot with past and present narratives. While it remains somewhat mysterious throughout the beginning, especially if you magically succeed in picking up this wonderful novel without reading its blurb, the story will find its groove unexpectedly and make you realize where it wants to bring you quite quickly. As much as you’d like this one to be structured in a way that most typical novels are, you’ll end up being confronted with a unique narrative that looks deep into the development of these two brothers and their similar, yet different realities. David Chariandy does a marvelous job in highlighting Francis’ older brother role as a protector and Michael’s innocent, four-years-younger, personality. Its the bond that these two share, as well as the one that they have towards their parents, that drives the plot forward and makes us reflect on the reality of immigration, even to this day.There’s a huge focus on the role of communities in society and their impact on individuals in this novel. Whether we like it or not, we’re never alone in this world. From blood relations to friends and neighbours, we are constantly being influenced by all these various interactions, even by those that do not exist. Brother does a fascinating job in showing the importance of communities and the way that a non-cohesive community increases tensions and internal problems among people who are already easy targets during times where prejudice and injustice are strong. This story also shows us how children of immigrants have the added pressure of performing and satisfying the expectations and hopes of their hard-working parents. The burden is easily seen through the older brother as he attempts to go after his dream in the music business, while struggling in his every-day-life.I loved the importance accorded to music, or even more globally to art and creativity in this novel. There was this symbolism that was conveyed at some point in the story that tried to showcase the difficulty, but also the possibility or mixing together different kinds of music from different times together, and I loved what it tried to add to the overall message behind this book, especially in regards to immigration. Brother is a short and mesmerizing story that holds a lot of emotion and power in the message it tries to convey. While I thought it could’ve had even more content and a much more focused direction in the overall narrative, I still think it did exactly what it wanted to do. Even if its main events takes place in 1991, the themes that it tackles are still relevant to our current times, hence vouching to its powerful and important message and story. If there’s one thing in this novel that I really loved, it would have to be the author’s understanding of how some of us, especially people of colour, can feel the judgment of others through the mere eye contact and insignificant small gestures. This lack of communication between everyone is what drives people to do senseless things.Thank you to Penguin Random House for sending me a copy for review!Yours truly,Lashaan | Blogger and Book ReviewerOfficial blog: https://bookidote.com/"}, {"userName": "Jennifer", "userReviewDate": "Sep 26, 2017", "userURL": "http://www.goodreads.com/user/show/2635637-jennifer", "userReview": "this book is heartbreakingly good, evocative, timely. necessary! the novel has been longlisted for canada's $100,000 giller prize, and it is now my frontrunner.chariandy is a beautiful writer."}, {"userName": "❀ Susan G", "userReviewDate": "Mar 31, 2018", "userURL": "http://www.goodreads.com/user/show/7820199-susan-g", "userReview": "More fulsome review pending: This heartbreaking story set in the gritty Jane and Finch projects tells the story of a family, a mom fighting to support and raise her two boys alone, an older brother trying to find himself and support those that he loves and a younger brother looking up to him and growing up in the face of so many challenges. This truly was a book that opened my eyes and would have been a great book to debate at Canada Reads."}, {"userName": "Rebecca Foster", "userReviewDate": "Apr 30, 2018", "userURL": "http://www.goodreads.com/user/show/5875398-rebecca-foster", "userReview": "Canadian author David Chariandy’s second novel was longlisted for the Giller Prize and won the Rogers Writers’ Trust Fiction Prize. Narrator Michael and his older brother Francis grew up in the early 1980s in The Park, a slightly dodgy community outside Toronto. Their single mother, Ruth, is a Trinidadian immigrant who worked long shifts as a cleaner to support the family after their father left early on. From the first pages we know that Francis is an absence, but don’t find out why until nearly the end of the book. The short novel is split between the present, as Michael and Ruth try to proceed with normal life, and vignettes from the past, culminating in the incident that took Francis from them 10 years ago.The title is literal, of course, but also street slang for friends or comrades. Michael looked up to street-smart Francis, who fell in with a gang of “losers and neighbourhood schemers” and got expelled from school at age 18. Francis tried to teach his little brother how to carry himself: “You’ve got to be cooler about things, and not put everything out on your face all the time.” Yet the more we hear about Francis staying with friends at a barber shop and getting involved with preparations for a local rap DJ competition, the more his ideal of aloof masculinity starts to sound ironic, if not downright false.I came into the book with pretty much no idea of what it was about. It didn’t fit my narrow expectations of Canadian fiction (sweeping prairie stories or hip city ones); instead, it reminded me of The Corner by David Simon, \nWe, the Animals\n by Justin Torres, and \nAnother Day in the Death of America\n by Gary Younge. It undoubtedly gives a powerful picture of immigrant poverty and complicated grief. Yet the measured prose somehow left me cold.Originally published on my blog, Bookish Beck."}, {"userName": "Renee", "userReviewDate": "Jan 16, 2018", "userURL": "http://www.goodreads.com/user/show/4950201-renee", "userReview": "There is so much packed into this slim book by David Chariandy. Brother explores topics that many would describe as timely, but that he describes as being felt by many for far too long. Chariandy dives into race, masculinity, police violence, community, the immigrant experience, and the power of music with striking precision and depth.Michael and his older brother, Francis, live in a community called The Park in Scarborough, Ontario. Raised by their hard working Trinidadian mother, the boys are often left alone to take care of each other. Francis takes on the role of leader, guiding and teaching Michael along the way, often making mistakes of his own. With love and respect for their mother the boys stay on a clean path, but after witnessing an instance of violence, Francis is changed.The story jumps back and forth in time from when the boys are kids to present day. As Michael and Francis struggle to find purpose and identity, the pair are subject to the prejudice that comes from having brown skin and living in an immigrant community; expectations are low. Through a love of hip hop, Francis begins to explore new opportunities, unknowingly sealing his fate. In the aftermath of tragedy, Michael discovers the healing power of his community.Chariandy did a great job at representing for us children of Caribbean immigrants (my mother is Jamaican), layering in even more for me to love about this book. I don't think I've ever seen \"ackee\" mentioned in a book, or that \"pears\" are \"avocados\", at least to Caribbean folks. Knowing that so many Canadians will read this story through Canada Reads 2018 brings me so much happiness."}, {"userName": "Taylor", "userReviewDate": "Sep 17, 2017", "userURL": "http://www.goodreads.com/user/show/7106883-taylor", "userReview": "For such a short novel, this one sure packs a punch. In an American-Dream-gone-wrong story, Ruth had brought her family to Canada from the Caribbean in the hopes of making a better life for her family. This novel follows her sons, Francis and Michael, as they come of age in a housing complex in the Greater Toronto Area. Their options for the future are limited by the climate of poverty, racism, and violence in which they live. This is definitely not a feel-good read - I was numb by the end of it - but an important story as it explores the barriers many are faced with. Thanks to Goodreads and the publishers for providing me this copy."}, {"userName": "Sarah", "userReviewDate": "Jul 20, 2017", "userURL": "http://www.goodreads.com/user/show/13431039-sarah", "userReview": "Thank you to the publisher and Goodreads for a free copy of Brother!Holy shit, you guys. This is an incredible look at racism, police brutality, masculinity, and music. Shifting between the 1990s and present-day Scarborough, the book is timely and powerful. And it is beautifully written -- short, but every word packs a punch, and it's the sort of thing you want to read slowly and reread.And I would say more, but honestly, don't waste your time reading my review. Go and start Brother."}, {"userName": "Bandit", "userReviewDate": "Apr 13, 2018", "userURL": "http://www.goodreads.com/user/show/4528663-bandit", "userReview": "Typically I very much enjoy the immigrant experience sort of stories. This one didn’t quite connect, though, which probably had less to do with quality and more to do with the somewhat heavy handed, all too timely and ubiquitous Black Lives Matter message (kinda like Orange is the New Black’s blatantly flag waving character assassination). The writing itself was very good (award worthy as it appears) and the rendering of the frustrations and privations of the first generation West Indies family struggling to make ends meet in Canada was realistic and emotionally devastating at times. Tragic story, not exactly an American (well, Canadian) dream, more of a neverending struggle, the ghetto projects serving as a quicksand to their tenants, who seldom if ever get out and move on. Maybe there’s an underlying motif about the culture and its misplaced priorities, the street toughness and barbershop parties over prospects, plans, education? Something to be said for the fact that it is the softer, gentler brother who survives, although to not much of a life as such. Presumably the question is to what degree these youths’ paths are predetermined by society in general or specific surroundings. This book works very well as a slice of life sort of thing, although for where I live it’s neither novel nor exotic. For other less racially diverse places this might be more fascinating (educational?) of a reading experience. Sad story, well executed, frustrating. Probably not strong enough or original enough of an argument to change anyone’s mind on immigration at a time where such arguments are much needed. Based on the quality of writing it would have been nice to see the story go further, develop more, take a direction that's less (straight out of the news) predictable. But then again it's only 192 pages. Very quick one sitting sort of read. Thanks Netgalley."}, {"userName": "Luanne Ollivier", "userReviewDate": "Dec 10, 2017", "userURL": "http://www.goodreads.com/user/show/1621569-luanne-ollivier", "userReview": "David Chariandy's first novel Soucouyant, 'was nominated for nearly every major literary prize in Canada and published internationally.' His second novel, Brother is recently released and it too is racking up accolades.Brother is the first reading of this author for me - and I was blown away....1991 Scarborough, Ontario. Michael and Francis are the children of Trinidadian immigrants, living with their mother in a housing complex in this urban center. Their mother dreams of more and better for her sons and works tirelessly to ensure this happens. The boys also imagine their futures. Francis in the music industry and Michael dreams of a life with Aisha, far from the concrete walls of 'The Park'.But in 1991 Scarborough, racial tensions are running high, violence is becoming part of everyday life, police presence is heavy and prejudices are rampant. Those hopes and dreams of the three members of this family are changed forever by the violence of that year.Brother is told in a back and forth timeline spanning ten years. In the present we learn about the past as the book progresses.Brother is a slim novel, but it took me a while to read it. I had to put the book down numerous times - to absorb and avoid the inevitability of what was coming next - even though I knew what that was. The story is real - and raw. Chariandy's prose are absolutely beautiful, drawing you in and wrapping themselves around you. I cried more than once as I read.As a mother, that is where I felt that punch the hardest - her hopes, dreams and desires for her children. And the undercurrent of the loss of her own wants and desires. Her perseverance, fortitude and strength resonated with me - even as it eroded and collided with ugly reality. I'm sickened by the indignities, attitudes and prejudices depicted. Even more so as I know they are not fiction. But those moments are juxtaposed and tempered by the acts of love, joy and happiness that also part of the life of this family.Brother speaks to the immigrant experience, to family, love, loss, hope, duty and desires. And the fact that the past is still the present. Absolutely, positively recommended reading."}, {"userName": "Jay G", "userReviewDate": "Aug 18, 2017", "userURL": "http://www.goodreads.com/user/show/30890847-jay-g", "userReview": "Want to see more bookish things from me? Check out my youtube channel:https://www.youtube.com/channel/UCfer...*I received a copy of this book in exchange for my honest review* 2.5/5 Stars Michael and Francis, sons of a Trinidad immigrant, live in Scarbrough, Canada. Francis dreams of a future in music and Michael has his eyes set on Aisha, a smart girl from his high school. After a tragic shooting, police are suspicious of the brothers and those they associate with. I loved how this was set in Canada and so close to where I am from! I haven't seen many books set here so it was nice to see! I really liked the family dynamics in this book. It was very clear that the brothers cared for each other deeply and I loved how they took care of their mother. The main issue I had with the book and the reason I rated it so low was that I just found it to be slow and boring in my opinion. I think that it is a very powerful story overall, and I can see why so many people enjoyed it... but it was just not my cup of tea."}, {"userName": "Catherine Coles", "userReviewDate": "Sep 18, 2017", "userURL": "http://www.goodreads.com/user/show/6470611-catherine-coles", "userReview": "Set in Scarborough in the early 90s, BROTHER follows two teenage brothers as they navigate racism, police brutality, poverty and gang violence in their marginalized community. Their hardworking mother, an immigrant from Trinidad, does what she can to protect and provide for her sons but so much is stacked against her. BROTHER is short (too short?), eloquently written and perfectly captures the vibrant multiculturalism of the GTA. Also, if you are looking for a novel that has overwhelming resonance with the Black Lives Matter movement, this certainly fits the bill.https://www.instagram.com/p/BZrKeEEjE..."}, {"userName": "Louise", "userReviewDate": "Sep 18, 2017", "userURL": "http://www.goodreads.com/user/show/5108969-louise", "userReview": "I read both Soucouyant and Brother back to back which was a mistake because Brother seemed to me to be a re-writing of Soucouyant. Both books bear the same description: Two brothers from Trinidadian parents, living in Scarborough, the younger one left behind with a mentally unstable mother, with a one-dimensional girlfriend and an absent father. What pushes my rating to a 4-star (for both books) is the mood that Chariandy sets in his novels. There is a sense of dread throughout but also of love and loyalty. You feel deeply for the family, such as it is, for the challenges they must endure. The immigrant experience is not an easy one and Chariandy tells it with compassion."}, {"userName": "Lena♥Ribka", "userReviewDate": "Nov 19, 2017", "userURL": "http://www.goodreads.com/user/show/10446876-lena-ribka", "userReview": "Heartbreakingly beautiful.This book is incredible. An extremely emotional, powerful, evocative and heart-rending piece of prose. Yes, I'm an emotional mess now. But really, guys, what a great book, and what a talented author. It was worth every single tear. Hats off. I should write more, I know, and maybe I'll do it later, when I gather my thoughts. **Copy provided by the Publisher via NetGalley in exchange for an honest review**"}, {"userName": "Natalie", "userReviewDate": "Oct 07, 2017", "userURL": "http://www.goodreads.com/user/show/5559242-natalie", "userReview": "I rarely read books in a day, but I could not put this down. It's as readable as it is challenging, as emotionally raw as it is narratively and stylistically polished. This is a masterful book; I'll be rereading and recommending it for years!"}, {"userName": "Penny (Literary Hoarders)", "userReviewDate": "Sep 30, 2017", "userURL": "http://www.goodreads.com/user/show/3727008-penny-literary-hoarders", "userReview": "A very current story. Often poetically told with rich and beautiful language."}, {"userName": "Krystal", "userReviewDate": "May 28, 2017", "userURL": "http://www.goodreads.com/user/show/22467330-krystal", "userReview": "In awe of this masterpiece! As a fellow Trinidadian immigrant to Canada, these characters really resonated, as he captured the challenges of xenophobia, white supremacy, anti-blackness, etc."}, {"userName": "Kristi", "userReviewDate": "May 22, 2017", "userURL": "http://www.goodreads.com/user/show/7464763-kristi", "userReview": "Fans of Junot Diaz, Eden Robinson, Colson Whitehead & Elizabeth Strout - this is a must add to your to-read shelves for Fall 2017."}, {"userName": "Laura Frey (Reading in Bed)", "userReviewDate": "Oct 07, 2017", "userURL": "http://www.goodreads.com/user/show/5115230-laura-frey-reading-in-bed", "userReview": "Deserves every award it gets, and those it didn't."}, {"userName": "Trevor Pearson", "userReviewDate": "Sep 05, 2017", "userURL": "http://www.goodreads.com/user/show/13458191-trevor-pearson", "userReview": "Received a copy of Brother by David Chariandy through the GoodReads First Reads Giveaway program in exchange for an honest review Becoming a young man is hard anywhere in the world, there are just certain fundamentals that help make it a little bit more of a smooth transition. Coming of age without a father figure is an impediment for sure, especially for two young men doing their best to stay tough and protect their house in a world filled with prejudices and an environment built on fear and reputation. Michael and Francis battle their own troubles and curb their own terrors for the sake of their hard working and fiery Caribbean mother Ruth. Francis is the older brother and understands his role as protector despite his problems coping with the responsibility. Francis wishes he could have a father to help alleviate some of the burden and allow Michael and himself to be children, but that's not happening. Ruth believed that given their circumstances that her sons only had one opportunity in life, their objective was to not screw it up. The boys never wanted to disappoint their mother, but they found it a difficult ask to make her proud. In their free time Francis and Michael went on their own brand of discovery in the inner labyrinth of Rouge Valley and rebelled at times, but most importantly they experienced everything together. Their lives as difficult as they already were became even more trying when Francis was 18 y/o, Michael was 14 y/o and police tape lined the complex walkways.\n\"After Anton was killed, you could feel it more than ever. You caught it in the eyes of strangers the suspicion or outright fear. You sensed the halo of menace above your head, glimpsed the turbulence swirling behind as you walked. On TV and in the papers, politicians promised to crackling down on criminals, with echoed agreements from suited community spokesmen. But criminals weren't the only target. Every day, neighbourhood kids were stopped by the cops, the questions about their actions and whereabouts more probing. We were being watched by everyone, shopkeepers, neighbours, passersby.\"\nRuth immigrated from Trinidad when she was a young adult, like their father, her children are not familiar with their heritage at all. Ruth was born in a small village and when she had the opportunity to leave she took it knowing she would never return to her home country. Ruth wrestled with self-doubt and felt like a failure to her family as she didn't fulfill the promise they told her she had. The \"Park\" is a neighbourhood in Scarborough and a concrete jungle that housed many dangers. Unlike many other cities during the early 90's in Southern Ontario you were forced to see and recall everything you witnessed; there was no escaping it's many tragedies. What first began as an Eastern European wave of immigration into the region began transforming into a more South Asian, Middle Eastern, African and Caribbean flare, bringing a certain flavour to the Great White North. The kids in the neighbourhood may not have looked alike or came from similar family origins but what they shared in common was the inner city strife. Parents that worked menial jobs to put whatever food on the table that they could and a roof over their heads, a common exhaustion from working late night shifts, overtime, and travelling a far distance for work. They also shared a common belief that their children could make a better life for themselves if they were honest, dependable and were aware that chances in life for the lower class were few and far between.\n\"Had I recognized it only then? We were loses and neighbourhood schemers. We were the children of the help, without futures. We were, none of us, what our parents wanted us to be. We were not what any other adults wanted us to be. We were nobodies, or else, somehow, a city.\"\nPeople in their situation faced immigrant backlash that involved dealing with indignities and frequently being told 'to go back to where they came from' as a new normal part of their existence. They became victims of a system and a country that espoused opportunity for all coming through the door but left you to your own devices once you became settled. If Canada's mantra was about mastering the art of getting by they would have fit right in. Being a single mother is tough and enables bad decision making to some, but also forces an eldest son trying to find his own way in life to take on a bigger responsibility. Michael and Francis were often left alone in a complex littered with gang activity, child predators and shot callers; while their mother worked as a cleaner to provide for the family. In most situations this is not the greatest of ideas, but luckily for Ruth, Francis was a natural caretaker and mentor for younger Michael. As time went on the family were beginning to establish a reputation around the neighbourhood as sons that were deeply troubled and burdened by circumstances from their past and a single mother on the brink of coming undone. They were being made aware that even in moments of civility, strangers looked at you as if you were a criminal. Moments like these shape the children of tomorrow, if people only knew the problems they create because of their own ignorance and fear the world would be better off and life would be that much more easier for all.\n\"A great lookout, my brother told me. One of the best in the neighbourhood, but step badly on a line, touch your hand to the wrong metal part while your brushing up against another, and you'd burn. Hang scarecrow stiff and smoking in the air, dead black sight for all. 'You want to go out like that?' He asked. So when you climbed, he said, you had to go careful. You had to watch your older brother and follow close his moves. You had to think back on every step before you took it. Remembering hard the whole way up.\"\nIt had been ten years since Aisha had been back to The Park and her father’s sickness was what brought her back. Michael and Aisha had been really close and still have an understanding after all these years but something still looms large over them. While Aisha is in for her father’s final days she is staying with Michael and his mother, who doesn't speak much anymore, in their cramped apartment and all of its complicated grief. Ruth is in a constant state of wander, she has moments of weakness where mourning and grief consume her and spells of confusion where she can't make sense of the past due to her overwhelming sense of loss but is coping as best as she can. We can only hope as readers that they come out on the other side okay.Brother by David Chariandy is a depressing and heart wrenching read that precisely discusses the effects of growing up: without a father, with a tremendous amount of self-doubt, and the vulnerability involved when dealing with a situation in a neighbourhood suddenly swarmed by people unlike your own. There was also some interesting concepts of becoming what you feared the most, your own living nightmare, a rational fear in an inner city littered with them. There was a lot going on in this book. What I perceived to be the author's overriding theme was the idea of community and coming together, but what I gravitated towards was that children should be allowed to be a children and not have their innocence ripped from their lives. There are several instances where passersby looked at the children as if they were hoodlums, police would question, stop and frisk, profile, harass and crackdown as if they were a hardened criminal when all they were looking to score was some baseball cards and some sticks of Juicy Fruit. Children should go through their early years having irrational fears like killer clowns from outer space or the creature from the black lagoon not the hoodlum that could see the boys as the next victim if they're in the wrong place at the wrong time, because in The Park the odds are that much more stacked against you. There is also a message in the power of art and the gifts that the world of creativity can bring, Hip Hop was Francis' calling. There's also death and swarming grief; and in order to deal with death you need friends, you need family, you need change, you need community, and you need love. I thought this short novel was very nicely done and would recommend it to everyone.\n\"And there were victories, you must know. Fears were banished by the scents of simmering pots, denigration countered by a freshly laundered tablecloth. History beaten back by the provision of clothes and yearly school supplies. 'Examples' were raised.\""}], "description": "Michael and Francis are the bright, ambitious sons of Trinidadian immigrants. Coming of age in The Park, a cluster of houses and towers in the disparaged outskirts of a sprawling city, the brothers battle against the careless prejudices and low expectations that confront them on a daily basis.While Francis dreams of a future in music, Michael’s dreams are of Aisha, the smartest girl in their school, whose eyes are firmly set on a life elsewhere. But the bright hopes of all three are violently, irrevocably thwarted by a tragic event.Beautifully written and extraordinarily powerful, Brother is a novel of deep humanity which provides a profound insight into love, family, opportunity and grief.", "title": "Brother", "url": "http://www.goodreads.com/book/show/36365121-brother", "average": 4.12, "cover": "https://images.gr-assets.com/books/1507316930l/36365121.jpg", "reviews": 222, "authors": [{"url": "https://www.goodreads.com/author/show/865900.David_Chariandy", "name": "David Chariandy"}], "type": ["Fiction", "Cultural"], "outlinks": ["http://www.goodreads.com/book/show/36365121-brother", "http://www.goodreads.com/book/show/13271378-brother", "http://www.goodreads.com/book/show/36306627-brother", "http://www.goodreads.com/book/show/39088853-brother", "http://www.goodreads.com/book/show/36672820-brother", "http://www.goodreads.com/book/show/36558026-brother", "http://www.goodreads.com/book/show/1901403.Soucouyant", "http://www.goodreads.com/book/show/37487246-i-ve-been-meaning-to-tell-you", "http://www.goodreads.com/book/show/9486516-finding-the-words", "http://www.goodreads.com/book/show/153097.No_Pain_Like_This_Body"]}