{"ratings": 226, "userreviews": [{"userName": "Lou", "userReviewDate": "May 16, 2015", "userURL": "http://www.goodreads.com/user/show/19770032-lou", "userReview": "Dear Sir. Dellosso:Where have you been all my life?Man-oh-man! I LOVE THIS BOOK!!!Every time I went to my recommendations on Goodreads and Amazon, Mike Dellosso's name came out, and I always knew I \nhad to\n read one of his books and I supposed I could like them... However, I didn't know how much!This book is so perfect that I'm fangirling right now. Anyway, the thing is that I'm so excited because I think I've found a new fav author!-I recieved a book from Tyndale Blog Network in exchange for my honest opinion but this fact didn't influence the review-"}, {"userName": "Paul Goble", "userReviewDate": "Aug 22, 2015", "userURL": "http://www.goodreads.com/user/show/2218672-paul-goble", "userReview": "Centralia is Christianized version of a Jason Bourne story: a super-skilled secret agent has his memory erased by his handlers, but as memories emerge, he struggles to find his true identity. The writing and plot were somewhat enjoyable, but unremarkable. It does hold fast to the tagline \"Things are not what they seem.\"My main impression after reading Centralia was how ridiculous the secret base was. This base serves a central role in the plot, yet it was poorly thought out. This supposed secret base had no scheme to conceal the comings and goings of its personnel, no rings of security outside of its walls, and huge gaps in its internal operational security. The base is situated in a hostile environment (which I won't describe to avoid spoilers) yet the book is silent as to how the base can possibly survive in that environment.There are a few mentions of \"God\" and \"faith\" and \"prayer.\" This Christian content isn't convincing enough to win unbelievers and isn't deep enough to edify believers. It seems only to exist to brand the novel as \"Christian fiction.\"Bottom line: This was my first book by Mike Dellosso, and it will be my last."}, {"userName": "Melanie", "userReviewDate": "Jul 12, 2017", "userURL": "http://www.goodreads.com/user/show/5396610-melanie", "userReview": "Centralia was a bit of a disappointment. I had super high expectations for the book going in, and yet when reading it, it was just way too confusing. I didn't know what was real, who to believe, or really what was even going on until the last little bit. It was a struggle to stay interested when you don't know what's true...at least it was that way for me. I did overall like the book, though, just wish it would have been a bit more clear. I plan on reading the next book."}, {"userName": "Yo Leo Ficción Cristiana", "userReviewDate": "May 16, 2015", "userURL": "http://www.goodreads.com/user/show/37540605-yo-leo-ficci-n-cristiana", "userReview": "RESEÑA COMPLETA EN ESPAÑOL\nWARNING: This book is not for cardiac peopleMike Dellosso is one of those authors that I always wanted to read, but for one reason or other, until now I hadn’t read any of his books... And now I regret not having done so.This book is AMAZING in the every sense of the word.I love thrillers, but definitely, this is one had me on the edge of my seat, wanting to finish the book and wanting to know how this chaos would be solved.The story has SO MANY twists in the plot, and at one point I got lost in fiction and I couldn’t distinguish reality. There is a lot of adrenaline on each page and each chapter ends with a shocking scene so, that you can’t even blink. Also, there are many deeply messages that reach the conscience and the heart.As for the characters, I think they are very well structured and I especially liked the protagonist. I think that despite everything that happens to him, he knew how to stay calm and he sought the truth at all costs, which made him a hero without knowing.As I said before, this novel is not for cardiac people because it’s impossible to draw the look of this book, and if you consider yourself a lover of a good suspense, then give a chance to Centralia.I take my hat off to this author, for his novel has a good plot, great pace, great message and unforgettable characters.-I recieved an eBook from Tyndale Blog Network but this fact didn't influence the review-"}, {"userName": "Mike", "userReviewDate": "Jun 03, 2015", "userURL": "http://www.goodreads.com/user/show/11035669-mike", "userReview": "Guided……Peter Ryan was guided by his soul and the love for his family.Though they tried to change his life, he kept going. A nightmarish ride to find the truth he already knew. His belief in God was deep seated and came to surface and saved him.Centralia is another exciting book from Mike Dellosso. Best of all, this is a very good story with believable characters. Please be sure you want to be grabbed before picking up this book, it will take you on a journey. For those who may have not read any of Mike’s books before, after reading this one you will certainly want to read the rest. I highly recommend this book to all. And yes, I believe this is his best book yet. You will too."}, {"userName": "Rebecca", "userReviewDate": "Jul 09, 2017", "userURL": "http://www.goodreads.com/user/show/10732829-rebecca", "userReview": "\"Things aren't what they seem. They aren't what you think.\" Plagued by reoccurring nightmares that lead him down a hallway towards a locked door, Peter Ryan is frantic to remember what happened to his wife and daughter. Nearly losing his life in a home invasion, from what appeared to be a highly trained commando unit, he goes on the run for his life. But not before retrieving what appears to be a message from his daughter, \"Daddy, we went to Centralia\".This high energy psychological thriller takes its readers on a journey through numerous unpredictable scenarios, with far more questions than answers, and many more enemies than friends. Sustained by fragments of his faith, Peter relies on the one person who has never failed him, and who inevitably holds the key to the locked door."}, {"userName": "Cindy", "userReviewDate": "Jul 04, 2015", "userURL": "http://www.goodreads.com/user/show/11776175-cindy", "userReview": "A good psychological thriller that keeps you guessing what is true and what isn't! It's like trying to find your way through a maze of mind-bending paths."}, {"userName": ".     ::Super_Nova::     .", "userReviewDate": "Apr 15, 2018", "userURL": "http://www.goodreads.com/user/show/38479383-super-nova", "userReview": "It was cool i guess..At one point in time (correction several points in time) I had to wonder if this guy was madI guess i was hoping for a little more romance...but this is not a romance book now is it?"}, {"userName": "Lisa Johnson", "userReviewDate": "Jan 13, 2016", "userURL": "http://www.goodreads.com/user/show/7092311-lisa-johnson", "userReview": "Title: CentraliaAuthor: Mike Dellosso\t Pages: 386Year: 2015Publisher: Tyndale HouseWhat would you do if you woke up one morning and realized that your world was not what you thought it was? How would you feel if you found out that your memories were untrustworthy? In Mike Dellosso’s Centralia, Peter Ryan can’t find out where his wife and daughter are, and he is told that they died in a car accident two months prior; however, Peter finds a hidden note from his eight-year-old daughter that says she and her mother went to Centralia. Memories start to surface, and before he knows it, Peter Ryan finds himself the target of sinister agents of a secret government organization. He fights for his life and starts to discover that his life is not what it seems as he pursues the truth and his family while being pursued by ruthless men who want to keep him from discovering who he really is.Mike Dellosso has written an action-packed thriller that once gets moving, continues non-stop as the mystery and memories of the main character’s identity unfolds. The nuances and details of the characters are well written and create situation that keep readers engaged and on the edge of their seats as each scene reveals more questions than answers to drive the story. It is easy to like the protagonist and hate the antagonists who pursue him. The way the story plays out is brilliant, and the key to the main character finding answers into his past and identity is rooted deeply in his heart and mind that could not be wiped away through any brainwashing or mental reprogramming that he had been subjected to. Readers will be happy to know that the story resolves happily, yet it leaves room for more action and adventure to follow. If you like stories that involve mystery, action, mayhem, and resolution for the protagonist, you will enjoy Centralia.A sequel to this thriller is coming summer 2016!My rating is 5.Note: I received a complimentary copy for an honest review of this book. The opinions shared in this review are solely my responsibility. Other reviews can be read at http://seekingwithallyurheart.blogspo... . Also follow me on Twitter@lcjohnson1988, FaceBook at https://www.facebook.com/lisa.johnson..."}, {"userName": "Susan Snodgrass", "userReviewDate": "May 30, 2015", "userURL": "http://www.goodreads.com/user/show/7103516-susan-snodgrass", "userReview": "Reading Centralia is like being whisked away by a monster roller coaster and not being able to get off! The ride is amazing, fast and never lets up, all the way to the end of the book! \"Peter Ryan wakes up on a typical morning only to find his house empty, his wife and daughter nowhere to be found. His world is shattered after a phone call to a friends confirms the impossible: his wife and daughter died in a car accident he doesn't remember.Haunted by faint memories and flashes of details, Peter becomes convinced that something isn't right and begins to question reality. When he discovers a note in his daughter's handwriting, strange memories begin to surface that cause him to second guess nearly everything he once believed. Suddenly armed men show up at Peter's home, turning the mysterious puzzle of his past into a dangerous game of cat and mouse. On the run and unsure whom to trust, Peter has to discover what's real and what isn't.....before he loses everything.\"That synopsis alone should be enough to convince you that you must read this book. But in case it doesn't, here's what I have to say: This book is absolutely amazing. Mike Dellosso hits the ground running with this one and the action does not let up one bit throughout the book! Never once. The action and adventure and yes, danger, swirl around the reader pulling you into a vortex of excitement that threatens to consume you until the book is finished.Peter is constantly surprised at everything happening around him because nothing, absolutely NOTHING, is what it seems. How in the world is Peter supposed to find out what is happening when there's no rhyme or reason to anything at all!Centralia is Mike Dellosso's 8th book and I've read every single one and they are terrific. If you enjoy Christian suspense, you MUST get this book. Don't waste anytime grabbing it. But be warned: everything around you must wait until you finish because you will NOT want to put it down!*I was provided a free copy of the book by the author in exchange for my honest review, which I have given."}, {"userName": "Joan", "userReviewDate": "Nov 22, 2015", "userURL": "http://www.goodreads.com/user/show/8435102-joan", "userReview": "I always know when I begin a Dellosso book I am in for a wild ride. This novel started off with a shock and just kept going.Peter Ryan wakes up to an empty house. His wife and daughter are gone. He calls a friend only to be told they had been killed in an automobile accident. Didn't he remember? But Peter is haunted by faint memories and a sense that something is very wrong. He finds a hidden note in his daughter's handwriting that she and her mom have gone to Centralia. Then thugs show up at his house and Peter displays defensive skills he didn't know he had.That is the beginning of a suspenseful plot where the action just keeps going. We follow Peter as he tries to escape those after him while he also tries to unravel who he is. He's supposed to work in a research lab. So how does he know armed combat techniques? Why is he a crack shot?This is a good novel of what might be when the military wants to develop super warriors. It's a scary yet very possible world of training and mental manipulation. It also gave me much to think about regarding memories and the past. One of the characters says, “What is your past other than a series of memories?” (258) Do we create a new past by what we remember? Can others change it for us by planting memories in our head? Do we believe lies about our past? Do we pay more attention to what our brain is telling us or what our heart is saying? And where does God fit into all of this? I recommend this book to those who love action packed novels that make you think. Your mind will be swirling with what might be Peter's real past. The action was a bit repetitive and one of the escapes might have been just a little too easy and unexplained, but in general, this is a good novel.I received a complimentary copy of this book through The Book Club Network for the purpose of an independent and honest review."}, {"userName": "Ian", "userReviewDate": "Feb 26, 2015", "userURL": "http://www.goodreads.com/user/show/5077041-ian", "userReview": "Peter Ryan is the perfect soldier. A lethal shot, a master at hand-to-hand combat and a sixth sense for anticipating danger, he is not to be messed with. Unfortunately, these skills are as much of a surprise to him as they are to some of the people chasing him. How did he become such a lethal weapon? And where are his wife and daughter? Does he have a wife and daughter? Who is Peter Ryan? And why are the Government chasing him?Intriguing, suspenseful and absolutely full of surprises Centralia grabs you on the first page and doesn't let up. A story that is seemingly so far-fetched becomes increasingly believable which reflects Dellosso's skill as a master story-teller. Dellosso keeps us glued to the page as, just like, Peter Ryan, we want to know the answers to all these questions. He's given clues but most of those simply lead to even more questions.And the antagonists? Are they all wanting him dead? Or are they actually the good guys and Ryan's the bad guy?Dellosso just keeps us guessing. It reminded me in part of the Jason Bourne movies (I haven't read the novels) so if you enjoyed those then I'd recommend you grab a cop of Centralia.The novel also has a good faith storyline. Ryan is intrigued by the Bible that continues to reappear. Why? It is something he's spent a lot of time reading? Can God help him solve all these riddles? He keeps recalling/dreaming his daughter encouraging him to \"have faith, daddy.\" Ryan learns to recognise that responding by faith requires a degree of surrender even when there is pain and hardship involved. A great message for all of us to remember.It's wrapped up well and it's a fantastic way to start a series. Interesting to see where Dellosso takes the next story."}, {"userName": "Peter  Younghusband ", "userReviewDate": "Feb 25, 2015", "userURL": "http://www.goodreads.com/user/show/16807073-peter-younghusband", "userReview": "When I started reading this novel, I had to convince myself that I was indeed reading a Dellosso novel. It did not feel like I was. All I can say is that if this is a Dellosso novel then he must have gone from great to excellent since his last novel, Fearless (2013). Dellosso seems to have developed his expertise further and taken this to the next level. This is one very well crafted novel.I know there are some very cliche terms/phrases in book reviewing. \"Hitting the ground running\" is one of those and I use this to not be cliche-ish at all, but to state how it is with this novel. It continues all the way throughout as well. And while the reader is panting from trying to keep up with the pace, they have to cope with the many plot twists and turns, and try to decipher and interpret many lies and deceit, half truths and distortions of the truth from everyone he comes in contact with.Just when you think you are getting to know Peter Ryan and what makes him tick, Dellosso reveals yet another aspect of Peter's personality, training or mysterious background. Dellosso successfully muddies the waters in every chapter in this way. I spent nearly 90% of this novel wondering who this main protagonist really is, I even wondered at one stage if he was the antagonist instead! Such is the complex structure of the plot that Dellosso weaves and the reader had better be careful to not get too entangled in it!To read more:http://christianfictionreviewguru.blo..."}, {"userName": "Trinity Rose", "userReviewDate": "May 25, 2015", "userURL": "http://www.goodreads.com/user/show/3546781-trinity-rose", "userReview": "Centralia by Mike Dellosso is one of my favorite books of the year. It only took me two days to read and that’s fast for me. Centralia is a thrilling book full of suspense. You never know what will happen next. Each chapter, almost every page has something new happening. If you like to guess what will happen next in a book you will never be able to in Centralia. Centralia is a real place. Centralia is a borough and a near-ghost town in Columbia County, Pennsylvania, United States. Its population has dwindled from over 1,000 residents in 1981 to 10 in 2010 as a result of the Centralia mine fire that has been burning beneath the borough since 1962. Centralia is the least-populated municipality in Pennsylvania. In the novel Peter doesn’t believe his wife and daughter are dead and then he finds a message from his daughter in the back tank of the toilet. So the search begins, but there are so many things that happen that you will be on the edge of your seat. This is an amazing book and you will love it. You won’t believe the things that happen. I highly recommend Centralia and know you will love it. Fantastic job Mike Dellosso.Thanks to Tyndale House Publishers for providing this book for review. I was not required to write a positive review. The opinions I have expressed are my own. I am disclosing this in accordance with the Federal Trade Commission's 16 CFR, Part 255"}, {"userName": "Melissa", "userReviewDate": "Apr 06, 2015", "userURL": "http://www.goodreads.com/user/show/721595-melissa", "userReview": "The premise is intriguing, but the way the tale is told is quite confusing. It’s difficult to follow the chain of events because things are never as they seem. In a thriller, this is expected, but readers also expect some occasional true revelations. Yet for those who like a great adventure, this story will fit the bill perfectly.Peter Ryan wakes up and finds his wife and daughter missing. When he calls around trying to find them, he is told that they died in an accident, of which he has no recollection. Peter begins to remember bits and pieces, but also does not believe that they are truly dead. When it becomes clear that someone is out to harm him in order to keep him quiet, Peter begins to investigate what happened and gets caught in a chase with far-reaching consequences. (TYNDALE, Jun., 400 pp., $14.99)- See more at: http://www.rtbookreviews.com/book-rev..."}, {"userName": "Galinda Barefoot", "userReviewDate": "Mar 21, 2016", "userURL": "http://www.goodreads.com/user/show/13510891-galinda-barefoot", "userReview": "Great book lots of surprises keeps you guessing until the end. I definitely recommend this book.I was provided a copy of this book by the publisher through TBCN/BookFun in exchange for my honest review."}, {"userName": "Dustin Foutz", "userReviewDate": "Jan 26, 2015", "userURL": "http://www.goodreads.com/user/show/24492452-dustin-foutz", "userReview": "Having read all of Mike Dellosso's books over years, he has become one of my favorite authors. Centralia is a wild ride and one of his best. Looking forward to the sequel coming in 2016."}, {"userName": "Dave Weiss", "userReviewDate": "Aug 30, 2017", "userURL": "http://www.goodreads.com/user/show/4103478-dave-weiss", "userReview": "I almost titled this review \"Don't read Mike Dellosso unless you have nothing else to do\" but then I thought it might dissuade someone from reading his work and that would be a mistake. This guy can write a page turner like few others. It's just they're really hard to put down. Centralia is a fast paced page turner that follows Peter Ryan, a man whose life is a complete mystery. When attacked this humble research assistant suddenly has fighting/military skills he doesn't know he has and he doesn't know why. His journey leads him to the mysterious town of Centralia, PA, a real life town that was abandoned because it sits above and underground mine fire that has been burning for decades. It's abandoned state leaves it the perfect place for nefarious experiments and government conspiracies. I know it's painfully cliche to say it this way but this book is a thrill ride. I had the opportunity to meet Mike at the Montrose Christian Writers Conference. I sat in on a couple of his sessions on fiction writing and couldn't wait to read some of his work. I was not disappointed. This book has everything, except the stuff that I'd just as soon not have. It's clean and well written. It's got a lot of action, some violence, but it's not, for the most part, gory or gratuitous and while there is clearly a message of faith, it's not oversimplified or cliched. Centralia is a thought provoking and original read that I highly recommend—especially if you have some time on your hands. As sated before, it's really hard to put down."}, {"userName": "Becky", "userReviewDate": "Jan 20, 2018", "userURL": "http://www.goodreads.com/user/show/703972-becky", "userReview": "Constant action made this a heart-pounding read! The potential for evil, with brainwashing and conspiracy, is exposed. Lots of death and bullets; but not graphic violence (if that makes sense). The author identifies the critical need for the anchor of Jesus, and reliance on His strength, to pull us through the darkness of “powers and principalities”."}, {"userName": "Nakia Casey", "userReviewDate": "Nov 25, 2017", "userURL": "http://www.goodreads.com/user/show/51078733-nakia-casey", "userReview": "Just pulled this off the library shelf. Thought it was a real thriller. As I read along, I kept thinking, “Ugh. This is awful! And why does he keep bringing up god?” I got a 3rd of the way in and it’s just so immature and tedious. It’s like a bible study adventure story. It needs to be labeled as Christian lesson material. Not mainstream fiction."}, {"userName": "Stanley", "userReviewDate": "May 28, 2017", "userURL": "http://www.goodreads.com/user/show/5487845-stanley", "userReview": "Good story. The Jason Boorne comparison has already been made by another reviewer so I'll let that stand. This book is safe to read."}, {"userName": "Juanita", "userReviewDate": "May 14, 2017", "userURL": "http://www.goodreads.com/user/show/66790459-juanita", "userReview": "This was a great book that had me riveted to what was going on. I finished it in two days which is not like me at all. Great mystery, twists and turns."}, {"userName": "Amy", "userReviewDate": "Jan 17, 2016", "userURL": "http://www.goodreads.com/user/show/6654120-amy", "userReview": "Action PackedPeter Ryan is on a mission to find his wife and daughter, even though everyone is telling him they are dead. Awakening one day with a sense that his reality is a bit off, finding a note from his daughter, then having his home invaded by some pretty tough characters, he takes off looking for answers. He is repeatedly attacked and chased after, with no knowledge of why or who is doing this. When his ability to fight back, amazes even himself, he begins to wonder if all he knows to be true now is somehow a different reality. The only thing he is sure of, it that if he can find Centralia, he will find answers. But will he get there alive?There were pros and cons to this book. At first I was drawn in to the story, captured by the immediate action and suspense, but eventually, I felt a little lost, kind of like the person in the story himself with no idea of what was going on, who could be trusted, what these people were after, and the purpose behind it. It was, however, mysterious and intriguing enough to keep me reading, and of course I wanted to know what was going to happen.What I enjoyed:The plot maybe not completely original, but interesting)The actionMost of the characters - especially the little girl with her steadfast faith.What I didn't enjoy as much:Some parts were just improbable (to me)It was a bit confusing - hard to discern who was telling the truth, who was lying- even in the end, I didn't feel like there was definite closure.The book is intense! It reminded me of Die Hard or Rambo (you can tell here I haven't watched many recent movies in that category). It was one man against many, doing some pretty remarkable, at times unbelievable, things to keep himself alive. There is also some memory alteration involved, due to some governmental experimentation for a top secret government project. Peter Ryan has no idea who he really is, which of his memories are true and which are false. On a Christian note, Peter has a sense of God, but not really a relationship with God. He begins to develop one as the story moves forward. His daughter however has a very steadfast faith (a child-like faith) and seems to be the one who encourages both mother and father. The ending was somewhat predictable, yet with a bit of a twist. Still, I felt like I was missing something. It is hard to explain exactly what I mean without giving away spoilers. If you like action, don't mind violence, I think you will enjoy this book. I appreciate that it was clean and did not contain language as a story this much action most likely would have.There is a sequel coming out this year in June. I think I would like to read it to see if it clears things up a bit and offers closure. This is my first experience with Mike Dellosso's books.I received this book courtesy of bookfun.org and Tyndale in exchange for my honest opinion."}, {"userName": "Mark", "userReviewDate": "Jan 10, 2015", "userURL": "http://www.goodreads.com/user/show/2648514-mark", "userReview": "This book starts out with the statement \"Things are not what they seem.\" And then the story begins and you see that is exactly the case.  Mike has been one of my favorite authors for quite some time, and every novel he churns out is a masterpiece, totally different from his others. This one is no exception. It is totally different from his previous seven books, and it is so good that he will have a hard time topping this one. The book has been described as a psychological thriller, and that is an excellent description of the book. Peter Ryan, the main character, has no clue what is going on for a lot of the book, and neither does the reader. He has all sorts of memories that flash in and out of his mind, often contradicting other memories that he experiences. There are people chasing him who he doesn't know, nor does he know why they are after him. Since the main character is confused, so was I as a reader....... but it wasn't a bad confusion. It was a confusion that made me want to read faster so I could get to the part of the book where it was revealed what was going on; the part of the book where Peter Ryan found out for sure who he was, and which memories were real and which were not. After a roller coaster of a ride, things start being made clear, and I found myself thinking, \"Man, Mike is a genius for coming up with this plot!\" It is a convoluted and complex plot, that is also exciting and full of drama and surprises. I loved the whole book, but especially how it reached its conclusion. I was sorry to see it end, and am hoping that what looks like a sequel may be in the works. The book has it all: suspense, drama. bad guys, good guys, chases, surprises, and faith. What stood out to me in the book, was although Peter had no clue what was real and what was not for most of the time, he could sense God and that He had had a close relationship with God before all of the madness set in. And although the book is fictional, that truth is not. No matter how rough life gets, no matter what condition our mind is in, whether it be things like in this book, or Alzheimer's and other mental illness, if we have a relationship with God, that will remain no matter what condition our mind is in. I highly recommend this book, and Mike's other books, if you enjoy good suspense. Centralia is set in the real ghost town like town of Centralia, PA, which has an interesting history."}, {"userName": "Beckie Burnham", "userReviewDate": "Aug 17, 2015", "userURL": "http://www.goodreads.com/user/show/2952739-beckie-burnham", "userReview": "I have read several of Mike Dellosso’s novels — all have been breathless suspense/speculative books that leave the reader slightly off-kilter. In Centralia, he has stepped it up a notch. Page-turning, with jarring images and ideas, this book is for those who want an adrenaline-laced read and a mind bending concept. This one kept me wondering to the last page and beyond.Peter Ryan wakes up one morning with a memory like Swiss cheese. A confusing mix of holes and conflicting memories leaves him searching for his wife and daughter that others assure him died tragically months ago. But Peter knows that can’t be right, especially as gun-wielding assassins keep showing up. Images skirting on the edge of his mind give him flashes of insight and a muscle-memory of guns, martial arts, and strategy keep him alive as he searches for those he loves and the truth that may set him free or bind him forever.Centralia is definitely not for the faint of heart. There are lots of scenes with gunfights, car chases, and hand to hand combat. One especially cringe-inducing scene involved a hot grill in a diner. Eww! And while the physical is front and center, the psychological aspects of this thriller may be the most disturbing. Peter is a complex character that the reader roots for from the beginning. Secondary characters aid in the advancement of the plot. One such character, Lawrence Habit, was the most intriguing — is he a good-guy or manipulative villain. Centralia is a Christian thriller, but is not preachy in any way. It’s compelling message of God’s faithfulness is woven seamlessly throughout. As Peter finds “they tried to take him away from God, but God just wouldn’t let go”. At the end of the novel, the reader is left with more questions than answers, literally and figuratively. The discussion questions at the end really helped this reader process what I had just read.Fast-paced, with physical danger and psychological trauma, Centralia is recommended for those who like lots of action, twists and turns, and an intellectually challenging reading experience.Recommended.Audience: adults.(Thanks to Tyndale for a review copy. All opinions expressed are mine alone.)"}, {"userName": "Elizabeth", "userReviewDate": "Jun 15, 2015", "userURL": "http://www.goodreads.com/user/show/31967709-elizabeth", "userReview": "Disclaimer: Centralia was provided by Tyndale in exchange for an honest review.Centralia is a different sort of book than what I usually get from Tyndale. It was refreshing to read something from a different genre, and it was interesting to see how Dellosso incorporated Christianity into a genre that usually excludes it. And while the religious aspects were not nearly as prevalent as the action sequences, overall I thought Dellosso did a decent job of combining the two.The action, however, was a bit mechanical in writing. It’s hard to write action without making it seem either like a role-playing game or a blow-by-blow description, and Dellosso tended to do a lot of the latter, which while effective and seamless in some of the scenes, was clunky and mechanical in others. Things like “he threw a right at the man’s jaw and then finished with a left to his abdomen. Then he raised his leg and…etc.” are distracting to read, at least for me, because my brain tends to fill in the gaps while reading and having something described in blow-by-blow form like that means that I concentrate more on the words than on the scene, if that makes any sense. This isn’t true of all the scenes in Centralia, but some I definitely thought were just overly descriptive and repetitive.I also didn’t really understand the plot. Something that didn’t make any sense to me at all was how this Centralia thing was kidnapping both kids and their mothers. Why in the world do they want the mothers? And why is nobody wondering why mothers and kids are missing? It seemed like that was thrown in there just so that the mother could be with her daughter in those particular scenes in the book, so that Dellosso could keep them together and not have to come up with a way to get the mother into the picture. But it didn’t make any sense, not to me.Centralia was refreshing if just for the fact that it’s different than the usual historical romance books that I get from publishers, and I thought for the most part Dellosso did a decent job of integrating Christianity into a genre that usually has no religious aspects at all. However, I thought the action scenes tended to get mechanical and overly “let me give you this blow-by-blow description” and some of the plot aspects didn’t make any sense."}, {"userName": "Nyla", "userReviewDate": "Jul 19, 2016", "userURL": "http://www.goodreads.com/user/show/6205278-nyla", "userReview": "Centralia by author Mike Dellosso is the first book in his Jed Patrick action packed series. Published by Tyndale this thrilling 400 page book's cover states \"things are not what they seem\". How true! What is Centralia? Where is Centralia? Who is lying? Who can be trusted?The book's main character is Peter Ryan. It is just a regular day when he wakes up alone in his house. Where are his wife and daughter? With no success in locating them he decides to phone a friend only to learn he has no family because of an accident. How could he forget that? Things just don't add up. Now comes the mystery, action, guns, suspense, car chases, twists, and where I can't read fast enough to find out the answers. This is the first book that I have read by author Dellosso, but definitely not the last. I enjoyed his style. He writes with a flair for action, intrigue and mystery. His characters are well developed and he puts twists and turns throughout his book. This is a book where you need to pay attention. Just when you think you have figured something out.....surprise.....here is another twist. For a Christian novel there was not enough inspiration for me. The main character's relation grew. The little child had faith and was a delight. I did enjoy the child's character. She was able to soften up this book a bit.This would be a good book for mystery lovers, people that like action or suspense. If you want a fast paced book that is reminiscent of Total Recall or The Bourne Identity you should check this out. It would be a fun book to have for a reading club. You will want to discuss it with friends. You will be ready for book two, also.I would recommend this for anyone wanting an action packed thrilling book. If you like to figure things out, this is a great book for you. Want mystery, intrigue, and some suspense? This is your book. I rated it 4 out of 5 stars. A copy of this book was provided by The Book Club Network for my honest review."}, {"userName": "Victor Gentile", "userReviewDate": "Jul 09, 2016", "userURL": "http://www.goodreads.com/user/show/2528881-victor-gentile", "userReview": "Mike Dellosso in his new book, “Centralia” Book One in the Jed Patrick series published by Tyndale House Publishers gives us Things Are Not What They Seem.From the Back Cover: Peter Ryan wakes up on a typical morning only to find his house empty, his wife and daughter nowhere to be found. His world is shattered after a phone call to a friend confirms the impossible: his wife and daughter died in a car accident he does not remember.Haunted by faint memories and flashes of details, Peter becomes convinced that something isn’t right and begins to question reality. When he discovers a note in his daughter’s handwriting, strange memories begin to surface that cause him to second-guess nearly everything he once believed. Suddenly armed men show up at Peter’s home, turning the mysterious puzzle of his past into a dangerous game of cat and mouse.On the run and unsure whom to trust, Peter has to discover what’s real and what isn’t . . . before he loses everything.Every book that Mike Dellosso writes is better than the previous one which means that “Centralia” is the best one so far. Nothing is what it seems so just when you, and Peter Ryan, think you have a handle on what is going on–guess again. This book starts out exciting and then Mr. Dellosso just notches up the excitement factor. “Centralia” is a thriller with all kinds of danger that is a lot like a roller coaster with dips and turns and drops that you really don’t see coming. Mike Dellosso knows how to weave a captivating story with wonderful characters that breathe. I am so looking forward to the next book in this series.Disclosure of Material Connection: I received this book free from Tyndale House Publishers. I was not required to write a positive review. The opinions I have expressed are my own. I am disclosing this in accordance with the Federal Trade Commission’s 16 CFR, Part 255: “Guides Concerning the Use of Endorsements and Testimonials in Advertising.”"}, {"userName": "Kelly", "userReviewDate": "May 31, 2015", "userURL": "http://www.goodreads.com/user/show/18160618-kelly", "userReview": "Things are not what they seem.Peter Ryan can't find his wife and daughter. Everyone keeps telling him they died, but he doesn't believe them. He does, however, have memories of their funeral. When his house is invaded, he discovers that he has survival skills he was not aware he had. He doesn't understand what is going on, and do the disconnected memories have anything to do with what's happening? And, what about the nightmare he has almost every night? Is it significant? Centralia is a fast-paced, edge-of-your-seat suspense story where \"things are not what they seem\".This story is very well-written and the characters, down to the very minor characters who only appear in one chapter, are very well-developed. One of the best minor characters in the book is Ronnie. He's only in one chapter, but Mike gave me so much information about Ronnie that I immediately cared about this character. I would like to see Mike continue Ronnie's story in another book sometime.The story grabbed my attention right from the start and held it in a strong grip right up until the very end. Mike Dellosso has a talent for giving great descriptions of people and settings without making it too wordy or slowing the action and suspense down. The story is action-packed, suspenseful and frightening.I've been a Mike Dellosso fan for a year now, and though I haven't yet read all of his books, I think this could be his best work yet. I highly recommend this book to anyone who likes to be kept up late because you just can't put this book down; to anyone who loves a story packed with action and suspense, you won't want to miss this one."}, {"userName": "Paula", "userReviewDate": "Mar 29, 2016", "userURL": "http://www.goodreads.com/user/show/35705761-paula", "userReview": "Centralia by Mike Dellosso is a suspense novel that will keep the reader focused and on the edge of the seat until the very end. With all the action, the book reads quickly and is hard to put down. This read is not for someone who likes predictability in a storyline and doesn’t like to keep an open mind to confusion and twists and turns throughout. Also, the faint at heart may not enjoy due to the graphic violence. Peter Ryan wakes up one morning forgetting that his wife and daughter have been killed in a car wreck two months prior. Everything is confusion and jumbled in his mind with flashes of possible scenes in his life. He doesn’t know about these flashes of memory. Also, there is the weird dream that often occurs that keeps him wondering about his life. On this particular morning, he finds a note hid in a canister in the back of the commode written by his daughter, reading “Daddy, we went to Centralia.” What and where is Centralia? How can this be? Are his wife and daughter still alive? While pondering this revelation, he hears several men quietly break into his house. After defending himself and killing all of them, Peter is now on the run. What is going on in his life? He must find the answer about his loved ones. The rest of the book takes Peter on the dangerous journey to and in Centralia. The faith in God and His protection are weaved successfully all throughout the book. Read to find out what happens to Peter Ryan. I received a copy from the author and publisher of The Book Club Network in exchange for an honest review."}], "description": "Peter Ryan wakes up on a typical morning only to find his house empty, his wife and daughter nowhere to be found. His world is shattered after a phone call to a friend confirms the impossible: his wife and daughter died in a car accident he does not remember. Haunted by faint memories and flashes of details, Peter becomes convinced that something isn't right and begins to question reality. When he discovers a note in his daughter's handwriting, strange memories begin to surface that cause him to second-guess nearly everything he once believed. Suddenly armed men show up at Peter's home, turning the mysterious puzzle of his past into a dangerous game of cat and mouse. On the run and unsure whom to trust, Peter has to discover what's real and what isn't . . . before he loses everything.", "title": "Centralia\n      \n          (Jed Patrick novels #1)", "url": "http://www.goodreads.com/book/show/24345783-centralia", "average": 3.87, "cover": "https://images.gr-assets.com/books/1422215014l/24345783.jpg", "reviews": 82, "authors": [{"url": "https://www.goodreads.com/author/show/1283191.Mike_Dellosso", "name": "Mike Dellosso"}], "type": ["Christian Fiction", "Thriller", "Suspense", "Mystery", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/24345783-centralia", "http://www.goodreads.com/book/show/24518245-centralia", "http://www.goodreads.com/book/show/6129682-scream", "http://www.goodreads.com/book/show/2976991-the-hunted", "http://www.goodreads.com/book/show/7884776-darlington-woods", "http://www.goodreads.com/book/show/12557776-frantic", "http://www.goodreads.com/book/show/14289303-rearview"]}