{"ratings": 405, "userreviews": [{"userName": "Hugh", "userReviewDate": "Sep 28, 2017", "userURL": "http://www.goodreads.com/user/show/32318315-hugh", "userReview": "Madeleine Thien first came to my attention when her brilliant third novel Do Not Say We Have Nothing was shortlisted for the 2016 Man Booker prize. This one is her debut novel, which shows that most of the key ingredients that made it so special were there from the start.This book is also ambitious and wide ranging - its events span five decades and four continents, from the north of Borneo during the Second World war through to modern Canada.Once again Thien weaves a complex tapestry of the personal and the political - a moving family story that touches on many other elements and ideas. We start with a doctor Ansel, grieving for his wife Gail who has died young a year earlier, and a dinner party he attends, given by her parents Matthew and Clara, which allows Thien to introduce many of the characters.Each section of the book focuses on a different character. The second takes us to Matthew's childhood in Japanese occupied Sandakan in what is now the Malaysian part of Borneo. He and his friend Ani hide from Allied bombs in the jungle. When the Japanese leave, his father, who runs a rubber plantation, is killed because he has collaborated with them to avoid the prison camp where Ani's father died. Matthew and his mother are forced to flee.I won't even attempt to summarise the rest of the plot, which touches on subjects as diverse as photography, tuberculosis, sound recording, cryptography and fractals, and takes us through Java, Hong Kong, Australia, Holland and eastern Europe. The central love stories are moving and the whole thing is very cleverly structured.A debut novel that is well worth reading."}, {"userName": "Tiffany", "userReviewDate": "Sep 21, 2008", "userURL": "http://www.goodreads.com/user/show/1545272-tiffany", "userReview": "If I wasn't so obsessed with keeping my books in such pristine condition, I would have read this book with a highlighter in hand, ready to set apart those passages that demonstrate the written word as a true art form. There were many, some that moved me to tears, which hasn't happened since I read The History of Love by Nicole Krauss, one of my favourite books of all time.Thien clearly has enormous talent; as stated on the back of the book, Thien has a flair for imagery, and I wholeheartedly agree. This book is incredibly sad but meaningfully so, and I believe it's a testament to how people can somehow find a way to move on after the most tragic events. At the same time Thien manages to describe the most mundane events to the point where they become extraordinary and beautiful in their regularity. I can definitely understand why this book won the Amazon/Books for Everybody First Novel Award. Thien is a talent that should be recognized for years to come, and I'm proud this book has been added to the Can Lit roster."}, {"userName": "Jonathan Pool", "userReviewDate": "Jun 05, 2017", "userURL": "http://www.goodreads.com/user/show/27950748-jonathan-pool", "userReview": "I was at the 2017 Baileys shortlist group reading in London, ahead of the winning book announcement. I overheard the comment that the reading style, body language, and general interaction of the authors with their fellow finalists, and their audience, is a good marker for the writing style that each brings to their craft.That's certainly true of Madeleine Thien who is such a gentle, giving and sincere person.  Certainty , her first novel is a gentle, rather sad, story. It's one centred around loving relationships, whose sadnesses are the consequence of ill fated circumstances rather than human selfishness.Some of the themes that have brought Thien to a wider audience in  Do Not Say We Have Nothing  are also explored here. Canada, Thien' s own adopted country of residence, is geographically and spiritually far removed from the Far East in which much of Certainty is set. Thien writes movingly about one's familial country of origin and of cultural identity; the playgrounds of childhood memories. The human displacement brought about by war and regime change is a sorrowful experience that millions of forced migrants continue to experience today.Thien borrows from Nietzsche: \"The ability to forget is what brings us peace\" (85)Certainty is an uncomplicated, wistful novel that doesn't have the greater ambition and sweep of the authors later works. It's a good introduction into the subject matter of global diasporas."}, {"userName": "Shawn Mooney", "userReviewDate": "Feb 20, 2017", "userURL": "http://www.goodreads.com/user/show/50408211-shawn-mooney", "userReview": "Do Not Say We Have Nothing is the best novel I've ever read, so I was interested (and a little nervous) to read this, Thien's debut novel. I loved it so much too! Of course it's not the masterpiece that DNSWHN is, but Thien sensitively explores many of the same themes here: grief, war, and displacement tearing families and psyches asunder, an intercontinental love triangle, a near-indecipherable diary. DNSWHN was no fluke. I'm calling it: Thien is my favorite novelist."}, {"userName": "Jennifer", "userReviewDate": "Oct 03, 2017", "userURL": "http://www.goodreads.com/user/show/32647049-jennifer", "userReview": "3.5 stars. The main problem with this book is that it’s overly ambitious. It jumps from character to character, present to past, and country to country to tie together storylines about love, trauma, and unwieldy memories. As a consequence, most of the characters end up flat and forgettable. But the thing that makes this book special is the main “present” storyline, which examines the loss of a young woman with understated, incredible beauty. One of the best portraits of grief I’ve ever read. And as in all of Thien’s books, you can trust that the writing will be fluid, elegant, and chip away at the pieces of your heart. Not a perfect book, but still lovely."}, {"userName": "Megan Baxter", "userReviewDate": "Dec 01, 2017", "userURL": "http://www.goodreads.com/user/show/5742086-megan-baxter", "userReview": "I have not always been thrilled by the list put out by the CBC of the Top 100 Canadian Books. I mean, I'll read the whole thing if it kills me, but the list itself was far to heavily weighted towards books that had come out in the five years before it was compiled. And so, many of the books on it have left me a little baffled as to why they're there, other than that they're recent, and it probably pleased the publishers.Note: The rest of this review has been withheld due to the changes in Goodreads policy and enforcement. You can read why I came to this decision here.In the meantime, you can read the entire review at Smorgasbook"}, {"userName": "Kyla", "userReviewDate": "Mar 18, 2008", "userURL": "http://www.goodreads.com/user/show/85937-kyla", "userReview": "Ah - award winning Can Lit. Yawn. If it is multi-ethnic, multi-generational, is written poetically and is dull as dishwater - bring on the Canadian Writing Awards! Of course I love Canadian writing but this is SO completely Can Lit pleasing and not interesting at all. The only bits I liked were the ones set in Strathcona because I recognized the neighborhood."}, {"userName": "Natasha Penney", "userReviewDate": "Jan 07, 2018", "userURL": "http://www.goodreads.com/user/show/9555683-natasha-penney", "userReview": "I adore this book. Although I've just finished it I already know I'll read it again. Thien again works her masterful storytelling and unearthly grasp of both the art of writing and the complexity of human emotion with seamless grace and fluidity. Her stories are complicated, but her characters are breathtakingly vulnerable and accessible. Genius."}, {"userName": "Alden", "userReviewDate": "Jul 27, 2007", "userURL": "http://www.goodreads.com/user/show/228310-alden", "userReview": "At its most essential, Canadian writer Madeleine Thien's resonant, richly textured first novel, Certainty, explores questions of how possible it is to know another person, even a person we love, and how to live with that uncertainty.Beginning in present-day Vancouver with Ansel, a physician wracked with grief and guilt after the untimely death of his 39-year-old partner, Gail, Certainty unfolds through overlapping narratives that follow twining streams of memory to North Borneo during the brutal Japanese occupation of the 1940s to Jakarta in the 1960s, to the Netherlands and back to Vancouver. Thien's characters are people with pasts complicated—or, in some cases, nearly annihilated—by war and its dislocations and, in the second generation, by the reverberations of war. There are holes in these characters' lives—mysteries, secrets, infidelities—and with each change in view, one hole is mended while another tears open. Many seek to understand their lives and connect with others through the beautiful ambiguities of art, others through the sureties of science.You can read the rest of my review of this book here:http://www.waterbridgereview.org/0320..."}, {"userName": "Ruthie", "userReviewDate": "Sep 25, 2011", "userURL": "http://www.goodreads.com/user/show/991634-ruthie", "userReview": "After all the discussion about this book on the CBC Goodreads page, as well as other sites I finally got a chance to read it! The novel is beautifully written, tells a compelling story about the war in North Borneo, as well as side side stories about immigration, radio documentaries, and a few love stories. My issue was that I felt very removed from all of the characters because the narrative voice kept changing voices. Despite the love stories I was somewhat unmoved, and that bothered me. I found the story of the conditions under Japanese control compelling, but the details did not feel complete. A story of a coded diary, another of another character of Dutch descent all made things more scattered and took away from the main story."}, {"userName": "Baljit", "userReviewDate": "Nov 20, 2017", "userURL": "http://www.goodreads.com/user/show/846699-baljit", "userReview": "I felt the pace got too meandering and too slow, and the main characters were emotionally disconnected from each other"}, {"userName": "Nicole A", "userReviewDate": "Jul 25, 2017", "userURL": "http://www.goodreads.com/user/show/57397415-nicole-a", "userReview": "This book grew on me slowly."}, {"userName": "Gerund", "userReviewDate": "Mar 02, 2009", "userURL": "http://www.goodreads.com/user/show/1261470-gerund", "userReview": "The opening of Canadian writer Madeleine Thien's Certainty is one of the most exquisitely-crafted passages I have read in a while. Still half-asleep, a man rolls towards his sleeping lover. But this is only \"what was to have been the future\", and by the end of the passage, as the man sits drinking coffee while the sun rises, you realise that his lover is not there, that she lives only in his memory.Nominated for the Kiriyama Prize, which recognises books about the Pacific Rim and South Asia, this is the first novel of the daughter of Chinese Malaysian immigrants. Her first collection of short stories, Simple Recipes (2003) won four awards in Canada.Unfortunately, that first passage is pretty much the highlight of the book. From there unfolds a disappointingly hackneyed tale of love lost and secrets revealed, involving the loved ones of Gail Lim, a radio journalist who persists as an echo amongst them six months after her death.As suggested by the title, which refers to philosopher Bertrand Russell's proposition that we need to learn to live without certainty, while at the same time not being paralysed by hesitation, Thien has certain theories about time and existence that she wishes to discuss throughout the book. This is fair enough, but Thien does so at the expense of character development.For example, she has Gail's lover Ansel cheat on Gail with another woman, shortly before her death. It's never convincing why he has an affair, though, except to create dramatic tension between the two characters and to give him a chance to muse: \"If he could have seen into the future, he would not have believed the affair possible\".Then there's her father Matthew, who in his old age is haunted by the pain of his childhood in Japanese-occupied Borneo during the Second World War. At the age of 10, he witnessed his father being executed by the Japanese, despite having collaborated with them to protect his family. After the war, the shame of being the related to a Japanese collaborator makes him flee for studies in Australia, leaving behind Ani, who is apparently the love of his life. Again, we are told rather than shown, making it more annoying than tragic when Matthew continues to hold a torch for Ani even after he meets Gail's mother.The book suddenly improves dramatically two-thirds of the way in as Gail, previously either dead or not yet born, finally takes hold of the narrative on her 39th birthday. The only person who doesn't seem self-absorbed or self-pitying, she is recovering from the revelation of Ansel's infidelity when she receieves news from her friend in Holland that he has managed to crack the code of the diary of a Canadian soldier, whose story is the subject of one of her radio documetaries.Flying to Holland to visit her friend, she decides to make a detour to visit the Dutchman who ended up marrying the love of her father's life, and ends up unravelling her family's very own mystery. But this eleventh hour upswing is not enough to compensate for the fact that most of the characters do not seem to have much of a personality, simply existing as ciphers for Thien's musings on malleability of time and memory. Abstract and obtuse as they flit through the pages, they resemble nothing so much as code -- one you don't really care about cracking anyway."}, {"userName": "Laura", "userReviewDate": "Aug 20, 2016", "userURL": "http://www.goodreads.com/user/show/5231257-laura", "userReview": "O poveste frumoasă scrisă prost, tradusă şi mai prost şi cu o redactare aproape inexistentă. M-a iritat la culme traducerea/redactarea, aşa că m-am concentrat cu greu la povestea în sine. Seamănă foarte bine cu Şoapta inimii de Jan Philipp Sendker, doar că pendularea trecut-prezent-imaginar-real este foarte obositoare. Nu am reuşit să-mi dau seama la ce se referă titlul. Oare la certitudinea dragostei dintre doi oameni, dintre părinţi şi copii? Sau la certitudinea că îl cunoşti bine pe cel de lângă tine? Poate la certitudinea că omul drag pe care l-ai pierdut a dus o viaţă împlinită? Cred că trebuie să mai citesc şi alte puncte de vedere să înţeleg mai bine."}, {"userName": "Andrea", "userReviewDate": "Jul 26, 2012", "userURL": "http://www.goodreads.com/user/show/7305144-andrea", "userReview": "Not worth working through the 300 pages. The book had the potential of being interesting with the need to uncover a mystery and I would even say I liked the way it was written in flashbacks. But the characters were lacking. The were several times where I would stop and ask who are we talking about this time? And the plot with Gail seems incomplete. I feel as though there's more to the story that was forgotten. Disappointed on this one."}, {"userName": "Dar", "userReviewDate": "Nov 07, 2016", "userURL": "http://www.goodreads.com/user/show/10640307-dar", "userReview": "A spare and dreamy story that twists in and out of time. I am a quiet and reserved person and I related to the silence and space that the characters in the book held around them. I am very conscious of whether to share things to unburden myself, or to withhold in order not to burden others. I don't know of other books that have treated this theme. The language created beautiful word-pictures and sensations. Such a contrast to the shouty, me-first drama-queen world out there."}, {"userName": "Pilvi", "userReviewDate": "Dec 21, 2008", "userURL": "http://www.goodreads.com/user/show/734162-pilvi", "userReview": "This was such a boring book. Throughout the book I kept thinking what was the point in the story, but it never occured to me at all. I don't really understand what the writer wanted to tell with this book, so in my eyes it's completely useless. There were some parts that were written nicely, but that's about it."}, {"userName": "Ann", "userReviewDate": "Apr 22, 2009", "userURL": "http://www.goodreads.com/user/show/116519-ann", "userReview": "I found it hard to pay attention to this book. It was an interesting story but told mostly in flashback. The characters changed so often that I was unable to form much connection to any of them. I do not recommend it."}, {"userName": "Stephen", "userReviewDate": "Jul 06, 2008", "userURL": "http://www.goodreads.com/user/show/265114-stephen", "userReview": "Talented writer; extremely fluid prose. Compelling story and was pleasantly surprised."}, {"userName": "Cathy Austin", "userReviewDate": "Jul 06, 2017", "userURL": "http://www.goodreads.com/user/show/38962020-cathy-austin", "userReview": "Must give this beautifully written book 5 stars.A story about remembrance, secrets kept, scars of war, loneliness, love, home. Things that stay the same regardless of the passing of time. Depth of feeling, connection. Sorrow of betrayal. Forgiveness. Thien covers so much in this book, gives us a lot to pause and to think about.Main characters friends Matthew and Ani as 10 year olds in Malaysia just before the war is over, 1945. What they see, hear, experience and lose (their fathers, their families) and each other as they part is heart wrenching but Thien tells the story in a clear, simple, lovely narrative. Matthew goes eventually to Australia for college then emigrates to Vancouver, taking with him his new bride, Clara. Ani stays behind and makes a life in Sandakan with her son, Wideh. Years later, it is Gail, Clara and Matthew's daughter who unlocks the secret of Matthew's life during the war years, something he never talks about. And she does this in Amsterdam. So many connection points for all the characters, a shared past that she unfolds, layer by layer. Relationships play a huge role in Certainty; Gail and Ansel, Matthew and Clara, Matthew and Ani, Ani and Sipke. I turned down so many pages in my copy, phrases I wanted to remember, share. \"There are things in my life that I hoped would turn out differently. Things that I thought I was capable of changing. But isn't it this way for everyone?\" pg 128.Thien plays with imagery that makes you sigh. \"In the quiet she thought of Matthew, of that morning, last month, when she came off the boat at dawn and saw him standing on the shoreline. His bicycle leaned against his hip, his eyes searching the returning boats, the crowd of people, finally coming to rest on her.\" 'when they came up for air, he told her how to listen for the sound of the ikan selan kuning, with its deep-yellow stripe, which made a noise like the wind', pg 154And since this book is absolutely about the past, 'He said to Gail that sometimes the past could not be made right, not every experience could be made to fit.' pg. 305. Agreed, yes.I will never get to North Borneo or Malaysia yet Thien has taken me there with her skill with words.Vancouver I know and she shows the places where I have been, familiar and easily identifiable.This story of people coming from other countries to make Canada home is a powerful read for our 150th birthday, so glad I finished it this week.I am now eager to read her newest book."}, {"userName": "Pamela", "userReviewDate": "Mar 05, 2018", "userURL": "http://www.goodreads.com/user/show/30824320-pamela", "userReview": "[And so it ENDS.\"The first maps, he [Matthew] knows, were drawn in the dirt, a picture of a place set tenuously down. He can close his eyes and see the road leading to Mile 8, curving down to the sea. A boy's hand tracing a circle on the ground, the soil warm against his fingers. He had once gone back to find it, the place between the row of trees, but what he had tried to keep safe was lost. His childhood, a time before the war. A glass jar that moves from his father's hand to his, a continuous question that asks, how am I to live now, when all is said and done and grief must finally be set aside. Ani in a park on the other side of the world, the words his father could not say, the remembered voice of his daughter. So many things, he thinks, that we carry all our lives, in the hope that what we know will finally redeem us, that we will find something that abides, even now, in the indefinite, the uncertain, hereafter.\" (hide spoiler)]"}, {"userName": "Ming", "userReviewDate": "Dec 22, 2013", "userURL": "http://www.goodreads.com/user/show/3962630-ming", "userReview": "Re-read this Aug 26-27, 2015. Such beautiful writing on every page. And the threads of story woven and interwoven are complex and richly textured. And in addition, the tone is so poetic and lush.Favorite passages:There is the understanding that she is no longer here, that it was sudden and irrevocable, but this understanding is one moment spread over a thousand hours, a continuous thought that tries to forget itself. And then, when that fails, to bargain, to change everything, to fall asleep and go back to another point in time.In her own life, Clara has witnessed acts of selflessness, of empathy, whose motivations she does not doubt. She knows that a single act, a choice, can transform all that came before.When she first met him more than forty years ago, they had been drawn to one another because of their differences. One the surface, they had been north and south, light and dark. Back then, he had carried a hollow within himself, a grief that he could not share. To each other, they had seemed the way out, the path that leads along the river, finally opening on to the sea.He remembers the gentleness of his mother's hand in his hair, how when she stepped back from him, the imprint remained, a weight, a memory against his skin.Inside the crater, no wind blew. Outside, on solid ground, there were strips of shade and light, but in her the light turned strange, almost liquid. there were no plants, nothing that grew. The bottom of the crater curved up like a boat, a hollow in which he and Ani could rest. In here, he, too, became something else, his body so insubstantial it seemed a memory of itself. Only by removing himself completely from the crater, by climbing carefully back over the lip could he become whole once more.In the decades that followed, he returned only twice, both times thinking that he could find a reason, a person who could bind them together, contain his memories, finally.XXShe seemed to want change, within herself, between them, and she believed all things were possible. She said that the past is not static, our memories fold and bend, we change with every step taken into the future. She believes in the present moment, that a decision made now can shift the balance, the every act realigns the past. Imagine it this way, she had told Matthew. It is like walking across a vast field as the sun rises, burns and slowly falls. The shadows around us change depending on which direction we walk, what steps we choose to take.He said that in Tawau, those memories had begun to fade. He did not know how such a thing was possible, but the past had become like a book submerged in water, the ink running across the lines, all the detail lost.She shut her ears to the disbelief in his voice, to her own grief. She told him that they were alike, two pieces of the same puzzle, but in the end, if you laid them down beside each other, you'd see an empty space, the jagged edges. And in this space, she knew there was no oxygen, no relief. It was a place they had made together when they were children. They had filled it with all the things they wanted to forget, a landscape of craters and bodies. She said that their feelings for one another had blinded them to the truth, what lay between them was too far-reaching, too vast. They could not hold it or push it down.He kisses her, and she knows, somehow, that he is asking for help, for an end to the sadness they are causing one another. Asking because, after all these years together, it is the only thing that might save them.He and Ani had moved easily between Dutch, English and Indonesian; they had many languages within their reach....He believes that the human body has some other means of communicating, some way that is yet to be categorized by science, or by language itself.They both had to have the truth between them, to understand what had been lost, to know how to go forward.The space between them grew, expanding out, until she seemed as insubstantial, as ghostly as the dust in the light. She stepped away, releasing his hand so gently that he almost missed the moment when it slipped from his.She listened to their voices, this knitting together, felt as if she were balanced within, a soul sheltered between the past and the present.When they parted, he left as if he would be seeing them again, shaking Wideh's hand, then putting his lips to the boy's hair. She knew that what she and Matthew had shared in childhood had carried them safely through, a net where all other lines had been torn away. All these years, the net had held. His eyes rested on Ani's face. They said goodbye to one another, and then he stepped away from them. She saw what he had given her, the one thing her parents had been unable to do, prepare her for this parting, this letting go.For a moment, the future comes to her, as vivid and clear as a memory fading. The highway rises onto a plateau, the land falls away.xHe said to Gail that sometimes the past could not be made right, not every experience could be made to fit. \"I left Sandakan believing that I had to push pieces of my life away. I thought the worst thing would be to lose a sense of balance, to fall. This is how it seemed to me. But I was wrong to hold.\" He hesitated, but something in her expression pushed him to continue. \"I never told you how your mother saved me.\"So many thing, he thinks, that we carry all our lives, in the hope that what we know will finally redeem us, that we will find something that abides, even now, in the indefinite, the uncertain, hereafter."}, {"userName": "Susan", "userReviewDate": "Jul 12, 2017", "userURL": "http://www.goodreads.com/user/show/23275064-susan", "userReview": "The debut novel by a recent Giller Prize winner. It tells the stories of 2 generations currently living in Vancouver but ultimately revealing the past beginning in North Borneo during World War II. The exploration of grief, the effects on loving relationships of war time survival and the slowly revealing history of the characters is compelling. Having said all that, for some reason I had trouble keeping track of events as the narrators shifted from chapter to chapter. So, I wasn't as engaged as I might have been."}, {"userName": "EsthaL", "userReviewDate": "Oct 17, 2017", "userURL": "http://www.goodreads.com/user/show/65233787-esthal", "userReview": "A very strong start with a poignant tender ending, the only thing that did not work for me was the emphasis on too many characters and storylines. The experience of grief in this book is palpable and in my opinion its strongest part. Thien's writing retains its charming softness and is a joy to read."}, {"userName": "John Ray Catingub", "userReviewDate": "Jan 09, 2018", "userURL": "http://www.goodreads.com/user/show/19864016-john-ray-catingub", "userReview": "Thien's first novel shows her narrative strengths that will be fully utilised in \"Do Not Say We Have Nothing\". She weaves stories together very well although the result is not as clean and satisfying as it is in her later work. I did not like that some of the threads were not tied up neatly. Otherwise, a very good story."}, {"userName": "Richard Lehingrat", "userReviewDate": "May 29, 2017", "userURL": "http://www.goodreads.com/user/show/14605540-richard-lehingrat", "userReview": "Where's the other half of this story? What about the unfinished radio documentary? **"}, {"userName": "Marilyn", "userReviewDate": "Jun 24, 2017", "userURL": "http://www.goodreads.com/user/show/4663624-marilyn", "userReview": "I liked it but was left alone without a storyline to keep me going. I liked the Vancouver setting and the role of parenting and the deep understanding of grief."}, {"userName": "Deb Brunt", "userReviewDate": "Sep 20, 2017", "userURL": "http://www.goodreads.com/user/show/10532734-deb-brunt", "userReview": "3.5"}, {"userName": "yanster", "userReviewDate": "Nov 02, 2017", "userURL": "http://www.goodreads.com/user/show/4566786-yanster", "userReview": "Always a pleasure to discover (relatively) recent noteworthy additions to the Asian American/Canadian canon."}, {"userName": "Amy Do", "userReviewDate": "Sep 24, 2010", "userURL": "http://www.goodreads.com/user/show/4334736-amy-do", "userReview": "I realized that I liked this book more after my second time reading it. A year ago I gave it three stars, feeling that it didn't live up to \"Simple Recipes\", but I've changed my mind after spending another month re-reading the story. That rarely happens to me, but in this case, Madeleine's beautiful writing became even clearer and more intricate after I revisited the book. I felt like I was reading an entirely new novel, with new depth and dimensions of emotions unfolding themselves within Thien's prose-like story of love, redemption, war and forgiveness. Thien writes some of my favorite lines in fiction. There is something soft, calm, reassuring, precious, yet sentimental, sad and vulnerable about the lines that she writes. Her words are so gentle that I let my guard down and believe that her stories are nice and quiet, yet when I've already indulged peacefully in the smoothness of the words, she captures my heart with terrible stories of loss. When Thien opens her novel with the beautiful scene of Ansel slowly waking up next to Gail; their intimacy and calmness mislead me into thinking about how happy this tale would be; little did I know that as the story unravels, the sorrow and quiet sufferings of the characters in this book is nothing alike the opening.However, unlike the typical melodramatic novel, \"Certainty\" does not call for attention to the brutality and gruesomeness of war. It concentrates on the sentimental and personal emotional journey that follows the devastating scenes of war. Images of the dead and captured appear sporadically in the background; only once, when Matthew's father was murdered, was the dead addressed in detail. For most of the novel, it is the people's thoughts, emotions and decisions that depicted the loss and sadness of those whose lives were stained so deeply by the fighting and killings. Just like in \"Simple Recipes\", Thien writes with an astonishing emotional purity and calmness. Emotions suddenly appear clear and mature, rather than impulsive and turbulent. That is where the feeling of solace and compassion comes from. Thien provides her readers with sympathy and strength in dealing with sorrowful subjects, especially in grieving for the deceased. \"Do you think there's a biological purpose to grieving?\", Thien writes, \"I guess it's to keep us alive somehow.\" I also felt \"Certainty\" was like metaphysical poem. Thien brings in topics from biology, astronomy, history, photography and cryptography for her metaphors on life and suffering. \"Perhaps you are asking too much of a picture\", Ani said to Sipke, a photographer and painter. But was Ani only talking about Sipke's work, or was she talking about life and choices? Perhaps we are asking too much of our choices, when in many cases we could only do the best we can. And when Jaarsma tries to explain the Mandelbrot Set to Gail, he says, \"The boundary encloses a finite area, but the boundary itself is infinite. No matter how much we increase the magnification, the same shapes appear and reappear in the border, though never quite the same.\" Perhaps life is like that too; it's difficult to analyze correctly an event, or emotion, or time of our lives, because all of them contain more events, more emotions. And one of my favorite lines I've ever read about Vancouver was from this novel: \"In Vancouver, there are many varieties of rain, but the most common, he believes, is the kind that tries to convince you it isn't there [...]\" If you've ever been to Vancouver, you would know how much it rains, days and nights and months and seasons. But perhaps the rain is just trying to hide away in the background, like a quiet child trying to escape from adult's scrutiny and scoldings. In the end, though, I would have liked if Thien ended the novel a chapter shorter. The resonance of Ani and Sipke's life would have been a beautiful and happy ending. Returning to Vancouver in the last chapter about Gail and Matthew seems a bit redundant. It is certainly not a book of fast-paced plot and compelling storyline; its beauty lies in the expressions and style of writing that Madeleine Thien is praised for."}], "description": "Madeleine Thien's stunning debut novel hauntingly retells a crucial moment in history, through two unforgettable love stories. Gail Lim, a producer of radio documentaries, is haunted by the mystery of her father's Asian past. As a child, Gail's father, Matthew Lim, lived in a Malaysian village occupied by the Japanese. He and his beloved Ani wandered the jungle fringe under the terrifying shadow of war. The war shattered their families, splitting the two apart until a brief reunion years later. Matthew's profound connection to Ani and the life-changing secrets they shared cast a shadow that, later still, Matthew's wife, Clara, desperately sought to understand. Gail's journey to unravel the mystery of her parents' lives takes her to Amsterdam, where she unearths more about this mysterious other woman. But as Gail approaches the truth, Ani's story will bring Gail face-to-face, with the untold mysteries of her own life. Vivid, poignant, and written in understated yet powerful prose, Certainty is a novel about the legacies of loss, the dislocations of war, and the timeless redemption afforded by love.", "title": "Certainty", "url": "https://www.goodreads.com/book/show/474662.Certainty", "average": 3.47, "cover": "https://images.gr-assets.com/books/1344270716l/474662.jpg", "reviews": 64, "authors": [{"url": "https://www.goodreads.com/author/show/265535.Madeleine_Thien", "name": "Madeleine Thien"}], "type": ["Fiction", "Cultural", "Historical", "Cultural"], "outlinks": ["http://www.goodreads.com/book/show/474662.Certainty", "http://www.goodreads.com/book/show/35817778-certainty", "http://www.goodreads.com/book/show/1695013.Certainty", "http://www.goodreads.com/book/show/854748.Certainty", "http://www.goodreads.com/book/show/1384173.Certainty", "http://www.goodreads.com/book/show/2093195.Certainty", "http://www.goodreads.com/book/show/18397039-certitudine", "http://www.goodreads.com/book/show/6017025-varmuus", "http://www.goodreads.com/book/show/32887817-certainty", "http://www.goodreads.com/book/show/31549906-do-not-say-we-have-nothing", "http://www.goodreads.com/book/show/34068494-dogs-at-the-perimeter", "http://www.goodreads.com/book/show/961911.Simple_Recipes", "http://www.goodreads.com/book/show/1384174.The_Chinese_Violin", "http://www.goodreads.com/book/show/35091408-granta-141", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}