{"ratings": 117, "userreviews": [{"userName": "SmarterLilac", "userReviewDate": "Feb 12, 2009", "userURL": "http://www.goodreads.com/user/show/2025000-smarterlilac", "userReview": "At times dull, at times restlessly experimental, this book is like a lot of Oates' lesser works—too much filler undermining an otherwise interesting premise and plot."}, {"userName": "Nate D", "userReviewDate": "Jul 16, 2010", "userURL": "http://www.goodreads.com/user/show/406701-nate-d", "userReview": "Narrative easing out of dense fog. Or a camera focusing, slowly, from queasy blur. Disjointed run-ons. Description without object. Unsteady perspective: a character can recur in first person, second person, third person. Even in this reeling high modernist fashion, the five principle characters are warmly, believably rendered, all with interesting personal histories and psychology. Their voices can run together a bit in Oates' stream-of-consciousness, but I wasn't especially bothered. The central story, beneath all the embellishment, is a fairly simple one of a lonely middle-aged man who finds himself infatuated (self-destructively?) with a teenage girl, and so evoked bits of American Beauty and Ghostworld. But it is convincing conveyed here, and what can I say, I'm a sucker for this kind of embellishment (exactly the embellishment the other reviewers here apparently hated) and the prose is often beautiful. I wonder why this book seems to have fallen through the cracks. Perhaps Oates other work from this era is better -- or at least more approachable.I bought this on a whim, purely on the basis of the eerie evocative title and the fact I've never read anything from Oates besides scattered more recent short stories, and I was not disappointed."}, {"userName": "Pamela Scott", "userReviewDate": "Jul 02, 2014", "userURL": "http://www.goodreads.com/user/show/5554077-pamela-scott", "userReview": "This was my first time reading Childwold.I have to say, I really didn’t get on with it. JCO may be one of my favourite writers but Childwold proves not everything she writes is brilliant. Another favourite writer, Stephen King proved this with his two novels of 2014, Mr Mercedes and Revival which were both stinkers.The premise of Childwold is very similar to Lolita. I never had an issue with the subject matter. I think Lolita is a good novel even if the subject matter is unpleasant. I was looking forward to seeing how JCO handled a similar premise. As Childwold proves she didn’t handle it very well. The biggest issue is that JCO uses a stream-of-consciousness style in Childwold. One of my least favourite narrative styles. I found Childwold very disjoined and confusing. I struggled to understand what was going on. Did Kesch have sex with Laney? Was it all a weird erotic dream? I really couldn’t follow the narrative thread in Childwold. Stream-of-consciousness was very popular when Childwold was published. I don’t know if JCO was just jumping on the band-wagon or thought this was the only way to write about unpleasant subject matter. Either way, none of Childwold worked for me."}, {"userName": "Chip", "userReviewDate": "Feb 13, 2014", "userURL": "http://www.goodreads.com/user/show/2589619-chip", "userReview": "Written in the 70s, in the self-conscious style that was popular then. The story is a Lolita-esque relationship between a barely teenaged girl and a shell-shocked veteran of the Vietnam war, seen through a fog of suggestion, fantasy, and dream sequences. It is very difficult to pick out exactly what happens, but it is clear that something does, based upon the reactions of the characters. Another of Oates' \"Yewville\" stories. JCO today writes with authority and a clear eye, but this book is from early in her career and the clarity isn't there. She recently publicly asked if Nabokov should be called a \"child predator\" for writing Lolita (in the wake of the furor over Woody Allen's Lifetime Achievement Award from the Academy of Motion Pictures amid accusations of child abuse from a step-daughter (to which I point out that it doesn't help that Allen married another step-daughter - it tends to support the accuser's claim)). To that I ask if Oates considers herself a \"child predator\" for writing Childwold? Having read Lolita and Childwold, my answer is \"no\" but I genuinely wonder what Oates would say."}, {"userName": "Kay", "userReviewDate": "Aug 27, 2009", "userURL": "http://www.goodreads.com/user/show/331132-kay", "userReview": "I'm a die hard Oates fan, but I couldn't make it past the first ten pages of stream-of-consciousness rambling, almost entirely without actual events and context of any kind. Maybe someday I will have the motivation to pick it up and try again."}, {"userName": "Kristel", "userReviewDate": "Aug 07, 2011", "userURL": "http://www.goodreads.com/user/show/5933311-kristel", "userReview": "Cet ouvrage est d'une lecture exigeante à l'issue de laquelle on se sent récompensé. Plusieurs passages descriptifs et énumérations m'ont fait penser à du Zola."}], "description": "This is the story of an enchantment and its dramatic consequences. At the centre is the frustrated love of a man in his forties for a fourteen-year-old girl whom he meets and befriends.Drawn into her strange family and the haunting world of Childwold, he discovers that, while others find freedom for themselves, for him there is no escape. (From cover)\"[A] blowsy mother whose many children have many fathers; her 14-year-old daughter, Laney, and Kasch, an anguished intellectual who loves them both...The novel's tight Oedipal triangle opens into a triple alliance against age and aggression as each person tries to turn the biological clock back towards innocence. Laney's mother wants to bear children to narrow the world to a child's room. Laney starves herself to stop her menstrual cycle and prolong her childhood. Kasch in his insanity is harmless, nonsexual, helpless...Drawn by his vulnerability in the same way that Kasch was drawn by her poverty, Laney may cling to Kasch and he to her as children cling together in the dark.\" (New York Times, 11/28/76)", "title": "Childwold", "url": "https://www.goodreads.com/book/show/1893008.Childwold", "average": 3.28, "cover": "https://images.gr-assets.com/books/1306770995l/1893008.jpg", "reviews": 7, "authors": [{"url": "https://www.goodreads.com/author/show/3524.Joyce_Carol_Oates", "name": "Joyce Carol Oates"}], "type": ["Fiction", "Novels", "Literature"], "outlinks": ["http://www.goodreads.com/book/show/1893008.Childwold", "http://www.goodreads.com/book/show/1691396.Childwold", "http://www.goodreads.com/book/show/245387.Haute_Enfance", "http://www.goodreads.com/book/show/5204.We_Were_the_Mulvaneys", "http://www.goodreads.com/book/show/15967.The_Falls", "http://www.goodreads.com/book/show/15972.The_Gravedigger_s_Daughter", "http://www.goodreads.com/book/show/15975.Blonde", "http://www.goodreads.com/book/show/156222.Foxfire"]}