{"ratings": 1118, "userreviews": [{"userName": "Nancy Oakes", "userReviewDate": "Feb 09, 2012", "userURL": "http://www.goodreads.com/user/show/900340-nancy-oakes", "userReview": "There is a Sinhalese expression \"Konde bandapu cheena,\" which translates as \"ponytailed Chinaman,\" and connotes someone gullible -- someone who will believe anything. A \"Chinaman\" in cricket terms is (according to Wikipedia) \"a left-handed bowler bowling wrist spin (left arm unorthodox). For a right-handed batsman, the ball will move from the off side to the leg side (left to right on the TV screen). \" The question asked by the narrator of this novel is this:\"Is this a story about a pony-tailed Chinaman bowler? Or a tale to tell a pony-tailed Chinaman? That is for you to decide.\" Whatever your choice may be after finishing this novel, Chinaman is one of the best novels I've read so far this year. I know jack about cricket, which features heavily throughout the story; no surprise there, considering Americans are far more involved in football, baseball and basketball. Strangely enough, my lack of knowledge was not a drawback in any form. The mix of Sri Lankan history, contemporary politics, humor, the characters and the author's prose all come together to make this book an unforgettable experience.\"There is nothing more inspiring than a solid deadline,\" notes retired Sri Lankan journalist WG Karunasena, and after a long career of both sportswriting and serious drinking, he has been given his last one. His doctor has given him about a year to live if he does not stop drinking; if WG cuts down to two drinks a day, maybe a year or two at most. He decides that it's a good time to do a \"halfway decent documentary on Sri Lankan cricket\", and is obsessed with a cricket player named Pradeep Mathew, who he says, is Sri Lanka's all-time best cricketer. Mathew was a \"top spinner...,\" \"Chinaman, googly, top spinner and that amazing arm ball that god rid of the Aussie captain.\" Along with his friend and fellow cricket fanatic Ari Byrd, WG begins to gather information on Mathew, who has long-since disappeared from the cricket scene, official records and also from Sri Lanka, seemingly vanishing into thin air. As they start the documentary project, which will later evolve into a book project for WG, they run into several people who claim to know something about Mathew, and they run into others who do not want WG to go any further with the project. Is there some conspiracy at work here? As WG and Ari embark on their at times rather strange quest, WG's obsession with Mathew and his discussions about the game of cricket become a vehicle for exploring Sri Lankan politics and history, and life in contemporary Sri Lankan society. But there are other considerations at work in this novel as well, both on and off the cricket field -- relationships within families; friendships; politics and money that get in the way of sportsmanship; old age; the sadness and regret of wasted lives; the inescapable power plays -- all presented in a style that fits well into the story without ever getting overly preachy. And then there's WG himself -- should anyone even believe his ramblings, considering his alcoholic bent toward self destruction and considering the characters that populate this novel? There's WG's old nemesis, once a rival for WG's wife Sheila, who may or may not have had six fingers and who may or may not have been Mathew's school coach ; a midget who claims to have had an underground bunker and to have secretly taped damning conversations on the cricket field; a friend of WG who may or not be a pedophile; and there's WG himself, the very center of the novel. The story is punctuated throughout with definitions of cricket terms, diagrams of different cricket techniques, parts of the field etc, largely to help the reader and to move the story along. . There are also fuzzy photos here and there that may or may not lend credence to WG's search for the truth about Pradeep Mathew. Chinaman is funny and downright sobering at the same time, which given the seriousness of the history of ongoing problems in Sri Lanka is a good juggling act, keeping the reader entertained on one hand while exploring the problems of this nation. And then there's the sports aspect: the author clearly brings out the \"magic\" moments of sporting events that tie people together: \"sport can unite worlds, tear down walls and transcend race, the past, and all probability. Unlike life, sport matters.\" As WG notes, \"In thirty years, the world will not care about how I lived. But in a hundred years, Bulgarians will still talk of Letchkov and how he expelled the mighty Germans from the 1994 World Cup with a simple header.\"As an American who knows little to nothing about the sport of cricket, at first the book was a bit daunting, even though the author lays out the basics and then throws in bits about different throws or batting techniques. When I realized that this could be problematic, I went to the internet for help in getting a quick rundown on how this game is played -- problem solved. Cricket might be a sticking point for some readers in this country, but ultimately I discovered it didn't really matter -- the overall story is so good and is so well told that my lack of cricket knowledge was only a momentary glitch that really did not distract from the narrative. The ending may be a bit gimmicky for some readers, but the book's good points are so numerous that they outweigh any negatives. Whether or not you care about cricket, I definitely and highly recommend this book -- it is that good, offering its readers a glimpse into life in another country, and into one man's journey of discovery in his last months of life. It's a beautiful book, and I hope it finds other Americans to cheer it on."}, {"userName": "Sairam Krishnan", "userReviewDate": "Sep 12, 2015", "userURL": "http://www.goodreads.com/user/show/8056568-sairam-krishnan", "userReview": "I had been thinking about buying this particular novel for some time, and I found it at the Landmark at the Mylapore City Centre, now defunct. They were closing down, and some genius had stowed a beautiful yellow hardcover of Snehan Karunatilaka’s cricket novel in the lowest rung of a rapidly-emptying, discounted bookshelf. It was priced at INR 36, less than even the big glass of filter coffee at Saravana Bhavan, which is INR 45. I was overjoyed, and billed it immediately, lest someone recognise their mistake and price it back at what should be at least 200 or 300 rupees.I didn’t read it then, though. I kept it at the bottom of my own shelf and proceeded to look at it wistfully at intervals, until last week. India had just returned from a rather successful tour of Sri Lanka, winning a test series after 20 or so years. I watched the Galle test, and was consumed by a desire to go watch the next game from the fort. Alas, the next Galle match is very near in time and I won’t be able to raise enough funds that quick. However, since I was thinking about cricket and Sri Lanka, I picked up the book from my shelf, dusted it off, and start reading.Chinaman is not the best sports novel I’ve read. That, perhaps, would be Chad Harbach’s The Art of Fielding. And I can’t talk about cricket novels, because this is the only novel about cricket I’ve read. There is another that has been suggested to me, a novel about cricket among immigrants in America, the name of which eludes me now.What Chinaman could be, as has already been suggested, is the first great Sri Lankan novel.In the way the best stories about sports are, the book is about so much more than cricket itself. It’s about the island and a people, a way of life and a nation, the story of a sport and the obsession with it. There’s so much about cricket itself, which, for a lover of the game like me, translated to hours of pleasure, but the reason Chinaman is so good is because it relates life and the sport in ways you can only read, smile and nod about. You don’t need to know the game to read this book, you’ll love it anyway.It’s an extraordinarily skilful work, told in spurts of little stories, anecdotes and cricket lore. God only knows how he structured it, and I’ll have to read it several times to get a feel for how he managed to execute the narrative. It does sag at places, and very clearly at the very end, when the old drunk who we’ve come to know and love so intimately is not narrating the story. But who cares? By that time I was so taken by the reading experience that I was willing to overlook anything.The island is in these pages, it’s sweltering afternoons and its beautiful sands, its people and their lives, its war and what it brought, sport and what it means. One answer to that last question I found on two pages a little to the end. In the words of our W.G. Karunasena:Some people gaze at setting suns, sitting mountains, teenage virgins and their wiggling thighs. I see beauty in free kicks, late cuts, slam dunks, tries from halfway, and balls that turn from off to leg. When the English toured in 1993, their supporters arrived in droves and formed a jolly beer-swilling troupe called the Barmy Army. A t-shirt of theirs read as follows: One day you will meet a goal you’ll want to marry and have kids with.Anyone who saw Diego Maradona in 1986 will agree that the t-shirt speaks the truth. To be in the right place at the right time and to watch a gifted athlete is one of life’s true pleasures.In sport, has-beens can step onto a plate and smash a last ball into oblivion. A village can travel to Manchester for a cup tie and topple a giant. Villains, can heroes become.In 1996, subcontinental flair overcame western precision and the world’s nobodies thrashed the world’s bullies. 60 years earlier a black man ridiculed the Nazi race theory with 5 gold medals in Berlin before Mein Fuhrer’s furious eyes.In real life, justice is rarely poetic and too often invisible. Good sits in a corner, collects a cheque and pays a mortgage. Evil builds empires.Sport gives us organism that attack in formation, like India’s spin quartet and the three Ws from the Caribbean. Teams that become superhuman right before your eyes. Like Dalglish’s Liverpool, Fitzpatrick’s All Blacks, and Ranatunga’s Lankans.In real life, if you find yourself chasing 30 off 20 balls, you will fall short, even with all your wickets in hand. Real life is lives at 2 runs an over, with a dodgy LBW every decade.In 30 years, the world will not care about how I lived. But in 100 years, Bulgarians will still talk of Letchkov and how he expelled the mighty Germans from the 1994 World Cup with a simple header.Sport can unite worlds, tear down walls, and transcend race, the past, and all probability. Unlike life, sport matters.Yes, it does.Sometimes I’m asked why I watch cricket with the intensity that I do, and at other times I’m asked why I choose to spend half a day buried in a book when I could be doing something else. This here is one of the passages I can show them before I ask them to fuck off."}, {"userName": "Usman Hickmath", "userReviewDate": "Mar 28, 2017", "userURL": "http://www.goodreads.com/user/show/66366804-usman-hickmath", "userReview": "Fierce war, suicide bombings, change in government after 17 years, weakening economy, struggling middle class families and in the midst of all a cricket team which was the only solace of people: Shehan has taken this backdrop to tell the story of an exceptionally talented, rebellious and mysterious cricketer and a retired sports journalist.Never in my life had I imagined that someone will take the story of bars and betting centers of Colombo, prestige issues and politics involved in school cricket, corrupt officials, mood of the city during the nights when the team won matches and the beautiful evenings of Colombo where we can see, through the gaps of fences, players practicing, to international readers. Shehan has done that and he has done that so beautifully. A must read."}, {"userName": "Waqas Mhd", "userReviewDate": "Nov 10, 2011", "userURL": "http://www.goodreads.com/user/show/6515529-waqas-mhd", "userReview": "This is one of the best books I’ve read this year (2011). Let me start with telling this first, I used to like and play cricket a lot. But over the time I just got dragged away from the game and lost all interest in the game. Now I hardly watch or play it. I am not interested in cricket anymore.So for exactly this reason I was reluctant to pick this book up, thinking of it containing all sort of cricket clichés and stuff, which is another way of making myself bored. I only bought it on the forced recommendation of a friend who also doesn’t like cricket but told some good things about this book. Although, I bought it, it stayed in my ‘to-be-read’ bucket for longtime after my buying it. Finally when I decided to read this book, I wasn’t expecting much and thought I wouldn’t be able to go beyond first few pages. So I wanted to get done with it asap, without wasting my time on something I wasn’t interested in.But to be honest I was sucked right into it from the start despite my lack of interest in the cricket. Shehan’s got brilliant writing style that never feels tedious or overbearing. Writing flows from one heading to another at quite reasonable intervals so you don’t feel stuck under same chapter for long. Book is actually divided into 5 main parts (2nd being the longest).Reading the blurb would make you think that its chockfull of cricket terminologies that would require thorough background knowledge of the game on your part as pre-requisite. Well, I cannot say completely no to it and I can understand if someone is not aware of cricket, it could be hard to digest this book for him, but you don’t need to know the game in detail. And knowledge about name of certain cricketers will let you enjoy this book a lot more. What I realized that it wasn’t as much about the game of cricket itself rather it portrays Srilankan society, its culture and its ugly politics both in and out of the game. Cricket is part of the story but these other stuff makes this book very interesting."}, {"userName": "Jaanaki", "userReviewDate": "May 15, 2018", "userURL": "http://www.goodreads.com/user/show/6265957-jaanaki", "userReview": "This book is the second exceptional book that I enjoyed reading this year.Most of Srilankan fiction talks about the atrocities of the civil war and I wanted to read something different that would also lay bare the soul and spirit of the island nation .*******************Snehan Karunatilaka actually does that by giving us a telescopic view of Srilanka through the eyes of cricket fanatic,aged and retired sports journalist and dying alcoholic Mr.W.G Karunasena ,lovingly called Gamini by his wife Sheila and best friend Ari Byrd.Once ,he realises he has only a few days on planet Earth ,he decides to spend his remaining days writing a book on elusive cricketeer Pradeep Matthews ,who he feels is the best spinner the world has ever produced ,an unsung hero whose records have been vengefully erased and who has disappeared from public life since 1995 .His search for Matthews is the backbone for the entire story and it is ironic because in the process Gamini tries to search for his heart and spirit which he lost to alcohol many years ago.I love the fact that the author effortlessly has interweaved a friendship between two old men that has lasted over decades ,a rivalry between two old men,a marriage that still has a lot of love in it inspite of a lot of wear and tear over the years in the form of dead hopes and unfulfilled expectations and Srilankan cricket history into the story.We also have a midget,cricketing syndicates,caste differences, bombings ,cricketing anecdotes and the LTTE all thrown into the story.He cleverly shows the reader the quirks and behavior of Srilankan society at various levels.The writing is philosophical,humorous and cheeky in many places and we realise halfway through that the writer loves his cricket and his country.One can sense the writer's sadness when Gamini says that whatever the difference between the Tamilians and Sinhalese ,it is not so big that they have to shoot bullets at each other or burn down libraries or his disappointment when another character Johnny says that this is a beautiful country but you are going to destroy it.This book is a celebration of cricket and Srilanka as a nation .Don't miss it if you are a die hard cricket fan"}, {"userName": "Rohit Enghakat", "userReviewDate": "May 29, 2018", "userURL": "http://www.goodreads.com/user/show/15355957-rohit-enghakat", "userReview": "I came across this book on GR and was absolutely bowled over (pun intended) by the blurb, the beautiful cover and the reviews. This is a fantastic story about an alcoholic sports journalist W G Karunasena and his quest to uncover the story of Pradeep Mathew who was perhaps the greatest spinner to have bowled on the Sri Lankan pitches. He is aided by his friend and neighbour Ari Byrd and a couple of other colourful characters.The author has spun a beautiful story incorporating the politics of Sri Lankan cricket and the country. The book has anecdotes of cricket in the 80s and 90s. It also gives an insight into the Srilankan people and culture, the racial tensions between the Sinhalas and the Tamils and a little bit about the LTTE. He has also explained each and every cricketing term and jargon with beautiful illustrations so as to make it inclusive to a non-cricket fan. But according to me, this book can only be enjoyed by a cricket fan or at least somebody with a passing interest in cricket. However, I found the book a bit too long. Otherwise, this is a brilliant piece of work by the author."}, {"userName": "Amina", "userReviewDate": "Aug 06, 2012", "userURL": "http://www.goodreads.com/user/show/9443625-amina", "userReview": "A book about cricket... yes i know i live in South Asia and we're all a little obsessed with this game but a whole book seriously? The answer: OH YES PLEASE!!!!!. This book made me keep going back to Google and wishing with all my heart that the bowler Pradeep Mathews was a real person, that he existed, that he was as great as sports writer W.G. Karunasena made him out to be, that his life was mostly bad luck, that he did disappear to live a life of obscurity. I Googled not just him but all Sri Lankan cricketers to see if he was at least based on someone. Pardeep Mathews is a character you wish would just step out of the book and be. And the brilliance of it, even for someone who finds the game (except during World Cup days) a tad bit boring i fell in love with every aspect of it."}, {"userName": "Indika De Silva", "userReviewDate": "Jan 19, 2014", "userURL": "http://www.goodreads.com/user/show/15764754-indika-de-silva", "userReview": "The following book contains 3 elements that is nearest and dearest to many Sri Lankans including myself. That is Cricket, Sri Lankan society/politics and alcohol. Shehan Karunatilaka takes us through a wonderful adventure through all these elements and much more in this rather long but highly enjoyable novel.If you are a fan of cricket I highly recommend this book to you. If you wish to analyze the Sri Lanakan society grab this book. For crying out loud... If you have some part of you which is Sri Lankan; then read this book. It is awesome.The only question I have after reading this book in a very eager manner is... Who the hell is Praddep Mathews??I shall say no more..."}, {"userName": "Nilu", "userReviewDate": "Nov 17, 2011", "userURL": "http://www.goodreads.com/user/show/4080624-nilu", "userReview": "Probably the best Cricket oriented Novel, and one of the 'Best' novels I have read so far.Despite being a debut novel the book does not reek of amateur writing. It transported me back to the days of reading 'Jeeves' and other works by P G Wodehouse. Shehan has managed to retain the same vein of wit running throughout the book.Narrated through an aged, dying,alcoholic Sportswriter, we witness a tapestry of events that shaped Sri Lanka, told in a perspective of Cricket (the National Past time). Highly recommended to all Sri Lankans, who are also ardent Cricket Fans."}, {"userName": "Palmyrah", "userReviewDate": "May 25, 2010", "userURL": "http://www.goodreads.com/user/show/2364523-palmyrah", "userReview": "This is very probably the first novel written in English by a resident Sri Lankan author that has any literary merit whatsoever. It's insightful, realistic, funny, ironic and a guaranteed page-turner to boot. I don't even like cricket, but it still kept me reading.A full review, written from the point of view of a Sri Lankan reader, is available here."}, {"userName": "Shane", "userReviewDate": "Mar 29, 2017", "userURL": "http://www.goodreads.com/user/show/1798222-shane", "userReview": "A rather unusual novel that reads alternatively as a Cricket for Dummies instruction book and a History of Cricket scrapbook.The author weaves himself into this fictional tale along with well-known international cricketers, and I wondered how he gets away with it, for some of these personalities are not painted in a favourable light. After many local rejections, the final international publisher of the book within this book also hints to taking it on because “getting sued is good for business” - I hope the real book didn’t end up in any lawsuits! The focus on cricket, the anecdotal incidents throughout the history of the game, the how tos of the craft, the descriptions of the tools of the trade, and the speculations on what really happened behind the scenes of pivotal matches tend to overshadow the story line; we wonder whether the target audience comprises of only cricket-crazy Sri Lankans (of which I am admittedly one). But then, what of the larger literary, non-colonial readership who doesn’t understand this strange game; has it been given as many bones, as I have, to chew on?Alcoholic, self-destructive journalist W.G. Karunasena is on a mission to find out what happened to spin bowler Pradeep Mathew, who in his mind is the “greatest cricketer to walk the earth.” Mathew can bowl fast or spin, bowl right arm or left arm, and deliver several variations on his pitch, including the Chinaman and the double bounce ball - unheard of in any cricketer. Like his chronicler, and despite his talent, he is an undisciplined player who runs into conflict with coaches, managers, and the murky Sri Lankan Cricket Board (SLBCC) authorities who shield many secrets. Mathew’s behaviour finally causes the SLBCC to ban him from the sport and erase his spectacular record of bowling in the few matches he played for his country. W.G. with his unreliable chronicling of events, his picaresque behaviour, and his technicoloured language is the real hero of this piece; Mathew, when we finally encounter him, is a rather boring immigrant in the West, who has been tamed by time and circumstance, with his myth reading larger than his reality. Through W.G.’s pursuit of Mathew, the author takes the opportunity to observe, expose and condemn all that is wrong with Sri Lanka, from its discrimination of minority Tamils, to the shallowness of Colombo society, to match-fixing by the authorities, to the local mobsters and politicians who infiltrate the game as Sri Lanka rises in the ranks of the global cricketing hierarchy and arrives at the pinnacle by winning the World Cup in 1996. Some of these observations are not earth-shattering and are typical of Sri Lankan society, and have no bearing on the story: e.g. paying bribes to get a student into a Catholic school. Some of the one-liners that the author relies on so heavily to keep us engaged in this long narrative would be best understood only by a Sri Lankan audience: “...ode to Surangani and her fish.” Some condemnations are blatant: “Unlike our sub-continental brothers, we do not throw bottles or light fires. We save our barbarism for the north and the east.”There were times when I wondered whether the author had squeezed out every statistic, anecdote and joke he had encountered in his life in Sri Lanka and thrown them into this book. The jerky story line that jumps back and forth in time, and which is interrupted constantly by side descriptions of certain aspects of cricket, or by historical incidents that occurred in the sport, just as we are getting to a juicy part in the narrative, is a bit irritating and impedes the flow of the novel. And the end, as described by W.G’s literary agent Enid (Blyton?), flagged. However, the narration and the dialogue are typically Sri Lankan - caustic, flamboyant and funny - and I laughed a lot.As I finished the book, I came back to my original question: “Novel, Cricket for Dummies, or a History of Cricket scrapbook?” I guess the reason this book has won so many awards in Asia, must mean that it is still considered a novel, albeit a new inflection point in its evolution. The author’s courage to go where no one has hitherto dared in this art form, like his heroes W.G. and Mathew did in their respective pursuits, is to be commended."}, {"userName": "Stephen", "userReviewDate": "Jul 26, 2012", "userURL": "http://www.goodreads.com/user/show/1905272-stephen", "userReview": "I must slightly caveat this 5* - if you're interested in cricket, the subcontinent (especially Sri Lanka) and have a tolerance for fictional unreliable memoirs, then you may love this book. If you are deficient in any of these criteria, this may not be the book for you.However- for those still with me - I think this is a wonderful book. All about unfulfilled ambition, and legacy. And the beauty of sport. The beauty and the glory and the capriciousness and the tragedy - in short, the romance. All set against the backdrop of the history of Sri Lanka, with its civil war and corruption and bigotry, and punctuated by cricket matches. It is sad and sweet, and suffused with the wisdom and acceptance of old age (impressively, this despite being the first novel by Karunatilaka).The book is named for the stock delivery bowled by an unorthodox left-arm spinner - the main delivery bowled by the main character. The plot follows a dissolute sports writer W.G. (Wije) Karunasena and cricket fan trying to find out what happened to Mathews, the greatest bowler Wije had ever seen.Is Mathews fictional or real? It is difficult to know what's real and made up - certainly I recognised many of the cricketing stories. Having done a little bit of research I would say the vast majority is fiction, but Karunatilaka has done a great job of weaving the two together. This greatly enhances the \"unreliable narrator\" aspect of the book - if you don't know what bits have been borrowed from the real world, it's impossible to know which bits are supposed to be made-up in the suspended-disbelief fictional world. In my googling, though, I found a couple of faked up websites about Pradeed Mathews - versions of cricinfo.com and crikipedia (with a strategic '1' in place of an 'i') - clearly created as supporting material for the book (one of these pages is featured in the book, but I only reached that after I found the page myself). So you have a fictional book that uses stories from the real world, with fictional bits leaking back out into the real world - it's kinda fascinating (and I'm certainly not saying it's unique, but it was very pleasing and effective to stumble across these fictional spillages).http://pradeepmathew.com/http://cric1nfo.com/player/srilanka/a...http://crickiped1a.com/record/engine/...Minor faults: it is somewhat romaticising of alcoholism (this is well reversed by the end, but may be jarring during the reading). And I found it a bit tricky to keep track of all the side characters. This is partly due to unfamiliar Sri Lankan names, but also because of the discursive nature of the narrative. I don't think these hamper the book particularly."}, {"userName": "Lisa", "userReviewDate": "Nov 18, 2012", "userURL": "http://www.goodreads.com/user/show/1758411-lisa", "userReview": "Most of the other reviews of this book that you’ll come across have been penned by people who love cricket and understand it properly. But as one who has done her best to avoid any exposure to the game ever since being dragged off to an interminable test match at the MCG by a well-meaning MIL in 1972, I am here to tell you that you can have a deep-seated antipathy to all forms of sport in general and you can rejoice in complete ignorance about cricket in particular - and still love Chinaman, The Legend of Pradeep Mathew by Shehan Karunatilaka. All the reviews I’ve seen quote this snippet, and so shall I, because it’s true: If you’ve never seen a cricket match; if you have and it has made you snore; if you can’t understand why anyone would watch, let alone obsess over this dull game, then this is the book for you.I loved the novel’s sly wit, its penetrating social and political critique, and its delicious portrayal of human nature. The male friendship between W.G. and his mate Ari is especially well done.To read the rest of my review please visit http://anzlitlovers.com/2013/05/11/ch..."}, {"userName": "Brian", "userReviewDate": "Jul 10, 2012", "userURL": "http://www.goodreads.com/user/show/8741162-brian", "userReview": "I won't say this is my favorite novel, nor one of my favorites. I will say I had more fun reading it than almost any other book I can think of. I am a huge sports fan, but I don't know anything about cricket. The way this book approaches the sport makes it universal for any fan. The characters, the emotions and most of all the foreboding sense of doom of the underdog fan feels so familiar, and comfortable, to me.But there is more to this book. The search for Mathew is funny, smart, and maddeningly twisted in its plot. It's an enjoyable detective story wrapped in a look into a (to me) unfamiliar sport in a far away country and culture. Honestly, how could I not like it?"}, {"userName": "Sankarshan", "userReviewDate": "Apr 10, 2011", "userURL": "http://www.goodreads.com/user/show/732796-sankarshan", "userReview": "You need to do a bit of reading up on the side about the matches and the players mentioned.But in all this is a splendid book.Calls out for a re-read."}, {"userName": "Abhaga", "userReviewDate": "Apr 15, 2018", "userURL": "http://www.goodreads.com/user/show/7188699-abhaga", "userReview": "Lots of cricket, lots of booze and all kinds of fantastic tales. Fact and fiction are spun up into an enticing weave in this story of a drunkard sports writer chasing a missing spinner whom he considers to be the greatest cricketer to walk the earth.This was an enjoyable read. It is also nicely wrapped up in the end although did feel a tad too long."}, {"userName": "Renuka Mendis", "userReviewDate": "Jul 28, 2014", "userURL": "http://www.goodreads.com/user/show/33393213-renuka-mendis", "userReview": "I could write a book about Chinaman; but its late and I am a bit drunk. So consider this a shitty first draft. I hope its ok to say shitty on goodreads.A post colonial post post modern and well earned insult to colonialism and its barbarities; legacies and loves. Consider jonny; ahem and cricket. And a sweet sweet love song to cricket the way Sri Lankans see it, do it and love it. A highly realistic tale about Colombo people; their lives, loves, hypocricies and most of all their sometimes maddening yet occasionally adorable and definitely scary craziness.Well. I've read Chinaman three times over the last two or three years and pining to re-read except for the stack of un-read books tugging at my skirt each time I pass them. At the outset I wonder if non-Sri Lankans will understand the gems in this book. And even for some who are not from Colombo some of it might go over their heads. Let me elaborate but not now. Later. In a twisted way I like that the book contains so many Srilankanisms (if there is such a word) and that not everyone might get it. The achingly tenderest morsels in Chinaman are the few times when WeeGee talks about his long suffering wife Sheila in the tenderest way he can possibly come close to for an Arrack loving cricket obsessed drunk. And of course his love for Jonny is the benchmark for friendships for the ages. Irrespective WeeGee is a great man. More on that later.The cruel corruptions that is the Colombo bureaucracy and the lives they destroy.Beautifully written; Thousands would kill to write like him. Funny and even better --Sri Lankan funny! But with substance to every page. And read it also to find out what I.E. Kugarajah told WeeGee and here is a bit of a priceless (see I told you. insider's privilege) catalogue I kept note of:1. That the Jaffna of his childhood was the most beautiful place on earth.2. That he invaded the pitch in 1975 during an SL vs Aus World Cup Game at the Oval, carrying an Eelam flag.3. That he lost more relatives in the 1977 anti-Tamil riots than he did in 1983.4. That he was a founding member of Eelam Revolution Organisation of Students in Wandsworth in 1978.5. That it matters not whether you believe the Tamils were only brought here in 1823. Or whether you accept that they’ve been here since King Ellara Cholan’s reign in 100 BCE. They are now here to stay.6. That most Sri Lankan Tamils and many Muslims would fail Lord Tebbit’s famous cricket test.7. That the Burghers told to ‘burgher off’ in the 1960s by the Sinhala Only policy were the island’s first example of ethnic cleansing and its biggest cultural loss.8. That ministers who laugh loudly, cry openly, bomb civilians, and burn libraries deserve to die.9. That he trained with Palestinians in Beirut in 180 and several Tamil recruits died during that training.10. That Buddhist priests have no business carrying handguns.11. That many Sri Lankan geniuses have been Tamil. Anandan, Sathasivam, Mathew, Kadirgamar, Ediriweerasingham, and the Thalaiver himself.12. That everything has a price. And that a Sri Lankan victory is far more expensive than a Sri Lankan defeat.13. That Satyagraha does not work.See I told you at the beginning I'd lose you. This stuff is arcane to outsiders. Insiders privilege and all that. But for insiders this is flesh and blood. Fear not you'll find your way. Its worth the trip. All the bloody way to New Zealand. Yup.More to follow. In the interim -- this is in my top ten books list. I am not being arrogant, believe me I am a nice person but I feel sorry for anyone who has not read Chinaman; or indeed is unable to devour it as if it were a wonderful plate of your mother's yellow rice with a killer beef curry, brinjals, ATD etc. etc. with Watalappam for desert. And of course Arrack on the side.More later. Await a properly written review soon. Read the book. Really. Read it. No sh*t. You thought ceylon tea was the best thing that came out of sri lanka. No man. This is it.hicis. as they say in Sri Lanka."}, {"userName": "Mark Staniforth", "userReviewDate": "Jan 20, 2012", "userURL": "http://www.goodreads.com/user/show/4106933-mark-staniforth", "userReview": "Sports writer W.G. Karunasena is drinking himself to death. The way he sees it, he has no choice. He needs the arack to sustain him through his final assignment: to resolve the mystery of Pradeep Mathew, the greatest bowler he has ever seen, and a man whose fleeting fame and subsequent deletion from cricket history begs unfathomable questions.In Chinaman, Karunasena, fondly known as Wijie by his friends and neighbours, and the most unreliable of narrators, given he is blind drunk most of the time, scours the Sri Lankan cricket hinterland in his quest for answers.He encounters bent officials, busty media executives, gangsters, paedophiles and midgets, all of whom seem to have their own vested interests in either hiding or entirely misrepresenting Mathew's story.What Shehan Karunatilaka has fashioned is, like Mathew's legendary delivery itself, a great, double-bouncing googly of a debut novel. It is by turns inebriated, bewildering and uproarious; a unique and dischordant symphony of tall stories, Sri Lanka-style.Karunatilaka has taken a brave step into that in-between world in which fiction and fictional characters are melded into an existing, factual framework. Most of the cricket matches are real, as are their protagonists, but the line is blurred to the extent that Mathew often interacts with them. The book's inherent unpredictability soon makes it impossible to separate fact from fiction, and this serves to perpetuate the Mathew myth: he may well be the greatest spin bowler the world has ever seen. Or he might just never have existed at all.If it is first and foremost a novel about cricket, and a timely exploration of the roots of the match-fixing scandal which still grips the game, it is also so much more. As Karunasena opines early in the book:If you've never seena cricket match; if you have and it has made you snore; if you can't understand why anyone would watch, let alone obsess over this dull game, then this is the book for you.'Chinaman' presents a rare insight into a modern Sri Lanka still (then) in the grip of the Tamil Tiger insurgency. On an individual level, it describes the determination of an ailing, ageing sports writer to take his last chance to make a mark in both his professional and personal lives. Sports writing can be the most vicarious of professions, in which even its finest exponents are forced to measure their achievements not through their own pen, but the greatness of others. It is almost as if, by restoring the memory of Mathew, Karunasena believes he will go some way towards making up for his own missed opportunities.'Chinaman' is an incredibly difficult book to describe in a way that does it full justice. The topics it raises go way beyond the boundary. It breaks just about every literary convention going: there are false starts, blind alleys and contradictions, and by the time you reach the reality-stretching coincidence which heralds this truly brilliant book's final pages, it will seem entirely fitting.Shortlisted for this year's DSC Prize for South Asian literature, 'Chinaman' indicates that Karunatilaka's talent will sustain much longer than that of Mathew ever did, or might have done."}, {"userName": "Dan", "userReviewDate": "Mar 25, 2012", "userURL": "http://www.goodreads.com/user/show/4589496-dan", "userReview": "\"I may be drunk but I am not stupid. Of course there is little point to sports. But, at the risk of depressing you, let me add two more cents. There is little point to anything. In a thousand years, grass will have grown over all our cities. Nothing of anything will matter.\" [pg. 14]\"Sports can unite worlds, tear down walls and transcend race, the past, and all probability. Unlike life, sport matters.\" [pg. 357]I know what you're saying. Nobody in their right mind would want to read a book about cricket. Well, saying that this book is about cricket is like saying Friday Night Lights was about football. Not really. Those sports just happened to be the backdrops for great stories and some wonderful characters. The only cricket knowledge you might need can be learned from a two minute visit to the cricket Wikipedia page. As long as you pick up the very basics of the game, that's probably all you really need.What really makes the book great has nothing to do with cricket. WG is a drunk sports writer, is dying from his drinking problems, and is kind of terrible to his family. I loved him. Having him as the narrator was so much fun. You'll learn a lot about Sri Lanka and what it's been like to live there over the last 20 years or so. You'll also laugh a lot because Shehan is a very sharp dude.WG is searching for Pradeep, the greatest Sri Lanka cricket player, who has disappeared. I think the greatest achievement of this book is nailing why we love sports so much as fans. It nails why I love basketball, why you love football, etc. Any sports fan would love this book I'd think. Also non sports fans. Anyone who has ever obsessed about something likely will dig this.Great writing transcends everything no matter what. Whether it's foreign fiction, or a book involving cricket, none of that really matters. This is just great writing. Period.Then there is the ending which is crazy and wonderful and perfect. I would describe the entire book in exactly the same way actually."}, {"userName": "Dimensions", "userReviewDate": "Jun 14, 2012", "userURL": "http://www.goodreads.com/user/show/8748820-dimensions", "userReview": "Having just come back from Sri Lanka to follow England in their 2 match Test series, this book had a special resonance to me, as the places, sounds and sights described by the author were still fresh in my mind.While it was suggested that this book would appeal just as much to non-cricket fans, it has to be said having a knowledge of the sport is a distinct advantage. But I wouldn't let that put off those who aren't familar with cricket, if anything a lack of knowledge would add to the sense of mysticism which makes this such a good storyline. Shehan Karunatilaka achieves many things in this book, he gives the reader an understanding of the cultural and historical make up of Sri Lanka, cricket, Sri Lankan cricket. But above all he should be applauded for the feeling of fun throughout the book, probably necessary considering the main character is approaching his death bed.The author also encapsulates beautifully the boundless enthusuasim for cricket which you can't fail to encounter when in the sub-continent. For Sri Lanka in particular, a relatively small island who are known throughout the world for winning the World Cup in 1996, it is more than just a sport.Karunatilaka very cleverly uses real names for players and weeves his fictional players into the plot, adding to the sense of realism. This book has one of the most clever endings I have ever read and leaves you asking the question: 'was it all real?'I want to end with a very funny passage from the book, which any cricket fans who has watched any India or Pakistan videos on Youtube will identify with!!\"I get sidetracked by a preview of the India Pakistan game where the readers comments begin with 'Dravid may struggle against Gul' and end with 'you goat fucking paki swine fukkers drink yo ma's urine and cum in your Dad's terrorist beard'.\""}, {"userName": "Manish", "userReviewDate": "Feb 20, 2013", "userURL": "http://www.goodreads.com/user/show/4362792-manish", "userReview": "Failed Sportswriter, failed dad, irresponsible husband and alcoholic W.G Karunatilaka is convinced during the last years of his life, that one Pradeep Sivanathan Mathew who made a handful of appearances for Sri Lanka was and will always be one of the greatest cricketers to ever hold a cricket ball. Armed with this conviction and a bunch of buddies, Karunatilaka embarks on a quest to uncover the truth behind the disappearance of this gem of Lanka and the reasons for his exploits purged from all official stats. The exploration leads him to an LTTE warlord, cricket administrators of the Sri Lanka Cricket Board, young damsels, reserve cricketers and even the discovery of an underground dungeon with eavesdropping equipment below one of Colombo's famed cricket grounds.Written with irreverence, a tangy feel and a thin line between fact and fiction, this masterpiece from Sri Lanka is simply un-put-downable. Highly recommended to all fans of cricket and any person interested in breathing and living in Colombo within the comfort of your armchair!"}, {"userName": "☕Laura", "userReviewDate": "Sep 20, 2013", "userURL": "http://www.goodreads.com/user/show/15033381-laura", "userReview": "This book is very much outside of my usual genre, as I have little interest in sports and know nothing about cricket, but something about the concept intrigued me. The story is centered around W.G. Karunasena's quest to learn what has become of Pradeep Mathew who, though arguably the finest cricket player in Sri Lankan history, has been largely forgotten. Understandably, this book is very heavy in cricket-related content, but it is so much more than a book about cricket. W.G.'s meandering narrative is really the story of a marriage and a family, of friends, of the narrator's battle with alcohol, and of a nation in crisis. This book has a great deal of humor, yet there are moments that are so very poignant. This would easily have been a four-star read for me if I understood cricket or knew anything about Sri Lankan politics. However, my own ignorance of these topics made the book difficult to follow at times, especially when combined with the meandering style. Overall, though, an enjoyable and at times very beautiful read."}, {"userName": "Katie", "userReviewDate": "Dec 27, 2011", "userURL": "http://www.goodreads.com/user/show/1012012-katie", "userReview": "Not quite sure how I'd rate this one-- I thought parts were brilliant, some was long-winded, and one storyline didn't seem to really fit the overall narrative--a narrative that is not straight-forward at all, but inventive and engaging. The end pulled it together for me, for the most part (one part was still a little hard-to-believe). Will look forward to seeing the reviews, glad I stayed with it to the finish."}, {"userName": "Sonia", "userReviewDate": "Jan 23, 2012", "userURL": "http://www.goodreads.com/user/show/4104081-sonia", "userReview": "http://www.mediabistro.com/galleycat/..."}, {"userName": "James", "userReviewDate": "Oct 14, 2017", "userURL": "http://www.goodreads.com/user/show/10183886-james", "userReview": "Originality is by its very nature a rare thing, it always has been. But in today’s day and age, when a population can be entertained by re-dubbing, rearranging, remixing, rebooting, re-releasing, prequeling and sequeling, originality feels like it has almost become redundant, a commodity that’s no longer rewarded.Chinaman taught me that there is still hope for original ideas and concepts to be experimented with. Chinaman challenges the narrative tradition; it just about has a beginning, middle and end, despite there being considerable changes in the timeline, and the fact that it uses more literary devices than perhaps anything I’ve ever read. This is something that the author does very deliberately given the subject matter.Who and where is Pradeep Mathew? Does he exist in the story, might he even be a real person? Who really wrote this book? Essentially it’s a story of one man’s quest to find, who he thinks is the greatest cricketer that ever lived, sounds simple. The cricketer in question happens to be a Sri Lankan spinner capable of a greater variety of deliveries than any other bowler in the sport’s history has been able to bowl. A bowler who is in some statistics the greatest to ever to play the game, but who mysteriously goes missing at the height of his powers. It is this quest that drives the plot and delivers the style in which the story is declared. A spinner takes his wickets through deceiving a batsman through a combination of flight, drift and spin. That is exactly what the narrative of this story does, as the reader struggles to predict where the plot will turn next. The reader is deliberately made to feel like a floundering batsman trying to play a bowler who’s beating him with every delivery. I found myself getting caught out trying to understand what this book was ultimately about, if I’m honest some chapters just left me stumped. Just as the story is told in a way make the reader feel the sort of confusion one would suffer facing the world’s greatest ever spinner, it goes further, leaving you in a corridor of uncertainty, asking yourself whether or not this might be true or how much seams to be true. Is this book realistic fiction, unbelievable fact, or a mixture of both? Is it the wicket that’s responsible for making the plot turn from off to leg so violently, or is the skill of the writer too much for the reader? In my case I was made to feel the latter.The author also includes the important points that happened in Sri Lanka socially, politically and racially during the last quarter of the twentieth century (ha, century, didn’t even see that one coming).I can honestly say that this is the most skillfully written piece of contemporary literature that I can remember reading. I recently read last year’s Mann Booker prize winner, Paul Beatty’s brilliant, The Sellout, for me Chinaman is considerably better. Contributions to the genre of Cricket Mystery are pretty sparse, but if it sounds like a genre that you might be interested in then this is probably the best place to start.Thanks for the tip J.B. Do you think I look like a Chinaman with a ponytail?* All the puns were intended. I hope I didn’t try to slip in too many in and maid en arse of myself."}, {"userName": "Shom Biswas", "userReviewDate": "Dec 21, 2017", "userURL": "http://www.goodreads.com/user/show/6651626-shom-biswas", "userReview": "Wijedasa Gamini Karunasena, takes immense pride in the initials of his name, which were also those of the first great cricketer, the legendary WG Grace. WG is a semi-retired cricket journalist, but truth to be said, he is subsumed by that strange ailment that affects many from the former colonies of the British Empire. He is a Cricket Tragic, a phrase that if you have to ask for the meaning of, you certainly are not deserving of. Not that you would want to be one either, perhaps. WG, for one, has named his son Garfield, after Garfield Sobers, the greatest all-round cricketer there has ever been. WG’s has a lifetime of watching cricket in Sri Lanka, local, national and international. And a lifetime of heavy drinking of cheap local liquor. He is one of those cantankerous, persnickety old men who are living through a life of reluctant retirement and general dissatisfaction – whose lives haven’t exactly amounted to nothing, but neither have they eventually added up to much of what they had envisioned. And now it is too late. And it is too late for WG Karunasena. He has a year more to live if he continues with the alcohol abuse. Maybe a couple more if he cuts down to two pegs a day. And as any self-respecting journalist knows, \"There is nothing more inspiring than a solid deadline\". WG decides to leave behind something for posterity. He knows that sports matter. As he says - \"In 30 years, the world will not care about how I lived… But in a hundred years, Bulgarians will still talk of Letchkov and how he expelled the mighty Germans from the 1994 World Cup with a simple header.\" He decides do a documentary on Sri Lankan cricket. He will track down the enigma that is Pradeep Mathew, the left-arm (and sometimes ambidextrous) mystery spinner who was perhaps the greatest exponent of spin bowling of all time. He has played a couple of Tests and One-day Internationals for Sri Lanka, performed none too badly, and then just disappeared from the team and from the public eye. Somehow, nobody seems to mention him at all anymore – it was as if he did not exist. Even his name and his stellar records have been carefully scrubbed off the score-books and public records.Why was he dropped? Was it merely because he was Tamil, a minority in the war-torn isles? Was is because he had had a fight against authority figures? Was it because he fixed matches? Or is there something more mysterious that lies in wait?Thus starts perhaps the greatest novel on sports that has come out of our subcontinent. “Chinaman: The Legend of Pradeep Mathew” by Shehan Karunatilaka is expansive like a glorious Gower cover drive, bright and joyous like a Sehwag flash above extra cover, and yet, somehow, has the gravitas of a steady-the-ship Jacques Kallis innings in a tricky track against excellent bowling. It is a must-read. Very highly recommended.First reviewed at The New Indian Express."}, {"userName": "Praveen Palakkazhi", "userReviewDate": "Dec 30, 2015", "userURL": "http://www.goodreads.com/user/show/15444712-praveen-palakkazhi", "userReview": "“In real life, justice is rarely poetic and too often invisible. Good sits in a corner, collects a cheque and pays a mortgage. Evil builds empires.Sport gives us organisms that attack in formation, like India’s spin quartet and the three Ws from the Caribbean. Teams that become superhuman right before your eyes. Like Dalglish’s Liverpool, Fitzpatrick’s All Blacks, and Ranatunga’s Lankans.In real life, if you find yourself chasing 30 off 20 balls, you will fall short, even with all your wickets in hand. Real life is lived at 2 runs an over, with a dodgy LBW every decade.In 30 years, the world will not care about how I lived. But in 100 years, Bulgarians will still talk of Letchkov and how he expelled the mighty Germans from the 1994 World Cup with a simple header.Sport can unite worlds, tear down walls, and transcend race, the past, and all probability. Unlike life, sport matters.”The second Cricket themed novel I’ve read (the first being the elegantly captivating Netherland by Joseph O’ Neill), and a pretty good yarn it is. Despite my loss of interest in following the relatively limited landscape of International cricket, I still find the game to be a fascinatingly technical and interesting sport. This is not just a book for the Cricket aficionado though. As with all good sports novels, the theme is such that it provides a canvas which can enthrall any lover of good fiction. With some interesting tidbits on the game thrown in, as well as intricate observations of the political and personal conflicts afflicting both individual and country, this is more of an ode to a game and a country’s passion for it.That country is Sri Lanka in the pre millennial period, mostly the period before and leading up to Sri Lanka’s stunning victory in the 1996 Cricket World Cup. That tournament has special resonance in me, as it was the first Cricket event I really followed, and made me consider at the time that nations such as Sri Lanka and Kenya(!) were always such superpowers in the game. Vinod Kambli’s tears, Australia’s nailbiting win over the Windies in the other Semi, Kenya humbling the Windies will always remain etched in folklore for me. But above all, it was the assured, confident and almost devastating manner in which Messrs. Jayasuriya, De Silva, Ranatunga among others took the cup that lingers most.The narrator here is an aging, alcoholic and (As we discover in the first chapter) dying sportswriter W.G Karunasena. As his liver and life is given an deadline by the doctor, he recalls that one of the few moments of magic in his life was watching a certain obscure Sri Lankan spinner bowl his side to victory and which convinced him that the aforementioned cricketer, Pradeep Sivanathan Mathew, was the greatest cricketer he has seen. However, Pradeep Mathew soon disappeared from the scene and his whereabouts both in Sri Lankan cricketing records as well as in real life seem a mystery. Karunasena decides the one way for him to redeem the last act of his mostly useless life is to make a documentary on this cricketer, and, along with his friend and fellow cricket enthusiast, Ari Byrd, decides to trace this shady genius. But the task seems more difficult than he expected and as he finds out, involves a lot of corruption, scandal and heartbreaks. Before long he is fraternizing with coaches, politicians, administrators, gangsters and even an enigmatic midget who records dressing room conversations from a bunker with potentially disastrous revelations. In between Karunasena has a host of personal ghosts to deal with, including his eternally frustrated wife, his estranged son, a friend who may be a pedophile as well as long simmering professional rivals, and the lifelong obsession with the bottle. The genius of the book lies in how it ties in Sri Lanka’s checkered political history and corruption into the tale of a missing cricketer. Observations of social mores and cultural tropes are mixed in with the writer’s obviously loving descriptions of the game and Sri Lanka’s rising prominence in it from humble origins. Opinionated, gruff, unapologetic alcoholic (for the most part), not exactly a great family man – all this he may be, but one thing he isn’t is dull. Some clever anecdotes of the game relating to various peripheral but important aspects of it, like sledging, the junior/senior relationships, the political machinations in the administration are all inserted to great effect here. Some great lines too, including the one mentioned at the start of this review.I could have done without the last part, where the author inserts himself as the typical literary rebel and part narrator (similar to Orhan Pamuk’s entry into most of his novels as a character), but this is a minor quibble to a book which provides many delights to readers, whether they are seasoned aficionados of the game or complete newbies to this peculiar obsession. Another gem-“Some people gaze at setting suns, sitting mountains, teenage virgins and their wiggling thighs. I see beauty in free kicks, late cuts, slam dunks, tries from halfway, and balls that turn from off to leg. When the English toured in 1993, their supporters arrived in droves and formed a jolly beer-swilling troupe called the Barmy Army. A t-shirt of theirs read as follows: ‘One day you will meet a goal you’ll want to marry and have kids with.’Anyone who saw Diego Maradona in 1986 will agree that the t-shirt speaks the truth. To be in the right place at the right time and to watch a gifted athlete is one of life’s true pleasures.In sport, has-beens can step onto a plate and smash a last ball into oblivion. A village can travel to Manchester for a cup tie and topple a giant. Villains, can heroes become.In 1996, subcontinental flair overcame western precision and the world’s nobodies thrashed the world’s bullies. 60 years earlier a black man ridiculed the Nazi race theory with 5 gold medals in Berlin before Mein Fuhrer’s furious eyes.”"}, {"userName": "Peter Wanless", "userReviewDate": "Jan 17, 2018", "userURL": "http://www.goodreads.com/user/show/7792950-peter-wanless", "userReview": "I reckon I know a lot about cricket yet there were cricket-related facts within this fictional book that I doubted were true only to discover they were. The alcoholic narrator, whose health, family relationships and career are failing is determined to tell the story of a cricketing hero whose achievements have never received the recognition they appear to deserve. But did he exist? Does he still exist? I’m surprised some reviewers have suggested this tale is fascinating to the non cricket fan. But I enjoyed it and learnt a few things about Sri Lanka, life and -yes - cricket too, along the way."}, {"userName": "McBugger", "userReviewDate": "Oct 06, 2015", "userURL": "http://www.goodreads.com/user/show/39304667-mcbugger", "userReview": "You don't have to have a passion for the game of cricket to be able to enjoy this book.You don't have to have a passion with Sri Lankan culture to enjoy this book.However, since this book's two principal themes are cricket and Sri Lanka, an inclination towards either or both of the aforementioned subjects will greatly enhance your reading experience. I am fortunate enough to have read Chinaman after having the privilege of travelling to the Emerald Isle and while being already well-versed in the workings and history of the beautiful game. My five-star rating is perhaps owed in part to the fact that Mr. Karunatilaka pandered to my tastes in writing it. This does not, however, mean that an a cricketing agnostic that has no idea about Sri Lankan culture will not enjoy it, but certainly not in the same degree as I have.The plot is quite simple: an alcoholic sports writer, W.G. Karunasena, having been notified of his imminent demise, sets his final goal of tracking down a mystery spinner that played for Sri Lanka in the late eighties and early nineties. With him are soft-spoken Geordie Jonny and boisterous Ariyaratne Byrd to help him on his quest, talk cricket with him and drink his stock of arrack for him. Each character seems like a distinct person you would love to have beside you in the pub, or at your dinner table, but perhaps not as a business partner. In W.G. we see the persona of the strict Lankan father; his strictness towards his son Garfield is distinct from his extra-parental kind character; parallels immediately surface with Kshema Sangakkara, father of Kumar.While the plot does become more tightly-woven as the book progresses, the first two-thirds do little more than tell a tale, with chapters encompassing independent Lankan history and the Sinhala-Tamil conflict. References are thinly veiled in tongue-in-cheek fashion (\"Mr. OldSchoolTie, Ms. SecondGeneration\"), but this is completely understandable; the book was published in 2011, just two years after the Wickrematunge assassination. Thankfully, Mr. Karunatilaka is much more direct on cricketing matters, such as the dichotomy around Muttiah Muralitharan and the Sri Lankan team's plights before gaining Test status, as well as the period of doubt before the triumphant spring of 1996.The book is very well-written with a slight Sinhalese idiom- the author is apt to throw in a few 'aiya's and 'keeyadha?'s here and there. This should not interfere with the pacing for those that don't speak Sinhala, as the meaning of the words can easily be extracted from context. The pages seemed to fly away. Definitely one to re-read, and one to deeply cherish. Five stars well deserved."}, {"userName": "Anu", "userReviewDate": "Jul 06, 2012", "userURL": "http://www.goodreads.com/user/show/4169043-anu", "userReview": "Simply amazing, this is the best book I have read this year. It is the People Magazine meets International Cricket meets Oprah of books!Set in SriLanka, commenting on the Cricket scene in the 80s and 90s, this book to me was a bitter sweet reminder of the game I once loved and enjoyed through my own father's eyes. Having lived through the trauma of international cricket played in Sharjah, where India lost enough matches by fair or unfair means, I soon weaned off what should have been the national sport of India (as it probably should have been of Sri Lanka and the rest of the subcontinent). This book is like life- comic, tragic, mysterious and sensuous.Some excerpts that stick...\"Did the drinking make me a thinker or did the thinking make me drink?\"Having just lost a friend to alcohol, this book helped me deal with some of the many unknowns of the last days of what might have been my friend's experience dealing with the sickness that is alcoholism. \"In real life, justice is rarely poetic and too often invisible. Good sits in a corner, collects a check and pays a mortgage. Evil builds empires.\"...so literally, though I never think in terms of good and evil, I completely get this.\"I didn't know I made you so unhappy, I didn't know you thought so little of our life. Did you really think I was complete;y pointless?....For what it's worth, I have memories I will not let you spoil.\"...sometimes we never really know how others experience us, especially those closest to us. \"You saw me ask W.G. for money, though he does not mention how drunk he was or that he referred to me as a 'lazy useless f*****' and that is why I left the room.\"...life is full of one sided tales, toxic moments, careless whispers and tough, misunderstood love."}], "description": "Some remember his impressive career stats ... others recall his on-field arrogance. Some say he fixed matches . . . others say he was dropped for being Tamil! Who exactly was Pradeep Mathew? And what became of him?WG Karunasena, a man who spent 64 years drinking arrack and watching cricket decides to find out ...If you have never seen a cricket match; or if you have and it has made you snore ...If you can’t understand why anyone would watch, let alone obsess over this dull game ...... then this IS the book for you", "title": "Chinaman: The Legend of Pradeep Mathew", "url": "https://www.goodreads.com/book/show/8198781-chinaman", "average": 4.15, "cover": "https://images.gr-assets.com/books/1279637138l/8198781.jpg", "reviews": 187, "authors": [{"url": "https://www.goodreads.com/author/show/3960325.Shehan_Karunatilaka", "name": "Shehan Karunatilaka"}], "type": ["Fiction", "Sports and Games"], "outlinks": ["http://www.goodreads.com/book/show/8198781-chinaman", "http://www.goodreads.com/book/show/10757209-chinaman", "http://www.goodreads.com/book/show/11075967-chinaman", "http://www.goodreads.com/book/show/14785756-chinaman-the-legend-of-pradeep-mathew-a-novel", "http://www.goodreads.com/book/show/13166688-the-legend-of-pradeep-mathew", "http://www.goodreads.com/book/show/15796243-chinaman", "http://www.goodreads.com/book/show/16176957-chinaman", "http://www.goodreads.com/book/show/13721743-the-legend-of-pradeep-mathew", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}