{"ratings": 626, "userreviews": [{"userName": "Maria Espadinha", "userReviewDate": "Jan 13, 2017", "userURL": "http://www.goodreads.com/user/show/20749430-maria-espadinha", "userReview": "O Guerreiro Do SilêncioMuitos padres ergueram a sua voz contra a loucura belicista de Hitler.O Führer temia-os! Receava-os como instigadores ideológicos. Armados de palavras que arvoravam nobres sentimentos , revelavam-se uma perigosa ameaça:“O maior perigo viria, isso sim, de «assassinos acicatados pelos corvos negros nos confessionários». Os «imbecis» que se lhe opunham, declarou Hitler, eram «sobretudo [os líderes] do catolicismo político». Se alguém tentasse um golpe, garantiu que iria «buscar todos os líderes do catolicismo político a suas casas e mandaria executá-los»”Padres que se rebelaram abertamente contra o regime Hitleriano, tornaram-se alvos fáceis da caça aos \"indesejáveis\" , que Himmler empreendia de forma implacável:“Em campos de prisioneiros «era comum», afirmou uma testemunha, «ver um padre com a roupa em farrapos, exausto, a puxar uma carroça e, atrás dele, de chicote na mão, um jovem com o uniforme da SA [Tropa de Assalto]»”Pio XII foi mais cauteloso. Às atrocidades de Hitler contrapôs o Silêncio. Agiu secretamente, sem levantar suspeitas que pudessem de alguma forma incriminá-lo. Foi um Papa político, lider duma guerra com um objectivo único e determinado: Exterminar Hitler!Movendo-se pela calada, como um guerreiro na penumbra, Pio XII ludibriou o resto do Mundo:Apelidaram-no \"O Papa de Hitler\" quando afinal, ele não fazia mais que conspirar em prol da sua aniquilação!Encarnou com tal mestria o disfarce de Vilão , que o tomaram como tal ;)Mais um Coelho que saltou da Cartola de Surpresas da Segunda Grande Guerra! E estou em crer que não será o último?!...Um \"thriller\" empolgante, impregnado de violência real. A incomensurável violência nazi!"}, {"userName": "Julie Davis", "userReviewDate": "May 04, 2016", "userURL": "http://www.goodreads.com/user/show/2125014-julie-davis", "userReview": "When the pope arose the next morning, he had made up his mind. He would engage the German military resistance and encourage a conservative counterrevolution. He would serve as secret foreign agent for the resistance—presenting and guaranteeing its plans to the British. He would partner with the generals not just to stop the war, but to eliminate Nazism by removing Hitler.Right after WWII, the Soviets began a misinformation campaign claiming Pope Pius XII supported the Nazi regime. Jewish praise and testimony squashed that early effort, but it has been popping up ever since, from various anti-Catholic sources. Many historians have defended the pope but somehow what grabs the headlines is always the sensational anti-Catholicism which keeps rearing its head.Church of Spies ably defends Pope Pius with an action-packed story and over 100 pages of footnotes and sources from recently uncovered documents.  Let's say right up front that author Mark Riebling is not a Catholic, in fact is a fallen-away Catholic, so he's speaking from a purely historical standpoint which I appreciate. He's got no axe to grind other than reporting history properly.We learn that Pope Pius provided an incomparable network for passing information from deep within the German government to Britain and America. Simultaneously, the information gatherers became conspirators who vowed to take action themselves. With the pope's approval.As a reader, the best part is that this reads like a spy thriller, from the beginning where the pope has the Papal Library wired with the best surveillance technology of the time to the end where we see conspirators stage a daring prison break in the Alps. In between, there were Jesuits with guns, double agents, incriminating notes swallowed,  escapes across rooftops, notes passed through prison laundries, and much more. This is all intercut with Hitler's real time actions which lends context and immediacy to the story.I also found it very uplifting. Whether Catholic or not (Dietrich Bonhoeffer was among their number), these men were willing to sacrifice themselves to save others and stop evil. Some of the examples in the personal stories have inspired me since I read them. Church of Spies is a story that resonates in our own time as well as providing us with heroes for WWII.They had found many compromising documents in the army safe at Zossen. Müller might as well consider himself a dead man.Müller said evenly that he could accept that. Death meant \"just a passage from this life to the next,\" Sonderegger later quoted him as saying. Sonderegger asked Müller whether he prayed. Müller said he did. Did he pray for the SS, too? Sonderegger asked. Müller said yes, he prayed for his enemies most of all.Sonderegger fell quiet for a moment. Then, saying he would return \"in three minutes,\" he put a sheet of paper on the table. ...This book should lay to rest any questions of Pius XXII being \"Hitler's Pope.\" Hitler knew to fear the Church's opposition. Now the story has been thoroughly and thrillingly told. The record is finally set straight.It would make an exhilarating mini-series! C'mon Amazon ... Netflix ... HBO ... even regular network TV!"}, {"userName": "Manchester Military History Society (MMHS)", "userReviewDate": "Jul 23, 2015", "userURL": "http://www.goodreads.com/user/show/5231504-manchester-military-history-society-mmhs", "userReview": "An absorbing read highlighting little known details of the Vatican’s own intelligence service during World War 2.Mark Riebling has put together a compelling argument that attempts to prove that Pope Pius XII’s relative silence on Nazi atrocities was a ploy to support the German resistance and specifically the catholic resistance within the Abwehr and the German High Command. The author focusses in on Josef Müller was sent to Rome in 1939 by the German Resistance, to seek assistance from the Pope in a plot to overthrow Hitler. According to Riebling the Pope was asked by the anti-Nazi resistance to refrain from singling out the Nazis to prevent pressure on German Catholics who were in the vanguard of the resistance.Müller’s story is one that could have been culled from the annals of spy fiction, however as we know truth is often stranger than fiction.A fascinating read and highly recommended to anyone interested in the German resistance and the Vatican during World War 2."}, {"userName": "KOMET", "userReviewDate": "Dec 11, 2016", "userURL": "http://www.goodreads.com/user/show/4183137-komet", "userReview": "Prior to reading \"CHURCH OF SPIES: The Pope's Secret War Against Hitler\", the opinion I had formed of Pope Pius XII vis-a-vis the Nazis was that he was strongly pro-German (from the time he had served in Germany as Apostolic Nuncio during the 1920s) and was largely indifferent to the fate of the Jews during the Second World War. In spite of his intelligence and long experience in the hierarchy of the Catholic Church, Pius XII (he was Eugenio Pacelli prior to being named Pope in March 1939) had struck me as a 'cold fish.' But after reading this book, I am beginning to realize that, perhaps, there was much more to Pius XII than met the eye. \"CHURCH OF SPIES\" lays out, in considerable detail, the history of the resistance movement against Hitler, which began before the war among a number of the German Catholic bishops and lay authorities (along with some members of the German military - e.g., the leadership of the Abwehr or military intelligence) and was given added (albeit indirect) impetus by Pius XII from the earliest days of his pontificate. Besides Pope Pius XII, the book brings to the fore a number of courageous, resourceful and highly astute individuals from the ranks of the German Catholic hierarchy (as well as the Protestant theologian Dietrich Bonhoeffer) and Wehrmacht (German armed forces) who formed the bulwark of a true German anti-Nazi resistance. One of them who most stands out in my mind for his amazing bravery and uncompromising commitment to humane principles, is Josef Müller. Müller, a First World War veteran and lawyer, had his first brush with the Nazis in 1934. He had been arrested by the Gestapo in February of that year and charged with \"a treasonable conspiracy ... punishable by death.\" Facing his accusers, Müller asserted that there could be no compromise between the Church and the Reich because \"each demanded 'the soul of the man.' \" Heinrich Himmler, the head of the Schutzstaffel (later to be better known as the SS) was present at Müller's interrogation and asked him if it were true that Müller had suggested to his friend Heinrich Held (the prime minister of Bavaria, where Müller was active in the Bavarian People's Party) during the Nazi takeover of Bavaria that Himmler be shot. Müller said that was so, much to Himmler's surprise! Himmler hadn't seen that coming. He was very much taken aback by Müller's candor. He then offered him a place in the SS. Müller refused, stating that \"I am philosophically opposed to you. I am a practicing Catholic, and my brother is a Catholic priest. Where could I find the possibility of compromise there?\" Himmler was flummoxed and awed by Müller. He congratulated Müller on his \"manly defense\" and let him go.Müller would later become a part of the resistance within Germany and serve as a go-between to Pius XII. This book, which often read like an espionage thriller, gave me so much to think about concerning the anti-Hitler resistance that, hitherto, I couldn't have imagined existed in Germany to the extent that it did. After all, once Hitler assumed full control of Germany following the death of President Paul von Hindenburg in August 1934, I had long thought after having previously read in years past many other books about the Third Reich, that the Nazis had established a binding, absolute hold over the country. Well, that hold wasn't airtight. And now that I've read \"CHURCH OF SPIES\", I would like to know more about the role of Pius XII and the Church in fighting Nazism during the Second World War. My curiosity has been piqued. [As an aside, I am still troubled by the fact that a number of Catholic priests after the War helped Nazi war criminals escape justice in Europe and find sanctuary in South America. Did Pius XII know about or condone their activities? I would like to know the answer to that question. ]I can't rate this book with 5 stars, however, because the author neglected to include any photos of the principal members of the anti-Hitler resistance. (I would've loved to have been able to place faces with the names of all the resisters that Mark Riebling mentioned throughout the book.) For that reason, I can only rate \"CHURCH OF SPIES\" with 4 stars."}, {"userName": "Carlos", "userReviewDate": "Oct 06, 2015", "userURL": "http://www.goodreads.com/user/show/1701553-carlos", "userReview": "No, this book did not convince me , the author didn't show his research or said where he had found these \"new never seen documents\" in which this book is based , no you can't go from a passive almost pathetic approach to a human crisis happening rigth next to you (as it was the case of Pius the 12th) to a book revealing that basically the pope was responsible for everything , (the fall of Mussolini, all the murder attempts to hitler life and the fall of nazi Germany ) under the pretense that he was afraid to speak up because it might have been repercussions to German Catholics , please 60 million people died on ww2 , the least you could have done was speak up...... This book seemed like it had an agenda to portray Pius the 12th as a \"covert hero\" but I'm not convinced by this rhetoric and more important because of the lack of evidence , and if you think the Vatican was actually trying to help \"Jewish people\" I would recommend you read \"gods bankers\" , a very well researched book about the ties of the Nazi movement and the Holy See."}, {"userName": "Jeff Miller", "userReviewDate": "Nov 26, 2015", "userURL": "http://www.goodreads.com/user/show/3947630-jeff-miller", "userReview": "I was somewhat aware of the various controversies surrounding Pope Pius XII who was the Pope during WWII up to 1958. I remember the book “Hitler’s Pope” which I once saw for sale at a retreat center. Since that book came out their have been various books defending the Pope and setting the record straight in regards to helping the Jewish people. I also knew how the Rolf Hochhuth’s 1968 anti-Pius play “The Deputy” did much to change what was previously a favorable view of the Pope during WWII. That the play might well have been part of a KGB-led disinformation campaign.So I thought I had a pretty good grasp regarding Pope Pius XII efforts to save Jews during WWII, which was mostly a behind-the-scenes effort. Then I heard author Mark Riebling being interviewed on Al Kresta’s show regarding his book “Church of Spies: The Pope’s Secret War Against Hitler”.When he learned of the Holocaust, Pius played his cards close to his chest. He sent birthday cards to Hitler—while secretly plotting to kill him.Church of Spies documents this cloak and dagger intrigue in shocking detail. Gun-toting Jesuits stole blueprints to Hitler’s homes. A Catholic book publisher flew a sports plane over the Alps with secrets filched from the head of Hitler’s bodyguard. The keeper of the Vatican crypt ran a spy ring that betrayed German war plans and wounded Hitler in a briefcase bombing.That the Pope actually plotted to have Hitler killed seems to actually be accurate and this book details this. That the Pope took efforts regarding this on his own initiative and worked to separate this as an official act for the Vatican. That in this case he thought Tyrannicide to be warranted. The book is just full of interesting details regarding this. One tidbit was the installation of a Marconi wire recorder in the Vatican to record conversations covertly.One of the central figures in the book is Josef Müller. His story is one of those that would seem outlandish in a novel. A lawyer who defended Nazi opponents including Jewish people and was part of the Catholic resistance against Nazi Germany. He was a central figure in carrying out a coup and passing intelligence personally to Pope Pius XII along with British intelligence. How he achieved this is simply astounding considering the watchful eyes he was under. He was later arrested, imprisoned, tortured repeatedly, and scheduled for execution. That he survived all this is another amazing story. Especially considering his connection to the various plots to assassinate Hitler including Operation Valkyrie with Colonel Claus von Stauffenberg."}, {"userName": "Ionia", "userReviewDate": "Sep 30, 2015", "userURL": "http://www.goodreads.com/user/show/16434239-ionia", "userReview": "I was both surprised and enthralled by this book from the beginning. Whilst I expected the author to have a compelling argument and evidence to support his ideas, he also managed to craft a book that was interesting and kept my attention throughout. As someone who loves history, it is hard for me to pass up a title that promises to look at something from a new angle. Mark Riebling offered that, and did an excellent job of supporting his claims. I have to say, after reading this, I agree with his assessment of the situation. There was a lot I didn't know about the Pope's standpoint on the Nazi movement and the involvement of the Catholic Church, and I walked away feeling better informed after having read this. If you are a history buff, I definitely recommend that you pick this book up. You will be rewarded with the writing of an author who knows his stuff and meets a high standard of literary integrity. This review is based on a complimentary copy from the publisher, provided through Netgalley. All opinions are my own."}, {"userName": "Sara", "userReviewDate": "Jan 27, 2017", "userURL": "http://www.goodreads.com/user/show/2047287-sara", "userReview": "Almost unreal. The extraordinary story of the German resistance to Hitler."}, {"userName": "Wayne McCoy", "userReviewDate": "Jan 30, 2017", "userURL": "http://www.goodreads.com/user/show/4054541-wayne-mccoy", "userReview": "'Church of Spies: The Pope's Secret War Against Hitler' by Mark Riebling is a fascinating read focused on recently uncovered documents from the Catholic church. The narrative is fast moving and full of thrills.History has not been kind to Pope Pius XII. He is probably the most hated pope in modern history. The church took a lot of criticism for seeming to side with Hitler and do nothing while he tried to eradicate the Jews. This book has a different story to tell. Newly discovered documents show that the church actively worked to undermine Hitler. Working with a large group of Vatican operatives and a network that extended into the German resistance, the church actually had a hand in three attempts to assassinate Hitler.One of the main characters is Josef Müller, nicknamed as Joey Ox, and he was sent on a series of trips to the Vatican carrying correspondence. Being caught with this would have meant his death. Another is Wilhelm Canaris, who was a German admiral and chief of the German military intelligence service. He decided that Germany couldn't win this war, and joined the opposition to overthrow Hitler.The Vatican had a secret radio room that was set up by Marconi. Information flowed smoothly as the church was without suspicion, but the life of resistance is not glamorized, and many who were captured were tortured and killed. It's a fascinating book, and I found the way it was told to be gripping. Even though the outcome of the war is known, Mark Riebling knows how to tell a true story very well.I received a review copy of this ebook from Basic Books and NetGalley in exchange for an honest review. I'm so very thankful for the opportunity to review this ebook."}, {"userName": "Wiedźma", "userReviewDate": "Oct 06, 2016", "userURL": "http://www.goodreads.com/user/show/50983160-wied-ma", "userReview": "Publikacja \"Kościół szpiegów\" obala mit jakoby Pius XII był „papieżem Hitlera” i pokazuje starania stolicy apostolskiej w walce z niemieckim nazizmem. Wyjaśniony został fakt, dlaczego papież nie głośno i wyraźnie nie sprzeciwił się polityce Hitlera, co było główną przyczyną oskarżania Piusa XII o cichy współudział w Holokauście.Cała recenzja na: http://wiedzma-czyta.blogspot.com/201..."}, {"userName": "Mariana", "userReviewDate": "Nov 26, 2016", "userURL": "http://www.goodreads.com/user/show/29193432-mariana", "userReview": "\"Uma história tem sempre dois lados. Devemos procurar saber os dois.\" Esta é a lição que retiro da leitura deste livro.Toda a gente criticou o Papa Pio XII por, aparentemente, não fazer nada contra o nazismo. Intitulando-o até de \"O Papa de Hitler\". Com este livro aprendemos que isso não foi de todo verdade e que o Papa tentou sempre derrubar Hitler, mesmo que secretamente. Só não o fez à luz de todos com receio das represálias que isso poderia trazer contra as pessoas que o seguissem."}, {"userName": "Peter Bradley", "userReviewDate": "Jan 14, 2016", "userURL": "http://www.goodreads.com/user/show/1414282-peter-bradley", "userReview": "Amazon review - http://www.amazon.com/review/RS8AOHJO...This is a captivating book. It represents a kind of “paradigm-shift” from the many recent books that have attempted to portray Pope Pius XII as a Hitler-supporting, Anti-Semitic, crypto-Nazi. The paradigm shift is long in coming, and represents nothing more than a return to the original sources of history, where the idea of Pius as being in any way a supporter of Hitler would have been considered the height of insanity.I have been reading up on the contemporary sources for a few years now. That exercise has marked me with the realization that history is a communal enterprise, subject to fads and, of course, laziness. Starting with “The Deputy,” it seems that there has been a thread of historians that have competed with each other in their anti-Pius depictions. What has happened is that each successive writer, selects more of the anti-Pius material to incorporate into their narrative and chooses to leave out the data that might distract from their thesis. The net result after a dozen iterations is a history that looks nothing like the history that people actually experienced.The thread I am describing is obviously the leftist, secularist, anti-Catholic thread, together with a leftist Catholic thread that has the papacies of John Paul II and Benedict XVI in their sights. We might chalk up the ratcheting of a falsified history to nothing more than human laziness and the eagerness to tell a story that fits the narrative except for the facts that, (a) as Justin Lawler has established, a lot of the anti-Pius narrative is actually fabricated and (b) when you read histories from outside this thread, the actual fact that the Catholic Church opposed Hitler and National Socialism are accepted as trivial truths.This book begins with the little-known fact that Pius permitted the Vatican to be used as a conduit for anti-Hitler conspiracies. This fact has been acknowledged by even John Cornwell in “Hitler’s Pope.” In a revision of his book, Cornwell was forced to acknowledge that he didn’t really mean that Pius was a Hitler supporter – something impossible to propose in the face of the fact that Pius had inconiently participated in conspiracies to overthrow or kill Hitler – but that he meant something far vaguer and less likely to sell books.Riebling’s book takes this fact and investigates the backstory, and what a backstory it is. We are introduced to Joseph Muller, a Bavarian Catholic lawyer who acted as a linchpin between the Canaris group, which was trying to overthrow Hitler from within the German military, and the Catholic resistance, which brought in Dietrich Bonhoeffer to win over Protestants, and the Vatican, which had to intervene with the Allies in order to broker a peace once Hitler was overthrown. Riebling’s story shows the white-knuckled bravery of the resistance: we see Canaris’s last days and we learn how close Mueller was to being executed like all the rest of the resistance, but for some last minute turns of good fortune.Riebling’s story is extremely well-researched in the original German sources. I’ve done a lot of reading on this period and I haven’t heard these stories, but they fit what I do know. For example, one of Riebling’s claims is that Pius’s purported silence arose from the request of the German Resistance that he be silent so as not to draw attention to Catholics in Germany. This is the mirror image of a story validated by the American adjutant to the Ambassador to the Holy See, Harold Tittman, Jr., who wrote the following. Here is the passage from Tittman's memoirs (which is actually a postscript from Tittman's son)://My fathers memoirs ended with his move out of the Vatican in July 1944, but it is appropriate to conclude the story of his Vatican assignment by reproducing a memorandum he wrote to Myron Taylor on June 4, 1945, reporting on a conversation with Dr. Josef Mueller, a Bavarian Catholic lawyer who had been a leading figure in the anti-Nazi German underground movement and had acted as the liaison between that movement and the Holy See. My father met Mueller following a speech by the Pope to the College of Cardinals on June 2, 1945, during which the Pope had severely castigated National Socialism and had referred to the deaths of 2000 Catholic priests at Dachau.FOR THE AMBASSADOR June 4, 1945Dr. Mueller told me last night that contrary to what I had heard, he had no part in drafting any part of the Pope’s speech, but that he had furnished the Holy Father with the information on which certain passages were based.Dr. Mueller said that during the war his anti-Nazi organization in Germany had always been very insistent that the Pope should refrain from making any public statement singling out the Nazis and specifically condemning them and had recommended that the Pope’s remarks should be confined to generalities only. Dr. Mueller said that he was obliged to give this advice, since, if the Pope had been specific, Germans would have accused him of yielding to the promptings of foreign powers and this would have made the German Catholics even more suspected than they were and would have greatly restricted their freedom of action in their work of resistance to the Nazis. Dr. Mueller said that the policy of the Catholic resistance in Germany was that the Pope should stand aside while the German hierarchy carried out the struggle against the Nazis inside Germany, without outside influence being brought to bear. Dr. Mueller said that the Pope had followed this advice throughout the war.I then said to Dr. Mueller that I had heard rather widespread criticism of the Pope in connection with his latest speech, because he had waited until Germany had been defeated before attacking the Nazis in public. Dr. Mueller said that he had already explained why the Pope had maintained silence during the war. He imagined that the Pope had decided to come out in the open now against the Nazis because the implications in the denunciations were so very important at the present time and seemed to the Pope to override other considerations.//(See Inside the Vatican of Pius XII: The Memoir of an American Diplomat During World War II.)I had a moment of chill when I got the end of Riebling’s book and I realized that the Dr. Mueller I had been reading about in Reibling had a cameo in Tittman’s book. In the Tittman memoir, “Dr. Mueller” comes on stage and delivers his lines and leaves. To get the backstory and to understand why Dr. Mueller knew what he knew was mind-blowing.I was surprised by the extent of information that Riebling had on Canaris. I’ve read other books about Canaris and they didn’t hint at the amount of information known about his death or the extent of his involvement with the Papacy (although, I believe that Cornwell alludes to the Canaris connection.)Another interesting detail is Riebling’s explanation for why there was no Protestant resistance comparable to the Catholic resistance. I was surprised to find that Bonhoeffer was part of the Catholic resistance, although I knew that Stauffenberg was Catholic. Riebling’s explanation was that Catholicism had a doctrine of just resistance to tyranny, which, while difficult to trigger, did provide an intellectual escape hatch for Catholics that did not exist for Protestants. I also suspect that there was also a history of German Catholic “resistance” to integration in the German culture, which expressed itself in a distaste with hyper-nationalism, or, because of the tendency of people to react against the mainstream, in the hypernationalism of apostate Catholics like Goebbels, Streicher and Hitler. Catholics, unlike Protestants, were confronted with the choice between nationalism or faith, and the choosing led to a variety of options from resistance to apostatic hypernationalism.Obviously, real history is far more interesting than the Monday-morning quarterbacking moralizing of modern historians who have been blessedly spared from the duty of making difficult choices.This is an interesting book. It is an adventure story. It deserves to be a movie. The men who gave their lives in resisting Hitler deserve to be remembered and not tossed down the memory hole so that modern writers can score points against their modern enemies."}, {"userName": "Brandon", "userReviewDate": "Sep 19, 2017", "userURL": "http://www.goodreads.com/user/show/123535-brandon", "userReview": "Not surprised that I thoroughly enjoyed this work considering my obsession with WWII history and the fact that it centered on previously unbeknownst secrets and strategies from German (anti-Nazi) resistance and papal/clergy resistance. It was interesting to find out how many assassination plots to get rid of Hitler were planned and failed (including Valkyrie) and the great lengths and sacrifices made by the persons involved. Probably would have rated this one higher if it weren't for the inclusion of so many historical names and roles. Couldn't remember most of the time if the person was German military resistance or clergy resistance."}, {"userName": "Chris", "userReviewDate": "Sep 19, 2015", "userURL": "http://www.goodreads.com/user/show/10980263-chris", "userReview": "Mark Reibling has written a book which succeeds on two counts: 1) clarifying events of history which have of late been clouded by ideology, and 2) writing a narrative that keeps the reader engaged in the subject matter. Reibling handily demonstrates that Pope Pius XII was not only deeply opposed to Hitler and the National Socialists but also involved in assisting the German resistance in its attempts to assassinate Hitler. The book is so heavily documented that denial of this has to rely on special pleading (viz. a deliberate ignoring of the facts of the case). While Reibling acknowledges some are critical of Pius XII for not being more vocal in his opposition to Hitler and the persecution of the Jews he also documents the fact that each time the pope or individual bishops spoke out the Nazis followed by persecuting even more violently the Church, the Jews, and perhaps especially Catholics of Jewish descent. One may disagree with Pius' prudential judgment to keep silent and work behind the scenes with those Germans who desired to hold a coup and return Germany to sanity but the historical record is clear that speaking out resulted in more deaths in every instance. One interesting detail that Reibling highlights is that it was the Bavarian Catholics who were most interested in and willing to hold a coup, even if it meant assassinating Hitler. Reibling points out that the teaching that tyrants can be removed or even killed was presented by figures such as St. Thomas Aquinas and expounded by Jesuit theologians through history. It was the Protestant Germans who were hesitant at opposing Hitler because of Martin Luther's influence. Reibling quotes Luther as saying: \"I would rather suffer a prince doing wrong than a people doing right\" and that \"Disobedience is a greater sin than murder.\" While Dietrich Bonhoeffer's resistance to Hitler is well know, what is not common knowledge is that he did not agree with the decision to kill Hitler until after coming under the influence of a Catholic priest.If I have one quibble with Reibling it is a matter of format. Throughout the text any time a regnal number is used it is spelled out instead of being represented by a Roman numeral. Thus, Pope Pius XII is consistently referred to as Pope Pius the twelfth. This oddity is rectified in the index but why it wasn't fixed in the text itself is beyond me."}, {"userName": "Patrick Johnston", "userReviewDate": "Oct 22, 2015", "userURL": "http://www.goodreads.com/user/show/38892112-patrick-johnston", "userReview": "How do you handle Hitler if you are the Pope? You obviously want to speak out, but the German resistance tells you that if you do, the Nazis will target Catholics more than they already do. So Pope Pius XII decided to go the espionage route instead of speaking out too loud, which history has criticized him for.This was one of the few times (notwithstanding the middle ages) the Church has greenlit an assassination. It was interesting to see how so many of the plots to kill Hitler were connected to the Vatican (remember the movie Valkyrie?). It was also interesting to see how many countries, Catholic and Protestant alike, saw the Vatican as the country that could be the central communicator regarding secret attempts at coups and brokering peace. I have said it twice now: interesting. This was a very interesting book; not as much as a nailbiter as I thought it would be. At times it was frustrating with all the names to keep straight. But Riebling did some EXCELLENT research (note the thickness of the reference notes section at the end).I think this book would make an awesome mini-series on HBO or something, bringing to life a story that has mostly been the shadows of the espionage world it originated in."}, {"userName": "Jeffrey Blake", "userReviewDate": "Dec 19, 2016", "userURL": "http://www.goodreads.com/user/show/2139985-jeffrey-blake", "userReview": "One of the controversies over the role of the Catholic Church during World War II is whether or not the church, or more specifically the Pope, did all he could to counter the atrocities being committed by the Nazi's. Pope Pius XII mentioned the Jews only once during the war, that at his first encyclical, and never again until the conclusion of the war. Riebling's well documented history dispels this notion of indifference and shows Pius as deeply troubled by what he knew of both Hitler's tactics and aims, but even more importantly, how deeply involved the pontiff was in covert activities designed at deposing the dictator. Pius justified his actions from the teaching of Saint Thomas Aquinas, who considered tyrannicide justified if there was no other way to protect the innocent. As Reibling explains, through the story of so many heroic Germans, (none more so than the Catholic lawyer from Munich, Joseph Mueller) the Pope's silence was very much in order to prevent even more atrocities as Hitler was consistently looking to target the church. The book includes 104 pages of chapter notes that are easily as fascinating as the book."}, {"userName": "Tyson", "userReviewDate": "Mar 18, 2017", "userURL": "http://www.goodreads.com/user/show/60323116-tyson", "userReview": "This book was a great read, far from many other history books, Church of Spies reads like a thriller. It was great to hear of the German resistance to the Nazi's and the involvement of Catholics in reclaiming Germany back from the Nazi's. It focuses in on a few people, and I found myself often sitting on the edge of my seat wondering how the resistance would get out of each new trap when it arose. It was also good to hear of the secret involvement of Pope Pius XII, and the efforts he put into ending the Nazi regime. I highly recommend this book."}, {"userName": "Nik", "userReviewDate": "Oct 17, 2015", "userURL": "http://www.goodreads.com/user/show/19426796-nik", "userReview": "This was a fascinating look at the behind the scenes stories surrounding the assassination attempts on Hitlers life. It's great to be reminded that there were courageous and good people in Germany at a time when so much evil was prevalent. It was refreshing to have an explanation behind the pope's overall lack of condemnation at the time. If you like history this book will keep you engaged."}, {"userName": "Johannes", "userReviewDate": "Oct 12, 2017", "userURL": "http://www.goodreads.com/user/show/31528766-johannes", "userReview": "Whether one is convinced by the author's argument or not, this is a remarkably intense story of espionage."}, {"userName": "Nikki", "userReviewDate": "Oct 07, 2017", "userURL": "http://www.goodreads.com/user/show/5482920-nikki", "userReview": "I found this information fascinating. I've read a good number of books about WWII and had never read about what the Catholic Church's involvement was at the Papal level. This presented an interesting look into the melding of religion and the need for political actions at times. Having just read the book Bonhoeffer: Pastor, Martyr, Prophet, Spy, I was given a deeper perspective on the issues faced by Catholic clergy throughout World War II, as well as the actions of the Vatican."}, {"userName": "Katie", "userReviewDate": "Apr 01, 2018", "userURL": "http://www.goodreads.com/user/show/3850774-katie", "userReview": "Pope’s secret plot to take down Hitler. WARNING So many names!!!"}, {"userName": "Peter", "userReviewDate": "Oct 13, 2015", "userURL": "http://www.goodreads.com/user/show/5223928-peter", "userReview": "As someone interested in what really happened behind the scenes in World War 2, I found this book riveting and hard to put down. Using records from Germany’s Institute für Zeitgeschichte and from the Vatican Secret Archives, Church of Spies casts light on WWII covert operations and spycraft that remained in the shadows for 75 years. Perhaps most-earth shattering and historically game-changing is the proof that a modern Pope, running a vast intelligence network inside Germany, green-lighted Hitler’s assassination, something neither FDR or Churchill, so far as we know, risked their reputations to do.\"Church of Spies\" will inspire many Catholics. It brings to life the heroic priests and ordinary faithful who did not sit on their hands, and who shed their own blood in the Pope’s high-stakes espionage to stop the Third Reich.This book will also interest students of the Holocaust. It provides new context for evaluating Pope Pius XII, who opted for quiet clandestine operations instead of loud public speeches. Although not uncritical of Pius – Riebling writes that \"he should have spoken out\" – the book shows the German resistance itself begged the Pope not to do or say anything publicly that would cause retribution against Catholics in Germany who were concurrently planning assassinations and coups against the Third Reich.Written with the attention to detail that one finds in Rick Atkinson's Pulitzer Prize winning World War II books, Church of Spies reads like a thriller. But the nearly 100 pages of source citations remind us that what happened here is true. And savoring that truth makes reading “Church of Spies” all the more compelling."}, {"userName": "Scribe Publications", "userReviewDate": "Jun 07, 2018", "userURL": "http://www.goodreads.com/user/show/3746214-scribe-publications", "userReview": "Mark Riebling provides the first fully satisfactory portrait of the most elusive and certainly the most divisive pope in modern history. He provides an entirely new, but thoroughly evidence-based explanation [of] the principal enigma in the history of modern Catholicism: its silence on the Shoah.Sam Harris, Author of The End of Faith and Letter to a Christian NationMark Riebling’s work on Vatican espionage makes an invaluable contribution [to] the scholarship on the wartime Church.Michael Burleigh, Author of The Third Reich: A New History[A] revealing history of Pius’ wartime dealings with the German resistance to Nazi rule … Readers will be surprised at the steady stream of anti-Hitler conspiracies, several of which reached the point where dates were set and bombs assembled.\nMilitary History\nRiebling, an expert on secret intelligence, compellingly explores the papacy’s involvement in espionage during World War II … This book has much to surprise, especially the many German officers, separately and together, involved in attempts on Hitler’s life … Pius, vilified by critics who believed he ignored Germany’s atrocities, comes off as a politically savvy man who realized his interference would precipitate Hitler’s mortal overreaction against German Catholics. Not only a dramatic disclosure of the Vatican’s covert actions, but also an absorbing, polished story for all readers of World War II history.\nKirkus\nClandestine organizations are hard to reconstruct and Riebling has mined an impressive array of archival sources to tell this fascinating story.\nLibrary Journal\nMark Riebling takes readers into the seldom-explored mysterious world of Vatican espionage with a deeply researched and fresh account that reads like a spy thriller. The crackling narrative of Church of Spies delivers an important and compelling addition to the debate over the legacy of Pius XII, the most powerful and complex Pope of modern times.Gerald Posner, Author of God’s Bankers: A History of Money and Power at the VaticanWhile the Pope hesitated to publicly provoke Hitler in foolhardy way, he had no hesitation in secretly opposing the Third Reich and its crimes. The record of the assistance Pius XII provided, through his representatives, to the German resistance, and the actions they took, under his guidance, is extraordinary. Without minimizing the complicity of individual Christians, or the role of Christian anti-Semitism, Mark Riebling shows that the Vatican took a very powerful stance against the Nazis. It is especially important for Jewish people — and I am Jewish myself — that this information is now being gathered for all to see.Sir Martin Gilbert, Official Biographer of Winston ChurchillThis gripping book, the product of extensive and fine-grained historical research, should change the course of the “Pius Wars”, if both critics and defenders of Pius XII take its evidence seriously.George Weigel, Distinguished Senior Fellow, Ethics and Public Policy CenterIn Church of Spies, Mark Riebling provides a groundbreaking and riveting account of Pope Pius XII’s secret war against Hitler. This richly documented book makes an important contribution to contemporary scholarship about Pius XII and to our understanding of the historical legacy of his pontificate.Rabbi David Dalin, Author of The Myth of Hitler’s PopeChurch of Spies is an incredible book. It is authentic, documented history that reads like a great action novel. Bonhoeffer, Stauffenberg, the pope, and others plotted to kill Hitler and end the war. Riebling takes us inside their meetings (sometimes held among excavations under Vatican City) and meetings of Hitler and his top advisors. The story that emerges is at times terrifying, tragic, and yet ultimately heroic. This is a book not to be missed.Ronald J. Rychlak, Author of Hitler, the War and the PopeMark Riebling has set himself a high bar in turning conventional wisdom on its head. He has taken on one of the most controversial and polarizing issues in the history of World War II: the role of the wartime Vatican in fighting the Nazis. By combining new archival material with a lively and convincing narrative he has created a new account of a secret war previously overlooked. This is a highly original contribution to intelligence history.Col. Rose Mary Sheldon, Burgwyn Chair in Military History, Virginia Military InstituteChurch of Spies captured my attention. It is a remarkable piece of research. It fills out much of the story that was known mainly in skeletal form. It makes the past come alive.Vincent A. Lapomarda, Author of The Jesuits and the Third ReichRiebling shows that the Vatican's wartime campaign against Hitler was far more extensive than previously thought.\nAustralian Jewish News\n[M]eticulously researched …reveals why Hitler fell apart in those dying months of World War II, the day after reading about the Gestapo’s investigation of his assassination attempt.Joanna McCarthy, Newcastle HeraldThis is a very interesting and informative book about the most controversial period in the Church’s recent history … Perhaps the most uplifting message from this book is that, apart from Pius himself, there were many courageous people in Germany and Italy who devoted their lives to try and stop the evil.George Femia, Manly DailyAn exceptionally important work that skilfully blends human strengths and weaknesses with events that will continue to be argued for centuries to come … This is the most interesting book I have read in more than 10 years of reviewing. Buy it.David Reed, Wamganui Chronicle"}, {"userName": "Blake Solomon", "userReviewDate": "Aug 27, 2016", "userURL": "http://www.goodreads.com/user/show/44027070-blake-solomon", "userReview": "Very interesting story that you don't hear about too often. There are more than a few occasions that make you think: \"how is that not a movie yet????\" Some real heroes in a place where people were too afraid to do anything. It's a history book that reads like a spy thriller."}, {"userName": "Scott", "userReviewDate": "Jul 18, 2016", "userURL": "http://www.goodreads.com/user/show/5391230-scott", "userReview": "Excellent."}, {"userName": "Heather E Ford", "userReviewDate": "Mar 24, 2017", "userURL": "http://www.goodreads.com/user/show/57657517-heather-e-ford", "userReview": "Very interesting true story of how Pope Pius XII actively encouraged an underground spy network via the German Catholic Church and attempted to negotiate a post-war peace with the Allies for the German resistance. The narrative centers around Josef Muller, a devout Catholic lawyer who worked with both German intelligence officers and Catholic priests to relay messages to and from the Pope, including prospects for the assassination of Hitler and plans for creating a post-war German government. Copious notes at the end of the book detail the documents from which the chain of events and details of each person's experiences are built.My only concern with this book is that the narrative starts slowly. If you are reading it because you are interested in learning more about Pope Pius XII and his real thoughts on the war, but aren't really into WWII or spies, it can take a while to warm to the book."}, {"userName": "Tom Hill", "userReviewDate": "Sep 06, 2017", "userURL": "http://www.goodreads.com/user/show/15505156-tom-hill", "userReview": "I am glad I read this book as I have always had a question about the role of the Vatican during WWII. I had read that Pope Pius XII was criticized for not openly opposing the Nazi's and their atrocities. This book explains that Hitler would have increased his persecution Catholics if the Pope was more vocal. Maybe even attacked the Vatican. Of course this was after the Pope made the same mistake as other leaders in trying to accommodate Germany and their plan for world domination. It is good to hear he was very active in encouraging a regime change in Germany but I can't help thinking the Catholic Church could of done more to protect and save the Jewish people. The 3 stars are mainly due to the writing style of the book. Less of a story and more of a fact filled diatribe. A little more prose would of made it much more readable."}, {"userName": "Tom", "userReviewDate": "Aug 24, 2017", "userURL": "http://www.goodreads.com/user/show/1825627-tom", "userReview": "An interesting historyRiebling's history details the efforts made by the oft-maligned Pope Pius XII against Adolf Hitler during World War II. Though publicly often silent, Riebling states that Pius said so little at the urging of both the Allies and German Resistance figures to keep things from getting worse as Pius coordinated with both groups in efforts to undermine the Nazis. Apparently, Catholic dogma can allow for the assassination of despots under the right circumstances and Pius felt Hitler qualified.More interesting may be the story of one Josef Muller, a Catholic layman who acted as the go-between for the Vatican and various resistance members. That man alone is worth reading about."}, {"userName": "Susan", "userReviewDate": "Dec 18, 2017", "userURL": "http://www.goodreads.com/user/show/1872007-susan", "userReview": "While I knew that Pope Pius XII and others in the Church resisted Hitler and helped numerous people to escape and survive, I did not know the extent of the plans. This is a history book written in a way that conveys the tension and drama. It had me in tears by the end, reading about the plight of these people and thinking of the depravity of the Nazis. I pray such a thing never happens again, yet I know other genocides since then have been as atrocious while receiving less attention. Anyway, I do highly recommend this book, though you might want to have something more lighthearted to read afterwards."}, {"userName": "Coleen Dailey", "userReviewDate": "Apr 13, 2018", "userURL": "http://www.goodreads.com/user/show/3972715-coleen-dailey", "userReview": "This book was a fascinating read. I was totally unaware of the depth of the involvement of the Pope in the plots to rid the world of Hitler during the thirties and forties. I knew there were several plots but am surprised at the involvement of the men in the Catholic church both in Germany and in Italy and how they worked with with men in the German military as well as other civilians including one I am familiar with from my own faith Dietrich Bonhoeffer. This book is well documented with an extensive bibliography and sheds a very different light from the stories that the Pope did nothing while HItler rolled over Europe. I would highly recommend this to any student of history."}], "description": "The Vatican's silence in the face of Nazi atrocities remains one of the great controversies of our time. History has accused wartime pontiff Pius the Twelfth of complicity in the Holocaust and dubbed him “Hitler's Pope.” But a key part of the story has remained untold.Pope Pius in fact ran the world's largest church, smallest state, and oldest spy service. Saintly but secretive, he sent birthday cards to Hitler—while secretly plotting to kill him. He skimmed from church charities to pay covert couriers, and surreptitiously tape-recorded his meetings with top Nazis. Under his leadership the Vatican spy ring actively plotted against the Third Reich.Told with heart-pounding suspense and drawing on secret transcripts and unsealed files, Church of Spies throws open the Vatican's doors to reveal some of the most astonishing events in the history of the papacy. Riebling reveals here how the world's greatest moral institution met the greatest moral crisis in history.", "title": "Church of Spies: The Pope's Secret War Against Hitler", "url": "http://www.goodreads.com/book/show/29502399-church-of-spies", "average": 4.18, "cover": "https://images.gr-assets.com/books/1470282815l/29502399.jpg", "reviews": 121, "authors": [{"url": "https://www.goodreads.com/author/show/338292.Mark_Riebling", "name": "Mark Riebling"}], "type": ["History", "Nonfiction", "Christianity", "War", "Religion"], "outlinks": ["http://www.goodreads.com/book/show/29502399-church-of-spies", "http://www.goodreads.com/book/show/32732211-os-espi-es-do-papa", "http://www.goodreads.com/book/show/24945325-church-of-spies", "http://www.goodreads.com/book/show/26833490-church-of-spies", "http://www.goodreads.com/book/show/31344025-ko-ci-szpieg-w-tajna-wojna-papie-a-z-hitlerem", "http://www.goodreads.com/book/show/40491313-church-of-spies", "http://www.goodreads.com/book/show/1162344.Wedge", "http://www.goodreads.com/book/show/35787146-die-spione-des-papstes", "http://www.goodreads.com/book/show/9672956-the-scarlet-underground", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/40205082-everything-is-horrible-and-wonderful", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}