{"ratings": 133, "userreviews": [{"userName": "Victoria Schwab", "userReviewDate": "Apr 03, 2018", "userURL": "http://www.goodreads.com/user/show/1695365-victoria-schwab", "userReview": "A girl who almost drowned.The ghost boy who pulled her back.A very haunted city.I am really proud of this book. I hope you guys enjoy it."}, {"userName": "softlykaz (on hiatus)", "userReviewDate": "Jan 11, 2018", "userURL": "http://www.goodreads.com/user/show/42130592-softlykaz-on-hiatus", "userReview": "so um, how am I expected to focus on school and a career and establishing a stable life for myself when Victoria Schwab keeps churning out new books every year??and on top of it: Stranger Things meets Ghost Hunters??"}, {"userName": "Korrina  (OwlCrate)", "userReviewDate": "Mar 29, 2018", "userURL": "http://www.goodreads.com/user/show/37437502-korrina-owlcrate", "userReview": "Yup. Loved this. Doesn’t matter what genre or age demographic Victoria writes for, her stories are always so amazing. They speak to something deep within my soul."}, {"userName": "Kaylin (The Re-Read Queen)", "userReviewDate": "Jan 22, 2018", "userURL": "http://www.goodreads.com/user/show/47627265-kaylin-the-re-read-queen", "userReview": "The results are in:------------------------------------------Okay guys, let's duke it out. Does this cover look more like:A: the start of an anime theme-song sequence B: the cover for the sophomore album of a semi-popular alt rock band C: the girl from 'The Ring' has an adventure"}, {"userName": "Kai", "userReviewDate": "Jan 23, 2018", "userURL": "http://www.goodreads.com/user/show/41788524-kai", "userReview": "If my life were as aesthetic as Victoria's covers, I would have had an editorial in VOGUE years ago."}, {"userName": "Ashley Nuckles", "userReviewDate": "May 18, 2018", "userURL": "http://www.goodreads.com/user/show/55308610-ashley-nuckles", "userReview": "This was not at all what I thought it was going to be (in a good way)! It was equal parts cute middle grade, creepy ghost stories, and fun adventure tale all in one! This is why Schwab is one of my FAVVVSSS"}, {"userName": "may ➹ (semi hiatus)", "userReviewDate": "Jan 22, 2018", "userURL": "http://www.goodreads.com/user/show/68157476-may-semi-hiatus", "userReview": "hey uh Scholastic.....did you know you’re the best for mailing me an ARC"}, {"userName": "Cait • A Page with a View", "userReviewDate": "May 22, 2018", "userURL": "http://www.goodreads.com/user/show/47412532-cait-a-page-with-a-view", "userReview": "Well, I'm a huge fan of Edinburgh & Schwab, so this was obviously a great setup. The story felt like a fun middle grade read with just the right amount of creepy, but it might not appeal to fans who mostly read her adult books. I genuinely love middle grade, though, and thought this was a really solid, well-rounded story with a creative premise!Cassidy's a Ravenclaw who died while drowning but was brought back by Jacob, a ghost who's now her best friend. She's a sort of \"in-betweener\" now who can free spirits trapped in the Veil. The book description's really good and I don't want to spoil any other points, so I'll just leave it there.Otherwise, it was a pretty quick read that I finished in one sitting (mostly because it was just so engaging). Schwab is an amazing storyteller and this book really shows how broad her range is!Thank you to the publisher for sending me an ARC."}, {"userName": "emi", "userReviewDate": "Jun 10, 2017", "userURL": "http://www.goodreads.com/user/show/34410191-emi", "userReview": "6.13.17 update  2018? 2018! I mean yesterday is a better publication date but I'll take what I can get.  prereview: Why, Victoria Schwab, do you have to tease books that won't come out for years???RIP me, because I'm gonna die before this ever even gets a release date."}, {"userName": "maymay❀", "userReviewDate": "Jun 10, 2017", "userURL": "http://www.goodreads.com/user/show/49148508-maymay", "userReview": "I literally identify as Victoria Schwab Trash Fan™ like, that's not even a joke. You can check my passport."}, {"userName": "sreeja (semi-hiatus)", "userReviewDate": "Jan 20, 2018", "userURL": "http://www.goodreads.com/user/show/50309540-sreeja-semi-hiatus", "userReview": "UPDATE: 23/1/2018ANDDD we have a cover idk im actually kindof liking it it looks creepy. Also am i just blind or does that thing beside the girl look like a goose?? :0020/1/2018so apparently this book is stranger things + ghostbusters + v.e schwab can this get any better?? :')"}, {"userName": "Michael", "userReviewDate": "May 11, 2018", "userURL": "http://www.goodreads.com/user/show/7810503-michael", "userReview": "Victoria Schwab is really great and so is this book."}, {"userName": "Melanie", "userReviewDate": "Jun 01, 2018", "userURL": "http://www.goodreads.com/user/show/3030788-melanie", "userReview": "ARC provided by Scholastic in exchange for an honest review.Blog | Instagram | Twitter | Tumblr | Youtube | Twitch"}, {"userName": "Cori Reed", "userReviewDate": "Apr 02, 2018", "userURL": "http://www.goodreads.com/user/show/28707574-cori-reed", "userReview": "YAAAAAASThis book was SO GOOD. I really don't have anything at all negative to say at all. Victoria Schwab just keeps getting better and better."}, {"userName": "Stacee", "userReviewDate": "May 25, 2018", "userURL": "http://www.goodreads.com/user/show/7359586-stacee", "userReview": "I am not at all surprised that I loved this story. Review to come."}, {"userName": "rin (lorenzo)", "userReviewDate": "Jun 13, 2017", "userURL": "http://www.goodreads.com/user/show/23238315-rin-lorenzo", "userReview": "the cover and the pitch are there, sounds fun 👀👀👀~~~i will read anything written by this woman creepy middle grade novel pfft sigh me tf up"}, {"userName": "sofia (sam willows)", "userReviewDate": "Jun 13, 2017", "userURL": "http://www.goodreads.com/user/show/55057635-sofia-sam-willows", "userReview": "did someone say victoria schwab?• added to tbr• pre-ordered• marked on calendarAt this point I am literal trash for this woman. I'll even read her grocery list"}, {"userName": "Hamad", "userReviewDate": "Jan 22, 2018", "userURL": "http://www.goodreads.com/user/show/54464244-hamad", "userReview": "Now we have a cover!!!!!!And I honestly like it :O"}, {"userName": "Meghan", "userReviewDate": "Apr 18, 2018", "userURL": "http://www.goodreads.com/user/show/2935175-meghan", "userReview": "Since this book doesn't come out until August, I'll save my full review for a later date. Here is what I will say:1. If I had read this book at 10 or 11, I wouldn't have wanted to be any other fictional character. 2. This book is a perfect middle grade book that leaves you wanting more. It is action packed and I would have been happier with 200 more pages. 3. This book is going to be a perfect book to get some kids into the horror/thriller genre of life. It is just creepy enough to make me want to not read it right before bed, but not too scary that a kid won't enjoy it. 4. I honestly enjoyed this more than the Savage Song series. Not one bad thing to say about that duology- this just truly struck me in a place of childhood remembrance and made it fresh. 5. I will be buying this in hardback the day it comes out #sorrynotsorry."}, {"userName": "Amy", "userReviewDate": "May 22, 2018", "userURL": "http://www.goodreads.com/user/show/13507409-amy", "userReview": "It’s safe to say I am a huge fan of Victoria Schwab. She can write adult, YA, and middle grade fiction and I’d be the first in line to buy them all.I’m also a huge paranormal fan. I grew up in a “haunted” college town. I’ve loved ghost stories as a kid and I still have a fascination with old legends and local haunts. City of Ghosts is being marketed as Stranger Things meets Ghost Hunters. I agree with the Ghost Hunters part. But, did you ever watch Are You Afraid of the Dark? on Nickelodeon? Because I legit feel like City of Ghosts could be an episode from that show.Submitted for the approval of the Midnight Society, I call this story…Ahem. I digress.I’ll skip writing a summary since the synopsis above already does a wonderful job explaining the key points (which I think is a bit of a shame because it really could benefit from a more vague description.) However, since this is middle grade, the synopsis is probably overly descriptive for parents to judge whether this book is right for their child/age group. So please keep in mind that this is a middle grade book. If you only prefer Schwab’s adult books then this might not be the perfect match for you.There were so many things I loved about City of Ghosts: The unshakable friendship between Cassidy and Jacob, the adventures they ensue in Edinburgh, the quirky ghost-hunting parents, and all the creepy spirits. The story is very fast paced and flows beautifully. I especially loved how the Veil was used as a means for Cassidy to use her “gift” and discover her “purpose”. My only qualm is I wish we got a little more info on Jacob, but I think there’s a possibility this is setting up for a sequel.\n\n“Embrace your strange, dear daughter. Where’s the fun in being normal?”\n\nOverall this was such a treat from Schwab. I really hope we get more Cass and Jacob. This would be perfect for Halloween and for anyone who wants a quick, haunting read. If you want some spooky lore set in Scotland, amazing friendships, and that dash of nostalgia à la Are You Afraid of the Dark?, then I highly recommend City of Ghosts!Thank you so much to my friend Mary for letting me borrow her ARC copy of City of Ghosts!All quotes were taken from an ARC and is subject to change upon publication."}, {"userName": "Tanja Voosen", "userReviewDate": "Jan 22, 2018", "userURL": "http://www.goodreads.com/user/show/5464546-tanja-voosen", "userReview": "Das ist zwar nicht die originellste Idee, aber ich liebe Geister-Geschichten und das Cover ist sau cool!!! ICH WILL ES LESEN UND BESITZEN!"}, {"userName": "Alana • thebookishchick", "userReviewDate": "Jan 13, 2018", "userURL": "http://www.goodreads.com/user/show/12402009-alana-thebookishchick", "userReview": "I didn't realize a cover was released but JUST LOOK AT IT.Also, I was sold at ghost-hunting. SOLDDDDDD!!!!--------------I needed this like yesterday.THIS SOUNDS AMAZING."}, {"userName": "Hari ~Brekker-Maresh~", "userReviewDate": "Jul 31, 2017", "userURL": "http://www.goodreads.com/user/show/18823024-hari-brekker-maresh", "userReview": "OMFG ANOTHER VICTORIA SCHWAB BOOK GIMMMEEEEEEEEEBUT DECEMBER FREAKING 2018 HOW CAN I EVEN WAIT THAT LONG AGGHHH!!!!!!!!!!(How do you set up your Amazon account to automatically pre-order/buy all books by Victoria Schwab?)"}, {"userName": "el", "userReviewDate": "Jun 11, 2017", "userURL": "http://www.goodreads.com/user/show/29832182-el", "userReview": "14/06tHAT SYNOPSIS THO i'm pumped 11/06you had me at victoria schwab"}, {"userName": "Kate (Reading Through Infinity)", "userReviewDate": "May 23, 2018", "userURL": "http://www.goodreads.com/user/show/8223877-kate-reading-through-infinity", "userReview": "4.5 starsI finished this today and I LOVE LOVE LOVE it. It's WONDERFUL. The narrative is sublime and V. E. Schwab captures the enchanting and haunting dichotomy of Edinburgh's streets perfectly. Cass and Jacob's friendship was so sweet and I really hope we get to see more of them in a sequel.FRTC but this was excellent and I'm so happy I got to read an ARC."}, {"userName": "Zoraida", "userReviewDate": "Apr 03, 2018", "userURL": "http://www.goodreads.com/user/show/5122719-zoraida", "userReview": "This made me miss Edinburgh and also Casper with Christina Ricci. Thrilling and adventurous."}, {"userName": "Katherine Moore", "userReviewDate": "May 24, 2018", "userURL": "http://www.goodreads.com/user/show/21365174-katherine-moore", "userReview": "It was a breath of fresh (ghostly) air to read this, even though I’m far from being in the target middle-grade reading group, but 12-year old me read it anyway (and lined up at Yallwest for 45 minutes for an early copy).Cassidy Blake, a self-professed nerdy tween, has parents who have just about the coolest jobs: they are ‘The Inspectres’, a ghost-hunting team, and they have just been given a round-the-world TV gig, that starts in Edinburgh, to hunt down ghosts in haunted cities. But that’s only part of what makes Cassidy a fascinating main character for Schwab’s new book; Cass once drowned, and because she came back from near-death, she came back with her very own ghostly sidekick and now, best friend, Jacob. Cassidy can see him and other ghosts, and go beyond ‘The Veil’, and she only comes to truly understand what this all means when she gets to Edinburgh. The book is endearing, funny, and clever throughout, and contains enough appropriately-scary scenes and ideas for the age group it’s written for. I would have been clamoring for this book when I was younger. The scary scenes beyond ‘The Veil’ and with the Red Raven are expertly written, and are creepy enough to only leave the reader with a chill but not scare beyond their wits. There are also some other minor characters written, like the young girl Cassidy meets in Edinburgh, Lara, who teaches her a lot about ‘what’ she is actually is, an ‘In-Betweener’ and even the city of Edinburgh feels like a character of its own.Victoria Schwab has crafted a near-perfect book, middle-grade or otherwise, which blends reality with fantasy, and gives the reader characters who are identifiable and likable. I felt like Cassidy was written for a younger version of myself (or is that still me?); I was obsessed so much with ghosts at that age of around 11-12, that it influenced my choice of boarding school, and Cassidy is also walking around with an old camera around her neck, and with her cat Grim by her side (a camera AND a cat?!) . And the glorious part where she tries British fish and chips for the first time; Schwab was after my soul. Our ghostly friend Jacob has emotion sweeping about him and makes the idea of having a spirit for a sidekick (especially if they’ll save your life on a whim), incredibly appealing. The excitement around this book is warranted, and I hope the adventures of Cassidy (and Jacob) continue. This may well be a book written for 12-year old girls, but the actual readers will surely span ages and other reader groups. Just such a special, unique, and thrilling read."}, {"userName": "Sabrina The Trash Queen", "userReviewDate": "Jan 27, 2018", "userURL": "http://www.goodreads.com/user/show/63480503-sabrina-the-trash-queen", "userReview": "creepy cover!"}, {"userName": "Kaycee Bowick (Off_The_Press)", "userReviewDate": "Jan 12, 2018", "userURL": "http://www.goodreads.com/user/show/14978558-kaycee-bowick-off-the-press", "userReview": "There really aren't many things I love more than Ghost Hunters and Stranger Things and novels? And it's middle grade? This is one happy teacher heart."}, {"userName": "Lily", "userReviewDate": "Jun 04, 2018", "userURL": "http://www.goodreads.com/user/show/33066708-lily", "userReview": "Solid 3 stars from me.City of Ghosts was my first Victoria Schwab read (I know, ridiculous!). I had high hopes, as her Shades of Magic series receives plenty of critical acclaim. Her middle grade debut, however, was just... okay. City of Ghosts follows Cassidy, a Harry Potter loving tween, whose parents write books about ghosts for a living. It's a not-so-normal life for a not-so-normal girl who's had a near-death experience that left her with the ability to see ghosts. When her parents land a TV show traveling to the most haunted cities across the globe, Cassidy and her best friend, a ghost named Jacob, depart on a paranormal adventure in Edinburgh, Scotland. With their cat, Grim, of course.There is much to love in that synopsis: Edinburgh, ghost hunting, Harry Potter, cats. The paranormal aspects are fantastic and well-explained. The emphasis on friendships is refreshing. But the overall impression I've received is one of a colorful exterior with a distinctly unmemorable interior. It was the type of story that I unfortunately will not remember the plot of - or even the main character's name - by next month. Jacob and the Raven in Red - the key villain in this story - were two of the most fascinating pieces of this story, full of mystery. Yet both of them were tragically underdeveloped. I was hoping for more for Jacob's character - of his backstory, his personality, anything to hint at some form of growth. The Raven in Red also lacked depth apart from her tragic backstory. There were plenty of pieces set in place, yet Schwab seemed to just skim the surface with each of them. Overall, not bad but not memorable either. Perhaps we have much to look forward to in Book 2."}], "description": "Cassidy Blake's parents are The Inspectres, a (somewhat inept) ghost-hunting team. But Cass herself can REALLY see ghosts. In fact, her best friend, Jacob, just happens to be one.When The Inspectres head to ultra-haunted Edinburgh, Scotland, for their new TV show, Cass—and Jacob—come along. In Scotland, Cass is surrounded by ghosts, not all of them friendly. Then she meets Lara, a girl who can also see the dead. But Lara tells Cassidy that as an In-betweener, their job is to send ghosts permanently beyond the Veil. Cass isn't sure about her new mission, but she does know the sinister Red Raven haunting the city doesn't belong in her world. Cassidy's powers will draw her into an epic fight that stretches through the worlds of the living and the dead, in order to save herself.", "title": "City of Ghosts\n      \n          (Cassidy Blake #1)", "url": "http://www.goodreads.com/book/show/35403058-city-of-ghosts", "average": 4.31, "cover": "https://images.gr-assets.com/books/1516638225l/35403058.jpg", "reviews": 119, "authors": [{"url": "https://www.goodreads.com/author/show/3099544.Victoria_Schwab", "name": "Victoria Schwab"}], "type": ["Childrens", "Fantasy", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/35403058-city-of-ghosts", "http://www.goodreads.com/book/show/37825382-city-of-ghosts", "http://www.goodreads.com/book/show/23299512-this-savage-song", "http://www.goodreads.com/book/show/10929432-the-archived", "http://www.goodreads.com/book/show/32075662-our-dark-duet", "http://www.goodreads.com/book/show/13638131-the-unbound", "http://www.goodreads.com/book/show/6931344-the-near-witch", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/25353286-provenance", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}