{"ratings": 351857, "userreviews": [{"userName": "Kiki", "userReviewDate": "Mar 15, 2011", "userURL": "http://www.goodreads.com/user/show/4074594-kiki", "userReview": "Stick a fork in me, I'm done.This book couldn't make less sense if it were written in elvish, and I know that some people actually understand that - as in, they're about as hardcore about Tolkien as I am about French bread - but that's the whole point; this book is a clusterfuck unless you've spent an exorbitant number of hours poring over the characters and their histories and their family trees and the mythology of this world, and let's face it, that's impossible. Impossible, because this is Cassandra Clare we're talking about. She is so inconsistent, she's basically the human embodiment of a 90's sitcom. The synopsis makes about as much sense as the ingredients of shampoo, so you're blundering through the dark when you turn the first page. By the time the plot manifests itself, it's fucking impossible to care. This book will make you feel like a sociopath. That's how dead you'll be inside.If you know anything about me, you know I loved the first three books in the Mortal Instruments series. I absolutely loved them. They're not great literature; they're not ingeniously plotted or poetically written; but they're just so much fun. They're outrageously hilarious, fast-moving, easy to follow and really? They took me on an adventure. A good, old-fashioned, magical adventure.City of Fallen Angels, however, was like standing at the bus stop in the rain and getting shat on by a pigeon. Cosmically unfair. I don't understand how Cassandra Clare, who'd written the first trilogy with such heart, could then suddenly morph out of all recognition and just stop giving a single fuck. It just doesn't make sense. Ghost writer? Loss of inspiration? These theories make more sense with the release of City of Lost Souls. It's not the worst of the series - I'd give that honor to COFA - but it's pretty darn bad. And it pains me even more than Kegels to say that. That COLS was just awful.For starters, where was the plot? I sat down for a good while after I'd finished this book and tried to come up with a short synopsis of what this book was about. I got nothing. Because it's not one solid plot, but a lot of complicated and awkward situations kind of tied together at the ends, filled with OOC behavior and fade-to-black sex scenes and whining. Endless, endless whining.Clary was probably the worst part of this book for me. She was like the Daphne of the whole mission, constantly getting herself captured (yes; getting herself captured. This is not victim blaming, people. She literally walks into the clutches of the villain and asks to be captured. I'm not exaggerating) and concerning herself with the most menial things, like the shape of a dress or the boats in Venice, when she ought to be \"saving the world\" or doing something else that a kangaroo would be better qualified for. She's so fucking incompetent and I can't believe that Shadowhunter civilization ceaselessly places its hopes on the shoulders of such a nincompoop. These people are meant to be professionals but they act like stoners.Yet I hesitate to complain. Clary is just insufferably stupid, but she doesn't sit on her ass and do nothing. In comparison to the Bellas or Luces or Bethanys out there, and in Olympic high-bar terms, she's the Fabian Hambuchen to their Kohei Uchimura. She's no better or worse, but at least she has the good grace to shave her armpits before competition.It's not as if her relationship with Jace is even anything to write home about. As creepy and incestuous as it seemed in the first two and a half books, it was then that I rooted for them the most. I mean, come on! These books are fluff. Magical fluff. They'd never explore anything as serious as GSA with any kind of depth or insight. We all knew from the moment Jace said, \"Leia, I am your brother\" that they weren't really siblings. It was fucking obvious, and it was for this reason that I gave in to enjoying them and at the end of City of Glass when they were finally and properly together, was on the verge of crying tears of fangirl joy.Now? They're a snore. They're about as interesting as a piece of wax paper, but that's not to say they're the flattest soufflé in the baking tray. Maia and Jordan are particularly problematic as a couple. On Tumblr, Cassandra Clare seems committed to writing healthy relationships and frequently defends her plot and character decisions with good, solid blog posts that generally allow me to better understand the thinking behind the decisions she makes.There have been no such posts about Maia and Jordan. The way I saw Maia and Jordan's relationship was that Maia's life had been ruined by what was clearly a metaphor for dating violence, but strong as she was, she managed to champion that, move on and become stronger. But after COFA, Maia is back with Jordan. Yes; the boy who attacked her and ruined her life by turning her into a creature of the night. How is this okay? I don't understand what Clare was getting at with this plot thread. Was it simply a desire to pair everyone off? Because if it was I'd rather Maia had been with Simon. That was what I assumed at the end of COG. Either that, or she ended up alone, which would have been even better.But this problematic palming-off of dating violence aside, Maia and Jordan's constant sexcapades just did nothing to push forward the plotline of this book. Cut out Jordan, who in my eyes will always be the boy who attacked Maia (the fact that he was \"out of control\" doesn't excuse it - only makes it worse. How many more times might he \"lose control\" in the future?) and ruined her life, and Maia could have merged with the main group and become a protagonist, not just a punctuation point.Nah! She's just thrown back at her abusive boyfriend, because love trumps all, yay! (Fuck off.)Probably the most agonizing part of this ordeal was Alec and Magnus, and let me put this into perspective: Alec and Magnus, to me, were what Bella and Edward were to Twihards. They were just...amazing. Their love was so pure. But that's not even it. As separate characters, they were my favorites in the entire series. Alec, in particular, I adored. He was so awkward and shy, protective and genuine, calm and sincere. He and Magnus, with such different personalities, just gelled together perfectly.But then along came City of Fallen Angels and everything went to shit. It was disheartening, to say the least, when this new and blindingly irritating Alec surfaced at the end of COFA. He underwent a total personality transplant, and I wonder if perhaps it was a marketing tactic. The fanbase for Alec and Magnus is probably just as big, if not bigger, than the fanbase for Clary and Jace. It seems as if Alec and Magnus have been destroyed and turned into another Bethany and Xavier to shift the love of their fandom over to Clary and Jace who are, of course, the unbreakable power couple.I'm just so mad about this. The whole thing only got worse in City of Lost Souls. Theoretically, Alec should be totally irredeemable for what he considered doing to Magnus. But when I was reading COB, the Alec I fell in blind love with then would never have done what the COLS Alec did to Magnus. They simply aren't the same character. He would never shorten someone's life without their knowledge, and for his own gain. He would never seek relationship advice from an obviously evil vampire. He would, however, have stood on that hill and used his archery mojo to protect his friends. And it was those brief little glimmers of Alec-ness that hurt the most. I don't...I can't. It would be so easy to hate Alec, but I can't. My feelings are a force far greater than I. And \"a million little paper cuts\" was so fucking beautiful. Ok, I need to pull myself together.The plot was all over the place, as aforementioned. I had to flip back pages and re-read paragraphs over and over just to understand why the fuck they were summoning the demon and then the angel and what have you, and I was sure, throughout all of it that to get their answers they probably could have just asked someone, maybe an adult who isn't made of straw. And the thing with the faerie rings? I'm not even going to go there. Clary, the ring moulded to your finger. That's specifically how it works. If it moulded into a perfect snug fit for your finger, why the hell would it fall off? How have you not already had a piano fall on you?Raphael, why are you still trying to kill Simon? Why does that matter?Maureen, why did you kill Camille? You wanted her dead, but to what end? Why? And why were you even a character in this book in the first place?Camille, why are you still sniffing around Magnus when he is clearly in a serious relationship? Why are you suddenly game to help Shadowhunters when you've shown absolutely no interest in doing so before?Magnus, if you were thinking about taking away your own immortality way back in COG, why did you not tell Alec? Why have you gotten so boring? Where are all your hijinks?Alec, what the fuck happened to you?Jace, why are you even still alive? And could you BE any more Edward Cullen, now that you sparkle? Why does everything always have to happen to you, like you're the most important person in the world? Truth is, you're boring. Very boring. I have no interest in you any more. But for some reason everything important has to surround you, everyone has to want you for their evil schemes, and you get captured more frequently than Clary. What gives?Sebastian, give it up. You're nothing but a wedge engineered to come between Clary and Jace, who apparently don't really care that you tried to rape Clary. You literally pinned her down on the floor, and yet neither Clary or Jace are at all fussed about it. Jace, in particular, is impassive, even when he comes back to being himself post-possession. I get that Clary is angry, but her anger feels half-hearted, which seems bizarre after she was victimized in such a terrifying way. I abhor the people who say that Clary ought to have \"learned\" or \"grown\" from the attack - it is not the victim's responsibility to \"learn and grow\" because being pinned down and almost sexually assaulted is not a fucking rite of passage, but I feel as if the whole issue was somewhat glossed over. The thing I find most problematic, as I mentioned before, is how little Clary and Jace seem to care. It's no one's right to say what a victim's reaction to rape ought to be, and another thing really bothering me about the general reaction to this scene is the volumes of people crying, \"How could she kiss Jace after she was almost raped? She should have not wanted to touch another man!\" That's just not how it works. You cannot possibly say what is or what is not the \"right\" reaction to rape - BUT! Having said that, any reaction would have left more of an impression on the reader, and would have highlighted the attempted rape as something more than a flippant plot device. The scene didn't anger me; Sebastian's actions were in no way condoned and Clary was never blamed as a victim (which is an unfortunately common trope when it comes to rape in fantasy settings), but I just feel as if the whole thing was an afterthought. And kind of glossed over.The writing was enjoyable, smooth and fun to read, and as usual the setting throbbed with life, like another character in the cast. There were also a few lovely funny moments, some great dialogue, nice mythology moments, engaging fight scenes and despite the book's lower points, it kept me hooked consistently from the first page to the last. You know what I wish? I wish the Mortal Instruments had ended back at City of Glass, and this second TMI trilogy had been replaced with the new one, The Dark Artifices. I think we're more or less over the characters in this corner of the Shadowhunter universe. Sure, I'd have missed them bitterly, but the fresh LA crew probably would have remedied that.Oy vey. Where there's money to be made, there's someone who'll make it. Capitalism is swell."}, {"userName": "Jesse (JesseTheReader)", "userReviewDate": "Mar 01, 2016", "userURL": "http://www.goodreads.com/user/show/8114361-jesse-jessethereader", "userReview": "Here's the deal.. this book was SLOW TO THE BONE, but the end result was worth the SLOWNESS. It just took forever and a day to get to the really interesting parts. I definitely liked this a lot more than City of Fallen Angels. I'll admit though after reading TID, nothing will compare to the beautifulness of that trilogy."}, {"userName": "Haleema", "userReviewDate": "Sep 30, 2010", "userURL": "http://www.goodreads.com/user/show/4336293-haleema", "userReview": "Beware of spoilers!I didn't see a point to this book. Clare really should have ended her series at City of Glass. We all know that. Well, all of us who are not fans of Clare's work. However, since this book was 534 freaking pages, I figured that I should talk about a few things.ClaceSo these two are one person. I honestly don't see them as two separate characters sometimes because they are so similar and shitty. We never really get to experience these characters as themselves, rather they are always together. However, for now let's separate these two just to save us all from the confusion.CoFA and CoLS were all about Jace. I don't even think Clary should have been the protagonist in these books. Jace and his luscious golden hair, smooth skin, and amber eyes. I mean, three books clearly weren't enough to describe his heavenly features. I'm sure the readers are fully aware of his physical features by now. So this whole real Jace/evil Jace concept was confusing the hell out of me. The evil Jace wasn't even evil. In fact, I thought the evil Jace was the real one. Because he was a piece of shit. He would make those incredibly Jace-like haughty remarks about how perfect and desirable he was. Jace would not survive in the real world with that arrogant attitude, which is why he's fictional. Thank God. Anyway, I don't get it. All those times they cut each other open with their bare hands made out, Clace was like, \"Oh, that wasn't the real Jace. Oh, I didn't want our first time to go like this because I'm not the real Jace.\" And this one time when they were finally about to have sex, but they didn't because they needed to whine and moan more:I'm jealous.Of who?Myself. I hate the thought of him being with you. The other me. The one Sebastian controls.That's such terrible, ugly writing. I am so sick of Clace. I am so sick of Jace being overly proud of himself. I am so sick of Clary practically worshiping Jace and finding every excuse to justify his shitty behavior and actions. Their scenes are so terribly written. There are pages of them talking about how they would do anything for each other. How they love each other. Pages of their cringey romance. By the way, I wasn't kidding when I said they wanted to cut each other open with their bare hands. Don't believe me?He kissed her harder and she clutched his shoulders as he sucked her bottom lip into his mouth and bit down on it, sending a shock of pleasure mixed with pain through her body. She squirmed to get closer to him and felt his breath quicken; she could taste blood in her mouth, salt and hot. It was as if they wanted to cut each other apart, she thought, to climb inside each other and breathe each other’s breath and share each other’s heartbeats, even if it killed them both. There was blood under her nails where she had clawed his back.Just terribly written and overdone. Also, read this sentence. A soft explosion went off in her head, like a dull firework of rage.In Clare's mind, explosions are soft and fireworks are dull."}, {"userName": "hayden", "userReviewDate": "Sep 13, 2010", "userURL": "http://www.goodreads.com/user/show/2995566-hayden", "userReview": "[ALEC AND MAGNUS BROKE UP! D: Their relationship was one of my favorites. Hopefully, Alec can win him back in 2014 when the next book comes out. (Yeah, can you tell I'm still totally pissed about that date?) (hide spoiler)]"}, {"userName": "Candace", "userReviewDate": "Nov 23, 2014", "userURL": "http://www.goodreads.com/user/show/16384209-candace", "userReview": "Where I was disappointed with 'City of Fallen Angels', 'City of Lost Souls' definitely made up for it! I'm glad that I didn't hang it up after the last book and kept pushing forward with the series. This fifth book was full of action and suspense. This time around, Jace is under the influence of Sebastian, the guy we all love to hate. Clary is kind of along for the ride, hoping she can break through to Jace. Meanwhile, Sebastian just keeps getting creepier and creepier. For the most part, Jace seems lost. He's kind of like Sebastian's \"Stepford wife\"/groupie. He seems entirely possessed with his adoration of all things Sebastian. It takes bromance to a whole new level.However, being the diehard that she is, Clary refuses to give up on Jace. She focuses on the brief moments of clarity that he has in the midst of his mental enslavement. She knows that the real Jace is still in the shell that he is now.Meanwhile, back at camp \"good\", Simon, Magnus, Alec and all of the others, work on a way to fire Jace. There is plenty of action taking place on that front as well. Simon seems to be patching up his romantic relationship, while Alec seems to be wreaking havoc in his.I don't want to give too much away, but I will say that I enjoyed the time with Jace and Clary. Finally, they get to spend some time together...even if it isn't always the \"real\" Jace. It may have taken five books, but things finally heat up between the two.Overall, this was another great book in the series. Things have definitely picked up and I'm mentally preparing for the good vs. evil showdown that is bound to happen in the final book. I'll be starting the sixth, and final, book immediately."}, {"userName": "Kitty", "userReviewDate": "May 08, 2012", "userURL": "http://www.goodreads.com/user/show/4032367-kitty", "userReview": "[image error]"}, {"userName": "Rachel (The Rest Is Still Unwritten)", "userReviewDate": "Aug 06, 2010", "userURL": "http://www.goodreads.com/user/show/2406353-rachel-the-rest-is-still-unwritten", "userReview": "*sobs* May!?!? 2012?!? May 2012?!? *sobs some more* This cannot be! Really! It's like....too long! Too, too long! I NEEEEEEEEEEED THIS BOOK! How can Cassandra Clare do this to me--ahh, I mean us! I need this book, like yesterday!I don't know how I'm going to wait this long!*sobs, wails, bawls some more.....*"}, {"userName": "Emelie", "userReviewDate": "Jan 05, 2011", "userURL": "http://www.goodreads.com/user/show/4757979-emelie", "userReview": "Update 12-05-21, finished reading: Wow. Absolutely 'wow'. Spectacular. City of Heavenly Fire, I'm coming for you...Before reading CoLS (and this applies to CoHF as well)How. Am. I. Supposed. To. Wait. A. Whole. Year. For. This. One? !!!!!!!!! I want it so badly, right now!If - and it's not very likely to happen, but IF - the world ends in 2012, and this one has not come out, then I'll be so pissed that even the zombies, or demons, or Mother Nature, whatever, will shit their pants in fear of me. I'll be THAT pissed. You better watch your sorry ass if you plan to end the world for me before I've had a chance to read this book.I, for one, think it's going to end in some supernatural way. Either it's zombies - which I probably fear the most, since I'm shit-scared of zombies - or it's demons. Pick one. Yes, it probably sounds very weird that I'm sickly scared of zombies, but they'd still shit their pants if they decided to end the world before I got to read 'City of Lost Souls'. Hm, ain't that confusing. Let's see it like this. I'm scared of them now, but if you get me pissed enough... then you better start running.2012-01-05Oh. My. Fucking. God. THAT COVER IS EPIC!!!! Okay, so I still don't picture Clary like that... and it's the same for City of Fallen Angels (obviously, since it's the same model), but Jace... oh, Jace... he is something special, isn't he? Lovely! :D Yes, I like it... if only a bit rougher around the edges, then I'd be perfectly happy :D Bu awesome! :D"}, {"userName": "Soumi", "userReviewDate": "Dec 12, 2011", "userURL": "http://www.goodreads.com/user/show/6833452-soumi", "userReview": "By The Angel! Do I actually need to review? Holy Hell! What am I gonna write?“Kill me, little sister. Kill me and you kill Jace, too.”Let’s start with the story, as it picks up, where City of fallen Angels left off, the resurrection of Sebastian. As he binds him to Jace, the two became irrecoverably inseparable, what one feels, the other feels the same, the pain, the joy everything. Jace the one Clary loves, and Sebastian the o ne she hates most, and now they are one. The clave wants to summon either of them, but killing Sebastian means, Jace will die, and Clary can’t let that happen. When Jace showed up, she follows him, determined to free him from Sebastian’s captivity. As the story progress, Clary discovers Sebastian’s true motive behind his suddenly changed and extremely generous behavior, and his plan to bring down entire Clave along with each and every shadowhunter. “I need Jace,” said Sebastian. “But in his heart, he’s not like me. But you are.” Previously I hated Sebastian, but In CoLS, I actually felt kind of sorry for him, he was the mere victim of abuse and ruthless torture by the name of training. His entire psychopathic personally was build up on the way he was treated by his father Valentine, unloved and to be ruthless. I say Sebastian is the heart of CoLS. Without him, the whole story would have fallen flat, and Miss Clare did a brilliant job by bringing him back with more vengeance. “I never cared,” he said. “I wanted you anyway. I always wanted you.” Romantic elements were higher than any other books TMI series, also heart break, despair and desire. The book was both my solace and torment, as darkness and light were aligned together, casting the perfect shade. The story gradually gotten faster, page by page and at the ending the action was mesmerizing, as if I was visualizing the whole scene, breathlessly.It will be very wrong to say CoLS is only focused on Jace, Clary and Sebastian, each and every character played very crucial part, especially Simon. Oh Gosh, I love this guy, he has grown into such understanding and responsible guy, his transformation is notable throughout the entire series. Also the on and off romance between Simon and Izzy took a whole new turn, I really appreciate how Cassandra Clare focused on Isabelle and Simon's relationship as well. As I mentioned earlier that the book has a lot more heart breaking, I referred to Alec and Magnus, such a lovely couple who let their relationship at a stake, which is entirely unacceptable.The book has many labyrinthine mysteries, and suspense, that is killing the readers to get the next book, which won’t be coming out until 2014? However I can’t help but bring out the most conflicting topic of debate Brother Zachariah whether Brother Zachariah is Will or Jem.. I bet, if a chance is given to the fans of TMI series, they will fight over this topic for the entire day, without being tired. Here is my little opinion that’s completely personal. His physical appearance is similar to Will with long and slender fingers and dark hair. He was also a shadowhunter before be came one of the silent brothers. I have a strong feelings of Brother Zachariah being Jem. I think Will married to Tessa and from there all Herondale decedents come from, later Will died in some fight like shadowhunters do. But I think when Jem was dying silent brothers saved him by turning him into one of them cause he is the youngest one among them he can speak using mouth. His silvery hair may be turned back into black after being saved and stopped using demon powder.Brother Zachariah has no children But Jem has decedents cause we will be seeing Emma Carstairs in The Dark Artifacts or may be Emma came from other Carstairs line, not Jem. Any that's not Will for sure cause Jace is Will's decendent, not any other Herondale's.“I know about parabatai,” said Magnus, an angry, dark undercurrent to his voice. “I’ve known parabatai so close they were almost the same person; do you know what happens, when one of them dies, to the one that’s left —?”Magnus also mentioned he knows what happened when one of the parabati dies. That means in Clockwork Princess one of the boys probably gonna die. Being a Silent Brother is life, Clary Fray. But if you mean I remember my life before the Brotherhood, I do.Clary took a deep breath. “Were you ever in love? Before the Brotherhood? Was there ever anyone you would have died for?”There was a long silence. Then:Two people, said Brother Zachariah. There are memories that time does not erase, Clarissa. Ask your friend Magnus Bane, if you do notbelieve me. Forever does not make loss forgettable, only bearable.Jem can die for both Tessa and Will, and Will can for Tessa and Jem. So Brother Zachariah is sure one of the boys from ID and who ever it is has no chance on being with Tessa cause silent brothers can not be romantically engaged. All of the above are just assumptions, Best way to find out by throwing Brother Zachariah in pond full of ducks, if he runs sure he is Will, if he doesn't he is Jem.The Herondales have a bad thing for Ducks"}, {"userName": "Jessica's Totally Over The Top Book Obsession", "userReviewDate": "Jun 18, 2016", "userURL": "http://www.goodreads.com/user/show/28967089-jessica-s-totally-over-the-top-book-obsession", "userReview": "4 Two sides of Jace\n*Spoilers*This one was much better than the last one. Lots of action. Jace and Clary still can't catch a break. Really the span of the whole series they are apart pining for each other with like a few weeks here and there that they can actually be together. Teenage angst at it's highest. I really wish she would have let them be together a little more in this series. I understand it's a ya series but if you want them to be this awesome powerfully connected couple that you just can't forget then they actually have to be a couple for a little bit of time. Just sayin'! I think they were together more in this book then in the last 4 but it was still tainted since Jace wasn't really Jace. I was glad that Clary started to finally kick some ass. She has been pretty wimpy standing around while everyone fights and gets hurt in the last 4 books. This one she was trained and kicking ass with the best of em. Loved Simon even more in this book. He is such a great guy and brave. I just wish him and Izzy would get together they have such a strong connection. I was so glad Simon's sister didn't turn her back on him like his mother. I was so disappointed in Alec. I don't know what the hell was going through his mind in this book but he was way over the line. I don't blame Magnus at all for ending things with him. Although that break up scene was so heartbreaking. \nI don't really know how I feel about Maia and Jordon. Jordon I think is great and Maia too but I don't really feel it with them together Idk. Sebastian was gross, creepy and evil all in the same breath. Jocelyn truly gets on my nerves. She is the most unsupportive mom ever. I get so mad that she doesn't like Jace she doesn't even give him a chance. No wonder Clary runs off and does shit herself her mom is an over the top bitch that lies, treats her like she is 2 and doesn't like the love of Clary's life. Poor Luke, losing his sister getting stabbed and almost dying. I'm really liking Brother Zachariah, but I wonder why he seems to want to help Jace so much. Is there some connection there? Was it just me or was everyone else happy to see Magnus's ex Camille bit it too! I'm on to the last one and I can't wait to see how things end!"}, {"userName": "Saniya", "userReviewDate": "Dec 21, 2010", "userURL": "http://www.goodreads.com/user/show/4048678-saniya", "userReview": "FUCK. GOD DAMN AMAZING TRAILER! I can't, I just can't breathe right now. O.O <3http://www.youtube.com/watch?v=S_FUJU... \"And I am going to burn down the world.\" *Crying* My Man, my man. :'DScrolling down as usual on facebook. Lalala, nothing interesting. *Cover passes* lalal -Dramatic pause- \"WTH? Did I jus-\" *Scrolls up!*\"OMG OMG OMG\" The cover! xD <3 (LOL! I just love the man in the pic)Ok. Maybe, just maybe I was expecting Magnus or Alec... but this rocks too! GOD! They look so awesome! <3Now please kindly give me the book before I go insane. Need to OWN! O_O"}, {"userName": "Melissa ♥ Dog/Wolf Lover ♥ Martin", "userReviewDate": "Jan 07, 2017", "userURL": "http://www.goodreads.com/user/show/17438949-melissa-dog-wolf-lover-martin", "userReview": "If I could have won the lottery for every time I wanted to smack people in this book, I would have an infinite amount of money right now. But, I digress. Welcome to the world of magic and twats. Just kidding :-D I love all of the characters even though I want to smack them at times. I don't care what anyone thinks but I don't think that Simon and Isabelle should be a couple. I know it has the whole, let's everyone in the group be with someone vibe going, but I just don't see them as a couple. Can't anyone just be single? Magnus Bane is the coolest one of all and that's just a fact. And can people and things just quit coming after Jace! I mean for shite's sake, we just got out of one mess with him and into another one. He's not himself in this book for reasons. Clary's good ole brother Sebastian is back and buddies with Jace. It's so not a good thing. Clary gets sucked into their world and all kinds of crazy stuff is going down with them. I really love Jordan and Maia, that's all I have to say about them. They are both good people and werewolves. There are several bad to the bone moments that I loved! From angels to demons and a crazy vampire kid on a rampage. Although one thing she did, classic! Loved it! Loved it! Loved it! Alec made me mad at what he wanted to do to Magnus. I thought, \"dude are you for real?\"So, I wonder what the scooby gang is going to go through in the final book. I dread things that might be coming! MY BLOG: Melissa Martin's Reading List"}, {"userName": "Pearl Angeli", "userReviewDate": "Aug 27, 2014", "userURL": "http://www.goodreads.com/user/show/31514572-pearl-angeli", "userReview": "Cassandra Clare did a wonderful job once again!City of Lost Souls, the fifth book of The Mortal Instruments series, picks up where City of Fallen Angels left off. I don't want to give anything away by describing the things that have happened here, but the series already becomes more and more interesting. This sequel is actually a much better response compared to the City of Fallen Angels because all the events here were pretty much powerful and more remarkable.I love how it started off as a bang!, eventually giving a slow-burn feels when the Shadowhunters were trying to figure out how they can come up with a solution to the dilemma, and ending up with a great and action-packed resolve. Although all throughout the book I must admit that I was really getting frustrated especially because of how badly things were turning for Jace. I mean, c'mon, why does Cassandra Clare keep torturing Jace and making him suffer all the time? It's fricking unfair!The best part of this book is SIMON. My boy always saves the day! He played a great part here and I think this is the book where he really shines best! When it comes to Clary, her character improved here (although I prefer her character development in City of Glass) but still, I like how bold she was here and how she resorted to critical-thinking. Alec and Magnus' relationship here was tested big time and I don't know what to feel about what happened to them here. As for Isabelle, once again this chick astounded me. As usual, she's a fierce, in-your-face character and that's what I loved about her! Maia and Jordan's relationship was also highlighted here. I love the sweet reunion! And of course, Sebastian . Blimey, I am not usually a fan of villains but it's so ironic how I fangirled over a bad guy all throughout the book!The action scenes were great and although it happened at the final chapters, they still didn't fail to bring out the adrenaline rush. The ending, on the other hand, was a blast and was well-executed. It had a surprise factor that will leave you wanting for more. All in all, it was a great come back. Cassandra Clare writes beautifully, but then I have always thought so! This book is really a world I could get lost in!Rating:"}, {"userName": "Bgurl (don't h8 me cuz I'm honestful)", "userReviewDate": "Jun 06, 2017", "userURL": "http://www.goodreads.com/user/show/4166814-bgurl-don-t-h8-me-cuz-i-m-honestful", "userReview": "TOP 5 SNARKIEST MOMENTS IN City of Lost Souls.In my review of City of Fallen Angels (TMI #4), I listed The Top 5 Angsty Issues. Now it’s time to rank my favorite part of the TMI series: The Snark. So, let’s get to it, shall we? Listed below, are the Top 5 Snarkiest Moments in City of Lost Souls (TMI #5), from least to most snarktastic. Enjoy!#5. What Do Werewolves & Frat Boys Have In Common?A lot, actually! As the posting at The Praetor House dormitories proves. “PRAETOR HOUSE RULESNo shape-shifting in the hallways.No howling.No silver.Clothes must be worn at all times. ALL TIMES.No fighting. No biting.Mark all your food before you put it in the communal refrigerator.”PARTY POOPERS!#4. What’s The Difference Between Sane & Insane?According to Sebastian: \"Two weeks.\"Jace: “Clary has a right to know our plans. I don’t like keeping her in the dark.” Sebastian: “We’ll tell her in a week. What difference does a week make?”Jace: “Two weeks ago you were dead.”Sebastian: “Well, I wasn’t suggesting two weeks. That would be insane.”CUZ I DON’T WANT THE REAL ANSWER TO BE “A SHIRT”. #3. What Kind Of Advice Do Warlocks Give?Let's see...Simon: “I’ve got the Mark of Cain. That means nothing can kill me, right?”Magnus: “You can kill yourself. Inanimate objects can accidentally kill you. So if you were planning on teaching yourself the Lambada on a greased platform over a pit full of knives, I wouldn’t.”Simon: “There goes my Saturday.”YUP!#2. Is Snark A Deadly Sin?Jace doesn’t think so.Jace: “I’m trying to remember all the deadly sins. Greed, envy, gluttony, irony, pedantry…”Clary: “I’m pretty sure irony isn’t a deadly sin.”Jace: “I’m pretty sure it is.”Clary: “Lust is a deadly sin.”Jace: “And spanking.”Clary: “I think that falls under lust.”Jace: “It has its own category. Greed, envy, gluttony, irony, pedantry, lust, and spanking.” ESPECIALLY THE PART ABOUT JACE SPANKING… #1. Are Magnus & Alec One Of “THOSE” Couples?You know… “THOSE” couples we make up catchy monikers for? Isabelle: “You smell like sandalwood.”Alec: “We like sandalwood.”Isabelle: “Either that’s the royal ‘we’ or you and Magnus are turning into one of those couples that think they’re one person. ‘We like sandalwood.’ ‘We adore the symphony.’ ‘We hope you enjoy our Christmas present’—which, if you ask me, is just a cheap way of avoiding having to buy two gifts.”WE SHOULD!BOTTOM LINE: City of Lost Souls is so chock-full-o-snark, this list could have been a hell of a lot longer. So, if there’s a snarktastic quote you’d like to add, please do so in the comments section. Then, check out my review of City of Heavenly Fire (TMI #6), where I rank TMI’s swooniest couples. City of Lost Souls (TMI #5), by Cassandra Clare: 5 “Snarktastic” Stars.For information about my rating system, see my profile page.City of Fallen Angels (TMI #4): Click Me Baby!City of Heavenly Fire (TMI #6): Coming Soon"}, {"userName": "Anniebananie", "userReviewDate": "Mar 25, 2018", "userURL": "http://www.goodreads.com/user/show/47587994-anniebananie", "userReview": "4,5 Sterne ⭐️ Na wenn das mal keine positive Überraschung war 😱Für mich das beste Buch der Reihe, was vor allem daran liegt, dass Clary hier mal nicht als hirnamputierte Hohlfrucht auftritt. Ich konnte ihre Handlungen diesmal größtenteils wirklich nachvollziehen.Auch unseren \"neuen\" Bösewicht/Gegenspieler mag ich lieber als Valentin aus den früheren Bänden. 👌🏻Es gab auch wieder viele tolle Malec-Momente obwohl ich ja vor allem Magnus und seinen Humor sehr in Cassie's Büchern zu schätzen weiß.Sogar an Handlung hat es m.E. hier mal nicht gemangelt was auch an den vielen POVs liegt. Ich bin mittlerweile auch echt ein Fan von Jordan und Maia und naja Jocelyn hasse ich auch nach Band 5 noch 🤷🏼‍♀️Und im Epilog sind ja noch so manch erschreckende Sachen passiert, dass ich wirklich von mir behaupten kann, dass ich mich auf das große Finale freue 😅"}, {"userName": "Whitney", "userReviewDate": "Jun 21, 2011", "userURL": "http://www.goodreads.com/user/show/3827678-whitney", "userReview": "I don't think I can even write a review for this just yet. Oh my God. SO MANY FUCKING FEELS, I CAN'T EVEN.PAGE 510-11. KILL. ME.Lord, help me get through this 2-year wait for Heavenly Fire."}, {"userName": "James Trevino", "userReviewDate": "Feb 23, 2016", "userURL": "http://www.goodreads.com/user/show/52992135-james-trevino", "userReview": "Much, much better than City of Fallen Angels. But again, it takes a while until things get going. The final chapters are great, but the middle part of the book... ugh, man, oh, man. Basically the reason why this is a 4/5 and not less is because of the ending and the chapters involving Simon. The whole Maia/Jordan thing though was so boring and endless. It read like filler and it felt like filler. The book could also do without Clary dramatizing about every single detail in her life in every freaking scene. It's one of those cases when, in a book, side characters actually have a more interesting story than the main ones (Simon, Alec).That being said, City of Fallen Angels reminded me of City of Glass (and that is good considering CoG is still far and away the best in the series), even though it could have been cut in half and not lose anything of importance."}, {"userName": "Gemma", "userReviewDate": "Sep 09, 2010", "userURL": "http://www.goodreads.com/user/show/2734630-gemma", "userReview": "FINAL REVIEW:People keep leaving me annoying comments about how if I have nothing nice to say about the new Mortal Instruments books, then I \"don't have to read them!\" With all due respect, that opinion is wrong; I really do have to read them. No matter how much my loathing for City of Fallen Angels made me disgusted with Clare's decision to write a second trilogy, I have to finish these books. I've invested my time, money, energy and love (yes, love) into them, and that is why I keep reading. Because I hope things are going to pick up and make the expansion of the series worth it, even if I don't really believe it's going to happen.With that cynicism weighing down on me, I went to Walmart (because CostCo failed me) and bought City of Lost Souls. After reading the first hundred pages or so, my hopes rose a little bit; stuff was happening. There was an apparent plot and people were moving along with it; it was a definite improvement over the standing and talking and whining that made of the first three-fourths of City of Fallen Angels. I started thinking that maybe Clare hasn't lost her touch after all. But the further I read, the more I realized that she has, at least with this series. City of Lost Souls felt like the fourth Pirates of the Caribbean movie; yes, there's a story, and no, it's not bad, but it just isn't as fun as it once was. In this one, the energy and adventure has been drained away. Like Clockwork Prince, this book is significantly less funny than its predecessors. Unlike Clockwork Prince, it doesn't work to Lost Soul's advantage. The lack of humor seemed to be for lack of trying, like Clare didn't have the energy to make this book funny. The few lines intended to be humorous feel tired and haphazard (with the exception of one expertly-timed Star Wars reference). Instead, Clare tries to substitute humor for angst. Lost Souls is absolutely angst-ridden. Clary's angry and manic, Alec's mopey and meditative, Isabelle is also mopey, as well as confused... Because I do actually care about these characters and their problems, more or less, the melodrama works to a certain extent. The Isabelle-Simon situation was particularly interesting and rather sweet. But overall, the excessive moodiness of the characters only weighed the book down and made it seem more heavy and depressing and boring than it should have been.It also made once-likable characters seem more annoying than they should have been. Clary, in particular has really began to grate on me. I mean, sure she's determined to save the man she loves, but she's gone from impulsive to idiotic, making completely irrational decisions and being totally unreasonable when anyone around her questions them. The determination she had in the previous books has been blown up to a new and disagreeable extreme that makes me dislike her a little bit more with each passing page. Another character who deteriorates before our eyes is Magnus Bane. It pains me to say it, but it's true. In Lost Souls, he's neither fun nor funny. All his glitter and panache seems to have melted into prissiness and irritability; he's more annoying than anything. And that's a tragedy, because he used to be almost as awesome as Jace Wayland himself. Jace Wayland, not Lightwood. I think Jace got boring after his name changed. Remember the impossibly arrogant, beautiful, hilarious, butt-kicking Jace of the first three books? I haven't really seen him since the end of City of Glass. I know he's been kind of possessed since then, but that really doesn't change the fact that I, as a reader, miss his old character. Even when he's himself, his love for Clary seems to have sapped away his old wit and humor, and that ridiculously big ego is gone. I have to mention that the Jace-Clary love thing has also grown rather stale. The more I read about it, the less I believe it. Clary says she'd die for Jace, she'd do anything for him, but I feel like she's more in love with the idea than the person. She's an average girl who suddenly has a hot, funny, smart, strong, awesome guy saying he's in love with her. What girl is going to say no to that? But when it comes down to it, I don't feel that it's the deep love it needs to be, more of a love of the concept of her having a guy like him as her boyfriend.I dunno. That's just what it felt like to me. I was fine with their relationship when it was on the side, but now that it's in the limelight, it seems a bit more transparent. Also growing increasingly transparent is the plot. Yes, it's existent, but the more I thought about it as I was reading it, the more it became rather ridiculous. Clary's running around trying to save Jace; Jace and Sebastian are plotting something bad; everyone else goes through relationship drama. And it's something, and it's substantial but it's... silly. And not fun. And pointless. Clare keeps attempting to incorporate the apocalypse and throw the entire balance of the world and mankind into danger, but it really doesn't work. I mean, Magnus makes vague references to visions about the world flowing with blood, but other than that... I don't know. At the end of it all, the plot seemed meager, like an crime-show mystery, set up, worried over and then solved because that's just how these things go. The conflict seemed too contrived, and the resolution seemed too easy. I'm sorry; I know I'm beating a dead horse, but the lack of a need for a second trilogy grows more painfully obvious with each chapter. After reading Lost Souls with little memory of CoFA, I realized how unnecessary the last installment was; all I need to know from that book is that Sebastian and Jace have now become bound. And that's it. 424 pages down to one brief sentence. But it's not just that. There's a point in this book, towards the end, where I'm figuring out a way to wrap this entire series up within the next forty pages. And it's there; Cassandra Clare could easily do it, but she won't, she'll drag it out for a whole other book only to have it end the way it did in City of Glass, more or less, and if that's the case, then why bother with Lost Souls? But then when you think about it, why bother with the second trilogy? Why not just have it end at the beautiful place where it did?I don't know. Actually I do; writing is like prostitution and she sold out to make more money. It's not as though the Mortal Instrument books are the only things she can write. She has talent as an author; her sentences have a generally nice flow to them and she can easily develop likable characters and decent or better plots. I feel that she has more to offer than half-baked revivals of a finished series. Oh, well. It's her decision, and if she wants to keep writing MI books, then so be it. And because I am tied to this series, I will keep reading, if only to watch that which I once loved turn slowly to ashes. (All the pre-reading reviews that I never delete for some reason)UPDATE 5/2:Less than a week to go and I am currently out of money and time for a trek to Costco, as well as the typical series recap where I go back and reread all the books for... what, the fifth time? I dunno. I probably won't be reading City of Lost Souls before June. I actually have a secret plan to avoid this book for as long as possible, preferably until next April, so when I finish it, I'll only have a couple months of waiting for City of Heavenly Fire. Plus I can continue to hope and believe that this is an excellent installment and that City of Fallen Angels was just a glitch, and that Cassandra Clare is still full of ideas and plots and creativity. Do I really believe this? No. Not because I don't enjoy these books, but because I question the motives behind writing a second trilogy; in my opinion, it was over with City of Glass, and everything beyond that was published so she could make more money. It's kinda like if JK Rowling wrote that 8th Harry Potter book. You'd have to wonder why. Oh, well. I'll carry on with this series until the end, bitter though it very well may be.Please don't let it be. UPDATE 1/4:Ew... what's with the cover? Is Cassandra Clare so blatantly switching from writing fantasy to writing crappy romance? Because that's what the cover would suggest. This looks like one of those poorly written paperbacks they sell on a revolving wire stand for five bucks at Fred Meyers.I mean, seriously. I can't believe this isn't just a teaser. Or fan-made. (Because some of those were better than this one) It's ridiculously cheesy, and quite frankly I'm kinda irritated with Clary right now and I don't feel that she deserves another cover. She's already had two; let's give some of the supporting characters a chance. I'm all for a Lightwood on the cover. Or Magnus. Or even a second Sebastian/Jonathan.Anything but two annoying lovebirds staring sappily into each other's eyes while locked in a passionate embrace... If I want to look at that, I can just walk down the English hall of our high school. Good grief. I'm going to be embarrassed at the checkout stand while I'm purchasing this. --Oh, no.This series was intended as a trilogy. That's why the books worked; because they were INTENDED to be a series, not just spinoffs. I don't want this to turn into Pirates of the Caribbean, where the sequels are made just to make money, and then the creators get bored and start messing around and ruining things for everyone. It's going to be like Mockingjay; all the major characters (Clary, Jace, Simon) will live, but all the cool side ones are going to die. RIP Magnus, RIP Alec, RIP Isabelle, RIP Luke..."}, {"userName": "Bangadybangz", "userReviewDate": "Apr 16, 2016", "userURL": "http://www.goodreads.com/user/show/39123161-bangadybangz", "userReview": "Wow I finished this a while ago! Guess I forgot to share my thoughts...Um... It was good? LolNot my favorite of the series, but I've heard CoHF is amazing, so I'm pumped to read that soon! :D"}, {"userName": "May", "userReviewDate": "Oct 13, 2015", "userURL": "http://www.goodreads.com/user/show/20416955-may", "userReview": "NO PUEDO MÁS. QUIERO LEER EL SEXTOOOOOOOOOOOOOOOOOOOOOOO."}, {"userName": "P ", "userReviewDate": "Mar 17, 2014", "userURL": "http://www.goodreads.com/user/show/25327841-p", "userReview": "“I never cared,” he said. “I wanted you anyway. I always wanted you.” \nThis book is a cliché. CoLS is one of the few books I know what will happen next. Jace was turned into a bad guy by Sebastian, and he convinces Clary to join him and her evil brother. I found out that this kind of story used to happen before, it's not a new thing to set our MCs apart with this bullshit to prove their true love. However, I still love CC's writing, it's intriguing and beautiful as always.\n“You may have the worst timing since Napoleon decided the dead of winter was the right moment to invade Russia.” \nCoLS looks promising for an epic ending, in the end of this book, we'll see the event triggers something that occurs in CoHF. And for TID fans, this one absolutely connects to those three books. Although this book struggles less than CoFA, it didn't seem to hold my interest the whole time. Even it's thoroughly written, the plot and everything are likely out of control since CoG in my opinion.\n“I know about parabatai,” said Magnus, an angry, dark undercurrent to his voice. “I’ve known parabatai so close they were almost the same person; do you know what happens, when one of them dies, to the one that’s left —?” \nAll in all, this book is better than CoFA even my feeling doesn't seem so different."}, {"userName": "Mikee Andrea (ReadWithMikee)", "userReviewDate": "Aug 29, 2015", "userURL": "http://www.goodreads.com/user/show/44137919-mikee-andrea-readwithmikee", "userReview": "I managed to stop complaining about this book long enough to finally finish it. Although I do believe that City of Lost Souls was better than its predecessor, it wasn't that much better. I'm still disappointed in the direction that this series decided to go and I still stand by what I said before about the last three books being completely \nUNNECESSARY.\nThis series was called \nTHE MORTAL INSTRUMENTS\n for a reason. Three instruments for each of the three books for the first half of the series. City of Bones was about the Mortal Cup. City of Ashes was about the Mortal Sword, and so forth. This series should've ended after City of Glass because the longer these books went on, the more I began to \ndespise\n this series and its characters. And that's saying a lot considering how I loved the first half of The Mortal Instruments and even dubbed this series as one of my favorite series of all time. But now, I could barely stand the characters, specifically Clary and Jace. Maybe even just \nClary.\n And since she's the central character of this whole series, you can see how this was problematic.My hatred for Clary reached its highest point in this book. I thought I couldn't hate her more than I already did, but she proved me wrong. She's, hands down, the most selfish character I've ever had to read about. And it just pissed me off that everybody in this book was defending her actions and claiming it as her \n\"fighting for what she loves\".\n NO. It's her putting her own reckless life in danger and everyone else following after her, risking their own lives, \njust to save her dumb ass.\n People are dying and people will continue to die on her behalf because everything she does is in the name of \"love\". She doesn't care about anything or anyone else because EVERYTHING she does is fueled by her love for Jace and it's absolutely \ndespicable.\n I have no good words to say about Clary or her relationship with Jace because in my opinion, Clace, or just Clary in general, was \nthe downfall of this series.\n If you really want to know how much my perception of these characters did a complete 180, you should know that I absolutely loved Clary and Jace in the beginning. I shipped them 100 percent. But my love for them dwindled with each book I read. City of Glass left me barely tolerating both Clary and Jace. After City of Fallen Angels, I lost all interest and respect for these two characters.Another thing that annoyed me about this book was Maia and Jordan. I USED to love Maia. I loved her whole backstory and how she was able to persevere. Then came City of Fallen Angels and Cassandra Clare just turned her into a typical, hormonal teenager in which every scene and dialogue just revolved around her relationship with Jordan. Jordan was a pleasant addition to the squad but ever since we learn about Maia and Jordan history, he pretty much only exists now \nfor the sake of giving Maia a love interest.\n Two great characters became completely \nIRRELEVANT\n to the storyline due to their relationship. They had nothing to contribute besides making out and sex. Here's an example of how literally all their POVs consisted of:Jordan: Did Luke say yes to letting them use his farm?Maia: Yes.*CUE MAKING OUT*Maia: Wait, haven't you noticed that every time we see each other we're only making out or having sex? Maybe we should talk.Jordan: Okay... Well what do you want to talk about?Maia: Nothing.*CUE MAKING OUT*And this my friends, I AM NOT even exaggerating about. Just turn to page 382 and read it for yourselves.Honestly, the only good thing about City of Lost Souls was Isabelle (and all \nThe Infernal Devices\n references). She dragged all their asses and told everyone straight up what everyone needed to hear. Bravo, Isabelle. She's twice the person Clary is or ever will be. And Simon and Isabelle? Let's just say that Clace doesn't even have an ounce of their chemistry. Even \nSebastian and Clary have more chemistry\n than Clace will ever have and this relationship can't even happen!I'm only finishing this series because: 1) Lady Midnight occurs after City of Heavenly Fire and the characters in Cassandra's series always seemed to be connected or related to each other. I don't want to miss out on any details, no matter how big or small, when it comes to the new characters. 2) I'm hoping that some of our main characters from The Infernal Devices will show up and play an important role in which I'm assuming will be war. 3) I'm trying to finish ALL five of the Shadowhunter Chronicles."}, {"userName": "Angelyn ", "userReviewDate": "May 28, 2012", "userURL": "http://www.goodreads.com/user/show/5170992-angelyn", "userReview": "If you haven't read the letter, here it is: To my son,If you are reading this letter, then I am dead.I expect to die, if not today, then soon. I expect that Valentine will kill me. For all his talk of loving me, for all his desire for a right-hand man, he knows that I have doubts. And he is a man who cannot abide doubt.I do not know how you will be brought up. I do not know what they will tell you about me. I do not even know who will give you this letter. I entrust it to Amatis, but I cannot see what the future holds. All I know is that this is my chance to give you an accounting of a man you may well hate.There are three things you must know about me. The first is that I have been a coward. Throughout my life I have made the wrong decisions, because they were easy, because they were self-serving, because I was afraid.At first I believed in Valentine’s cause. I turned from my family and to the Circle because I fancied myself better than Downworlders and the Clave and my suffocating parents. My anger against them was a tool Valentine bent to his will as he bent and changed so many of us. When he drove Lucian away I did not question it but gladly took his place for my own. When he demanded I leave Amatis, the woman I love, and marry Celine, a girl I did not know, I did as he asked, to my everlasting shame.I cannot imagine what you might be thinking now, knowing that the girl I speak of was your mother. The second thing you must know is this. Do not blame Celine for any of this, whatever you do. It was not her fault, but mine. Your mother was an innocent from a family that brutalized her. She wanted only kindess, to feel safe and loved. And though my heart had been given already, I loved her, in my fashion, just as in my heart, I was faithful to Amatis. Non sum qualis eram bonae sub regno Cynarae. I wonder if you love Latin as I do, and poetry. I wonder who has taught you.The third and hardest thing you must know is that I was prepared to hate you. The son of myslef and the child-bride I barely knew, you seemed to be the culmination of all the wrong decisions I had made, all the small compromises that led to my dissolution. Yet as you grew inside my mind, as you grew in the world, a blameless innocent, I began to realize that I did not hate you. It is the nature of parents to see their own image in their children, and it was myself I hated, not you.For there is only one thing I want from you, my son — one thing from you, and of you. I want you to be a better man than I was. Let no one else tell you who you are or should be. Love where you wish to. Believe as you wish to. Take freedom as your right.I don’t ask that you save the world, my boy, my child, the only child I will ever have. I ask only that you be happy.Stephen"}, {"userName": "shreya", "userReviewDate": "Oct 23, 2011", "userURL": "http://www.goodreads.com/user/show/5800904-shreya", "userReview": "Ok guys, the OMG's and updates had to go because the humongous length of this review. You don't have to read it all if you don't want to, lol. ;DThe official blurb:“The demon Lilith has been destroyed and Jace has been freed from her captivity. But when the Shadowhunters arrive to rescue him, they find only blood and broken glass. Not only is the boy Clary loves missing–but so is the boy she hates, Sebastian, the son of her father Valentine: a son determined to succeed where their father failed, and bring the Shadowhunters to their knees.No magic the Clave can summon can locate either boy, but Jace cannot stay away—not from Clary. When they meet again Clary discovers the horror Lilith’s dying magic has wrought—Jace is no longer the boy she loved. He and Sebastian are now bound to each other, and Jace has become what he most feared: a true servant of Valentine’s evil. The Clave is determined to destroy Sebastian, but there is no way to harm one boy without destroying the other. Will the Shadowhunters hesitate to kill one of their own?Only a small band of Clary and Jace’s friends and family believe that Jace can still be saved — and that the fate of the Shadowhunters’ future may hinge on that salvation. They must defy the Clave and strike out on their own. Alec, Magnus, Simon and Isabelle must work together to save Jace: bargaining with the sinister Faerie Queen, contemplating deals with demons, and turning at last to the Iron Sisters, the reclusive and merciless weapons makers for the Shadowhunters, who tell them that no weapon on this earth can sever the bond between Sebastian and Jace. Their only chance of cutting Jace free is to challenge Heaven and Hell — a risk that could claim any, or all, of their lives.And they must do it without Clary. For Clary has gone into the heart of darkness, to play a dangerous game utterly alone. The price of losing the game is not just her own life, but Jace’s soul. She’s willing to do anything for Jace, but can she even still trust him? Or is he truly lost? What price is too high to pay, even for love?Darkness threatens to claim the Shadowhunters in the harrowing fifth book of the Mortal Instruments series.”Oh, by the angel!I wasn’t, may I simply just say, even for one freaking second, expecting this book to be a let-down. Going off of that, I am not saying something like this in any part of this review: “Oh, I’m so blown away” or “Oh, this book was better than I’d thought it would be”, because I was expecting Cassandra to stupefy and astonish me, anyway. Alright, now that that’s out of the way, I can get on to explaining how amazing this book actually is. In the beginning, you have no idea how excited I was to get my hands on this piece of heaven, actually, maybe some people, but anyway… I was beyond ecstatic; in fact, I’m surprised I didn’t burst into flames by simply touching it. It was that unbelievable. I waited a year for this book, a full, painful, agonizing, depressing, 12-monthed year, and the question is, in the end, was it worth it? ABSOLUTELY, POSITIVELY, MUCH-AGREEINGLY, NODDING-HEADLY, A DEFINITE YESH (ok, now I’ve gone on to making up my own words. See? There are no words in this world to describe my love for this book; it’s too great for even a shadowhunter to comprehend, well, maybe Jace and Clary, god knows the drastic of actions they took to save their love). -----------SPOILER ALERT (for those of you who haven’t read the series at all)-----------So in CoFA, we left of with Jace mysteriously disappearing with Sebastian, the bastard. I’m pretty sure many of us assumed Sebastian kidnapped Jace, or fought him to the death, but we were all wrong. Things are much, much, worse. Sebastian binds Jace to him, as in, literally and mentally binds. What Sebastian feels and thinks, Jace is the same. But, whereas Sebastian can control Jace’s actions and emotions, this factor is not vice versa, unfortunately. But, whatever physical damage happens to Jace, also affects Sebastian, the only good thing to come out of this horrible connection. Problem is, who wants to hurt Jace?Don’t fret yet guys! Here comes “The Good Team” to the rescue!!! (Inside joke for all of us that have read it, LOL). Team members include: the lovely yet dangerous shadowhunter Isabelle, the silent yet internally-very-emotional shadowhunter Alec, the seemingly disturbed yet adorkable vampire Simon, the charming and always party-hard-fun high warlock Magnus, the hell-of-a-bad-ass mother shadowhunter Jocelyn, always kind and caring werewolf Luke, the depressed and hot ex-boyfriend werewolf Jordan, the secondary-love-interest tough-knuckles chick werewolf Maia, and finally, I guess the “silent and strong yet creepy” (another inside joke ;D) silent brothers!! LET’S HEAR IT UP FOR TEAM GOOD!! You might be wondering why Clary wasn’t included in team good. Well, that’s a good question, if you read the summary then you’ll understand the reason is because Clary chooses to “go into the heart of the darkness, to play a dangerous game utterly alone”, meaning…..that you’ll understand when you read the book, haha. I seriously love her for sticking up and stupidly, stubbornly, and idiotically dealing with this problem head-first just to save Jace, when no one would let her help. YOU GO GIRL! Now for a very, very, very quick inside-look at Team Good: Simon is still very nerdy and very sarcastic. He deals with his problems in his own way, and man oh man, does he have a handful of them for a young boy. I get it, he’s a cursed vampire, a very unfortunate and rejected status, but seriously, give him a break God. There’s a reason to why he can’t say your name, it’s not because he hates you, so stop pouting ‘great one’. Looking on the good side, his love life sure takes a turn though. Isabelle gets tougher, and her love life takes a turn for the good as well. She also deals with many problems, losing two of her brothers, parental issues, gosh; this girl has lots of drama in her life, and us mundie girl think we have it tough. Alec is way more irritating in this one; I never liked him, but, yah, now it’s confirmed, and once again, you’ll understand when you read the book. Magnus was very helpful and charming as always. Take of yourself though, hun, don’t want you stressing out and becoming a drone like Alec, let’s leave that to him. Jordan and Maia and Luke, contributed a lot to the action part of this whole shenanigan with their super wolfy powers. Jocelyn still doesn’t understand her daughter and her needs and wants. Clary’s freakin like 17 now Jocelyn, you gotta let her go. I’m surprised, with her age, how she managed to still kick-butt in this book. I wonder if it’s the shadowhunter gene? Hmmm…Well moving on, the silent brothers are here to help feel up people’s minds again, such pervs. Oh, we’re also introduced to their sister group, called the Iron Sisters, who also play a major role in this book. That pretty much covers everyone. The Important Characters that are always the “act-before-you-think” type, and are always causing trouble in either a good way or a bad way:Clary. Oh Clary. Let’s just say, I take back whatever mean things I ever thought or said about her out loud. She definitely proved herself to be a brave shadowhunter in this book. Clary went from being a short midget-like wimp with a ‘rack’, to literally saving the world. It’s true; she had her down moments, but cut her some slack, this girl is going through more than just puberty, and that’s hard enough to handle. The point is, Clary was amazing in this book. She went through a lot of pain, more than usual, to get Jace back, and that kind of determination deserves a standing ovation. Hell, the fact that she willingly put up with Sebastian just doesn’t deserve a standing O, she should be running alongside Obama in the presidential campaign. I know I would totally vote for her ;D. I cried my eyes out for Jace. I missed his usual sarcastic, witty, and annoying self like crazy. In this book though, whether he’s aware of it or not, he is much happier. But this happy Jace isn’t our normal Jace, and I hate Sebastian for doing this to him. I can count the number of funny things he said in this book on two hands and maybe one toe, it sucks, it really does. NOT THE BOOK, hell no! But the fact that, the remnants of his soul and mind were missing from the book. Though there is one part where he decides to grace us with his presence (the part where I jumped up and down like crazy) that’s all I’m saying. I’m not even gonna say how much pain he goes through in this book, because I’m pretty sure we all know that there isn’t a Cassie Clare book in which the main hero doesn’t suffer. All I have to say about Sebastian is that he’s a bastard who deserves to die a long, painful, excruciating, awful death. And that he needs to get his claws and eyes of Clary before Jace slaps him into the next universe outside our universe. Overall, this book was crazy good in that it contained the romance that was lacking in the other books of the series, and that it contained a great deal more character development. Clare managed to, once again, amaze the knickers off of me. I have this feeling that all these books contained certain points that will lead to major decision in City of Heavenly Fire. This book is the like the BING before the BANG! That being so, I CAN NOT WAIT FOR CITY OF HEAVENLY FIRE, THESE NEXT 2 YEARS WILL ONCE AGAIN BE PAINFUL AND AGONIZING. (sigh) The cycle was bound to repeat again once this book was over. ---------------------------------------------------------------------MORE REVIEWS AT CHOCOLATE COATED REVIEWS @ Blogspot\n\n\nNEXT REVIEW: Insurgent by Veronica Roth"}, {"userName": "Cait • A Page with a View", "userReviewDate": "May 13, 2016", "userURL": "http://www.goodreads.com/user/show/47412532-cait-a-page-with-a-view", "userReview": "I'm so glad that Alec, Magnus, Isabelle, and Simon are finally stronger characters! I would totally give this book more stars if they were the only characters. I'm still not into Clary & Jace and am somehow even more annoyed by them now than I was during that ridiculous incest storyline. Everything just seems like a plot device to keep them apart for the sake of angst and I really don't care! Like first they're siblings, then he thought he'd hurt her, now he's not himself, then he's burning up, WHAT NEXT. Their whole adventure in this book with Sebastian was pretty boring and I wish I would've skimmed parts. And I kept waiting for the book to get some kind of conflict/plot beyond \"Jace is acting funny.\"But Team Good was fun and the writing has improved since the first book! I remember deciding at the start of this one that it was my favorite book in the series so far, but then the last half was so mind-numbingly dull that I completely forgot what I liked & why. So I'll just say this was good, but the third book is probably my favorite overall since I can still remember it."}, {"userName": "Rinoa Heartilly", "userReviewDate": "May 02, 2012", "userURL": "http://www.goodreads.com/user/show/1946963-rinoa-heartilly", "userReview": "[He beats Clary up. (hide spoiler)]"}, {"userName": "AMEERA ", "userReviewDate": "Dec 02, 2016", "userURL": "http://www.goodreads.com/user/show/32325414-ameera", "userReview": "3/5The reason to make me give this book 3 stars just for Magnus and Alec's , Simon and Isabelle and the rest just was bullshit"}, {"userName": "grace", "userReviewDate": "Aug 12, 2014", "userURL": "http://www.goodreads.com/user/show/32195256-grace", "userReview": "(Re-read) SO MANY FEELINGS"}, {"userName": "Victoria Hansen", "userReviewDate": "Mar 13, 2016", "userURL": "http://www.goodreads.com/user/show/34354125-victoria-hansen", "userReview": "\"I don't care,\" Clary said. \"He'd do it for me. Tell me he wouldn't. If I were missing-\" \"He'd burn the whole world down till he could dig you out of the ashes. I know,\" Alec said.Mortal Instruments: City of Lost Souls is the fifth instalment of the Mortal Instruments franchise, written by Cassandra Clare. It follows the events after City of Fallen Angels, and focuses on finding the missing Jace, who is now working with Sebastian under a spell. The plot is forced and boring, the writing is dull and the romance is an endless war about fighting, passion, heartbreak and jealousy, but the characters remain great and the world is unique with its developing. Ultimately, City of Lost Souls brings epic parts to an otherwise dull book. Clary Fray, student and Shadow Hunter finds herself torn between the love of her life, Jace who has joined the dark Shadow Hunter Sebastian in building an army and her own family as the final battle between good and evil looms in the distance. Clary Fray is only fifteen and a Shadow Hunter, a hunter of the things that go “bump” in the night and are part of the supernatural world that she used to never know existed. Clary has dealt with many horrific events over the last year, her mother being attacked by her father, Valentine and cursed into a deep sleep, her fledgling romance with Jace Wayland, another Shadow Hunter, her best friend Simon turning into a vampire and her killing her father by sacrificing him to the Angel Raziel. However, for once in her life things have begun to quiet down.After fleeing his home due to his mother seeing him as a vampire, Simon returns hoping to revive their relationship. However, when Simon arrives he is shocked to see he cannot enter his home. He calls out to his mother who is cold and heartless, believing him to be an imposter who killed her son. Simon pleads with his mother, trying to convince her that he is the real Simon but she refuses to listen. Unfortunately, before Simon can give one final plea, he receives a call from Clary who is in a complete panic because Jace has gone missing. Worried that Sebastian, a young man who was killed months ago and then resurrected by Simon has taken him, Clary begs Simon to go with her to meet the Seelie Queen (Queen of the Fairies). Simon agrees and they travel to the Seelie Kingdom where she asks the Queen for her assistance in locating Jace. The Queen is hesitant at first, not seeing a reason that she should help humans or Shadow Hunters due to past grievances. Refusing to do the work for nothing, the Queen demands they find two rings that were lost to the kingdom. Clary is apprehensive at first since she knows the Seelie are known to be tricksters and is worried that she will help them only to have the Queen not follow through, but due to her desperation to find Jace she reluctantly agrees. Later that evening, Clary returns to the Institute (Shadow Hunter Training Center) and searches the library with the hopes of finding a book that might point her in the direction of the missing rings. However, while there she spots Jace and Sebastian talking and collecting books from the shelves. Clary is even more alarmed because Jace seems totally at home with Sebastian like they are old friends. She watches them closely as they collect more books and leave in the veil of darkness. That night, Clary tosses and turns unable to sleep. She wakes to find Jace in bed with her and she begs him to tell her what is happening. He informs her he is working with Sebastian and he came back for her because he loves her and wants her to join him. Unfortunately, their intimate moment is cut short by Sebastian who tells them it's time to go. Clary's mother Jocelyn wanders into the room wondering what all the commotion is about and is mortified to find Sebastian in the room. She screams for Clary's stepfather Luke who attacks Sebastian but Sebastian stabs him brutally and leaves him for dead, fleeing with Jace. Jocelyn forbids Clary from seeing Jace any longer, the danger too great, however; Clary has other plans. \"I don't care,\" Clary said. \"He'd do it for me. Tell me he wouldn't. If I were missing-\"\"He'd burn the whole world down till he could dig you out of the ashes. I know,\" Alec said.The next day, Clary is able to locate the Seelie Queen's rings but decides to keep them so she can communicate with Simon while spying on Jace and Sebastian. Clary meets with them and soon discovers Jace is possessed and Sebastian has found a way to control him through runes (magical symbols that have great power). Clary finds a way to temporarily deactivate the rune which allows Jace to come into his right mind for a few moments. He tells Clary that Sebastian is a complete psychopath and plans to use the vampire Lilith's blood (she was killed by Simon a month earlier) to infuse Shadow Hunters and create his own dark force that the world will not be able to stand up against. Jace feels horribly guilty for having assisted Sebastian this much and makes the decision to turn himself into the Shadow Hunter Council (known as the Clave) in an effort to stop Sebastian. He tells Clary he loves her and will always love her but that the Clave will not see the difference between possessed and not and will most likely kill him for helping. Clary refuses to let this happen, her love for Jace too strong for that. She summons Sebastian against Jace's wishes and alerts him that Jace has broken his binding rune. Sebastian thinks Jace is very clever to have gotten away with it but he also admires Clary for turning him in thinking that her loyalties now lie to him and not Jace. Later that night, Clary contacts Simon in an effort to tell him of the sinister plans Sebastian has for the Shadow Hunters. She tells Simon they need assistance and to summon the infamous angel Raziel in an effort to help them. Simon agrees, though he knows Raziel is of the unpredictable sort and it could get sticky. Simon heads to another dimension through a portal and to a lake where Raziel resides. When he summons him, he tells Raziel of Sebastian's plan to create evil Shadow Hunters. Raziel knows of only one blade that could take down the corrupted hunters as well as Sebastian known as the blade Glorious. Simon begs for him to release it to him however it comes at a price. Due to Simon becoming a vampire under extreme circumstances, he was given the ability to kill anyone who tries to harm him. Raziel says to get the blade, a a sacrifice must be made. He removes Simon's mark making him now vulnerable yet Simon rather be at risk and help Clary than not because deep down he is in love with her. Meanwhile, Sebastian unleashes his Shadow Hunters to fight the good one's of the Clave and a battle ensues The fight is brutal and Clary calls upon her friends Alec and Isabelle (also Shadow Hunters) and the sorcerer Magnus Bane to assist in the fight. Jace is able to break his binding rune and a vicious battle breaks out between him and Sebastian. As the fight turns desperate, Simon arrives with the blade Glorious which will kill and set aflame anyone with a dark heart. Simon hands it off to Clary who moves through the fighting searching for Sebastian. As her group begins to overpower them, she watches him flee through a portal and take the remaining dark Shadow Hunters with her. Clary gets an idea and runs to Jace and in a leap of faith stabs him with the sword with the hope that it will cleanse the darkness Sebastian bestowed upon him. Jace is engulfed in the cleansing flame and collapses and is rushed to the Institute to be healed. A few weeks pass, and Clary visits Jace who reveals to her he now has the power to set those with dark hearts on fire. He has now become the cleansing flame of the Glorious in the flesh. Clary worries that this could make him a target by the dark forces at work but Jace assures her he will protect her to the very end. They both know Sebastian will regroup and return, the question is how and when. They recommit their love to one another, knowing that if they stand strong together, they will be able to shine through the darkness as a beacon of light.Another disappoint published in the series, and I have lost hope. However, after having read five out of six books in a series, I’m not going to give up on the last one; I’m curious about the ending, and the outcome. As I stated in my review of City of Fallen Angels, it messes with the great ending of the third book, and delivers an unnecessary continuation. Unlike City of Fallen Angels, Simon’s part in the book has significantly been cut out and had an incredibly boring start, but got got increasingly exciting as the book went on. The last 100 pages of it was action-packed, epic and redeemed certain parts of the book. There was certainly an improvement in the end, and I feel the need to keep going. But the romance ruined half of the book for me. Ms Clare felt the need to ruin every relationship, and not let the couple be happy. Clary is looking for Jace, but once she finds him, she is still unhappy. Eventually, she fucks him as she believes there is still good in him. Other than that, it’s them fighting and Clary whining. Of course, in the end, when Jace returns to his normal self, there is the expected cliché love moments, where both characters continuously keep expressing their love for one another. It’s truly an endless cycle, and a desperate attempt to make the romance seem passionate, interesting and intense. Since the first book, I haven’t felt the chemistry between Jace and Clary, and as I read further, I disliked it. Their relationship gives me a headache, and constantly makes me cringe. Despite the heat in her face, it felt as if cold needles of ice were running up and down her veins. \"What are you doing here?\"He drew back slightly, looking disappointed. \"That isn't really an answer to my question, you know. I was expecting more of a \"Hallelujah Chorus.' I mean, it's not every day your boyfriend comes back from the dead.\"\"I already knew you weren't dead.\" She spoke through numb lips. \"I saw you in the library. With--\"\"Colonel Mustard?\"\"Sebastian.\"Isabelle and Simon is also a confusing and irritating relationship. She wants to know if he feels the same way about her, but doesn’t say anything. Yet, she is angry that he doesn’t say anything, and expects him to do the work. Despite sharing a bed with him and going on countless dates, they are not exclusive yet and she tries to spices up their ‘relationship’ with terrible drama. Ms Clare ensured that every main character had a love interest, and if they didn’t, she would force the relationship. Jordan and Maia have minor parts in the book, but it also includes the popular theme, trouble in paradise, as Maia is confused of her feelings; should she be in love with the man who turned her into a werewolf? Of course, she loves him anyways, and can’t what happened and move on.Lastly, Alec and Magnus is my favorite couple in Mortal Instruments. Alec’s jealousy in the fourth book was understandable, but it kept coming, and repeating itself. At some point, Alec’s insecurity and jealousy leads him to talk to Camille, about taking Magnus’s immortality. In the end, Magnus breaks up with him and he is heartbroken. Why did he have to think about immortality? Their relationship was great before, but the author had to ruin it. Personally, I understand why Magnus broke up with him. The majority of their relationship was Alec asking about Magnus’ past lovers. However, I do love them as a couple, as both characters are the best part of the book (aside from Simon). As most readers agree, they are a lovely couple.\"Does she still love you?\"\"I don't think so,\" Magnus said dryly. \"She wasn't very pleasant the last time I saw her. Of course, that could be because I've got an eighteen year-old boyfriend with a stamina rune and she doesn't.\"Alec sputtered. \"As the person being objectified, I ... object to that description of me.\"The Mortal Instruments is known for ‘borrowing’ from other classics and books. In City of Lost Souls, it’s evident that Ms Clare is trying to write her own story, without borrowed elements. To keep the story going, she distracts the reader from the main plot with the drama romances and other side stories that is hardly relevant to the main plot. Characters are changed, mostly Alec. The selfless eighteen-year-old wants to remove immortality from his boyfriend, and it’s completely unlike him. His intentions were selfish, but was ‘out of love’. Therefore, it’s fine, of course, as love saves everything. Alec’s character development in this book was terrible, and I preferred the younger version of him. Cliffhangers was misused in the entire book. One chapter is extremely long, and in result, it regularly switches between point of views of different characters. To do this, every scene ends with a cliffhanger, and then there’s another character’s scene, which takes up twenty pages, and it ends with the cliffhanger. Finally, it continues from the first scene, but ends it with another. It kept going, and was a shitty method to switch perspectives. I never noticed it before, but it had been used in her books, but it was particular irritating in this book. For example, while Clary was in Sebastian’s room and she was caught, it ends there. Then, it’s another character’s turn to have their perspective, and after at least ten pages, it continues. If an exciting or shocking events occurs, it never continues straight on. It’s almost as if there is adds in between before it continues. The binding magic between Sebastian and Jace was a great twist to the story, despite having been used numerous times before in other fantasy novels. Truthfully, I hadn’t expected Clary to come with them on their journey, but I did enjoy the scenes she had with her brother, Sebastian. The rings Simon and Clary used a great way to communicate, and I hadn’t expected the Seelie Queen plot twist, where it was revealed Sebastian knew everything about their plan. It was completely unexpected for me, and surprised me. I’m terrible at noticing foreshadowing, so despite being obvious for some readers, I didn’t notice it, but I did expect a plot twist. \"Kill me, little sister. Kill me and you kill Jace, too.\"The ending was great, and Sebastian’s agenda for his decisions were well explained. The passionate moment when the sword went through Jace was surprising to read, but it was predictable that he was going to survive. Sebastian forces Shadowhunters to drink from a new Mortal Cup, hence, developing a new demon species. He raises his ‘mother’, Lilith, a strong demon and it ends there, knowing Sebastian will return. The description of appearances is overused, and too much time is spending on describing clothes, facial features and hair. Reminding the reader of the physical appearance of a person is a great idea to refresh their memory, but endlessly thinking about the shade of someone’s eyes or the length of someone’s dress. Sebastian has white hair, and it’s mentioned at least ten times in the book. Jace has gold eyes and gold hair, which was a complete surprise for me. No, I haven’t read the other four books before reading this one. The female characters, Clary in particular, seem to fantasize about their lover at all times. Whenever a character dies in a Mortal Instruments book, they a bought back, living or not. Simon died in City of Ashes, and he was turned into a vampire. In City of Glass, Jace died but was resurrected because of an Angel. Sebastian died in City of Glass, but returned in City of Fallen Angels. Lilith died in City of Fallen Angels, and is resurrected in City of Lost Souls. Jace supposedly dies, but is resurrected again. As much as I dislike having favorable characters die, it adds a great twist to the story, including a new storyline. Ms Clare had only decided to leave Valentine, Hodge and Max dead, but the remainder lives. A great addition of the story would be to kill of one of the Shadowhunter characters, but for real this time. There are some people—people the universe seems to have singled out for special destinies. Special favors and special torments. God knows we're all drawn toward what's beautiful and broken; I have been, but some people cannot be fixed. Or if they can be; its only by love and sacrifice so great that it destroys the giver.Another problem with this book is that Clary, as the main protagonist, is rather unlikable and incredibly self-centered. Everything she does has to do with what she wants, and what she wants is Jace. Unlikable protagonists by themselves aren't necessarily an issue; there are plenty of books featuring unlikable characters. But the issue here is that readers not supposed to see Clary that way. She's stupid and runs into danger without thinking, disregarding what anyone else tells her, but readers meant to think that she's headstrong and fierce. She's also selfish when it comes to Jace. She actually sells him out and betrays him to Sebastian to keep him from turning himself into the Clave, even though doing so would save countless lives. Fortunately, she apologizes later and does in a sense make up for it when she is willing to put a sword through Jace to cut him off from Sebastian. It's still troubling that she goes there in the first place, but, of course, readers meant to see this as an indication of how true her love is for him.Clary's selfishness isn't a new development, either. In City of Glass, Clary is granted one wish when she summons an Angel. What does she wish for? To have Jace back. She tries to justify and rationalize it by saying that maybe it's not right to wish for something like world peace (fair enough), but all I could think was: what about Max, who brutally murdered not all that long ago? The one who, as Isabelle points out to Clary, was not a solider, unlike Jace, but an innocent 9-year-old child? What makes his life more forfeit than Jace's? Oh right, because Clary didn't have a thing for Max. Although Clary might be a frustrating character, the perspectives is expanded, and other characters have been included frequently, such as Alec and Simon. This saved most aspects of the book, as the plots were connected into a huge main plot line, but ultimately, had different minor plots that would eventually mix together. I did think that after the fourth book I might stop reading because it seemed a little bit pointless to me. This book is better than the fourth in that there is really something that happens. I have yet to be convinced that the series should have been continued past the third book. I have a feeling that the reason the series has been continued is because Jace and Clary have yet to have sex. This is really the only logical reason I can come up with for it to be going into a sixth book.In conclusion, City of Lost Souls is slightly better than the fourth book, but certainly lacks in the romance department, which ceases to ruin the dull plot. The outcome and ending was action-packed, epic and Sebastian serves as an interesting villain. Perspective of characters have been expanded, which keeps the plot going, due to the several minor plots in the book. Clary’s character development has taken a turn for the worse, and attempts to act brave and fierce, but is selfish instead. Ultimately, I did like City of Souls, but I still believe Ms Clare should have stopped writing after City of Glass.\"I've got the Mark of Cain,\" said Simon. \"That means nothing can kill me, right?\"\"You can kill yourself,\" Magnus said, somewhat unhelpfully. \"As far as I know, inanimate objects can accidentally kill you. So if you were planning on teaching yourself the lambada on a greased platform over a pit full of knives, I wouldn't.\"\"There goes my Saturday.\""}, {"userName": "Pam", "userReviewDate": "Feb 27, 2015", "userURL": "http://www.goodreads.com/user/show/13865261-pam", "userReview": "4 hallelujah now we're getting somewhere starsNarrated by: Molly C. QuinnJace and Sebastian bound together in an unbreakable cursewill the real Jonathan Christopher Morgenstern please stand up... and Clary is hell bent on saving Jace any way she can ... even if it means playing happy home with Sebastian. City of Lost Souls is the fifth book in the Mortal Instruments series. Where we get to see a different side to each character...While we are heavily invested in Jace and Clary's story, I can't deny the fact that I am equally invested in seeing Izzy & Simon's relationship be determined, Maia & Jordan's heal and Magnus & Alec's tested. City of Lost Souls is by far I think the most sinister of the bunch, for a Young Adult read this is rather twisted, themes pushing the bar for kids to comprehend, but perfect for us adults who love a fantasy world where we can get lost in. I had no clue where it was all headed, but it drew me in, making me want the HEA I crave all the more. I can't wait for the final book, it can only get better from here... finger's crossed my prayers will be answered!"}], "description": "The New York Times bestselling Mortal Instruments continues—and so do the thrills and danger for Jace, Clary, and Simon.What price is too high to pay, even for love? When Jace and Clary meet again, Clary is horrified to discover that the demon Lilith’s magic has bound her beloved Jace together with her evil brother Sebastian, and that Jace has become a servant of evil. The Clave is out to destroy Sebastian, but there is no way to harm one boy without destroying the other. As Alec, Magnus, Simon, and Isabelle wheedle and bargain with Seelies, demons, and the merciless Iron Sisters to try to save Jace, Clary plays a dangerous game of her own. The price of losing is not just her own life, but Jace’s soul. She’s willing to do anything for Jace, but can she still trust him? Or is he truly lost?Love. Blood. Betrayal. Revenge. Darkness threatens to claim the Shadowhunters in the harrowing fifth book of the Mortal Instruments series.", "title": "City of Lost Souls\n      \n          (The Mortal Instruments #5)", "url": "http://www.goodreads.com/book/show/8755776-city-of-lost-souls", "average": 4.3, "cover": "https://images.gr-assets.com/books/1460477703l/8755776.jpg", "reviews": 17532, "authors": [{"url": "https://www.goodreads.com/author/show/150038.Cassandra_Clare", "name": "Cassandra Clare"}], "type": ["Fantasy", "Young Adult", "Fantasy", "Romance", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/8755776-city-of-lost-souls", "http://www.goodreads.com/book/show/17226994-city-of-lost-souls", "http://www.goodreads.com/book/show/25560294-city-of-lost-souls", "http://www.goodreads.com/book/show/17449657-city-of-lost-souls", "http://www.goodreads.com/book/show/15722810-ciudad-de-las-almas-perdidas", "http://www.goodreads.com/book/show/256683.City_of_Bones", "http://www.goodreads.com/book/show/3777732-city-of-glass", "http://www.goodreads.com/book/show/1582996.City_of_Ashes", "http://www.goodreads.com/book/show/7171637-clockwork-angel", "http://www.goodreads.com/book/show/10025305-clockwork-prince", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/25353286-provenance", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}