{"ratings": 86869, "userreviews": [{"userName": "Doug Bradshaw", "userReviewDate": "Jun 14, 2008", "userURL": "http://www.goodreads.com/user/show/808994-doug-bradshaw", "userReview": "I have read some good fiction lately, but this one is special like \"Catcher in the Rye\" or \"The Curious Incident\" or maybe \"The Kite Runner\". Instead of telling the story, I will make observations as to why I loved it: 1. Many historical fiction novels are written from the perspective of the thinking of the time. Although it is interesting to observe how people think people thought in the past, it can be a little too un-modern and sometimes boring, like reading \"Moby Dick\" or some other great, but somewhat over the top book. Here, we are set back in time by the grandson who is just like us, telling the story his grandfather tells him, but with language and interpretations that are how we think about things today. Instead of finding this tool to be unrealistic and too Hollywood modern, I found just the opposite. I felt like I really was back in time and I related to the characters like they were my best friends and buddies. I loved this approach to history telling. 2. The primary relationship in the book is between a shy, 17 year old Jewish boy who is intelligent, clever, educated and a great story teller. There is a running dialogue in his head describing his sometimes ridiculous and unimportant thoughts and observations as life threatening things are occurring. His older buddy is a young \"man of the world\" a college boy who is experienced with women, a writer and philosopher, a handsome and sometimes arrogant guy. He puts his arm around his younger shy friend's shoulder and starts to teach him about wine women and song. It is a touching and fun relationship that works as well as any friendship relationship I've ever read. The observations of the younger as to the older's sometimes graphic and raunchy statements and experiences are absolutely brilliant and spot on. This is how life and relationships really work and the author has been able to convey these experiences in a way that makes us relive similar things in our lives as older kids taught us about what really goes on in the adult world and we're half thinking it's a lie and half believing it, yet shaking our heads. I can't think of a book I've read that does this kind of coming of age relationship as well. 3. Because the story moves fast and is more about relationships and internal observations, you would think that the history of the time is secondary. However, the story gives us a very realistic feeling of how it must have been to be suffering through the invasion of the Germans into Leningrad in the horrible cold of the winter without much good food or shelter or equipment. There is a lot of good information about the cold and calculated way of the Nazis and the underfunded and yet heroic attempts of the Russian people to fend them off. And yet, as important as the historical setting of the book is, the thing that makes it work well is the commentary and thoughts of our two friends and eventually heroes. 4. There are many other great characters in the book from the brilliant and interesting Nazi leader, an intense and talented young female sniper, and the spoiled and wealthy man who sends them on their ridiculously trivial mission in the first place. This book is the reason you read fiction."}, {"userName": "Jeffrey Keeten", "userReviewDate": "Apr 29, 2014", "userURL": "http://www.goodreads.com/user/show/3427339-jeffrey-keeten", "userReview": "”How could you fear anything more than death?Everything else offered moments of escape: a paralyzed man could still read Dickens; a man in the grips of dementia might have flashes of the most absurd beauty.”Lev Beniov wants to live. He may not be clear about anything else, but he knows that to be true. Life becomes more precious when being anywhere, not just in the wrong place, but just existing in space, can turn into a death trap at any moment. When his mother and sister fled the city he decided to stay. Now he is caught up in one of the worst sieges in the history of the world, he is in Leningrad or as I always think of it St. Petersburg. Lev is seventeen years old. \nBecause it is mostly a city of islands, Leningrad was isolated from the rest of the Soviet Union by the Nazis’ control or destruction of its bridges.When I went to Google the siege of Leningrad to brush up on the events that provided the background for this novel I was slightly taken aback when all I had to do was put in SIEGE and BAM there was Leningrad. The Germans made the decision, instead of going street by street and house by house, to just starve the citizens and remaining soldiers out of the city. They put a ring of soldiers around the perimeter of the city so that no one can come in and no one can come out. The staggering results are the deaths of two million Russian soldiers and civilians. ”I was built for deprivation.”We’ve all maybe been a bit hungry, but many of us cocooned in a civilized world where food is plentiful and relatively cheap may not remember the last time we had a hunger pain. Lev and the remaining people of Leningrad have went beyond hungry to near starvation. People are dying daily because now there is no cushion of calories between them and dying. One day without some type of food intake will be...the final day. It is almost like a gift from God, if Lev believed in such a person, to see the German paratrooper, frozen to death, drift down from the sky. Lev and his friends pounce on the body ransacking pockets finding food, a nice Damascus blade, and a flask of cognac or maybe schnapps how could they know the difference? But it spreads a warmth through their bodies like a hot meal or a roaring fire. They take too long, a crucial loss of focus. Maybe it is the bonanza of food and booze that makes them forget for a moment that they are vulnerable out in the open. The soldiers are on them quickly and there is a mad scramble for safety. Lev is caught. He is shocked they didn’t execute him for looting immediately. He has seen it happen before. He is thrown into a cell and there he meets Kolya who is also in dire trouble. He is charged with desertion and they didn’t execute him either. This isn’t a time for trials or due process. Shooting someone is just one less mouth to feed. The rules are maddeningly unpredictable. It is always best to assume the worst. Now Kolya didn’t desert because he was afraid or because he was homesick. He deserted because he was horny. He is a tall, good looking guy who is used to having a steady diet of sexual encounters. With most of the city too calorie deprived to even think about anything as strenuous as sex, it is still his number one concern. His number two concern is; in fact, number two. He hasn’t taken a crap in eleven days. ”The loneliest sound in the world is other people making love.”As Lev soon finds out.The reason they are still alive is there is a Colonel who needs a dozen eggs. He is throwing a wedding feast for his daughter and they need eggs to bake her wedding cake. Kolya and Lev seem like improbable candidates to pull off such an impossible mission. They are dead men walking though and the Colonel has offered a pardon if they can bring him back the eggs he needs. Need, such an interesting concept when for most of the city twelve eggs represent twelve days with a meal. The boys get to see the Colonel’s daughter ice skating on the river. ”It took me a few seconds to realize why she looked so strange, and then it was obvious--even at a distance you could tell that the girl was well fed. There was nothing pinched and desperate about her face. She had an athlete’s casual grace, her pirouettes were tight and fast; she never got winded. Her thighs must have been magnificent--long, pale, and strong--and I could feel my prick hardening for the first time in days.”\nRain down on me ladies! Peter Paul van Rubens, detail from 'The Disembarkation at Marseille' .Lev hasn’t seen a woman in a long time that he didn’t have to mentally add weight to her figure and her face to determine if she used to be pretty. ”I finally fell asleep and dreamed of a sky raining fat girls.”Their task takes them behind enemy lines where they meet pretty Russian girls kept for the amusement of the Germans, cannibals who have learned that the buttocks make the best steaks, and a female sniper named Vika who Lev falls head over heels in lust with. ”I was raised to be clean and it bothered me when others were not… But Vika’s wet dog smell did not offend me. All of us were slathered in grime by that point, of course--I must have stunk like week-old fish myself--but this wasn’t about being inured to foul odors. The tang off her body made me want to lick her clean.”It is such a burden to be virginal. *sigh* I’ve lost track of how many days it has been since Kolya took a crap. It is somewhere around twenty days. He has decided that his bowels are waiting for the end of the siege (the siege ended up lasting 872 days). He is looking forward to feeling the relief of a VICTORY CRAP.Despite the stark circumstances that provide the backdrop for this novel there are many moments of unexpected humor that lend brevity to the growing frustrations and dangers in trying to achieve their mission. Watching the evolution of the friendship between two very different young men, a Cossack and a Jew, is not only heartwarming, but memorable. Lev’s father, a relatively famous poet, who was disappeared by the NKVD looms over the story as ghostly as Hamlet’s father. Lev has the soul of a poet, but lacks the gift to express it. Kolya is working steadily each evening, when he hasn’t found some woman willing to help him with his continually heated loins, on his novel title The Courtyard Hound. I have feeling his writing is spicy. It all comes down to a game of chess, but then isn’t all of life a game of chess? We make sacrifices, pawns, rooks, and bishops, and hope the results prove worthy of what we have given up. The longer these two young men are together we can see their minds expanding exponentially just because one is with the other. If you wish to see more of my most recent book and movie reviews, visit http://www.jeffreykeeten.comI also have a Facebook blogger page at:https://www.facebook.com/JeffreyKeeten"}, {"userName": "Stephen", "userReviewDate": "Jun 26, 2011", "userURL": "http://www.goodreads.com/user/show/1413439-stephen", "userReview": "in the aftermath of my tryst with this beautiful, intelligent novel, I was hobbled by lancinating pain stemming from a burning, itching question repeatedly sounding off in my head…why didn’t I love this book MORE? Why? I love historical fiction, especially tales set in WW the Sequel, and Benioff’s crisp, effortless prose is smart and pleasurable without ever become overly clever or self-indulgent. The plot device of surreal \"forced\" shopping expedition to track down a dozen eggs against the backdrop of the horrific Siege of St. Petersburg was a wonderful vehicle to spotlight the everyday struggles of life during the longest and most destructive siege in the history of modern warfare.All signs point to a love connection. So…again…why wasn't I smitten? The only diagnosis I arrived at to explain my muted affection for this novel was that it was too detached an experience. The story, while giftedly told, never truly pulled me within its sphere of influence. The events encountered by the plot’s main characters, Lev and Kolya, despite being well-described and at times harrowing, never completely captured me. This lack of involuntary engagement in the story left my enjoyment dulled  and pretty much doomed me. I think being actively vested in the characters and being held captive by the sense of place created by Benioff is vital to a genuine enjoyment of this story. For me, sadly, it more like seeing photos and video of someone else’s exciting vacation rather than experiencing it myself. Still, there were flashes of engagement for me that left me breathless and cemented the fact that I would at least \"like\" this story: ** The scene with the cannibals had me duct-taped to my seat. Benioff’s talent during this portion was writ large on the marquee as he handled this potentially cartoonish scene so deftly that you just knew he was writing truth.\n I haven’t personally researched the level of cannibalism that occurred during the 900 day Siege, but Benioff’s depiction of it felt absolutely authentic.   ** The mine-strapped anti-tank dogs lying dead in the snow and the sole survivor found bleeding by the characters was very powerful and I felt ache. To be able to evoke such emotion for an animal in the midst of the almost unimaginable suffering taking place all around them was a further display of superb craftsmanship on the author’s part. ** The description of the casual, sadistic atrocity perpetrated by the German einsatzkommandos against a Russian peasant girl for trying to escape forced prostitution is seared on my memory. Most noteworthy is that Benioff handled it without any melodrama and this understated, “just the facts ma’am,” recounting made it all the more chilling. ** The Chess game. I loved it. I’m not going to spoil anything, but I thought this scene was handled wonderfully when it could have derailed easily into Hollywoodness. It didn't and so more another cap tip to the author.    In addition to the above, I enjoyed the way Benioff blurred the lines between reality and fiction by using the story-within-a-story framing device. The novel is told as the embellished memoir of Benioff’s own grandfather detailing  his experience during the siege. This adds a real sense of authenticity…however it was also part and parcel of its downfall for me as it added another layer between me and the events of the story. This further heightened my lack of connection to it. In the end, I think this is a skilled work by an excellent story-teller with real talent for writing. The story just never quite clicked for me and I found myself hopelessly undevoted to it. I wish that wasn’t the case, but it was. Thus, the best I can do is 3.0 stars and to point to all the kudos above so that you will understand why I am still recommending that you give it a shot. There is much to like here and hopefully you have a more engrossing experience."}, {"userName": "Jen", "userReviewDate": "Jul 29, 2014", "userURL": "http://www.goodreads.com/user/show/27709782-jen", "userReview": "This is what happens during war: people will do anything to survive -from murder to stealing, to going on exhaustive food hunts. Absurdly as it sounds, this becomes the cultural norm.It's the Soviet Union 1942. Tension is thick with famine and war. The Germans are beginning their invasion. Two soviet thieves, Lev and Kolya are captured and thrown into the same cell. However, instead of death, they are given a 4 day reprieve with a mission to find a dozen eggs for a wedding cake for a colonel's daughter. This is their mission and the wild egg hunt they go on. Trudging through a landscape of death, evading nazis and cannibals, fighting their own fatigue and exhaustion, an unusual friendship begins. Well drawn out human characters: Lev, Jewish -shy and withdrawn; paralleling that of Kolya, a mild mannered fellow providing humour on this bleak trek.From calculated neglect to constipation -this a story rich in all elements of character development. Writing so palatable and simplistic yet rich in texture, it was a pleasure to read. 5★Thank you to my GR friends who pointed this one out as a must read."}, {"userName": "Maciek", "userReviewDate": "Nov 05, 2012", "userURL": "http://www.goodreads.com/user/show/2969647-maciek", "userReview": "[image error]"}, {"userName": "Ken", "userReviewDate": "Feb 10, 2010", "userURL": "http://www.goodreads.com/user/show/730754-ken", "userReview": "You know how annoying it is when a book’s ending is so unrealistic that you say to yourself in disgust, “This would never play out like this in real life!”? It’s happened more than once, right? But a funny thing sometimes happens on the way to the forum. Sometimes your peevishness gets assassinated. Sometimes you’re so damned entertained by a book that you act like a sailor on leave and say, “Ah, what the hell!” Sometimes you’re so amused by the characters that you see that suspension bridge of disbelief and you cross it -- cheerfully, yet.This is the case with David Benioff’s oddly mesmerizing historical foray, CITY OF THIEVES. The quixotic quest book offers a little something for everyone. Russophiles and history buffs will love it because it’s set in Leningrad during the siege, and the author has done his homework, making the setting and background events accurate. Coming-of-age fans will like it because the protagonist, a tough but runty Russian Jew who is only 17, will worm his way into the apple core of your heart. Humor enthusiasts will take to it because it is rich with witty badinage, much of it thanks to Kolya, the Red Army sidekick whose libido leads him AWOL and into deep doo-doo with the Russian military.Together, Lev and Kolya are spared death (one for breaking curfew, the other for looking for love when he should have been on guard with his unit) if they can bring back a certain colonel one dozen eggs. Why? The colonel’s daughter is getting married at the end of the week and needs a huge wedding cake in a city that is about as eggless as a grunting rooster. Ridiculous? Sure. Fun? Indubitably. But the sights our heroes come across during their journey are anything but laughable and, at times, downright gruesome.War is hell, yes, but it also offers ironies in spades. Ante up, then, because Benioff is dealing. You might consider Kolya a tad over-the-top, and you might agree with me that the showdown with the Germans toward the end “stretches things a bit,” but what the hell – if you’re charmed, you’re in a good mood; and if you’re in a good mood, you tend to let certain things go. Thus, the suspension of disbelief. Thus, the four stars. Thus, the hearty recommendation, reservations notwithstanding. This one’s a page-turner. This one I think you'll like."}, {"userName": "Jeff ", "userReviewDate": "Jun 16, 2014", "userURL": "http://www.goodreads.com/user/show/12618229-jeff", "userReview": "It’s all about the quest.When I read books, I like to do a little research about the author, time period, the book itself, etc. I was interested to learn that the creator of the video game, The Last of Us, drew inspiration, in part, from this book.The Last of Us is a game my son keeps begging me to play. It takes place in the near future, has nothing to do with World War II era Leningrad, and from what I’ve watched bears no resemblance to the book.It’s all about the quest.In the book, the quest is to obtain a dozen eggs for a NKVD Colonel, so his daughter can have a wedding cake. Leningrad is under siege by the Nazis and people are eating the paste from library books, so finding eggs will take some doing. In the games, you generally have an end point too, but you can get sidetracked by doing multiple side quests. Examples:“Mister, can you rescue my puppy. He’s in a den of necromancers.”“I lost my sword in a cave about 50 years ago. It would bring a tear to this old soldier, if you could recover it for me. Oh, and it’s guarded by 100 zombies. They’re fast. And they wield weapons. And they use magic. Did I mention there is really powerful zombie when you get to the final room? I’d do it myself but …I’m old. Thanks again. Zeus, bless you!”“There’s a den of mutant drug fiends about a mile outside of town. If you kill them all, I’ll give you a bottle of water, five bottle caps and the whole town will “like” you.”You do have options. You could say no, punch the asker in the face, or simply walk away with their pathetic pleas ringing in your ears.There’s no straight line from point A to point B in the book either. It’s never that simple. Fortunately, Lev, our intrepid hero, doesn’t have to find the eggs by himself. Kolya, one of the more interesting characters, I’ve come across in a while, is in on this errand with him. Kolya is the guy that’s handsome, funny, charming, and good with his fists and can talk his way into and out of any situation. More or less the perfect companion.In most of the better games you have companions that you can choose from, usually one at a time. Companions range from drunks, mages, guys who can transform into werewolves, 7 foot-300 pound mutants who are off their meds, smoking hot vampire warriors, automated trolls and talking dogs. The latter is not as cool as it sounds, he won’t stop talking/barking if you’re trying to sneak up on enemies. The book doesn’t lack for humor, pathos, adventure and excellent characterization. It’s a timeless tale of summoning one’s inner resources and facing down doubt and fear in the most trying of situations. But in the end, it’s all about the quest."}, {"userName": "Phrynne", "userReviewDate": "Apr 15, 2017", "userURL": "http://www.goodreads.com/user/show/8655084-phrynne", "userReview": "What a wonderful book and why have I not read it before? It reminded me of The Boy in the Striped Pajamas both for its remarkable story and the quality of the writing. The book is written as a retelling by the author of his Grandfather's early life, more specifically \"one week in 1942, the first week of the year, the week he met my grandmother, made his best friend and killed two Germans.\" During that week the Grandfather, Lev, was just 17 years old and living in Leningrad which was enduring the Nazi siege of 1942. Various events cause him to meet up with Kolya, a Russian deserter who is only a few years older in years but much more in experience. Together they set out on a ridiculous quest and witness many of the awful atrocities that occurred during that war.The characters of Lev and Kolya are what makes this book. Kolya is by turns funny and infuriating but is always lovable. Their dialogue is frequently hilarious which prevents the story from becoming overwhelmingly sad and horrifying. The history was amazing - how those poor people survived starvation during the siege! I had not come across \"library candy\" before. The will to live brings about some incredible invention.A sad, sad ending with a sweet epilogue. I have another favourite book:)"}, {"userName": "Kemper", "userReviewDate": "May 24, 2009", "userURL": "http://www.goodreads.com/user/show/405390-kemper", "userReview": "A terrific book that proves you don't have to write 700 or 800 pages to have real depth. I'm fascinated by how Benioff managed to describe the characters enduring terrible hardship and the worst of one of the most brutal battles in history, but the book doesn't read as grim or overly depressing. That's not to say that there isn't real drama, horror and sadness, but the natural humor of characters keep it from being just another book about the horrors of war."}, {"userName": "J. Kent Messum", "userReviewDate": "Aug 16, 2013", "userURL": "http://www.goodreads.com/user/show/23165988-j-kent-messum", "userReview": "'City Of Thieves' is a rare book, one that fires on all cylinders and almost never missteps. It's a modern textbook example of how to write a great story. Stories often have their strengths and their weaknesses when all is said and done. They can rely more on character than plot, or vice versa. A story might be strong, but pacing is a problem. Dialogue might come off unrealistic, although narrative hits the mark. In short, most books are a balancing act. There are things done right, and things that could have been better. Benioff's third offering is balanced well beyond the average book. There are no pros and cons, no strengths to rely on. The entire work is solid from beginning to end. This is a damn-near perfect novel and Benioff is a damn-near perfect storyteller. That’s pretty much all you need to know. Set in Leningrad during WWII, 'City Of Thieves' is a hard look at the best and worst of humanity, often hilarious and harrowing at the same time. To say any more would be to give it away, but City Of Thieves should be required reading for every fan of fiction. Darkness and light entwine in these pages, opening your eyes and affecting your heart. And although it's fiction, it is based on historical fact. Just knowing this type of tale occurred in the real world is enough wind you. You'll laugh, you'll gasp, you might even cry. This is one book that will play on your mind long after you've put it down. I couldn’t recommend it enough.*This book was one of my '10 Books That Stuck With Me' piece. See what other books stuck with me... http://jkentmessum.com/2014/03/19/10-..."}, {"userName": "Eve", "userReviewDate": "Nov 25, 2014", "userURL": "http://www.goodreads.com/user/show/1283951-eve", "userReview": "\"There is a place beyond hunger, beyond fatigue, where time no longer seems to move and the body’s misery no longer seems fully your own.\"\n\nCity of Thieves\n was an amazing book! If I wasn't juggling so many other books, I would have easily finished it in a day or two. The World Wars are definite areas of interest for me, but I am always fascinated by the differing perspectives and experiences of individuals depending what country they lived in. This book explores the 900-day Siege of Leningrad from the eyes of Lev, a seventeen-year-old Jewish boy living on his own soon after his family flees the city. Like all great journeys, Lev is sent on a strange, if not comical, mission that throws him into the company of Kolya, a young private in the Red Army. As they head past the German line on their quest, they encounter many of the horrors associated with war: death, suffering, hunger, depravity. Chock full of suspense, adventure, comedy, sadness, and irony, I loved Benioff's style of writing. He contrasted the seriousness of Lev's personality, and the cocky humorous one of Kolya's, to capture the \"Russian experience\"–a history of tragedy and sadness told with sardonic wit. Easily one of my favorite reads this year; I highly recommend it! Books like these really bring history to life.P.S. This would make an amazing (and probably R-rated) film. Why hasn't anyone jumped on this? I kept picturing Dustin Hoffman as Lev (circa Little Big Man). We need to get this into the Cohen brothers' hands."}, {"userName": "Debra", "userReviewDate": "Dec 01, 2017", "userURL": "http://www.goodreads.com/user/show/5032725-debra", "userReview": "Bring back some eggs he said. My daughter needs them for her wedding cake he says....Sounds simple, right? Except this is wartime and eggs are nowhere to be found. The Nazis have invaded Leningrad and Lev Beniov has been arrested and thrown in a cell with a slightly older and more experienced deserter named Kolya. The men are tasked with finding eggs for a powerful Soviet colonel instead of facing the firing squad.Thus, begins Lev and Kolya's journey through the rough and extremely dangerous streets of Leningrad. There they find starving people willing to do the unimaginable to survive. They find danger, friendship, lust, fear, pain and hope. This book is raw and powerful in that it does not hold any punches when showing the hardships of war. People are willing to go to extremes to survive and prove that they are stronger than they look and braver than they think.See more of my reviews at www.openbookpost.com"}, {"userName": "Diane", "userReviewDate": "Dec 29, 2012", "userURL": "http://www.goodreads.com/user/show/279256-diane", "userReview": "It's a World War II caper, everybody!I highly enjoyed this novel set during the Siege of Leningrad, even though I had just been complaining to my book club friends that I was sick of reading books set during WWII. I thought I had hit my limit of Nazi-related stories, but I was happy to be proven wrong.Many of my GR friends have already read this book, but for those who haven't, I will keep this review free from spoilers. The short summary is we meet a young man named Lev, who is starving in Leningrad but wants to help defend the city against the Germans. One night, Lev gets arrested (long story) and is thrown in prison, where he meets Kolya, a Russian soldier who was arrested for desertion (another long story). Lev and Kolya are given an unusual task by a Soviet colonel: They will be released if they can find a dozen eggs. The colonel's wife wants the eggs to make a cake.How hard can it be to find eggs, you ask? Well, if you're trying to find them when your city has been blockaded and under siege for months, when people are starving and eating bread made of sawdust and \"candy\" made from the glue of books, it can be damn near impossible. This quest for eggs sets the story in motion, and it is fantastic. I couldn't put this novel down! There are just so many things I liked about this book. I liked that the writer, David Benioff, wrote an introduction that made it seem as if the story had really happened to his grandfather. I liked that Lev and Kolya slowly learn to trust each other and become friends. I liked that Kolya was obsessed with Russian literature, and loved to quote from a novel that Lev had never heard of (another long story). I liked how Lev grew up during the story, and how his love of chess helped them in their journey. I liked how rich the writing was, and how reading this book made me feel the coldness and the hunger and the fear of the siege. It's just an incredible story. I highly recommend this novel.Favorite Quotes:\"As siege-hardened as I believed I was before my arrest, the truth was that I had no more courage in January than I had in June — contrary to popular belief, the experience of terror does not make you braver. Perhaps, though, it is easier to hide your fear when you're afraid all the time.\"\"I've always envied people who sleep easily. Their brains must be cleaner, the floorboards of the skull well swept, all the little monsters closed up in a steamer trunk at the foot of the bed. I was born an insomniac and that's the way I'll die, wasting thousands of hours along the way longing for unconsciousness, longing for a rubber mallet to crack me in the head, not so hard, not hard enough to do any damage, just a good whack to put me down for the night.\""}, {"userName": "LeAnne", "userReviewDate": "Feb 21, 2012", "userURL": "http://www.goodreads.com/user/show/7862560-leanne", "userReview": "Omg. May, 2018 This got nominated AGAIN for one of my book clubs, so yes, I did the audio for the fourth total time through this. If you know anybody who hasn't read this, buy it for them.---------------------------------------------When you’ve read a book THREE times, that’s a pretty decent barometer of one’s love level! Im founding a 2nd book club as of next month & wanted to kick it off with an easy read that includes laughter amidst fear, historical curiosities you've never heard of, and deep friendship. City of Thieves hits all those marks and more. It is not Faulkner or Conrad or Joyce, but it is one of my favorite books ever. It also has the single best ending sentence of just about anything Ive ever read. The tale reminds me a bit of \"Lonesome Dove\" if one can imagine old Gus being a charming 20 year old Red Army soldier named Kolya. Yes, maybe that's an odd comparison, but aside from a lot of profanity and some scatological humor (he is a 20 year old soldier - the language fits him), I cannot think of anyone who wouldn't love this character and the others. A tiny, red-headed sniper, the scrawny chess player with his gigantic nose, and even Darling, the dinner companion will stay with you for a long time. All the bizarre horrors and atrocities in Benioff's book are well documented factually, and I actually read two of the author's reference pieces after my first time through the book. Darkly fascinating. Five stars for the story and its historical accuracy."}, {"userName": "Trudi", "userReviewDate": "Nov 25, 2012", "userURL": "http://www.goodreads.com/user/show/1416912-trudi", "userReview": "[WHY DO AUTHORS LOVE TO MAKE YOU FALL IN LOVE WITH CHARACTERS JUST SO THEY CAN KILL THEM?! Argghhhh! So angry and heartbroken. I should have seen Kolya's death coming a mile away. He was just too full of life and love to survive to the end of the book. I guess Benioff could not resist breaking our reader hearts. Damn you Benioff!!! ::sob::  (hide spoiler)]"}, {"userName": "Matthew Quann", "userReviewDate": "May 02, 2018", "userURL": "http://www.goodreads.com/user/show/22699228-matthew-quann", "userReview": "I regret not reading David Benioff's superb City of Thieves at an earlier date. I'm hot and cold with WWII stories, which accounts for some of my reluctance in getting this one started. Luckily, my steadfast, book-recommending friend, Josh Bragg, prompted me to pick it off my shelf and give it a read. It is both the most entertaining WWII story I've read in recent years, and the most emotionally hard-hitting. Benioff is able to bring to life his grandfather's story with enough playful fudging of the facts (as per his grandfather's request) that it blurs the line between fiction and nonfiction, but reads most like a stunning novel.City of Thieves introduces the reader to 17 year-old narrator Lev Beniov, a jewish man living in Leningrad during the Nazi siege. Lev is timid, golden-hearted, and on a quest to find his first sexual experience amidst freezing temps and famine. When Lev is arrested for looting the corpse of a Nazi paratrooper, he is sent on a mission with 20 year-old Kolya to retrieve a dozen eggs for the wedding cake of a colonel's daughter. The seemingly silly premise encapsulates the charm of the novel: it mixes the life and death stakes of the war with the absurd and hilarious. The novel's beating heart is its two leads and their relationship. Kolya's boisterous, crude, and relentlessly upbeat attitude provides the perfect foil to Lev's hesitant, unsure teenage lead. I was often put in stitches by Kolya's off-colour remarks and quips, and Benioff is able to turn a scene from despair to delight with remarkable skill. This ability to go from the harsh realities of war to pure black comedy kept me hooked on this book page after page, and dealt with many of my complaints about WWII stories without every losing their edge. The book also deftly manages to contrast the friends' locker-room talk with a strong, emotionally resonant, male relationship.Benioff's writing also surprised me. This book sat on my shelf and I referred to it as \"the one by the guy who's the show-runner for Game of Thrones.\" Unfortunately, this generalization does Benioff a great disservice as he realizes his vision and characters with readable, strong prose, and superb dialogue. There are many books in which characters are hungry, cold, happy, or sad, but it is rare the book in which those emotions are felt by the reader. Benioff had me feeling to bone-chill of Russia in winter, the elation of the leads, the hunger of its protagonists, and the tragedy of of war. I love Game of Thrones, but Benioff would do well to return to the publishing world for a few more books!This book snuck up on me. It's a charming, enthralling, hilarious, and heartfelt read. I tried to space out my readings to savour Benioff's prose or to spend a bit more time with the characters. The ending manages to be both heart wrenching and uplifting, and stuck the landing far better than I had imagined it would. Again, thanks to Josh Bragg for this recommendation and I hope it soon finds its way into many of your hands!"}, {"userName": "Jeannie", "userReviewDate": "Mar 03, 2013", "userURL": "http://www.goodreads.com/user/show/18024484-jeannie", "userReview": "This book made me laugh, it made me cry, it made me feel. It is a book about friendship during the worst of times. It is my favorite book so far this year. The writing is fabulous!\"Firelight shone through the mullioned windows, warm and buttery, spilling onto the snow in front of the house. Black smoke plumed from the chimney, barely visible as a curling smudge against the dark blue sky. It looked like the most inviting house ever built, the country residence of the emperor's favorite general, heated and well stocked for Christmas with everyone's favorite smoked meats and pastries.\"I highly recommend this book!"}, {"userName": "Giò", "userReviewDate": "Mar 12, 2018", "userURL": "http://www.goodreads.com/user/show/4613789-gi", "userReview": "Sono molto felice di aver letto questo libro e sono grata a tutti coloro che hanno scritto commenti che mi hanno convinta a leggerlo (Grazia, Nood-Lesse, Gattalucy, Marika, Ubik...).È un racconto semplice, drammatico e ironico, tenero e crudele. Un racconto di amicizia e di formazione con protagonisti formidabili che è impossibile non amare e con i quali è impossibile non identificarsi. Non ti devi far influenzare dal fatto che a scriverlo sia stato uno che “vive a Los Angeles e scrive sceneggiature sui supereroi mutanti.” Benioff ha il raro dono di saper raccontare alla vecchia maniera, in modo semplice e poco cerebrale. E tu sei lì come fossi ad ascoltare i racconti di guerra del tuo vecchio nonno. In ogni attimo vissuto da Lev e Kolja, in ogni paura, in ogni piccola gioia, in ogni dolore, in ogni passo nella neve, in ogni sibilo di pallottola o raffica di mitraglia, in ogni incontro, in ogni risata, in ogni sguardo verso il cielo buio anche se pieno di stelle, in ogni odore, in ogni emozione sei lì con loro a vivere tutto sulla tua pelle. Leggetelo, è bellissimo."}, {"userName": "Chris Horsefield", "userReviewDate": "Jul 11, 2017", "userURL": "http://www.goodreads.com/user/show/14058695-chris-horsefield", "userReview": "As a storyteller, Benioff's got the complete package: mastery of setting, pacing, plotting, psychology, and especially dialogue. Here, inspired by his Russian grandfather's murky experiences during the siege of Leningrad during World War II, he creates a captivating story of adventure, hope, survival, and humor in a tautly effective short novel.The brutal siege setting is quickly established in the opening chapter, and when the corpse of a German pilot lands near his apartment, teenage Lev Beniov and his friends quickly rush out to scavenge whatever food they can from the body. By the end of the chapter he's been caught as a \"looter,\" and thrown in the notorious Crosses prison, where his cellmate is Kolya, a talkative and jovial army deserter only a few years his senior. Expecting to be executed the next day, they are given an unexpected reprieve by an NKVD officer, who sends them on an absurdist quest for a dozen eggs.This takes them across the city, where they encounter people even more desperate than themselves, and rather more dangerous. Eventually, it takes them out of the city into the German-occupied countryside, where they get embroiled with a band of partisans intent on killing the commander of an Einsatzgruppen. As the duo wanders through the scary and slightly surreal winter landscape, they form a classic odd-couple bond. Lev is the uptight, awkward straight man to Kolya's charismatic, charming rogue."}, {"userName": "Buggy", "userReviewDate": "Dec 22, 2010", "userURL": "http://www.goodreads.com/user/show/3099666-buggy", "userReview": "Opening Line:\"My grandfather, the knife fighter, killed two Germans before he was eighteen.\"I came away from this feeling, very cold, very hungry and with an inexplicable need to make sure my pantry was full. CITY OF THIEVES is a fantastic story; set in 1942 during the Nazis’ brutal siege of Leningrad. It’s a coming of age story filled with adventure, suspense, friendship, romance and tragedy all washed down with (from what I understand) a historically accurate picture of Leningrad during the blockade.I should point out that despite the events of the time this is also a surprisingly funny read as our two main characters; Kolya the romantic optimist and Lev with his random internal observations both have an interesting way of looking at life around them during the absurdities of war. The story begins with a powerful opening chapter; a writer asks his grandfather to tell him about his experiences during the war. All the narrator knows -and he doesn’t remember anyone telling him its just one of those family folklores that he always has- is that his grandfather, \"the knife fighter\" killed two Germans before he was eighteen and is missing a finger. And so Lev begins to tell his story to his grandson. Talking openly for the first time about his childhood, coming to America and sex. Mostly though he talks about a two week period in 1942 when he met his best friend, the woman that would become his wife and killed two Germans. I actually referred back to this chapter several times during the course of the book and again when I finished. Its January 1942 Leningrad is under marshal law, surrounded by the German army and what’s left of its inhabitants are starving. Our hero 17 year old Lev Beniov has just been arrested for looting and placed in a cell with a handsome friendly deserter named Kolya Vlasov. Both of their crimes are grounds for execution and as our heroes get to know each other that’s what they expect come morning. However in a twist of fate they are given a chance to save their own lives, a secret mission for a powerful soviet colonel, all they have to do is find a dozen eggs for his daughter’s wedding cake. A dozen eggs in a city cut off from supplies, a city resorting to cannibalism and eating glue from book spines to survive. It is of course a ludicrous and impossible task one which takes our new friends far into German occupied territory, through the bitter cold of winter and countless adventures and atrocities. The outcome didn’t really surprise me but I haven't stopped thinking about it either. “One moment I thought I had a few minutes left to live; the next a sniper was flirting with me. Was she flirting with me? The days had become a confusion of catastrophes; what seemed impossible in the afternoon was blunt fact by the evening. German corpses fell from the sky; cannibals sold sausage links made from ground human in the Haymarket; apartments blocs collapsed to the ground; dogs became bombs; frozen soldiers became sign posts. I had no food in my belly, no fat on my bones and no energy to reflect on this parade of atrocities. I just kept moving, hoping to find another half slice of bread for myself and a dozen eggs for the colonel’s daughter.”"}, {"userName": "Kaylin (The Re-Read Queen)", "userReviewDate": "Jan 31, 2017", "userURL": "http://www.goodreads.com/user/show/47627265-kaylin-the-re-read-queen", "userReview": "3 Stars Overview: \n“Truth might be stranger than fiction, but it needs a better editor. ”\nInspired by David Benioff's grandfather, this story takes place during the Leningrad Blockade, which occurred from 1941 to 1944 and resulted in up to 4,500,000 deaths. In the midst of this, Lev is a Jewish 17-year-old who is arrested for looting a German corpse. The Soviet police pair him with Koyla, a deserter with artistic ambitions and gives them a mission: Find 12 eggs in the desolate, war-torn city. Prior to writing this book, Benioff worked on screenplays for X-Men films, and in a weird way, I think it shows. Comics and Comic-based movies often rely on a dark or sarcastic humor despite the intense story-lines. This novel was absolutely peppered with crude humor as Lev and Koyla became friends, but it was detracting to the story at times. Pros:All of the characters are very strong and dynamic, and I enjoyed the way they all contrast with each other. Lev is more reserved, while Koyla is vibrant and poetic. They both have dreams and ambitions that extend beyond the reach of their destroyed town. Every character they came in contact with seemed to have their own realistic ambitions and goals, even if only present for a chapter or two. Lev and Koyla frequently discuss sex or make sex jokes, and while it was off-putting at first, by the end of the book it became clear these jokes served as a way for them to disengage from the horrors around them. This seemed realistic and clever storytelling, even if I did not enjoy it all the time. This was not a subdued view of the War. It was dark, gritty and painful. Some of the images the story built were absolutely haunting.Cons:In some ways, I really wish I could rank this higher. It had so many strong elements and I do believe Benioff is a talented writer. However, I think because of this dark humor I was actually pulled  out of the story. This was filled with very intense subject matter, but all the joking seemed to keep me from ever feeling anything about it. The characters were well written, but everything was so detached I didn’t ever have the emotional connection I wanted to have. The ending seemed almost… predictable? If that makes sense. That’s a weird criticism for something based on a true story, but it just seemed almost an easy way to end things. And perhaps a little hokey. Really made me wonder which parts of the story Benioff embellished, as he admits in the beginning. In Conclusion: Very intense subject matter hidden by crude humor, friendship and a somewhat zany plot. Still paints a very haunting picture of WWII era Leningrad."}, {"userName": "Nood-Lesse", "userReviewDate": "Jan 19, 2018", "userURL": "http://www.goodreads.com/user/show/10729786-nood-lesse", "userReview": "«Questo, amico mio, è il segreto per vivere una lunga vita»Durante un incontro per la presentazione di uno dei suoi libri, chiesi a Fabio Genovesi ciò che ho domandato a tutti gli scrittori con i quali sono venuto in contatto: “Quale libro consiglieresti di leggere?” Mi rendo conto che è una domanda scontata e che c’è il rischio che lo scrittore, per dar mostra di non esserlo altrettanto, tiri fuori titoli snob e sperimentali. In passato mi è successo, ma mi è successo anche di scoprire libri come la Versione di Barney.Da scrittore e da lettore, quale libro consiglieresti di leggere?-La città dei ladri di David Benioff, questa fu la sua risposta.Presi un appunto sul Kindle, detti un’occhiata su anobii il giorno dopo. Non ero convinto, decisi di lasciar perdere. Quattro mesi più tardi, un amico si presenta con un pacchetto ed un biglietto: è BELLO e te lo STRA-consiglio...Sì, avete capito, dentro l’incarto Amazon, c’era proprio La città dei ladriLe raccontai della figlia del colonnello che pattinava sulla Neva; dei cannibali con i loro macabri tagli appesi ai ganci; del ragazzino moribondo, Vadim, e del suo gallo, Ciccina; del cane anticarro che stava morendo dissanguato nella neve e del soldato russo assiderato che indicava Mosca. Quando finii la storia, Vika scrollò la testa ma non disse niente. Forse le avevo raccontato troppo.E io racconto a voi che al libro ho dato cinque stelle e che se qualcuno mi avesse fatto leggere questo stralcio, probabilmente avrei rinunciato a metterlo in lettura.Ho due raccomandazioni: prima di leggere informatevi sul costo attuale di una dozzina d’uova, mentre state leggendo non andate a cercare in rete notizie in merito al romanzo Il Segugio in cortile di Ushakovo, aspettate di aver terminato i capitoli.Nei ringraziamenti finali, David Benioff dice di esser grato a Harrison Salisbury per “I 900 giorni”, a parer suo il miglior libro in lingua inglese scritto sull'assedio di Leningrado. E’ proprio la ex San Pietroburgo, (Piter, nello slang dei suoi abitanti) il teatro della vicenda. Leggendo questa nota mi è venuto in mente che Sergio Leone morì prima di aver realizzato l’ultimo suo ambizioso progetto, un film sull'assedio della città. Grazie a “La città dei ladri” ho capito di quale portata sarebbe potuto essere quel film."}, {"userName": "Carol", "userReviewDate": "May 19, 2013", "userURL": "http://www.goodreads.com/user/show/7668522-carol", "userReview": "CITY OF THIEVES is a coming-of-age story that centers around one eventful week in 1942 Leningrad and the search for a dozen eggs that will mean freedom for a young Jewish (virgin) teen \"thief\" and a handsome, over-sexed, funny, talkative Russian \"deserter\" if they secure their prize.As the war ensues and their trip unfolds, fighting both hunger and fatigue, the two unlikely partners in crime end up behind enemy lines encountering some despicable horrors and near death experiences while sharing stories and ultimately becoming friends.Absolutely loved Kev and Kolya, (such well-defined characters) their ongoing sarcastic banter, (some really funny stuff here) and the intrigue and outcome of the chess playoff (such courage) but then........there's the ending."}, {"userName": "Lori", "userReviewDate": "Jan 16, 2011", "userURL": "http://www.goodreads.com/user/show/3332895-lori", "userReview": "Really, really enjoyed this. I'm kind of surprise at how much... the characters are very well developed and so likable. Creating humorous moments during a period in history not regarded as such is a difficult thing for an author to pull off. Benioff does it with such ease and ends up leaving you with a smile on your face. Easy 5 stars read for me."}, {"userName": "Ron", "userReviewDate": "Dec 01, 2015", "userURL": "http://www.goodreads.com/user/show/43881851-ron", "userReview": "“If you want to talk about Leningrad, we talk about Leningrad.”\nSo begins the story of Lev and Kolya in what I will say is the best book I have read this year. I’ve read a number of books that are in some way related to WWII over the past 12 months. This happened without planning. It’s just that some of the very best books are in this category, so I wanted to read them: Vonnegut, Philip K Dick, Wiesel & Kristin Hannah. Vonnegut wrote a satire based on reality. Dick wrote a science-fiction piece about what could have happened. In City of Thieves, Benioff (who I now wish would write more and more books, but hey, I know he has a few irons in the fire) creates a story of fiction set within the true siege of Leningrad (St. Petersburg), fondly known as Piter to the Russians who lived there. The then Leningrad is a world and a lifetime away from me (probably you too). It didn’t feel very far while reading. I was with Lev and Kolya the whole way, these two mismatched cohorts that I grew to love.Lev and Kolya are just boys really, forced by situation to be men. They don’t even know one another in the beginning of this story, one caught for looting, the other labeled a deserter. Neither is really guilty, but war creates labels. To save their own lives, they are given a chance: find a dozen eggs for the colonel so that his daughter may have a cake for her wedding (there is little to no food in the city – people are starving). Send two young men to find eggs: sounds like a preposterous premise. Well, it’s the sort of thing, along with some great humor, that keeps City of Thieves from being overly oppressive. It straddles a line with levity, and by doing so, it is better.What made this book special was its characters. Who they were is why I cared about them. Lev is a 17-year-old, skinny, big-nosed, Russian Jew who’s consistently mistaken for being 15. Insecure, but severely loyal. By appearance, Kolya is all that Lev is not: tall, blonde and blue-eyed and happens to look like a German. He is confident, and out-spoken to a fault, but underneath that there is no vanity and no judgment. Even in the middle of danger, Lev can’t help but see potential love in every girl he meets, and Kolya can’t help but instigate every possible situation. To me that seemed so human.Finally, I thought the story got better as it went along. As the plot developed the tension deepened, and there were three big scenes towards the end, each staggering to me in a different way. I’ll be thinking about this one for quite awhile."}, {"userName": "Will Byrnes", "userReviewDate": "Jan 29, 2010", "userURL": "http://www.goodreads.com/user/show/1526851-will-byrnes", "userReview": "This is a lovely, coming of age novel about a young (17) man in Nazi-besieged St Petersberg, Piter to the locals, who finds himself accompanied by a Soviet army deserter, named Kolya as they try to survive the horrors of war. It is, of course, a bleak landscape, with people driven mad by hunger and desperation, some to the point of cannibalism. What are people capable of? What is our young hero capable of? Can he kill? I quite enjoyed this book. It was engaging from front to end, with nicely drawn characters and payload in the form of an inside view of life under siege."}, {"userName": "Ann Marie (Lit·Wit·Wine·Dine)", "userReviewDate": "Feb 09, 2017", "userURL": "http://www.goodreads.com/user/show/7447086-ann-marie-lit-wit-wine-dine", "userReview": "Loved this book! Full review to follow"}, {"userName": "Tadiana ✩Night Owl☽", "userReviewDate": "Jun 27, 2017", "userURL": "http://www.goodreads.com/user/show/8734459-tadiana-night-owl", "userReview": "$1.99 Kindle sale, June 27, 2017. I bit."}, {"userName": "Liz", "userReviewDate": "Mar 03, 2016", "userURL": "http://www.goodreads.com/user/show/20625013-liz", "userReview": "If I had to describe this book in two words (because one is never enough), they would be:1. Brilliant.2. Extraordinary.This book hit me on so many different levels that I still can’t believe it’s all the same book. Tension, excitement, heartache and hilarity are all seamlessly wrapped up to create this wonderfully engaging story that I read in just over a day. I might not have put it down at all if not for those pesky life responsibilities getting in the way!I must first say that these are two of the most endearing characters I’ve read in a long time. Lev and Kolya are strangers at the outset but what they gain by the end of their adventure is more than just an unlikely friendship. The fact that they couldn’t be more polar opposites is what makes witnessing their journey so sweet. Kolya is like a blunt object hammering away at Lev’s reticence. This had me in stitches so many times! I really fell hard for these guys. The greatest source of Lev’s shame is that he can’t seem to find a way to not be afraid. He wants to be brave like his friend Kolya, wants to believe that when it comes down to it he would fight for what he believes in. I’m happy to say that this shy and unassuming boy does find out what’s really worth defending and discovers something inside himself that I don’t think he realized was there all along. And Kolya, well he might just be one of my favorite characters ever. He’s fast-talking, quick on his feet, completely irreverent and doesn’t ever seem to stop thinking about sex (among other things). And above all that he’s just…kind. Generous. Self-sacrificing.One mark of a winning book is that I’m sad when it’s over. In this case I feel like I’m leaving two friends behind. I’m so grateful to my Goodreads friends who recommended this one."}, {"userName": "Susana", "userReviewDate": "Sep 23, 2013", "userURL": "http://www.goodreads.com/user/show/1205030-susana", "userReview": "(review in English below)Brutalmente brilhante, incrivelmente viciante, absolutamente imperdível!Ofereci este livro há 2 anos, depois duma consulta ao rating do Goodreads e a algumas reviews, sem imaginar a preciosidade contida nas suas páginas.É uma história fabulosa, com dois protagonistas inesquecíveis: Kolya é um achado e o contraponto fornecido por Lev (o narrador) dá origem a cenas e diálogos maravilhosos, que são filosóficos, humorísticos ou, frequentemente, as duas coisas ao mesmo tempo.Não esquecer que o cenário é a Rússia ocupada pelos nazis, em pleno Inverno. Este livro contém cenas e linguagem que podem ser demasiado fortes para leitores mais sensíveis - leia-se mais jovens.De resto, recomendo a toda a gente que o compre, peça emprestado, alugue ou até roube, se preciso for - e desafio-vos a largarem este livro antes de o terminarem!This is an incredibly brilliant, addictive, compelling, absolutely mandatory book!I offered it two years ago, after checking its rating and some reviews on Goodreads, completely unaware of the treasure hidden in these pages.It's a wonderful story, with two unforgettable characters: Kolya is something else and the counterpoint embodied by Lev (the narrator) leads to some fabulous scenes and dialogues, which are philosophical, humoristic or, quite often, both at the same time.I should point out that the setting is occupied Russia in the middle of winter. This book includes some scenes and language that may be too rough for the more sensitive readers - namely younger ones.Besides that, I urge everyone to buy, borrow, rent or even steal it, if you need to - and I dare you to put it down before you finish it!"}], "description": "From the critically acclaimed author of The 25th Hour, a captivating novel about war, courage, survival — and a remarkable friendship that ripples across a lifetime.During the Nazis’ brutal siege of Leningrad, Lev Beniov is arrested for looting and thrown into the same cell as a handsome deserter named Kolya. Instead of being executed, Lev and Kolya are given a shot at saving their own lives by complying with an outrageous directive: secure a dozen eggs for a powerful Soviet colonel to use in his daughter’s wedding cake. In a city cut off from all supplies and suffering unbelievable deprivation, Lev and Kolya embark on a hunt through the dire lawlessness of Leningrad and behind enemy lines to find the impossible.By turns insightful and funny, thrilling and terrifying, City of Thieves is a gripping, cinematic World War II adventure and an intimate coming-of-age story with an utterly contemporary feel for how boys become men.", "title": "City of Thieves", "url": "http://www.goodreads.com/book/show/1971304.City_of_Thieves", "average": 4.29, "cover": "https://images.gr-assets.com/books/1392015757l/1971304.jpg", "reviews": 9213, "authors": [{"url": "https://www.goodreads.com/author/show/120401.David_Benioff", "name": "David Benioff"}], "type": ["Historical", "Fiction", "War", "Cultural", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/1971304.City_of_Thieves", "http://www.goodreads.com/book/show/6327123-city-of-thieves", "http://www.goodreads.com/book/show/8121694-city-of-thieves", "http://www.goodreads.com/book/show/12618747-la-citt-dei-ladri", "http://www.goodreads.com/book/show/9770690-la-citt-dei-ladri", "http://www.goodreads.com/book/show/6987155-city-of-thieves", "http://www.goodreads.com/book/show/11697081-cidade-de-ladr-es", "http://www.goodreads.com/book/show/379160.The_25th_Hour", "http://www.goodreads.com/book/show/2203766.The_Kite_Runner", "http://www.goodreads.com/book/show/996084.When_the_Nines_Roll_Over_and_Other_Stories", "http://www.goodreads.com/book/show/13115433-25th-hour-screenplay", "http://www.goodreads.com/book/show/35629976-game-of-thrones", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}