{"ratings": 8324, "userreviews": [{"userName": "Warwick", "userReviewDate": "Dec 02, 2014", "userURL": "http://www.goodreads.com/user/show/53165-warwick", "userReview": "Delhi is lucky to have William Dalrymple as a chronicler – not many cities get such exemplary treatment as this. I think I even preferred it to Peter Ackroyd's London: The Biography, just because Ackroyd presents himself as an expert dispensing knowledge, whereas Dalrymple is pure ingénu: curious, open-minded, he allows us to accompany him on his own journey of exploration and discovery which dovetails with the social and historical narratives he uncovers.For Dalrymple, Delhi is a city of accumulated losses, haunted by its innumerable fallen rulers, the locus of empires that have been lost and – though not actively remembered – not quite forgotten either. Two dates recur with especial frequency. 1857, when the Mughal Empire finally fell, and 1947, when the British Indian Empire was dissolved and the territory partitioned into India and Pakistan.Partition in particular emerges as the event that underlies almost everything about modern Delhi. While some authors might present this as a bald historic fact, Dalrymple instead lets us share in his growing realization over quite how much of the city's population left, arrived, or was radically changed by Partition.Even the most innocuous of our neighbours, we discovered, had extraordinary tales of 1947: chartered accountants could tell tales of single-handedly fighting off baying mobs; men from grey government ministries would emerge as the heroes of bloody street battles.Nor is he content with hearing only from those still in the city. He travels to Pakistan to hear from Delhi's former population of Muslims too, still speaking what they refer to as pure Delhi Urdu in the streets of Karachi. Dalrymple's interview with Ahmed Ali, the author of Twilight in Delhi, is fascinating. Ali loathes the whole idea of Pakistan; indeed the only country he seems to hate more is post-Partition India itself, to the extent that when a flight he was on had to make an emergency stop in Delhi, he refused even to get off the plane.‘The civilization I belong to – the civilization of Delhi – came into being through the mingling of two different cultures, Hindu and Muslim. That civilization flourished for one thousand years undisturbed until certain people came along and denied that that great mingling had taken place.’This sense that the city has created a constant stream of such refugees throughout the years, whether physically or mentally, is central to Dalrymple's understanding of Delhi. The British are an unusual case because, as he points out, their lengthy period of political rule has left remarkably few traces on Indian culture. The Brits that Dalrymple can find who had lived in colonial India show a hilariously skewed kind of imperious equanimity over Indian independence. ‘On balance I think you must never take land away from a people,’ says one old Englishwoman who, as a child, had known Lutyens.‘A people's land has a mystique. You can go and possibly order them about for a bit, perhaps introduce some new ideas, build a few good buildings, but then in the end you must go away and die in Cheltenham.’And the few Brits still remaining in-country show the sort of bizarre false memories of \"the motherland\" common to all such colonial relics (I've met some similar people myself in Kenya) – ‘The dish I like is that Kentucky Fried Chicken,’ confides one man as he reminisces about a couple of trips to relatives in Suffolk. ‘It's a very popular dish over there, that Kentucky Fried Chicken is. A delightful dish.’The major exception to Britain's complete disappearance from Indian society is of course the English language. The English spoken in India is its own animal, with all kinds of strange and unusual pleasures awaiting those who are unfamiliar with it. Its status as a lingua franca means that the fluency of some users is not high, and many of the ensuing idiosyncrasies, along with influences from Indian languages, have made their way into the standard idiom. The result is a very dynamic printed language subject to a lot of rapid tonal shifts which make it especially prone to bathos and other register-clashing effects. Dalrymple offers up this obituary from the Hindustani Times as a minor classic of the genre:SAD DEMISEWith profound grief we have to condole the untimely passing of our beloved general manager MISTER DEEPAK MEHTA, thirty four years, who left us for heavenly abode in tragic circumstances (beaten to death with bedpost). Condole presented by bereft of Mehta Agencies (Private) Limited.Perhaps the most impressive parts of the book, though, are the result of more intensive research that takes Dalrymple out of the library and into the streets. In particular his long, delicate attempts to get first-hand interviews and experience with Delhi's hijra community – representing a kind of fusion of transgender identity with India's eunuch tradition – are amazing, and result in some remarkable testimony from within a very closed and secretive subculture.‘I started to wear women's clothes and to put on makeup. The following year I was taken to a village in the Punjab. I was dosed with opium and a string was tied around my equipment. Then the whole lot was cut off. I knew it would be very painful and dangerous, but I got cut so that no one would taunt me any more. After I was cut all my male blood flowed away and with it went my manhood. Before I was neither one thing nor the other. Now I am a hijra. I am not man or woman. I am from a different sex.’My only real concern is that so much of this must now be out of date; comments about how the roads are ‘becoming clogged’ (ha! I actually read this page while sitting in an afternoon-long traffic jam that was nose-to-tail cars, buses, pedestrians and cattle) are a reminder that 1993 is a long time ago for a city changing as fast as Delhi is. But overall there is so much to enjoy here, such a wealth of great material so well tied together, and motivated by a palpable love of the city, that despite its age it's still the first book many Delhi-wallahs recommend for anyone visiting this City of Djinns for the first time.(Dec 2014)"}, {"userName": "Riku Sayuj", "userReviewDate": "Nov 22, 2011", "userURL": "http://www.goodreads.com/user/show/1651956-riku-sayuj", "userReview": "City of Djinns: The Reader’s Journey\nI started reading The White Mughals sometime in an auto in Lucknow, in 2011. I still remember reading enchantedly of Old Delhi while sitting stuffed inside a crammed  \"share-auto\", dodging the remains of an equally old Lucknow (and close to the pre-Shah Jahani capital, of Agra). I remember missing my stop. I don’t remember when I left off reading it.Then, recently, I had an argument with a friend about that fiendishly invented TV series/Soap Opera ‘Jodhaa Akbar’ and realized how little I knew about Mughal rule and also remembered that I never got around to even properly beginning The White Mughals.I then picked up White Mughals again, flipped it around and got the mistaken impression that it must have been set after The Last Mughal. I have no way of explaining how that logic worked, but, it probably went something like this - only after the ‘Last Mughal’ could ‘White’ Mughals come into the story. Right? Brilliant as usual, of course.Anyway, I started The Last Mughal and Dalrymple kept talking to me as if we were in the middle of a conversation. This disconcerted me until he let slip that he had been talking to me of this subject since The White Mughal. So I immediately went back to that.Where he informed me that he had initiated the conversation way back in The City of Djinns. This book was the least alluring - ancient Delhi was more fascinating to me than contemporary travel writing.But I decided to humor Dalrymple and started with CoD, if for nothing else but to trace the evolution of an obsession that gave us such great works later. Not a bad decision. But I am sure the next two in his ‘tetralogy’ are much greater delights - I should know, I have read more than a bit of both.\nCity of Djinns: The Writer’s Journey\nDalrymple plots his own journey (from childhood almost) of sifting through the endless layers of Delhi’s historical stratigraphy and historiography. As he sifts, we discover that in the everyday structures lies dormant splendid stories and great figures.The reader should keep in mind that this is early in Dalrymple’s own love affair with Medieval India. What it lacks in insight, it makes up for in enthusiasm. A brisk and breezy Dalrymple is on display instead of the magisterial one we have come to expect. Also, the spirit of imperial fascination and the tendency to view the fall of Delhi as due to “decay” exists in these pages. Need to see if Dalrymple moves beyond that impression of decay in his later more mature works.Dalrymple still paints quite a wonderful portrait - of a city disjointed in time, a city whose different ages lay suspended side by side, a city of djinns. [The story behind the title would be a spoiler]Two recurring themes:1. A simple technique of transposition of place and time - Dalrymple first talks of a place that he himself is visiting and then effortlessly takes us back centuries to show what momentous events were transpiring in that same now innocuous piece of land… exposing the grand history in which daily life of great cities are lived.2. Great Beauty and grandeur hidden amidst everyday squalor - a city that is as fine as the very greatest cities, yet living in the most prosaic manner, with hardly a nod to its own history. A closer look is all it takes in Delhi to be transported back into a distant century. It took a Dalrymple to take that look. And it transformed both the city and the author. [ Refer Footnote #1 ]\nStep 1: Independence & Partition\n[The easiest reference point for any historian of India. Dalrymple does not duck this one either.]The Quest to understand delhi convinces D again and again that he has found the key only to be shown each time that the inner doors keep stretching into the distance. A sort of chinese doll palace entrance, with entrances nested inside the other.Living with a Punjabi family and mixing with Muslim families throws D on an early scent. He follows this contradistinction between the communities and arrives at the answer that partition is what made today’s delhi a city of contradictions.He asserts early in the book:The more I read, the more it became clear that the events of 1947 were the key to understanding modern Delhi. The reports highlighted the city’s central paradox: that Delhi, one of the oldest towns in the world, was inhabited by a population most of whose roots in the ancient city soil stretched back only forty years. This explained why Delhi, the grandest of grand old aristocratic dowagers, tended to behave today like a nouveau-riche heiress: all show and vulgarity and conspicuous consumption. It was a style most unbecoming for a lady of her age and lineage; moreover it jarred with everything one knew about her sophistication and culture.This thread of enquiry leads to an engrossing paean on Old delhi  - of the muslim delhi, of a british delhi - of the high class Old Delhi. Set off in stark contrast from the bureaucratic, boring and boorish Delhi of today.In pursuit of the Old Muslim glory of the city D reaches Karachi and is thus introduced to even stronger nostalgia for the lost Delhi of before partition, a bi-imperial city.Soon however, D abandons the idea that this story explains Delhi.Thus, he discovers that:New Delhi was not new at all. Its broad avenues encompassed a groaning necropolis, a graveyard of dynasties. Some said there were seven dead cities of Delhi, and that the current one was the eighth; others counted fifteen or twenty-one. All agreed that the crumbling ruins of these towns were without number.The next step was to go even further back.Peel back one more layer.\nStep 2: The Imperial Past / The Raj: Digging up The Elephant in the City \nMultiple strands:- the vast Lutyens’ architecture- the inhuman scale- the adaptations from Mughals- ferreting out of anglo-indians (a favorite method of D to recapture the flavor of living in that layer of Delhi - employed throughout the book until the layers get too ancient for the method)- the exploration of the ‘sub-delhis’, the imperial summer outposts of Kashmir and Shimla.Excerpt:Considering that Lutyens managed to fuse Eastern and Western aesthetics more successfully than any other artist since the anonymous sculptors of Gandhara (who produced their Indo-Hellenic Buddhas in the wake of Alexander the Great), his dislike of Indian art and architecture is particularly surprising: ‘Moghul architecture is cumbrous ill-constructed building,’ he writes in one letter. ‘It is essentially the building style of children [and] very tiresome to the Western intelligence.’ At one stage, after visiting Agra, he is grudgingly forced to admit that ‘some of the work is lovely’, but he attributes these qualities to an (imaginary) Italian influence.In the end one is left with the same paradox confronted by lovers of Wagner: how could someone with such objectionable views and so insular a vision have managed to produce such breathtaking works of art? Here was a man capable of building some of the most beautiful structures created in the modern world, but whose prejudices blinded him to the beauty of the Taj Mahal; a man who could fuse the best of East and West while denying that the Eastern elements in his own buildings were beautiful.Authoritarian regimes tend to leave the most solid souvenirs; art has a strange way of thriving under autocracy. Only the vanity of an Empire - an Empire emancipated from democratic constraints, totally self-confident in its own judgement and still, despite everything, assured of its own superiority - could have produced Lutyens’s Delhi.By now the pattern should be apparent to the reader. It even appears doubtful if the story of the gradual discovery of delhi’s antique mysteries is authentic. In any case, D follows the charade of another surprise discovery that Delhi is much older and needs to be peeled back even more.Moreover the city - so I soon discovered - possessed a bottomless seam of stories: tales receding far beyond history, deep into the cavernous chambers of myth and legend. Time for another peel, obviously.\nStep 3: The Long Twilight\nThus, D soon comes up with another key to Delhi: the Twilight. This time he is closer to the mark - much of modern Delhi is an outgrowth or a reaction to this period’s history and architecture. First by the Britishers and then by the Leaders of Independent India.The Twilight, as defined by D, is bounded by two of the greatest disasters in Delhi’s history: the Persian massacres of 1739 and the equally vicious hangings and killings which followed the British recapture of Delhi after the 1857 Indian Mutiny.If we extend this and add the next great disaster, modern Delhi would appear to take shape, even though D does this in reverse, it is easy for the reader to do the mental jugglery.But having come this far, D could not stop. He had to dig deeper. How could a history of Delhi be complete without talking of Mahabharata??Especially when every section is marked by an elephant - a tribute to Hastinapura of old?\nStep 4: The Epic Past\nUnfortunately, Delhi’s history fades away quickly into legend past the ‘twilight’. Except for eulogies, not much is known of the leaders such as Prithviraj Chauhan.It soon became clear that trying to disentangle the history of pre-Muslim Delhi was like penetrating deeper and deeper into a midsummer dust storm: the larger landmarks stood out, but the details were all obliterated.And then, quite suddenly, on the very edge of the dark abyss of prehistory, ancient Delhi is dramatically spotlit, as if by the last rays of a dying sun. The light is shed by the text of the greatest piece of literature ever to have come out of the Indian subcontinent: the Mahabharata, the great Indian epic.D then embarks on an archeological survey into ancient Delhi of lore - to the Mahabharatha and beyond, right to the Vedic origins of the civilization on the banks of the Yamuna - that is interesting by itself but adds precious little to the illumination of present Delhi. But it still shows how continuing traditions lie at the core of such cities. After all, there are only a handful of truly epic and truly modern cities.\nStep 0: Tracing a City: The Present \nSo, how does all this come together? Is D a travel writer or a new breed altogether? I wonder how the readers at the time greeted this book that makes not much of an effort towards being a travel chronicle and is quite blatantly an exercise in curiosity.To D, Delhi is unique. This is why the historical, architectural and archeological approach was inevitable. For, this uniqueness is due to the fact that, scattered all around the city, there were human ruins too. Somehow different areas of Delhi seemed to have preserved intact different centuries, even different millennia. The Punjabi immigrants were a touchstone to the present day; with their nippy Maruti cars and fascination with all things new, they formed a lifeline to the 1980s. The old majors you would meet strolling in the Lodhi Gardens were pickled perhaps half a century earlier. Their walrus moustaches and Ealing comedy accents hinted that they had somehow got stuck in about 1946. The eunuchs in the Old City, some speaking courtly Urdu, might not have looked so out of place under the dais of the Great Mogul. The sadhus at Nigambodh Ghat I imagined as stranded citizens of Indraprastha, the legendary first Delhi of the Mahabharata, the great Indian epic.As they drove up the Ring Road, the motorway which for much of its length follows the old course of the Jumna. Driving up the dry riverbed was like looking at a section of Professor Lal’s stratigraphy: on the way we drove through millennia of Delhi’s history, the detritus of city after city spaced out on the old river bank. Leaving Lutyens’s broad twentieth-century avenues we passed by the Purana Qila, the early Mughal addition to Delhi’s bastions; after that we passed the shattered domes of Feroz Shah Kotla; then the magnificent walls of the Red Fort with their great ribbed chattris; and finally we drove under the walls of Salimgarh, the old Bastille of Delhi. Passing beyond all of these, we headed up towards the site of William Fraser’s first house. And then on to the Sufi mystic villages on the outskirts. A journey into the past.The book’s final message:There is still continuity here, a few surviving traditions, some lingering beauty, but you have to look quite hard to find it.\nA Necessary Footnote [#1] \n:On the complete neglect of the mighty past, of the structures, of traditions, etc. Also a major face slap for ASI as D traces out one major monument after another in complete disrepair and neglect. Indeed, even of a nation that is too busy to look back on past glories and s busy building a shiny, plasticky future.****Today the passages are only blocked with a small plug of concrete; it should not be difficult to remove that plug and investigate what lies beyond. The problem would be to motivate India’s impoverished and bureaucratic Archaeological Survey to take an interest in the matter. As Mr Prashad explained when we were leaving: ‘You see actually in India today no one is thinking too much about these old historical places. India is a developing country. Our people are looking to the future only.’****The streets here are narrow and full of goats being fattened for Bakri Id. Pack-donkeys trot past carrying saddlebags full of rubble. As you pass into the Sita Ram bazaar and take in the grand old gateways tumbling down on either side of you, you begin to realize what has happened here. The same walls that now form the rickety paan shops and dirty godowns once supported sprawling mansions and the lovely Delhi courtyard houses known as havelis. You can see it for yourself: the slum was once a city of palaces.****In Shahjehanabad the town houses were so planned that a plain façade, decorated only with an elaborate gatehouse, would pass into a courtyard; off this courtyard would lead small pleasure gardens, the zenanas (harems), a guardhouse or a miniature mosque, the haveli library and the customary shish mahal or glass palace. The haveli was a world within a world, self-contained and totally hidden from the view of the casual passer-by. Now, however, while many of the great gatehouses survive, they are hollow fanfares announcing nothing. You pass through a great arch and find yourself in a rubble-filled car-park where once irrigation runnels bubbled. The shish mahals are unrecognizable, partitioned up into small factories and workshops; metal shutters turn zenana screens into locked store rooms; the gardens have disappeared under concrete. Only the odd arcade of pillars or a half-buried fragment of finely-carved late Mughal ornament indicates what once existed here."}, {"userName": "Kalliope", "userReviewDate": "Nov 22, 2011", "userURL": "http://www.goodreads.com/user/show/3593962-kalliope", "userReview": "This is the perfect read when visiting Delhi.Written by a Brit, this book is the result of a one year stay in Delhi. It reads as a mixture of memoir, travelogue, history, religion, and myth book.Its nicest charm is that it conveys, sweetly, the author’s absolute love for the country. The understanding with which he presents his stories becomes contagious and after this relatively short read one feels immersed into the magic and mysteries of India.I read it while visiting a friend who was also spending one year in India as a Fulbright scholar. She was sharing an apartment in South of Delhi with other Fulbrighters, and that apartment had become as a kind of warm and welcoming consulate-refugee camp for any friend or friend of friends going through India. I was one of those migrants.In that apartment Dalrymple’s book figured prominently. It was the companion and welcoming read for anybody knocking at the door."}, {"userName": "Caroline", "userReviewDate": "May 20, 2013", "userURL": "http://www.goodreads.com/user/show/6257531-caroline", "userReview": "[\nAs soon as you awoke you knew it was going to be hot.The sun had just appeared over the treeline, as blond as clarified butter but powerful none the less, hinting at the furnace-heat to come. ...By late morning the air was on fire; to open the door on to the roof terrace was to feel in your face a blast of heat as strong as that from a blazing kiln. Noon came like a white midnight: the streets were deserted, the windows closed, the door locked. There was no noise but for the sullen and persistent whirr of the ceiling fans.The heat had sprung up quite suddenly: the change from late winter to high summer - six months of European weather - was compressed into little more than a Delhi fortnight..... One day everyone was laughing and singing in the Delhi gardens, covering each other with pink powder and coloured Holi-water; the next they had imprisoned themselves in the silent air-conditioned purdah of their bedrooms and offices, waiting patiently for the reprieve of evening.The rising mercury changed everything. In the gardens the annuals shrivelled and died. The earth cracked; the lawns became bald and bleached. The tar on the roads glistened like liquid quick-silver.People became tired and listless. Fruit decayed: an uneaten mango, firm at breakfast, could be covered with a thin lint of mould by evening. Water shot boiling from the cold taps. There was no relief except to shower with bottles of cold water from Mrs Puri's fridge....In the Old City men set up small roadside stalls around big earthenware pots containing 'jal jeera', a dark, spicy, green liquid which burns the mouth but cools the body....The sky turned the colour of molten copper. The earth cracked like a shattered windscreen. April gave way to May and every day the heat grew worse.Hot sulphurous winds began to rake through the empty Delhi avenues. The walls of the houses exuded heat like enormous ovens. The rich fled to the hill stations and the beggars followed them....\n\n(hide spoiler)]"}, {"userName": "Hana", "userReviewDate": "Apr 24, 2014", "userURL": "http://www.goodreads.com/user/show/10571559-hana", "userReview": "“Some said there were seven dead cities of Delhi and that the current one was the eighth; others counted fifteen or twenty-one. All agreed that the crumbling ruins of these towns were without number. But where Delhi was unique was that, scattered all around the city, there were human ruins too…All the different ages of man were represented in the people of the city. Different millennia co-existed side by side. Minds set in different ages walked the same pavements, drank the same water, returned to the same dust.” A mystic explains to William Dalrymple that Delhi is a city of djinns. Delhi was destined to appear in a new incarnation century after century because the djinns loved Delhi so much they could never bear to see it empty or deserted. Delhi is a city haunted by djinns. “You could not see them, said Sadr-ud-Din, but if you concentrated you would be able to feel them: to hear their whisperings, or even, if you were lucky, to sense their warm breath on your face.”Newly married, William Dalrymple and his wife, the artist Olivia Fraser, move to the Sufi neighborhood of Nizamuddin in New Delhi and set out to explore their adopted city. They arrive in the City of Djinns in September of 1989. Their landlady, the formidable Mrs Puri and her husband are, like so many others in Delhi, refugees of the Partition, Sikhs expelled from their home in Lahore during the upheavals of 1947. The terrors of those times have left Mr Puri flitting in and out of madness, but Mrs Puri has rebuilt the family’s life and fortune with discipline and iron determination. The Puris are the first of many vividly drawn characters who inhabit this city of djinns. The first veils of history that Dalrymple must part to understand the city and hear the whispers of the past are the veils hiding memories of the Great Partition that tore India apart at the very moment of her birth as an independent nation. In layer after ancient layer; story after story, Dalrymple lets us hear the murmuring of the djinns and the voices of Delhi’s many peoples. Roughly organized by season, we live through the Delhi calendar, celebrating Diwali and Ramadan. We freeze in the grey cold of the winter, delight in Delhi’s brief glorious spring and endure the scorching heat of summer. Dalrymple’s stories carry us slowly back through time. Sometimes prompted by a conversation, at other times by the discovery of yet another ancient building crumbling into dust, we journey to the British Imperial India of Lutyens; to the early days of the East India Company; to the waning decades and tragic end of the Mughal Empire in 1857; to the Golden Age of Shah Jahan; and far, far back to the Tughluk dynasty that ruled nearly all of India from Delhi in the 14th century. In the final chapter, Dalrymple explores the historical roots of the great Hindu epic, the Mahabharata, and speculates on its links to the most ancient excavations in the Punjab.But this is no dry, depressing history. Dalryple’s stories are enlivened by his wife Olivia’s watercolors and by Dalrymple’s ear for language, his keen, appreciative sense of humor and his deep fondness for humans with all their foibles. He salutes his driver, Mr Balvinder Singh from International Backside Taxi as “son of Punjab Singh, Prince of Taxi Drivers...” A warrior by cast and inclination, Mr Balvinder Singh disdains “such cowardly acts as looking in wing mirrors or using his indicators. His Ambassador is his chariot, his klaxon his sword. Weaving into the oncoming traffic, playing ’chicken’ with the other taxis, Balvinder Singh is a Raja of the Road.” One month after Dalrymple’s arrival in Delhi, Mr Singh careened his Ambassador into the back of “a Maruti van which bled Mango Frooty Drink all over Mr Singh’s bonnet. No one was hurt, and Mr Singh—strangely elated by his ‘kill’—took it stoically. ‘Mr William,’ he said. ‘In my life six times have I crashed. And on not one occasion have I ever been killed.’” City of Djinns is only Dalrymple’s second book. He had not fully mastered his art and the book at times feels disorganized and unbalanced. I longed for a chronology of Indian history and the many Urdu, Persian, Arabic and Hindi terms are sometimes translated and sometimes left for us to Google or guess. Dalrymple’s later outings, including the superb White Mughals: Love and Betrayal in Eighteenth-Century India and The Last Mughal: The Fall of a Dynasty: Delhi, 1857, explore India’s history with greater depth and scholarly assurance. Those who love fine travel writing and appreciate religious studies should sample From the Holy Mountain: A Journey among the Christians of the Middle East, which has a special poignancy now that world of Dalrymple’s pilgrimage has been destroyed. Still, Dalrymple’s many fans as well as lovers of all things Indian should not miss City of Djinns; it is an atmospheric classic and almost as wondrous as being in Delhi yourself. Three and a half stars.Content rating PG for occasional gruesome, gritty details, comments on Delhi's red light districts and a section on the hijra transgender community."}, {"userName": "Siddharth Sharma", "userReviewDate": "Jan 05, 2013", "userURL": "http://www.goodreads.com/user/show/12315581-siddharth-sharma", "userReview": "William Dalrymple embarks upon a journey to unravel the history of Delhi, thus providing the reader with historical perspectives behind various parts of the city- a city which, as a Persian proverb goes, is destined to be lost by whoever who builds it. Set upon a period of a year of his stay in the capital, the narration opens up beautiful aspects of Delhi, including architectures erected in the Mughal phase (Humayun Fort, the Red Fort...), the Tughlaq phase, the British Raj; even dating back to the times of the epic poem 'Mahabharata' which has helped to bear testimony to the existence of this city even thousands of years before Christ. He has extensively studied the accounts of various travelers who wrote about the then society, the state of music and art, the clandestine diplomacy inside the courtrooms, etc. etc. Based upon the letters that they wrote back home, various British civil servants like Metcalf, Lutyens, Fraser, have been pictured and their distinct approaches towards India and Indians has been well illustrated. At one point, he beautifully concludes a discussion on how the architecturally exquisite constructions of British time, are also tragic reminders of Lutyen's condescension and his broad dislike for everything Indian... \"Authoritarian regimes tend to leave the most solid souvenirs; art has a strange way of thriving under autocracy. Only the vanity of an Empire- an Empire emancipated from democratic constraints, totally self-confident in its own judgement and still, despite everything, assured of its own superiority-could have produced Lutyens's Delhi\"And about Fraser, who acquired the Indian traditions & customs and mixed enthusiastically with the common gentry, Dalrymple quotes Jacquemont's memoirs...<>\"He is a thinker who finds nothing but solitude in that exchange of words without ideas, which is dignified by the name of conversation in the society of this land.\" Throughout the book, he has had a parallel attention towards the people of Delhi...\"The more I read, the more it becomes clear that the events of 1947 (referring to partition) were the key to understanding modern Delhi. The reports highlighted the city's central paradox: that Delhi, one of the oldest towns in the world, was inhabited by a population most of whose roots in the ancient city soil stretched back only forty years. This explained why Delhi, the grandest of grand old aristocratic dowagers, tended to behave today like a nouveau-riche heiress: all show and vulgarity and conspicuous consumption. It was a style most unbecoming for a lady of her age and lineage; moreover it jarred with everything one knew about her sophistication and culture\"In an attempt to excavate the background of Delhi, beginning from the modern history and receding behind till as far as 2000 BC, he has composed a great mix of travel writing and history."}, {"userName": "Sudhakar Gupta", "userReviewDate": "Aug 02, 2010", "userURL": "http://www.goodreads.com/user/show/4080268-sudhakar-gupta", "userReview": "I'm not sure if I can call myself a Delhi-walla after reading City of Djinns. Despite living in Delhi for the past 17 years, I had not known most of the sites mentioned, except on a superficial level. Delhi today is completely unrecognizable from the beautiful city that it once was. Dalrymple successfully manages to bring to life that old Delhi with all its charms and customs. He employs a rather unusual method, that of going through the history in a reverse chronological order. Thus we start in Indira Gandhi's Delhi, taking part in the riots of 1984, and move back to the Partition in 1947, the birth of Lutyens' Delhi, the Siege of 1857, construction of Shahjehanabad and all the way back to the defeat of Prithviraj Chauhan at the hands of Muhammahad of Ghor before ending at the ancient epic of Mahabharata.The author adds another dimension to these stories and makes them much more interesting by introducing some modern day aspect, say an existing but long forgotten ruin or a living person who is directly related. We get to meet Dr Jaffrey who serves as an expert on Purani Dilli, the Haxby sisters who tell us about the unfortunate Anglo Indians, and a visit to an Office of the Railways Board reveals a tykhana built for William Fraser.One thing that I loved about this book is how Dalrymple interspersed the story with his daily life experiences. How he deals with the shrewd Punjabi landlady Mrs Puri, or the refreshingly funny stories with his cab driver Balvinder Singh, amidst the noisy, heavily populated, sweltering hot Delhi, turn this into a book a reader can relate to, rather than just another bland volume of history. To a reader, a travel enthusiast and a history buff, I highly recommend City of Djinns for the delightful book that it is, and to a Delhi-walla, for getting to know his Dilli better."}, {"userName": "russell barnes", "userReviewDate": "Jun 08, 2007", "userURL": "http://www.goodreads.com/user/show/72919-russell-barnes", "userReview": "Despite  William Dalrymple's deeply upsetting background of being posh, and having wealthy relatives allowing him to potter around ancient castles in Scotland and seemingly taking random years off without having to work, it's a pretty inspiring read. There's more to Dehli than curry and he picks it apart to reveal the fascinating, multi-layered history beneath the stereotypical surface.It made me want to seek out the two Eighteenth Century books he used as a guide to learn more. And not only that, who knew Cliff Richard was an Anglo-Indian?Miss Lucy Ferguson, a top recommendation - I salute you!"}, {"userName": "Jim", "userReviewDate": "Mar 20, 2010", "userURL": "http://www.goodreads.com/user/show/1895570-jim", "userReview": "I first heard about this book as a result of searching eBay for the works of the Scottish writer and poet George Mackay Brown, whose works I collect. I kept running into William Dalrymple's City of Djinns, which Brown is quoted in the accompanying squibs as saying it was his favorite travel book.Brown was only half right. It is both a travel book and a history at the same time. Under the guise of describing a year in Delhi, Dalrymple also goes back into the history of Delhi, ranging from even before the days of the Mahabharata, India's great national epic which is about as old as Homer's Iliad and Odyssey, all the way to the present day. Included are several fascinating chapters about the Mughal rulers, including Tunghkul, Shah Jehan, and Aurangzeb. As well, there are fascinating stories of British rule and the Partition that marked the birth of a free India and Pakistan.This is a marvelous work to luxuriate over and enjoy at a slow pace. Also, I suspect that even as Brown's quote led me here, Dalrymple will lead me to more fascinating books. Life is a knowledge quest."}, {"userName": "Zaki", "userReviewDate": "Aug 15, 2010", "userURL": "http://www.goodreads.com/user/show/3040523-zaki", "userReview": "I'd love to live in Delhi. I'd eat a chicken vindaloo every fucking day, smoke it up with the Sadhus, and see about these ethereal Djinns that rule over the cities unconsciousness."}, {"userName": "Travelin", "userReviewDate": "Nov 27, 2016", "userURL": "http://www.goodreads.com/user/show/21707944-travelin", "userReview": "I FINALLY finished this, just so I wouldn't have to carry it to another strange Balkan country. Such high hopes dashed again. I really feel like Dalrymple is some kind of hermaphrodite, who can't decide if he's proudly English or proudly Scottish/English, but he does spend the first part of the book ridiculing Indians who still think they're English, then 10 full days more trying to meet the city's eunuchs, so I guess that excuses his broad apologia for a Scottish governor and empire builder who allegedly embraced native culture by refusing to wear shoes and taking a harem of his own. I guess it helps his case that Dalrymple's wife is related to him.Here's a note I wrote last night:I was almost ready to excuse his youth when he wrote this (24?), but the closest he comes to a Cambridge don is Don Corleone, aping a kind of monkey in his back yard until he suddenly collapses from the sensuality of the orange fruits. Here's what I wrote months ago:My God, I just saw Dalrymple interviewed on a dodgy History channel documentary! The documentary is hosted by a woman whose Muslim grandparents never trusted Ghandi, and wouldn't you know Dalrymple agrees. What's so weird, aside from his alleged expertise, is that he shows up on camera seated in a lotus position, with bare feet, answering in a candence so Indian I had to be certain it was him doing the talking. What a show. All in all, the book is superficial and trivial, with a bizarre and badly explicated focus on the geography of ancient sites which is only slightly ameliorated by his wife's illustrator-quality drawings. Like any book of this size, especially one about such an ancient and interesting topic, it has its valuable excerpts, which I'll try to share before dumping the book. It's just exceedingly strange that the ancient excerpts his text so often depends on are so often so exceedingly tedious."}, {"userName": "Abhishek", "userReviewDate": "Jul 07, 2012", "userURL": "http://www.goodreads.com/user/show/10727057-abhishek", "userReview": "This book is an encyclopaedia for all common Dilliwalas and any Indian even slightly interested in knowing about Delhi and ancient India. This is what you can call ‘The Discovery of Delhi.’ Partly a travelogue, partly a history book and overall a pleasurable book. Dalrymple provides information not usually found in school history. He starts describing Delhi right from her very birth and the saga continues till the modern times. It is most fascinating when Dalrymple describes an ancient monument or place and then visits it in person to observe what it looks like. History comes alive then. He lives no stone unturned in uncovering Delhi. Not only it's about buildings and monuments, it's about people too. He describes the lives of the people in times of Shah Jahan and in times of early British rule. He presents excerpts of various journals, historical documents also. He gets in touch with the descendants of the Mughals and interviews them. He even interviews two British ladies in Shimla who stayed back when the British left India.He describes Delhi’s cold (Dilli ki Sardi) and her heat too with brutal honesty. The stories go as far back as the Mahabharata. The subtle nuances of the people of Delhi, especially his landlord, landlady and the taxi driver are beautifully portrayed. He even visits Pakistan to interview Ahemd Ali, the famous writer of ‘Twilight in Delhi.’This book clearly depicts Dalrymple’s love for India and it's people and their history (as does his books Nine Lives, The Age of Kali, The Last Mughal, The White Mughals etc). This gives and unbiased view of Delhi, what she was, is and has always been. This book changed my perspective and literally made me fall in love with the city (all over again)."}, {"userName": "Ishi", "userReviewDate": "May 31, 2014", "userURL": "http://www.goodreads.com/user/show/30868451-ishi", "userReview": "When I was first told of this book, I was skeptical about reading it, as nonfiction is a genre which I had a completely irrational dislike for. I'm glad to say that all my doubts vanished as soon as I read the first page of this book. This made me know the city I've been in forever even better. The many traditions, the ever-changing rulers, the rich history, it all had me awestruck. I was pulled into this book instantly and abandoned all my other \"current-reads\" for the time being. The picture William Dalrymple portrays of this immortal city is as realistic as it can get. Reading the descriptions I felt as if I myself was the one visiting the various places and landmarks mentioned throughout the book. I don't think I can put it into words about how much I loved the time I spent reading it. This definitely was a 5 star read for me and I know this is one book I won't mind rereading again and again."}, {"userName": "Vikas Lather", "userReviewDate": "Jun 13, 2014", "userURL": "http://www.goodreads.com/user/show/24372433-vikas-lather", "userReview": "William Dalrymple is the best travel writer(only exception is V.S.Naipaul)\"In Delhi, right of way belongs to the driver of the largest vehicle\", shows he wrote the book with exceptional observation. Teeth-grinding horror episodes of 84 Sikh riots and his conviction to discovery truth behind the story of Mahabharata capture imagination to seemingly endless degree. \"Delhi ladies very good. Having breasts like mangoes\", Second rate filthy expression of Mr Singh(his driver), reflects his playfulness and fearless humor. I would like to end the review with a delicious sense of irony. Just as Olivia (his wife) upon arrival of morning chai as a gesture from Mrs Puri(their landlord)said, \"I wish she had sent it up two hours later\". I also wish this book had not finished for another two hours :)"}, {"userName": "William1", "userReviewDate": "Aug 06, 2013", "userURL": "http://www.goodreads.com/user/show/4684009-william1", "userReview": "Exquisite."}, {"userName": "Zain Hashmy", "userReviewDate": "Dec 08, 2017", "userURL": "http://www.goodreads.com/user/show/32232965-zain-hashmy", "userReview": "This is the second time I've read this book. The first was when I was 15, and even then, I found it to be an interesting book.Today, it does a lot more than that.The book talks about the soul of Delhi, in a mesmerising, heart rending way, in a manner so poignant that I can smell the Delhi smoke and walk among the streets and alleys again. More importantly, it talks about the spirit of Delhi, which I must say, has been lost today.To quote Ahmed Ali \" The civilisation that I belong to - the civilisation of Delhi - came into being through the mingling of two different cultures, Hindu and Muslim. That civilisation flourished for one thousand years undisturbed until certain people came along and denied that that great mingling had taken place. \"That was the culture, from one of the cities of Delhi, and if the people of those days could see Delhi today, shattered, with communal hatred spreading through every alleyway poisoning the city, they would lament at the loss. I have been lucky enough to have grown up in that culture, between my family and another family that practiced Hinduism. During Eid, Major Uncle would come with us to the mosque, and during Diwali, I would stand while the aarti was carried out by Kavita Aunty. Major Uncle wrote letters to my parents in Urdu when we lived away, and Kavita aunty spent a lot of time trying to ensure I did not fail in my Hindi exams. I never felt for one second that they were any different from my parents, or that we were two separate families instead of one whole unit. They are as basic a part of my childhood as has ever been, and thanks to this friendship between our families, I know exactly what the book talks about, and I hope that there are other people out there who are able to live this way again. Back to the book again.The book takes us through the seven cities of Delhi, layer by layer, each chapter dedicated to one city. William Dalrymple is sporting, observant and energetic, and travels far and wide for his research, and uses sources so rare, that it would impossible to find them again today. The book has first hand accounts of people who lived in Lutyens Delhi, stories from the Anglo-Indians who got caught in the British Raj days between divided loyalties, Sufi saints from Mughal Delhi, and historical details from Inderprastha, just to name a few. Bit by bit, the puzzle of the seven cities will come together, and even experienced historians from Delhi will be able to glean new knowledge from this book. Caught in the story are the modern attitudes of people in Delhi, from the Sikh Landlady Mrs. Puri, to the driver who taken William Dalrymple around the city. There has never been a more vivid and beautiful description of this city, with so much research and with such accuracy. It is now on my bucket list to get a hardcover copy of the book, track down the author(who lives in Gurgaon- he never left because he fell in love with Delhi), and get his autograph. To everyone who has ever visited Delhi or lived there, pick up this book, and walk through each city while reading it. The experience will stay with you for the rest of your life."}, {"userName": "Udit", "userReviewDate": "Mar 18, 2018", "userURL": "http://www.goodreads.com/user/show/11758887-udit", "userReview": "My first experience of reading a William Dalrymple was with White Mughals when I was in class nine. Until then, although I had always enjoyed reading History as part of the school curriculum, I hadn’t cared to venture into it any further outside of my textbooks. White Mughals turned out to be sad, breathtaking, challenging (I was a kid) and extremely memorable. I finally started to look for books which fell outside the broader fiction genre.City of Djinns was written almost a decade before White Mughals. While WD is yet to achieve the refined writing he does in his later books, he is clearly on the way. CoD has a fresh, unabashedly opinionated (but never cruel) and passionate feel to it. It’s witty and thoroughly engaging. Read CoD for the fascinating amalgamation of experiences, discoveries, peoples, cultures, histories, and stories. It will make you long to explore the ancient, delightful city of Delhi. It’s certainly on my to do list for 2018."}, {"userName": "Sashwati Sanyal", "userReviewDate": "Sep 12, 2007", "userURL": "http://www.goodreads.com/user/show/269125-sashwati-sanyal", "userReview": "This is the first of William Dalrymple that i am reading. Having being pushed into it via heavy recommendations, must say that WD fails to inspire. The book starts with a lot of promise but takes a meandering tone halfway through the narration. Delhi's intriguing past is a delicious topic that more than simply nudges your curiosity but WD is yet to bite a fulsome piece into it.Here's hoping that the latter half would live upto expectations!"}, {"userName": "Parinita", "userReviewDate": "May 19, 2014", "userURL": "http://www.goodreads.com/user/show/7115920-parinita", "userReview": "What a spectacular book! My first Dalrymple and definitely not my last. I've fallen in love with Delhi all over again (which is supposed to be odd behaviour for a true-blue Mumbai girl) and can't wait to visit the city for a longer, more illuminating stay. I'm going to keep an eye out for all his other books."}, {"userName": "Ashish", "userReviewDate": "Sep 27, 2017", "userURL": "http://www.goodreads.com/user/show/33440429-ashish", "userReview": "My first Darlymple book, and a fine introduction to his style of writing. I have never been much of a history buff, it was a chore to get through in school as we don't allow a more storytelling-based approach towards teaching it. The topic of the Mughals is prominently featured in the school curriculum and yet there is so much more to discover. The author creates a beautiful tapestry of stories, places and events, which when juxtaposed with the present creates an exquisite narration. The language is top notch, albeit a tad bit too formal at times. There is a lot of imagery associated with the way he describes the architecture and it requires an active imagination, or a trip to the places, to truly imbibe it. The book showcases and plots the life of the city of Delhi over the ages; its origins and its collapse, its resurgence and its history is all laid bare for us to peer into. The focus is predominantly on the Mughal era which seems to be the author's forte as he tries to recapture and revisit the former glory or atleast what little remains of it. It does provide a keen outsider's relatively unbiased view on how things are, away from traces of jingoism or reveling in the past. There was definitely much more that could have been done with it, especially with the pre Mughal period, but I think it wasn't the author's main interest and it only features in the last 40 pages or so.Overall, a really good book. Would definitely read up on more of the author's works as he makes history interesting."}, {"userName": "Soumen Daschoudhury", "userReviewDate": "Oct 20, 2016", "userURL": "http://www.goodreads.com/user/show/29766292-soumen-daschoudhury", "userReview": "William Dalrymple, in one of his interviews says, “If I had five more lives, I would have lived all of them in India.”I have travelled to Delhi many a times. If you ask a non-Delhiite about the city, though they would awe at the roads and structures, complain about the filth and crowd in some parts of the city, one common thing that they would say is ‘it’s a city of snobs’ and so would I.Delhi – a city like any other city in the world; what’s the fascination attached to it? History, I would say and so says WD; a beguiling city built from a scratch and then destroyed, reduced to a scratch. And built again only to be destroyed again, and again, and again; like a potter’s creation at the wheel, marvelled at for some time and then thrown again to the hearth by the vagarious potter who doesn’t want anyone else to see its beauty.Conquered by the mightiest of conquerors the world has ever seen, Delhi, apart from being their capital of power, was like a beautiful princess that every king or emperor vied for. It held a certain enigmatic love for them; a love, a masculine, salacious consummation that these monarchs couldn’t possibly find in their harems.  WD’s research of the city is absolute. His travelogue extends from the epidermal surface of the current unconcerned multitude of the Delhi people, and excavates to scour layer upon layer of treachery, annihilation, love and power; an era long buried in the city’s abyss. WD talks of the mammoth structures the city hosts, their comparison to facades in the west, their historical bearing and the neglected state that they are in today. The ‘Red Fort’ receives a special mention and righty so; the throne from where was ruled most of India, all of Pakistan and great chunks of Afghanistan during the time of the celebrated Moghul Emperor Shah Jehan. WD writes, it was the apex of Moghul power, the golden age of unparalleled prosperity. The story of Delhi is incomplete without the mention of three important entities; the Moghuls, the Britishers and the bloody partition. Powerful and obstinate rulers like Timur the lame, Muhammed –bin-Tughlaq, Nadir Shah, Shah Alam, Shah Jehan and Aurangzeb, WD says, had their own doctrines, their own laws to abide by, each so different from the other. Some respected the saints, the others abhorred and beheaded them. The city’s story is replete with acts of deceit, treachery, barbarity and incest too. How many people would believe that the great emperor Shah Jehan, who built the Taj Mahal in memory of his wife Mumtaz was salaciously close to his eldest daughter Jahanara Begum. Needless to say, each king had his own harem, decorated and filigreed with the choicest of women. “As you sow, so shall you reap”, probably was quoted of Shah Jehan, an emperor who, though liberal than the others, conquered his place to the throne by killing his brothers and their children and capturing his father. Not surprisingly the barbarous Aurangzeb, one of his neglected sons imprisoned him, killed his own kin and presented to him on the dining table, the lifeless head of his favourite son and successor to the throne Dara Shukoh.WD meets historians, researchers, knowledgeable people, old members or their descendants from that time in history. With the changes in the throne, the language of Delhi has come a long way though the transformation isn’t a pleasant one. From Persian to Urdu, an immaculate language delivering and demanding respect, the language of the poets, the city now has to do with Hindi. Delhi, once was the land of poets like Mir, Jalal-ud-din Rumi, Ghalib and the likes, and the greatest gift to a king would be the latest verses from the great Mir than any jewel or tapestry.While meandering around the streets of Delhi, WD meets some interesting multitude like the eunuchs, the masters of the pigeon fights, the leftover Britishers and their families, now called Anglo Indians, the survivors of partition like his landlady and the driver. The eunuchs, though in the present time are rebuked, they had a stronghold in the days of the emperor; they were a part of the courts, caretakers of the harems. At the Nizam-ud-din mosque, a place thronged by both the rich and the poor, the saints tell WD about the Djinns, their existence since God created man, how they can be captured and used.Delhi, as WD rightly points out, post the India-Pakistan partition is itself divided into two conspicuous parts; old Delhi sporting the remnants of the Moghul era in bits and pieces and New Delhi, a facade of Lutyens’s brilliant architecture and now a house to the Punjabis. India, always has been an easy country to be besieged because of its religious differences. The bloodbath of partition is a horrific tale where entire villages were annihilated, people burnt alive, women raped – a crowd has no face, or rather has the face of a terror. As Dr. Jaffery, a historian tells WD, “In this city, culture and civilization have always been very thin dresses. It doesn’t take much for that dress to be torn off and for what lies beneath to be revealed.” WD’s research is excellent; he presents facets of the city which a tourist would normally miss. If you ever happen to visit the city, sitting on the ramparts of a fort or marvelling the intricate designs of a palace, or being blessed by the saints in one of the mosques, the djinns will most definitely bring to life snippets from this book. And as you relive the glorious incidents of that era, you would shudder at the thought of living under the rule of a monarch.The worst part about reading history is that it’s almost always a biased, colourful story written by sycophants; WD’s travelogue isn’t that, it is unbiased, written without any obligation or pressure."}, {"userName": "Pramod Nair", "userReviewDate": "Jan 26, 2015", "userURL": "http://www.goodreads.com/user/show/37107782-pramod-nair", "userReview": "I was hooked to the works of William Dalrymple from the moment I started reading City Of Djinns. It was in 2004 while browsing through a bookshop that I came across three of the 2004 penguin published Indian editions from the author – ‘City Of Djinns’, ‘The Age of Kali’ and ‘In Xanadu’ and I bought them all. The authors name was slightly familiar from a newspaper article, which I have read a year before about his documentary titled ‘Indian Journeys’ and the news about his then published ‘White Mughals’. Reading City Of Djinns was like reading a fascinating novel and I soon found that it was not a typical travelogue but an enchanting chronicle of the historic city of Delhi. Dalrymple was not just describing to the reader about each sights that comes across him and then moving on to the next destination; he was taking the reader along with him for a captivating journey through location and time inspecting and interacting with key elements and moments from the cities epic history spanning centuries. City Of Djinns is the result of Dalrymple’s encounters during his six-year stay in the capital city of Delhi and the narration is brought alive with an array of fascinating characters like Sufi mystics, philosophers, descendents of the Mogul emperors, a guild of eunuchs, musicians and calligraphers connected to the golden history of the town. The ever curious mind and the always trying to understand what he is seeing nature of the author can be observed in the balanced and open-minded way in which he interacts with these characters; and this gives a wonderful charm to the book. Even the characters that he interact on a daily basis during his stay at Delhi – like his gardner, his landlady, taxi drivers, government officials – are portrayed in the narration with wonderful anecdotes.With meticulous research, Dalrymple creates a stunning dissection of Delhi by showcasing each era of its centuries old history in reverse chronology delving deep into the ancient roots of the city and narrating the centuries of Delhi’s evolution to the reader in vivid clarity. He takes the reader through each decline and resurgence of the city by inspecting the key moments in Delhi’s history like Indira Gandhi’s assassination, the anti-Sikh riots of 1984, the post-independence bureaucratic Delhi, Delhi during the Indian independence & partition, the refugees in Delhi during the partition days, the massacres during the 1857 mutiny, Delhi made by Edwin Lutyens during the British Raj, the glory during Mugal days and even to the epic pasts connected with the Mahabharata and to the origins of the city. He inspects in detail how the past and present co-exist in Delhi by experiencing the social and historic life of both the Old & New Delhi. Dalrymple packs all these stories within a time-frame of a single year – so the title ‘City Of Djinns; A year in Delhi’ and this allows the author to bring the year-around social happenings, the life of its people, and even the climatic conditions of the city in to the narration.It won’t be an exaggeration if I say that as a humble reader who has thoroughly enjoyed this book, reading it felt like I was right there along with Dalrymple during each of his experiences unraveling the epic history and cultural vibrancy of this City. The sights and smells of streets of Delhi are described with such detail and with his supreme control over the narration the author has created a stunning and lively portrait of the soul of Delhi. The narrations are interspersed with illustrations by Olivia Fraser (Dalrymple’s wife). Even though few in number these illustrations are certainly charming."}, {"userName": "Maitrey", "userReviewDate": "May 31, 2013", "userURL": "http://www.goodreads.com/user/show/14247078-maitrey", "userReview": "I came into this book as an unabashed fan of William Dalrymple (WD). I think he's a razor-sharp observer who can write hilariously. Combine this with his love for history, assiduous scholarship and great sympathy and fondness for the subjects he writes about, and we have a winner. He's definitely an oasis in the desert that is Indian-history writing.The City of Djinns trawls through time, peeling away layer by layer the city that is Delhi. Even though the book was written in the late 80s/early 90s, so much about the book is timeless. And I'm not just talking about the sweltering summer heat or the dust that have always made Delhi their home, but apparently even bureaucratic red-tapism had already settled in Delhi in the 14th Century! (according to the Moroccan traveller Ibn Battuta)City of Djinns keeps going back in time, tracing events that according to WD have made an impact on modern Delhi. From the Anti-Sikh riots to Partition to Imperial Delhi's grandiose architecture to cultural fusion that gives some parts of Delhi a Late Mughal-Early British baroque feel, WD brings all of these alive. Not all the time is spent quoting dusty manuscripts however, WD puts his boots on the ground if you. Whether it is tracking down eunuchs, a forgotten people who can be a stand in as a metaphor for the history that stares Delhi-wallahs in the face, yet it's chosen to be ignored; to visits to myriad Sufi shrines, havelis, markets and even shacks inhabited by victims of both the horrific riots that have scarred Delhi. WD even makes trips to Karachi, Shimla, Ajmer and even the Deccan fastness of Daulatabad; and writes extensively about Anglo-Indians (or the British who chose to stay back after Independence) and the unfortunate fog that now shrouds them. Not all is doom and gloom however. We also get to read about the indomitable Mrs. Puri, WD's landlord and Mr. Singh, WD's regular taxi driver who operates from the International Backside Taxi Stand and a host of other Delhi-wallahs who make WD's day. The book rounds of with on Delhi's pre-historic past which some believe to be the mysterious settlements of the Mahabharata.Overall, if you would like read about India, Delhi especially, you'll have to pick up City of Djinns."}, {"userName": "Kislay Verma", "userReviewDate": "Sep 26, 2012", "userURL": "http://www.goodreads.com/user/show/7944915-kislay-verma", "userReview": "From SolomonSays:William Dalrymple's City of Djinns: A year in Delhi is a perfect amalgamation of an informative travel guide, a beautiful retelling of the city's history and a very personal story...Although the book describes just one year of his stay in Delhi, the content has been drawn from the experiences he had over a couple of years. Dalrymple's love and understanding of the city is clearly visible through the myriad stories woven together seamlessly into the narration. He paints such a life-like picture of all the characters that the reader instantly connects to them and basically \"gets\" them. Whether it's his domineering landlady or impetuous taxi driver or lonesome remnants of the British Raj or the secretive fakirs and eunuchs of hidden parts of Delhi - he maintains a pleasantly non-judgmental attitude while interacting with them. One can feel that the author has gone out of his way to understand the people, their perspectives, their history and its impact on them and even the mysticism associated with Delhi that seems to be slowly disappearing. The descriptions of the evolution of culture, literature and religion and politics within the city are particularly noteworthy. There are a couple of things that stand out as one traverses through the pages of City of Djinns. First - the entire account exudes a feeling of impartiality...Secondly, Dalrymple has made serious efforts to unearth the city's past starting from the first inhabitants of the city to the post-independence era. The readers get a chance to know, probably for the first time in popular literature, about the hidden treasures of the Old Fort that date back to centuries ago and give a fresh direction to the talks and theories regarding the authenticity of Mahabharata and Indraprastha.In a nut shell, Dalrymple's City of Djinns is a must read for anyone who wants to learn more about the “whats” and more importantly the “whys” about Delhi and for everyone who has been eternally in love with the city."}, {"userName": "Indrani Sen", "userReviewDate": "Sep 28, 2013", "userURL": "http://www.goodreads.com/user/show/14943717-indrani-sen", "userReview": "I had moved away from this book a few times. It took me a long time getting around to finishing it. I loved it. Loved the way Delhi has been depicted through it's long history backwards. A very very good and interesting read."}, {"userName": "Raghu", "userReviewDate": "Dec 29, 2010", "userURL": "http://www.goodreads.com/user/show/76014-raghu", "userReview": "'City of Djinns: a year in Delhi\" is probably the finest book on the city of Delhi covering mostly its recent history of 400 years. It is lovingly and passionately researched and is embellished with endearing encounters. The author spends a whole year in Delhi in 1989 and researches for four more years to produce this gem of a book. It was of particular interest to me as I lived in Delhi for five years in the mid- 1970s. This book teaches me how little I knew of the city and its history. The author was just 25 years old in 1989 and shows what a scholar and culturally-sensitive person he was, especially coming from as foreign a culture as that of Scotland. He talks about the many Delhis that exist and has existed in the past. He starts out with India's partition and reveals poignantly the chasm between the old Delhi-wallahs and the new Punjabi immigrants after partition. The Urdu-speaking elite - both Hindu and Muslim - who inhabited the city for centuries during the Mughal and British times looked down on the 'boorish, uncultured' Punjabi immigrants. Their memories of Delhi consisted of Mushairas and mehfils (literary evenings) of great Delhi poets, subtlety and perfection in Urdu and the Delhi cuisine. They saw the new Punjabi immigrants as essentially colonizing farmers. On the other side, the Punjabis see the old Delhiites as lazy, indolent, slothful and effeminate. Consequently, the two Delhis never really meet and mingle. In his research on the old Delhi-wallahs, Dalrymple even goes and meets Ahmed Ali, a quintessential old Delhi elite, who ends up in Karachi much against his will as a result of the partition of India. Ahmed Ali tragically spews venom on partition and Pakistan. But he wouldn't set foot in Delhi even when he accidentally lands in Delhi airport. 'I won't put foot on that soil which was sacred to me and has been desecrated' says Ahmed Ali.Dalrymple also reflects deeply on the New Delhi of the architect Lutyens. He says that the Imperial Delhi of Lutyens reminds him of Nuremberg. To quote his brilliant prose, - '...in its monstrous, almost megalomaniac scale, in its perfect symmetry and arrogant presumption, there was a distant but distinct echo of something Fascist or even Nazi about the great acropolis of Imperial Delhi.....Authoritarian regimes tend to leave the most solid souvenirs; art has a strange way of thriving under autocracy. Only the vanity of an Empire - an Empire emancipated from the constraints of democracy, totally self-confident in its own judgement and still, despite everything, assured of its own superiority - could have produced Lutyens' Delhi.\"Dalrymple explores the many Mughal monuments in Delhi and delves into the city's life in Mughal times. As I read on, I realized that much of the Mughal history in India that was taught to me in high-schools was mostly a sanitised and untrue version of reality. The brutalities of Mohammed-bin-Tughlak, the massacres in Delhi at the hands of Nadir Shah and Mohammed Ghori and the unjust rule of Aurangzeb have been spelt out in detail in the book. On reflection, I suppose it is just as well that the truth not be told to young minds in India as it would only contribute to greater chasm between Hindus and Muslims. Perhaps, the incestuous advances of Emperor Shah Jahan towards his daughter Jahanara could have been hinted at in our text books! The book examines the legacy of the many living Sufi legends such as Hazrat Nizamuddin, Khwaja Khizr and Moin-ud-din-Chishti and shows the strength of the syncretic culture of India. The author shows us the diversity of Delhi through his meetings with Unani medicine practitioners, pigeon-fanciers, the eunuchs of the city, traditional calligraphers and other religious healers. The lighter side is seen through his Sikh landlady Mrs.Puri and her husband and Dalrymple's favored taxi-driver Balvinder Singh of the International Backside Taxis!This is at once a travel book, a book on Delhi's history, the diary of an young, erudite man as well as an account of a pilgrimage. It is simply a brilliant work."}, {"userName": "Shadin Pranto", "userReviewDate": "Jun 14, 2017", "userURL": "http://www.goodreads.com/user/show/31495129-shadin-pranto", "userReview": "ড্যালরিম্পল সাহেব সস্ত্রীক একবছর কাটিয়েছিলেন দিল্লি। আশির দশকের শেষের দিকের কথা। সেই সময়ের দিল্লি বনাম অতীতের দিল্লিকে একফ্রেমে আনতে চেয়েছেন উইলিয়াম ড্যালরিম্পল। সাফল্য ব্যর্থতা সমান সমান।পান্ডবদের ইন্দ্রপ্রস্থ থেকে বাহদুর শাহ জাফরের দিল্লি সুদীর্ঘ সময় ইতিহাস, মিথ কিংবা পঞ্চম জর্জের রাজধানী ঘোষণা বনাম ইংরেজ শাসন সবই দিল্লিকে ভিন্নভাবে উপস্থাপন করেছে।স্কটিশ সাহেব ড্যালরিম্পল আসেন আশিরদশকের শেষে।যখন ইন্দিরা নিহত হবার পর দিল্লির শিখরা কচুকাটা হয়েছে। পুরনো দিল্লির শানশওকত এখন অতীতের হা হুতাশ মাত্র। ড্যালরিম্পলের বইয়ের বড় গুণ হল এখানে কাহিনী দুটো সমান্তরাল গতিতে এগিয়েছে। একটি বর্তমানের দিল্লি। যেখানে শিখ ড্রাইভার বলবিন্দর সিং আছে, আছে ড্যালরিম্পলের বাড়িওয়ালি, বাড়িওয়ালা, আছেন পুরাতন দিল্লির এক ফারসি শিক্ষক ও গবেষক। যিনি আবিষ্কার করেছেন, তার মুসলমান সেরা ছাত্রটি এখন বেশ্যার দালালি করে! নতুবা ফারসি পড়ুয়া মুসলমান ছেলেরা দিল্লিতে কোন কাজ না পেয়ে বনেছে ছিচকে চোর নতুবা ডাকাত।দিল্লির সাথে পুরো মোঘল সাম্রাজ্য জড়িত। সেই অতীতকে ধারণ করতে সুলতানি আমল ও দিল্লির অন্যান্য রাজবংশের ইতিহাসকে সামনে এনেছেন ড্যালরিম্পল। আগেই বলেছি স্কটিশ সাহেব ড্যালরিম্পল। তিনি সম্ভবত সাবেক প্রভুজাতের লোক তা ভোলেন নি। তাই বারবার বিশ্রীভাবে আক্রমণ করেছেন ভারতীয় সংস্কৃতিকে। সাধারণ আচরণগুলোকে তিনি ব্যাখা করেছেন আংরেজ দৃষ্টিকোণ থেকে। ড্যালরিম্পলের আরো একটি লেজ বের হয়ে আসে যখন তিনি ব্রিটিশ শাসনের প্রথম দিকের দিল্লি রেসিডেন্টের কথা বলতে গিয়েছেন। ফ্রেজার, মেটাকাফের মতো কোম্পানির কর্তাদের জীবনযাপন তার কাছে হয়ে উঠেছে মহত্তম, রাজকীয়। সেখানে তিনি বর্বরতা খুঁজে পান নি। পেয়েছেন শৌর্য। দেখেছেন প্রশংসার চোখে।খুশবন্ত সিংয়ের \"দিল্লি\" আর ড্যালরিম্পলের আধ্যাত্মিক শহর \"সিটি অব জ্বিনস\" আলাদা তবুও কোথায় যেন মিল আছে। হ্যা, দুটোই দিল্লি নিয়ে আগ্রহ বাড়ায় পাঠকের।"}, {"userName": "Pushkar Srigyan", "userReviewDate": "May 11, 2009", "userURL": "http://www.goodreads.com/user/show/2130454-pushkar-srigyan", "userReview": "First time I find out that reading history can be so interesting . I have never much interest in monuments and parks. But of course the unbiased descriptions of incidents and actual research had made this book very addictive and once you start then you also feel the same way as author feels. Basically william has written in travel book style so you feel the same way as you are also traveling those places . Whenever he finds out a little about anything , we also start filling curious about it and later if he founds someone to talk about that ( I mean any breakthrough) we also became excited to meet him or visit that places . this is the thing that make you seat tight till the last page. Sometimes you envy him like how interesting is all this work .  I have visited few monuments but i never felt anything great about them . But now visiting so many places of Delhi through William's eyes was more insightful. In particular I found few of the incidents very interesting. Especially , meeting with descendants of the historical figures and their reaction about different issues was the most thought provoking part."}, {"userName": "gurpreet kaur", "userReviewDate": "Oct 20, 2012", "userURL": "http://www.goodreads.com/user/show/1391376-gurpreet-kaur", "userReview": "With its rich cultural heritage Delhi has intrigued the interest of many a historian and traveller. William Dalrymple has made an interesting attempt at unravelling the history of this age-old city. A dedicated effort to research and sketch the portrait of a city disjointed in time, a city which has managed to preserve many varied centuries, frozen in time, at different areas. Beginning with recent and familiar events the author goes backwards to the cavernous chambers of myth and legend holding the reader's interest with anecdotes and stories both from the past and present. One feels like visiting the places and monuments mentioned and see them afresh in new light. An absorbing and stimulating read."}, {"userName": "Jenny Brown", "userReviewDate": "Jun 23, 2011", "userURL": "http://www.goodreads.com/user/show/4215702-jenny-brown", "userReview": "I wish there had been more Delhi and less history. The author's scholarship is, as usual, impressive, but the city he is actually living in rarely comes alive as he describes its past in great detail, though at times with what seemed to me to be the introduction of stereotypical people chosen to illustrate points he is trying to make. Indeed, all the of the people he encounters seem like stage characters. Perhaps Dalrymple's youth at the time he wrote this book (he was barely 25) and his own British culture and prejudices kept him from from going deeper and finding the little bits that would have made the people he describes more three dimensional.He has done this much better in his more recent books."}], "description": "Sparkling with irrepressible wit, City of Djinns peels back the layers of Delhi's centuries-old history, revealing an extraordinary array of characters along the way-from eunuchs to descendants of great Moguls. With refreshingly open-minded curiosity, William Dalrymple explores the seven \"dead\" cities of Delhi as well as the eighth city-today's Delhi. Underlying his quest is the legend of the djinns, fire-formed spirits that are said to assure the city's Phoenix-like regeneration no matter how many times it is destroyed. Entertaining, fascinating, and informative, City of Djinns is an irresistible blend of research and adventure.", "title": "City of Djinns: A Year in Delhi", "url": "http://www.goodreads.com/book/show/124430.City_of_Djinns", "average": 4.08, "cover": "https://images.gr-assets.com/books/1327731460l/124430.jpg", "reviews": 633, "authors": [{"url": "https://www.goodreads.com/author/show/60159.William_Dalrymple", "name": "William Dalrymple"}, {"url": "https://www.goodreads.com/author/show/3900279.Olivia_Fraser", "name": "Olivia Fraser"}], "type": ["Cultural", "Travel", "Nonfiction", "History", "Cultural"], "outlinks": ["http://www.goodreads.com/book/show/124430.City_of_Djinns", "http://www.goodreads.com/book/show/6965755-city-of-djinns", "http://www.goodreads.com/book/show/1092988.City_of_Djinns", "http://www.goodreads.com/book/show/13561238-city-of-djinns", "http://www.goodreads.com/book/show/882717.City_of_Djinns", "http://www.goodreads.com/book/show/34140155-city-of-djinns", "http://www.goodreads.com/book/show/124429.The_Last_Mughal", "http://www.goodreads.com/book/show/6943146-nine-lives", "http://www.goodreads.com/book/show/124432.White_Mughals", "http://www.goodreads.com/book/show/124431.In_Xanadu", "http://www.goodreads.com/book/show/186538.The_Age_of_Kali", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}