{"ratings": 236, "userreviews": [{"userName": "Cathy ", "userReviewDate": "Apr 21, 2014", "userURL": "http://www.goodreads.com/user/show/1526945-cathy", "userReview": "This story won the Nebula in 2012 and was nominated for a Hugo in 2013 and a whole list of other honors. She wrote another novella in this universe in 2012 that I'd like to read as well (On a Red Station, Drifting), but I can't rationalize almost $15 for a novella, I'll try to get my library to buy it. The Waiting Stars, a third story in this universe, was published in 2013 and was nominated for a Hugo Award as of the time of this review, among its other honors, which is what made me remember to go back and look this one up. I like the idea of having a universe that an author keeps coming back to in short stories. It makes the magazines or books she's being published in must-buys for her fans. And it's cool the way she seems to be doing it by circling around the universe from different angles as well, so each story remains independent, but it's still more fun for fans if they happen to read more than one of the stories.So with all of the honors I thought I would be blown away. Raised expectations are always tough, especially when reading a whole pack of Hugo nominated stories in one week (which I've been doing). What can I say, it was a good story, pretty solid. I got a clear picture of what she was describing and what the issues were. I'm always really impressed by authors who can clearly convey images in short time frames, be it short stories or graphic novels, it's quite a skill. I always enjoy stories that actually feature women and people of color, that's nice to see. It was good. I'm just not all that sure why it was different from any number of stories that I've read in anthologies. OK, maybe not a large number. But if I'd read it in a book I'm not sure it would have been the one that would have stood out as stellar. I'd have liked it a lot, hoped that it was the beginning of a series for sure, checked out the author's books and thought it was great advertising for her writing. But that's as much because I like stories about Asian cultures than because it had any huge impact on me. And it felt too much like the beginning of something than like something in and of itself. If I hadn't found out before I read this that she'd written other stories in this universe, though not about these people or even this space station, I'd have felt really cheated. As it was I still felt, \"that's it?!\" at the end. The disappointment at the end made me want to knock it down a star. I'm 50/50 about the immersion story, she had an interesting idea about the device and how people would use it for appearances, languages, etc., I'm just not as taken with her culture clash concept and the thought that tall and willowy automatically wins out against short and dark, especially on a space station where headroom is at a premium. I have to bump it back up that star again because of the imagery though, it's all told so simply and yet it's 100% real and clear in my mind. Those women feel real, I can smell the food (definitely that!) the colors, the sounds, all of that is what I'll remember about my first de Bodard story. And that's worth four stars for sure. Even if I'm a little confused about all of those honors."}, {"userName": "Michael", "userReviewDate": "Apr 01, 2014", "userURL": "http://www.goodreads.com/user/show/303327-michael", "userReview": "Holy crap what a story! This is the kind of thing that I have always admired science fiction for - transporting you to a different world in a way that lets you view important issues and ideas from a fresh perspective. It's one of my two favorite kinds of sci-fi stories (the other kind are those that completely f*ck with your head).At just over 5,000 words, this is a brief story, and because of the economy of words and the author's slow reveal of the situation, it was hard to understand just what was being explored at first. But when I got to the end, I suddenly realized how many different angles Ms. de Bodard had been taking simultaneously, and how dead-on so many of her observations had been. It was quite a jolt.Is this one of our possible future worlds? How different is it from ours? Are Agnes' arguments about dominant culture correct? Whatever the answers, this story is a fertile jumping point for discussions about culture, and is a bold critique of some of our own modern flaws. I think Ms. de Bodard deserves props, in particular, for creating a poignant educational metaphor here - along the lines of John Scalzi's Straight White Male setting - but wrapped up in a delicious sci-fi short story. Brilliant!Note: This story can currently be read in its entirety at Clarkesworld Magazine."}, {"userName": "John Wiswell", "userReviewDate": "Jul 19, 2013", "userURL": "http://www.goodreads.com/user/show/147818-john-wiswell", "userReview": "Read for the 2013 Hugo Short Story voting, and my first exposure to Bodard. She made a darned strong impression.\"Immersion\" is an interesting experiment in identity disassociation. It follows a young woman in the future who is surrounded in immerser culture, devices that shroud how we look, sound, etc., in artifices. It has damning undercurrents of peer pressure, inadequacy fears folding in on themselves, and forgetting how you'd feel without everything weighing on you. Its opening is the most effective passage, using second person to take us into the point of view of the woman trying to remember anything about herself for one page. She (in this case, \"you\") doesn't even recognize the room around her or reflection staring at her. It's fascinating, unnerving, and a cracklingly effective introduction to Bodard's future, and from there she switches between sympathetic third and disoriented second person perspectives. This is also the farthest fetched passage, though, because as damaging to self-esteem and identity as immersers can be, that level of schizophrenia is never really reconciled or earned, and there's never a clear expression that it's an outlier reaction or something everyone routinely experiences. Instead it comes across as the brightest color in a rainbow of disassociation, which makes up the soul of the story."}, {"userName": "Jenny (Reading Envy)", "userReviewDate": "Jul 10, 2013", "userURL": "http://www.goodreads.com/user/show/68030-jenny-reading-envy", "userReview": "Nominated for the short story category for both the Nebula and Hugo in 2013, I first discussed what I thought about it in the context of the Nebula nominees for SFF Audio. It is a complex story, full of questions and problems, what is identity, what is living, etc. I'd like to read more of Bodard."}, {"userName": "Rob", "userReviewDate": "Feb 03, 2013", "userURL": "http://www.goodreads.com/user/show/3359801-rob", "userReview": "A few obeservations on Immersion and the theme of cultural dominance can be found here. Spoilers ahead."}, {"userName": "Juan Luis García-Alonso", "userReviewDate": "Nov 12, 2014", "userURL": "http://www.goodreads.com/user/show/18770849-juan-luis-garc-a-alonso", "userReview": "Si ya me gustaba lo que escribía Aliette de Bodard, este relato ya me ha terminado de fascinar. Es como beber un zumo de una fruta tropical con variados matices de sabor, color, textura que varían en tus ojos mientras olores inesperados embriagan tus pupilas y te traslada a un mundo que te parece cotidiano, pero es nuevo. Un estupendísimo relato."}, {"userName": "Megan", "userReviewDate": "Jun 04, 2013", "userURL": "http://www.goodreads.com/user/show/1075526-megan", "userReview": "So as not to spoil, I won't say a lot about the plot of Immersion, but it is a very well-told futuristic story that also deals with race/culture appropriation and societal beauty norms in a fascinatingly original way."}, {"userName": "Jm_oriol", "userReviewDate": "Jan 14, 2013", "userURL": "http://www.goodreads.com/user/show/5750054-jm-oriol", "userReview": "Ninguna de las tres historias me ha impresionado excesivamente, en cambio los ensayos me han gustado mucho más."}, {"userName": "Kira", "userReviewDate": "Aug 03, 2013", "userURL": "http://www.goodreads.com/user/show/13548172-kira", "userReview": "Overall: 4 StarsAn excellent issue with great stories. Even those that aren't exceptional are worth the read.Favorite: \"If The Mountain Comes\" by An OwomoyelaStandout: \"Immersion\" by Aliette de BodardDud: \"Another Word: Assimilation, Multiculturalism, and Me\" by Daniel AbrahamFiction\"Immersion\" by Aliette de Bodard5 StarsA young waitress and a wife of an interacial marriage find an unexpected common ground.Set in her Xuya universe, De Bodard explores globalization, cultural identity, and western-standards of beauty. While a much quieter story than others of her's I've read, she still manages to question the structure of not only sci-fi narratives, but political relations in the world as well. Her experiments with form and voice (such as second person narration here) have paid off in this story, not only putting the reader in the head-space of \"the other,\" but becoming her. I haven't read a story about cultural ideals of beauty this heart-wrenching since The Bluest Eye. This story has won almost every award ever and I understand why.\"If The Mountain Comes\" by An Owomoyela5 StarsA young woman is torn between her father, who militantly controls all the ever decreasing water in the village, and the man who promises to give the village their river back.This story starts off with probably the best first two lines I've ever read:François and Papa were outside, discussing what to do if the water rose. I was in, scrubbing blood from the walls with a palmful of sand.It's beautiful, violent, and descriptive, immediately putting you in the mindset necessary for the story. I loved the religious and nature metaphors the author used to describe the village and the predicament. I loved how there were no simple answers and all the characters had both good and bad motivations. An Owomoyela is definitely an author to look out for.\"You Were She Who Abode\" by E. Catherine Tobler3.5 StarsA war veteran struggles to regain make sense of her shattered memory after suffering a brain injury.This is very much a stream-of-conscious narrative, which was really really hard for me to follow. I think that is party the point - to reflect Cardee's confusion after her injury - but it made the story almost impossible to follow until about halfway through. It was a very emotional, yet hopeful story, showing the costs of war. However, I think the language was a bit too flowery and the stream-of-conscious a bit too chaotic for me to become fully invested. I was too busy trying to figure out what was going on to be emotionally engaged.Non-fiction\"Energizing Futures: How SF Fuels Itself\" by Stephen GaskellNot RatedI'm more of a humanities and social sciences person, so these extreme science articles make my eyes glaze over. I don't think I have the ability to give critical analysis to articles so outside my sphere of knowledge. So I'm just going to not rate very scientific articles in the future. The only argument I could level against this is it isn't very clear for those outside the discipline.\"Neither the Billionaire nor the Tramp: Economics in Speculative Fiction\" by Jeremy L. C. Jones5 StarsAfter taking an economics class in high school, the term makes me shudder. However, I never really thought about how economics affects and drives narratives. Jones interviews many authors who give their opinions and tips on creating economies in sci-fi/fantasy fiction. It's a great companion piece to Owomoyela's and de Bodard's stories. It was very informative and will definitely influence how I interact with media and my own sad pieces of writing from now on.And John C. Wright is a sanctimonious ass.\"Another Word: Assimilation, Multiculturalism, and Me\" by Daniel Abraham2 StarsI'm somewhat confused what the purpose of this article was. I guess a sort of memoir of the author's interactions with multiculturalism. He does bring up some good points (like how multiculturalism both exposes people to other cultures, but ghettoizes those other cultures into the \"other\"), but he never really explores any of those ideas. It seems to be more of a congratulatory patting himself on the back for his progressiveness. His final conclusion is just very naive. Of course there are good books from all cultures, but cultural background shapes reader responses to works. Works that don't fit the Western paradigm of active individualism (such as more passive characters who have things happen to them instead of \"forging their own destiny,\" or importance is placed on community, not individuality) are turned down because they won't appeal to the Western reader. It's a much more complex problem than I believe the author realizes.You can read the full magazine for free here! If you like what you read, support the magazine by buying a copy for your e-reader."}, {"userName": "John", "userReviewDate": "Jan 27, 2013", "userURL": "http://www.goodreads.com/user/show/10592139-john", "userReview": "\"Immersion\" by Aliette de Bodard\nde Bodard writes about a world in which devices known as immersers are used to help Galactics translate native cultures and languages into a form they can interpret. The story is told through the viewpoints of two women who are nearly polar opposites, and I found it an interesting examination of cultural imperialism as much as it was an interesting SFnal concept.\n\"If the Mountain Comes\" by An Owomoyela\nA water farmer and his daughter are the richest folks in a village with a dry riverbed, but someone called Enah comes with a plan to make the river flow again. Predictably, this doesn't sit well with the farmer, and this story is about him and his daughter's reactions. I love the fact that we're not told how the village got to this situation; there are hints through the story that it's not just a poor village, but that the story is actually post-apocalyptic.\n\"You Were She Who Abode\" by E. Catherine Tobler\nA story about someone whose memory is faulty and augmented by a machine designed to help. This story is deliberately very fragmented, as the tale is presented in the way that the protagonist is remembering events. I found it sad, but also confusing; I feel like another viewpoint could have helped ground the disjointed narrative and made it easier to understand what the memories are actually of. As it is, the confusion of the combat zones the protagonist has seen comes across pretty well, though."}, {"userName": "Edward Giordano", "userReviewDate": "Apr 18, 2015", "userURL": "http://www.goodreads.com/user/show/22307497-edward-giordano", "userReview": "I really would probably put this at a 4.5, but I definitely thought it was better than a 4, so I ended putting it at a 5.Aliette introduced us to a tourist colony controlled by a centralized government, that tend to believe differences in different people's cultures boils down to a few algorithms here and there. And then voila. On paper, I totally see what the galactic is thinking. The only main differences you can see are the obvious ones. Language, food choice, behavior patterns, but as this story explores: the one thing it doesn't take into account are the subconscious decisions that make up those actions.Sure, effectively all you may do is blush because of something someone said, but that action could be for an infinite amount of reasons. Are you blushing in anger or nerves, or blushing because you don't want to give off what you really think. The Immersion device is very cool and sounds a bit like looking at the world through an iPad screen. Love the story, definitely worth a read."}, {"userName": "Althea Ann", "userReviewDate": "Jan 08, 2014", "userURL": "http://www.goodreads.com/user/show/3846743-althea-ann", "userReview": "Written well, but I strongly disagree with de Bodard's metaphorical characterization of sophisticated 'galactic' (global) culture as an addictive habit that will take over and destroy 'purer,' 'simpler' cultures. Sure, sure, the 'tourism' device she imagines certainly could have the problems and potentials she mentions, but that's not what she's really talking about. She's talking about 'cultural immersion,' and objecting to (or treating with condescending sympathy) people who choose not to remain 'true' to their 'ancestral culture,' and characterizing them as 'lost souls.' I read the end of the story as an argument in favor of some kind of 'separate but equal' scenario, and an argument that people from different backgrounds literally cannot *think* in the same way and can never truly understand each other. As a believer in shared humanity, and a believer in the ability of creative works (and yes, even our technological devices) to help different peoples understand one another, I find the underlying messages in this story not just wrong, but pernicious."}, {"userName": "Jon", "userReviewDate": "Jul 01, 2013", "userURL": "http://www.goodreads.com/user/show/3445389-jon", "userReview": "I was as disappointed in this as the author's same-universe novelette On a Red Station, Drifting until about halfway through when something \"clicked\" with me. Immersion is set on a (different) space station, and roughly-speaking, is the story of a woman who has taken to wearing an \"immersion device\" in order to fit in with her husband's culture -- the dominant Galactic culture. In telling the story, de Bodard manages to say volumes about the compromises one must make to \"fit in\" with a different culture, and more importantly the limitations in the ways that people attempt to cross cultural lines. All of this without being too heavy-handed with a \"message\".This will probably get my vote over Mono No Aware for the Hugo for Best Short Story."}, {"userName": "Dione Basseri", "userReviewDate": "Dec 05, 2014", "userURL": "http://www.goodreads.com/user/show/13970278-dione-basseri", "userReview": "The problem of language and cultural disconnect is a hard barrier to overcome in business. Even if you are an expert in another culture, you still may not be their ideal of a business partner, and may lose out to local competition. So, in the future, technology exists that allows you to not only speak and act appropriately, but to also project a physical appearance that will be acceptable to your clients. Unfortunately, as with all sci-fi \"perfect\" tech, there are major side effects if you depend too much upon technology, instead of your own wits.This is a meh story, to me. Cohesive, with a good point (changing who you are too much could mean losing yourself entirely), but I just didn't connect. Perhaps those more in tune with the outsider's experience would enjoy this more, but that's not my life, so I can't identify very well. :/"}, {"userName": "Margaret", "userReviewDate": "May 14, 2015", "userURL": "http://www.goodreads.com/user/show/5629372-margaret", "userReview": "A story of addiction set within the framework of cultural relativism. This story is told from two perspectives--Quy, a teenager who works at her family's restaurant on Longevity, and Agnes, a Galatic woman visiting Longevity to celebrate her 5th anniversary. Both stories center on the use of immersers, Galatic technology that gives the user an avatar and tells them what facial cues and wording to use. Certainly a well written story, but most of the characters, except for Quy, fell flat for me. I think the addition of Galen (Agnes' husband) having a voice would've helped. As it is, it feels like the characters are tools instead of people."}, {"userName": "Jeremy Preacher", "userReviewDate": "May 21, 2015", "userURL": "http://www.goodreads.com/user/show/1973239-jeremy-preacher", "userReview": "The best short stories leave me gasping, and this was one of those. \"Immersion\" is an all-too-familiar look at a culture overrun by Western tourists, Western culture, and Western values, with just a touch of externalization to emphasize particular bits. It's short and sharp - it could have gone on quite a bit longer, building a world instead of making a point, but ending it where it does is brilliantly effective.I never quite know what to say about short stories that are so clearly smarter than me, and this one is."}, {"userName": "Michelle", "userReviewDate": "Jun 07, 2013", "userURL": "http://www.goodreads.com/user/show/84077-michelle", "userReview": "just a few short years after typical western TV was introduced to Fiji, a rather significant percentage of the women (especially the young ones) picked up typical western body image depression and eating disorders:http://www.nytimes.com/1999/05/20/wor...this story lays a future tech veneer over the ideas of western cultural dominance, but ultimately, didn't say a whole lot beyond what the current state of things is here and now. it's a solid, but not amazing story."}, {"userName": "Jules Jones", "userReviewDate": "Jan 05, 2014", "userURL": "http://www.goodreads.com/user/show/10074986-jules-jones", "userReview": "A lot of things are stuffed into this short story. Imperialism, whether economic, cultural, or in the recent past nakedly military. Class and money. Identity, and how it ties into the imperialism. The use and abuse of technology. Common themes, but handled deftly, and with a genuine sf slant to them. There's some superb world-building done in a short story word count, and characters whose fate I care about. This one's my pick for the Hugo, although it was a hard choice between this and Ken Liu's story."}, {"userName": "Joe Frazier", "userReviewDate": "Jun 17, 2013", "userURL": "http://www.goodreads.com/user/show/19761596-joe-frazier", "userReview": "Immersion is an exemplary short story by Aliette de Bodard, with beautiful brevity, introduces us to two cultures, a sense of social strata, deals with over reliance on technology, our inability to be at peace with who we are physically and otherwise and our desire to project someone we want to be. In the process, she reminds me why I love short stories. See here for more detail: http://wp.me/p2XCwQ-bb"}, {"userName": "Norman Cook", "userReviewDate": "Jul 28, 2013", "userURL": "http://www.goodreads.com/user/show/4081587-norman-cook", "userReview": "This is a character study of a woman addicted to her virtual-reality immerser, an alien technology that allows people to create avatars to interact with others. The actual plot is fairly superficial but I’m not sure I fully understood how everything fit together, a common complaint I have with stories involving virtual characters. To me, the story is more style than substance—not necessarily a bad thing, just not my cup of tea."}, {"userName": "Juliana Rew", "userReviewDate": "Mar 17, 2015", "userURL": "http://www.goodreads.com/user/show/11514024-juliana-rew", "userReview": "Finely crafted story set at a Rong (Vietnamese) restaurant aboard a galactic space station. The employees wear \"immersers\" to create illusions that make them appear more acceptable to the visiting tourists. de Bodard masterfully mixes tenses and points of view, ultimately showing the effect of the immersers on those who wear them."}, {"userName": "Ben Nash", "userReviewDate": "Jun 26, 2013", "userURL": "http://www.goodreads.com/user/show/11591769-ben-nash", "userReview": "This story seems to be set in the same world as de Bodard's other 2013 Hugo nominee: On A Red Station, Drifting. While a good story about clashing cultures and self-identity, de Bodard doesn't utilize the short form as well as she could. As with Red Station, she's written about a well realized world and makes me want to read more from her."}, {"userName": "Ed", "userReviewDate": "Jun 06, 2013", "userURL": "http://www.goodreads.com/user/show/3937599-ed", "userReview": "Interesting concept especially with Google Glass coming out. Its interesting to contemplate unintended effect we have on those around us which feeds back to their own image of their worth and how people force themselves to be something they are not and opposite of what they are loved for for what they perceive as what people want them to be."}, {"userName": "Sarah", "userReviewDate": "May 31, 2013", "userURL": "http://www.goodreads.com/user/show/3858942-sarah", "userReview": "I enjoyed this story involving colonial politics between Earth and her colonies on the small scale, along with a statement about technological addiction. This definitely should have been longer to explore some of these ideas more fully."}, {"userName": "Stephanie", "userReviewDate": "May 24, 2013", "userURL": "http://www.goodreads.com/user/show/784856-stephanie", "userReview": "Read as part of the Hugo packet 2013.Best short story is going to be a hard category. I was utterly enchanted by this one from the first sentence. I suspect I need to read more of de Bodard's work now."}, {"userName": "Laura", "userReviewDate": "May 29, 2013", "userURL": "http://www.goodreads.com/user/show/4053034-laura", "userReview": "A fascinating tale of local vs colonial/commercial culture and addiction to technology but love and family as well. This story is set in a far future, butits parallels to the present give it meaning and depth."}, {"userName": "A.J.", "userReviewDate": "Jun 27, 2013", "userURL": "http://www.goodreads.com/user/show/3941101-a-j", "userReview": "Read for the 2013 HugosThis was an interesting story that might make more sense if I read it a second time. It took me a while to figure out what was going on. Half of the story is told in 2nd person, and half is told in 3rd. I really enjoyed the way the two halves of the story came together."}, {"userName": "Peter", "userReviewDate": "Jan 21, 2015", "userURL": "http://www.goodreads.com/user/show/1119601-peter", "userReview": "A very fun short story that challenges and respects the reader by not explaining too much. I was particularly impressed by how de Bodard managed to create characters I cared about in such a brief narrative and how well their emotions were shaped."}, {"userName": "Jeff Stockett", "userReviewDate": "Apr 24, 2013", "userURL": "http://www.goodreads.com/user/show/2950483-jeff-stockett", "userReview": "I've been excited about Google releasing their Google Glass to the public next year. This story examines similar technology (although much more advanced) and what happens when we rely on technology too strongly.It was fun."}, {"userName": "Tammy", "userReviewDate": "Mar 22, 2013", "userURL": "http://www.goodreads.com/user/show/122617-tammy", "userReview": "I am a fan of Aliette de Bodard so it's no surprise I'd enjoy this story. This story is about identity and more to the point about identity as a member of a marginalized group. It's very much a political statement and the ending left me thinking. [2013 Hugo Nominee Reading]"}], "description": "FICTION\"Immersion\" by Aliette de Bodard\"If The Mountain Comes\" by An Owomoyela\"You Were She Who Abode\" by E. Catherine ToblerNON-FICTION\"Energizing Futures: How SF Fuels Itself\" by Stephen Gaskell\"Neither the Billionaire nor the Tramp: Economics in Speculative Fiction\" by Jeremy L. C. Jones\"Another Word: Assimilation, Multiculturalism, and Me\" by Daniel Abraham\"Editor's Desk: Clarkesworld by the Numbers\" by Neil Clarke", "title": "Clarkesworld Magazine, Issue 69\n      \n          (Clarkesworld Magazine #69)", "url": "http://www.goodreads.com/book/show/15730445-clarkesworld-magazine-issue-69", "average": 3.92, "cover": "https://images.gr-assets.com/books/1341120709l/15730445.jpg", "reviews": 49, "authors": [{"url": "https://www.goodreads.com/author/show/4005010.Neil_Clarke", "name": "Neil Clarke"}, {"url": "https://www.goodreads.com/author/show/4356849.An_Owomoyela", "name": "An Owomoyela"}, {"url": "https://www.goodreads.com/author/show/2918731.Aliette_de_Bodard", "name": "Aliette de Bodard"}, {"url": "https://www.goodreads.com/author/show/2951127.E_Catherine_Tobler", "name": "E. Catherine Tobler"}, {"url": "https://www.goodreads.com/author/show/2918735.Stephen_Gaskell", "name": "Stephen Gaskell"}, {"url": "https://www.goodreads.com/author/show/3122955.Jeremy_L_C_Jones", "name": "Jeremy L.C. Jones"}, {"url": "https://www.goodreads.com/author/show/13557729.Daniel_Abraham", "name": "Daniel Abraham"}], "type": ["Science Fiction", "Short Stories", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/15730445-clarkesworld-magazine-issue-69", "http://www.goodreads.com/book/show/25020712-clarkesworld-magazine-issue-100", "http://www.goodreads.com/book/show/22725217-clarkesworld-magazine-issue-94", "http://www.goodreads.com/book/show/22142606-clarkesworld-magazine-issue-92", "http://www.goodreads.com/book/show/25084889-clarkesworld-magazine-issue-101", "http://www.goodreads.com/book/show/23882997-clarkesworld-magazine-issue-99"]}