{"ratings": 240, "userreviews": [{"userName": "Rebecca McNutt", "userReviewDate": "Jun 22, 2016", "userURL": "http://www.goodreads.com/user/show/36977686-rebecca-mcnutt", "userReview": "Sometimes YA fiction in the mystery/crime genre can be really dull and the characters can be very immature. Luckily, Cold Case (not to be confused with my favorite TV show on CBS of the same title) was an exception. Emotional, intense, suspenseful and riveting, this story begins as a murder mystery and soon turns out to involve government corruption, nuclear secrets, family drama and good old fashioned detective work."}, {"userName": "Hector Bustos", "userReviewDate": "Oct 21, 2016", "userURL": "http://www.goodreads.com/user/show/59926035-hector-bustos", "userReview": "Imagine a 13-year-old boy finding a dead man's body in his family's restaurant. The genre of this book is mystery. I especially liked this book because of how it leaves the reader with suspense at the end of every chapter.  13- year-old Austin \"Oz\" Keiller spends his Saturday mornings clean the house because of his older brother, Dave. On Saturday he notices that his older brother, Dave is not home he figures he is at his family's restaurant in Santa Fe, New Mexico. Oz leaves the house arrives at Chez Isabelle (The Name of the family's restaurant). Immediately he notices something is wrong. The door at Chez Isabelle is open and there is blood on the kitchen counter. Oz then checks the walk-in refrigerator and finds the dead body of a man named Aaron Sneider. The Police arrives at the scene and take Oz and Dave to the police. Where Oz finds out that his father was accused of selling nuclear secrets to rogue governments. Oz is furious that his family did not tell him about this before. After that Dave is taken into custody and charged with murder. It is now up to Oz to clear his brother's name and crack the case. The 1st person point of view affects the story because if the story was not in 1st person the reader would not be able to relate to the emotions that Oz was felling. One major event that changed the story was that when Oz walked into the walk in refrigerator and found Aaron Sneider's dead body. The narrator (Oz) is a reliable source because he witnessed all these events happen and experienced all of them. A major symbol in the book is Aaron Sneider's dead body because when they police find the body, Dave is taken into custody and charged with murder and it is now up to Oz to clear his brother's name. The Character motivation is his father because Oz is determined to clear his brother's name and find out who his father really was. I was surprised when Oz found Aaron's dead body in the fridge. I was angry about how Oz had found a note in Aaron Sneider's T-Shirt pocket when he and Dave were at the police station and said nothing. The note said, \" D. Keiller Fri night-midnight. Use back door.\" I liked the way the author describes how Oz was feeling at the police station where he finds out who his father was. My Favorite part in the book was when Oz finds out that his father was a scientist selling nuclear secrets to rogue governments. Cold Case was a good title for this book because it re-opens his father's case and Oz tries to solve it before it is too late.  I would rate this book 4 stars out of 5 because it kind didn't make sense that Oz's mother was away on a trip and Oz's and Dave were by themselves with the police and the case and everything and the police never even asked where the parents were. I would recommend this book to my mom because she likes reading Mystery/Suspense books. So, I think this is a good book for her. What would you do if you found a dead body in your fridge? Would you keep it a secret or spill the beans right away? The choice is yours."}, {"userName": "Angie", "userReviewDate": "Oct 07, 2011", "userURL": "http://www.goodreads.com/user/show/837162-angie", "userReview": "I love a good murder mystery, so when I was offered this one for review (THANK YOU) I of course said sure.Things I Liked:1)The relationships around Oz (the main character)--he and his brother Dave, he and his best friend Rusty, he and fellow restaurant employee Razor. They all rang true in terms of how they communicated and got along.2)The history of Los Alamos and descriptions of Santa Fe.3)The descriptions of how a kitchen runs. Not that I cook but still ... it made sense and seemed like it really was a young teen explaining it all.4)Totally doable for a middle grade murder mystery. Enough detail that the kids will be intrigued but not so much that we have to worry about freaking them out. Who knows which houses allow CSI and which don't.Things I Think Will Get Even Better with More Middle Grade Mystery Novels:1)I don't think (wouldn't know for sure, would I?) bad guys explain everything. Mentally going through in my head ... and I just really don't think they do. Will consider more specific examples but the way the final ending plays out was just a little bit contrived.2)The mother is pretty absent and I'm not sure why. Doesn't have to be that way ... even to get Oz over to Rusty's house more often.3)Perhaps narrowing down the suspect pool just a bit. There are a couple characters in the story who's only real job seems to be red herring. A little misdirection is fun. Too much and it starts to wear on the credibility of the story.All in all ... a solid entry. If I could give three point five or even three point seven five I would. Will definitely watch for more from this author. Not a huge fan of the cover (running seemed to be more important to him) but I can see the vibe they were going for. With booktalking I can think of at least a couple fifth graders who will enjoy this one, and definitely sixth or seventh graders. Another reviewer here on Goodreads mentioned they enjoyed this one more than Theodore Boone, Kid Lawyer and I would agree. Was thinking the same thing before I even saw that comment."}, {"userName": "Zaziz3", "userReviewDate": "May 23, 2015", "userURL": "http://www.goodreads.com/user/show/35486803-zaziz3", "userReview": "Thirteen-year-old Oz Keillor wants nothing more but to work at his family's restaurant and become a successful chef someday, but things take an unexpected turn when Oz finds a dead journalist in the kitchen of their restaurant early one Saturday morning, and soon discovers that his brother might have murdered the journalist over an old family vendetta involving his now dead father and some pretty nasty secrets. Shocked at his very own family for keeping such secrets and lying all these years, Oz soon turns to his rebellious friend, Rosy, who can hopefully help him clear the smoke, sort through the lies and figure out who exactly killed this journalist in an attempt to clear his brother's name. Then, as Oz and Rosy soon discover, they must question the trust of their closest friends to clear up the red herrings preventing them from solving the mystery. They learn that even their so-called friends might not be so friendly any longer; Cold Case is about determination, trust and betrayal."}, {"userName": "Phoebe", "userReviewDate": "Nov 19, 2011", "userURL": "http://www.goodreads.com/user/show/2807810-phoebe", "userReview": "Oz and his friend Rusty find themselves in a strange new world when Oz discovers a body in his family's restaurant, and Dave, Oz's brother, is arrested for murder. Oz's mother is in France, and the list of adults Oz can turn to is short. He and Rusty embark upon their own investigation since the police seem to think it's an open and shut case. What connection did the murdered man have with Dave, and with Oz's dad, once a scientist at Los Alamos, uncovered as a spy, and dead before Oz was born? Tangled threads create a convincing and interesting mystery for upper elementary and early junior high readers, and the novel's setting, Santa Fe, is fun for those of us who have spent lots of time there! Thanks for the SJC mention! I hope this author keeps writing."}, {"userName": "Tyler Haney", "userReviewDate": "Nov 21, 2014", "userURL": "http://www.goodreads.com/user/show/34805159-tyler-haney", "userReview": "Restaurants. Not the kind of place you'd find a dead body. But 13-year-old Austin \"Oz\" Keiller finds just that. A dead body in his family's restaurant, Chez Isabelle, in Santa Fe, New Mexico. ***SPOILER ALERT*** He finds a clue that could put his brother, Dave, at #1 on the suspect list: A note saying to meet After going to the police station for an interview, he learns that Dave and mother have kept a terrible secret from him: The fact that his late father was accused of selling rogue governments nuclear secrets about Los Alamos, a secret nuclear base. Also, another clue might show that Dave is the killer: The victim, Aaron Sneider, was writing a book called \"Traitor\" about Oz's dad. Later on, after visiting his brother's lawyer, Archie, (Full name: Archibald McCallister.) he meets up with a friend of Dave's, Razor, and after that, Oz meets up with his best friend, and forensics junkie, Rusty, who, the day before, her parents dragged her to Los Alamos for no-nuke protests. The two friends decide to go to Sneider's room, at the Silver Dollar Motel, to poke around for clues. The only thing they find is an envelope with a picture in it, showing 3 men, Oz's father, and 2 others. However, Oz makes a mistake: The pair brought flashlights, and Oz forgot his at the room. After that, they meet up again, and discuss clues, but this happened after Dave got arrested for killing Aaron Sneider. The big clue that got him arrested was the fact that his personal knife had Dave's fingerprints only on it. To me, this means, if there was another killer, he would've worn gloves to not have his fingerprints on it. While they talked, Oz phoned Jake Whitetower, and tells him his \"name,\" which is Mac Macintosh. During the talk on the phone, to Rusty's dismay, Oz promised an interview.  When Oz arrived at school afterward, everyone was whispering about the Chez Isabelle murder, which made Oz a little paranoid. Oz gets to the library--he's not a regular there, so the librarian gave him a funny look. He made his way to a computer area in the back of the library. Rusty, of course, is there. She has a picture, the one from Sneider's room, opened on the screen, and Oz thinks she's showing it to everyone--but Rusty says they're the only ones there. Rusty apparently made an account on a blog named \"High Altitude\" and posted a comment saying that \"High Altitude\" was looking for the other 2 men in the photo. She tells a comment to Oz--someone commented on it saying that they were alien abductees. After a while, someone comments saying that David Keiller died, but he doesn't know the guy in the middle. He also tells them of \"A.J. Powell,\" who worked with David, had left the lab back in the 1990s. The person who made the comment thinks he's in Santa Fe. Rusty searched public records--and found 4 A.J. Powells. After a while, they possibly find the correct A.J. Powell. When they open the gate, someone yells \"ATAQUE,\" which in Spanish means \"ATTACK.\" A German Shepherd raced after Rusty and Oz. Rusty froze on the spot, looking like she was letting the dog try to kill her. After a while, the same person that said \"ATAQUE\" yells \"BASTA,\" which calms the dog down. The only kind of injury-related pain was inflicted on Rusty, when she had fell on the ground, her arm had a few scratches. The person--the correct A.J. Powell-- tells them the dog's name is Rio. Oz asks if Rusty was okay, who nods. They give him the picture. Of course, he asks where they got it. Oz lies and says they cleaned out some boxes and found it. (Just saying, this is one long book.) After a while, they left, but weren't any closer to figuring out if Dad was innocent or not. From what I've seen on TV shows, the primary sentence (Time in jail.) if your convicted of murder is 95% of the time life without parole. If David was convicted, he could get that much time in jail. On Tuesday, after Oz sleeps at Rusty's house, her dad drives Oz to Water Street, 2 blocks from the plaza. He is still wondering where one of David's friends, I think, Carlos, is. He sees Archie and walks over time him. Archie owns a 1971 vintage Mercedez-Benz 280SL Convertible. Oz and Razor were texting each other in the process. Archie takes Oz to the Santa Fe Correctional Facility. After talking with David, who was being held there, Detective Suarez says 2 people murdered Aaron Sneider--1 kept him pinned down and the other...well, jabbed a knife into him a bunch of times. After he's dead, one hid Aaron's body crudely in the walk-in freezer, the other threw Dave's knife away. After this, he met Harrison Smith. The two talked about--you might not have guessed it, but did--the murder. After the talk, Harrison drops Oz off at Chez Isabelle. At first, he wanted to get there like Sonic the Hedgehog, but now, he sorta didn't. Dave wanted Oz to open the restaurant and keep business running smoothly. Razor comes, and talks with Oz. During the talk, Oz phones Rusty. After they talk, Oz and Razor set up the restaurant. At school on Wednesday, Rusty considers the possibility that the killer, or killers, injured himself on the knife, during the stabbing. After having a Mexican meal afterward, they find out, in the middle of the picture, is the late Victor Martinez. They meet up at his wife's home. Apparently she was acting very rudely, or was ticked off, because they acted a bit rude to Rusty and Oz. They find out later Victor died in a car accident. Also, before they left the wife's home, Archie visits her. When Oz gets home, his door is opened, picked open. Inside, the place is like a tornado just spawned inside his home and was ripped to basic shreds. Afterward, a car literally crashes into the house, injuring Oz, but not badly. Afterward, he goes to Rusty's. Oz explains what happened, while Rusty is trying to treat his wounds. After a talk, he talks to Harrison on the phone. They decide to meet each other on Thursday, at 7:00. Rusty pleads to go, but Oz refuses. After being ticked off about it, Oz leaves on her bike. During the talk with Harrison, Harrison reveals the police are at A.J. Powell's. He barricaded his house and rigged it to blow--and he's holding a young girl hostage. Oz says he has Rusty. All of this. This all...I'm not going to tell you yet. They go to Powell's house. Harrison enters it, and later, 2 gunshots are heard. Oz rushes inside--Powell is dead, a gun near him. Suicide, right? NOT. Harrison killed Powell and faked his suicide. There's now no witnesses but Rio. Afterward, Harrison reveals the biggest shock in the book--***SPOILER ALERT. BIG ONE.***--Harrison killed Sneider. Harrison threatens Oz that if he runs away, he'll kill Oz. However, Oz comes up with a plan--he screams \"ATAQUE\" 2 times, and Rio pounced on Harrison. Rusty wasn't there. Harrison lied all along. The young girl being a hostage? All fiction. Harrison used Rusty as a bait to get Oz to go there. Within minutes, cops swarmed the house's area. Oz escapes the scene, however, he didn't know one thing: Witnesses getting awake from a crime scene itself is a broken law. After Suarez calls him and talks to him about it, he goes to Chez Isabelle. ***NOTE: DON'T READ ON IF YOU DON'T WANNA BE SPOILED.*** Oz goes to Chez Isabelle to look for Rusty. Razor's car was parked there. After a short part, it escalates into something else: a murder(?) Razor orders Oz on the ground and ties his hands with plastic wrap. Then Razor reveals the truth after Oz agrees to comply with him: Razor murdered Sneider. He had acted with Harrison too, but Razor was the only one at the murder. He told Oz why he pinned the murder on Dave: Dave never stopped reminding Razor how much he was better than him, and that \"pinning this on Dave was the only good thing that came out of it. Oz realizes that Razor is going to kill him. Then, the biggest surprise occurs: Soon after Razor pushed Oz to the walk-in freezer, (Where Aaron Sneider's corpse was.) Rusty opens a door and, when she realizes what happens, run off. Later, cops burst straight through the door. Razor was on the ground in an instant and handcuffed. Later, Oz goes to talk with Rusty. Rusty tells Oz what occurred: Because she was angry, she decided to hitch a ride to Los Alamos with her parents. She went to the library there, too. After a short part of it, Rusty explains she went to Chez Isabelle because Oz was always there. After the conversation ends, Dave is released. Oz thought Dad was innocent. Dave thought he was guilty. After a talk, the book ends. Personally, I thought this was a 5 star book. I'd reccomend this to anyone who likes crime books and crime novels."}, {"userName": "Devin Logan", "userReviewDate": "Aug 23, 2013", "userURL": "http://www.goodreads.com/user/show/23083864-devin-logan", "userReview": "Imagine be a 13-yr. old boy, with a life that seems to be normal for what you know. Until you go to the family restaurant early one Saturday morning and are horrified by the sight that you see. The back door light is busted out, the back door is unlocked with no signs of forced entry, and there is such an errie feeling in your body. Then, when you turn on the lights you see something you couldn't have imagined would be there in a million years. Blood! That is what happened to Oz Keiler. He went to go prepare the family rstaurant, Chez Isabelle, for another day of buisness. But when he went to go prep clean he found in the freezer a dead man. Thinking that someone else did the murder, all the clues at the time pointed to his big brother, Dave, the head chef, doing the murder. But determined and relentless, Oz would do anything to find the true murderer.So Oz and his friend, Rusty go all around the Santa Fe area looking for clues and leads that would help them in the murder. Unlike anyone else, Oz and Rusty don't just leave the investigation in the Police's hands, they take it into their own. The two talk to various people trying to find clues and information until one story pops up, Oz's dad. Oz's father's story would lead them to many clues and files about the murder case . They would run into various people and Los ALamos Nuclear PLant files and records. But unlike some, Oz is very curious. He never knew his dad, so he was detrmined to find out if his dad had anything to do with the case.A 13-yr. old boy full of curiosity and smarts goes to every limit and barrier he can to get to the botttom of this murder case. But young Oz would soon find out a lesson about the people in Santa Fe. He would learn that soon enough that \" curiosity kills the cat.\"No one would expect the twist the book would take and the journey it would lead the reader on. But this book can truly teach people to always, always know someone to the fullest before you trust them. Although some would take advantage of young, naive, Oz he would truly outwit them.The author created an amazing book about a curious boy who never gives up on finding the truth! He faces lots of obstacles and plenty of danger but prevails through it all to get to the truth. I believe the book had a greater effect because she put a young, persistent, and unwilling to give up boy as the main charcter. With the young boy as the main charcter you can relate better being in your teen years knowing how much knowledge means to you and how much you want it, so I could see the book from a first-person perspective almost. This is a great book for anyone who enjoys people digging up someone's ghostly past and revealing the whole truth! The author wrote an amazing book in the post Nuclear bomb testing era in the New Mexico area and has a young boy take an amazing adventure to dig up the truth to the ghostly files of Los Alamos and bring out the truth that every reader was so desperate to know about!In my opinion, I give this book a 7/10 !"}, {"userName": "Molly Jo", "userReviewDate": "May 07, 2011", "userURL": "http://www.goodreads.com/user/show/1664364-molly-jo", "userReview": "This book totally took me back to when I was 12 and reading my first mystery novel! Actually, I may have been younger. It was Megan's Island by Willo David Roberts. Ah, the memories. Moving on.Poor Oz! He goes into the family restaurant to get things ready for the night and finds a dead body and a LOT of blood in the freezer. Not exactly conducive to a nice evening. Things rapidly spiral out of control when it looks like Oz's brother had the perfect motive and opportunity. The police also enlighten Oz to the fact that his father was accused of stealing government secrets from the lab he worked at. The rest of his family tried to keep from Oz. When Oz's brother is arrested, it's up to Oz to figure out exactly what's going on and how it's connected to his father's past. He looks up former co-workers and their families to try and pry out more information, hoping to clear his brother's name.Your heart has to go out to Oz. He has more information about the murder than he should, but is scared to death to go to the police. To Oz, the police look like the bad guys and he has no idea who to trust. He does have his best friend, Rusty, though, who I absolutely adore. She's a budding CSI who carries around a crime scene kit at all times. She's a smart little thing. Smart ass, too. It's up to Rusty to help Oz keep things in perspective at times, even though he's not completely inclined to listen to her advice. Typical boy.There wasn't anything that seemed grossly far-fetched in the book. Any investigation the kids did was within their abilities, and the consequences were realistic. Julia Platt Leonard did a wonderful job expressing Oz's fear about what was going to happen to his family and the business.The emotions are true and raw. I even got pretty caught up in the tension of the conclusion. I would definitely recommend this one to any young teens or pre-teens. Very nice who-dun-it read with a conclusion that will probably knock their little pants off."}, {"userName": "Aditya Jha", "userReviewDate": "Mar 14, 2014", "userURL": "http://www.goodreads.com/user/show/28237586-aditya-jha", "userReview": "The book is about a murder of a newspaper writer that happens at a boys family restaurant. Oz who is the boy gets his brother taken away by the police because they think that he committed the crime. Oz goes to his mom's lawyer to find out what is going on. Oz does the investigation by himself and finds out that someone who worked with his dad (the dad was pronounced a traitor after some files got out of the nuclear plant that he worked in, but it was a lie the man who did the murder leaked the files)and the prep cook at the restaurant killed the newspaper writer because the cook was tired of being lower than Oz's brother and the other guy was scared that the newspaper writer would find out too much so they killed the man and tried to frame Oz's brother. At the end they both go to jail and the restaurant opens again. One quote is \"He'd just told us he didn't have a phone, hadn't he\"? This shows that people will lie when they are stressful situations. This ties to the quote when people lie they get into more stressful situations than before because the man who said this quote dies at the end of the book. Another quote is \"And for the first time in my life, I was completely alone\". This shows that Oz was never alone in his life until this murder and it ties to the theme people can never be alone or they will not live life the way it is meant to be lived because if they don't have anyone to talk to then they will have no meaning in life just like Oz in this part of the book."}, {"userName": "Tammy Dahle", "userReviewDate": "Aug 31, 2011", "userURL": "http://www.goodreads.com/user/show/2612859-tammy-dahle", "userReview": "My thoughts: Finding a dead body in a walk in freezer is not a good way to start the day. But things go from bad to worse when Oz's big brother and head chef is accused of murder and thrown in jail. Suddenly it's up to Oz to get to the bottom of the crime and fast because police are starting to look at him as a possible accomplice. Cold Case is a sharp, engaging, detective mystery perfect for middle school readers, as well as older readers. Main character Oz feels like the real deal as he struggles with a complicated family history, frustrations with his older brother and fear that his mom may lose their family business. He was easy to root for as the story took some unexpected twists and turns as the plot thickened and the list of suspects grew. I enjoyed that the story was from Oz's point of view but the other characters were also interesting-his best friend Rusty added a touch of humor and excitement to the story. I would definitely follow Oz on another adventure if he ever stumbles upon a dead body again! For some fun facts about Cold Case and Oz visit Julia Platt Leonard's blog. I also discovered a fun interview Julia did with Hope's Bookshelf. Go check it out. I would like to thank author Julia Platt Leonard for giving me the opportunity to read and review Cold Case. I will be donating this book to my local Middle School Library where I have no doubt kids will enjoy it!"}, {"userName": "Kailee", "userReviewDate": "Apr 25, 2013", "userURL": "http://www.goodreads.com/user/show/12042611-kailee", "userReview": "The book Cold Case by Julia Leonard was very interesting. I enjoy reading this book. I was on the edge of my seat every page. The book follows Oz, who is the main character, on his adventure. Oz goes into work at his families restaurant early one morning, when he discovers more than he was looking for. I don’t want to give too much away, so I am not going to say much. When he arrives to work he discovers blood on the counters, he follows the blood to their walk-in fridge where there is a dead man. Before calling the police he finds a note on the dead man and the note is from he brother telling the victim to meet him at midnight. Oz does not tell the police about the note, because he is afraid that they will suspect his brother. He knows that his brother has been acting weird and did not come home the night before. At the police station he finds out the truth about his dead father, who is a suspected terrorist. This is also when he discovered that the victim, is reporter who wrote a story on his father. He turns to a friend to help him find the truth, until he gets to deep. This may the second best book I have ever read (next to Found, of course). Although there were some parts which I could predict what was going to happened, there were also parts that I tried to predict what happens, but failed. I most definitely would read it again."}, {"userName": "Selena", "userReviewDate": "Jan 10, 2016", "userURL": "http://www.goodreads.com/user/show/33667723-selena", "userReview": "I liked this novel. It was very good. While it is all of these things, it is not one of my favorite mystery novels. The characters were all good. They each had their own underlying secrets and there was some twists and turns with characters that you didn't expect. I believe that the theme of this novel was it is always someone you don't expect. I thought it was one person but in the end it was someone you thought was your friend. The plot of the novel was very intricate. There was a lot of underlying reasons why this and this happened. You never would guess that the next thing that happened would happen. The point of view was from the same person the whole novel. The settings were the same. They changed but some settings were used more than others. The main conflict of the novel was that you were trying to figure out who killed the guy. This was the main focus in the whole novel. Overall it was a good novel and had all the elements of a good mystery."}, {"userName": "Alexina", "userReviewDate": "Jul 29, 2016", "userURL": "http://www.goodreads.com/user/show/11051808-alexina", "userReview": "Summary: It’s just another Saturday morning in Santa Fe when Austin “Oz” Keiller walks into his family’s restaurant to prepare for the day. He immediately notices that things are amiss in the restaurant. Perhaps it’s the fact that the door is unlocked, or the place smells like rust or bleach, or, maybe...it’s the frozen dead man in the freezer! Oz’s older brother, Dave, immediately becomes the prime suspect and is charged with murder. It’s up to Oz and his best friend, Rusty, to figure out exactly what has happened before Dave spends the rest of his life behind bars.Thoughts: I enjoyed this book mainly because it left me in suspense at the end of every chapter, which also helped the plot move along. The only reason I didn't like it was because I knew who the killer was since the second or third chapter THOUGH I am happy that I was still surprised at the end by the unseen twist.Overall, it will be an easy read for my students but I think they will enjoy it."}, {"userName": "Diana Renn", "userReviewDate": "Sep 07, 2011", "userURL": "http://www.goodreads.com/user/show/868657-diana-renn", "userReview": "This mystery has all great ingredients: a Sante Fe setting, a family restaurant, and a boy (named Oz) who stumbles into a mystery when he finds a dead body in the restaurant's freezer. The situation worsens for Oz when his brother becomes the prime suspect. The plot is complex, with many twists and turns, as well as a subplot mystery about Oz's late father and his role in a Los Alamos lab years ago. I could not figure out who committed the crime until the very end, but I was always intrigued, as Julia does an excellent job of pacing her story and revealing one fascinating clue after another. While technically for middle grade readers, this mystery could certainly be enjoyed by young adult and adult readers as well. In his determination to solve the mystery (and clear his brother's name), Oz finds himself in some pretty harrowing situations that will get anyone's heart racing. I'm definitely looking forward to more books by Julia Platt Leonard!"}, {"userName": "Mrslabraden", "userReviewDate": "Mar 25, 2016", "userURL": "http://www.goodreads.com/user/show/54099824-mrslabraden", "userReview": "Cold Case is a good middle grades mystery about 13 year old Oz whose brother has been charged with killing the man who wrote a newspaper article about their father accusing him of being a traitor and selling nuclear secrets to other countries. While Oz's mother is away helping her own mother who has had a stroke, it is left to Oz to figure out who killed the newspaper reporter and how his death connects to the accusations involving his father. Oz enlists the help of his best friend, Rusty, who is a fan of forensic cop television shows. She brings her interest in forensics to the case as they begin to investigate other suspects who might have had reason to kill the reporter. Overall this was a pretty good mystery that had enough twists and turns to keep me guessing right up until the end."}, {"userName": "Klee", "userReviewDate": "May 05, 2011", "userURL": "http://www.goodreads.com/user/show/4889114-klee", "userReview": "Despite the lackluster cover and title, I found this kid oriented mystery a better read than Grisham's \"Theodore Boone, Kid Lawyer,\" geared to the same age range. As a relentless reader of adult mysteries, I have to adjust my expectations when reading this genre for kids and teens and not judge them against the plotting and characterization of a Ruth Rendell. This book held up the whodunit aspect for longer than most and gave a decent feel for the city of Santa Fe. There is just enough history of Los Alamos to pique a young reader's interest and it helps that the information is also new to our main charachter Oz. Also refreshing to have realistically flawed family members and relationships, again, unlike the Mayberry-esque setting and parental situtation in Theodore Boone."}, {"userName": "Tracey", "userReviewDate": "Nov 23, 2011", "userURL": "http://www.goodreads.com/user/show/5858840-tracey", "userReview": "This novel is very much like Grisham's Theodore Boone:Kid Lawyer books. For an adult, solving the crime is not a tough task - the foreshadowing is laid on pretty thick. However, I can see how a young reader would enjoy the story. The protagonist is 13 years old and so I would imagine that someone of that age reading this book would enjoy how smart and brave Oz and Rusty are. I like that Rusty is a female and that she is more of the CSI brains of the operation. I find it odd that the parents are always absent in these kinds of novels though...really? You are off in France and can't get back more quickly?"}, {"userName": "Riley", "userReviewDate": "Jan 13, 2012", "userURL": "http://www.goodreads.com/user/show/4601954-riley", "userReview": "This book is about a boy named Oz Keiller. One day he walks into his restaurant to find a dead body in the freezer. The police start looking into the murder, and find Oz's brother Dave, to be a prime suspect. Oz learns that the victim was a reporter who wrote an article accusing his dad stealing nuclear secrets.Oz then works with his friend Rusty to try to prove Dave innocent. In the process of doing this Oz almost gets killed, and learns a lot about his father. The ending is very surprising, because it ends up being one of Oz's coworkers and a politician. Both try to harm and kill Oz, but end up getting arrested."}, {"userName": "Brian M.", "userReviewDate": "Nov 12, 2015", "userURL": "http://www.goodreads.com/user/show/46537976-brian-m", "userReview": "In the novel, Cold Case by Julia Platt Leonard, a family who runs a local restaurant in Santa Fe called Chez Isabelle is in jeopardy of losing it all after 13 year old Oz Keiller finds a dead body in the back of the restaurant. The police arrive and Oz is stuck in a slippery situation. Dave, Oz’s older brother is the prime suspect in the murder investigation. Then, Oz sets out on a quest to find the real murderer. This novel was a thrilling chase when in reality, the truth was right in front of their eyes. This book was a thrilling page turner. I would recommend this novel to anyone who likes mysteries."}, {"userName": "Christian Roberts", "userReviewDate": "May 21, 2013", "userURL": "http://www.goodreads.com/user/show/20533630-christian-roberts", "userReview": "Cold Case by Julia Platt Lenard is a book set in present day Santé Fe, New Mexico. It is about 13 year old Oz who needs to clear a case about his brother who is charged with murder. Oz also must find out more about his dads death also. The murderer will stop at nothing to make sure he is not suspected. Will Oz succeed? Read and find out. I rate this book a 4.5 out of 5 stars. It is a very descriptive book. It gets very good near the end and picks up the pace. It needs a little more action in the beginning but it is a great book. If you want to find out more open up Cold Case."}, {"userName": "Steven M", "userReviewDate": "Nov 12, 2015", "userURL": "http://www.goodreads.com/user/show/46539914-steven-m", "userReview": "This is a great mystery book that I would recommend to anyone who love reading mysteries, suspense, or adventure books. This book is about a boy named Oz Keillor who finds a body in the walk-in freezer at his family’s restaurant. What I liked about this book is that the murderer was someone unexpected. All the characters developed a lot as well. However, there are just too many suspects. Too many characters were made just to be a suspect. In addition, the character made to be a suspect don’t make the story as interesting anymore. Overall, it’s a great book."}, {"userName": "Boyd", "userReviewDate": "Jan 13, 2013", "userURL": "http://www.goodreads.com/user/show/7335066-boyd", "userReview": "A murder mystery set in Santa Fe, New Mexico. Young Oz Keillor finds a dead man in the kitchen of his family's restaurant. Is older brother is arrested for the crime. Oz is certain he is innocent, can he and his best friend Rusty learn the truth in time to save his brother. I enjoyed this book but felt many similarities to the Theodore Boone series and there was some predictability in the ending."}, {"userName": "Devin Logan", "userReviewDate": "Aug 21, 2013", "userURL": "http://www.goodreads.com/user/show/23099062-devin-logan", "userReview": "I personally enjoyed this book a lot! The author uses a curious teen as the main character,Oz, and through him and his adventures we see how far and how many barriers and limits someone will go through and break to reach the truth. Oz has been given such an image about his dad, whom he never knew and he is determined to find out the truth about his dad. S he and his friend, Rusty go throughout Santa Fe searching for clues and answers to the sudden events that had occurred. Un"}, {"userName": "Dolores", "userReviewDate": "Sep 26, 2012", "userURL": "http://www.goodreads.com/user/show/1644281-dolores", "userReview": "It took me a really long time to get into this book, but I did end up enjoying it. Mysteries are pretty scare for young adults, and this is a pretty decent one. And a murder mystery, at that. I thought the \"whodunnit\" was pretty obvious, although I'm not sure teens would feel the same way. It felt very odd that Oz was so alone in the world, I guess that added to his sense of urgency in solving the crime."}, {"userName": "Annabeth Paige", "userReviewDate": "Sep 14, 2012", "userURL": "http://www.goodreads.com/user/show/12832942-annabeth-paige", "userReview": "I think that this a really good murder mystery I've read. You really have to think if you want to figure who did committed the crime. In this book it turns out to by someone I didn't even think it would by so it really surprised me. It really keep keep you on your toes with a bunch of action of trying to figure who did it. With two mysteries in one this is one good book."}, {"userName": "Amy", "userReviewDate": "Aug 20, 2011", "userURL": "http://www.goodreads.com/user/show/234973-amy", "userReview": "A book with a murder, some mystery from the past,and a kid searching for the truth about his Dad. I found the plot a bit slow and I have a hard time with books where the bad guy (who I guessed very early on) actually sits there before killing his intended victim and explains how he did the deed. It just didn't ring true to me."}, {"userName": "Evelyn", "userReviewDate": "Aug 19, 2014", "userURL": "http://www.goodreads.com/user/show/32153084-evelyn", "userReview": "I think that this book was a really good mystery and who was the killer and helper surprised me because i could not tell. I would recommend this book to anyone who likes mystery and adventure because of all the stuff they do."}, {"userName": "Karen", "userReviewDate": "Oct 30, 2011", "userURL": "http://www.goodreads.com/user/show/5998408-karen", "userReview": "Excellent Mystery read! Likeable characters with a little history mixed in. Main characters are male and female. This story allows a young thirteen year old to take control of a situation. This will make a great book report book."}, {"userName": "Lauren Welty", "userReviewDate": "Sep 06, 2013", "userURL": "http://www.goodreads.com/user/show/23084143-lauren-welty", "userReview": "I didn't really like this book. I sort of lost interest through the middle of it. The beginning was okay. It just didn't make sense to me through out some of it. I felt like i re-read too many things. I didn't understand it at all."}, {"userName": "Margo Dill", "userReviewDate": "Aug 31, 2011", "userURL": "http://www.goodreads.com/user/show/3097021-margo-dill", "userReview": "This is a great adventure book for kids. It's a crime drama (CSI, THE MENTALIST, THE CLOSER, etc) for middle-grade readers. They will love it!"}], "description": "When 13-year-old Oz Keillor finds a dead body in his family restaurant, he is soon caught up in a mystery where the stakes are high. His older brother is the prime suspect, and Oz quickly finds out that the murder may be tied to the death of their father years earlier, who was accused of selling nuclear secrets to rouge governments. With the fate of his family in balance, it's up to Oz to try and crack the case, with the help of his best friend, Rusty. It's a quest that has more twists and turns than the dusty roads of New Mexico--with the answer being closer to home than Oz ever could have imagined.", "title": "Cold Case", "url": "http://www.goodreads.com/book/show/9466338-cold-case", "average": 3.81, "cover": "https://images.gr-assets.com/books/1347241635l/9466338.jpg", "reviews": 54, "authors": [{"url": "https://www.goodreads.com/author/show/4398287.Julia_Platt_Leonard", "name": "Julia Platt Leonard"}], "type": ["Mystery", "Young Adult", "Adventure", "Young Adult", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/9466338-cold-case", "http://www.goodreads.com/book/show/12678670-cold-case", "http://www.goodreads.com/book/show/11176236-cold-case", "http://www.goodreads.com/book/show/37581710-the-company-of-demons", "http://www.goodreads.com/book/show/40024832-empire-of-sin", "http://www.goodreads.com/book/show/8343548-the-bricklayer", "http://www.goodreads.com/book/show/40193155-among-the-wicked", "http://www.goodreads.com/book/show/23818400-the-snow-garden", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/23157833-almost-dead", "http://www.goodreads.com/book/show/33555347-crime-scene", "http://www.goodreads.com/book/show/30249521-fatal-frost", "http://www.goodreads.com/book/show/40266676-remains-of-innocence", "http://www.goodreads.com/book/show/34330657-finding-claire-fletcher", "http://www.goodreads.com/book/show/28824403-outfoxed", "http://www.goodreads.com/book/show/23957469-huntress-moon", "http://www.goodreads.com/book/show/40204087-the-deepest-secret", "http://www.goodreads.com/book/show/35115882-what-the-dead-know", "http://www.goodreads.com/book/show/40267317-ragdoll", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/39791173-the-girl-before", "http://www.goodreads.com/book/show/40205081-last-witness", "http://www.goodreads.com/book/show/40205040-dead-weight", "http://www.goodreads.com/book/show/18903409-weekend-warriors", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/40193809-eye-for-an-eye", "http://www.goodreads.com/book/show/35005051-the-forgotten-girls", "http://www.goodreads.com/book/show/27239265-the-short-drop", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/17623604-you-only-live-twice", "http://www.goodreads.com/book/show/17377392-thunderball", "http://www.goodreads.com/book/show/17284593-casino-royale", "http://www.goodreads.com/book/show/17623578-for-your-eyes-only", "http://www.goodreads.com/book/show/17304110-live-and-let-die", "http://www.goodreads.com/book/show/18780375-dr-no", "http://www.goodreads.com/book/show/17379070-moonraker", "http://www.goodreads.com/book/show/18799804-diamonds-are-forever", "http://www.goodreads.com/book/show/40205231-the-spy-who-loved-me", "http://www.goodreads.com/book/show/17377384-from-russia-with-love", "http://www.goodreads.com/book/show/40243961-the-cape-refuge-collection"]}