{"ratings": 9534, "userreviews": [{"userName": "Joe Valdez", "userReviewDate": "Jul 30, 2017", "userURL": "http://www.goodreads.com/user/show/26876584-joe-valdez", "userReview": "[the Forsythes are dead (hide spoiler)]"}, {"userName": "Christopher", "userReviewDate": "Sep 08, 2014", "userURL": "http://www.goodreads.com/user/show/5745485-christopher", "userReview": "There are two ways to read the Lonesome Dove series, and they're analogous to the ways you can watch Star Wars. You can start with the first produced, which fall in the middle of the story chronologically, then read/watch to the end of the story, then loop back around and meet back in the middle. That's the way I chose to go. Or you can read/watch from the beginning of the story straight through to the end. (Star Wars: no way! Lonesome Dove: as you can see later on, this is close to the way to go.)Order by Publication DateLonesome Dove (1985)Streets of Laredo (1993)Dead Man's Walk (1995)Comanche Moon (1997)Chronological OrderDead Man's WalkComanche MoonLonesome DoveStreets of LaredoSo this is the end of the line for me. No more Gus, no more Call. No more Deets or Pea Eye or Buffalo Hump or Blue Duck or any of the other characters with bizarre names.I say all this because this would certainly be a different review if this was only the second book I read in the series. If I was only halfway through, I'd be pumped up to read the rest of the series. I wouldn't be able to wait to find what other picaresqueties the boys would ramble into.As it is, though, this was a real let down of a finale. It went out with a whimper rather than a kaboom. Throughout the novel our heroes' plans are constantly foiled. They really didn't do much at all, besides ride out into the desert, either discover that their quest had been resolved by someone else or get so thirsty that they have to return to home base.It's frustrating as a reader, because I've spent a lot of time with these dudes. I wanted to remember them as heroic, looming figures. This book did not present them as such. And that's probably the point. McMurtry rarely gives the reader what she wants. He stands second only to George RR Martin, slayer of people you love, in being able to create characters that feel real, and then spilling their brains out over the ground at the least expected moment. McMurtry is also a great writer of Westerns because he knows that the heroes of his books are not truly heroes. Call and Gus are as flawed as anyone I've ever known. While you root for them, McMurtry's always making you keep in the back of your mind that these guys are pretty much taking part in a genocide. Their job is to suppress the \"savages\". That's not to say that the Indians are the good guys, either, but much of this book, even more than the others, is dedicated to the perspective of the Indian characters.So it's safe to say that I'm ambivalent about this book. On the one hand, it did not give me the closure I wanted for a series end. On the other, it was a worthy continuation of McMurtry's bloody Western saga. In light of this, I propose a new reading order for the books. Lonesome Dove is still the obvious starting point. It's the best and if you're only going to read one of them, it has to be this one. Then go back to the chronological beginning and read Dead Man's Walk, then Comanche Moon. Then go to the chronological end and read Streets of Laredo. It's good stuff, and a more fitting endpoint. My Recommended Reading OrderLonesome DoveDead Man's WalkComanche MoonStreets of Laredo"}, {"userName": "Megan Baxter", "userReviewDate": "Sep 26, 2012", "userURL": "http://www.goodreads.com/user/show/5742086-megan-baxter", "userReview": "In Comanche Moon, Larry McMurtry has a deep sense of his characters and what they might do at any given moment. This often leads to scenes that ring true for the characters, but don't advance the narrative, or, indeed, subvert the narrative drive. This sprawling novel is not one of plot. It is one of detail, and character-driven meandering.Note: The rest of this review has been withdrawn due to the changes in Goodreads policy and enforcement. You can read why I came to this decision here.In the meantime, you can read the entire review at Smorgasbook"}, {"userName": "Nate", "userReviewDate": "Mar 23, 2015", "userURL": "http://www.goodreads.com/user/show/6803829-nate", "userReview": "This is chronologically the second book and that’s how I’m going through them, even though he seems to have written them in a relatively confusing order (I know Lonesome Dove was the first, but I have no idea what came when after that.) I definitely liked it more than Dead Man’s Walk! I think it has to do with the fact that we get a little more time to settle into the characters and also get a little bit of town living, whereas the first one was just Gus and Call trekking through a violent, harsh wasteland for 400 or whatever pages. Don’t get me wrong, there’s still a metric fuckton of walking and dying in the desert this book, but it’s relieved by scenes in Austin and even Lonesome Dove’s first appearance in the series.I really have no idea what the plot of this one was. It’s more like a few shorter novels about the same characters packed into one big book. Most of it consists of Gus and Call in their time as Texas Rangers patrolling the Comancheria in the pursuit of the same few dudes (Kicking Wolf and the mighty Buffalo Hump and his shithead son Blue Duck, all from Dead Man’s Walk and the new baddie Ahumado.) Joining them are a few familiar characters including Deets, Pea Eye Parker and Long Bill Coleman. This sounds kinda boring on paper but when the characters are as lovingly rendered as these are and when some horribly violent shit could befall anyone at any them it keeps the pages turning...which is necessary with a book with 800 pages.I should really say that horribly violent shit could befall them or they could perpetrate it. One of the major themes that McMurtry is pushing is the plain hardness of this time and place. On one end of the spectrum you have guys like Ahumado who have personal flayers that do all kinds of horrid shit to people and on the other you have the clear and inarguable good guys Gus and Call, who lead ranger troops that kill women and children. (Okay that part was clearly an accident but it’s not like they noticeably felt bad or gave a shit, they were just like “Whoops, gotta go kill Blue Duck!”) Tragedy is common and a lot of the time not even that big of a deal. As much dramatic stuff happens in these books you could never call it melodrama because it’s everyday life. Speaking of melodrama, I really quickly just wanna give the shoutout to Inish and Inez Scull as the legendary-and-legendarily-dysfunctional power couple of this series.So I’m finally up to the big one, the original and the legend; Lonesome Dove. Thing is, I kinda just wanna skip to Streets of Laredo because I’ve seen the miniseries with Robert Duvall and Tommy Lee Jones probably fifty times. It’d be one thing if it was like three or four hundred pages but that motherfucker looks longer than this one and I already have a billion brick-size historical novels I wanna read. Anyways, I happily recommend this series to people with an interest in old west fiction, but I just gotta warn you to clear your calendars because the pace of these books can be about five miles above glacial at points. You really have to enjoy the setting and the characters and spending time with them."}, {"userName": "Carol Storm", "userReviewDate": "Feb 25, 2011", "userURL": "http://www.goodreads.com/user/show/5032322-carol-storm", "userReview": "Given that this book is the final volume in the LONESOME DOVE series, (the last one written, but second in the series time line) I was surprised at just how enjoyable and poignant it really was. Where to begin?Buffalo Hump, Buffalo Hump, Buffalo Hump! This magnificent warrior is not only a devastating action hero in dozens of scorching battle scenes, he's also a tragic hero worthy of Shakespeare. Just like Shakespeare's kings, the last great Comanche chief is surrounded by legend and mystery. Like Richard III, he has a humped back which is both sinister and a sign of supernatural powers. Eerie prophecies surround him. Just as Macbeth can never be defeated till Birnam wood comes to Dunsinane, Buffalo Hump can only be killed when his mighty hump is pierced. And just like Gloucester in KING LEAR, Buffalo Hump's doom is spelled out in the form of a bastard son -- the result of a sinful past he can never escape. Or as Blue Duck puts it at the end, \"the gods are just, and of our pleasant vices make means to plague us.\"The Comanche side of the story was worth the price of the book alone. The father-son conflict between Buffalo Hump and his son Blue Duck is literally Shakespearean, with enormous intensity and passion. As the son of a Mexican woman Buffalo Hump brutally raped, Blue Duck is a symbol of tragic retribution, and the destruction he brings on Buffalo Hump is chilling and inevitable.But Blue Duck is more than just a bad son like Edmund in KING LEAR. He is also a symbol of change. As hateful as he can be, Blue Duck does what no other Comanche warrior in this series does. He sees the destruction of his people as an opportunity rather than a catastrophe. Instead of refusing to adapt and giving in to suicidal despair, (like his father, and Three Birds, and Idahi) Blue Duck actually adjusts to changing conditions. He fights better with pistols and rifles than with the bow or the lance, and he leads an army of white drifters rather than native warriors. Blue Duck's story is almost frighteningly intense. He grows from a boastful adolescent to a proven warrior to a terrifying menace, losing his humanity by such small degrees that he isn't even aware of it. On the other hand, the story of the Texans is not told so well. Captain Scull and his sexy wife Inez are both annoying cartoon characters in the book, and McMurtry dances around the issue of slavery without ever confronting it directly. Making Inez Scull crazy and vicious is a way of subverting the myth of the angelic southern belle without really challenging it. And it also takes all the guilt off of Gus and Jake for their whoring around, as if somehow her vileness cancels out theirs. I didn't buy it. A lot. But I was rooting for Buffalo Hump and Blue Duck anyway, along with their friends Idahi, Three Birds, and Kicking Wolf. Those guys are the heart of COMANCHE MOON. And that's the way it should be!"}, {"userName": "Tyler", "userReviewDate": "Mar 12, 2012", "userURL": "http://www.goodreads.com/user/show/141327-tyler", "userReview": "By far the best of the Lonesome Dove sequels, and, for the first 2/3rds, the most purely exciting McMurtry novel I've read. It's a very typical McMurtry book, too, circling in on many of those same themes and character types that pop up in much of his fiction and nonfiction: meaningless, unromantic sex in the arid desolation of Texas; the fundamental inability of many men and women to understand each other, despite each being inherently sensible; the closing, or taming, of the American West; Maggie Tilton, seen here for the first time as a full-bodied character, as a kind of version of The Last Picture Show's Ruth Popper, one hundred years earlier in time. In addition, there are some great supporting characters, particulary the insane East Coast/Old South transplants Inish and Inez (Dolly) Scull; I'd call Inish's storyline, with the on-foot trek to Mexico to retrieve his stolen horse and subsequent crazy-ass survival narrative, the best B-plot in the series."}, {"userName": "Dan Secor", "userReviewDate": "Jan 04, 2009", "userURL": "http://www.goodreads.com/user/show/1121196-dan-secor", "userReview": "The second in the famed Larry McMurtry Lonesome Dove tetralogy. Filled with unforgettable characters and unspeakable actions. The book is a trilogy unto itself, following the Texas Ranger heroes and unlikely friends Woodrow Call and Gus McCrae.Unfortunately, the romantic elements of this novel (which left alone outside of the tetralogy are memorable) suffer from consistency when compared to the third volume of the series (which was the first written).Still, we are introduced to characters we have loved and hated from the key novel of Lonesome Dove - Deets, Pea Eye, and Jake Spoon, and find out what happens to characters we came to love in the first novel (Dead Man's Walk).Even without the inconsistency, this novel is an example of how great a writer McMurtry is, at least in character development."}, {"userName": "Ms.pegasus", "userReviewDate": "Jan 04, 2013", "userURL": "http://www.goodreads.com/user/show/5015851-ms-pegasus", "userReview": "The full moon was a harbinger of death to the settlers on the Texas frontier – the Comanche welcomed it's light to guide their fearsome nighttime raids. This is a book about death – the contemplation of endings rather than beginnings. McMurtry, in this prequel to LONESOME DOVE, seizes the opportunity to present a historical context, rather than merely a backstory, to his Pulitzer Prize winning story of Woodrow Call and Augustus McCrae. He peoples it with a host of memorable characters: Capt. Inish Scull of the Austin Texas Rangers, the Kickapoo scout Famous Shoes, the sly and silent horse thief Kicking Wolf, the great Comanche war chief Buffalo Hump, and his vicious son Blue Duck. The story begins in the 1850's. It straddles a mere 2 decades – a generation that sees the extermination of the southern buffalo herds, the last struggle of the Comanche to push back the demarcation line of white settlers, the collapse of traditional culture after decimation from smallpox and cholera in the previous decade, and finally, the realization that a way of life has come to an end. As befitting its significance, McMurtry spreads his story across three books with multiple plot lines: Scull's pursuit of one final adventure seeking out the sadistic Ahumado; Buffalo Hump's final assault on white settlements; and Blue Duck's vengeful violence.We look back on the period with mixed feelings today. The West is symbolic of American courage and self-reliance, but also of genocide on a massive scale. It's difficult to imagine what kinds of people sought lives on the frontier. It's difficult to imagine life in a warrior culture such as the Comanche, or a life so completely dependent on chance. McMurtry skillfully imbues his characters with the emotions and temperament consistent with the violence and haphazard outcomes of the period, but permits them to speak and think in unique voices. I particularly loved the musings of Famous Shoes. Guiding Call and McCrae in their pursuit of Blue Duck, he encounters an ominous white owl – not characteristic of that part of the country. “Famous Shoes realized then, when he heard Captain McCrae's casual and cheerful tone, that it was as he had always believed, which was that it was no use talking to white men about serious things.”(p.741). The real courage of these characters is to be found in the attitude of unflinching acceptance of reality. In Capt. Call that attitude solidifies in a stoicism so deep it enables his survival. By silencing his inner emotions, he is able to channel his senses to the most subtle signals of impending danger. In Buffalo Hump it is the understanding that the buffalo herds will never return. Even Maggie understands: “There was no changing men – not much, anyway; mainly men stayed the way they were, no matter what women did.” (p.241)McMurtry mines his wealth of historical knowledge effectively. The prophet Worm reveals an unsettling dream to his traveling companion Buffalo Hump: Thousands of squealing horses – they are squealing because they are being killed. It is a premonition of a sombre event. In 1874 over a thousand Comanche horses were captured and slaughtered in the battle of Palo Duro Canyon at Ranald MacKenzie's command. His reasoning was that the Commanche would steal the horses back, so he had them killed. McMurtry is a disciplined writer. Despite the violence and sadness, he never lapses into sentimentality. Most readers will approach this book after having read LONESOME DOVE. In contrast, it is a more sprawling narrative. Call and McCrae are part of an ensemble of interesting characters, and there is less narrative focus. The implicit comparison was always in the back of my mind. I missed that sense of forward momentum and wonder if anyone has approached this book without having read LONESOME DOVE first.Gr 1/4/13"}, {"userName": "Kyle", "userReviewDate": "May 23, 2011", "userURL": "http://www.goodreads.com/user/show/4432628-kyle", "userReview": "Comanche Moon is the second book in the \"Lonesome Dove\" series, and it continues to provide the back story on the lives of Woodrow Call, Augustus McCrae, and several other major characters. I really enjoyed getting to know Call and Gus better, and to see the events that hardened them into the men that shined in the third, and in my opinion, the best book, Lonesome Dove. Compared to the first book, Dead Man's Walk, I thought Call and Gus were older, more seasoned, and even less fearful of the Comanches. I also thought Gus showed a lot more of his banter that I enjoyed so much in Lonesome Dove. There were numerous scenes that brought a smile to my face and one where I literally laughed out loud!I ranked the story down one star becuase it felt like the book jumped around too much at times. You would be reading about characters in one place, and the next chapter would have them miles and/or years down the trail. It felt like editors might have cut chapters and cobbled it back together to form a complete story. Warning! This book included a lot more sexual references, and rape than other books in the series. The scenes with Inez Scull seemed a bit over the top for the \"Old West\"."}, {"userName": "Billcorcoran", "userReviewDate": "Nov 24, 2010", "userURL": "http://www.goodreads.com/user/show/1924622-billcorcoran", "userReview": "Lonesome Dove is probably my all time favorite novel. This is one of the prequels and not quite as good but still a terrific read. I think it is the only one of the 4 books that can't be read entirely on it's own so don't start with this book. They were written completely out of order and I think the best way to read them is in the order they were published, starting with Lonesome Dove. McMurtry writes great characters and includes both humor and tragedy to great effect. It starts off a bit slow but is never dull, McMurtry just takes awhile to build up the characters and the situation. I did feel the resolution to some of the conflicts were anti climactic but others played out just about right."}, {"userName": "Trisha", "userReviewDate": "Dec 01, 2011", "userURL": "http://www.goodreads.com/user/show/1300121-trisha", "userReview": "A rollicking read!! And for those of us who got to know Texas Rangers Augustus McCrae and Woodrow F. Call in Mc Murtry’s Lonesome Dove this is a chance to meet up with them again, but this time as younger men. No sooner does the story get going but what they find themselves summarily turned into captains by their own thoroughly eccentric Captain Inish Scull (Bible and Sword!!) so that he can leave them on their own and head on south in pursuit of his huge horse, Hector, who had been stolen by the notorious Commanche horse thief Kicking Wolf. And so it’s one adventure after another as we gallop along from one scenario to the next – from the two camps of Buffalo Hump and Kicking Wolf to the open plains of Texas to the cliffs of the Rio Grande in northern Mexico. Along the way we meet up again with some familiar faces from Lonesome Dove – including the thoroughly evil Blue Duck. Gus and Cal’s fellow rangers -- Deets, Jake Spoon, Pea Eye Parker and others -- are part of the story as well as are Clara Forsythe, Gus’ one true love and Maggie Tilton the whore with the heart of gold whose love for Cal will forever be unrequited. We also meet a whole book full of equally unforgettable characters like the lusty Inez Scull who’ll bed anyone in sight, and the terrifying “Black Vaquero” with an amazing repertoire for torture. This is one of those books that kept me wanting to keep coming back to it as soon as I’d put it down. McMurtry is a great story-teller and his imaginative use of dialogue, not to mention his talent for creating characters that are hard not to like (even the bad guys are so colorful that it’s hard not to like the fact that we hate them!!) makes this book every bit as much fun to read as his other books that are set in the West."}, {"userName": "Karla", "userReviewDate": "Apr 25, 2010", "userURL": "http://www.goodreads.com/user/show/2846441-karla", "userReview": "I enjoyed this far more than Dead Man's Walk, but it misses the mark made by Lonesome Dove by a great deal. What could measure up to it, honestly?The set-up seems to be the same: Indian nemesis, a supporting cast of eccentrics, and Gus and Woodrow trying to reach the last page alive. There's lots of blood, guts, and gore to wade through - funnily enough, I'm not into horror novels, but put the same violence porn into a historical context and I'm ok with it. There's a lot of it here, including a graphic scene of some poor bastard being flayed. It's the only time when a book has made me physically ill.Seriously, it's beyond gross.But still a kickass piece of historical fiction."}, {"userName": "Mari", "userReviewDate": "May 17, 2012", "userURL": "http://www.goodreads.com/user/show/9300479-mari", "userReview": "I have to rate this book five stars because it is about Call and Gus, after all. I am in love with those guys. No one can write dialogue like McMurtry (well, except maybe Pat Conroy), and he doesn't disappoint yet again.Everything Gus and Call say is spare, witty, and sometimes profound. Recurrent McMurtry themes such as how cruel or merciful luck can be in determining our fate, man's love of adventure, the nostalgia for the frontier and the frontiersmen, and the idea of life as energy and movement.McMurtry has relegated the American Western to the literary status it deserves through his depiction of two true American originals who embody the best and worst traits of true men. Call and Gus are very capable human beings who have an edge on attracting good luck because of their skills. But, alas, even they are at the mercy of their fate."}, {"userName": "Pete", "userReviewDate": "Sep 18, 2008", "userURL": "http://www.goodreads.com/user/show/1540778-pete", "userReview": "All of McMurtry's books are peopled by the most fascinating characters in American literature. As far as I'm concerned, McMurtry rivals Dickens in his colorful characterizations and this book rivals even Lonesome Dove with great characters such as Famous Shoes, Blue Duck, Pea Eye, Maggie and the rest of the characters that enrich and complicate Woodrow Call and Augustus McCrae's lives."}, {"userName": "John", "userReviewDate": "Oct 31, 2010", "userURL": "http://www.goodreads.com/user/show/3800326-john", "userReview": "I've put together a quiz perhaps you'll like it.Lots of pages, not much depth. Fast reading story. Not much depth. Ummm did i say \"not much depth?\" Well it's kinda shallow like a mudhole in the llano.\"You're right. The only thing the man ever roped on the first try was himself. That's a curiosity, ain't it?\" Call speaking of Lonesome Bill."}, {"userName": "Widespread", "userReviewDate": "Nov 21, 2013", "userURL": "http://www.goodreads.com/user/show/14298766-widespread", "userReview": "For me, and probably for many others, this series has been a shock to the system, but also a vital awakening to an Old West more horrible than we had imagined. But the beauty of these books is not in the horror; for that you can read Cormac McCarthy. McMurtry's gimlet eyed realism is leavened by a Dickensian heart, and his characters throb with immediacy. I will take Larry over Cormac any day."}, {"userName": "Cphe", "userReviewDate": "Nov 11, 2014", "userURL": "http://www.goodreads.com/user/show/14907696-cphe", "userReview": "My favourite of the Lonesome Dove series, who could forget the chillingly evil Blue Duck?"}, {"userName": "Shatterlings", "userReviewDate": "Feb 23, 2018", "userURL": "http://www.goodreads.com/user/show/993082-shatterlings", "userReview": "This is so much better than I thought it would be, there’s so many characters and storylines, it kept my interest the whole way through it’s massive length. Lots of the characters get back stories and there are surprises as they move forward. This was my first western but I don’t think it will be my last."}, {"userName": "Kyle", "userReviewDate": "Dec 24, 2014", "userURL": "http://www.goodreads.com/user/show/3826418-kyle", "userReview": "(Audible book)This book is very different from \"Dead Man's Walk\" the first book I read in the Lonesome Dove series. In my previous post about \"Dead Man's Walk\", you met the main characters in their late teens as they first become Rangers. The story in this book, picks up the main characters ten (10) years later. Both Cal and Augustus have grown up, but so has Texas and the Rangers. This is reflected throughout the story. You no longer see the impetuous, brazen, and immature young men. Instead, you meat two men who have grown up and are dedicated to their calling. Unlike the previous book, there is a greater deal of humor woven into this story. The bond between Cal and Augustus has been clearly cemented. These two could not be any different from one another. But the dependence or reliance upon each other is strong. This is clearly portrayed at one point in which both of them have to save the troop when they are appointed co-Captains. The inner struggle how to accomplish this as well as which way to proceed it the conflict at the moment. Instead of working against each other, the reliance an dependence upon one another helps them to put aside their personnel feelings and wants, and listen seriously the other. Oh how they have grown up, how much they believe in each other, how much do they believe in the Rangers. For the sake of the troop, for what made the most sense, they reach a compromise which saves the themselves and saves the troop. You will also meet all the primary characters who will continue on into the book everyone has read: \"Lonesome Dove\". You will better understand who these men are, and what made them what they are. And how all these secondary characters play in their lives. You will also have a greater understanding as to what is important to each man and what they value. What one is the other is not. What one lacks the other has. This is what brings these two together and dependent upon the other. For each becomes stronger because of the other. This story is well written. Good believable character development is a must for me and thus far in both of these books, this more than accomplished. I also like Larry McMurtry's sense of reality. There is no romanizing the life these people live. Death seems to be lurking constantly around the corner and it is cruel, gruesome, and cold. Yet, Mr. McMurty writes with just enough detail to get his point across without having to delve into gross and horrific detail. The story line is real. A story of living in a hard time, when Texas was coming out of the wild wilderness full of Indians and Mexicans, war and attacks. When Texas was trying to identify herself and find her way in the world. These were the men who were going to give her the ability to survive and shape her future. Life and your place in the world, that is what these men were. Your name, your integrity, that was well worth it's weight in gold. Then there are the humorous incidents, and regrettable mistakes these men experience and make. Just as in real life, the decisions we make, the ones we wish we could do over, and the consequences we live with for the rest of our lives, that shape our lives. This is what makes this book such a pleasure to listen to. I am glad that I am reading these book in order chronological order as opposed to order of publication. For I am seeing them grow up, seeing what shaped and influence their lives. I will know these men now that I am starting \"Lonesome Dove\". They will already be good friends whom i have come to know and respect."}, {"userName": "A", "userReviewDate": "Feb 12, 2012", "userURL": "http://www.goodreads.com/user/show/7721685-a", "userReview": "Plot – 4, Characters – 4, Theme – 3, Voice – 4, Setting – 5, Overall – 4 1) Plot (4 stars) – After his horse is taken by a famous Comanche thief, an old Texas Ranger captain sets off after him on foot only to end up in one of the most brutal Mexican bandit camps on the frontier. To me, that was the plot. Much more than the adventures of Call and Gus, the usual protagonists of the Lonesome Dove series. And I eagerly ate up the pages about the ornery captain, the clever Comanches, and the torturing Mexicans, while skimming through the 50% of the book devoted to the other characters and plotlines.2) Characters (4 stars) – Captain Skull was funny and wise and brave (very much like Gus in Lonesome Dove). The Comanches were not savages, nor were they saints; they were not simply white men in loin clothes, but nor were they so alien as to not have human hopes and fears. And the Mexican bandits were so enthrallingly cruel—skinning people alive, hanging them in cages from cliffs, cutting off eyelids … what an awful and fascinating spectacle to watch from afar. McMurtry does an amazing job with each culture, showing us what it would be like to be in the head of someone raised in that worldview (e.g., there’s a Shaman who eats armadillos to grow a protective shell on himself). I have no way of knowing if this is an accurate portrayal of these people, but even if it’s not, it is impressively imaginative. 3) Theme (3 stars) – I wasn’t quite sure what the moral of this installment was, besides maybe the power of testing yourself, of not only facing but seeking adversity, danger, and even torture with a high head and a smile. McMurtry shows us a time of rugged and brave men, and perhaps he wanted to say something about the virtues of courage and adventure. Though I’m not sure.4) Voice (4 stars) – McMurtry has the ability to spin off some of the finest come-by-this-fire-and-let-me-tell-you-a-magnificent-yarn prose. But, unfortunately in this book, many sections felt unedited. He would say the same thing three of four times in the same paragraph. I’m not sure if this was intentional, if he felt it gave simpler men a simpler aura to them, but as a reader I often found myself thinking “let’s gone on with this” and started skimming.5) Setting (5 stars) – McMurtry knows his nineteenth century Texas. It is an expansive, dangerous, difficult place, and he drops you right in the middle of it to fend for yourself.6) Overall (4 stars) – This is no Lonesome Dove. But 99% of books aren’t. Lonesome Dove is one of the greatest stories ever told, and it’s tough for anyone to be infused with so much genius twice. Comanche Moon, however, is a good book. I picked it up because I didn’t want Lonesome Dove to end, but I kept reading for the fascinating window into Comanche life. I’d recommend it."}, {"userName": "Jeneden", "userReviewDate": "May 03, 2012", "userURL": "http://www.goodreads.com/user/show/9255378-jeneden", "userReview": "Comanche Moon was sad in many places, gruesome in others, but ultimately lovely and satisfying. McMurtry's descriptions of the West at this particular moment in history really puts you there. He delves into the psychology of all of his central characters which allows one to consider what was ultimately a war, from all angles. You get a feel for what it was like to be Rangers, Comanches, other Native Americans, Military Commanders, Native Mexicans, a Free African American, Prostitutes, wives, young children living in Texas at it's start. You lament the loss of the Comanche territory with the dying of the last great warriors, although at the same time you find them fearsome and terrible for having committed torture throughout their lives. One interesting lack of depth is the character of the settler. They are mentioned throughout as relentlessly encroaching on the West, spreading like ants, and they are killed often in the book, described mostly for the horrible deaths they meet rather than meeting any of them in particular. One captive woman is followed briefly but only as a means to demonstrate how the Comanches, the Rangers and society deals with her upon her return. I think it is a perfect second part in this series (having read part 3 - Lonesome Dove - first, and part 1 - Dead Man's Walk second). I don't understand other people's objections to continuity problems, but then again, my memory isn't necessarily that detail oriented so I didn't notice any disconnect between this and the other two books. Then again, in life we often remember things incorrectly anyway, and I felt that this book explained well how Gus and Call move from being young Texas Rangers to seasoned professionals, to looking forward to their semi-retirement in Lonesome Dove. If anyone is considering reading this series, I do think reading Lonesome Dove first makes the most sense, as it's definitely the major work and once hooked, reading further into the prequels and sequel after."}, {"userName": "Kevin Symmons", "userReviewDate": "Sep 23, 2012", "userURL": "http://www.goodreads.com/user/show/11223787-kevin-symmons", "userReview": "In general, while I fancy myself a serious student of western history and novels that describe that ilk, I have found the Lonesome Dove group far too graphic for my liking. I understand that the real west and the conflict that existed between white settlers and their Native American counterparts often resulted in tragic, even disturbing consequences. The problem I have with the LD novels is these activities are spelled out in such explicit, thorough and frankly disgusting detail. I found many of the passages difficult to read. I seldom put down a book that I have purchased, especially from such a noted author. I did this one. I get sick of reading about abuse, rape, sadistic and systematic torture, assaults, peoples eyes being put out, etc. I'm sure it happened but these continual and heinous acts transport me away from the story all too often. Frankly, I found the film (TV generally) versions of these far more engaging. I have watched every minute of Lonesome Dove, Streets on Laredo and the other mini-series many times. Fortunately,due to censorship much of the more graphic and gruesome detail is missing... Praise be to heaven!"}, {"userName": "Stephen", "userReviewDate": "Aug 15, 2013", "userURL": "http://www.goodreads.com/user/show/632452-stephen", "userReview": "A word about this novel before I get back to the business of writing reviews of serious, high-toned literature. It must be apparent from my review of Lonesome Dove that I enjoy reading Larry McMurtry. I also finished Streets of Loredo recently. I have a theory about Comanche Moon. Mere speculation actually. I suspect that Larry McMurtry read Blood Meridian by Cormac McCarthy before undertaking this project and was swept away by it--so swept away by it that he allowed it to influence his own endeavor. Now, Cormac McCarthy impresses me, too. Still, I wish Larry McMurtry had written another Larry McMurtry novel rather than this pale imitation of Cormac McCarthy at his bloodiest, bizarre best.I speak of the violence, torture, rape, etc., etc. here that gets so over the top that it becomes unintentionally comical.Nice little nod in this novel, however, to William H. Prescott, the author of the classic The Conquest of Mexico, one of my all time favorite histories. I did appreciate that."}, {"userName": "Catherine  Mustread", "userReviewDate": "Jan 18, 2016", "userURL": "http://www.goodreads.com/user/show/1894763-catherine-mustread", "userReview": "Book #2 chronologically in the Lonesome Dove series, though the last of the four books in the series to be published (1997).  Covers the roughly 20 years in the lives of a band of Texas Rangers, primarily focusing on two captains, Augustus \"Gus\" McCrae and Woodrow Call and their efforts to fight the Comanche and also battles in their personal lives during the 1850-60s.McMurtry's storytelling ability and descriptions of the rugged Texas life of the era is superb and keeps the story moving through the 700+ pages. The characters, with their imperfections, are great examples of how the west was tamed and some of the final efforts of the Comanches to maintain their independence.The violence and especially the torture made for gruesome scenes, but seemed realistically described and I can tolerate such scenes better in a book than a movie."}, {"userName": "Beth", "userReviewDate": "Jul 14, 2014", "userURL": "http://www.goodreads.com/user/show/4705693-beth", "userReview": "Absolutely loved this series. It was perfect for a new Texan, and it has made me hungry to learn more Texas history. The characters in the series are such real people to me now, and I am heart-broken to have to leave them. The novels capture the era of the Texas Rangers and the beginning of the settling of Texas and the West by Americans. There is a sense of the tragedy of the era of Native control of the land ending, despite the protagonists being the protectors of the settlers. The books manage to convey huge differences in approaches to life possible between, but also within cultural groups, but mostly they just convey a love of life itself, of the land, of the complexity of human relationship."}, {"userName": "Tess Mertens-Johnson", "userReviewDate": "Sep 16, 2013", "userURL": "http://www.goodreads.com/user/show/2876749-tess-mertens-johnson", "userReview": "This book is a prequel to Lonesome Dove.This book had well fleshed out characters, and the characters were the book.Texas Ranger Augustus McCrea and Woodrow Cull were the lead male characters. They commiserate about lost loves, father children and befriend Native American along the way.Inish Scull, Famous Shoes. Guiding Call Buffalo Hump and McCrae round out the cast, as well as Maggie, in the good old boy western saga There were torture scenes that made me squirm with the “skinning” of others. The stuff nightmares are made of…I did enjoy the book…just a tad long for me"}, {"userName": "Rob Shurmer", "userReviewDate": "Jul 23, 2014", "userURL": "http://www.goodreads.com/user/show/596061-rob-shurmer", "userReview": "Same characters, but less skillfully crafted than 'Lonesome Dove'. The story-line is predictable and McMurtry dwells too much on gratuitous violence which at times borders on the sadistic. The last 200 pages were more torturous than McMurtry's two-dimensional Indians and mostly loped ponderously to an ending (or a beginning considering that this is a prequel to 'Lonesome Dove') that all readers could see coming like a thunder-storm across the Great Plains. Also, one wonders if the character of Inez is McMurtry's attempt to write a 'strong' female character. If so, he failed miserably."}, {"userName": "Emilianna", "userReviewDate": "Nov 03, 2010", "userURL": "http://www.goodreads.com/user/show/2187592-emilianna", "userReview": "Bottom Line:AMAZING!!!I know people say that Lonesome Dove is better, but I like the Comanche Moon plots more than Lonesome dove. Mainly I think because it puts more of an emphasis on the Comanches. That and I like Famous Shoes so much!!!! He's just funny. But it was good, it was my first Western and the movie is also very wonderful. I think it should not be compared so hard to Lonesome Dove. Its a really wonderful book."}, {"userName": "Mindy", "userReviewDate": "Oct 24, 2010", "userURL": "http://www.goodreads.com/user/show/1582332-mindy", "userReview": "I couldn't finish this book. Reading all the western banter was way too distracting. I think the personalities of the characters were also not very desirable. So I gave up! Sorry Kelly , I REALLY tried to get into it and it just wasn't happening. It stayed in my car after I Renewed it from the library 3 times."}, {"userName": "Lauren", "userReviewDate": "May 30, 2008", "userURL": "http://www.goodreads.com/user/show/786673-lauren", "userReview": "Again, a good read, but it doesn't match up to Lonesome Dove for quality of story and character. Maybe it just pales because I read Lonesome Dove first. I'd still recommend reading Lonesome Dove before any others in the series."}], "description": "THE NATIONAL BESTSELLER The second book of Larry McMurtry's Lonesome Dove tetralogy, Comanche Moon takes us once again into the world of the American West.  Texas Rangers August McCrae and Woodrow Call, now in their middle years, continue to deal with the ever-increasing tensions of adult life -- Gus with his great love, Clara Forsythe, and Call with Maggie Tilton, the young whore who loves him. Two proud but very different men, they enlist with the Ranger troop in pursuit of Buffalo Hump, the great Comanche war chief; Kicking Wolf, the celebrated Comanche horse thief; and a deadly Mexican bandit king with a penchant for torture. Assisting the Rangers in their wild chase is the renowned Kickapoo tracker, Famous Shoes. Comanche Moon closes the twenty-year gap between Dead Man's Walk and Lonesome Dove, following beloved heroes Gus and Call and their comrades in arms -- Deets, Jake Spoon, and Pea Eye Parker -- in their bitter struggle to protect the advancing West frontier against the defiant Comanches, courageously determined to defend their territory and their way of life.", "title": "Comanche Moon\n      \n          (Lonesome Dove #4)", "url": "https://www.goodreads.com/book/show/54807.Comanche_Moon", "average": 4.0, "cover": "https://images.gr-assets.com/books/1371294499l/54807.jpg", "reviews": 402, "authors": [{"url": "https://www.goodreads.com/author/show/1055.Larry_McMurtry", "name": "Larry McMurtry"}], "type": ["Westerns", "Fiction", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/54807.Comanche_Moon", "http://www.goodreads.com/book/show/26212088-comanche-moon", "http://www.goodreads.com/book/show/111856.Comanche_Moon", "http://www.goodreads.com/book/show/34858.Comanche_Moon", "http://www.goodreads.com/book/show/1524984.Comanche_Moon", "http://www.goodreads.com/book/show/256008.Lonesome_Dove", "http://www.goodreads.com/book/show/63461.Terms_of_Endearment", "http://www.goodreads.com/book/show/50051.The_Last_Picture_Show", "http://www.goodreads.com/book/show/54812.Streets_of_Laredo", "http://www.goodreads.com/book/show/54804.Dead_Man_s_Walk"]}