{"ratings": 16456, "userreviews": [{"userName": "Karin Slaughter", "userReviewDate": "Jan 19, 2014", "userURL": "http://www.goodreads.com/user/show/10901279-karin-slaughter", "userReview": "All new characters, set in 1975...I think my readers will really enjoy this one. It was a lot of fun to work on and I talked to a lot of interesting folks for research. Don't worry--another Will and Sara is around the corner. A girl has to have some fun!"}, {"userName": "Paromjit", "userReviewDate": "Oct 29, 2017", "userURL": "http://www.goodreads.com/user/show/38610813-paromjit", "userReview": "Cop Town is a crime thriller set in Atlanta, Georgia, in 1974. It is a story of a city and state in a state of flux, a police department in open revolt against a black mayor, a black police commissioner, Reginald Eaves, and the changing face of communities with the growth in a range of minorities, with women and blacks working as police officers and more. Atlanta is a city festering with hatred and tension as a fifth white police officer has been shot dead on duty, with the shooter pegged as a black man by the police. If you are black, you better watch out. Jewish widow Kate Murphy is starting her first day as a police officer, only to face a baptism of fire from male cops. She is partnered with Maggie Lawson, determined to remain a cop in staunch opposition from her mother, and cops, brother Jimmy and Uncle Terry. Terry feels free to punch and knock Maggie around. Kate and Maggie are sidelined from the investigation into the cop murders, but nevertheless pursue the killerThe white male cops are angry, crude, drink heavily, openly racists and bigots, brutal, violent, misogynists, anti-gay, despise liberals, and struggle when it comes to the subtle and the more nuanced in their jobs. They plant evidence and threaten people with impunity. They deride, scorn, treat with contempt and sexually harass female police officers, and are of the firm opinion that women do not belong within the police department. The uniform that is given to Kate is a joke, every item is too big, including the shoes. The women are hard on each other, although as relationships develop, they look out for each other. The anti-semitic serial shooter is stalking and lusting after Kate, with a view to killing her and Jimmy Lawson. The police would rather shoot one of their own if he is gay than face public shame. As Jimmy's life comes under threat, Kate and Maggie race to find the killer, despite all the obstacles and danger they face.There is not much, if any, difference between most police officers and the serial killer. This is story of a search for identity as the world shifts, the cosy bastions of white power in the police is beginning to crumble, societal demographics are changing, and women are acquiring influence in non traditional areas. There is a lot to be uneasy and afraid of. We see Kate come to terms with a different identity, and various versions of herself. 1970s Atlanta is a place you are glad we have moved on from....wait, I have a sense of deja vu, as history seems to be hell bent on repeating itself today. A darn good and suspenseful thriller from the talented Karin Slaughter. Brilliant read!!"}, {"userName": "Arah-Lynda", "userReviewDate": "Nov 13, 2017", "userURL": "http://www.goodreads.com/user/show/5859453-arah-lynda", "userReview": "I’m giving it up for Slaughter’s Cop Town. She got her hook in early and kept me tethered to that line throughout. Dawn broke over Peachtree Street. The sun razored open the downtown corridor, slicing past the construction cranes waiting to dip into the earth and pull up skyscrapers, hotels, convention centers. Frost spiderwebbed across the parks. Fog drifted through the streets. Trees slowly straightened their spines. The wet, ripe meat of the city lurched toward the November light. The only sound was footsteps.Heavy slaps echoed between the buildings as Jimmy Lawson’s police-issue boots pounded the pavement. Sweat poured from his skin. His left knee wanted to give. His body was a symphony of pain. Every muscle was a plucked piano wire. His teeth gritted like a sand block. His heart was a snare drum. His partner Don Wesley was thrown over his shoulder like a sack of flower. Jimmy did not know if he was alive or dead. He had just been shot. And he is not the first policeman to be gunned down. Set in 1974 Atlanta during a time of significant social turbulence. Times were changing rapidly on all fronts, racial tension was at an all time high and minorities of all stripes were infiltrating Atlanta’s police force, most notably women from both sides of the racial divide. They are not welcomed by the old guard who will not quietly relinquish their former dominance and control. But there is a shooter out there and he is taking down cops. The story follows Maggie, Jimmy’s sister who is also a member of the police force and newcomer Kate Murphy, a beautiful young Jewish war widow who has led a life of shelter and privilege. All of Slaughter's characters are well fleshed out in these pages. These women came alive for me and I was drawn into their story as they try to identify the shooter and do their jobs, all the while surrounded by misogynistic, homophobic men who are so busy defending the old days and ways that they are no longer interested in real police work. Their solution for the shooter, once apprehended would be faster, cheaper and much more satisfying. The pacing is pitch perfect, the characters complex and authentic enough to invoke an emotional response, as the hunt for the killer escalates in a city teetering on the brink of upheaval. Damn fine writing. :)"}, {"userName": "Susanne Strong", "userReviewDate": "Dec 18, 2017", "userURL": "http://www.goodreads.com/user/show/4514828-susanne-strong", "userReview": "4 Fabulous Stars.Maggie Lawson is a cop in the Atlanta Police Department. The Year is 1974. Things were different back then. Maggie is basically a beat cop, writing traffic tickets, as are all of the other women on the force, unless they are working undercover as Prostitutes that is. Women are after thoughts. After all, they aren’t allowed to buy a car or open their own bank accounts. Women on the force are mere numbers, meant to make the force look good. Yet Maggie Lawson wants more and she knows she has the brains to do the job. Kate Murphy joins the force after her husband dies in the war. She is one heck of a beauty and she stops traffic too - always has, just in a different way than Maggie. The day of Kate’s first day on the job, Jimmy Lawson’s, partner gets shot and killed. Jimmy is Maggie’s brother and he was right there when it happened. He claims it had to be the Atlanta cop killer - who has taken the lives of several cops already that year. Everyone on the force believes Jimmy, including their Uncle Terry, who adores Jimmy and has nothing but disdain for Maggie. Maggie, however, can’t help but think something doesn’t seem right. She therefore takes it upon herself to investigate the death of Jimmy’s partner along with the help of Kate Murphy and an undercover officer who taught Maggie everything she knows. “Cop Town” by Karin Slaughter kept me on my toes. I was engrossed from the first second to the last even though I had my suspicions early on and they were correct. Every characters was so well written, even those I disliked immensely. This is the second book I’ve picked up by Karin Slaughter and I have now become a huge fan. I listened to the audiobook and the narrator, Kathleen Early (who narrates all of her books apparently) did a splendid job. For those looking for an enjoyable thriller, I’d suggest checking this out as it was well worth it. Published on Goodreads, Amazon, Twitter and Instagram on 12.30.17."}, {"userName": "Shelby *trains flying monkeys*", "userReviewDate": "Mar 20, 2014", "userURL": "http://www.goodreads.com/user/show/1053760-shelby-trains-flying-monkeys", "userReview": "This book is now released. Run and get it!! Cop Town is set in Atlanta, Georgia during the 1970's. Admittedly the south has suffered for our history and this book doesn't portray the people living in the south in a great light. Don't let that stop you though. I lived and live in Georgia and this book blew me away.Atlanta GA 1970\nPeachtree street. 1970's \nThen Atlanta's Police Dept in the 70's. \nNotice something there? No women. The Police department didn't really think women belonged on the force. The ones that had made it were tough and somewhat bitter. Maggie Lawson is fairly new on the job. She has been there for four years. Working under her uncle Terry and brother Jimmy. Both of who are stars of the show. (Terry is a arsehole-just had to put that in).Enter Kate Murphy widowed, first day on the job and Jewish. Not great in that time in history.The story takes place in one week. A shooter has targeted the police officers and is shooting them down in cold blood. The male officers are in an uproar and crying for blood. Maggie and Kate will not step back and let the boys handle things.These two women! I adored them both. They aren't perfect. They don't even think so themselves. Karin Slaughter might write like a man but damn it she makes me proud to be a woman. Slaughter does not beat around the bush about the history of that time. There is physical abuse, racism, homophobia and violence. It happened as bad as I hate it. She does show that most people have good and bad sides and that \"change it was a coming.\"Ramble time:Atlanta still has parts of it that are described in the book. Perry home like areas. My dumbbutt saw it first hand one time. I was looking for a friends new house and walked into a crack house. I think I just made it out without more happening just because they realized I was stupid. Atlanta does have wonderful parts too. I love the city. Bad history and all. This story could have happened in any town though. Corrupt police officers still exist today. I love the Grant County/Will Trent books but this one I was floored by. I think it may have been even better than those. I recieved an ARC of this book from Netgalley for an honest review."}, {"userName": "Wendy", "userReviewDate": "Nov 28, 2013", "userURL": "http://www.goodreads.com/user/show/1418580-wendy", "userReview": "Unputdownable!I can easily see why Karin Slaughter is one of my very favorite authors. \"Cop Town\" is her first stand-alone novel that I genuinely hope she will develop into a series.Set in the 70's \"Cop Town\" is an epic story of a city in the midst of tumultuous turmoil, a serial cop killer, and a divided police force assigned with capturing this madman.How can I do justice to this superbly written novel except to say it is fascinating, deeply moving, blatantly realistic and written by one of the best crime novelists today.Thank you to Net Galley and Random House for this arc.Re-read and loved it just as much the 2nd time!"}, {"userName": "Maxine (Booklover Catlady)", "userReviewDate": "May 05, 2014", "userURL": "http://www.goodreads.com/user/show/22943325-maxine-booklover-catlady", "userReview": "I received a copy of this book thanks to the publisher via NetGalley in exchange for an honest review. My thanks for the opportunity.I am shamefully admitting that whilst crime is my most read genre, this is the first time I have read a book by the talented Karin Slaughter. I know, I know, there is no excuse and I see that I have been missing out after reading this outstanding and breathtaking novel. Never fear, I shall be reading every single book she has written after this one.Cop Town is unlike ANY crime novel I have ever read before. It's an absolute stand out with it's plot, characters, message and depth. For me this was a six star read. It's so well written that it makes many other novels I have read in the past pale in comparison.It's 1974, Atlanta, USA. The Atlanta police force has only recently been advertising for women to join the police force, so they are few and far between and they don't get it easy. Rampant sexism, racism, bullying, taunting and downright unethical behaviour is what the women in the Atlanta Police Department have to put up with. Tension runs high in the ranks between men and women, white and black police officers. This is not a place of equality or equal opportunity. You need to be tough, really tough to survive as a woman here.Kate Murphy joins the ranks and is quickly faced with the hard initiations that every woman before her has faced. There is not many women, outnumbered on every corner and Kate has to prove herself to the women and men around her. Many won't even give her a chance. Prejudice and fear is everywhere.Kate's character is complex and surprising, just when you think you know what she is all about, she shows another element of her personality, there is more than meets the eye. She is thrown into some incredibly difficult and harrowing police situations from her first day on the job, many question if she will be back for more on day two. She's not a quitter though our Kate, oh no, she's certainly not that. You will like her a lot.Then we have Maggie Lawson, who has been with the department for years longer than Kate. Maggie has followed in the very big footsteps of her brother and Uncle who are present also in the department. Again, Maggie is a character that is complex, surprising at times and so very well written. Heck, all the characters in this book are exceptional. As white, female Police Officers these two women have a lot to prove. The men in the Atlanta Police Department in the 1970's did not always stick to procedure or protocol, in fact it seems just the opposite, it's as though there are unwritten rules everywhere.The plot is tight, we get tastes of the private lives of Maggie and Kate as well as being on the job with them. Someone is killing Police Officers in Atlanta and Kate and Maggie figure that they have just as much chance of finding the killer as any of their male counterparts. They are jeered at for even thinking this way. This was an environment that set up harsh, impossible situations for them. They are risking a lot in teaming up and going after the killer that everyone wants to catch.The prose is stunning, every single word is exceptional, I was literally transported back to the 1970's, it was painted with such clever descriptive paragraphs and emotion running through the sentences that you are just swept along. From the moment I started reading this novel I could not put it down, each word flowed so well and the plot got more and more interesting, at times it's dark, heck it's just so incredibly good.There are some really clever, unexpected things thrown up along the way that I did not expect, some shocking, deep issues being tackled at the same time. This book does not hold back, it's gritty, in your face and challenging. I can't rave enough, whether you are already a Karin Slaughter fan or not, read Cop Town and make up your own mind. It's a stunning work of fiction. Have I raved enough? I hope so. Happy reading."}, {"userName": "Patrice Hoffman", "userReviewDate": "Apr 23, 2014", "userURL": "http://www.goodreads.com/user/show/5405898-patrice-hoffman", "userReview": "Karin Slaughter has been one of my favorite authors for some time now. Her Will Trent series has always placed her in a class all her own. Her gritty, descriptive, suspenseful crime novels make her a force to be reckoned with so it's no surprise that Cop Town, the first standalone novel, is as good as it is.Maggie Lawson and Kate Murphy take center stage as two female officers for the Atlanta Police Department. Maggie comes from a family that eats, breathes, and dies by the blue. Although no one in her family is happy she's on the force, she can take care of her own. Her brother Jimmy, and uncle Terry, are on the force as well. They give her as much of a hard time as all the other animals... I mean men in blue.Kate Murphy is the rookie officer who is barely managing her first day on the job when she partners up with Maggie. Kate decides to serve after her husband dies in Vietnam. At first she seems lost and unsure of herself, but eventually she discovers what she's made of. Both women are investigating the death of Jimmy Lawson's partner Don Mosley. Someone has declared it open season on the APD. There have been seemingly random murders of officers while on duty which has turned the whole Atlanta Police Department on its head. They are out for blood and will not let this murderer have their day in court. Maggie and Kate begin to investigate the latest murder of Don Mosley and begin piecing together the evidence and witness accounts. There is enough proving that Maggie's brother is hiding something and the murders may not have been so random after all. Cop Town takes place during the 70s. Racism, homophobia, sexism and classism seems to permeate its way into the minds of every character. In some way, in some form, one person or another is faced with dealing with their own prejudices or ones thrown at them. Kate and Maggie battle not only the elements on the tough streets, but are constantly needing to prove themselves to their male counterparts. Kate is sexually harassed at least once every hour or so. I can't imagine what it was like for women who paved the way for current female police officers. Judging from this book they had a tough row to hoe.Karin Slaughter writes a damn-good police procedural. She provides readers with great characters who have such depth I'd love to see them in future novels. (Please...maybe?) Both women trudge through the mud and find a whole lot more on the other side. I really enjoyed this journey with Maggie and Kate. Cop Town is a must read for all of Slaughter's fans. And for those living under a rock and haven't yet been acquainted her novels, make Cop Town your first. Copy provided by Random House Publishing Group via Netgalley"}, {"userName": "Brenda", "userReviewDate": "Nov 27, 2013", "userURL": "http://www.goodreads.com/user/show/2337007-brenda", "userReview": "Atlanta, Georgia in 1974 was full of racial prejudice, bigotry, hatred and the belief that women should be in the home, not working toward a career – and this was just in the Atlanta Police Department. Maggie Lawson had been a raw recruit once – on the job now for twelve months, she was still in the shadow of her uncle and brother. Terry had a cruel streak and did his best to lower Maggie’s dwindling confidence with verbal abuse and beatings. Her brother Jimmy was growing up the same way, though they had been close as children and she loved him dearly. Kate Murphy had lost her husband to the war in Vietnam and was still grieving. But she had decided a job in the police force was something she could do – helping people less fortunate was her naïve thoughts. When she discovered the uniform she’d been given was way too big, even though her measurements had been taken meticulously, she should have realized the tone of her near future. The catcalls, the derision, the leers from the male cops as she tried to make her way into the squad room on her first day were daunting to say the least; then she met the few women on the force….When another cop was murdered on the night shift they were working and his partner lucky to survive, the ensuing manhunt was all consuming. A serial killer was targeting cops and the desperation of the department was escalating. Kate’s first day would not ease her gently into Atlanta PD, she was thrown into an outright war. But as Kate and her partner Maggie were told in no uncertain terms that they couldn’t do anything in the search – they were women after all – Maggie and Kate decided to do their own investigation; follow the paperwork, follow the clues – their determination was made stronger by the taunts of their male colleagues. As the women ventured into the depths of the city’s dark side where murder and depravity were every day occurrences; where the colour of a person’s skin made a difference, a madman waited on the sidelines. Would they capture this twisted and psychotic maniac before he struck again? How many more cops would die before he was brought to justice?I thoroughly enjoyed Karin Slaughter’s latest offer, the stand-alone Cop Town. The action was full on and intense, the twists and turns brilliant! The deep prejudices against women, gays, black people – all seemed extreme, but I’m sure it wasn’t back in 1974. Atlanta had the dubious reputation of being the worst area for crime in the US, and through this book, I can see why. Cop Town is a fantastic read, one which I have no hesitation in recommending highly.With thanks to NetGalley, TRR and Random House for my copy to read and review."}, {"userName": "Wendy Darling", "userReviewDate": "Jul 15, 2014", "userURL": "http://www.goodreads.com/user/show/2745288-wendy-darling", "userReview": "[I'm hoping Angie gets what's coming to her soon! Yeah, that'll never happen. (hide spoiler)]"}, {"userName": "Katie", "userReviewDate": "Mar 14, 2018", "userURL": "http://www.goodreads.com/user/show/8106992-katie", "userReview": "WHY HAS IT TAKEN ME SO LONG TO READ KARIN SLAUGHTER? I loved most of it, but there was one aspect with the then that irritated me. Video review will be up next week :)"}, {"userName": "Carol", "userReviewDate": "Jun 11, 2014", "userURL": "http://www.goodreads.com/user/show/1166663-carol", "userReview": "Sincere thanks to Netgalley and Random House for providing the e-galley of Cop Town to be published June 24, 2014. Where have I been? This is my first experience with author Karin Slaughter. It certainly won't be my last. Cop Town begins with a hit the ground running, grab your attention, prologue. Jimmy Lawson carries his partner, Don Wesley, over his shoulders, fireman style, to the hospital after a serial cop killer known as The Shooter shoots Don. Jimmy credits his own survival to the killer's gun jamming. Cop Town rushes to its conclusion in only a few days but what intense days these are.  Kate Murphy lost her husband to the Vietnam War two years ago. Her family has the means to cushion her from the real world. They'd love to see Kate get a nice, safe, secretarial job. Kate has other ideas. When Kate reads an article in The Atlanta Journal recruiting women police officers for motorcycle patrol she joins the Atlanta Police Department. This is 70's Atlanta and it's no stroll in the park. It's hard to know who is lowest in the pecking order, the blacks or whites divided by gender or possibly the Jews on the force. It's safe to say the rookies are way down on the list. Kate's first walk into the building in her \"fitted\" issue uniform might be comical if not planned at her expense. The top is swimming, the pants, so long they need to be stapled or clipped, the shoes so big she knows she'll have blisters by the end of the day, her hat falling so far down on her face so that her view is obstructed. This doesn't even account for the rest of her equipment, flashlight, nightstick, radio transmitter, gun, all which she has no clue how to manage. Where does her purse go? Add to this the man handling (pun intended) and catcalls. You get the picture. Making her way to the woman's dressing area is a human obstacle course which provides no sanctuary as even the veteran women cops haze the rookies.  Though I was pretty certain Kate had the guts to stick it out, it was quite exciting to watch her get there. Her acknowledgment of her own strengths makes for some of the most interesting passages in the book. Partnered with Maggie Lawson, a veteran with an uncle and a brother on the force, Katie and she seek common ground as they search for the cop killer. This killer, known as The Shooter, has targeted teams; making them kneel, lace their hands over their heads, killing them in execution style. Obviously the whole department is out to get this guy and there are lots of interpersonal stories to keep the plot moving.  At times the brutality and depravity left me with my mouth open but never seemed unrealistic. Gritty, but rang true. I loved it. Karin Slaughter lives in Atlanta and she has given this city life and a unique voice of its own, if not everyone's Atlanta, at least one that is based on many truths a makes for a great setting.Cop Town, Kate, Maggie and some other characters are just begging to be brought back. Let's hope so."}, {"userName": "Gary", "userReviewDate": "Oct 21, 2017", "userURL": "http://www.goodreads.com/user/show/15055195-gary", "userReview": "Whenever I read a Karin Slaughter book I finish it and think I really should read more of her work. I always seem to enjoy her books and yet I still keep reading other authors work, well this is going to change. In my defence there are so many good authors and books out there and such little time to fit them all in.This stand alone novel is set in Atlanta, 1974 and new recruit Kate Murphy is thrown into a brutal murder and a furious manhunt that is rocking the city. Kate is a good looking woman who comes from a privileged background and life in the force is not going to be easy, but her first day could not get any worse when a policeman is shot and the locals tempers are ready to boil over. There are so many good characters in this novel and I particularly liked the interaction between Kate and another police woman Maggie who comes from a police family. Because the book is set in the 1970's there is an abundance of the prejudices that were particularly prevalent at that time such as racism and sexism. The two women face a constant fight to prove themselves not only keeping the city safe but also against the prejudices of their male colleagues. Another good novel by a very good author who I intend to read a lot more of very soon."}, {"userName": "Marnie  Krüger", "userReviewDate": "Aug 29, 2015", "userURL": "http://www.goodreads.com/user/show/6108495-marnie-kr-ger", "userReview": "Again this is prove of why Karin Slaughter is one of my favorite authors.All the dedication in researcher that went into this book is mind baffling. She capture the struggle and perseverance of these women so well. In 1975 women was meant to be at home raising the kids; and the men would not make you forget your place. Written as brutally honest as only Karin can be.In Cop Town Karin just again show how brilliant she is at creating the perfect killer and then let them unravel in the end. Not a lot of writers can keep me in suspense like Karin does."}, {"userName": "Jenn (One of Many, We are Legion)", "userReviewDate": "May 27, 2014", "userURL": "http://www.goodreads.com/user/show/3003455-jenn-one-of-many-we-are-legion", "userReview": "[ I really enjoyed that by the end, both Jimmy and Maggie seemed to have let go of at least some of their hang-ups. They began to see other people as people and realize how their little classifications of others didn't matter. Maggie accepted Jimmy, she accepted Kate. (hide spoiler)]"}, {"userName": "Robert", "userReviewDate": "May 05, 2014", "userURL": "http://www.goodreads.com/user/show/5537205-robert", "userReview": "Sexism baby. It’s pretty-freakin’-ridiculous. But if you can’t move past it, or you’re going to start swearing from the mountaintop, you better just slide right on by, because you will not enjoy this novel. Let that sink in for a moment before we move on. And if you’re going to bitch and moan about it, keep in mind Karin Slaughter wrote a realistic historical novel. She did not set out to write a politically correct novel. And for cripes sakes, this is fiction people.Atlanta is a wonderful southern city. There’s The Varsity and the College Football Hall of Fame and The World of Coke and Centennial Olympic Park and Stone Mountain Park. Yes, three out of the five attractions I’ve mentioned weren’t open in 1974, and yes, I am still going to mention them anyway, because all five are just plain cool. But if you want to ratchet up your confusion, try driving in downtown Atlanta. There are 71 streets with Peachtree in their name. Fuck me. That’s just crazy. Some city planner really wanted to fuck with tourists. Yeah, and I thought Boston was bad.I did like COP TOWN. Actually, I really liked it. So why did it take me so long to finish? You might ask. My answer is simple: That first 15 percent or so nearly killed me. But once the train got rolling, it moved faster than a hamster on a wheel, and I was left clinging to the side for dear life. Had I stopped sooner, I would have missed out on one hell of a read. Was it the best novel I’ve read this year? No. Would I read it again? Probably not. But the atmosphere nearly caused me to inhale a carton of cigarettes, a bottle of Jack, and way too much hairspray.I wanted to wave a red flag and a hand-painted sign for women’s rights, and yes, I really wanted to see what Kate Murphy had going on underneath her uniform. That woman could break a man in two, or serve up a heart attack to a twenty-five year old. Sure, her tits may have been mentioned more than once or twice, but if she’s got a pair that could make Susan Sarandon jealous, I want to hear about it. Yes, she was a blonde, and yes, that endeared her to me a little bit more, but again, I can’t stop that train because it’s already left the station.This novel was locked and loaded better than a Glock 17. My only wish: there were a few more bullets in the chamber.I received this book for free through NetGalley.Cross-posted at Robert's Reads"}, {"userName": "Liz", "userReviewDate": "Jul 18, 2017", "userURL": "http://www.goodreads.com/user/show/4125660-liz", "userReview": "Ever since I read Darktown, my GR friends have been recommending I read Cop Town. 1974, Atlanta. A black chief of police has just been appointed but the old,white guard is not going down without a fight. Racism and sexism are rampant. Drinking on the job is so common you wonder how anything got done. And now there's a cop killer on the loose. The book is told from the perspective of two young female cops, one brand new to the job and the other with a few years under her belt. Slaughter does a great job of evoking time and place, when being groped on the job was a given, not cause for filing a sexual harassment report. This is a good, fast paced mystery with lots of twists and turns. I listened to this one and had a weird experience. Disc 10 had the four chapters from 27-30 backwards. This was the only disc that was screwed up but it played a real number on my brain until I figured it out. I can't speak to whether this is universal for all audio editions."}, {"userName": "Richard", "userReviewDate": "Jul 13, 2014", "userURL": "http://www.goodreads.com/user/show/8386404-richard", "userReview": "5.5/10This is a hard book to review. There were parts I liked but there were parts I didn't like, but taking two weeks to read this sort of book shows that I was struggling. The soundtrack to this book has to be \"Gimmie Shelter\" by the Rolling Stones. Racism is rife, homosexuality is like a disease that needs to be eradicated, the backdrop of the Vietnam War and the general hatred of it ooze out of the pages. That is the highest praise I could give it by relating it to such a great song. The plot is also good; cop killer hunting down and killing cops with a distinct M.O. Cops don't like this and try and capture said killer. I can get on board with that, it could be a really good narrative done in the right hands. I just couldn't get into this though, I didn't relate with any of the characters or care about any of them and by the end the writing style started to grate and I just needed to finish it so I could get on with something else. As a book based mainly on a woman’s perspective I, a white middle aged male, found it hard to understand the battles they had to go through in their work and personal lives. I didn't live in this time so it seems alien to me, those of an older disposition may relate easier. It was sort of like a buddy cop movie in that one was down to earth with her own problems and the other is a rich kid whose husband died in the war and is looking to make it as a cop and both trying to solve this cop killer crime.I've read 1 really good book by this author and 2 that were let downs. I'm starting to think that the 1st was a fluke. Worth a try though if you're more open to some of these ideas than I was, I think this is definitely a case of wrong book, wrong time. I received a free copy from NetGalley for review. If you like this try: \"The Choirboys\" by Joseph Wambaugh or listen to \"Let it Bleed\" by Mick & Co."}, {"userName": "Diane S ☔", "userReviewDate": "Dec 17, 2013", "userURL": "http://www.goodreads.com/user/show/4159922-diane-s", "userReview": "The seventies, in Atlanta, women and black are just now being allowed on the police force, a police force of the good ol boys, used to running the city the way they see fit. I grew up in Chicago and in the seventies, I knew cops like this, they would often beat up the male teenagers whenever they felt like it and then deposit them on their front porches. They had no oversight and the kids had little recourse. This novel has that time period down pat.Kate is a new cop and Maggie comes from a family of cops. The atmosphere they endure in the police station is horrific and yet they manage to deal with it and find ways to help in their own ways. This is a good standalone from this author and the storyline of a shooter after cops is a good one as well. Kate is easy to underestimate and I enjoyed watching her slowly come into her own. Maggie's treatment at the hands of her uncle, who is also a cop, is despicable. Of course there are secrets and the solution is not the apparent one but goes much deeper. A good new start to what the author says will be a occasional series. ARC from Netgalley."}, {"userName": "Magdalena aka A Bookaholic Swede", "userReviewDate": "Jul 23, 2017", "userURL": "http://www.goodreads.com/user/show/1379514-magdalena-aka-a-bookaholic-swede", "userReview": "Dual review with Swedish first and then English!\nSWEDISH REVIEW\n\nDe fördärvade är en fantastisk bok! Att läsa den här boken fick mig att inse att jag inte läser många kriminalromaner vars handling utspelas på 70-talet och det är synd eftersom det är en fascinerande tidsperiod. Särskilt, som i den här boken, för kvinnor som försöker hitta en plats i en mans värld\nJag verkligen älskade att läsa om Kate Murphy och Maggie Lawson, två mycket olika kvinnor från olika klasser. Kate kommer från en familj av poliser, både hennes farbror och bror arbetar på samma polisstation som hon gör. Men det är inte så att de gillar att hon är polis, särskilt inte hennes farbror. Maggie å andra sidan är änka, hennes man dog i Vietnam-kriget. Hon är också den nyaste polisen på polisstation, och hon lär sig snabbt att ingen, inte ens kvinnorna, kommer att hjälpa henne. Om hon vill jobba som polis, måste hon tuffa till sig och acceptera att bli mobbad. Och som kvinnor hålls de också borta från de verkliga fallen som jakten på polisens mördare. Inte för att det kommer att stoppa Maggie och Kate från att försöka ta reda på vem som dödar poliser.De fördärvade är en träffsäker roman om en tid i förändring där kvinnor försöker bli mer självständiga. En sak som verkligen berörde mig var den skrämmande attityden gentemot kvinnor i den här boken. Även bland andra kvinnor, ja, även i en familj. Och sedan har vi den omaskerade rasismen och homofobin, särskilt bland manliga poliser. Men det är allt detta som gör den här boken så fascinerande att läsa. Karin Slaughter har verkligen fångat tidsandan och jag mentalt hejade jag på Kate och Maggie för att de våga stå upp mot männen och våga försöka hitta mördaren trots motstånd.\nDetta är en av de bästa böcker jag har läst av Slaughter och hon har snabbt blivit en favoritförfattare!\nTack HarperCollins Nordic för recensionsexemplaret!\nENGLISH REVIEW\n\nCop Town is a fabulous book! Reading this book made me realize that I don't read many crime novels set in the 70s and that's a shame since it's a fascinating period of time. Especially for women that are trying to find a place in a man's world, as in this book.\nI loved reading about Kate Murphy and Maggie Lawson, two very different women from different classes. Kate comes from a family of cops, with both her uncle and brother working on the same force as she does. Not that they like that she is a cop, especially her uncle. Maggie, on the other hand, is a widow, her husband died in the Vietnam war. She is also the newest cop on the force, and she quickly learns that no one, not even the women will help her out. If she wants to work as a cop, then she has to toughen up and accept being bullied. And, as women are they also being kept away from the real cases like the hunt for the cop killer. Not that that will stop Maggie and Kate from trying to find out who is offing cops.Cop Town is a gritty crime novel about a time in changing, with women more and more trying to be independent. One thing that really struck me was the appalling attitude towards women in this book. Even among other women, hell, even in a family. And, then we have the undisguised racism and homophobia, especially among the male cops. But, it's just all of this that makes this book so fascinating to read. Karin Slaughter has really captured the spirit of the time and I found myself mentally cheering Kate and Maggie for daring to stand up to the men in this book and daring to try to find a killer.\nThis is one of the best books I have read by Slaughter and she is quickly becoming a favorite author of mine.\nThanks HarperCollins Nordic for the review copy!"}, {"userName": "Stacy Green", "userReviewDate": "Jul 14, 2014", "userURL": "http://www.goodreads.com/user/show/5500554-stacy-green", "userReview": "Absolutely excellent. The characters were vivid, and Slaughter's obvious research into the life of a female police officer in Atlanta in the 70s made the book one of the best I've read in a long time. I'm hoping she decides to make this one a series!"}, {"userName": "Jack Jordan", "userReviewDate": "Jul 31, 2015", "userURL": "http://www.goodreads.com/user/show/37897404-jack-jordan", "userReview": "2nd June 2018 update: read and loved it a second time. The characterisation is phenomenal.4.5 stars. I had read one of Slaughter's books in my early teens, and I can't remember why I didn't pick up another title of hers until now. I'm glad I did. Cop Town is brilliant: not only is it a thrilling crime story, but it also highlights real problems in society: racism, sexism, homophobia, police brutality. Slaughter delivers a great crime novel with a window of what it was like in 1970s Atlanta, Georgia. Not only is Cop Town a brilliant read, but it is also an educational one. I'm looking forward to reading more of Slaughter's work."}, {"userName": "Judy Collins", "userReviewDate": "May 16, 2014", "userURL": "http://www.goodreads.com/user/show/11063006-judy-collins", "userReview": "A special thank you to Random House Publishing Group-Bantam Dell and NetGalley for an ARC in exchange for an honest review. Loved this Atlanta Crime Thriller, COP TOWN!, Karin Slaughter’s upcoming new stand-alone crime thriller based in Hot Atlanta. A dark encounter of life on the streets, back in the seventies in a controversial city full of hatred and crime, in a predominantly male law enforcement world, with no respect for women, or other minorities. The 70’s were proving to be a bad decade for police officers. Atlanta had suffered more losses than most and in the past two years they caught five cop killers though only one of them had seen the inside of a courtroom. The others had mysterious accidents and the fifth one had walked out of the courtroom a free man.It was great returning to Atlanta, to all the familiar neighborhoods, with a beautiful, kick ass rookie cop, named Kate, a Jewish Buckhead gal, who recently lost her husband in Vietnam. Kate, walks into the Atlanta Police Department, blindsided with every kind of racism, sexism, discrimination, and abuse you can only imagine, especially being a woman in a man’s world--- as readers get to experience firsthand her first EIGHT days on the force. (they are not pretty ones).Kate gets paired with seasoned partner, Maggie Lawson. Maggie of course is under the thumb of her Uncle Terry and brother, Jimmy and her life is not easy (they even treat their own family like dirt). A lot of bad cops and not too many good ones. No one gives Kate, the new girl a break, as she quickly gets introduced to hookers, drug dealers, crack houses, pimps, violence, bigotry and the down and dirty Atlanta (all the evil is not within the town, but inside the police force). Kate is not sure she will make it through day one. These people are crude, violent, sexist, and obnoxious. - She is not safe anywhere, and little does she know the killer is on her trail, as well.A brutal murder has taken place and a serial killer  is targeting cops and a divided police force with the mission of bringing a madman to justice. Maggie and Kate team up with Gail (this is one crazy and funny woman), to try and crack down a madman with no help from the macho pigs. No liberals, gays, or minorities are welcome by these guys. As the suspense builds, readers hear from three POVs -Maggie, Kate, and the Killer, (Shooter/Fox). The killer remains a secret, as Slaughter does a bang up job keeping you guessing. There is much more to the novel than the actual murders and crime. The author dives into the life of Kate, her past, family, and her struggles with people being good and bad at the same time. Maggie is quite a mystery; however, she and Kate learn from one another and develop a trust. (Liked the little sexy diversion of Dr. Philip Van Zandt -Dr. Zipless). Maybe more from Maggie in another book.A fast-paced, heart-racing, riveting crime thriller  which keeps you on edge-- from Chester Bridge, Little Five Points, Howell Mill, Cabbage Town, Midtown, Buckhead, Grant Park, Downtown, to Grady Hospital---getting a glimpse into the dark alleys and secrets of Atlanta’s finest—truly engrossing, filled with humor and sarcasm for a satisfying bestseller read. Having moved to (Buckhead) Atlanta in the early nineties, missed all the happenings in the earlier times; however, have heard horror stories. Slaughter did an outstanding job with the fictional account, research, and reality of this devastating time. For those who do not reside in the area, you will be glad to know a number of these seedy dark areas are now quite trendy and hip, with lots of lofts and restaurants.Looking forward to reading more from this talented author!  Judith D. Collins Must Read Books  TOP 30 BEST BOOKS OF 2014"}, {"userName": "Barbara", "userReviewDate": "Jul 13, 2014", "userURL": "http://www.goodreads.com/user/show/2172096-barbara", "userReview": "This stand alone by Karin Slaughter is set in 1974 Atlanta, where a serial cop killer is on the loose. As the search for the killer is going on Kate Murphy, a beautiful young widow from Buckhead (a wealthy Atlanta neighborhood) has completed her police training and starts on the job. She's soon partnered with working class Maggie Lawson, whose uncle Terry Lawson and brother Jimmy Lawson are both cops. The job isn't easy for women however. The 1970s Atlanta Police Department is dominated by racist, homophobic, white men who have contempt for black cops and female cops. The white males feel free to disrespect and grope their female colleagues, who are generally relegated to traffic duty or undercover work where they pose as hookers. Kate is even more ostracized because of her good looks and posh accent. Before long Jimmy is wounded by the cop killer and his partner Don is killed. The Atlanta PD goes into high gear to catch the murderer and Maggie - who thinks Jimmy's hiding something - wants to help. Uncle Terry is violently against this but Maggie uses personal sources to get information and she and Kate launch their own inquiry. As the women investigate Kate becomes re-acquainted with an old friend who's now a doctor, able to provide important information about Jimmy's injuries. The doc, though married, is attracted to Kate and proceeds to pursue her. The book has a wide array of interesting characters including a tough lady officer who's willing to torture witnesses, a transgender pimp, a creepy child rapist, Kate's courtly family, and a whole bunch of cops. The plot is fast-paced and leads to a dramatic, believable, and satisfying climax. I enjoyed this mystery thriller and highly recommend it. (A note: I'm glad to think the bigoted male cops in this story would be thrown off the job immediately in this day and age.)You can follow my reviews at http://reviewsbybarbsaffer.blogspot.com/"}, {"userName": "Kate", "userReviewDate": "Feb 12, 2018", "userURL": "http://www.goodreads.com/user/show/73069853-kate", "userReview": "Karin Slaughter does it again. This book left me pretty speechless. Not only was it a typical 5 star Slaughter thriller, but it tackled some heavy historical issues regarding race and gender inequality that took place in the 70's and really shed some light on what a \"historical thriller\" is. The setting is in the 1970's in Atlanta Georgia where there is a definite racial divide about as wide as the grand canyon not only in the city of Atlanta but on the Atlanta police force. Slaughter (not surprisingly) provided detailed descriptions that painted a picture so real that I found myself simply shaking my head at times. Not only was there a huge racial divide at that time but the gender inequality was also at an all-time high. To be a woman on the Atlanta police force in the 70's was no easy task. Once again, Slaughter made it so unbelievably real to picture what these women went through, it truly was eye opening for me.One of the things I loved most about this book was how we got to see Kate Murphy go from new recruit to bad @$$ and she totally owned it the entire way. I really looked up to Kate as a character (no, not just because my name is Kate) but because she was the epitome of someone who truly never gives up despite what is thrown their way. Watching her grow throughout this book was something I really enjoyed. I also thought she brought out a whole new side to Maggie Lawson throughout the book and by the end I think it is safe to say they were friends. As I'm writing this I am really noticing too how connected I felt to the characters. Slaughter has a way of bringing her characters to life for me which is one of the many reasons why I truly appreciate her writing. To sum it up, this book is real, it's important, and you really should read it."}, {"userName": "Linda Quick", "userReviewDate": "Apr 27, 2014", "userURL": "http://www.goodreads.com/user/show/5333931-linda-quick", "userReview": "This is very different from Karen Slaughter's other works. This takes us inside the Atlanta Police Department during a time of extreme racial and gender strife. During this time, Slaughter takes us along as a young Jewish woman of privilege joins the police department. No group seems to be safe from taunting and abuse, whether they're of color, of another faith, of another sexual preference, or female, etc. Even the female police officers were treated as lower class citizens and this woman faced challenges for both being female and being Jewish. Ms. Slaughter has brought this time to life in the book. While I was alive during this time and remember too much of it well, it made a fascinating backdrop for the murder mystery of a cop killer murdering Atlanta police officers.This is not a light weight fluffy mystery, but rather a deeply engrossing story that will haunt you long after you've finished reading it. I highly recommend it.Thank you to Netgalley for providing an ARC."}, {"userName": "Jennifer Masterson", "userReviewDate": "Jul 05, 2014", "userURL": "http://www.goodreads.com/user/show/28953843-jennifer-masterson", "userReview": "A strong 4.5 stars for Cop Town. This was my first Karin Slaughter novel but it definitely won't be my last. It's a thriller about cops living in Atlanta in 1974. Boy does Slaughter do a good job portraying what life was like back then, especially for cops."}, {"userName": "Marianne", "userReviewDate": "Apr 17, 2014", "userURL": "http://www.goodreads.com/user/show/5067228-marianne", "userReview": "Cop Town is the first full-length stand-alone novel by popular American author, Karin Slaughter. Despite some changes in laws, policies and attitudes, the Atlanta Police Force in 1974 was still overwhelmingly rife with racism and sexism. It is against this background that young police patrolwoman Maggie Lawson and new recruit Kate Murphy, excluded by the boys, launch their own investigation into the murder of an Atlanta patrolman, Don Wesley. The fact that he was partnered with her brother Jimmy, at the time, gives Maggie some intriguing clues about the case, but also complicates matters. Remarkably Kate, too, stumbles on a source of information about the shooting. As they try to determine if this incident is part of the recent spate of cop killings by The Shooter, they find themselves venturing into Colored Town and visiting a very different type of club; they encounter hookers and pimps, gays and transvestites. The Shooter calls himself Fox, and it seems Fox is stalking Kate, but just who is Fox? The events of this fast-moving, action-packed novel take place over just a few days. Slaughter’s totally credible plot has quite a few twists and a heart-stopping climax. Her two main characters are multi-dimensional and engaging: Maggie tries to be a tough gal but cannot ignore her feelings for her brother; Kate turns out to be a surprisingly gutsy woman possessing hidden steel within. Slaughter’s extensive research is apparent on every page and the attitudes and values of the times are expertly depicted. As well as exploring racism and sexism, Slaughter touches on the Holocaust, the Vietnam War, the emergence of the gay culture, sexual harassment, rape and the independence of women. As Maggie succinctly sums up: “The entire world gave men the responsibility for everything in it except for their dicks”. Slaughter’s sizeable Dutch fanbase will appreciate the inclusion of some delightful Dutch characters and dialogue. Readers should be prepared for quite a bit of violence, but also lots of snappy dialogue, plenty of laugh-out-loud moments and even a bit of hot sex. Fans will, no doubt, be hoping for more of Maggie and Kate (and perhaps Gail and Jimmy and Rick too). Once again, Slaughter does not disappoint: this is a brilliant read."}, {"userName": "Jennifer Boyce", "userReviewDate": "May 13, 2014", "userURL": "http://www.goodreads.com/user/show/5772316-jennifer-boyce", "userReview": "I struggled a little bit getting into this book but after the first couple of chapters, I found myself sucked wholly into the story.The story itself was fantastic. The Atlanta police department is trying to track down a cop-killer while at the same time, the killer is tracking one of their cops. Cop Town is a fast-paced thriller full of twists and turns that will keep you glued to the pages until the very end. While the story is fast-paced, it's also full of realistic details and lifelike scenarios that make the reader feel as if they're living the story.For the most part I really enjoyed the characters in this book. Most of the characters were realistic and enjoyable to read about. I found myself able to relate to many characters and to empathize with them if I was unable to relate exactly. Kate, especially, was a wonderful (female) character; strong and self-reliant, she sets a fantastic example for all literary characters everywhere. Maggie's family, on the other hand, included the only characters in the entire story that really got on my nerves and I found myself disliking. All of the characters in Maggie's family felt flat, unlike the lifelike characters found throughout the rest of the story. The reactions and actions of Maggie's family felt fake and I found myself unable to really relate or empathize with the characters in her family.The writing in this book was easy and enjoyable to read. I was a little flustered by the first chapter (or two) and assumed that I wouldn't like the writing style but it turns out that I just didn't like Maggie's family and actually found the writing style a pleasure to read. After the chapter(s) about Maggie's family are over, the writing and action really pick up and the story starts moving. The author does a fantastic job of describing everything, without being overly graphic at parts, definitely something I appreciate in a thriller author.I would recommend this book to all looking for a solid thriller. This one has characters that will resonate within you while still containing a story that will keep you on the edge of your seat (and maybe make you scared to be home alone at night).I received this book for review purposes via NetGalley."}, {"userName": "Holly Vine", "userReviewDate": "Apr 03, 2014", "userURL": "http://www.goodreads.com/user/show/5813101-holly-vine", "userReview": "So I finished this book last night and had to wait until I could get to a computer to type out my review. Plus, I had to calm my inner fangirl so I would not sound like my teenage daughter at a One Direction concert. Thanks to NetGalley for the ARC of this book. I am a very impatient person and I am so glad I did not have to wait until June. I thought for sure that I would miss Will (and Sara) since I have an undying love for him but, I got so caught up in the story and the descriptions, that I barely missed him (them). Cop Town takes place in 1970s Atlanta and follows two extremely different female Atlanta cops as they try to figure out who is behind the shootings of their fellow officers. The descriptions of the abuse suffered by females by their coworkers and superiors was hard to read and gives a person insight to the \"city too busy to hate\". Apparently, the city wasn't too busy to discriminate and be misogynistic.I also enjoyed the descriptions of the streets and neighborhoods that I see every day as I commute to work or walk around downtown. So, without revealing any spoilers at all, I will finish by congratulating Karin Slaughter on another gritty cop book that I was sorry to see end. I really would like to see more of Kate and Maggie but first, I seriously need more Will."}], "description": "NEW YORK TIMES BESTSELLERKarin Slaughter, author of the bestselling Will Trent novels, is widely acclaimed as “one of the best crime novelists in America” (The Washington Post). Now she delivers her first stand-alone novel: an epic story of a city in the midst of seismic upheaval, a serial killer targeting cops, and a divided police force tasked with bringing a madman to justice.   Atlanta, 1974: As a brutal murder and a furious manhunt rock the city’s police department, Kate Murphy wonders if her first day on the job will also be her last. She’s determined to defy her privileged background by making her own way—wearing a badge and carrying a gun. But for a beautiful young woman, life will be anything but easy in the macho world of the Atlanta PD, where even the female cops have little mercy for rookies. It’s also the worst day possible to start given that a beloved cop has been gunned down, his brothers in blue are out for blood, and the city is on the edge of war.   Kate isn’t the only woman on the force who’s feeling the heat. Maggie Lawson followed her uncle and brother into the ranks to prove her worth in their cynical eyes. When she and Kate, her new partner, are pushed out of the citywide search for a cop killer, their fury, pain, and pride finally reach the boiling point. With a killer poised to strike again, they will pursue their own line of investigation, risking everything as they venture into the city’s darkest heart.   Relentlessly paced, acutely observed, wickedly funny, and often heartbreaking, Cop Town is Karin Slaughter’s most powerful novel yet—a tour de force of storytelling from our foremost master of character, atmosphere, and suspense.\nFeatures a preview of Karin Slaughter’s next novel, Pretty Girls\n \n \n“Karin Slaughter is simply one of the best thriller writers working today, and Cop Town shows the author at the top of her game—relentless pacing, complex characters, and gritty realism, all set against the backdrop of a city on the edge. Slaughter’s eye for detail and truth is unmatched. . . . I’d follow her anywhere.”—Gillian Flynn “Cop Town proves Karin Slaughter is one of America’s best writers. . . . She pulls her readers into a twisted tale of mystery and keeps them fascinated from start to finish.”—The Huffington Post“Stunning . . . Karin Slaughter breaks new ground with this riveting story. If you haven’t yet read her, this is the moment.”—Michael Connelly“Compulsively readable . . . will have your heart racing.”—O: The Oprah Magazine\n \n“Intense . . . engrossing . . . evocative . . . [Karin Slaughter’s] first stand-alone novel [has] a gritty, action-packed plot and strong, believable characters.”—Associated Press  “Slaughter graphically exposes the rampant racism, homophobia, and misogyny of cop culture in the 1970s. . . . Winning leads, the retro setting, and a riveting plot make this one of Slaughter’s best.”—Booklist (starred review)  “Superb . . . explosive . . . [Cop Town] is sure to win over readers new to Slaughter’s work while reminding old fans of her enormous talent.”—Library Journal (starred review)  “Evocative writing . . . amazing characters . . . with edge-of-your-seat suspense and a riveting plot . . . Slaughter’s first stand-alone book is a knockout.”—RT Book Reviews", "title": "Cop Town", "url": "http://www.goodreads.com/book/show/18594594-cop-town", "average": 3.89, "cover": "https://images.gr-assets.com/books/1384822680l/18594594.jpg", "reviews": 1891, "authors": [{"url": "https://www.goodreads.com/author/show/12504.Karin_Slaughter", "name": "Karin Slaughter"}], "type": ["Mystery", "Thriller", "Mystery", "Fiction", "Suspense"], "outlinks": ["http://www.goodreads.com/book/show/18594594-cop-town", "http://www.goodreads.com/book/show/22096629-cop-town", "http://www.goodreads.com/book/show/18657698-cop-town", "http://www.goodreads.com/book/show/23347037-cop-town", "http://www.goodreads.com/book/show/18917353-cop-town", "http://www.goodreads.com/book/show/20861275-cop-town", "http://www.goodreads.com/book/show/35518346-de-f-rd-rvade", "http://www.goodreads.com/book/show/23346462-cop-town", "http://www.goodreads.com/book/show/25574782-pretty-girls", "http://www.goodreads.com/book/show/21718.Blindsighted", "http://www.goodreads.com/book/show/21717.Triptych", "http://www.goodreads.com/book/show/2199587.Fractured", "http://www.goodreads.com/book/show/33230889-the-good-daughter", "http://www.goodreads.com/book/show/37581710-the-company-of-demons", "http://www.goodreads.com/book/show/40024832-empire-of-sin", "http://www.goodreads.com/book/show/8343548-the-bricklayer", "http://www.goodreads.com/book/show/40193155-among-the-wicked", "http://www.goodreads.com/book/show/23818400-the-snow-garden", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/23157833-almost-dead", "http://www.goodreads.com/book/show/33555347-crime-scene", "http://www.goodreads.com/book/show/30249521-fatal-frost", "http://www.goodreads.com/book/show/40266676-remains-of-innocence", "http://www.goodreads.com/book/show/34330657-finding-claire-fletcher", "http://www.goodreads.com/book/show/28824403-outfoxed", "http://www.goodreads.com/book/show/23957469-huntress-moon", "http://www.goodreads.com/book/show/40204087-the-deepest-secret", "http://www.goodreads.com/book/show/35115882-what-the-dead-know", "http://www.goodreads.com/book/show/40267317-ragdoll", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/39791173-the-girl-before", "http://www.goodreads.com/book/show/40205081-last-witness", "http://www.goodreads.com/book/show/40205040-dead-weight", "http://www.goodreads.com/book/show/18903409-weekend-warriors", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/40193809-eye-for-an-eye", "http://www.goodreads.com/book/show/27239265-the-short-drop", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/17623604-you-only-live-twice", "http://www.goodreads.com/book/show/17377392-thunderball", "http://www.goodreads.com/book/show/17284593-casino-royale", "http://www.goodreads.com/book/show/17623578-for-your-eyes-only", "http://www.goodreads.com/book/show/40193858-the-cuckoo-s-calling", "http://www.goodreads.com/book/show/17304110-live-and-let-die", "http://www.goodreads.com/book/show/18780375-dr-no", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies", "http://www.goodreads.com/book/show/17379070-moonraker", "http://www.goodreads.com/book/show/18799804-diamonds-are-forever", "http://www.goodreads.com/book/show/40205231-the-spy-who-loved-me", "http://www.goodreads.com/book/show/17377384-from-russia-with-love", "http://www.goodreads.com/book/show/40243961-the-cape-refuge-collection"]}