{"ratings": 469, "userreviews": [{"userName": "Brian", "userReviewDate": "Dec 10, 2010", "userURL": "http://www.goodreads.com/user/show/4638580-brian", "userReview": "A heartwarming tale of cannibalism and group marriage.Courtship Rite is set in a lost colony stranded on a desert planet without much life above insects and somewhat regressed technologically, with the exception of biology and bio-engineering, which is above present-day levels. The cultures that have developed are rather pragmatic about survival (creches where children must prove themselves by a certain age or become food), though not entirely without morality (after all, our protagonist's culture doesn't actually eat criminals when there's not a famine; only barbarians do that).A richly developed world, with interesting cultural and societal developments."}, {"userName": "ambyr", "userReviewDate": "Dec 14, 2013", "userURL": "http://www.goodreads.com/user/show/2670408-ambyr", "userReview": "So on the one hand: the writing is turgid, the pacing is bizarre, and the political lecturing interminable. Also there is cannibalism (did I mention the cannibalism?) on almost every page. Spousal abuse and child rape both make appearances and are treated as the unexceptional actions of reasonable people.And on the other hand: I loved this book.Partly it's the culture. (Or cultures. Geta is not a monoculture, and its clans' beliefs frequently clash.) Courtship Rite is more \"here, let me show you my worldbuilding\" than it is a novel, but it rarely falls prey to \"As you know, Bob\" exposition dumps. It lets its culture reveal itself organically from character interactions. That culture is profoundly weird--quite possibly one of the weirdest I've encountered in science fiction, and that includes non-humanoid ones--and includes a lot of moral and ethical norms that make me cringe, but it's internally consistent enough that I believe the characters think they're doing right even when I think they're committing terrible wrongs. And despite those terrible wrongs, I love the characters, especially the women. (Teenae! Noe!) I'm not entirely clear what this novel thinks it's doing with gender--it has this weird mix of sexist norms and broad gender equality that I think is one of the least well-thought-out aspects of the culture--but as individuals its female characters are pretty awesome. And I don't mean that in some sort of generic action hero way; each of the women (and men) is in fact a clearly distinct individual, with her own strengths and flaws. (And, in most cases, her own scientific specialty. One is a physicist, one is a biologist, and one is a mathematician.)More impressively, I don't just buy them as individuals, I buy them as spouses. There's a saying in poly circles that a triad isn't one relationship, it's four--each pair as well as the three together. It follows that a quartet is eleven, a quintet twenty-five, and . . . I'm not going to keep doing the combinations, because I am not Teenae. At its heart, this novel is about the formation of an eight-party relationship, and while it doesn't manage to develop every possible relationship within that marriage it gives it a noble attempt. By the end of the book, I understand how the core five function together (as pairs, as triads, and even as quartets) and even believe the expanded marriage has a shot. That's frankly more than I can say about a lot of books' dyadic relationships.I'm a little weirded out by the book's relentless heterosexuality--there are no gay people on Geta? At all?--but I do appreciate the lack of performative bisexuality by women, which is a place it would have been easy for it to have gone. And I definitely appreciate that all characters of both genders are equally enthused about sex and their marriage.In conclusion: if you are interested in poly relationships and not bothered by cannibalism or bad writing, I highly recommend this book. But I suspect I am part of a rather small target audience."}, {"userName": "Sheherazahde", "userReviewDate": "Aug 18, 2011", "userURL": "http://www.goodreads.com/user/show/6072951-sheherazahde", "userReview": "Courtship Rite takes place on a human colony world, Geta, that has forgotten it is a colony. Their legends tell them \"God\" brought them across the stars to protect them from \"war\", and \"God\" still watches over them from the sky. We learn later that their word for \"God\" was the original colonists word for \"ship\", and the colony ship does indeed still orbit above them.The only source of protein the colonists have are bees and human flesh, so cannibalism is common and accepted. They also practice genetic engineering. The story follows one family of three half brothers and their wives. The men share a common father and were raised in a public creche where any failure would result in death. They married a young girl from a clan that specializes in math and a spoiled rich girl of their own clan. Their clan specializes in government. They are about to marry a scientist when they are ordered by their clan leader to marry a woman from a coastal clan who advocates heretical beliefs, such as evolution and not killing people for food. They decide to use the \"Courtship Rite\", where they try to kill her several times and if she lives they will marry her. Since she doesn't know them or want to marry them this is bit unfair to her, but they were a angry about the order and it is the central motivation of the plot. [return] They also have to deal with a clan of clone women who make their living as courtesans, and clan of seafarers who want to rule the coastal area.This is my favorite kind of Science Fiction: religion, politics, social engineering, and philosophy. By an author who does it all very well. I give it 5 out of 5 stars"}, {"userName": "Terence", "userReviewDate": "Nov 13, 2008", "userURL": "http://www.goodreads.com/user/show/1019174-terence", "userReview": "I just can't get into this book. Perhaps it's that the writing is \"harsh\" and \"clunky,\" at least to my mental ear. There are points where a character says something and I'm jarred out of the scene, asking \"huh?\" Perhaps it's the characters, of whom I like or care for none.It's a shame for two reasons: One, the world (Geta) is potentially fascinating. A harsh world, most of whose flora and fauna is poisonous to human life. A situation that has forced the development of ritual cannibalism, and lives conditioned by the harsh needs for survival. Secondly, Kingsbury's Psychohistorical Crisis remains one of my favorite novels and I had high hopes for this one.If I didn't have more interesting-looking books on my to-read shelf, I might have stuck with this one but I don't want to continue to waste my time here."}, {"userName": "Dianne", "userReviewDate": "Feb 13, 2008", "userURL": "http://www.goodreads.com/user/show/905038-dianne", "userReview": "This is one of the better alternative societies created for a science fiction book. In this society, the perfect marriage consists of six people, and there is a complicated food imbalance in the native food availible that impacts who and when a family can court another member. Humans are not native on the world, earth plants and animals are hard to maintain, and native food is poisonous, but some hungry people are adapting to eating it. I read this book every few years."}, {"userName": "Sybil", "userReviewDate": "Dec 13, 2008", "userURL": "http://www.goodreads.com/user/show/395474-sybil", "userReview": "A little known classic of the genre that blew me away when I read it 25 years ago. The author does an incredible job of world building in the first part of the novel. The characters are all well-drawn and complex."}, {"userName": "Marjorie Turner", "userReviewDate": "Nov 07, 2009", "userURL": "http://www.goodreads.com/user/show/2282169-marjorie-turner", "userReview": "Wow! This definitely got me thinking about morality and mortality! I'm such a novice sci-fi reader that I think I probably didn't \"get\" some of the sub-context. But it was a real page turner and I enjoyed it!"}, {"userName": "Nicolas", "userReviewDate": "Jul 03, 2008", "userURL": "http://www.goodreads.com/user/show/1156136-nicolas", "userReview": "Mon avis Parade nuptiale est un roman étrange, issu d’une ligne de Hard-science qu’on peut sans problème faire remonter à Dune, tant par l’hostilité du milieu que par la forme du récit, et d’autres postures d’écriture. Cependant, il serait réellement réducteur de le positionner comme une simple copie du roman de Herbert, car Parade nuptiale est un récit beaucoup plus riche, plus fort, et plus difficile d’accès que Dune. Ce récit se situe sur une planète autre que la Terre, où des humains luttent pour survivre dans un monde à l’hostilité avérée. En effet, loin de monstres géants, la biosphère de cette planète est naturellement toxique pour l’être humain, et les aliments dits profanes, c’est-à-dire ceux issus de cette biosphère, sont potentiellement mortels, à la manière du plomb, pour les humains. Il existe bien sûr quelques aliments dits sacrés, pour lesquels le lecteur devine qu’ils ont été importés avec ces humains, comme le blé ou les patates. Partant de cette hypothèse très simple, Kingsburry se place d’entrée de jeu dans ce qu’on pourait appeler un régime stable, c’est-à-dire longtemps après la colonisation. Et son postulat d’environnement toxique a des répercussions incroyables sur la culture et la société de cette planète, retombée dans ce que je considère comme une espèce de moyenâge, où existerait pourtant la génétique moderne. Parmi les conséquences les plus évidentes, on peut citer le cannibalisme culturel. C’est-à-dire que les plus faibles sont éliminées en cas de famine, pour nourir de leurs protéines les plus forts, et ainsi participer à l’amélioration de la race, concept clé de cette planète. De la même manière, les anciens qui meurent de vieillesse, les difformes et les bébés non désirés sont tous mangés, et on conserve les parties de leur corps non dévorées lors du buffet funéraire dans de délicieuses conserves. Tout cela n’est qu’un des milliers d’aspects où l’environnement a eu son impact sur la culture et la civilisation de ce monde. Tout cela n’est qu’un environnement dont j’ai essayé de donner un aperçu des pratiques les plus marquantes. Et dans cet environnement, ce roman nous raconte l’ascencion d’une famille (un mariage polygame visant la complétude à sept) qui va essayer de prendre le pouvoir, de manière \"civilisée\", c’est-à-dire sans verser le sang et en respectant les coutumes politiques. Et toute cette lutte politique présente, pour le joueur de nomic que je suis, certains aspects très intéressants comme une réflexion approfondie sur le pouvoir, son exercice et sa fonction sociale. Ainsi, la mise en oeuvre d’un électorat sur la base du clientélisme, qu’on considère usuellement comme une mauvaise forme de gouvernement, est ici utilisé d’une manière extrêmement intéressante, qui en sublime les potentialités politiques. En fait, il est difficile de bien parler d’une oeuvre aussi radicalement différente. Car la différence, ici, n’est pas seulement dans les vêtements ou les pratiques religieuses de gens, elle est dans le coeur de leur culture, qui se base entièrement sur la cannibalisme. Et ce cannibalisme, à son tour, ne peut pas être vu comme un acte dégradant. Ou du moins, il n’est vu comme tel que par une gentille hérétique, qui souhaite y mettre fin, et dont le rôle dans le bouquin est assez important. Au final, c’est effectivement une lecture très étrange, mais assez fascinante. Je ne saurais trop conseiller aux fans de fictions éllaborées de se précipiter sur cet ouvrage où l’action laisse bien volontiers la place à de puissantes réflexions sur la société, la politique, le pouvoir, ce genre de choses.  Une discussion sur ce roman Peu de temps après, j’ai eu l’occasion de discuter de ce roman avec un interlocuteur d’Usenet, qu’on appelera ici XH. NDParce que des cannibales qui se lancent dans une guerre tribale pour étendre leur empire, ça fait sf, comme thème ? XHNon ; mais la question de savoir si une société fonctionnelle issue d’un peuplement originellement humain mais qui a dérivé à tel point que tout les critères sociaux habituellement admis ont volé en éclat est encore composée d’humains, n’est-ce pas SF, comme thème ? NDSi, complètement. il n’en reste pas moins que, dans ce roman, certains éléments (les combats tribaux, l’espèce de médiévalisme que j’ai pu y ressentir) me font penser que le classement en SF est quelque part un peu artificiel. Pour ma part, si j’avais dû placer ce roman quelque part, je l’aurais mis dans une nouvelle catégorie : la hard-”sciences humaines”. Car si, dans les bouquins d’Egan, par exemple, les éléments qui sont très largement extrapolés sont des éléments de sciences dures, Kingsburry, lui, choisit d’extrapoler de la même manière des éléments purement humains : comment survivre et adapter la civilsation à un environnement dont l’hostilité est on ne peut plus hostile. Il en tire ainsi des conséquences politiques, sociales, psychologiques, qui ne peuvent que laisser le lecteur sans voix. XHC’est parce que tu es trop conditionné par l’association entre SF et technologie. Alors que la SF est un état d’esprit que tu évoques fort bien dans la suite [... cf paragraphe du dessus …] Le tout ficelé dans une histoire intéressante. Voilà une bonne recette pour un bon bouquin de SF, je dirais. L’important, ce n’est pas la technique, c’est la remise en cause des certitudes et la rationnalité (même basée sur des bases qui peuvent être complètement farfelues scientifiquement, l’important étant que cet a priori soit relativement clair). Bref, la SF cherche à explorer et découvrir le réel, le plus souvent au travers de virtualités savamment élaborées, tandis que la fantasy joue plus sur comment faire revivre les structures narratives ancestrales et leurs émotions associées dans un contexte littéraire modernisé. Cela dit, c’est mon point de vue et je le partage (du moins jusqu’à ceje le relise demain), mais sans doute manqué-je de biscuits (comme disait mon prof de philo de terminale), i.e je n’ai pas mon diplôme de pipologie appliquée, euh pardon, de critique littéraire avancée. Notons au passage que Kingsburry a obtenu l’an dernier une distinction en tant qu’auteur de SF libertaire, ce qui cadre bien avec cet esprit de remise en question. NDEn fait, il n’y a pas non plus de doute pour moi, mais ça reste un bouquin tellement étrange que le placer en sf me pose de nombreux problèmes d’organisation de mon catalogue mental. XHFranchement, je trouve que c’est un des bouquins que je conseillerais pour quelqu’un qui voudrait découvrir la SF autrement que sous la forme de batailles dans l’espace avec des robots. Le seul truc queje regrette, c’est la concession qu’il fait en faisant trop directement référence à l’histoire du XXe siècle, je trouve que cela affaiblit l’effet de dépaysement. Mais en même temps cela sert aussi l’histoire,et la référence est immédiatement compréhensible, voire même ressentie par lecteur, bien plus que le seraient des inventions de l’auteur."}, {"userName": "John Park", "userReviewDate": "Feb 25, 2013", "userURL": "http://www.goodreads.com/user/show/17831138-john-park", "userReview": "A recent reread after a couple of decades. I found I'd forgotten all the plot and some of the setting. Geta is a far-future, mostly desert world precariously colonised by humans, who have no other surviving vertebrates (the Horse is known only as a chesspiece) and so must be their own source of meat protein, through ritual cannibalism. The biosciences are well developed, but physics is also making progress as the story develops. Kingsbury employs the traditional assumption that such a civilisation will have deified what it can no longer understand--and indeed the Getans have their own God who crosses the sky at regular intervals. This God, almost certainly the starship that brought them to Geta and now left in a parking orbit, remains enigmatic to the end of the book--evidently grist for a sequel that Kingsbury has never published.What he gives us is a fascinating portrayal of a culture of world-wide clans specialised in various talents. Marriages can consists of two to six spouses (though the free and often joyous couplings Kingsbury presents are all heterosexual), but are apt to be influenced by political pressures. The main plot engine of the book is started when a five-member marriage, having chosen a third woman to complete their six, are told that for political reasons they must take another, a stranger.Political intrigue intersects with personal needs and clan morality. Characters grow and change, war is threatened, stories of Earth's violent past are recovered and overinterpreted, A biological weapon threatens famine. Catastrophe is averted. Conflicts are resolved, loose ends tied off.The writing clunks occasionally; some of the dialogue feels too oratorical, and the last fifty-odd pages are perhaps an epilogue rather than part of the main story. But the book contains a wealth of invention in the setting, plot and character. Perhaps the best indication of the care that must have gone into it are the invented quotations used as chapter-epigraphs; like the book itself they are by turns deliberately naive, satirical, wise, sad, funny, harsh, and always thought-provoking."}, {"userName": "Kyle", "userReviewDate": "Feb 07, 2015", "userURL": "http://www.goodreads.com/user/show/38628830-kyle", "userReview": "Easily the best book about the political machinations on a planet filled with polyfidelitous cannibals that you'll ever read. Life on Geta is harsh--the mostly-desert environment means the only animal life around is insectoid, so the only source of labor or meat is other humans. And to make matters worse, all but eight \"sacred\" plants are poisonous to humans. This gives rise to a very specific set of social institutions where cannibalism is seen as perfectly acceptable in certain situations and is often even an act of noble sacrifice. It also means the lack of trees and fossil fuels have kept technology to a level roughly equivalent with that found immediately prior to the industrial revolution. But there are hints, especially strong in the religious traditions that are passed down from generation to generation, that there was a time of more advanced technological progress.The characters are vibrant and the numerous complex plot lines interweave to form a rich, fascinating tapestry. It may not be everyone's cup of tea but if it sounds at all interesting, highly recommended."}, {"userName": "Kathryn", "userReviewDate": "Mar 06, 2016", "userURL": "http://www.goodreads.com/user/show/4751989-kathryn", "userReview": "I read this book many years ago and it remains in my memory after 33 years. This story was so amazing and compelling. It opens your mind to different thoughts about cultures and social mores and norms. One thing that I did not see mentioned in other people's reviews was that tattoos and scarring were the norm and having no body modification was considered exotic. I highly recommend this book. It's sci-fi. It's not sexually explicit but there are sexual events. If you can find a copy of this in a resale shop, get it and read it. I don't think you'll be sorry."}, {"userName": "Margaret", "userReviewDate": "Nov 23, 2008", "userURL": "http://www.goodreads.com/user/show/1728912-margaret", "userReview": "O.K. I didn't actually finish it. I found it slightly confusing in spots and then it would get really interesting and then it would get confusing again. The character build up was nice and the premise of the book was interesting I just kept finding other things to do and to read and that usually doesn't bode well."}, {"userName": "Pauline Ray", "userReviewDate": "Jun 26, 2012", "userURL": "http://www.goodreads.com/user/show/155549-pauline-ray", "userReview": "Just read it. It's wonderful. Thought-provoking, disturbing, and so very detailed and real."}, {"userName": "ΛrtesµS", "userReviewDate": "May 26, 2017", "userURL": "http://www.goodreads.com/user/show/50433194-rtes-s", "userReview": "Empieza muy fuerte, me gustaba mucho la idea del juego del Rito Mortal que le plantean a Oelita y cómo se iba desarrollando. Sin embargo, la trama cambia rápidamente y las pruebas mortales pierden fuerza prácticamente desde el principio dando paso a un argumento más amplio. Personalmente me gustan más las historias individualizadas que las generales en las que el objetivo podríamos decir que es salvar al mundo de la facción enemiga. A pesar de ello es un libro muy original y me han gustado muchísimo las ideas que plantea. Final redondo, quizá con algún detalle menor sin cerrar pero prescindible. Sin duda, para los amantes de los finales felices en los que todos comen perdices y los héroes salvan al mundo de la catástrofe. Por poner una pega quizá tiene un final poco realista y demasiado perfecto."}, {"userName": "Laci", "userReviewDate": "Aug 15, 2017", "userURL": "http://www.goodreads.com/user/show/4138951-laci", "userReview": "Me, about a quarter of the book in: o_OThere will be no plot spoilers here, just some thoughts on the world building, etc. If you like figuring it out by yourself, or enjoying a slower reveal, don't read on. :)In summary, the name might as well be Cargo Cult: The Book. That is an idea I'd always liked - the original cargo cults were interesting enough. The first time I'd read something like this in a sci-fi, it was in Asimov's Foundation. But here, it's the central tenet the world is built upon. People were brought to a hostile planet by a spaceship still orbiting in the sky. They still have and very much use equipment for genetic manipulation and other bio/chemical processes - but they have almost no knowledge of the *rest* of physics. Only some rudimentary stuff about \"electron demons\" running through copper. And there are no real animals on this planet. And the people now think the orbiting spaceship is their god. The plot in this book is quite good, and the setting made it excellent."}, {"userName": "prcardi", "userReviewDate": "May 16, 2016", "userURL": "http://www.goodreads.com/user/show/43250213-prcardi", "userReview": "Storyline: 4/5Characters: 3/5Writing Style: 3/5World: 5/5Granted, 2016 is not even half-way over yet, but this is the best book I've read this year. If I had to give the review in one word: fascinating.The only information I had about this book when I began was a) the author (whom I did not recognize) b) the publication year and c) its nomination (and lack of award) for the Hugo. I recommend reading this without knowing much more, and I'll give the kind of review that won't spoil it for others. More intriguing than any murder or detective mystery I've ever read is the puzzle of determining this book's genre. As I progressed through the chapters, I couldn't decide, but I was mesmerized by the challenge. Is it a fantasy world? Are the characters human? Is it an alternate history? Far future science fiction? Dystopia? It was a remarkably engaging reading experience. I was further impressed by the depth and detail of the social and political life portrayed. Whether it be set in the past, future, or some other universe, this was society organized around a very different set of values; the conflicts, shame, outrage, and adventure were then governed by the rules of this created world. I felt as immersed in this world as I have been with epic series such as The Song of Ice and Fire and The Wheel of Time - all the more astounding because Kingsbury put me there with a single book of 409 pages. More laurels are certainly deserved, but equally noteworthy are the facets that kept this from being one of my favorite books of all time. First, it was a somewhat difficult read. Because Kingsbury is building a very alien world, and because its true identity is only gradually revealed, the book starts out in very unfamiliar territory and you rapidly have to familiarize yourself with scores of peculiar proper nouns while accepting that much of what is going on is supposed to be opaque. This was a necessary and worthwhile trade off in my estimation, but not every reader is going to happily trudge through to rapprochement. It also made for a slow read. Second, Kingsbury relied on a lot of shock devices. The author presents and develops as normal social conventions many practices that are grotesque and perverse. I don't think the repulsive ideas were there simply as cheap entertainment (okay, maybe the pervasive sex was); I'll give him credit for pushing the reader to consider why our society considers some behaviors civilized and others barbaric. Still, it was hardly a book you can go discussing with your mother. Third, for all the worldbuilding, Kingsbury seems to have petered out when it came to the courtship rite for which the book is named. This was (or should have been) the organizing device for the tale, but it got lost somewhere, and the care and design so obvious in the rest of the book was strikingly absent here. I'm not as well-read with fantasy as I am with science fiction, thus perhaps this isn't as original as it appeared to me. I can only tell you that I really enjoyed it and will think about this for some time to come."}, {"userName": "Dominick", "userReviewDate": "Jun 21, 2014", "userURL": "http://www.goodreads.com/user/show/5913578-dominick", "userReview": "Fascinating far-future SF set on a harsh planet where humans came at some point in the past (how is not entirely clear, though the \"god\" they worship is apparently their spaceship, orbiting silently above the planet). They have developed a bizarre culture that glorifies pain and suffering (elaborate scarification is normative, and the \"courtship rite\" is in fact an elaborate death trial), polygamy (logical enough, perhaps, in a depleted environment where reproduction would be difficult), and cannibalism--perhaps the novel's most unsettling element is the bland reference to such things as roast babies. Nevertheless, the characters are not savages or primitive; they have some advanced technology, including some that allows complex genetic engineering, cloning, and machine breeding, though they also lack other things we'd expect (e.g. radio and wheeled vehicles are reinvented in the novel). Most interestingly, they are complex figures with plausible and different motivations, and belonging to clearly etched different cultural groups. Weakened by some clunky writing and a plot that meanders, but a superlative example of world-building."}, {"userName": "Mark Schomburg", "userReviewDate": "Jun 02, 2012", "userURL": "http://www.goodreads.com/user/show/1776553-mark-schomburg", "userReview": "The heavy tone is worth savoring, especially given the food discussion which is cannibalistic. I found this fantasy world comparable to stuff by various writers ranging from RA Salvatore or Clive Barker to even Asimov. The \"psychohistorical\" connection here is that society is structured around \"Predictors,\" a major theme which resonates pretty strongly with Asimov's Foundation series, albeit in a very different way. The writing is adult and sometimes explicit which sets it apart from Salvatore to some degree. Kingsbury does not curtail his need to express difficult social themes by imposing an external morality. The work is true from within - a valid world, not unlike something by Huxley, with its flaws and nuances clear for all to see. That uninhibited range gives the book great depth. The plot development has much in common with sci-fi of the 70s in how the fantasy world's nebulous connection to Earth history is revealed (but not pinned down). We start on a strange planet and gradually (through ambience) begin to find where we are, a well-tread method which also works here, but dates the book, which would otherwise feel more eternal."}, {"userName": "Daniorte", "userReviewDate": "Aug 04, 2015", "userURL": "http://www.goodreads.com/user/show/28707139-daniorte", "userReview": "La novela parte de una idea original. La historia de una civilización surgida de una nave seminal proveniente de la tierra. Una civilización hecha para vivir en un mundo en donde la biología del lugar es incompatible con la humana por lo que el canibalismo es la forma de vida aceptada e integrada en la sociedad. Esta idea, junto con los conocimientos que la civilización posee de las naves seminales, va creando una historia muy bien hilada con tramas palaciegas y conflictos éticos que te atrapan durante todo el libro. Lectura muy agradable, aunque es cierto que es un libro lento para cogerlo con tranquilidad e ir haciendose con los personajes, los cuales van introduciéndose poco a poco y de manera bastante acertada."}, {"userName": "Erik Graff", "userReviewDate": "Jul 22, 2009", "userURL": "http://www.goodreads.com/user/show/974210-erik-graff", "userReview": "Oh, if I had only read great literature or at least informative non-fiction instead of all the forgetable science fiction novels and collections I've spent so much of my life reading! I knew I'd read a lot of sf, but going over the lists of books completed which have been kept since the end of college has been sobering. With few exceptions, most of the genre isn't worth reading except as escapist literature and I never attended much to quality, simply reading almost anything to hand except when burned enough by a particularly bad writer to avoid him or her.This isn't a bad book. It's actually pretty well written. Beyond that, however, it left me with nothing memorable."}, {"userName": "stormhawk", "userReviewDate": "Mar 19, 2016", "userURL": "http://www.goodreads.com/user/show/2016887-stormhawk", "userReview": "Still trying to decide how I feel about this book. It was hard going at first, the names and relationships were confusing, but I eventually got the hang of it. It us a book of relationships and intrigues. Some of the most interesting elements come from how the characters change and grow, but it feels very unfinished. There is a lot of untold story here. I yearn to know and understand how the culture came to be, how many generations passed to this point, and how many to come to resolve the questions hinted at in this novel."}, {"userName": "Gaines Post", "userReviewDate": "Jun 24, 2015", "userURL": "http://www.goodreads.com/user/show/7473567-gaines-post", "userReview": "Very imaginative. Ignore the comparisons to a certain book that starts with the letter \"D\"; it is nothing like it. Kingsbury has masterfully created a unique world and put a great deal of thought into it. I'd like to read more set this universe. I was a little disappointed with the ending, but mainly because some at one point while I was reading I thought something was going to happen with regard to [censored -- sorry, no spoilers here hehehe], and it never did, so subconsciously I must have been waiting for it. But in retrospect, everything that needed to be resolved was resolved."}, {"userName": "Eric Post", "userReviewDate": "Sep 25, 2013", "userURL": "http://www.goodreads.com/user/show/1034433-eric-post", "userReview": "Difficult to explain. Generations after a starship dumped its crew on a very dangerous planet they have evolve a religion about the orbiting craft and the rituals that allow them to survive on a planet where everything is toxic to humans. It is also a love story of a marriage of five people seeking another mate. It is also the story of a technical tipping point in the civilization. Complicated. Delightful."}, {"userName": "Verena Wachnitz", "userReviewDate": "Oct 29, 2016", "userURL": "http://www.goodreads.com/user/show/5976971-verena-wachnitz", "userReview": "Donald Kingsbury has an incredible imagination and writes very well. The characters feel very real despite belonging to a culture that is very alien. The story is engaging. The only aspect I didn't enjoy was cannibalism... taken a bit too far in my opinion. But beyond that the book is a fascinating journey to a strange and unique place, and an entertaining story of adventure and romance. I'm surprised this book is out of print... it should be sci fi classic."}, {"userName": "Janine Southard", "userReviewDate": "Aug 19, 2014", "userURL": "http://www.goodreads.com/user/show/4798561-janine-southard", "userReview": "I wanted to like this book. I forget who rec'ed it to me, but it had lots of gene splicing and interesting group marriages. Sadly, the characters all drove me crazy, the women seemed rather pointless (even the Jesus-figure), and everything was written in the overblown medieval fantasy style that turns me off of medieval fantasies. :(This book is awesome for someone else. But not for me."}, {"userName": "Dedaimia Whitney", "userReviewDate": "Sep 11, 2007", "userURL": "http://www.goodreads.com/user/show/371327-dedaimia-whitney", "userReview": "Interesting ideas, but very much overwritten. Story about a planet colonized by escapees from a devasted, war-ridden earth. Interesting commentary on \"priest\" classes and human nature, but too much detail not required for the plot or characterization."}, {"userName": "Phillip", "userReviewDate": "Mar 07, 2012", "userURL": "http://www.goodreads.com/user/show/7510654-phillip", "userReview": "This book does what books in its genre ought to do. It presents a fully developed world and alternative culture, much as Herbert did with Dune. The world presented is not so different from Earth. But the culture is out there, fully developed and consistent."}, {"userName": "Juan", "userReviewDate": "Jan 04, 2014", "userURL": "http://www.goodreads.com/user/show/18368792-juan", "userReview": "El relato no plantea un hilo conductor que lleve la trama a ningun lugar, ni plantea ideas que ameriten seguir la lectura"}, {"userName": "Amy", "userReviewDate": "Oct 02, 2014", "userURL": "http://www.goodreads.com/user/show/732308-amy", "userReview": "I liked the idea of Geta, a harsh world with an excellent culling system, and cannibalism."}], "description": "A vast alien landscape, a human culture based on our own, yet evolved in strange ways by the forces of an inimical nature provide a panoramic backdrop for the romantic adventures of a large cast of memorable & attractive characters. Courtship Rite is a sf novel by American writer Donald Kingsbury, originally serialized in Analog magazine in 1982. The book is set in the same universe as some of his other stories, such as Shipwright (1978) & the unpublished The Finger Pointing Solward. In the UK, the novel was entitled Geta, in France, Parade nuptiale. Courtship Rite was the 1st winner of the Compton Crook Award for best 1st novel & was nominated for the Hugo Award for Best Novel in 1983. The novel details the attempts of two of the priest-clans, the Kaiel & the Mnankrei, to expand into territory controlled by the Stgal. Ultimately, all the priest clans are trying to attain dominance of the planet through the use of new technology, propaganda, treachery & \"war\", a new concept in this world. Previously, killing was done merely in order to provide food. Jo Walton remarked that Courtship Rite \"is about a distant generation of colonists on a planet with no usable animals. This is the book with everything, where everything includes cannibalism, polyamory, evolution & getting tattoos so your skin will make more interesting leather when you’re dead.\"", "title": "Courtship Rite", "url": "http://www.goodreads.com/book/show/753136.Courtship_Rite", "average": 3.97, "cover": "https://images.gr-assets.com/books/1286425438l/753136.jpg", "reviews": 31, "authors": [{"url": "https://www.goodreads.com/author/show/127931.Donald_Kingsbury", "name": "Donald Kingsbury"}], "type": ["Science Fiction", "Fiction", "Fantasy", "Polyamory"], "outlinks": ["http://www.goodreads.com/book/show/753136.Courtship_Rite", "http://www.goodreads.com/book/show/3215002-courtship-rite", "http://www.goodreads.com/book/show/7391761-courtship-rite", "http://www.goodreads.com/book/show/3628871-parade-nuptiale", "http://www.goodreads.com/book/show/18248785-rito-de-cortejo", "http://www.goodreads.com/book/show/8467506-courtship-rite", "http://www.goodreads.com/book/show/2519823.Geta", "http://www.goodreads.com/book/show/1518819.Psychohistorical_Crisis", "http://www.goodreads.com/book/show/812056.The_Moon_Goddess_and_the_Son", "http://www.goodreads.com/book/show/6524501-psychohistoire-en-p-ril-i", "http://www.goodreads.com/book/show/6524500-psychohistoire-en-p-ril-ii", "http://www.goodreads.com/book/show/378692.Man_Kzin_Wars_IV", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/25353286-provenance", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}