{"ratings": 127, "userreviews": [{"userName": "Marie", "userReviewDate": "Nov 07, 2016", "userURL": "http://www.goodreads.com/user/show/6587391-marie", "userReview": "These books were definitely \"Creepy\". A little bit of true ghost stories and fiction stories - either way, it was a real good collection of books and I enjoyed reading them. Definitely five stars for this collection!"}, {"userName": "Gina", "userReviewDate": "Oct 26, 2012", "userURL": "http://www.goodreads.com/user/show/5460575-gina", "userReview": "What Goodreads has to say- From the #1 bestselling author of Reunion and Twisted Vengeance.~ Listed with Goodreads Best Breakout Authors of 2011.Creepy is a collection of short stories, some fiction and some not that will send shivers down your spine!Creepy contains two of my favorite short-suspense stories (The Rumblin' and Murdoch's Eyes), but best of all, it includes some of my real life supernatural experiences...absolutely true ghoststories. I was around ten years old when I had my first supernatural experience. Thirty years later, my ghosts have returned and they are creepier than ever. I've seen full-bodied apparations, felt a dark presence practically breathing down my neck, and I work everyday with a ghost who seems more curious than anything.The following true stories are all inside CREEPY:~ The Shadow Man~ The Ghost Named Earl~ Someone in the BasementThese ghostly experiences have influenced my writing and allowed me to truly capture the essence of fear and suspense that you'll discover in my fiction. If you enjoy creepy tales from Stephen King, you'll love my heart pounding, short stories too. This collection of true stories and short suspense will at the very least, creep you out!OTHER HOT REVIEWS:\"With the author using horror as a psychological special effect, Murdoch's Eyes packs a fearsome punch. A killer of a short story thriller!\" - Michele Tater, The Couch Tater Review\"Murdoch's Eyes is a wicked, twisted little tale. A thrilling paranormal both well written and with some truly freaky characters. I don't think I'll ever look at anyone with green eyes the same again.\" - Jen Wylie, Author of Sweet Light\"Reading the reviews of this book, I wondered if it was all it was hyped up to be. Reading it - I discovered it really was. The violence is beautifully executed, the plot is perfect in its speed and intensity and the characters are wonderfully written. Jeff Bennington has written a stunning story here. Ten out of ten.\" - Michael Wilson\"Very interesting story, Jeff! I don't think I would've gotten much sleep either.\" - Neal Hock, The Bookhound's Den(less)I realize that if you read the summary and reviews that I have copied from Goodreads.com you will get the general idea that this is a collection of varied horror short stories and novellas. I am a fan of Jeff Bennington and his writing is excellent. Even though these are horror stories there isn't graphic violence or grisly scenes. These stories are reminiscent of the kind of ghost stories we told at slumber parties as teens that were just meant to creep you out and make you scared enough to hide under the covers. Jeff is definitely an author to take a look at if you are a fan of horror, especially if the extreme violence is bothersome or distracting to you. Jeff just knows how to write a good ghost story. I highly recommend his short and full length book Reunion. I will be reading his other full length novel Twisted Vengeance very soon!! 4 stars!! Another quality work Jeff!"}, {"userName": "Kate's Reads", "userReviewDate": "Oct 26, 2011", "userURL": "http://www.goodreads.com/user/show/6759375-kate-s-reads", "userReview": "Creepy, by Jeff Bennington definitely lives up to it's name! I'd suggest leaving the lights on while you read it!The collection consists of 2 fictional short stories, Murdoch's Eyes and The Rumblin' and 3 real life supernatural accounts that happened to Jeff himself. They are The Shadow Man, The Ghost Named Earl and Someone in the Basement. The true accounts are definitely chilling and will make you wonder what goes bump in the night. The fiction shorts are fast-paced, edge of your seat, thrill rides.I'd just started into the book when I heard thudding upstairs. I assumed the cat was playing with her mouse. Then I looked and saw she was in the room with me...... Hope it was the neighbors...If you like to be scared read this book!5 Stars - KatesReads"}, {"userName": "Dana", "userReviewDate": "May 18, 2012", "userURL": "http://www.goodreads.com/user/show/8351940-dana", "userReview": "Jeff Bennington,s collection of Short stories \"Creepy\" ..just scary.. The Three eyewitness accounts he shares with us will leave you looking over your shoulder and give you goosies, Murdoch's eyes was as scary as it was touching for the Monster who turns out to be the hero..very well done... I was particularly fond of The Rumblin' maybe cause the wife's name is \"Dana\" and one of the drops in my bucket list is to go RV-ing ... gonna check the weather first though... And His True Story of The Shadow man gave me 'goosies\" while at the same time getting ELO's Mr. Blue Sky stuck in my head so that I had to go listen to the song.. I'm giving this 5 stars I couldn't put it down."}, {"userName": "Caridad cruz", "userReviewDate": "Feb 01, 2013", "userURL": "http://www.goodreads.com/user/show/5133919-caridad-cruz", "userReview": "i thought this book was about short stories, its not. This book is gives you the first two chapters of books that you may or may not want to buy. those books i did not find scary or creepy. The cover is more creepy then the stories in the book. I wouldn't waste my time or money on this, the thing is i bought creepy 2 thinking it was scary short stories and i am so disappointed. the two stars i give to it is for the cover of the book!"}, {"userName": "Rebecca McNutt", "userReviewDate": "Jan 04, 2016", "userURL": "http://www.goodreads.com/user/show/36977686-rebecca-mcnutt", "userReview": "I usually love ghost stories (my favorites are the ones involving history or mythology) but Creepy talks more about the author's life than it does about the paranormal happenings."}, {"userName": "Aurora", "userReviewDate": "Aug 15, 2013", "userURL": "http://www.goodreads.com/user/show/7028532-aurora", "userReview": "Very poorly written and not creepy at all :/ Finished the collection through pure determination."}, {"userName": "Grampy", "userReviewDate": "Mar 17, 2012", "userURL": "http://www.goodreads.com/user/show/7669867-grampy", "userReview": "An excellent, and well named, creepy collection of scary stories. The author maintains that several of these stories are first-person actual experiences he has had. In other words, they are true ghost stories! But among the ones the author does not claim as part of his life experience are some dandies. \"Rumblin\" is one of my favorites, in which a creepy park ranger warns campers to come straight to his cabin when \"the rumblin\" starts. He doesn't explain what \"the rumblin\" is. The story is told from the POV of a family of campers. At first they dismissed the ranger as being a few donuts shy of a dozen, but when a fierce thunder storm wakes them in the night, they decide maybe it would be a good idea to head for the relative safety of the ranger's cabin. When they arrive, they learn that the ranger isn't the only \"creepy\" person hanging around. The \"rumblin\" is some kind of local phenomenon which happens every once in awhile, always accompanied by a serious storm, and the effect it has on normal people (granted, there weren't very many \"normal\" people in the cabin) is unpredictable, but always unpleasant. And this is just one of the many creepy, scary stories in the collection. If you like hiding under the covers, or leaving a little night light on, definitely read this book. It just might give you some of the best nightmares you've ever had!"}, {"userName": "Rachel", "userReviewDate": "Oct 15, 2011", "userURL": "http://www.goodreads.com/user/show/6648750-rachel", "userReview": "I reviewed this and chose it from my stack to read as it is coming up to Halloween, and I am a sucker for all things of the spine tingling nature.I loved this book! The mix of real ghost recollections and stunningly scary fiction works really well, and I have to say, I had to wait till the daytime to finish reading it! The cover itself sends an ice cold fingertip down your spine. I think my favourite story was the one of Earl, the real life ghost, but I shan't spoil the plots, buy it now for your Kindle...."}, {"userName": "Jessica", "userReviewDate": "Dec 11, 2012", "userURL": "http://www.goodreads.com/user/show/11130298-jessica", "userReview": "The parts of this book that you may dislike? Well, it isn't all that creepy... it's more like reading episodes of Tales from the Crypt (which I never found all that creepy but more humorous and some hokey) and there are only three actual stories (interrupted by the author's personal \"creepy\" experiences) which do contain a spelling mistake or two. So, if you're a perfectionist with super high expectations you may want skip this book.However... if you're more open and forgiving then check this out. These were three very original stories, my favorite being the one about \"the rumbling\"."}, {"userName": "Nancy", "userReviewDate": "Jan 05, 2014", "userURL": "http://www.goodreads.com/user/show/189834-nancy", "userReview": "Horrible. Really, really awful. Bad writing, predictable, cliche. But my new year's resolution is to get through all of my books, e-books, and audiobooks before I can buy any new ones. Glad to get this done early in the process. The author's constant breaking of the fourth wall, personal (and unnecessary) disclosures and bad pacing along with everything else mentioned gives me two words of advice for those thinking of picking this up: stay away!"}, {"userName": "Michelle Wiles", "userReviewDate": "May 29, 2014", "userURL": "http://www.goodreads.com/user/show/5523879-michelle-wiles", "userReview": "I downloaded this for free from Amazon.co.uk. I just fancied a quick read and thought I would try it. I must say that I am so glad I didn't pay for this because I didn't really like it that much. I found the true stories in the book quite interesting, but not the ones that Jeff Bennington wrote. I didn't find them believeable. Sorry but I won't be recommending this book, or reading the others in the series after it."}, {"userName": "Colleen", "userReviewDate": "Oct 15, 2012", "userURL": "http://www.goodreads.com/user/show/8521279-colleen", "userReview": "The fictional stories contained some genuinely creepy aspects but overall seemed too rushed to really be enjoyable. I liked the subject matter of \"The Rumblin'\" a lot more than \"Murdoch's Eyes\" but I would have liked more build up of suspense and more atmosphere and detail. I enjoyed the author's personal accounts of supernatural experiences the most."}, {"userName": "S.C Alley -  Author", "userReviewDate": "Jan 11, 2012", "userURL": "http://www.goodreads.com/user/show/7330420-s-c-alley---author", "userReview": "Having read 'The Reunion' by the same author, I was quite disappointed in the short stories themselves. What was of greater interest proved to be the explanations and experiences that inspired each story. Some of the stories were more gorey than creepy."}, {"userName": "Maryellen", "userReviewDate": "Sep 24, 2012", "userURL": "http://www.goodreads.com/user/show/6023641-maryellen", "userReview": "CREEPY. Even saying the word \"creepy\" kind of makes you shudder. The short stories, some of them are true accounts witnessed by the author, will definitely cause you to shudder! Well done Mr. Bennington! On to CREEPY 2!"}, {"userName": "Adrienne", "userReviewDate": "Feb 21, 2013", "userURL": "http://www.goodreads.com/user/show/2145558-adrienne", "userReview": "The fiction in the book is sophmorish. The personal accounts between the stories is much better written. There were only three tales in the ebook that I read; the third and final was the best. Hopefully, this is an indicator that Mr. Bennington's future endeavors are improved."}, {"userName": "Brandi", "userReviewDate": "May 09, 2013", "userURL": "http://www.goodreads.com/user/show/9167797-brandi", "userReview": "This was a good book there were a few short stories that would be campfire worthy and I love those kinds of stories. The only downfall would be that I can't think of anyone other than myself who would appreciate them."}, {"userName": "Tammy", "userReviewDate": "Jul 26, 2012", "userURL": "http://www.goodreads.com/user/show/4839816-tammy", "userReview": "It was good to pass the time. Not very scary at all, though."}, {"userName": "Dan", "userReviewDate": "Jan 15, 2013", "userURL": "http://www.goodreads.com/user/show/4231337-dan", "userReview": "Overall, pretty good stories."}, {"userName": "Sue  Pilski", "userReviewDate": "Oct 22, 2014", "userURL": "http://www.goodreads.com/user/show/12653132-sue-pilski", "userReview": "Very well done, Jeff Bennington!! Very well thought out stories that, at times, are literally spine-chilling!!!! :0"}, {"userName": "TAMMY WRIGHT", "userReviewDate": "Oct 27, 2016", "userURL": "http://www.goodreads.com/user/show/48615831-tammy-wright", "userReview": "Good scary short stories......."}, {"userName": "Michele Jones", "userReviewDate": "Jan 14, 2015", "userURL": "http://www.goodreads.com/user/show/29609076-michele-jones", "userReview": "Sorry but this wasn't the least bit scary unless you're maybe 8 yrs old!!"}, {"userName": "J.M.", "userReviewDate": "Feb 26, 2014", "userURL": "http://www.goodreads.com/user/show/798516-j-m", "userReview": "I love horror but this didn't really do it for me."}, {"userName": "Sarah", "userReviewDate": "Feb 17, 2014", "userURL": "http://www.goodreads.com/user/show/4342838-sarah", "userReview": "A few fantastic stories in this book. Some are really creepy. Overall is a great read and one well worth reading. I look forward to more from this author."}, {"userName": "Ghostleegirl", "userReviewDate": "Feb 10, 2012", "userURL": "http://www.goodreads.com/user/show/7041994-ghostleegirl", "userReview": "I really enjoyed this collection of short stories. It was a good taste of what to expect from the author and encourages me to keep reading books from him."}, {"userName": "Gina", "userReviewDate": "Sep 14, 2013", "userURL": "http://www.goodreads.com/user/show/11343322-gina", "userReview": "I enjoy these spooky stories!!!"}, {"userName": "Fairul Asannan", "userReviewDate": "Feb 10, 2013", "userURL": "http://www.goodreads.com/user/show/3168544-fairul-asannan", "userReview": "for me this collection seems more cheesy than scary. but i really like the story of the ghost girl fell in love with a runner."}, {"userName": "Cyndi", "userReviewDate": "Aug 08, 2013", "userURL": "http://www.goodreads.com/user/show/7576457-cyndi", "userReview": "The short stories were ok, a little underdeveloped at times. Could have done without the author's true stories of his encounters, they were dull (I saw a shadow, felt a cold breeze, blah)"}, {"userName": "Bonnie Hilligoss", "userReviewDate": "Sep 27, 2012", "userURL": "http://www.goodreads.com/user/show/6296815-bonnie-hilligoss", "userReview": "I enjoyed these short stories and already have the two books which the author included excerpts of at the end. Looking forward to reading them."}], "description": "Creepy is a collection of short stories, some fiction and some not that will send shivers down your spine!Creepy contains two of my favorite short-suspense stories (The Rumblin' and Murdoch's Eyes), but best of all, it includes some of my real life supernatural experiences...absolutely true ghoststories. I was around ten years old when I had my first supernatural experience. Thirty years later, my ghosts have returned and they are creepier than ever. I've seen full-bodied apparations, felt a dark presence practically breathing down my neck, and I work everyday with a ghost who seems more curious than anything.The following true stories are all inside CREEPY:~ The Shadow Man~ The Ghost Named Earl~ Someone in the BasementThese ghostly experiences have influenced my writing and allowed me to truly capture the essence of fear and suspense that you'll discover in my fiction. If you enjoy creepy tales from Stephen King, you'll love my heart pounding, short stories too. This collection of true stories and short suspense will at the very least, creep you out!", "title": "Creepy: A Collection of Scary Stories\n      \n          (Creepy #1-3)", "url": "https://www.goodreads.com/book/show/12813544-creepy", "average": 3.32, "cover": "https://images.gr-assets.com/books/1331798793l/12813544.jpg", "reviews": 29, "authors": [{"url": "https://www.goodreads.com/author/show/3131402.Jeff_Bennington", "name": "Jeff Bennington"}], "type": ["Short Stories", "Fantasy", "Thriller"], "outlinks": ["http://www.goodreads.com/book/show/12813544-creepy", "http://www.goodreads.com/book/show/12857612-creepy", "http://www.goodreads.com/book/show/10467702-reunion", "http://www.goodreads.com/book/show/18590305-a-collection-of-ghost-stories-and-paranormal-short-stories", "http://www.goodreads.com/book/show/13120273-twisted-vengeance", "http://www.goodreads.com/book/show/31950437-federal-underground", "http://www.goodreads.com/book/show/16075736-a-collection-of-scary-stories"]}