{"ratings": 4811, "userreviews": [{"userName": "mark monday", "userReviewDate": "May 14, 2016", "userURL": "http://www.goodreads.com/user/show/131922-mark-monday", "userReview": "this is a 4 star book if you like it fast-paced and page-turning, if you want to stay up all night as you say to yourself Just One More Chapter, if you want an hour-by-hour narrative of an intrepid but often foolish group as they encounter heaps of perils and death in an abandoned, pyramid-shaped luxury hotel, full of hidden passageways and rooms full of disturbing secrets and maybe even another group, except those guys are a bunch of murderous jerks, and hey maybe there's even a serial killer, and some bombs and death traps and mutant rats and a mutant cat and all sorts of grisly surprises, it's that kind of book - you know, a fun book, a supermarket paperback you can read on a flight or at the beach; I had some fun reading it, the author is a professional, he knows his stuff, he crams the book full of details from his own life experiences and all of the research he obviously did beforehand, kudos to him for sure, he can make a story that is all Go! Go! Go! and that is chock-full of blood and danger.or maybe this is a 2 star book for you? too many info dumps, perhaps? an exciting fast pace but you maybe skipped a bunch of pages because those info dumps were sometimes hella boring and a bit eye-rolling? maybe the dialogue was eye-rolling too? maybe the characters were just a little too flat for you? maybe the backstories were just a bit too convenient and the coincidences just a bit too Oh C'mon Now Really? maybe that's why you gave it 2 stars even though you actually enjoyed it?"}, {"userName": " Danielle The Book Huntress (Back to the Books)", "userReviewDate": "May 02, 2011", "userURL": "http://www.goodreads.com/user/show/1570669-danielle-the-book-huntress-back-to-the-books", "userReview": "This was an odd book. Some aspects struck me as cheesy (listening on audiobook), but man it was intense, and the bad guy is a piece of work. Actually, there were other bad guys, which were a complete surprise (and they were complete jack*sses that made me want to jump into the story and do some b****slapping).The genre of this book seems to vary as I listened. At first, was it adventure? Then it was mystery. Then, horror...but supernatural or human monster variety? The violent parts come suddenly and are somewhat brutal. Nothing I couldn't handle, but I was gasping in horror and talking to myself as I listened on my commute. I'm working on my language, and I had to restrain myself from cursing at the bad guys. The characters didn't immediately strike me as memorable. But Mr. Balenger, well he earned my respect. Goodness gracious, what this man has gone through. But I have to say it really prepared him to be the hero in the ordeal that their little urban exploration jaunt into a long-abandoned hotel on the Jersey Shore will bring them to face. At first, he's a man who seems mysteriously knowledgeable and capable in emergency situations for a mere, mild-mannered reporter. And strangely bossy. But then, you know why. He comes through big time, and I definitely wanted to give him a high five. But he's also very human. The everyman sort of hero, kind of like John McClane from Die Hard, in a way. I also liked Amanda and Vinny. I felt bad for a few other characters who had some messed up crap happen to them.And the main villain. What a sicko lowlife scumbag, for sure! I mean, seriously??? What did I learn from this book?*Creepers, the nickname for urban explorers, are crazy as heck! *Every experience you go through in your life will come in handy, so pay attention!!*Minutiae and trivial facts might buy time if you can spout them off when you are dealing with bad guy losers who want to end your life.*Stay my butt out of abandoned old buildings.*People can be seriously messed up in the head!*There is a such thing as poetic justice.I didn't love this book (some parts just seemed cheesy to me), but it was an interesting read on audiobook. At any rate, I was sucked in big time."}, {"userName": "Chibineko", "userReviewDate": "Oct 29, 2010", "userURL": "http://www.goodreads.com/user/show/4436152-chibineko", "userReview": "I've always been fascinated by the idea of exploring abandoned buildings but have always been too chicken to do it for real. So you can imagine my excitement when I saw Morrell's Creepers, a fictional story about a group of urban explorers (aka \"creepers\"). About 24 hours later, I was finished. I just couldn't put it down! The story follows a group of urban explorers and one reporter as they prepare to explore one of the most mysterious hotels ever- the Paragon Hotel. Built by a reclusive architect, it was THE place to see and be seen at. When the hotel closed suddenly in the 1930s, the place soon fell into neglect. It is into this mystery that the plucky group enter into, only to find a bit more than what they were looking for. I absolutely adore this book. I've read it over & over again & the thrill is still there each time. Maybe not as sharp as the first time I read it, but it's still a fun read. I absolutely love the characters, especially since they are all written as flawed characters. Everyone has something to hide, some more than others. This book will appeal not only to fans of thrillers but also to those who love the idea of exploring dusty old buildings."}, {"userName": "Evans Light", "userReviewDate": "Nov 16, 2013", "userURL": "http://www.goodreads.com/user/show/7008067-evans-light", "userReview": "Actual rating is 3.5 stars.Over the top, full of unlikely events, coincidences and character motivations, this book nevertheless was perfectly paced and full of enough dramatic twists and turns to keep me flipping the pages until I finished the whole thing in a single setting.Like a strange hybrid of POSIEDON and the thriller movie IDENTITY, Creepers is non-stop action and a heck of a good time that keeps things moving along at such a fast and smooth pace you won't bother to take the time to think about the ridiculousness of everything - kind of like a Richard Laymon novel without the lechery.David Morrell is an incredibly readable writer, and even though I never got a good feeling for the actual layout of the hotel they were exploring (it seemed to grow larger and larger as the story progressed), the action was well written and gripping.Recommended if you're looking for a good pulpy page-turner. I liked it enough that I plan to read the sequel, Scavengers, next."}, {"userName": "Kilgallen", "userReviewDate": "Apr 02, 2012", "userURL": "http://www.goodreads.com/user/show/4840795-kilgallen", "userReview": "I found the first 1/4 of this book to be a little slow but I am glad I kept reading! It turned out to be a great page turner. As I finished the last few paragraphs I was struck by the realization that \"Creepers\" could be described as \"Goonies\" for grown-ups!"}, {"userName": "Nathan", "userReviewDate": "Mar 22, 2014", "userURL": "http://www.goodreads.com/user/show/29647641-nathan", "userReview": "I was excited to read this book. I was open-minded with flexible, not-too-high expectations. The concept of urban explorers sounded right up my alley. Also, it won the Bram Stoker Award.I was so disappointed. It failed to deliver on setting, atmosphere, character development, character motivation, use of language, plot, description...every aspect of storytelling except pace. A decade after I read it, this book stands out as one of the five worst reading experiences I've ever had."}, {"userName": "Charles Dee Mitchell", "userReviewDate": "Dec 21, 2012", "userURL": "http://www.goodreads.com/user/show/2272557-charles-dee-mitchell", "userReview": "I want four hours of my life back."}, {"userName": "Sakib", "userReviewDate": "Sep 07, 2016", "userURL": "http://www.goodreads.com/user/show/38866986-sakib", "userReview": "A really fast-paced thriller, and I've never read so furiously.After James Hadley Chase's books, this is the only thriller I've read without any kind of distraction from other books, or the temptation to try a first few lines of another book of my to-read list just because I don't like what I'm reading; it just isn't keeping my attention. No, that didn't happen with this one, and I've read two awesome books successively that swept me of my feet with plot twist, mystery and vivid description of an expedition gone horribly wrong, so wrong that at the end of the novel, the survivors were asked that what the hell had happened to them; the answer was \"The Paragon Hotel\" .The novel was vivid enough; at some places, eerily vivid I think. I haven't read the author's note at the end, but I know from the title of the note that David Morrell researched a lot, and he researched with love and enthusiasm.Somehow this novel is bound to make a reader get fond of history. The details presented here isn't boring at all; it's obviously dark, maybe fiction, maybe fictionalized, but I don't care... because it's damn good.The incidents of the book happened at night, and I read this book through the night, and if there was rain and storm here I would've been more caught up than I am right now. How I wish that happened! But I just couldn't wait for the sky to come down heavy, now do I?End of my kind-of-review-that-isn't-a-review-at-all. I hope this book gives many other readers an awesome journey and elements of surprise. Happy reading!"}, {"userName": "Ari", "userReviewDate": "Oct 19, 2014", "userURL": "http://www.goodreads.com/user/show/16646347-ari", "userReview": "4.5 starsFast paced and full of twists and turns, this turned out to be nothing like what I expected. On the premise, I thought I'd be diving into some sort of haunted story full of ghosts and thrills in an old hotel. I didn't get that, sure, but the psychopath that took center stage instead was pretty damn creepy--enough so to make me forgive the story for not being what I'd hoped!Just when you think you have it figured out, David Morrell surprises you, shocks you, stupefies you, and makes you want to keep reading until you devour the book and figure out the mystery behind this tale. I might need to get my hands on the second installment of the Frank Balenger books."}, {"userName": "Jonah", "userReviewDate": "Apr 16, 2009", "userURL": "http://www.goodreads.com/user/show/1485065-jonah", "userReview": "I found the premise of this novel quite interesting. I actually hadn't even read enough of the cover to know that it was in fact a fairly straightforward thriller, and in the opening I was expecting a supernatural horror (the appearance of strange wildlife and the suggestion of more furthered this suggestion), having found the book in the horror section. Well, while I did think the premise was quite good, I found the execution far less so. I found the characters to be flat and their dialogue to be awful. The three meatheaded \"villains\" were right out of a pulp cliche catalogue. They were seemingly dropped into the story with little motivation and were quick to ruthless, disproportionate violence. Their biggest apparent fear was the Crowbar, an magical item that seemed to have more violent potential than the handgun. I should have poured myself a shot every time \"Crowbar\" was said. I don't want to go on and on about what I perceived as the shortcomings of this novel, after all, I did enjoy it somewhat. Like most television shows, it's usually the character writing that puts me off - in this case the plot and setting were a lot of fun. I found the dialogue corny and unrealistic, and the character interplay and suspicions unlikely (who cares about the dead-end love triangle). If you're from close to my generation and familiar with Saturday morning cartoons, you will find this story very familiar, as it was only lacking two characters: Shaggy and Scooby-Doo. Oh, and the Mystery Machine. \"Jinkies!\""}, {"userName": "Susan", "userReviewDate": "Sep 22, 2017", "userURL": "http://www.goodreads.com/user/show/4548128-susan", "userReview": "The idea behind this book was interesting, even quite exciting....a group of people secretly enter long abandoned buildings to explore spaces which have been frozen in the past.It started out ok, but I'm not sure what went wrong, it just became brutal and silly....I think the story had potential, but the author, in my opinion, went in the wrong direction with it.I speed read the last third, as it just didn't hold my interest...."}, {"userName": "Kasia", "userReviewDate": "Mar 31, 2010", "userURL": "http://www.goodreads.com/user/show/2087548-kasia", "userReview": "So I finally got my hands on something written by the guy who created Rambo. Having expertise in firearms, executive protection, hostage negotiation and various other action skills and still suffering the death of his own child from blood cancer, Morrell is gifted when it comes to coming up with a good story and he has everything he needs to back up the action and the pain that fills his novels.Creepers is a dark thriller, full of suspense and casualties. When a group of action loves who love to infiltrate old buildings in search of the past makes the mistake of picking the wrong place at the wrong time. Past and future collides as the group gets trapped in an Aztec temple style Paragon Hotel, deserted and about to be bulldozed. Amidst the rats, ruins and secret hotels rooms awaits something that is not dead, something that will turn their lives inside out and splash the walls with fresh blood. The team consists of a college professor Robert Conklin, his two students Rick and Cora, friend Vincent and a new comer with mysterious past, Frank Balenger, well trained in survival and perhaps their only chance of getting out alive.Blinded by the dark, walking on rotten floors they climb higher and higher stirring the past with their discoveries. The original owner of the hotel was not an average person, but a peeping tom with secrets of his own. As the stumble into his domain they enter a trap as if they entered a portal to hell and what awaits them has no intention of letting anyone escape its clutches.Fast paced and very entertaining, it certainly kept me glued to the pages and the story went from creepy to bizarre but I loved the main concept and what was really lurking for them in the dark. It was almost a mystery book mixed in with a healthy dose of terror and suspense. I am looking forward to \"Scavenger\" which picks up with the main hero of this story."}, {"userName": "Cheryl", "userReviewDate": "Dec 22, 2014", "userURL": "http://www.goodreads.com/user/show/22026875-cheryl", "userReview": "Fast-paced mystery/thriller about a group of \"creepers\" (people who explore abandonded buildings) who get more than they bargained for during an exploration of an abandoned hotel in Asbury Park, NJ. There are a few twists in the plot, as they discover things about the hotel's builder and the events that happened in the hotel. A fun, fast read."}, {"userName": "Tara Lynn", "userReviewDate": "Feb 23, 2009", "userURL": "http://www.goodreads.com/user/show/1327118-tara-lynn", "userReview": "Eh. To me this had the feel of a Made-for-TV movie on the Sci-Fi Channel. There really wasn't enough there to draw you in. Quick read, though."}, {"userName": "Sarah", "userReviewDate": "Mar 14, 2011", "userURL": "http://www.goodreads.com/user/show/3124054-sarah", "userReview": "From the creator of Rambo comes Creepers, David Morrell's first novel featuring hero Frank Balenger.\"Creepers\" is a slang term for urban archaeologists who explore abandoned buildings that are banned from the public or awaiting demolition. The building in question is an old hotel built by an agoraphobic millionaire located in the ghost town of Asbury Park on the Jersey shore. A group of four creepers is entering this ancient hotel accompanied by reporter Frank Balenger, who will honor them in the New York Times anonymously as the expedition they are about to embark on is highly illegal. However, far more than timeless artifacts from the turn of the century will greet the creepers as they face the most horrible nightmares of their life once inside the hotel.With a story that takes place within a timespan of several hours, Creepers is absolutely horrific, gripping, and incredibly fast-paced. Not only is the premise highly intriguing, but the wacky personality of the hotel and the events that soon transpire will raptly keep your attention. Morrell is an amazing storyteller and unfolds the mystery within Creepers rather gracefully; seasoned readers may or may not be able to pinpoint the source of evil as we near the end. Creepers is action-packed but throws in historical references, a hint of romance, and mind-numbing terror that nicely blend together for a truly unique and gratifying reading experience.In fact, David Morrell presents such an interesting subject on \"Creepers\" that you can't help but research and read more into it upon completion of the novel. Morrell includes several website links at the end of Creepers that will both spark and feed your desire to learn more about urban archaeologists and their adventures.Since the release of Creepers, Morrell has written a second novel featuring Frank Balenger called Scavenger (2007) about the ultimate hunt for a time capsule. Scavenger has definitely made it onto my wish-list for future reading. David Morrell's latest stand-alone novel is The Shimmer (2009).For more book reviews visit http://dreamworldbooks.com."}, {"userName": "Andy", "userReviewDate": "Mar 10, 2010", "userURL": "http://www.goodreads.com/user/show/3413766-andy", "userReview": "As they say, \"An image is worth a thousand words.\". Well for this book, only 388 pages worth. But the sheer suspense this novel brings to the reader makes it worth every drop of sweat you perspire, every nail you bite off and every time you feel butterflies in your stomach.In simple terms, while you read this book, you become your own worst enemy. You mind will bring out the dark side of your imagination, exposing the horrible thoughts inside your head. While the book may not go as far as your mind does, the sense of unknowing will defiantly keep you wondering, “Why didn’t I think of that?”The novel needs no introduction, and doesn’t have one either. The author throws you instantly into the situation, keeping you wondering the whole way through. With many holes to how it all came to be, you create your own prelude to the story, until the author slowly pieces it all together for you. Believe me, you cannot guess anything in this story. It doesn’t take long for them to get into the hotel, but takes even less time to discover some horrors about it. The author is really good at misleading you, like a van painted on the side, “Free Candy”. As the famous quote states, “You think you know, but you have no idea.”They say you can never be too cautious, but this still didn’t help the creepers from the dangers within. The slightest actions caused them horrific dangers, things they can only regret, things you wouldn’t wish on your worst enemies.If you thought the number 666 was bad, I think I can say 610 is worse. Opening this door was like opening Pandora’s Box, letting out extensive amount of troubles. If only the characters could see even one of them. I think “Do Not Disturb” was a very appropriate sign hanging on the door. If you thought putting the sign on your door kept everyone safe since you’re not a morning person, I think I can say behind Room 610, there is something that can even wake you up. No, it’s not coffee. You will only need that cup of coffee once, to wake up after a long sleepless night once you finish this book."}, {"userName": "Dolceluna", "userReviewDate": "Aug 29, 2017", "userURL": "http://www.goodreads.com/user/show/69990469-dolceluna", "userReview": "I \"creepers\", dal verbo inglese \"to creep\" (che significa letteralmente strisciare, infiltrarsi) sono una sorta di speleologi urbani che organizzano, spesso in maniera segreta e illegale, spedizioni in edifici abbandonati alla ricerca di tracce del passato. Un passato che li affascina e li ossessiona.Insomma, un'idea perfetta sulla quale costruire un bel romanzo horror.E infatti, per buona parte del romanzo, l'atmosfera, oscura, \"polverosa\", elettrica, non manca, e la lettura si lascia divorare. Una notte, un professore universitario, tre dei suoi ex studenti e un giornalista del New York Times, s'infiltrano, tramite un tunnel sotterraneo, nel Paragon Hotel, un tempo lussuoso hotel, chiuso da decenni e destinato a essere demolito.Ben presto si renderanno conto che avrebbero fatto meglio a non entrarci, ma sarà troppo tardi, e le scoperte che faranno li trascineranno in un baratro di terrrore sempre più profondo.Attenzione però, di sovrannaturale, qui non c'è traccia. Tutto si muove in questa atmosfera buia, condito da un ritmo serrato e cinematografico che mi ha ricordato molto quello dei migliori romanzi di Sebastian Fitzek.Peccato che nelle ultime cento pagine l'atmosfera si disperda un po' e lasci spazio a un intreccio continuo di azioni, a tratti confusionario, che occhio e mente faticano un po' a seguire.Il risultato resta più che buono e originale è l'idea sulla quale l'autore ha costruito la trama principale: l'ossessione, maniacale e rischiosa, del passato. Il passato come fuga dal presente, il passato come nostra traccia da lasciare ai posteri, il passato per dimostrare che ci siamo stati. Ma anche il passato che, in queste pagine, riesce a fare paura in tutto il suo fascino."}, {"userName": "Goran Markov", "userReviewDate": "May 07, 2013", "userURL": "http://www.goodreads.com/user/show/19331672-goran-markov", "userReview": "This is a great novel by David Morrell! A very interesting and mysterious writing, a thriller that actually thrills.It is a story about a group of people, \"urban explorers\" or \"creepers\", as they are called, that research abandoned and long closed buildings for their personal satisfaction and pleasure, as well as documenting photographs and their experiences and history. Being a thriller, you've got everything you could possibly wish for...mystery, sudden changes of situations, antagonists, action, psychological pressure...and everything masterfully executed by David Morrell. This novel is the proof why Morrell is such a respected thriller writer.The atmosphere and the setting of the novel are so nicely set that you just get sucked into it. Also, the story is written in real time, meaning that everything happens in eight hours, with no flashbacks, no time changes...with every single event bringing more tension to the already complicated reality. Highly recommended."}, {"userName": "Michael", "userReviewDate": "Feb 17, 2009", "userURL": "http://www.goodreads.com/user/show/1157039-michael", "userReview": "This book was pretty exciting and fast-paced, but did not have much substance, in my opinion. It provided a unique look at history from the perspective of an urban explorer, which was pretty cool. But the characters in the story were not very fleshed out. It was also difficult to identify with any of them, because we never really knew much about them, and never found out. This is probably just as well, because, like in many thrillers, all of the characters were dead by the end of the book, except for two. Essentially, these people sneak into an old building, whereupon an old weirdo begins killing everybody in horribly bloody ways. Kind of gross. The writing was pretty good, but the story needs work. Enjoyable, but left me wanting much more."}, {"userName": "Myriah", "userReviewDate": "Jan 23, 2017", "userURL": "http://www.goodreads.com/user/show/2295756-myriah", "userReview": "Terribly disappointing. The beginning, while poorly written in that overly-explanatory, that-sentence-was-unnecessary, this-dialogue-is-unrealistic sort of way, still was promising enough with the set-up and backstory that it seemed as though the plot itself would be interesting.IT WAS NOT. All of the intriguing lead-up (the mysterious hemophiliac hotel owner, the strangely preserved rooms) never went anywhere! Random characters start showing up and it ends up being just a series of \"shocking\" \"action\" sequences, as opposed to any real storyline.Extremely disappointing, never lived up to its potential, and honestly, a waste of time."}, {"userName": "William Scott", "userReviewDate": "Jan 06, 2015", "userURL": "http://www.goodreads.com/user/show/21521551-william-scott", "userReview": "All those four and five star ratings? Have you people been reading Dick and Jane books from Kindergarten? Zero depth in the characters! I could care less when they died as he did nothing to make them seem real. So many mistakes as well, do a little research. There was nothing about this book to make it deserve 2 stars let alone 3 to 5!"}, {"userName": "Chris", "userReviewDate": "Dec 07, 2015", "userURL": "http://www.goodreads.com/user/show/31251133-chris", "userReview": "This has to be one of the best books I have read. The author has a style of writing that makes you feel as if you are actually in the story. There was enough description in the book to know exactly what was being done in each chapter."}, {"userName": "Gerrie Finger", "userReviewDate": "Dec 30, 2010", "userURL": "http://www.goodreads.com/user/show/2315241-gerrie-finger", "userReview": "Morrell never disappoints, and this premise is solid. He executed what he set out to do, but, the big BUT, is that I couldn't suspend disbelief. Too much going on, I think. I'll always finish a Morrell book because his writing is never boring."}, {"userName": "Shell The Belle ", "userReviewDate": "Aug 31, 2013", "userURL": "http://www.goodreads.com/user/show/15880350-shell-the-belle", "userReview": "Good read, spooky at first, bit gruesome further on, liked the beginning more than the middle or end.Good ending though, look forward to reading the sequel !!"}, {"userName": "Crystal Craig", "userReviewDate": "Jan 19, 2011", "userURL": "http://www.goodreads.com/user/show/4729956-crystal-craig", "userReview": "I read this book a few years back and I want to reread it. It's a book that's stayed with me. I recommend it all the time."}, {"userName": "Wayland Smith", "userReviewDate": "May 12, 2018", "userURL": "http://www.goodreads.com/user/show/16181797-wayland-smith", "userReview": "Five people get together to explore a luxury hotel, abandoned for decades. Notionally, this is a group dedicated to \"urban exploring,\" going places they aren't supposed to go. But one is lying about their motives, and another about who they are. That would be enough to set up for some tension and twists, but more twists await. The explorers find strange tableaux in the abandoned hotel rooms, which don't jibe with the place being gradually closed down. They learn more secrets about the eccentric millionaire who owned, designed, and lived in the hotel. There is another group stalking them with murderous attitude and evil intent. And they don't end up being the main threat. Morrell is a great thriller writer. If you don't know him, you probably know his most famous character, Viet Nam vet John Rambo. Yeah, that one, who first appeared in the novel First Blood. I liked the classic action movie, but the book is deeper and a better story. This one is mostly good. My only complaint is the huge coincidence of the two groups ending up being around at the same time. I didn't quite buy that. The rest of it is great thriller/tension and a good read."}, {"userName": "Lisa", "userReviewDate": "Aug 20, 2017", "userURL": "http://www.goodreads.com/user/show/8066053-lisa", "userReview": "Great story filled with suspense. Well written to provide the reader with a vision of old hotel. Details that allow you to envision the creepiness and history of where the story takes place. Would be a great movie"}, {"userName": "Lanie", "userReviewDate": "Mar 10, 2014", "userURL": "http://www.goodreads.com/user/show/1838636-lanie", "userReview": "This book was recommended to me. I'd never heard of David Morrell, and if it wasn't recommended, I wouldn't have picked it up. The magic of goodreads. First, it's about an abandoned hotel and about 5 urban explorers looking for archeological finds. That intrigued me immediately. The slang term for these explorers is \"creepers\" and it's a highly illegal activity, so that makes for great fiction in my book. They are joined by a reporter, Frank, whose motives are to write an article, but his entire agenda is not disclosed to them, but is revealed later. As the history of the hotel and in particular the man who maintained and owned it, Carlisle, is revealed, it adds a new air of mystery of 'what happened to this beautiful place'? Carlisle was a hemophiliac, and somewhat of a recluse, and the group finds some police reports to give clues about what strange events took place in the hotel. There are a few more surprises in the book, but the knowledge of that history comes into play, and what they find is not what they expected. A great thrill ride - I basically read this in one day. There were so many things that intrigued me about this. The idea of urban explorers & the dangers of an abandoned building in the dark, Frank's real agenda, and of course the fascinating history of this once luxurious hotel. The characters were good, and the dialogue was realistic. Once I bought into the whole idea of where they were and what they were doing, I was totally hooked. I wanted to find out more, and I wanted them to be okay. It was a great story, well constructed, plenty of suspenseful moments, surprises, and as the story unfolded I was more fascinated. The hotel itself, The Paragon, is a character in this story as well. I related her to an aging beauty - one who was beautiful and grand in her heyday but now has become dilapidated, rotten, and forgotten through the evils of time. It was great fun to imagine what she would have looked like when Carlisle first built her. He must've had a great love for the hotel, and it was fascinating to learn it's history.The only thing I had a problem with was the character of Tod. He was one of three would-be thieves who leaves the creepers for dead, then returns to join them when his other two partners in crime go missing. I felt the group was too quick to take him along, after he had ill motives. I felt that he should've been watched a little more closely, although he does prove himself to be useful in certain ways. I guess every story has to have at least one undesirable character (other than the villain) that everyone has to tolerate. I don't know where this ranks among other of David Morrell's books, but I liked it a lot and I'd be willing to read more of his books."}, {"userName": "Helena Nguyen", "userReviewDate": "Dec 18, 2013", "userURL": "http://www.goodreads.com/user/show/23691445-helena-nguyen", "userReview": "1. Creepers2. David Morrell3. A group of 5 adults go on an adventure in an abandoned hotel that was built in 1901 called the Paragon Hotel in New York. Once they get into the hotel, they visit a couple rooms just to see what things are left behind and they discover that there has been a murders, suicides, or some type of death or tragic story within each room. Their objective is to find a hidden vault within the hotel until their lives are at stake.4. Courage- I think courage played a role in this book by the character Balenger. He was the character who's smart, a risk taker and knows how to handle situations under pressure when it's between life or death. There's a scene in the book where a member of the group falls through the rotted floors, Balenger risks his life to save him. \"Balenger charged toward the open door and dove, landing on his stomach at the entrance of the murky room. The impact sent his hard hat clattering along the floor, its light twisting in sickening angles. He grabbed Vinnie's knapsack where it has caught the edge of the jagged hole in the floor.\" (84)Death- Death played a huge role in this book because it was everywhere. In these hotel rooms, so many crimes were committed, including murders, suicides, thefts, etc. Everything that these group members went through, it threatened their lives. Their lives were threatened the moment they walked into that hotel. This quote is when they found and read the police reports that were from the Paragon Hotel. \"Rick gave the missing-person report back to Balenger and indicated a yellowed page from a newspaper. 'I've got one of the murders. The thirteen-year-old boy who took a baseball bat to his father's head while he was sleeping. Hit him twenty-two times, really bashed his brains in. Happened in 1960. The boy's name was Ronald Whitaker. It turns out his mother was dead and his father sexually abused him for years..'\" (105)5. If you like thrillers, mystery and adventure, you would definitely enjoy this book. It was a really good book and made you want to keep reading."}, {"userName": "Gina", "userReviewDate": "Mar 31, 2009", "userURL": "http://www.goodreads.com/user/show/985335-gina", "userReview": "I was a few chapters in when I finally realized I'd read it before. Yet, I can't find my review. I believe it was one I lost when my computer crashed. Anyway, I remember it being a little more scary the first time around. This time, not so much. The suspense is really there, though. I agree with the majority here - while the suspense was good, the creepy factor (deformed rats and cat) kind of slipped through the readers fingers and nothing comes of it. What are we supposed to make of it? Inbreeding? There's nothing further on the subject, almost like the author forgot about them, even though the cat attacks one of the 'bad guys', it still wasn't enough. Finding the girl in the vault was a little much, but I get the factor. Okay, so some seriously deranged guy has been kidnapping and killing women for 30 years. That's the entire plot? It seems that Morrell could have done so much more with that. Once you get past the suspense, the plot is too simple. It actually bugged me a little that it was so simple. I do, however, like the twists Morrell put in - how Frank posed as a reporter when he was actually scouting, supposed to go back to steal the gold coins for himself and the professor who lost his tenure, how he was once a cop who is now looking for more money so that he can continue his search for his missing wife, the wife who disappeared after a meeting to see if the hotel could be bought out. Those twists made the story interesting. The characters getting away from the madman, seeking a way out, made the story interesting. The suspense of it all, made the story interesting. Not 5 stars. If GR had a half-star rating, it would be a 3.5. A little more than a 3, not enough for a 4. So, I guess it's a 4 for me."}], "description": "On a cold October night, five people gather in a run-down motel on the Jersey shore and begin preparations to break into the Paragon Hotel. Built in the glory days of Asbury Park by a reclusive millionaire, the magnificent structure - which foreshadowed the beauties of art deco architecture - is now boarded up and marked for demolition.The five people are \"creepers,\" the slang term for urban explorers: city archeologists with a passion for investigating abandoned buildings and their dying secrets. On this evening, they are joined by a reporter who wants to profile them - anonymously, as this is highly illegal activity - for a New York Times article.Frank Balenger, a sandy-haired, broad-shouldered reporter with a decided air of mystery about him, isn't looking for just a story, however. And after the group enters the rat-infested tunnel leading to the hotel, it becomes clear that he will get much more than he bargained for. Danger, terror, and death await the creepers in a place ravaged by time and redolent of evil.", "title": "Creepers\n      \n          (Frank Balenger #1)", "url": "http://www.goodreads.com/book/show/21829.Creepers", "average": 3.64, "cover": "https://images.gr-assets.com/books/1399476928l/21829.jpg", "reviews": 563, "authors": [{"url": "https://www.goodreads.com/author/show/12535.David_Morrell", "name": "David Morrell"}], "type": ["Thriller", "Horror", "Fiction", "Mystery", "Suspense"], "outlinks": ["http://www.goodreads.com/book/show/21829.Creepers", "http://www.goodreads.com/book/show/929914.Creepers", "http://www.goodreads.com/book/show/11979842-creepers", "http://www.goodreads.com/book/show/9713800-paragon-hotel", "http://www.goodreads.com/book/show/929907.Creepers", "http://www.goodreads.com/book/show/21838.The_Brotherhood_of_the_Rose", "http://www.goodreads.com/book/show/15790878-murder-as-a-fine-art", "http://www.goodreads.com/book/show/113110.First_Blood", "http://www.goodreads.com/book/show/21837.The_Fraternity_Of_The_Stone", "http://www.goodreads.com/book/show/21832.The_League_of_Night_and_Fog", "http://www.goodreads.com/book/show/37581710-the-company-of-demons", "http://www.goodreads.com/book/show/40024832-empire-of-sin", "http://www.goodreads.com/book/show/8343548-the-bricklayer", "http://www.goodreads.com/book/show/40193155-among-the-wicked", "http://www.goodreads.com/book/show/23818400-the-snow-garden", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/23157833-almost-dead", "http://www.goodreads.com/book/show/33555347-crime-scene", "http://www.goodreads.com/book/show/30249521-fatal-frost", "http://www.goodreads.com/book/show/40266676-remains-of-innocence", "http://www.goodreads.com/book/show/34330657-finding-claire-fletcher", "http://www.goodreads.com/book/show/28824403-outfoxed", "http://www.goodreads.com/book/show/23957469-huntress-moon", "http://www.goodreads.com/book/show/40204087-the-deepest-secret", "http://www.goodreads.com/book/show/35115882-what-the-dead-know", "http://www.goodreads.com/book/show/40267317-ragdoll", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/39791173-the-girl-before", "http://www.goodreads.com/book/show/40205081-last-witness", "http://www.goodreads.com/book/show/40205040-dead-weight", "http://www.goodreads.com/book/show/18903409-weekend-warriors", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/40193809-eye-for-an-eye", "http://www.goodreads.com/book/show/27239265-the-short-drop", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/17623604-you-only-live-twice", "http://www.goodreads.com/book/show/17377392-thunderball", "http://www.goodreads.com/book/show/17284593-casino-royale", "http://www.goodreads.com/book/show/17623578-for-your-eyes-only", "http://www.goodreads.com/book/show/40193858-the-cuckoo-s-calling", "http://www.goodreads.com/book/show/17304110-live-and-let-die", "http://www.goodreads.com/book/show/18780375-dr-no", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies", "http://www.goodreads.com/book/show/17379070-moonraker", "http://www.goodreads.com/book/show/18799804-diamonds-are-forever", "http://www.goodreads.com/book/show/40205231-the-spy-who-loved-me", "http://www.goodreads.com/book/show/17377384-from-russia-with-love", "http://www.goodreads.com/book/show/40243961-the-cape-refuge-collection"]}