{"ratings": 34758, "userreviews": [{"userName": "karen", "userReviewDate": "Sep 02, 2011", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "it is totally okay to float old reviews when you suddenly have a picture of yourself and the author to attach to them. also, when you are bored. but only once a day. anything more than that becomes boring. or desperate.one of the best books i have read, ever.and exactly what i was looking for when i posted my query in my very own readers' advisory group. so, thank you, james, this is a perfect suggestion to the kind of book i was looking for. and i am going to immerse myself in tom franklin's backlist and tell all my friends, etc. but right now,i don't know how to review it. with a book this meaty, i find it difficult to do plot-reviews without giving away too much, as i get overexcited about sharing the book. will does a good job, though, with dignified restraint. i can only do tone-reviews of something that kicked my ass so hard. remember when stephen king paid a lot of attention to the craft of writing, before he became a machine of churning out books editors were afraid to edit because he's stephen bloody king, and he \"knows what he's doing??\" stephen king became stephen king because he started out as a careful storyteller. he always had a knack for building and filling a scene, creating characters with dimensions, and building tension around them that was more powerful because the characters were fleshed-out and not just stand-ins for something for the action to happen to. this is what a lot of modern horror writers forget, that it's not just about scary things happening, it is about scary things happening to characters who have begun to matter to the reader.and this is not a horror novel, but the tremendous larry ott character does read a lot of stephen king throughout this novel, as a kid and as an adult, and the childhood scenes read a lot like stephen king, to me, before some sort of alien or clown comes to get 'em. the coming of age, eye-opening stuff, far from idyllic, is so richly detailed. and larry ott and silas jones are characters to care about, despite all their mistakes and how you wanna just shake both of them sometimes.the story is a different kind of horror. life is brutal with murder and racism and persecution and hollow loneliness and missed opportunities. this is such a frustrating situation. books like this kill me - when characters endure years of isolation and heartache that could be resolved with one conversation. but by \"kill me\", i of course mean \"delight me.\"okay, some basic plot.larry ott is the town whipping boy, ever since the first girl he took to a drive-in vanished without a trace. now, he is 41, lives in his childhood home, while his mother lingers in a nursing home, his abusive father is dead, and he buys a lot of books through the mail. already ostracized, vandalized, and avoided - when another girl goes missing, suspicion naturally falls on him.silas jones is now the town constable, returned after many years away. his is a story of life on the other side of the color divide, with a single mother trying to raise him, essentially squatting in larry's father's shed, where they strike up a boyhood friendship ultimately marred by larry's father and the cruelties of adolescence.larry as a kid is heartbreaking. so earnest, so smart, so reaching out for affection. silas - oh, god - his mother's story, so buried in his own, is worth the whole of the book. i am choking with tenderness and silas-anger.i just loved this book. the mystery, the characters, the quiet of it all. it is sad, but resigned to its own sadness. anything else i could say would just be inarticulate squawking.thanks to dana and the harpercollins half-off hook-up!"}, {"userName": "PirateSteve", "userReviewDate": "Mar 17, 2017", "userURL": "http://www.goodreads.com/user/show/46000051-piratesteve", "userReview": "What does it say about a person when their mother feels the need for prayer they find a friend? Scary Larry Ott won't blame you if you don't like him.He knows what people say about him... But the first ladies need support and Larry may as well be the one. Another 5 star book from Tom Franklin."}, {"userName": "Stephen", "userReviewDate": "Jun 26, 2011", "userURL": "http://www.goodreads.com/user/show/1413439-stephen", "userReview": "Gorgeous... Gorgeous and dripping with emotion and ache...This story OWNED ME from the opening page and LARRY OTT is among the most endearing, heart-wrenching characters I've come across in a long, long time. That I connected so well with both the story and its main character surprised me because, being born and raised in Vegas, my own life experience is so vastly different from both Larry and the town of Chabot, Mississippi, where the story takes place. I give heaping mounds of credit to author Tom Franklin for making this “alien” world come alive for me. Larry Ott is a 41 year old caucasian man living alone in his parents house in Chabot, MS, where he eats mostly McDonald’s and KFC (by himself), owns an auto repair shop (with no local customers) and loves, loves, loves to read, especially Horror novels, of which Stephen King is his favorite. The reason for the above two parentheticals is that Larry is the town pariah. 25 years ago, when Larry was 16, a high school girl named Cindy Walker disappeared while on a date with Larry. While Larry was never arrested or formally accused of a crime, his reputation as the weird, horror book reading loner was enough to earn him a guilty verdict and a permanent shunning from the town. Larry feels this isolation down in his bones and Franklin casual, matter of fact description of it sliced right through me. Now Larry spends his days working in a shop with no customers, living alone with his chickens and having no visitors except for (i) drunk teenagers throwing bottles at his house and (ii) the County Investigator, Roy French, harassing him whenever a crime occurs. Beyonf that, Larry just sort of floats through the days, even treating his house as if he were only a guest. \nHe acted more like a curator, keeping the rooms clean, answering the mail and paying bills, turning on the television at the right times and smiling with the laugh tracks, eating his McDonald’s or Kentucky Fried Chicken to what the networks presented him and then sitting on his front porch as the day bled out of the trees across the field and night settled in, each different, each teh same.\n That's Larry’s life. Silas “32” Jones, is the African American Constable of Chabot, MS and the sole law enforcement officer in the area. Silas was a high school baseball star with dreams of going pro until injury cut his prospects short. For a brief time in high school, Silas and Larry were friends. However, since the disappearance of Cindy Walker, Silas has avoided all contact with “Scary Larry” Ott. Silas is another damaged man with lots of baggage of his own. Silas often regrets the way he and the town treat Larry, but has become trapped in his own circumstances and is too weak to change. Viewed as a local hero, his days, while better than Larry’s, are spent writing tickets, directing traffic and acting as a glorified meter maid. The town of Chabot is another amazing character in this story and Franklin’s charming, understated prose is perfect. I listened to the audiobook and by the time you hear his words they've already vaporized and settled onto your brain like a flower-scented mist of small time life. His descriptions of Chabot and its slow, small town death are magical and precisely what they should be. \nHe passed a clothing store that had gone so long without customers it’d briefly become a vintage clothing store without changing stock.\nThere's also a whole supporting cast of interesting, well drawn southern folks who come across as varying shades of good and bad. In other words, normal people and Franklin's unobtrusive prose has you able to visualize each one after spending only a few minutes with them. In fact, the atmosphere of the book, the feel of the characters and the pace and tone of the narrative reminded me a lot of To Kill a Mockingbird, which is high praise indeed as it is one of my all time favorites. However, where Atticus Finch made you wish you were his son, Larry Ott will break your heart and make you long to be his friend. For all that, this is NOT a depressingly morose sob-story, though I did tear up more than once. This lack of melodrama is the true gift of Franklin's novel. I don’t know how he did it, but despite the often crushing sadness that follows Larry around and how sorry you feel for him from deep in your soul, Larry never wallows in his trials and the story never becomes overtly sentimental. It is a joy to follow Larry going through his day and you just keep hoping things get better for him. As far as the main thrust of the narrative:When another girl disappears, all fingers point towards \"Scary Larry\" and Silas is put in charge of the investigation. Through a series of lengthy flashbacks we are taken back through the childhoods of both main characters, their eventful meeting and brief friendship and the tragic events surrounding the previous disappearance that forever changed their lives. At its heart, this is the story of Larry and Silas and how circumstances, personal dreams and other peoples' perceptions can create barriers that are difficult to overcome. It's a story of good and evil, persecution and redemption, friendship and betrayal, secrets and truths. It's a story of life and one of those rare books that make you feel the world around you. I know I am gushing so I will just end by saying...6.0 stars. HIGHEST POSSIBLE RECOMMENDATION!!P.S. If you have the opportunity to listen to the audio version of this read by Kevin Kenerly, take it. His narration was masterful and fits the narrative like a glove."}, {"userName": "Jeffrey Keeten", "userReviewDate": "Jun 06, 2012", "userURL": "http://www.goodreads.com/user/show/3427339-jeffrey-keeten", "userReview": "M, I, crooked letter, crooked letter, I, crooked letter, crooked letter, I, humpback, humpback, I.--How southern children are taught to spell Mississippi\nTom FranklinMy wife's family is from Prentiss, Mississippi not far from where the action of this book takes place. When my wife's grandmother died a few years ago we went down for the funeral. This was my first time in Mississippi and I remember a couple of things about the experience. First, this is small town USA and there were two funeral homes. One for black people and one for white people. When you ain't from around there you might accidently go to the wrong one.After the funeral we ended up back at grandmother's for a meal. The women stayed out in the kitchen except for when they were bringing more food around or filling up my ice tea. I swear my ice tea never got more than inch down from the rim. The men asked me questions. One thing they were really concerned about was how the South was perceived by a Yankee such as myself. I trotted out my bona fide that my gg grandfather Keeten was a Confederate soldier from Virginia. To people in Mississippi Virginia is Northern, so that bought me barely a dollop of legitimacy. My wife had warned me not to be outspoken politically. These weren't blue dog Democrats, but deep red Mississippi mud Republicans, and so I skated over the issues that I knew would cause a ruckus. They insisted to me how much Mississippi had changed, as if I were an ambassador from the North, and would go home and tell everyone that the South has become progressive. I agree, no doubt, the South had progressed in the last 150 years. The people were super. Everyone I met was sincere and every sentence was scented with Southern charm, but two different funeral homes tells me that the South still has some wrinkles that need smoothed out. I loved my time down there and can't wait to take a family vacation through Mississippi, Alabama, and Georgia. I know, I know I'm supposed to be writing a book review not reminiscing. There is something about reading books set in the South that makes me want to tell stories. In junior high I was the kid that ordered too many books from Scholastic. I can still feel the shame reddening my neck and my cheeks as I walked up to the teacher's desk to get my book stack that was larger than the rest of the class put together. I was only someone's best friend when they needed help with their homework. So I did identify with the feelings of ostracization that Larry Ott was feeling in this novel. I was undersized too, one of the smallest guys in my class. I wore glasses and scurried around like a rabbit between classes. Small towns are tough and small schools are even tougher. There is no escape. In big schools you can blend in better, and also with a larger population you increase your chances in finding a \"freak\" like yourself. When people extol the virtues of their small school system I always think to myself they're great if your kid is designated normal. Larry Ott gets accused of a crime, a girl is missing. He is in the frame. People aren't accusing him just because he is weird. Circumstantial evidence does make him a legitimate suspect. The problem is when he is cleared of all charges the town does not forget. Another person, maybe a person that sat at the \"cool kids\" table could have moved on with their lives with only a passing reference to the unfortunate circumstances. Not Larry, not Scary Larry. Unfortunately for Larry the people of his small town America did not like him. He had been weighed and measured and found to be too weird. When another girl goes missing Larry is the number one suspect because what lingers in everyone's mind is the unfinished business from the first missing girl. Sympathy for his plight is not offered. He is, as he has been his whole life, alone. Silas \"32\" Jones is the closest Larry ever had to a friend. Their lives are entwined in a way that neither boy is fully aware of, yet there are phantom ghosts of information at the periphery of their consciousness that as more facts are revealed they don't question the results. They realize they've always known. When Larry lends Silas a rifle Silas becomes his friend for a short while. Silas likes the stories that Larry tells him from the pages of Stephen King, but refuses to even try to read a book. It is too much like school work. When Silas becomes a star short stop, known as 32 by everyone, Larry is just an embarrassment to him. Silas will look back with more than a little regret that he didn't lay a friendly hand on Larry's shoulder or ask him to join in social activities. He was uniquely positioned to change Larry's life forever. His gift of athleticism empowered him to bring Larry into the social group. His offer of friendship would have forced people to see Larry differently. By some quirk of fate I started growing. By the time I got to high school I had evolved from being one of the shortest people in my class to being the tallest person in my class. As it turned out I was coordinated enough to play sports and did well. Like Silas, when people would see me in the local diner or on the street or in the hallway they would call out my jersey number, 12. The people I needed so desperately when I was so lonely all of a sudden were my \"best friends\". It was simply ridiculous. I can score twenty points in a basketball game, and miraculously I am cured of being the number one class freak. Growing up I was Silas and Larry. I understand all too well their fallacies and their insecurities. I felt Larry's burning shame as if my own cheeks were inflamed. I felt Silas's guilt as if it were resting on my own shoulders. Franklin keyed into elements that I have given a lot of thought to. I can tell from reading other reviews that this book had a profound impact on people. It certainly made me plow over old ground. My one complaint is that I feel that Franklin could have put more meat on the bone. It does not have the complexity of a book that I could wholeheartedly agree is a modern classic. I really enjoyed another book by Franklin called Hell at the Breech.If you wish to see more of my most recent book and movie reviews, visit http://www.jeffreykeeten.comI also have a Facebook blogger page at:https://www.facebook.com/JeffreyKeeten"}, {"userName": "Rebbie", "userReviewDate": "Jan 20, 2017", "userURL": "http://www.goodreads.com/user/show/6582211-rebbie", "userReview": "Poor Larry Ott. He's a beautiful soul whose wings have been clipped; he's damaged and hurting after a lifetime of being ridiculed, being thrown to the wolves, being falsely accused of a horrific crime.And yet he doesn't lose his sweetness or optimism, even after his only childhood friend, Silas, ditches him out of fear of losing his own newfound popularity. Silas has to accept how poorly he used to treat Larry while they were growing up, and it's not easy to do. The author did a magnificent job of facing this raw pain head-on.All Larry ever wanted is one true friend, but life kicked him where the sun doesn't shine when it comes to that wish too. I just wanted to wrap him up in a blanket and hold him. Make it all better because someone as kindhearted and gentle as he is shouldn't have to face the cruelties of this world alone.People who are alone become a target, an easy mark for bullies and people who can wildly spin things out of control at the drop of a hat. The other people who come into Larry's life have their own twisted agenda, but Larry's loneliness makes it difficult to turn anyone away. This is crucial to the layout of the story.I almost gave this 4 stars because the ending is too neatly tied together, but the character development is true perfection, so it's worth the extra star."}, {"userName": "Arah-Lynda", "userReviewDate": "Aug 16, 2017", "userURL": "http://www.goodreads.com/user/show/5859453-arah-lynda", "userReview": "So often when I read a book I cannot wait to talk about it, eager to hear other people's takes and share my own thoughts, but sometimes, as in life, the unexpected occurs.  A book has been read all right and it affected me but still I need to let it rest a while, need to think on it, recover from it.I found myself looking back, being brutally honest in my reflection.  Have I ever succumbed to group think and if so how often have I hurt others?  And even though in truth I have never really fit in with groups or cliques or the like, that experience in itself, makes me more prone somehow to the lure of community.  At what cost?   I am not without blemishes.  I strive to be a better person today.  Each day.Group think is dangerous, it holds open no doors for freedom, fairness, equality or justice.  It just is.  I am humbled by Larry Ott.  He seeped in somehow.  He reminded me that others bore a cross heavier, less forgiving than my own.   Of course I always knew that.   Still  that knowledge had lurked for too long in the shadow of my own fear, and uncertainties.  Larry Ott can not be ignored and in not doing so, one must also consider Silas. Once they had been the best of friends, secretly of course, but still.  Larry was white, Silas not so much.  They met in private, had fun, explored. But that was before Larry’s father intervened, before the  girl went missing, the girl that Larry had had a date with that night.  The girl that no one has seen since.  Larry of course maintains his innocence, and given the evidence was circumstantial at best, he also maintains his freedom.  But the court  of public opinion can be harsh, does not require the same hard evidence as a court of law and is unrelenting.  Larry may be free but he is also cut off from any kind of society whatsoever.  He is alone and he is ostracized. And now twenty years later, another girl has disappeared.Silas had long since left town, explored other options, moved on.  But he has returned to this rural, Mississippi town, as their local constable.  He can no longer hide from Larry’s private pain or his own past. And Larry had called him. This story gutted me and that can only happen if I truly care about someone, someone like Larry.  Who seeped in.  A Stunning Achievement!"}, {"userName": "Nataliya", "userReviewDate": "Mar 11, 2012", "userURL": "http://www.goodreads.com/user/show/3672777-nataliya", "userReview": "[seriously, Tom Franklin! You have complete disregard for any spoilers in 'Salem's Lot, don't you? (hide spoiler)]"}, {"userName": "Candi", "userReviewDate": "Oct 24, 2017", "userURL": "http://www.goodreads.com/user/show/3639005-candi", "userReview": "\"The Rutherford girl had been missing for eight days when Larry Ott returned home and found a monster waiting in his house.\"This book grabbed me from the beginning and never let go. I was mesmerized by the rural Mississippi setting and quickly connected to the main characters. Larry Ott, otherwise known as Scary Larry by an unforgiving and judgmental community, and Silas Jones, the former high school baseball star, have a history. A history that goes back more than twenty years to that difficult and often merciless time of life – boyhood and adolescence. Larry was always a loner. The white kid shunned by everyone else because he was different. He liked to read, wasn’t interested in sports, and just lacked the social skills necessary to be one of the popular kids. Sound familiar?! \"Used to be, his mouth always hung open, giving the impression he was slow. But he wasn’t. He was smart. Knew the weirdest shit.\" Silas is black, new to town, and the son of a single, poverty-stricken mother. At one time, the two struck up a secret friendship, nurturing each other’s desire for another human connection. As often with ‘secret’ friendships, they don’t remain so for long. The two part ways, and when teenaged Larry is the main suspect in the disappearance of a local girl, Silas never looks back - until now, when another girl goes missing two decades later. Who better to incriminate than the town scapegoat? Silas is the town constable and Larry is eyed with suspicion once again. Silas is perhaps the sole keeper of some secrets that never came to light all those years ago. Will his conscience and his moral compass point him in the right direction?This book will cause you to reflect on the choices we make when it comes to the inclusion of others. Especially those that seem so fundamentally unlike ourselves. Do we have a role in molding another’s future based on our narrow-mindedness or misguided notions of our fellow beings? Can we make an individual become the person we in fact believe them to be? How does one withstand the onslaught of animosity delivered repeatedly over a period of years… can it be overcome? Larry Ott is on my list of the most memorable characters in literature. My heart broke for the young Larry, and I am full of affection for the older Larry. Likely we can all catch glimpses of ourselves in either Larry or Silas. And that is not a bad thing. How do we help our own young Larrys or Silases? Schools talk about inclusion, advocate for it in fact, but I regret to say that we still have not achieved this goal. Exclusion seems even more rampant in this day and age of social media. Sigh… well, I don’t want to go off on a further tangent here. We can only keep working in the right direction.Highly recommend this slow-burning mystery to anyone that enjoys superb character development and excellent writing. This is my second Tom Franklin novel, and it will not be my last. \"It was country dark, as Alice Jones had called these nights, the absence of any light but what you brought to the table.\""}, {"userName": "Will Byrnes", "userReviewDate": "Oct 13, 2010", "userURL": "http://www.goodreads.com/user/show/1526851-will-byrnes", "userReview": "Worst first date ever. Poor Larry Ott, the bookish kid, the weak one, a smallish white boy, the bully-target at school, takes out the girl of his dreams, returns home alone, and gets blamed for her presumed rape and murder. Decades later, ostracized by the town, living alone in the same house he grew up in, tending his late, abusive father’s garage, another girl goes missing and all fingers point his way. Did he or didn’t he? But Crooked Letter, Crooked Letter tells of two twisted lives. As a kid, Silas came to town when his mother, Alice, had to flee a bad situation in Chicago. He and Larry became friends. But after high school, black baseball-star Silas left for college, then stayed away until decades later when he returns, joining the local police department. Why? The book takes us back and forth between the present day, the investigation into the latest disappearance, and the story of Silas and Larry’s ill-fated friendship.Crooked Letter, Crooked Letter is a tale of black and white told in shades of gray. Franklin's main characters display human strengths and weaknesses. He shows the racial environment and tension in 1970s Mississippi, reduced, but still far from dissipated today. We see that people act on what they believe rather than on what they know. Where does purity lie? Truth? Atonement? Forgiveness? Although Crooked Letter, Crooked Letter offers a piercing account of life in rural Mississippi it holds resonance beyond the time and place. The sort of people who find Larry peculiar because he reads are the same ones who deny evolution, global warming or the holocaust. The atmosphere of the place is very nicely drawn as history seeps from the past into the present in forms physical as well as psychic. Too much looks the same as it did way back when, only more eroded. Franklin drew a lot on his own childhood. Like Larry, his father was a mechanic; he lived on the outskirts of a small southern town; he was a bookish kid in a place where that was not a good thing to be; he was a loner. And while he was not so ostracized in real life as his stand-in is in his novel, he knows of what he speaks. Tom Franklin has written a very moving tale about being an outsider. You will feel for Larry. Crooked Letter Crooked Letter has received a flood of critical approval. And there is a lot to like here, engaging characters, a good depiction of place and time, powerful imagery in the form of serpents and masks. It seems like a sure thing. And I did enjoy the book. But the straight dope is that it did not do for me what it seems to have done for some other readers. Franklin is clearly a very good writer, but is hardly the second coming of Faulkner. Read, and enjoy, but keep your expectations grounded and you will not be disappointed. A review of a later novel by Franklin, co-authored with his wife, Beth Ann Fennelly, The Tilted World"}, {"userName": "Kemper", "userReviewDate": "Jun 17, 2011", "userURL": "http://www.goodreads.com/user/show/405390-kemper", "userReview": "The geeks may have seized a nice chunk of pop culture these days, but it’s too easy to forget that it wasn’t that long ago when reading and collecting comic books made you a bit odd. Long before remaking ’70s slasher films with as much blood as possible was considered mainstream entertainment, liking Stephen King novels or other horror books and movies might get your folks a closed door session with your teacher. Before Lord of the Rings made a gazillion dollars and won Oscars, you probably would have gotten blank stares or called a nerd if you tried talking about hobbits and orcs to most people. Larry Ott is a geek who was born just a bit too soon, and that’s why he completely broke my heart in this excellent book.In a small Mississippi town, we meet Larry and Silas “32” Jones. Larry is a 41 year old white bachelor who lives in his parents’ house that he has preserved just like it was when they lived there, and he goes to work every day at the garage his father ran despite the fact he never has any customers. Larry lives with almost no interactions with other people and spends most of his time reading or visiting his mother in the rest home. When Larry was 16, he was a geek who read horror novels all the time and was considered a weirdo by everyone in his school. Larry finally scored a date with a hot girl, but unfortunately she was never seen again after he picked her up. He was never charged or convicted of a crime, but the entire community decided he killed her and he’s been an outcast ever since.Silas is black and the local constable of a small town that is completely owned by a lumber mill. He was a baseball star in high school before tearing up his arm in college. For a brief time before Larry went on his ill-fated date, he and Larry were friends, but Silas now does everything he can to avoid contact with him. Now that a local college girl has gone missing, Larry is a prime suspect, and the events that happen will force both men to face their pasts.I can’t say enough good things about this book. The depiction of life in a modern small town being choked out by large corporations was excellent as were the many supporting characters. It uses extensive flashbacks to set up our present day story and then fill in the blanks with the history. Even with the great setting and clever story telling, it’s the characters of Silas and Larry that really make this thing hum.Silas is a former local hero who has returned back to the site of his previous glory, but even though most people still call him ‘32’ after his old baseball number, he spends his days directing traffic, writing tickets and riding around in a decrepit old jeep because the town can’t afford anything better. But Larry has it even worse. Over two decades as a local boogeyman have left him isolated and stuck in a past that wasn’t that good to begin with. He’s the kind of guy who feels bad for the chickens in his coop for having to spend every day on the same patch of mud so he rigs up a mobile trailer and rotates them around different parts of his field so they can spend time in fresh grass. He lives in his quiet routine without complaint even after 25 years of being harassed by the police, barred from local businesses and churches, and being the target of frequent drunken teenage pranks. The saddest thing is that he doesn’t even seem to realize how achingly lonely he is. This was a terrific story about how people become trapped by the perceptions that others force on them, whether they deserve the label or not."}, {"userName": "Nancy", "userReviewDate": "Jun 22, 2011", "userURL": "http://www.goodreads.com/user/show/763271-nancy", "userReview": "Posted at Shelf InflictedIt was Kemper's review that made me add this book to my shelf. It was Stephen's that made me rush to the library after work and grab a copy. After reading Shine and Winter's Bone, I was hesitant about reading another depressing story set in the south, but I’m so glad I did. Larry Ott had a tough childhood growing up in rural Mississippi. He was sickly and he had a stutter. He never quite fit in among his classmates, usually the butt of a joke or the target of a bully. His dad was cold, distant and unaffectionate. Reading books was his only escape, until he met Silas Jones. The two boys were friends for a short time, enjoying activities like shooting, playing in the woods, and hanging out. Larry’s life was forever changed when popular Cindy Walker asked him on a date. Though no evidence was found linking Larry to her mysterious disappearance, he has been the object of scorn and speculation, resulting in his isolation from the close-knit, rural community he grew up in. Silas, meanwhile, has moved on. Now 41, Larry’s days are spent repairing the cars of the few out-of-towners who visit his late father’s garage, tending his chickens, and reading his favorite Stephen King novels. Silas returns to Mississippi as a town constable. He and Larry’s lives intersect again when another girl disappears. This beautiful, sad and unforgettable story weaves back and forth, between the past and the present, revealing details about childhood and the awkward teenage years. It paints a vivid picture of a depressed town and the secrecy, silence and judgment of its inhabitants. While crime plays a significant role in this story, it is the friendship between Silas and Larry and Larry’s aching loneliness that make the greatest impact."}, {"userName": "Lawyer", "userReviewDate": "Oct 17, 2010", "userURL": "http://www.goodreads.com/user/show/3025547-lawyer", "userReview": "Crooked Letter, Crooked Letter: Thoughts following a second reading\"The Rutherford girl had been missing for eight days when Larry Ott returned home and found a monster waiting in his house.\"Read that first sentence. What? It doesn't grab you? Keep reading. It's like that long slow climb up to the peak of that first drop on the roller coaster. Hear the click of the chain pulling you to the top? After you hit the top, you're in for a ride. \nFirst came this mean little collection of a novella and nine short stories.\nThen came a dark novel bringing the Alabama Clarke County range war to life.\nAnd when I thought Franklin had gotten the mud, the blood and the beer out of his system, he turns Rumpelstiltskin upside down with a malicious little dwarf named Smonk.\n I've been a Tom Franklin fan since the publication of his first book, \"Poachers.\" The novella title piece in that anthology won an Edgar Award. He is a master of Southern Gothic. His prose is lean, mean, yet frequently is laced with a lyricism that borders on poetry. Franklin can write violence of so fierce a nature that his mild looks make you wonder where he finds the source of the ferocity in his stories.Franklin is one of the most amiable authors I've met. Soft spoken, with an easy smile, you look at him and wonder how the Hell he comes up with stuff that makes you shudder. So having said that, Crooked Letter, Crooked Letter seems to have been produced by a different writer. This is a kinder, gentler Franklin, though the occurrence of violence is present in his latest, it is not what you might have come to expect from him.The violent acts in Franklin's latest are not what you would see in a Sam Peckinpah film, it is more reminiscent of the murders committed in Fritz Lang's classic film \"M.\" Franklin should find a wider audience with \"Crooked Letter\" by leaving some of the horror to the reader's imagination.Franklin tells a story of two boys, one black and one white, who grow up together only to show up on opposite sides of a murder case. Larry Ott was suspected of murdering a girl who disappeared when he was fifteen. After all, it was Larry who took her on a date to the drive-in. She never made it home. As we say these days, Larry was a person of interest. But no body was ever found. No corpus delicti, no case. But through the years when anything untoward has gone on, Larry has built up a collection of search warrants. \"You understand,\" the Sheriff tells him. Ever the compliant one, Larry nods while the Sheriff goes about his business. Now another young girl has gone missing and Ott is the usual suspect. As a child, Silas Jones lived in a hunting cabin owned by Larry's father. Now Silas is the Constable in town and will become involved in the investigation of the latest disappearance.While Larry has always been the goat, Silas has always been the hero. No two guys ever turned a double play the way \"32\" Jones and M&M could. Jones went on up to Ole Miss playing ball. M&M became your friendly dope dealer.After an injury ends Silas' sports career he comes home to his job as Constable. Everybody still loves \"32\" Jones. Somebody doesn't love M&M and killed him. Silas finds his body beneath a swirl of vultures. Then there's that rattlesnake someone put in a young woman's mailbox. Silas has more business than a man with a badge wants. Then, damn it, somebody's gone and shot Larry Ott. The Sheriff thinks Larry did it out of remorse for the crimes he has committed. His guilt must have finally got to him. Larry is hovering between life and death in the hospital. Silas processes the crime scene; but then begins picking up Larry's mail and feeding the chickens. He's waiting for Larry to wake up. He has something to tell him.What strange bond holds Larry and Silas together, yet keeps them apart? The secret lies somewhere in the past. Franklin deftly weaves their story with chapters alternating between the present and the past.This is an extremely satisfying work of contemporary southern literature. Read it. Then give yourself a little time and read it again. It is even stronger the second time around."}, {"userName": "Jason", "userReviewDate": "Nov 04, 2011", "userURL": "http://www.goodreads.com/user/show/4426615-jason", "userReview": "I want to be clear on the 3-star rating, folks. I liked this book. I swear. I just don’t believe it lived up to the potential I arbitrarily ascribed to it when I saw on the shelf of my local Stop & Shop’s aisle 7.Guys, I can’t review books anymore. I don’t know if “reviewer burnout” is a real thing or if I’m just miserable because it’s only the second week of July and I am going to die from this heat, or if I’m rip roaring drunk (which I somewhat am), but I came home from visiting some friends this afternoon with every intention of reviewing this book because El can’t get out of bed in the morning if I don’t, but then I got home and my wife asked me to make her a Long Island iced tea, which I can make like nobody’s bi’ness, and I decided to make one for myself, but then one became two and two became three (even though the Spice Girls taught me differently) and now I can’t focus. But I still maintain it’s because of reviewer burnout, not the drink.So I’ll say it again. I did like this book. Larry is a reclusive white boy in 1970s Mississippi who is in the wrong place at the wrong time and spends the remainder of his adult life the subject of neighborhood gossip and small-town ridicule as a result of that poor timing. Silas is (or was) his best and only friend. Silas, a black boy, is in most ways better off than Larry, even while being a black boy in 1970s Mississippi and fatherless, as Silas was athletic and sociable and had friends and had respect and had a girlfriend and had a life outside his dreary home existence.Generally speaking, the characters are not poorly drawn but sometimes it becomes glaringly obvious when someone (in this case Larry) becomes the author’s pet, and that pet status penetrates the character to the extent that he begins to resemble a two-dimensional stock: Larry is pitifully harmless, incapable of having a mean streak that would have otherwise given him a more rounded out character (and possibly made his involvement in the crime-in-question more ambiguous), and essentially can do no wrong. I realize this is sort of crappy of me, but I kept comparing this book to \nWinter's Bone\n and for me, it just doesn’t live up to that level of literary brilliance. Perhaps I expect too much from crime fiction these days, but I like to think that speaks more to how good crime fiction has gotten rather than to my being a demanding jerk about it.To reiterate, though: I really did like this book. Anyone for a Long Island iced tea?"}, {"userName": "Florence (Lefty) MacIntosh", "userReviewDate": "Jan 09, 2014", "userURL": "http://www.goodreads.com/user/show/10856439-florence-lefty-macintosh", "userReview": "It’s got a lot of heart, dark and dramatic with ambience in spades, does a great job depicting rural Mississippi. \"A few paved roads and a lot of dirt ones, a land of sewer ditches and gullies stripped of their timber and houses and single-wides speckled back in the clear-cut like moles revealed by a haircut.\"The point of view alternates between Silas Jones & Larry Ott, flashing back to their boyhood friendship - a friendship that ends when Larry is suspected of murder. Now Silas is back in town this time in the capacity of constable, returning to a moral dilemma. There's another murder and Larry's the prime suspect, how can he live with himself if he turns his back on his friend again.For me the idea of small town life both attracts and repels. If you fit in there’d be nothing warmer or more embracing - if you didn’t it could be a living hell. From day one Larry doesn’t fit. As a boy he has nose bleeds, stutters, reads too many damn books. While not found guilty by a jury he might as well have been, the town sentences him to a life of friendless isolation. In his place I’d have left without a backward glance, feet don’t fail me now…But not Larry, he stays. Undecided if that choice was cowardly or courageous, whatever. There’s a quiet dignity to how every day he’s at that garage, just sitting and waiting, I mean who’s gonna give their business to ‘Scary Larry’? But you can set your watch by him, he’s always there, always on time. And not a drop of meanness either, like how he cares for his chickens, rigging up that moveable pen so they get a change of scenery, some fresh air, a few bugs to eat. My heart went out to him, this guy who’s never experienced kindness treating a bunch of birds, chickens no less, with more compassion than he’s ever been shown.While both Silas & Larry's characters are richly defined, it’s Larry I’ll remember - the world’s loneliest mechanic. Cons:  The mystery is pretty obvious, the outcome predictable - in fairness legs only to what’s really a character study. Short on thrills some find it slow paced – I didn’t.A book to immerse in; for the genre of Southern Gothic Lit – 4 shiny stars."}, {"userName": "Diane S ☔", "userReviewDate": "Oct 23, 2010", "userURL": "http://www.goodreads.com/user/show/4159922-diane-s", "userReview": "The descriptive and narrative power in this book is what hooked me. Rural Mississippi, two boys, one black, one white will become entangled in each others lives for years to come. The amazing thing to me is I kept thinking that Silas, who is black grows up respected, very unusual in the south during this time, while Larry, who is white is treated as the towns albatross. Due to a missing girl years back and a missing girl in the present. Very strange mixture of characterizations and yet Franklin pulls it off. Very gritty, hard scribbled people and I couldn't help, wonder why Dave stayed in this town, though his mother is ill but it was almost as a sort penance. Secrets are revealed, though one is easy to guess, and I loved how the life goes on ending, with maybe just an few changes."}, {"userName": "Melki", "userReviewDate": "Jun 04, 2012", "userURL": "http://www.goodreads.com/user/show/5293536-melki", "userReview": "My son came home from school last week with his outrageously overpriced yearbook. A lot of people had a lot of nice things to say about him, which made me feel all warm and fuzzy inside. One kid wrote something that struck me as particularly nice:In a few years I see you with a house, wife, and babies. They will be stupendous, and we'll still be friends.What I liked, besides the kid's use of the word \"stupendous,\" was the \"still be friends\" part.Will they still be friends? Who knows? Like much of life, it's kind of a crap shoot.Why is friendship so important to us? It certainly seems to be vital. Even the toughest prisoner dreads solitary confinement. To be completely cut off from others is the worst punishment of all.Larry Ott, one of two very finely crafted characters in this book, is perhaps the loneliest man on earth. For the first time in longer than he cared to remember, Larry smiled in the presence of another person...What a powerful, and very sad line. The word \"friend\" appears again and again in the book, and manages to overshadow the main story of two missing girls and the search to discover the truth behind their disappearances. I'm not the sharpest knife in the drawer, but I managed to accurately guess both outcomes. I think the real story here is the friendship.Larry was lonely even as a child. His mother used to pray for him to find a \"special friend\". One day he does, in the person of Silas Jones. The boys keep their friendship a secret, playing together in the woods out of sight of others, because neither Larry's parents nor Silas's mother approve of their interacting.After an ugly incident forces them apart, Silas becomes involved with sports and Larry retreats to a lonely world with only books for companions.In high school, he is stunned to learn that a girl he's always liked will go on a date with him. Later that night, she vanishes. Larry is never convicted of any wrongdoing, but the townspeople condemn, despise and shun him.Decades later, another girl is missing, and the prime suspect is once again \"Scary\" Larry.He tells police:\"I didn't even know that Rutherford girl. I don't know anybody except my momma and she doesn't know me. I used to go to work sometimes without talking to anybody except the girls in Kentucky Fried Chicken.\"His eagerness to please and desperate need of human contact leads to an unfortunate friendship with a racist murder-groupie who has a dog named John Wayne Gacy. Is a nightmare of a friend better than no friend at all?If you want to know more, read it yourself. It's a good one.Friends.Be my friend on Facebook, my BFF, my friend til the end. We just can't get away from it.Larry and Silas. They both did things, said things, and didn't say things they should have, and yet the story of their friendship is in me for good."}, {"userName": "Orsodimondo", "userReviewDate": "Nov 25, 2015", "userURL": "http://www.goodreads.com/user/show/10490224-orsodimondo", "userReview": "B & WIl titolo non traduce niente, appiccica un’etichetta. D’altra parte, il titolo originale è abbastanza intraducibile, sono i versi di una filastrocca.Storia di due ragazzi, un bianco e un nero, che si conoscono da adolescenti, diventano amici durante un’estate, ma poi smettono di frequentarsi e si allontanano – crescono e si rincontrano adulti in circostanze che avrebbero volentieri evitato.Una storia di bianco e nero, un black and white pieno di colori, e di colore.Robert Duvall-Boo Radley nella trasposizione cinematografica del 1962 di “To Kill a Mockingbird-Il buio oltre la siepe” diretta da Robert Mulligan. Per Duvall, all’epoca trentenne, era il primo film.Larry, il ragazzo bianco è timido, introverso, lega poco e male con i suoi coetanei, è oggetto di bullismo, perfino da parte dei ragazzi di colore (la segregazione sembra superata…). Ama leggere libri horror, fatica a trovare il suo posto a scuola come a casa. Nonostante sia il bianco, vive il disagio tipico di chi si sente inferiore e parte di una minoranza. È il Boo Radley del paese, e in qualche modo è anche considerato il Norman Bates del posto.Silas, il ragazzo nero, per quanto di condizione economica nettamente inferiore, è più audace, sia nei confronti della vita, che della gente in genere e delle ragazze in particolare: ama lo sport, l’avventura, parte, viaggia, ritorna, si costruisce una carriera, è amato e rispettato, è quello bello. Il ragazzo nero sembra quello bianco, e viceversa.In fondo, a Chabot (cinquecento anime: un borgo prima ancora che un paese) con un futuro alle spalle, e dove il passato non passa mai, a Chabot la strada più malfamata si chiama White Trash Avenue, perché i relitti umani, i junkies, sono bianchi: i primi sono diventati ultimi senza che gli ultimi prendessero quel posto da loro perduto.Anthony Perkins-Norman Bates, interpretazione che gli valse la carriera, non riuscì mai a scucirsela di dosso. In “Psycho”, 1959, Norman è un bravo tassidermista. “Psycho” di Alfred Hitchcock è l’adattamento del romanzo omonimo di Robert Bloch, che ne scrisse poi altri due con lo stesso personaggio, creando una saga.I personaggi sono più importanti della trama: chi sono, da dove vengono, e dove vanno, cosa li lega, li avvicina e li allontana, conta più dei fatti, singoli o nel complesso. Viene da pensare che Franklin abbia preso le mosse proprio dai personaggi e poi abbia costruito l’architettura della trama: che regge, ma i personaggi che la determinano funzionano meglio. Franklin sa maneggiare il genere senza restarne imbrigliato: però la trama ha qualche forzatura di troppo, qualche agnizione un po’ appiccicata, e tirata. Quello che gli riesce meglio è costruire la personalità dei suoi personaggi, renderli credibili.E poi, perfino meglio, gli riesce descrivere la natura, animale e vegetale, altro protagonista, qui come nei suoi racconti: l’Alabama, il sud rurale degli Stati Uniti, è vivamente presente in queste pagine, spicca, conta, brilla, incide nelle vite della gente, determina. Magnifica ed efficace metafora di questa terra è il kudzu, un rampicante che cresce a un ritmo forsennato, e copre tutto, alberi, case, rovine e vecchie auto: strangola dolcemente tutto quello a cui si avvinghia, un abbraccio avvolgente e letale. Un’immagine che sa di degrado e di dolcezza allo stesso tempo, di morte e di bellezza. Spettacolare.Il kudzu, pueraria lobata, pianta rampicante appartenente alla famiglia delle leguminose le cui foglie e radici sono ricche di principi attivi benefici per la salute. Utilizzata da più di 1.300 anni nella cucina asiatica, questa pianta è diffusa in tutto l'Estremo Oriente e oggi le sue proprietà vengono sfruttate anche nel mondo occidentale, dove rappresenta un aiuto soprattutto per chi vuole smettere di fumare. Può infatti capitare di trovare il Kudzu fra gli ingredienti dei liquidi utilizzati nelle sigarette elettroniche. Altro principio attivo del kudzu è visibile nella foto e ben raccontato nel romanzo.Per Tom Franklin i paragoni tirati in ballo sono sempre con gli scrittori di quella parte geografica degli Stati Uniti (Faulkner, Williams, O’Connor, Caldwell…). A me è però soprattutto venuta in mente una scrittrice che invece non appartiene alla compagine sudista, Joyce Carol Oates.Altro scrittore sempre tirato in ballo quando si parla di Franklin è Carver, che secondo me è percepibile in queste pagine soprattutto in quanto si tratta di storie di fallimenti, storie di looser. Come tanta letteratura nordamericana anche qui si parla di redenzione, si parla del senso di colpa, della caduta e della possibilità di riscatto: per diventare adulti occorre soffrire.-Eravamo amici. Vero, Silas? -Tu lo eri, Larry. Io non so cosa ero.”Getting to Know You”, 1999, regia di Lisanne Skyler, ispirato dai racconti di Joyce Carol Oates raccolti in “Heat and Other Stories” del 1991, mai tradotti in italiano."}, {"userName": "Trudi", "userReviewDate": "Sep 04, 2011", "userURL": "http://www.goodreads.com/user/show/1416912-trudi", "userReview": "Guh! This book ... (flails helplessly) ... it is a gut puncher, heart-wrencher. Franklin is a poet, his prose sings, his characters walk off the page, and he puts the reader into a time and place that absolutely resonates with a vibrancy and brutal honesty all its own. I was so sad -- so emotionally invested -- that I found the reading painful to bear at times. Franklin's descriptions of human isolation and loneliness are so raw and uncompromising I forced myself to take breathers between reading sessions. I don't think this is a book meant to be read in one gulp; it is made up of so much complexity and depth that it's better to sip from its well, savor what you've tasted, and then go back for more. The water can be frigid cold, and if you drink too much too fast you're bound to get excruciating brain freeze. This book had me at hello: it's set in the American south, it features the mess of family dynamics, and secrets big and small stalk its pages. It is a coming-of-age story and at its center are two boys -- Silas and Larry. Their lives intersect in ways neither could have predicted, and one of them must carry the pain and punishment of that connection his entire life. It is a heavy burden, but I will say not without redemption. I love Larry Ott -- not only is he a die-hard Stephen King fan, despite years of being ruthlessly cast as town pariah, Larry quietly goes on about his business. He is not consumed by bitterness, or enraged by the unfairness of the abuse that has been heaped upon him. That takes a strong man, and this is what probably made me the most sad is that Larry doesn't know how great and kind a man he really is. Beaten down first by his father, then by the town, he is prevented from discovering his true qualities of inner strength and dignity. Read this book. It is beautiful. So very sad, but beautiful.And because they are so good, and do the novel such justice, I will refer you to the reviews of Stephen and Kemper.First line fever: The Rutherford Girl had been missing for eight days when Larry Ott returned home and found a monster waiting in his house."}, {"userName": "☮Karen", "userReviewDate": "Sep 14, 2016", "userURL": "http://www.goodreads.com/user/show/1076079-karen", "userReview": "M, i, crooked letter, crooked letter, i, crooked letter, crooked letter, i, humpback, humpback, i.  That spells Mississippi if you're from the South, so they say. Not sure if I ever heard the humpback version before. The Mississippians in this book are probably not much like most folks you know, with highly dysfunctional families, a mean or absent father in every one, kids that are oppressed and depressed. Then we have snakes in mailboxes, preteens playing with guns, in a town where blacks are in the majority and whites the minority. Larry Ott, suspected in a girl's disappearance in his teenage years but never charged, grows up lonely and ostracized in their little town. Silas was his friend at one time, but not since he moved away and came back as the Constable. Now Larry is friendless --and alone since his mother moved into a nursing home.Did I mention guns? Guns everywhere, like the kudzu strangling the forest and everything in it. To these people, \"Gun control means hitting where you aim.\"This was a slow starter for me; took me a while to get used to the odd words used and the slow build up, and to the awfulness of Larry's father and Cindy's step-father. Larry is a bit of a nerd who needs to grow on you. Silas made some poor choices but was redeemed in my eyes. The current-day mystery I figured out in no time; the other one I did not. By the end it was unputdownable (stole that word from someone, sorry). Really good read!"}, {"userName": "Paula Kalin", "userReviewDate": "Dec 26, 2016", "userURL": "http://www.goodreads.com/user/show/16174645-paula-kalin", "userReview": "Crooked Letter, Crooked Letter is the first Tom Franklin book I have read and he is certainly a fine writer. Set in rural Mississippi in the late 1970's, this is a story of a friendship between loner, Larry Ott, and former high school sports star and local constable, Silas Jones or \"32\". Back in high school, Larry, on his first date, takes a hot local girl to the drive-in and she never returns home. Although not charged with murder, Larry is ostracized by his community for the rest of his life. When another girl disappears 20 years later, the town's suspicions fall on Larry. Why not, the poor son of a bitch, no one likes the book-carrying weird guy anyway.This book is full of heartbreak. Larry Ott lives his life alone. No one visits him, no one stops at his father's former gas station that Larry now runs - although Larry shows up every day hoping to fix up someones car. Then the second girl disappears and long held secrets that were buried for 20 years start to come out.This is a story of friendship and it's highs and lows, and when a friendship is tested what you will and will not do.4 out of 5 stars. Nicely done."}, {"userName": "James Thane", "userReviewDate": "May 18, 2014", "userURL": "http://www.goodreads.com/user/show/3483907-james-thane", "userReview": "This is a very well done atmospheric novel set in rural Mississippi. The story is told in scenes that alternate between the 1970s and the present day. At the heart of the story are two men, one white, the other black, who for a brief period of time as boys were secretly close friends in a time and place where their friendship, if public, would have only brought them trouble.The white man is Larry Ott, the only child of a lower class family. His father was a mechanic who seemed to have little patience for or interest in his son. Even as a boy, Larry was quiet and withdrawn. With no athletic or social skills, he had no friends at all, was ridiculed at school, and gradually withdrew into a world of books. In high school he had only one date, which ended tragically when the girl he had taken out disappeared and was never seen again.The entire county believes that Larry raped and killed the girl and then buried her body. Since the body was never recovered and since there was no physical evidence to connect Larry to her disappearance, he was never prosecuted. But now derided as \"Scary Larry,\" he is even more ostracized and his family disintegrates in the wake of the tragedy.Twenty-five years later, Larry is still living in the family home, alone now, tending to the chickens and still reading his books. Every day, he drives into the garage he inherited from his father and waits in vain for any customer to appear, but no one in the small community will have anything to do with him. Then another young woman disappears and all eyes turn to Larry as the obvious suspect.Larry's black boyhood friend was Silas Jones, a gifted athlete known as \"32,\" the number he wore on his baseball uniform. Silas was raised as the only son of a black single mother and never knew who his father might have been. For a brief time, Silas and his mother lived in an abandoned shack on property owned by Larry's father, which is how the two boys briefly became friends.Shortly after the first young woman went missing, Silas left the area to go to college and pursue his dream of a career in baseball. Now he's back, serving as the town constable, and he sees no reason to make an effort to renew his friendship with Larry Ott. But the disappearance of the second woman will throw the two men together again, whether they like it or not. The crimes at the heart of the story serve principally as a backdrop for the larger story of the relationship between Larry and \"32,\" and watching that story unfold is a very rich and rewarding reading experience--one of my favorite books of the year thus far."}, {"userName": "Margitte", "userReviewDate": "Jan 17, 2017", "userURL": "http://www.goodreads.com/user/show/7481492-margitte", "userReview": "Two boyhood friends, now 'non-friends' in adulthood, are forced to face their individual bags of bones in their closets, when a serious crime strikes their small town in Mississippi. Thrown together, the skeletons screamed their stories to a world who refused to acknowledge their truth. Instead, the people around them preferred to believe their own versions and acted upon it all these years.For Silas Jones, or '32', as he was known as a high school baseball hero, it could have been different if he only had the guts to do the right thing. But how could he, if social norms dictated devastating consequences for both him and his mother if he followed the terms of human kindness, integrity and honor. Those rules applied to everyone else. He had no right to it. The only symbols he could safely allow to define him was his status as the sole law enforcement agent of Chabot, population 500; driver of an ancient '76 four cylinder Jeep with its clip-on flashing light, it's emphysemic air conditioner, its leaky master cylinder, its audiometer stuck on 144,007 miles, and addict to both Freon and brake fluid. Silas was also a registrant for three firearms and a Taser; and a badge he usually wore on a lanyard around his neck. Larry Ott had only an umbrella on the gun rack in his 1970s Ford pickup; nurtured the egg -laying First Ladies in his chicken pen; had more books stacked all over his remote home than the town library, owned a two-bay shop on Highway 11 North, and could not call anyone a friend under any circumstances. Larry was a mechanic, but only in theory. His Ford had only 56,000 miles on its original six-cylinder, with the rest of it being immaculate factory part replacements.What they did not force upon themselves, the town did for them, through discrimination, prejudice, ruthless gossip and justified moral corruption. However, what the town refused to fuse, destiny would, when the teenage daughter, Tina Rutherford, of the wealthy Rutherford Lumber Company's mill owner, disappears one night. The collective memory of the town recalled another unresolved disappearance twenty years earlier of Cindy Walker ...When M&M, the drug dealer in town is found dead, a new chapter begins in a town where change is forced upon them like the necessity to rebuild a carburetor. All they had to do was fix what was broken for all of them and find the culprit who left snakes in women's letter boxes ...COMMENTSOh dear, of course I LOVED my first experience of the author Tom Franklin's books. A soul-wrenching read of a richly textured, compassionate tale, with a positive ending. The ending determined the rating in this case, since I needed something good to restore emotional equilibrium after tough previous reads. There's enough body added to all the skeletons to make this a literary suspense thriller, a perfect murder mystery. A must-read for aficionados of this genre."}, {"userName": "Cheryl", "userReviewDate": "Apr 16, 2016", "userURL": "http://www.goodreads.com/user/show/11255849-cheryl", "userReview": "Crooked Letter, the crooked lives we live. Those crooked thoughts that alter trajectories, oh if only someone—a friend, a parent, a community, a town—could reach out and position a person's marred ways of thinking. Oftentimes, it doesn't happen this way, not if one lives in a crooked town. Imagine a life in ruins, simply because a person has been misunderstood. Imagine having a friend you could never publicly claim, a girlfriend you would always keep hidden, because of a small town's shortsightedness. Imagine making one wrong turn and being blamed for an egregious incident. Imagine lives destroyed because of racism and sexism, those isms that still feed on parts of the small town life today.Imagine a life of forced solitude. \nTheir lives had stopped, frozen, as if in a picture, and the days were nothing more than empty squares on a calendar.\n There is only so much I can say about this novel without ruining it for you, for every word seems so intricately placed, every thought deftly illuminated, every story structure profoundly rendered. The mystery and pacing unfolds without obstruction. Structurally, this is one of those perfectly written books. \nWhen he left, Larry lay amid his machines, thinking of Silas, how time packs new years over the old ones but how those old years are still in there, like the earliest, tightest rings centering a tree, the most hidden, enclosed in darkness and shielded from weather. But then a saw screams in and the tree topples and the circles are stricken by the sun and the sap glistens and the stump is laid open for the world to see.\nImagine painfully bearing other people's lies and secrets, yet being unaware you're doing so.Sure, the story takes place through interesting dialogue, a heartrending plot, and neatly developed characters, but to truly know Larry and Silas is to be engrossed within a nuanced tale of two Southern men who are very different, and yet quite similar, men shackled by similar heritage, shackled by more than they'd imagined. Imagine time distorted and bruised, time forgiven and healed."}, {"userName": "Bill", "userReviewDate": "Jun 15, 2012", "userURL": "http://www.goodreads.com/user/show/810550-bill", "userReview": "I didn't sleep well last night.It was one of the very rare occurrences where I finish a book in bed without another one to pick up right away. You see, I hate being between books. When I finish one, I immediately choose another and begin it right away. But last night was an anomaly. Just the way things worked out.So. Turning out the light immediately after finishing this left methinking about the whole thing for much of the night. I kept going over what it was that Franklin did that made me care for these characters so much. He has an understated style of writing, but what was there really resonated.Larry Ott. Oh man. How I felt for this guy. A boy after my own heart, lonely but finding refuge in Stephen King's novels. In adulthood, a man who is ostracized by an entire town amid suspicions that he killed a girl 25 years ago.Now, another girl is missing, and \"Scary Larry\" is, of course, suspected.Did he or didn't he?The story moves along in present day, and also flashing back to the past (a formula I never tire of), and explores life in small town Mississippi, and Larry's friendship with a Silas (a dirt-poor black boy). I was totally immersed. Part of the reason I didn't have another book ready to read after this one is because this is the only book that mattered while I was reading it.I've noticed some reviewers have made comparisons to To Kill a Mockingbird, which is inevitable given the Mississippi setting and race relations. A pretty high standard there, but I feel it's warranted. I wish I had the eloquence to describe how Franklin touched on life in Mississippi and how human kindness struggles to rise to the surface, and does it, really? Gosh, I loved being into this story and I'm so sorry it's over. I'm still thinking about it and I'm having a tough time selecting the next book to read.Any book that keeps buzzing in my head like this did deserves the highest rating."}, {"userName": "Madeline", "userReviewDate": "Feb 07, 2013", "userURL": "http://www.goodreads.com/user/show/111921-madeline", "userReview": "Something I learned about myself while reading this book: I am incapable of reading books that include a murder mystery but don't focus on the mystery aspect.Look guys, I love detective novels. I love seeing how an author puts together a crime, presents the circumstances, and shows us the investigation process while disguising the real solution until the moment they're ready to give us the answer. It's fun to read about mysteries, so when I get a book that features a mystery but tries to distract me with Big Issues, I just get frustrated. I do not care about your racial tolerance message, there has been a murder.Crooked Letter, Crooked Letter is a good book - I want to establish that right off the bat. Its chapters alternate between the perspectives of two men, Larry Ott (a white man) and Silas Jones (a black man) in a small town in Mississippi. The two men were friends growing up in the 70's, but as adults they haven't spoken in years. When they were in high school, a girl disappeared, and the last person to see her was Larry. He was never arrested or accused of having something to do with the disappearance, but the suspicion has followed him his entire life, making him a pariah in his town. Years later, Silas is now a police officer, and another girl has disappeared. Everyone suspects Larry, and he and Silas are forced to confront their past together.So obviously, the point of the story is not the disappearance; the point is the strained and complex relationship between these two men. It's a good story, but I was distracted the entire time because I was too busy trying to figure out who killed the two women who disappeared (the solution, I should add, will be plainly obvious to anyone who has seen even one episode of Law and Order: SVU). I had the same issue with Donna Tartt's The Little Friend: the mystery wasn't the point of the book, but I hated the story because she didn't provide a satisfying solution to the mystery that the plot revolved around (Franklin, at least, ties up his mystery's loose ends, so I didn't have to throw the book against the wall). I can't help it, guys - I'm incapable of turning off my detective-novel brain, and it meant that I didn't enjoy this book as much as I should have."}, {"userName": "Annet", "userReviewDate": "Oct 23, 2011", "userURL": "http://www.goodreads.com/user/show/1166369-annet", "userReview": "Read this book in 2012, remember it's a great, have to re-read soon!"}, {"userName": "Greg", "userReviewDate": "Jan 26, 2012", "userURL": "http://www.goodreads.com/user/show/42508-greg", "userReview": "I'm fairly certain that my reaction to books is dependent on things going on outside of the text itself. Certain books read at certain times of my life affected me in ways that I can't imagine they would affect me now. Other times the shit that is going on in my life makes me unable to give a book that I might otherwise really enjoy the kind of attention, or mood, or something that it really deserves. Is this one of those books?Maybe. I see gushing reviews for this. And I went into expecting to love the book. I was looking forward to it, really I was. Maybe I was expecting too much? Maybe. Or maybe it wasn't the type of book that I would really enjoy while sitting in a Chicago Airport for an extra hour and a half because of delays, and continuing reading while sitting on the tarmac waiting to take off because of even more delays, a couple of them bordering on absurdly comical and finally finishing somewhere just past Toledo at thirty something thousand feet while the plane banged around from turbulence. Maybe all of those things and the annoyance in my head that I'd be getting back to New York close to midnight and that it would be a pain in the ass to get home at that hour using public transportation was putting me in the kind of mood where just about any book was going to lose its luster. Maybe that is what my three star rating is all about. If so, I'm sorry Mr. Franklin. If it means anything this is a really high three stars. The book sort of reminded me of some of George Pelecanos' later novels, like The Way Home (and another one that I read but apparently never rated, stupid Greg), and that is a good comparison (actually, maybe the comparison sucks and you might not think these are alike at all, but I mean it's a good comparison in my head because I thought quite highly of The Way Home). I really liked the character of Larry Ott, he was so pitiful and beaten down that I wanted to think he was totally unbelievable, but the more I thought about him and his station in life I started to realize how perfectly created he was and how he couldn't be any other way. I didn't care so much for the character of Silas 'thirty two' Jones, I didn't like that he gave his name as thirty two, I thought that was kind of absurd but not in a good way (although I guess it is believable), but more I just didn't think his character was as developed, and in another novel he might have been fine but being paired off with the amazingly developed character of Ott he seemed too formulaic. I think the novel could have used more of something. I'm not sure exactly more of what, but I think the characters of the town could have really come to life in the way that Donald Harington's do, I'd be interested to see Franklin use some of his minor characters in other works, but I don't think he's the type of writer to do this kind of thing (I have no basis for saying this, he might be, I've only read this one book by him and here I am blabbing like I'm some kind of expert, fuck you Stahl, why don't you just write your fucking book report already). One other thing I didn't like too much about the book was the ending. I didn't mind the way the main story of the book wrapped up, but then there were still four or five chapters left, which was used to wrap up some of the underlying conflicts in the novel. Maybe it was the delays and annoyances of traveling (I don't care for flying much, it's almost always unpleasant for me, with either the morbidly obese sitting next to me (three times now, three! and I rarely fly) or else my head is so fucked up by the pressure changes that I'm deaf and feel like someone is sticking ice picks in both of my ears for most of the flight), but once the main story wrapped up I started to get impatient for the book to end. There was some good stuff in the 'wrap' up part of the book, but there were also a couple of moments that I had a hard time accepting that the characters would act the way they did, and frankly (I almost wrote frankly Franklin, but then thought better of it, but see I didn't really write it because it's not in the main thread of the review) I kind of would have liked not knowing how the characters turned out after all of the main conflict had resolved. Probably, though, I'd be bitching and moaning about loose strings of the plot if the book didn't have these last few chapters. I wish I had loved the book like Karen does. If you haven't done so yet, you should read her review of the book, and see the picture she has of her and Tom Franklin at a book signing, and be more influenced by her great review than my whining rant about the woes of being a privileged fuck who was delayed a couple of hours in a couple of thousand mile trip that he was still able to make in a mere ten hours."}, {"userName": "Natalie Richards", "userReviewDate": "Sep 22, 2017", "userURL": "http://www.goodreads.com/user/show/11247707-natalie-richards", "userReview": "I loved this book. I`ve never read Tom Franklin before but I will now be looking out for his other reads."}, {"userName": "Shelby *trains flying monkeys*", "userReviewDate": "Nov 12, 2010", "userURL": "http://www.goodreads.com/user/show/1053760-shelby-trains-flying-monkeys", "userReview": "Larry Ott's character in this book just broke my heart. I mean took it out and threw it on the ground and stomped it kind of broken. His character was a little bookworm who just didn't fit in with the other kids. When he dared to think he had a date with a cute girl and took her out she never returned. So his whole life has been \"Scary Larry\". Silas is his one time black friend who is now constable in the town they life in. One time friends. But this story is of their friendship and the way we all hurt the people we possibly care about so other's don't look as us harshly.5 standing ovation stars from me."}, {"userName": "Tammy", "userReviewDate": "Nov 01, 2017", "userURL": "http://www.goodreads.com/user/show/19481265-tammy", "userReview": "Character development at its best! They are flawed, just as we are. They are capable of both good and evil. They are Southerners, born and bred. Very true to life and completely believable. Descriptive without an over abundance of flowery metaphor. This is a great story, which I would classify as a tragedy. Can’t wait to read another by this author."}], "description": "Tom Franklin's narrative power and flair for characterization have been compared to the likes of Harper Lee, Flannery O'Connor, Elmore Leonard, and Cormac McCarthy. Now the Edgar Award-winning author returns with his most accomplished and resonant novel so far\u0097an atmospheric drama set in rural Mississippi. In the late 1970s, Larry Ott and Silas \"32\" Jones were boyhood pals. Their worlds were as different as night and day: Larry, the child of lower-middle-class white parents, and Silas, the son of a poor, single black mother. Yet for a few months the boys stepped outside of their circumstances and shared a special bond. But then tragedy struck: Larry took a girl on a date to a drive-in movie, and she was never heard from again. She was never found and Larry never confessed, but all eyes rested on him as the culprit. The incident shook the county\u0097and perhaps Silas most of all. His friendship with Larry was broken, and then Silas left town. More than twenty years have passed. Larry, a mechanic, lives a solitary existence, never able to rise above the whispers of suspicion. Silas has returned as a constable. He and Larry have no reason to cross paths until another girl disappears and Larry is blamed again. And now the two men who once called each other friend are forced to confront the past they've buried and ignored for decades.", "title": "Crooked Letter, Crooked Letter", "url": "http://www.goodreads.com/book/show/9436201-crooked-letter-crooked-letter", "average": 3.83, "cover": "https://images.gr-assets.com/books/1328069022l/9436201.jpg", "reviews": 4493, "authors": [{"url": "https://www.goodreads.com/author/show/125736.Tom_Franklin", "name": "Tom Franklin"}], "type": ["Mystery", "Fiction", "Mystery", "American", "Gothic"], "outlinks": ["http://www.goodreads.com/book/show/9436201-crooked-letter-crooked-letter", "http://www.goodreads.com/book/show/7948230-crooked-letter-crooked-letter", "http://www.goodreads.com/book/show/16301400-l-avvoltoio", "http://www.goodreads.com/book/show/9429500-crooked-letter-crooked-letter", "http://www.goodreads.com/book/show/9674087-crooked-letter-crooked-letter", "http://www.goodreads.com/book/show/9819204-crooked-letter-crooked-letter", "http://www.goodreads.com/book/show/17349083-the-tilted-world", "http://www.goodreads.com/book/show/214340.Hell_at_the_Breech", "http://www.goodreads.com/book/show/367625.Poachers", "http://www.goodreads.com/book/show/385530.Smonk", "http://www.goodreads.com/book/show/27131485-mississippi-noir"]}