{"ratings": 9728, "userreviews": [{"userName": "Angela M", "userReviewDate": "Jul 06, 2014", "userURL": "http://www.goodreads.com/user/show/4685500-angela-m", "userReview": "I started this on Sunday and finished it on Monday. It was just one of those books that is filled with secrets of the past that you just have to know about and characters that you love as soon as you meet them and then you love them more as the author lets you see who they are.Almost twelve years old and still reeling from the death of her father, Ibby is abandoned by her mother and left on the doorstep of a grandmother who she just barely found out she had. Fannie, her grandmother is a seemingly eccentric, smoking, and gambling, woman is really a mentally unstable, sad woman who has many secrets. The loving relationship that develops between them will move you. The story is set in New Orleans just as the Civil Rights Act is passed in 1964. Queenie, the endearing maid who “came with the house “has endured losses of her own. She is wise but set in old ways and doesn't think anything will change with the passage of the Civil Rights Act. Dollbaby, her daughter, of the newer generation wants change not just for herself but her daughter. These women become as big a part of Ibby’s life as they are of Fannie’s.The secrets, one after another begin to unfold about Fannie's life. Ibby learns about Fannie's hard life as a child and how she came to New Orleans. I loved the descriptions of the French Quarter, both when Fannie first came there and in the time when Ibby arrives. But it isn’t until the end that the whole story is divulged.The story though is about more than just the time and place. It is about loss, about friendship, family, race and prejudice, but mostly about the beautiful relationships between these characters. There are things that happened in the past that Ibby doesn't learn until the end , but the most important things she learns is that she is not alone. It’s a beautiful story, beautifully written and full of heart and love.*****************************************************************************************************************Thank you to PENGUIN GROUP Viking and NetGalley for the opportunity to read this book.."}, {"userName": "Jen", "userReviewDate": "Jul 02, 2014", "userURL": "http://www.goodreads.com/user/show/27709782-jen", "userReview": "This is a subtle, southern charming read that gets under your skin as you read it. It’s 1964 in the deep south of New Orleans. It’s the summer and the heat is oppressive. Ibby Bell is abandoned by her mother just after her father has passed away. She is literally left on the doorstep of her eccentric grandmother whom she has never met. The atmosphere of the story is one of racial tension, acceptance of differences and the love and protection found in a non traditional family. A 50-year old story unfolds that is amazingly sad but full of hope and provides such clarity. McNeal’s writing is both descriptive and thematic. The story is told from Ibby’s point of view, however throughout there are various flashbacks into her grandmother’s life that tell her story. There was only one minute part that I didn’t quite buy into and kept this at a 4.5 rather than a 5★. Well worth the read if you enjoy southern lit."}, {"userName": "Diane S ☔", "userReviewDate": "Mar 29, 2014", "userURL": "http://www.goodreads.com/user/show/4159922-diane-s", "userReview": "3.5 A coming of age story set in New Orleans during the era of Civil Rights. A story that is gently and atmospherically told, filled with secrets, family and tragedies from the past that have a strong hold on the present.It is, however, the characters that make this novel so special. Ibby I 12 hers old, her father recently dead, when she is dropped at her grandmothers house, by her mother. A grandmother she had never met and had been told by her mother many bad things. There she meets two wonderfully drawn black women named Queenie, the other Queenie's daughter who they call Dollbaby. Her grandmother is a generous, often overwhelmed woman, whose life holds many personal struggles and secrets. The rich characterizations of these characters is amazing.We get little bit of the music scene, a visit to the black community and their church when President Johnson signs the Civil Rights Act, and a Vietnam War protest a Tulane. We watch Ibby grow and as secrets are revealed, her struggle to understand the woman who is her grandmother. A wonderfully written Southern novel, full of the atmosphere that is still found in New Orleans today."}, {"userName": "Sharon", "userReviewDate": "May 06, 2014", "userURL": "http://www.goodreads.com/user/show/7280942-sharon", "userReview": "To all those comparing this to The Help by Kathryn Stockett..STOP IT. It's not even close. The plot here is good, but the writing is clunky and inconsistent. Difficult to follow."}, {"userName": "Lucy", "userReviewDate": "Jul 14, 2014", "userURL": "http://www.goodreads.com/user/show/2472340-lucy", "userReview": "Very disappointing. I wanted to like Dollbaby, but it was a real letdown. If you're looking for the next The Secret Life of Bees or The Help, this is not it. Dollbaby reads like a young adult novel. The narration is mainly devoted to spelling out historical details and includes some strange, nonsensical metaphors; the dialog is clunky and contains too much exposition; and the character development is simplistic. The story is disorganized, with plotlines that go nowhere. There are a handful of very good scenes that hint at the book this might have been, but most of it is a big disappointment. And why is it called Dollbaby? The reason is flimsy at best. The character Dollbaby is a potentially terrific lead character, but she remains only a supporting character throughout. My suspicion is that an editor thought it would look good on the cover. (The book does have a great cover, I'll give it that.) This might be a good read for a junior high school-aged reader who has just been introduced to To Kill a Mockingbird. There's no comparison between the two - not by a long shot - but that's the right audience for this novel."}, {"userName": "Elizabeth of Silver's Reviews", "userReviewDate": "Jun 24, 2015", "userURL": "http://www.goodreads.com/user/show/1882027-elizabeth-of-silver-s-reviews", "userReview": "The 1960's, New Orleans, a matriarch, a girl without a daddy, housekeepers, families, and secrets.Ibby was moved to her grandmother's home after her father passed away so her mother could have some time to herself. Ibby had never seen her grandmother before nor had she known about her until a week before this move. Ibby was frightened especially since she heard stories about her strict grandmother from her mother.Ibby met Queenie and Doll before meeting her grandmother. Queenie and Doll are the staff in Grandmother Fannie's house. They are very loving and caring and huddle around Ibby and take good care of her when Fannie can’t. The characters in DOLLBABY were ones I fell in love with along with Ibby, whose real name was Liberty Bell. Ibby was an understandably sad young lady for a twelve-year old with a heartbreaking story.Queenie and Doll were warmhearted, Fannie was rough on the outside but loving on the inside with a past that was kept secret as well as a few other secrets that made the ending superb. Birdelia was sweet even though she was kept out of sight most of the time and had a story of her own. Well…just about every character had a story that was kept under wraps.If you love Southern fiction with a Gone-With-The-Wind feeling, you will love DOLLBABY. We the reader follow Fannie, Ibby, Queenie, Doll, and Birdelia in their day-to-day activities during the time of The Civil Rights Movement.DOLLBABY is an engaging, beautiful debut novel with amazing description, terrific, authentic characters, and a true-to-life storyline. The cover itself will pull you in and will keep you reading. Historical fiction fans and fans of family sagas will not want to put DOLLBABY down and will miss the characters when the book ends. The ending was filled with revelations and proves family is everything even though they might have secrets.Add DOLLBABY to your reading list this summer. I know you will love it too. It is going to be a favorite read for this year. The characters are what made DOLLBABY special.I truly enjoyed this book. I hope you can read it too. 5/5This book was given to me free of charge and without compensation by the publisher in return for an honest review."}, {"userName": "Julie", "userReviewDate": "May 07, 2015", "userURL": "http://www.goodreads.com/user/show/5210022-julie", "userReview": "Dollbaby by Laura Lane McNeil is a 2014 Viking Adult publication. This highly praised novel has oft been compared to “The Help”, and to a lesser extent “The Secret Life of Bees”. However, I would advise you to avoid going into this book with that type of preconceived notion. This book is nothing at all like “The Help” with the exception of it being set in the south in the 1960's, and featuring strong black women, but the similarity ends there. When Liberty's ( Ibby) father dies suddenly, her mother abruptly drops her off at her paternal grandmothers' home without Ibby ever having met the woman, and with no indication when her mother might return for her. Fannie is nothing like Ibby thought she would be, and with Queenie and Dollbaby on hand, Ibby settles into a new life in New Orleans with these three special women who raise her into adulthood, while Ibby slowly unlocks the dark family secrets Fannie has hidden in the old house for all these years. The hot, humid backdrop of New Orleans in the sixties where race tensions were high provided a uneasy backdrop to this engrossing coming of age story. Queenie and Dollbaby are the real caretakers of Ibby, although Fannie makes most of the big decisions about her granddaughter's future, such as attending a prestigious Catholic school, despite the fact they weren't Catholic, as an example. Queenie and Dollbaby know most of Fannie's secrets and moods, and slowly reveal them to Ibby until she finally has clearer picture of who Fannie is and what is at the root of her instability. You will most likely begin to piece together the truth about Ibby's family as time passes on, but ultimately this is a story of friendship, love, and family. The writing could have been a lot more cohesive and the outline needed some work. However, at the core, the story is solid, it just lacks a smoothness to it, and could use a little more shine and polish. However, the story itself overrode any writing issues. I had some mixed emotions about some parts of the story, but the south had it's own way of handling things back in the day and Fannie and Queenie, especially Queenie, took an unorthodox approach in what was most certainly a no win situation. I still wondered at some of the ramifications of Fannie's story, but can't really dissect it in this review without giving too much away. I think the story is though provoking, atmospheric, sad, yet ultimately the truth, as harsh as may have been, really showed that love transcends all manner of obstacles, especially with family. Forgiveness, acceptance, and peace often comes at a high price and all the women in the story made sacrifices in order to do what they felt was right or for the best. We may not agree with all their choices, but I did find them to be strong and inspirational, in the face of much tragedy and difficult times. Overall, I still feel somewhat conflicted by this book, but any story that keeps me thinking about it long after I have turned the last page, means it left an impression. I have struggled with how I wanted to rate the book, especially with some of the writing issues I mentioned, but I think the story is about average- so this one gets 4 stars."}, {"userName": "Pamela", "userReviewDate": "May 18, 2014", "userURL": "http://www.goodreads.com/user/show/20048096-pamela", "userReview": "In prefacing acknowledgements, Laura Lane McNeal praises her agent and editing/publishing team for their support, assistance, and sage advice. I concur. Without professional tutelage, “Dollbaby” might have become another diamond-in-the-rough among hundreds-of-thousands lost in an overly saturated self-published sea. That would be a crying shame. Dollbaby is a delightful coming-of-age southern jewel. It’s my kind of southern-fried fiction: regionally unique and atmospheric rich with quaint ambiance and flavor; an eclectic array of colorful characters; social graces steeped in mysticism, secrets, and perpetual hope; and eccentric magnetism unique to southern social grace – and disgrace.I felt Ibby’s pain of rejection, pawned-off onto an eccentric and somewhat neurotic grandmother whom Ibby had never laid eyes on before. I could smell the Mississippi basin and gulf sea air, and hear gulls and pelicans crying aloft. I could hear the creaking wood floor of the perfumery shop, drenched in earthy and exotic scents. And I could easily visualize Frannie’s old Victorian house complete with vine encroaching turrets and pillared portico. And oh the delight of southern superstitions: ”Queenie’s bottle tree . . . Every time she finishes a bottle of Milk of Magnesia, she sticks it on a branch of the tree. The bottles, they supposed to capture spirits that wander in the night. Mama says them spirits love blue glass, so they crawl up inside, and once there they can’t get out. Then when the sun rises, they burn all up until they no more.”Essentially, McNeal did a nice job authenticating time, place, dialect, customs, traditions, and people unique to New Orleans - and the south in general. The Woolworth’s lunch counter sit-in, along with a racially-charged false accusation and the Vietnam War protest rally gave atmospheric credence to the turbulence of the sixties and seventies. And the unique names of people, places, foods, and traditions brought N’Orleans, and all that jazz, to life. Plus I love how Ibby grows and transforms over the years, embracing Frannie, Queenie, and Doll’s affection and dedicated devotion as extended family. Truly, good or bad, all the characters were unique and adequately developed.As for mechanics, a few conversational scenes were a bit choppy. But the overall story had good flow. Divisions between current action and flashback were easy to follow. And for the most part, the story-line stayed on track. There weren't any totally pointless rabbit trails; most everything that McNeal divulged was relevant to time and place. However, not all atmospheric enhancements were relevant to Ibby’s story, especially scenes such as Woolworth. Yes it was historically significant to the Civil Rights movement. And yes it was important to the development of Doll and Queenie’s characters. But it would have made a stronger impact had Ibby been more directly tied into it. And though Frannie’s red convertible emerging on scene at the Vietnam rally was humorous, I wasn’t totally certain why it was included. Frankly, the rally scene was so brief it felt more like an aside than a major event.Overall, Dollbaby is a delightful coming-of-age story - an exceptional debut novel which I enjoyed immensely. I recommend it to all who enjoy an eccentrically rich southern tale embracing culture, hope, acceptance, and family. And because McNeal has room for growth as an author, it only means upwards and onward to greater literary heights. I’m looking forward to reading future novels from her charming southern pen."}, {"userName": "Angie Lisle", "userReviewDate": "Mar 26, 2014", "userURL": "http://www.goodreads.com/user/show/5306709-angie-lisle", "userReview": "This is southern-lit about a family in New Orleans, when a girl named Libby Bell is abandoned by her mother at her paternal grandmother's house in the 1960s and all the family secrets proceed to spill out of the closets. I loved this book. Loved. The story has the magic of Alice Hoffman, Sarah Addison Allen, Rebecca Wells, and Mildred Taylor, all rolled up into one. I also thought about the older movie version of Steel Magnolias while I read this book - not because of similar plot-lines or characters, but because of the way the story feels as it's being told. I think another reason this story made me think of Steel Magnolias so much is because I would love to see this book become a movie. I'm so glad I received a free advanced copy of this book from GoodReads First Reads in exchange for a review. I had allotted four days to read this book (reading a quarter of the book per day) but I was so into the story that I carried the book around with me and read whenever I found a spare minute. I finished the book in three days. I look forward to reading future works from Laura Lane McNeal."}, {"userName": "Laura", "userReviewDate": "Jan 13, 2015", "userURL": "http://www.goodreads.com/user/show/7555122-laura", "userReview": "I loved this book. The characters are so likeable you just can't help falling in love with them. They become family. The author continues to feed you bits and pieces until the plot comes around full circle. Loved it and highly recommend. Quick and easy book!"}, {"userName": "Jessica", "userReviewDate": "Jul 12, 2014", "userURL": "http://www.goodreads.com/user/show/188447-jessica", "userReview": "I don't understand how this one has such a relatively high rating on Goodreads. It sounded like a very promising novel of a young girl coming of age in 60s New Orleans, against a backdrop of civil rights protests and family secrets, and it's drawn comparisons to The Help. But the writing is very awkward -- most of the background information is revealed through dialogue and the concept of exposition is ignored completely in favor of offering explanations after the fact -- and the characters barely rise above cliche. Not for me."}, {"userName": "Caryne", "userReviewDate": "Jul 16, 2014", "userURL": "http://www.goodreads.com/user/show/238635-caryne", "userReview": "I have so many books on my to-read list that I didn't even finish this one. It has been compared to \"the help\" and in my opinion, is far from that in quality and story-telling. The characters are annoying, and the big family secrets revealed are obvious and boring."}, {"userName": "Judy Collins", "userReviewDate": "May 19, 2014", "userURL": "http://www.goodreads.com/user/show/11063006-judy-collins", "userReview": "A special thank you to PENGUIN GROUP Viking, Pamela Dorman Books, and NetGalley for an ARC, in exchange for an honest review.Update Audio Book 2015: Almost a year has passed since the launch of award-winning DOLLBABY,  a favorite among southern fans. Being an Audible member, I enjoy going back to some of my \"all time favorites reads\" from the previous year, and re-reading by listening to them via audio. What a pleasure experiencing once again an extraordinary and heartwarming story by Laura Lane McNeal, performed by January Lavoy,  delivering an outstanding performance! (A perfect match). Highly recommend any version; however, the audio most definitely captures the essence of time and place, as well as the intense emotions of the turbulent sixties.Move over Southern writers, this newfound author is here to stay! THIS GIRL IS ON FIRE! Laura Lane McNeal, where have you been? Hands down, DOLLBABY, The Best Debut Novel of 2014! A predicted bestseller chart topper. From the exquisite and stunning front cover, beautiful fonts, and the intricate filigree throughout the book—resonating the elegant New Orleans style of southern charm and sophistication, worthy of this much loved historical setting—matched with a beautifully- written, impressive debut novel, from the first page to the last. A heartwarming and poignant story of strong women, facing many obstacles, tragedies, and challenges in a time of racial tension during the 60’s and 70’s. From Civil Rights, Vietnam, family secrets, and lies, to the days of Woolworth’s, President Johnson, Black and white TVs to color---in the exciting and beautiful southern backdrop, where architecture, jazz, music, dance, southern creole and Cajun food feed your soul.What a storyteller---this inspiring, uplifting and funny novel, full of flawed and lovable characters, will keep crying and laughing, as they win reader’s hearts. It was 1964 and Liberty Alice Bell (Ibby) 12 yr.-old, born on July 4th, from Washington, has just lost her dad, due to a biking accident (they were on their father-daughter outing). Ibby’s mom, Vidrine, (not a very caring mom), dumps her daughter, (with no explanation), along with her dad’s ashes and an urn---on her eccentric grandmother, Fannie’s doorstep, in the historical area of New Orleans. Of course, Vidrine does not care for her mother-in-law, and the feeling is most definitely, mutual. Ibby is not aware she has a grandmother prior to this date, nor is she knowledgeable of her southern roots, her dad’s family, or anything about this foreign culture. She is grief stricken, and now left alone with a grandmother she does not even know, in a strange town.Boy, is she in for a treat of her life, when she is greeted by Fannie’s black, smart and wise housekeeper, and cook-- Queenie, who seems to run the household. Queenie came with the house, and has been with Miss Fannie since she was eighteen. She has seen and heard it all, and well equipped for the job! Queenie’s daughter Dollbaby (Doll) -- (23 yrs. old), a talented seamstress and manager for Miss Fannie, runs the household as well, keeping everyone in line. One of her main duties is ensuring Miss Fannie, the lady of the house stays calm. This group loves hiding things, and keeping secrets to protect their owner. (And let me tell you, this family has plenty of dark, hidden secrets), keeping you engrossed from beginning to end! Doll’s daughter, Birdelia (sassy and fun), also Ibby’s age, so an immediate family and friendship. (If only Annabelle could be so easy to win over). Miss Fannie has had a tough life after her husband, and two son’s death. She has a colorful past, yet is the foundation of the town, and knows everyone. Fannie is rich, street smart, has guts, tough, funny, and well respected. (Even though she does like to drink now and then, and go a little nuts). Her main family is Queenie and Dollbaby, and of course, their immediate family. Fannie will do anything to protect them, as they her. Even though Fannie is strange in many ways---she has a wonderful and giving heart and takes Ibby under her wing. However she wants to protect her in the event her mom comes back for her. The funniest is Fannie’s love of betting – tennis, golf, football, race horses, etc…..she is sharp, has a thumb on the winners, and a town of followers, ready to follow her lead. She begins to teach Ibby, the ways of the south from-- the way you dress, entertain, manners, and how to win at life! (The white gloves and pearls, a trademark of the South)—yes I am a southerner! Queenie and Doll informs Ibby the rules of the house from their point of view: Rule #1: Don’t ever go asking Fannie about her past (gets her all emotional) Rule #2: Fannie talks about her past, let her talk, but don’t go asking no questions.Rule #3 You see her hand start twitching, you better change the subject or she gone have one of her spellsRule # 4 You got something you want to know you come ask one of us Rule #5 I will tell you what you need to know, but don’t never let on to Miss Fannie that I said nothing.Rule #6 Keep Miss Ibby away from Miss Annabelle\"Just remember those rules and we won’t have no troubles!\"As Ibby searches for a family and her own identify, she finally comes to know her real grandmother, with all her secrets and flaws; and love of the other powerful women in the house on Prytania Street, who irrevocably shaped and nurtured her grandmother, past the ghosts she left behind. From the flash backs to the fifties to the present time of sixties through the seventies – what a ride, from loss and love, to forgiveness and redemption. Loved these quotes: “You can’t choose the day or time when you will fully bloom. It happens on its own time, when you least expect it. “Whenever there’s a loss, there’s bound to be a gain somewhere else. You just have to know where to look for it.”Fans of Dorothea Benton Frank, Beth Hoffman, Karen White, Susan Rebecca White, Fannie Flagg, Joshilyn Jackson, Wiley Cash, Charles Martin, Kathryn Stockett, Sue Monk Kidd, Sarah Addison Allen, Julie Kibler, and Diane Chamberlain (just to name a few of my favorites), will welcome Laura Lane McNeal’s DOLLBABY, and assured to enjoy her unique style and authentic first-hand knowledge of the south, its characters, and dialect. This big-hearted, coming-of-age debut novel, is the type of book, you cannot put down. A page-turner, keeping you wanting to know the next secret and fate; yet at you come to the close, you do not want it to end as you want to savor each word. (Missing Commander’s Palace–and my favorite seat in the garden patio). Please, let’s hope for a sequel, as these characters are too good, to end. You have to love New Orleans and this house! Would love to continue to hear more about future adventures of Ibby, Doll, Birdelia, and T-Bone. Fans will definitely root for a movie –as can you image the cast? A powerful, thought-provoking, inspiring, and satisfying read. I highly recommend! A talented author you will want to follow for years to come-can’t wait to see what comes next! Judith D. Collins Must Read Books   TOP 30 BEST BOOKS OF 2014"}, {"userName": "Sharon", "userReviewDate": "May 21, 2014", "userURL": "http://www.goodreads.com/user/show/1649933-sharon", "userReview": "Very stilted writing and xeroxed characters. DNF."}, {"userName": "leslye", "userReviewDate": "Dec 19, 2014", "userURL": "http://www.goodreads.com/user/show/3896845-leslye", "userReview": "*ALL the stars! Simply the best book to end the year with!After the death of her father in 1964, Liberty \"Ibby\" Bell is taken by her mother to New Orleans and dropped off outside the home of her eccentric grandmother who is a stranger to her. She has no way of knowing what is to come, or the people she will grow to love...redefining what it really means to be a family. There she meets Dollbaby and Queenie, the two women that know how to keep the house running and take care of Fannie, the grandmother. But they all have secrets meant for keeping. Dollbaby is a story about secrets. And locked rooms. And mental illness. But it's not a dark tale. Amid the craziness, there's also a lot of humor. It was a surprisingly light read considering the many dark subjects the story touched on (civil rights, rape, murder).I really enjoyed this book. It is more character-driven, and the slower pace didn't bother me. I loved the characters of Queenie and Doll! They are funny, sassy women who always tell it like it is! New Orleans truly becomes a character itself, experiencing the culture and vibe of this city during the 60's, from the Cajun food, to the street performers, and to the issues of civil rights.I'm not sure how I missed McNeal's debut novel when it was first published back in July, but I'm so glad I caught up to it now. I found this book to be such a treat. I wanted to linger in Ibby's world long after the book was finished. McNeal succeeded in creating characters that were both flawed and lovable, and just so real on the page. Impressive debut, and I will absolutely read her next novel. This is a definite keeper on my bookshelf!Favorite Quotes:\"You got to dance, even when there ain't no music.\" (Queenie)\"Whenever there's a loss, there's bound to be a gain somewhere else. You just have to know where to look for it.\" (Fannie)"}, {"userName": "Magdalena aka A Bookaholic Swede", "userReviewDate": "Sep 06, 2014", "userURL": "http://www.goodreads.com/user/show/1379514-magdalena-aka-a-bookaholic-swede", "userReview": "12-year-old Liberty Bell or Ibby as everyone calls her is send after her father’s death to live with her grandmother Fannie in New Orleans. That Ibby had a grandmother was quite a shock to her because it has always been her and her parents. Her grandmother Fannie lives in an old house with black servants Queenie, Dollbaby, and Crow. This is the 1960’s so segregation is still a part of the everyday lives. Ibby soon realizes that the town treats the blacks way different than the whites. She also get’s to know her grandmother Fannie better. And the years go by and Ibby grows up in the house with Fannie.As we follow Ibby from 12 till 20 years old we also follow the world around her and all the people in her lives. She grows up in a world of changes, for instance; President Johnson declares The Civil Rights Act. She also gets to know her grandmother Fannie better. I was a bit confused until the end why the book was called Dollbaby because I thought the book was more about Ibby than Dollbaby. But in the end, everything was explained.I love to read and watch movies about the 60’s, so much happened during the decade and this book was not an exception. It’s a coming of age story, but it’s also a story about Fannie that we through the book get to know better. And what a woman what a life, she is a real eccentric.I want to thank the publisher for providing me with a free copy through NetGalley for an honest review!"}, {"userName": "Patricia", "userReviewDate": "Jun 27, 2014", "userURL": "http://www.goodreads.com/user/show/9113276-patricia", "userReview": "Many readers will disagree with my rating this book two stars. I read a lot of books. This was not literature. It is a perfect Oprah Book of the Month genre and likely why it has received high overall reader score. It's a feel good book. I found it to have a predictable plot which was not believable, formulaic, simple writing, and little character development. Set in New Orleans, twelve year old Liberty Alice Bell (Ibby) is deposited by her mother, Vidrine Crump Bell, on the doorstep of her grandmother, France's Hadley Bell, whom she has never met, after her father, Graham Bell dies. The house is attended by three staff, Saphorina (Queenie) Trout, Cedric Cornelius (Crow) Trout, and Viola (Dollbaby) Trout. The book provides historical reference on food, the layout of New Orleans, the Civil Rights movement, a slight reference to Vietnam War, and New Orleans funerals. Essentially this is a story about family and what defines motherhood. The book doesn't portray most men too favorably.There is one scene where the author was clever. Liberty goes to church with Queenie. The congregation is in a frenzy over President Johnson's passing of the Civil Rights Act of 1964. It is crowded, hot, humid, and a long service. She is the only white person in attendance. The minister starts to yell, \"Give me liberty, give me liberty\" whereby she thinks he is calling her to step forward. It was a funny scene and made me laugh."}, {"userName": "Melodie", "userReviewDate": "Jul 10, 2014", "userURL": "http://www.goodreads.com/user/show/5788507-melodie", "userReview": "Literally dumped on the door step of her eccentric grandmother,Ibby must cope with not just her mother's abandonment,but living in a new city, going to a new school andtrying to fit in, all the while being the grand daughter of one of the more colorful residents of New Orleans. But she does make her way. While harboring that secret wish of all abandoned children, that her mother will return for her,she comes of age as the era of civil rights begins to hit it's stride in the deep South.The turbulence of both is the back drop of this story of family love,dramatic secrets and digging down deep for the courage to do what is right. I really enjoyed this story. I found the characters engaging and well thought out.Frequently I felt that Ibby was my southern counterpart, growing up on the cusp of great change. Wonderful debut."}, {"userName": "Sheri", "userReviewDate": "Nov 03, 2014", "userURL": "http://www.goodreads.com/user/show/6970638-sheri", "userReview": "I debated between a 2 and 3 star rating on this one. It is not really average (which would be a solid 3 star), but wasn't bad enough for me to pull the trigger on 2 stars.I think my biggest complaint was that the title (Dollbaby) and the \"big reveal\" (yes, quotes because it wasn't really so surprising) revolve around a minor character. The protagonist here is Ibby Bell (another complaint I had about the book was the names: Liberty and Graham Bell to cite a few), NOT DOLL. I could feel McNeal sprinkling in pieces of her setting (food, place name drops) and that was almost okay (overdone, but still decent flavor). However, when she started to add in the time period (mid 60s to early 70s race relations in the south) it felt not only forced, but whitewashed. Both Doll and Birdelia (another annoying name) attend protests, but neither talk to each other about it (what about black pride and supporting each other?); all of the blacks hate the Panthers (doesn't seem real). I was also annoyed at Ibby's speech in the beginning (\"a mighty handsome necklace\" is one example). At this point she is 11 years old and has lived in WA her whole life with parents who suppress their southern accent. She would not talk this way. By the end, she could have picked up some of their cadence, but on her first day she needs to sound like a northerner.Two other silly little points bothered me: Kennedy was involved in EVERYTHING (even though New Orleans is a big city and presumably there are more cops and precincts) and where did Fannie get her money? She was poor white trash when she met Norwood and he was just a ship captain and yet, she manages to leave lots of money/donations around the city (including several buildings with her name on them) AND $700,000 cash (and this is 1972 dollars!). Didn't seem to add up unless there was some long term family money buried in the background (but the house wasn't historical: Norwood bought it when they were first married around 1930). Hard to believe a ship captain amassed all of that in about 10 years.Overall, it was just too bland. The story hops along well enough, but there wasn't much substance."}, {"userName": "Myrna", "userReviewDate": "Feb 26, 2015", "userURL": "http://www.goodreads.com/user/show/8789819-myrna", "userReview": "4.5★s rounding up to 5★sSo glad I listened to the audio book. January LaVoy, the narrator, did a fantastic job bringing these characters to life!Dollbaby starts with a bang during the 1964 civil rights era in New Orleans and takes you on a journey as secrets are revealed. The characters are fantastic, strong, and resilient. They know what it truly means to be a family. The end ties all the loose ends together and left me teary-eyed. If you are a fan of southern fiction in general give this one a try. It's full of wit and charm!"}, {"userName": "Andrea", "userReviewDate": "Apr 09, 2016", "userURL": "http://www.goodreads.com/user/show/27117435-andrea", "userReview": "5 STARS!I am absurdly delighted to review Dollbaby. This is the rare kind of book where you'll begin reading it, and the next time you look up, somehow a hundred pages have flipped by. It occurs during my favorite historical time period to read about and features steadfast, but zany characters you wish were your own family. Complete with southern charm, it's a must read!"}, {"userName": "Renae (Romantic Parvenu)", "userReviewDate": "Jun 28, 2014", "userURL": "http://www.goodreads.com/user/show/4620632-renae-romantic-parvenu", "userReview": "Sometimes you can really tell when history has been sanitized and written too optimistically. Dollbaby takes place between 1964 and 1972, in the American south, featuring a cast of both white and black characters. Any realistic portrayal of this setting and period would be practically obligated to prominently portray race-related tension and struggle. Yet Laura Lane McNeal’s story is unerringly ho-hum, and any racist difficulties are quickly overcome or swept under the rug. Though Dollbaby is mostly well-written and has good intentions, the end result is a rose-tinted view of New Orleans during the Civil Rights era which didn’t ring true.Though the book’s title would suggest otherwise, the protagonist of the book is Ibby Bell, a young white girl who at twelve years old is abandoned by her mother in New Orleans with her paternal grandmother. Other characters like Grandma Fannie and her servants, Queenie and Dollbaby, are mostly peripheral and two-dimensional—though it’s a bit of a stretch to call Ibby a fully developed character. Though these people are interesting, McNeal’s characterization is hardly complex or nuanced. I really never got to know anyone in this book, even though we saw Ibby grow up from an abandoned preteen to a wealthy college student.Ibby, like the reader, experiences the world of Dollbaby for the first time, as a newcomer to New Orleans and her grandmother’s household. Fannie is a wealthy Southern woman in her early fifties with a large house and two full-time black employees: Queenie and her daughter, Dollbaby. This seems like it could be the beginning of novel fairly similar to The Help, but Fannie Bell is surprisingly progressive (probably unbelievably so). Queenie and Dollbaby are “family”—they boss Fannie around more than she bosses them, Fannie buys them a new house, pays for Dollbaby’s daughter to go to college, pays for Dollbaby’s brother’s funeral, pulls weight with the police department when family members get in trouble. In short, Fannie makes no distinction between black and white at all. And don’t get me wrong, this is admirable in Fannie, and modern readers will find her likable—but is it likely that a southern woman who came of age during segregation and Jim Crow, who was doubtless raised by racist parents, could be so completely unlike the rest of her peers? It would be extraordinary if she were, and probably a story in and of itself. But Dollbaby just takes Fannie’s egalitarian mindset in a stride and makes no big deal out of it, even though it’s completely opposite of the norm for the times.Other things, besides the “family” that Ibby finds herself in, seemed unreal to me. In the beginning of the book, Dollbaby attends a sit-in, but it’s made to look like a routine, unremarkable occurrence. Another character is a Black Panther, but he’s kept hush-hush until he’s summarily murdered and pushed out of the story. Yet another character was accused by an underage white girl of rape, but the charges were dropped and never came to trial. The world of Dollbaby seemed to be remarkably free of racism or conflict. Any problems were easily done away with, and McNeal’s dry, straightforward prose gave no emotion to events that should have been dramatic. The false rape accusation was introduced in the beginning of one chapter, and by the end of that same chapter, it had been completely taken care of, never to be mentioned again. There were few (if any) mentions of any other issues happening around the nation. McNeal featured a scene where President Johnson signs the Civil Rights Act of 1964, and then never touched the topic again, as if it were all over and done with. Peripheral racism existed in the book, but the main characters never seemed touched or harmed by its effects.Dollbaby is very optimistic; it’s clean and safe. Laura Lane McNeal stays far away from the more unsavory aspects of being African American in the 1960’s, and in doing so she really compromised her story. I didn’t buy into this book at all. It was far too easy and clean-cut. A lot of people in the South today aren’t as open-minded as Fannie Bell, and with no explanation as to how she came to be that way, it felt like a glossy, sanitized revision of history that was very feel-good but hardly true to life. If we pretend that history didn’t happen, then Dollbaby is an enjoyable, well-written story—but we don’t pretend that, and so I don’t believe this book is particularly honest or authentic."}, {"userName": "Sandy *The world could end while I was reading and I would never notice*", "userReviewDate": "Mar 18, 2015", "userURL": "http://www.goodreads.com/user/show/30817744-sandy-the-world-could-end-while-i-was-reading-and-i-would-never-notice", "userReview": "Dollbaby brings to life both the charm and the civil unrest of the 1960's Southern States.Set in New Orleans, Dollbaby chronicles the life of Liberty Bell who, upon the death of her father, is unceremoniously dumped at the door of her grandmothers house along with the urn containing her father's ashes. A grandmother she has never met. A grandmother who spends periods of time in the local asylum, leaving her Negro staff of Queenie and Doll to raise Libby.There are a lot of family secrets hidden behind the façade of this southern mansion. Secrets that over a period of time are slowly exposed.Not just a family saga, Dollbaby is a social commentary on that era's fast changing times of political and civil unrest."}, {"userName": "Lori", "userReviewDate": "Aug 02, 2014", "userURL": "http://www.goodreads.com/user/show/3332895-lori", "userReview": "This was a sweet southern coming-of-age novel that I would best describe as a mixture of The Help and The Secret Life Of Bees! Definitely an enjoyable read for all southern fiction fans!"}, {"userName": "Sonja Arlow", "userReviewDate": "Nov 29, 2016", "userURL": "http://www.goodreads.com/user/show/6449756-sonja-arlow", "userReview": "So many themes, issues, secrets and clichés crammed into a story that never really created any depth and complexity. The book blurb also didn’t do this story any favours by comparing it to The Help.It’s a sweet, safe and predictable coming of age story narrated by Ibby Bell, whose father passed away suddenly prompting her mother to dump her on the doorstep of a grandmother she has never met.It’s not that I am allergic to sweet stories but this book really struggled to hold my attention. The characters were nice (if very stereotypical of the South) but they just didn’t feel very real to me. The plot twists were quite predictable and the ending, well let’s just say it was a little too far fetched for me.Most of this book just felt anticlimactic. For example, the book mentions the Civil rights protests with one of the characters attending a sit-in at a local restaurant. This could have been such a great topic to delve into yet Doll went to the sit-in, police arrived and …. nothing…. Another example was when a white girl accusing a black boy of raping her. Yet this gets resolved in the span of one chapter with smiles all round.It almost felt like the author included these issues just to ground the story into the period full of racial tension rather than create real problems for the characters to overcome.There are a lot of people who enjoyed this and I must give credit to the audio narrator who did an excellent job creating atmosphere however this is not a book I will actively recommend.If you are interested in Southern Fiction I would rather recommend A Grown-Up Kind of Pretty. Its easy reading southern fiction but with a lot more substance to it."}, {"userName": "Melinda", "userReviewDate": "May 24, 2014", "userURL": "http://www.goodreads.com/user/show/30751354-melinda", "userReview": "The setting undoubtedly adds zing to this touching coming of age story. As we ride along with Ibby on her journey from adolescent to adulthood we are invited to the exciting and turbulent times of New Orleans during the mid 1960's to mid 1970's. Experiencing the culture and vibe of New Orleans from succulent food, vibrant street performers to the issues of civil rights. A delightful, touching and inspiring story of one young woman's discovery of herself, her family and the family she never knew she had as well as the hidden finally secrets brought to light. Impressive debut from McNeal, a perfect balance blending sensitivity, seriousness and humor, all encompassing a heartwarming novel. \n\n\"Queenie pointed a finger at Ibby. \"Rule Number One in this house. Don't ever go asking Miss Fannie about her past. Rule Number Two. She starts talking about her past, let her talk but don't go asking questions. Rule Number Three. You see her hand start twitching, you better change the subject. Rule Number Four. You got something you want to know, you come ask one of us. But don't never let on to Miss Fannie that I said nothing. That's Rule Number Six.\"\"That's Rule Number Five, Mama. There ain't no number six,\" Doll said.\"Doll, shut your mouth. Miss Ibby knows what I'm getting at.\"Doll rolled her eyes. \"Maybe Rule Number Six should be don't argue with Mama.\"\"That's an unwritten rule. Don't need a number.\""}, {"userName": "Trudy", "userReviewDate": "Aug 02, 2014", "userURL": "http://www.goodreads.com/user/show/2471697-trudy", "userReview": "I realize I'm in the minority here, but I vacillated between 3 and 4 stars for this book. I think I was expecting it to \"shake me to my core\", but it did not. In fairness, though, I kept thinking of SAVING CEE CEE HONEYCUTT, which I loved. On the positive side, the narration by January Lavoy was a wonderful addition. It's just that I never really connected to the characters for some reason. So, as my friend, Mitch, stated, \"I liked it, but did not love it.\""}, {"userName": "Karen", "userReviewDate": "Jul 09, 2014", "userURL": "http://www.goodreads.com/user/show/12851291-karen", "userReview": "I really enjoyed this book and the characters."}, {"userName": "Terri", "userReviewDate": "Jun 02, 2014", "userURL": "http://www.goodreads.com/user/show/5963725-terri", "userReview": "Review also found at http://kristineandterri.blogspot.ca/2...4.5 starsI received an advanced copy of this novel from the publisher via Edelweiss in return for an honest review. The expected publication date is July 3, 2014. Thank you!This story was absolutely wonderful! I'm tempted to end my review here. The reason is because a) it is true and b) this is a story that the reader needs to discover on their own and not through a bunch of other peoples opinions. Therefore I will not discuss the plot at all in my thoughtsThere are so many elements that are woven together that make this story worth reading. The wonderful portrayal of the south, the racial divide of the 60's, family secrets and an abandoned girl who does not know what family means. Mixed together it makes a story that is understated and powerful at the same time. Truly a gem of a read. Fans of historical fiction will love this read.I admit I figured out some of the secrets before they were revealed however this did not hamper the story. I understand that this is a debut novel and I must give a big round of applause for having such an impactful story the first time out of the gate. I will be keeping my eye out for future work by Laura Lane McNeal based on this home-run!"}, {"userName": "Stacy Boyles", "userReviewDate": "Aug 10, 2014", "userURL": "http://www.goodreads.com/user/show/27092418-stacy-boyles", "userReview": "I loved this book. I have figured out that I love to listen to old southern stories. My highlight listens in past 18 months have been The Help, The Invention of Wings, The Kitchen House, To Kill a Mockingbird and now Dollbaby. I need to look for more books from this era and this writer. The narrator did an excellent job also. Overall, great story with lots of twists and southern secrets."}], "description": "Působivý debut s atmosférou oblíbeného románu Černobílý svět. Malou Liberty zavane osud z Washingtonu do jižanského New Orleans, kde ji matka po smrti Libertina otce nechává u dosud nepoznané babičky. Krátké prázdniny se však nepředpokládaně prodlouží na neurčito a prostředí amerického Jihu šedesátých let dává dívence poznat černošskou mentalitu a kulturu a otevírá jí úplně jiný svět. Po vzoru svého jména, znamenající Svoboda, a pod vedením svérázné babičky Fannie zde Ibby, jak jí všichni říkají, dospívá. V domě žije také černošská hospodyně Quennie a její dcera Dollbaby. Dodržují se tu jistá pravidla, a to především zásadně se neptat na minulost – ta totiž skrývá tragická tajemství…", "title": "Cukrová panenka", "url": "https://www.goodreads.com/book/show/35004997-cukrov-panenka", "average": 3.83, "cover": "https://images.gr-assets.com/books/1493391101l/35004997.jpg", "reviews": 1494, "authors": [{"url": "https://www.goodreads.com/author/show/7353473.Laura_Lane_McNeal", "name": "Laura Lane McNeal"}, {"url": "https://www.goodreads.com/author/show/7034493.Jana_Kord_kov_", "name": "Jana Kordíková"}, {"url": "https://www.goodreads.com/author/show/15453222.Diana_Delevov_", "name": "Diana Delevová"}], "type": ["Historical", "Fiction", "American", "Young Adult", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/35004997-cukrov-panenka", "http://www.goodreads.com/book/show/18693929-dollbaby", "http://www.goodreads.com/book/show/20492467-dollbaby", "http://www.goodreads.com/book/show/22855434-dollbaby", "http://www.goodreads.com/book/show/23398944-dollbaby"]}