{"ratings": 1660, "userreviews": [{"userName": "SueBee★bring me an alpha!★", "userReviewDate": "Jan 04, 2016", "userURL": "http://www.goodreads.com/user/show/15735368-suebee-bring-me-an-alpha", "userReview": "⭐️⭐️⭐️⭐️! Damage Control, book 2 of 4. Shane & Emily must come clean about their secrets to gain the upper hand in a game over a fortune!\n\n\n“I wonder,“ I say my gaze finding hers, heat simmering low in my limbs, one part lust, another part fury, “how it is that I didn’t taste your lies. I wonder if they’ll taste differently now that I know they exist.”\n\n\nBooks in Dirty Money series should be read in order:Book 1: Hard RulesBook 2: Damage ControlBook 3: Bad DeedsBook 4: End GameIn Hard Rules, book 1 job candidate Emily Stevens, on the run from something, met attorney and heir Shane Brandon. And so she was pulled into a battle over a fortune, between a deathly ill father, a meddling mother, one good brother and one who seems to have fallen from grace.Damage Control, book 2 opens up to distrust. While Shane and Emily sort out their differences… in the bedroom, the world around them caves in. They will find themselves entangled with mobsters and hackers in a power game riddled with secrets, greed, deception, danger and conspiracy. Nine words to describe Shane Brandon: Noble, perceptive, loyal, dutiful, dominating, powerful, conflicted, enigmatic and private.Nine words to describe Emily Stevens: Secretive, loyal, cautious, naive, smart, perceptive, confused, vulnerable and desperate.Damage Control, told from dual POVs, is a suspenseful whirlwind romance featuring a struggle between right and wrong; good and evil in a fight over an empire, a legacy and a fortune. It ends leading right to book 3, \nBad Deeds\n for the continuation of their saga!***Hero: ★★★★Heroine: ★★★★Plot: ★★★★Storytelling: ★★★★★Sexual tension: ★★★★Sex scenes: ★★★★Story ending: N/A******************************************OVERALL RATING: ⭐️⭐️⭐️⭐️Angst: | MEDIUM FOCUS |Darkness: | MEDIUM FOCUS |Humor: | LOW FOCUS |Kink: | LOW FOCUS |Romance: | HIGH FOCUS |Sex frequency: | MEDIUM FOCUS |Suspense: | HIGH FOCUS |\nARC provided to me by author Lisa Renee Jones & St. Martin’s Griffin, via Netgalley, in exchange for an honest review."}, {"userName": "Natalie The Biblioholic", "userReviewDate": "Jul 02, 2017", "userURL": "http://www.goodreads.com/user/show/39243185-natalie-the-biblioholic", "userReview": "Let me start off by saying that although I rated this with five stars, I was really disappointed with Emily's secret. Am I really the only one? Seriously??? I mean... there was so much buildup to it... it caused so much tension between her and Shane... that when it was finally revealed I was like 'That's it?' I gather that it's a big deal and life-altering but... I was a bit let down. I hope this plays a bigger role in the book to come.Anyho... that was my only issue with the ENTIRE story. It really was a stunning story. Shane was still trying to hold his family together, get the business back on the 'right' track, cling to hope, and relish the deep connection he shared with Emily. I'm a huge fan of how the author brought these lovebirds together and how in sync they were in this book.Between trying to balance the unwanted attention of the cartel, the potential backstabbing of former allies, the further deterioration of the relationship with his brother, and the chaos and dysfunction of the Brandon clan, it's clear that Shane needs the sanity and peace he finds with Emily. It's a good thing she has no plans on EVER leaving. And while this book certainly cleared up some details, it's beyond obvious that this story has many legs and is far from finished.Release Date: February 21, 2017Genre: Contemporary RomancePOV: Dual - 1st personHeat: 4 out of 5Type: Book 2 of the Dirty Money series"}, {"userName": "Lisa Jones", "userReviewDate": "Sep 25, 2016", "userURL": "http://www.goodreads.com/user/show/1892928-lisa-jones", "userReview": "BAD DEEDS (Dirty Money book three) is AVAILABLE NOW!! And get the FIRST TWO CHAPTERS of END GAME (the fourth and final Dirty Money book)!BUY BAD DEEDSAmazon US ➜ https://goo.gl/qA5gLuAmazon UK ➜ https://goo.gl/YHD8VLAmazon CA ➜ https://goo.gl/ZXZpd2B&N ➜ https://goo.gl/on1Ex3iBooks ➜ https://goo.gl/w9BS87Audible ➜ https://goo.gl/oRhBYmGET THE FIRST TWO CHAPTERS OF END GAMEhttps://us.macmillan.com/smp/promo/en...PRE-ORDER END GAMEAmazon US ➜ https://goo.gl/XQ6KSpAmazon UK ➜ https://goo.gl/9Lo9WBAmazon CA ➜ https://goo.gl/RT5MhWB&N ➜ https://goo.gl/yfNLBMiBooks ➜ https://goo.gl/du7ce7♡ ★ ♡ THE FIRST TWO BOOKS IN THE SERIES ♡ ★ ♡READ A SEXY EXCERPT ➜ http://lisareneejones.com/excerptHARD RULES (book #1)Amazon US ➜ https://goo.gl/g6KSmJAmazon UK ➜ https://goo.gl/fUPZSdAmazon CA ➜ https://goo.gl/YWsNpCB&N ➜ https://goo.gl/4H78UWiBooks ➜ https://goo.gl/PVdRmTAudible ➜ https://goo.gl/snXHAQDAMAGE CONTROL (book #2)Amazon US ➜ https://goo.gl/jg5FwZAmazon UK ➜ https://goo.gl/yURPf5Amazon CA ➜ https://goo.gl/mBbsf7B&N ➜ https://goo.gl/6CWmcviBooks ➜ https://goo.gl/PwuTqCAudible ➜ https://goo.gl/PrK15T"}, {"userName": "Shannon Moore", "userReviewDate": "Feb 24, 2017", "userURL": "http://www.goodreads.com/user/show/33394531-shannon-moore", "userReview": "I'll admit, I was a little hesitant when first opening Damage Control because for the life of me, I couldn't remember some of the details in Hard Rules. It had just been too long since I had read the first book! I felt awful and was trying to figure out how I could schedule in a reread during my hectic life and was getting a little flustered. I figured, 'what the heck? I'll just start reading and see how it goes.' THANK YOU LISA! At the beginning of Damage Control, there's not only a brief recap of the important details from Hard Rules, but there's also a list of the major players and descriptions of each. This was a lifesaver and you guys have no idea how appreciative I was. What an amazing idea. From here on, I could jump right into the story and not wonder if I was missing any info. \n\nLet me hold on to you, Emily. I’ll protect you.” “Remember when I said I don’t need a hero?” “But do you want one?” “Who doesn’t want a hero?” She laughs. “Especially one like you.” “Then let me—” “You don’t need someone else to save from themselves. You have your brother. But thank you, Shane. For hearing me out. For being a friend. I know you will think this is crazy, but you were fast becoming my best friend.” “Then come back to me.”\n\nRight off the bat, Damage Control starts right where Hard Rules left off. If you remember, Shane and Emily were left in a bit of a predicament at the end of book one, so immediately you're sucked back into their story. From the first page, the author takes you on a fast paced journey full of mystery, deceit and masterful manipulation. I can't stress how incredible this was! I had so many questions, but as soon as one was partially answered another came up. Lisa Renee Jones hooked me from the first page until the last. \n\n\"Lies destroy, but I fear the truth is worse.\"\n\nNot only is this book fast paced, but there's a lot of information floating back and forth so be prepared to pay attention. I really liked how there are different conflicts that this couple needs to address as well. Both Emily and Shane have their own individual conflicts (but working together as a team to kick butt!) and they also have a big problem when it comes to the future of Brandon Enterprises. These three issues are sure to keep the reader guessing and intrigued all the way through.One of my issues in Hard Rules was that while we got a lot of information, there were no answers. I had lists and lists of questions or concerns but nothing was addressed. I'm happy to report back and tell you that this is different in book number two! Not all of my questions were answered (because where's the fun in that?), but just enough to keep me satisfied while wanting more. More Shane. More Emily. More Brandon Senior, Maggie, and Derek. More Seth and Nick and Adrian. It's an exciting, gripping, compelling read. \n\nYou will never trust me again. Not when everyone around you lies and cheats, and cuts each other’s throats just to watch the other bleed.” “I’d bleed for you.”\n\nI am a huge fan of the fact that most of this novel takes place over a very short time frame - only a few days, to be more exact. It gives this story more of a genuine feeling, letting the reader feel more concern for the characters and their situation while experiencing each of the steps they went through to try and uncover the betrayals and lies. It honestly feels like watching a crime show. I would totally watch this if it ever became optioned for a TV Drama! Move over CSI, I'd watch Dirty Money. Now, enough about all of that mumbo-jumbo, let's talk about the romance. Oh Shane and Emily... Emily and Shane. Their relationship really took a big step in this book and it was palpable. The relationship grew so much in such a short amount of time, I could practically see it getting deeper and deeper. When these two express their feelings, I believed it every single time. Trust was also a major player in the relationship between these two and I love how this issue is addressed so pointedly. There's no beating around the bush when it comes to Shane Brandon, ladies, he is something else entirely. \n\n“Shane,” she whispers. “You don’t understand what you’re dealing with.” I reach around her, cupping her backside and pulling her to me. “I’ve got you,” I say, and her hand settles on my cheek. “But who has you, Shane? That’s what I’m worried about.” “You. More than you know.”\n\nI was truly loving all of the twists and turns in this book. So refreshing and different while not feeling agressive and pushy. Even when you think things are starting to calm down, don't believe it! This book was like a roller coaster for our characters and I wouldn't have it any other way. <3 \n\n\"His demons and mine are alive and well, two poison kisses, which could too easily turn our sweet hello into a brutal good-bye.\"\n\nAfter finishing Damage Control, I'm getting a much better sense for the series as a whole. I think I even mentioned it in my last review, but Hard Rules feels more like the foundation of a house (or an empire, if you will ;) ). It's strong, it's solid and though at times dense, important for building an unshakable base. In the same sense, Damage Control becomes the building blocks of the same structure. This home is starting to take shape. Let's even call it the framing. Yes, there's still some holes, all of our questions aren't answered yet, but we're getting there. We can see the outlines and have an idea of what the finished product might look like. The rest of the build? Who knows! Anything could happen in those last two books of the series, but I for one can't wait to find out! Sort of along the same lines, I think the two books so far in the series were excellently and strategically split. It was a clever spot to separate them and gives the reader plenty of drama right off the bat in the second book. But more so as a whole, I'm loving the way that the stories are progressing with each book and growing. This is an interesting couple and an anything but average situation, I can't see what they come up with to get out of these situations! So until then, I'll just be sitting over here, twiddling my thumbs, waiting until someone can say Checkmate. *An ARC was received in exchange for an honest review.FIND US ON: FACEBOOK / INSTAGRAM / TWITTER / BLOG"}, {"userName": "Mindy Lou's Book Review", "userReviewDate": "Aug 04, 2017", "userURL": "http://www.goodreads.com/user/show/44132489-mindy-lou-s-book-review", "userReview": "This is turning out to be such an awesome series! There is so much going on that no one can claim to be bored. You've got two crazy families, the mob, FBI and a million secrets that are coming to light.You will want to start with book 1, Hard Rules. Just a small recap, Emily and Shane hook up for a one night stand only to find out Emily's new job is at Shane's company. As these two kept getting drawn together, Emily realizes Shane is in the middle of a tug of war with the family business. Shane realizes Emily is not who she says she is and he's determined to find out what she's hiding. Damage Control picks up right where Hard Rules left off. Shane is determined to get the truth out of Emily and vows to protect her, all the while he is battling his father, brother and even his mom to keep their company clean and gain control. His brother is mixed up with the mob and is willing to do anything to get the control of the business. Shane is cleaning up one disaster after another. He's willing to do almost anything to keep Emily safe and Emily is trying to help Shane by spying on his father and brother. This book kept me guessing the whole way through and I loved it! It does continue onto book 3. ARC provided NetGalley."}, {"userName": "✰ Bianca ✰ BJ's Book Blog ✰ ", "userReviewDate": "Nov 03, 2016", "userURL": "http://www.goodreads.com/user/show/3243151-bianca-bj-s-book-blog", "userReview": "We're back in Denver with our darling...Shane Brandon.And his Emily of course!Lisa tells us all about the first book again at the beginning of this 2nd book. Which is so mega-amazing for us Bookalzheimer-Sufferers! I loved that.The book starts in the same moment we left them last time. Brandon just found out that Emily has been telling him lies about herself.But she's not ready to tell the truth. The truth could hurt or even kill herself and Shane.But Shane doesn't yet believe that her secrets are not connected to his family.But they aren't. Emily saw something she wasn't supposed to see. And now very bad people are after her.And of course there are other bad people who want to destroy Shane and his family business too - like his idiot brother Derek. And his dad is still playing his stupid games.We have LOTS of stuff to go through until we might see a happily ever after somewhere on the horizon! Which of course might not happen by the end of this book, because there is more coming! ☺WHAT WILL HAPPEN TO SHANE & EMILY???WILL EVERYBODY SURVIVE??WILL THERE BE ANOTHER CLIFFY???READ THE BOOK TO FIND OUT ☺══════════════════════════════GREAT 2nd BOOK!!!!I was sooo happy that Lisa told us all about what happened in the first book. I never remember anything once I get to the 2nd book in a series!!This 2nd book was just as great as the first one.It's all so mysterious and exciting and suspensy and erotic.And again it all reminded me of Lisa's Amy Bensen series. It all felt like it was happening in the same time and place with similar people. Didn't bother me much, but I noticed it.I love Shane and Emily. They just want what's best for everybody, but it's so hard to fight for their happily ever after with so much happening. In so many different places. All very confusing and so very suspensy! But I really enjoyed reading it. You can't stop, you just have to know what will happen next. And there's ALWAYS something happening. I think this series would be an amazing TV Show!!!Lots of mystery and sexiness!Perfect Romantic Suspense!Can't wait to see what will happen in the next book because we're SO not done with #Shamily yet!!!!!☺☺☺DAMAGE CONTROL was another very interesting & exciting & sexy romantic-suspense-mystery... Run to your nearest amazon for your own Shane - this one is MINE!!!"}, {"userName": "Snow", "userReviewDate": "Feb 16, 2017", "userURL": "http://www.goodreads.com/user/show/31719636-snow", "userReview": "4.5 \"in control\" stars\n\nThe people closest to you can hurt you the most.\n\nAfter Shane confronts Emily for the false presentation she acted upon making him believe she was a spy working against him, Emily can't explain it by telling him the truth about her background and what she's actually running from, cause she wants to protect him from it. She runs away, but she's desperate, lost and alone and Shane „feels“ that even though Emily hides the truth from him, is not really working against him nor she wants to harm him in any way. Using his every resources available, he finds her and confronts her again. This time with a different result. \n\n Things happen for a reason. I believe that, and you belong with me now.\n\nEmily is adamant to leave Shane out of it but he pushes her into admission, leaving him with yet another „problem“ to deal with, in a form of a dangerous organisation called Geminis, along with the treacherous ways of conduct within his own family, the lies, the betrayal, adding the shady deals his brother Derrek has with the Martina drug cartel that want to enter into their family emipre…the secrets that are slowly eating on the threads of the family relations, leaving space to more doubts, dirty plays, hidden agendas and ploys to take over the leading role of the legacy Shane is blindly adamant to safe and guide through legal channels.\n\nYou are the best damn thing that's ever happened to me. I'm trying to make sure my family doesn't destroy us.\n\nThere's so much pressure on Shane that he's struggling to keep up with the control and with a clear head when it's all wearing him down every step of the way…\n\nI need to do damage controlLies destroy, but I fear the truth is worse.\n\nSo while Shane is coping to handle the problems leaking from every possible known and unknown direction…\n\nThere is a war raging not just with my family, but within me, between good and evil.\n\nIt's Emily who gives him anchor and his sole purpose is driven around her, to keep her safe and beside him…\nCause she's the source of both, his strength and his weakness, but without her, it wouldn't have no sense to continue with the whole rampage, destruction and shuttering the family he never quite fit into…until her, and he will go any length to protect what's his.\n\n…this war has changed me. I know that winning it – which I must- will change me even more. But I am also certain that I won't lose myself, as long as I don't lose Emily.\n\n\nDamage control\n is the sequel to the \nHard rules\n in the Dirty money series and it continues right where the book 1 ended, therefore must be read in that order.This story is throwing us right into the fire of undulated passion between Shane and Emily as they regain trust in one another and fight off the odds that are immensly smothering and threathing to their own existence but in fact it only makes them closer in binding in an eternal war where you have to do the wrong thing to make it right and while coping with the notion of it.Thrilling, exciting and passionate story of two people leaning on each other through out the raging storm of crime, betrayal and lies in the merciless games of corporate world.Eagerly expecting book 3 \nBad deeds\n…***ARC given by the author via NetGalley in exchange for an honest review***"}, {"userName": "Elfina Renee", "userReviewDate": "Mar 24, 2017", "userURL": "http://www.goodreads.com/user/show/24309155-elfina-renee", "userReview": "The lies, secrets, intrigue and classic deception kept me turning the pages. Lisa Renee Jones has one hell of a storyline, but there's so much happening behind the scenes. The villains are straight forward so while at times there might be an air of boredom, if you follow the drama, pay close attention to the key players and all the fine details, this amazing author will not only capture your attention you won't be able to put the book down. At least I couldn't. \nDamages reminds me so much of Agatha Christie & Murder, She Wrote. The sins of betrayal is laid out and the real suspense comes in knowing who is going to come out on top and win the deadly games. \nI have every intention following along with this series. Lisa Renee Jones, I'm hooked and eagerly await your next release!"}, {"userName": "Stormi (Bewitched Reader)", "userReviewDate": "Oct 09, 2016", "userURL": "http://www.goodreads.com/user/show/12516485-stormi-bewitched-reader", "userReview": "Damage Control is the second book in Lisa Renee Jones's Dirty Money Series and it was another great read. Jones flawlessly combines suspense, mystery, and romance in this book. Dots were connected and questions answered as we learned details about Emily's past. I don't want to spoil any of the surprises for any of you, but it now makes a lot of sense why Shane and Emily connect the way they do. A character who surprised me in this book was Brandon Sr. We really got to see his softer side in this book and I like his softer side, so I am really hoping he leaves the dark side in the next two booksDamage Control would have been a five star read for me, but I felt like there should have been more that happened. There were a lot of questions answered during this book, but not a lot that happened. With all of this build-up, I think Bad Deeds is going to be a very exciting book."}, {"userName": "Sissy's Romance Book Review ", "userReviewDate": "Jul 29, 2017", "userURL": "http://www.goodreads.com/user/show/1831318-sissy-s-romance-book-review", "userReview": "Book Review For: Damage Control Lisa Renee Jones 'Damage Control' by Lias Renee Jones is book Two in the \"Dirty Money\" series. This continues the story of Emily Stevens and Shane Brandon. I would recommend reading the previous book \"Hard Rules\" since that book starts their story. But, Ms. Jones did set this book up so that you could catch up to their story if you choose not to read the first book. Damage Control picks up right where Hard Rules ended. As we know Emily hasn't be honest with Shane about herself and her past. But Shane is now confronting her and wanting her to have no more lies between them. Since his brother Derek did a background check on Emily, Shane wants answers. But Emily is arguing that her secrets are her secrets and upset that a background check was done on her. Emily saw something that could get her killed and possible him if she is found out. Shane is still dealing with his family and trying to bring things to a honest dealing but his family is pretty messed up I think. I just cannot get enough of this series and their story does get continued to another book. I wish this story could be made into a movie...I love it that much!Dirty Money Series in Order:Book 1: Hard RulesBook 2: Damage ControlBook 3: Bad DeedsBook 4: End Game\"My honest review is for a special copy I voluntarily read.\"https://www.amazon.com/gp/profile/A2H... https://twitter.com/soapsrus68 https://www.facebook.com/RomanceBookR... http://booklikes.com/bloghttps://roma... https://www.tumblr.com/blog/romancebo..."}, {"userName": "Dawn", "userReviewDate": "Feb 27, 2017", "userURL": "http://www.goodreads.com/user/show/53403637-dawn", "userReview": "3.5 stars for this book, i feel really bad but ...it just didnt Entertain me :(I was so looking forward to this book & the carry on of Emily & Shane story,it started of great with a brief Synopsis of the last book, and litterly took of from the last book,but it was just to slow and for me really dragged in places i found my mind difting in lots places!and the sex sences just seemed Repetitive,Gutted :("}, {"userName": "The Romance Book Disciple (Samantha)", "userReviewDate": "Feb 19, 2017", "userURL": "http://www.goodreads.com/user/show/3009708-the-romance-book-disciple-samantha", "userReview": "Link to full review below! This series is like How to get away with murder (the TV show): twisted people, secrets and lies, and sex! I am so totally sucked in! See full review on The Book Disciple"}, {"userName": "Michelle", "userReviewDate": "Aug 07, 2016", "userURL": "http://www.goodreads.com/user/show/10367112-michelle", "userReview": "ARC provided by publisher in exchange for an honest review\n\nAhhhhh!!!!!\n Lisa Renee Jones never ceases to amaze me as she continues to knock out another amazing seductive romantic suspense in the second installment to the Dirty Money Series. In Damage Control, Lisa continues to lead her readers down the proverbial rabbit hole of suspense, mystery, chicanery,and passion. With her mastery and virtuosity of words, Jones will define the hard rules of trust, duplicity, and love as she takes reign of the meaning of damage control.If you didn’t read Hard Rules, then I am here to inform you that you can’t read Damage Control as this book continues where it last left off with Shane and Emily. And what a sexy, intricate, and heart-stopping journey it is. As secrets are slowly unraveled and the players are known, all there is left is figure out what moves will be made. And did I mention that Lisa Renee Jones turns up the heat. Yes, Shane and Emily’s relationship gets scorching hot.I know that I haven’t revealed much as to what happens in the story and that is because this book is layered with so much intrigue, raw emotions, mystery and suspense that readers must see how everything unfolds with Shane and Emily. As secrets are revealed, danger is imminent and will either of them come out alive?Damage Control was everything you could have wanted and expected from Lisa Renee Jones as she didn't hold anything back. This book was just as riveting, intense, and sexy as the first book. I loved how Lisa Renee Jones slowly dissected every facets of truth, lies, secrets, and chicanery in her seductive manner. She engages readers. Well scratch that. She entices readers to beg for more. More truth. More suspense. More danger. And more of Shane and Emily. So are you ready to get lost in this wickedly intense story whereDamage Control is a necessity?\n Lisa Renee Jones"}, {"userName": "RentasticReads", "userReviewDate": "Mar 07, 2017", "userURL": "http://www.goodreads.com/user/show/5941467-rentasticreads", "userReview": "Well, goddamn... Talk about action packed! This was way more intense than Hard Rules, that's for sure! Plus, it started exactly where the first book ended, which is always great. I absolutely love the way Lisa Renee Jones does this on all her installments. She doesn't get readers confused or lost whenever they read the second or third book in the series. She eases you and guides you through it perfectly well. It won't hurt to reread the previous book before you dive into this one either, even if just to refresh your memory. I think you'd appreciate this one more if you actually do.Shane Brandon and Emily Stevens had my heart lodged on my throat the entire time reading this. The angst, the action, the games get so much crazier and mind numbing. The revelations will make you hold your breath. Everything going on will absolutely make your heart pound. And you will just cheer for Shane and Emily's relationship so much more. I want them to win this. I want them to get through this as unscathed and unbroken as possible. But these two just can't seem to catch a break. Emily and her history was highlighted more in this book and I was more than glad about that since she kind of just blended in the background on Hard Rules for me. Consider me stumped though. Seriously, the bombs being dropped left and right here will blindside you. You will start making connections, but they still aren't enough. You'll want to fast forward time and get book three, Bad Deeds, already. This truly isn't your typical romance book. It's laced with so much suspense and it will keep on making you come up with your own theories. It's addictive, especially if you set yourself, your mind fully into it. I can't wait for the next one!"}, {"userName": "Bj", "userReviewDate": "Feb 18, 2017", "userURL": "http://www.goodreads.com/user/show/27341466-bj", "userReview": "4 \"True Allegiances?\" Stars!Lovers of torrid family dramas, steamy romances, and mysterious backgrounds to slowly reveal and solve, will enjoy the second installment in the Dirty Money Series, Damage Control. Please note though that this series must be read in chronological order, so if you have not yet read Hard Rules, please see my review for that title as this review may contain spoilers for that debut book in this series. Additionally, the story continues in book 3 (scheduled to be released in August of this year) and book 4 (planned for release in February of 2018), so only undertake this journey if you're willing to read all of the books in this series. For once you've started, you will no doubt be compelled to take this journey to its end to reveal all of the answers!Book 2 picks up where book 1, Hard Rules leaves off. There is a shroud of secrecy surrounding our heroine, Emily, and our hero, Shane, is determined to figure it out. Moreover, he is equally determined to protect her from the danger she is no doubt fleeing. So strong is his conviction that though he may not know who she really is, she is not part of the family coup that backs his brother in the fight to win his father's company. All that said his advisors are not so sure and continue to investigate her. Is Shane correct to trust Emily? And just what kind of trouble is Emily in the web of?Even as we are treated to small glimpses of the truth in Damage Control, Lisa Renee Jones continues to weave an even more intricate plot with the Martina Drug Cartel, Shane's Father, and even Shane's Mother, playing crucial roles in both the future of Shane's family's business and the fate of Shane's and Emily's love. Moreover the rift and true alliances to whom Shane's brother is truly beholden continue to evolve adding even more questions to the mix.With such an action-packed booked it is no surprise that there is no idle minute in Damage Control. Fans of Ms. Jones' classic style of romantic suspense, as well as, readers who have already been ensnared by the pull Hard Rules will definitely be anxious to read this next installment in the twisted and yet romantic journey of the Dirty Money Series.Now if only I could get my hands on Bad Deeds (Dirty Money 3), so I can continue to unravel this tale which holds two hearts and the future of a business empire in its grasp!Source: Review copy provided in exchange for a review."}, {"userName": "Nancy Brady", "userReviewDate": "Sep 05, 2017", "userURL": "http://www.goodreads.com/user/show/2870158-nancy-brady", "userReview": "Two brothers, one chess game...who will win?This is a continuation of the first novel (read it first), which finds Emily and Shane learning to trust while family (his and hers) machinations threaten to derail their relationship--and trust. Lies may do them in.Moreover, the control of the company is also at stake.Lots of spicy scenes between the pair. There are a few continuity issues as well as typos, bringing it to 4.5 stars. Having mentioned this, they are not so egregious that this reader won't be moving onto the next book in the series. In fact, looking forward to reading it."}, {"userName": "~Mandi~", "userReviewDate": "Aug 07, 2017", "userURL": "http://www.goodreads.com/user/show/16397272-mandi", "userReview": "Sex, Lies, and Deceit!!!Awesome continuation from Hard Rules. I'm so addicted to this story, I haven't put it down. I can't wait for the next book in the series to be released. So grab a copy and get ready to be sucked in to so much sex, lies , and deceit."}, {"userName": "Elle ✦ Pretty Little Books ✦", "userReviewDate": "Jan 28, 2017", "userURL": "http://www.goodreads.com/user/show/44344367-elle-pretty-little-books", "userReview": "Release Date:  February 21, 2017 Genre:  Romantic SuspenseLisa Renee Jones has done it again! She has brought to life a story that is suspenseful and romantic, and one that is extremely hard to put down. Honestly, this book consumed me from beginning to end. And, while I hate the idea of having to wait for the next book in the series (this is on me NOT the author >> I am just impatient in general) I gladly will if she keeps pushing them out like this one. Readers, make sure you read Hard Rules prior to this one as it is a continuation of that story. For those who are familiar with the series already make sure you have enough time to sit and read it all without interruption! You will get HOOKED. There are so many amazing things I can say about this novel. But, instead of going into deep detail about the plot I will just say this. Secrets will come to light (you will love this if you read book 1), love and hate will intertwine, and readers will be gripping their books for the majority of it...  Read it ! Source:  Author and Negalley. Thank you!"}, {"userName": "Guilty Pleasures Book Reviews", "userReviewDate": "Apr 14, 2017", "userURL": "http://www.goodreads.com/user/show/4391611-guilty-pleasures-book-reviews", "userReview": "As the Dirty Money series continues, Lisa Renee Jones finally starts letting us in on some of the secrets that everyone is keeping. I give Emily lots of credit in the 2nd Dirty Money Novel. She stands her ground with Shane and with Brandon Sr. She knows how to put Derek in his place and knows what she has to do to keep Shane’s mother on her side. What she doesn’t know is what Shane is keeping from her and it’s the one thing that may break her. She’s one strong, determined woman with a mind of her own but knows that there is nothing that she won’t do for Shane or to help him in his quest to keep the business on the straight and narrow, bring the Martina Cartel down and help her out of her little problem.Shane will do anything to keep Emily once he confronts her with everything that he found out. Now, she has to come clean, tell him the truth of who she is, why she’s running. It takes a lot to earn Shane’s trust in a world that he knows he can only trust certain people not to betray him and he wants Emily on his side, at his side, in his bed and in his life. When she does tell him everything, he’ll stop at nothing to get her out of the mess she is in while working to get Brandon Enterprise under control. But, with so much going on, his anger and fear start making inopportune appearances. He is trying not to go to the dark side and needs Emily to keep him grounded, in the light. The only place he wants to lose control is in bed with her.I really have no idea what is going to happen going forward in this series. Players keep being added and changing. Lisa Renee Jones keeps adding layer upon layer to this story. She brings out the best and worst in all of her characters and is definitely keeping me intrigued and looking forward to what comes next. Her writing is edgy, sexy and captivating, her characters are deep and complicated. The Dirty Money Series is turning out to be one of the most interesting I have read in a while.Review copy provided by St. Martin's Griffith for a voluntary review."}, {"userName": "Lisa Aiello", "userReviewDate": "Jul 03, 2017", "userURL": "http://www.goodreads.com/user/show/58092270-lisa-aiello", "userReview": "I received an ARC of this book in preparation for the release of Book 3, for my honest review.I absolutely love the dynamic between our two main characters, Shane and Emily. Yes, there are many many secrets that they both hold...or held. In this book, a whole boatload of those secrets and motivations come out. This couple is just amazing together. When the time comes for them to be truthful and open, they are, without hesitation, and I love how they trust each other so completely. And they have an incredible chemistry together...oh, the chemistry!!! Shane's family is one crazy, contemptible, f'd up mess of manipulation. While I love the main characters, the back story has a lot to do with hackers and drug cartels and business manipulation, and it's sometimes hard for me to follow.The author did a FANTASTIC job of recapping everyone's backstories and characters at the beginning of the book. Thank goodness, because I would have been lost since it has been quite some time since I read book 1. I am now ready to dive into Book 3 and see where this journey takes me."}, {"userName": "Karen Mc ", "userReviewDate": "Feb 24, 2017", "userURL": "http://www.goodreads.com/user/show/11017760-karen-mc", "userReview": "“The only enemy I can’t fight is the one I don’t know.”“There is no fight if they never know you.”\n\nI just finished Damage Control by Lisa Renee Jones and I’m still UTTERLY SPELLBOUND…SPINNING from the suspense where I’m still SPEECHLESS!!! I’m in a DREAMY DAZE. I can’t think straight. This story has not released my soul that is still swimming in a sea of suspense. My heart is still furiously beating out of my chest, racing like an Olympic runner. My body is going through the motions, directed by my brain that is still under the spell of this story. My mind is not mine. Damage Control rendered me MIND-BLOWN.Damage Control claimed and consumed me from the very first page. Mind racing. Feelings flowing. Eyes wide in anticipation. Heart beating out of my chest. My pulse pounded with each page as I felt the current of Damage Control flow through me. I was HIGH ON Damage Control, my drug. I could not get enough of this FIX. I was EXCITED and ON EDGE as Damage Control pushed me to the edge, transporting me to another world where I was held in suspense, left in a stupor. This story slowly seduced me, word by word, weaving me into its spell. Damage Control leapt to life so vividly, as if I were watching a movie my head. This story bled into me; I was bound to Damage Control. Shane Brandon is the white knight in a dark world, battling his feuding family for control of their corrupt empire before they all crash and burn. So many demons lurk in the shadows: his father, his brother, the mafia that is tied to his brother, and more. The one beautiful angel in his life, Emily Stevens, is not who she seems: Her life is built on lies. Shane seeks to uncover the truth while Emily wants to run from the man who’s her hero. \n\n“I don’t need you to be my hero.” “Well, I’m going to be whether you like it or not.”\n\nEmily wants to protect Shane like he wants to protect her, and she can’t let him delve into her twisted truth that is worse than the web of lies. \n\n“I don’t need to be protected from you. You need to be protected from me.”\n\nRunning away won’t stop Shane from protecting Emily, as he will catch her to keep her safe…at all costs. Emily is the best thing that’s happened to Shane and he won’t let her go without a fight. \n\n“I’ve got you.”“But who has you, Shane?”\n\nEmily wants to protect her hero as he’s protected her as both have demons ready to devour them. I loved her bravery as Emily is now Shane’s hero too! \n\n“You’re a drug to me. The only addiction, outside of success, I’ve ever had.”\n\nAll alpha, I fell for Shane hard and fast. I LOVED THIS HERO!!! Shane is tough on the outside but tender at the core. \n\n“I might not own you.”“But I own your pleasure.”\n\nI SMOLDERED and SWOONED as Shane’s words of passion POSSESSED ME!!! I felt their chemistry COMBUST!!!Emily is running from a past and hiding from the present that includes secrets that may destroy the one man she cares about: Shane. Shane is trying to save Emily, his family, and more. Lives are at stake as they may lay in the wake of mass destruction that may fall from deceit. Love may be the biggest victim in this crime. Shane is the conscience to his family’s corruption. Can he save Emily, them, and himself from destruction? \n\nHis demons and mine are alive and well, two poison kisses.\n\nDamage Control is smolder, scandal, and sin that seduces the senses while wrapping you in a web of suspense full of twists and turns, and blazes and burns. This is not just a story but an immersion into another world. A world that holds you powerless in its clutches, daring you to escape. Escaping this enthralling tale that possesses power over the reader isn’t easy. Trust me…I know.This brilliant and breathless book BLEW ME AWAY!!! I could not put the mesmerizing mystery meets romance down! This story was my drug. My high. My hope. My adventure. My addiction. Damage Control captivated and claimed ALL OF ME.Lisa Renee Jones is the queen of suspense! From Hard Rules to Damage Control, this series gets better and better! Lisa Renee Jones flawlessly executed Damage Control that ruled every piece of me. Damage Control will be hard to forget until I get my next…my final dose. UTTERLY INTOXICATING and INCREDIBLE, Damage Control is a hard act to follow!!! I bow to you, Lisa Renee Jones, for this movie in my head is still playing!!!★★★★★ masterful and mind-blowing starsWeb: http://www.bookaliciousbabes.comFacebook: http://www.facebook.com/bookaliciousb...Readers Group: http://www.facebook.com/groups/BBBBoo... Twitter: http://www.twitter.com/bookaliciousbbInstagram: http://www.instagram.com/bookaliciousbb"}, {"userName": "Laura", "userReviewDate": "Feb 21, 2017", "userURL": "http://www.goodreads.com/user/show/10804446-laura", "userReview": "***ARC Provided by the Author Via Netgalley***Whew.This one starts about 6 seconds after Hard Rules ends. This is a good thing if you have read Hard Rules, as you want to know what in the world is going on.Now is a good time to mention, this is not a standalone. You do have the author, thanks for this, in the notes at the beginning, give a sum up of what has happened. But it is a sum up and you are in no way ready to start the ride at this one.And, what a ride. With spoilers around every corner. I loved Emily and Shane even more in this one than I did in the first. I loved finding out more about her. And, in a way, this was Emily's book. Yes, there were still the issues with Derek and the father that were in the 1st one, but I really felt that the last book, I got to know Shane and what made him tick but in this one, I got to know Emily.The writing, as always with Ms. Jones, was perfect. The pacing excellent and it kept the story moving at the perfect speed, with the right amounts of tension and romance. The opening \"chase\" if you will, the revelation of Emily, the hunt for the people involved in the reason she is keeping the secrets...all excellent and interesting.The first few chapters are especially riveting and compelling, and I was not sure who I wanted to win...although I can't say more than this because it would be a spoiler of epic proportions and no one likes those.I am keeping this short to avoid giving things away...but read this. You really want to...but read the first one before!"}, {"userName": "Alexandra G.", "userReviewDate": "Aug 16, 2016", "userURL": "http://www.goodreads.com/user/show/28336219-alexandra-g", "userReview": "Loooved the first book, but this one kind of bored me to tears. I understand there has to be suspense and mystery but it felt like the book dragged along just to be a little dramatic.I don't know, maybe I'll come back to it sometime."}, {"userName": "Mg ♥ The Bookishmedialite", "userReviewDate": "Jul 30, 2017", "userURL": "http://www.goodreads.com/user/show/33436532-mg-the-bookishmedialite", "userReview": "What is about walls or doors...? LOL.\nShane has a problem with it, but not me. Oh no! I love every time he presses Emily against a wall and frames her legs with his. Sighs.Oh, sorry about that but I have to say it. So about the book.They say things get better in time. And Damage Control is no exception. Lisa Renee Jones grabbed my attention with Hard Rules. But with Damage Control, she has trapped me in a web of lies, power, control, and passion. And I don't see myself getting out of it. \n\"How do I protect her when our families are basically two tornadoes about to sideswipe us at any moment, or worse, collide, with devastating results?\"\nHere's hoping Emily's secret plays a bigger role in the next books, because seriously, that was it? All the buildup for that? It was a big thing, yes. But I was really expecting more. It was my only issue with the entire story. So, I had to get it off my chest.Enough about my issues, let's talk about Shane and Emily. Their relationship took a big step in this book. While their relationship was just ok for me in the first book, in Damage Control I found myself cheering for their relationship so much more. \n\"It's not you anymore,\"he says, his hands back on my naked waist, branding me, seducing me. \"It's not me anymore. It's us.\nYou have no idea how much I want them to win this shit. TOGETHER.Everything around Shane & Emily is a nightmare. At times while reading this I wanted to throw my kindle at the wall... then I realized I needed to find out who would be the next one backstabbing Shane, so I just kept reading. Angst will be your friend while reading Damage Control, so be prepared because the bombshells will come around when you least expect them and stab you in the face. Overall, I loved it. It feels like a new addiction. I loved the characters, the writing style and I can't wait for the next book. I'm ready for some answers... and yeah, more questions.You can find me here: \nFB PAGE\n|\nINSTAGRAM"}, {"userName": "Christine~justlovemybooks.com blog~", "userReviewDate": "Feb 15, 2017", "userURL": "http://www.goodreads.com/user/show/31054192-christine-justlovemybooks-com-blog", "userReview": "Damage Control (Dirty Money #2) is by author Lisa Rene Jones.Release Date: February 21, 2017Read: February 15, 2017NOT A STANDALONESeries: Dirty Money: #1 Hard Rules; #2 Damage Control; #3 Bad Deeds; #4 End GameMy Rating: 5Cover: 5*I voluntarily read and reviewed an advanced copy of this book from the author via NetGalley*DIRTY MONEY is about the Brandon family corporate empire, where power, sex, and deceit drive every action, and two brothers, Shane and Derek vie for control. Shane will try to convince everyone to go legit, but the darkness keeps trying to pull him under, and one woman is all that keeps him from sinking. And Shane Brandon IS money, power, and sex…Just wow! Lisa Rene Jones knows how to tell a captivating, suspenseful and emotional story where you are focused on nothing else but her book. Damage Control is the second book in the Dirty Money series. This series MUST be read in order. So if you haven't yet, you need to read Hard Rules first. There is so much going on that you will be completely lost other wise.Damage Control continues exactly where Hard Rules ended. I mean that literally. So yes there was a cliffhanger.. Fortunately Lisa Rene does not make us wait to resolve that particular issue. Yes I say particular because there are many issues in this dark, complex, crime-filled series. I won't say too much because I don't want to give any spoilers away from the first book. I do however recommend you find a quiet place to dig in. As I said previously, there is a lot going on. There are a lot of characters involved in the plot. And there is a sub plot brewing as well. I admit with the first book, I had to re-read several pages here and there because I got lost. But that's my own fault. Generally, I am a very fast reader and have been know to miss important facts. As a result, I re-read. I was so engrossed in every single page of this book. I read slower with a steady pace to not miss a thing. The premise of this series is one brother (good) up against the other (bad). A father dying and getting ready to hand over the reigns of a multimillion, if not billion, dollar dynasty. A manipulative mother...whose side is she on? Both brothers want the head position. It is almost impossible to trust anyone. When you think you have something or someone figured out...you don't.Emily and Shane got together in the first book. It started out as just sex. Emily has secrets. Shane has secrets. Both bigs ones. Although we learn Shane's early on, it is Emily's that will shock you. There are secrets revealed. There is murder. There are threats. And there is the fact that while Emily and Shane's dramas have become shared ones, while Shane's is an ongoing entity in the book, the threat of Emily's problems have not come to light yet. I can't even imagine the angst and drama that will bring to their already stressed lives.The good thing....Shane and Emily have grown very close. Their relationship is passionate and erotic. By the end of Damage Control there are no more secrets between them but there is still danger. They are a perfect couple together; both intelligent, resourceful and protective. What I loved the most is how Shane treats Emily. Yes at first is was purely lust. But now she is everything to him. And she will need to be everything for him as well. Because where this book leaves us off tells us that darker times are coming.Can Shane and Emily come out still together? I just pray they both come out alive."}, {"userName": "Shayna", "userReviewDate": "Jan 19, 2017", "userURL": "http://www.goodreads.com/user/show/7305727-shayna", "userReview": "OH MAN! OH MAN! OH MAN! This was SO FREAKING GOOD! I am REALLY enjoying this series from the amazing Lisa Renee Jones. I didn't think she could top her INSIDE OUT SERIES, but HOT DAMN, The Dirty Money Series is raising the bar on romantic suspense for sure! DAMAGE CONTROL is book two in this intense and intricate sexy series, and it must be read after HARD RULES. If you don't like cliffhangers, walk away now. This series is not for you. If you like scorching hot passionate romance with edge-of-your-seat suspense at every corner, this IS the series and book for you!\n\"I want to take care of you. Don't tell me I can't do that for you, the woman who is the one good and right thing in my life.\"\nOh Shane...you broken man. I LOVE the hell out of you! The darkness is creeping in on Shane and Emily is the only person who can keep it at bay. With lies and corruption around ever corner, it's Emily who has the power to truly bring him to his knees. Emily's first instinct is to run, but Shane is not having it at all. She can run, but HE will always be there to pull her back in.Their story HEATS up even more in DAMAGE CONTROL. The story is intricate, but it flows nicely and the writing is pretty spectacular. Beware my friends, this one is a SCORCHER! The love deepens, the connection is electrified, and the suspense is multiplied. My heart was pounding out of my chest by the time I finished this one. I knew it was going to end with me holding my breath. I just KNEW IT! In DAMAGE CONTROL, we know who the players are...we just don't know which side they are on. I am SO going to enjoy figuring that out in the next book!"}, {"userName": "Dirty Dayna", "userReviewDate": "Feb 05, 2018", "userURL": "http://www.goodreads.com/user/show/19515492-dirty-dayna", "userReview": "4  twisted starsthis book follows book 1 with its intensity, confusion and manipulation. We get to understand more characters in this book which will develop hate and intrigue for the reader. For me it felt too long more so because I felt the cliff hanger worked 3 chapters away from the actual end. But I did very much enjoy book 2 because there are sooo many loose ends, frayed pieces and players . I don't even know who I like anymore!!!! I rated it down a star because I feel the length didn't work and I feel our MC has lost her actual character identity and I am losing my desire to like her character. \n I hate him and I love him and I don't know how those two things are possible to feel at the same time."}, {"userName": "Viollar", "userReviewDate": "Jul 06, 2017", "userURL": "http://www.goodreads.com/user/show/33208866-viollar", "userReview": "4 Stars..From the beginning, this book had me by the balls...I mean Shane finding out that Emily has been hiding a secret and thinking that she is a spy...then later learning out she has her own demons...i was with it for sure..Then the 'BIG EMILY' secret comes out am just like...really??..Anyway through out the story am just at the edge of my seat honestly, i just love this series... For me its Shane and Emily's relationship more than anything else... Shane is just on another level..I mean who doesn't want a man who is handsome, rich and would die for you?? Diving into the next book.***An ARC was received in exchange for an honest review."}, {"userName": "Jessica", "userReviewDate": "Feb 22, 2018", "userURL": "http://www.goodreads.com/user/show/40203179-jessica", "userReview": "4.5 stars..Im not sure what to say about this book right now. Yes I couldn't put it down. Yes I am dying to see what happens next. Yes I freaking love Shane. He is strong, loving, will do anything for his family eventhough they don't deserve it, he has a big heart and he just wants to be loved."}, {"userName": "Lexxie (un)Conventional Bookviews ", "userReviewDate": "Jul 02, 2017", "userURL": "http://www.goodreads.com/user/show/3651677-lexxie-un-conventional-bookviews", "userReview": "This review was originally posted on (un)Conventional Bookviews\nThere is even more action and danger in Damage Control than in the first book. Emily and Shane have a lot difficulties to deal with; most of it outside of their control. Story: Danger galore in Damage Control. And the familial relationships are more than tense. Emily is still keeping back part of herself, as she is too afraid her past will catch up with her and damage Shane. The plot moves forward nicely, and the pace is fairly even. There are a lot of sex scenes, and sometimes, I skimmed part of them, as I didn't feel they always added something to the actual story. Characters: Shane is fairly standoffish in some ways, but he really cares for Emily. She has some dark secrets that come to light in Damage Control. Shane's family is like a viper nest, though, it's impossible to know who to trust. Good thing Shane's assistant and some of his hired hands are on hand to make sure Shane and Emily stay as safe as possible. Writing style : First person present tense - which brings the reader right into the action. Chapters from either Emily's or Shane's point of view. Feels : Not that many, the suspense was the main feel I had when it comes to Damage Control.Seth and his team search for Emily both inside and outside the property, while I check every spot in the hotel her access key and codes will get her, thinking she could be hiding to throw off our search.It's cold and snowing when I step outside, close to twenty degrees, if I estimate right, which means there is no way Emily, who gets chilled even on warmer nights, is going to be lingering outside."}], "description": "Wall Street meets the Sons of Anarchy in Damage Control, the smoldering, scorching next novel in the explosively sexy Dirty Money series from New York Times bestselling author Lisa Renee Jones.The only thing more dangerous than a dark secret is a damaged heart… Shane Brandon has been pushed to the brink, torn between his corrupt family and his explosive, all-consuming desire for Emily Stevens, who he now knows is not who, and what, she seems. Has he trusted the wrong person? Will she, not his brother Derek, be the ultimate destruction of his family Empire.Emily tries to run from Shane, but he will stop her, confront her, force her to reveal all – one hot touch and kiss, at a time, under every intimate detail of who this woman is, and what she wants, is exposed. But as he tears away the dangers of the unknowns with the woman in his bed, and in his heart, The Martina Cartel, has set their sites on his company, his family, and the one piece of leverage they believe he won’t gamble with: Emily.", "title": "Damage Control\n      \n          (Dirty Money #2)", "url": "http://www.goodreads.com/book/show/31370449-damage-control", "average": 4.24, "cover": "https://images.gr-assets.com/books/1474920605l/31370449.jpg", "reviews": 369, "authors": [{"url": "https://www.goodreads.com/author/show/73977.Lisa_Renee_Jones", "name": "Lisa Renee Jones"}], "type": ["Romance", "Suspense", "Contemporary", "Romance", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/31370449-damage-control", "http://www.goodreads.com/book/show/29939226-damage-control", "http://www.goodreads.com/book/show/31428810-damage-control", "http://www.goodreads.com/book/show/15717721-if-i-were-you", "http://www.goodreads.com/book/show/15839315-being-me", "http://www.goodreads.com/book/show/15839322-revealing-us", "http://www.goodreads.com/book/show/23401076-escaping-reality", "http://www.goodreads.com/book/show/23486458-infinite-possibilities"]}