{"ratings": 1243, "userreviews": [{"userName": "Chris Philbrook", "userReviewDate": "Oct 23, 2013", "userURL": "http://www.goodreads.com/user/show/13239533-chris-philbrook", "userReview": "As the author, I'm a big fan. Most importantly, as someone who has read this story, I'm constantly surprised by how entertained I am when I read it again, and how proud I am of the work I put into it.AUD is something I'll be proud of for the rest of my life."}, {"userName": "Pamellia", "userReviewDate": "Apr 25, 2014", "userURL": "http://www.goodreads.com/user/show/12457099-pamellia", "userReview": "Dark Recollections (Adrian's Undead Diary) by Chris Philbrook Began read, 4.23.2014. Completed, 4.25.2014I was looking through some books on amazon and ran across this zombie apocalypse story. I noticed it is a series and since 4 of the books have been released, I thought I'd give it a change. I absolutely fell in love with the protagonist, Adrian Ring. He was former military and I love military or former military in these many zombie books. After Adrian realizes the apocalypse has hit, he goes to several friend's homes and stops by to check on his mother. He finds different situations at each house and ends up by himself for now. Because he is able to have electricity for a few hours a day, Adrian decides to type a journal and the story starts with the first day he begins typing his journal.I learned a lot about Adrian from his journal. His fears became very real, but he remembered his training and was able to over-come much fear. Adrian's character development was well written. He used his sense of humor when writing, which most likely helped him stay sane. As he started thinking of more he could do and what he needed to do to survive, his thought process followed-up with these survival ideas. He clearly planned, organized, carried out and controlled what he was doing. He knew specific things he wanted...it was more like he went into homes or businesses looking for specific things that he already knew he needed instead of running across items and saying, “Oh, yea, I can use that.” For example, he knew he needed a wood burning stove for warmth and cooking. I mean he did come across things he wasn't necessarily looking for, but his plans were well thought out.There were a couple of chapters in the book that were not from the protagonist point of view. These chapters were the stories of what happened to a couple of different people in this small town where Adrian lived and people he happened to come across (for one reason or another) on “that day”. These were so well written. I found myself really caring about these people and wanting them to survive this terrible time. I also appreciate a map of the area in a story. This author does include a nice map of the area where Adrian was holed up.There were several typos, wrong words, misspelled words and grammar errors. For me, these mistakes did not take away from the story. I hope to see improvement in these things in the later books in the series.I would recommend this book"}, {"userName": "Joshua Christensen", "userReviewDate": "Oct 24, 2013", "userURL": "http://www.goodreads.com/user/show/25029005-joshua-christensen", "userReview": "I am so excited that this is finally going to print. For those who do not know about this story, it is time for you to check it out. The original format was entries being placed in \"Adrian's\" journal (online) every few days or sometimes a week or more apart. After my reading it for over a year and a half the story was completed. It will now be printed in its entirety in 8 full length books. The massive size of this story is unbelievable. Congratulations Chris Philbrook for the finest literary contribution I have ever been exposed to. The suspense, survival knowledge, and humor always had me looking for the next update. I remember many a late nights hoping a new entry would be posted. This series of books cover many themes, including Horror (Zombies), Survival, collapse of the thin veneer of civilization, prepping, good/evil, and great humor. It has a very unique point of view and it spreads its focus away from just alive versus undead. Some groups of people working in a cooporative and others fighting for the few remaining resources. My emotional attachment to Adrian was intense. I highly recommend picking up this book 1, Josh"}, {"userName": "Tony Hart", "userReviewDate": "Oct 24, 2013", "userURL": "http://www.goodreads.com/user/show/25025375-tony-hart", "userReview": "I would love to have given this 1 star.... because it ENDED!! lol. I have never been more attached to a group of characters, the story was excellent. I highly recommend this book for any zombie fan or book nut out there. It will make you laugh, it will make you cry (if you are a wuss because I totally didn't) it will piss you off in places. I started reading it again just because I missed the characters so much. I generally don't read a lot so it takes an interesting story to suck me in much less 8 books worth! The fact that this was the equivalent to War and Peace in length amazed me because it had my attention the whole time and it did not feel that long, I didn't want it to end! It wasn't a Toe Pusher as Adrian would say. I could have read 8 more books worth of these characters."}, {"userName": "Eric Loveless", "userReviewDate": "Oct 25, 2013", "userURL": "http://www.goodreads.com/user/show/25051779-eric-loveless", "userReview": "AUD = Best zombie story out there. Dark Recollections starts off one of the best zombie stories you will ever set your eyes on. From believable characters to situations, this book sets the tone for an epic story that doesn't experience any breaks of engauging content.Chris does a phenominal job creating a main character in Adrian and story/world that you often have to remind yourself that this didnt really happen, and Adrain doesn't actually exist. Pick it up, you wont be disapointed!"}, {"userName": "Anne", "userReviewDate": "Oct 25, 2013", "userURL": "http://www.goodreads.com/user/show/1652339-anne", "userReview": "Adrian's Undead Diary (AUD) was my first time reading zombie fiction... it was and still remains my first love....Since AUD I have read:World War Z900 MilesWhat Zombies FearZombie Fallout 1 - 7You will not find the humor, tension or raw emotion in those books as you will find with Dark Recollections. You WILL be on the edge of your seat.You will worry along with Adrian, Abby and Gilbert.You will worry about zombies on fire.I still love Adrian like an ex-boyfriend....I now know I need:many guns and a lot of ammunitiona halligan bar....a dualie....a generator...Buy this book now... you won't regret it - even if you haven't read Zombie fiction before"}, {"userName": "Shana Festa", "userReviewDate": "Nov 21, 2013", "userURL": "http://www.goodreads.com/user/show/9185553-shana-festa", "userReview": "Originally released as an online serial, Adrian's Undead Diary is now available as an eight book series. How this one slipped by me is baffling, as it fits perfectly with my preferences and meets all my needs in a piece of work. Chris Philbrook, the very talented author of the series, originally submitted Dark recollections for review. When it came up in my queue, I read it in one sitting. The book was so entertaining, I managed to get through all 266 pages in under three hours; there was no way I was putting it down. As soon as I got back from vacation, and within internet range, I contacted the author to submit more of the series. My whistle was suitably wetted, and I wanted more!Adrian Ring, dorm supervisor for a private school, finds himself jarred awake by the sound of gunshots. A woman lay in the road, her head a mass of pulp from the impact of a bullet. It is only then that he realized what he had shrugged off as a hoax was indeed the zombie apocalypse. Adrian wooed me with his self deprecating humor as he wrote entries into \"Mr. Journal\". I found myself laughing as he went old-school and pulled out \"nincompoop\", and took out his frustration on his journal, frequently telling it to F-off.Armed with a box of food, a couple new weapons from the local gun shop, and his fat cat Otis, Adrian hunkers down and barricades himself behind the walls of the school as things go from bad to worse in his community.Dark Recollections does not divulge the cause of the zombie outbreak, only that if you die, you turn. Philbrook's zombies are of the slow, shambling, Romero variety. As a lover of the gore, I appreciated his use of description and could easily envision the undead as they came to life on the pages (pun intended).One of the things I found most successful about the book was Philbrook's ability to take a normally narrow writing perspective and still give readers a feel for what was happening beyond just a single person. I didn't feel as if I were reading a narrow scope of the events as told by Adrian.So, what's the verdict? Great story line with laugh out loud humor and bloody deaths, three dimensional character development, and an exciting, fast-paced piece of work that gives even the most notable zompoc authors a run for their money.Visit www.bookie-monster.com to read my full review."}, {"userName": "Brian", "userReviewDate": "Oct 24, 2013", "userURL": "http://www.goodreads.com/user/show/8112069-brian", "userReview": "I’m not one to write reviews. But I feel I must for AUD!If you like reading comedy, drama, fiction, suspense it is ALL in here!When this first popped up in my browser I thought to myself. “Hmm, this sounds kind of neat. A post apocalyptic diary of a man and his adventures with zombies.” I then found myself going to the website and checking out the first few posts. As soon as I finished reading I became a member of the site. Vastly sucked into Adrian’s world. I would wait, very impatiently, for the next post. Then I would see a message from Chris on my FB news feed with something along the lines of; “Adrian has something to say” or “Adrian is about to write in his diary”. And joyous warmth would consume me. As a reader I tend to read a few chapters of a book. Then put it down for a week or two, come back and read some more. I generally don’t read cover to cover. But with AUD I read every diary entry as soon as it was posted. Then re-read so I could get my fix waiting on the next post.The story is written beautifully. I didn’t see anything coming as I was reading. I was surprised with every word. I became part of Adrian’s world. As the reader you feel as if you ARE his computer that he is talking to. You feel his pain and his joy. When the story finally ended, a little bit of me died along with the characters in the story. I can’t wait to read it once again in print!I list this as a MUST READ for anyone! I hope you enjoy as much as I did."}, {"userName": "Hasna' Abdulmajid", "userReviewDate": "Oct 24, 2013", "userURL": "http://www.goodreads.com/user/show/25021710-hasna-abdulmajid", "userReview": "People. Trust me on this. Get this book. The layers of drama, suspense, horror, survival, character development, and lets not forget zombies draw you in . The writing is so good that you just wont be able to put it down. Just like all the dead zombies that have to be.. made dead AGAIN.. reading Philbrook in book form is a no brainer!When I first came across Chris Philbrooks writing I was on a site where he posted a few stories and I was hooked by his style and writing \" voice'. I quickly sought him out and found his website. His writing is strong and he has much depth that you would not expect in this genre of writing. I expect that the future holds good things for Adrian's Undead Diary.. a movie maybe? Either way.. there is nothing like the feel of a book in your hands and I knew from the moment I found his site that I would prefer to read it in book form...I am so happy its finally happened and i cant wait to get my own copy and finish what I started...I probably sound like I'm getting paid but I cant dumb down sincere enthusiasm..."}, {"userName": "Nicki Hillgrove", "userReviewDate": "Oct 24, 2013", "userURL": "http://www.goodreads.com/user/show/956837-nicki-hillgrove", "userReview": "I am a long time fan of good zombie stories (which are very few and far between I might add) and I stumbled across Adrian's Undead Diary when it was a few hundred entries on the website. I started to read it to see if it appealed and when I next looked at the clock it was past midnight and my eyes couldn't focus anymore! It took me three days to catch up to the latest diary entry and then I would go back several times on the day the latest entry was due, impatiently waiting until it appeared and I could get my AUD fix. When it came to an end I was both sad and happy as the ending itself was worthy of the entire story. Adrian's Undead Diary is truly the greatest zombie apocalypse story that I have ever had the pleasure of reading and the characters are incredibly well written. I will be keeping an eye on the next project to come from this author as I know it will be just as epic as Adrian's Undead Diary was."}, {"userName": "Adrian Burt", "userReviewDate": "Oct 24, 2013", "userURL": "http://www.goodreads.com/user/show/25021459-adrian-burt", "userReview": "I started reading AUD almost 3 years ago near the beginning and have been hooked into the journey ever since. I became addicted to reading AUD and waited for more of the story, needing to know what happened next. The other thing that hooked me about the story is the realism of the situation. The main character isn't an all perfect hero, he's simply a human in this new world, making realistic mistakes and feeling the realistic emotions. The author Chris has obviously put a huge amount of work into the story and the outcome is an amazing, impossible to put down book.Deserves the highest rating and has my highest recommendations."}, {"userName": "Randy Harmelink", "userReviewDate": "Jun 09, 2014", "userURL": "http://www.goodreads.com/user/show/2029520-randy-harmelink", "userReview": "Journal-entry type books are always iffy. Sometimes they work, other times they fail. Miserably. This one scored big for me. It helps that Adrian is a likeable guy. I WANTED him to succeed.One technique that really helped is that there are two chapters, actually short stories, of people that Adrian has mentioned crossing paths with in his Journal. These short stories give us an outside perspective of Adrian. I found it very effective in making me like Adrian, and it helped to explain why some other situations played out the way they did. I found their vision of Adrian was a bit different than how I had pictured him in my mind. In a good way."}, {"userName": "William Mitchell", "userReviewDate": "Oct 24, 2013", "userURL": "http://www.goodreads.com/user/show/5488980-william-mitchell", "userReview": "As someone who has read all of Adrain's Undead Diary a multitude of times, I have never once found myself being bored when re-reading. From start to finish I am always hooked on what is placed in front of me. Chris has a way of really bringing his characters to life so much so that you really feel for what they are doing and how hard they have it. I for one am super excited about this coming to print, have been since I read the first entry to the Diary. I want this work to come with me no matter where I go, hell I think it would even make one hell of a bed time story."}, {"userName": "Laura", "userReviewDate": "Oct 24, 2013", "userURL": "http://www.goodreads.com/user/show/11715700-laura", "userReview": "This was one of the best books I have read in quite awhile. It's one of those stories that sucks you into the storyline, and leaves you unable to put the book down. I have gone back and re-read this several times, and each time I catch small bits of the story that I missed on previous views. It just gets better and better. While some readers may be put off by the idea of a story revolving about the zombie apocalypse (personally, I love it!) there is so much more to this book. A must read for anyone who enjoys characters with true depth!"}, {"userName": "Tommy", "userReviewDate": "Oct 25, 2013", "userURL": "http://www.goodreads.com/user/show/15841025-tommy", "userReview": "When I read AUD, I was expecting just another run of the mill zombie book. A zombie book where no one has any idea whats going on, and there is no guy who says \"hey, maybe we should shoot them in the head?\" I dont think I could have been more wrong. Not only did Chris have Adrian almost automatically realize whats going on, but he did it in such a way so that you are instantly glued to the book, and never want to set it down.Just a guy who wants to be loved forever,Tommy Fiebig"}, {"userName": "Jamie Rogers", "userReviewDate": "Oct 24, 2013", "userURL": "http://www.goodreads.com/user/show/25038941-jamie-rogers", "userReview": "Chris Philbrook manages to capture the reader's attention from the very beginning, and the intensity never slacks off!! I'm one of the lucky ones who has already read, and reread, AUD and I can't even begin to describe how excited I am to finally be getting a printed version! This isone of those stories that you fall in love with and want to read over and over again; it never gets old. His humor, style of writing, and fantastic characters make this easily one of my favorite reads of all time!"}, {"userName": "Gina", "userReviewDate": "Oct 24, 2013", "userURL": "http://www.goodreads.com/user/show/9168308-gina", "userReview": "Awesome book, recommend it to any zombie fans!"}, {"userName": "Stephen Glasgow", "userReviewDate": "Oct 25, 2013", "userURL": "http://www.goodreads.com/user/show/25060383-stephen-glasgow", "userReview": "I'm a pretty voracious reader, as much as being a full time dad allows anyway; I manage to rip through a book or two a week. I don't identify with any one genre, just well written stories. In the past couple of years though I've started reading more and more stories that are placed online. Not because its cheap reading but because there is a community of authors that is not only maturing in quality, but in some I've long felt that many of the finest authors out there today are the ones who have seen their humble beginnings start on the internet. They spend hours putting out their works not for the money but for the pure love of writing their story in a way that will get it read, their satisfaction coming from the enjoyment it gives their readers.Chris Philbrook in my opinion is one of the best of this new group. I just happened to discover \"Adrian's Undead Diary\" one night in passing on a forum and decided to give it a look. By the time I was done with the first post I was drawn in to the apocalyptic world he had created and to his protagonist Adrian. Many… MANY late nights were spent reading \"just one more post\" before heading to bed followed by to many tired mornings. It took several months to get through it all, indeed Chris has written a lot - but it didn't feel that way. The hallmark of a good story is its ability to suck you in and this did just that. When I found out Chris was going to take the next step and self publish I couldn't be happier for him. Not just as a person - Chris is an excellent guy - but as an author whose time has very deservedly arrived. He's spent a lot of time not just writing but listening to his fans and refining what he does, the result being the story that hopefully you will start reading yourself.Do yourself a favor. If you are a fan of a well crafted story, buy this as soon as its available. Even if you are not a fan of zombie lit you will get pulled into a story that is gripping, and behind a hero that manages to be tough as nails while never giving you that sense that he's unbeatable. You won't regret it."}, {"userName": "Savychacha", "userReviewDate": "Oct 25, 2013", "userURL": "http://www.goodreads.com/user/show/6647325-savychacha", "userReview": "I'm not the type of person that reviews just any ol' thing. The only time I tend to sit down and write a review is when it's about something that I really love. Let me just say that Adrian's Undead Diary (AUD) has been one of the most exciting and captivating stories that I may have ever read.I'm an avid reader of books, but the ones that I hold near and dear to my heart are the ones where I feel like I could actually be friends with the characters. You know those books. The ones you sit down to read and all of a sudden you're thinking about stories from your own life and people you really know and how much these characters remind you of that/them. That's what AUD is. It is undeniably relatable, and pulls you in and captures your attention from the first entry. These books are more than just a zombie story. There's suspense, and violence, and romance, and crude humor (which let's be honest, I love) and just...so much emotion. I have to be honest that there were a few parts that made me tear up. That's good writing right there. Please don't feel like eight books is too much to get invested in. You will finish the first one and crave more immediately. You will not want the story to end, and when it does, you will go back and start to read it from the beginning again. I know that's what I and many other people have done. All said and done, please give this book a chance if you are on the fence. Do yourself the favor and read this. Not only is the author an amazing writer, but he's also a pretty cool dude. I will continue to show my support by writing reviews of his books, and putting my money where my mouth is and supporting this cause to get all of AUD published. I promise that you won't be sorry if you do the same."}, {"userName": "Wendi", "userReviewDate": "Oct 25, 2013", "userURL": "http://www.goodreads.com/user/show/25064216-wendi", "userReview": "Regardless which facet of AUD it is that ultimately captivates you... humor, drama, action, survivalism, horror, character studies... I promise that you will be captivated. Because Chris Philbrook hasn't just crafted us a story to read, he's presented us with a journey (and an epic one at that). Alongside a cast of inherently flawed, inherently human, and completely relatable characters. I don't even think one needs to be a fan of zombie fiction to end up a fan of AUD; because Chris's talent can't be pigeonholed into one limited, literary genre. His true talent lies in weaving an enduring, sweeping story that does exactly what it's supposed to do... pulls you in, engrosses you, evokes emotion, and leaves you satisfied (if not a little bit sad) when it's over. In the case of AUD, for me, the zombies are just a bonus! I can't remember a time when I didn't have my nose in a book; yet my list of favorites is a remarkably short one. From the first few passages I read of AUD, I knew it would make that list; whether it ever had the benefit of pages or binding. I am beyond thrilled that it's finally going to print, and cannot wait to get lost in Adrian's world all over again but this time the old fashioned way... one page at a time."}, {"userName": "Nahuel La torre", "userReviewDate": "Oct 24, 2013", "userURL": "http://www.goodreads.com/user/show/25031499-nahuel-la-torre", "userReview": "This book is by far the best zombie action/drama/journal story I've read in many years. The story has a lot of sense, there aren't black holes and the story sustains itself from the beggining until the end. The characters are tremendous, every one of them has a story to tell, and in the end, you love them all as they are people you know in real life! Adrian, Abigail, Gavin, Gilbert and Blake were my all times favourites all the ride long. The story is depth and wide, the detail level is sometimes so accurate (i've googled several times for things i didn't know, hallingans, calibers and such) that you can literally have a daydream while you are reading, you can see, hear, feel, enjoy and fear what is happening inside Adrian's head while you read it. I've cried for Adrian more than once. If you like good stories and also like zombies, this story is for you. Even if you don't like zombies, I'm sure that the telling itself will suck you in as it will anyone else. I can't wait to get a copy in my hands. I'm not a collector, but this is something I must have, a fine piece of art that I can't let myself not having it. Read it, Feel it, Love it."}, {"userName": "Krista", "userReviewDate": "Oct 24, 2013", "userURL": "http://www.goodreads.com/user/show/5072622-krista", "userReview": "I loved this story. So much so that I felt awful when I had read the last page! This story leaves you with a true book hangover! The characters are written so clearly and deeply that you feel absolute love and/or loathing for them. The story is mesmerizing - I could not put it down and eagerly awaited each new chapter. I laughed out loud at the humor, cringed at the scary parts, cheered when the bad guys got what was coming to them, and cried when my favorite characters died. More than just a simple zombie story, this narrative explores not only survival after the dead rise, but the spiritual, supernatural and emotional aspects of a man struggling to survive in a world that is doing it's damnedest to kill him."}, {"userName": "Roz Stanley", "userReviewDate": "Oct 23, 2013", "userURL": "http://www.goodreads.com/user/show/14119376-roz-stanley", "userReview": "As someone who loves the zompoc genre i can be pretty hard to please but Chris Philbrook has managed to give me many sleepless nights with Adrian Ring and the world of AUD and honestly if you havent read any of his work yet all i can ask is why not? get on it you dont know what your missing .Chris manages to bring his characters to life and make them people you care about and wait impatiently to see what happens to them next while having a refreshing twist to the usual zombie fare .AUD is super cool and rocks , Chris is an author who knows how to tell a great tale,so if your looking for an epic adventure that will keep you entertained over and over again this is the book for you"}, {"userName": "Carey", "userReviewDate": "Oct 24, 2013", "userURL": "http://www.goodreads.com/user/show/24745430-carey", "userReview": "Great author, Amazing story!! This book is about Adrian, his fight for survival from the undead and living, his struggles within, and his own brand of humor. You will become invested in this character and his story. You will be horrified, shocked, and rally along with him. In addition to becoming to know Adrian, you will get glimpses into the world around him by reading side stories about the day “it” started, or the people directly or indirectly involved with Adrian. It was hard for me to write a review for this book, because I want to do it justice, and encourage everyone to read it and the other books that will encompass this truly epic story."}, {"userName": "L Binks", "userReviewDate": "Nov 21, 2013", "userURL": "http://www.goodreads.com/user/show/25890539-l-binks", "userReview": "I have been a zombie novel fan since before the zombie fad came around. This is hands down the best zombie novel I have ever read. If this were to be turned into a television series it would rival \"The walking dead\"...forget that....it would make walking dead look real bad. Highly recommend this to anybody. You will not be dissapointed. I'm about to begin the next book in the series and at the edge of my seat to see what happens."}, {"userName": "Jon Mosher", "userReviewDate": "Oct 24, 2013", "userURL": "http://www.goodreads.com/user/show/25031841-jon-mosher", "userReview": "Quite frankly, if you are a zombie fan, this is a must for your library! Mr. Philbrook has created the defining universe for zombie fiction. Once you start reading Adrians Undead Diary, you won't be able to stop! I've read the entire series twice now, and have been blown away by how mind-numbingly good this series is!"}, {"userName": "Lindsay Ffrench", "userReviewDate": "Oct 25, 2013", "userURL": "http://www.goodreads.com/user/show/25061120-lindsay-ffrench", "userReview": "I've been reading AUD for a long time and it never fails to captivate me, I think I'm on my 4th read through. The language and detail is awesome and the characters are human and believable. I'm so excited that it's finally made it to paper, where it will guide my steps during the zombie apocalypse. Thanks for this piece of awesome literature, Chris!"}, {"userName": "Carissa", "userReviewDate": "Oct 24, 2013", "userURL": "http://www.goodreads.com/user/show/15928928-carissa", "userReview": "I am seriously so incredibly excited for Dark Recollections to come out. I've been a follower of AUD since the very beginning, and I am elated to see Chris' amazing work finally come to print. If you're reading this series, you're in for one hell of a ride, so buckle up and get ready for some toe pushin'. Also, that jinx fairy is a real bitch!"}, {"userName": "Lynne Johnston", "userReviewDate": "Oct 24, 2013", "userURL": "http://www.goodreads.com/user/show/25034017-lynne-johnston", "userReview": "I read A LOT...but this book is THE only book to have literally stopped my life while reading it...nothing else existed for me while reading it. Because of the sheer number of books out there, i have a general rule that i never re-read anything. This book breaks that rule. Seriously, just read it. If you're a Walking Dead fan, or just a fan of fantastic writing...read it. Today."}, {"userName": "Dean Adams", "userReviewDate": "Oct 25, 2013", "userURL": "http://www.goodreads.com/user/show/25064029-dean-adams", "userReview": "AUD absolutely ROCKS! My only \"complaint\" is (even at 1800 pages worth) it's too short, there's soooo much more that could be written about, many untold side stories and I'm sure there's things I've missed. I've read it online at least 4-5 times now, I want the hard copy!"}], "description": "For the first time, the internet phenomenon is now in print!Beheading a zombie isn't easy in a world where you're more afraid of the living than the dead.Adrian Ring's simple life is thrown into chaos when the world is ripped apart by a plague of undead and legions of desperate survivors. Retreating to Auburn Lake Preparatory Academy, Adrian attempts to rescue friends and family on the way while dancing around his impending insanity over who and what he left behind, and evading maniac survivors. He saves his cat Otis, but shoots his mom. Pretty successful, all things considered.Dark Recollections is the first part of Adrian's own story of how he survived after \"That Day.\" Told through his eyes as he talks to his laptop, affectionately named 'Mr. Journal,\" and through short stories that entwine with his tales that bring forth dark visions of a world being eaten alive by an unimaginable evil. Adrian's Undead Diary is an eight part epic about a solitary, guilt stricken man that didn't think he deserved to live, but realizes very soon that he survived, and suffered for a reason.", "title": "Dark Recollections\n      \n          (Adrian's Undead Diary #1)", "url": "https://www.goodreads.com/book/show/18713527.Dark_Recollections__Adrian_s_Undead_Diary__1_", "average": 4.24, "cover": "https://images.gr-assets.com/books/1382597045l/18713527.jpg", "reviews": 175, "authors": [{"url": "https://www.goodreads.com/author/show/7278507.Chris_Philbrook", "name": "Chris Philbrook"}], "type": ["Horror", "Apocalyptic", "Fiction", "Horror"], "outlinks": ["http://www.goodreads.com/book/show/18713527-dark-recollections", "http://www.goodreads.com/book/show/18886550-dark-recollections", "http://www.goodreads.com/book/show/18755971-alone-no-more", "http://www.goodreads.com/book/show/19170481-midnight", "http://www.goodreads.com/book/show/21881932-tesser", "http://www.goodreads.com/book/show/20563936-the-failed-coward", "http://www.goodreads.com/book/show/20939080-wrath"]}