{"ratings": 697, "userreviews": [{"userName": "Blair", "userReviewDate": "Sep 12, 2009", "userURL": "http://www.goodreads.com/user/show/272909-blair", "userReview": "My first impressions of this book weren't entirely favourable, due to the fact that, initially, it seemed so similar to Cottam's debut The House of Lost Souls; substitute a haunted boat for a haunted house, and the premise is basically identical. But once I started reading, all my reservations were dispelled. This is Lost Souls, but better - more confidently written, with stronger tone, pace, characterisation and narrative voice; superbly chilling, fantastically atmospheric and absolutely compelling from start to finish. It's free of the annoying repetition and grammatical errors that hampered its predecessor, and is a first-rate example of a truly disconcerting modern ghost story. I can't recommend this book highly enough and it definitely desrves to be a commerical success.Edited to add: I've read this four times now and it's never lost its lustre or diminished in power and effectiveness. I wish you could 'dislike' reviews on Goodreads, because the top-rated review of Dark Echo is a negative one, and I worry that will discourage potential readers from reading this book. In my opinion it's absolutely excellent, and if you're looking at this review you should at least give it a chance. Many of my favourite books are modern classics but I love this one above almost everything else, with only a handful of exceptions, and could re-read it endlessly."}, {"userName": "Sheila", "userReviewDate": "Apr 21, 2015", "userURL": "http://www.goodreads.com/user/show/6810645-sheila", "userReview": "It took me a long time to read this book, despite all my Goodreads ghost-loving friends' recommendations, because I thought a book about a haunted boat would be boring.I was wrong!This isn't at all what I was expecting. Most of the action takes place off the boat and is about research and history. I can see how some readers might find this dull (the book slows down a bit when Suzanne reaches Southport, especially), but I was fascinated by the steadily growing backstory and especially by the helpful intervention of another ghost. (I won't spoil his identity here, but I really enjoyed this addition to the story.)I found the book spooky in places, too; the ghost was a really twisted character. I listened to the audiobook and the reader was excellent (even if his American accent occasionally wobbled, hehe!)."}, {"userName": "Kelly McCoy", "userReviewDate": "May 09, 2014", "userURL": "http://www.goodreads.com/user/show/17472595-kelly-mccoy", "userReview": "Dark Echo surprised me in a good way. I wasn’t sure what to expect because stories about haunted ships tend to be filled with cheap thrills and ridiculous characters. But this is a solid story with fantastically written characters and settings. The Dark Echo is a sailing boat purchased by Martin Stannard’s father. The family duo plan to sail her across the Atlantic but the boat’s sinister past has Martin worried. The boat was built for Harry Spalding, a WWI veteran, and his name raises questions for Martian’s girlfriend, Suzanne. She begins researching Harry Spalding and all the other owners of Dark Echo that have died violent deaths. The book is a classic mystery mixed with a ghost story. I have never been able to describe a book as chilling until now, because this book is downright creepy. In the end, I had to knock a star off because I thought the climax seemed rushed and maybe a bit mellow dramatic for my taste. All in all I really enjoyed Dark Echo and I want to read more books like it."}, {"userName": "Shelby", "userReviewDate": "Jul 01, 2015", "userURL": "http://www.goodreads.com/user/show/32693238-shelby", "userReview": "I loved this book. It was written beautifully. At its core Dark Echo is a ghost story, and that alone provided a complex story line. But the history and mysteries involved in this novel delve much deeper than most ghost stories. I found it interesting that while this is a fictional account, the author tastefully ties in some references that are based in reality. The supernatural elements in no way came off as cliche or overdone; in fact, I was impressed by Cottam's originality and ingenuity in his use of incorporeal happenings. I enjoyed this story immensely, and I am so glad I came across it and bought it. This read was one of my favorite this year."}, {"userName": "Sue", "userReviewDate": "Dec 31, 2010", "userURL": "http://www.goodreads.com/user/show/3642045-sue", "userReview": "Very enjoyable thriller/ghost story involving a cursed yacht with ties to an apparently cursed man who performed questionable deeds during WWI. Lots of researching by one of the primary characters who turns out to be a wonderfully strong heroine.Not recommended for the faint of heart. There are some sections where the dread piles on thickly and I felt the need not to read late at night. But then I rushed through to the end, needing to know the story's resolution.As a postscript: I forgot to mention this is a more literary read than, say, Stephen King or other more popular titles. The writing style is actually an interesting facet of the book."}, {"userName": "Bettie☯", "userReviewDate": "Sep 01, 2012", "userURL": "http://www.goodreads.com/user/show/1108123-bettie", "userReview": "Bettie's Books"}, {"userName": "John Wiltshire", "userReviewDate": "Oct 22, 2017", "userURL": "http://www.goodreads.com/user/show/31591928-john-wiltshire", "userReview": "I'm currently suffering the extremely unpleasant task of wading through Cormac McCarthy's Blood Meridian on audio. It's not the gore putting me off, because, to be honest, I think people who found it violent possibly aren't horror fans? Gory and violent it's not. But it is...incredibly boring. There, I've said it. If I want a string of long words I can read them in a dictionary. Hell, I'd rather read a dictionary. I want plot! I want characterisation! But I'm not giving up on it. I am going to push through to the end and try to work out why it's lauded by critics and hailed as being an important work of literature. And why do I mention this here on a review for Dark Echo? Well I almost guarantee that the majority of people who read Blood Meridian won't have heard of F.G. Cottam. I totally guarantee that the book reviewers in the NYT and The Guardian, who hailed McCarthy's spew of words, won't have a clue about this excellent author and so he'll never get such prominent publicity for his books.I'm 40% into Dark Echo, the story of a haunted schooner, and I literally can't put it down. How's that for holding interest? There is a palpable sense of menace about this story. All its elements are brought together to add to a sense of dread that begins on the very first page. Weather is used particularly effectively: storms and rain battering old shipyards on the south coast of England buy into a almost physical manifestation of the evil unfolding. Of course, McCarthy uses weather too (a lot). But in Blood Meridian, everything is always as if or like, nothing is ever just left to the reader's own imagination. It's simile on steroids. In Dark Echo, as the protagonists battle to renovate this horrible boat, the weather brings fog, driving rain, cold, but we are left with the characters to interpret this how we wish. And it's the more unnerving for that. I have no idea who chose the cover of this edition because it has absolutely nothing to do with the story, but makes it look like a Daphne Du Maurier romance for some reason. As usual, I'll update when done...Finished. This held its excellent level of tension and interest right to the end. Once the protagonists were aboard the Dark Echo, the story narrator changes to someone researching into the background of the events which lead to the damnation of the boat and its previous owner. It's an exciting read with really likeable characters. I imagine some readers would have issue with the resolution of the story, but I found it intriguing and humbling. Excellent read, highly recommended."}, {"userName": "Leslee", "userReviewDate": "Aug 14, 2012", "userURL": "http://www.goodreads.com/user/show/4902013-leslee", "userReview": "Cottam rises to the occasion again. There are strong similarities between this novel and the first of his that I read - The House Of Lost Souls. I felt that this one worked a lot better plotwise and the flow and pacing was much stronger than in his debut work, though I do think I like the storyline of the first one better. I love the way Cottam handles the intermingling of historical figures with his modern day hauntings - something that I appreciated even more after reading the heavy-handed Shadow of Night. The book was nicely atmospheric and satisfied in that old school horror vein. I much preferred this to Adam Nevill's work (I noticed a street in here named 'Nevill' - I didn't know if this was some sort of shout out or homage, or if this is an actual street in the UK?) because I think it felt more grounded somehow. I think Cottam does a better job with mood and suspense than Nevill did, especially in Banquet for the Damned. Would recommend this to anyone who enjoys a good ghost story."}, {"userName": "F.R.", "userReviewDate": "Oct 06, 2009", "userURL": "http://www.goodreads.com/user/show/1309606-f-r", "userReview": "With laborious and wordy prose which sucks the excitement out of all the chapters, as well as some truly awful dialogue, exposition and foreshadowing, this haunted boat story doesn’t have that much to recommend it. In fact by the time the characters board the boat, so much has been dragged up about its horrible past, that it’s amazing any of them will go within a hundred foot of it – and yet still they do.To be fair though, I did like the character of demonic jazz-age rogue Harry Spalding.Interestingly, this is the second horror novel I’ve read this year which concerned itself with The Spear of Longinus. The other was James Herbert’s awful ‘The Spear’. So I can’t help thinking that mixing that particular artefact with supernatural fiction doesn’t have the best of success rates."}, {"userName": "Linda Boa", "userReviewDate": "Jan 06, 2017", "userURL": "http://www.goodreads.com/user/show/5456460-linda-boa", "userReview": "Absolutely fantastic spooky novel - the best I've read for years; in fact I'd rather given up on the genre coming up with anything new. But FG Cottam's use of old music, crackling old radio transmissions, outfits, like spats, etc, on a haunted boat, which obviously you can't get off as you're crossing the Atlantic, adds something new to the horror novel. Highly recommended - this is his best, imho, along with The House Of Lost Souls."}, {"userName": "Michelle", "userReviewDate": "Dec 22, 2013", "userURL": "http://www.goodreads.com/user/show/6032841-michelle", "userReview": "I was taken by Dark Echo right from the very first page. It was unputdownable.The story was told from the perspective of Martin Stannard. He accompanied his father, Magnus to buy a boat for his retirement plan. The boat was the famous Dark Echo, once belonged to Harry Spalding. It didn't take long though before they noticed there was more to the boat. There were the unexplained accidents that befell the workers who tried to restore the boat, its enigmatic first owner, and the boat's own mysterious past. All in all, these provided a good chilly build up for the story. Cottam also blending in few historical figures such as Mick Collins, Harry Boland (who were portrayed in ways that made me want to learn more about them), and mentioned few others such as Bricktop, F. Scott Fitzgerald, Ernest Hemingway etc. for the effect of the 1920s. The First World War also had a major part in explaining the connections and solving the ultimate mystery of the dark force. In fact, the prologue took place during WWI.The book introduced various characters; and they each had a distinctive voice. My favorite characters were Suzanne, Martin's girlfriend and Jayne Boyte. I liked Suzanne right from her first appearance. We saw further of her character development when the story was switch from Martin's first person of view to Suzanne in third in person. She was smart, intelligent, resourceful and I found to be admirable. Her love for Martin and her not giving up the fight in order to save him and his father made her much more likable to me. I enjoyed reading from her perspective more than that of Martin's. As for Jayne Boyte, she was a fun and remarkable woman for her era. And maybe in a way, she was reincarnated as Suzanne. The few things I didn't like was one, I thought the story was a bit dragging prior to the voyage; two, the ending was disappointing. After the sinister build up, I expected more or at least a twisty dark ending. Three, there was one instance where Martin mentioned something that seemed important at the beginning, but then it was never brought up again. So, that was a little meh."}, {"userName": "Karl Drinkwater", "userReviewDate": "Dec 24, 2016", "userURL": "http://www.goodreads.com/user/show/8058558-karl-drinkwater", "userReview": "The book began interesting: for the first half I was truly riveted. It was filled with eerie ideas, and I looked forward to what was going to happen. There was a great build up of tension to the point the story had been working towards, the start of the ill-fated voyage, and it left me excited at the prospect of things going up a further notch. But then ... it seemed to just lose it. Tension and credibility floated away and all the great elements seemed to fizzle as an anti-climax. I noticed a lot of other reviewers enjoyed the start but then felt the book floundered as it got further on. Compared to what went before it switched from scary hints to chatty ghosts, and the previously-strong father folded like paper. Then they took to a cabin and pretty much disappeared from the novel until the final scene. We find out the ship had decayed around them: it sounded fascinating and creepy but we see nothing of it - instead the novel switches to a far less interesting slow detective mystery, full of coincidences. I felt as I would if I'd been reading The Shining, and at the point when The Overlook got most active Stephen King switched from all that escalating horror to a bunch of scenes set in Scunthorpe involving an archive, then just came back to the hotel for the finale. It wouldn't have worked, and that is, sadly, what happens here. The story becomes more and more conventional, and the intriguing hints turn out to be exactly what you expected: haunted boat, satanic rituals, then it is all tied up with marriage and a baby. Honestly, it’s that most typical of Hollywood of endings. Even the threat is tied in to a conventional Christian God versus Satan worldview, with Jesus relics being snuck in as Macguffins, while priests say prayers to defeat evil. We've seen it all before. Despite the familiarity it is probably a lot more satisfying if you are a Christian and believe it - but for anyone agnostic, atheistic, or who follows a different religion, it all falls apart at that point. I remember reading Clive Barker's \"The Hellbound Heart\" and being impressed by his imagination, the way he gave fresh views to ideas of evil and good, convincing portrayals I'd never seen before, that could fit alongside any religion (or no religion). Unfortunately Dark Echo devolves into a disappointing set of occurrences that feel overly familiar. I wouldn't have minded if there hadn't been so much promise and ominousness at the start. Really, the first half was so good that the rest seems weaker by comparison.Then there were all the elements that were confusing or hard to swallow, usually tied to facts and twists that the author wanted to establish or reveal but which didn't seem like believable actions or conclusions by the characters. There were one or two typos or repetitions (hardly noticeable) but it's more that some elements just seemed unconvincing in the second part, or like editorial oversights.- I found it far-fetched that Suzanne goes to France for a day to look at a barn someone stayed in 90 years ago on the vague idea of \"finding clues\".- Jane had a daughter, mentioned in passing near the end - but the daughter wasn't mentioned in any scenes previously, nor newspaper accounts, nor sources, nor her diary. Weird, where was this daughter when Jane swam in pools, spent time with her friends, went to parties, flew planes, got arrested? Hidden in a drawer? Why did she not mention it?- Jane's deposition – it was unclear how it tied in to her being arrested. It was all about Spalding, but presumably she wasn't arrested for that (she didn't drop a bomb from the plane, didn't attack him, hadn't been arrested by the unsympathetic policeman she saw). So why had she written a deposition about Spalding, what relevance were those details to the police, what crime had been committed? Maybe I overlooked something.- Suzanne goes to a town, stumped in her investigation; then someone sits at her table, and it turns out this person knows has information Suzanne was seeking, including details from 90 years ago (in a crazy amount of detail about someone the coincidental character had never met). The author slips in a “maybe it was fate” comment in an attempt to justify the coincidence and hide that it is just done as an easy way for them to slip in exposition.- Suzanne rings a priest on the off-chance he might know something, grabbing at straws – then the priest misinterprets her call, thinks she knows something, so reveals that there’s a conspiracy of some kind, and she plays along – then forgets it for ages as if it is not worth a mention or consideration, even though it could be massive (and was revealed through coincidence - the author covering their back by having the priest say \"I would have told you anyway\").- On p296 Jane wrote (in 1927) about “blind loyalty to one’s gender”. But in 1927 people used the correct term for male and female - sex. Only in modern times (post-1963) did people habitually start using the wrong word, gender.Characters also often know or assume things they wouldn’t really be aware of. Examples:- Suzanne says her (male) boss goes to the toilet to be sick. How on earth would she know?- Likewise Suzanne’s reports include details she couldn’t know. E.g. about a detective in the past who woke to find a threatening bullet on his pillow, so he never wrote his article. How did Suzanne know about the bullet on his pillow then, all that time ago, not having spoken to him?- “And Jack Peiterson had gone” says Martin, reiterating what his girlfriend had already said, tied to a subplot: yet they had no reason to think so at that point, since they had rung two places and Jack wasn’t there at those moments. You wouldn't then assume a person has disappeared! He could be getting food, travelling between places, ordering equipment, having a crap. Like many parts of the book, the author slips in things that the fictional narrator wouldn’t know in order to strengthen the case for the reader.- In Martin's written story he recounts many things; Martin even admits later in the novel that it is his “true account”, written as it happened, his narrative. And yet twice when he wrote about conversations with Suzanne (Ireland ghost and France trip) it slips into a far more detailed account than she would have given, noticing every drop of moisture, every sound and smell, a journey into her head in some sort of present tense in more detail than he would know, as if he'd actually been in her head. It’s so the author can bring immediacy, but it’s nonetheless a trick to achieve an effect.- In my edition Jane Boyte is first mentioned on p.198. This was after Martin set sail, so he doesn't know the name. In the final scenes Suzanne is referred to as \"Jane\" by a ghost. Yet on p.352 Martin says \"He thought you were Jane Boyte.\" Yet Martin had never heard the surname Boyte.I have to also say the novel switches between first person and third person chapters. I always find that distracting, you may not. So the second half of the book just doesn’t live up to the first half. It becomes rather workaday, clichéd, and predictable. It also often feels padded (the Southampton scenes and overlong descriptions of the town and its history and what councils have done to it are a hiatus and feel like filler, as if the author had lots of notes about Southampton he wanted to use). But let me reiterate that the first half was great, had pulled me in and made me want to read on, and that’s an achievement. I'm still interested to try other books by this author – in fact, I have one downstairs. With so much promise at the start of Dark Echo, I would love to see a book live up to that promise."}, {"userName": "Hylary Locsin", "userReviewDate": "Oct 03, 2011", "userURL": "http://www.goodreads.com/user/show/5801904-hylary-locsin", "userReview": "Originally posted on my blog: http://libraryladyhylary.blogspot.com ! Check it out for more reviews!Magnus Stannard, a tenacious businessman, has made his career on unusual moves that have proved successful, resulting in a large fortune and a great deal of power. His only son, Martin, has failed to live up to this shining example of entrepreneurialism, and has always believed his father's feelings towards him to be those of disappointment. When Magnus acquires a vintage yacht called the Dark Echo he informs Martin, and his business partners, that he is retiring to a life at sea. He invites Martin to take a transatlantic voyage with him from England to New York to begin his new nautical existence. Martin, with the help of his researcher girlfriend Suzanne, begin looking into the history of the yacht. It seems that it was commissioned by a millionaire playboy and World War I veteran, Harry Spalding, in the 1920s. Spalding lived a dashing existence, but was also rumored to dabble in Satanism. The yacht is thought by those familiar with it to be cursed, but Magnus ignores these rumors. As the crew working to restore the boat falls victim to strange accidents, Martin and Suzanne become convinced that the history of the boat will reveal the truth about the dangers they now face.This intriguing ghost story is a mixture of historical fact and fiction that makes for an intense, supernatural mystery. The reader comes to know the characters in the novel quite well, and this understanding makes the plot all the more interesting. Martin's failed attempt at a life in the Church, Suzanne's professional interest with Michael Collins, and Magnus' lifelong obsession with the yacht are just some of the subplots that add to the richness of the story. The historical figures placed in the book as well as the various locations in the UK set the tone for some of the creepy happenings. Overall, Cottam weaves an intricate tale that definitely pays off in the end.I can proudly proclaim myself an F.G. Cottam fan after reading his second \"ghost story\" (the first was The House of Lost Souls, which I highly recommend.) Although I did prefer his first novel to this, Dark Echo is a very interesting story with a lot of history and some truly creepy moments. Definitely for readers who are into plots that are intense but with depth. I would only recommend this title for older teens as there is some violence and gory situations, but nothing too out of hand."}, {"userName": "Webbweaver Reviews", "userReviewDate": "Sep 14, 2011", "userURL": "http://www.goodreads.com/user/show/5743917-webbweaver-reviews", "userReview": "This story is about a possessed boat, and the father and son duo who intend to sail her. Magnus Stannard is a rich and powerful business man by the time he buys a dilapidated boat called Dark Echo. He had seen it in a book as a child, and to the then poor boy, it represented greatness and wealth and freedom. Magnus wants to restore the enchanting boat and sail her on a trans-Atlantic route to America with his only son, Martin. This is to be his retirement.But Martin gets an uneasy feeling about the boat, and about its original master, Harry Spaulding. Spaulding was a rich American with a dark past. To say the man, and the boat, had a dark and sometimes unlucky association, was putting it mildly. Magnus, however, didn’t share the concern. To him, there may have been unlucky owners, but a thing such as a boat was benign in nature, and certainly not cursed. Would their voyage be successful and without incident or would something much more sinister happen? The mind can play tricks on you, can’t it?I love a good ghost story and I’m very much intrigued by the paranormal so this book was a no-brainer for me. It grabbed me from the very first page, and wouldn’t let me go right up until the very last page. I was oohing and aahing the entire time I was reading this work. Dark Echo is a fantastic book about the paranormal, and how the past can interfere with the present. It involves the demonic, and the holy. It involves all kinds of haunts, residual and intelligent, not only having to do with the boat, but the character’s encounters with other ghosts as well. If you are curious about the paranormal, you MUST read this book! Mr. Cottam has written a truly gripping, edge-of-your-seat story with Dark Echo. His knack for detail works to his advantage by scaring the ever-loving Hell out of you! And for you romantics, there is a bit of that also. A true love that shines through all the scary parts. What wouldn’t you do for the one you loved? 4 spiders for this one.SB Price"}, {"userName": "Stacey", "userReviewDate": "Dec 31, 2015", "userURL": "http://www.goodreads.com/user/show/34977837-stacey", "userReview": "This is the first book that I have read by F. G. Cottam, and it will not be the last. In fact, I am now reading another by him. I would say that he truly is a master of the horror genre. I read many horror stories, and have enjoyed many, but only a few have ever really creeped me out like this one did. This is about a haunted yacht built in the 1920s by a questionable character named Harry Spalding. It is purchased as a complete wreck by rich Magnus Stannard with the intention of refurbishing it and sailing with his son Martin from the UK to America. But things do not go smoothly. Is this ship haunted by a ghost, a malevolent entity, or both? This story is a classic fight between good and evil. What I really thought was terrific was the deeply foreboding feeling of this book from the very beginning and maintained throughout. You knew something was there, and something evil was going to happen, but you never really knew what, why and by what. This book scared me to read it, but I had to keep with it. It gave me nightmares, and I still get the chills thinking about it. Not only was the storyline strong and well done, the climate of the story expertly crafted, but all the characters, especially Martin's girlfriend Suzanne, very well developed. A book has not freaked me this bad while reading it since Pet Cemetery and The Shining both by Stephen King. I feel as though I just \"discovered\" another of my \"most favorite authors\" of all time. I highly recommend this to those who really enjoy getting chilled to the bone!"}, {"userName": "Sarah", "userReviewDate": "Oct 14, 2014", "userURL": "http://www.goodreads.com/user/show/19459101-sarah", "userReview": "Two feisty heroines in different eras, an atmospheric post-WW1 setting and a villain who’s a mash-up of Gatsby and Voldemort makes this the best FG Cottam book I’ve read so far. About a year ago I swore I would never read another book by FG Cottam again. I’d just read Brodmaw Bay and loved everything about it except the ending, which I felt destroyed my enjoyment of the book. In some ways it’s a great ending and I admire the author for daring to go in that direction with the plot, but it just wasn’t for me. But then I stumbled across Dark Echo on my library website and I was like an alcoholic falling off the wagon - I just had to get my fix. I enjoyed this even more than House of Lost Souls and The Waiting Room. It doesn’t provide the chills or tension which those books serve up in large doses, but it makes up for this in atmosphere and characterisation. Instead of building up to a Big Revelation (the satanic pursuits of the villain are revealed early on) the book instead relies on interesting subplots and character arcs to keep the reader hooked. The blink-and-you’ll miss it climactic battle is a little underwhelming but a refreshing change from the hyped up clashes with terrifying monsters churned out with tedious predictability by the supernatural horror genre. It reads more like Robert Goddard with a dash of the occult, and what could be better than that?"}, {"userName": "Nancy", "userReviewDate": "Feb 21, 2015", "userURL": "http://www.goodreads.com/user/show/1690005-nancy", "userReview": "Mangus Stannard is a wealthy entrepreneur who has risen from a poverty-stricken childhood. His dream is to sail the Atlantic Ocean from Ireland to America on a boat he refurbishes called the Dark Echo which has a dark past and, it seems, a dark present. People have died on the Dark Echo and people have died working on her. Now, Mangus wants his son, Marty, to cross the ocean with him. Marty's lover, Suzanne, is a researcher and while they plan, she begins quick work to solve the boat's mystery and save Marty and his father if she can. Evil is a forever condition and appears here as Harry Spaulding. Good is also a forever condition and the two are pitted against each other here. It occurred to me to wonder if Mr. Cottam ever considered people had to do other things in life, like sleep. Don't start reading this book unless you have plenty of time because it is fast-paced, thoughtful and addictive. Quote: \"The sacrifice of his son to the priesthood was exactly like the medieval buying of indulgences by wealthy men too busy generating profit to find the necessary time for prayer.\"  While I liked this book very much, I still have to say, of the books of F.G. Cottam I have read, The Waiting Room is the best."}, {"userName": "Martin Belcher", "userReviewDate": "Aug 27, 2012", "userURL": "http://www.goodreads.com/user/show/5636083-martin-belcher", "userReview": "F.G.Cottam never fails to entertain, I loved Dark Echo a truly creepy ghost story set on and around a boat called Dark Echo which has a truly horrific past, previously it's owners have been beset by tragedy and it's original builder, Harry Spalding is a man of hidden depths and his story is indelibly stained on the boats wooden planks.Magnus Stannard a retired businessman buys the Dark Echo at auction and entices his son, Martin to sail the Atlantic with him. What begins as a simple restoration job in a small boat yard on the Hampshire coast turns into a horrific sequence of \"accidents\" and discoveries. Wonderfully creepy and full of suspense another gem of a novel by F.G.Cottam. A haunted house story set on a boat with a life of it's own! Brilliant!"}, {"userName": "Jo Ann ", "userReviewDate": "Jul 14, 2014", "userURL": "http://www.goodreads.com/user/show/7047071-jo-ann", "userReview": "[What woman goes to rescue her man from evil and strikes him in the face not once but twice and then orders him to pick up his comatose father while he himself is battered and bleeding. (hide spoiler)]"}, {"userName": "Ellen Herbert", "userReviewDate": "Nov 18, 2014", "userURL": "http://www.goodreads.com/user/show/2069286-ellen-herbert", "userReview": "Best of all of the Cottam books so far. Researched so well and completely chilling. Had to put it down at one point as it was doing the job of a proper ghost story too well. The characters are so well drawn, we see their flaws and feel their hope. The presence of evil is palpable. The intertwining of history, heroes, relics,family tragedies and triumphs and the pugilists stamina to persevere all weave together in a most satisfactory fashion. If you read it alone or in the late hours, keep a light on and keep the radio off."}, {"userName": "Ceri", "userReviewDate": "Apr 02, 2014", "userURL": "http://www.goodreads.com/user/show/10830358-ceri", "userReview": "Dark Echo- FG CottamAfter giving up on The Summoning, I didn't have high hopes for FG Cottam but this was vastly better. That isn't saying much because I still didn't love this. A promising premise of a cursed/haunted yacht, a strong villain and an early sense of foreboding are let down by a plot that while unravelling a mystery that's never really mysterious, also never builds to any real climax. Well written and interesting, but ultimately never lives up to its promises."}, {"userName": "Gayle Noble", "userReviewDate": "Jul 05, 2013", "userURL": "http://www.goodreads.com/user/show/17445096-gayle-noble", "userReview": "This is the third book I have read by this author and I find them incredibly frustrating. The author is good at building up a story with tension and promise of a cracking ending or plot twist coming up and then...nothing. I enjoyed the first two thirds of the book but found the ending extremely weak and a real disappointment."}, {"userName": "Michael", "userReviewDate": "May 10, 2015", "userURL": "http://www.goodreads.com/user/show/3146514-michael", "userReview": "[--  The story was going along nicely enough to begin with... and then Martin goes on the boat and hears a man's voice saying, \"Relax, old chum\".  Um, okay... By the end of the book, that doesn't seem quite so strange to me, but at the time I read it, it was oddly jarring to have the \"ghost\" just speaking-- especially to hear him using silly period slang like \"old chum\".   (...Also, if Spalding is capable of speaking out of thin air, across an unknown distance, why all the fuss with the old-fashioned recording device, later in the book?  Couldn't he just have spoken to Magnus and Martin in the same way?)--  Maybe I'm just jealous ;o) but despite hearing over and over again about what a genius researcher Suzanne is, I didn't see her do much that I couldn't have thought of, myself!  Her one really clever move was figuring out that the spear tip was hidden under the mountain of beets, and I don't see how that had anything to do with her amazing research abilities... More a matter of intuition.--  So... Is Suzanne the reincarnation of Jane?  I guess it's up to us to decide.  Seems a very odd coincidence that someone who looks just like Jane should happen to fall in love with Martin, who just happens to be the son of Magnus, who is predestined to own the Dark Echo... Yeah, none of it's coincidence.  It's supposed to be fate, I'm sure.--  Suzanne knows that she's a dead ringer for Jane-- which is why I find it so irritating/hilarious that she's so obsessed with Jane's looks.  She's constantly commenting on how beautiful Jane was.  Ugh!  Vain, vain woman!   \"My God, she really does look just like me, Suzanne thought, who knew that her looks had intimidated more men than they had attracted...\"  \"She was a pioneer aviator and drop-dead gorgeous to boot.\"  \"She had been a celebrated beauty.\"  \"No wonder Vera Chadwick had felt insecure, with friends like Jane and Helen around.\"--  The tying in of Michael Collins was not especially interesting to me because... Well, I don't know much (at all) about him or that part of UK/Irish history.  No offense intended to anyone, but it's not a topic I care to research simply for the sake of better understanding this book.  I vaguely recognized his name as having something to do with Ireland, but that was it.  So, suffice it to say that that whole aspect of the book was less than enthralling for this particular reader.--  It's interesting to note that the author was born in Southport, a city that plays an important role in the book.  Since he's English, I'm surprised that he called a sweater a sweater and not a jumper.  I thought that was the British word for sweater.  (Isn't this a fascinating review?)--  Is anyone actually named \"Magnus\" these days?  I mean, I'm sure someone is... but it has ghost-story connotations for me.  \"Count Magnus\" and all that.--  I found it amusing that the chaplain (Derry Conway) was \"an old-fashioned follower of what, a generation earlier, had been termed muscular Christianity\"-- because I just (for the first time?) encountered that unfamiliar term in something I read last month (Wildfire at Midnight).  --  I'm always amused by a reference to Sweden... Magnus sighs over Martin's car-- a Saab.  \"What's the prob, Dad?\" asks Martin (or something to that effect).  \"The Saab's fine.\" To which Magnus replies:  \"Fine if you're a Swede.  Fine if you follow the gospel of self-deprecation.  Which the Swedes, as Scandinavians, have no recourse but to do.\"--  What was with all the radios playing \"When Love Breaks Down\"?  I assumed it was Spalding's way of taunting/terrorizing Martin and Suzanne, since it was one of Martin's favorite songs (if I remember correctly).  Maybe, I thought, it was foreshadowing the breaking of the couple's relationship under the pressures Spalding applied.  But then the author (through Suzanne) explains it away as being a song that Spalding heard when he abducted the two teenage fishermen in 1985.  ...So, in that case, why is Spalding now making it playing everywhere?  Why choose that particular song to torment his new victims?Either Spalding's been using some creepy magic to spy on them and learn that the song has significance to them or Spalding heard the song at random on the radio in 1985.  Either one of those on its own?  Ok.  Both?  Erm...Also, what has Spalding been doing for all this time?  I assumed he could come and go as he pleased-- but apparently he looks pretty bad. (Seriously, dude.  Strike a better deal, next time you sell your soul.  Right?)   I guess that explains why he wouldn't get out much-- and maybe why a song he heard back in 1985 would make such a strong impression, if you accept that he doesn't have access to a radio or TV.  :o/--  At one point, I wondered if Magnus might be the descendent (grandchild?) of one of the members of the Jericho Crew.  At least that might explain his bizarre attraction to the Dark Echo.  Except that the Jericho Crew were all American, and Magnus' family have probably lived in England forever.--  The two-man crew on board the Dark Echo seems like it would be foolhardy under any circumstances, even if there were no evil man-demon out to get them.  What if one or both of them became ill?  Sickness isn't uncommon enough to risk it. --  When Suzanne finally finds the document that she's been looking for-- Jane's deposition-- does she read it as quickly as possible, desperate for the answers that could well save her boyfriend's life?  No, of course not.  \"She wanted to read what she had discovered in the space and at the time of her choosing.  There was urgency there.  But she felt she would glean more from the deposition away from where she'd discovered it.\"  What?!  Read the darn thing right away, woman!--  In her diary, Jane refers to Spalding as \"my obnoxious American\", which seems a strangely understated way to describe a man who attempted to rape her.  --  Suzanne's cold case detective is amazingly helpful.  He assembles a team to dig up the yard of Spalding's old rented home on the very day that she brings him her evidence (the aerial photo Jane took).  Apparently there's no such thing as red tape and paperwork in Merry Old England!  Then, when they discover the spear, he's only too happy to release it into Suzanne's care.  \"'Won't people see it's missing?  'It won't be missing.  I'll replace it myself with one similar from the dead wood in the park over the way.'\"  Ha!  Convenient.  Oh, and though he does say he'll need her to give a statement, it can wait for another time.  No biggie.  Whenever's convenient for you, woman I've never met before today.  I trust you implicitly.  (Must've been stunned into submission by her incredible personal beauty.)--  The French farmer compliments \"madame\" on her courage in having laid the curse.  She responds, \"Could you not have done it?\"  (Yes, how about that?)  \"My father tried.  It destroyed him.\" Okaaaay.  What made Suzanne so special, then?   Also, the scary dudes who seem to hang out in a van around the French countryside.  The ones the farmer shoots dead.  Who exactly are they and what have they been doing all this time?  I know they're somehow connected to the Satanic cult that Spalding's family was part of, but... Beyond that?  Strange that they stay in the background so much, if they are also desirous of keeping the desecrated holy relic in place.--  The appearance of Vera Chadwick's ghost seems pointless.  ...What is the point, really?  To further suggest to us that Suzanne is the reincarnated Jane, however much she may deny it?--  We learn that Magnus has gone into some type of shock-induced coma.  Martin says, \"I've been feeding him, chewing his food.  He throws a lot of it up.\"  Um, gross.  Thank you for that little tidbit, Martin!  Next time, maybe use food softened with water or something... Broth... Make pre-chewed food your last option, okay?--  Spalding and Martin engage in fisticuffs.  \"'You're old,' Martin said.  'It's a young man's game.'  He spat a tooth on to the sand.\"  . . . . . . Bwa-ha-ha!  Did he also say \"patooie\" as he did so?  Because that wouldn't make it much sillier, in my humble opinion.  --  I must've forgotten something.  What happened to Martin's arm on board the boat?  By the time they hit land, it's infected, but I can't recall anything that should have reopened his old wound.--  Speaking of which, the book could've used a little more detail on what happened on the boat after Spalding reveals his plan to Martin and Magnus.  However, the biggest mystery of all is why they got on board to begin with!  Sure, sure, it's partly explained away by a change in the weather-- familiarity dulling the sense of evil-- etc.  But it's odd.  If you had the experience Martin described on his first time aboard, would you ever agree to go on a trans-Atlantic voyage aboard that boat?  Ultimately, Martin himself tells us that he will go on the voyage-- even against his better judgement-- simply because he loves his father and can't let him go alone.  I can't say that Magnus seems worth such self-sacrifice, sadly.--  So... How much was Magnus supposed to have known about the boat beforehand?  During his delirium, he confesses to Martin that he was hoping Spalding would somehow bring about a reunion with his dead wife and daughter.  ...But... But... I though Magnus was obsessed with the Dark Echo after seeing her in a book, as a child.  I guess he realized after reading the log (which, incidentally, why would Spalding have written what actually happened in the log?  just as a sign of his arrogance?) that Spalding had some magical powers.  It doesn't make much sense to me, to be honest, but I guess none of it makes real sense, seeing as it's a ghost story, so... ~shrug~ (hide spoiler)]"}, {"userName": "R Z", "userReviewDate": "Oct 01, 2017", "userURL": "http://www.goodreads.com/user/show/58389341-r-z", "userReview": "The dialogue— both internal and external— was just,,, so not there. And I don't know, it felt anachronistic; the characters didn't seem to belong to the mid-2000s. The writing, other than that, felt laborious and not in a good way; any drama or suspense I might have had was kind of ruined by how tedious I found the writing. It wasn't terrible, but it was not great, either."}, {"userName": "tattooedreader13", "userReviewDate": "May 30, 2018", "userURL": "http://www.goodreads.com/user/show/9426088-tattooedreader13", "userReview": "Really enjoyed this read, I found it a bit slow to start, but once it got going, I struggled to put it down."}, {"userName": "Alyson", "userReviewDate": "May 14, 2017", "userURL": "http://www.goodreads.com/user/show/8398085-alyson", "userReview": "For some reason the book took me ages to read - there seemed to be a lot of writing in there, not necessarily always moving the plot forwards.I don't normally read ghost/ paranormal books, but someone passed the book on to me. It had interesting characters and enough intrique to keep me going.I spotted two glaring continuity errors though. On p.186 they set sail from Southampton Harbour. On p.188 Suzanne was thinking about how they had set say from Portsmouth Harbour. On p.330 she arrived somewhere at 5 am and had interaction with people there, and 2 hours sleep. She then drove for another 5 hours and was somewhere by 11am. By my calculation, 5am + 2 hours sleep and a bit of chat would mean leaving there 7:30am. Add 5 hours driving on top and she would arrive at second destination at 12:30, not in time for the 11am thing."}, {"userName": "Kirsty", "userReviewDate": "Aug 07, 2016", "userURL": "http://www.goodreads.com/user/show/76596-kirsty", "userReview": "I just wanted a creepy story to go with my G&T on a lovely summer night. Friends, this was not that story. Perhaps there is a solid creep-fest hidden beneath all the backstory (the first five chapters are basically all backstory and info-dumping), but I couldn't find it. Also I kept tripping up because apparently it's set in the modern day, but the dialogue is so old-fashioned and clunky (example: \"I never possessed the strength to talk about your sister at all. And your mother kept silent on the subject, I think to spare me from the ordeal of being forced to do so.\") I was intrigued by the idea of a haunted boat, but when I flipped to the middle of the book and found they still weren't even in the bloody boat, I gave up."}, {"userName": "Rita", "userReviewDate": "May 28, 2011", "userURL": "http://www.goodreads.com/user/show/805157-rita", "userReview": "I got really involved in this story, I liked the 'ingredients'; religious relics, gruesome finds, hauntings & ghostly music. I thought the ending was a bit quick after a long build up but I enjoyed it & look forward to reading other books by the same author.Read in a Bookcrossing bookray:http://www.bookcrossing.com/journal/7..."}, {"userName": "Ty Bedell", "userReviewDate": "Oct 01, 2017", "userURL": "http://www.goodreads.com/user/show/51710818-ty-bedell", "userReview": "I love the way Cottam tells his tales."}, {"userName": "Joyce Tyo", "userReviewDate": "Sep 25, 2017", "userURL": "http://www.goodreads.com/user/show/12320946-joyce-tyo", "userReview": "One of those books that is hard to put down."}], "description": "She is a seductive ship: a sailing yacht built for an American playboy. Yet her history is full of fatal accidents and three of Dark Echo's owners met tragic, violent deaths. Now she has been rebuilt, crossing the Atlantic with new owners. Only the truth about Harry Spalding, the man who built her, can save them from the same fate.", "title": "Dark Echo", "url": "https://www.goodreads.com/book/show/3153081.Dark_Echo", "average": 3.69, "cover": "https://images.gr-assets.com/books/1327915615l/3153081.jpg", "reviews": 113, "authors": [{"url": "https://www.goodreads.com/author/show/974195.F_G_Cottam", "name": "F.G. Cottam"}], "type": ["Horror", "Fiction", "Fantasy", "Mystery", "Paranormal"], "outlinks": ["http://www.goodreads.com/book/show/3153081-dark-echo", "http://www.goodreads.com/book/show/8105035-dark-echo", "http://www.goodreads.com/book/show/19075763-dark-echo", "http://www.goodreads.com/book/show/6854374-dark-echo", "http://www.goodreads.com/book/show/9112244-dark-echo", "http://www.goodreads.com/book/show/3153080-the-house-of-lost-souls", "http://www.goodreads.com/book/show/15849654-the-colony", "http://www.goodreads.com/book/show/7619076-the-waiting-room", "http://www.goodreads.com/book/show/17415094-the-memory-of-trees", "http://www.goodreads.com/book/show/6358975-the-magdalena-curse"]}