{"ratings": 1, "userreviews": [{"userName": "Gershom Joseph", "userReviewDate": "Mar 08, 2018", "userURL": "http://www.goodreads.com/user/show/76875655-gershom-joseph", "userReview": "Great reading, and very easy principles to apply. This is a very good book to read very much information I love the way that the husband and wife both write in order to hear what both sexes are thinking."}], "description": "There is Still hope for you. Dating and courting is imperative in the process of finding a mate. Too often this process becomes very complicated. Most people do not know how to navigate these tough terrains and often miss great opportunities or fall victim to bad ones. In this book, we want to help you understand that this process does not have to be so challenging. We are not guaranteeing that after reading this book, you will find a mate. We hope you do, but the information in this book will help you on that journey. Remember! You will not be ready for anything you did not prepare for. In Dating and Courting with Godly Purpose, you will learn and have some of these questions answered such as: • Why are you dating? • What is the purpose for being in the relationship you are now in? • Do you date because you have to, or because you want to? • Why self-love is important for a successful relationship? • Should you be dating or courting if you are not ready for a long-term relationship? • Do’s and Dont’s for Online Dating • How to put a person of interest through the Relationship Appraisal Process (RAP) • Is there one special someone out there for me? • Will God choose your mate for you? • Is the Feminist movement responsible for so many men and women staying single? • The difference between being alone and being lonely. • How to enjoy your singleness while waiting to be found. And so much more! The principles in this book will guide, and help you to navigate through the difficulties that comes with relationships. If you are looking for that special someone to share your life with, I suggest you get this book!", "title": "Dating and Courting With Godly Purpose", "url": "http://www.goodreads.com/book/show/35157500-dating-and-courting-with-godly-purpose", "average": 5.0, "cover": "https://images.gr-assets.com/books/1494986611l/35157500.jpg", "reviews": 1, "authors": [{"url": "https://www.goodreads.com/author/show/14356328.Dauren_Francis", "name": "Dauren Francis"}, {"url": "https://www.goodreads.com/author/show/2645843.Joan_Francis", "name": "Joan Francis"}], "type": [], "outlinks": ["http://www.goodreads.com/book/show/35157500-dating-and-courting-with-godly-purpose", "http://www.goodreads.com/book/show/26588332-built-to-last"]}