{"ratings": 14577, "userreviews": [{"userName": "Nenia ✨ Queen of Literary Trash, Protector of Out-of-Print Gems, Khaleesi of Bodice Rippers, Mother of Smut, the Unrepentant, Breaker of Convention ✨ Campbell", "userReviewDate": "Sep 24, 2017", "userURL": "http://www.goodreads.com/user/show/2190064-nenia-queen-of-literary-trash-protector-of-out-of-print-gems-khalees", "userReview": "Instagram || Twitter || Facebook || Amazon || PinterestI missed out on V.C. Andrews as a teen, so I'm accumulating as many of them as I can now. You know, for science. So far, I've mostly been reading the ones that were originally written by V.C. herself and not her ghostwriter, Andrew Neiderman. The Dollanganger series was excellent and so was her one standalone book, MY SWEET AUDRINA. HIDDEN JEWEL was a Neiderman effort, but I thought that one was reasonably okay, even if it lacked that special brand of spiciness that the Dollanganger books had. DAWN is one of Neiderman's earlier efforts, published just four years after the real V.C. Andrews died. I expected it to be even better than the Landry book I read, since it was published earlier and - I figured - he'd probably be working extra hard to do her justice.Ha - nope!DAWN is one weird book. Parts of it are just boring and badly written, with words repeated over and over again (especially \"quickly\", for some reason, which seemed to appear at least once per page), and emotions being told instead of shown via dialogue tags. \"Don't be so obvious,\" she yelled angrily. \"Be subtle!\"Plus, we get gems like these:Good-bye to my first and what I thought would be my most wonderful romantic love, I thought. Good-bye to being swept off my feet and floating alongside warm, soft white clouds. Our passionate kisses shattered and fell with the raindrops, and no one could tell which were my tears and which were the drops of rain (227).Sounds like she's confusing an acid trip with love, don't you think?***WARNING: SPOILERS***The plot is one part THE FACE ON THE MILK CARTON, one part MY SWEET AUDRINA, and one part FLOWERS IN THE ATTIC. Dawn and Jimmy Longchamp have always been on the move but now their dad is determined to bring some stability to their lives: he's taken a job as janitor at a private school, which means that both kiddos get free tuition as a bonus.Obviously the rich kiddos do not take kindly to poverty in their midst, and begin hazing like it's rush week at a d-baggy party college. People mock and laugh at Jimmy, but it's Dawn who really bears the brunt of the bullying - they stop just short of parading her through the streets with a shorn head while screaming SHAME! SHAME! The only rich kiddo who's actually nice to her is the brother of Clara Sue, the mean Queen Bee who has a rage-boner for Dawn: Philip Cutler.\"Nice guys\" in V.C. Andrews books can never be trusted and Philip is no exception. He quickly begins pushing Dawn to go all the way with him, fondling her in his car, kissing her passionately in public, etc. Jimmy is, of course, super jealous, even though he's her brother. And oh, by the way - did I mention that the Longchamp parents seem to think it's cool to not only have their teen children share a bedroom, but also have them both sleep in the same bed? Also, he watches her get dressed.Anyway, Dawn thinks she's finally gotten the better of her bullies and her evil headmaster... but then her mother dies and makes a cryptic statement about forgiveness and the police come to take her father and siblings away - and Dawn finds out that she isn't Dawn Longchamp. She's Dawn Cutler. The Longchamps kidnapped her from their employers when she was just a baby to replace a stillborn.Dawn is pulled out of school and whisked away to the elite Cutler Cove hotel, where the grandmother matriarch (who seems to be inspired by the grandma in FLOWERS IN THE ATTIC) runs a tight ship. Think Dunstin Checks In (1996) without the orangutan-provided comic relief. While there, Dawn experiences even more bullying... this time at the hands of her new relatives: Psycho Grandma and Queen Bee Mean Girl. Psycho Grandma forces Dawn into what is basically child slave labor, forcing her to work as a maid free of charge; steals and destroys some of Dawn's belongings; gives her a new name (Eugenia) and then starves her when she doesn't use it; and when someone (*cough* Clara Sue) steals a necklace from one of the guests, she basically gives Dawn a cavity search looking for it.Philip is at the hotel, too, and at first he seems nice, but then it turns out that he's still not over that heavy petting they did together before they realized they were brother and sis. Towards the end of the book, he rapes her, saying that it's important that he \"teaches\" her how sex works and that it's her fault for leading him on, etc. Dawn is so upset, because she doesn't want to have sex with this brother - she wants to have sex with her other brother now that she knows that they're not related, and even takes a moment later on to wish how Jimmy was the one who got her v-card instead of Philip.But wait - there's more!Dawn tracks down the maid who was responsible for her and finds out that she's the product of an affair that Mama Cutler had with a musician. Angry, Grandma Psycho had arranged for a kidnap by paying the Longchamps to take her away. She had second thoughts later, but was willing to let the Longchamps take the fall for it rather than have scandal befall the family. What a betch, right? So Dawn whips out the blackmail, and Grandma Psycho admires her balls and decides that maybe Dawn and her can reach an \"agreement.\" Dawn gets send to NYC to study music and bought all manner of expensive clothes while Philip and Clara seethe, dreaming of the day when she and Jimmy can reunite and have it's-not-incest-anymore-let's-party style sexings.This left such a bad taste in my mouth. It might actually be worst than the time that I ate a piece of dark chocolate for dessert after having kimchee for dinner (although that was pretty bad, too).2 to 2.5 stars"}, {"userName": "Mizuki", "userReviewDate": "Jun 25, 2017", "userURL": "http://www.goodreads.com/user/show/16842102-mizuki", "userReview": "I noticed V. C. Andrews' books seem to all follow the same pattern: rags to riches storyline, woman on woman hating, incest, beautiful main characters, a grand manor or two, wicked older women (usually a grandmother), Queen Bitch mean girls, school dramas and boy dramas.So basically, reading Dawn is pretty much like reading Dark Angel and Flowers in the Attic all over again.Argh, why am I still coming back for more?And why must the heroine keep suffering and suffering and suffering throughout the whole story. I know Gothic romances tend to do this 'women are to suffer' thing to their heroines...but still.Okay, I don't hate this book, I like the story, the writing and the final revealing of the truth well enough; so I'm going to read the next book.My review for the sequel: https://www.goodreads.com/review/show..."}, {"userName": "Jess", "userReviewDate": "May 13, 2012", "userURL": "http://www.goodreads.com/user/show/4643578-jess", "userReview": "I keep wondering why in the world V.C. Andrews books are so popular, and I keep wondering why I buy them at garage sales, and then I finish one and realize they are such campy trash and I love them.\"Dawn\" is no exception. Even though this was one of the books ghostwritten after Andrews' death, it follows the same basic elements of any classic Andrews novel: Innocent fair-haired protagonist, rags to riches story, incredibly talented and attractive youths, evil old woman, and a whole lotta incest. Like, a LOT of incest. Incest that doesn't start out as incest, and love that then turns into incest after the plot twist, and just general family-lovin' fun. INCEST.The story starts with the titular fair-haired innocent, Dawn, on the move with her poor family (Momma, Daddy, brother Jimmy, and new baby sister Fern) to a new apartment. After Daddy gets a maintenance job at the prestigious Emerson Peabody school in Virginia, Dawn and Jimmy get to go to school for free, and they are thrust into a posh private school world that they've never experienced before. I love how recklessly evil the principal, Ms. Turnbell, and the students are to the Longchamp kids. Andrews makes such ridiculous situations- like why is everyone just needlessly evil? It's funny but it tends to make me facepalm a little. Dawn meets the handsome and charming Phillip Cutler, whose rich family own the Cutler Cove resort in town, and his bitchy sister Clara Sue, who wants to make Dawn's life miserable. Dawn and Phillip embark in innocent teenage romance, or in Andrews terms, attempted sexual assault of a young woman masquerading as flirty teasing. Good stuff, keeping it classy. Phillip is a total douchenozzle and lies about his experience with other girls, but Dawn is smitten.So then the twist comes forth- Dawn's mother dies from sickness and her father is arrested at the hospital for kidnapping Dawn from her rightful family, the Cutlers, when she was an infant. So douchenozzle Phillip and evil Clara Sue are really Dawn's siblings, and she is taken from Jimmy and Fern and forced to live with the Cutlers in their fancy hotel. She is treated like a shameful secret by Grandmother Cutler, a treacherous old biddie who runs a pretty tight ship. Dawn's new family sucks- along with the evil grandma, her father is a flake and her mother is a simpering fool who barely gets out of bed. But that's not all- Dawn discovers what really happened and why she was really \"kidnapped\", and she has to work to outsmart this powerful new family and get back her old family.There are so many flaws in this book it is ridiculous. I think Andrews took some liberties with the foster care system. I don't think they just throw the kid into a new home like hey, here's your new family. I really need to stop fact-checking these books; its really just beating a dead horse. Also, why would Dawn's parents take her back to Virginia and have her go to school with the Cutler kids if they freaking kidnapped her from that family? Daddy even knew Dawn was going on a date with Phillip! Like, come on! Best kept secrets, people! You're not doing this right!This wasn't a terrible book- it certainly wasn't boring. A lot happened in one 400-page paperback and I read it pretty fast. But it is a middle-school level read with a lot of Andrews' weird personal fetishes sprinkled around, and the characters are two-dimensional at best and cartoonish at worst. I don't know why I keep going back to V.C. Andrews- probably some Freudian thing. My brain cells might be dying as I read her books but I'm always entertained."}, {"userName": "Shannon", "userReviewDate": "May 13, 2008", "userURL": "http://www.goodreads.com/user/show/729308-shannon", "userReview": "This whole series could be great. It has all the elements: mystery, deceit, betrayal. Unfortunately, it was written by Andrew Neiderman, the person Andrews' family chose to continue her legacy. Why they chose a man, particularly this man, is beyond me. The writing is terrible. The dialog is unbelievable and idiotic and makes all the characters (especially Dawn) appear incredibly stupid. Just very bad."}, {"userName": "Marketa", "userReviewDate": "Feb 24, 2017", "userURL": "http://www.goodreads.com/user/show/38532081-marketa", "userReview": "Nehodnotím. Nevím totiž jak. Kniha to byla čtivá, ale sem tam jsem se fakt smála tomu, co autorka vyplodila. :D Nejvíc výstižné pro tenhle příběh je slovo INCEST. Jako fakt. Ale jestliže se do toho pustíte, tak se nenechte ze začátku zmást. Počkejte si, ono to přijde. :D"}, {"userName": "Camille", "userReviewDate": "Feb 09, 2009", "userURL": "http://www.goodreads.com/user/show/1715267-camille", "userReview": "This book is in my favorites section and I feel the need to explain... it's more for sentimental value not actually the greatness of the writing.In 7th grade while all my friends were into the Sweet Valley High books, I was devouring the world of V.C. Andrews. It’s something about the lonely, outcast, but talented orphan, finding her \"real\" family which happens to ridiculously rich. Of course her real family treats her horribly because of the \"secret scandal\" which expunged her from the family in the first place. While said orphan, adapts to her \"new\" life she will have to battle the unwanted attention of a family member (usually her brother) who will inevitably fall in love with her (all books have some type of incest). Eventually her talent (either singing, playing an instrument, or ballet) will be her saving grace and she will find happiness, but not before inheriting the family fortune.Yup, that is a pretty good description of ALL V.C. Andrews book but I loved them! Maybe it was my own secret wish that I was adopted and my real family was rich and famous, which caused me to basically read the same story plot over and over again. Or maybe it was the subtle sexuality in the books which made me feel rebellious because I’m pretty sure my mother wouldn’t want me to read about “near rapes” by someone’s brother when I was 12 years old. Either way, I started to circulate these books around my girlfriends and we became Mr. Levin’s 7th Grade English Class V.C. Andrews reading group.So I add this book to my favorites list because it sparked the love of reading for me when I was very young."}, {"userName": "Megs ♥", "userReviewDate": "Oct 13, 2011", "userURL": "http://www.goodreads.com/user/show/5691412-megs", "userReview": "This was my favorite book when I was 15. I remember a friend giving me this book, and how our parents let us read it honestly having no clue of the content. My friend and I would sit on the phone for hours laughing at the authors use of the word \"hardness\"..Yes we were that mature!Recently I reread it and sadly the book didn't stand the test of time. I can reread Flowers in The Attic over and over again, but somehow I just can't read 90% of the books done by Andrews' ghost writer.As far as Dawn I just don't remember her being so utterly stupid."}, {"userName": "Bark", "userReviewDate": "Jan 14, 2010", "userURL": "http://www.goodreads.com/user/show/2905339-bark", "userReview": "Wow, is this story ever dramatic! As a pre-teen, the original VC Andrew's books made me ache with emotional pain but now that I'm, eh, a little older they seem rather silly. The world Andrew's creates is so damned black & white, good vs. evil, innocent or black-heart it's nearly laughable. I do miss those innocent days of old when I could read this book and fall for Philip Cutler along with Dawn instead of screaming, \"He's a smarmy bastard who is going to ruin you! For god sakes Dawn he felt you up the first chance he got you alone. He doesn't love anything about you but your budding breasts. Run Dawn, run as fast as you can from the evil legacy that will haunt you, your daughter, your granddaughter and branches of the family tree no human could ever live long enough to see.\"Recently, I made the mistake of reading one of the newer books written by ghostwriter Neidermann (Midnight Flight, maybe?). I've tried to put it out of my mind but the images have been branded into my memory. I found it utterly horrible and unreadable. He had nubile young girls wearing diapers and being forced to urinate in them. Male fantasy gone out of control? Out of shocking, incestuous ideas, anyone?! So, I decided to go back and reread Dawn, one of the older novels, to see just how far these books had denigrated. Lucky for me there were very few similarities besides the fact that the protagonists are innocent, dim-witted, pretty things who constantly have butterflies buzzing around in their bellies and brains. Dawn's life is turned upside down when she discovers her parents were keeping secrets and have been on the run. Without spoiling things, these *parents* are candidates for the biggest pair of dumb asses ever in a fictional novel. Now she's forced to live with people who resent her and treat her to cruelty piled upon cruelty. To add to the angst, she's also all mixed up inside sexually about the two boys in her life. Jimmy was raised as her brother and Philip (with the groping paws) whom really *is* her brother. Ehhh, what a dilemma!I don't know what's wrong with me but I have to admit that I was absolutely riveted to this story while listening despite all of its flaws. And there were many. These books do not stand alone and now I'm left hanging and will have to find the rest of the series on audio to see what happens to Dawn's messed up clan."}, {"userName": "Jenna Major", "userReviewDate": "Nov 04, 2016", "userURL": "http://www.goodreads.com/user/show/14772037-jenna-major", "userReview": "OMG THIS SERIES!Honestly if you love the drama and gossip this series is for you. I read this series when I was 14 and boy did it change my views on a lot of things. I don't even know what to rate this book to be honest because I read them so long ago. The plot goes way past anything you would imagine, full of secrets, betrayals, deaths, illness, incest, poor, rich, love, rape, torture, pregnancy, business, friends LITERALLY EVERYTHING GUYS, THIS SERIES HAS GOT IT. This series really kept me spinning as I thought 'how can this all happen' or 'who would do that' because it IS extremely unrealistic but makes for an awesomely entertaining read. I think I'm going to give this book 4 stars, because I can't remember much about the writing style, I do know that it entertained me. Some of these story lines are soo hard to forget that sometimes I still ponder about them. That's why I am giving it 4 stars. I do remember that some of the later books weren't as good but this one was wickedly entertaining. There is a lot of negative reviews for this series, but for me, I ate up the drama and the gossip. That is just my personal opinion that I enjoyed it. I can say that I do not remember much of the style of writing and other aspects of a novel, so if you're wondering about that, I'd check out some of the other reviews."}, {"userName": "Nora|KnyguDama", "userReviewDate": "Feb 01, 2018", "userURL": "http://www.goodreads.com/user/show/24881652-nora-knygudama", "userReview": "Kur buvus, kur nebuvus aš ir vėl imuosi V.C. Andrews knygų. Šį kartą bibliotekoje užmačiau dar vieną keistą viršelį su nuliūdusia mergaite ir pikta senele (gan įprastas Andrews motyvas) na, ir nesusilaikiau... Kaip jau šimtą kartų sakiau - tos knygos yra mano mažytė saldi nuodėmė, kurios kartas nuo karto griebiuosi pavargusi nuo detektyvų ir fantastikų. Kaip vienas knygų apžvalgininkas rašė: \"Aš puikiai suvokiu, kad Andrews knygos yra praktiškai vienodos ir, vieną perskaitęs gali manyti, jog perskaitei visas, bet... Nežinau kodėl aš jų imu dar ir dar ir dar... Tai užkrečiama!\". Lygiai taip pat jaučiuosi ir aš. Ką gi, aprašysiu jums pirmąją Katlerių šeimos sagos dalį \"Aušra\".Don - pagrindinės veikėjos vardas - angliškai rašosi dawn, o verčiasi aušra. Dėl to toks ir yra knygos pavadinimas. Taigi, Don auga su savo tėčiu ir mama Longčempais ir broliu Džimiu. Dėl Don nežinomų priežasčių šeima nuolat kraustosi iš vienos gyvenamosios vietos į kitą. Gyvena jie labai skurdžiai, vos duria galą su galu, o kaip tyčia Don mama vėl pastoja... Gyvenimas tampa dar sudėtingesnis. Viskas šiek tiek pasikeičia, kuomet tėvas gauna valytojo darbą prestižinėje mokykloje. Tuo pačiu, jo vaikai - Don ir Džimis - įgauną teisę ten mokytis nemokamai. Abu jaunuoliai keistai jaučiasi žengdami į turtuolių pasaulį. Na, o būdama graži ir talentinga, Don iš karto susiranda priešų. Pagrindinė jų - Kler Katler, kuri krečia Don šunybes vieną po kitos. Tačiau engiamą mergaitę imasi ginti Kler brolis Filipas Katleris. Tarp jaunuolių pamažu gimsta romantiški jausmai. Tačiau Don gyvenimas vėl apsiverčia, kuomet miršta jos mama, o tėtį išsiveža palicija. Pasirodo jos tėvai yra ir jos pagrobėjai. Jie pagrobė Don iš turtingųjų Katlerių šeimos. Mergina priversta apsigyventi su savo tikrąja šeima , kuri ją sutinka ne itin svetingai. Pasirodo, tikroji šeimos galva yra senelė, kuri valdo šeimai priklausantį Katlerių viešbutį. Ji iškart pristato Don tarnaitės pareigoms, o su tikrąja mama ji pasimato tik po kelių dienų, mat pastaroji kankinasi nuo nervų ligų. Don nekenčia savo naujojo gyvenimo... O kur dar faktas, kad jos didžiausia priešė yra jos sesuo, o jos vaikinas yra jos tikras brolis....Skamba kaip tikra \"muilo opera\"? Tai, žinokit, taip ir yra. Vienas neįtikėtinas įvykis keičia kitą, mainosi giminystės ryšiai, o Don nuolat ir amžinai dėl visko kenčia, kaip tikra Marija Selestė iš tų visų legendinių serialų. Vėl tie patys V.C. Andrews motyvai: brolio ir sesers meilė, pikta senelė, mergaitė sužinanti, kad jos šeima nėra jos šeima... Kone visi šitie dalykai kartojasi visose autorės šeimų sagose, o AŠ VIS TIEK SKAITAU TAS KNYGAS. Na, ir nieko čia nepadarysi.. Matomai, man patinka pasikankinti su tomis Selestėmis. Bet gerai - paskaitai tokį romaną ir galva nuo visų rūpesčių palengvėja..."}, {"userName": "Rebecca McNutt", "userReviewDate": "Nov 13, 2016", "userURL": "http://www.goodreads.com/user/show/36977686-rebecca-mcnutt", "userReview": "Dawn is just another Flowers in the Attic, using too-close-for-comfort brother/sister relationships as perverse shock value which, after reading a number of VC Andrews' books, gets really repetitive and annoying. Her books always have a prissy rich family full of dysfunction, and some sort of weird possible incest..."}, {"userName": "M.M. Strawberry Reviews", "userReviewDate": "Sep 05, 2012", "userURL": "http://www.goodreads.com/user/show/12558730-m-m-strawberry-reviews", "userReview": "After VC Andrews died, it was left to Andrew Neiderman to finish the four books she had started but did not finish. After he did so, he wrote this book. It is supposed to have been based off notes and outlines left by VC before her untimely death. I know that some people were unhappy with Neiderman for this book and series, but I feel that the Cutler series reflected Neiderman's best efforts. It's clear that he put a lot of effort into this series as compared to his later works... which consist of pretty much anything he did after the Logan series especially Daughter of Darkness and the Gemini, Attic Secrets, April Shadows, Broken Flower, and Heavenstone series.This series was very decent, and I feel that VCA herself would have been pleased with this story though I am sure she would have tweaked it to add more of her personal, inimitable style. If you want to keep reading VCA and have read the Dollanganger and Casteel series, then read this, along with the Landry series. Together, these series make for a good reading experience whether it be from the original author or ghostwriter.Though this book itself leaves a lot of unanswered questions, it is but the first book of five, so you get to explore Dawn's story further (and the deal with Grandmother Cutler) The situations with her real and adopted brother bring a good touch of Gothic and incest to make the series thrilling enough."}, {"userName": "Joshua", "userReviewDate": "Oct 28, 2015", "userURL": "http://www.goodreads.com/user/show/28983544-joshua", "userReview": "I usually enjoy Andrew Neiderman VC Andrews, and this was no different: I flipped through this in a day and it was fun. I know 1 star is harsh, but it was so obvious he wasn't even trying. There wasn't enough fucked-up-shit for it to be amusing, and it was so cliched and juvenile that it felt like Sweet Valley High without all the craziness that makes VC Andrews interesting. I'll be completely honest, from what I've read, Andrew Neiderman is a competent writer. He's no literary genius, but I can usually flit through one of his books without rolling my eyes and cackling at every other page.I guffawed my way through this whole book. As I reached the last page, I couldn't shake the feeling that I had to cleanse the crevices of my brain with Joyce Carol Oates or John Updike. And I felt the shame of knowing that the next book I picked up would't be anything intelligent. The next book I picked up, would the sequel Secrets of the Morning."}, {"userName": "Laura", "userReviewDate": "Jun 09, 2009", "userURL": "http://www.goodreads.com/user/show/1094212-laura", "userReview": "I don't know why I ever try to read serious books. It should be all V.C. Andrews, all the time. It's like watching an episode of Maury Povich or Jerry Springer, only better because you're reading it and improving your mind at the same time!Dawn is exactly like Heaven (from V.C. Andrews' Casteel series) except she's blonde instead of brunette and lives in Richmond, Virginia instead of the West Virginia mountains. Everything else the same -- dirt-poor upbringing, secret wealthy parents, mean girls at school, unnatural love for brother and a hateful, slutty sister. On the very first page, we learn that the 14-year-old Dawn and her 16-year-old brother Jimmy, share a bed. In the second chapter, there is some inappropriate nudity and longing glances. But, like all V.C. Andrews books, nothing is quite what it first appears to be...I don't care if this series is the trashiest series on earth, it's still pretty dang entertaining to read!"}, {"userName": "Dawn Campbell", "userReviewDate": "Jun 16, 2008", "userURL": "http://www.goodreads.com/user/show/1245108-dawn-campbell", "userReview": "My sister had a box of books in her closet and the only reason I picked this up is because my name was the title! Little did I know what I was about to get myself into! All of V.C. Andrews' books (be it the ones she wrote or the ghost writers after her) are quite interesting. As soon as I finished this book, I was hooked on all her others. I've fallen off the wagon the past year or two, but I hope to catch up to them all."}, {"userName": "Jamie", "userReviewDate": "Nov 14, 2008", "userURL": "http://www.goodreads.com/user/show/1714434-jamie", "userReview": "I think in my pre-teen years I read all the VC Andrews books with my best-friend Trish at my side. love you trish!"}, {"userName": "Neva", "userReviewDate": "Nov 16, 2007", "userURL": "http://www.goodreads.com/user/show/250203-neva", "userReview": "Dawn is probably the worst book VC Andrews never wrote. It's the story of an impoverished vagabond who lives in Virginia with her parents and brother and sister. Her father gets a job as a janitor at a fancy private school, and Dawn and her brother Jimmy can go for free. Surprise, surprise, it's full of snobs and they hate Dawn and her brother. Everyone except a totally hot dude! I never realized while reading this in middle school how fast Dawn's romance with Philip progresses - they eat peanut butter and jelly sandwiches together one day, and then the next day they're at a make out spot? Whatever. Dawn's mother dies and then the police come to the their crappy apartment and tell Dawn she was kidnapped as a baby! And she's really Philips' sister! And rich!Blah blah blah. She goes to her real family and her mean grandmother is in charge and makes her be a chambermaid at her family's resort. Her mom is crazy, her dad is crazy, her sister hates her, and Philip can't deal with their new relationship and totally rapes her. Whatever. Oh, and now she's in love with Jimmy. The story ends with her finding out her kidnapping was a setup because her mother had an affair with a travelling musician and the grandmother finds out. She gets sent to a performing arts school in New York City! God, this book is lame. I find it alarming that Dawn blurs the line between brother and boyfriend so often."}, {"userName": "Mell", "userReviewDate": "Nov 13, 2011", "userURL": "http://www.goodreads.com/user/show/355426-mell", "userReview": "Another book I found in an old pile from high school. Ugh, I can't believe adults let me read these. While I don't remember VC Andrews books as graphic, they were full of incestuous brother-sister relationships. Why did anyone read these? And there are about a million different VC Andrews series. Sadly, I owned several. In hardback. They might have been gifts! I packed them off to Goodwill, as I can't toss (or burn, ha) even bad, bad books."}, {"userName": "Tahera", "userReviewDate": "Sep 15, 2017", "userURL": "http://www.goodreads.com/user/show/9902950-tahera", "userReview": "Basically my eldest sister owned a copy of this book and I managed to sneak it out of her possession and read it when I was around 14-15 years. I am not sure how I will like this book now but back then I quite enjoyed it. The plot had everything to get me interested at that point of time but never did get around to reading the entire series though..."}, {"userName": "Sarah Marie", "userReviewDate": "Oct 01, 2011", "userURL": "http://www.goodreads.com/user/show/6515737-sarah-marie", "userReview": "I love this book!Dawn was an amazing book. The characters were either likeable and unlikeable. This book was something that V.C. Andrews would write. I loved this book and I can't wait to read the rest of the Cutler series."}, {"userName": "Erin ☕ *Proud Book Hoarder*", "userReviewDate": "Jun 28, 2013", "userURL": "http://www.goodreads.com/user/show/3048260-erin-proud-book-hoarder", "userReview": "Dawn was an excellent book when I was younger - now not so much. I will always remember that I kept reading the beginning of the book, enchanted by how Andrews wrote. She was a likeable character pushed into some strange situations, classic Andrews."}, {"userName": "Yusra", "userReviewDate": "Sep 25, 2012", "userURL": "http://www.goodreads.com/user/show/5064816-yusra", "userReview": "http://incompletetales.tumblr.com/pos...I do not recommend this series unless you enjoy soap operas and you’re most recent favourite show just got cancelled, and maybe then you will find this to your liking."}, {"userName": "Debbie", "userReviewDate": "Nov 18, 2017", "userURL": "http://www.goodreads.com/user/show/12798804-debbie", "userReview": "This was a reread for me and even though I enjoyed it , it was nothing like the first time I picked this book up with all the twists and turns."}, {"userName": "Maaike", "userReviewDate": "Oct 29, 2017", "userURL": "http://www.goodreads.com/user/show/14457164-maaike", "userReview": "Stars: 2.5"}, {"userName": "Zonah", "userReviewDate": "Oct 27, 2011", "userURL": "http://www.goodreads.com/user/show/4381474-zonah", "userReview": "reading this book made me feel mature and i tried imagining myself into the situations...that was a great deal...hats off to V.C.Andrews...and especially to Dawn..!!"}, {"userName": "Andi Clarke", "userReviewDate": "Jan 08, 2013", "userURL": "http://www.goodreads.com/user/show/10442606-andi-clarke", "userReview": "Great series"}, {"userName": "Brittany", "userReviewDate": "Dec 14, 2012", "userURL": "http://www.goodreads.com/user/show/10154101-brittany", "userReview": "V.C Andrews never disappoints."}, {"userName": "Jess Swann", "userReviewDate": "Jul 02, 2017", "userURL": "http://www.goodreads.com/user/show/18396541-jess-swann", "userReview": "Une nouvelle saga qui, comme toujours, déracine l'héroïne, Aurore. La jeune fille découvre alors que ceux qu'elle pensait être sa famille ne le sont en fait pas. En même temps, vu comment son \"frère\" la regarde ça vaut mieux ( erf, le fait de vivre dans une telle promiscuité n'aide pas...) . Bon, la bonne nouvelle, c'est que la famille d'Aurore est riche. La mauvaise c'est que son petit ami est en fait son frère.. Ce qui, comme vous pouvez l'imaginer risque de poser un tas de problèmes... Sans compter qu'Aurore se retrouve affublée de la pire peste de l'école en guise de soeur (quand on a la poisse...). Pour couronner le tout, sa grand mère est carrément furieuse de la voir revenir à la maison, sa mère est carrément indifférente, son père plane... Et Philippe a vraiment du mal à la voir comme une soeur (mais que serait un VC Andrews sans un bon gros inceste ?). Bien entendu, on apprend peu à peu le secret de la naissance d'Aurore et la jeune fille finit par être éloignée de l'hôtel familial (ce qui n'est pas plus mal !)Ce que j'aime : la relation entre Philippe et Aurore (oui, c'est dommage qu'ils soient de la même famille), la grand mère CutlerCe que j'aime moins : la relation entre Jimmy et Aurore (pour le coup, je trouve ça too much, même si je reconnais que le fait de les faire sans cesse dormir l'un sur l'autre n'aide pas)En bref : Le début d'une nouvelle saga prometteuse avec une héroïne plutôt futéeMa note 8/10"}, {"userName": "Crazy_smiler", "userReviewDate": "Jan 14, 2013", "userURL": "http://www.goodreads.com/user/show/16431876-crazy-smiler", "userReview": "I didn't like how it was a repeat of many things from other V. C. Andrews books but it kept me interested and hard to stop reading."}, {"userName": "Kya Young", "userReviewDate": "Mar 13, 2018", "userURL": "http://www.goodreads.com/user/show/62017807-kya-young", "userReview": "V. C. Andrews will always be one of my favorite authors. RIP :(In her fine new Virginia school, Dawn Longchamp feels happy and safe. But nothing is what it seems...Now Dawn and her older brother Jimmy have a chance for a decent, respectable life, and Dawn'ssecret, precious hope to study singing can come true. Philip Cutler, the handsomest boy in school, sets Dawn's heart on fire. She is deeply devoted to her brooding brother; but with Philip, she imagines alovely dream of romance...Then Dawn's mother suddenly dies, and her entire world begins to crumble. After a terrible new shock, she is thrust into a different family and an evil web of unspoken sins. Her sweet innocence lost, humiliated and scorned, Dawn is desperate to find Jimmy again and...strip away the wicked lies that will change all their lives forever!This book has so many twists and turns I can not wait to get started on the second book. So the first part of the book you are getting to know Dawn and her family and how they live. The family consists of her father, mother, her brother Jimmy and her newborn baby sister Fern, who you see does grow quite a bit, being able to talk by the time everything starts to happens. The family is rather poor, the parents working one job after the next and also seem to be on the run. They live in small, one bedroom apartments so Jimmy and Dawn must share a pull out couch and you can see there are feelings there with Jimmy, but he can't do anything knowing that is his sister.....or is she? LIKES1. I love the twists in this book. The kids go to a private school and they meet all these snobby rich kids, especially the Cutler kids, Clara Sue and Phillip. Phillip looks at Dawn as his next girlfriend because he's oddly obsessed with her. Then come to find out, Phillip is actually her brother and Jimmy is not her brother because she was kidnapped as a newborn. And just when you think it can't get any worse it does. The whole kidnapping was a set up by Grandmother Cutler because Dawn is not even Mr. Cutler's real daughter so his mom set up the whole thing to get rid of the baby because his wife cheated.2.I applaud Dawn for being as courageous as she is at only 14. She gets sucked up into this mess and just when she is trying to clean up the mess, it gets even bigger but she does not give up. She eventually stands up for herself and now she is on her way to New York City.3. I'm glad that Clara Sue is still evil to her throughout the book even when she finds out they are sisters. In fact, how boring would it be if Clara Sue all of a sudden became best friends with her for that reason? I wanted to punch her in the face myself.DISLIKES1. Grandma Cutler=HUGE BITCH2. Clara Sue=SPOILED ROTTEN TEENAGE BITCH3. Laura Sue Cutler=LYING HYPOCHONDRIAC BITCHI'm very pleased with disliking characters because if you like and dislike characters, then the writer is doing an amazing job telling the story because not every one you meet in real life you will like. So not everyone in a story you read you will like. I give this book 5 out of 5 messed up families."}], "description": "In her fine new Virginia school, Dawn Longchamp feels happy and safe. But nothing is what it seems...  Now Dawn and her older brother Jimmy have a chance for a decent, respectable life, and Dawn's secret, precious hope to study singing can come true. Philip Cutler, the handsomest boy in school, sets Dawn's heart on fire. She is deeply devoted to her brooding brother; but with Philip, she imagines a lovely dream of romance...  Then Dawn's mother suddenly dies, and her entire world begins to crumble. After a terrible new shock, she is thrust into a different family and an evil web of unspoken sins. Her sweet innocence lost, humiliated and scorned, Dawn is desperate to find Jimmy again and...strip away the wicked lies that will change all their lives forever!", "title": "Dawn\n      \n          (Cutler #1)", "url": "http://www.goodreads.com/book/show/397456.Dawn", "average": 3.87, "cover": "https://images.gr-assets.com/books/1390354875l/397456.jpg", "reviews": 274, "authors": [{"url": "https://www.goodreads.com/author/show/1353301.V_C_Andrews", "name": "V.C. Andrews"}], "type": ["Fiction", "Young Adult", "Horror", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/397456.Dawn", "http://www.goodreads.com/book/show/33624861-sv-t-n", "http://www.goodreads.com/book/show/19005642-au-tant", "http://www.goodreads.com/book/show/563447.Dawn", "http://www.goodreads.com/book/show/30229039-het-geheim", "http://www.goodreads.com/book/show/16172152-dawn", "http://www.goodreads.com/book/show/2625311-aurore", "http://www.goodreads.com/book/show/43448.Flowers_in_the_Attic", "http://www.goodreads.com/book/show/226709.Petals_on_the_Wind", "http://www.goodreads.com/book/show/226706.If_There_Be_Thorns", "http://www.goodreads.com/book/show/659612.Seeds_of_Yesterday", "http://www.goodreads.com/book/show/659622.Garden_of_Shadows"]}