{"ratings": 762, "userreviews": [{"userName": "Antoinette", "userReviewDate": "Feb 06, 2018", "userURL": "http://www.goodreads.com/user/show/5328952-antoinette", "userReview": "DNF after 6 stories. Just not my type of stories. Too whimsical and fantastical. Still plan to read one of her novels"}, {"userName": "Krista", "userReviewDate": "May 04, 2015", "userURL": "http://www.goodreads.com/user/show/4729639-krista", "userReview": "There was a parade in Pas-Grand-Chose for all the mad scientists when they got off the plane. They were a curious sight with their hair sticking straight up in the air, their bottle-cap glasses and their briefcases that had smoke coming out of them. They had cardboard boxes filled with beakers and Dungeons and Dragons sets. None of them had girlfriends.\nDaydreams of Angels is like a book of fairytales for grownups – with magic and imponderables and talking with angels – and while many stories border on the absurd, each gem in this unusual collection lingers in the heart; these aren't moralistic or instructive tales, but rather, whimsical fantasies that get to the core of what it means to be human. As a huge fan of Heather O'Neill (and her novels Lullabies for Little Criminals and The Girl Who Was Saturday Night), it's a pleasure to see her freed from the long form and marvel at what she can condense into a few pages. As always, O'Neill's language and gift for metaphor is what makes her writing so interesting line by line. There are recurring images of trumpets and roses and wolves, and as in her novels, so many, many cats doing curious things:\n•Only a black cat saw her but it was too busy saying witty things to alert anyone.•The declawed kitten tiptoed on the table in just its stockings.•There was an aging black cat that had dyed its fur with a cheap bottle of dye from the pharmacy, but it wasn't fooling anybody.\nAnd the moon figures prominently, too:\n•The surface of the moon on a clear night looked all dented, like it had been out drinking and driving and had now lost its licence after a crash.•All that the Gypsy could see was the big fat moon, which looked like the bald head on a gentleman who sat in front of you at the movie theatre, blocking your view.•The moon looked like the Day-Glo face of a wristwatch.\nAnd more and more metaphors:\n•His cigarette smoke wavered above his head like a French philosopher's thought bubbles.•His sequins glimmered like a distant galaxy whose constellations were emitting their tragic messages in Morse Code.•The dolls had red, glistening lips. They looked as if they were dying to say something but had been warned not to say another word by their teachers. Their eyes were so shiny that at times it seemed as if they were welling up with tears. Their cheeks were rosy, as if they had come in from skating moments before. And their hair was so curly that it always seemed to be shaking, as if they had just taken the pins out and now it was tumbling down and they were laughing.\nThe writing is, thusly, so inventive that it's a pleasure to read just for the word combinations themselves, but repeatedly in this collection, I was broadsided by the truths at the center of what seemed at first blush to be simple fantasies. Love, love, love me some Heather O'Neill (which is why I let her do all the talking in this review)."}, {"userName": "Magdelanye", "userReviewDate": "Mar 27, 2016", "userURL": "http://www.goodreads.com/user/show/5208681-magdelanye", "userReview": "If you are at all uptight, judgemental, or belong to the moral majority, you probably wont like these sprawling, lushly subversive stories. You might even get irritated, lost, or you might feel a need to trivialize the writing, the characters, the plots or lack of plots, and you might miss the brilliance that permeates each story.So what do I love the most about HO'N that has skyrocketed her into my life?There is her diction of course, her teasing wordplay, and there are her marginal characters claiming centre stage and carrying on with impunity. It is her generosity of spirit that so appeals to me, and the crazy optimism that lurks under the dingiest reality, that life is good and worth living. Returning to these stories for the weeks of their reading, as I struggled with the other books I was working my way through at the time, I was deeply grateful for their refreshing, uplifting effect."}, {"userName": "Ashley Daviau", "userReviewDate": "Aug 27, 2016", "userURL": "http://www.goodreads.com/user/show/35915119-ashley-daviau", "userReview": "As usual, Heather O'Neill delivers an absolutely stunning story. Or really in this case, a whole bunch of stunning stories because each one was freaking amazing! Each story captured me right from the first sentence to the very last. I loved that they were all kind of fairytales but based in Montreal like her previous works. This collection of stories was beautiful and touching yet whimsical and lighthearted at the same time. I absolutely adored Daydreams of Angels and find myself wishing there were twice as many stories!"}, {"userName": "Kate", "userReviewDate": "Jun 02, 2015", "userURL": "http://www.goodreads.com/user/show/2378632-kate", "userReview": "I've said the gist of this quote from the Toronto Star before but they say it best: \"[O'Neill] writes like a sort of demented angel with an uncanny knack for metaphor.\" A knack is definitely putting it lightly. Anything I read of hers I love just because of the descriptions and the sheer absurdity of the images and stories going on here. I enjoy her novels a bit more but by no means should you skip this weird collection of stories if you're a fan of hers. We've got cloned Russians, robots, a gypsy who isn't really a gypsy, and Montreal in ways you've never seen it. Definitely not to be missed."}, {"userName": "Steph", "userReviewDate": "Nov 04, 2015", "userURL": "http://www.goodreads.com/user/show/17985658-steph", "userReview": "I didn't like any of these short stories I really tried but I just couldn't get into them. Even though most of them if not all of them have a Canadian Setting and context. They're really unique and I liked the concept of each story the delivery was not great and I hated some of the historical connections that she made it just didn't come off well."}, {"userName": "Dov Zeller", "userReviewDate": "Feb 05, 2016", "userURL": "http://www.goodreads.com/user/show/440651-dov-zeller", "userReview": "I couldn't get into this one. Read the first story, which was conceptually a little interesting but with writing that just felt tedious and uninspired. And gave up very soon into the second story, which I found pretty grating (the writing made me shrink away in horror for some reason). So, chalk that up to \"not a good fit for moi.\""}, {"userName": "Angélique (MapleBooks)", "userReviewDate": "Feb 06, 2015", "userURL": "http://www.goodreads.com/user/show/28480875-ang-lique-maplebooks", "userReview": "Daydreams of Angels is a little piece of magic. It brought me back to the same feelings I had in my childhood while reading Alice in Wonderland or The Wizard of Oz. These books immersed me in a world of wonders, which left me fascinated but also slightly scared… after all, Alice almost drowns in her tears and a walking scarecrow wasn't my vision of a best friend!Daydreams of Angels possesses this ambivalence too. It's beautifully written and immerses the reader into its oneiric worlds with no effort. However it's also heartbreaking and very often tragic. While giving life to angels and talking bears and abandoned dolls and half-mechanical people, it also tells extremely thought-provoking stories about real-life childhood and family legacy.\"It was because of his childhood that he couldn't trust anybody.\"A few themes tie all twenty six stories of Daydreams of Angels together. My favourite one was the consequences of a child's environment and family over his or her future. Several characters in the book—often little girls—are abused or neglected. Sometimes they live in extreme poverty. Always, they were born with a good heart but their surrounding—social pressure, mean adults or families—eventually define who they become.In \"The Saddest Chorus Girl in The World\", a girl is running away from her step-father and become a dancer with not much ambition in life; \"The Story of Little O\"—probably the most heartbreaking story in the book—shows the tragic depravation of a little girl left to her own devices; and \"The Story of Rose Bush\", a girl fostered by an abusive family after her father disappeared during WW2, will remind you of Sarah in A Little Princess by Burnett with a much darker, grown-up twist. A few characters, like the guru in \"The Holy Dove Parade\", even despise the whole family concept:\"He didn't believe in biological families. He thought that the root of capitalism was that when we were born, our parents owned us. And he said that biological families had a knack of teaching people to band together and hate outsiders, which was essentially just getting them prepared to wage war against others.\"However, Heather O'Neill shows how nurture and a child's future are tied in a peculiar way, not always giving the expected result. In the incredible story \"Swan Lake for Beginners\"—one of my favourites in the book—a (slightly mad) scientist is trying to clone the famous dancer Rudolf Nureyev. While they manage to give birth to batch after batch of clones, the team is confronted with an odd issue: most clones don't want to dance, most of them—when forced to—hate dancing, and the ones who eventually dance are nowhere as good as the original Nureyev. The story shows that Nureyev's relation to dancing was much more than the result of an adequate physiology. Dancing was a way to express and affirm himself, and even survive in a harsh environment.\"You were defined by being loved. Love exposed you to loneliness. Love gave you a personality but damaged you, too.\"Yet, not all stories are (entirely) tragic. Other shows the power of a single person to make a child's life brighter. \"The Man Without A Heart\"—another favourite of mine—shows how a single man, damaged and prejudiced against, can make a difference in a child's future. \"Bartok for Children\", a modern Pinocchio story, also shows how a man can instil affection and a family sense into a seemingly heartless boy.There would be a lot more to say about Daydreams of Angels but instead of going on forever about it, I thought you might as well pick up the book and enjoy it first hand. It feels like reading a mix of dreams and childhood recollections. Heather O'Neill's style is simple, vivid and fluid, immersing the reader with great ease in magic and sometimes sinister worlds. Let's wish Daydreams of Angels the best of luck for the Giller Prize 2015 and in any case: read it. Just read it."}, {"userName": "Jean-marcel", "userReviewDate": "Nov 17, 2015", "userURL": "http://www.goodreads.com/user/show/8821840-jean-marcel", "userReview": "These are stories of lost children, happy children, poor folk, folk with hearts of stone, folk with hearts of glass, ballet dancers, chorus girls, wolfboys and mandogs, robots and toasters, oldsters telling crazy stories, poverty and excess and everything in between. The tales are sometimes cute, sometimes innocent, sometimes a bit dirty, sometimes perplexing. I liked the book. It helped that most of these are quite short and don't carry on their particular theme for two long. Realism is not a priority but the level of symbolism is very high. Everything has a projected meaning but I wasn't always convinced. Most of the time, though, it works. The medium of the short story is excellent and should not be ignored or treated as a trifle. In my case, I use them as an opportunity to investigate authors or even swaths of literature I would not bother with otherwise. It's truly great when a deliberate, patient reader like me can take in a story in a single sitting, and learn something about the author at the same time. I may not rush out to grab ONeill's novels but I was impressed here with her cleverness and the layers of fascinating ambiguity she constructed within these enigmatic little pieces."}, {"userName": "Gretel", "userReviewDate": "Feb 25, 2016", "userURL": "http://www.goodreads.com/user/show/7945503-gretel", "userReview": "There are a few individual gems but overall this collection is nothing to rave about. While reading the first few stories I'd be impressed by certain descriptions and strange character traits, but as I progressed further through the book everything became quite repetitive. Poor child, Quebec, strange quirk, some kind of sexual awakening, repeat. The characters's quirks just all seemed to bleed into one another, and to me it felt that O'Neill was just filling in her own version of mad libs. Change strange adverb with another one here etc. Another thing that made the stories blur into each other was the matter of so many of them being told second hand, e.g. a child recalling a story their grandparent told. Why not just hear it from the horse's mouth? I hoped to like this more, as I've really grown to appreciate short story collections, but I think revamped/modern fairy tales have been done to death. There's talent here, but I'd suggest reading this book over a long period of time to get the most out of these stories."}, {"userName": "Sherry Monger", "userReviewDate": "May 16, 2015", "userURL": "http://www.goodreads.com/user/show/5548515-sherry-monger", "userReview": "Short stories are not my favourite literary form, but these stories are absolutely brilliant!Someone at the Toronto Star has said that O'Neill writes like a \"demented angel\" and I would wholeheartedly agree. The first thing you need to do before reading is to give up all preconceived ideas about how a story should go. These ones are fantastical,impossible and you can never successfully predict where they are going to go. There is the story of the cloned Rudolph Nureyevs and the one where Jesus is in Grade 6 with the narrator, and the chain smoking angels. These tales are sometimes comical and sometimes shocking and always involve people existing on the edges of society. Many times I was unable to immediately continue on to the next story - I had to put the book down to contemplate what I had just read. This is the most creative mind that I have read in quite some time."}, {"userName": "David Scrimshaw", "userReviewDate": "Nov 23, 2015", "userURL": "http://www.goodreads.com/user/show/12995971-david-scrimshaw", "userReview": "These magical short stories made me want to write my own outrageous stories.What's stopping me besides time and energy? They just wouldn't be this wonderful.And technically, I don't want to spoil this for you, but there might even be a talking cat."}, {"userName": "grdel", "userReviewDate": "Sep 27, 2015", "userURL": "http://www.goodreads.com/user/show/8280770-grdel", "userReview": "Fables, mostly urban, some dark but all of them magical and utterly charming. O' Neill's writing is wonderful, evocative and packed with originality and verve. Loved."}, {"userName": "Andrea", "userReviewDate": "Jan 15, 2015", "userURL": "http://www.goodreads.com/user/show/6608084-andrea", "userReview": "All the stars! Absolutely wonderful! Heather O'Neill creates the best, most magical, similes I have ever read. This book is a work of art!"}, {"userName": "Aly", "userReviewDate": "Sep 08, 2017", "userURL": "http://www.goodreads.com/user/show/3528600-aly", "userReview": "Je croyais que ce livre était un roman. J'ai d'abord été déçue de constater que c'était des nouvelles mais après la deuxième histoire, j'étais déjà conquise. Tout plein de gens et d'objets sont mis en scènes dans ces récits tantôt amusants, parfois troublants, tantôt mignons ou alors délicieusement absurdes. Des jouets, des chérubins, des animaux, des enfants, des adultes écorchés, des vieillards raconteurs, des hybrides, des robots et plusieurs autres encore. Avec un titre pareil, il faut s'attendre à des univers fantaisistes ou simplement étranges et j'ai noté plusieurs clins d'oeil à des oeuvres littéraires, cinématographiques ou des contes et légendes. Mon coup de coeur ? Comment se déroulerait une journée de classe typique pour certains personnages bibliques s'ils vivaient à Montréal à notre époque.Presque 400 pages pour un livre de nouvelles, c'est peut-être un peu trop à mon goût, mais ça ne change rien au fait que la plume de l'auteure est sublime."}, {"userName": "Alexander Kosoris", "userReviewDate": "Aug 13, 2015", "userURL": "http://www.goodreads.com/user/show/21462127-alexander-kosoris", "userReview": "A short story collection is an interesting outlet for an author to experiment with her craft. Given that the sequestered narratives have so little time to show and tell, it gives an author ample leeway to branch out to different styles and dramas. Even if a tale sort of falls flat – and, many a short story collection has its share of duds – the author can move along to something completely different, fostering more opportunities to amaze and surprise. Then a short story collection like Daydreams of Angels comes along and not only does so much with these brief tales, but also contains nothing I would really call a dud.O’Neill proves herself to be a careful author, painstakingly fleshing out characters to such a great extent that you’d have to be heartless not to empathize with them, even within our brief glimpses into their lives. But, don’t think that only the characters are given such love; the author fills her stories with numerous intriguing details that make the little worlds come alive. I absolutely love how specific she gets with difficult, almost impossible, descriptions: the sound of an angel playing his trumpet, or how it feels to still be in the womb. And, while Daydreams of Angels wanders through a huge array of themes – loneliness, corruption, redemption, perception, and love, to name a few I can think of offhand – some of the stories don’t bother to change anything, reminding us that, sometimes, stories just exist for the enjoyment of the telling.So, I think I can very easily recommend Daydreams of Angels, with the skilful diversity of its tales. While not every story will prove to blow you away, a few of them may. (At least one made me cry, and that’s probably some indicator of O’Neill’s skill.)"}, {"userName": "Jenny Cooper", "userReviewDate": "Aug 21, 2016", "userURL": "http://www.goodreads.com/user/show/54132199-jenny-cooper", "userReview": "I approached this book with a degree of reluctance as the description on the back cover made it sound like pure fantasy, not one of my favourite genres. However, the reality was very different and I loved it. Heather has given her imagination free rein to wander where it will and the result is a magical collection of short stories. It is essentially a book of fables for adults, each one loosely based on fairy tales, biblical stories or traditional folklore with which we are all familiar and which have been reworked in a completely unique and contemporary way. Many are recognisable despite the fact that they often incorporate adult themes and are based in unfamiliar settings. Some are dark, some humorous, some fantastic (in the sense of pertaining to fantasy) but all are grounded in realism. They somehow manage to combine both cleverness and simplicity, an effective and successful marriage. In addition, many have a twist in the tale which adds a welcome layer of unpredictability.I have never read any Heather O’Neill before, but if this is a taste of what to expect, I shall certainly be reading more."}, {"userName": "Amanda", "userReviewDate": "Apr 17, 2015", "userURL": "http://www.goodreads.com/user/show/710000-amanda", "userReview": "i loved this short story collection. the author gives us fairy tales & fables which manage to convey grief, hope, loss, love. they are absurd, highly imaginative & humorous stories that complement her novels quite well. there are stories within stories told by parents and grandparents to children. there are talking bears, misbehaving angels, cloned ballet dancers, soldiers with clockwork hearts. they are both fanciful and at times political, but they are always entertaining. reading these stories was pure joy. it's good to see contemporary writers taking on the fairy tale again. i'm thinking also of Helen Oyeyemi (Boy Snow Bird, Mr. Fox, etc), Barry Webster's the Lava in My Bones & in the last century, Angela Carter's the Bloody Chamber. i highly recommend this collection to all readers. they will remind you of the joy of reading you discovered as a child. If Angela Carter & Kurt Vonnegut had a daughter, she would be Heather O'Neill."}, {"userName": "Brian", "userReviewDate": "May 29, 2016", "userURL": "http://www.goodreads.com/user/show/9050360-brian", "userReview": "O'Neill is a great prose stylist; this collection is full of lovely sentences and even better metaphors. And a few of the stories are truly great--the way she plays with fairy tale and myth is a lot of fun.But, my main beef with O'Neill is this: whether in her stories or in her novels, she's only really got one voice, and even when her characters are ostensibly different, they're the still the same (both in terms of the voice itself and mechanics/style). And that voice is fun at first, but it would be nice to get something different now and then--and Daydreams never really manages that. Reading the collection straight through, therefore, really exposes her weaknesses."}, {"userName": "Penny (Literary Hoarders)", "userReviewDate": "Oct 05, 2015", "userURL": "http://www.goodreads.com/user/show/3727008-penny-literary-hoarders", "userReview": "3.5 stars  I approached the stories in this collection with some caution. They were a little strange at first, all simplistically written and all folklore-ish and adult/modern fairy tales. The off-beat, fairy tale quality to the stories are not my normal cup of tea but there are quite a few of the stories inside that were an absolute delight to read. Towards the end my interest started to wane again as they did return to more of the same, simplistically written fairy tale stories, with similar style stories/plots. This is the first time I've read O\"Neill's work."}, {"userName": "Marc", "userReviewDate": "Apr 28, 2016", "userURL": "http://www.goodreads.com/user/show/2923208-marc", "userReview": "What a charming collection! Ms O'Neill's fantastical short stories bring Peter S Beagle to mind, as she can conjure metaphor like a sorceress. The tales are often delightfully absurd- a grandfather tells his grandkids about his dating life as a young man on Dr Moreau's island, a woman recalls how babies used to be made (washed up on the ocean beach for mothers-to-be to collect)- and quietly relevant. This one is a stunner and, like other impactful storytellers, goads me to write more.....and better."}, {"userName": "Zoom", "userReviewDate": "Sep 09, 2015", "userURL": "http://www.goodreads.com/user/show/1989201-zoom", "userReview": "Heather O'Neill is one of my favourite writers. I love her quirky characters and her subtle sense of humour. A lot of her characters were born on the edge, the offspring of dysfunctional families, growing like weeds in the cracks of the sidewalk. I found this book of short stories to be more ethereal and less gritty than some of her others. She plays with point of view...one story is written from the perspective of abandoned dolls, another from the perspective of a child's imaginary friend. Overall, it's a wonderful collection - imaginative, clever, touching, funny and evocative."}, {"userName": "Alicia Kaiser", "userReviewDate": "Dec 29, 2016", "userURL": "http://www.goodreads.com/user/show/4580835-alicia-kaiser", "userReview": "She did it again. I will go to the ends of the earth to read anything that O'Neill writes. Her metaphors are an old friend that clings to the walls of my heart. I've loved her novels but something about these short stories were just meant to be for me. Within a few pages I'd be swollen to bursting with emotion. These stories are good for getting out those pent feels up feels. 10/10 would recommend."}, {"userName": "Quentin Krogstad", "userReviewDate": "Nov 05, 2017", "userURL": "http://www.goodreads.com/user/show/28679592-quentin-krogstad", "userReview": "O'Neill is a master of metaphors. Any collection of short stories will contain pieces that not every reader likes, but in every single story I found myself needing to share some delicious nugget of writing that made me laugh or gasp. She wields her metaphors with unique cleverness that never fails to amaze. Brilliant."}, {"userName": "Steph VanderMeulen", "userReviewDate": "Feb 01, 2015", "userURL": "http://www.goodreads.com/user/show/3818944-steph-vandermeulen", "userReview": "Find my review on bellasbookshelves.comhttp://www.bellasbookshelves.com/?p=8706"}, {"userName": "Heather Craig", "userReviewDate": "Apr 05, 2015", "userURL": "http://www.goodreads.com/user/show/11838034-heather-craig", "userReview": "I love everything of Heather O'Neill's that I have read. Her characters and her ability to see beauty stay with me long after I finished reading"}, {"userName": "Beth", "userReviewDate": "Sep 29, 2015", "userURL": "http://www.goodreads.com/user/show/18377475-beth", "userReview": "One of my favourite authors now...magical and funny."}, {"userName": "Pamela", "userReviewDate": "Aug 05, 2015", "userURL": "http://www.goodreads.com/user/show/30824320-pamela", "userReview": "[Totally absolutely completely brilliant and unexpected. The Orphan is the Gypsy; the Bear is the Gypsy's heart; the story is a circle, internal, reality. The story is started by the boy but continues through the characters. And here it ENDS.\"And of course the bear had been right. The Gypsy could never travel without him. And even though it was a monster, a beast that people had all sorts of preconceived notions about, the bear was really his own great big heart. The bear was who he would have been if he hadn't had a difficult childhood. The bear was everything that was good and decent about the Gypsy, and it would follow him whether he liked it or not, everywhere he went. It would never let him just look at the world coldly. It would almost magically make him notice that everything was full of wonder.\" (hide spoiler)]"}, {"userName": "Shannon", "userReviewDate": "Apr 04, 2018", "userURL": "http://www.goodreads.com/user/show/1351161-shannon", "userReview": "\"The surface of the moon on a clear night looked all dented, like it had been out drinking and driving and had now lost its licence after a crash.\"\"They think that they have flown all the way up to the moon, but really they haven't gone anywhere at all.\"If there's anything as abundant in Heather O'Neill's writing as charmingly scruffy stray cats, it's the moon as a flawed and dirty but ultimately beautiful and hope-giving sight. In this sense, it's the perfect metaphor for the types of characters she writes about. They're down on their luck, kicked around by society and circumstances, victims of poor decision-making. But they're also charming and lovable for the fact that they're never fully sobered by reality and always half-sure a better tomorrow is just around the corner.I love how instantly identifiable O'Neill's writing is, even if it's hard to define any specific features (other than her odd but uncannily accurate metaphors) that make it so unique. A lot of it comes down to character and setting: her rendering of the seedier corners of Montreal and their many quirky, vibrant occupants feels so alive with activity and color. It's also comfortingly familiar, after having read her novels, and it was easy to effortlessly slip into that world again for most of these stories. I also love how deftly she balances lightness and darkness, humor and gravity, surrealism and reality. These stories burrow their way into the reader's heart surreptitiously but ultimately leave a lasting mark.My favorites were probably the ones on the more whimsical and weird magical realism side of the spectrum: \"Swan Lake for Beginners,\" \"Daydreams of Angels,\" \"The Dreamlife of Toasters,\" \"Messages in Bottles,\" \"Bartok for Children,\" \"The Wolf-Boy of Northern Quebec.\" These allowed the more surreal flourishes in her writing which hovered just around the edges of her novels to really take flight. Of course, there were also several fantastic coming-of-age stories (\"The Man Without a Heart,\" \"The Story of Little O,\" \"The Conference of the Birds\") that were as heartwarming as they were devastating."}, {"userName": "Luc Séguin", "userReviewDate": "Oct 26, 2017", "userURL": "http://www.goodreads.com/user/show/56324857-luc-s-guin", "userReview": "La Vie rêvée des grille-pain. Comment résister à un tel titre ? Ce recueil d’histoires, d'une auteure québécoise que je ne connaissais absolument pas, est le contraire de notre époque : nul jugement moral, ici, nul haine de l’autre. Qu’un irrésistible appel à aimer la vie, amour dans lequel les personnages puisent leur liberté.O’Neil s’intéresse aux marginaux, aux exclus : un junky, un petit garçon timide, une mère monoparentale, une famille sur le BS, un vieillard seul avec son chien… Près de la moitié des histoires nous sont racontées par un grand-parent, dont l’imagination débordante ne reculent devant aucun « faits alternatifs », pour le plus grands bonheur de ses petits-enfants. Nous sommes dans la vie rêvée, où domine l’esprit du conte.Mais ces histoires pour autant ne s’adressent pas aux enfants. Car l’auteure mélange les genres, les atmosphères, explorent les situations ambiguës, les sentiments sordides. Et la mort qui rôde...La prose est concise, alerte, précise, avec, çà et là, des comparaisons qui font sourire. Mes trois histoires préférées : « L'homme sans coeur », « Les anges de la falaise », « Bartók expliqué aux enfants ».La traduction, faite au Québec, est excellente."}], "description": "Inventive, outlandish, and tender fairy tales from a bestselling authorThe fantastic has always been at the edges of Heather O'Neill's work. In her bestselling novels Lullabies for Little Criminals and The Girl Who Was Saturday Night, she transformed the shabbiest streets of Montreal with her beautiful, freewheeling metaphors. She described the smallest of things--a stray cat or a second-hand coat--with an intensity that made them otherworldly. In Daydreams of Angels, O'Neill's first collection of short stories, she gives free reign to her imaginative gifts. In \"The Ugly Ducklings,\" generations of Nureyev clones live out their lives in a grand Soviet experiment. In \"Dear Piglet,\" a teenaged cult follower writes a letter to explain the motivation behind her crime. And in another tale, a grandmother reveals where babies come from: the beach, where young mothers-to-be hunt for infants in the surf. Each of these beguiling stories twists the beloved narratives of childhood--fairy tales, storybooks, Bible stories--to uncover the deepest truths of family life.", "title": "Daydreams of Angels", "url": "https://www.goodreads.com/book/show/23848004-daydreams-of-angels", "average": 3.97, "cover": "https://images.gr-assets.com/books/1424086636l/23848004.jpg", "reviews": 138, "authors": [{"url": "https://www.goodreads.com/author/show/12676.Heather_O_Neill", "name": "Heather O'Neill"}], "type": ["Short Stories", "Fiction", "Fantasy", "Cultural", "Literary Fiction"], "outlinks": ["http://www.goodreads.com/book/show/23848004-daydreams-of-angels", "http://www.goodreads.com/book/show/22812823-daydreams-of-angels", "http://www.goodreads.com/book/show/26124707-daydreams-of-angels", "http://www.goodreads.com/book/show/25663117-daydreams-of-angels", "http://www.goodreads.com/book/show/36098892-la-vie-r-v-e-des-grille-pains", "http://www.goodreads.com/book/show/25343082-daydreams-of-angels", "http://www.goodreads.com/book/show/22207.Lullabies_for_Little_Criminals", "http://www.goodreads.com/book/show/30201327-the-lonely-hearts-hotel", "http://www.goodreads.com/book/show/18490554-the-girl-who-was-saturday-night", "http://www.goodreads.com/book/show/35644665-wisdom-in-nonsense", "http://www.goodreads.com/book/show/15838850-and-they-danced-by-the-light-of-the-moon", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}