{"ratings": 776, "userreviews": [{"userName": "Donna", "userReviewDate": "Nov 09, 2015", "userURL": "http://www.goodreads.com/user/show/13244359-donna", "userReview": "This is my first book by this author. I appreciated the Christian Fiction/Crime-Mystery merge. There were things I definitely liked, but it also tipped in the other direction. I liked the plot. It was intriguing and had some twists that were well placed.My main two complaints may be linked. I didn't care for the MC. I prefer the MC to be a little stronger and not a complete mess, especially when they have to carry the entire book. My dislike of her might be linked to the narrator. I listened to the audio and it felt way over acted and the MC came across as super whiny. I struggled with that."}, {"userName": "Debra", "userReviewDate": "Nov 19, 2013", "userURL": "http://www.goodreads.com/user/show/20295188-debra", "userReview": "Another great, heart-thumping suspense novel from Brandilyn Collins! This one sees the main character's faith growing and becoming an ever-more important part of her life. In this book, she will need every bit of her own faith as well as that of those around her as she, once again, finds herself in the thick of a murder investigation. While she is heading for trouble in that direction, her teenage son in rushing into it from another. The climax was so well-written and descriptive, my heart was pounding! I'll be sorry to see this series end..."}, {"userName": "joyce lynn ", "userReviewDate": "Jul 02, 2007", "userURL": "http://www.goodreads.com/user/show/162773-joyce-lynn", "userReview": "Brandilyn Collins is a phenominal mystery writer, who certainly knows how to toss the twists and turns in, and keep you on your toes! she puts lots of details in it, but not too much, so if you're squeemish about murder, you should still be able to handle it. btw, for those of you that will only read christian books, she is a christian author!oh, this book is #3 in a series. the main character starts out as a court room artist in the 1st book, who becomes a forensic artist."}, {"userName": "Amanda", "userReviewDate": "Oct 29, 2016", "userURL": "http://www.goodreads.com/user/show/7535238-amanda", "userReview": "3.5 starsOverall, I liked this story and thought it had a solid mystery. I did figure out who the killer was but not until the very end when it is probably obvious to everyone. I felt a bit detached from the characters because I read the first two books in the series a long time ago. I didn't care for the brief times we spent in the killers POV. The ending was very good and why I gave it the 1/2 star."}, {"userName": "Jenna", "userReviewDate": "Dec 20, 2017", "userURL": "http://www.goodreads.com/user/show/20231530-jenna", "userReview": "Overall I really enjoyed this main character. It was so refreshing to read a character who showed genuine struggle and not just for one chapter or until the end of the book. The mystery itself was full of twists and turns which kept me reading and reading!"}, {"userName": "Pam", "userReviewDate": "Mar 04, 2018", "userURL": "http://www.goodreads.com/user/show/65284889-pam", "userReview": "still haven't listened to book 2 - hope that doesn't mess up the series; it takes so long to get some things from the library; enjoying series, but a bit gruesome."}, {"userName": "Lisa", "userReviewDate": "Jun 14, 2017", "userURL": "http://www.goodreads.com/user/show/9933854-lisa", "userReview": "What can I say about such a great book! I really enjoyed this book! I love the mystery and suspense in this book. Brandilyn weaves in the power of prayer and how much we need prayer in our lives. Must read!"}, {"userName": "Lisa", "userReviewDate": "Jul 25, 2017", "userURL": "http://www.goodreads.com/user/show/14135765-lisa", "userReview": "Left me hanging with a lot of things unexplained."}, {"userName": "Louise E.", "userReviewDate": "Feb 27, 2017", "userURL": "http://www.goodreads.com/user/show/43939596-louise-e", "userReview": "Good story."}, {"userName": "Debra", "userReviewDate": "Jun 27, 2014", "userURL": "http://www.goodreads.com/user/show/6262845-debra", "userReview": "This is the second Brandilyn Collins novel I've read, and sadly, it will probably be my last.Here's the thing. I like the complexity of her plot, and the plot ideas are quite clever and engaging, at least in the two books I've read.But I just can't take the writing style. First, I'm not at all a big fan of first person. It's a form of emotional dissonance to me, trying to force me into pretending I'm the main character when I know I'm not and I frankly don't want to be. I don't read a novel to experience what the main character experiences. I want a good plot without all the extra \"please identify with my main character\" stuff. The action and plot are what I care about.So I should enjoy a novel such as this because the plot is good, right? I should. But I don't because of the weird phrases and ways of saying things this author has. The beginning and the endings are the worst for these things (although there often are a few scattered throughout). It's almost like those two parts are overworked, like the author thinks she can twist words/metaphors around to make them sound clever when they just come across as rather pompous or nonsensical. They drag me right out of the story, and that's especially not something you want to happen when the reader is in the middle of the climax action. I had a really hard time getting past a very early reference to a dead body as smelling sweet like rotting vegetables. One, rotting vegetables can in no way be described as a sweet smell. And two, my dad was a renderer so I KNOW what dead animals smell like, which is similar to dead humans. NO WAY they are described as sweet. Ever. Ever. Just never.I hate it that these things have come up in both books because I think if it weren't for the first person and the pretentious words pictures in places, I would probably enjoy this author otherwise. But sadly, I can't get past these things. They make me want to throw the book across the room (especially those few at the end, right in the middle of the action). Sorry.Oh, and as for the sister interactions in this, a couple of scenes between the two dragged on a bit and didn't seem to provide much to the plot.The plot itself was good, well-researched and very believable."}, {"userName": "Lisa Johnson", "userReviewDate": "Jul 28, 2014", "userURL": "http://www.goodreads.com/user/show/7092311-lisa-johnson", "userReview": "Title: Dead of Night (Hidden Faces #3)Author: Brandilyn CollinsPages: 457 (large type edition)Year: 2005Publisher: Thorndike Press (large type)Annie Kingston is back in this third installment of the Hidden Faces series. This time she is tasked with drawing lifelike images of the murdered victims of a serial killer. She also is still dealing with her son’s poor choices and behavior as he gets involved with drug dealers. Her sister has also moved in with her to help her “babysit” her son. She has a great deal of stress in her life and realizes the only way she can cope is with prayer. She has dedicated at least ½ hour every day to reading her Bible and prayer so she can face the day and its challenges. She also begins to realize her next door neighbor, Dave, is interested in more the friendship. Is she ready for a relationship when her life has so much chaos? As the murders become more frequent, Annie learns she knows one of the victims. The killer is becoming more and more brazen. Who will be next? Can Annie do anything to stop this killer?I couldn’t put this book down. There was so much suspense, action and mystery in the plot I was hooked from the first page. Having read the first two books in the series, coming in contact with the same characters again was like meeting old friends. Annie is now such a strong woman of faith, so much more than she realizes. I loved the emphasis on the power of prayer, especially as a weapon against evil and in the maturation of the relationship between God and His children. I would recommend reading the first two books in the series before this one as they serve to introduce the characters in book one and then further develop them in book two. This was a great book!My rating is 5 stars.Note: The opinions shared in this review are solely my responsibility. Other reviews can be read at http://seekingwithallyurheart.blogspo.... Also follow me on Twitter @lcjohnson1988, FaceBook at https://www.facebook.com/lisa.johnson..."}, {"userName": "Jay", "userReviewDate": "Jun 25, 2013", "userURL": "http://www.goodreads.com/user/show/8046340-jay", "userReview": "Dead of Night had its ups and downs. The plot (a Christian-focused serial killer novel) is pretty interesting. There is some decent suspense. And the identity of the killer was a nice twist.But the main character was not likeable to me. That is the result of two situations. The first was when she got angry at the police for not doing anything about her son getting beat up. Well the reason they didn't do anything was because he son (who is also awful) wouldn't talk. The second issue I had about her was how easily she got tricked in the end of the book.The ending of the book was kind of lazy. The identity of the killer was a twist, mainly because it didn't make any sense. The two other people I thought might have been the killer had reasons. The real killer? None, and the author never gives any motive. The author also left a few of the relationships unnecessarily open. The main character seemed to have two guys interested in her but the book end with absolutely no resolution whatsoever. Lastly, I don't particularly love the author. I'm not taking about the writing style but the author herself. Especially early in the book, she makes use of some stereotypes about race and rap music. Alienating an entire race isn't exaactly the best way to spread the Christian message.In the end, this was a decent book that could have been much better. I know the book is by a Christian publisher but the message often overpowered the plot. This wouldn't have been as big an issue is it had been done in a good way. Unfortunately it was not. Instead, the message was expressed in a way that many non-Christians take issue with; in a shove it down your throat and sometimes close-minded fashion."}, {"userName": "C.J. Darlington", "userReviewDate": "Feb 02, 2015", "userURL": "http://www.goodreads.com/user/show/2777896-c-j-darlington", "userReview": "Diving right into the action, DEAD OF NIGHT opens with narrator Annie Kingston confronting an intruder in her house. That same day she discovers the sixth victim of a serial killer in the woods on her property. Placed there randomly? Or is the killer trying to taunt her?Book #3 in the Hidden Faces series continues the saga of forensic artist Annie Kingston with page-turning intensity. Not only must Annie draw the victims of the killer for identification, she must also face the escalating consequences of her teenage son's rebellion and the challenges of living out her new-found faith. Interspersed throughout the first person narrative are chillingly evil, yet often strikingly poetic, scenes in the killer's point of view. I was reminded of Edgar Allen Poe's story \"The Telltale Heart\" as I read them.With this novel, and the rest of the Hidden Faces series, Brandilyn Collins has pushed the envelope in the emerging genre of Christian crime fiction. She's not afraid to tell it like it is, yet spares us the gratuitous details most secular crime writers thrive on. That said, DEAD OF NIGHT isn't just about crime and its aftermath. It's also about the power of prayer. As the back cover states: \"Annie learns where the real battle takes place - and that a Christian's authority through prayer is the ultimate, unyielding weapon.\""}, {"userName": "Jackie Morgan", "userReviewDate": "Mar 17, 2015", "userURL": "http://www.goodreads.com/user/show/37315753-jackie-morgan", "userReview": "Wow! Each book in this series just gets better! Truly suspenseful. This time around during the climax of the book I found myself pulling my feet up off of the floor and scrunching my face, reading with one eye open as the latest victim, always Annie Kingston at some point, was literally on the brink of death!Typically, when things run in series it seems on number 2 or 3 the steam runs out - not the case here! And just when you think she will wind up the dilemmas she doesn't, she amps them up! I should have mentioned earlier, in my first review, but forgot. Not sure about everyone else, but as a serious reader I think of myself as \"literate\". Brandilyn Collins has sent me to the dictionary more than a dozen times over the course of these past 3 books. The first couple times I thought, \"nah, probably won't see that word again in my lifetime\" but then she kept using it or added to the bank of \"unknowns\" in my brain! So I had to crack the old dictionary.Here are some of the words I'm proud to say I've learned, but haven't necessarily memorized :-)portent, pique, roiling, miasma, nonplus-ed, enervation, obsequious, darkling, sibilance, banal, denizens, morose, minutiae, insipidity, insouciance, pas de deux, nascent and drosser!Happy Reading!"}, {"userName": "Marissa", "userReviewDate": "Apr 30, 2012", "userURL": "http://www.goodreads.com/user/show/173542-marissa", "userReview": "I took a little hiatus between book 2 and book 3 in this series. Fortunately, one really doesn't involve the other much when it comes to the main crime storyline. There are occasional references to the previous family situations but they cover that pretty well. As for the main plot...what a horrible way to die! As soon as I thought I thought I figured out who the murderer was on 2 occasions. Boy was I wrong! Never saw that one coming until the end. Collins did a good job playing out the storyline. Some parts were a little too detailed and they became stale, but she was still able to keep the pages turning. Also, there was a little too much \"God/Jesus/prayer\" in this book for me. That's fine if that's your thing, but I felt like it was almost pushed on to me as a reader. Didn't stop me from reading it, but has stopped me from reading book 4 right away."}, {"userName": "Sheryl Rogener", "userReviewDate": "Dec 18, 2008", "userURL": "http://www.goodreads.com/user/show/2277838-sheryl-rogener", "userReview": "The Hidden Face series follows Annie Kingston (a former court artist and a single mom) into her new career as forensic artists and into her new life in Christ. This series would be classified as part of the mystery-thriller genre with some light romance thrown in. The author does an excellent job of keeping her readers guessing (particularly books 2 and 3) as to \"who dun it\". She also gives readers insight into the workings of the law enforcement world.Book three has been the best so far and I'm looking forward to reading book four."}, {"userName": "Amy", "userReviewDate": "Jul 27, 2011", "userURL": "http://www.goodreads.com/user/show/5900824-amy", "userReview": "this book was great until the last 3 chapters- at that point the ending became so obvious it wasnt worth finishing. the biggest problem was how obvious it was to the reader who the killer was but the extremely naive heroine didnt have a clue until it was too late and she was in trouble. there were warning flags all over the place but she took the wrng path. innocence is desirable for a while- then it just becomes plain stupidity. in my mind I am thinking - no normal person would fall for this ruse- how can she be so dumb as to go along with this. Not one of Annie's better moments."}, {"userName": "Jeff Carpenter", "userReviewDate": "Aug 29, 2010", "userURL": "http://www.goodreads.com/user/show/4124616-jeff-carpenter", "userReview": "I have read several of Brandilyn Collins' novels, but this is the best one to date. Fast paced, highly suspenseful with some gotcha's along the way. This is the book I was expecting when I started reading Ms. Collins' work. Not that her other stories were not good, I just had some big expectations from all the reviews I had read of her work, I guess I was a little let down. Not to fear, this book really delivers. Can't wait for the next installment in the series."}, {"userName": "Agnieszka", "userReviewDate": "Feb 21, 2015", "userURL": "http://www.goodreads.com/user/show/38573939-agnieszka", "userReview": "Yeah, it's a hard one. It's really a great written suspense with mostly well developed characters and very interesting twist and turns. Though I really couldn't relate to the poison murder plot and the real perp was in the 'book real life' unimpressive, I'm still giving the book 4 stars because of the splendid secondary plots and characters which are more than gripping and rewarding.The book is as all the other Brandilyn Collin books I read a real page turner."}, {"userName": "TheReadingKnitter/ Kasey", "userReviewDate": "Feb 02, 2010", "userURL": "http://www.goodreads.com/user/show/1070966-thereadingknitter-kasey", "userReview": "This book was my favorite out of the 3 in the series I've read so far, there's one more book in the series. It kept me guessing as to who was the Poisin Killer. But when Ruby invited her to her house I had a thought that it was probably her. And Annie is falling for Dave! :) I knew she would fall for him or Ralph."}, {"userName": "Geokowgurl", "userReviewDate": "Jul 30, 2012", "userURL": "http://www.goodreads.com/user/show/4199465-geokowgurl", "userReview": "Drawing pictures of the deceased isn't exactly what Annie Kingston had in mind when she decided to hone her forensic artist skills. But that is exactly what she is being asked to do by law enforcement in the hopes of getting identifications on the victims of a serial killer. However, is it safe for her family to undertake this job for the undertakers?"}, {"userName": "Cathleen", "userReviewDate": "Apr 17, 2009", "userURL": "http://www.goodreads.com/user/show/2092322-cathleen", "userReview": "Loved it! Read the whole thing in just a couple of days. I particularly liked the theme centering on the power of prayer. I think people forget how powerful prayer can be. Prayer CAN change things. I know I forget that. It's too easy to fall into a feeling of \"whatever will be, will be\". Prayer CAN change things. Can't wait to read the final book in the series."}, {"userName": "Julie", "userReviewDate": "May 29, 2013", "userURL": "http://www.goodreads.com/user/show/12355186-julie", "userReview": "This book pulled me in from page one. It was better than the first two in this series--not as many superfluous words this time. I liked the command to pray against evil this time and the surprise murderer in the end."}, {"userName": "Victoria", "userReviewDate": "Mar 03, 2014", "userURL": "http://www.goodreads.com/user/show/7363839-victoria", "userReview": "SuspensefulSuspensefulThis is good story demonstrating the power of prayer. I enjoyed the depiction of the forensic artist, which was something that I had not encountered in other forensic stories that I have read."}, {"userName": "Tessa Small", "userReviewDate": "Feb 03, 2014", "userURL": "http://www.goodreads.com/user/show/12263873-tessa-small", "userReview": "Just love her writing style and the thriller and suspense drama that she carries from page to page."}, {"userName": "Amy Marshall", "userReviewDate": "Mar 20, 2009", "userURL": "http://www.goodreads.com/user/show/2091639-amy-marshall", "userReview": "great!!"}, {"userName": "Donald A. Messenger", "userReviewDate": "Jan 19, 2016", "userURL": "http://www.goodreads.com/user/show/49541559-donald-a-messenger", "userReview": "I thought I knew Several times I thought I knew the killer, but was really surprised the way it turned out. Good story that keeps you guessing until the end."}, {"userName": "Quin", "userReviewDate": "Sep 24, 2016", "userURL": "http://www.goodreads.com/user/show/28789375-quin", "userReview": "Dead of Night, book 3 in the Hidden Faces series, by Brandilyn Collins, was hard to put down. Action, intrigue, and a little extra."}, {"userName": "Jill", "userReviewDate": "Nov 02, 2014", "userURL": "http://www.goodreads.com/user/show/24738708-jill", "userReview": "This is book three, and my comments are the same. Interesting story line, annoying characters. Too bad!"}, {"userName": "Susan", "userReviewDate": "Dec 06, 2014", "userURL": "http://www.goodreads.com/user/show/8026410-susan", "userReview": "This one was oh-so-creepy to find out who the killer was!! I never would have guessed it!"}], "description": "All words fell away. I pushed myself off the path, noticing for the first time the signs of earlier passage—the matted earth, broken twigs. And I knew. My mouth turned cottony. I licked my lips, took three halting steps. My maddening, visual brain churned out pictures of colorless faces on a cold slab—Debbie Lille, victim number one; Wanda Deminger, number three . . . He’d been here. Dragged this one right where I now stumbled. I’d entered a crime scene, and I could not bear to see what lay at the end. . . . This is a story about evil. This is a story about God’s power. A string of murders terrorizes citizens in the Redding, California, area. The serial killer is cunning, stealthy. Masked by day, unmasked by night. Forensic artist Annie Kingston discovers the sixth body practically in her own back yard. Is the location a taunt aimed at her? One by one, Annie must draw the unknown victims for identification. Dread mounts. Who will be taken next? Under a crushing oppression, Annie and other Christians are driven to pray for God’s intervention as they’ve never prayed before. With page-turning intensity, Dead of Night dares to pry open the mind of evil. Twisted actions can wreak havoc on earth, but the source of wickedness lies beyond this world. Annie learns where the real battle takes place—and that a Christian’s authority through prayer is the ultimate, unyielding weapon.", "title": "Dead of Night\n      \n          (Hidden Faces #3)", "url": "https://www.goodreads.com/book/show/593056.Dead_of_Night", "average": 4.3, "cover": "https://images.gr-assets.com/books/1176096860l/593056.jpg", "reviews": 37, "authors": [{"url": "https://www.goodreads.com/author/show/101287.Brandilyn_Collins", "name": "Brandilyn Collins"}], "type": ["Christian Fiction", "Mystery", "Christian", "Fiction", "Suspense"], "outlinks": ["http://www.goodreads.com/book/show/593056.Dead_of_Night", "http://www.goodreads.com/book/show/7513172-dead-of-night", "http://www.goodreads.com/book/show/32196400-dead-of-night", "http://www.goodreads.com/book/show/8214102-dead-of-night", "http://www.goodreads.com/book/show/593059.Brink_of_Death", "http://www.goodreads.com/book/show/593060.Violet_Dawn", "http://www.goodreads.com/book/show/593058.Eyes_of_Elisha", "http://www.goodreads.com/book/show/5986556-exposure", "http://www.goodreads.com/book/show/7443302-deceit"]}