{"ratings": 109299, "userreviews": [{"userName": "CJ - It's only a Paper Moon", "userReviewDate": "Oct 12, 2010", "userURL": "http://www.goodreads.com/user/show/1357098-cj---it-s-only-a-paper-moon", "userReview": "[ with the plot to kill Victor underway and the faeries out of the house and the babyshower on the way (where the hell did that even come from)the action starts. Sookie, in a very weird unchracteristic Sookie move, removes her clothing, runs starkers into Bill's house and huddles up with him as two humans plan to kidnap her and bring her to Sandra Pelt. Oh, did I mention that Sandra Pelt is out and has no bearing on the larger part of the story, which is....well, I'm not sure but Sandra comes in fits and starts. Since the book opened with her firebombing the bar, setting Sookie and Sam together (I know a lot of people don't get it but they would be a very good couple) and causing the Eric hissy fit, it make sense that her death would be the final action in the book. Anyhoooooo, so, Sookie actually plans the death of Victor and then the night when the vamps all go into battle frenzy mode, she becomes a hypocrite and is disgusted by the actions. Good call Eric (he's the one who called her out) but probably not a smart relationship move at the time. However, I like how you bit her and made it hurt because at that point, she needed some sense to clear her head. I mean, she planned and participated in the attack. I get that she doesn't like gore and that could make anyone sick but to not at least acknowledge how important the actions were, well yeah, I can see how you're harshing everyone's buzz.Oh, wait, did I mention that there's another plot thread? Eric has basically been sold to the Queen of Oklahoma and though he and Sookie are married, he would have to drop her like the leaden hot potato she's become to marry this Oklahoma bitch that his maker signed him up for? He's been trying to get out of it, hence the face pummeling of Pam and the moodiness. However, he only decides to bring it up after the fact. Is he going to get out of it? Does he want to? Sookie broke the bond and that hurt him. Will he stay? Stay tuned for the next edition of \"What the hell is going on with these people\".So, Sam and Sookie seem like they should end up together. Sorry I said it. It is out in the open. Deal with it how you wilt.Oh, Hunter. How could I forget. While I love Hunter and Sookie's dealings with him, why was he in this book? Was Harris afraid we would forget about him? I don't know. Was it to remind us that Sookie is human and has human dealings? Maybe. I can buy that but then I didn't need the friggin' baby shower. More time at Merlotte's would have been fine.  (hide spoiler)]"}, {"userName": "Tatiana", "userReviewDate": "May 20, 2010", "userURL": "http://www.goodreads.com/user/show/2250020-tatiana", "userReview": "[image error]"}, {"userName": "Jayson", "userReviewDate": "Aug 01, 2013", "userURL": "http://www.goodreads.com/user/show/22106879-jayson", "userReview": "(B-) 69% | SatisfactoryNotes: Cozy and familiar, while at the same time sloppy, amateurish and blah. No direction, just seemingly random events."}, {"userName": "Megan", "userReviewDate": "Aug 29, 2010", "userURL": "http://www.goodreads.com/user/show/1233686-megan", "userReview": "Dear Sookie, You know you are one of my oldest friends, right? I love our yearly visits at your old Stackhouse family home, sitting on the porch, soaking up the sun and drinking iced tea. It’s great to live vicariously through you and hear about the most powerful and sexy supernatural beasts falling over themselves to flirt with and please you. And Eric…. Mmmm =) Anytime you want to tell me all of his dirty little secrets and every sexy thing about him that is okay with me. But here’s the thing, Sookie. You tend to ramble. A lot. Don’t get offended. I love hearing you talk and visiting Bon Temps with you. But our time is limited. And as much as I love hearing all those mundane details of your life, I really wish our time together could be used more wisely. Your life is so exciting, and so many fascinating things happen to and around you ~ I’d much rather hear about your supernatural activities than the particulars that went into preparing for Tara’s baby showers. The next time we meet, it would be awesome if you stuck to the more important facts. Don’t get me wrong, I love hearing you talk about brushing your hair and cleaning the kitchen. But if you can’t bring yourself to edit those little fine points in favor of the bigger ones, perhaps you could convince Charlaine Harris to allow us more pages to visit? Even so, I did enjoy our time together and am looking forward to seeing you again next spring. Hopefully you and Eric will get more alone time and you can tell me everything. Your friend, Megan P.S. I loved Bubba's concert! Anytime you can get that guy to make an appearance (and especially sing!) be sure to tell me allll about it! =)"}, {"userName": "Kitten", "userReviewDate": "Aug 21, 2010", "userURL": "http://www.goodreads.com/user/show/4166881-kitten", "userReview": "3 1/2 StarsI should start off by saying that though the Sookie Stackhouse series isn't my all-time favorite series, Eric Northman IS my all-time favorite fictional character. AND GODDAMN I LOVE ME SOME PAM!Half of the reason I love these books is the Eric and Pam relationship; I find them endlessly entertaining. Though there weren't enough appearances of them (there never are), there were some comedic bits between the two. I enjoyed the funny jabs at Sookie on Pam's behalf (One scene in-particular, involving a gift to Sookie...yeah, that was classic!).The other half of the reason I love these books is Eric's relationship with Sookie. However, I think Eric is too good for Sookie. I've honestly never been a big fan of her. I think she's a brat, she yells too much, she's too judgmental, changes her mind to whatever suits her at the moment...and the hits can keep coming, but I'll stop here. That said, I was even more annoyed with her in this book because her character has seemed to make ABSOLUTELY NO PROGRESSION; she is not maturing in anyway, except maybe by obsessing over cleaning her house when she's stressed (or so the stereotype goes)...which happened WAAAAAAY too much, but I digress... I think it's obvious that there is no longer a love affair with our author and these characters. Though I enjoyed reading this (when I wasn't overly frustrated), it felt a bit hollow-I don't know how else to describe it. Though I'm not happy with where some storylines SEEM to be going, there are others that are intriguing (I'll leave it at that so as to not spoil anything)."}, {"userName": "Kasiabadura", "userReviewDate": "May 04, 2011", "userURL": "http://www.goodreads.com/user/show/888584-kasiabadura", "userReview": "It seems to me that Ms Harris is being more and more influenced by the show, which in case of the novel is a bad thing. Does anybody else have a feeling that the author is setting a scene for a convenient fading out Eric, and a not- so- miraculous reintroduction of Bill? The dialogue between S. and E. is stale and lacks in energy.Whereas, Bill's character all of the sudden shows signs of sense of humour. In short, I wouldn't be surprised if in the end of the series Eric ended up dead, and Bill emerged as a Sookie's true love.Well, if I were Stephen Moyer, I would be thrilled."}, {"userName": "Carol. ", "userReviewDate": "May 15, 2011", "userURL": "http://www.goodreads.com/user/show/3978225-carol", "userReview": "[found out how to break the blood bond between her and the vampire Eric. Nevermind that Sookie spent the first part of the book reflecting on how the bond has offered her protection, and had it reinforced when Eric had to visit his Regent, Victor. Nevermind that Eric came to the bar both times she was in danger, ready to save her. Nevermind that she hasn't said word one of her desire to be free to Eric, or even to herself. Poof, like that, she does it. Completely thoughtless, selfish and heartless.  (hide spoiler)]"}, {"userName": "valee", "userReviewDate": "May 05, 2010", "userURL": "http://www.goodreads.com/user/show/2320890-valee", "userReview": "I don't know why I have this feeling we will be disappointed with this installment. I just feel the series needs a closure and it doesn't seem like it. I want more Eric but I don't think I'll get all the Eric I need to get to love this series again. It feels like this book is just gonna be another chapter in the series and not as whole book. I'm not sure if I made myself clear,lol."}, {"userName": "LMM", "userReviewDate": "May 05, 2011", "userURL": "http://www.goodreads.com/user/show/1533889-lmm", "userReview": "Welll...This is a solid, \"liked it\" but more 3.5 stars. If it wasn't for the fact that there MIGHT be a HUGE plot inconsistency in this book (the convo between Sook, Claude & Dermot about Niall & Eric being in cahoots), I would give it 4 stars but I'm trying to figure out if something might actually be a well placed lie by CH or not but I'm not so sure yet.(**Edited on May 14th. After doing some digging, I think the bit I thought was a plot inconsistency is intentional. See bottom of review)However, overall I really enjoyed this installment once the ball got rolling (the 1st 50% was a bit boring for me) & I do believe this was indeed a huge turning point for not just Sookie & Eric but Sookie herself. The end scene with Eric was like..BAM! She has some very big thinking to do about what she wants for herself & what she is willing to accept about her life & the people she surrounds herself with.I don't have many doubts that Eric/Sookie are going wind up together. OK maaayaybe a little doubt b'c CH likes to play her audience...but... really? It wouldn't make sense to have it be anyone else 11 books in & a few shorts as well. I found this installment to signify their next big bump in the road, the next trial & tribulation for their relationship & watch how they get through it. In this book, for the 1st time Sookie was more upfront. Discussing the future, aging, babies etc.. she has grown & continues to. It does look like there is a setup for a breakup in the next book but with a possible reconciliation in the last book thanks to the magical cluviel dor. Who knows for sure though!**Semi-spoilers**There were a lot of typical SVM hi-jinks & humor in this book. Sookie's naked jaunt into Bill's house & her rambling inner monologue... \"Irrelevant!\" was hilarious.I even liked Bill. A lot. Although, that's not surprising b'c CH was turning him into Eric to a degree. Not kidding. CH is definitely recycling her Eric material into the new Bill. His quote as to why he loves Sookie complete with a comment about her chest (so un-Bill like) is practically verbatim Eric to Sookie in DTTW. That's right...go check it out! And his move...\"Is it Christmas? Are you my early present?\" was also classic Eric. It's a little tedious CH's manipulation of the audience but whatever. It is what it is. I suppose if you are going to finish this ride be prepared for the tactics that come with it.Sookie was back to herself but in better form than ever in many ways. Aside from her own homicidal tendencies, she is growing, more mature & in control. Or trying to be at least. She is taking a much larger stand for herself in what she will tolerate from the people in her life whereas in the past, she almost assumed their feelings & was able to be manipulated more. I like her relationship with Eric a lot. Warts & all. I found her insecurities & misgivings well founded as well as his own anger, resentment & fear. I really enjoy seeing them having to go through a ton of crap to work it out. Like a real relationship.I also loved the scene with Eric & Sookie after the bond broke. Not the sex scene mind you b'c that was whatever - it was one page of throwing it in but it did, to me show their huge relief that Sookie does in fact love Eric tremendously as he does her. More than that, I love their bit of dialog afterward.However, the scene that blew me away was at the end when she freaked out amongst the assassination ruin in which she had the majority hand in rallying & plotting. When Eric took her blood after rightly calling her a \"hypocrite\" & didn't take the pain out of it. HOLY COW. I know this will be a much debated scene & very controversial but I thought it was just SPOT ON. So good. So dark. So very deep.It was awesome. Well for me anyway. I mean here Sooks has been complaining the last 2 books how she wants Victor to die (by her own hands even). She's the one that rallies Eric & co. It's her plan they go with & then at the end....b'c she hates what she sees in herself & not only that but, was a part of & had the largest hand in plotting, she projects onto Eric & co. b'c it's easiest to do that.Him letting her feel the pain was his way (to me anyway) of saying deal with it! Face it. This is life with me/a vamp Sookie & I'm not going to sugarcoat it for you. Accept it & accept me. You partake in this life, these are the realities that come with it. We're alive. Isn't that what you wanted most?I don't know what CH is going to have her do but I find this turning point really compelling. She scares herself. The lengths she's willing to go to for those she loves & to survive & the macabre situations she finds herself in as a result.I thought it was a very clever, deep scene.The CD fairy love token is a bit of a cop out but I will wait to see how CH wields it. Oh wait.. we have a potion which will amazingly come in SO handy! Er...we'll see.The potential Fairy plot is quite devious. It seems as if CH is foreshadowing someone playing dress up in Eric or someone else's skin to potentially get Sook's up the duff? IDK but all the material is there & man...those Fairies are sneaky.Funnily enough, I felt the worst for Sookie in regard to Amelia. Not that Amelia's meddlesome betrayal was a surprise to me, I figured it was only a matter of time but she really went all out. Sookie is a character with a rare handful of people she can trust & not even that. She is quite often, alone. And that theme featured a lot in this installment. With Eric's new day man being a 'lone wolf', Eric asking her to move in with him b'c the thought of her being 'alone' & feeling her fear made him crazy. Her really feeling the isolation in this installment esp. when she kicks everyone out of her home. Poor Sookie Sookie.Overall, this place which Sookie is in, yet another crossroads deciding who she can trust, turn to, what will happen to her relationship & what will that mean for her future? This is all great meaty stuff.And now for my biggest issue..the potential plot inconsistency (it's the convo between S,C & D about how Niall & Eric were in cahoots. It soo doesn't stack). I am investigating that one & won't bog down the review with it but in fairness I will change my rating if it turns out that it's not a sloppy, hole filling, plot inconsistency b'c CH didn't have enough material to plan 13 books.  **Edited May 14th. I thought when reading that b'c CH has stated she writes by the seat of her pants, that she was going back to try & fit in plots in places she thought were vague enough, in order to make things work now that she had to stretch the series out. After all, she has made a lot of obvious errors in the past that her readers have caught & called her on. In this book - C&D tell Sookie that Eric had approached Niall to send protection for Sookie, hence Niall calling in Claudine b'c she was withering. The implication being Eric knew who Niall was in connection to Sookie.CH recently stated in April that DR doesn't \"have a word about the history between Niall and Eric, because it's not important to Sookie's story.\" I think those crafty fairies are definitely up to something."}, {"userName": "Sarah (saz101)", "userReviewDate": "Apr 29, 2011", "userURL": "http://www.goodreads.com/user/show/3825460-sarah-saz101", "userReview": "***There are some minor spoilers below... allusions to character's feelings/thoughts/actions that could give some plot points away***Sookie's working her shift in Merlotte's when the bar is firebombed... and it doesn't look like the bomber was human. To make matters worse, an old enemy is out for her blood and the tension between her vampire lover/husband Eric and his progeny Pam with their boss, Victor, is building. The peaceful life Sookie is wishing for seems a distant dream.A new Sookie book is like visiting with old friends. There are so many folks I love in Sookie's world, and it is real treat catching up with them... but it's like a visit with the old gang in more ways than one: it is great catching up with them all, but there's so much going on in their lives, you feel like you didn't spend as much time with them as you would have liked.A few old favourites make significant appearances here: Bubba, Mr Cataliades, Amelia, Bob, Hunter and Alcide show up. Alcide in a funny (and very compromising) way, and it makes me think we might not see Alcide again in a hurry. Bill plays a larger role in Dead Reckoning than he has in a while, and I found myself genuinely liking him (not just feeling sorry for him) for the first time in quite a few books.Eric is obviously in a starring role, and as much as I was rooting for a relationship between the two of them, you begin to see some problems here. Sookie's starting to genuinely consider the real costs of a relationship with him: both him as an individual, and him as a vampire. What's going to happen when she gets older? How can they have a relationship if Eric won't talk to her; not just about his business and problems, but about serious issues that have huge consequences for her? This couple has serious communication problems. She's also really beginning to examine how much violence she can cope with and wants in her life. While Sook struggles with the thought of killing someone, even if that someone is trying to kill her, Eric will snap their neck without a moment's thought--or a pinch remorse. While Sookie understands Eric's character, motivations and actions, she needs someone who will understand her remorse and horror, and comfort her, even if she knows she's not being rational. Eric will never be that person. Sookie also takes a very drastic measure to test her real feels for Eric in this book... and the outcome could destroy a good friendship, as well as putting her in danger. And Eric's been hiding a big secret.Sookie has experienced more personal growth over the course of the series than any character in any other series I can think of. She's a lot more mature, and there's an 'Aha!' moment where she decides she's going to have to prioritise her crises in order to cope (like she feels she's not so much living as rushing from one life-threatening situation to another). She's far more cautious in many areas of her life, but largely in who she chooses to trust. She's beginning to examine what she really wants from life, and I thought it seemed like she was starting to think of herself as leading two separate ones: her normal, human, life in Bon Temp, as a barmaid, a sister, and a friend, throwing her best friend's baby shower; and another, where she's the wife of a powerful vampire, a pawn in political power games, and in constant danger from vampires, weres, faeries, and God-knows-what-else. And more than anything Sookie just craves peace. A quiet, happy life with the people she loves. At one point, she tells Eric she wishes he was a 'normal' vampire: boring, and without the political struggles.Dead Reckoning ends on an ambiguous note, and perhaps creates more questions than answers for the series. While we learn a lot more about Sookie's gran, and her family history, some threads in the story I thought had been neatly tied up are unravelled again (notably, an unexpected twist to do with Bill). What is Sookie going to do with her Grandfather's gift? How will this book effect her relationship with Pam? What about Eric? The Queen of Oklahoma? What the HELL is Claude really up to? It definitely seems as though everything is coming together for a big finale in 2 books' time.The world of the Southern Vampire Mysteries is rich and vibrant--and SO real--and Charlaine Harris has created an intricate web with almost infinite possibilites. I cannot wait to see how see where she takes it next."}, {"userName": "Virginia Ronan ♥ Herondale ♥", "userReviewDate": "Nov 30, 2017", "userURL": "http://www.goodreads.com/user/show/69106439-virginia-ronan-herondale", "userReview": "To say it with a quote from the book:\"I've tried to kill you over and over, and you just won't die!\"I almost felt like apologizing.That's the Sookie Stackhouse series in a nutshell! ;-PI still love it though! XD"}, {"userName": "Anzu The Great Destroyer", "userReviewDate": "Sep 20, 2010", "userURL": "http://www.goodreads.com/user/show/2278800-anzu-the-great-destroyer", "userReview": "Review from ZombieHazard.OMG!!! I’ve been waiting for this book for a year and now it’s finally out!!! It was sooooooo worth the wait!!! Such an amazing book!!! It totally made up for the sh*t that was the previous one!!!Naaaah I’m just kidding. I so much wished I’d say that after reading Dead Reckoning. But guess what? It sucked even more than Dead in the Family. It simply has no purpose of existence.If I could just point out all my problems with this book I’d end up wasting all day writing about it so I’ll just mention the things I think are somewhat relevant. I simply hated it. I’m full of rage because I tried to trick myself into thinking the series will come back to its feet. Nah. The series is dead.Anyways, here comes my complaining.Was it just me or did the plot go on vacation to a sunny beach and left the book hanging around our poor shelves as useless as a pile of dirt? Why was this book totally useless for both the series and my poor raped mind? Also, why am I being bothered by Charlaine Harris' writing style? I mean yeah she makes you feel like you’re reading Sookie’s mind but I don’t know. It didn’t appeal to me. Sookie’s mind is too simple for me to like living in there…I have to admit I started reading this because it’s been sitting on my shelf for a while and True Blood’s running on TV and I’m watching the show and kinda enjoying the season. Seems ok so far. But anyways, I said its time to finally read this. The previous book was a huge pile of sh*t. I really was hoping this one will be different. I can tell the series is going to hell book by book so I was curious to see how many books I have left until I totally give it up. Well guess what? I’m officially giving the series up after Dead Reckoning. So bye bye Sookie Stackhouse, it’s been fun but we must go our separate ways! So leave me the hell alone!!!Excuse me for not wanting to read about Sookie cleaning her attic and selling her junk to an antique shop. I don’t give a sh*t about non-important characters or don’t know who’s baby or Sookie’s hair getting cut by an emo dude. I want a damn good story. I can’t believe this series ended up like this. I know I’m repeating myself but it’s just cruel. This shouldn’t even be printed out!!!Sookie is turning out to be very annoying. Now I’m not saying it because she gets turned on by her cousins, or that everyone’s trying either to kill her or f*ck her. I mean isn’t it strange that so many dudes are after Sookie? Does this woman wear a special perfume that gets guys crazy over her? Is it her boobs that, I quote, should win the Miss America Tit Competition (WTF?!?! Nice going Bill)? Or maybe her milkshake brings all the boys to the yard, and they're like, it’s better than yours. I got bored with people trying to kill Sookie all the time. All the books are about her escaping God knows who because they want her dead for God knows what reason. I wish this book as about something more original.Anyway, back to my point. Why is she annoying? Because she has a nice husband and she treats him like sh*t. Eric already has problems and she adds to them by cutting the bond. Why does she have to complicate things? Probably because their relationship is boring. Was it on purpose? Does Charlaine Harris actually plan to end Sookie and Eric’s “marriage”? I would have expected them to be team-mates, work together, be strong together, but what I see is coldness and boredom. I was excited, like everyone, that they hooked up, then shocked that they got married or whatever, and now they’re just normal dudes who do nothing and just occupy pages for the sake of what? Going on with the series even though it’s dead? Is the TV show making Mrs. Harris write the books just to get more money out of sales? Well yeah it’s a good strategy since fans will want inside scoop, but what about the rest of us? What about the people who actually liked the series and were expecting some good books and good stories to be out? Not good enough for the sale numbers maybe? I think the series should have ended with maximum book nine. At least it would have been a decent exit.Question: are there any good things in this book?I love Pam, she’s the coolest character in the book and also in the show. I have to mention Jessica also for the show, she’s interesting. Bellenos was great, it was a relief that he didn’t lust after Sookie. And Dermot wasn’t bad also.That’s it with the good stuff.As a summary for my reactions after reading the book I will present this rage comic:I don’t know why this change in the Sookie Stackhouse series. Either Mrs. Harris got out of ideas, or maybe it’s True Blood messing with it, but nothing good is coming out anymore. I used to be crazy about the series and it’s kinda sad seeing it end up like trash. Oh well, there are better books out there which are actually worth my time."}, {"userName": "Sarah", "userReviewDate": "Nov 27, 2015", "userURL": "http://www.goodreads.com/user/show/7591340-sarah", "userReview": "[ Victor and Sandra!! (hide spoiler)]"}, {"userName": "Alyssa", "userReviewDate": "Jul 06, 2010", "userURL": "http://www.goodreads.com/user/show/2718225-alyssa", "userReview": "WTH...WTF...Seriously!!!...Speechless...seriously pissed off!\nNo words, other than the few above, can truly describe how disappointed I am with this book and this series. When I re-discovered my love for reading several years ago, this was one of the first series' that I read and I fell in love with. It will continue to hold a special place in my heart but what I fell in love with is just no more. NEVER, in a million years, did I think I would say I'm looking forward to Season 4 of True Blood more than the next book.\nWhat I Liked\nJack & Lily Leeds - their appearance was one of the few excited moments I had while reading. What's worse, I was excited about them & I've never read their books. How sad is that?Bubba - loved that he was brought back in this installment, however, I feel his re-introduction fell a little flat.Pam - we got to see a softer side to Pam with her love interest and I enjoyed that.Sookie - finally stands up for herself in some respects and that was much needed for her. It's time for her to stop letting people walk all over her.\nWhat I Didn't Like...Serious WTF moments\nAlcide - I have several questions on this topic. Why does CH feel the need to make Alcide such an asshole? When he was first introduced, he was a character I really enjoyed reading & felt that he had lots of potential. I just don't understand his character development. Next, why bring him into this book for that un-necessary scene? It served absolutely no purpose, why even bother? Sandra Pelt - Ok, did you run out of people to try and kill Sookie? Why resurrect her of all the past villains? I guess since most of the bad guys in the past are dead, that was the only option. Eric - Eric will forever be on my top ten list of favorite characters, BUT, the past couple of books have made him out to be such a p**sy :/ Thank god for the scene at Fangtasia at the end of the book or I would have sworn he was be-spelled again. Pretty much the whole book - In every book, with the exception of the last two, CH has always had a clearly defined plot. There may have been several smaller plots working at the same time, but, you were able to see progression within the book, as well as, the series itself. This book didn’t offer that at all. Instead we received pieced together scenes that did little to explain what the overall plot even was or was supposed to be.Overall, this was installment left me wanting nothing more than for this series to end. I’ve said it before, I would much rather have fewer books & wonderful stories, over more books & mediocre ones. If we can’t go back to the series of old, for the love of God, put an end to it."}, {"userName": "Veronica Lucero", "userReviewDate": "Dec 02, 2010", "userURL": "http://www.goodreads.com/user/show/4612611-veronica-lucero", "userReview": "Can't wait!!! I'm counting down the days.... I read the whole series in less then 2 weeks when I discovered them and I seriously need this book asap!Well I FINALLY got my copy of this absolutely wonderful book! I couldn't put it down, I'm kinda sad that I finished it so quickly...now I miss the characters all over again! LOL, I am at a lost for words about what went down. I don't know whether I should cry or be happy, the new issue with Sookie and Eric is so heartbreaking (for me at least). Bill has gained some of my trust and love back. Pam...poor, poor Pam, I did cry for her. I'm a bit sad that Jason wasn't in the story much, he had a big role in the end of the previous book. It really struck me as odd that he didn't have a least a bigger role in this book then he actually did. I find myself left with a lot of answered questions from the previous book, but a hell of a lot more now. Now all I have to do it wait for the next book to get those answered. Hopefully Good! All in all a ABSOLUTELY WONDERFULLY AWESOME book!! Now HURRY up Season Four of TRUE BLOOD!!!!"}, {"userName": "Katie Michaels", "userReviewDate": "May 02, 2011", "userURL": "http://www.goodreads.com/user/show/4669344-katie-michaels", "userReview": "Have you ever noticed that every time an enemy of Sookie Stackhouse bites the dust, another is waiting in the wings to make her life miserable? If you think about it, our girl has got a lot of carnage in her wake: from Lorena... to the vamp who killed Hadley... on to Andre and Debbie and Appius Livius. But you cut off the head of one beast and another grows in its place. Our beast du jour for Dead Reckoning is our old pal Victor. He is making life more and more miserable for Eric, and he's an ever-present threat to Sookie.And he's not the only one. Someone has firebombed Merlotte's; some drugged out thugs are sent to snatch Sookie; and that's just the beginning! Sookie has to figure out who is targeting her, while helping Eric come up with a plan to get out from under Victor.Emotions are running high. There's a schism between Eric and Pam, and Sookie knows she has something to do with it. (The basis of their discord, when it's finally revealed, is real kick to the gut!) At the same time, Pam is trying to gain permission to create her first vampire child. And there are major developments in the blood-bond issue between Eric and Sookie.Sookie is coming to see how much she has changed since the supes have come into her life. Much of what she's done has been necessary to her own survival, but she's not sure she likes who she's become. Things are strained between her and Eric. I've been Team-Eric for as long as I can remember, but the cracks are forming. That's an understatement, really. We see what can easily be the mechanism to separate them once and for all. But things are left unresolved. I just wish Harris would just rip the band-aid off already. I've softened towards Bill, though I can't see the two of them ever reconciling --and we even have a surprise appearance from another potential suitor. But when all is said and done, I feel like we're just getting more groundwork laid for Sam as an eventual HEA. Sure, he's got a girlfriend here, but he is now firmly ensconced as Sookie's best friend. I feel like it's just a hop, skip and jump from becoming something more.I can't wrap up without acknowledging that Sookie makes some great new discoveries about her family history. And we finally know where her telepathy comes from. (A fun surprise, I thought.) We have resolution on the main story arc, but the relationship issues are left hanging in a most frustrating way. I just didn't feel like the book was as cohesive as some of the ones that came before it. The best books in the series were obvious in what they were about: whether it was the vampire summit, the evil witches or what-have-you. The weaker ones tend to meander from event to event, or perhaps more accurately... from disaster to disaster, in Sookie's life. Almost 4 stars."}, {"userName": "Cheese", "userReviewDate": "May 09, 2011", "userURL": "http://www.goodreads.com/user/show/1306597-cheese", "userReview": "Sookie, I really, really wanted to give you four stars. Truly, I did. Though we haven't known each other long, I've grown extremely fond of you. Unfortunately, I spent much of this story feeling like this:Fear not, I also have nice things to say, I just wish they outweighed the bad.First, the bad:*It should have been condensed. Now, some of the allure of Sookie, for me, is her amusing internal rambling and watching her try to go about a normal way of life. But not for half of the book!!!!! It felt like so much of this book was filler and made it excruciatingly boring to read until almost the end. Example:Sookie did the laundry.Dermot walks in. Sookie says hi.Sookie goes to Walmart.Sookie comes home and does the dishes.Know what? I don't give a rat's ass. Which brings me to my next point.*There's building suspense, and then there's dangling a juicy carrot in your face and stringing you along for 5 fucking chapters before you're told what the hell is going on. And I'm not talking waiting for the climax, just answers to questions that you've been more than patient waiting for. Or maybe I'm just a demanding ass who can't wait. Could be both. *Too many characters were thrown in for me. As this series progresses, it's like there's always 10 subplots within the plot. Which means characters are introduced quickly and don't show up again/or until way later. And by that point, I kinda recognize the name, but I'm scratching my head trying to remember who the hell they were and what part they played. There's just not enough for you to invest in them, therefore my brain is not making a good mental note of them. *My biggest personal pet peeve with Sookie is her inability to come to terms with her reality. Honey, we're 11 books in now, stop being so shocked. Someone got beheaded? Psh, we saw that like book 1. OMG, she lost a limb! Wait, been there, saw that. You yourself even point out in the climax that of all the bloody, horrific things you are seeing, only one is new to you. I get the upset in the first few books. Now you just need to put on the big girl panties and adjust already. No, it's not nice or pretty, but WE KNOW THAT by now. It's you or them, and you shouldn't feel guilty for defending your life, and the lives of those you love.Now, while I can concede that a trauma is a trauma, she shouldn't still be having this shellshocked reaction. I get being upset, remorseful, even a little horrified, but I do not understand \nsurprise\n at this point!!! By now, we've had plenty of bloody, fight-for-your-life battles. This isn't new for you. Please start responding accordingly. *Sookie pet peeve #2 is her unrealistic expectations of her vampire(or any supe) lovers. While as a woman I can understand the things you want and value in a significant other, I don't think it makes sense to for you to expect just that in something that is not human. Sure, vampires can love, they have feelings, but they still are not HUMAN. Accordingly, you cannot demand the all the same aspects of a human relationship in a relationship with a vampire. I think it bothers me doubly because she is privy to a lot of the ins and outs of the vampire society/hierarchy that a lot of others in the book aren't, so I'd think that would make her more qualified to understand this. And sometimes she does. But for me she still acts too much like this is her first rodeo with a vampire and I find it frustrating. Maybe I'm biased because I've got it bad for Eric. Who could resist this face?? I can't, that's for sure. *Charlaine, pay close attention to this one. It's bad enough that you use, almost verbatim, the same descriptions for multiple things in EVERY book! Even worse, you do it multiple times in a single book. If I have to read Sookie describe what happened to Bubba every time his name graces a page, I will scream. Guess what? I am not a moron, so I understood perfectly well what you meant the first 500 times you described it the last 10 books. It does not bear repeating!!!!!The good stuff:Though the books are kind of predictable in the way that you always know that Sookie and friends will have a problem, but you know that they always save the day, for me the stories have(mostly) stayed refreshing enough. I love how she manages to find trouble right up until the end. Even after you've had the big bloody climax/power struggle, something else always has to happen. And that keeps me entertained. Pam. Pam has to be my favorite character. She makes me laugh every time. I love her dry humor, her random exclamations(\"fuck a zombie!!\"), how even though she's not the most affectionate, it's still obvious she cares, and her unwavering loyalty for those she cares about. I am always excited when she appears. The last quarter of the book was fantastic and had me totally engrossed. I just wish I could say that for the rest of it. Alas, I still will be excited for the next installment and I hope the series will start to redeem itself. In summary:"}, {"userName": "Catie", "userReviewDate": "May 20, 2011", "userURL": "http://www.goodreads.com/user/show/1886642-catie", "userReview": "[who wants to bet me that she uses the c.d. to save Sam in some way? How could I not have known that I LOOOVED you all along?!!! Booo-hoooo…. (hide spoiler)]"}, {"userName": "Richard Derus", "userReviewDate": "Dec 14, 2011", "userURL": "http://www.goodreads.com/user/show/3920693-richard-derus", "userReview": "Rating: 3.8* of fiveThe Publisher Says: There's a reckoning on the way ...Sookie Stackhouse is a cocktail waitress in Bon Temps, Louisiana. It's a job which has its own challenges, but now the vampires and the shapeshifters are finally 'out', you'd think the supernaturals would get on with each other. But nothing is that simple in Bon Temps!... and Sookie has a knack for being in trouble's way; not least when she witnesses the firebombing of Merlotte's, the bar where she works. Since Sam Merlotte is known to be two-natured, suspicion falls immediately on the anti-shifters in the area. Sookie suspects otherwise, but before she can investigate something else - something even more dangerous - comes up.Sookie's lover Eric Northman, and his 'child' Pam are plotting something in secret. Whatever it is, they seem determined to keep Sookie out of it; almost as determined as Sookie is to find out what's going on. She can't sit on the sidelines when both her work and her love life are under threat - but as their plans gradually become clear Sookie finds the situation is deadlier than she could ever have imagined.My Review: Sookie Stackhouse's latest print outing. I'm sure I missed something along the way. Too many givens aren't what my memory offers...well, who knows, I might just be sufferin' from worsening Half-heimer's. It certainly feels that way when one is internetless for long stretches! Facts I gave not a second's thought to, because I could pop online and look 'em up, are all wetware storage reliant. I suspect the little elf who does my mental filing has grown very lazy in these internetty years.Our various dramatis personae are all a-whirl in this outing...how odd, right?...over the Nevada vampire king, Felipe, choosing the reprehensible (even for a vampire) Victor as his Regent. Victor's got his knickers in a knot because he felt he should be King of Louisiana, not just Regent. And, insult to injury, Felipe is separating the Louisiana/Arkansas merger that was effected before the mass deaths two (possibly three) books ago when Sophie-Anne married whatever the King of Arkansas's name was before everyone at the wedding was slaughtered. Felipe chose to keep Eric, Sookie's vampire-rite husband, as Sheriff, the only individual so favored, and thus Victor's gunning (literally and figuratively) for him. Eric, Sookie, and some oddly assorted allies decide that gunnin' for someone is a two-way street after Victor is revealed as the force behind the new vamp club ruining Eric's business, and the roadhouse ruining Sam's beloved Merlotte's, in an unsubtle effort to make Eric come for Victor so Eric can be killed without explanation or expiation.Yeah, good luck with that. And good luck to Eric in his new, unexpected, and possibly Sookie-less life, as arranged by his now-dead maker, very different from the one he has in True Blood.Anyhoo, throw in Claude the hot gay faery/stripper, Dermot the damaged faery uncle, Mr. Cataliades the demon (literally not pejoratively) lawyer, Amelia the renegade witch and her former pussycat Bob, and a return visit from nutball Sandra Pelt, and the corpses stack up to agreeable heights in the accustomed way of Harris's books. As is expected in this series, the ending is another sea-change in the life of the Sookster, not yet brought quite to fruition. If this technique has palled on you, avoid this book.Well, what can one say? I mentioned in the last review that I wasn't at all ready to give up on bookish Bon Temps. This book does nothing to push me in one direction or the other. I liked it, and I was very pleased as always to immerse myself in the supe-filled universe that Sookie inhabits. I suspect that, barring a return to the terrible flatness of the un-fun All Together Dead, I'll read along in the series. I won't be out trolling for converts, though, like I do with Louise Penny's addictive-as-chocolate-coated-nicotine-infused-heroin-enrobed-crack Three Pines mysteries. I don't imagine my non-proselytic stance will harm Mother Harris's rep or bottom line.I'll have to loop back and fill in some details from the book I missed. I suspect I've got the gist from Harris's carefully crafted fill-ins, but some of the fill-ins have left me curious about the full version. (Good job, Mother Harris! I'm tough to inveigle!)And I am amused to note that The Sookie Stackhouse Companion is now available. Really? A concordance? How Biblical. I might not like Sookie's Jesusy thoughts, but isn't this a bit much?\nThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 3.0 Unported License."}, {"userName": "Jilly", "userReviewDate": "Jun 10, 2015", "userURL": "http://www.goodreads.com/user/show/25894509-jilly", "userReview": "You know the expression \"Jumping the Shark\" for a television show that has been on too long and gotten horrible? Well, this book series has definitely been to Sea World on a motorcycle. \nI hope he had this book in his hand...And, although I can be quite a masochist when it comes to finishing a series that I've started, I'm officially done.\ntake that, people who told Charlaine Harris to keep writing when she was obviously out of ideas!Sookie has actually managed to become even more unlikable in this book. I didn't think that was possible, and yet, here it is. I mean, we already knew she was stupid. Even she admits it.\nOkay, I've been stupid in the past. Not consistently stupid, but occasionally stupid.\nUh, no Sookie, you have been consistently stupid.Plus, she is vain, selfish, and delusional. But, she did do one thing right and that was to get together with Eric. Unfortunately for Eric, though, is that she is a really crappy girlfriend. She is rude, argumentative, never understanding or compassionate, and rash. She breaks their blood bond without even talking to him first. It is like the equivalent of going to Mexico for a quickie divorce from your husband and then wondering why his feelings are hurt.\nI should have called Eric and warned him what was about to happen. But I'd been afraid he'd talk me out of it...\nOh, okay then. If you want to do something that you know that your spouse would absolutely be against, just do it behind their back.\nOops, sorry about that. I guess a little \"heads up\" would have been nice.So, even though I waited forever for Sookie and Eric to finally get together, I have to say that I now think that Eric can do a lot better.\nbecause you are a boring f*ck and Eric is a viking god...The only people I will miss in the series:"}, {"userName": "Yui", "userReviewDate": "Nov 28, 2010", "userURL": "http://www.goodreads.com/user/show/3980858-yui", "userReview": "3.5\n It's very tempting to give \nDead Reckoning\n 3stars because I feel it inferior in some ways to past Sookie Stackhouse novels but It isn't fair to grade a book just because I am holding a grudge to events that hasn't even happened in the book yet. So for years of adoration and sheer insanity it stays with 4 stars on first glance ;)WARNING!The following may contain spoilers. Let me just get this quote out of my mind for it's been bugging me ever since I started reading DR....I suffered with you, I hurt with you. I bled with you-not only because we're bonded, but because of the love I have for you.This was spoken by Eric in Dead in the Family. It keeps playing in the back of my mind while and after I read this. It is probably one of the stalest lines I have ever read but I remember the first time I read it in the back of Dead And Gone as a special preview while Sookie's torture is still fresh, I didn't find it corny or flat. It was one of the most emotional moments for me in the series. And even now I still feel more emotion than the actual written words. It served me as a charm throughout this book. The story in this book is divided in two parts. First is the attempt on Sookie's life. I admit I was satisfied and can classify this as a mystery worthy of Sookie Stackhouse but the perpetrator is an old character and is solved halfway thru the book.The second is the threat of Victor. I wasn't satisfied with this one because they have been dancing with him for 4 books now and they still ended up fighting him face to face. They have planned very carefully and in the end it seemed like the sufferings they endured and the time waiting was wasted since they defeated him easily. They even brought two new characters to plan and help but they ended up being useless. One of the characters I like who has a grudge with Victor is Heidi. She is talented and her story is very interesting. Her son was being held like a hostage to ensure her loyalty to Victor and it's a very good angle to work with but her worth was wasted because they focused on the other human who has no special traits and other contribution to offer.It really wasn't a bad read all in all. The writing is good. The story is good. I probably won't be complaining if it's my first C. Harris novel but since I've been following the series for years, it didn't meet my expectations. It might as well have ended up with a big cliff hanger since there have been new mysteries introduced like Sookie's real grandfather Fintan and a new threat to Sookie in life and in matters of the heart but both were left hanging. I feel instead of going forward, the story is going backward. Sookie started second guessing her self and her relationship with Eric isn't going forward.They're married and they share a bond that lets them feel each others emotion but they still don't know each other well. They should have matured in their relationship by now but they are like a new couple on their 3rd date. The endearments Sookie's using honey, honeybun? makes me wince and have goose bumps. Instead of being sweet I feel like it's a sarcasm and been having bad premonitions. *sigh* I didn't feel the passion and warmth Eric used to make me feel whenever he said \"My lover\".Even the supporting characters are backtracking. Bill's back to throwing hints at Sookie which he should not be doing since Sookie's married already in vampire law with his sheriff no less! And everyone has a secret agenda and needs something from Sookie. It's like after years of struggling and coming out with friends in life threatening situations you should have been able to identify by now if not who your enemy is at least who your allies are. But no. It's like the past life savings didn't matter. Every body's plotting.Maybe Harris should wrap this series up and start another one instead of planning another 10 books with this. After 10years she still couldn't commit how many Sookie Stackhouse novels she's planning to write. I always thought this is a good thing because every SS books is long well written story and always bring something new. It's probably not Harris' fault that she spoiled us with the complex plots and many different treats before that the last 2 books feels like an anthology compare to the past 9 books. Maybe I'm just angry because I've been waiting for years for this Victor showdown and in the anticipation I didn't mind how much the price of this book is higher than the previous ones. I thought it's ok since the series has become quite popular and a lot of crappy novels are popping out and I sometimes find it insulting when a crappy book is priced higher than the really good ones but now I think the pricing is absurd. It is still worth a buy and even if a friend lend me a copy I will still pay to get my own definitely. But I could have waited for the original price to go down first..."}, {"userName": "Rubal", "userReviewDate": "May 08, 2011", "userURL": "http://www.goodreads.com/user/show/4241582-rubal", "userReview": "[There’s nothing much that happened in this one.No ‘oh em gee!What will happen now?’ kind of mystery.They kill Victor.They kill Sandra.The blood bond is broken very easily and that shows that Charlaine Harris is not good at planning her books.She brings a twist in a book,regrets it and then has to think of a lame way to get rid of it.Alcide shows up for one scene,Bill is there sometimes.I felt,there were a lot of plot holes.I still haven't figured out who sent Hod and the other guy to kidnap Sookie.It felt contrived,something done to get Bill in the middle of things.Eric is being weaved out of the story gradually.Sookie will end up with Sam IMO. (hide spoiler)]"}, {"userName": "Camille", "userReviewDate": "Jan 24, 2011", "userURL": "http://www.goodreads.com/user/show/4824387-camille", "userReview": "Ok, I'm pissed. I really enjoyed the series up until this point and I really feel like this was simply a contractual obligation. There were some parts that were completely boring and hard to get through. There is so much double talk and all around the subject, that i couldn't get into it. Hell, from the first few pages I noticed that Sookie's voice was changed and it was not in a good way.What happened? The things about the characters that we all grew to love (even if they were evil and unjust) all changed. Eric feeling bad about something that could put him up on the vampire chain of command? Claude being helpful? Bill being so overtly sexual? Alcide (leader of the pack) doing what a fairy and a witch tell him? Who are these people? I want my 12.99 back plus the week it took me to get through this. NOW, i will never know what happens to Sookie because I probably won't read the next book. For shame.I'm going to go back and read the first book and pretend like none of this happened."}, {"userName": "Lighthearted", "userReviewDate": "May 11, 2011", "userURL": "http://www.goodreads.com/user/show/1132923-lighthearted", "userReview": "What is happening to the Sookie Stackhouse series??? At best, the characters were wooden; on occasion, they ventured into poor caricatures of themselves; at the worst, they weren’t even recognizable. In what universe would southern gentleman Bill tell Sookie she has great tits? As he’s declaring his love for her? Ack!As the book continued, it became more and more ridiculous. At one point Sookie is being chased through the woods by an unknown number of assailants—she reaches Bill’s house but because she doesn’t want the assailants to know which direction she went, she takes the time to take off her shoes and clothes, hide them behind bushes, and then wring out her hair so that they won’t be able to follow her drip marks. Really? She also forgets to lock the door behind her. Sure. Bill’s house is the obvious place to run but take off your clothes so they can’t really be certain that you’re there–and then neglect to lock the door. Uh huh. And I’m sorry but having run through a thunderstorm, no amount of hair-wringing is going to leave you drip-free without a towel. If Harris wanted Sookie naked in front of Bill, she should have worked harder to create a more believable scenario. To make a bad scenario worse, instead of thinking “holy crap, I’m trapped in a house, I don’t know who’s after me or why, holy crap!”, Sookie’s thoughts run from “dang it, here I go running to a man for help” to “silly men and their erections—okay, so what if I’m straddling him naked, people are after me” to “those selfish bastards, who do they think they are, leaving all of the lights on in Bill’s house”. Seriously??? And when the bad guys are gone and Bill’s awake, he doesn’t offer to lend her a shirt, pajamas, anything? He gets dressed and she keeps traipsing around in a shawl/tablecloth with an apparently open-weave???The fight scene at Fangtasia was nearly as bad. A vampire’s arm gets lopped off and she makes the best of it by whacking someone else with it? Was I supposed to laugh at this? And Eric may have his selfish tendencies but unless the previous books were a lie, he loves Sookie and would not have chomped on her neck like that, even angry. Speaking of Eric, the sex scene earlier in the book was just wrong—one, it’s not sexy when the characters have as little of an emotional connection as these two do in this book and two, it’s not sexy if you need to place an icepack on your “yahoo place” afterwards.There were so many things I hated about this book that I can’t remember if there was any aspect of it I liked. The only reason that I continued reading is because I’m such a fan of the series—I’m hoping Harris rediscovers her love of the story before she writes the next book and I want to be prepared to read it."}, {"userName": "Carrie", "userReviewDate": "Jan 29, 2011", "userURL": "http://www.goodreads.com/user/show/4814585-carrie", "userReview": "Well I was anxiously awaiting the release of this book, hoping it would redeem the series for me after the last one. Well I regret to say it didn't. Yes, it was better than the last one but it still left me dissatisfied. I'm not sure if it's me who has lost interest in the series or the author (but if you ask me her heart just isn't in it anymore). I miss the bad ass Eric from the earlier books and wish he would come back. I'm tired of all the Sookie drama (seriously how much trouble can one person get into) and I'm over the whole love triangle thing already.So I guess there it is. The book was just ok. At least it was better than the last one but was it good enough to keep me invested in any future books? I really don't think so, I may have to lay the Sookie Stackhouse series to rest."}, {"userName": "Sue Herbert", "userReviewDate": "May 11, 2011", "userURL": "http://www.goodreads.com/user/show/5419377-sue-herbert", "userReview": "Sookie, Sookie, Sookie. Will you make up your mind whether you like vampires or not? I begin to think Sookie Stackhouse is actually not that nice a person. Perhaps I have over exposed myself, having ploughed my way through all the novels so far in short order, but there are elements on Dead Reckoning which feel awfully contrived. If you were being pursued by people in the rain and wanted to hide in a house, would you think of taking off ALL your clothes and dumping them in a bush? I mean how much do damp bra and knickers drip? Nope, not convinced, I felt that was a contrivance to create a situation, for no good reason that I could see other than to satisfy a particular fan base. I heard an interview with Ms Harris and even she could not really explain the reason for this episode. Then there is a Eric situation. I felt the books had what is now known as a 'story arch' in which Sookie was led, despite herself, towards Eric and he, despite himself, to her. This was all rather satisfying. Except that it now appears we may have peaked too soon, come to a climax prematurely and we're now heading downhill toward another conclusion altogether. Which can surely only be an anti climax, especially if Sookie does decide ultimately that what she wants is a nice domestic life, iced tea on the porch and someone to share it with. Looks to me as if she could end up with Sam after all at this rate. I have nothing against Sam, I'd just hoped for something more dramatic as a conclusion after what will be apparently be 13 books in all. Not to mention all that death, blood and destruction (which Sookie now appears to think she dislikes, despite having been co-instigator of the most recent bout)Sookie's attitude to her vampire lovers is inconsistent. She complains that Eric is scary and violent, yet dear lovely Bill kills three humans in defence of Sookie (one of them a relation) in the first book and this is never brought up against him. She complains that Eric is excited by violence and death, but she forgave Bill for having exactly the same reaction after the Dallas incident, when the Church of the New Sun attached the vampires and Bill ran off in pursuit instead of making sure Sookie was OK. She knows full well the fealty a vampire owes to his maker, it led to her break up with Bill, but when the full implications of this hit home, she's somewhat grumpy about it. She never has any consideration for the feelings of the men in her life, it's all about how what they do affects her. Does she really love any of them, or does she just enjoy the sex? I was left feeling that this book is setting us up for a conclusion I am possibly not going to like. I'll read the books anyway, they are a light, easy read and often very enjoyable. I thought I liked Sookie Stackhouse, but the selfishness she is starting to exhibit grates somewhat at the end of Dead Reckoning. Maybe she has to get selfish to protect herself, but the violent world she lives and loves in, was very much of her choosing. I guess if I become depressed I can always go back and read 'Dead to the World' again. Eric fan? Me? How did you guess?"}, {"userName": "Pam Nelson", "userReviewDate": "Jun 21, 2017", "userURL": "http://www.goodreads.com/user/show/15402332-pam-nelson", "userReview": "❤ 4 Dead Reckoning Stars ❤ You know, I love book 10… But this book though it is JAM PACKED full of action.. I am NOT liking where the story line is going. Sigh I feel compelled to keep reading… thought I wished I had stopped at book 10 then my happen existence would stay the same.. But a lass I am a sucker for punishment and I will continue.. I am a little mad at Sookie she freaked out at the end when it was her idea to do what they all did. So why is she all uppity about it. I kinda wanted to be like DUDE.. Grow a pair it had to be done. But she is a girl so growing a pair just doesn’t seem right. Hahah any who… off to book 12.. Wish me luck that I don’t get mad at my iPad. *You don't have to like my review but its 100% my opinion, and I am allowed to have it.*"}, {"userName": "Cat Russell  (Addicted2Heroines)", "userReviewDate": "Nov 13, 2010", "userURL": "http://www.goodreads.com/user/show/4250664-cat-russell-addicted2heroines", "userReview": "[Sandra Pelt (hide spoiler)]"}, {"userName": "Ashley", "userReviewDate": "May 05, 2011", "userURL": "http://www.goodreads.com/user/show/2158779-ashley", "userReview": "I waited a year, telling myself that the worrisome feeling I was left with after Dead in the Family was a one-off sensation. I told myself \"she'll get back in her groove with Dead Reckoning.\" I had it delivered to my Kindle so I didn't even have to fight with book-store staff on release day. I wanted so very, very badly for this book to be a return to the Sookie Stackhouse books of the early series.I wish I could say it met my expectations and then blew me away. But I'd be lying.It's not a BAD book, I'll start there. The dialogue is left wanting, and she recycles a few very key metaphors throughout the story, but her writing wasn't my main complaint. It DID lack the beautiful tension that Charlaine Harris has delivered in the past, and that more than anything was what disappointed me.Dead Reckoning, much like Dead in the Family, feels like filler. In Dead Reckoning I felt as if Harris had gone through the FAQ section of a Sookie fan page and decided to answer a bunch of arbitrary questions, like \"can Sam breed in dog form\" and \"what happened with Amelia and Bob.\" And man, oh, man the secondary characters are crammed into this book in force. From Eric's vampire posse, to Amelia and Bob, to the Merlotte's staff, to Bubba and Alcide. Not many get left behind, but all the interactions felt rushed. The back story with Sookie's grandmother fell flat, and I didn't really buy into the relationship with Sookie and her fairy-kin.And then there was Sookie and Eric. I longed for this couple. PINED for this couple. By the time book 4 rolled around I thought I might combust over the tension. But between this book and the last, they've lost me. Their dialogue was weak and Eric, to be frank, was kind of a turd. And not just in the \"I'm a very old vampire who has important things to do\" way. No. He was just an overbearing, pushy, domineering jerk. And suddenly Bill is back in her life, acting like he's a viable option? Am I the only one who remembered how betrayed she felt?The general feeling I got from the book was that Harris tried to introduce way too much but did too little with it. I wasn't really pulled into the book until almost 40% in when the good old stand-by \"crazy Sandra Pelt\" plot was brought in. The book would have been sensational if it was Sookie and the Leeds's trying to fend off Sandra while Eric and the vamps dealt with Victor.Guess I'll be waiting another year to see if she can bring it back around. I'm sad to say it, but I just want it to end. The series has lost its magic."}, {"userName": "Marie", "userReviewDate": "May 03, 2011", "userURL": "http://www.goodreads.com/user/show/5064994-marie", "userReview": "[ Alright, Sookie is running from baddies (about all she ever does) and she hip-hops her way over to Bill's in the day time 'cause clearly that's going to help. Anyway, she decides THE BEST COURSE OF ACTION IS TO STRIP DOWN BUTT NAKED AND GO COZY UP WITH DEAD-BILL (Also naked). What the hell? Yes, I get the whole must-hide, oh look, Bill's day time hidey hole. That makes sense, but removing all her clothes so she didn't drip? a) wouldn't her hair be wet? And, uhm, dripping? B) And her underwear just happened to be that soaked???? COME ON. If you see some reason this all makes sense other than an excuse to get her naked with Bill, please explain.  (hide spoiler)]"}], "description": "Alternative Cover Edition for : B004UNGQM4With her knack for being in trouble's way, Sookie witnesses the firebombing of Merlotte's, the bar where she works. Since Sam Merlotte is now known to be two-natured, suspicion falls immediately on the anti-shifters in the area. Sookie suspects otherwise, but her attention is divided when she realizes that her lover Eric Northman and his \"child\" Pam are plotting to kill the vampire who is now their master. Gradually, Sookie is drawn into the plot-which is much more complicated than she knows...", "title": "Dead Reckoning\n      \n          (Sookie Stackhouse #11)", "url": "http://www.goodreads.com/book/show/7981206-dead-reckoning", "average": 3.77, "cover": "https://images.gr-assets.com/books/1357679465l/7981206.jpg", "reviews": 6310, "authors": [{"url": "https://www.goodreads.com/author/show/17061.Charlaine_Harris", "name": "Charlaine Harris"}], "type": ["Fantasy", "Paranormal", "Fantasy", "Fiction", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/7981206-dead-reckoning", "http://www.goodreads.com/book/show/9640019-dead-reckoning", "http://www.goodreads.com/book/show/10763935-dead-reckoning", "http://www.goodreads.com/book/show/10901035-dead-reckoning", "http://www.goodreads.com/book/show/10424719-dead-reckoning", "http://www.goodreads.com/book/show/10901034-dead-reckoning", "http://www.goodreads.com/book/show/35272727-dead-reckoning", "http://www.goodreads.com/book/show/301082.Dead_Until_Dark", "http://www.goodreads.com/book/show/140077.Dead_to_the_World", "http://www.goodreads.com/book/show/110494.Living_Dead_in_Dallas", "http://www.goodreads.com/book/show/140082.Club_Dead", "http://www.goodreads.com/book/show/170210.Dead_as_a_Doornail", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/25353286-provenance", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}