{"ratings": 146, "userreviews": [{"userName": "Kristie hunter", "userReviewDate": "Oct 23, 2014", "userURL": "http://www.goodreads.com/user/show/11941174-kristie-hunter", "userReview": "Priceless Masterpiece of Apocalyptic FictionI have read and re-read Eric A Shelman's Dead Hunger series. When l started reading zompoc fiction it was about a year or so after my 21 year old daughter was murdered by a sexual predator. Now, l say this, not for sympathy, but to tell you what this series has meant to me. I would lie in bed reading zompoc books, depressed and not feeling like l would ever get through this pain. I read the Dead Hunger series and felt like his characters were like family. I was invested and felt like l was there with this group. It made me happy, scared, sad, and at times jubilant. I am re-reading the series again and l can't say l will ever be the person l was before this, because like Gem, Flex, Hemp, Charlie, Trina, Taylor, Doc Scofield, Nelson, Rachel, Dave, Serena, Uncle Bug, Isis, Flexy Jr and Max, I'm a new normal. That is what this series helped me to see. The characters are so relatable that I could see my tragedy in a relatable way. They can't cure the apocalypse or go back to who or what they were. Just embrace a new normal with scars and pain with those you love. So, to me the characters are more than fictional, they're like friends that I keep returning to visit."}, {"userName": "Amanda Felix", "userReviewDate": "Feb 23, 2014", "userURL": "http://www.goodreads.com/user/show/17820136-amanda-felix", "userReview": "Masterfully written as Eric Shelman gives the major characters voice allowing the reader a unique look at each individuals point of view in their quest for a safe haven. The stakes are higher, if that's possible in this final (hopefully not!) book of the Dead Hunger series. But who would believe a greater threat that could devastate that which survives is around the corner. In Flex and Gem's case it arrives at their doorstep. Dave and Serena, along with Nelson have returned from California bringing with them Rachel, Lola, Dave's uncle Bug and his daughter Isis. They've managed to overcome so much in such a short time that the horror of what comes next is so unexpected. Compounding the problem is Isis who is unfortunately drawing every pregnant red-eyed female Zombie within a couple of hundred miles and they never come alone! Charlie is about to give birth and Hemp finds himself as helpless as any father to be as a monster storm approaches. Flex must leave Gem and his son to desperately seek help for what is sure to be a devastating end to any child born into this new world, his son at the forefront and zombies are at the gate! The tension mounts as the storm draws near and nothing will stop the Red-Eyes who have only one thought in their quasi intelligent minds...Isis. Flex will join forces with another in his quest, Hemp and company are fighting for survival as the zombies and storm close in and the race is on as to who will get to the finish line first."}, {"userName": "Jessica", "userReviewDate": "Jan 13, 2014", "userURL": "http://www.goodreads.com/user/show/6678507-jessica", "userReview": "Hell yes!I seriously cannot begin to describe. how amazing this book was.....I mean I really loved it. there were parts in this book where I couldn't put it down when I needed to go back to work. I just didn't want it. I just wanted to keep reading.I kinda threw a mind tantrum.....I cannot wait for book 7"}, {"userName": "Cathy Harris", "userReviewDate": "Feb 08, 2014", "userURL": "http://www.goodreads.com/user/show/14105987-cathy-harris", "userReview": "AmazingSeriously enjoyed this series. This one, (The Gathering Storm) was just as good as the first five.. I am looking forward to seeing what the new world has in store for Isis and family."}, {"userName": "Laurie Mault", "userReviewDate": "Apr 04, 2014", "userURL": "http://www.goodreads.com/user/show/21523486-laurie-mault", "userReview": "Awesome as always! Waiting patiently for the next book in the series."}, {"userName": "Gerald", "userReviewDate": "Jan 13, 2014", "userURL": "http://www.goodreads.com/user/show/9086717-gerald", "userReview": "I highly recommend the Dead Hunger series. The story gets better with each book."}, {"userName": "Jessica Bakaitis", "userReviewDate": "Jan 12, 2014", "userURL": "http://www.goodreads.com/user/show/7615445-jessica-bakaitis", "userReview": "LOVED! My favorite in the series I think. Crazy, crazy action fromi the z ombies and mother nature."}, {"userName": "Suzy", "userReviewDate": "Mar 03, 2018", "userURL": "http://www.goodreads.com/user/show/2172365-suzy", "userReview": "I devoured this book and still hunger for more!I have read many, many, many- Post Apocalyptic/Zombie Apocalypse stories -99% of them being in a series- though some only having 3-5 books, others in the 10+ range. My love for long, Post-Apocalyptic Zombie/Infection series is what drew me to the Dead Hunger series. Every book in this series is amazing, always holding my attention and making me fall in love the characters! I don’t always fall in love with characters right away, but with Dead Hunger, I did. What sets the Dead Hunger series apart from many others is that while it does use science and logic -a great deal at that- it also has a supernatural aspect that adds to the mystery and charm...and even the fear of the unknown. What I find very unique and fascinating about it is that by using a combination of science and science fiction (paranormal) the Mr. Shelman is able to make the events in the story seem eerily plausible. As fantastical and intricate as it is, the world is presented to the reader at a pace that is easily digested -and unlike other stories which use a supernatural aspect- it leads the reader to believe that it might actually be possible for the world to succumb to a fate as described in the stories. Even 6 books in, we the readers are STILL learning about everything as it happens, as if we are right there with the survivors, learning, loving, losing -everything they feel, we feel just as deeply. Needless to say, I am really enjoying this ride, even though I have to check my pulse constantly, wondering if my heart can take the constant pounding. If you like stories that keep you captivated and enthralled, this one is for you. If you want something safe and boring, steer clear because it’s nowhere near safe, or boring."}, {"userName": "Billie Lang", "userReviewDate": "Jul 08, 2017", "userURL": "http://www.goodreads.com/user/show/16948525-billie-lang", "userReview": "ExcitingLoved this installment, especially being from the Carolinas, and familiar with hurricanes. Great description. Well written, as usual. Nervous about the introduction of new character, but think I'm gonna like Punch. The only issue I had was because it wasn't in chronicle form, when a chapter switched back from Flex, to Whitmire, I had to take a second to figure out who was telling the story. But, absolutely loved it, and getting ready to read the next one."}, {"userName": "Alina", "userReviewDate": "Dec 11, 2014", "userURL": "http://www.goodreads.com/user/show/31927139-alina", "userReview": "What a great story! If you are already a fan of Dead Hunger than i dont need to explain very much, because you already feel like you are a part of the family.***SPOILER**** You actually care for Gem, Flex, Charlie, Hemp, the Girls, the Dogs, even for Nelson and his chick Rachel. In this Episode our beloved family members from btw the pages are hit by a gigantic storm and at the same time , they become a point of interest for the zombies, especially the red eyed mothers. And if you think that this is not enough, a very human drama takes place, the kids are infected with diphtherya, and a contra clock race for getting the Antitoxin beggins. If you know Eric A Shelmans work, i can only say that you wont be dissapointed, if you just pick that book up because you really like the colors of the cover and the biohazard sign, welll, good for you, because now you are hoocked and will feel a urge to read all the other books from the Dead Hunger series.Believe me, the day wen i decided to give this Shelman guys books a shot, was a great day, and i made a fab decission. More Spoiler**** Isis, omg, what can i say about Isis ? We meet Isis in DH V, but around this book her abilityes tend to gett even better noticed, she is a zombie magnet, the mothers just want her because they do feel that she is there unborn Baby... She can show them there kids, you have to read it. I hope the author does not mind if i will compare the baby Isis that is far beyond her age, can talk, has the power to see what happens in the world to Frank Herberts Alya. Alya , the child that in her mothers womb undertook the change, well, same happens to Isis, the baby that still unborn was exposed to the red vapor. She is unique, and she is a litle creepy, but still, fascinating, i cant wait to read the next book"}, {"userName": "Julie Greig", "userReviewDate": "Aug 26, 2014", "userURL": "http://www.goodreads.com/user/show/31928904-julie-greig", "userReview": "In this book we find the band of travellers return home with a few additional members.They have to deal with mundane earthly problems that are no less dangerous and lethal to our friends than the hungerers and the mothers.Once again Eric delivers. It's got everything you can want in a novel. Heart, guts and glory. The characters, both old and new battle to not only stay alive but to maintain their essence, their very humanity in this book. Its heart warming and will make you smile, laugh out loud and actually feel that the human race just might have a chance.Go buy these books - buy the box set I to V, see it's that easy. It does not even cost 1 cent / 1 pence per page. How is that for value for money."}, {"userName": "Thomas Jr.", "userReviewDate": "Jul 19, 2014", "userURL": "http://www.goodreads.com/user/show/33188782-thomas-jr", "userReview": "The Gathering Storm was another amazing entry into the Dead Hunger series. Shelman's ability to run with so many different characters and keep things flowing and interesting is a rare gift. With each book I've grown rather attached to the characters. Each book, the plight set before the characters, the sense of family all resonates strongly and helps carry the books. I've never once been bored with this series from the start and am very happy to say The Gathering Storm continued that trend. I loved the fact the chronicles were told from both Flex and Gem's perspectives, it broke things up and added an interesting twist as it bounced back and forth. As always, plenty of action, laughs and intensity.Very interested to see where the story goes from here."}, {"userName": "R Martine", "userReviewDate": "Aug 27, 2014", "userURL": "http://www.goodreads.com/user/show/34351519-r-martine", "userReview": "A storm gathers on the horizon outside, and a storm rages in the hearts of the others. Can they get through this latest battle? Is this the end? Can they make it?? I don't want to give any spoilers, but I had no cuticles left by the last page. I think I read this in less then 48 hours, every time I reached the end of the chapter it was like I would start to twitch if I put the book down too long. This book is gripping, Intense, fast paced, and emotionally its a heck of a roller coaster... They only get better and better.... This did not disappoint, if anything I was bummed it was over :( MORE DEAD HUNGER!!!!!"}, {"userName": "Giles Batchelor", "userReviewDate": "Aug 29, 2014", "userURL": "http://www.goodreads.com/user/show/34441611-giles-batchelor", "userReview": "This author really doesn't like to let his characters chill out or have 5 minutes breathing space. No sooner, have Dave, Bug and co made it back from California than a frenetic series of event's occur, throwing them from frying pan, to fire, to zombies. There is just no let up, in the action they whole way through the book. It is as others in the series well written, with great characters and interesting descriptive scenes.really enjoyed it, looking forward to more."}, {"userName": "Charlotte Ray", "userReviewDate": "Aug 15, 2015", "userURL": "http://www.goodreads.com/user/show/44009528-charlotte-ray", "userReview": "I am a voracious reader of Z Books. Eric A. Sherman is as good as it gets. The characters of Mr. Shelman's books in this series are also as good as it getsgets. Read them! You will love every breathless moment of these well written books. I will read every word he has written from now on."}, {"userName": "Malik", "userReviewDate": "Feb 22, 2014", "userURL": "http://www.goodreads.com/user/show/10526561-malik", "userReview": "Awesomethis series is awesome! if u ended it right now I wouldn't be mad at all because there are no perfect endings this was perfect but since u plan on moving forward I'm excited to see what's next!"}, {"userName": "Shannon Sharpe", "userReviewDate": "May 27, 2014", "userURL": "http://www.goodreads.com/user/show/13756704-shannon-sharpe", "userReview": "I am lucky to have been able to read these back to back...This story does not get old in any way and the more I read the more I am anxious to slow down and delay the inevitable...the end. Max and Isis' stories are going to be Epic and cannot wait! Keep up the GREAT work!!"}, {"userName": "Karen", "userReviewDate": "Oct 07, 2015", "userURL": "http://www.goodreads.com/user/show/37164885-karen", "userReview": "my reviews are crap, this book is not. don't read my review, go read this book, and if you haven't - go to the beginning of the series and read those first!!"}, {"userName": "Michelle", "userReviewDate": "Jul 22, 2014", "userURL": "http://www.goodreads.com/user/show/8822512-michelle", "userReview": "AddictiveThis is a very good series, interesting characters, dialogue, and I never wondered when it was going to end. I will be on the lookout for more from this author."}, {"userName": "Karen Mccollin", "userReviewDate": "Feb 16, 2014", "userURL": "http://www.goodreads.com/user/show/9236004-karen-mccollin", "userReview": "it was a great read I really enjoy this book I wish the journey back to the house was mention but other than that it was great"}], "description": "A Storm Is Brewing . . . Some of our old friends have returned home safely, to be with the ones they love and trust. Even as their warm greetings of welcome are offered, another threat builds on the horizon. It enters their home in the form of a little girl. What the child visitor carries within her is an adversary as single-minded and deadly as the zombie hordes themselves. It is known to have existed over 350 years, and it takes life without consideration of age or innocence. At the same time, another female child, unable to quell her siren call, beckons the Mothers. They, in turn, gather the Hungerers to follow. Join our family of survivors once again, and prepare to brace yourself against the coming onslaught.", "title": "Dead Hunger VI: The Gathering Storm\n      \n          (Dead Hunger #6)", "url": "http://www.goodreads.com/book/show/20514367-dead-hunger-vi", "average": 4.67, "cover": "https://images.gr-assets.com/books/1389482396l/20514367.jpg", "reviews": 21, "authors": [{"url": "https://www.goodreads.com/author/show/350507.Eric_A_Shelman", "name": "Eric A. Shelman"}], "type": ["Horror", "Horror"], "outlinks": ["http://www.goodreads.com/book/show/20514367-dead-hunger-vi", "http://www.goodreads.com/book/show/12799616-dead-hunger", "http://www.goodreads.com/book/show/651622.Out_of_the_Darkness", "http://www.goodreads.com/book/show/13508580-dead-hunger-ii", "http://www.goodreads.com/book/show/25876391-scabs", "http://www.goodreads.com/book/show/22732368-dead-hunger-vii"]}