{"ratings": 737, "userreviews": [{"userName": "Elaine", "userReviewDate": "Nov 14, 2014", "userURL": "http://www.goodreads.com/user/show/13060256-elaine", "userReview": "This is probably one of the scariest crime thrillers I have read in a long while. Set in the Lake District, DS Mark (Heck) Heckenburg is living the quiet life, that is until “The Stranger” returns. But that can’t be possible, because 10 years ago “The Stranger” was supposedly shot and killed, although no body was ever found. Did he survive a shot in the chest or is this a copycat killer?I loved the setting of November in the Lakes. What is beautiful in the summer can be challenging in the winter and when the weather turns to dense fog, deadly if you don’t know what you are doing. I loved the way the author brought his setting to life – his descriptions of the weather and fells really gave me a feeling of claustrophobia and just felt so eerie and creepy – the thought of not being able to see more than a foot in front of your face because of the fog, in dangerous walking conditions with the added burden of a serial killer on the loose just made me shudder.The killings themselves are savage and brutal and I really liked the way that we got to know the victims before they died. It made the victims feel more “real” to read about. In general, I liked most of the characters. They seemed to behave in a believable way and the dialogue between them all felt natural. Can Mark, with his limited manpower and resources, keep the community safe as well as hunt the killer down? It is a story that twists and turns, which constantly keeps you guessing as to who the killer is and what the killer is up to. I was gripped by the read and found it really hard to put down. Thanks to the publisher for the review copy."}, {"userName": "Maxine (Booklover Catlady)", "userReviewDate": "Sep 19, 2014", "userURL": "http://www.goodreads.com/user/show/22943325-maxine-booklover-catlady", "userReview": "This book kicked off with a very promising couple of chapters as we were given a glimpse into an exciting undercover operation to catch the vicious serial killer known as \"The Stranger\" currently enjoying killing couples who are partaking in \"dogging\" activities in isolated places. Great! I was really into it but then.....It all started to go horribly wrong for me. This is the second Paul Finch novel I could not take to, or believe for that matter, more on that in a moment. But first, the synopsis to put you in the picture.Beware the stranger in the night…Consigned to a remote valley in the Lake District, DS Mark ‘Heck’ Heckenburg is getting used to a quieter life – a far cry from the bloodbath of his former division, the Serial Crimes Unit. But wherever Heck goes, trouble is never far behind.Unknown to Heck, ‘The Stranger’ has returned. Last seen on Dartmoor ten years earlier, this prolific serial killer has found a new home. As a dense, frozen mist descends on the Lakes, The Stranger returns to his old ways, starting with two young women lost high on the hills. Only one girl is ever found – barely alive – but able to confirm Heck’s worst fears.As The Stranger lays siege to the remote community, Heck helplessly watches as the killer plays his cruel game, letting off his trademark call before viciously picking off his victims.So Heck is in this small town, like the type of town where everybody knows everybody, with one tiny police station and a couple of coppers including Heck present. It's the back of beyond. I suffered through chapter after chapter of descriptions at minute level of scenery (boring), people, who they were, what they looked like (boring) and their activities (boring). There is a theme here. Welcome to Boredom, a small place on the edge of Dartmoor.I hung in there, hoping for something good to happen soon. When two lost hikers, young women are lost on the moors in a pea-souper of fog where they can't see their own hands in front of their faces and \"The Stranger\" is after them I was getting excited. And it was good for a while but then again it fizzled.This book is waaaay too long in my opinion, it's filled with words and paragraphs that don't enhance the plot but divert you away from it almost as you struggle to retain all the information of what is going on. Sure there are a few more gory and horrific kill scenes but there was so much other stuff that was just not even realistic.By a third of the book I was so shocked at how unrealistic the plot was getting, it was off on a tangent and very difficult to believe, we were off in fantasy land somewhere. Scenes that just made me frustrated as no sane person would do the things the plot told them to do. So many out there incidents that really took a lot of credibility away. By the time the whole little village was under siege I was over this book, it went from really good to totally ridiculous from start to finish. Why? Why they choice of plot line? By the time \"The Stranger\" was revealed I was just at my wits end, what a stupid person to be the killer, it just didn't shock me or sit right at all. It was just weird.I read crime a lot, I have read great crime fiction this year, I think the imagination of the author ran off in uncontrolled directions with this one. TOO many scenes that are drawn out beyond belief so it doesn't have the tension it needs. TOO many unrealistic scenes and characters doing things that make no sense. So much promise, what a waste. Again, I am in the minority, other have loved this book. But I know my crime genre and there are MUCH better books to read this year. As I said this is my second Paul Finch book read, that's two novels I have not liked, one short story read that I found average, I won't be revisiting this author in my lifetime. Sorry. 2 stars, it was okay, very okay. That's all I can say really.I received a copy of this novel thanks to the publisher via NetGalley in exchange for an honest review."}, {"userName": "Paul", "userReviewDate": "Nov 23, 2014", "userURL": "http://www.goodreads.com/user/show/11410830-paul", "userReview": "Dead Man Walking - #HookedonHeckDS Mark Heckenburg is back again in exile from London and the Met to the sleepy backwaters of Cumbria and the village police station. Nothing exciting here no murders no violent offenders to worry about other than what to do all day a real change from London. In Dead Man Walking Heck is back as lovable as ever, attracting trouble like a fly round s*~t he is still a born survive with the capacity to out live whatever the job throws at him.Paul Finch never holds back with the violence or the twists in his previous writings and once again he delivers all but hellfire up on Heck but I am sure that will appear eventually. Dead Man Walking sees the bodies pile up in the fog but does it a breathtaking pace ticking all the boxes you want from a thriller. At no point is the perpetrator of mayhem and murder telegraphed so you can work it out from early in the novel you only find out at the end and then it is through a twist. Once again with Dead Man Walking Paul Finch has delivered another absolute stunning thriller proving that he is up with the best of British crime writing.DS Mark Heckenburg is up in Cumbria having transfer out of the Met after a bust up the Detective Superintendant Gemma Piper, his one time love and his line manager. He is up in the Langdale Pikes protecting the people of the hamlets of Cragwood Keld and Cragwood Ho the only detective for miles around along with PC Mary-Ellen O’Rourke.Two city girls get lost on the Tors in the fog as they go hiking Heck and M-E get the police launch out to search the outer banks of the lake when they discover one of the girls a live if only just. The fog is down and around the whole of the area and the recovery and transfer has to be done by road to hospital. When Heck is able to interview the surviving girl she tells him what happened but for Heck it had reminders of an unsolved case from ten years prior that made Gemma Piper’s career The Stranger murders. Heck informs Piper there may be links to that old case and she makes her way north.With the hamlets in lockdown the murderer is out in the fog having their fun at the expense of the villagers. As Heck and Piper tramp over hill and dale in the desperate attempt to bring the offender to justice they become targets too. They are getting shot at every move they make is being anticipated and as they move from a farm towards the hamlets they find dead villagers who have met a very grisley end. Heck and Piper are up beat at first in their belief that other officers will come to their aid as they have asked for back up and it is not until the discovery of dead colleagues they understand that they really are on their own. Somehow they need to evacuate the remaining residents keeping them alive while trying to find and arrest the person responsible for all the mayhem and death around them.Dead Man Walking is a brilliant addition to the DS Heckenburg series of thrillers and the more you read the more you want from the books. Heck is our very own superhero who seems to survive whatever is thrown at him. You will not be able to put this book down and once finished you will want the sequel now not next year. Paul Finch’s writing draws you in like heroin and gets you hooked on Heck and you will want that next fix."}, {"userName": "Vicki - I Love Reading", "userReviewDate": "Apr 21, 2018", "userURL": "http://www.goodreads.com/user/show/1919965-vicki---i-love-reading", "userReview": "Book 4 in the DS Mark Heckenburg series. I hadn't actually realised that I was so far behind with this series. After finishing this book I also realised I hadn't read books 1 & 2. That said, it didn't take away any enjoyment I had of the book. So i would say it can be read as a stand alone. I just don't think books should be read out of order, and i'm annoyed with myself. Heck is working as part of a village police force, a small village in Cumbria. It's a big change to his days in The Met, in London. A lot quieter of a life. That is until two back packers go missing. When Heck gets involved he can see similarities to another case he worked. Is it his mind working overtime or could there be a link. This was an enjoyable read. I look forward to reading many more."}, {"userName": "Best Crime Books & More", "userReviewDate": "Sep 22, 2014", "userURL": "http://www.goodreads.com/user/show/10323950-best-crime-books-more", "userReview": "I was feeling rather lucky as I got started on the new Heck more than 2 months before publication, however after a few chapters I put it down. What was going on? Heck had relocated to the arse end of nowhere and frankly I was bored. I felt like I had so much description with regards to the area of Cragwood Vale and the local villagers I wondered if the book was even written by Finch! However, it appears Mr Finch had his reasons for this, and as usual they were absolutely correct...more on that later!Heck seems to be on some sort of mission to extract himself from his friends and colleagues so has taken himself to a very remote village in the Lake District. You almost get the feeling that Heck doesn’t quite know what to do with himself. He has now distanced himself from his old boss Gemma Piper and other colleagues and instead has a new partner Mary-Ellen O’Rourke. There is also the landlady of the local village pub Hazel as well as some other locals who start to make an appearance.The prologue was an insight into an old case where a killer known as The Stranger appears and it involved Gemma Piper back when she was starting out her career. Before long we realise that there is a killer on the loose who seems remarkably like The Stranger and it gives Heck enough leverage place a to call to Gemma. I was thankful; she re-appeared as I felt like Heck needed her back in his life as he seemed so off kilter.As usual with a Finch novel, as soon as Gemma re-appears the story starts to ratchet up in tension. With two young girls out hiking and lost, anything could have happened. As soon as Heck, Gemma and Mary-Ellen start to investigate it seems like all hell breaks loose. The second half of the book is where all the action happens and if you heart can take it the last quarter is positively heart stopping.Depending on the type of reader you are, if you are like me and absorb everything your mind creates your own idea of a place based on the author’s description. This is where it all started to make sense. Paul Finch had spent some time detailing the area and the sheer beauty of it. However throw in some bad weather and you have the perfect setting (in my head) for a fantastic horror movie. Because of this, the last section of the book had me bloody petrified as we see Heck do his usual ‘playing with death’.I was really unsure at the start of this book, however after the halfway point I didn’t want to put it down and had to keep reading. It was also a book that had my nerves shot to hell! I thoroughly enjoyed it, but sincerely hope we see Heck move away from this area as I don’t think it suits him. This latest book had a different feel to it compared to the others, but certainly didn’t make it any less enjoyable. As always I am left waiting with baited breath to see what is next for Heck and cannot wait!"}, {"userName": "Book Addict Shaun", "userReviewDate": "Nov 10, 2014", "userURL": "http://www.goodreads.com/user/show/7403283-book-addict-shaun", "userReview": "4.5I cannot tell you how excited I was to start this book, especially after receiving a proof copy in the most ingenious way. I held off on getting a NetGalley copy for weeks because I knew a very exciting parcel was coming. After finishing \nThe Killing Club\n in May, Paul Finch shot right into my top five crime authors, it was just a fantastic book. Expectations were insanely high for Dead Man Walking then, and despite two books in one year being something of a treat, does the quality suffer because of it? Dead Man Walking is marginally different to Paul's previous work, and I can definitely see it being a bit of a Marmite book amongst crime fans. For those new to his work, I'd start at the beginning with Stalkers and work through the series. I was thrilled to be back in the company of DS Mark 'Heck' Heckenburg, one of my favourite fictional detectives. His recent relocation to Cumbria has found him out of his comfort zone, his only excitement coming from attempting to apprehend some small-time thieves, not the sort of criminals he is usually tasked with capturing. The book's opening felt very much like a horror story, and played out like a horror film in my head, and this is something Paul does incredibly well. An author who can make you feel genuine terror just from words on a page is very exciting indeed. The opening was haunting, with its eery setting as we are taken back ten years to learn more about The Stranger, who is described as a weird sex-murderer, who started off attacking people after dark before targeting lovers' lanes and dogging spots across Devon, leaving no living witnesses. Two young police officers set out to apprehend The Stranger and almost succeed as the female officer puts a bullet into him before he vanishes, presumed dead. The female officer is none other than Heck's ex-boss and former lover, Gemma Piper who after all her comments about Heck's impulsiveness and insubordination, comes across a little bit like a female Heck in these opening scenes. Back in the present day and The Stranger appears to be back and killing again, striking terror into a quiet and isolated community.\n\n\n\n\nI found the opening of the book to be a little slow, and description heavy. Paul usually delivers an exciting, fast paced opening to his books getting you straight into the action but here, given the change in setting there was an awful lot of scene building and at times unnecessary description, it was only later in the novel I fully appreciated the time Paul spent doing this. It's clear that he knows the setting he's talking about, and has researched it really well, it was just that I wanted the story to pick up quicker than it did. That said though the latter half of the book was the Paul that I know and love and the book very quickly becomes hard to put down as The Stranger picks up the pace and the killings escalate, and the villagers soon find themselves in mortal danger. Paul never fails to come up with some absolutely gruesome and brutal descriptions for the crimes that his villains commit, and the villains themselves are always brilliantly evil and at times terrifying, and this is something that I really love. To compare I would say his scenes are at times reminiscent of Chris Carter, probably the best crime author writing today. I want my crime fiction to be as bloody and brutal as possible, and we definitely get that here.\n\n\n\n\nThe atmosphere created by Paul is some of the best I've read in crime fiction this year. The setting is only terrifying because of the time of year and the terrible weather, this is a place that in Summer would be beautiful and full of holidaymakers and walkers, but which in off season is almost perfect for what has been created here. Given this change in setting, and the danger that the residents face the book is very unpredictable, I had no idea for the most part where the story was going to go, or who the next victim was going to be and it made the book more thrilling. In terms of twists there's plenty in this book, not least the revelations surrounding The Stranger. I'm still not sure how I feel about these revelations, whether it was silly or pure brilliance. As I said this is going to be a Marmite book and what some people love, others won't. That said though I didn't see the plot twists coming so that's testament to Paul's ability to keep his readers on their toes. Gemma Piper plays a little bit of a starring role in this book as Heck contacts her about the return of The Stranger and she makes her way to Cumbria. The tension and chemistry between the two is electric, and it makes for fantastic reading. Both are such well developed, interesting and realistic characters and they are two of my favourites in crime fiction. I would love for Paul to write a story about their earlier days, so we can learn more about them with more detailed information than the brief flashbacks we've been given so far. The change in setting also allowed for a change in how the police act and behave. Given that there's no police station as such, or even many police for that matter, most of the action takes place in the field, away from the office environment you usually get where teams can analyse and plan the investigation, Heck has to think on his feet, sometimes acting first and thinking later, having to make instant decisions and this makes for a more exciting read than your everyday police procedural does. Overall then a fairly solid read which held my interest throughout, in places gripping, in others a little slow but for the most part a very enjoyable story which has left me wanting more. Taking Heck out of his comfort zone was a nice change, and made for a very atmospheric and at times scary read but next time around I'd love to see Heck back where he belongs and for his relationship, both work and personal, with Gemma to be explored further. Both are brilliant characters who those yet to discover must do so right away. I definitely reccommend this book to crime fans. Thanks to the publisher for the review copy and the incredibly exciting package it came in!"}, {"userName": "Elaine Tomasso", "userReviewDate": "Apr 11, 2017", "userURL": "http://www.goodreads.com/user/show/49861138-elaine-tomasso", "userReview": "Two young girls get lost and then attacked in the Lake District. One survives and mentions the attacker whistles Strangers In The Night. This leads Heck, who has transferred to the Lake District, to contact Gemma Piper, who shot a serial predator known as The Stranger 10 years ago in a sting operation. The case was closed as he was believed to be dead but no body was found and now he's back. That's the basic plot but as series will know this is only the beginning as the bodies pile up and Heck and Gemma get involved in some serious action. Initially I thought Mr Finch was going for a change of direction with more psychological than physical action as his descriptions of the the Lakelands in the deep fog are genuinely scary - I lived every minute of their walk with Jane and Tara (the 2 missing girls) and then with the others as they faced the fog alone. Brilliant, just amazing - but you can't keep a good man down so, soon enough, Heck is back in full Boy's Own mode - dicing with death, saving lives and capturing the perpetrator. Obviously, the plot is ludicrous but it's a very good, high octane read which kept me on tenterhooks the whole way through. I think this is the best book in the series so far as Mr Finch has added an extra dimension with the foggy atmosphere - you really feel it and the characters's fear. This is one of the best books I have read this year for thrills and spills and I wholeheartedly recommend it as great escapist fun."}, {"userName": "Willemijn", "userReviewDate": "May 20, 2018", "userURL": "http://www.goodreads.com/user/show/43752895-willemijn", "userReview": "One of the creepiest books I’ve read in quite a while. However, it was a bit too obvious to me which character the writer wants you to think is the bad guy, which meant that I knew it had to be someone else. As such, I’m not sure what to think of the ending. Maybe I was expecting more of a surprise there, although in a way, it was a surprise. That said, it’s definitely worth reading for anyone who likes thrillers."}, {"userName": "Sandy", "userReviewDate": "Oct 03, 2014", "userURL": "http://www.goodreads.com/user/show/24770184-sandy", "userReview": "(May contain spoilers)This book should come with a caution: In case of pre-existing heart condition, please check with your physician before opening.Heck is back. That would be DS Mark \"Heck\" Heckenburg, a man with a gift for attracting trouble even when posted to a sleepy rural village. After the fallout from his last case (\"The Killing Club\"), Heck was banished to the Lake District. Ostensibly it's as part of Scotland Yard's Antil Rural crime Initiative. In reality, it's punishment meted out by Superintendent Gemma Piper, his old boss. They have a long history but Piper has finally had it with his tendency to colour outside the lines. Now stationed in Craigwood Keld, Heck's days are spent covering miles of sparsely populated fens & mountains. The one bonus is the Witch's Kettle, a local pub popular for 2 reasons. It's the only one in town & it's run by the lovely Hazel Carter.His \"staff\" consists of PC Mary-Ellen (ME) O'Rourke, a feisty young woman with limitless energy. She's eager to learn but with most calls being of the search & rescue variety, Heck fears for her education. That's about to change.It begins with 2 missing hikers. The weather in early November is unpredictable & a thick fog has descended, reducing visibility to zero. Heck & ME's search is hampered by treacherous conditions but they find one of the young women, battered & barely alive.She tells a chilling story of being stalked & attacked by a faceless stranger. One detail stands out...he was whistling \"Strangers in the Night\".This gets Heck's attention. Ten years ago, Piper was part of a team that trapped a sadistic killer known as the Stranger. She shot him & barely escaped but his body was never found. Heck hasn't spoken to Piper since his transfer & she's reluctant to believe there's a connection. It was the case that started her meteoric rise through the ranks. It was also the beginning of the end of her relationship with Heck. But privately she has always wondered if the Stranger is still out there.It's an old ghost she can't shake & Piper surprises Heck by travelling to the area. She'll be one of the last to make it as the weather settles in, cutting off cell service & closing the roads.What happens next makes for a full on thriller.The tiny hamlet is soon at the mercy of a killer who is smart, cruel & always one step ahead. Heck & Co. have few resources & their isolation creates a plot similar to a closed room mystery. This is a creepy, atmospheric read. The author's descriptions of rugged landscape shrouded in fog lend a claustrophobic feel to the setting. The sense of menace is pervasive & it's easy to relate to the paralyzing fear of the villagers. They're an odd assortment but the story belongs to Heck, ME & Piper.This is book #4 & Heck is a well established character. He's a conscientious, likeable guy whose laid back manner belies a keen mind that never truly shuts down. His obsessive focus has led to great success professionally. His personal life is another matter. The lonely cop who bends the rules is hardly a revelation but in this case makes for an intriguing character. His blue collar background has left him grounded & comfortable in his skin with no aspirations to leave the street & become a paper pusher.Just a heads up. The author spares no adjective describing the gory crime scenes & the killer's MO had me feeling a tad squeably. But by then I was hooked & had to know how he was going to extract his characters from this seemingly hopeless situation.It's a scary, fast paced read that keeps you turning the pages. If you're a fan of Stuart MacBride, Lee Child or Steve Berry, this is for you."}, {"userName": "Havers", "userReviewDate": "Jan 17, 2016", "userURL": "http://www.goodreads.com/user/show/49284803-havers", "userReview": "Üblicherweise bin ich kein Freund von Thrillern, in denen die Taten eines Serienmörders im Zentrum der Handlung stehen, denn meist verzichten diese zugunsten blutiger Beschreibung der Morde auf die detaillierte Ausarbeitung des Plots, der Personen und der Handlungsorte. In der Mark „Heck“ Heckenburg-Serie des englischen Autors Paul Finch geht es auch blutig zu, aber Finch, ehemaliger Polizist, beschreibt nicht nur die Polizeiarbeit sehr realitätsnah, sondern hat auch ein Händchen, wenn es darum geht, eine stimmige Atmosphäre zu kreieren. Und genau deshalb mag ich die Reihe. Mittlerweile sind vier Heckenburg-Thriller erhältlich, der aktuelle Band trägt den Titel „Schattenschläfer“ (alle erschienen bei Piper).Cumbria im Nordwesten Englands, der Novembernebel hängt zäh über diesem spärlich besiedelten Teil des Lake Districts, nach seiner Strafversetzung das neue Einsatzgebiet Mark Heckenburgs. Vor zehn Jahren trieb in dieser Gegend ein Mörder sein Unwesen, der Paaren auflauerte, die Männer gleich umbrachte, die Frauen aber zuerst folterte, ihnen dann die Augen ausstach, bevor er auch sie tötete. Für seine Verbrechen zur Rechenschaft gezogen wurde er jedoch nie. Gemma Piper, Hecks ehemalige Vorgesetzten bei Scotland Yard, konnte ihn zwar verhaften und ihm eine Schussverletzung zufügen, aber er konnte entkommen.Jeder Polizist in England kennt diesen Fall, so natürlich auch Heck als ehemaliger Angehöriger der Serial Murder Crime Unit von Scotland Yard. Und so zieht er auch sogleich eine Verbindung zu diesem Fall, als ein junges Mädchen von einem Spaziergänger orientierungslos aufgefunden wird, der Körper übersät mit Schnittwunden. Bei ihrer Befragung stellt sich heraus, dass sie mit ihrer Freundin unterwegs war und die beiden von einem Mann verfolgt wurden, der „Strangers in the night“ pfiff. Heckenburg informiert Gemma, die sich sogleich auf den Weg gen Norden macht, um ihn bei seinen Ermittlungen zu unterstützen, die er mit Hilfe seiner Kollegin vor Ort, Constable Mary-Ellen O’Rourke, aufgenommen hat. Es ist ein Wettlauf gegen die Zeit, denn der Mörder spielt ein grausames Spiel mit seinen Verfolgern…„Schattenschläfer“ ist ein Thriller, der neben der spannenden Handlung durch seine gut ausgearbeiteten Hauptfiguren und deren komplexen Beziehungen punktet. Und auch der Handlungsort und die Zeit könnte nicht besser gewählt sein. Diese im Winter fast menschenleere Gegend, den Elementen ausgesetzt und nach dem Schneesturm von der Außenwelt abgeschnitten, in der ein Mörder sein Unwesen treibt – sehr stimmungsvoll, aber auch bedrohlich für Leib und Leben.Auch wenn man die Vorgängerbände nicht kennt, was allerdings sehr schade wäre, kann man getrost zu „Schattenschläfer“ greifen, da es eine in sich abgeschlossene Story ist und sich die Bezugnahme zu den früheren Fällen sehr im Rahmen hält. Und die Ecken und Kanten des Protagonisten sind auch für Nichteingeweihte recht schnell ersichtlich. Ich mag diesen eigenwilligen Polizisten und freue mich schon auf Band 5 mit dem Titel „Totenspieler“, der im August erscheinen wird."}, {"userName": "Kamilla", "userReviewDate": "Apr 01, 2015", "userURL": "http://www.goodreads.com/user/show/9926284-kamilla", "userReview": "Another masterpiece by Paul Finch. By the fourth book in the series we all know and love Heck, the rogue detective who solves crimes by all means necessery. He's human. He'll stumble, he'll make mistakes, he'll get hurt. But he loves what he does. He lives for it. He can't do it any other way. And that's what we so love about him. He's flawed, but he's brilliant. And a good man.In this book Heck has been transferred to the back of beyond, to no-mans-land, somewhere in the country, up in the hills. Bad weather sets in, night is approaching, everything is shrouded in fog. It's creepy, it's eery, it's totally isolated. And of course this is when the sh@t hits the fan. From the first pages things go wrong. And it just gets worse. Heck is chasing his tail, chasing an enemy in the gloom, while trying to protect the villagers. It is nailbiting stuff. Creepy as hell, mainly because of the scenery. The gruesome acts of the Stranger are shocking but in this tale, the main focus is on the foggy courtyside. The writing is brilliant, the characters are well developed, the clues are expertly laid out, the misdirection is so well done, that when the truth is revealed you're left dumbstruck. At least I was. But I so like to be dumbstruck. I get so wrapped up in the story that usually even the most obvious eludes me. :) But seriously. This one really threw me. Can't wait for Heck's next adventure. I'm officially now a big fan of this series. :) Highly recommend it."}, {"userName": "Gail", "userReviewDate": "Jul 11, 2015", "userURL": "http://www.goodreads.com/user/show/7052436-gail", "userReview": "This started off absolutely fantastically. It was very, very scary indeed and at times I was sat with my hand over my mouth, with my heart racing, but (and its a big but) the whole thing became totally implausible. I had spotted the perpetrator from quite early on and couldn't understand why Heck couldn't see what was before his eyes. From the middle of the book and the siege, I had to speed read. It was absolutely ridiculous and the reasons why the perp did what they did were totally beyond belief. There had been plenty of occasions to take out the victim/victims from early on, which sort of sent the whole plot into a massive free fall for me I am afraid to say. The first two books by Paul Finch will stay in my memory forever but the last two I had read, which involve my hero, DS Mark Heckenburg (Heck), have been less than satisfactory, in my humble opinion. I am just about to read the fifth in the series, Hunted, and do hope Paul is back on form with this one. I am also quite bored of Heck getting into ridiculous cat and mouse situations where it seems to go on forever, and would much rather Heck get back to real policing, which he does best, instead of him always being chased or doing the chasing.Disappointing, and average thriller."}, {"userName": "Linda  Branham Greenwell", "userReviewDate": "Jan 04, 2016", "userURL": "http://www.goodreads.com/user/show/2731485-linda-branham-greenwell", "userReview": "This is the fourth book in the series for the main character, DS Mark “Heck” Heckenberg.It is an action book - Lots of hiding, chasing, etc I'm really not \"into\" that kind of book - but it is a well written book (although I could have done with a lot less chase and hiding scenes)DS Heck has transferred to a remote and small village to get away from his ex-boss and ex-girlfriend, Gemma Piper. Right away a crime occurs that remind Heck of a crime that was connected to Gemma - in fact she was almost killed in attempting to apprehend the serial killer - called The Stranger. ( ( a serial killer who whistles \"Stranger in the Night\") So Heck calls Gemma to inform her of the connectionThen many gruesome murders occur - as Heck and his assistant in the small town, Mary Ellen, and Gemma (yes, she comes to the town to see if there is a connection to the told case.)"}, {"userName": "Martin Haynes", "userReviewDate": "Jan 03, 2015", "userURL": "http://www.goodreads.com/user/show/28889577-martin-haynes", "userReview": "Another breakneck paced thriller by Paul Finch. I could identify with the landscape which is a major player in this book having had some experience of the English Lakeland fells in fairly dangerous conditions. The only downside to the book is that I'd identified the wrong 'un midway through the book. It rattles along at a cracking pace though and it's well worth giving a go!"}, {"userName": "Richard Barber", "userReviewDate": "Dec 26, 2015", "userURL": "http://www.goodreads.com/user/show/3400356-richard-barber", "userReview": "Heck is a force of nature. Closer to a thriller than a police procedural, once again Finch manages to deliver the goods, a great, fast paced run through the Lake District."}, {"userName": "Rickysbuchgeplauder", "userReviewDate": "Mar 13, 2017", "userURL": "http://www.goodreads.com/user/show/59895634-rickysbuchgeplauder", "userReview": "RezensionSchattenschläferGenre: ThrillerSeiten: 479Verlag: PIPERKlappentext:Zehn Jahre hielten ihn alle für tot – dann kehrt der Killer zurückEin eisiger Winter bricht über den Norden Englands herein, als in der Nähe des Lake District zwei junge Mädchen verschwinden. Alles spricht dafür, dass „Der Fremde“ zurückgekehrt ist, ein Killer, an den sich Detective Mark Heckenburg und seine Kollegen nur zu gut erinnern. Zehn Jahre ist es her, dass er das letzte Mal zugeschlagen hat. Aus dem Dunkel, brutal, tödlich. Nun sucht er sich erneut seine Opfer, eines nach dem anderen. Heck macht sich auf die Jagd nach dem Unbekannten, doch schon bald steht er selbst mit dem Rücken zur Wand.Meine Meinung:Geschichte:Dies ist Band 4. Für mich ist es der beste Teil der Reihe, er war nicht so gezwungen spannend sondern wirklich spannend. Was ich am Wichtigsten finde ist, dass dieser Teil mir nicht so extrem langatmig vorkam. Die Geschichte ist anders als die anderen und echt brutal. Viel Blut und Mord und Spannung. Der Schreibstil ist wirklich gut zu lesen und sehr spannend gehalten. Erst in der zweiten Hälfte des Buches kam mir die Idee, wer der Mörder ist und normalerweise bin ich da ziemlich auf zack.Hier gibt es 5 von 5 Gryffindor – PunktenCharaktere:Die Charaktere sind sehr bildlich beschrieben. Man hatte sie immer ziemlich gut vor Augen und konnte sie sehr gut nachvollziehen. Ich finde es gehört schon eine Menge Kreativität dazu, sich so einen Mörder auszudenken.Hier gibt es ganze 2 von 2 Hufflepuff – PunktenEmotionen:Meine Erwartungen sind übertroffen worden. Es war unfassbar spannend und fesselnd. Außerdem auch sehr ekelerregend. Hier gibt es 2 von 2 Slytherin – PunktenAufmachung/ Design:So schlicht wie die Cover sind ist auch die Innengestaltung. Aber ich liebe es! Besonders im Kontrast zu dem farbigen Buchschnitt finde ich es richtig schön. Was ich auch sehr mag ist, dass alle Teile der Reihe super zusammen passen.Hier gibt es 1 von 1 Ravenclaw – PunktenFazit:Für mich der beste Band der Reihe. Absolut nichts für schwache Nerven. Insgesamt gibt es: 10 von 10 Buchplaudis"}, {"userName": "Edward Janes", "userReviewDate": "Oct 08, 2017", "userURL": "http://www.goodreads.com/user/show/27785844-edward-janes", "userReview": "The well-worn plot of a cop who leaves the big city and winds up up in a usually rural community with a killer on the loose. A killer who is not so much a mastermind as smarter than a rather stupid group of people. A plotline of whether said villain has blown themselves up and nearly killed themselves as a red herring...One of those books where you get to the end and think \"Oooh I can read the first chapter from the next book in the series. Best not'."}, {"userName": "Lisa Richards", "userReviewDate": "Nov 14, 2017", "userURL": "http://www.goodreads.com/user/show/1700427-lisa-richards", "userReview": "I love suspense thrillers and the fact that it takes place in a small town is another plus for me. While I've not read the earlier books in this series, I had no problem what's ever getting dragged in on what was a fabulous murder mystery. One of those that keeps you up all night reading but then wish you hadn't cause you can't turn it off once you do go to bed."}, {"userName": "Shirley Campbell", "userReviewDate": "Jun 01, 2017", "userURL": "http://www.goodreads.com/user/show/16378251-shirley-campbell", "userReview": "Another new crime writer to look out for"}, {"userName": "Stargazer", "userReviewDate": "Sep 22, 2017", "userURL": "http://www.goodreads.com/user/show/4687720-stargazer", "userReview": "started off interesting but just had me wrinkling my face up towards the end, it just got too unbelievable."}, {"userName": "Angela Free", "userReviewDate": "Nov 27, 2017", "userURL": "http://www.goodreads.com/user/show/25102826-angela-free", "userReview": "I just can’t get enough of Paul Finch at the moment! I’ve said it before I think, the adrenaline rush from his books is immense!"}, {"userName": "Stephanyvanruhr", "userReviewDate": "Mar 21, 2018", "userURL": "http://www.goodreads.com/user/show/21912039-stephanyvanruhr", "userReview": "Der bisher beste „Heck“. Ich freu mich auf den nächsten!"}, {"userName": "Pauline", "userReviewDate": "Jun 07, 2018", "userURL": "http://www.goodreads.com/user/show/1689725-pauline", "userReview": "An excellent read. Good storyline and strong characters. Look forward to reading the next."}, {"userName": "Carissa Watkins", "userReviewDate": "Mar 01, 2018", "userURL": "http://www.goodreads.com/user/show/71655504-carissa-watkins", "userReview": "Couldn’t put this book down.Very intense from the first few chapters until the end. Enjoyable read. The story itself twists and turns and I didn’t guess the ending. Didn’t see it coming at all!"}, {"userName": "Kirstin", "userReviewDate": "May 31, 2018", "userURL": "http://www.goodreads.com/user/show/30319346-kirstin", "userReview": "OMG!!! Literally seat of the pants stuff... so fast paced I was breathless!!!! I’ve loved every heck book so far but wow next time it’s foggy I’m hiding under the bed!!"}, {"userName": "Dave", "userReviewDate": "Dec 22, 2017", "userURL": "http://www.goodreads.com/user/show/12439679-dave", "userReview": "Pretty unbelievable and I guessed who the baddie was quite early on. But an enjoyable, easy read"}, {"userName": "Nisnis Bücherliebe", "userReviewDate": "Jan 12, 2016", "userURL": "http://www.goodreads.com/user/show/50123769-nisnis-b-cherliebe", "userReview": "Inhaltsangabe:Zwei junge Mädchen verschwinden im winterlichen Norden Englands. Die Ereignisse im Lake District erinnern Detective Seargant Mark Heckenburg an die grauenhaften Taten „des Fremden“, der vor zehn Jahren das letzte Mal im Blutrausch brutal getötet hat und den alle für tot gehalten haben.Mark und seine ehemalige Kollegin Gemma Piper nehmen die Jagd nach „dem Fremden“ auf, doch schon bald scheint es, als gäbe es für ein ganzes Dorf keinen Ausweg mehr.Der Autor:Autor Paul Finch, ehemaliger Polizist und Journalist, lebt mit seiner Familie in Lancashire, England. Seine zahlreichen Drehbücher, Kurzgeschichten und Horrorromane wurden bereits vielfach ausgezeichnet, unter anderem mit dem British Fantasy Award und dem International Horror Guild Award. Schattenschläfer ist einer von bereits sehr erfolgreichen Thrillern um den Ermittler Heck, Mark Heckenburg.Das Cover:Das schwarze Cover beherbergt mittig einen Eisenhaken an einem Seil. Für mich gibt es keinen direkten Bezug vom Cover zu der Handlung, auch wenn hier und da in der Story Haken eine Rolle spielen. Der Autorenname „Paul Finch“ leuchtet in einem grellen Neon-Grün. Der Titel „Schattenschläfer“ ist weitaus dezenter in weißen Kleinbuchstaben abgebildet. Irre sehen die Ränder der neon-grünen Seiten aus, die sich anfangs etwas ungewöhnlich anfühlten.Reflektionen:Die Ankunft in der Geschichte fiel mir sehr leicht. Der flüssige, klare Schreibstil, in angenehmer Sprache, trägt mich leichtfüßig von Seite zu Seite und die Geschichte fesselt sofort. Paul Finch ist es absolut geglückt die Spannung von der ersten bis zur letzten Seite aufrechtzuerhalten, eine wahrlich meisterhafte Leistung. Die Geschichte, im Genre Thriller bestens aufgehoben, spielt vollständig im Nebel und in einer Gegend, in der es mehr Schafe als Menschen gibt. Schon allein die Wetterumstände sorgten für eine gruselige und geheimnisvoll knisternde Stimmung. Die Protagonisten befinden sich auf der Flucht vor dem Menschenjäger, wenn auch nicht stetig in für mich logischer und authentischer Vorgehensweise. Sie können kaum die Hand vor Augen sehen und erwarten fast bei jedem Schritt den sie tun das Grauen. Sie hören es im Gebälk knacken, sie sehen Schemen und sie haben panische Angst. Die Emotionen der Figuren kommen bestens rüber und sie erreichen mich emotional. Die Ereignisse grenzen fast an Horror. Immer wieder kommt es zu Spannungshöhepunkten, die sich jedoch ausschließlich auf gefährlich brutale Szenarien beziehen und nicht weil die Handlung spannende Wendungen hervorbringt. Wendungen erlese ich erst gegen Ende der Story. Ich habe vorher keine Chance Charaktere dem „Fremden“ zuzuordnen, dafür fehlen mir weitere Informationen. Dennoch werde ich in hohem Tempo vorangetrieben, immer in Erwartung dass weitere tiefgründige Begebenheiten geschehen. Abgesehen von den ersten Kapiteln des Buches lebt die Handlung auf den letzten 40 Seiten endlich inhaltlich von mehr als von grauenhaften und gefährlichen Fluchtszenarien. Interessante Wendungen überraschen mich, denn niemals hätte ich das Ende so vorhersehen können.Die Charaktere haben grundsätzlich überzeugt, doch die Konzentration dieser Geschichte zielt eher darauf ab, den Leser mit angsteinflößenden Momenten, Nervenkitzel, Gruselfaktor und Gänsehautmomenten zu versorgen, zumindest habe ich persönlich es so empfunden. Paul Finch versteht es wirklich diese Emotionen im Leser zu wecken und den Leser in einen spannungsgeladenen Erwartungsmodus zu versetzen, der ihn nicht mehr loslässt, doch da blieben tiefgründige Charaktere für mich doch leider etwas auf der Strecke.Die Schauplätze der Geschichte stellt Paul Finch sehr detailliert und recht vordergründig dar. Ich mag es sehr, wenn mir Beschreibungen der Landschaften, Ortschaften und Wetterverhältnisse helfen, dass ich mir ein eigenes Bild zeichnen kann oder wenn diese Beschreibungen die Grundstimmung mit prägen, doch in diesem Thriller, waren mir die landschaftlichen Begebenheiten, Unwägbarkeiten und der ständige Nebel etwas too much. Etwas weniger wäre hier mehr gewesen.Mir fehlte etwas mehr Input an Handlung. Im Großen und Ganzen dreht sich die Geschichte hauptsächlich um Flucht, Angst und Schrecken. Die beiden verschwundenen Mädchen, die anfangs einen wahren Horror-Trip durchleben, verschwinden gänzlich aus der Handlung. Da hatte ich mir einfach mehr Zusammenhänge erhofft.Mein Fazit:Ein äußerst spannender Thriller für den ein etwas stärkeres Nervenkostüm benötigt wird. Wer keine tiefgründigen Charaktere erwartet ist mit ausreichend Thrill, gruselig unterhalten."}, {"userName": "June Jones", "userReviewDate": "Jan 16, 2017", "userURL": "http://www.goodreads.com/user/show/40455234-june-jones", "userReview": "Excellent gripping thriller, with an unexpected ending, would recommend"}, {"userName": "Mary", "userReviewDate": "Apr 28, 2018", "userURL": "http://www.goodreads.com/user/show/40984543-mary", "userReview": "Audio book. Enjoyed listening although the brutality of the murders was a too graphic for me. There's something about the eyes . . ugh."}, {"userName": "Jasi", "userReviewDate": "Jan 05, 2016", "userURL": "http://www.goodreads.com/user/show/19581054-jasi", "userReview": "Es ist zehn Jahre her, seit \"der Fremde\" das letzt Mal zugeschlagen hat. Als in der Nähe des Lake Districts zwei Mädchen verschwinden, spricht alles dafür das der Serienkiller wieder zurückgekommen ist. Superintendent Gemma Piper, die vor zehn Jahren bei dem Fall ermittelt hat, kümmert sich mit ihrem alten Partner Heck sofort darum und die beiden müssen feststellen, dass der Killer so wütend ist, wie noch nicht zuvor. Ich schreibe diese Rezension direkt nachdem ich das Buch beendet habe und ich muss sagen, mein Herz klopft immer noch unglaublich schnell. Das Buch ist einfach in so einer rasenden Spannung geschrieben, das ich mich zwischendurch wirklich gar nicht losreisen konnte und atemlos das Geschehen verfolgt habe. Der Autor legte das Augenmerk des Buches nicht auf die Ermittlungen, sondern brachte sehr viel Action und Bewegung in das Buch und die Protagonisten entrannen dem tödlichen Schicksal oft nur mit Haaresbreite. Andere hatte leider nicht so viel Glück, denn in dem Thriller geht es sehr blutig zu und die Morde an mehreren Personen werden sehr ausführlich geschildert. Der dunkle, düstere Schreibstil von Paul Finch passt das natürlich ausgezeichnet und mir es sehr gut gefallen das er in manchen Stellen Gänsehaut verursachte und bei anderen einen Adrenalinausstoß. Ein großes Plus bekommt auch die Location, da sich das Ganze in den Bergen abspielt und sich die beiden Ermittler nicht gerade gut auskennen, der Täter dafür umso besser. Außerdem sind die Wetterbedingungen sehr ungünstig und durch den starken Nebel, der für dieses Gebiet durchaus nicht ungewöhnlich ist, verstärkt sich der Grusel-Effekt nur noch mehr. Die Protagonisten in dem Buch fand ich eigentlich alles sehr interessant, besonders Superintendant Gemma Piper, die in der Abteilung für Serienverbrechen zuständig ist. Anfangs stand ich ihr etwas kritisch gegenüber, doch im Laufe des Buches hat sie mich doch sehr überrascht. Von der spannenden Handlung habe ich ja bereits geschwärmt, besonders die actiongeladenen Szenen in dem ein Schock nach dem nächsten folgt, konnte mich begeistern. Der Autor schafft es so wirklich durchwegs die Spannung aufrecht zu halten. Was den Serienkiller angeht, hatte ich schon ziemlich früh einen Verdacht, der sich auch bestätigte. Das fand ich etwas schade, da ich gerne noch einen Überraschungseffekt gehabt hätte, aber vielleicht bin ich auch nur eine zu gute Ermittlerin. ;) Was mir beim Lesen auch noch aufgefallen ist, ist das der Auto ein Faible für Automarken zu haben. Selten sind mir in einem Buch so viele verschiedene Automarken unter die Augen kommen, wie hier. ~ Fazit ~Ein unglaublich spannender Thriller, der durch die schaurige Location nur noch gruseliger ist. Ich habe die Geschichte wirklich atemlos verfolgt, auch wenn ich leider schon vor dem Ende eine ziemliche Ahnung hatte wer der Täter ist und welche Motive hinter seinen blutigen Taten stecken."}], "description": "Beware the stranger in the night...Consigned to a remote valley in the Lake District, DS Mark ‘Heck’ Heckenburg is getting used to a quieter life—a far cry from the bloodbath of his former division, the Serial Crimes Unit. But wherever Heck goes, trouble is never far behind.Unknown to Heck, ‘The Stranger’ has returned. Last seen on Dartmoor ten years earlier, this prolific serial killer has found a new home. As a dense, frozen mist descends on the Lakes, The Stranger returns to his old ways, starting with two young women lost high on the hills. Only one girl is ever found—barely alive—but able to confirm Heck’s worst fears.As The Stranger lays siege to the remote community, Heck helplessly watches as the killer plays his cruel game, letting off his trademark call before viciously picking off his victims.And with no way to get word out of the valley, Heck has no choice but to play ball...", "title": "Dead Man Walking\n      \n          (DS Heckenburg #4)", "url": "http://www.goodreads.com/book/show/23244964-dead-man-walking", "average": 4.12, "cover": "https://images.gr-assets.com/books/1410968604l/23244964.jpg", "reviews": 80, "authors": [{"url": "https://www.goodreads.com/author/show/548923.Paul_Finch", "name": "Paul Finch"}], "type": ["Mystery", "Thriller", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/23244964-dead-man-walking", "http://www.goodreads.com/book/show/23463281-dead-man-walking", "http://www.goodreads.com/book/show/28451128-schattenschl-fer", "http://www.goodreads.com/book/show/23785375-dead-man-walking", "http://www.goodreads.com/book/show/26882738-schattenschl-fer", "http://www.goodreads.com/book/show/17268840-stalkers", "http://www.goodreads.com/book/show/17926971-sacrifice", "http://www.goodreads.com/book/show/9729691-doctor-who", "http://www.goodreads.com/book/show/29359900-strangers", "http://www.goodreads.com/book/show/21059082-the-killing-club", "http://www.goodreads.com/book/show/37581710-the-company-of-demons", "http://www.goodreads.com/book/show/40024832-empire-of-sin", "http://www.goodreads.com/book/show/8343548-the-bricklayer", "http://www.goodreads.com/book/show/40193155-among-the-wicked", "http://www.goodreads.com/book/show/23818400-the-snow-garden", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/23157833-almost-dead", "http://www.goodreads.com/book/show/33555347-crime-scene", "http://www.goodreads.com/book/show/30249521-fatal-frost", "http://www.goodreads.com/book/show/40266676-remains-of-innocence", "http://www.goodreads.com/book/show/34330657-finding-claire-fletcher", "http://www.goodreads.com/book/show/28824403-outfoxed", "http://www.goodreads.com/book/show/23957469-huntress-moon", "http://www.goodreads.com/book/show/40204087-the-deepest-secret", "http://www.goodreads.com/book/show/35115882-what-the-dead-know", "http://www.goodreads.com/book/show/40267317-ragdoll", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/39791173-the-girl-before", "http://www.goodreads.com/book/show/40205081-last-witness", "http://www.goodreads.com/book/show/40205040-dead-weight", "http://www.goodreads.com/book/show/18903409-weekend-warriors", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/40193809-eye-for-an-eye", "http://www.goodreads.com/book/show/35005051-the-forgotten-girls", "http://www.goodreads.com/book/show/27239265-the-short-drop", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/17623604-you-only-live-twice", "http://www.goodreads.com/book/show/17377392-thunderball", "http://www.goodreads.com/book/show/17284593-casino-royale", "http://www.goodreads.com/book/show/17623578-for-your-eyes-only", "http://www.goodreads.com/book/show/17304110-live-and-let-die", "http://www.goodreads.com/book/show/18780375-dr-no", "http://www.goodreads.com/book/show/17379070-moonraker", "http://www.goodreads.com/book/show/18799804-diamonds-are-forever", "http://www.goodreads.com/book/show/40205231-the-spy-who-loved-me", "http://www.goodreads.com/book/show/17377384-from-russia-with-love", "http://www.goodreads.com/book/show/40243961-the-cape-refuge-collection"]}