{"ratings": 1023, "userreviews": [{"userName": "Amanda", "userReviewDate": "Mar 06, 2014", "userURL": "http://www.goodreads.com/user/show/1219253-amanda", "userReview": "Maud Stack is a beautiful, vivacious, intelligent, and careless student. Professor Steven Brookman is a handsome, Hemingway-masculine, intelligent, and careless instructor. Of course, we know what this means. It's not long before office hours become after hours, and the classroom becomes the bedroom. In terms of plot, there's nothing new or shocking in Death of the Black-Haired Girl. Professor Brookman is, of course, a very married man who, despite his occasional sexual liaison, is very much in love with his wife, who has recently discovered she is pregnant with their second child. Taking a personal vow to be a better husband and a better father, Brookman decides to end his relationship with Maud, but hell hath no fury like an undergraduate scorned. It's not long before Maud spirals out of control, leading to her eventual death under questionable circumstances in front of the Brookman home. Despite seeming like the setup for a by-the-numbers whodunit, Death of the Black-Haired Girl is anything but. For those familiar with Stone's writing, this shouldn't be a shock and many of the negative reviews I've read come from readers who felt misled. I can't say that I blame them. With a title that conjures The Girl With the Dragon Tattoo and blurbs and summaries that throw around words like \"thriller\" and \"noir,\" it does seem to project the wrong image. However, I read and enjoyed Stone's Dog Soldiers, so I was eager to enter into Stone's morally-nebulous universe. That enthusiasm did not last very long.Stone uses the aftermath of Maud's death to explore morality in both specific and broad terms. The novel's setting is a prestigious liberal arts college in New England, an academic institution whose motto, Lux in Umbras Procedet, or Light Will Go Forth Into Shadows, hearkens to a vainglorious past, its original mission to bring civilization and God's light to the wilderness. Ironically, in its 21st century manifestation, it has become the place that creates shadows, a place of locks and barriers--no longer seeking to interact with the world, it seems to insulate itself from it. In its attempt to protect itself from outside influence, it's evident that its insular nature is destroying it from within. It is a gray, dismal wasteland populated by the selfish and the insane. As Maud quotes Mephistopheles from Doctor Faustus as saying of the world, \"Why this is hell . . . nor am I out of it\" (15). After Maud writes a scathing indictment (although, from my perspective, a clumsy, rambling and ridiculously written diatribe that I cannot imagine anyone finding persuasive or brilliant) of the hypocrisy of Christian right-to-lifers that is published in the school newspaper, the college becomes a literal battleground between the secular and the sacred as hundreds of protesters flock to the campus and some go so far as to physically threaten Maud.Many of the characters here seem to be in hell: Maud; her father, Eddie; the school counselor, Jo Carr; and Steve Brookman carry and create their own personal demons. There are also lesser angels presented in the form of the dean's wife, Mary Pick, whose tragic past in Ireland seems to have only strengthened her faith, and Ellie Brookman, who routinely leaves the college to return to the Garden-like existence offered by her Mennonite community in Canada. A woman of deep faith who believes her life to be firmly in the hands of God, Ellie serves as the embodiment of the platonic ideal for Brookman: a constant presence reminding him to do better and be better in light of his past. Discovering her pregnancy months after leaving their home to return to the fold of her family seems to remove her from the sordid sexual escapades at the college, making her pregnancy seem almost immaculate and her presence in Brookman's life divine. So, yes, there's a lot going on here in terms of spirituality, repeatedly dancing at the edge of existential angst and then pulling back again. There's a lot going on in terms of abortion, Christian fundamentalism/radicalism, adultery, marriage, and temptation. There's some beautiful writing (the scene depicting the reaction of Maud's father, Eddie, after he learns of her death is heart-wrenching). So what's the problem? Remember how I said Maud's editorial rant was rambling and clumsy? Ultimately, that's how I felt about the structure of the novel. The story isn't really about Maud's death at all, but splinters off into a dozen different directions, following secondary characters in such a hurried, abrupt way that the reader never finds resolution on any front. It's like Maud's death is a bare Christmas tree from which Stone hangs every vituperative, cynical, and nihilistic bauble he can find. But then he stands back and thinks something is missing. So out come the garlands of devotion and piety as a counterweight. But still, it's not quite right. Maybe some twinkling obvious symbolism lights? The plot becomes so weighted under these conflicting and ponderous messages that I just lost interest. But the real death knell? The host of unlikable characters. Now, don't get me wrong--I'm not suggesting they should be likable in the sense that they should be good (in fact, it is the intended saints in the novel that I find particularly obnoxious), but there should be something about them that I still find appealing. Not so here. Part of my complaint comes from the fact that the novel does far more telling than showing, so many of the characters seem two-dimensional. It doesn't help that these are self-centered, pretentious, beautiful people who are careless with the lives of others. Surprisingly, the only sympathetic character is the one I thought I would loathe the most: Steve Brookman. Despite everything, there's the sense that he did love Maud in some way that went beyond lust. He doesn't come across as a lecherous Humbert Humbert in that what he loved and celebrated in Maud had as much to do with her intellect and her potential as her youth and beauty. In the end, I can only state that Death of the Dark-Haired Girl ultimately seems tedious and unnecessary despite its grander aspirations. Cross posted at This Insignificant Cinder and at Shelf Inflicted"}, {"userName": "Alison", "userReviewDate": "Jun 18, 2014", "userURL": "http://www.goodreads.com/user/show/746793-alison", "userReview": "This is a perfectly ridiculous campus melodrama, written by a man who writes very well about drugs and violence and warzones and should probably just stick to that. And I could should just leave it at that, because that's true and it's hardly worth wasting type on a mistake of a novel. BUT HOLY SHIT WHAT A MISTAKE.This book got two stars from me BECAUSE IT WAS SO ABSURD AND BORDERLINE OFFENSIVE IT WAS LIKE A PAGETURNER OF ABSURD AND BORDERLINE OFFENSIVE. I couldn't stop reading it. It was a total trainwreck. If you like outdated insulting ethnic stereotypes, gorgeous women powerless to the charms of shitty men, beautiful saintlike wives devoted to their terrible husbands, outdated insulting religious stereotypes, outdated insulting regional stereotypes, insulting authorial attitudes to the mentally ill, casual racism, hilariously outdated language and behavior by \"young people,\" a complete lack of understanding of how technology works, outdated notions of class, a complete lack of understanding of how a contemporary college operates, bizarro dumb-dumb machismo seemingly played as \"noble,\" and much, much more. I mean, I don't demand realism from my fiction, in fact, I love wingnut shit that flies way out of bounds. But this book seems to think it is realism. And to give you one example of just how off-base that is, there are a lot of ways you might describe a heroine that is purportedly six feet tall and weighs 120 pounds but \"well-nourished and athletic?\" For real? Robert Stone, have you ever met a women in real life? In the meantime, there are all these strange details that are so wackado, that I can't tell if Stone is just playing everyone and that, in fact, he intends this book to be a comedy. Take for example, the elaborate scene setting about vast mentally ill homeless population haunting the edges of his fictionalized liberal arts Ivy-lite so pervade the story for the first few pages that even the students live in renovated flophouses. That's an interesting detail that gets dropped entirely. Likewise spectral Andean flute players, a (ghost? zombie? who the fuck knows?) new age, terrorist priest, a one night stand with a (Polish?) fake Wall Street executive with cheap Scotch, a baby-faced Irish mob family that still \"whacks\" people and seems to have been lifted full cloth from a comic book, some Canadian German Amish-lite sect who believes in standing by your man and Native American folklore and the Appalachian,former Christian rocker, schizophrenic ex-husband of the heroine's b-movie starlet roommate (I AM NOT MAKING THIS UP). And I have so many questions: Why does the protagonist dress in drag to walk to a coffeeshop in the morning? Why do people think that she's a good writer (because the extracted bits are beyond nonsensical)? Who in their right mind actually reads the editorials in a campus newspaper at a small, liberal arts college? Actually, you know what? Let me answer that last one for you: nobody. Nobody at all outside the campus, except the (maybe) parents of the students writing the editorials. I'd like to raise a broader point here, and it's not entirely fair to Mr. Stone (who really has written some great books. Seriously. Damascus Gate? A Flag For Sunrise? A Hall of Mirrors? All good. In fact, Dog Soldiers is still probably my favorite book written about the Vietnam War) that I leave this here, but it has to be said:Male authors in late middle age (or actual senescence as the case may be): we get it. You want to have sex with hot nineteen year olds. You want to believe they will become obsessed with your brilliant fiction and manly ways and swoon and sigh and keen like some tragic Gothic heroine. You want to believe you have the power to break their heart and break them. You want to believe that even though you haven't hung out with teenagers since 1965, you're still hip to the lingo. That your inherent coolness will allow you to write incisively about the lives of young people in general, and young women in particular, with razor sharp insights. And listen to me, unless you are (maybe) Thomas Pynchon (who is evidently still partying incognito with real, truly, live kids and listening to what they actually have to say), YOU SHOULD NOT DO THIS. You are making an ass of yourself. You are insulting your readers. Just stop. If you want to write a campus novel (and I'd ask you to reconsider whether we really need another one of those, because GOD HELP ME, THERE ARE SO MANY OF THEM), how about 1) setting it during a time you were actually on a young person on a campus and 2) making it not about an beautiful ingenue having an affair with a Hemingway-esque lit/creative writing professor and/or getting torn apart by campus politics. You have the power to make it stop. So MAKE IT STOP. Rant concluded. Seriously, people, this book is so absolutely terrible, I almost want to recommend it to you."}, {"userName": "Jeanette  \"Astute Crabbist\"", "userReviewDate": "Nov 03, 2013", "userURL": "http://www.goodreads.com/user/show/796425-jeanette-astute-crabbist", "userReview": "Rating = 3.5 stars\"How learned and fine we believed ourselves to be! How shitty of the world to deal with us this way.\"It's a story as old as academia. Adolescent co-ed falls for, and falls into bed with, her university professor. It doesn't matter if he's paunchy in plaid or sexy in silk shirts. She can't resist the allure of age and power and worldliness. But the guy's always married, with a kid or two and a career to protect. Relationship ends. Girl is left bereft by father figure. Did Maud Stack, the black-haired girl, have to die because of her affair with Professor Brookman? Or was it her substance abuse and emotional instability that doomed her? Did she have to die at all? Do any of us get what we have coming to us, according to our measure of responsibility for good and bad events? My guess would have to be that Bob Stone says no. Some play and others pay. This novel is more philosophical than the plot description might lead you to believe. Robert Stone stirs up a lot of serious questions without ever giving away his own stance on any of them. Is consenting adult sex between student and professor acceptable? How much responsibility does the professor bear for the consequences of such a relationship? Who has the higher moral ground on questions of abortion? At what point should confidentiality be breached to save someone from self-destructive behavior? What part, if any, should religion play in determining appropriate decisions and punishments?All of these questions are raised, and left unanswered, in this story. And perhaps that was Bob Stone's intent, to present a bleak reality in which there are no right or wrong answers and people regularly suffer, disproportionately, for their own mistakes as well as for the sins of others."}, {"userName": "Deborah", "userReviewDate": "Nov 01, 2013", "userURL": "http://www.goodreads.com/user/show/9284848-deborah", "userReview": "As I’d read the back cover blurb about this book I expected to be following college academic Steve Brookman, who’d been having an affair with the lovely but headstrong Maud Stack; as we’re reliably informed (from the blurb) that Brookman realises his folly and – though obviously reticent – decides to break off his relationship. (Well that, plus his wife is pregnant (again) after many years of trying.) However, we’re first introduced to college student Maud and her moderately successful actress roommate (and fellow student) Shelby. And then there’s Shelby’s ex husband who is supposedly incarcerated in a mental institution in her hometown; and Jo, a former nun and now college counsellor.By the time tragedy strikes we’ve also met Maud’s father Ed – former cop and alcoholic with whom she has a complicated relationship. Because I actually thought this novel was going to be focused on Brookman, his family and the fallout of his dalliance, I found myself disappointed when we jumped between the heads of a myriad of characters and exploring a range of issues. In addition to the moral matters of adultery and abortion, religion and the church were also offered as fodder for consideration. Author Robert Stone is an acclaimed writer, but in my humble opinion, Death of the Black-Haired Girl was a huge anti-climax. Perhaps it’s more of a study of human nature than anything else, although I felt our major players’ reaction to the novel’s tragic turning point, could have been explored in greater detail. At that point it felt like the novel became about Jo and Ed, with the Brookmans all-but disappearing. Because it felt like we were constantly moving from one character’s head to another, I didn’t really connect with any of the main players; and the control freak in me still struggles to define or even describe the novel in any detail. I suspect I read most of the novel with a furrowed brow… wondering where on earth Stone was taking us.Robert Stone’s Death of the Dark-Haired Girl will be available from 12 November 2013. I received a copy of this novel for review by publishers, Houghton Mifflin Harcourt via NetGalley."}, {"userName": "switterbug (Betsey)", "userReviewDate": "Oct 28, 2013", "userURL": "http://www.goodreads.com/user/show/2843912-switterbug-betsey", "userReview": "At a small, prestigious New England liberal arts college, a brilliant young undergraduate student, Maud Stack, is killed by a hit-and-run driver. When it happened, she had been standing outside with her college professor ex-lover in an angry confrontation. There were many witnesses, and opposing points of view about how she died, why she died, and who killed her. Additionally, there are characters either central or peripheral to Maud's life that provoke the reader into asking questions about truth and illusion; religious rearing; the connections and responsibilities of our patrons and protectors; and the security of our civic structure.Maud, who has an increasing problem with alcohol, had just posted an article in the college Gazette, railing on the anti-abortion fetishists who have placed grizzly pictures of dead fetuses on protest posters to shove in the faces of women on their way to abortion clinics. Maud, angry with the vigilantes, decides to turn it around, by publishing pictures of fetuses with birth defects, with the argument that two can play this game of propaganda.Did Maud's death come as a result of this article? If not directly, then indirectly? Or was it related to the affair with the married professor? Or did she bring it on herself, with her increasingly outrageous and self-destructive behaviors? The truth is hidden in plain sight.There are several other characters that have relationships with Maud. There's her actress roommate, Shelby, who has a schizophrenic, stalking ex-husband who is obsessed with a punitive Christian dogma. Maud's one-time counselor, Jo Carr, is a compassionate ex-nun, who also works at the hospital and believes in a woman's right to choose. Jo is certain that she has seen a menacing preacher from her younger years in South America, one who may have come to pursue and shadow Maud. Then there is Maud's father, a former detective with the NYPD, slowly deteriorating from emphysema, due to exposure to Ground Zero. He also harbors secrets that trouble him, and he worries that he may have Maud's blood on his hands.There are also characters that represent the class division of the city. This appears to be a crumbling Massachusetts mill town. Apart from the scholars and students at the college, it is a depressed place. Most of the inhabitants are meagerly educated malingerers and blue-collar workers, some who hold the esteemed college in contempt. There is also a strong presence of mental health patients who stroll in clusters of support for each other, very near the college grounds. For the most part, there is a hospitable understanding or informal agreement between the haves and the have-nots. Or is there?The plot is less important than the themes, but it is the plot, or the unanswered questions, that keeps the reader reading. Stone writes sparingly, similar in some ways to DeLillo, examining academia and exploring themes of intellectualism, piousness, and the fractures of the family. Most of the characters live in internal disenfranchisement, in a desperate isolation from each other. Stone explores the woefully and ruefully marginalized, and his prose enhances that feeling--the hollow and bleak existence of those that fail to connect, and a mournful dependence of doctrine that breeds exile, and chains them to their transgressions. And he tinges it with dark humor and irony.\"People's religion -- it's not like opium. It don't work that way. It's their mother, you understand. They may not understand their mother at all. They may hate their mother. Maybe they're ashamed of their mother. Sometimes a mother makes someone hate other people. Any thing can drive such people to anything.\"Stone's new novel is not straightforward mystery or police procedural. He is a former National Book Award winner, known for his stylized narration. The detached tone required some adjustment on my part, and I never felt an emotional attachment while reading. What lingers is the impressionistic images of a complex moral universe that Stone creates through his prose, and that evolve into a composition of exile, dependence, and internment."}, {"userName": "Jill", "userReviewDate": "Oct 23, 2013", "userURL": "http://www.goodreads.com/user/show/2228181-jill", "userReview": "Is the universe indifferent to our suffering? Do those who believe they hold all the answers always think they have the right to hurt those who don’t believe them? These two broad questions are at the core of Robert Stone’s latest novel.The eponymous black-haired girl is Maud Stack – beautiful, mercurial, spoiled, and self-destructive. While attending college in New England, she begins an affair with her middle-aged and emotionally damaged college advisor, Steven Brookman. To prove her mettle, Maud writes a highly inflammatory college newspaper article tackling the faith-filled anti-abortion protestors at the most visceral level. There is no doubt what happens to Maud; the very title of the book gives the main plot point away.But is the book truly about the death of the black-haired girl…or is it a book about the death of all our illusions? In the most important ways, this book is not about Maud at all and it’s certainly not any kind of classic whodunit. We meet the people who hang on the periphery of Maud’s life: Jo Carr, school counselor and ex-nun, who is still mentally tortured from horrors in South America, her father, Eddie Stack, an emphysema-ridden former policeman who lives with his own nightmares, her friend and roommate Shell, an actress with a mentally disturbed ex-husband, Lieutenant Salmone—her father’s ex-partner and many more.All of them struggle to make their lives – and Maud’s death – make sense and mean something at a time when the institutions that are supposed to protect them (the churches, the law, the colleges) are failing. All of them strive for a sense of connection yet most must carry on alone.It’s a strong premise, but it didn’t entirely work for this reader. To buy into any of this means that the reader must first buy into the premise of Maud and Brookman and how her death unravels those around her. But her character not nuanced enough. As portrayed, Maud appeared as an unstable, potentially alcoholic, terribly entitled and naïve young woman; her smartness, creativity and beauty seemed secondary to that. Some of the scenes between Maud and Steven did not seem quite genuine.Also, at times, I felt that Robert Stone was walking a thin line between serious literary work and crime novel territory. Both are valid genres, but for me, the cohesion between the two had to be more seamless.I wanted to give this a 4 star rating for many reasons: the assuredness of the prose, the universal questions it raises, and the simple fact that once I got going, I didn’t want to stop reading. But it never really coalesced, hence my 3-star rating."}, {"userName": "Barbara", "userReviewDate": "Mar 25, 2016", "userURL": "http://www.goodreads.com/user/show/2172096-barbara", "userReview": "2.5 stars While browsing in the library I picked this book up because - from the title - I thought it was a mystery. Though there's a death in the story it's not a mystery as such, with detectives following clues, etc. It's more of a literary novel.The basic story: Maud Stack is a beautiful, bright co-ed at a prestigious New England college. She drinks too much, is having an affair with her professor/advisor Steve Brookman, and writes for the college newspaper, 'The Gazette'. Local anti-abortion protestors inspire Maud to write a scathing editorial supporting women's rights. The editorial describes non-aborted babies with serious birth defects and/or lethal syndromes - with distressing photos when the article goes online. Before it's published Maud drops the article off at Brookman's office, hoping to impress him with her writing.As it happens Brookman has just learned that his wife is pregnant with their much-desired second child and has decided to break up with Maud. Thus, he doesn't read her article, avoids her phone calls, and doesn't respond to her text messages. Without Brookman to deter her, Maud's article is published. It garners enormous fury and blowback from the anti-abortion community, especially religious Catholics. (This part is hard to buy into. Surely the editor of 'The Gazette' would nix publication of such an inflammatory piece.)Maud, very much in love with Brookman, is devastated by the break up. She shows up drunk outside his house one blizzardy evening and throws snow at the windows, screams at him, yells things about his wife, and so on. Brookman, wanting to protect his family, goes out to confront Maud - hoping to convince her to go home. Maud attacks Brookman, punching and hitting. Brookman tries to restrain the girl, and during the struggle a car hits Maud and she's killed. Detectives investigate the incident. Did an anti-abortion protestor hit Maud? Did Brookman push her in front of the car? Was it a random accident? Was it the religious, stalkerish, estranged husband of Maud's roommate? Various 'witnesses' provide conflicting accounts of what happened and it's hard to decipher the truth.As it happens Maud's father, Ed Stack, was once a New York City police detective who was at the Twin Towers on 9/11. Stack got emphysema from the dust, became disabled, and retired. Stack loves his daughter, is devastated by her death, and is determined to get retribution. Stack also feels guilty for 'abetting' thefts from dead victims of 9/11, and speculates that God might be punishing him by taking his child. (It's pretty horrifying to think that cops would steal from disaster victims but who knows if this is true or not). Though some of this sounds like the stuff of mystery, the story doesn't really slant that way. It's more about a teacher/student affair, abortion/pro-choice issues, religion, a former nun who's now a student counselor, a militant priest who once worked in South America, a mentally ill man wandering around campus, Ed Stack's possible revenge, how Brookman's wife and co-wokrers react to the scandal, and more. In the end we do find out who killed Maud but this isn't the important part of the story.The book has interesting characters and situations but I found it hard to remain engaged in the tale, which seems to wander all over the place. Thus, in the end, I didn't like the book much."}, {"userName": "Steve", "userReviewDate": "Jun 02, 2013", "userURL": "http://www.goodreads.com/user/show/1254714-steve", "userReview": "Not good. Stone, a writer I really admire, is now at the point in his career where he's sadly cannibalizing parts and characters from previous novels (in particular Flag for Sunrise and Bay of Souls) in order to crank out something \"new.\" Some (the New York Times) are calling this a fast paced \"literary thriller.\" Well, it is true that there are elements of both literary fiction and noirish thriller (none of which are \"fast\") in the novel, but not enough to satisfy the lover of literary fiction or genre novels. There are some cool moments throughout, but too often characters and motivation seem undercooked. There's an interesting and recent piece on Stone by the Wall Street Journal. In it Stone confesses to being both a perfectionist -- and lazy. A bad combination according to Stone. I think that harsh, but he's not exactly a prolific author, though much of what he's written is extremely well crafted, recalling high-end Hemingway and Conrad. In Death of the Black-Haired Girl, you will find numerous passages, stunning sentences, and terrific meditations on the nature of good and evil. But the parts don't equal a satisfying whole. If you're coming to this novel as a first time reader of Stone, and are mystified about his reputation after reading it, I suggest you turn to the novels Dog Soldiers and Flag For Sunrise, or perhaps his remarkable (and grim) short story, \"Under the Pitons.\" In these stories you will see why Stone has such devoted fans. Below is a link to the \"Pitons\" story. It says you can sign on to read the whole story for free. If so, check it out...http://www.narrativemagazine.com/issu..."}, {"userName": "Mrtruscott", "userReviewDate": "Dec 27, 2013", "userURL": "http://www.goodreads.com/user/show/12528871-mrtruscott", "userReview": "I wish I had started with Stone's earlier work, which I hear is good and even excellent. This, sadly, read like \"notes for some possible screenplays if I need money fast.\" I could not even detect an editor's slight touch. I pity the editor who is associated with this book. There were what in movies are called continuity errors - a college counselor is paid enough to dress well, but her office is In a basement because her status is so (aptly) low. This character, a former nun, had a rough draft of a back story that was literally pointless to the book, the plot, such as it was, and had me flipping back thru the book at one point to see if it was missing pages. She had been in another country. There was a mysterious revolutionary? Man, anyway, known as The Mourner. I think his name was symbolic. The adulterous college professor was not even developed enough to be a cliche, although much detail was provided about the drapes in his office; his wife, apparently an idiot, had some thinly sketched out religious background that she maintained - Mennonite? which contributed nothing to the barely existent plot, except more of the \"toss some themes in the blender\" -- to confuse the reader?An alcoholic cop, references to 9/11, corruption in the NYPD, abortion rights, the Catholic Church, oh, wait -- a woman widowed by an IRA bombing? College students with iPhones proving to be poor witnesses...ripped from the headlines and then tossed in a blender. Or to keep current, juicer. I finished it at last. And it was not a long book. And it was not, according to what I hear, even close to the caliber of writing that Stone made his name with. For which I am, despite being out the price of the book, glad to know."}, {"userName": "Alexandria", "userReviewDate": "Nov 09, 2013", "userURL": "http://www.goodreads.com/user/show/7502058-alexandria", "userReview": "I definitely had the wrong idea about this book. I thought I was getting a crime thriller, maybe some mystery, a little romance. Instead, I found this philosophical rambling much more boring. I don't mind authors who spend a lot of time on character development, but I still didn't understand the characters by the time I turned the last page. Some of the scenes and descriptions were so vague, I'd have no clue what was going on or what author Robert Stone was referring to until it was referenced more straightforwardly several chapters later. Rather than focuse on Maud, the young collegiate who is the main character, or Steve Brookman, the professor with whom she's having an affair, Stone jumps from character to character — Maud's roommate, the roommate's crazy ex-husband, a former nun who does have some sort of mysterious history in Latin America (but I was too confused to know what it was). It was a struggle to get through this book. And the main plot point — who killed Maud — was wrapped up in a couple short paragraphs. At that point, I didn't even care who killed her."}, {"userName": "Abby", "userReviewDate": "Dec 02, 2013", "userURL": "http://www.goodreads.com/user/show/6843326-abby", "userReview": "A bright, beautiful, troubled student at an elite New England college is dumped by her professor-lover after he learns that his wife is pregnant. When the girl dies in an apparent hit-and-run, there is some question as to whether it was an accident. Might her aggressive diatribe against anti-abortion protesters have been a factor? The professor? In a Robert Stone novel, you don't expect a thriller. You expect contemplation of moral and spiritual questions, characters wracked with guilt and ambivalence. Check. What suspense there is is of the psychological rather than the whodunit variety. There are interesting secondary characters, well-drawn atmospherics of a fading town and its uneasy relationship with the pristine institution in its midst, and mostly first-rate writing. The pages turn easily. But “Death of the Black-Haired Girl” not only isn't a thriller. It isn't much of anything else either."}, {"userName": "Mike", "userReviewDate": "Dec 10, 2013", "userURL": "http://www.goodreads.com/user/show/18173547-mike", "userReview": "I found this book to be a waste of my time. It is self-indulgent and pretentious. The author apparently wants to communicate a few randomly associated opinions he has (regarding religion, abortion, drugs, police, higher education) and has combined them with chewing gum and post-it notes. The plot is thin and stressed by the number of ornaments Stone has decided to dangle from its weak limbs. The descriptions are often just attempts to show off how good he is without advancing the story, the setting, or the understanding. Overall, this felt like the first novel of a not-very-good author, or even an undergraduate writing thesis. So, I checked the jacket blurbs to get some more info on the author and found out that he is \"considered one of America's greatest living authors\". I only have two explanations for that: we are very short of authors, or he wrote the blurb himself."}, {"userName": "Barbara", "userReviewDate": "Sep 20, 2015", "userURL": "http://www.goodreads.com/user/show/34701366-barbara", "userReview": "This is probably the worst book I have ever read, as I can not think of one redeeming quality. As I was reading this, the question running through my mind was \"how could this have been published?\" This book was terrible, for MANY reasons. A brief sample:1- The dialogue was absolutely ridiculous, especially between Maud and Brookman (most cringeworthy) and Maud and her roommate. Being only a few years older than Maud, I can clearly remember my college years and I can absolutely guarantee that my friends and I never spoke like that. 2- Related, partially due to the language, I kept feeling like this book took place in the 70s or 80s, only to have the author specifically reference the year as 2004. The dialogue, the clothes that the characters are described as wearing- everything screams of decades past. I want to open my book to describe specific examples, but I also can't imagine opening that book again.3- The attitudes towards abortion again feel out of place in a liberal arts college in New England in 2004. Considering the absolute uproar that Maud's (poorly written) article (in a college paper, that apparently EVERYONE read) induces, this again made me feel like I was reading a book set a few decades ago. In such a setting, the fact that people were literally travelling to this college to harass a college student seemed ridiculous. 4- The fact that literally everyone can find something in this book to be offended by. Again, I don't want to go back through this book, but off the top of my head: the casual attitudes towards the mentally ill just wandering through the college, the indifference towards the town's supposedly huge homeless population (only mentioned on a surface level, as they only served to hit on Maud as she walked by), Brookman's attitudes towards his wife's religious sect in Alberta, the absolute dismissal of the roommate's mentally ill, abusive husband and the lack of concern of those around her concerning his violations of the restraining order...and I can still go on.5- The misleading title/blurb on the back of the book: don't be fooled in to thinking this is about a student who dies shrouded in mystery, or think that her affair with her married professor will make this any sort of a suspense novel. There were so many random plots inserted, and at some point I just stopped caring. I got this book for maybe $3 in the cheap bins at the book store and I can't even recommend buying it then. Judging by other reviews, it seems that this author has other, far worthier novels that someone looking to read this book should probably choose instead."}, {"userName": "Megan Folse", "userReviewDate": "Jan 04, 2016", "userURL": "http://www.goodreads.com/user/show/30206073-megan-folse", "userReview": "I was going to write this review later, but I can't sleep. The longer I think about this book, the more I hate it. What gets under my skin, more than the book itself, are the reviews oozing praise for this book from some of the major newspapers. Then I check GoodReads and see that many other readers agree with me. Thank god!My first hint that this book would not make it onto my favorites list was when the lovely Maud gave dear professor a blowjob. It was like a scene from a cheesy porno; all that was missing was the plaid skirt. \"I bet a man wrote this.\" Hey, look! I was right!Except for the professor, the characters were lifeless shells. Maud, who was supposed to be intelligent, was an absolute pinhead. The counselor was flat as a pancake-very little dimension. Even Maud's grieving father toed the line between real and a robot.I understand what Stone was trying to accomplish with the religious references, the highlighting of hypocrisy directly and indirectly, the edges between where sin begins and ends, and everything else. At least, I think I do. He never quite reaches his goal, whatever it is, and instead splinters the story in a dozen directions. Each direction ends in a pointless mess, and the book closes with a weak attempt to bring it all together."}, {"userName": "Pauline Viskup", "userReviewDate": "May 15, 2014", "userURL": "http://www.goodreads.com/user/show/15403283-pauline-viskup", "userReview": "Read this for my book club. None of us cared for this book. It was a big disappointment."}, {"userName": "Nicole", "userReviewDate": "Feb 04, 2014", "userURL": "http://www.goodreads.com/user/show/41580-nicole", "userReview": "That one star is based on the first half of the book, which was all I could take."}, {"userName": "Bill Talley", "userReviewDate": "Dec 09, 2015", "userURL": "http://www.goodreads.com/user/show/10048551-bill-talley", "userReview": "Deeath of a Black Haired Girl reads as easily as a murder mystery, while tackling some very big issues. In the end the book is not merely about the death of the black haired girl, a college student who wades into the abortion issue. The book is ultimately about how we as individuals choose what has meaning for us and whether ultimately that choice is meaningful at all. On a micro level the book seems to suggest that very little of what we believe or hope for has much affect on our fellow beings. However, it is more about the striving for meaning that is more important than anything else. This issue is played out through the question of abortion. Maud Stack, (the black haired girl) writes an article in her college paper about the despicable conduct of anti-abortion zealots. She is particularly galled by the photos protesters use to scare women away from getting abortions. Thus, she finds photographs of horribly deformed children who were born and suggests that God does a pretty good job of aborting children as well. (Some of the live births only last for a few minutes or hours.) This of course agitates the anti-abortion crowd. There are several candidates the police could look at for the crime. But there are characters in this book with varying degrees of religious morality and it dawns on the reader that there is indeed a lot of gray area in this debate no matter how strongly you might feel about one side or the other. As with most other major issues, the movement appears much different when one focuses on or has a relationship with individuals. Movements seem to create an inertia of there own that simply may be too big for individual actors, who are nonetheless cogs in the machinery. If they want to be a part of the movement, they are part of the machine. It becomes very difficult to have a meaningful dialogue under these circumstances. The police search for the usual suspects until the crime is solve. But is not how the crime is solved that is the focal point of this book. Rather the book ask us to question why we do what we do and whether there is ultimately in meaning in our daily lives at all."}, {"userName": "Simon", "userReviewDate": "Jul 20, 2015", "userURL": "http://www.goodreads.com/user/show/1937720-simon", "userReview": "1.5 stars.... Stone's final novel is a busy mess of a book, one that never pauses to develop the character at its center. College student Maud Stack is by turns an alcoholic, a firebrand writer for the campus newspaper, and the lover of a professor. It's Maud's death that sets the story in motion, but Stone is only interested in her as a set of behaviors that cause reactions in others. The world Robert Stone sets this novel is resolutely depressing, and Stone doesn't hesitate to pile on. Recently released mental patients roam the streets near Maud's campus alongside angry pro-life marchers, and it's a rant about the marchers (one that no newspaper, college or otherwise, WOULD EVER PRINT) that provides the most likely reason for Maud's death. There's also a mention of the robbing of dead bodies at Ground Zero and counselor whose work with radicals in Mexico Stone uses for digressions that add nothing. In the end there's a meeting between two men central to Maud's life, and we realize Stone's point. Robert Stone, for all his facility as a writer, was incapable of putting himself inside the head of a young woman c. 2015. What we have here is a novel about the Sadness of Men. Not recommended."}, {"userName": "Skip Ferderber", "userReviewDate": "Feb 14, 2014", "userURL": "http://www.goodreads.com/user/show/5928376-skip-ferderber", "userReview": "First there was film noir, now there is college noir. A distinguished writer turns Harvard into Sin City (I'm looking at you, graphic-novel-turned-incomprehensible-movie). I tried hard getting into these characters, into that dark college that we know to be Harvard but, coyly is Not Named. I tried holding on through sad nuns, room mates with far too much back story, infidelity, young writers who truly did need an editor (what a badly written diatribe), the alcoholic emphysema ex cop morning his wife and awaiting death, the (gasp) Mourner... After the central character gets thrown under the bus (I'll leave it to you to read other reviews and figure out what actually happens), I stopped reading in mid-book and said to myself, \"Self, WTF is going on here, and furthermore, do I really care?\" The only upsides for me are, 1) that I understand that Stone is a much-revered writer and I'm willing to give his works another chance (\"Dog Soldiers,\" e.g.) and, 2) I'm glad I borrowed this book from my local library instead of buying it. I may commit the unforgivable sin of skipping to the last few pages just to bring this sorry tale to an end. Or I may not."}, {"userName": "Tony", "userReviewDate": "Jan 14, 2014", "userURL": "http://www.goodreads.com/user/show/1361000-tony", "userReview": "DEATH OF THE BLACK-HAIRED GIRL. (2013). Robert Stone. ***.I admire Stone’s writing skills, but this, his latest novel, left me cold. Although well written, I’m not sure what it was about. The plot is straight-forward: A young college professor has an affair with one of his students; unfortunately, he is married with one child and another on the way, and he has to break the relationship up. The student doesn’t want that to happen and threatens to break up his marriage in a forceful way. An accident occurs during which the student is run over by a car while she is arguing with her professor. The effect of this on her father, the professor, the professor’s wife, and a counselor at the school is fully explored. To add to this, the student had just written a screed against the anti-abortionists who had been demonstrating on campus. Now we have the involvement of both the pro and anti movements of this topic as part of the plot. Stone’s works should definitely be read, but this one was certainly confusing for me."}, {"userName": "Maree", "userReviewDate": "May 28, 2014", "userURL": "http://www.goodreads.com/user/show/5001811-maree", "userReview": "Depressing, but interesting in how it outlines the fallout from the death of one girl. I don't think that's a spoiler, seeing that it's in the title that she's going to die. But it's interesting that the reader is allowed to get to know her a bit before she actually dies, with the knowledge that she is going to. And you can't help but like her, not because she is a kind and sweet person, but because of her edges and because she wants what everyone wants out of life.Definitely an interesting read. It was especially harsh to read about her father, who was a policeman there on 9-11 and doesn't expect anything for all the crap that got in his lungs. He doesn't even bother to go to the doctor; he's just pretty much given up.This is one of those books where every character has a deep background, and it was great to read about her roommate and her husband issues as well as the counselor and her history with other girls and before she came to the school."}, {"userName": "John Pappas", "userReviewDate": "Nov 12, 2013", "userURL": "http://www.goodreads.com/user/show/5899347-john-pappas", "userReview": "While it would be reductive to see Stone's latest novel as simply a post-9/11 allegory, the campus Stone describes is a petri dish for a study in the tensions between passion and responsibility, and the consequences ofliving without limits to one's personal power. He limns the edges of freedom and security in personal and political ways (vis a vis his particular brand of conflicted Catholicism and justice), but never hides behind false-seeming allegory. Fast-paced and multi-faceted, Stone's narrative investigates the complex moral universe his characters inhabit with all of the accompanying rationalizations and justifications that go along with their passions. Despite the complexity of characterization, messy, unresolved strands of narrative spin out from the center of the narrative and do not addmuch to the thematic content or forward motion of the plot. That's the way the world is, however, and Stone embraces it in all its divergent chaos. Solid."}, {"userName": "Paul", "userReviewDate": "Feb 09, 2014", "userURL": "http://www.goodreads.com/user/show/787522-paul", "userReview": "Pretty fantastic. At times incredible. My first Robert Stone novel, and won't be my last. The titular event occurs about halfway through the novel, and it does suck a little life out of things. What began as an almost sprawling book gets pretty focused, and I missed the anything-can-happen nature of things. This seems to be billed as a thriller or a sort of genre novel in certain places, but aside from some serious exposition (esp. in character introductions), it reads like pure high lit. Some really great moral questions handled here, most of it woven into the story brilliantly, some of it just straight-up explicit. The end gets a little moralizing, actually, and things wrap up nicely in an almost Hollywood sort of epiloguey way, but still, this was a great book. Spectacular first half, good second half."}, {"userName": "Alison", "userReviewDate": "Jan 22, 2014", "userURL": "http://www.goodreads.com/user/show/3310069-alison", "userReview": "I actually don't even think this book deserves the one star, but there were no choices for no stars. After reading a review in one of my magazines, I thought this is going to be a good one! Well, I stopped reading after the few chapters. It just didn't hold my attention and the writing was nothing like how the review made this story out to be. But even more annoying than the writing was the character's name. Maude. Really? Maude for a young girl? I just couldn't get the picture of her in my mind as a Maude. Oh well. Disappointed in this one."}, {"userName": "Alexis", "userReviewDate": "Feb 07, 2014", "userURL": "http://www.goodreads.com/user/show/7164737-alexis", "userReview": "This book was very hard for me to finish. To me there wasn't much character development to create an interest in ANYONE in the book; however, Stone provides backgrounds on a lot of characters and I'm still trying to figure out the purpose for these pages. I'm just dumbfounded and completely confused. Example: I don't understand the reference to the mentally ill gentleman who is found roaming campus. What is his purpose? He has nothing to do with Maud or the what I believe the plot to be. Very strange book. I would not recommend this book to anyone."}, {"userName": "Joan Cobb", "userReviewDate": "Jan 09, 2014", "userURL": "http://www.goodreads.com/user/show/3970741-joan-cobb", "userReview": "Again I was hoping for a Robert Stone book that I would like as well as his earlier novels. Unfortunately this was not it. Is it a new trend to write novels full of characters about whom none are nice or sympathetic or that the reader even cares about? In addition this one attempts to comment about the Catholic Church, abortion, homelessness, self-absorbed college students as well as their professors. Fortunately it was short but not recommendable."}, {"userName": "Larry", "userReviewDate": "Feb 23, 2015", "userURL": "http://www.goodreads.com/user/show/2068224-larry", "userReview": "Bob Stone does not miss, when it comes to middle-class Catholic lives. While he didn't write a mystery pageturner like this one typically, in Death of the Black-Haired Girl, he out-Lehanes Dennis Lehane. The plot may be a bit thin, thus the four, not five stars, but there is so much delicious writing here to leave your head spinning. He is sorely missed."}, {"userName": "James", "userReviewDate": "Nov 16, 2013", "userURL": "http://www.goodreads.com/user/show/5157420-james", "userReview": "A great disappointment. I enjoyed his other books, especially his short story collection. This book is ruined by a strange obsession with 'right to lifers' and the Catholic church. If Stone just couldn't help going on about these pet peeves, he should have done it in essay form. It all seems forced and not holistic with the story."}, {"userName": "Mandi Bean", "userReviewDate": "Sep 05, 2013", "userURL": "http://www.goodreads.com/user/show/10272851-mandi-bean", "userReview": "The tone is pretentious and the prose seems bent on alienating non-academic readers. The elitist undertone suggests anyone who did not attend college is unworthy of anything fortunate and/or psychotic. The symbolism is heavy handed and the allusions try too hard to be impressive. Some scenes are so terribly vague and out of joint that reading the text is more frustrating than enjoyable."}, {"userName": "Brad Hayes", "userReviewDate": "Nov 26, 2013", "userURL": "http://www.goodreads.com/user/show/2091718-brad-hayes", "userReview": "I grew disappointed with this work after about 50 pages, but I kept reading all the way to the end, hoping that a compelling story would emerge from the book. It did not."}], "description": "In an elite college in a once-decaying New England city, Steven Brookman has come to a decision. A brilliant but careless professor, he has determined that for the sake of his marriage, and his soul, he must extract himself from his relationship with Maud Stack, his electrifying student, whose papers are always late and too long yet always incandescent. But Maud is a young woman whose passions are not easily contained or curtailed, and their union will quickly yield tragic and far-reaching consequences.As in Robert Stone’s most acclaimed novels, here he conjures a complex moral universe where nothing is black and white, even if the characters—always complicated, always compelling—wish it were. The stakes of Brookman and Maud’s relationship prove higher than either one could have anticipated, pitting individuals against one another and against the institutions meant to protect them.Death of the Black-Haired Girl is a powerful tale of infidelity, accountability, the allure of youth, the promise of absolution, and the notion that madness is everywhere, in plain sight.", "title": "Death of the Black-Haired Girl", "url": "http://www.goodreads.com/book/show/17165876-death-of-the-black-haired-girl", "average": 2.67, "cover": "https://images.gr-assets.com/books/1358995674l/17165876.jpg", "reviews": 222, "authors": [{"url": "https://www.goodreads.com/author/show/41938.Robert_Stone", "name": "Robert  Stone"}], "type": ["Fiction", "Mystery", "Abandoned", "Thriller", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/17165876-death-of-the-black-haired-girl", "http://www.goodreads.com/book/show/18222837-death-of-the-black-haired-girl", "http://www.goodreads.com/book/show/18930663-death-of-the-black-haired-girl", "http://www.goodreads.com/book/show/380364.Dog_Soldiers", "http://www.goodreads.com/book/show/196337.Damascus_Gate", "http://www.goodreads.com/book/show/241951.A_Flag_For_Sunrise", "http://www.goodreads.com/book/show/241953.Outerbridge_Reach", "http://www.goodreads.com/book/show/324987.A_Hall_of_Mirrors", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}