{"ratings": 1293, "userreviews": [{"userName": "Mikey T", "userReviewDate": "Mar 22, 2011", "userURL": "http://www.goodreads.com/user/show/4948700-mikey-t", "userReview": "Deeper Reading should have been titled Teaching Reading for Dummies. Ideally, all teachers want students to walk into class already knowing how to make meaning from the text, revisit it a number of times to deepen their understanding, make metaphorical and reflective connections, and to venture from the text to other texts. But, sadly, this is hardly ever the case. We, as teachers, are the ones responsible for teaching this set of skills that will enable to become frequent and better readers as adults.  When reading this book, I found it important to make sure students see why they are learning the things they are learning. Providing a background and a point of reference for students to use is vital in teaching students deeper reading/learning. When Gallagher used his example of his teacher and the students’ writing, it helped the students see the connection between their lives and the text. It is important for students to make a connection so they can see the relevance in what they are learning. Gallagher once again provides many different and insightful ways to get students to approach texts. He gives us many great exercises to help further students’ understanding, generate focus, achieve deeper comprehension, and establish metaphorical connections. I will gladly say that I plan on using some of his exercise ideas in my own classroom. More importantly, I can see many ways to create new exercises from the examples he has provided.  Gallagher once again makes this text easily approachable because of his style of writing. He has an easy-going, anecdotal way of explaining himself.  Like his other book, Readicide, I would recommend this book to future, current, and former teachers. It ties in well with Readicide. This book was extremely helpful and inspirational. One last thing this book taught me - By knowing what you want to achieve at the end of your lesson, you can come up with interesting and creative ways to effectively get there."}, {"userName": "Laura Leaney", "userReviewDate": "Aug 19, 2015", "userURL": "http://www.goodreads.com/user/show/3633494-laura-leaney", "userReview": "I hovered between a rating of 3 and 4 stars on this. The book has value for English teachers, but like many books chock full of \"activities\" to elicit deeper meaning from text, it's a little dry, especially on the back end. I like Gallagher's sensibility though. I would trust him as a reader, because he knows that \"reading is not an all-or-nothing proposition. There are gray areas.\" I wish someone would tell the people at Common Core. I also agree with his stance that \"learning begins when we encounter confusion.\" What happens, especially for young students in the school system, is that they feel like they ought to know what the text \"means\" right away. (Picture here a kid with his or her head dropped on a desk, shoulders hunched in despair). It would be very helpful if young people could \"welcome and embrace confusion.\" I agree. When I read Kant or Kierkegaard I encounter confusion every five minutes. Additionally, I admired his advice on: re-reading, using metaphor to deepen understanding, and providing a sense of purpose. More information on reading the internet, art, and history would be helpful. Minor quibbles. If you teach high school, as I do, and you find yourself with some dependent readers in your classroom, this book will be of significant benefit."}, {"userName": "Dawn", "userReviewDate": "Feb 07, 2011", "userURL": "http://www.goodreads.com/user/show/286002-dawn", "userReview": "Typically, I am wary of books written from a high school teachers' POV because I feel so much will not be applicable to my very different elementary school universe. This book, however, is filled with ideas for me to try in lessons and in guided reading groups with my fourth graders. I love how Kelly Gallagher writes and love the points he makes about reading instruction. Some of it was beyond my upper elementary school realm, but overall, I'm glad I read it and I'm sure I will continue to refer to the growing list of ideas I've gathered from it."}, {"userName": "Sarah Gross", "userReviewDate": "Jan 12, 2011", "userURL": "http://www.goodreads.com/user/show/2897655-sarah-gross", "userReview": "Must-have resource for all middle and secondary school English teachers!"}, {"userName": "Kate", "userReviewDate": "Jul 28, 2012", "userURL": "http://www.goodreads.com/user/show/3193723-kate", "userReview": "I picked up Kelly Gallagher’s Deeper Reading after reading Gallagher’s Teaching Adolescent Writers. I, like many other teachers, view Gallagher as a teacher rock star, and Deeper Reading does not disappoint. What I like about Gallagher is that he knows what works for teachers because he is a teacher. While his methods are clearly deeply rooted in theory and research, Gallagher presents these methods in a conversational tone, and his books read like a really good teacher-friend giving you practical advice about what works well and what makes learning fun.\tOverall, Deeper Reading focuses on reading as a process. He emphasizes that our first-draft reading, much like our first draft of writing, only scratches the surface of meaning and understanding. The book is focuses on six components of deeper reading: focusing the reader, effective first-draft reading, deepening comprehension through second-draft reading, the importance of collaboration, using metaphor to deepen comprehension, and leading students to meaningful reflection. What’s great about Gallagher is that rather than focusing on why each component is important, he provides the reader with a variety of strategies to help engage students in each part of the reading process. For example, in the section “Focusing the Reader”, one of the strategies I can’t wait to try is the daily focus question (p. 46). Rather than giving students a “gotcha!” reading check quiz that really only tests their first draft of reading (which they probably did while watching Jersey Shore, or something of equal intellectual merit), you provide students with a guiding question that either deals with a major theme from said reading or helps to guide students into one of the major ideas students will be focusing on in their closer reading of the text. Gallagher even cites Sheridan Blau’s three key questions (What does it say? What does it mean? Why does it matter?) (p. 86) and expands on various ways to get students to tackle these questions on their own.\tGallagher is quickly becoming my 2nd choice go-to-guy for ways to shake things up in my classroom. (My first love is Jim Burke, and first loves die hard.) I highly recommend Deeper Reading."}, {"userName": "Carrie", "userReviewDate": "Jun 09, 2011", "userURL": "http://www.goodreads.com/user/show/2995746-carrie", "userReview": "Another Gallagher blockbuster! Deeper Reading explores how teachers can get kids to not just fake read or highjack others who have done the work. He sets up the justification for incorporating choice and an open-workshop type atmosphere in the classroom. He also touts the idea of giving kids the space and time to read in the classroom. Great practical ideas that I can see readily incoporpating into my own classroom."}, {"userName": "Mark", "userReviewDate": "Feb 02, 2011", "userURL": "http://www.goodreads.com/user/show/1274105-mark", "userReview": "Good companion piece to Gallagher's Readicide, in that this work offers some concrete suggestions to help alleviate the issues that Readicide highlights. Gallagher's work can be compared to Kylene Beers and Chris Tovani, and he writes in an easy, conversational style (peppered with baseball analogies and anecdotes), that makes it easy - I think - for beginning teachers to imagine how to use these techniques with students. I'll plan on using this text again in the future."}, {"userName": "Heather Munao", "userReviewDate": "Jul 20, 2016", "userURL": "http://www.goodreads.com/user/show/29797705-heather-munao", "userReview": "This book offered a philosophy (first draft reading and second draft reading) which makes sense when you think about how nicely it connects to what we try to tell kids about editing, drafting, etc. He offered a lot of suggestions/strategies for \"second draft\" reading ideas. I put bookmarks all over it! Gallagher really makes me want to be a great teacher."}, {"userName": "Mrsandrukat", "userReviewDate": "May 27, 2012", "userURL": "http://www.goodreads.com/user/show/6970682-mrsandrukat", "userReview": "Amazing I will use it every time I plan a new unit!"}, {"userName": "Kristin", "userReviewDate": "Jan 12, 2011", "userURL": "http://www.goodreads.com/user/show/282288-kristin", "userReview": "Great book....awesome strategies I can use tomorrow, next month, next year. Quick read, entertaining, and insightful. Recommend for all teachers, not just ELA."}, {"userName": "Jeni Enjaian", "userReviewDate": "Jan 17, 2018", "userURL": "http://www.goodreads.com/user/show/4680796-jeni-enjaian", "userReview": "Unlike \"Readicide,\" this book is designed for deep study, pun intended. I intend to pull this book back out this coming summer as I work on redesigning my lessons for the next school year. (As long as I am still teaching ELA and the same grade level...if I teach something else next year I will be designing the lessons rather than redesigning them.) I love Gallagher's approach to teaching literature. I would have loved to have been one of his students. That is not a slam against my own high school English teachers. Although I do not remember my freshman English teacher, I dearly loved both my sophomore and junior year teacher as well as my senior English teacher, primarily because what I love about them is that they used techniques such as the ones advocated by Gallagher in their own lessons. Although in the future I hope to transition to teaching History, as long as I teach English, I want to be the best English teacher I can be. Careful study and application of this book and the concepts expounded upon within will go a long way.I highly recommend this book to all teachers, especially English teacher."}, {"userName": "Jenny", "userReviewDate": "Mar 07, 2018", "userURL": "http://www.goodreads.com/user/show/177754-jenny", "userReview": "I've been teaching English for about 20 years, and I read this book seeking ways to help aid struggling readers, something I've been seeing more and more recently. He has very concrete steps to help students read texts better. I like how he refers to reading as \"first draft\" and \"second draft\" readings, and I can see using t-charts, essential questions, key words, and metaphors in the texts I teach. I'm not sure I agreed with him on multiple choice tests being too basic--you can construct higher-level thinking multiple choice questions that ask kids to analyze and not just recall--and I'd like to see the later chapters updated (he references using calling cards for long-distance calls and doesn't mention social media at all. Still a good, practical tool for teachers with many resources to assist students in becoming better readers."}, {"userName": "Jacki", "userReviewDate": "Nov 10, 2017", "userURL": "http://www.goodreads.com/user/show/306690-jacki", "userReview": "Everything in this book works hand in hand with Reading Apprenticeship and in many cases, I'm finding the same thoughts and ideas in both. What I like most about this book, however, is the specific examples and clear ideas for application. It's very inspiring. I have already taken his strategies into the classroom with great results with my kids. The activities are fun and engaging and it's really helping my struggling readers to dive back into the text."}, {"userName": "Elaine", "userReviewDate": "Jan 25, 2018", "userURL": "http://www.goodreads.com/user/show/71958575-elaine", "userReview": "Gallagher does a great job teaching how to teach literacy. With this text, I believe I can add many strategies into my classroom and I'm excited to have this book on my shelf as a reference when I feel unmotivated or non creative."}, {"userName": "Angie", "userReviewDate": "Jun 04, 2017", "userURL": "http://www.goodreads.com/user/show/20803595-angie", "userReview": "This is a wonderful book that shares some wonderful insights into how to teach older readers to read more deeply. I loved that the strategies shared are not complicated and will be easy to implement!"}, {"userName": "ATB", "userReviewDate": "Jul 06, 2017", "userURL": "http://www.goodreads.com/user/show/69212301-atb", "userReview": "Invaluable"}, {"userName": "Anna Dunlap", "userReviewDate": "Jun 01, 2018", "userURL": "http://www.goodreads.com/user/show/82589987-anna-dunlap", "userReview": "Loved this book! Every teacher should read this one!"}, {"userName": "Kristin Bateman", "userReviewDate": "Feb 25, 2017", "userURL": "http://www.goodreads.com/user/show/2533313-kristin-bateman", "userReview": "I was assigned this book for a graduate class I'm currently taking, and didn't have the highest expectations because well, 1.) It's a \"school book\" and 2.) Teachers are horrible students, in general. My mind was blown! This text is INCREDIBLE and has so much to offer that will totally shift how I teach reading, and I admittedly have been teaching for fifteen years. What floors me even more is the copyright is 2004...and what Gallagher was suggesting was unheard of in pedagogy at the time. Now what Gallagher is suggesting in very much the shift education saw about five years ago. This is an essential text for any teacher of the humanities."}, {"userName": "Jamie", "userReviewDate": "Jul 14, 2015", "userURL": "http://www.goodreads.com/user/show/26662937-jamie", "userReview": "I liked this book, but I couldn't fall in love with it in the same way I do about works by Penny Kittle or Donalyn Miller. I acknowledge that may be too high a standard for a pedagogical text, but there it is. This book is highly practical, so it's valuable in that it offers a large number of activities that can be applied to different types of texts, and while his examples often target high school students (or adults), they illustrate how the ideas might be adapted for younger students.One slight drawback is that some of the references are outdated (newspaper activities would almost certainly be online and not pulled from paper copies; technology use has evolved), but that's true for most books that offer specific instructional ideas that relate to technology in any way.The section with fiction activities seemed to contrast with the ideas I've read elsewhere about prioritizing reading and discussion time, rather than doing vocabulary activities and charts and so forth. He offers examples with whole-class (or small-group) novels, too, which is different from work with independent reading selections. I appreciate his caution about not relying on any one activity or strategy with students to avoid making it stale, and he is certainly not an advocate for worksheet machinery or graphic organizer overkill. I also appreciate the idea that teachers need to dig in and provide support for readers, instead of just sending them off on a reading journey and wishing them bon voyage, and these activities offer concrete ideas about how to do that. However, every time they are completing a chart - even an open-ended one - students are spending less time actually reading. The assignments can be great springboards for peer discussions and they can help focus students on particular literary devices; it's just a balancing act (as always) to ensure students have time for independent reading and have time for explicit instruction. My favorite sections were about the importance of metaphorical thinking and the ideas for supporting students in their thinking about \"real-world\" texts, which could include \"reading\" a commercial, a piece of art, an editorial, a statistic, or a political cartoon. While many of the strategies for fiction were familiar to me, this section sparked lots of new ideas that could be applied in different subject areas. His point that we want students to be able to read both what is said and unsaid in texts they encounter as adults is well-taken.The metaphorical thinking section encouraged me to take more time with themes and big picture thinking skills for all my students. Even though some of my fifth grade students aren't as prepared to process metaphors as high school students might be, this book reminded me how worthwhile it is to dig in to the complexity of a text for all sorts of readers. I think there are many more things I can do with my students to get them to think more deeply about things they read, and this offered some excellent starting points."}, {"userName": "Claudia", "userReviewDate": "Feb 23, 2011", "userURL": "http://www.goodreads.com/user/show/70211-claudia", "userReview": "Kelly Gallagher is one of a handful of professional writers I'll drop everything to read. I did...\"Readicide\", I think, is one of the most important books an English teacher could read. He gives us so many powerful, practical ideas here that support his views about avoiding over-teaching and under-teaching literature.Gallagher thinks in metaphors, writes in metaphors, and teaches with metaphors. He has packed this book with great ideas, not all of them new, but great ideas to facilitate student learning.I love the idea of the first draft reading and second draft reading. He recognizes the importance of reading all kinds of texts, and his lesson for teaching Pieter Brueghel's \"The Fall of Icarus\" makes me want to be in his class.Gallagher distills his teaching and planning down into four questions: 1. Without my assistance, what will my students take from this reading, 2. With my assistance what do I want my students to take from this reading. 3. What can I do to bridge the gap between what my students would learn on their own and what I want them to learn. and 4. How will I know when my students get it. Those questions and his strategies of focusing the reader, first draft reading, second draft reading, collaboration, metaphorical responses and reflective response...A template like that could take us through all our literature teaching.As I said, many of his suggested activities are not new -- I've 'invented' some of them, other teachers I've worked with have 'invented' them. Gallagher put them into a framework -- his four questions. He knows when and why he uses each strategy.Since my job is different now with my elective, it's harder to incorporate some of the activities, but the mindset, the attitude, the love for students and for their literacy growth? Oh, we share those."}, {"userName": "Debbie", "userReviewDate": "Feb 07, 2011", "userURL": "http://www.goodreads.com/user/show/598468-debbie", "userReview": "I have owned a copy of this book for several years, and I've flipped through it for inspiration here and there, but I'd never read it cover to cover until recently. I began before Christmas, reading a few pages between school visits or during lunch, and just finished today. Because of the disjointed way I read it, I think I was able to let a lot more sink in than if I read it straight through, as I have other Gallagher (and teacher/writer) books. Inbetween activities and pages, I had opportunities to meet with teachers, share the ideas included, try them out myself, and see the results. In that way, I have a much better feel for the usefulness and value of the philosophy Gallagher lays out here and the reason his methods will actually lead students to stronger understandings and connections to their reading.I especially liked the way Gallagher's activities and examples get at the ways that reading (specifically literature) does not always fit a comfortable, easy graphic organizer. To illustrate his belief, the dominoes, multi-layered time line, and seen/unseen activities are so much more flexible and honest than other forms of note-taking/GO that I've used with students. I am also glad to see sections related to reading visuals, statistics, charts, and other \"texts\" that are becoming more prevalent and more misleading in today's publications.There is no doubt that I'll come back to this book again and again."}, {"userName": "Lablover", "userReviewDate": "Mar 24, 2016", "userURL": "http://www.goodreads.com/user/show/6174540-lablover", "userReview": "I don't know if it's from more than twenty years of teaching special education or the fact that I have taught every level from preschool through high school but I didn't find this book illuminating. Gallagher talks about focusing the reader and activating prior knowledge as if this is something new. I learned that as an undergrad and was required to demonstrate it in lesson plans during student teaching in every lesson. The strategies that he presents, for the most part, are \"old hat\" to me. Gallagher talks about groups, effectively breaking students up and how to keep them engaged. Well, Mr. Gallagher needs a Kagan's cooperative learning workshop. I learned that in 1990 when I started teaching. This information is hardly revolutionary. However, elementary teachers and special education teachers are strategists by profession, whereas high school teachers are more content experts. Gallagher also talks about when he has created assessments in the past he would think of what his students learned and what they may have \"overlooked\". Rather than assessing what he taught! I find this appalling! Why would you put something on an assessment that you hadn't taught? He calls this \"fuzzy\" teaching. How does he NOT know what he taught? Does he not have unit plans? Does he not have lesson plans? What about his notes, handouts etc? Doesn't he keep track of these? I am surprised by all of the 4 and 5 star reviews for this book."}, {"userName": "Alex Harrow", "userReviewDate": "Dec 28, 2013", "userURL": "http://www.goodreads.com/user/show/3502158-alex-harrow", "userReview": "The thing I love most about Kelly Gallagher's books is how he offers hands-on ideas that I can directly apply to any of my classes. He doesn't just theorize (in fact he actually theorizes very little). Instead, he structures his books into chapters that have a clear focus and give specific ideas that are often connected to specific literary or nonfiction examples - and he presents them in an engaging way that makes his books into the ultimate stimuli for my teaching brain. So far I've read \"Write Like This\", \"Readicide\", and now \"Deeper Reading\" with \"Teaching Adolescent Writers\" still sitting on my shelf to be read shortly. I've blazed through \"Deeper Reading\" in one sitting, in a matter of hours, it was that engaging and well-written. And the best part? At this point I really thought that some of Gallagher's ideas would be outdated or repetitive since he has written quite a number of books on the same subject matter and yet I am finding each of his books to be a new host of ideas of how to approach teaching students reading and writing. As a first-year English teacher, his books have not only been a huge curriculum-builder, but ultimately life-changing as they have changed my perspective and approach on teaching."}, {"userName": "GNOWP", "userReviewDate": "Mar 12, 2010", "userURL": "http://www.goodreads.com/user/show/3429369-gnowp", "userReview": "In Deeper Reading, Kelly shares effective, classroom-tested strategies that enable your students to:accept the challenge of reading difficult books;move beyond a \"first draft\" understanding of the text into deeper levels of reading; consciously monitor their comprehension as they read;employ effective fix-it strategies when their comprehension begins to falter;use meaningful collaboration to achieve deeper understanding of texts;think metaphorically to deepen their reading comprehension;reach deeper levels of reflection by understanding the relevance the book holds for themselves and their peers;use critical thinking skills to analyze real-world issues.Kelly also provides guidance on effective lesson planning that incorporates strategies for deeper reading.Funny, poignant, and packed with practical ideas that work in real classrooms, Deeper Reading is a valuable resource for any teacher whose students need new tools to uncover the riches found in complex texts.Cathy TanguisI love this book as well. It has great information for engaging readers and writers.--Laurie Williams"}, {"userName": "Kristin", "userReviewDate": "Feb 07, 2011", "userURL": "http://www.goodreads.com/user/show/4840408-kristin", "userReview": "As Gallagher mentions in \"Deeper Reading,\" he has come to think of himself more as a teacher of literacy rather than of literature. Between the two books (Readicide and Deeper Reading), issues of literacy have taken on an urgent tone. Literature may be able to effect profound change, but it's ultimately impotent if individuals are not able to read deeply, or read at all, for that matter. Gallagher's strategies, and the emphasis he places on the importance of including all types of text (Internet, advertisements, political cartoons, newpapers, SPAM, etc.), reinforce the idea that teachers need to prepare students to be informed citizens. I especially liked his idea of having a Newspaper Month, and a unit on advertising, and I think these two ideas would marry well with a novel such as 1984. The bringing together of literature and the text of the world is what makes reading a deeper experience. This book will get much use in the future."}, {"userName": "Christina Lear", "userReviewDate": "Mar 26, 2012", "userURL": "http://www.goodreads.com/user/show/5849555-christina-lear", "userReview": "This is truly one of the best books out there for teachers of English. Gallagher proposes that there is a difference between assigning reading and teaching reading, and then he lays out what actions teachers need to take to really guide students so they can engage with text on a more meaningful level than most classrooms reach.His recommendations are going to be more needed than ever as we all approach more rigorous texts with Common Core implementation. Fear not; this book is filled to the brim with specific strategies, explicitly explained and often pictured in the form of student examples. So helpful.Moreover, Gallagher is a fantastic writer who uses examples and metaphors masterfully to make this an enjoyable read for teachers. His vision of literature as a tool for engaging with contemporary issues is so empowering. This is the book I need to become the teacher I want to be."}, {"userName": "Theresa Maher", "userReviewDate": "Aug 02, 2008", "userURL": "http://www.goodreads.com/user/show/177210-theresa-maher", "userReview": "For my English teacher friends, this book is a must! While most reading books focus on how to help challenged readers, this one focuses on how to make meaning out of more difficult texts for average and above average readers. Gallahger's ideas are fresh, engaging and meaningful. With every chapter, I found a lesson or strategy that I can't wait to implement. Gallagher uses examples from novels that he himself has taught and sites them by name. I found specific strategies that tie directly to novels I teach. If you are tired of doing the same old thing in your class, and if you really want to spice things up for your students, this is the book for your class. Simply, it's the most useful teaching book I've ever owned."}, {"userName": "Beth", "userReviewDate": "Mar 21, 2012", "userURL": "http://www.goodreads.com/user/show/1434969-beth", "userReview": "STOP WHAT YOU'RE DOING. Do not teach another whole-class text again until you read DEEPER READING by Kelly Gallagher. I have been on a crusade for the past couple years that I would never teach another whole class novel again after I realized what it did to my love of reading in high school. I equated whole-class texts with the death of my love of reading. Kelly Gallagher has helped me to see that it doesn't have to be that way. There are so many wonderful lessons and activities that can apply to any whole-class text that will engage and get kids excited about discussing a book as a whole class. I still plan to use whole-class texts sparingly in my classroom but this book made me feel better about using them."}, {"userName": "Chris May", "userReviewDate": "Mar 06, 2015", "userURL": "http://www.goodreads.com/user/show/7404445-chris-may", "userReview": "A really solid book full of strategies, and assignments, for teaching kids the importance of reading and re-reading a text for different purposes to ferret out \"deeper meaning\" in a text (hence the title). I can see many of these assignments/strategies integrating into my Language Arts curriculum and pumping up the rigor in some of my other projects. Although this book seems more geared to high school, the lessons could be adapted to younger (and older) audiences pretty easily. And although he seems to teach a large number of whole class novels, the strategies could easily be used in a workshop or genre study model. This is a book that will keep coming off my shelf as I refer to it to improve/refine my curriculum"}, {"userName": "Kari S", "userReviewDate": "Jan 14, 2011", "userURL": "http://www.goodreads.com/user/show/4809561-kari-s", "userReview": "As a fairly inexperienced teacher this is the BEST teaching resource I have read to date. This resource has lots of helpful ideas and tips. It doesn't try to tell me what to teach or how to teach it, it reads more like a memior of what Ghallagher has done and what he has learned. Even though it is a book by a teacher for teachers, I felt like I was part of Ghallager's classroom, deciding for myself what I enjoyed and didn't enjoy about his teaching style. I appreciated the way he suggested texts his activities would work with, but also suggested ways to modify it for your own classroom. I found that to be the most helpful. I could identify with Ghallagher's style of writing and teaching, which made this book more enjoyable (and easy to get an A in my professinoal development class!)"}], "description": "Do your students often struggle with difficult novels and other challenging texts? Do they think one reading of a work is more than enough? Do they primarily comprehend at a surface-level, and are they frequently unwilling or unable to discover the deeper meaning found in multi-layered works? Do you feel that you are doing more work teaching the novel than they are reading it?Building on twenty years of teaching language arts, Kelly Gallagher, author of Reading Reasons, shows how students can be taught to successfully read a broad range of challenging and difficult texts with deeper levels of comprehension. In Deeper Reading, Kelly shares effective, classroom-tested strategies that enable your students to:accept the challenge of reading difficult books;move beyond a \"first draft\" understanding of the text into deeper levels of reading; consciously monitor their comprehension as they read;employ effective fix-it strategies when their comprehension begins to falter;use meaningful collaboration to achieve deeper understanding of texts;think metaphorically to deepen their reading comprehension;reach deeper levels of reflection by understanding the relevance the book holds for themselves and their peers;use critical thinking skills to analyze real-world issues.Kelly also provides guidance on effective lesson planning that incorporates strategies for deeper reading.Funny, poignant, and packed with practical ideas that work in real classrooms, Deeper Reading is a valuable resource for any teacher whose students need new tools to uncover the riches found in complex texts.", "title": "Deeper Reading: Comprehending Challenging Texts, 4-12", "url": "http://www.goodreads.com/book/show/432727.Deeper_Reading", "average": 4.41, "cover": "https://images.gr-assets.com/books/1328855555l/432727.jpg", "reviews": 141, "authors": [{"url": "https://www.goodreads.com/author/show/243747.Kelly_Gallagher", "name": "Kelly Gallagher"}], "type": ["Education", "Teaching", "Nonfiction"], "outlinks": ["http://www.goodreads.com/book/show/432727.Deeper_Reading", "http://www.goodreads.com/book/show/6012327-readicide", "http://www.goodreads.com/book/show/12503439-write-like-this", "http://www.goodreads.com/book/show/432726.Teaching_Adolescent_Writers", "http://www.goodreads.com/book/show/432730.Reading_Reasons", "http://www.goodreads.com/book/show/24796770-in-the-best-interest-of-students"]}