{"ratings": 967, "userreviews": [{"userName": "Maxine", "userReviewDate": "Oct 16, 2011", "userURL": "http://www.goodreads.com/user/show/3331599-maxine", "userReview": "This probably shouldn't have been the first book of the series to read, but... The mystery - who's killing defense lawyers in a hotel during a defense lawyer convention? - was interesting enough, but I had problems everywhere else in the book. Highlights of those problems? The POV changes from the main character (Theresa) to her cousin for no reason other than it's a really easy exposition shortcut. There's a half-hearted make out scene in the middle of the investigation (calling it the book's \"romance\" would be a total joke) that seems really out of character for one of the characters. Everyone is sexually attracted to everyone else...just because. The next book's case is so clumsily inserted into this book that it comes off as a blaring afterthought-turned-red herring. And, pet peeve, every few chapters, Theresa points out that \"this isn't TV - [insert name of csi test results] take more than a minute.\" (Although, frankly, after reading some passages, I wished things happened as quickly as they did on TV.) Overall, this felt like more of a first draft, than a fully fleshed out final copy. It's left me zip desire to read the first few books."}, {"userName": "Cindy Meilink", "userReviewDate": "Oct 02, 2011", "userURL": "http://www.goodreads.com/user/show/2644076-cindy-meilink", "userReview": "What fell a little short...First, this is not a fast-paced thriller. Second, there is not a sizzling romance to add to the interest. Third, I felt the characters weren't developed sufficiently to connect to them.What this book does offer is an onion-like approach to solving the murders of three defense attorneys killed while attending a convention at the Ritz. Layers of evidence, motive, and opportunity are peeled back at an alarmingly slow pace to ultimately reveal the murderer. It is the job of our forensic investigator, Theresa MacLean, to find and examine the evidence that will lead to the arrest of the killer. When her daughter becomes a likely target, the urgency to find the murderer heats up.Although not at the top of my \"to read\" list, the plot is interesting if you can keep reading through the slow sections.I received a copy of Defensive Wounds from the Early Reviewers Program"}, {"userName": "Becky", "userReviewDate": "Nov 23, 2012", "userURL": "http://www.goodreads.com/user/show/2175138-becky", "userReview": "Lots of forensic stuff, lots. Sometimes more than you want. Cops, dead attorneys, daughter of the CSI lady, all at the Ritz Carlton in Cleveland. Then a sealed juvenile record, grieving mother, and at least 15 connections from 47 clues, all of which (spoiler) end up having almost no bearing on the final outcome. Oh, and a bit of romance on the rise while the mystery unfolds.Decent escape for listening while I was knitting, but I really do prefer more honest crime based complexity and if not that, then at least more complex characters. Either Agatha Christie stuff or for characters one of the Scandanavian crime writers.This is paperback grocery store stuff"}, {"userName": "Kirsten", "userReviewDate": "Sep 26, 2011", "userURL": "http://www.goodreads.com/user/show/5672829-kirsten", "userReview": "I received Defensive Wounds from Goodreads.This book was a fast, absorbing read. I had not read any of the previous novels featuring Theresa MacLean, but quickly got to know and like the characters. The story was interesting and I loved reading the technical forensic information. Although I figured out part of the mystery, the end was a surprise! I am definitely planning to go back and read Ms. Black's previous novels."}, {"userName": "Vicki", "userReviewDate": "Apr 25, 2017", "userURL": "http://www.goodreads.com/user/show/11521780-vicki", "userReview": "[Something I don't like is when the family is too involved. And I don't mean her cousin Frank, that makes all the sense in the world to me. I'm talking her daughter Rachel almost dying 700 feet up on the observation deck. I would say \"why did it have to be a daughter\" but I realize that a theme in the book was this relationship, but I did not like that aspect. I also got frustrated on more than one occasion when Theresa - who is a seasoned detective - does not see the simple things around her that the readers are privy to. Like the fellow detective, Neil, gave so many signs of suspicion yet she is almost in bed with the guy. That's odd. And she's such a stickler on others not breaking rules - even including the defense attorneys who embellish their stories and she is so by the book. But she's not, is she? She gleans information from sealed juvenile court records; she is getting down with her super suspicious partner; she is visiting the home of the mother of a girl that had been murdered by the boy now dating her daughter. Speaking of...how can a detective who has seen so much death and rape and murder have a daughter who simply ignores her time and time and (ugh) time again. Really? And why would she - and others - keep visiting an unsafe, unfinished observation deck 700 feet above the city? And, why after one murder - let alone two - does the Ritz not have a) better security, b) CAMERAS installed, etc. These are the types of things that appear in at the end of the book that just seem like she's coming up with ideas that are really not plausible just because she knows what her end game is. Lastly, if you hadn't figured out who the murderer was long before the end, then this book should be a 5-star for you! I thought it was obvious. Although I teetered on Coral being responsible and/or Neil. And guess what? Super spoiler alert - they ALL were. Wow.  (hide spoiler)]"}, {"userName": "Tracey", "userReviewDate": "Feb 25, 2017", "userURL": "http://www.goodreads.com/user/show/62701774-tracey", "userReview": "An easy read mystery/detective story.A defense attorney is found murdered at the Ritz hotel and an investigation is launched which uncovers suspects with ties to a previous crime. A few good twists and turns are introduced before the final showdown reveals the actual murderer.Ultimately, a good, quick, weekend read."}, {"userName": "Hannah Garden", "userReviewDate": "Mar 05, 2013", "userURL": "http://www.goodreads.com/user/show/1031706-hannah-garden", "userReview": "This author, at least as evidenced by the two novels I've read so far, has a hilarious resentment against television crime dramas. Which is a not uncommon trope in this genre--an easy way to add a little real-world zing to a population of characters generally rendered in the mid- to late-blooming stages of caricature. A cold blue eye, a hard certainty, and a cigarette clenched grimly--but get back, Marlowe, coz this damey watches CSI, and she thinks it's SILLY. Not the worst; you read these things with pretty big grains of salt, right? You just want to disappear out of your head for a little while, that's what these books are for. Of course they're going to be a little stupid; they are so sure of themselves. They are like any closed circle of signs and symbols--transparent and interdependent. That's why it is so cozy in here, huddled around the autopsy table.She just hammers that shit home like every two pages. \"It's sooooo easy ON TV,\" someone bristles shrilly. \"Oh well ON TV they would have had this all wrapped up,\" someone else spits venomously. \"ON TV it's all in the computer, the MAGIC TV COMPUTER,\" a third person chimes in, tearing out her eyes and leaping from the window, a droll cigarette clenched grimly in her hardened jaw.Anyway n really a bd. These books are placed in Cleveland, where she used to work, but now she lives in Florida! So I hope she will locate a book there, for o how I love to read of my swamp, no matter how dopey the tropes.Oh wait the other thing is an almost baffling hamhandedness when it comes to metaphor. Her character is thinking about oh no what if I have to adopt this cat, what will my cat think. She says that when the cat had to deal with her bringing a dog home, that was one thing--the dog was \"a hangnail\" but another cat would be \"a bullet to the brain\"?? I mean . . . yeah okay that's a metaphor. That's using figurative language, technically nothing wrong there. But what? What.All that pettiness aside, I'll read the next one. I'm sticking with two stars, though. I liked it, but only because it was okay."}, {"userName": "Cheryl", "userReviewDate": "Nov 09, 2011", "userURL": "http://www.goodreads.com/user/show/1179650-cheryl", "userReview": "Theresa gets a call that a murder has happened at the Ritz-Carlton. Attorney, Marie Corrigan was murdered. No one really sheds a tear for Marie. Everyone thought she was a major \"B\" including Theresa. At first Marie's death seems like a sexual act gone wrong but when another attorney ends up dead, it is up to Theresa to uncover the truth before it is too late. Another book marked off my TBR pile. Sorry I did not read this book sooner. I really like Theresa. She is smart and calls the shots in a male driven job. I was impressed by how she solved the murders. While at the same time trying to be a good mother to her teen daughter. I have to admit that I could have cared less about the victims but the crime itself in why the lawyers were murdered had me really intrigued. To be honest, I was trying to solve the murder before Theresa did. I failed. However when it was all revealed I was like \"I did not see that coming\". This is always a good thing when it comes to a murder, mystery, suspense novel. You want to be surprised and it is nice when this does happen. So often a lot of books in this genre can become very predictable."}, {"userName": "Magpie67", "userReviewDate": "Nov 18, 2017", "userURL": "http://www.goodreads.com/user/show/987948-magpie67", "userReview": "\"Ding dong the witch is dead!\"It's definitely not a good time to be a defense lawyer at the convention being held at the hotel... Love this series and I will have to say, I found myself quite nauseous as the techs collected fibers, latent prints and other unmentionables from the rooms. I'm serious, I'm thinking twice about wanting to stay in a hotel ever again. Lisa Black gets right down to the details of crime scenes and I'm always learning something new. Okay, I thought at first, there was a group of individuals tag teaming and disposing of the lawyers who represent scum... personal offenses, then I thought it's one client, one case that all the lawyers had their hand on... but which victim was it, which crime was so personal and of course, the crimes also had a revenge feeling to them... a pissed off wife, a lover slighted... and then maybe, it was just an underworld sleazy sex thing... Holy buckets... my brain was everywhere trying to solve it... that group ideal stuck in my head though... I had angles galore. Good story, wicked angles, deep emotional betrayal from multiple corners. Webs of deceit, dirty secrets and a justice system that needs an overview (we have too many loopholes)."}, {"userName": "Katie Rekowski", "userReviewDate": "Jan 03, 2018", "userURL": "http://www.goodreads.com/user/show/4087058-katie-rekowski", "userReview": "2011. Read by Kirsten Potter. Theresa LacLean #4. Theresa MacLean is a Cleveland forensic scientist. She has a daughter, Rachel. Rachel has a summer job working the front desk at the Rita-Carlton. There's been a murder; Rachel calls her mother. The hotel is hosting an attorney convention; the murdered victim was an attorney. And then there a two more similar murders, two more attorneys . How are these people tied together and why murder?"}, {"userName": "Lora King", "userReviewDate": "May 07, 2017", "userURL": "http://www.goodreads.com/user/show/3451479-lora-king", "userReview": "4th in series. I so enjoy Theresa the forensic scientist. She's still in Cleveland solving crimes with her cousin. This time, defense lawyers are dying at a convention in town and while no one is sad about it, there seems to be a tie in with 2 other murders from the past...a teen who was killed and her supposed killer got off and is now seeing Theresa's daughter and the 1st wife of a high profile obnoxious defense lawyer. Love how these stories are just long enough to finish in a few days!"}, {"userName": "Marti", "userReviewDate": "Mar 13, 2017", "userURL": "http://www.goodreads.com/user/show/2060998-marti", "userReview": "Takes place in Cleveland. Three bodies in all. They are all connected. The way the bodies were scanned was interesting. A lot of tension."}, {"userName": "Donna", "userReviewDate": "Mar 19, 2018", "userURL": "http://www.goodreads.com/user/show/50812907-donna", "userReview": "earlier novels were more exciting!"}, {"userName": "Becky", "userReviewDate": "Jun 27, 2017", "userURL": "http://www.goodreads.com/user/show/2114845-becky", "userReview": "I like this author and want to read more of her books."}, {"userName": "Vivian", "userReviewDate": "Sep 08, 2011", "userURL": "http://www.goodreads.com/user/show/4285380-vivian", "userReview": "Theresa MacLean is a forensic investigator. She is also an overprotective mother to a teenage daughter. She thought her daughter would be safe working for the summer at a downtown hotel until there's a murder on the premises. It doesn't help that the murder victim is a defense attorney that the local police department loved to hate. Why this hotel? Why this attorney? Why no defensive wounds? These questions are asked and answered in the latest suspense novel by Lisa Black, Defensive Wounds.Being a single mom can be exasperating, and Theresa understands that she has a tendency to go overboard at times. Her daughter was nowhere near the murder site but she's still overly cautious and wary. It doesn't help that she knows nothing about Rachel's new love interest. Theresa's interest is further peaked when her friend, another defense attorney, has a suspicious and curious reaction to the teenager. Theresa then asks her cousin, a police detective, to check into the boy's background. Isn't that what family connections are for?Theresa must still continue her forensic investigation but trying to find evidence in a hotel room is akin to looking for a needle in a haystack blindfolded. Just when she thinks she's the original hovering mother, there are two more murders. By now, Theresa is frustrated because of the mounds of forensic evidence to be looked at from the hotel. If there's a ton of evidence from the hotel, there's also a ton of suspects to be considered. One suspect is a former police officer that is currently working as the head of security at the hotel. On the personal front, Theresa must field interest from one of the investigating detectives. She also learns that Rachel's prospective boyfriend has a record . . . for murder. He was found not guilty and said that he doesn't remember that night, but what really happened? He doesn't know and the dead girl cannot speak for herself? The evidence points to him, or does it? What follows is an investigation that keeps the reader on tenterhooks. The investigation is like a roller-coaster ride in the dark, the twists and turns kept me on edge because I never saw what was coming next.I enjoyed reading Defensive Wounds and completely understood that Theresa is the primary character, but since I have family on the police department I also know that forensic investigators don't generally play such a primary role in investigations and interrogations. Removing that little problem from the equation, Defensive Wounds is a great suspense read. I found myself feeling for Theresa as she worried about Rachel and sympathetic when she mourned the loss of her friend. (I also rather enjoyed the possible play on words as \"defensive wounds\" may refer to the lack of defensive wounds on the murder victims as well as the wounds they inflicted on victim families as defense attorneys.) If you're looking for a procedural suspense to read with a strong female character and an emphasis on evidence, then look no further."}, {"userName": "Julie", "userReviewDate": "Feb 22, 2017", "userURL": "http://www.goodreads.com/user/show/12355186-julie", "userReview": "Theresa's daughter calls her from the her job at the Ritz and tells her there's a dead body. She gets pulled into the case of the dead defense lawyer. Can she and the police figure out who the killer is and the motive before more people die? Can she keep her own daughter safe?Good suspenseful writing and good characters. Some twists."}, {"userName": "Debbie Oxier", "userReviewDate": "Sep 13, 2016", "userURL": "http://www.goodreads.com/user/show/21813445-debbie-oxier", "userReview": "This was an excellent suspense filled story centered around Theresa MacLean, a forensic scientist. You can tell the author knows her stuff with her detailed descriptions and obvious knowledge of the subject matter. When Theresa is called to the scene of a crime at the Ritz-Carlton hotel in Cleveland, she finds a well known attorney dead. Marie Corrigan, said attorney, had made many enemies over the course of her career. Known for falsifying evidence and humiliating people on the stand who had been called to testify against her clients, no one was particularly sad to see her gone. Theresa included. However, she concedes that even Marie Corrigan didn't deserve to die like she did. The woman was naked, hogtied, with her head bashed in. Was it a rendezvous gone bad? There was no sign of a struggle, no sign of forced entry, and from what Theresa can tell, very little evidence left behind by the killer. There was, however, a big conference going on at the hotel with attorneys from all over the country in attendance. Had the deceased arranged to meet one of them in between sessions? When another attorney is killed in similar fashion at the hotel, Theresa has to wonder if they have a serial killer on their hands. She and her cousin, Frank, a detective, race against time to connect the dots before another murder takes place. As an aside, Theresa's daughter, Rachael, is employed by the hotel and has only been on the job for a couple of weeks. She's interested in a young man who works in the kitchen. So not only is Theresa embroiled in this new case but now she's worried about her daughter, especially when she learns the young man in question was once arrested and tried for the rape and murder of his girlfriend.This was a sure fire winner for me. There were plenty of suspects to keep me guessing. I didn't want to put it down. It kept me on the edge of my seat and there was a huge twist at the end I didn't see coming. This was my first Lisa Black novel but it definitely wont be the last. Her thoroughness and attention to detail made for one very entertaining read."}, {"userName": "Kristin", "userReviewDate": "Oct 30, 2011", "userURL": "http://www.goodreads.com/user/show/575523-kristin", "userReview": "I've read others in this series, and while this one was good, it wasn't quite as good as the first one I read, which is alluded to a couple times in this plot. Here, crime scene investigator Theresa MacLean is alerted to a murder in Cleveland's Ritz-Carleton hotel by her teenage daughter, who works at the front desk. The victim turns out to be a well-known local defense lawyer, whose arms and legs are tied up so as to suggest that her death might be a result of a sexual encounter gone bad, although the room shows no evidence that any sexual acts had taken place. When another defense lawyer turns up dead the next day, tied up in the same way, MacLean begins to wonder if someone has it out for lawyers or if it's just coincidence because the hotel is hosting a defense lawyer convention. As she's trying to process the evidence taken from the scenes, MacLean is alerted to a potential suspect who works at the hotel, which may put her daughter in danger as a fellow employee who has routine contact with this suspect.In re-reading my review from the 2nd book in the series, 'Evidence of Murder', some of the same things I said about that one apply here too. The book was harder to get into than the first in the series, 'Takeover', which I remember not wanting to put down, whereas I had to take this one to the gym because I kept falling asleep while reading it at night. Theresa delegates much of the analysis of the crime scene samples, so what we get as readers is her processing of the crime scene but minimal feedback on what she found until the people she sent the samples to get results back. Perhaps more realistic than the authors who have their character do it all, but it makes it hard to tie it all together. I did skip over the 3rd in the series, and originally I thought that a plot that was alluded to here was the focus of that book, but based on comments Theresa makes at the very end, I imagine it might show up in the 5th book, in which case I would like to read that one despite being a bit disappointed with 2 of the 3 books of hers I've read so far."}, {"userName": "Maddy", "userReviewDate": "Dec 21, 2011", "userURL": "http://www.goodreads.com/user/show/1298544-maddy", "userReview": "PROTAGONIST: Theresa McLean, forensic scientistSETTING: Cleveland, OhioSERIES: #4 of 4RATING: 3.25There’s a convention of criminal defense attorneys being held at the Ritz-Carlton hotel in Cleveland, where Rachael McLean, daughter of forensic scientist Theresa McLean, is working for the summer. One of the attorneys, Marie Corrigan, is found murdered in the executive suite. There aren’t too many people mourning her death, as she was a lying manipulator. When two other DAs are killed in similar circumstances, the mystery deepens—who feels a need to “kill all the lawyers”? It’s Theresa McLean’s job to collect forensic evidence from the crime scenes. The setting presents an incredible, almost impossible, challenge. How many people have been in any hotel room, much less the hallways and stairwells? Trying to find any useful information is like searching for a needle in a field of haystacks. Theresa is more personally involved than she usually is on the job; she fears that her daughter is in danger as well. Could the dubious young man that she is interested in be the murderer?The idea of using a hotel setting for a forensics investigation is an interesting one. However, too much of the narrative was dedicated to the processes used for each of the victims. There was a lot of redundancy, which had a negative impact on the pacing of the book. The major strength of the book is in the depiction of the lead character. Obviously, McLean is an extremely skillful and dedicated forensic scientist. However, she has difficulty in separating her professional and personal lives and is excessively overprotective of her adult daughter. DEFENSIVE WOUNDS is the fourth in the Theresa McLean series. Those who enjoy a heavy dose of forensics will appreciate this book."}, {"userName": "Lee Ann", "userReviewDate": "Nov 21, 2011", "userURL": "http://www.goodreads.com/user/show/3560162-lee-ann", "userReview": "Shakespeare's \"let's kill all the lawyers\" gets a workout in this 4th entry in Black's Theresa MacLean forensic investigator series. Mama MacLean gets a chill when receiving her daughter's text of \"sum 1 ded here\" from the hotel at which she's working before going back to college. The \"ded\" happens to be a not-so-much lamented femme fatale of a defense attorney who was attending a convention for criminal defense attorneys at the Cleveland Ritz-Carlton. Detectives and forensic investigators both have run afoul of Marie Corrigan's tricky tactics on behalf of her clients...and there are a passel of victim's families out there who would have liked to see her roasted on a spit, but none of them had a key card for this security conscious locked hotel room. When a former lover and professional colleague also in attendance meets the same bloody and humiliatingly staged end as Marie, the plot has thickened and the pool of suspects has deepened to include a retired cop now employed by the hotel, the new boyfriend - did we mention the dead lawyer got him cleared of a rape/murder charge? - of Theresa's daughter, Rachael, and well just about everyone who ever met both the dead lawyers.This series continues to shine with working class Cleveland lending its blue collar aura. And Theresa is the everywoman - except for that whole crawling around on the floor picking hairs off dead people thing - that inspires admiration from any reader and fan of forensic fare.P.S. After reading Takeover, Evidence of Murder, and Trail of Blood, go back and find her 2 books under the name Elizabeth Becka that also feature a female forensic investigator."}, {"userName": "Linda", "userReviewDate": "Sep 13, 2011", "userURL": "http://www.goodreads.com/user/show/1050198-linda", "userReview": "A defense attorneys' conference has invaded the Ritz Carlton, where the daughter of forensic scientist Theresa MacLean works at check in. In the midst of the conference, a serial killer suddenly targets three of the lawyers in quick succession, leaving them naked and trussed up with their heads bashed in, each in a different part of the Ritz. The cops hate all three, for their skill in springing the very same criminals the police work so hard to put away. While collecting evidence, Theresa is horrified to learn that her daughter's new love interest, also a hotel employee, was accused three years ago of bludgeoning to death a beautiful female classmate. Because he was acquitted, she can't convince her to avoid him. As the plot unfolds, Theresa is constantly worrying about her daughter, and just as constantly learning new information that points to several likely perpetrators, all with ample motive and opportunity. But finding hard evidence to connect any one of them, in a crime scene in which hundreds of people come and go every day, is like searching for the proverbial haystack needle; in this case, however, think fibers and hairs rather than needles. Theresa is an engaging protagonist, one who is smart and diligent, but nevertheless makes mistakes and sometimes finds her personal life intruding into her professional one. This is less a who-dunnit than a forensic procedural, and while it's possible to foresee who the killer is, there are enough zigs and zags in the end to allow for a few surprises."}, {"userName": "Linda", "userReviewDate": "Sep 13, 2011", "userURL": "http://www.goodreads.com/user/show/1638879-linda", "userReview": "For me a quick read since I was taken with the setting in Cleveland, mostly around the Terminal Tower and its environs. Glorious views that both dazzle and terrify. Someone is killing high profile defense attorneys at a convention and of course, the suspects are endless as are the lawyer jokes as as the charges that police won't investigate the murders because the police had defense attorneys who are just doing their job putting scumbags back on the street. (Oops did I say that?) Well, you can't help but feel that way about the victims in the first two murders who make a big buck and build big egos by getting the seemingly slam dunk guilty cases tossed or earing acquittals.This doesn't just anger the police, it grates on the coroner and forensic investigators like Theresa who is back for another round in this book by Lisa Black. The fourth book tells us we've known her for 3 years now, long enough for her teenage daughter Rachael to have a job at the Ritz-Carlton. She calls her mom from the front desk to report the first murder and the case starts there.Theresa's cousin, Frank is back to investigate and support. For a moment, I thought he was going to get more of a personal life but we're soon back to the murders at hand which develop links to a past murder case.You'll solve that one quickly but the main who done it? takes a few good twists.The main characters in this book may be great at solving crimes but their love livese are abysmal. Maybe next book which is set up in the final page, or so I'd guess."}, {"userName": "Sandy", "userReviewDate": "Mar 09, 2012", "userURL": "http://www.goodreads.com/user/show/5913149-sandy", "userReview": "Theresa McLean’s is back and this time I think she really is doing more work along her line of occupation as a forensic investigator. The bodies are piling up in the hotel and they belong to defense attorneys who are attending a conference at a high profiled hotel where Theresa’s daughter works at the front desk. With more at stake with her daughter mingling with the cliental, Theresa hopes that the only one being stalked are the attorneys and her daughter is not at risk. Defense attorneys have a multitude of enemies who might want to eliminate them plus with the convenience of the hotel as the killing field the list of suspects is far-reaching. But how is the assassin getting into the rooms and are these room being staged by the killer? These pieces need to be put together and Theresa using her forensic background finally does her magic. This book was like watching a Law & Order episode or another forensic show on TV except for me it had more suspense and action. I was drawn in because of the connection to the attorneys and how the characters thought anyone could have done it because of the openness of the hotel and the line of work the attorneys did. Instead of pouring over surveillance tapes which I have seen in TV shows, Theresa and her team, used forensic methods and other similar ideas to keep the book moving and the story line riveting. Just when you think she had the person pegged and she was ready for to confront them, the story opened up to another detail."}, {"userName": "Allan Dyen-Shapiro", "userReviewDate": "Jan 28, 2017", "userURL": "http://www.goodreads.com/user/show/7485903-allan-dyen-shapiro", "userReview": "I picked this book up because I had met the author and wanted to see what she wrote, even though I do not generally read police procedurals. This one definitely kept me turning the pages. The protagonist, Theresa Maclean, was a well-rounded character who truly won my empathy. When she was afraid, as a reader, I was afraid for her. When she was angry, the same. The character is based upon the author, and as such, the minute details added much to the authenticity. The cops read like cops; the lawyers read like lawyers. I'm not sure the sexism attributed to the male cops applied to all cops, but I didn't have any trouble believing a locker room culture of a particular police department. The hatred of defense attorneys by those involved with prosecuting crimes--not anything with which I have experience. It was certainly strong and uniform in the book. The mother-daughter relationship also was well done. I did not guess the murderer at any point. In retrospect, I can see the trail of breadcrumbs, so Black succeeded admirably in throwing me off the trail. I did guess who would try to kill the major suspect, but I don't think Black was working too hard to conceal this. In getting me to enjoy a sub-genre with which I have no experience and which I am not in any way predisposed to like, the book succeeded, and as such, I would think that those who enjoy and seek out police procedurals would find this book especially good."}, {"userName": "Teresa Michael", "userReviewDate": "Apr 09, 2015", "userURL": "http://www.goodreads.com/user/show/9660724-teresa-michael", "userReview": "Lisa Black is a real CSI in Florida. She does latent fingerprint examinations and was a former forensic scientist at the Cleveland coroner's office. She goes into great detail on how her character Theresa McLean gathers and processes the evidence. This is the third Theresa McLean novel I've read. In this story, Theresa's teen-age daughter, Rachel, is working at the front desk of the Cleveland Ritz-Carlton during an attorney's convention where three defense attorneys are found dead. One in the locked Presidential Suite and another in his room. These are two attorneys and most of the police force aren't too worked up about. Hotel rooms are notoriously forensic nightmares (makes you think twice about what is really under those sheets you're sleeping on). A secondary plot line involves Rachel's boyfriend and did he really get away with murdering his high school friend after a school dance. Theresa needs to put all the evidence together before anyone else, including her daughter, gets hurt. A good read."}, {"userName": "Tami", "userReviewDate": "Sep 14, 2011", "userURL": "http://www.goodreads.com/user/show/1472968-tami", "userReview": "Haven't received the book yet, just received notice I had won. 9/14/11Received my copy last night, hope to start soon, I have my current read and 2 others in front. 9/28/11Started Saturday 10/15/11finished last night 10/20/11The defense lawyer everyone hates is found murdered, during the middle of a defense lawyer convention. With so many possible suspects, Theresa tries to remain impartial and professional while trying to collect evidence to find the murderer. When another lawyer ends up dead under similar circumstances, things just get trickier. I read a lot of murder/mysteries but have not read any by Lisa Black before this. The book was good, great story, fun characters (both the good guys and the villians) and a great pace. I was stumped up through about 2/3rds of the way through, which is not normal for me. I either tend to have a criminal mind or telepathy or something but figuring out who did it usually comes rather early for me."}, {"userName": "D.B. Reynolds", "userReviewDate": "Dec 24, 2012", "userURL": "http://www.goodreads.com/user/show/2467806-d-b-reynolds", "userReview": "The latest from Lisa Black featuring forensic specialist Theresa MacLean, Defensive Wounds starts with a brutal murder and goes from there. Theresa's a good character, as is her daughter Rachael, and the supporting cast which includes her overly protective cousin Frank. The murders are intriguing, and Black doesn't flinch when it comes to killing off even characters we've grown fond of. One thing about Theresa, she does seem to have a doomed love life--which brings to mind a big question mark for me as a reader of the previous books ... what happened to Chris Cavanaugh?? I really liked him and he just disappeared without explanation. Anyway, Defensive Wounds is largely a forensic/police procedural, with a tiny bit of romance thrown in, and some mom/daughter conflict (which conflict, by the way, isn't Theresa's finest hour.)"}, {"userName": "James", "userReviewDate": "Mar 06, 2014", "userURL": "http://www.goodreads.com/user/show/6977675-james", "userReview": "As the story opens, Theresa MacLean receives a telephone call from her daughter, Rachel, informing her of a murder just discovered. Rachel is working in a fancy hotel in downtown Cleveland. The murder victim is a well known defense attorney who was attending a convention at the hotel. The hotel is full of defense attornies. At first, it appears that the murder was the result of a lovers' quarrel. But then another defense attorney is found dead. And then a third one is found. What is the connection between the three murders? To further complicate matters, Rachel has a boyfriend who works at the hotel who may have a secret to hid. There are a number of red herrings throughout the story. The pace is quick. The writing is excellent. You can easily forget the time as you read. I would definitely recommend it to fans of police dramas."}, {"userName": "Liz", "userReviewDate": "Nov 01, 2011", "userURL": "http://www.goodreads.com/user/show/2166205-liz", "userReview": "This is the first book I have read by Ms. Black. There are so many suspects that in-depth character development is impossible for the many suspects attending the Defense Lawyer's Conference at the Cleveland Ritz Carlton. being held in Cleveland--everyone seems to have a motive for killing defense lawyers. I became a bit bored with so many forensic details--unlike other similar novels.Murders begin with the killing of the high-powered, most hated local defense lawyer, Marie Corrigan. No one is sad to see her die--but the murders continue.There is little romantic element in this novel (read Jayne Ann Krentz for some ideas.) Point of view shifts which bothers me.It's a fast read and well written."}, {"userName": "Burt", "userReviewDate": "Sep 24, 2013", "userURL": "http://www.goodreads.com/user/show/2148427-burt", "userReview": "This was another genre switch for me. I was looking for a break from my hardcore pursuit of geopolitical thrillers and had not been into the police/crime genre for a good long while. The thing I most appreciated here was that author, Lisa Black, does not present her CSI as a \"go out and play the T.V. detective\" role nor does she make her out as a super/geekish/unbelievable technology genius that is currently the mainstay of this type of story on T.V. She does provide the reader with a fair dose of the absolute tedium that goes with the job of crime scene investigation. It was believable tale and an easy and enjoyable read that gave me a good break from the thrillers."}], "description": "In this fourth novel in Lisa Black's captivating suspense series, forensic investigator Theresa MacLean finds herself embroiled in a case in which everyone has a motive and everyone is a suspect—especially when high-powered defense attorneys start turning up dead.   When Marie Corrigan, a Cleveland defense attorney with a history of falsifying evidence and no shortage of enemies, is found dead in the presidential suite at the Ritz-Carlton, most people would agree that she had it coming. Forensic investigator Theresa MacLean is summoned to the crime scene by her daughter, Rachel, who is working the front desk. But even before Theresa enters the room, she knows that she's walking into a forensic nightmare—for crime scenes at hotels, even the most luxurious, are teeming with trace evidence that has been left behind by innumerable guests and may or may not be related to the murder. But what Theresa finds is even worse than she imagined.   Given the positioning of Marie's body, everyone assumes the same thing—that it's a lovers' tryst turned lethal. But large questions remain: How did the killer gain access to the room without anyone's knowledge? And has the scene been staged for their benefit? The little evidence Theresa has is conflicting at best. What's more, a legal convention at the hotel provides an endless list of suspects—and potential victims.   When two more bodies show up in quick succession, each in a similar state, Theresa's investigation takes on a whole new urgency as she fears they may have a serial killer on their hands—a serial killer with a vendetta. But as she searches for the threads that tie the cases together, Theresa begins to suspect that she and her daughter are closer to danger than they realize. And a mother will stop at nothing to protect the life of her child.", "title": "Defensive Wounds\n      \n          (Theresa MacLean #4)", "url": "http://www.goodreads.com/book/show/10854062-defensive-wounds", "average": 3.52, "cover": "https://images.gr-assets.com/books/1313799955l/10854062.jpg", "reviews": 140, "authors": [{"url": "https://www.goodreads.com/author/show/115085.Lisa_Black", "name": "Lisa Black"}], "type": ["Mystery", "Fiction", "Suspense"], "outlinks": ["http://www.goodreads.com/book/show/10854062-defensive-wounds", "http://www.goodreads.com/book/show/10854061-defensive-wounds", "http://www.goodreads.com/book/show/13623825-defensive-wounds", "http://www.goodreads.com/book/show/3315452-takeover", "http://www.goodreads.com/book/show/6564237-evidence-of-murder", "http://www.goodreads.com/book/show/26025628-that-darkness", "http://www.goodreads.com/book/show/8564346-trail-of-blood", "http://www.goodreads.com/book/show/30214944-unpunished", "http://www.goodreads.com/book/show/37581710-the-company-of-demons", "http://www.goodreads.com/book/show/40024832-empire-of-sin", "http://www.goodreads.com/book/show/8343548-the-bricklayer", "http://www.goodreads.com/book/show/40193155-among-the-wicked", "http://www.goodreads.com/book/show/23818400-the-snow-garden", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/23157833-almost-dead", "http://www.goodreads.com/book/show/33555347-crime-scene", "http://www.goodreads.com/book/show/30249521-fatal-frost", "http://www.goodreads.com/book/show/40266676-remains-of-innocence", "http://www.goodreads.com/book/show/34330657-finding-claire-fletcher", "http://www.goodreads.com/book/show/28824403-outfoxed", "http://www.goodreads.com/book/show/23957469-huntress-moon", "http://www.goodreads.com/book/show/40204087-the-deepest-secret", "http://www.goodreads.com/book/show/35115882-what-the-dead-know", "http://www.goodreads.com/book/show/40267317-ragdoll", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/39791173-the-girl-before", "http://www.goodreads.com/book/show/40205081-last-witness", "http://www.goodreads.com/book/show/40205040-dead-weight", "http://www.goodreads.com/book/show/18903409-weekend-warriors", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/40193809-eye-for-an-eye", "http://www.goodreads.com/book/show/27239265-the-short-drop", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/17623604-you-only-live-twice", "http://www.goodreads.com/book/show/17377392-thunderball", "http://www.goodreads.com/book/show/17284593-casino-royale", "http://www.goodreads.com/book/show/17623578-for-your-eyes-only", "http://www.goodreads.com/book/show/40193858-the-cuckoo-s-calling", "http://www.goodreads.com/book/show/17304110-live-and-let-die", "http://www.goodreads.com/book/show/18780375-dr-no", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies", "http://www.goodreads.com/book/show/17379070-moonraker", "http://www.goodreads.com/book/show/18799804-diamonds-are-forever", "http://www.goodreads.com/book/show/40205231-the-spy-who-loved-me", "http://www.goodreads.com/book/show/17377384-from-russia-with-love", "http://www.goodreads.com/book/show/40243961-the-cape-refuge-collection"]}