{"ratings": 59, "userreviews": [{"userName": "Breann", "userReviewDate": "May 17, 2013", "userURL": "http://www.goodreads.com/user/show/5378471-breann", "userReview": "Zombies? Pass. But there was some manlove involved so I was easily persuaded. And I am so glad I didn’t pass up the opportunity to read this. I was hooked from the start. And by that I mean by 1%. Insta-love over here. \nWe begin with Asher St. Paul who is trying to survive the best he can with his lover, Conner, in a post-apocalyptic world where zombies rule. First page and I’m dying inside. I barely know this character and my heart is breaking already. Asher has just lost the last person on Earth he loves to these zombies. He decides to continue on, though his hearts not really in surviving. Hell, mine wouldn’t be either. He eventually finds himself in a safe house where he learns more of necromancers who are creating and controlling zombies. Asher. Oh Asher. So loveable, so lost. He doesn't know if he wants to or even if he can go on alone. None of his family is left, they died in gruesome ways, some by his own hand. Somehow he finds the strength to keep going. While at the safe house Asher learns more about himself than he ever knew was possible. He begins his training with the in-house necromancer, Ulga. He's so much more powerful than he ever knew. Now, he just needs to figure out what to do with the powers he's now aware of. But he definitely figures it out. I love when a character discovers how kickass they really are.He was taken care of in the safe house by one of their doctors, Cleave. Give me a moment while I swoon. I love the patient type. The one who knows who they love and are willing to wait. Willing to put themselves through the torture of waiting just to be with The One. This was Cleave. He was there for Asher from the beginning and still there for him after Asher treated him like crap. And he put up with a lot from that man. But he continued on taking care of him, comforting him, being strong for Asher when he needed it. *sigh* \n\n\nI think what drew me in was the urban fantasy feel. UF is my first love, so even though zombies aren’t my thing, this has all the right parts for a fantastic read. There wasn’t much world building needed since this universe isn’t much different than our own, just add in some zombies and creepy ass necromancers. But what was built was the complete sense of loss by every human who’s still living. Every character broke my heart. I really felt every story that was told and every experience that was had. Characters we just met in passing touched me in some way. What I love most about UF is that not all the questions are answered. There was a definite sense of closure at the end but I’m salivating to know more. What more can Asher do? Is he still more powerful than he knows? Will he be able to resist the evil temptations that others before him have not? How long will their safe haven be safe? And, for the love of god, will we get a sex scene? Not that I mind fade-to-black, but Cleave is sexy as hells and I wanna read that man in action. Just sayin’.I loved it. The writing felt a little choppy at times, which then drew me out of the story momentarily and I found myself rereading some scenes when I was a little lost. Even so, this was fantastic and I will definitely read more of Asher’s zombie adventures. A copy of the ebook was provided by the author in exchange for an honest review."}, {"userName": "Bob Milne", "userReviewDate": "Jun 03, 2013", "userURL": "http://www.goodreads.com/user/show/2224905-bob-milne", "userReview": "While it wasn't necessarily a bad book, there were so many little issues with Desolation that I really had trouble enjoying it.On the plus side, Travis Simmons has definitely done something interesting with zombies here, adding a little fresh blood and brains to a genre that's become very tapped out. Rather than limit himself to a choice between the classic shuffling zombie and the contemporary speedy one, he incorporates both into his story, and then adds a third flavor in the infernals - basically zombies with brains. Not content to stop there, he also adds an even darker element, with human necromancers who have the power to create and control the zombies. It definitely makes for a very dark, exciting read, but he needs more space to fully explore the concepts.Unfortunately, this is a book that's in dire need of an editor. While I generally don't like to focus on that element in my reviews, when it becomes a distraction - as it did here - I have to call it out. Little things like the proper use of its/it's and there/their/they're are one thing. They're annoyances, but you can train your mind to skip by them. Wrong or missing punctuation is another thing entirely, however, and there were passages - particularly following a line of dialogue - where my reading just hit a brick wall of incomprehension. Also, while I know it's difficult to work personal details into a first person narrative, it shouldn't have taken 7 or 8 chapters before Asher is revealed as a guy. Yes, I know it's clear in the synopsis, but when a book has sat on your e-reader for a few months, the value of a synopsis or cover blurb is entirely lost.As for Asher being a guy, I certainly had no issues with that, and thought gay romance angle was an interesting touch, particularly with his lingering feelings for his now-zombie boyfriend. Their romance was solid, and I think Asher's grief was very well portrayed. In addition, I really liked how Simmons continued to play with the romance angle, right up to the climax of their final zombie confrontation. My problem with Asher was not his sexuality, but his personality and his perfection. He's a little too much of the perfect hero, more a pulp adventure novel cliché than somebody fit to lead a post-apocalyptic horror novel.Ultimately, this felt like a young adult novel that was deliberately sexed-up and bloodied-up to appeal to a wider audience. It certainly has potential, and I think Simmons can do some really exciting things with the material, but this first volume is just a bit too rough and unpolished for my tastes.Originally reviewed at Beauty in Ruins"}, {"userName": "Katy", "userReviewDate": "May 31, 2013", "userURL": "http://www.goodreads.com/user/show/5552109-katy", "userReview": "Book Info: Genre: Post-apocalyptic dark fantasy/zombiesReading Level: AdultRecommended for: Fans of zombie fictionTrigger Warnings: murder, mental slavery, lots of goreMy Thoughts: I'm not a huge fan of traditional zombie fare, but thought with the necromancers thrown in I might enjoy this well enough, and that was true. The necromancers made this more interesting, as did the several types of zombies: traditional, speeders, and infernals. However, the ending was unsatisfying; it just sort of petered out rather than providing much of an ending. I suppose it was left open for a sequel, but I felt like things could have wrapped up a bit more than they did.It was nice to have a book where the characters were fairly well accepted as who they were in the QUILTBAG, but it also seems awfully convenient that so many of the men surviving the zombie apocalypse were gay. I'm not sure what would have made me happier about this book, honestly. It just felt unfinished. I know this was an ARC, so I discounted the various typos I saw, which will probably mostly be cleared up in the final release, although the constant misspelling of “rifle” as “riffle” made me giggle a few times. However, I imagine that fans of zombie fare will enjoy the book, so don't let my lackluster recommendations turn you off if you're interested in reading it. I will definitely be exploring other books by this author.Disclosure: I received an e-book ARC from the author in exchange for an honest review. All opinions are my own.Synopsis: Asher St Paul thought it was just a typical zombie apocalypse like in the movies, until the necromancers crawled out of the woodwork. Since the undead have chased the living into hiding, the necromancers are able to roam freely in a new America of their making. Asher is seeking safe harbor. The need for safety is what drove him from his home in Philadelphia, Pennsylvania before it was shelled. He has searched from quarantine to quarantine, always finding them overrun with zombies until he hears of The Refuge, a military compound in Binghamton, New York. With his family and lover lain to rest by his own hand, he has nothing left to lose and gives everything he has to reach the safe haven. But questions arise when he reaches The Refuge: mainly, how has he been able to sustain multiple zombie bites and not change? He thinks he has found safety in the military compound turned quarantine, but he was wrong. Even now there is a necromancer trying to make The Refuge their kingdom of the dead."}, {"userName": "Tammy K.", "userReviewDate": "Jun 06, 2013", "userURL": "http://www.goodreads.com/user/show/4626742-tammy-k", "userReview": "As a reader/lover of Paranormal Magic, Zombies Apocalypse & LGBT romance fiction, this book was right up my alley. But just in case you are not a lover of each of those sub-genres, here is what I enjoyed about this book that you might enjoy as well:The Main characters are unique for the Zombie Apocalypse genre. Our young hero is flawed-but growing. In the beginning of this story, I wasn’t particularly fond of Asher. However by the end of this story, I had seen that Asher had grown in his maturity to the point of putting others needs above his own.The pace of the plot was solid. There are a couple combat-action scenes which I felt were a little rushed, but overall the story keeps to a steady pace.The world within this story was also unique. Without giving away any plot secrets, I will say that the traditional role of necromancer vs. witch are played around with here. Sure you have spells, enchantments, the rising of the dead, but there are a couple pleasing twists that I have not found in other necromancer stories.Speaking of twists, this story has them! While I had suspected the villain in the beginning, I was caught off guard with other key players.This story is not one that is spelled out for you. There is a fair bit of thinking and piecing together for the reader to do if they want to reach the end smiling. But even if you read straight through without much thinking, the story explains itself nicely in the last section.Now for a comment or two on the gay romance subplot. Well this was the most difficult part of the book, because parts of the romance plot were out right heartbreaking, and other parts were rather annoying. Yet if not for these extreme peaks in the character emotional state, Ashers \"epiphanies\" would not have had a place to play out. It is through his emotional roll-a-coaster ride that he reaches beyond himself to rightfully become our Hero.It may also help to know that there is no on-page sex in this story making it a book that I can easily recommend to young adult readers.So do I recommend this book? Yes! I believe readers of Paranormal-Magic, Zombies Apocalypse and LGBT Romance fiction will find this story to be an enjoyable read."}, {"userName": "Taylor P. Davidson", "userReviewDate": "May 03, 2013", "userURL": "http://www.goodreads.com/user/show/8866527-taylor-p-davidson", "userReview": "Desolation, Travis SimmonsTrying to survive in the brave new world following a zombie apocalypse isn’t easy for Asher St. Paul. His family and friends are dead. His lover is dead. He should be dead. And to make matters even worse than the hordes of zombies that threaten him with each passing day, chilling rumours of necromancers are beginning to circulate through the last remaining human refuges. They say that survivors are being rounded up, caged and used to feed zombie populations as the necromancers fight to hive out their territories in the old cites.As Asher is searching for one such refuge, he observes a lone woman treating a pack of zombies as she would a dog and begins to suspect that there is more truth to these rumours than he would like to believe. His worst fears are realised when he finds the refuge to be taken in by them, and Asher must come to grips with a dark secret as he struggles to save his newfound friends from certain death.The GoodWritten with the imaginative flair of Travis Simmons, the author of the gripping Revenant Wyrd Saga, Desolation is fast paced and exciting. The tragic events that befall Asher are believable within the confines of the story (accepting of course, the roaming zombies) and Simmons doesn’t go over the top with describing blood and gore. Instead, Simmons invests in describing Asher’s emotional battles as he learns to live with the austerity and horror of his new way of life, which I found made his character very believable and easy to engage with.Without spoiling the book by going into too much detail, Simmons tells the story with a rather unique spin that I found refreshing as it helps Desolation to stand out from other zombie apocalypse books. Rather than focusing entirely on the zombies as the main villains, which of course they still are, Simmons mainly concerns himself with necromancers and how the zombies are used by them. By bringing in magic and a greater sense of purpose behind the apocalypse, Simmons has created an interesting blend of zombies and fantasy that I found both enjoyable and intriguing.The BadI must say that I have little to fault with Desolation as it's well-written and Simmons steers clear of the ‘conventional’ clichés of zombie plotlines well. Saying that, Desolation does fall foul of the traditional problems that zombie stories face – where are Asher and the other characters getting all of their bullets? How is the electricity being generated in the Refuge? How are so many people being fed? I could go on, but I'm sure you know what I mean!Obviously, ammunition and electricity are things that probably wouldn't be around for long should a zombie apocalypse actually happen, even if raiding parties did scavenge petrol from cars etc. for their generators. But, for the purposes of the story, it makes sense for Asher to have bullets in his guns and to be able to turn lights on in the Refuge. And let’s face it, we don’t read zombie stories to be realistic so I found it very easy to forgive Simmons for this unrealism!My ThoughtsAfter finishing Desolation I found that I was disappointed it was over. The book makes for a fantastic read that uses fantasy genre magic in a manner that helps it to stand apart from other zombie stories. As such, I would recommend that you add Desolation to your reading lists – you won’t be disappointed if you do!"}, {"userName": "Elizabeth Towns", "userReviewDate": "Jun 10, 2013", "userURL": "http://www.goodreads.com/user/show/5173241-elizabeth-towns", "userReview": "I haven’t read or watched anything zombie since I was a teenager, and I couldn’t for the life of me remember why I requested to review Desolation by Travis Simmons, yet I did - so I dived in to reading. It was not at all what I expected. This book was not about your run of the mill zombies.It’s the coming of age, coming to power story of Asher, a zombie/necromancer. Asher is the main character, who from the very beginning makes you feel like he is the one who needs saving, when really, he is the super zombie turned zombie controller who can save everything. He loses everyone he loves, and we come to learn, even his family. The Refuge, a military compound in Binghamton, New York, is where Asher sets out to go when he has survived the Zombie Apocalypse. In turn, he begins his training as a necromancer - one who creates and controls zombies - under the care of an in-house zombie named Ulga, at a safe house. During his time in the safe house, one of the Doctors who takes care of him ultimately falls in love with him. Oh yeah, the doctor is a guy. His name is Cleave. As in cleave to me forever, cause I am hot, handsome and a doctor, dude.There is much more to the story than this, but I don’t want to give away any clues or much detail. This is a well written story, even though the closer I got to the end the more breathless it seemed; as if the writing got a little choppier. The characters are absolutely intricate and well defined and the story line is well thought out, descriptive and well outside of the normal zombies take over the world, the end. I wondered for a bit why a girl would be named Asher - until I realized he wasn’t. Throwing in the homosexual plot twist was also something unique, and not abusing it by clouding the topic with multiple sex scenes was brilliant.This is my first Travis J Simmons read, and I was reasonably pleased."}, {"userName": "Teresa", "userReviewDate": "Oct 31, 2013", "userURL": "http://www.goodreads.com/user/show/6126761-teresa", "userReview": "****Really 2 1/2 stars****While the idea of this book was good, I believe the author missed the mark. There was just too much going on- Necromancers, Witch Trains (STILL don't know why they are called witch trains), Zombies, Infernals, Living Zombies, the ability to place your soul in an inanimate object (Uh...Harry Potter?), some sort of zombie vaccine (which we never here much about), and all sorts of other stuff. It was just WAY too much. Plus, our protagonist JUST found out he was a necromancer and within a week was like a friggin Necromancer black belt, even going so far as to standing toe to toe with ancient necromancers. Oh, and all the crazy, wild, off the wall descriptions of 'balls of light' and Asher's process or healing and hurting was just page after page of torture. The only GOOD thing I saw in this book was the depiction of human relationships. The author did SPLENDIDLY in that department, and I gave 2 stars because of that, and also because this IS the beginning of a series, so I'm assuming (hoping?) that A LOT of the mangled mess of a story gets clarified in the sequels (which I WON'T be reading, anyway). Still, unless you are a huge fan of really paranormal weirdness, stay away from this one. I read it with a Zombie group buddy read, and I thought it would be more zombie, less crazy nonsense...."}, {"userName": "Luke", "userReviewDate": "May 08, 2013", "userURL": "http://www.goodreads.com/user/show/20172367-luke", "userReview": "Zombies have always intrigued me, more so than other typical monsters (vampire, werewolf, etc). Every time a new film or book is announced I wait in anticipation to see/read it. By the end that all too familiar disappointment sets in. The work is your typical zombie film/book with the same cookie cutter story line: zombies spread, zombie killing, small group of people with one main character, one member from the group gets bitten and a loved one secretly keeps them alive, zombie killing, another group members selfish actions gets other group members killed, zombie killing, the end. This has been the result of nearly every zombie book I have ever read, until now. Desolation manages to seamlessly blend the typical zombie slaying and close calls we have all come to expect with a refreshingly unexpected love story. Simmons balances high speed zombie action with just the right amount of first person thoughts and the adjoining love story to keep the reader glued to the book until the last page...well glued to my nexus 7 :-) P.S. Don't worry, this is NOT a \"Twlight love story\"!!"}, {"userName": "Valerie", "userReviewDate": "Jun 30, 2013", "userURL": "http://www.goodreads.com/user/show/11305518-valerie", "userReview": "Wasn't sure if I was going to try to read this I love zombie movies, but wasn't sure if I would get into it in a story.. I mean its hard to beat The Walking Dead.. I have to say this is my first story by Travis Simmons and a nice treat from Amazon to have it free for the day so I read all afternoon. I was surprised.. ;)A military compound in Binghamton.. lol less than 70 miles from me..How could I not get into this story.. Yay Yankee lovers. ;)Anyway, this is about Asher..a necromancer/zombie.. very cool...he doesn't seem to be anything special at first but dang does he surprise me as he becomes this super zombie.As he is training to up skills as a necromancer his doc falls for him.. a guy.. okay shocker.. but I kept reading.; ) Some sexual relations and of course will warn if your not into the homosexual scene or can have an open mind as its not based on the entire story!!.. you will enjoy this read .. if not please don't as an author doesn't deserve a bad rating due to your specific beliefs.You've regained my zombie world .. Mr.Simmons looking forward to book 2"}, {"userName": "Randy Harmelink", "userReviewDate": "Aug 12, 2013", "userURL": "http://www.goodreads.com/user/show/2029520-randy-harmelink", "userReview": "Overall, I liked the book. However, I picked it up because I thought it was a zombie story. It's actually more about the necromancers than it is about the zombies, so I would definitely put it into a paranormal genre.I also was not a fan of the main character's strong hormones. The way the story jumps between zombies and necromancers and his sex drive was just awkward, more often than not.I probably should rate the book a 3, since I find I have zero interest in the next book. I expect the zombies to be just background noise there, since the story is no longer about them, but the necromancers (and other magical beings)."}, {"userName": "Debbie Lamb", "userReviewDate": "Jun 30, 2013", "userURL": "http://www.goodreads.com/user/show/17924444-debbie-lamb", "userReview": "If you like Zombies - Desolation takes you into a different world of Zombies! Desolation had me on the edge of my seat a few times! I was very impressed with how Travis was able to draw me in and keep me there! You do not have to be a zombie fan to enjoy Desolation. When you have read Desolation you will be a Travis fan! I have to smile when I think about the book..Travis has taken zombies to a whole new place in my heart!"}, {"userName": "Don Bradshaw", "userReviewDate": "Oct 05, 2013", "userURL": "http://www.goodreads.com/user/show/3799351-don-bradshaw", "userReview": "I haven't been a huge fan of zombie books but am giving them another try. This story was a little different from the blood and guts chew up the living books. I liked the necromancy angle evens though what Asher learned was rushed somewhat. The story read a little more like a YA story but it's getting near Halloween so it did the trick for me."}, {"userName": "Teressa Oliver", "userReviewDate": "Jun 09, 2013", "userURL": "http://www.goodreads.com/user/show/6073428-teressa-oliver", "userReview": "Desolation by Travis J. Simmons Summary: With his soul mate laying dying in his lap, Asher St. Paul breathes in his lover Conner's last breath. Torn between wanting to join Conner and his instinctive need to survive, Asher pushes on and continues his journey to find a safe haven from the zombie apocalypse always on his heals, lurking hungrily in the dark. Still fifty miles from the rumoured quarantine in Binghamton, New York, Asher encounters packs of traditional shuffling zombies, fast moving speeders and infernals. Fierce hunters that can track and trap their prey, infernals are intelligent and don't give up. After having killed his entire family, Ashley was unable to destroy Conner and now Conner is an infernal with Asher's scent. Worse yet, there are puppet master Necromancers he is unaware exist. On the verge of awakening to self-awareness, Asher has secrets hidden within he has yet to discover. Trying to adapt to his new normal without his biological family and his beloved Conner, Asher is trying desperately to survive. Encountering new friends along the way, he finds strength for hope and a new life and future. As an old fashioned battle of good and evil ensues, Asher may find he is the saviour or destroyer of those he loves and cares about most. This is a new world that belongs to the zombies and the Necromancers. No one is safe, even the virus immune Asher. Some will live. Others will be lucky enough to have a friend put a bullet through their brain. The not so lucky will be dragged off and eaten alive. My Review:Zombies, gore, witchcraft, m/m romance oh my! This book is not a fairy tale to read to your children before tucking them into bed. With just the first sentence, I was grabbed and pulled into the action packed, heart pounding gore fest. Often I held my breath, feeling like I was home alone in the dark watching a horror movie, too afraid to watch and too afraid to move or look away. Asher St. Paul is a well developed main character who moved me to tears with his tenderness towards those he loved and those he lost. At the same time, he is a tough gun toting guy I would want fighting on my side against zombie hordes. With an ensemble of hunks, tough chicks, good guys and bad girls, the secondary characters were as equally exciting as the protagonist. Travis J. Simmons is masterful at moving the plot quickly and never derails the fantastic storytelling. Keeping the readers guessing with clues that peak interest without giving the ending away, Simmons pulls off a surprising and climatic conclusion. Even Agatha Christie would agree this is a perfect “whodunnit” mystery. While the m/m romance isn't graphic, Simmons still manages to make the love scenes steamy and with enough material for the reader to easily use a vivid imagination to fill in the blanks. Due to the graphic violence more than the m/m romance, this book is suitable for older readers. With a sequel sure to be on the way, I have only one complaint. Write faster Mr. Simmons."}, {"userName": "Kelli Guilbeau", "userReviewDate": "May 17, 2013", "userURL": "http://www.goodreads.com/user/show/14535440-kelli-guilbeau", "userReview": "If you are into zombies, this book is for you. I have to admit I love supernatural books, but I have never really cared about zombies. However, recently I started watching The Walking Dead. So, I was intrigued when I was asked if I wanted to review a book about zombies. Well, this one definitely didn't disappoint.While reading this, I tried to stay aware of what people might like and what they wouldn't like. One thing that some people will not be comfortable with is that there are some same sex partners. It doesn't bother me, but I know many people don't like it . Of course, if zombies don't bother you I don't know why a same sex couple would. It is definitely a new twist to a zombie story that I wasn't expecting. In fact, I kind of like that it shows that gay men aren't always flamboyant. There are many that are considered to be \"a man's man\" - strong, athletic, love the outdoors - survivors. Desolation doesn't slap you in the face with the gay card, though. In fact, I had to go back and reread to make sure whether or not that person was male or female in the beginning.Desolation is about Asher, a young man dealing with a zombie apocalypse. The story begins with losing the love of his life. He now needs to find his way on his own. He heard about a refuge in New York. Along the way, he not only has to deal with zombies but necromancers. Will he survive? Will he find a safe place?Travis Simmons does a wonderful job of grabbing your attention from the beginning, and he never lets go. Desolation will keep you guessing and on the edge of your seat. You might start checking your closets and under your bed for zombies. If zombies scare you, or freak you out, then this might not be the book for you. If you are like me and love things that go bump in the night, then you will love Desolation. The Walking Dead fans out there will love this book. I can't wait to see what comes next.Get your hands on this book as soon as you can. You will not be disappointed. Besides, you might just need all of the information you can get on zombies for when they do attack (just kidding). The only disappointing thing is when you come to the end of the book. You won't want it to end. You will be left wanting more. I received a free copy of this book to review but all opinions are 100% mine."}, {"userName": "Leila", "userReviewDate": "Jun 09, 2013", "userURL": "http://www.goodreads.com/user/show/10649905-leila", "userReview": "I just recently (like in the past month recent) gotten into zombies. Hubby got me hooked on a zombie show, so when I heard this book was about zombies, I couldn't get my hands on it fast enough.I liked this book. A lot. It was good. It introduced me to new ideas of zombies and to new \"people\" I had never heard of - necromancers (I really am not into the zombie thing, but when I mentioned it to hubby, he knew exactly what I was talking about!)The book itself was a perfect pace. Kept me wanting to keep reading. I do agree with another reviewer that the end seemed rushed, but it kept me flipping pages and I don't think I would have wanted it any other way. It was much more active than the rest of the book.Along with the typical zombie action that you would expect; it was suspenseful with just enough mystery (that I could't figure out either so that was a bonus!)I feel I do have to disclose that the main character is a homosexual and there are a few homosexual relations. I was not bothered by this, but surprised when I first figured it out (which isn't right away). As long as you are open minded to equality and you like zombies and suspense - this book is for you. I have already told hubby he would enjoy this book and he will be reading it next.I am assuming there is going to be a sequel and I will be watching for when that comes out so I will be one of the first to grab it as I truly enjoyed reading Desolation.Disclosure: I received a free ebook copy in exchange for an honest review. All opinions are 100% my own."}, {"userName": "Jennifer Defoy", "userReviewDate": "Jun 09, 2013", "userURL": "http://www.goodreads.com/user/show/1613620-jennifer-defoy", "userReview": "I have always loved a good zombie story - be it reading or watching. I would have to say Desolation falls into the good zombie story genre. In addition to the zombies there's a love story brewing. And add to that the necromancers and it makes for an entertaining read.My knowledge of necromancy and necromancers was very limited - like I heard it in an ICP song when I was much younger. Never knew what it was, never really cared. But I can say that I now understand what a necromancer is. I don't know that I'd want the ability to control the dead, but it makes for a good twist for a zombie story. I fell in love with Asher. He was such a real character. I'm not sure how I would react in a zombie apocalypse, and honestly despite my zombie knowledge, I'd probably be a zombie within a few days. Much like Asher - being bit multiple times. However Asher's apparent immunity to zombies is something that makes him a much better character than I would be. The love \"square\" that Asher is a nice twist to the story. He wants to do what feels right, but I don't think any of his options are \"right\" given the circumstances he finds himself in. However it makes for a good story in between the action packed zombie scenes.I think it was a pretty good story. It was pretty fast-paced and quite entertaining. I liked the characters and the idea of the story was well executed. It was a new take on the old zombie story and I found it to be a nice change of pace. I was provided a copy of this book in exchange for a review. This review is my truthful honest opinion."}, {"userName": "Adriana", "userReviewDate": "May 21, 2013", "userURL": "http://www.goodreads.com/user/show/7158566-adriana", "userReview": "Desolation was beautifully written. Travis J Simmons was so explicit and detailed keeping me on the edge of my seat. He was able to describe the fear she was going through as she planned his way out of areas infested by zombies. Little did she know how her life would change just being in the company of Anderson, a necromancer. Zombies were controlled by necromancers and there was nowhere else to go but to listen in ZZ’s show which had a large audience. Asher was becoming more and more paranoid wanting so much to trust the man who had saved her life, Anderson. She felt his passion and his need for her yet, her mind was on her boyfriend who had been bitten. Oh wow! Travis was able to include romance in the midst of this plague.As I was reading - my question was \"are necromancers able to control the zombies?\" There comes a point when realizes that her boyfriend, Connor is an infernal. He is a monster. Yet, Connor calls her by her name making her wonder how come he spoke. She shoots at him but never kills him. Civilians show up killing zombies but it never seems to end. Asher meets Cleave who explains what is going on but…who can you trust? Desolation is a book I do recommend if you like mysterious happenings as they are told in such an eloquent way. I could not do less than be persuaded into every scene as they seemed so real."}, {"userName": "Sonja Bristow", "userReviewDate": "May 16, 2014", "userURL": "http://www.goodreads.com/user/show/4985363-sonja-bristow", "userReview": "I enjoyed the twist of the different types of zombies and that of the ability of them to be controlled. However, the main character's constant whining (which was supposed to be angst, regret and internal turmoil) put me off. In addition, this is a fairly new zombie apocalypse and there must be some time to \"acclimate to the situation\", so I will grant allowances for this being all new and having to adapt quickly. However. I feel like the author took the whining to the extreme. For a man who just lost what is perceived to be his true love, it seemed rather \"quick\" for him to become interested in someone else. Whether we want to chalk it up to numbing himself via diversions (Anderson, Cleave & Poe), focus on your new found power and help your people. Finally, I hate to make the comparison, but I felt we found the male version of Kim Harrison's Rachel Morgan. The incessant whining, the focus on someone's physical traits rather than looking within or without to make the best of a horrible situation. I became so annoyed, I started slightly skimming to jumping to the end of the book so I didn't have to keep reading this whiny account. Is Asher talented? Possibly. But his triumphs strike me as super human flukes that worked out in his favor."}, {"userName": "Amber", "userReviewDate": "May 17, 2013", "userURL": "http://www.goodreads.com/user/show/7440008-amber", "userReview": "I have never been into the Zombies . I'm not one for scary movies and until Desolation I had never read a Zombie book. So, I was curious where this author would take me. The imagination, the thrill and the suspense in Desolation had me reading it in just a few hours. Seriously I was shocked when I put it down finished .A virus that turns you into a Zombie. (scary stuff and in Desolation it seems so real) There is the refuge where those that survive can hide . Then there is the necromancers who can make the zombies do as they say. (pretty cool although not everyone thinks so) This book is action packed right from page one.Each character gives something to the story development. Each having their own awful story of what happened in the past and each offering something in the struggles for the future outcome. Desolation was a winner in my book I\"d definitely pick up another from author Travis Simmons.disclosure: I received a complimentary copy for reviewing purposes. All opinions are my own."}, {"userName": "Andrea Kruse", "userReviewDate": "Jun 05, 2013", "userURL": "http://www.goodreads.com/user/show/15422949-andrea-kruse", "userReview": "Though not a stranger to reading paranormal literature, this was one of my first zombie books. Boy, I think I may be hooked!Movie experiences aside, Travis Simmons brought some even more chilling ideas up beyond the usual zombie apocalypse for me. From necromancers to living zombies and speeders and infernals, it was enough to keep me riveted to the story.The main character of Asher St. Paul was easy enough to fall in line with. Tired, alone it is hard not to root for him to get up and keep fighting against the zombie hoard ... as well as all the twists this story has to throw at him. Some of the action was a little hard to follow smoothly, but overall the story was good enough to keep reading.Disclosure: I received a free ebook copy in exchange for an honest review. All opinions are 100% my own."}, {"userName": "Debbie Denny", "userReviewDate": "Jun 10, 2013", "userURL": "http://www.goodreads.com/user/show/8185358-debbie-denny", "userReview": "To begin with, Zombies are not of much interest to me. Not sure why I decided to read this book, but I did. Pretty satisfied with that decision. Travis J Simmons did a fantastic job of drawing you in to afterworld of a zombie epidemic. I did see many twists and turns that piqued my interest and kept me glued to the story. I was overwhelmed by Asher as he discovers and learns exactly who and what he is. I found myself holding my breath many times as he battles his own doubts and perceptions, in addition to zombies and the dark necromancers. 'Desolation' has so much more than the expected zombie gore.... it is a suspenseful, sometimes mystical story. A story that includes our hero coming to terms with those he has lost and those he continues the fight to save. So I will have to give 'Desolation' a thumbs up, and anxiously await the story to continue."}, {"userName": "Karl", "userReviewDate": "May 26, 2013", "userURL": "http://www.goodreads.com/user/show/15083675-karl", "userReview": "Overall, I thought this was a fantastic book. Which surprised me since I am getting sick of all the zombie movies and books that have flooded the market. It drew me in and kept me engaged. The writing was very good. I enjoyed the main character as he found out the extent of his capabilities and coped with the new dystopian world. The imagery of what he saw as the human soul versus the evil of the virus was well done.The reason I did not give the book a rating of five is that I felt the story could have been expand in certain areas to provide either more background or explanation of what was occurring or had occurred. It leaves you hanging at the end and antsy to read the sequel!"}, {"userName": "Amber Mabry", "userReviewDate": "Jun 10, 2013", "userURL": "http://www.goodreads.com/user/show/13935223-amber-mabry", "userReview": "Let me start by saying that it took A LOT of bravery for me to sit and read this book. I'm one of those people that are TERRIFIED of Zombies. So much in fact, that I don't say the \"Z\" word out loud and nobody in my house is allowed to say it either. lol But I made myself read this book a few chapters at a time and I'm glad I did. Desolation isn't like a normal zombie book. Usually they are all the same but Travis Simmons created a book so unique I actually had to call my sister and tell her about it. lol That is pretty unusual for me. I really enjoyed this story. Every couple of chapters something \"new\" happens that adds to the mystery and the drama of the story. Greatest Zombie book that I've ever read! 5 stars for sure!!"}, {"userName": "Laura Frost", "userReviewDate": "Jun 10, 2013", "userURL": "http://www.goodreads.com/user/show/18163011-laura-frost", "userReview": "Awesome! Go get yourself a copy NOW!Zombie? CheckGay Love Story? CheckMemorable Cliffhanger? CheckWhat more can you want? Asher St. Paul is the type of protagonist that you root for from page 1. There isn't a single page where you wonder why you are following him as the main storyline. Sure, there are parts where I wished for more, scenes that seemed a little glossed over, but hey, it leaves room for a sequel (or 2)."}, {"userName": "Kittykills", "userReviewDate": "May 17, 2013", "userURL": "http://www.goodreads.com/user/show/12523911-kittykills", "userReview": "I stopped reading at page 120 and those pages took me almost seven days to read because this book put me to sleep each time I picked it up and tried to read it. I wanted to kill Ash myself, and the boyfriend zombie really made my eyes spin about in my head at the time. The characters weren't fleshed out enough and the storyline was somewhat redundant as Ash is a survivor, has to kill but he can't quiet commit to finishing the job."}, {"userName": "Rachella Baker", "userReviewDate": "May 31, 2013", "userURL": "http://www.goodreads.com/user/show/19174350-rachella-baker", "userReview": "I WON THIS BOOK THROUGH GOODREADS FIRST READ GIVE-A-WAY PROGRAM.WHAT A BOOK,IT WAS AWESOME,ZOMBIES ARE NOT MY FAVORITES BUT THIS BOOK WAS REALLY GOOD,HOPE TO READ ANOTHER BOOK ON ZOMBIES.THANK YOU"}], "description": "Asher St Paul thought it was just a typical zombie apocalypse like in the movies, until the necromancers crawled out of the woodwork. Since the undead have chased the living into hiding, the necromancers are able to roam freely in a new America of their making. Asher is seeking safe harbor. The need for safety is what drove him from his home in Philadelphia Pennsylvania before it was shelled. He has searched from quarantine to quarantine, always finding them overrun with zombies until he hears of The Refuge, a military compound in Binghamton New York. With his family and lover lain to rest by his own hand, he has nothing left to lose and gives everything he has to reach the safe haven. But questions arise when he reaches The Refuge, mainly, how has he been able to sustain multiple zombie bites and not change? He thinks he has found safety in the military compound turned quarantine, but he was wrong. Even now there is a necromancer trying to make The Refuge their kingdom of the dead.", "title": "Desolation", "url": "https://www.goodreads.com/book/show/17877167-desolation", "average": 3.98, "cover": "https://images.gr-assets.com/books/1367447741l/17877167.jpg", "reviews": 26, "authors": [{"url": "https://www.goodreads.com/author/show/4342608.Travis_Simmons", "name": "Travis Simmons"}], "type": ["Horror", "Horror", "Fantasy", "Science Fiction", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/17877167-desolation", "http://www.goodreads.com/book/show/18713256-desolation", "http://www.goodreads.com/book/show/30129257-dragon-born", "http://www.goodreads.com/book/show/18191396-killian-s-moon", "http://www.goodreads.com/book/show/30370492-dragon-plagued", "http://www.goodreads.com/book/show/9294978-the-bonds-of-blood", "http://www.goodreads.com/book/show/17450952-the-mirror-of-the-moon"]}