{"ratings": 29, "userreviews": [{"userName": "Dianne", "userReviewDate": "May 07, 2017", "userURL": "http://www.goodreads.com/user/show/7395171-dianne", "userReview": "Who and what are Destiny and Serenity? What is their special bond that transcends the earth plane into a land of dreams, visions and emotions? Why do they draw people to them? Why do some become their protectors? Is it Fate? A bond beyond human comprehension? Their pasts holds some answers, but brings more questions. Questions that cannot be understood until they are ready. For all the light they give to the world, there is a darkness that attempts to douse their goodness, and it is getting ever closer, ever more dangerous and ever more deadly. India R. Adams brings the second book in her Forever series to light with DESTINY as we follow Destiny, the popular singer/entertainer and witness the guidance she gives to Serenity and the confidence she shows in the powers Serenity is just discovering are growing.Serenity’s powers make her fragile, her demure size makes her seem waif-like and encourages other to watch over her in a world that cannot know she is different. With life comes choices and change and both Serenity and her husband and protector, Derek have changed their life paths when Destiny takes them under her wing and gives Derek the opportunity to fulfill one of his dreams, to be a rockstar. Could it be this very change that will help Serenity learn to grow from within and embrace her true potential as a special being who has faced hell and survived?When evil closes in under its cloak of darkness, even her protectors may not be enough to keep her safe. Will her innocent view of the world and the undying trust she feels in those around her be her downfall? Could it be that only one can truly protect her with undying and eternal love? Could it be Destiny's strength and knowledge that will be the light they all need?Ms. Adams brings a world of fantasy and the unknown to her readers as Destiny and Serenity’s tales unfold. Whether you believe in spiritualism or not, in a power we cannot see, in the possibility that there are those who walk among who are more than human, this tale of love, intrigue, devotion and loyalty will certainly grab at your heart as these characters are caught between what they can see and touch and powers that go beyond human understanding.There is a special atmosphere to Ms. Adams’ writing as she gives us full-bodied characters, some that seem too naïve, some too fearful and some fiercely loyal and protective. It is the evil or dark side that remembers veiled and threatening. There is no face to place on the villain. Could it be because evil invades the weak or the self-righteous, making its number legion? Will Serenity have the strength she needs to come into her own? Will Destiny remain as her guide?A unique read that flows along almost poetically at times, peppered with humor, kindness and caring.I received an ARC edition from India R. Adams in exchange for my honest and voluntary review.Series: Forever - Book 2Publisher: India's Productions; 1 edition (May 16, 2017)Publication Date: May 16, 2017Genre: Visionary | YAPage Count: 617Amazon |  Barnes & NobleFor Reviews & More: http://tometender.blogspot.com"}, {"userName": "Carrie", "userReviewDate": "May 13, 2017", "userURL": "http://www.goodreads.com/user/show/36817401-carrie", "userReview": "Destiny is the second book in the Forever series by India R. Adams. The story in Destiny picks up after the ending of book one of the series, Serenity. The series a YA/NA fantasy romance story that centers around young Serenity grew up with an abusive home life but also knew there was something a bit different about her in which she can see the light surrounding everyone around her. Serenity has a small group of close friends in which she trusts which includes her now husband, Dereck. At the end of book one they had met the famous country music singer Destiny who shared a special sort of bond with Serenity. Dereck is now performing with Destiny allowing Serenity and Destiny to explore their bond. This series is a bit different than any I've read in the fact that it has such subtle touches of a fantasy edge to it with Serenity and the bond she shares with those around her. But the story contains such heavy subjects such as abuse, rape and alcoholism that I would warn of those for the casual fantasy fan. The story can be lighthearted at times but also covering heavier topics at other moments for an emotional roller coaster. The author as always has brought her characters to life in such a way that is always quite compelling. Quite the unique read with complex characters with a bit of a fantasy element. I received a copy of this book from the author. For more reviews please visit https://carriesbookreviews.wordpress...."}, {"userName": "Snow", "userReviewDate": "Apr 25, 2017", "userURL": "http://www.goodreads.com/user/show/31719636-snow", "userReview": "4.5 starsABSOLUTELY POWERFUL & OVERWHELMING STORY!The second book in Forever series follows the lives of Serenity, Dereck, their Crew - Josh & Jolene, Roc but now they are intertwined and even more connected with Destiny, a famous country singer, her husband Sawyer and the memeber of the band while Serenity's and Dereck's lives change in the terms of making career choices, and their future (in their life together), the pending fears of horrors we've faced along with Serenity in book 1, here, we find her growing more but still staying the innocently open-hearted, inspite the damage and pain and hurt she experienced in her young life, along with the knowledge that she is indeed different, special...\n\nSome people are telepathic. they hear voices or thoughts not said out loud. Some are clairvoyant. They see images or little movies in their head. Some people are empathetic. They feel others' emotions or pain. Some people are healers. Some are protectors. Some people have precognitive dreams, and some have great intuition, an immediate insight to a situation they're in. Some people read auras, the energy light around your body...\n\nand she's just trying to cope with the notion and accept it along the way...\n\nWe should love our space, which is truly loving ourselves. You worry so much about everyone else's space that you are not taking the time to love your beautiful space.\n\nand still Serenity is doing just that - giving in to the space and opening up the heart to the close unity of people that love her and protect her, especially Dereck who is her lifeline and the essence of her existence, her savior, her protector - while the evil spreads its tentacles trying to shatter it all into the dark abyss of destruction using the rare human vulnerability - empathy - into its favor, taking the collateral victims along its devastating path...and still the scary event is yet to take its place...It's really hard to present this story and not really give the details away, and yet you can't say anything from the top of your tongue cause it will sound utterly sensless, meaningless not to say stupid. Gah...This is a complicated story, carefully intervowen with the threads of lulling poetic writing of \nIndia R Adams\n and just when you think you picked up the right tone and pace, she tosses you a curve ball and brings turmoil and whirwind of shattering events and emotional rollercoaster that all you can do is gasp, then curse the hell out of the read pages, then sigh in relief that you made it along with the characters till the end, after all...right?! Right?!amazingly beautifully written, powerful, emotional, insightful and overwhelming story of\n\nTrust, strength, growth, change, bravery, friendship, love, paths, and most of all...faith.\n\nMy solemn bows and gratitude go to the author India R. Adams for her kind gesture of giving me the ARC.still #Snownotears, lol but keep the faith *wink*"}, {"userName": "India Adams", "userReviewDate": "Mar 29, 2017", "userURL": "http://www.goodreads.com/user/show/49911281-india-adams", "userReview": "Create light... and there will be no darkness"}, {"userName": "Yesha", "userReviewDate": "Aug 04, 2017", "userURL": "http://www.goodreads.com/user/show/54254365-yesha", "userReview": "*** Note: I received book from the author, in exchange for an honest review. I am glad I got a chance to read this book. ***Alert! Alert! It’s damn emotional heartbreaking story. It includes bullying, abuse, rape, privacy invasion, media harassment. It will definitely give heart attack. I don’t know who performed CPR but I’m alive. Yeeyyy for that. And I have this very bad feeling that this is just beginning and more will come in the next book of the series ‘Mercy’. (Have a mercy on me India. 😉 ) So readers be prepared, harden your heart.Another scary thing apart from all these was ‘Preface’. India scares me right from the beginning in all her books. And keep wishing me oh God, no, this is not going to happen in the book!Characters– ‘Destiny’ mainly focus on ‘double’- double D and S, couples, and 2 main characters with magical gifts. Am I making this confusing? Sorry!! Okay, so 2 Couples Serenity-Derek and Swayer-Destiny. 2 main characters- Serenity and Destiny. Now it will be clear.There were many characters in this book, as both Destiny’s boys and Serenity’s crew were together with new characters too in the book. I loved all of them, they all developed with Destiny and Serenity in the book. They all were such a good people with so much understanding and without any jealousy and selfishness that I wish they become real to make this world beautiful as they did for Serenity and Destiny. Apart from my favorite couple Jose and Jolene, I loved 2 bodyguards most as they guided well and talked sense to the featuring couples of the book.I liked both Destiny and Serenity, but Serenity annoyed me a little as she was too innocent that she couldn’t see how her action will turn out and which she couldn’t bear. Though, it made story more realistic I wish she start acting mature and listen to Derek. Same goes for Destiny.What I liked? All characters and story, I liked this whole book and India’s flawless writing.First few chapter of the book cover the brief summary of the first book ‘Serenity’. Amazing opening of the book with the court session. Magical connection, Music, Emotions, Loyalty, Love and Friendship controlled this book. This book shed a light on-Derek’s career in music industry. I don’t have any musical bone but I loved to know more about music industry in this book. The songs and lyrics in the book were mesmerizing specially ‘my pledge one’.Destiny’s past life and her fears was heart-wrenching. I can’t believe Destiny has gone through all those horrible thing. It literary broke my heart. While just reading in the book, those scene can disturb me at such high level, I can’t imagine the pain of those who have suffered this cruelty in their real life.The struggle of characters with their growing fame. Among all dark things of the book, invasion of privacy by media and fans was more highlighted and infuriating. Privacy is one thing I can’t compromise with and so this part touched my nerves. I wanted to kill those reporters. How their mind could work with such negativity! It showed the true face of celebrity’s life. I’m glad I’m normal ordinary person.Bullies and name calling thing in the book was really disturbing. And the reason they created names for Serenity was just idiotic. I loved it when Serenity called them crazies and how Destiny explained it as a darkness. That’s the proper name for them. I guess every topic of this book was touching my nerve and it is coming out in this review.And of course we learn more about magical connection between characters. The songs written by Destiny in the first book was described more clearly in this book. I loved learning about Destiny how she wrote in journal, how she connected with Serenity and learned about her gifts. I liked how she explained everything about her and Serenity’s gift to Derek about the darkness they were in fight with. The danger she was in, the threats she was receiving gave a more clue on what is going to come in the next books. The emotions in the book were so raw that I knew what was coming in the book from very beginning, also at few points in the story, I was even prepared for the worst and still it touched my heart with a force. Not whole book was sad. There were many funny moments that made me laugh out loud and were soothing and a great relief in-between terrible moments. I like India’s humor in this book. I was crying mess at some point and laughing like manic at the other.The pledge thing was really touching and awe-inspiring. I wonder how other characters recognized that connection. How they felt they need to pledge. The best moment of the book that I loved most was, when Destiny showed Serenity her worth.This book was comparatively slow than the first one, but the slow pace was worth it. And I can’t read such heavy topic with express speed. I love India’s writing and stories for never giving me a negative point to write.Overall, I was lost in the book totally. It was damn emotional meaningful book with heavy topics and beautiful romance and friendship.Who should read it? I recommend this book to everyone. There something to learn for everyone."}, {"userName": "Catherine Imbeault || The Reading Cat ||", "userReviewDate": "Dec 08, 2016", "userURL": "http://www.goodreads.com/user/show/38784623-catherine-imbeault-the-reading-cat", "userReview": "I received a Beta copy of this book from the author India R. Adams. Thank you infinitely India!This book definitely lived up to its predecessor, Serenity. It was just as heartfelt and emotional, yet had a different level of maturity. One of the aspects I thoroughly enjoyed was Serenity's character development and how India really pushed the envelope; pushed Serenity out of her comfort zone. It really accentuated the maturing of this incredibly strong character, and showed growth on the author's part as well.Something new about this book that I also enjoyed was the double narrative with Destiny and Serenity. It allowed for an exploration of the similarities and profound connection between the two wonderful females. Lastly, India is such a poet, it blows my mind. The sporadic poems and songs really grabbed my attention and made me love the book so much more. They are elegant, sophisticated, and absolutely natural in the story. I swear, if she wrote a poetry book, I would buy it.As soon as this book goes live, every single person should buy it. And if you haven't read Serenity, what are you waiting for? https://www.amazon.com/Serenity-Forev..."}, {"userName": "Sharon Mariampillai", "userReviewDate": "Sep 24, 2017", "userURL": "http://www.goodreads.com/user/show/28086295-sharon-mariampillai", "userReview": "I received a copy from the author, in exchange for an honest review.Thank you India R. Adams for the opportunity to read your book. I was supposed to read this a few months back, but I lost track of time and did not start it when I wanted to. The first book was amazing, and I have to say that I thought that the second book was better. I loved the story. It dealt with so many issues that occur in our world today: bullying, rape, abuse, and so much more. The beginning of this book really pulled me in as it began with a nightmare, and I was hooked from that moment on. I loved the two main couples: Dereck & Serenity, and Sawyer & Destiny. I thought the characters were amazing. They were so relatable and easy to connect with. I usually do not like slow paced books, but this book was perfect at this pace. It was another emotional roller coaster. I really felt sad at the end, but it makes me wonder what book 3 - Mercy will have in store. I cannot wait to read the third book. Overall, a fantastic read."}, {"userName": "Janine", "userReviewDate": "Dec 05, 2016", "userURL": "http://www.goodreads.com/user/show/26407549-janine", "userReview": "Wowza !!!This book was fanfreakintastic!I am a huge India Adams FAN. Her books transport the reader into the story.The characters are well developed and you grow to love each and every one of them.This book grabbed me from the first pages and I couldn't put it down.I would have plowed thru it in one day except that work got in the way.LolI love love loved this book!! ❤❤❤❤❤"}, {"userName": "Sage Knightly", "userReviewDate": "Jan 22, 2017", "userURL": "http://www.goodreads.com/user/show/32900412-sage-knightly", "userReview": "I hate that it took me so long to read this magnificent work of art! It's an emotional roller coaster I never wanted to get off of and I still don't want it to be over. I adore this series<3"}, {"userName": "Tamara Harrington", "userReviewDate": "Mar 11, 2018", "userURL": "http://www.goodreads.com/user/show/52843272-tamara-harrington", "userReview": "WOW!!!!! Just WOW is how I have to start this reviews. India has done a bloody brilliant job with this book. It is book two in the Forever series and yes, you do have to read book one first or nothing will make sense.Now having said that, this book is brutal to my emotions. This is everything that I love and hate all rolled up into one which ensured that I did not put this book down. I have just spent the last sixish hours reading this book because I am so addicted to how it made me feel. It gives us an insight into who Serenity is and we learn so much about Destiny. I am convinced that I want to know these two woman personally because this book has made me feel awesome! It's a few years later and Serenity has grown and is such a force to be reckoned with yet and yet she still has that naive vulnerability to her that I have come to love. The more people that come into her life, the more I long for such friendships of my own because the love is just too beautiful.I will tell you that I have laughed and cried and just felt throughout this whole book and at the same time, I am using some of this amazing advice that Destiny has given to Th Crew, The Boys and The Guys and will be surrounding myself with more happiness and focus on bringing more positivity to my world.Thank you, India for another beautiful book with truly inspiring words.This is my honest and unbiased review."}, {"userName": "Anna (Adventures with a Book Nerd)", "userReviewDate": "May 03, 2017", "userURL": "http://www.goodreads.com/user/show/30608333-anna-adventures-with-a-book-nerd", "userReview": "~4.5 Stars“Serenity”—Dereck kisses me as he gently lays me back on our bed, moving his body over mine—“if I fail, if I lose you, will I see you”—he chokes on the painful words—“again?”My throat tightens, fully understanding his fears. He has lost me in every lifetime I can remember. I softly reply with my open heart, “Dereck, you will see me in the future, the present, the past. For everything, including you and me, is as one.” So, I've actually had this book read for a while now, but because of the past couple of weeks being crappy, it never got written. So, here I am! I made it! I'm late, but I'm here. I actually started rereading this a couple days after I finished (the beginning of the crappy weeks), and I had to stop myself. Because it was obviously way to early to be rereading it. You need to wait at least a week. Oh, and this book didn't kick me into a pit of alligators this time! No, it was a pit of rabid hyenas. So, I guess that we improved?This book takes place about a year after we left our favorite characters in the first book. All of the gang is in college (well, almost all of them, sorry Sky), and Dereck is working on his music career. Meanwhile, Destiny is helping Dereck, while her husband tries to protect her. This book starts to transition into the paranormal aspect of the series, while still keeping the drama and humor of an Adams's book.To be completely honest, I was terrified of this book. Mainly because I knew that we would have Destiny's POV, along with Serenity's. And I know exactly why this terrified me. It's because I was scared of loosing Serenity. I didn't know Destiny! Serenity is my main girl, and always will be, but after reading one chapter from Destiny's POV I was completely in love with her. This doesn't mean that you can get rid of my Serenity though! I'm expecting at least half of the next book to be from her POV so that I can get my Serenity fix. \"The cell hits the floor as I run to the couch, retrieving the book I grabbed off Faith's bookshelf earlier- to strengthen my cover- and I sit, acting as if I'm relaxed, reading. My eyes bug out of my head when I realize this book is in Spanish.\"I feel like Adams's is just going to pick a different couple every book, and just fuck with them. Because, Adams's, YOU SCARED ME! IT WAS SCARY! WHA, WHAT WOULD HAVE HAPPENED IF YOU HAD PULLED ANOTHER SKYLER?! YOU CAN'T KEEP DOING THIS TO MY HEART! That being said, A+ on the \"Let's make Anna Cry\" test. You passed. I do wish that this book had had a bit more action. Because the event that the book was leading up to, never actually happened. This made the whole book feel like a filler book. It is crucial to the series, yet not much happened. But, I wasn't ever bored while reading this one. Figuring out what was happening, and why. Along with getting to know our new group of friendly faces (remember, boys, to always use condoms!). So, did I like book one more than book two? Short answer, no. And I wasn't expecting to. The thing with Serenity was that I read it at the right time, and it really impacted me. Serenity will always hold a piece of my bookish heart, and it will be very hard to beat. So, was Destiny a bad book? Fuck no. Destiny was fucking majestic, but it was different that the first book. It isn't as emotional, and more mature in a way. Which is good. The writing and story telling matured with the characters, and made this book a treat to read. This book has me developing theories (mainly regarding some of the writing, one character that is no longer with us, and the phrase, \"back when my human form\"), and I'm very excited to see where the story advances next.\"The beast stalks the fairyThe fairy chases the lightThe light seeks the heartThe heart fears the night\"I received a copy of this book in exchange for an honest, and unbiased review."}, {"userName": "Briana", "userReviewDate": "Apr 29, 2017", "userURL": "http://www.goodreads.com/user/show/18913814-briana", "userReview": "I love this series so much! The fact that I finished this one day says something Lol There were so many explanations given in this book, and I loved that. I know many other series wait till the last book to really explain the the things we, the reader, do not know. I love Destiny, Sawyer, The Boys, The Crew, and every other main person I haven't mentioned #nospoilers I have to say, I have no bad criticisms of this book. This writing is unique in and of itself and it deserves all the love and awe I have for it, and the books beautiful author!5.0 stars ***ARC given to me by my BFF India R. Adams for an honest review***"}, {"userName": "Karin", "userReviewDate": "May 14, 2017", "userURL": "http://www.goodreads.com/user/show/51158276-karin", "userReview": "Destiny picks up shortly where Serenity, the first book in the series, ends. I didn't think I could love Serenity anymore then I already did but, I do. She is truly resilient character having overcome so much and is still so sweet, kind & not jaded in a way. She is also written beautifully, as is Dereck. I forgot how much I missed these characters. We get the see Serenity and Dereck a little more grown and matured in this book, as all the secondary characters. This book also starts revealing more and more information as the story goes on which I appreciated cause I am truly impatient at times. With Indias writing I try to leave my review as vague as possible only stating my opinion as opposed to spoilers cause it will be very easy to ruin the book which would be such a disappointment when it comes to her stories. Her writing is truly magnetic in a way to me and has been ever since I read Steal Me. She can draw me in, in a way not many authors can. There's virtually nothing that she could write that I wouldn't read. She is truly a very gifted writer and her books always bring out genuine raw emotion in me. When I read her books it takes me on a journey along with characters. There's only a handful of authors I'm truly a fan girl of, and India is on top of that list!!I voluntarily reviewed a advanced readers copy of this book"}, {"userName": "Angel ", "userReviewDate": "May 01, 2017", "userURL": "http://www.goodreads.com/user/show/14918811-angel", "userReview": "Wow India did it again! Yep she made me cry.I had a plan to how I was going to approach this book. I didn't want to rush through devouring it in one session. So I intended to pace myself. A few pages in and i had to put it down. What I was reading caused an ache in my chest and a deep inhale. Off to grab the kleenex I went.My good intentions didn't last long. I was soon devouring the pages. Growing as the characters grew. Hurting as they hurt. Loving as they loved.I'm not going to tell you what happens etc as I feel this series in particular is about how this story makes you feel. Connecting to all the characters in a story is rare. But in this case it's impossible not to.I'm still clueless to the purpose of Serenity and Destiny. And I'm still perfectly ok with that.Thank you India for allowing me to read Destiny and for bringing me into your world. Sharing your heart and light with us all. #Createlight"}, {"userName": "Amanda Clay", "userReviewDate": "May 16, 2017", "userURL": "http://www.goodreads.com/user/show/30444075-amanda-clay", "userReview": "What a hauntingly beautiful story! Such a fan of India’s work. It’s a difficult book to put my thoughts on Destiny into words without giving much plot away but I will say that the writing will pull you right in and in an instant you’ll be back in Serenity and Dereck’s world. This time you’ll follow Destiny, mysterious singer with a connection to Serenity. It’s a subtle world of fantasy and the unknown. Something spiritual and powers that are more than human, testing love and fate. It was one of those books that I devoured in an afternoon. If you haven’t read Serenity, the first book, pick that up and make sure to make time for Destiny!"}, {"userName": "Paulette", "userReviewDate": "Apr 04, 2018", "userURL": "http://www.goodreads.com/user/show/46778480-paulette", "userReview": "I don’t even know where to begin with this review. This book slayed me. In my last review I said this is a book that deserves to be read. Let me repeat myself. This is an important piece of work. Although it is fiction, the author has taken very relevant issues and theories and put them into a meaningful and entertaining context. Please don’t misinterpret entertaining as light and fluffy. Think of this as more interesting, fascinating, compelling and absorbing and you can’t get this story out of your head! The author touches on issues that will trouble you but are very prevalent in society, such as domestic violence, mental stability, and people’s belief systems. She brings to light that just because a mass of people believe something to be true doesn’t necessarily make it so. I, for one, believe this to be true. Just look throughout history. I’m sure many people thought our greatest inventors were a little (or More than a Little) out there.On a much lighter note, the characters in her book are handsome, beautiful, quirky, fun, and people for the most part you want to hang out with. It’s not all doom and gloom. If I’ve given that impression I apologize. She has some steam in this book that will make you swoon and bring all the feels. It’s described passionately and believable. The tender moments brought tears to my eyes as well as a smiles and at times laughs. The guys in this book are to die for!Let’s just say, I want a Dereck, Josh, Rocco, Sawyer, Blake.... yeah I’m not greedy or anything. Once you read this book and Serenity, you’ll want them too! The lead females characters are strong, beautiful, powerful and smart! They are not femme fatales. These women have substance! Yet they are tender and charming and stand together, not snarky and they don’t belittle. It’s a beautiful thing!The problem I have with her books is that it’s very hard for me to stop talking about them because they make me think and want to discuss instead of just review. She takes the fiction and makes it personal. This author is telling us much more than she actually lets on. It is important for you to keep a very open mind when reading her works. Believe me it won’t be easy when you read the story, it can be disturbing, but it is worth the journey you’ll take. There is so much more that I want to draw attention to but I don’t want to divulge the content. Just trust that if you read her work not only will your heart expand like the Grinch but also your mind, soul, and the love you possess inside for yourself and the universe we are all eternally a part of and connected to will as well. The worst part of this book is that it’s over and I have to WAIT for the next one to be released. Thanks for that India! Seriously, though, well done! I am so looking forwards to the next book. Although, I fear you will once again gut me but teach me in an insightful and beautiful way!"}, {"userName": "Courtney Giraldo", "userReviewDate": "Jul 03, 2017", "userURL": "http://www.goodreads.com/user/show/39408976-courtney-giraldo", "userReview": "Serenity and Dereck are married, navigating life at the University of Texas where Dereck is a beloved football star and Serenity is often heckled and scorned for her misunderstood past. After a video of Dereck singing at the Destiny concert goes viral, he is suddenly launched into stardom with a record deal, music video, and summer tour with Destiny. On the road, Serenity and Destiny's relationship deepens, and new protectors are added to the unusual group of people in Serenity's life. As they try to understand their unique relationship to each other as well as their unique abilities, a darkness threatens the group. Seeming to grow more powerful and dangerous as the groups relationships and devotions solidify, not everyone will make it out unscathed. I am glad that I stuck with this book and listened to my gut that this story had great potential as I really enjoyed the second installment to this series. Perhaps it was the fact that I was going into it with the knowledge that this group was different and that there seemed to be a greater force at work within their lives and relationships? I think the flashback scenes to previous lives were interesting and reinforced the idea that this group of people are meant to be together and have purpose. I would even venture to say I would love to see more and longer flashbacks that drew into the current plot line and struggles the group is currently facing. Speaking of the plot line, it definitely came together more in this second book with a much deeper understanding of how everyone really fits together, why they are they way they are if you will. The addition of all the new characters (there were a lot) seemed to fit together with the core group nicely. The new characters were all well written with fleshed out personalities (Zane was kind of my favorite, seconded by Tank). The sense of familial love palpitates from the pages and without giving away any spoilers, the scene with a main character facing mortal danger was honestly so tense and heartbreaking my eyes were flying across the pages to see what happened. Overall a good read and I am excited to see where Serenity's story takes us next!"}, {"userName": "annemarie_bookaholic", "userReviewDate": "Apr 30, 2017", "userURL": "http://www.goodreads.com/user/show/9471806-annemarie-bookaholic", "userReview": "Wow! I'm speechless....this book was amazing. I went through a plethora of emotions...I laughed, cried, was angry, and laughed some more. The way India writes just draws you into the story...it's like you are a part of what's going on..It's everyday life with Destiny and Serenity...you learn about them more in this book and what makes them so special. The joking amongst them and their friends is so real to life...that is why if you haven't read any of India's books you have to start and I would say what better way to fall in love with her books you have to start with the Forever series...pick up Serenity today and then when Destiny hits the stores RUN don't walk to your nearest bookstore or computer and buy it! Thank you India for doing what you do and for allowing me an ARC copy of your books."}, {"userName": "Alex Miller", "userReviewDate": "Jun 25, 2017", "userURL": "http://www.goodreads.com/user/show/60689433-alex-miller", "userReview": "First of all I might be really late but I did get this book as an ARC from the lovely India R. Adams. Thank you so much India!!!This book was a wonderful sequel to the Forever series. I love the character dynamics; they are complex and engaging and I wanted to know everything I could about each fully developed character. While I did miss the Crew a little bit getting to know the Boys was a good trade off. And I really liked how the Light allowed insight into different aspects of the story. Can't wait for the next one! :)"}, {"userName": "Lindsay Crook", "userReviewDate": "Mar 12, 2018", "userURL": "http://www.goodreads.com/user/show/31809609-lindsay-crook", "userReview": "Book 2 in the Forever series is just wow...There were tears yet again but gah India's words are so god damn beautiful I highly recommend getting lost in the wolrds she creates..I loved Destiny and the emotional rollercoaster it put on I'm so excited for book three..Give me more."}, {"userName": "Harini Nayak", "userReviewDate": "May 26, 2017", "userURL": "http://www.goodreads.com/user/show/41767095-harini-nayak", "userReview": "I hate India  I remember having asked her if the book was emotional ..and she said  no  . Was she trying to kill me with all the heartache , sending me un-warned ?Me reading it  :  I demand to know why you didn't tell me right away *points a gun at India *  Okay , throwing my rant aside...should I tell you that India creates the most complex , heart wrenching stories ? It's like she was programmed by someone to write them and this story is no different . And just like the other books from her , it's hard to give a review without focusing on the emotions and the writing style itself .  The one thing that hit me strongly than the other books is ..how the subplots were woven seamlessly in this book . And be warned  , get yourself a tissue paper bundle and don't read it in public . It would be awkward to cry like a baby and find stupid excuses . And..I'm not sure you would have read the likes of Destiny . This felt and was different from any other books I've read . I've been feeling the connection to Serenity from the book 1 , so it was def amazing to keep on with the series and seeing her grow . The book does have content which comes off as heavy-but I loved reading about them because I'm a masochist who loves heartache *yeah , when it comes to books *  I received an ARC of the book..but I'm so lazy I just came around to reviewing . Sorry for the delay India Blog Twitter Instagram Facebook"}, {"userName": "Sofiraindrop", "userReviewDate": "May 31, 2017", "userURL": "http://www.goodreads.com/user/show/16822468-sofiraindrop", "userReview": "4.5 starsI don't know why I loved this weird book, but I did. It's great for relieving the stress the author put me under and then some more. I don't understand why I became stuck halfway and then the rest of the book flew super fast?!"}, {"userName": "Michelle Campbell", "userReviewDate": "Jan 11, 2018", "userURL": "http://www.goodreads.com/user/show/33204033-michelle-campbell", "userReview": "This sequel is as riveting as the first in the series! Some areas seem long, some rushed, but it kept me on the edge of my proverbial seat! I couldn't wait to read more to see where the author took us this next chapter. If you haven't read India, yet, you simply must!"}, {"userName": "Paula Brown", "userReviewDate": "Feb 28, 2018", "userURL": "http://www.goodreads.com/user/show/57086618-paula-brown", "userReview": "Growth brings change-- and some times changes bring danger.This story shows the growth and maturity of the main characters;The Bonds between them deepen and they realize that there is more then meets the eye here. That in some cases understanding comes from sharing the same pain and scars.. The story reveals the lengths people who love each other are willing to go to protect the other..The story also shows that out of jealousy or hatred how evil can grow and spread.. This is a story that is still growing and developing--- I am capativated.. I want more more more... Awesome Job India"}, {"userName": "Merissa (Archaeolibrarian)", "userReviewDate": "May 16, 2017", "userURL": "http://www.goodreads.com/user/show/10258612-merissa-archaeolibrarian", "userReview": "Destiny is the second book in the Forever series, and it perfectly matches Serenity. Time has moved a couple of years, but Serenity, Dereck, and The Crew are still dealing with Sky's death (don't get me started again, I've only just stopped crying!). Not only that, but times change as schools change and life takes them in new directions. Serenity and Dereck's move them in a direction that neither of them would have guessed at, but both are loving it. Their heads are in the sand a bit, and they are protected by their friends. Whilst understandable, this does lead to some calamities that they have to learn how to deal with.What can I say??? I loved all writing by India R. Adams. I think her writing style is poignant and graceful. She deals a strike to the heart and makes you thankful for it! I actually made time to re-read Serenity before I read this ARC, presuming that I would just be catching up on characters and situations. Instead, I found myself feeling every emotion as though for the very first time. THAT is the quality of the author's writing. To re-read something and find it as fresh, soulful, and engaging as the first time is just phenomenal. Of course, the downside to that is that my emotions were a jangled mess when I started reading Destiny and they didn't unravel throughout. Ending on a cliffhanger, this is a fantastic addition to the series, and definitely leaves me wanting more. Ms Adams? You absolutely SLAY me, and I love you for it!* A copy of this book was provided to me with no requirements for a review. I voluntarily read this book, and my comments here are my honest opinion. *MerissaArchaeolibrarian - I Dig Good Books!"}, {"userName": "Rosie Amber", "userReviewDate": "May 07, 2017", "userURL": "http://www.goodreads.com/user/show/12118203-rosie-amber", "userReview": "Four Point Five StarsDestiny is book #2 in the 'Forever' series of romantic fantasies. It continues the story of Serenity, a young woman who suffered abuse when growing up, but is now surrounded by a group of dedicated protectors.This group is led by her devoted husband Dereck, who is a football player and, more recently, a budding musician. Near the end of book #1, Dereck and Serenity met country singer Destiny at a concert, and immediately there was a connection for them both. In this book, we are taken along on the road as Destiny and Dereck tour with the band. Serenity joins them and explores her growing relationship with Destiny in moments of quiet. I thought the atmosphere and camaraderie on the tour bus and at concert locations was very well written, giving the characters depth and a clear image for the reader.Under all the fun and singing, a dark layer exists. Serenity’s abusive father will soon be released from jail and Dereck will do all he can to protect her, while Destiny’s husband, Sawyer, joins forces with the male band members to protect Destiny from threats she is receiving. Once again India Adams has written a great book filled with characters you fall in love with, while finding yourself deeply engrossed in the storyline. The music industry element is a large part of this book, but doesn’t overpower the main themes of the series, such as abusive relationships."}, {"userName": "Jerica Jones", "userReviewDate": "Jan 16, 2017", "userURL": "http://www.goodreads.com/user/show/15984937-jerica-jones", "userReview": "I received a beta copy of this book from the author India Adams and I am so very happy that I did. Never have I felt such strong emotions with a book as I do with this book (along with all of her other books). You can clearly tell she pours so much emotion and energy into her books that you can feel every bit and want to cry in some moments and then catch yourself smiling from ear to ear in another or laughing out loud slapping your leg in the next. She also shows even more how much she cares for her characters and books by giving that extra that other books don't by actually writing poems and songs for the book that connect directly to our characters. This book allows us the ability to see the characters grow and learn more about them. We also see them starting to become adults and come closer to each other then ever! It is yet another 5 start from this wonderful author and I would recommend this to anyone!"}, {"userName": "Sarah-Jane", "userReviewDate": "May 17, 2017", "userURL": "http://www.goodreads.com/user/show/48158670-sarah-jane", "userReview": "What can I say? I absolutely loved this book. From the development of Serenity between the first book, the poems... India kept me on my toes as usual. This is a must-read.If this sounds like your kind of book, I recommend that you read Serenity first."}, {"userName": "Amy Shelton", "userReviewDate": "Oct 04, 2017", "userURL": "http://www.goodreads.com/user/show/28109093-amy-shelton", "userReview": "Independent Reviewer for Archaeolibrarian - I Dig Good Books!It sure was nice to dive into an “India Adams” book again. As per the norm, I fell in love with the story, I loved the continuation from book 1, Serenity, and I loved her writing style.I felt this book was a bit more emotional. The circumstances might have been a little different than the first book emotional wise, but it delved more into the relationship between the two female lead characters. It dove in deeper into Derek and Serenity’s relationship as well.It was, what I would call, an emotionally heavy book. I think it’s important to note, that if you’re mind isn’t in the right place, this book can take you down a rabbit hole. I had to start reading it twice just because I wasn’t prepared for what was coming. Understand what I’m saying, I didn’t stop reading it because it was bad writing, or a bad plot, or bad details. It was quite opposite actually. It was the intense nature that India puts into her writing. She tends to put everything she has into her books, characters, story lines, and it seeps from the pages. It carries over to the reader! So, my review might have taken longer to complete, it was simply because this book was over the top.Details were incredible and descriptions were chilling. The relationships between the characters are that of which you dream of having, in friends and your love. They are anything but perfect, but they are worth fighting for – every single day. The characters really carry this story. Their fierce bond to one another is something to be jealous of if you don’t have it in your life.As expected, it goes without say, I loved this book. I love this author and her writing ability. I love what she draws out of me each and every single story. I can’t wait to read what she writes for years to come!* A copy of this book was provided to me with no requirements for a review. I voluntarily read this book, and my comments here are my honest opinion. *"}], "description": "“Serenity”—Dereck kisses me as he gently lays me back on our bed, moving his body over mine—“if I fail, if I lose you, will I see you”—he chokes on the painful words—“again?”My throat tightens, fully understanding his fears. He has lost me in every lifetime I can remember. I softly reply with my open heart, “Dereck, you will see me in the future, the present, the past. For everything, including you and me, is as one.”The phenomenal connection between Serenity and country music star Destiny Crowe cannot be denied. But will they have the chance to learn what this connection is about when dealing with unexplained interferences? Can they handle the pressure, discovering more about who and what they are? Because the more the two women are together, the more things start happening, for better and worse. The brighter they shine, the more they are seen. The more they are seen, the more other energies notice… and try to interfere with fate.In this second novel of the Forever series, destiny will be tested, darkness will be tempted, and love will show its truest form.", "title": "Destiny\n      \n          (Forever #2)", "url": "http://www.goodreads.com/book/show/31685537-destiny", "average": 4.72, "cover": "https://images.gr-assets.com/books/1474808762l/31685537.jpg", "reviews": 29, "authors": [{"url": "https://www.goodreads.com/author/show/14881546.India_R_Adams", "name": "India R. Adams"}], "type": ["Fantasy", "Romance", "Young Adult", "Suspense", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/31685537-destiny", "http://www.goodreads.com/book/show/34808144-destiny", "http://www.goodreads.com/book/show/29957486-rain", "http://www.goodreads.com/book/show/29560746-my-wolf-and-me", "http://www.goodreads.com/book/show/29207112-blue-waters", "http://www.goodreads.com/book/show/29957508-serenity", "http://www.goodreads.com/book/show/29553364-black-waters"]}