{"ratings": 1978, "userreviews": [{"userName": "Jan-Maat", "userReviewDate": "Jul 06, 2011", "userURL": "http://www.goodreads.com/user/show/5617661-jan-maat", "userReview": "\"There's been many a one,\" the old postman said, \"who's saved himself just by not doing his duty at the right time.\"\"Then he's never done his duty at all,\" my father said curtly.\"In the far North-West of Schleswig-Holstein, just below the Danish border, the village policeman is intent on carrying out his duty by preventing the artist Nansen (apparently modelled on Emil Nolde) from painting.Told from the point of view of the policeman's son as an essay on 'The Joy of Duty' while serving time in a Borstal this is a fine depiction of the state of mind of the NS period and it's consequences in post war Germany. \\The narrator's father is the village policeman and is tasked with keeping the artist undewr observation and ensuring that he paints no canvases- amusingly the policeman develops second sight during the course of the war and he suffers from distinctly improper visions of death and defeat.There is both the narrow minded adherence to duty, the difficulty of establishing a democratic society after dictatorship and the father as policeman enforcing an orderliness (both in personal and cultural life) that is constricting rather than protecting. Difficult to live through and to grow out from.Lenz was part of the Gruppe 47 of authors, along with the likes of Heinrich Böll and Günter Grass, whose major pre-occupation was to use literature to create a more democratic society and confront the legacy of the '33 to '45 period a legacy that was dangerous in so far as it was internalised in everyday attitudes. A concern that is clear throughout this book. \"'The rats are boarding the new ship,\" Nansen said. \"You'd think they'd keep quiet, play possum, alone in the dark with their shame. But you've hardly heaved a sigh of relief, and there they are again. I knew they'd be back one of these days, but I never dreamt they'd be as quick as this. You can only wonder which is greater, their ability to forget or their utter shamelessness.\""}, {"userName": "Claudia", "userReviewDate": "Feb 08, 2018", "userURL": "http://www.goodreads.com/user/show/45870338-claudia", "userReview": "4,5 Sterne. Review folgt."}, {"userName": "Nerdles Mcfralerstein", "userReviewDate": "Aug 21, 2013", "userURL": "http://www.goodreads.com/user/show/12564049-nerdles-mcfralerstein", "userReview": "What struck me so strongly when I began reading this was the prose. It was unlike anything I'd read yet. I found myself reading snippets to my roommate out loud so I could share the use of imagery, detail, and language.  Most reviews I've seen on here give a brief synopsis, and that's very nice, but it doesn't tell why the book is so amazing. I picked it up at a used book store without any prior knowledge of the author or the artist upon whom it was based. And for that I'm glad. I went into it with an almost morbid curiosity as to what a German author writing in the 1960's would be saying about a German town in Nazi Germany. One thing that became obvious very quickly was that the word \"Nazi\" is never once used in the book. I found this to be an interesting omission at first but grew to appreciate it. Because it's not a book about the Nazis and it's not a book about WWII. It's a book about duty. This story could have been written about any society who finds itself in a war of ideals and has to cope with perceived \"enemies within.\" I realize that this is a quintessential piece of literature in understanding and explaining the everyday German population during this period, but it's much, much bigger than that.  On the topic of duty, the author has much to say. The protagonist's father is always espousing his views on duty. Duty to his country, duty to his post, duty to his leaders. There's also the undercurrent of the protagonist's own sense of duty with runs in two distinct themes. His duty during the retelling of his story (a duty to his brother, sister, the painter, and his own moral conceptions of duty) and his duty to finishing the task before him even when the people who originally gave him the task eventually try to make him stop. Finally, the painter has his own sense of duty to his art and craft despite those trying to silence him. In all cases, the duty of each is blindly obsessive.  Take away the elements of WWII, take away the Germans, and read this as a study of human character during extreme conditions Nationalistic existentialism. In the end, the only thing each character has to cling to is his or her own sense of duty. Be it a duty of self preservation, a national agenda, art and expression, or an obsessive quest of self identity."}, {"userName": "Seth", "userReviewDate": "May 22, 2011", "userURL": "http://www.goodreads.com/user/show/4351439-seth", "userReview": "Unfortunately, I must update this review to reflect a report in the German weekly Die Zeit that Emil Nolde, the artist who inspired this novel, was a Nazi sympathizer:http://mobil.zeit.de/kultur/kunst/201...I read this novel some time ago, but since it is one of my favorites, I thought I would call it to your attention (if you have not heard of it). The German Lesson, written by Siegfried Lenz in 1968, is one of the seminal works of post-war German literature. It sought to explain to the Sixties generation the behavior of their parents during World War II. Without providing a complete plot summary, which would ruin the reading experience for you, I will merely set the stage.The multi-layered novel starts in a home for juvenile delinquents on an island in the Elbe River, but the main action involves recollections of the narrator’s childhood in northwestern Germany near the Danish border. The narrator is Siggi Jepsen, a teenage boy who is being punished for refusing to write an essay in his German class. Now the prison has given him the assignment of writing another essay on the \"Joys of Duty.\" This provides an opportunity for the flashback to his childhood. The innocence of the child’s point of view is one of the appealing aspects of the book. For example, Siggi refers to the Gestapo as leather jackets (an example of metonymy). He explains how he became involved in frustrating the efforts of his father, a policeman, to stop a local Expressionist painter from carrying out his profession and to seize his art, which the Nazi regime regarded as degenerate. Adding another layer, Siggi is the subject of a psychology graduate student’s dissertation about the child’s supposed psychological disorder. Several chapters of the dissertation appear in the book.As is true of many historical novels, this one is based on fact. An interesting fact is that the painter’s fictional name is Max Ludwig Nansen, but he is modeled after an actual Expressionist artist, Emil Nolde. Nolde, in turn, was an assumed name, as the historical artist was born as Emil Hansen. The name Max Ludwig Nansen represents a composite of the names of two other Expressionist painters (Max Beckmann and Ernst Ludwig Kirchner) as well as a variant of Hansen."}, {"userName": "Francisco H. González", "userReviewDate": "Nov 15, 2017", "userURL": "http://www.goodreads.com/user/show/39537363-francisco-h-gonz-lez", "userReview": "Siggi, un joven internado en un reformatorio, el día que debe escribir una redacción con el jocoso título de \"las alegrías del deber\" se bloquea y entrega un ejercicio en blanco. A este acto de insumisión caligráfica, le sucederá un castigo con reclusión y aislamiento en su celda que supondrá que el joven logre extraer parte de su pasado vomitándolo sobre un buen número de cuadernos.Siggi entonces se aplica, recorre su pasado e irá espigando los momentos que recuerda de su vida: El puesto de policía más al norte de alemania en el que trabaja Jepsen (donde el Mar del Norte, en un territorio fronterizo entre Alemania y Dinamarca se convierte en un personaje más), su padre, Max, el pintor al que se le prohíbe pintar (y al que se le confiscan sus últimos cuadros, impeliéndole a pintar cuadros imaginarios) porque los colores son subversivos, tanto como la claridad nocturna tal que si alguien olvidará sellar las ventanas, la infracción de la ordenanza de oscurecimiento de ventanas supondría un delito, su hermano Klaas el cual se automutila durante la guerra y es detenido, luego deviene fugitivo y más tarde hijo (no) pródigo y entregado a la justicia por su severo padre, más tarde liberado, luego actor, fotógrafo, Asmus Asmussen, Jutta, su hermana Hilke...Todas las historias que sin proponérmelo, he retenido en mi memoria, empiezan y acaban mal. Todas, nos dice Siggi. En la narración brilla la relación de Siggi con sus padres, que sin llegar a lo que enuncia Thomas Bernhard en su relato Reencuentro manifiesta una carencia de sentimientos y de sensibilidad brutal, una severidad implacable, un sentido del deber y de la rectitud demoledor y aniquilante, que conlleva para Siggi una obediencia temerosa hacia sus padres, donde siempre median los inevitables castigos corporales por parte de sus progenitores ante los que el joven siente tanta inquietud como miedo. Un sentimiento de odio similar al que experimenta Hilke a quien le cantan las cuarenta al posar de manera procaz y muy poco decorosa según sus padres, para el pintor Max.La figura del pintor, su rebeldía ante el absurdo reinante del gobierno nazi que los somete, me ha parecido lo más notable del relato, al tiempo que pone de evidencia el poder intempestivo del arte, en este caso de la pintura.El pintor demostró de una vez por todas que el gran arte también contiene una venganza frente al mundo, pues condena a la inmortalidad aquello que esté quiere despreciar.Otro de los puntos destacables de la novela es la manera en la que sociedad criminaliza la diferencia, algo que el régimen homogeneizador nazi llevó hasta sus últimas consecuencias eliminando no solo cualquier atisbo de disidencia hacia su poder (muy recomendable para entender mejor esto es la biografía que Peter Longerich escribió sobre Heinrich Himmler), sino a cualquiera que se apartara de su ideal de pureza racial.La sociedad siempre se ha sentido desafiada, amenazada o subvertida por aquel que es diferente, y por ese motivo dedica a estos sujetos todo su interés y su desconfianza, y hasta los persigue con odio., dice Wolfgang Mackenroth, el psicólogo que analizará el caso de Siggi y con el que piensa elaborar una tesis.A medida que Siggi va reconstruyendo su pasado como actor principal, Mackenroth, en su rol de psicólogo, irá sacando conclusiones sobre la conducta de ese joven inadaptado que parece ser Siggi, tratando de explicar la personalidad de éste, recurriendo para ello a hechos objetivos. Hay una frase que me parece clave entre la relación que se establece siempre entre lo objetivo y lo subjetivo.Sucedió como lo cuentas, pero en realidad no fue así. Le dice Siggi a Mackenroth cuando Siggi lee lo que este último ha escrito en su informe tras leer Mackenroth los cuadernos de Siggi.Frase que demuestra los límites y el alcance de la psicología, de la misma manera que toda literatura es metáfora de la pérdida o cambio de significado que hay entre lo que el escritor tiene en mente cuando escribe un libro y lo que el lector aprehende con la lectura del mismo. Un libro basado en la memoria, en la reconstrucción de los hechos, es terreno fecundo para las elipsis, y sucede que esos momentos para mí más interesantes, como sería saber lo que le sucede tanto a Jepsen como a Max cuando son detenidos, cada uno por distintas causas, y luego devueltos a la vida normal, son momentos que Lenz nos sustrae, para contarnos otros momentos a ratos más tediosos, demorándose en cosas que hacen que en mi opinión la novela, descompensada, vaya de más a menos, con personajes como Hilke o Klaas que deberían de tener más cuerpo, pues ese campo de fuerzas, esa polaridad entre el sentido del deber (meollo del libro) a ultranza de Jepsen (deber convertido en una adicción, que lejos de sumar, resta y merma todo lo que éste tiene a su alcance) y la mínima observancia del mismo por parte de Max, a veces pierde fuelle y se desaprovecha la oportunidad de apuntalar algunos aspectos que están presentes en la novela sin llegar a entrar a saco en ellos, lo que hubiera hecho de la narración algo todavía más notable.Impedimenta. 2016. 496 páginas. Traducción de Ernesto Calabuig."}, {"userName": "El", "userReviewDate": "Aug 12, 2012", "userURL": "http://www.goodreads.com/user/show/83144-el", "userReview": "The story begins in a juvenile detention center where Siggi Jepsen narrates the plot. He is to write an essay on duty, and through the course of the copybooks he details his childhood in Nazi Germany, his relationship with his father, a police officer, and his friendship with an older artist friend. When his father's duty is to shut down the paper-friend, Siggi takes it upon himself to save as many of the paintings as he can. His father, when he finds out, has his son arrested for art theft.I had no previous knowledge about this book before reading it, which is normally how I like to do it anyway. I found a copy for super cheap and snagged it because I like Germany! And German stuff! But I didn't think it was something I'd get around to reading anytime soon (because I can sometimes be a very fickle reader). I'm glad I managed to read it now; while my description above is succinct, the story itself is much more interesting, much longer, and written much more beautifully. There's no way to give it its fair due here.Strongly recommended."}, {"userName": "nettebuecherkiste", "userReviewDate": "Jan 30, 2012", "userURL": "http://www.goodreads.com/user/show/5279356-nettebuecherkiste", "userReview": "Der Roman erzählt die Geschichte von Siggi Jepsen, dessen Vater während des 2. Weltkriegs das Malverbot der Nazis für den Maler Max Ludwig Nansen (für den Emil Nolde als Vorbild diente) durchsetzen muss. Das große Thema des Buches ist die Frage, inwiefern Pflichterfüllung zu Schuld führt. Wo hört die auferlegte Pflicht auf und beginnt die Pflicht, gegen die Pflicht zu handeln?Es fällt mir nicht leicht, eine Rezension für dieses Buch zu schreiben, denn ich bin nach seiner Lektüre etwas zwiegespalten. Einerseits handelt es sich ganz klar um gute, wichtige Literatur, an der mir auch Vieles gefallen hat, andererseits muss ich feststellen, dass ich mich im vor allem im letzten Drittel eher durchgequält habe. Und zwar vor allem dort, wo Bilder des Malers Max Ludwig Nansen oder expressionistische Malerei allgemein beschrieben werden. Diese Passagen erschließen sich mir einfach nicht. Gut gefällt mir hingegen der ironische Ton insbesondere zu Beginn des Buches. Häufig setzt Lenz als humoristisches Element Übertreibungen ein.Die zentralen Themen des Buches, Pflicht und Schuld, ziehen sich durch das gesamte Buch. Siggis Vater, der mit dem Maler aufgewachsen und befreundet ist, setzt das Malverbot rigoros durch und verweist dabei stets auf seine Pflicht, so zu handeln. Er steigert sich regelrecht in diese Aufgabe hinein und setzt sie sogar nach Ende des Krieges noch fort. Die meisten der Mitläufer und Opportunisten und auch viele Täter versteckten sich damals hinter der Ausrede, sie hätten ja nur ihre Pflicht getan. Die Fragen, die sich dem Leser stellen, sind: „Wie hättest du gehandelt? Wie schuldig hättest du dich gemacht? Und wo endet die Rechtfertigung?“ Gegen Ende scheint dieser Aspekt etwas in den Hintergrund zu treten. Doch dem ist nicht so, denn die Kinder der Kriegsgeneration, wie Siggi, sind es, die für die Handlungen ihrer Eltern oft indirekt einstehen, die ihre Schuld erkennen und aufarbeiten.Der Roman ist schwere Kost, aber man sollte ihn gelesen haben. Er gehört unbedingt zur deutschen Nachkriegsgeschichte."}, {"userName": "Robert Wechsler", "userReviewDate": "Oct 15, 2014", "userURL": "http://www.goodreads.com/user/show/17447518-robert-wechsler", "userReview": "I finally picked this book off my shelves when I read that Siegfried Lenz died at the age of 88. Boy, was I fortunate!What I found most special about Lenz's masterpiece is the way he used description not just to describe or set up a scene, but to complement thoughts and action, often metaphorically. I generally don’t like a lot of description, but Lenz’s descriptions are wonderfully offbeat, sometimes breathtaking. They are the novel’s greatest joy.The other things that make this WWII novel so amazing are the smallness of its world (a child’s world), its lack of physical violence, and its central relationship, between the narrator’s father and a painter who lives nearby, which epitomizes the war and is the equivalent for the narrator of war trauma.This novel feels a lot like The Tin Drum in terms of the first-person voice, the humor, the fast pace of the prose, and the off-centeredness with which the stories are told. I think The German Lesson is equal to this great work, and I don’t understand why it has not been better received in the U.S."}, {"userName": "Elizabeth", "userReviewDate": "Apr 13, 2008", "userURL": "http://www.goodreads.com/user/show/1079907-elizabeth", "userReview": "This is my number one book. It's about a painter who is forbidden to paint during the Third Reich. The story is told throught he eyes of a young boy whose father is responsible for making sure that the painter does not paint at all. Instead, the painter painstakingly paints them in his mind's eye. Some of these paintings he eventually executes and then hides. The descriptions are vivid, the reader can see these wonderful works of art in their minds as well. This is a fictionalized account of a true story about Emil Nolde the German Impressionist painter. Nolde was actually an Nazi sympathizer and the Unpainted Pictures created during this period are wonderful watercolors."}, {"userName": "Guille", "userReviewDate": "Feb 05, 2018", "userURL": "http://www.goodreads.com/user/show/57810023-guille", "userReview": "“Lección de alemán” es una novela sobre el deber. Esto es lo que se lee en cualquiera de las reseñas de esta novela que pueda llegar a vuestros ojos. Y en efecto, así es. También hay algunas reflexiones muy interesantes sobre el arte de la pintura y su apreciación, fácilmente trasladables al arte de la escritura y a la lectura, pero la novela, con un telón de fondo marcado por la pasividad de terceros, tiene como tema central el deber, su cumplimiento ciego, la irracionalidad de colocarlo por encima de cualquiera otra consideración, aunque también sugiera, a mí me lo ha hecho, el deber como excusa para satisfacer la picazón de otros intereses más inconfesables. La narración es muy contenida, muy cuidadosa con el detalle, con el gesto, muy pausada y descriptiva, lírica en ocasiones, lejos de dramatismos, de recursos efectistas, de lugares comunes sobre el nazismo. De hecho, no creo que sea tanto una novela sobre el drama del nazismo como una novela sobre cierta faceta de la personalidad alemana y, por tanto, de cierta clase de personas, sean estas de donde sean: ya lo dice uno de los personajes refiriéndose a su pequeña aldea: “Aquí se encuentra cuanto existe en el mundo.”Personalmente, hubiera deseado leer más sobre el conflicto personal que debe sufrir ese humilde policía de pueblo que tiene que cumplir y hacer cumplir las órdenes que recibe de Berlín contra un pintor “degenerado” y antiguo amigo suyo, pero aun así me ha parecido una novela notable y atractiva."}, {"userName": "Jennifer", "userReviewDate": "Apr 17, 2009", "userURL": "http://www.goodreads.com/user/show/716599-jennifer", "userReview": "Another title for this book might have been \"The Joy of Duty\", which is the title of the lesson assigned to the book's protagonist, young Siggi, who currently lives in an institution for delinquent youth. Siggi is initially immobilized by the assignment, eventually turning in a blank notebook. As he is forced to explain to the director, it is not for lack of material, but that there is so much to say that he is unable to organize his thoughts in order to record them.... therefore, he is given solitary and a complete cessation of interruptions and distractions until such time as the paper is complete. The only problem is, Siggi cannot stop once he begins, and the story unfolds in memoir form over the next few months, taking on a life and a legend of its own and weaving through Siggi's own pathology. It is a very personal story and most of it takes place in northern Germany ten years earlier, during the last years of WW2, when Siggi's father is the local policeman for their small town. A local artist, seen as a threat to the Reich, is prohibited from painting, and Siggi's father becomes the enforcer of the dictates from Berlin. His inflated and implacable sense of his own very singular duty affects himself, his family dynamics and the attitudes of the community, and his malevolent obsession with the painter, his former, childhood friend, far outlives the duration of the war."}, {"userName": "Elnaz", "userReviewDate": "Mar 24, 2014", "userURL": "http://www.goodreads.com/user/show/17433146-elnaz", "userReview": "رمان زنگ انشا خاطرات نوجوانی خلاف کار است که به خاطر دزدیدن چند تابلوی نقاشی دوران بازپروری را در پرورشگاه می گذراند.به او انشایی با موضوع فواید وظیفه شناسی داده شده که چون در زنگ انشا موفق به نوشتن اش نمی شود در سلول انفرادی به این کار واداشته می شود.زیگی پیزن برای انکه بتواند به درستی و زیبایی این فواید را به تصویر بکشد از خاطره ی پدر خود و نقاش محله استفاده میکند.لنتس در این کتاب علاوه بر شخصیت نوجوات بزه کار دو شخصیت اصلی دیگر هم دارد : یک پلیس کاملن وظیفه شناس که پدر مجرم جوان است و یک نقاش معروف که موضوع تابلوهای وی را مناظر و مردم شمال المان تشکیل می دهد.زمان داستان بیشتر در دوران نازی هاست.برای نقاش که در چارچوب قوانین المان نازی نقاشی نمیکند نقاشی کردن را ممنوع کرده اند.پدر مجرم موظف به سرکشی برای اطمینان از اجرای حکم درنظر گرفته شده برای نقاش است.پدر نماد یک انسان زورگو و نماینده دولت فاشیستی المان 1941 است و نقاش فردی مهربان و قربانی این دولت.در بسیاری از صفحات داستان , با طنزی ساده روایت میشود که چندان هم موجب خنده و شادی نیستبرگرفته از مقدمه داستان با کمی تغییر و توضیحات بیشتر ترجمه حسن نقره چیزیگفرید لنتس متاسفانه در ایران و کتابفروشی ها مهجور مانده.بی نهایت از خواندن این کتاب نسبتن حجیم لذت بردمبه شما هم پیشنهاد میدمالبته موقع خوندن سعی کنید اشتباهات تایپی رو نادیده بگیرید"}, {"userName": "Lara", "userReviewDate": "Sep 02, 2015", "userURL": "http://www.goodreads.com/user/show/33389531-lara", "userReview": "This book is basically about a boy in a detention center who has to write an essay on the topic of \"The joys of duty\". At first he doesn't even know how to start but when he finally starts writing he can't stop and all the memories of his childhood (during Second World War) in Northern Germany pour out of him. His duty turns into a month long writing obsession and he does enjoy it. The duty, his piece of writing, becomes his life. My duty was to read this book and I did (FINALLY - thank God!)succeed. But unfortunately, I didn't really experience the joys of duty. This book was pretty exhausting to read and I'm just happy that I'm done. But I have to say one thing: this isn't a bad book. I just couldn't really appreciate that."}, {"userName": "Guido", "userReviewDate": "May 25, 2017", "userURL": "http://www.goodreads.com/user/show/12281249-guido", "userReview": "Ik weet het wel, size doesn’t matter, en er zijn beslist grootse kleine boekjes. Een snelle greep uit de boekenkast levert alvast deze parels op: ‘Zonder mij’ van Philippe Claudel (109 pagina’s), ‘De voorlezer’ van Bernhard Schlink (176 pagina’s), ‘Alsof het voorbij is’ van Julian Barnes (158 pagina’s), ‘Dat is wat ik bemin’ van Isabelle Rossaert (149 pagina’s), ‘Rivieren’ van Martin Michael Driessen (139 pagina’s), ‘Sergeant Bertrand’ van Aleksandr Skorobogatov (158 pagina’s),… En die lijst kan beslist nog een stuk langer. En toch. Dan lees je ‘Duitse les’ van Siegfried Lenz, een kloeke roman van een dikke 500 pagina’s, en kan je niet om de conclusie heen: de lange afstandslopers behoren toch tot een andere categorie dan de meesters van de korte sprint. Ik zei het al: de norm is niet “hoe langer hoe beter”, want het aantal pagina’s zegt inderdaad niets over de literaire kwaliteiten van een roman, maar een auteur die erin slaagt de twee te combineren (én een sterk uitgebouwd verhaal én de volgehouden stilistische kwaliteiten) staat toch nog op een ander niveau. ‘Duitse les’ dus. De verhaallijn kort samenvatten is niet moeilijk: protagonist Siggi Jepsen bevindt zich, midden jaren vijftig, in een instelling voor moeilijk opvoedbare jongeren, ergens in de buurt van Hamburg. In de les Duits krijgt hij de opdracht een opstel te schrijven over “de vreugden der plicht”. Siggi Jepsen krijgt geen letter op papier. Zijn blanco blad wordt geïnterpreteerd als een stille revolte tegen het gezag; in werkelijkheid wordt hij zó overspoeld door flarden herinneringen dat hij onmogelijk orde kan scheppen in zijn chaotische gedachten. Het resultaat is: eenzame opsluiting tot de opdracht is uitgevoerd. En in zijn cel gaat Siggi aan het schrijven en pent hij het verhaal neer van de plichtsgetrouwe “posthuiscommandant” Jens Ole Jepsen (zijn vader dus), van zijn harteloze moeder, van zijn zus Hilke en broer Klaas (die zichzelf door de arm heeft geschoten om te ontsnappen aan het front), en vooral van schilder Max Ludwig Nansen. Vader Jepsen en de expressionist Nansen staan lijnrecht tegenover elkaar: het werk van Nansen wordt door de nationaalsocialistische autoriteiten beschouwd als Entartete Kunst, zijn schilderijen worden in beslag genomen en hij krijgt een Berufsverbot opgelegd. Zowel bij die inbeslagnames als bij het toezicht op dat verbod om nog te schilderen speelt vader Jepsen een cruciale rol. Maar ook als de oorlog uiteindelijk voorbij is, blijft hij Nansen bespioneren en couilloneren, want: aan de plicht mag niet verzaakt worden, ook al veranderen de omstandigheden. Protagonist Siggi wordt in een ambivalente rol gemanoeuvreerd: door zijn vader (die hij haat) wordt hij ingeschakeld als verklikker, van de schilder krijgt hij vertrouwelijke opdrachten om zijn schilderijen in veiligheid te brengen… (Wie wil weten waarom hij uiteindelijk in dat centrum voor jeugdige delinquenten terechtkomt moet het boek lezen.)Het verhaal van ‘Duitse les’ is boeiend, omdat het een indringend beeld schetst van de tentakels van het nationaalsocialisme in een uithoek van Duitsland, ver weg van het front. Ook boeiend omdat, zo leert enig opzoekwerk, schilder Max Ludwig Nansen geen verzonnen romanfiguur is maar gemodelleerd is naar de reëel bestaande expressionist Emil Nolde (die als echte naam Hansen had – één letter verschil dus). En nóg interessanter wordt het als, uit een recent opgedoken brief*, blijkt dat diezelfde Nolde weliswaar – en tot zijn grote verbijstering – een Berufsverbot kreeg opgelegd, maar eigenlijk een uitgesproken nazi-sympathisant was. Maar het is niet alleen omdat ‘Duitse les’ inhoudelijk boeiend is dat het ook grootse literatuur zou zijn. Dat is het ook en vooral om stilistische redenen. Siegfried Lenz is een meester in zijn beschrijvingen, in de psychologische uitdieping van zijn personages, in de manier waarop hij heden (de setting in de instelling) en verleden (het fameuze opstel) met elkaar verweeft. En nee, het is niet allemaal bittere ernst en kommer en kwel. Ook behoorlijk hilarische personages passeren de revue: de directeur van de instelling, de “lievelingsoppasser”, de student psychologie die een doctoraalscriptie schrijft over “de demonstratiepersoon”. Lenz’ taal is soms barok en wijdlopig, zijn beschrijvingen van de natuur (talloze keren het onderwerp van de schilderijen van Nansen) even beeldrijk als die natuur zelf. Maar hyperbeknopt kan ook: “Hier op het wad, uit de moddergrijze of leemkleurige woestenij, dooraderd met gelen, vergeven van ondiepe kuilen, moet volgens Per Arne Schessel, auteur en heemkundige, de ommekeer zich voltrokken hebben: wie ademen kon enzovoorts verhief zich op zekere dag van de bodem der zee, wandelde via de amfibie-achtige trap naar het strand, spoelde de modder van zich af, maakte een vuurtje en zette koffie. Zo schreef mijn grootvader, de heremietkreeft.” Zowaar de Genesis in één welgemikte zin.Samen met Günter Grass en Heinrich Böll wordt Siegfried Lenz tot de Grote Drie van de Duitse naoorlogse periode gerekend. (Wat mij betreft mag daar beslist ook Wolfgang Koeppen aan worden toegevoegd, maar dat terzijde.) De link tussen die drie is hun oorlogsverleden: Grass zat bij de Waffen-SS, Böll diende bij de Wehrmacht en Lenz bij de Kriegsmarine (waar hij wel deserteerde toen hij een revolterende medesoldaat moest executeren). Alle drie verwerkten en becommentarieerden ze dat verleden in hun romans. Twee van hen kregen de Nobelprijs Literatuur: Böll in 1972, Grass in 1999. Wat mij betreft mocht ook Siegfried Lenz aan dat lijstje worden toegevoegd. * “De nazischilder Emil Nolde en de Duitse literatuur”, artikel van Piet de Moor in Knack, 15.10.2013"}, {"userName": "Susan Barnaby", "userReviewDate": "Nov 24, 2007", "userURL": "http://www.goodreads.com/user/show/637078-susan-barnaby", "userReview": "Everybody should read this book. It's a fictional narrative by a kid in a detention facility looking back on his youth on the flatlands of northern Germany during World War II and his police-officer father's efforts, under orders, to suppress a local expressionist artist. If that doesn't sound great to you, then stick to whatever floats ya, but this book matured me."}, {"userName": "Viktoria", "userReviewDate": "Mar 19, 2010", "userURL": "http://www.goodreads.com/user/show/3190519-viktoria", "userReview": "Lenz schafft es über die Sprache eine Stimmung zu schaffen, die der Landschaft an der Nordsee total entspricht! Grandiose Sprache, man kann das Buch nicht einfach runterlesen, jeder Satz ist wichtig und muss gelesen werden."}, {"userName": "Andrea", "userReviewDate": "Jan 29, 2008", "userURL": "http://www.goodreads.com/user/show/478510-andrea", "userReview": "I need to read this again to be reminded of why I liked it so much."}, {"userName": "Julia", "userReviewDate": "Sep 11, 2009", "userURL": "http://www.goodreads.com/user/show/2719191-julia", "userReview": "One of my absolute favourites! Great prose, good setting,well-rounded characters, important topics addressed- and never boring, despite of being quite a big volume....Definitely recommended!"}, {"userName": "Saskia", "userReviewDate": "Jan 15, 2018", "userURL": "http://www.goodreads.com/user/show/31154441-saskia", "userReview": "Bij de start dacht ik dat dit dikke (bijna 600 pagina's!) boek in het Duits me maanden zou kosten. Ik had maar 4 weken voor we het in de leesclub zouden bespreken. Onmogelijk! Maar ik had buiten Siegfried Lenz gerekend... zijn boek nam me bij de hand en ik wandelde in een aangenaam tempo een andere wereld in. Een wereld van wad en plicht, van kleur en kunst, van koppigheid en loyaliteit.Het gaat over de jonge Siggi die in een soort jeugdgevangenis of inrichting zit. Tijdens de Duitse les weet hij geen opstel te schrijven over het thema De vreugde van de plicht, omdat het te veel bij hem oproept. Als strafwerk moet hij dan het opstel alsnog schrijven. Dat doet hij en hij houdt het uitzonderlijk lang vol. Hij vertelt over zijn jeugd waarin twee personen centraal staan: zijn vader, een plichtsgetrouwe politieman en de buurman, de flamboyante schilder Nansen. Het is een lang en gedetailleerd verhaal, maar Lenz weet door slimme constructies steeds de spanning vast te houden. Je vraagt je natuurlijk af wat er gebeurd is dat Siggi in die inrichting terecht is gekomen, maar ook de scènes zelf blijven spannend omdat je door Siggi's ogen meekijkt en ervaart wat er allemaal gebeurt. Een bijzondere inkijk in het leven op het Duitse platteland tussen 1943 en 1950 met karakters die je net als Siggi beschouwd om vat op hen proberen te krijgen. Of ik dat heb na bijna 600 pagina's? Ik twijfel."}, {"userName": "Leah", "userReviewDate": "Oct 12, 2017", "userURL": "http://www.goodreads.com/user/show/39972744-leah", "userReview": "Hach, mir ging richtig das Herz auf beim Lesen. Der Schreibstil ist detaillreich und genau, sodass man sich immer alles vor Augen führen kann. Gerade die Landschaftsbeschreibungen haben Schleswig-Holstein und das Watt und das Meer und den Wind und alles was noch so dazu gehört so gut eingefangen. Ich habe mich richtig zuhause gefühlt in dem Buch."}, {"userName": "Niklas", "userReviewDate": "Apr 17, 2018", "userURL": "http://www.goodreads.com/user/show/79864741-niklas", "userReview": "3,5 *"}, {"userName": "Nuno Simões", "userReviewDate": "Jun 25, 2017", "userURL": "http://www.goodreads.com/user/show/60909962-nuno-sim-es", "userReview": "a leitura é exaustiva mas vale cada estrela."}, {"userName": "AnnSo", "userReviewDate": "Oct 13, 2017", "userURL": "http://www.goodreads.com/user/show/69780187-annso", "userReview": "Excellent. The narrative is constructed in a complex and intriguing way. It deals with serious topics, that are echoed in Germany's identity, culture, and politics until today."}, {"userName": "Jennifer", "userReviewDate": "Dec 01, 2012", "userURL": "http://www.goodreads.com/user/show/1830075-jennifer", "userReview": "This is a delicate and beautiful book about the mentality that led to the following of orders, no matter how destructive of life and spirit, in Germany during WW2.Written with a frailty which is beautifully conveyed in this translation, the prose is quite lovely and sensitive, as the story unfolds of the erosion of a son's love for his father, due to the policeman father's obsession with duty. Ironically, the son, Siggi, shares an obsessive tendency with his father, and compulsively writes a punishment essay on duty from his cell in a prison to which his father has had him consigned because of his opposition to his work. Siggi can see the effects of his father's compulsive behaviour on his family, his friendships and the village itself, as the older man's obsession destroys all that humanises him, and all that he loves and appreciates in his life, leaving him an automaton with nothing to offer, who is alienated from those close to him and from the essence of the man that he once was. It is little short of heartwrenching to follow, through Siggi's eyes, the dehumanisation of the man, as his convictions turn him into a burnt out husk, and result in the loneliness and emotional starvation of Siggi, who has the courage, idealism and youthful foolishness to stand up for his convictions against his father's wrongs, and try to live with him and mitigate his damage, instead of deserting his home in defeat, as his older siblings have done.The story is a picture, painted slowly and meanderingly by the pen of Siggi, and supplemented with psychological analysis by bits of the reports of his psychologists; and the slowness of the focus, and the ongoing descriptions of the river outside the cell window can be a little frustrating when our reader forgets to enjoy the journey, and seeks too hard for a destination. The destination does arrive, and when the reader steps back from this instrument, s/he is in wonder at the work that has been wrought, so incrementally, and with such magic."}, {"userName": "Dragos C Butuzea", "userReviewDate": "Aug 28, 2013", "userURL": "http://www.goodreads.com/user/show/3651116-dragos-c-butuzea", "userReview": "Ce m-a-nvăţat Siegfried?Incitat şi de opinia recentă a Andei despre această carte, mi-am întregit panoplia germană cu capodopera scriitorului german Siegfried Lenz, Ora de germană (Deutschstunde), mare bestseller al anilor '70.Ce-am citit?La fel ca Oscar Matzerath în închisoare, adolescentul Siegfried Jepsen e într-un centru de reeducare şi-şi compune o temă de pedeapsă pentru ora de germană, cu titlul Bucuriile datoriei. Tema este romanul însuşi şi va consta din amintirile lui din copilărie, pe când tatăl îi era poliţist de provincie într-un sat, în vremea celui de-al treilea Reich.Tema unuAlaturi de problema datoriei - pretenţie nejustificată şi oarbă -, expusă magnific în carte prin personajul tatălui, mi s-a părut importantă tema educării. Aflat în centrul pentru tinerii \"greu educabili\", adolescentul se întreabă de ce nu există aşa ceva şi pentru bătrânii greu educabili? Când încetează de fapt, educaţia, la optsprezece, la douăzeci şi cinci de ani? Ba mai mult: pentru viaţa de azi, nu e nici un om matur fără vină, toţi sunt vinovaţi, iar distrugerea Germaniei o confirmă.Tema doiCe înseamnă a vedea? Siegfried răspunde: Numai copiii văd bine, chiar mult mai bine decât credem. \"Lucrurile trebuie înfăţişate nude, în aşa fel încât nimeni de pe lumea asta să nu se poată declara ignorant\". Şi, faţă de copiii romanelor româneşti recente ce privesc comunismul cu inocenţă şi detaşare - ca-n Băiuţeii sau Orbitor (apropo, şi-aici e vorba despre o moară dragă eroului) - copilul ia atitudine, acţionează, îşi înfruntă chiar tatăl, cu datoria lui cu tot. \"Începi să vezi atunci când încetezi a juca rolul unui contemplator şi născoceşti ceva de care ai nevoie. Căci a vedea nu înseamnă a trece la dosar.\"Concluzia?A VEDEA ÎNSEAMNĂ A TE IMPLICA, CU DISCERNĂMÂNT. Aceasta e lecţia pe care Lenz mi-a dat-o prin acest minunat roman, scris perfect, pe care l-am citit cu sufletul la gură."}, {"userName": "Nancy", "userReviewDate": "Jan 14, 2012", "userURL": "http://www.goodreads.com/user/show/4663679-nancy", "userReview": "I chose to read this book after visiting the Emil Nolde Gallery near Flensburg, Germany in September 1998. The story is based on Emil Nolde's childhood friendship with a neighbour who became a police officer and was faced with the dilemma of betraying his artist friend who was painting in a manner that was considered illegal under the Nazi rule. The gallery is fascinating as the scale and the subject manner of the paintings is apparently affected by the war years. I highly recommend a visit to the gallery if you ever find yourself in North west Germany.From Wikipedia:\"However Hitler rejected all forms of modernism as \"degenerate art\", and the Nazi regime officially condemned Nolde's work. Until that time he had been held in great prestige in Germany. 1052 of his works were removed from museums, more than those of any other artist.[2] Some were included in the Degenerate Art exhibition of 1937, despite his protests, including (later) a personal appeal to Nazi gauleiter Baldur von Schirach in Vienna. He was not allowed to paint—even in private—after 1941. Nevertheless, during this period he created hundreds of watercolors, which he hid. He called them the \"Unpainted Pictures\".In 1942 Nolde wrote:There is silver blue, sky blue and thunder blue. Every colour holds within it a soul, which makes me happy or repels me, and which acts as a stimulus. To a person who has no art in him, colours are colours, tones tones...and that is all. All their consequences for the human spirit, which range between heaven to hell, just go unnoticed.[3]\"According to Wikipedia, Nolde was a member of the Nazi party for a time. That's a disappointing fact.http://www.agermanyattraction.com/ger...http://www.nolde-stiftung.de/"}, {"userName": "Jordi Suriñach", "userReviewDate": "Jan 18, 2017", "userURL": "http://www.goodreads.com/user/show/15913386-jordi-suri-ach", "userReview": "Quin sentit fer una cosa dolenta només pel simple fet que t'obliguen a fer-ho? Així de simple és el punt de partida de 'Lliçó d'alemany', la gran novel·la de Siegfried Lenz que ha arribat a les meves mans en la seva versió en català a càrrec de Club Editor. Durant el final de la Segona Guerra Mundial, però aliena en bona part del conflicte bèl·lic, un policia municipal d'un petit poble del nord d'Alemanya rep l'ordre de prohibir que un reconegut pintor local, Max Ludwig Nansen, torni a agafar els pinzells. L'extraordinari zel amb què l'agent de l'ordre s'aplica per complir aquesta absurda ordre, ignorant una llarga amistat és el motor d'aquesta obra on també sobrevola una reflexió sobre el paper de la família tradicional.El protagonista de la història no és ni el perseguidor ni el perseguit, sinó el fill del policia, el petit Siggi Jepsen que davant del conflicte de treballar com a espia pel seu pare o ajudar el seu amic es decanta progressivament pel segon. I tot plegat, explicat en forma d'una inacabable redacció que el mateix Siggi eternitza com a càstig i on ell mateix acaba sent presoner de les incongruències del deure i de les dificultat d'abordar la disjuntiva entre l'acatament de l'autoritat o la satisfacció dels impulsos. La primera immersió a l'obra de Lenz ha estat sumament profitosa, gaudint d'una prosa minuciosa i d'unes completíssimes descripcions que es contenen abans d'arribar al nivell de saturació."}, {"userName": "Tara deCamp", "userReviewDate": "Feb 16, 2014", "userURL": "http://www.goodreads.com/user/show/5921418-tara-decamp", "userReview": "Amazing book about a boy in a detention facility looking back on his youth during WWII and his policeman father's efforts (under orders) to suppress a local expressionist artist as he is forced to write an essay on the \"joys of duty\".Indeed, duty is a major theme in this novel. The protagonist's father is always espousing his views on duty. Duty to his country, duty to his post, duty to his leaders. There's also the undercurrent of the protagonist's own sense of duty with runs in two distinct themes. His duty during the retelling of his story (a duty to his brother, sister, the painter, and his own moral conceptions of duty) and his duty to finishing the task before him even when the people who originally gave him the task eventually try to make him stop. Finally, the painter has his own sense of duty to his art and craft despite those trying to silence him.It's not an easy read, but it's worth your time."}, {"userName": "S.P. Moss", "userReviewDate": "Feb 28, 2016", "userURL": "http://www.goodreads.com/user/show/16389676-s-p-moss", "userReview": "'The German Lesson' belongs, with 'The Tin Drum', to the modern classics of German literature. It's a beautifully constructed story, richly populated with a superb cast of characters, darkly funny and dominated by the wonderfully-evoked north German landscape. Told in retrospect through a young boy's eyes, it is the story of how one man (the boy's policeman father) becomes so consumed by his love of duty that it takes him over, at the expense of friendship and family loyalty. Although the words Nazi, Hitler and Gestapo don't appear in the story at all, it is all too clear how this regime took hold of the German people, rewarding those who did their duty without question with a feeling of power and self-importance.The story takes a while to get into, as the author has an idiosyncratic writing style (which I believe is well-translated) but is well-worth persevering with. It is a thought-provoking story that stays with you."}, {"userName": "Marie  Ash-Evans", "userReviewDate": "Jul 09, 2011", "userURL": "http://www.goodreads.com/user/show/5756375-marie-ash-evans", "userReview": "I read this in a college history class and I am now putting it out to be reread. What can one say about the Nazi's that has not already been said???? This is fiction and takes a different angle but strong, as all of the books about the Third Reich that I have read, have been. We need to know, I would be frightened of anyone who understood the Nazi's and I do not and don't want to but I am continually puzzled, attracted and horrified as if I were reading about a particular horrifying murder that really happened as this mass murder, mass horror did - and within my lifetime so it is not so long ago and never so far away as we look at the modern world today. I recommend this book to anyone who wants to know history as it was lived and not just on the cold, dry pages of a text book."}], "description": "Der Roman Deutschstunde von Siegfried Lenz erschien 1968. Lenz bringt in diesem Werk das zentrale Thema der deutschen Nachkriegsliteratur auf den Punkt: Die Verquickung von Schuld und Pflicht in der Zeit des Nationalsozialismus. Die oft gehörte Entschuldigung, man habe ja nur „seine Pflicht getan“, wird hier kritisch durchleuchtet.Formal ist der Roman durch zwei verschiedene Zeitebenen strukturiert: Die erste Ebene ist die Gegenwart des Ich-Erzählers Siggi Jepsen, der sich in einer Anstalt für schwer erziehbare Jugendliche befindet; die zweite Ebene ist Siggis „Aufsatz“, in dem er in Rückblenden seine Geschichte erzählt. Hinzu kommen außerdem gelegentliche Perspektivewechsel durch psychologische Studien über Siggi, die von ihm gelesen und skeptisch kommentiert werden.", "title": "Deutschstunde", "url": "http://www.goodreads.com/book/show/1423957.Deutschstunde", "average": 4.07, "cover": "https://images.gr-assets.com/books/1183481432l/1423957.jpg", "reviews": 103, "authors": [{"url": "https://www.goodreads.com/author/show/45787.Siegfried_Lenz", "name": "Siegfried Lenz"}], "type": ["European Literature", "Fiction", "Classics", "Cultural"], "outlinks": ["http://www.goodreads.com/book/show/1423957.Deutschstunde", "http://www.goodreads.com/book/show/287505.The_German_Lesson", "http://www.goodreads.com/book/show/32809425-lecci-n-de-alem-n", "http://www.goodreads.com/book/show/1482044.Deutschstunde", "http://www.goodreads.com/book/show/35709972-lecci-n-de-alem-n", "http://www.goodreads.com/book/show/21539906", "http://www.goodreads.com/book/show/23336908-duitse-les", "http://www.goodreads.com/book/show/1768944.Deutschstunde", "http://www.goodreads.com/book/show/8442182-a-li-o-de-alem-o", "http://www.goodreads.com/book/show/3428562-schweigeminute", "http://www.goodreads.com/book/show/1482018.So_z_rtlich_war_Suleyken", "http://www.goodreads.com/book/show/1482022.Arnes_Nachla_", "http://www.goodreads.com/book/show/1482042.Das_Feuerschiff", "http://www.goodreads.com/book/show/1425665.Fundb_ro"]}