{"ratings": 61, "userreviews": [{"userName": "Paul", "userReviewDate": "Jul 24, 2011", "userURL": "http://www.goodreads.com/user/show/5076043-paul", "userReview": "I chose this book at my local library, after having seen it on sale at a supermarket. It's written in a style rather similar to that of Andy McNab. I know McNab's writing style is not really considered one of the literary greats, but it does what it does well: it makes a fast-paced book with an enjoyable story. Ross Kemp does a good job of following the same style with his 2011 novel, 'Devil to Pay'. The story follows an ex-soldier who is trying to find out why an army buddy committed suicide despite having a wife and kids, and living a rather normal life. The protagonist's name is Nick Kane, which is again similar to the protagonist in many of McNab's novels, who is named Nick Stone. Look past this, however, and there is a genuinely exciting plot awaiting.While the book's blurb does not go into much detail on the locations, it shifts from London to Afghanistan, and pits the protagonist characters in a struggle between the Taliban and private security companies acting in the area. Suffice to say, Kemp nails the British gang culture perfectly during a scene with an attempted mugging early in the story. His ability to describe a situation like this is unsurprising due to his work on gangs.It takes some time to get into the actual action of the story but for the most part the book moves very quickly, and makes for an enjoyable summer read. It might not be an incredibly thought-provoking story but the facts presented at the conclusion are actually very interesting.I had only one problem with the book during my time reading it; the number of little errors I saw throughout. They were relatively minor but for some reason I picked up on them with this one book in particular. Maybe all books have the same number of errors but I only ever have picked up on them so regularly in this one book. Regardless it is a good read."}, {"userName": "KEVIN", "userReviewDate": "Oct 29, 2017", "userURL": "http://www.goodreads.com/user/show/59009470-kevin", "userReview": "A lean and action-packed thriller. The plot steams along at a furious pace with not a word wasted, and its all the better for that. All thrills no frills. Recommended."}, {"userName": "Ann York", "userReviewDate": "Jun 20, 2011", "userURL": "http://www.goodreads.com/user/show/5151391-ann-york", "userReview": "I didn't think was I was going to like this book but I really enjoyed it. It was about a man named nick kane and he has a friend who dies and they both was in the army so know tires to find out what happened to his friend because everyone is telling him that his mate killed himself but he knows that's not true so he has to travel to Afghan to find out what happens to his mate really don't want to give any thing away"}, {"userName": "Matthew", "userReviewDate": "Sep 06, 2012", "userURL": "http://www.goodreads.com/user/show/12228053-matthew", "userReview": "Good read, cross between an Andy McNabb & Stephen Leather."}, {"userName": "Elviey", "userReviewDate": "Aug 04, 2013", "userURL": "http://www.goodreads.com/user/show/22801845-elviey", "userReview": "My son brought this book for me for my birthday as Im a Ross Kemp fan. I loved it"}], "description": "Nick Kane is a man with nothing to lose, and everything to prove.A model soldier fighting for queen and country, it seemed nothing could stop him becoming one of the very top officers. But that was then.And this is now.Injured in a bomb blast on reconnaissance in Iraq he's forced out of the army and into the quiet life.But after a year in civvies rebuilding his life and his relationship with his family, things for Nick are looking up. That is until he finds out that his old army buddy Ben is dead.Word is that he took his own life, but Nick knows that Ben had everything to live for, and when he starts to question the circumstances of his friend's death, he discovers that there are people who will stop at nothing to cover up the terrifying truth.Explosive and gripping, Devil to pay is the electrifying new action thriller from bestselling author Ross Kemp.", "title": "Devil to Pay\n      \n          (Nick Kane #1)", "url": "http://www.goodreads.com/book/show/10029793-devil-to-pay", "average": 3.84, "cover": "https://images.gr-assets.com/books/1328044068l/10029793.jpg", "reviews": 5, "authors": [{"url": "https://www.goodreads.com/author/show/1009646.Ross_Kemp", "name": "Ross Kemp"}], "type": ["Mystery"], "outlinks": ["http://www.goodreads.com/book/show/10029793-devil-to-pay", "http://www.goodreads.com/book/show/2233988.Gangs", "http://www.goodreads.com/book/show/6556313-ross-kemp-on-afghanistan", "http://www.goodreads.com/book/show/5966658-gangs-ii", "http://www.goodreads.com/book/show/20318213-a-z-of-hell", "http://www.goodreads.com/book/show/7163433-ganglands"]}