{"ratings": 784, "userreviews": [{"userName": "Buck", "userReviewDate": "Mar 25, 2012", "userURL": "http://www.goodreads.com/user/show/1450485-buck", "userReview": "I’m pretty sure I brushed up against Hume in university, but I was too busy getting high and watching Cops to read him properly. Not that I regret watching Cops, which was an education in itself, but I probably should’ve paid more attention to things like—oh, I don’t know—the freaking Western canon. Just for starters.Once you get past the genteel diction, Hume’s skepticism still seems pretty hardcore, and I can only wonder how it struck his original readers, some of whom must have had their minds well and truly blown (or whatever the contemporary idiom was). Hume has often been conscripted into the atheists’ camp, but as I see it, he was just a no-nonsense agnostic who politely suggested that it was really, really dumb to dogmatize about God. And even dumber to plague and kill each other over an abstract noun about which nothing verifiable can ever be said. If all of that sounds sweetly reasonable to you, it’s because Hume’s ideas have gradually trickled down to the water table of Western consciousness. Skepticism is like mental fluoride: we’ve all ingested it, whether we wanted to or not. (I’m tempted to squeeze in a metaphor here about the bottled water of fundamentalism, but this paragraph has already exceeded its analogical weight limit)."}, {"userName": "Beli_grrl", "userReviewDate": "Aug 10, 2007", "userURL": "http://www.goodreads.com/user/show/164808-beli-grrl", "userReview": "I did my thesis on Hume last year and whenever anyone asks me which Hume they should read, this is what I recommend. Both are reasonably easy to read and comprehend; both have held up over the centuries. His other major works are far more difficult, and, at times, more dated, although they were revolutionary in the eighteenth century and have been influential in philosophy since then.The Dialogs, in particular, makes what is still the most compelling and rational argument against the existence of a supreme, benevolent deity that I have ever read. If you are a person of faith, I suggest you read this and try your arguments against the arguments Hume makes. You will never have a tougher, smarter, more dispassionate debating partner.Hume's real stroke of brilliance in the Dialogs is the form itself. By putting these controversial ideas in the mouths of other people, he was able to let the arguments speak for themselves and not explicitely associate himself with one particular opinion. Hume was a genius and a masterful rhetorician. You will experience him at the height of his powers in this book."}, {"userName": "Trevor", "userReviewDate": "Jul 11, 2007", "userURL": "http://www.goodreads.com/user/show/175635-trevor", "userReview": "The fact that Hume only published this book after he died says much about how far we have come."}, {"userName": "Ali Nazifpour", "userReviewDate": "Mar 30, 2013", "userURL": "http://www.goodreads.com/user/show/10661959-ali-nazifpour", "userReview": "You have to read this book. Hume has always been my favorite philosopher of all time, I have a picture of him on my wall, and to me he was the wisest human who ever lived. Here he tackles the question of religion. He does so with such insight, mental veracity and flexibility, and genius. Once you get the handle on the syntax it won't read much differently from a modern text, although the absence of evolution is quite serious, one could feel how it could shape entire conversations. But still he has a fresh outlook and brings up points ignored by modern thinkers. To anyone interested in philosophy, religion, or intellectual awesomeness this is a must read.The book leaves some questions unanswered. Was Hume an atheist, a deist, or a very lax theist? He speaks of atheism with disregard, and claims he is no deist, but spends the rest of his book poking massive holes into religious logic and severely criticizing it. He does not do less damage to theism than Russell or Dawkins or Hitchens. He seems to accept the argument by design wholeheartedly in \"History\" but shoots it down in his \"Dialogues\".His history of religion is basically this. Fear, lack of understanding, and personification of natural objects leads to polytheism which is a \"superstitious atheism\". This leads to monotheism, which is right, but then the same polytheistic elements infiltrate and the religion is tainted by superstitions - prophets, saints, miracles, prayers, and such. Polytheists were tolerant, but since monotheists claim they have all the truth they become intolerant. Religion also has a negative influence on people's morality, encouraging rigidness and violence, so in short, religion becomes a superstitious and immoral system (not very flattering, eh)?I don't know what Hume really believed. I don't think he himself knew it either. But that doesn't matter. By recording his mental struggles, he has taught us about the topic more than any other person could.One interesting trivia: Hume actually comes up with theory of evolution by accident but then goes on to reject it. How he could have changed if he came after Darwin?"}, {"userName": "Laura Deen", "userReviewDate": "Mar 09, 2018", "userURL": "http://www.goodreads.com/user/show/31854495-laura-deen", "userReview": "I thought the Natural History of Religion was far more interesting than the Dialogues. However, in the Natural History, I thought Hume was more or less rude concerning the world population."}, {"userName": "Jake", "userReviewDate": "Nov 13, 2015", "userURL": "http://www.goodreads.com/user/show/2759420-jake", "userReview": "I get the feeling that I missed a lot. Constant interruptions kept me feeling like the train of Hume's thought left without me. Maybe I'll read it again some day."}, {"userName": "Shinynickel", "userReviewDate": "Dec 28, 2010", "userURL": "http://www.goodreads.com/user/show/251555-shinynickel", "userReview": "Off this review: Whereas Hume is very sceptical about the degree to which anything can be rationally understood at all, isn’t he? Including why or if the sun will rise tomorrow—to say nothing of the nature of God.Yes, the difficulty of demonstrating rationally anything much about God is the focus of my second book, which is Hume’s \"Dialogues Concerning Natural Religion\". This was published almost a hundred years after Spinoza’s \"Tractatus\"—again, it was published posthumously, because even in the relatively free-thinking atmosphere of late 18th century Edinburgh, Hume’s critique of religion was highly unacceptable. His friends urged him not only to give up the idea of having it published in his lifetime, but even of having it published after his death, because they thought that it would condemn all this other works to the dustbin of history. Nobody would read them, because they would write Hume off as a wicked unbeliever. But Hume insisted and took steps to ensure that the \"Dialogues\" would be published after his death, and he was right to have done so, because his works are now far from ignored. This one is probably the most read of all his books, and I think it’s arguably the masterpiece of English language philosophy.That’s a terrific claim. Can you explain why?The secret of its success is the way in which powerful and original arguments are woven into an elegant dialogue between three thinkers. The dialogue form is hard to pull off in philosophy, and Hume is one of the very few since Plato to be able to manage it. His announced topic here is “natural religion”. This is contrasted with “revealed religion”, and it means the sort of religious conclusions one can arrive at by reason rather than revelation. So for example, if somebody says “I know that Jesus wants me to do this, because he came to me in a vision,” or “because that’s my reading of scripture,” then that counts as revealed religion. On the other hand, if someone were to say that he is going to behave in a certain way, or that he believes in God, because of certain rational arguments, then that is natural religion. The part of natural religion that Hume focuses on in the \"Dialogues\" is something that is often called “the argument from design”, which is an argument for the existence of God that starts from the way the world works and is structured. The suggestion here is that the best explanation for what we observe is the existence of a designer—a god who made us. And this is of course a very familiar argument, with an intelligent, divine designer still offered by many people as a necessary supplement to science, as something that is still required by the evidence of complexity and apparent order in the universe. What Hume does in his \"Dialogues\" is to undermine that line of thinking in a brilliant series of arguments that I don’t think have ever been bettered, let alone answered. They are more profound, I think, than the Darwinian critique of intelligent design. Hume, certainly would have endorsed natural selection if he had known about it. But it’s not enough to read Darwin and Dawkins. You have to read Hume as well to understand the flaws in the theistic argument from design.And what is it particularly that Hume offers that goes to the heart of the matter?One of the key ideas is the limitations of arguing by analogy in this context, which is the way the argument from design usually works. Take, for example, a watch found lying in a forest. You might say to yourself: this watch cannot have come together by chance. Somebody must have designed it and made it. Then, by analogy, you might reason: surely nature wouldn’t work as it does unless there were a designer who made it. Now one of the many things that Hume points out is wrong with this kind of analogy is that even if you accept the analogy in principle, it still wouldn’t get you to the sort of God we’re after, but only to a superior intelligence who had made the world and the creatures in it. This intelligence wouldn’t necessarily be everlasting, omnipotent, or omniscient…And would himself require a designer…Well that’s one of the clinchers. If you’re going to ask where everything comes from and who designed it, you really do have to ask the same of God. So if you put forward God as the explanation for nature, you’re also going to have to ask who made God.Yes, a devastating argument. And the finishing touch, isn’t it, is that if a designer requires no designer then why does nature require a designer? What is the need for God at all? Which brings us back to Spinoza, effectively collapsing the difference between God and nature.Yes. And one of the most striking things that distinguishes these Dialogues from contemporary anti-religious books like, for example, Dawkins’s \"The God Delusion\" or Hitchens’s \"God is Not Great\", is that none of Hume’s characters ever actually puts himself forward as an atheist or agnostic. Even Philo, whose views are closest to Hume’s own, pretends to be a believer. Hume’s technique is to pretend that he is the true defender of religion, that he is just trying to strengthen religion by shaving off the weaker bits. Now the thing is that when you have read and sympathised with all of Hume’s writings on religion, you realize that he has in fact shaved away everything. But that is why he manages to be so persuasive. He takes the reader very gently."}, {"userName": "Xander", "userReviewDate": "Sep 28, 2016", "userURL": "http://www.goodreads.com/user/show/60074558-xander", "userReview": "This book consists of two parts: The Dialogues Concerning Natural Religion (published posthumously in 1779) and his essay Natural History of Religion (published in 1757 as part of a collection of four essays). In the Dialogues, David Hume tries to lay out the philosophical arguments for the existence of God. To do this, Hume uses the form of a dialogue in which three people debate these religious arguments. The three persons all represent distinct philosophical positions concerning religious questions. The form of a dialogue, in my opinion, doesn't work as well as the dialogues of writers such as Plato or Galilei. Cleanthes represents the empiricist, who tries to use his experience to understand Nature as God's work and thereby coming closer to God. This is, in essence, the 'argument from design' - we see the complexity and functionality of natural works (for example an animal) and from this we infer an intelligent designer; a 'creator god' who is the cause of all of Nature.The problem with empiricist views on religious questions (or on any topic, for that matter), is that induction is philosophically incoherent. This is one of Hume's sceptical conclusions in his main philosophical work: we deduce universal truths from particular observations, but this is logically impossible, since we don't have access to all of the data of all times and places (past, present and future), therefore it will always remain possible to be contradicted by future events. This sceptical position is taken up in the Dialogues by Philo, possible Hume's alter ego, who argues that, in the end, we, as human beings with our limited intellects, are simply not up to the task of fully understanding nature. We can use science to come close, but we will never understand Nature the way it actually is. (Note that this presupposes the existence of an objective reality that CAN be grasped). But since observation (i.e. induction) is only part of the story, can we turn to mathematics and logic (i.e. deduction) for truth? These were said to be independent of reality and therefore to contain a priori truths. This is the solution of the third character, Demea. We can use a priori reasoning to understand nature and God: everything inthe universe that exists is caused by something else, the universe as a whole exists, so the universe has a cause outside of the universe, therefore god exists. (This is the cosmological argument in a nutshell).But according to Philo, even this a priori reasong can't help us in understanding Nature, or God. It is interesting to note, that retrospectively this sceptical view of Philo (and Hume?) on a priori truths was verified in the 19th century, when mathematicians found altnernative, non-Euclidean, geometries. This would later on lead Einstein to his relativity theory. The importance, and irony, of this is that we have to use observation (i.e. induction) to verify the axioms of our deductive systems: which type of spacetime are we dealing with? To sum up: Demea argues scholastically (Aristotelean), Cleanthes argues empirically (Lockean), but Philo sceptically asserts - and in my opinion convincingly - that real truth is not graspable for our limited intellects. There is an objective reality out there, and we should use science to approach understanding (à la Locke), but we should accept that we will never attain full knowledge. In the Natural History of Religion, Hume deals with the topic of religion in a different way. Here he tries to sketch the history of how humanity grew from animistic natural religions, via polytheism, into monotheism. Human beings, in a natural state, want to control their circumstances and are afraid of many things. To reduce these psychological stresses, they concoct spirits to assist them in staying safe and sound. Over time, when people accord these spirits more and more powers, these spirits take the form of gods and become the identity of the tribe. In tribal warfare, tribes promote the strengths and powers of their gods; in other words: religious competition; this has a logical endpoint: the all powerful, all knowing, all good god. And, voila: now we have arrived at monotheism!Hume notes that all monotheists have a need to concoct a theological just-so story, in order to conceal the primitive, fear-driven origins of their belief systems. So the (infamous) theological, scholastic argument about how many angels can fit on the top of a pin, is nothing more but window dressing. Besides this, monotheists have a drive (and psychological need) to correct the mistaken beliefs of others, and this leads inevitably to persecution, (intellectual) dishonesty and intolerance.So this little book outlines Hume's ideas on religion; as a book I didn't find it that interesting, but as a historical work, it has its value."}, {"userName": "Danijel Brestovac", "userReviewDate": "Nov 21, 2014", "userURL": "http://www.goodreads.com/user/show/4102133-danijel-brestovac", "userReview": "​Str. 20-\"nič ni gotovega na svetu, niti slava niti blaginja. Bogovimečejo vse v zmedo; vsako stvar mešajo z njenim nasprotjem;da vsi mi, zaradi naše nevednosti in negotovosti, plačamo za toz več čaščenja in spoštovanja. \" (EURIPID, Hecuba~956)Str. 70- v tedanjem času je postalo jasno, da celotno kraljestvo religiozne vere lebdi nad razumom, je negotovo in podrejeno vsaki spremembi razpoloženja ter je nadalje odvisno od pričujočih slučajnih dogodkov.Str. 75- prvotna religija je nastala predvsem zaradi bojazni pred bodočimi dogodki; in dokaj razumljivo je, da se ljudje ukvarjajo z idejami o nevidnih in neznanih silah, saj so pod pritiskom vsakovrstne turobne zaskrbljenosti........ ko se polasti duha panika, živahna domišljija še poveča strah; ta še poglobi mrak...Str. 85- da vsakemu zločinu sledita kes in skrivnostna groza, ki duhu ne da miru ter poišče zatočišče v verskih obredih in ceremonijah ter spravnih daritvah napadenim.Str. 97 (napisal Fran Jerman)- praznoverje, vraž​​evernost je tisti iracionalni moment, ki se mu po Humovem mnenju vdaja predvsem neuko ljudstvo, vendar pred njim niso imuni niti največji duhovi. S tipično razsvetljensko mislijo jo tudi zaključil svojo obravnavo zgodovine naravne regije: \"NEVEDNOST JE MATI POBOŽNOSTI.\""}, {"userName": "Thomas", "userReviewDate": "Apr 15, 2013", "userURL": "http://www.goodreads.com/user/show/5344618-thomas", "userReview": "The Dialogues are well worth reading. I can't say the same for his essay on the Natural History of Religion. When Hume represents his views as a dialogue you can perceive the schisms within himself; Cleanthes the orthodox, Demea the romantic and Philo the passionate enquirer. Hume himself a spectator to the discussion.In the Dialogues I felt the force in which each actor used the arguments of the other as a leaver for his own view an admirable scene to have played out in the mind of one man! And to go from that dynamic centrifuge of logic, to a dogmatic speculative rambling through the origins of natural religion was a sobering if not completely disappointing experience. I found myself wishing the essay had been written by Philo rather than through a union of all three parts of Hume. Also about half way through I decided to imagine the characters of the dialogue as animals. Demea was a grizzly black dog; Philo a cat; Cleanthes a pious old ass. hard to type on phone with man hands, sorry if that reads horribly."}, {"userName": "Patrice", "userReviewDate": "Jan 11, 2013", "userURL": "http://www.goodreads.com/user/show/2348745-patrice", "userReview": "Written in dialogue form Hume says some pretty radical things for the time, or any other time. If I understand what he is saying, there just isn't enough evidence to say that God is a fact. We have no experience of Him therefore we cannot know for certain that He exists. Seems pretty simple when I write it that way but he makes it much more complicated! ;-)He thinks that God, rather than being a rational idea, is an emotional response to the terrors of being alive. We turn to God more often when we are in trouble than when we feel joy. No atheists in the foxhole and all that.I remember when we read Descartes' \"proof\" that God exists. A rational proof. We were so looking foreward to that proof. But in the end, no one believed it. \" I think ergo I am \" turned into \"I think of God ergo He is.\" Nope, didnt' work for anyone. Certainly not for Hume!"}, {"userName": "William Ramsay", "userReviewDate": "Sep 26, 2010", "userURL": "http://www.goodreads.com/user/show/200881-william-ramsay", "userReview": "I have decided to read David Hume. Dialogues Concerning Natural Religion is the first work in the anthology I bought even though it was one of the last things he wrote. Hume is one of the easier philosophers to read - his writing is clear and precise. That is not so say that he is light - he is one of the most influential philosophers of the modern era. This work is posed as a dialog between three friends who attempt to determine the place of religion in the education of the young man who is narrating the dialog. It gets into the nature of God, how man can know God, and the influence of God in the life of man. Hume was a great and famous skeptic, but in this work he comes to the conclusion that religion is valuable as a moral guide to man however tenuous it claims. I'm sure that this work was very controversial in its day."}, {"userName": "Zach", "userReviewDate": "Oct 05, 2015", "userURL": "http://www.goodreads.com/user/show/17599004-zach", "userReview": "I would give this more stars if I could. Hume is calm, equable, cheerful, humanitarian, surprisingly fair, and above all skeptical. He's also necessarily slippery; even though the Dialogues were published after his death, he is careful to not be Philo and to have Philo himself disclaim his more skeptical attacks shortly after making them. Such was eighteenth century censorship. Nevertheless, the Dialogues are outstanding, and, though the History is fairly weak as history it's pretty great as philosophy.Of particular note are part XI and XII of the Dialogues, parts XI - XIV of the History, and Note I of the History."}, {"userName": "Charles", "userReviewDate": "Jan 19, 2011", "userURL": "http://www.goodreads.com/user/show/229372-charles", "userReview": "Makes a great sedative. Listen, I understand the importance of Hume in his time, however reading about the cosmological argument or the argument from design in a pre-Darwinian, pre-modern astrophysics context just makes me cringe. If you are looking for better arguments against dogmatic Monotheism in favor of deism, which Hume is putting forth, just read The Age of Reason. Paine's arguments stand up better, even in the light of modern biblical criticism which actually serve to strengthens his points."}, {"userName": "David Mcdowell", "userReviewDate": "Aug 01, 2012", "userURL": "http://www.goodreads.com/user/show/5918453-david-mcdowell", "userReview": "I find the dialogue style a little difficult to get into at first but once in the mindset I appreciated some of the killer reasoning that Hume puts in the mouth of Philo.The natural history was also interesting, and in both I enjoyed seeing how Hume had to tie hiself in knots to appear to be an upstanding godfearing member of the community."}, {"userName": "Paul", "userReviewDate": "Jun 07, 2013", "userURL": "http://www.goodreads.com/user/show/8487908-paul", "userReview": "In the Natural History of Religion Hume doesn't so much speak against religion as he speaks against the ignorant believers of all the major religions in history. At the very least his critique is equal opportunity, spending as much time speaking against the devotions of the Romans and Greeks as he does the Catholics and Egyptians."}, {"userName": "Matko", "userReviewDate": "Dec 01, 2009", "userURL": "http://www.goodreads.com/user/show/3000669-matko", "userReview": "I gave this book five stars firstly because of its historical importance. There has never been more destructive criticism of natural theology. Next to Kant, it was the sole reason why natural theology was shaken to its core and wasn't rehabilitated till the last century's sixties. Contemporary philosophers of religion made most of its arguments obsolete. Read it for the language."}, {"userName": "Nathanael Coyne", "userReviewDate": "Nov 29, 2009", "userURL": "http://www.goodreads.com/user/show/2376002-nathanael-coyne", "userReview": "This guy is confused. A novel approach to writing and narration which can be a little hard to follow but makes for an interesting read. Just don't get too caught up in Hume's meanderings or you might end up confused too!"}, {"userName": "Lucas", "userReviewDate": "Aug 01, 2012", "userURL": "http://www.goodreads.com/user/show/7783659-lucas", "userReview": "Interesting. I found the Dialogues deeply insightful and interesting. The Natural History was fascinating as proto-sociology, but seems overly interested in anecdote and rhetoric. I was disappointed."}, {"userName": "Timothy", "userReviewDate": "Jun 20, 2008", "userURL": "http://www.goodreads.com/user/show/533219-timothy", "userReview": "Hume successfully counters most philosophical arguments for the existence of God in this slim book. The dialogue format can get a little trying after a while and the prose doesn't exactly grip you. The substance, however, is worthwhile."}, {"userName": "Filbert Lam", "userReviewDate": "Dec 20, 2013", "userURL": "http://www.goodreads.com/user/show/19768617-filbert-lam", "userReview": "The eloquence of David Hume is astounding. Beautifully written, and clearly ahead of his time. I was primarily interested in Philo's formulation of the problem of evil and suffering, because that inspired Paul Draper's own argument based on a \"Hypothesis of Indifference\"."}, {"userName": "Dennis", "userReviewDate": "Jun 24, 2007", "userURL": "http://www.goodreads.com/user/show/148467-dennis", "userReview": "Better than the xenophobic rantings of Christopher Hitchens."}, {"userName": "Hollis", "userReviewDate": "Jan 04, 2009", "userURL": "http://www.goodreads.com/user/show/1862015-hollis", "userReview": "Forget 'The God Delusion': this is the real classic of atheist thinking."}, {"userName": "Mike", "userReviewDate": "Jan 05, 2013", "userURL": "http://www.goodreads.com/user/show/1714969-mike", "userReview": "classic"}, {"userName": "Kathy", "userReviewDate": "Mar 19, 2011", "userURL": "http://www.goodreads.com/user/show/2589014-kathy", "userReview": "2.5 Stars While I don't necessarily agree with Hume, at least he is more coherent than Nietzsche."}, {"userName": "John", "userReviewDate": "Aug 23, 2007", "userURL": "http://www.goodreads.com/user/show/303728-john", "userReview": "philosophy,religion,nonfiction,enlightenment"}, {"userName": "Peter Broady", "userReviewDate": "Jul 24, 2013", "userURL": "http://www.goodreads.com/user/show/22479626-peter-broady", "userReview": "A classic...had a big impact on me in college."}, {"userName": "Rhianna", "userReviewDate": "May 18, 2012", "userURL": "http://www.goodreads.com/user/show/3998981-rhianna", "userReview": "I wasn't interested in it enough, and I've been far too busy to give myself enough time to read it closely enough to comprehend any of it."}, {"userName": "Dane", "userReviewDate": "Jan 24, 2010", "userURL": "http://www.goodreads.com/user/show/3036704-dane", "userReview": "It's Hume. Haven't read him in a while, though."}, {"userName": "Anna C", "userReviewDate": "Feb 02, 2015", "userURL": "http://www.goodreads.com/user/show/23704895-anna-c", "userReview": "Well, I read my second Hume. I'm not sure how much of it I actually understood... but I read it."}], "description": "David Hume is one of the most provocative philosophers to have written in English. His Dialogues ask if a belief in God can be inferred from what is known of the universe, or whether such a belief is even consistent with such knowledge. The Natural History of Religion investigates the origins of belief, and follows its development from polytheism to dogmatic monotheism. Together, these works constitute the most formidable attack upon religious belief ever mounted by a philosopher. This new edition includes Section XI of The Enquiry Concerning Human Understanding and a letter by Hume in which he discusses Dialogues.", "title": "Dialogues Concerning Natural Religion and The Natural History of Religion", "url": "https://www.goodreads.com/book/show/80315.Dialogues_Concerning_Natural_Religion_and_The_Natural_History_of_Religion", "average": 4.02, "cover": "https://images.gr-assets.com/books/1386922833l/80315.jpg", "reviews": 33, "authors": [{"url": "https://www.goodreads.com/author/show/45726.David_Hume", "name": "David Hume"}, {"url": "https://www.goodreads.com/author/show/3894777.John_Charles_Addison_Gaskin", "name": "John Charles Addison Gaskin"}], "type": ["Philosophy", "Religion", "Nonfiction", "Classics", "Politics"], "outlinks": ["http://www.goodreads.com/book/show/80315.Dialogues_Concerning_Natural_Religion_and_The_Natural_History_of_Religion", "http://www.goodreads.com/book/show/4886534-dialogues-concerning-natural-religion-and-the-natural-history-of-religio", "http://www.goodreads.com/book/show/20326799-dialogues-and-natural-history-of-religion", "http://www.goodreads.com/book/show/781467.Dialogues_Concerning_Natural_Religion_and_The_Natural_History_of_Religion", "http://www.goodreads.com/book/show/130119.An_Enquiry_Concerning_Human_Understanding", "http://www.goodreads.com/book/show/80311.A_Treatise_of_Human_Nature", "http://www.goodreads.com/book/show/839433.An_Enquiry_Concerning_the_Principles_of_Morals", "http://www.goodreads.com/book/show/80313.Dialogues_Concerning_Natural_Religion", "http://www.goodreads.com/book/show/80316.Enquiries_Concerning_the_Human_Understanding_Concerning_the_Principles_of_Morals", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}