{"ratings": 237, "userreviews": [{"userName": "Mariah", "userReviewDate": "Nov 25, 2017", "userURL": "http://www.goodreads.com/user/show/22371819-mariah", "userReview": "I listened to this book on audio and really enjoyed it. The acting was very fun!"}, {"userName": "Maygin at Not Quite a Literary Critique", "userReviewDate": "Oct 14, 2017", "userURL": "http://www.goodreads.com/user/show/46744515-maygin-at-not-quite-a-literary-critique", "userReview": "[rape and contributing to rape culture through minimization of such rape; (hide spoiler)]"}, {"userName": "JG (The Introverted Reader)", "userReviewDate": "May 03, 2013", "userURL": "http://www.goodreads.com/user/show/48404-jg-the-introverted-reader", "userReview": "I chose to listen to this because it showed up in my digital library's \"recently added\" lists and I recognized it as having been nominated for a couple of Audie awards. \"I can't go wrong with something that's been nominated for an award, right?\" I reasoned with myself.Wrong.It was terrible.Had it been any longer than two hours, I would have stopped after about 30 minutes. I felt the writer was trying way too hard to be funny and as a result, the whole thing just fell flat. The plot, such as it was, would circle miles out of the way to set up a joke that didn't even make me smile.The basics are here--the evil stepmother, Snow White, the mother wishing for a child fitting Snow White's description...I guess that's about it. There were tons of other fairy- and folk tale creatures dragged in by the skin of their teeth, which I should have loved, but I didn't. I mostly didn't see any rhyme or reason for who was included and who wasn't. I honestly can't even remember what happened to most of them.Snow White was super annoying. I believe that was kind of the point, but man, she set my teeth on edge. She's supposed to be about fifteen but she's voiced by Sandra Oh, who is at least as far from fifteen as I am, and she generally acts about two years old. Temper tantrums? Seriously? Not attractive or enjoyable.I could go on but I won't. I'm sure there's an audience for this, I just don't know who it would be. If you're interested, don't let me dissuade you from trying it out; at two hours long, you don't have much to lose."}, {"userName": "Cindi", "userReviewDate": "Mar 27, 2017", "userURL": "http://www.goodreads.com/user/show/5730733-cindi", "userReview": "2.5 rounded up. This wasn't horrible. Based on some of the reviews, I was a bit afraid. But it was offered for free download from the library and I love fairy tales & retellings, so I thought I'd take a chance. I can't say it's on my top 10 favorites list, or that I would exactly remember or recommend it to a friend, but it was entertaining and actually very well performed.The blend of different fairy tales was interesting as well. If not for the implied sex and the king's bedroom scene, I'd suggest it to my daughter. But although not explicit, I don't feel like it is appropriate for her age."}, {"userName": "Missy", "userReviewDate": "Dec 29, 2017", "userURL": "http://www.goodreads.com/user/show/63990928-missy", "userReview": "I would have given this a 5 star review but I thought at time there was way too much going on so it was hard to follow. I thought Sandra Oh did an amazing job. She made me laugh several time throughout the book. Overall I'm really glad I listened to the book and it was very enjoyable. Definitely would recommend it to anyone!!!"}, {"userName": "Tracy", "userReviewDate": "Nov 17, 2017", "userURL": "http://www.goodreads.com/user/show/17080363-tracy", "userReview": "Unique. Creative. Not my thing. At all."}, {"userName": "Eleni Konstantine", "userReviewDate": "Aug 10, 2017", "userURL": "http://www.goodreads.com/user/show/2756875-eleni-konstantine", "userReview": "Hilarious retelling of Snow White. Perfect to listen to when doing the dishes!"}, {"userName": "Cara's Craftastic Creations", "userReviewDate": "Jul 04, 2017", "userURL": "http://www.goodreads.com/user/show/55771870-cara-s-craftastic-creations", "userReview": "4.5"}, {"userName": "Jarrod Scarbrough", "userReviewDate": "Mar 14, 2017", "userURL": "http://www.goodreads.com/user/show/6506516-jarrod-scarbrough", "userReview": "I had high hopes for a fun and comedic quick tale. This was not it. This felt like the result of staying up late drinking too much while watching hours of sketch comedy and satires, then deciding you could throw your own story together. Glad it was quick, because it was more than a little painful."}, {"userName": "Stacy", "userReviewDate": "May 08, 2015", "userURL": "http://www.goodreads.com/user/show/5651302-stacy", "userReview": "This was a fun hodgepodge of fairy tales. When the first word out of Gretchen's mouth was \"Shit!\" I knew I would like this book. And when the Duke used \"vomitorium\" in his death/marriage speak, I knew I would really, really like it. It's about 2 1/2 hours, has a full cast and includes the cheesy sound effects you find in old radio programs. Snow White's voice was a bit too whiny, which was unfortunate, but the other voices were great. And there is a crazy amount of fairy tale variety. The girl that spins straw into gold is in there. Snow White lives in the cabin of the seven dwarfs but shares it with Rumplestiltskin. Hansel and Gretel have a cameo, as does the witch's candy house. A genie in a bottle grants Snow White's wishes. This book has terrible reviews so I seem to be the odd man out but I thought it was funny. It was a quick listen with quirky appeal."}, {"userName": "Terri", "userReviewDate": "Oct 03, 2016", "userURL": "http://www.goodreads.com/user/show/25674152-terri", "userReview": "The Carol Burrnett Show for your Ears (Audiobook)ROFLWTIME (for those non-internet slang users: Rolling on the Floor laughing with tears in my eyes) from the start. Don't expect to find the anything remotely resembling \"Snow White a Tale of Terror\". This reminded me more of a Vaudeville show or one of the Carol Burnett Show skits that gets slightly out of hand as Tim Conway & Harvey Korman start alibiing.This is the book to read if you are feeling blue and need something to cheer you up or for about any other reason. Yuri Rasovsky spins a unique take on the classic Snow White fairy tale story with a few other fairy tales thrown in for fun. The Narration staff was OUTSTANDING!"}, {"userName": "Badseedgirl", "userReviewDate": "Apr 19, 2014", "userURL": "http://www.goodreads.com/user/show/20662786-badseedgirl", "userReview": "Most definitely not for children. In this version of the story, Snow White is a bit of a slut! I very much enjoyed this audiobook. It was more like an old fashioned radio show than an audiobook, with several different actors playing various parts and the use of foley artists. I have never heard an audiobook quite like this one. Various fairy tale characters appear in the novel, including Hansel and Gretel, Goldilocks and the three bears, as well as Rumplestilskin. just a wonderful mature fairytale."}, {"userName": "Natalie", "userReviewDate": "Nov 10, 2016", "userURL": "http://www.goodreads.com/user/show/27331835-natalie", "userReview": "Yeah... it was fun, but if you're looking for a good fairy tale retelling, OR actual plot or depth- move on. Quickly. Basically- the only redeeming quality for this, is the vocal talent. A full cast of mostly celebrity voices make it a fun listen. The horrible pronunciations of German words (although some of the cast did try), the sketchy and shallow plot, and the supposedly funny, but isn't racial generalizations make for a tiresome listen. And really- you can tell by the title that this isn't for children."}, {"userName": "Corey Klauder", "userReviewDate": "Jul 02, 2016", "userURL": "http://www.goodreads.com/user/show/27273385-corey-klauder", "userReview": "Umma.... Let me start by saying I listened to the Audio Book version of this on my way home during a 4 and a half hour trip, and it was a big distraction because it pretty much was like listening to a movie. I thought the book did have its funny parts, I thought it was a unique twist on the characters, but I found myself getting confused alot as to where the story was going. This might possibly be one I have to go back and read a paper version of, maybe just the Audio Book through me off?"}, {"userName": "Morganucopia", "userReviewDate": "Aug 31, 2013", "userURL": "http://www.goodreads.com/user/show/10133472-morganucopia", "userReview": "I thought this play was a delightfully raunchy send up of the Disnyfied tales we know and love so well. The acting is sometimes a little over the top, but the outlandishness works well with the bizarre and silly script. A great time passer. The people giving this less than 3 stars must not have read the title very well. Does \"Die, Snow White! Die, Damn You!\" not sound like it's going to be a parody?"}, {"userName": "Ms. Kelly", "userReviewDate": "Nov 20, 2015", "userURL": "http://www.goodreads.com/user/show/3906954-ms-kelly", "userReview": "I was home along - cleaning the bathroom - looking for an audio book to entertain myself whilst scrubbing the commode. I found this QUITE amusing.It requires a certain passing knowledge of not just Disney versions of fairy tales like Snow White and Rumplestiltskin, but also the classic versions.It also has quite a bit of swearing and adult content (read sexual innuendo)So... with that in mind, I found the performances in this tale quite fun!"}, {"userName": "Heather", "userReviewDate": "Jul 17, 2014", "userURL": "http://www.goodreads.com/user/show/3052319-heather", "userReview": "It was entertaining enough and it reminded me of a play - which I guess is kind of what it was going for - but I wouldn't go out of my way to listen to it. They brought together a lot of fairtales, not just Snow White so it was an interesting take. The actors were over dramatic (as they are in plays) and the music was corny (as they usually are in plays) and some of the humour seemed forced. As re-tellings go it was ok."}, {"userName": "Unapologetic_Bookaholic", "userReviewDate": "Jan 13, 2017", "userURL": "http://www.goodreads.com/user/show/1125077-unapologetic-bookaholic", "userReview": "I love retelling or imagining of fairy-tales. Admittedly Snow White is not one of my all time favorites I did enjoy parts of this story. The setting made the language a little hard to follow at times but otherwise the voice acting made it very entertaining. (3.5 round to 3, finished the book but wouldn't put this author on my \"must read\" list)"}, {"userName": "Janderson", "userReviewDate": "Oct 17, 2013", "userURL": "http://www.goodreads.com/user/show/4640949-janderson", "userReview": "With the cast included on this audio book I really expected more. First of all, it was slightly disconnected, like I started in the middle and then missed something toward the end. Also, for an award-winning audio production some of the actors were very hard to hear and understand. While still fun, it just didn't meet the expectations I had for quality."}, {"userName": "Xanthi", "userReviewDate": "Feb 13, 2013", "userURL": "http://www.goodreads.com/user/show/5966790-xanthi", "userReview": "I can appreciate the effort and the vocal talent of the people who narrated this story. I also like the way several Grimm stories were used in parts (Rumplestiltskin, Hansel and Gretel, etc). On the whole, however, it just didn't appeal to me. The way Snow White was portrayed was quite off putting and I think that had a lot to do with why I did not enjoy this all that much."}, {"userName": "Chris Conrady", "userReviewDate": "Mar 22, 2016", "userURL": "http://www.goodreads.com/user/show/8679982-chris-conrady", "userReview": "Although there are some fun notes in this talk of the very dark pre-Disney Snow White, Die Snow White Die reads more like a poorly written slap-stick play. Some of the humor was more Laugh-In esque and just didn't fit. The idea was good and I think with a bit of polishing it could be more enjoyable."}, {"userName": "Diana", "userReviewDate": "Sep 14, 2012", "userURL": "http://www.goodreads.com/user/show/4763034-diana", "userReview": "It is an audio drama, with sound effects and music, but not the version you should let your young kids listen to.The story line manages to bring in other fairy tales, misquotes from all kinds of people, and twists the tale without taking it seriously.There were laugh-out-loud moments, and it was only 2 discs long. I did enjoy it."}, {"userName": "harlequin {Stephanie}", "userReviewDate": "Aug 08, 2012", "userURL": "http://www.goodreads.com/user/show/4039337-harlequin-stephanie", "userReview": "Had potential, but it was not that funny. The parody of snow white in The Book of Lost Things was much funnier. Had a few laughs. Not much more."}, {"userName": "Nicole", "userReviewDate": "Sep 29, 2013", "userURL": "http://www.goodreads.com/user/show/11129456-nicole", "userReview": "I listened to this one and loved the voices. However, I had trouble following the story sometimes due to the language or the accent...maybe because I was also driving. Entertaining, but I didn't follow along as closely as I would have liked...and then it was over!"}, {"userName": "Demerain", "userReviewDate": "Sep 02, 2012", "userURL": "http://www.goodreads.com/user/show/8297549-demerain", "userReview": "This fairy tale is not for children. That being said, it is a highly amusing, slightly raunchy version of the classic tale. I'd classify this as an audio drama, and the evil queen's brilliant performance can be reflected best in the title of this tale \"Die, Snow White! Die, Damn You!\"."}, {"userName": "Kathy  D.", "userReviewDate": "Mar 17, 2016", "userURL": "http://www.goodreads.com/user/show/1001726-kathy-d", "userReview": "Alternated between entertaining and annoying. And juuuust a little bit racist. This was an audio, readers theater version and the Snow White character was annoying. Part of the plot? Yes. Horribly over acted? Yes."}, {"userName": "Rebekah", "userReviewDate": "Oct 30, 2013", "userURL": "http://www.goodreads.com/user/show/2935433-rebekah", "userReview": "I made several mistakes in choosing this book. The first was of course picking it up in the first place. The second was choosing to listen to the audio version (the voice actors grated at my nerves). The third was listening to the end."}, {"userName": "Stephanie", "userReviewDate": "Nov 29, 2016", "userURL": "http://www.goodreads.com/user/show/1830303-stephanie", "userReview": "This had humorous parts. Ok to listen to once, but not a keeper for me. Well performed. This is a dramatization (parody?) of Snow White."}, {"userName": "Elijah Lucian", "userReviewDate": "Nov 14, 2012", "userURL": "http://www.goodreads.com/user/show/5740529-elijah-lucian", "userReview": "very well cast audio drama!recommend to anybody.. except children of course hahaha"}, {"userName": "Kathy Broyles", "userReviewDate": "Jan 07, 2013", "userURL": "http://www.goodreads.com/user/show/1674781-kathy-broyles", "userReview": "I thought it was hilariously funny. Full cast, very well done."}], "description": "With the premiere of two new film versions of the Snow White tale, Blackstone enters the fray with its own adult, edgy, and not altogether serious full-cast exposé of fairy-taledom. At last it can be told! Was Snow White really as pure as the driven snow? Did her allegedly wicked stepmother get a bum rap from the Grimm brothers? What went on behind the closed Dutch doors of the dwarves' cottage? How many handsome princes does it take to screw in a light bulb? These and other burning questions may or may not be answered in this new pseudogothic audio play that Blackstone commissioned from award-winning author and audio dramatist Yuri Rasovsky.", "title": "Die, Snow White! Die, Damn You!", "url": "http://www.goodreads.com/book/show/17881088-die-snow-white-die-damn-you", "average": 2.95, "cover": "https://images.gr-assets.com/books/1367622529l/17881088.jpg", "reviews": 60, "authors": [{"url": "https://www.goodreads.com/author/show/87584.Yuri_Rasovsky", "name": "Yuri Rasovsky"}, {"url": "https://www.goodreads.com/author/show/2986653.Sandra_Oh", "name": "Sandra Oh"}, {"url": "https://www.goodreads.com/author/show/4800513.Simon_Helberg", "name": "Simon Helberg"}, {"url": "https://www.goodreads.com/author/show/266194.Kate_Burton", "name": "Kate Burton"}], "type": ["Fantasy", "Fiction", "Fantasy", "Humor", "Plays"], "outlinks": ["http://www.goodreads.com/book/show/17881088-die-snow-white-die-damn-you", "http://www.goodreads.com/book/show/13643200-die-snow-white-die-damn-you", "http://www.goodreads.com/book/show/14578173-die-snow-white-die-damn-you-a-very-grimm-tale", "http://www.goodreads.com/book/show/1485559.Sweeney_Todd_and_the_String_of_Pearls", "http://www.goodreads.com/book/show/6776561-black-mask-audio-magazine-volume-1-number-1", "http://www.goodreads.com/book/show/1019483.Tales_for_a_Stormy_Night", "http://www.goodreads.com/book/show/6396192-the-cabinet-of-dr-caligari", "http://www.goodreads.com/book/show/6996272-a-grown-up-s-halloween"]}